[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ij3kyz",
        "author": "gbnewsonline",
        "title": "Netflix price rise coming to UK",
        "content": "",
        "upvotes": 79,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1ij3kyz/netflix_price_rise_coming_to_uk/"
    },
    {
        "id": "1iiz9pz",
        "author": "StarKCaitlin",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller ‘Animals,’ Gillian Anderson Joins Cast",
        "content": "",
        "upvotes": 82,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iiz9pz/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1iiyhyr",
        "author": "theipaper",
        "title": "Apple Cider Vinegar isn't just cashing in on Belle Gibson's scam",
        "content": "",
        "upvotes": 74,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1iiyhyr/apple_cider_vinegar_isnt_just_cashing_in_on_belle/"
    },
    {
        "id": "1iirj71",
        "author": "Impossible-Will-8414",
        "title": "Kinda Pregnant -- Wow",
        "content": "OK, I know Amy Schumer can be a complicated figure, but she has done some decent work lately, including in the Hulu series Life and Beth -- not amazing or anything, but a mix of quiet humor and heartfelt plot lines. And movies like Trainwreck, while not great, still have had some merit. But my GOD -- Kinda Pregnant, which debuted today on Netflix, is fully unwatchable -- it's like a Z-grade Adam Sandler movie (and funnily enough, Adam Sandler's nephew, Tyler Spindel, directs this atrocity!), with a \"wild and wacky\" plot that is completely over the top and characters who are not in any way recognizably human. And Schumer actually co-wrote the script, so she can't blame this on bad writing. It is ATROCIOUS. Watched about 30 minutes and flipped it off, both literally and figuratively. Schumer really seems to be in a very bad place if this garbage is any indication.",
        "upvotes": 209,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1iirj71/kinda_pregnant_wow/"
    },
    {
        "id": "1ij16du",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has released the teaser for 'The Eternaut' live-action adaptation of the famous Argentinian sci-fi comic. Premieres globally on April 30",
        "content": "",
        "upvotes": 25,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij16du/netflix_has_released_the_teaser_for_the_eternaut/"
    },
    {
        "id": "1iiew2n",
        "author": "EthanWilliams_TG",
        "title": "Netflix Cancels Six Announced Games Before Release",
        "content": "",
        "upvotes": 401,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1iiew2n/netflix_cancels_six_announced_games_before_release/"
    },
    {
        "id": "1ij8qaz",
        "author": "brucie_me",
        "title": "Roku won't show Netflix on home page!",
        "content": "I have 3 Rokus and one of them (newest Roku Ultra 2024) doesn't show Netflix on my home page no matter how I try! I can only access it through the remote or \"channel lineup\" -- no problem with other apps. This is known issue from what I read online, is a fix or workaround available?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij8qaz/roku_wont_show_netflix_on_home_page/"
    },
    {
        "id": "1iji9mb",
        "author": "Affectionate_Ice7775",
        "title": "Thoughts on TNA season 2 wardrobe?",
        "content": "I finished watching Season 2 of The Night Agent, and while I actually enjoyed it, I do get why people weren't in love with it. The writing had its moments where it felt a little off, so l get the criticism. But what really threw me off this season was the wardrobe and styling.\nUsually, I don't even notice this kind of thing, but it was so bland that it actually stood out. The outfits gave stock photo and had zero personality. It's even more wild because the actor who plays Rose is so gorgeous outside of the show that I didn't recognize her in an interview she recently did. Don't get me wrong she's still pretty in the show, but why would the stylists make these choices? I saw some real-life photos of her, and she looks even better outside of the show, which just made me wonder why they went with such a dull look for her character.\nLast season, the styling felt a lot more natural, but this time around, it just felt like they were covering her up if that makes sense? It didn't feel purposeful. Did anyone else notice this, or am I overthinking it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iji9mb/thoughts_on_tna_season_2_wardrobe/"
    },
    {
        "id": "1ij44af",
        "author": "ideasnstuff",
        "title": "Action Scenes in The Night Agent",
        "content": "For all the serious action fans - do the fight and action scenes stand out in TNA? I find the production quality great overall but the action scenes are comparable to other similar shows. I don't see anything that sets it apart to justify all the attention it gets during promos.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ij44af/action_scenes_in_the_night_agent/"
    },
    {
        "id": "1ijg36i",
        "author": "ZenCat14",
        "title": "Whenever I watch anything, I get sent to the home screen after a short time",
        "content": "So, there are some shows that I've been meaning to watch, but whenever I start them, after a few seconds, I'm sent back to the Netflix home screen on mobile. This also happens with previews of shows. Any ideas for a fix? I tried uninstalling and reinstalling, but that didn't help.\n\nEdit: As it would turn out, it's not just shows that are doing this, but the entire app. After having it open for a little while, it automatically minimizes on my phone while still having the app open.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ijg36i/whenever_i_watch_anything_i_get_sent_to_the_home/"
    },
    {
        "id": "1iiymb5",
        "author": "FirTrader",
        "title": "Second time thru Black Mirror",
        "content": "I’ve only watched all of “Black Mirror” once, two years ago.  It’s one of my favorites.  Currently binge watching several episodes, each night, before falling asleep.  I just want everyone to know i’m ok (rocks back and forth with blank stare, fidgeting nervously with hands).  Everything’s going to be ok.",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iiymb5/second_time_thru_black_mirror/"
    },
    {
        "id": "1ij5i93",
        "author": "climbergirlwx",
        "title": "La Palma",
        "content": "A lot of copy paste from Dante’s Peak (1997)😂 even the characters are similar looking! Not complaining because I grew up loving Dante’s Peak, just thought it was interesting. \n\nDid anyone else think so as well? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij5i93/la_palma/"
    },
    {
        "id": "1ijdi8n",
        "author": "jackdempsy2345",
        "title": "The capture of ending",
        "content": "Has anyone watching the Netflix series “ the capture” and was really disappointed with the ending? I wanted Paul to become a free man. The ending just felt dissatisfied for me and I loved watching it apart from the ending.im quite cautious in watching season 2",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijdi8n/the_capture_of_ending/"
    },
    {
        "id": "1ii1bwp",
        "author": "AccurateInflation167",
        "title": "Netflix drops Emilia Pérez star from Oscars campaign over tweets",
        "content": "",
        "upvotes": 1255,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1bwp/netflix_drops_emilia_pérez_star_from_oscars/"
    },
    {
        "id": "1iirlph",
        "author": "SodaPopinski6",
        "title": "Home Improvement.",
        "content": "Feeling old. Been binging Home Improvement and haven’t laughed like this in a long time. Also brings back memories of the whole family sitting down to watch TGIF. ",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iirlph/home_improvement/"
    },
    {
        "id": "1ij4xn0",
        "author": "Pogrebnik",
        "title": "Robert De Niro to Star in Adaptation of Alex North's 'The Whisper Man' for Netflix, James Ashcroft to Direct",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ij4xn0/robert_de_niro_to_star_in_adaptation_of_alex/"
    },
    {
        "id": "1ij9bix",
        "author": "Saushi00",
        "title": "Why does Netflix video quality is poor on my laptop compare to tv and mobile",
        "content": "Netflix quality on my mobile great and on TV amazing but why does on laptop it sucks I have basic 720p plan I use Netflix app which runs on edge browser if any way it can be fixed please help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ij9bix/why_does_netflix_video_quality_is_poor_on_my/"
    },
    {
        "id": "1iizez6",
        "author": "forevony_0904",
        "title": "Recs",
        "content": "\n\nSo I decided I wanna watch mostly romance comedy drama typa series and comedies. \nI've watched Ginny and Georgia,2 broke girls, heartbreak high,never have I ever, atypical,everything sucks\n\nJust shows that are these vibes pleaseee\n\nAny shoes like these would be good. Some sad drama can be good like mental health rep too please ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iizez6/recs/"
    },
    {
        "id": "1ijeuai",
        "author": "Logical_Mushroom_689",
        "title": "No promo for Stranger Things 5?",
        "content": "Anyone knows why Netflix released everything they showed on the Next on Netflix event except that teaser they showed for Stranger Things? \n\nIt’s been oddly quiet for ST compared to their promotion for other seasons. Usually by now we’d have a few teasers and some quick looks, now we have absolutely nothing except some bts stuff. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ijeuai/no_promo_for_stranger_things_5/"
    },
    {
        "id": "1ijcn8u",
        "author": "Swimming_Umpire2597",
        "title": "Anyone want a anniversary special called once upon a Netflix",
        "content": "Where all of the characters from animated shows and movies for kids 9-12 take a anniversary picture with characters from: \n\nThe Cuphead show \n\nJurassic world camp cretaceous \n\nThe Sandy cheeks movie \n\nAnd Thomas and friends ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijcn8u/anyone_want_a_anniversary_special_called_once/"
    },
    {
        "id": "1iixcgp",
        "author": "creepywolf1090909",
        "title": "Question about Netflix",
        "content": "So, my Netflix Icon use to be Lucifer from Lucifer but all of a sudden it changes when I went on Netflix on my tv and so I went to change it back but couldn't find the Lucifer icons.\n\nWas the Lucifer icons removed or something???",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iixcgp/question_about_netflix/"
    },
    {
        "id": "1iiqt4a",
        "author": "Several-Archer4786",
        "title": "Rewatching \"The Wiz\"",
        "content": "I remember watching this several times on network television as a kid growing up. My wife has never seen it so we're watching it together for the first time. Just the era of the film brings back memories.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iiqt4a/rewatching_the_wiz/"
    },
    {
        "id": "1ii549c",
        "author": "gomi-panda",
        "title": "Anyone know what show this comedy came from? It looks hilarious",
        "content": "",
        "upvotes": 143,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o10p0nk31ahe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ii549c/anyone_know_what_show_this_comedy_came_from_it/"
    },
    {
        "id": "1ijf89y",
        "author": "Bremaster",
        "title": "What a joke 🤦‍♂️👎🗑️🚽🧻",
        "content": "What was the point of WWE Raw being on Netflix if most of the episodes &amp; years are missing?! They should’ve stayed on Peacock. At least Peacock has all the episodes for SmackDown. I hope this Netflix deal fails soon and WWE goes back to PEACOCK where they belong at and it where it was good.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ijf89y/what_a_joke/"
    },
    {
        "id": "1iitybo",
        "author": "Express-Temporary464",
        "title": "cant watch anything that isn’t a netflix original?",
        "content": "is netflix having issues? it started happening yesterday, first my “continue watching” category went back to a queue i was watching months ago, now everything that isnt a netflix original is giving me and “remind me button” instead of a play button. confused pls help.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iitybo/cant_watch_anything_that_isnt_a_netflix_original/"
    },
    {
        "id": "1iiqk0i",
        "author": "Fuzzy-Step-4064",
        "title": "AirPods Quiet But fine on everything else",
        "content": "I currently have the 1st gen airpods. The volume is perfect when I’m listening to music, however when watching Netflix on my iPhone on full volume, the airpods are substantially quieter. Is there a fix to this at all?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iiqk0i/airpods_quiet_but_fine_on_everything_else/"
    },
    {
        "id": "1ii0clu",
        "author": "Somethingman_121224",
        "title": "Insider Claims Netflix's 'Assassin's Creed' Series Is On Hold, But A New Live-Action Movie Is In The Works",
        "content": "",
        "upvotes": 57,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ii0clu/insider_claims_netflixs_assassins_creed_series_is/"
    },
    {
        "id": "1iivpyp",
        "author": "TreeThink5214",
        "title": "Netflix travel work around?",
        "content": "Does anyone know of a workaround for traveling with Netflix? I have used it while traveling for the past two months, but suddenly I received a message saying that I'm outside the main household and can no longer access it. Is there a solution for this, or does it randomly work and then not work?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iivpyp/netflix_travel_work_around/"
    },
    {
        "id": "1ii5y54",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reveals New Indonesian Originals: 'The Actor' and Zombie Thriller 'The Elixir'",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5y54/netflix_reveals_new_indonesian_originals_the/"
    },
    {
        "id": "1iimjbz",
        "author": "drdodo-88",
        "title": "Automatic sign out device",
        "content": "Hi! \nI hope this question belongs in this sub! \nIs it possible for my smart tv to automatically sign out after a certain period? This is for a rental property and I would like people staying to use their account and automatically sign out so others won’t use the account. \n\nThanks! \n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iimjbz/automatic_sign_out_device/"
    }
]