[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 154,
        "comments": 538,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n0czgr",
        "author": "SoftPois0n",
        "title": "‘The Waterfront’ Canceled By Netflix After 1 Season",
        "content": "",
        "upvotes": 145,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1n0czgr/the_waterfront_canceled_by_netflix_after_1_season/"
    },
    {
        "id": "1n0h6a6",
        "author": "Reico88",
        "title": "10 Favourite Animated Netflix Films",
        "content": "10. Entergalactic\n\n9. Vivo\n\n8. Chicken Run: Dawn of the Nugget\n\n7. Wendell &amp; Wild\n\n6. Nimona\n\n5. Orion and the Dark\n\n4. Pinocchio \n\n3. KPop Demon Hunter\n\n2. Klaus\n\n1. The Sea Beast ",
        "upvotes": 51,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n0h6a6/10_favourite_animated_netflix_films/"
    },
    {
        "id": "1n0ptz5",
        "author": "DotOne4395",
        "title": "10 Best Movies Coming to Netflix in September 2025 (With Above 90% Rotten Tomatoes Score)",
        "content": "* Boyz n the Hood **(September 1) RT Score: 96%**\n* Chicken Run **(September 1) RT Score: 97%**\n* E.T. the Extra-Terrestrial **(September 1) RT Score: 99%**\n* Edge of Tomorrow **(September 1) RT Score: 91%**\n* Knocked Up **(September 1) RT Score: 90%**\n* La La Land **(September 1) RT Score: 91%**\n* Paddington **(September 1) RT Score: 96%**\n* Phantom Threads **(September 1) RT Score: 91%**\n* Willy Wonka &amp; the Chocolate Factory **(September 1) RT Score: 90%**\n* Are You There God? It’s Me Margaret. **(September 11) RT Score: 99%**\n\n[**Visit Website** ](https://www.cinemablind.com/best-movies-coming-to-netflix-in-september-2025-with-above-90-rotten-tomatoes-score/) **|**[**15 New Movies &amp; TV Shows on Netflix in September 2025**](https://www.cinemablind.com/new-movies-and-tv-shows-on-netflix-september-2025/)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0ptz5/10_best_movies_coming_to_netflix_in_september/"
    },
    {
        "id": "1n0owgu",
        "author": "Timely-Hovercraft-76",
        "title": "Is the new show “untamed “ any good?",
        "content": "Has anyone watched The Untamed on Netflix? The Yosemite backdrop looks gorgeous, and Eric Bana being in it makes me curious. Is it actually worth a watch?",
        "upvotes": 3,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1n0owgu/is_the_new_show_untamed_any_good/"
    },
    {
        "id": "1n011sr",
        "author": "shedevil_99",
        "title": "Any of you guys watched Mr. Robot?",
        "content": "Im debating whether to finish this series or not. I like the original concept of it, but find the schizo random episodes off putting. To me, they are very unnecessary and very confusing. It ruins the show. One minute he’s paranoid about getting caught hacking and the next he’s hearing voices that aren’t there? Like why? The last straw was the opening of Episode 6. He (i guess) imagined being in a sitcom. Why couldn’t they continue with the hacking greedy corporations storyline without the dad being an imaginative character in Elliot’s head? Like i said, i enjoyed the original concept and am thinking about finishing it but idk? Have any of you finished it? Is it worth it? It just annoys me when writers try so hard to be clever and eccentric with these shows ultimately losing the plot &amp; ruining a good show. ",
        "upvotes": 58,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1n011sr/any_of_you_guys_watched_mr_robot/"
    },
    {
        "id": "1n0m4u1",
        "author": "Fun_Molasses5215",
        "title": "‘A self-indulgent, vanity project’: The scathing reviews for season two of With Love, Meghan are in",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n0m4u1/a_selfindulgent_vanity_project_the_scathing/"
    },
    {
        "id": "1n0qoei",
        "author": "One-Organization-758",
        "title": "What is the meanest competitive show on Netflix?",
        "content": "A while ago I watched Tattoo Masters (which isn’t on Netflix anymore) and I realize now that I really like completive shows where steaks are high and people are mean to one another. \n\nAny show will do! Just not things like Love Island- I don’t like shows that focus on relationships too much.  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0qoei/what_is_the_meanest_competitive_show_on_netflix/"
    },
    {
        "id": "1n0q4t1",
        "author": "AttemptSilent2070",
        "title": "In a big slump rn - good revenge show",
        "content": "I need a good vigilante or revenge type of show. My favourite is Dexter. I also like You, vigilante (kdrama), taxi driver etc.\n\nI keep trying things and getting bored and turning it off😭",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0q4t1/in_a_big_slump_rn_good_revenge_show/"
    },
    {
        "id": "1n0pkna",
        "author": "Feeling-Conclusion90",
        "title": "Netflix Household help",
        "content": "I don't understand, my family has the family plan for Netflix. We're a family of 6, and all of us 4 siblings are away at colleges in different states. Considering that we're subscribed to the family, to allow multiple users, how come we still can't use our netflix? Wouldn't this more \"extensive\" plan offer the option of limited devices on a different network? How is the netflix household suppose to work for families exactly? Or is there a way to set that up?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n0pkna/netflix_household_help/"
    },
    {
        "id": "1n0pkbt",
        "author": "DotOne4395",
        "title": "15 New Movies &amp; TV Shows on Netflix in September 2025",
        "content": "* Franklin &amp; Bash Seasons 1-4 **(September 1)**\n* Orphan Black Seasons 1-5 **(September 1)**\n* Wednesday Season 2 Part 2 **(September 3)**\n* Beauty in Black Season 2 **(September 11)**\n* The Wrong Paris (**September 12)**\n* Call the Midwife Season 14 **(September 15)**\n* Ice Road: Vengeance **(September 15)**\n* Nashville Seasons 1-6 **(September 15)**\n* Black Rabbit Season 1 **(September 18)**\n* Billionaires’ Bunker Season 1 **(September 19)**\n* Haunted Hotel Season 1 **(September 19)**\n* Alice in Borderland Season 3 **(September 25)**\n* House of Guinness Season 1 **(September 25)**\n* Wayward Season 1 **(September 25)**\n* Interview with the Vampire Season 2 **(September 30)**\n\n[**Visit Website**](https://www.cinemablind.com/new-movies-and-tv-shows-on-netflix-september-2025/) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0pkbt/15_new_movies_tv_shows_on_netflix_in_september/"
    },
    {
        "id": "1n0nq2s",
        "author": "Happy_Tx24b",
        "title": "New suggestions based on astrology, genius or gadget feature ?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0nq2s/new_suggestions_based_on_astrology_genius_or/"
    },
    {
        "id": "1n0gbfq",
        "author": "Hero-Firefighter-24",
        "title": "What future Monster series should be about?",
        "content": "I’ve been following the Monster franchise since Jeffrey Dahmer, watched both Dahmer and the Menendez Brothers, and I’m looking foward to the Season 3 about Ed Gein and Season 4 on Lizzie Borden.\n\nBut what should Season 5 be about? Personally, I’m hesitating between Gerard Schaefer and George Tiaffay.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n0gbfq/what_future_monster_series_should_be_about/"
    },
    {
        "id": "1n0cqp8",
        "author": "Celestialey",
        "title": "The gang members in 'Money Heist' seem like they all came from a mental asylum",
        "content": "I want to say, who needs a villain or an enemy if you have such members in your gang. Professor himself was a dumb person for recruiting this exact set of dumb pieces. \n\n1. Proudly broke the first rule of 'Having no relationship'. \n\n2. Rio and Denver both talked to female hostages like taking a walk in the park and trusting them like highschool mates. \n\n3. These guys kept talking and discussing about personal matters at the most critical moments when they were required to focus on enemy and making sure they got out. \n\n4. All the gang members casually sitting in different places in the building and carelessly having the chit chat of their life without anyone really looking after the hostages. \n\n5. The entire gang was on hostages' mercy that they didn't try to run away. \n\n6. Shouting, abusing and pointing gun towards own gang member and the incharge, and trying to kill them too. \n\n7. Professor getting beaten and tied by a pregnant lady risking the entire heist. \n\n8. No plan on how to get the gang out of the bank. And neither anyone caring about it. ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n0cqp8/the_gang_members_in_money_heist_seem_like_they/"
    },
    {
        "id": "1n00nno",
        "author": "L0v3_1s_War",
        "title": "First Netflix House opens its doors on November 12th. The Philly house will be followed by Netflix House Dallas on December 11th.",
        "content": "",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n00nno/first_netflix_house_opens_its_doors_on_november/"
    },
    {
        "id": "1n0k0wb",
        "author": "spikeszy",
        "title": "Netflix Not Working On All Devices At Home.",
        "content": "Hi guys, I really need help.\n\nNot sure what happened, but came home to Netflix not working on all devices, my LG TV, iPhone, Macbook and all.\n\nI got the error code NW-2-5 and UI 8003, and after trying the multiple things suggested such as\n\n1. Resetting router\n2. Resetting the device\n3. Signing in and out and all other stuff as per Netflix website\n\nIt doesn’t seem to work.\n\nI could really use some help, and if there are other things I could do which I haven’t.\n\nThank you.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n0k0wb/netflix_not_working_on_all_devices_at_home/"
    },
    {
        "id": "1n075x3",
        "author": "The_LawBorn",
        "title": "Looking for something to watch.",
        "content": "I’ve been looking for something new to watch for awhile, particularly where the main character is the strongest in the show. They don’t have to be overpowered, do everything without a struggle, or be a Mary sue or Gary Stu. I’m just looking for a show where they’re already the strongest or become the strongest. Please let me know if any of you have a good recommendation, anything is greatly appreciated. ",
        "upvotes": 8,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1n075x3/looking_for_something_to_watch/"
    },
    {
        "id": "1n0iyn4",
        "author": "TimesandSundayTimes",
        "title": "How we made Wednesday — by the creators of the hit Netflix show",
        "content": "[https://www.thetimes.com/magazines/culture-magazine/article/how-we-made-wednesday-by-the-creators-of-the-hit-netflix-show-qq32lvgtn](https://www.thetimes.com/magazines/culture-magazine/article/how-we-made-wednesday-by-the-creators-of-the-hit-netflix-show-qq32lvgtn)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0iyn4/how_we_made_wednesday_by_the_creators_of_the_hit/"
    },
    {
        "id": "1n0hr9e",
        "author": "Then-Scholar1748",
        "title": "Too Hot To Handle is being axed!",
        "content": "This is what was said: \"And a lot of entertainment shows on Netflix have bitten the dust already this year, ranging from Celebrity Bear Hunt to Cheat: Unfinished Business.\n\n\"So, although Too Hot To Handle may return, the signs are not good in the current environment, where competition for viewers is fierce and other dating shows like Netflix’s Love Is Blind are doing very well.\"",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0hr9e/too_hot_to_handle_is_being_axed/"
    },
    {
        "id": "1n0ea5o",
        "author": "FireReaper52",
        "title": "Does anyone know what’s happening with Neal Shusterman’s game changer?",
        "content": "It feels like a while ago that they teased the production of a series for it but I haven’t seen any updates on it. Has it been cancelled or is it still in production? If so is there an eta on when it will release?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0ea5o/does_anyone_know_whats_happening_with_neal/"
    },
    {
        "id": "1n0bohx",
        "author": "Terzinho",
        "title": "Warrior 2019-2013",
        "content": "I just finished watching 3 seasons of warrior tv show. It's one of the best shows I've watched ever and I hope Netflix continues to run it one day. It would be a shame if it ended unfinished. Rarely today I find great shows like this hidden gem. It was originally Bruce Lee's idea to make it but he passed away, so they used his writings to create the plot. It would be nice in his memory to finish Warrior one day... Hopefully.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n0bohx/warrior_20192013/"
    },
    {
        "id": "1n0lrsd",
        "author": "Diesel_AFL",
        "title": "Is there really no way to delete the \"trailers you've watched\" section?",
        "content": "Even whenever I hover over a title for a few seconds it turns out it's been appearing in the trailers you've watched section. I looked all over the app, from different different platforms, even spoke to netflix support but there doesn't seem to be a way clear the trailer watch history.\n\nHow is it that we can we remove shows from our viewing history and continue watching, but not remove the hovering over titles that we had no idea we were being tracked all this time!\n\nHas anyone been able to find a workaround at all? Sorry if this sounds worked up just it's a pretty big deal if my family figure me out. I'm really not ready for that conversation yet.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0lrsd/is_there_really_no_way_to_delete_the_trailers/"
    },
    {
        "id": "1n0bgf0",
        "author": "evecatherine",
        "title": "Thoughts on Sirens",
        "content": "This might be a controversial take: I don't blame Simone for doing whatever it takes to avoid revisting her trauma, especially when her dad said \"It's gonna be you and me again.\" Like Jesus Christ. First, her mother nearly kills her. Then her dad neglects her to the point where she's starving. THEN she gets taken into foster care and is sexually abused there. \"Stealing\" someone's husband is one of the lesser evils she could have committed given her awful circumstances. It's immoral, of course, but desperation will lead to desperate measures.\n\nDevin is alright. She's had it pretty tough, but Simone arguably had it even worse. Given what we know now, I'm surprised she wasn't a bit more sympathetic towards Simone for not wanting to come home. I don't have too many thoughts on her. \n\nMichaela is fabulous! No notes. Prime example of how \"powerful\" women, or women with a strong presence, are villainized or even suspected to be \"witches\" (the series tricked us into going along with that narrative, when it was Peter pulling the strings all along). \n\nIMO, the main villains are Peter and Bruce (the dad). One intentionally manipulates and tricks people (Peter), and the other was just a neglectful parent who caused irreparable trauma to both his daughters. The main characters are just products of their circumstances. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n0bgf0/thoughts_on_sirens/"
    },
    {
        "id": "1n0dm6o",
        "author": "armie",
        "title": "Received an email saying that I subscribed but I haven't",
        "content": "Title really; I've received an email saying I subscribed to Netflix but I haven't.  Trying to change Netflix password gives me an error: Sorry, something went wrong. Please try again later.\n\nMy email account doesn't have any unrecognized sessions and 2FA is on.\n\nWhat might this be? I can't seem to find a way to contact Netflix about it.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0dm6o/received_an_email_saying_that_i_subscribed_but_i/"
    },
    {
        "id": "1n0gtd0",
        "author": "aaryan_pathak",
        "title": "Netflix glitching?",
        "content": "2 shows on my watchlist, one a TV series and the other an anime. Both of them are available on my iPhone app, but when I open Netflix on the browser, neither is available. Even when I try to check from my viewing history, it only shows that they have 'trailers' available. What's going on? It's not region locked because Im watching it on my phone and TV",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0gtd0/netflix_glitching/"
    },
    {
        "id": "1n0grfz",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix Lands Matthew McConaughey, Cole Hauser, Nic Pizzolatto Show in Bidding War",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0grfz/netflix_lands_matthew_mcconaughey_cole_hauser_nic/"
    },
    {
        "id": "1n0g1nc",
        "author": "therealgale65",
        "title": "When a download is expiring on a certain date, what time does it expire?",
        "content": "I downloaded some shows to watch on a flight but my earphones didn't work so I wasn't able to watch. So now they expire on the exact day I'm flying back home. Do they expire at the end of the day? Thank you ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0g1nc/when_a_download_is_expiring_on_a_certain_date/"
    },
    {
        "id": "1n0flwk",
        "author": "Happy_Tx24b",
        "title": "Usefull feature or random add ?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n0flwk/usefull_feature_or_random_add/"
    },
    {
        "id": "1n0obke",
        "author": "Plus-Breakfast-6125",
        "title": "Meghan Markle sends secret 'intentional message' to Royal family during Netflix series",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n0obke/meghan_markle_sends_secret_intentional_message_to/"
    }
]