[
    {
        "id": "1mbc4du",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 474,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbc4du/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mcxvoy",
        "author": "menu07",
        "title": "Of that group only Dani remains",
        "content": "",
        "upvotes": 358,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rvelzgiz1yff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mcxvoy/of_that_group_only_dani_remains/"
    },
    {
        "id": "1mcno97",
        "author": "AestheticEvan23",
        "title": "Luka Modrić comment under Mbappé ig post",
        "content": "",
        "upvotes": 1478,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q07v24uipvff1.jpeg?auto=webp&amp;s=5ebc137b352597a5a8ae9c127236263e21a97773"
        },
        "permalink": "/r/realmadrid/comments/1mcno97/luka_modrić_comment_under_mbappé_ig_post/"
    },
    {
        "id": "1mcqoq9",
        "author": "Right_Author8684",
        "title": "Jose Mourinho’s Real Madrid, the best team to never win the UCL",
        "content": "",
        "upvotes": 671,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2krt81vnbwff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mcqoq9/jose_mourinhos_real_madrid_the_best_team_to_never/"
    },
    {
        "id": "1md9tst",
        "author": "rgr_o7",
        "title": "Going to a game at Bernabeu",
        "content": "Hi guys, I will be visiting Madrid in September around the time Real will be playing Espanyol at home.\n\nI wanted to ask what is the best way to get tickets as a person from US. I have read that tickets for games that are not el clasico, Madrid derby etc you can usually get at the stadium the day of. Is that a true statement still? I have seen tickets for sale on sites like StubHub or viagogo, are those sold by season ticket holders? Because I know the tickets don’t usually go on sale until the week of, unless you get the hospitality tickets. I see tickets for around $300 to sit in the middle of the stadium which is what I would be interested in, but is that a fair price to pay? Or should I rather wait until I’m there?\n\nIf anyone has went to a game last season, any input would be appreciated. ",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1md9tst/going_to_a_game_at_bernabeu/"
    },
    {
        "id": "1mckuiw",
        "author": "DonuandDeca",
        "title": "\"The last survivor 💔\" by hamid sahari",
        "content": "Carvajal ❤️ El Capitán",
        "upvotes": 593,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lfxxb6c26vff1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mckuiw/the_last_survivor_by_hamid_sahari/"
    },
    {
        "id": "1mcljla",
        "author": "EndouShuuya",
        "title": "Cristiano Ronaldo, Roberto Carlos e Zidane 🤩 (Honorable mention to Gareth Bale)",
        "content": "",
        "upvotes": 361,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ob8660w2bvff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mcljla/cristiano_ronaldo_roberto_carlos_e_zidane/"
    },
    {
        "id": "1md1lcp",
        "author": "ManuMora98",
        "title": "[Basket - Official] Chuma Okeke signed on a 2 years deal",
        "content": "Real Madrid CF has reached an agreement with Chuma Okeke, power forward from the Cleveland Cavaliers, by which the player remains linked to the club for the next two seasons, until June 30, 2027.\n\nOkeke arrives at Real Madrid to face his first experience in European basketball, after playing a total of 203 games in the NBA with the Orlando Magic, Philadelphia 76ers and Cleveland Cavaliers.",
        "upvotes": 22,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1md1lcp/basket_official_chuma_okeke_signed_on_a_2_years/"
    },
    {
        "id": "1mch518",
        "author": "Tsumaranai_Jinsei",
        "title": "KM10 is confirmed!!!",
        "content": "",
        "upvotes": 341,
        "comments": 126,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mch518/km10_is_confirmed/"
    },
    {
        "id": "1mcjzbv",
        "author": "ace-s",
        "title": "Seems like the biggest difficulty is that we cannot get rid of players like Alaba, Mendy...etc. so it is not possible to sign the players that Xabi Alonso wants",
        "content": "Even Cortegana reported it today that Xabi is not satisfied with the window and he wants more signings but player departures are blocking new signings.\n\nI really wish the club accepts the loss and buys our their contract. I don't think another season of mediocre results due to not having the players the manager wants is acceptable for a team like ours. \n\nLook at Liverpool, despite winning the league. They reinforced their squad and it seems they are gonna sign Isak aswell, a player that would be perfect for our club. \n\nimo, it would be a crazy achievement from Xabi if we manage to have an amazing season and I hope that the fans and the board don't blame Xabi cuz he doesnt have the players he wants for the footbal he wants to play.",
        "upvotes": 132,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mcjzbv/seems_like_the_biggest_difficulty_is_that_we/"
    },
    {
        "id": "1mc3cnm",
        "author": "menu07",
        "title": "What a good side Marcelo was",
        "content": "",
        "upvotes": 1434,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x28xj5943rff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mc3cnm/what_a_good_side_marcelo_was/"
    },
    {
        "id": "1mcjaxh",
        "author": "chunchunmaru1129",
        "title": "This might be a hot take but I have never seen a real Madrid or any player with a better final pass in the final third then özil",
        "content": "It felt like the guy could see space anywhere and just pass it eaisly and his vision was amazing but boy was the dude lazy he barely ever ran and mostly walked and it seemed he lacked physicality.\n\nThe dude at one point was getting assists at a ridiculous number I would go as far as to say this guy never actually reached his full potential and if he played in a different decade lets say 1990-2010 he would be considered in the top 10 best midfielder of all-time argument as Cams basically died during his time",
        "upvotes": 127,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mcjaxh/this_might_be_a_hot_take_but_i_have_never_seen_a/"
    },
    {
        "id": "1mc4d3j",
        "author": "Onegoofylad",
        "title": "Chema at Stuttgart training",
        "content": "Would be nice to have an “inside agent” to make an attempt to sign Stuttgart’s midfielder Angelo Stiller (person on the right). \n\nI believe he’d make an excellent addition to the midfield and given that anyone could be sold this summer, it’s not that far of a stretch to think and wish about. \n\nOnly hope the board would be on the same page. ",
        "upvotes": 272,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wpr0m8fverff1.jpeg?auto=webp&amp;s=a091eaa4c910b2447b9ea652d0d5cc810276fc36"
        },
        "permalink": "/r/realmadrid/comments/1mc4d3j/chema_at_stuttgart_training/"
    },
    {
        "id": "1mc9rho",
        "author": "auctus10",
        "title": "Comunicado Oficial: Mario Martín.",
        "content": "",
        "upvotes": 73,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mc9rho/comunicado_oficial_mario_martín/"
    },
    {
        "id": "1mc6fr1",
        "author": "Emmanuel_I",
        "title": "El primer entrenador profesional del Real Madrid recibe la modesta limpieza de su tumba por parte de un aficionado del Liverpool",
        "content": "",
        "upvotes": 32,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_x9hds-svq_UgKFyoz2u87EKKWGKTACOtGjV-fTxPsQ.jpeg?auto=webp&amp;s=554916d24bb56826b88fc52b2e8e24e91b9e8068"
        },
        "permalink": "/r/realmadrid/comments/1mc6fr1/el_primer_entrenador_profesional_del_real_madrid/"
    },
    {
        "id": "1mbefmr",
        "author": "Any_Paint_5822",
        "title": "Thibaut Courtois hanging out in Tomorrowland",
        "content": "As almost every year, Courtois was spotted at Tomorrowland in Belgium, enjoying the festival with his wife. I also saw him in the 2022 edition, he is clearly a big fan.\nTried to get a picture but he had a bodyguard not allowing any contact from the crowd.\nPS: If I remember correctly, he even had Martin Garrix perform at his wedding. \n",
        "upvotes": 611,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/je046jkzvlff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mbefmr/thibaut_courtois_hanging_out_in_tomorrowland/"
    },
    {
        "id": "1mbn4cr",
        "author": "Individual-Insect927",
        "title": "Mom bought me a Chelsea sportswear",
        "content": "I really dont know what to do.  So i wanted to buy a new sportswear for the gym . And my mom decided to buy one for me to make me happy. It looks good ngl . But There is a problem here . It has Chelsea logo on it.  And now idk what to do cuz i doubt the store will take it back . I hate myself rn cuz if i tell her the truth she will be sad and also i hate to wear another team .i was a madridista since childhood but my mom was never into sports so she doesnt know what even club logo means.\nWhat would you do if you were in my shoes?\n\n\n\nEdit: thank you all for the replies.  I will use it then , hopefully my Barca friends will never see me with these xD",
        "upvotes": 132,
        "comments": 126,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbn4cr/mom_bought_me_a_chelsea_sportswear/"
    },
    {
        "id": "1mbahjz",
        "author": "EffectiveTie3144",
        "title": "OTD july 28 2006 Van Nistelrooy was presented on the Bernabeu stadium, as a Real Madrid's player. He won the Pichichi Trophy in his first season.",
        "content": "",
        "upvotes": 694,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbahjz/otd_july_28_2006_van_nistelrooy_was_presented_on/"
    },
    {
        "id": "1mbfplz",
        "author": "EdwinTorres09",
        "title": "La vida me sigue dando señales 😫🤧😍",
        "content": "",
        "upvotes": 152,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hm0oighl6mff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mbfplz/la_vida_me_sigue_dando_señales/"
    },
    {
        "id": "1mbe2cb",
        "author": "Ghost-Ripper",
        "title": "WHO are the missing players?👀",
        "content": "",
        "upvotes": 170,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbe2cb/who_are_the_missing_players/"
    },
    {
        "id": "1mctl30",
        "author": "iamdwon786",
        "title": "Hypothetical Q: If Vini ends up leaving this summer, will you consider him a bigger RM legend than Bale?",
        "content": "Both of them have scored in 2 winning CL finals. Vini has had more years in the club but I guess for the first 3 years he wasn’t at his current level, whereas Bale was already world class when he came. Both of them have had their detractors as well from our fans.\n\nVini would be my choice, he’s had more impact in the team ever since he broke out. \n",
        "upvotes": 0,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mctl30/hypothetical_q_if_vini_ends_up_leaving_this/"
    },
    {
        "id": "1mbba4u",
        "author": "Galactic_Ryder",
        "title": "Throwback to pre-season 94/95: new signings unveiled at the Santiago Bernabéu",
        "content": "From left to right, we see the Real Madrid squad. Standing in the back are Fernando Redondo, Santiago Cañizares, Michael Laudrup, and Pedro \"Koke\" Contreras. Crouching in the front are Quique Sánchez Flores, José Amavisca, and Ismael Urzaiz.\n\nPedro \"Koke\" Contreras and Ismael Urzaiz were academy players who were promoted to the first team that season. Santiago Cañizares also came through Real Madrid's academy but had been loaned out to Elche and Mérida, then sold to Celta, before making his return to the club that year.\n\nRegarding the other players shown: Fernando Redondo was purchased from CD Tenerife, Michael Laudrup joined as a free agent from FC Barcelona, Quique Sánchez Flores was bought from Valencia CF, and José Amavisca was acquired from Real Valladolid.\n\nNot visible in this picture is Raúl González, who began the season with the C team. He would be promoted later in the 1994-95 season, making his highly anticipated first-team debut on Matchday 9 against Real Zaragoza.",
        "upvotes": 167,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cvzbamaqzkff1.jpeg?auto=webp&amp;s=1264da45bdeca156a9adcfbe0906006e26b2805a"
        },
        "permalink": "/r/realmadrid/comments/1mbba4u/throwback_to_preseason_9495_new_signings_unveiled/"
    },
    {
        "id": "1mbb171",
        "author": "Zeepat963",
        "title": "The last match played los blancos played without a balon d’or winner in the squad was 19th of May 2000",
        "content": "As said in the title, I begin to understand more why Perez is gunning for Rodri. It so much. He is also the only active balon d’or player within Europe that isn’t Lukita. \n\nThe match was against Real Valladolid and we lost 0-1. \n\nLine-up:\nGK: Casillas\nLB: Roberto Carlos\nLCB: Helguera\nRCB: Karanka\nRB: Salgado\nLDM: Campo\nRDM: Redondo (Captain)\nCAM: Raúl\nLM: Sávio\nRM: McManaman\nST: Anelka\n\nSubs:\nBodo Illgner\nFernando Hierro\nManolo Sanchís\nChristian Karembeu\nNjitap Geremi\nElvir Baljic \nFernando Morientes \n\nManager:\nVicente del Bosque\t \n\nWhat are your thought about this? Worth it to pay the extra for Rodri?\n\nEdit: remove the first ”played” in the title. My bad:/\n\nEdit: never mind as someone commented, the months between CR7s departure and Modric winning it, we played without a balon d’or winner",
        "upvotes": 150,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbb171/the_last_match_played_los_blancos_played_without/"
    },
    {
        "id": "1mcfwkz",
        "author": "Embarrassed_Sport266",
        "title": "At This Rate Rodrygo Is Going to Leave on Deadline Day",
        "content": "At This Rate Rodrygo Is Going to Leave on Deadline Day. The way this transfer saga has unfolded it has indicated a few things. For one that Rodrygo is going to leave the club the signs were there as early \"Don't Forget the R\" propaganda last summer/early fall. As soon as I saw Rodrygo getting benched in the CWC I knew it was over. Xabi was sending a message and it breaks my heart. \n\nThe other fact is that Rodrygo is nowhere near a move right now depsite rumors being hot all summer. Imo the best fit for him was Bayern and they overpaid for Diaz instead. Liverpool has already spent a lot and currently going for Isak. Then you got Arsenal who seems to have opted for a RW backup and other bench pieces instead of a bona fide starter at LW instead. \n\nHonestly idk how Al Hilal hasn't swooped in and even offered half or 75% of what they were offering to Real Madrid and Vini. I think the club would accept that in a heartbeat and it might turn Rodrygo's head. I mean its turning Vini's. ",
        "upvotes": 0,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mcfwkz/at_this_rate_rodrygo_is_going_to_leave_on/"
    },
    {
        "id": "1mbaa3l",
        "author": "RamsesII89",
        "title": "How Real Madrid’s Stadium Became a Cash-Printing Machine - The Joe Pomp Show (podcast)",
        "content": "Interesting episode from The Joe Pomp Show going over the transformation of the Santiago Bernabéu’s recent project.\n\nThe new Bernabéu is not just a football ground — it’s a hybrid commercial hub engineered for sustainable, diversified revenue. It’s one of Perez’s first major steps to effectively future-proofed the club’s financial engine, ensuring its place at the pinnacle of global sport and entertainment.\n\n",
        "upvotes": 22,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lztu0Uq2SFloEV33Cy5JR-Gm6FxiuE0CyO1tdfu7LqQ.jpeg?auto=webp&amp;s=a6141761e0c9a4f0a782cf092ad0b829240a24a6"
        },
        "permalink": "/r/realmadrid/comments/1mbaa3l/how_real_madrids_stadium_became_a_cashprinting/"
    },
    {
        "id": "1mbaffh",
        "author": "choker_18",
        "title": "what do you guys think ?",
        "content": "after this season we all are worried about our defense and somehow disappointed as madrid managment is not working (buying defenders).\n\n  \ni dont know if i make sense but we are not as bad as many are assuming,for example we have joan martinez (la fabrica product).he is just phenomenal.\n\n  \nAlvaro-joan-dean-militao or rudi..... i know 3 of them are very young and dont have \"experience\" but they will improve themselves.\n\n  \nwe all know how much xabi trusts academy players and the way gonzalo garcia proved him right and somehow boosted his confidence in academy players.... i am  personally sure that xabi will keep bringing academy players.",
        "upvotes": 16,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mbaffh/what_do_you_guys_think/"
    },
    {
        "id": "1madx8c",
        "author": "menu07",
        "title": "How many of us remember this day",
        "content": "",
        "upvotes": 1570,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hjpksfbymcff1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1madx8c/how_many_of_us_remember_this_day/"
    },
    {
        "id": "1mai2dr",
        "author": "ersansefa",
        "title": "Rodrygo Has Run Out of Options",
        "content": "Rodrygo Goes, the Brazilian winger at Real Madrid, finds himself in a complex situation regarding his professional future. Despite being highly regarded in Europe, his role at the club has been drastically reduced, with very limited participation in key matches like the Copa del Rey final and the Club World Cup final. Real Madrid is considering selling him to complete two crucial transactions in the transfer window, though no formal offers have yet been received.\n\nClubs such as Bayern Munich and Liverpool have opted for other targets, while Arsenal has not advanced beyond preliminary interest. Only Tottenham remains as a potential suitor, albeit a less prominent one. This leaves Rodrygo with few alternatives amid declining physical and emotional condition, having lost weight and confidence. The club would only entertain offers of around €100 million, which presents a significant hurdle in today’s competitive market.\n\nA Market in Flux\n\nAs the global market heads toward a high-stakes finish in spending, there are still players looking for a new space to shine. Rodrygo, born in 2001 in Osasco, São Paulo, Brazil, is among them  ￼.\n\nWhile he’s on many clubs’ radar, and Real Madrid hasn’t yet received an official offer, the club’s planning includes his departure to fund the final moves needed to complete their dream squad  ￼. Rodrygo played only 45 minutes in the Copa del Rey final against Barcelona in April and 92 minutes in the Club World Cup—indicating how limited his game time has become  ￼.\n\nAlthough Rodrygo and his representatives have publicly expressed his desire to remain at Madrid, reports suggest the club views him as a transfer candidate following his substitution in the Copa del Rey final  ￼.\n\nPhysical and Mental Decline\n\nSince then, Rodrygo has struggled with a physical imbalance that caused him to lose nearly five kilos, as well as an emotional downturn due to his lack of effectiveness in front of goal. Even a stay in Brazil with his two children did not fully help him clear his mind  ￼.\n\nInterest Fading from Big Clubs\n\nDespite maintaining a strong reputation across Europe, major clubs are looking elsewhere. Bayern has decided to sign Luis Díaz (for around €80 million) and Liverpool has not progressed its interest in Rodrygo. Real Madrid insists on offers close to €100 million if a sale is to happen  ￼.\n\nLiverpool’s considerable winter spending—such as Wirtz (€125M) and Ekitike (€95M)—may also explain the lack of movement regarding Rodrygo  ￼. Meanwhile, Arsenal has already invested roughly €200 million in Zubimendi (€70M), Madueke (€56M), and Gyökeres (€75M), reducing appetite for another major forward signing  ￼.\n\nOnly Tottenham remains an option—but it’s seen as a step down compared to the other clubs. Gradually, Rodrygo is running out of viable alternatives to leave Real Madrid this summer  ",
        "upvotes": 376,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vmXjv9K9qea4EAoJ6vI0ZLTVVAxpcn32v7FoLnBRoY8.jpeg?auto=webp&amp;s=a6b6c77a9cf064df6ee50fb33a1e0b04d308c831"
        },
        "permalink": "/r/realmadrid/comments/1mai2dr/rodrygo_has_run_out_of_options/"
    },
    {
        "id": "1ma4d2b",
        "author": "Opening_Landscape951",
        "title": "They had no idea that together they'd rule over Europe a few years later",
        "content": "",
        "upvotes": 1765,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jqr4txv8aaff1.jpeg?auto=webp&amp;s=bbdfb5b33467912d82222cd92d04aa5cdd473c7d"
        },
        "permalink": "/r/realmadrid/comments/1ma4d2b/they_had_no_idea_that_together_theyd_rule_over/"
    },
    {
        "id": "1mak0dw",
        "author": "auctus10",
        "title": "Comunicado Oficial: Chema Andrés.",
        "content": "",
        "upvotes": 98,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mak0dw/comunicado_oficial_chema_andrés/"
    },
    {
        "id": "1m9y80p",
        "author": "brainybrit",
        "title": "Is Keylor Navas the most underrated GK in recent decades?",
        "content": "",
        "upvotes": 2710,
        "comments": 156,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nsojl9jm09ff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m9y80p/is_keylor_navas_the_most_underrated_gk_in_recent/"
    }
]