[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 502,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jsxsf7",
        "author": "Wild_Shallot_3618",
        "title": "Con Mum Arrested!",
        "content": "Courtesy of @mothershipsg IG",
        "upvotes": 26,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jsxsf7/con_mum_arrested/"
    },
    {
        "id": "1jschg8",
        "author": "TimesandSundayTimes",
        "title": "Charlie Brooker: I’ve only let my kids watch one episode of Black Mirror",
        "content": "",
        "upvotes": 53,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jschg8/charlie_brooker_ive_only_let_my_kids_watch_one/"
    },
    {
        "id": "1jrz4ph",
        "author": "skummies",
        "title": "Con Mum arrested in Singapore",
        "content": "I’m from Singapore and it’s so surreal to see this in the news this morning. Just like in the documentary, Dionne attempted similar scams here. Victims only realised they were being cheated after they watched the documentary. ",
        "upvotes": 317,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1jrz4ph/con_mum_arrested_in_singapore/"
    },
    {
        "id": "1jsnsjf",
        "author": "Calebp24",
        "title": "Show recommendation",
        "content": "I need a new show to watch. The last show I watched was The Recruit and I loved it. I need something with action and excitment. Anyone know any shows maybe like the recruit or at least something exciting with a lot of action?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jsnsjf/show_recommendation/"
    },
    {
        "id": "1jslz3o",
        "author": "deonisgreatness_",
        "title": "In need of a show name",
        "content": "It was probably on netflix during the 2014-2015 range. I remember watching it as a kid but nothing more. It was sort of like horrid henry, there was a boy he had a younger sibling, 2 main friends, 2 parents and there was a school bully. Had relationships with his teacher. There was a episode where he and his classmates had like this race around the block with their gym coach. Please help me",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jslz3o/in_need_of_a_show_name/"
    },
    {
        "id": "1jrzfv4",
        "author": "Key-Highway9659",
        "title": "Did anybody really bored by Ozarks stick it out and it was good? Having trouble with it",
        "content": "Hello.\n\nI am not trying to insult The Ozarks. This is the fifth time I have tried to watch it as I've heard so much good stuff about it.\n\nBut every time I watch, I am bored to tears. The way the actors all act doesn't feel real and I care about the characters most of all in a show. \n\nI thought this is about a family thrown into extreme danger unexpectedly? \n\nIt's weird. I feel like I didn't get enough time with Marty or any of these people before they were genius hardened criminals and almost...bored/underwhelmed by all of it and any vulgarity.\n\nSo far, it feels like if Breaking Bad knew it was a TV show mixed with Mad Men or American Psycho but without the... I don't know!! Justification? Style?\n\nIts frustrating. I want to shake them and wake the whole show up. \n\n\n I ask... did anybody that was IMMENSELY bored by this stick it out and it was worthwhile for you? Thank you for any info\n\nOr does it get explained later why they're all like this and weirdly numb? Even the family members?",
        "upvotes": 59,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1jrzfv4/did_anybody_really_bored_by_ozarks_stick_it_out/"
    },
    {
        "id": "1js4zds",
        "author": "TaleMother8466",
        "title": "The best reality show on netflix?",
        "content": "What is the best reality show on netflix? Something really suspenseful. I just watched Million Dollar Secret and I loved it. I know its not the real, but I would love something simmilar to watch. ",
        "upvotes": 15,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1js4zds/the_best_reality_show_on_netflix/"
    },
    {
        "id": "1jswjg4",
        "author": "Even-Face9205",
        "title": "What theory explain best who probably will be killed tonight? I think the part with the fruit from the Suicide tree will have a big part with who will be killed and probably Timothy the killer!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jswjg4/what_theory_explain_best_who_probably_will_be/"
    },
    {
        "id": "1jsiyd4",
        "author": "slyr4scal",
        "title": "Netflix issue..",
        "content": "Hey, so, just started watching Naruto through Netflix.\n\nCurrently on season 2, episode 1 and my closed captions aren’t really “closed-captioning”… The subtitles aren’t showing what the characters are saying on screen, which isn’t TOO MUCH of an issue, but it’s extremely annoying. I watch dub with subtitles on because it feels comfortable (please don’t attack me for it) and I want to know if anyone else has had this issue watching Naruto on Netflix or if it’s just me.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsiyd4/netflix_issue/"
    },
    {
        "id": "1jsrj5i",
        "author": "Renegade_Pawn",
        "title": "Prevent Netflix from auto-rewinding 30 seconds or so",
        "content": "For a while now, Netflix has been auto-rewinding episodes by \\~30 seconds when I resume watching them. I'm not talking about using the play/pause button, but rather when I've closed and then reopened the episode later.\n\nThis behavior seems to have become the trend (Youtube does the same), but I **really, really don't like it.** \n\nIt doesn't seem consistent. Sometimes it happens, sometimes it doesn't.\n\nI just want the episode to resume exactly where I left off. Does anyone know a way to disable this so-called feature?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jsrj5i/prevent_netflix_from_autorewinding_30_seconds_or/"
    },
    {
        "id": "1js7axp",
        "author": "Arppeggi",
        "title": "Netflix TV does not have a \"I'm traveling\" option anymore?",
        "content": "I recently bought a smart TV a month ago, and I think it had the traveling option, which worked great until today. Now, I’m stuck with having to change the Netflix household to use my TV.  \n  \nIs there any way I can use Netflix on my TV without changing the Netflix Household?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1js7axp/netflix_tv_does_not_have_a_im_traveling_option/"
    },
    {
        "id": "1jsahzz",
        "author": "surtrc",
        "title": "Movies stop about 7 minutes before the end?",
        "content": "Hello\n\nI watch movies via Playstation. When the movie is about to end (about &lt;7 minutes before the end of the movie) SOME movies stop playing. I can't do anything. I have to restart my Playstation. When I try to open the movie after and watch it it happens over and over again.\n\nDo anyone of you have the same problem or experienced this issue? Thanks so much for your help.\n\nIt happens with SOME movies, but not all... really weird.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jsahzz/movies_stop_about_7_minutes_before_the_end/"
    },
    {
        "id": "1jsnk21",
        "author": "awesomeAMP",
        "title": "Million Dollar Secret: good idea, stupid execution",
        "content": "Basically the title. \n\nSaw what was it about and it sounded interesting, however, it’s is completely stupid and easy for the contestants to know who the millionaire. The secret objectives are not subtle, and the clues given out by the producers are more than obvious. \n\nI understand why it must be like this: the average viewer is not that smart and more complex puzzles, objectives, and clues can be a turn off leading to less views, but it still makes me kind of angry knowing this could be so much fun with smarter rules. \n\nI’ll keep watching because I like crappy tv before bed, but still. \n\n\nWhat do you think. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jsnk21/million_dollar_secret_good_idea_stupid_execution/"
    },
    {
        "id": "1jsg9c0",
        "author": "Kuchii_Kopii",
        "title": "Florida Man - Song in episode 2??",
        "content": "I'm desperatly looking for the song thats playing at 27:20 mins Episode 2.\nI only know he sings something like:\"So slooo-o-o-o-oow\" idk??\nCan u help me there its killing me aaah",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jsg9c0/florida_man_song_in_episode_2/"
    },
    {
        "id": "1jsoasv",
        "author": "Icy_Studio4485",
        "title": "adolescence",
        "content": "in adolescence when they discuss jamies attractions and feelings towards women and kate, and with the graffiti, are they implying that jamie also sexually assaulted kate at some point before or after the murder? or is it accusations towards the father, or towards jamie being an incel? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jsoasv/adolescence/"
    },
    {
        "id": "1jrroxe",
        "author": "Jatmahl",
        "title": "Pulse",
        "content": "Started episode one and already turned off by the shitty CGI... like everything outside the hospital building is CGI. You are telling me the producers couldn't get back drops of a random real life hospital to use? It makes it look very cheap.",
        "upvotes": 36,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jrroxe/pulse/"
    },
    {
        "id": "1jsvqh3",
        "author": "gibranaway",
        "title": "Xenopobic Netflix, Racism is Okay",
        "content": "My daughter is Russian Ukrainian and primarily speaks Russian. She moved here before the war. There are one millions Russian speaking citizens in the USA, most oppose Russia's invation. Netflix systematically removed all Russian SubTitles and Voice-Overs.\n\nThat is Xenopobic. \n\nWhat would we say if Netflix banned the Islamic language from their platform? We'd be outraged and call out the Xenopobic Racist decision. Here's all the countries with Russian based languages discrimated by Netflix ban.\n\nAccording to ChatGPT, there's 260 million globally Russian-speaking people, only 50% (137 million live in Russia).  So, 50% of Russian-based language is live outside Russian.\n\n140 million people not part of the war had their language removed from Netflix.\n\nhttps://preview.redd.it/p6934e6978te1.png?width=1318&amp;format=png&amp;auto=webp&amp;s=a550d3797c3d84fb86be94a6826e6b3e81576e72\n\nI ask Netflix to make an effort towards peace and reinstate Russian dubs &amp; subtitles.  \n  \nBecause it is racist and xenophoic to remove a language.   \n  \nWhen you see a Ukrainian flag, their foundational language was essentially removed too.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jsvqh3/xenopobic_netflix_racism_is_okay/"
    },
    {
        "id": "1js4l15",
        "author": "BreathInTheWorld",
        "title": "Million dollar secret",
        "content": "Great show, could think of it similar to a popular game 'amoung us' BUT I'm sure the producer's didn't count on alliances to form instead of everyone collectively voting out the millionare.\n\nIt is possible the producers stepped in to tell the contestants they had to try vote out the millionaire. There was no downside for an alliance of 5 people voting out 4 others. That would then make it a boring and predictable show when you know who will be voted out.\n\nLet's say the contestant's voted out someone that is not the millionaire, then $100,000 is taken off the prizepool and given to the millionaire. This wiould make sure someone like Lauren isn't voted out and would create higher tensions petween players. Complete anarchy! What do you think?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1js4l15/million_dollar_secret/"
    },
    {
        "id": "1jrwylx",
        "author": "fish_man77",
        "title": "Any good detective shows??",
        "content": "I'm currently watching unbelievable which is amazing btw if you haven't seen it watch it! But I'm really into these shows and I was wondering if there's any more? I have watched one but I forgot the name but they interview murders so I've only seen two good ones:))",
        "upvotes": 13,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jrwylx/any_good_detective_shows/"
    },
    {
        "id": "1jrldyd",
        "author": "Decent_Confidence_36",
        "title": "Con mum",
        "content": "I’m so confused watching this, I can understand how a man who believes his mother he hasn’t known for his entire life can be manipulated… but the Zurich bank and lawyers ??? How ",
        "upvotes": 84,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1jrldyd/con_mum/"
    },
    {
        "id": "1jryxd2",
        "author": "tsundering_kurisu",
        "title": "I made a chrome extension that changes your new tab page into a netflix themed page. Please share your opinion.",
        "content": "for those who are interested here:\n\n[Extension link for Netflix themed new tab page.](https://chromewebstore.google.com/detail/oedcjippkgifaipmjjfhjfcpikmnaopf?utm_source=item-share-cb) \n\n[Color theme link that changes your browser's frames, tab background, toolbar to look like Netflix themed.](https://chromewebstore.google.com/detail/jmjmmjncjfcejmkjicaccmdhoolpcpal?utm_source=item-share-cb)\n\nPlease share your opinions. \n\nThank you very much.",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0q8fmpgr8zse1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jryxd2/i_made_a_chrome_extension_that_changes_your_new/"
    },
    {
        "id": "1jslhgy",
        "author": "Legitimate-Image-472",
        "title": "Adolescence",
        "content": "So, I just finished watching the first episode of this show, and I have to say that the kid’s solicitor/attorney is terrible!\n\nHe sits silently while the boy pretty much confesses to killing his classmate. \n\nAny good attorney would shut that interview down before it progressed to showing the cctv of the murder taking place. \n\nTell me I’m wrong. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jslhgy/adolescence/"
    },
    {
        "id": "1jshgk3",
        "author": "Fool_Kumari",
        "title": "Adolescence",
        "content": "I just finished watching Adolescence and I absolutely loved it—the drama, the suspense, and especially Jamie’s acting were all on point. But honestly, it left me craving more; it felt like there should have been a few extra episodes. \n\nI really wanted to see more of Jamie—maybe even a courtroom drama. He kept insisting he didn’t do it, and it left me wondering what he really meant by that. Was he hinting at some psychopathic tendencies? Did he actually feel any remorse? I remember episode 3 showed a lot of his character, but it just made me even more confused about who he really is. I guess that was the point, though—leaving us with questions. Anyone else feel the same way?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jshgk3/adolescence/"
    },
    {
        "id": "1jrz999",
        "author": "Sweaty-Toe-6211",
        "title": "Ashley Park Teases Filming Emily in Paris Season 5 in the Summer: 'I Am Highly Anticipating It'",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jrz999/ashley_park_teases_filming_emily_in_paris_season/"
    },
    {
        "id": "1js4ri7",
        "author": "Alterria",
        "title": "Devil May Cry E04 Won’t Play",
        "content": "(No bugs/problems flair?)\nEvery other episode and every other show works perfectly fine, Episode 4 loads 0%, 25%, or 89% before forever loading and eventually a popup shows up saying there was some kind of error and asking to run a check, which upon clicking shows a pinwheel for a split second and then cuts right to the Devil May Cry menu where I can hit play on the episode. Where it repeats the cycle. Is this a server issue or something wrong on our end?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1js4ri7/devil_may_cry_e04_wont_play/"
    },
    {
        "id": "1jshjwx",
        "author": "EntertainerFrosty842",
        "title": "What is your takeaway from Adolescence?",
        "content": "To me the series is about how the world and especially the internet is extremely conflicted (this is not necessarily a bad thing because freedom of speech is truly needed in any society of beings who want to coexist) but learning to ease these conflicts peacefully by talking things over is of utmost importance (like Jamie should have done with Katie and/or his parents and possibly others from the very beginning and like he did too late with Briony) \n\nI feel like the series also shows that people are in search of confirmation of their own morals and beliefs, which could spiral them down further if they are only confirmed again and again (like on the internet and what Jamie seems to seek from Briony in the hearing). I see a lot of people saying the series is about toxic masculinity, and while I can clearly see it plays a big role in the series, that’s not “only” it to me.\n\nLastly, I invite everyone who has the intend to respond, to comment on my post. You may critique this, applaud it, laugh at my grammer, correct me, add to it, ask me about anything and even post memes. Just comment anything you want. Because I think you should know that your opinion matters (not necessarily to a person individually but it does 100% matter to society). If you don’t want to respond then that’s also fine, that’s an opinion too. Only by talking things out as civil beings we can make this world a better place for everyone. If you don’t agree with this part you may also comment if you want. (Sorry if this paragraph was too long, I have ADD so that may explain it hehe)\n\n(My first language isn’t English so if there are any issues and you need me to reexplain something you know what to do ;)) —&gt; if you don’t know what I meant by this just read the paragraph above this one\n\nSmall joke at the end of my comment because I want to make someone smile:\nThis comment is copyrighted by my brain",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1jshjwx/what_is_your_takeaway_from_adolescence/"
    },
    {
        "id": "1js0dxi",
        "author": "Brewben",
        "title": "Random accounts",
        "content": "Does anyone ever have a random profile pop up on your account? Second time this morning, a ‘Jojo’ pops up with a watch queue and continue watching list. \n\nOf course I immediately sign out of all devices and change password, but with Netflix locking you into only being able to watch on your local network these days, how does someone even pull this off? Also no email notification of a new sign in…",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1js0dxi/random_accounts/"
    },
    {
        "id": "1jrjnql",
        "author": "Ordinary_survival",
        "title": "Anyone watched Netflix Mo?",
        "content": "I am watching it now, while knitting 😄\nI am atheist/agnostic still going back and forth but I am have brought up in a muslim country so the things they tease I get it. The one thing I repelled so far was the Hameed wedding, so the girl is big, Mo himself is big aswell he can have a “love” relationship with Maria but he does not believe Hameed loves Dallas and just marries her for greencard. So as a former big girl I got triggered why men are acceptable as big as they are and women are not? What is the difference and this coming from a big guy (I mean of course it is scripted and I don’t know if he is in the writer squad but still) is very annoying and heartbreaking, when this hypocracy will end? Being a big women does not equal to not being loved😢",
        "upvotes": 23,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jrjnql/anyone_watched_netflix_mo/"
    },
    {
        "id": "1jseswg",
        "author": "Only-Standard445",
        "title": "Why did Jamie in Adolescence keep saying ‘I didn’t do anything wrong’?",
        "content": "Was he trying to convince everyone around him that he didn’t commit the crime? Or was he trying to convince himself that even though he did it, it wasn’t wrong?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jseswg/why_did_jamie_in_adolescence_keep_saying_i_didnt/"
    },
    {
        "id": "1jrvdmp",
        "author": "eHrbP",
        "title": "anything that hit like arcane or blue eye samurai?",
        "content": "Arcane + Blue Eye Samurai got me obsessed me in the best way. Looking for series or movie with that same unique art style, how the characters got built emotionally complex and has very strong storyline. Something that scratches the same itch pls pls bonus if it has a rlly darker cinematography i js want a plot that goes hard\n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jrvdmp/anything_that_hit_like_arcane_or_blue_eye_samurai/"
    }
]