[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1htd9hj",
        "author": "Whobitmyname",
        "title": "‘Wallace &amp; Gromit: Vengeance Most Fowl’ Has Become The Most Watched Film Broadcast On English TV With 16.2M Viewers",
        "content": "",
        "upvotes": 59,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1htd9hj/wallace_gromit_vengeance_most_fowl_has_become_the/"
    },
    {
        "id": "1hta94f",
        "author": "Yakasha",
        "title": "Is there a way to get Netflix to stop showing me WWE content?",
        "content": "So WWE is coming to Netflix. How do I know this? It's fucking everywhere every time I open the app.\n\nMy \"new and popular\" is nothing BUT WWE shit. I don't care. I'm not 13 anymore. I don't care about this shit.\n\nNetflix knows what I'm interested in based on my thumbs up and thumbs down, but insists on populating almost every genre with at least something WWE. \n\nHow do I get it to go away?",
        "upvotes": 75,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1hta94f/is_there_a_way_to_get_netflix_to_stop_showing_me/"
    },
    {
        "id": "1hta7wf",
        "author": "S4v1r1enCh0r4k",
        "title": " R.L. Stine confirms the writers are currently working on three more Fear Street movies ",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hta7wf/rl_stine_confirms_the_writers_are_currently/"
    },
    {
        "id": "1hsuod8",
        "author": "Background_Silver702",
        "title": "Best show I’ve seen in a while: Man on the Inside",
        "content": "The title says it all. But this was such a heart-warming show. One of the best shows I’ve seen on Netflix in a while. \nGreat acting, laugh out loud moments, poignant, good storytelling and great cinematography. \nI am so enthused that there’s going to be a second season. \n10/10 for me. ",
        "upvotes": 150,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1hsuod8/best_show_ive_seen_in_a_while_man_on_the_inside/"
    },
    {
        "id": "1hthaur",
        "author": "SuperPigDots",
        "title": "How do I add \"extra members\" on my Netflix Premium plan paid through my T-Mobile Magenta plan?",
        "content": "I recently upgraded to Netflix Premium through my T-Mobile Magenta plan. On the Netflix Premium features that were/are advertised to me, just like on the Netflix website, it says:\n\n&gt;Option to add up to 2 [extra members](https://help.netflix.com/en/node/123279) who don't live with you.\n\nI want to take advantage of this by adding one of my parents (non-household and lives far away) as the extra member. I looked everywhere I could think of, but I do not see Netflix currently offering any interface, option, or way to add these extra members. I would like to know:\n\n1. How do I add a member?\n2. Does it cost extra? \n3. If it costs extra, then, how much?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hthaur/how_do_i_add_extra_members_on_my_netflix_premium/"
    },
    {
        "id": "1htfuc7",
        "author": "berryruby",
        "title": "How may people can watch netflix at the same time on one account and one profile?",
        "content": "So I have 1 netflix account that I pay for, And 3 profiles on it (one for me, my brother and then one for my 3 friends) So how many people can watch netfkix at the same time on one account and one profile? I have standard premium plan btw. I searched on internet but I genuinely dont get it",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1htfuc7/how_may_people_can_watch_netflix_at_the_same_time/"
    },
    {
        "id": "1hstkcy",
        "author": "VeracitiSiempre",
        "title": "Cunk on Life now airing",
        "content": "I watched it, and it was outstanding, as usual. If you’re a fan of the  Philomena, you’re in for a treat!\n\nDeadline link because I felt like I was supposed to add *something\n",
        "upvotes": 63,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hstkcy/cunk_on_life_now_airing/"
    },
    {
        "id": "1hthfwb",
        "author": "Motorboke",
        "title": "Netflix not updating shows on my profile. ",
        "content": "I’ve been having the issue lately that whenever I watch a show on my phone it won’t update what I’ve been watching on my profile, but I do notice that it will update the show I’m watching on my mom’s profile instead. \nBefore I watch a show I make sure I am in my profile so I know it’s not an issue of me clicking the wrong profile. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hthfwb/netflix_not_updating_shows_on_my_profile/"
    },
    {
        "id": "1ht1ei1",
        "author": "Ready-Flamingo6494",
        "title": "Horizon An American Saga, how have I not heard of this before until Netflix just released chapter 1?",
        "content": "I will admit, I'm not one that pays close attention to new releases on Netflix or mainstream media releases. But holy #$@&amp; hell. This came out of nowhere for me.\n\nI do not think I've been more emotionally distraught, angry, hopeless - utterly overwhelmed with grief - all of it at once from a movie in a long time, if ever. \n\nSPOILER\n\nThe scene where the raiding Apache open up the tent as the family prays. I...I just can't... I can't get my head around it. Wow just wow. \n\n",
        "upvotes": 14,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ht1ei1/horizon_an_american_saga_how_have_i_not_heard_of/"
    },
    {
        "id": "1htfsh1",
        "author": "BeastElyse",
        "title": "New on Netflix (based on the lag between titles and images while scrolling) ",
        "content": "Has anyone else experienced a delay in images catching up with titles while scrolling through options? I decided to make a few combos (because this is how I spend my weekends, now). ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1htfsh1/new_on_netflix_based_on_the_lag_between_titles/"
    },
    {
        "id": "1hteick",
        "author": "erickravi",
        "title": "WWE’s Monday Night Raw to Debut on Netflix: A New Era Begins on January 6, 2025",
        "content": "WWE’s “Monday Night Raw” is set to make its streaming debut on Netflix on January 6, 2025, at 8 p.m. ET / 5 p.m. PT.\n\nNetflix This transition marks the beginning of a 10-year partnership between WWE and Netflix, valued at over $5 billion.\n\nThe premiere episode will be broadcast live from the new Intuit Dome in Los Angeles.\n\nSource - StorifyNews",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hteick/wwes_monday_night_raw_to_debut_on_netflix_a_new/"
    },
    {
        "id": "1hthd6z",
        "author": "RareCheesecake595",
        "title": "WHY is there no English subtitle option without Closed Captioning (CC)???",
        "content": "Please. I am not a native english speaker but don't want to watch the dubbed version. I know English well enough to understand everything with subtitles but not well enough to understand ALL of it without. Sure, most of it. But maybe there whispering, maybe there are explosions or other loud sounds (I'm looking at you Nolan), maybe there is just one word I don't know, maybe they are using colloquial language I'm not familiar with, maybe there using names I don't understand. But I don't want to see this annoying closed captioning s\\*\\*\\* because... well it is ANNOYING AS HELL. Besides, maybe some native speaker folks want to watch with normal subtitles as well? I imagine watching while eating chips/crisps for example or watching Nolan movies. Or maybe you don't want to turn up the volume too loud.\n\nAlso, why is there stuff included in the CC which one can see? For example there was someone seen spitting on the floor, why would you add \\[spits\\]??? Dude, I see it! It does not happen often but sometimes.\n\nWouldn't it be easy as hell to offer a subtitle-version without CC? All the text is there already anyway, just search and delete everything in square brackets, it can't be that hard for real.\n\nAre they really thinking there is NO ONE who would like subtitles for the original/production language without CC?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hthd6z/why_is_there_no_english_subtitle_option_without/"
    },
    {
        "id": "1htc8li",
        "author": "Unlikely-Abalone-268",
        "title": "Lowering quality on the TV",
        "content": "I watch Lucifer and since season 4 the series has become 4k hdr (now the TV switch to a specific profile)\n\nAnd I don't like 4k at all, nor hdr, so it was perfect before.\n\nHow can I lower the quality to 1080p? I couldn't find anything in the settings. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1htc8li/lowering_quality_on_the_tv/"
    },
    {
        "id": "1hstsvv",
        "author": "Lars_Olav",
        "title": "Are reviews of non-English shows poorer when the reviewer isn't used to subtitles?",
        "content": "I’ve been noticing something lately, and I’m curious if anyone else feels the same way. It seems like reviews of non-English shows often get lower ratings or feel less in-depth compared to English-language ones. I wonder if it has to do with the fact that many reviewers aren't used to reading subtitles? It feels like there's a certain disconnect when people aren't accustomed to watching things with subtitles, and it shows in their reviews.\n\nIt seems to me that reviewers who are more familiar with non-English media are able to offer more thoughtful critiques, but those who are less used to subtitles sometimes struggle to engage with the show properly. Does anyone else notice this trend?\nI often see this in Europan non English shows ",
        "upvotes": 17,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hstsvv/are_reviews_of_nonenglish_shows_poorer_when_the/"
    },
    {
        "id": "1ht81ke",
        "author": "Fluffyfrogfred",
        "title": "Black dove, no good deed or Missing you?",
        "content": "Alright. I’m wanting to binge a show and don’t know which one of the three I should start with and complete. I have probably watched one episode of black dove and no good deed, however I don’t retain anything unless I watch it a few times so basically  it’s like I’m starting over again. Pls tell me which one you enjoyed most, if any. ",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ht81ke/black_dove_no_good_deed_or_missing_you/"
    },
    {
        "id": "1hshzrx",
        "author": "gorram1mhumped",
        "title": "Do people talk about Glow? I'm kinda shocked how good it is, but nobody every pushed it. If you haven't seen it, for whatever reason, consider this a push.",
        "content": "The show takes its time, don't expect to get hooked right away. But i think they nailed the tempo. Very fun, silly, touching, and cool. Really unique viewing experience, and everyone is acting their asses off, often with just a few lines an episode.",
        "upvotes": 83,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1hshzrx/do_people_talk_about_glow_im_kinda_shocked_how/"
    },
    {
        "id": "1ht0ov8",
        "author": "Lars_Olav",
        "title": "Why do Harlan Coben's stories grip us with suspense and twists, but we forget them quickly after finishing?\"",
        "content": "Harlan Coben is a master at creating stories packed with suspense, unexpected twists, and turns that make his books and Netflix series almost impossible to put down. The tension, the mysteries, and the twists keep us hooked until the very end. But here's the interesting thing—once we finish a story, it often seems to fade from our memory quickly. Why is that?\n\nIt can't be as simple as just following a formula—because if it were, many writers would be able to do it. What makes Coben's stories so compelling in the moment but forgettable after? Is it the pacing, the focus on plot over deep characters, or something else? ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ht0ov8/why_do_harlan_cobens_stories_grip_us_with/"
    },
    {
        "id": "1ht57pe",
        "author": "Only-Ordinary1146",
        "title": "Fire tablet not opening my profile, only open kids profile ",
        "content": "So started today my Netflix app on my fire tablet only open the kids profile, when I try to open my profile it crashes. I use it while on the treadmill 😭😭😭 I tried uninstalling the app etc etc etc nothing helps. It started out of nowhere today. What’s going on? ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ht57pe/fire_tablet_not_opening_my_profile_only_open_kids/"
    },
    {
        "id": "1htehgf",
        "author": "Herringundercoat",
        "title": "Squid Game 2 in Dubai. Are you in?💰 #squidgame #netflix #dubai #whycgi",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1htehgf/squid_game_2_in_dubai_are_you_in_squidgame/"
    },
    {
        "id": "1hsmvg2",
        "author": "indiewire",
        "title": "The 27 Best Rom-Coms on Netflix: Friends with Benefits, Hit Man &amp; More",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsmvg2/the_27_best_romcoms_on_netflix_friends_with/"
    },
    {
        "id": "1ht61e1",
        "author": "hesyouknow",
        "title": "No Good Deed Episode 8 - Looking for rug",
        "content": "Not sure if this kind of post is appropriate here but hoping someone can help me out. I binged No Good Deed over the holiday break. A good show. \n\nStop reading - this might be a spoiler \n\n\nIn episode 8 Lydia goes to Abbi &amp; Sarahs house. I’m looking for the rug in the living room scene. Anyone know the brand? \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ht61e1/no_good_deed_episode_8_looking_for_rug/"
    },
    {
        "id": "1ht72l1",
        "author": "Key_Village4870",
        "title": "Immersive banners",
        "content": "So a few weeks ago, Netflix released **Spellbound.** I saw my brother who was a kid watch it but before he pressed play on it, there was a big banner promoting it with an intro. Can somebody introduce me to what this is?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ht72l1/immersive_banners/"
    },
    {
        "id": "1hsyulv",
        "author": "Motor-Replacement-77",
        "title": "ABSOLUTELY LOVE THIS SHOW!",
        "content": "I just finished Jin on Netflix. It was recently added and it was spectacular. Definitely give it a watch if you like time travel and a really heart string pulling story. I learned a great deal of history about Japan from it too.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hsyulv/absolutely_love_this_show/"
    },
    {
        "id": "1hsxk9l",
        "author": "Numerous_Cook9842",
        "title": "Korean gameshow about geniuses solving riddles?",
        "content": "I watched a series on Netflix and forgot the name. \n\nIt was about a group of (real) people who were all very intelligent and the games were intellectually challenging. Rewards for winning were gathering golden coins, punishment was going to a jail cell over night. \n\nPlease help.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hsxk9l/korean_gameshow_about_geniuses_solving_riddles/"
    },
    {
        "id": "1hswv38",
        "author": "Alxyhq",
        "title": "I forgot a name of this k-drama(?)",
        "content": "So there was a woman who was married with wealthy men and had 1 kid with him. She met a girl who was an artist, and asked her for a drawing classes. Once she couldn’t come to her, she asked her boyfriend to go instead of her. He fell in love with this woman and they fled to Ireland. But after one year she left him bc of lack of money. This guy had an accident and he lost his memory. Back to his girlfriend and her friend: she still loved him and couldn’t imagine life without him so she found him in Ireland after accident, returned to Korea and pretended like they always were an couple.\n\nSorry if there are a lot of mistakes I tried😭😭🙏",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hswv38/i_forgot_a_name_of_this_kdrama/"
    },
    {
        "id": "1hsvloi",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in January 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsvloi/best_new_movies_streaming_on_netflix_in_january/"
    },
    {
        "id": "1ht0ajq",
        "author": "Psychological_Ad1202",
        "title": "Can't watch netflix while in whatsapp call?",
        "content": "Greetings,\n\nI've been having this issue ever since I started using Whatsapp which has been a long time now.\n\nI have a Samsung Galaxy S20+ and anytime I'm in a Whatsapp call, I for some reason can't get anything to actually play in the Netflix App. The app will open, but any time you actually try to play the movie/show, it doesn't do anything.\n\nIs there a way around this? Perhaps a web browser of some sorts that will allow me to watch Netflix while still in a Whatsapp call?\n\nThanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ht0ajq/cant_watch_netflix_while_in_whatsapp_call/"
    },
    {
        "id": "1ht4g2m",
        "author": "elguspeo_elpro",
        "title": "Am I the only one having lag spikes?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6w31am4h4wae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ht4g2m/am_i_the_only_one_having_lag_spikes/"
    },
    {
        "id": "1htcpr2",
        "author": "icygirl7",
        "title": "There is no need for movies and tv series to have sex and nudity scenes",
        "content": "This is something I've felt strongly for a long time. I am a 22-year-old woman. Ever since I was young, I have always hated the fact that many movies and TV series have sex and nudity scenes. They are not necessary at all, and I think it is very misogynistic for women to have to strip on camera to have these big roles. And no, I do not need to see men naked either. I don't want to see anyone naked, I just want to see a good story.\n\nIt's not comfortable for us to watch, whether I am alone or with family. In fact, even kissing scenes can be uncomfortable when you are watching with your family. They don't need to show us two people kissing to show they are a couple, like we get it.\n\nI've switched to watching Asian, Arabian, and Turkish dramas. No kissing, sex, or nudity required, the plots and acting are much better. Why can't we have that in the West?\n\nA lot of Gen Z feel the same way. We're just gonna boycott more and more movies and series that have sex and nudity. We have plenty of stuff to watch from the other part of the world, and luckily, every streaming app has English subtitles.\n\nI hope more people can speak out like me. Going forward starting from 2025.",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1htcpr2/there_is_no_need_for_movies_and_tv_series_to_have/"
    },
    {
        "id": "1hsmvnu",
        "author": "indiewire",
        "title": "The 15 Best Thrillers on Netflix in January",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsmvnu/the_15_best_thrillers_on_netflix_in_january/"
    }
]