[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 42,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kxamzx",
        "author": "bitchandmoan69",
        "title": "Its really fucking annoying that the starter of the binge streaming model of TV keeps interrupting me to ask if I'm watching.",
        "content": "At least rate limit it to 2 hours or something, dont do it by episode count because short episode things like Love Death and Robots exists. I had it ask me if I'm still watching twice in one hour, very annoying.",
        "upvotes": 32,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kxamzx/its_really_fucking_annoying_that_the_starter_of/"
    },
    {
        "id": "1kxh8bq",
        "author": "boobooball5",
        "title": "New show suggestions please",
        "content": "\nMy fav genres are crime, psychological thrillers, a bit of teen drama and romance, witty humor, steamy shows are my guilty pleasures! I enjoy shows like YOU, Handmaids Tale, The diplomat, ginny and Georgia , Virgin River, Marvelous Mrs Maisel, Fleabag, Elite, Bridgerton, The Empress, Behind her eyes, obsession, unbelievable, White Lotus, Normal People, The Bold Type , Gilmore Girls, Modern Family, classics like Vampire Diaries!\n\nPlease help a bored girl out! Thanks in advance ",
        "upvotes": 9,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1kxh8bq/new_show_suggestions_please/"
    },
    {
        "id": "1kxfnoo",
        "author": "ValuableExact4899",
        "title": "shows to watch",
        "content": "just finished rewatching breaking bad and dexter and i need a new show to watch! i love the vibes of breaking bad and dexter, and i like the crime and gore and stuff that they have. \n\nive seen people recommend Ozark so i may start watching that. does anyone recommend this? \n\nany other great shows i can watch that give these vibes??? ",
        "upvotes": 10,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kxfnoo/shows_to_watch/"
    },
    {
        "id": "1kxljyy",
        "author": "DragonfruitFar3607",
        "title": "Theres hope please",
        "content": "Guys, we just got major support — Rebekka Johnson (Dawn from GLOW) one of the twins shared the petition on her Instagram story!\n\nThat means we now have 2 cast members backing this and spreading the word. This isn’t just a dream anymore — this is momentum. The people who made this show as special as it was are fighting with us.\n\nPlease don’t listen to the ones saying it’s over — we’re literally getting real attention now. If we keep pushing, this could actually happen. So don’t stop. Share the petition again. Comment. Post. Get it out everywhere.\n\nWe’re being seen. Let’s make it impossible to ignore.\n\n🖤 Link to petition: https://chng.it/JMNsWv8Qz5 🖤 #SaveGLOW #RenewGLOW #GLOWDeservesAnEnding",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kxljyy/theres_hope_please/"
    },
    {
        "id": "1kxkzn3",
        "author": "Same_Cat6189",
        "title": "Is Pernille worth sticking with? I’m on S2 and struggling with how much of a pushover she is…",
        "content": "I’m on Season 2 of Pernille and I’m torn. The acting and writing are excellent, and I want to keep watching—but it’s getting exhausting seeing the main character constantly swallow her feelings and let everyone, especially her daughters, walk all over her.\n\nIt’s hard to watch someone be emotionally bullied over and over without advocacy. Do characters eventually show growth?\n\nI want to stick with it if there’s a character arc, but if the whole show is just pain with no change, I might have to tap out.\n\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kxkzn3/is_pernille_worth_sticking_with_im_on_s2_and/"
    },
    {
        "id": "1kx8cey",
        "author": "temeria_123",
        "title": "Just discovered Obliterated, why was this cancelled?",
        "content": "What the hell Netflix, you cancelled one of the most fun shows ever. Alright, this is no \"White Lotus\" or \"Severance\" or whatever, and the best part is...it never tries to be. This is one of those cheesy, over-the-top, brainless action shows that is sexy, funny and addictive. It's a throwback to shows I watched as a kid, Airwolf, Miami Vice, Knight Rider...the 80s baby. And c'mon, it's better than the shitty movies Netflix puts out like Red Notice, Old Guard, Extraction and those 100 generic Ryan Reynolds movies. The cast is hot, doing hot things, while saving U.S. from a nuclear detonation. What's more American than that? The storyline is cliche, but still decent, Russians are bad (of course), but rather than pitting them against another foreign power, there are rogue U.S. ex-military operatives vying for the bomb. There are some genuine twists (don't expect Sixth Sense/Fight Club level twists), that I found good. There are a lot of zingers in the dialogue, c'mon references to Rambo and Mission Impossible (\"fuck, we've been Ghost Protocol-ed\" had me lmao). There were even some deep philosophical shit, like the Gremlin representing Paul's inner demons, fantastic.  Characters, Ava, McKnight, Trunky, Tech Chick, Haggerty, Paul, Gomez were all likeable af, and the cast really delivered. Does help that everyone is hot, yes even Tech Chick. I didn't want any of them to die (which is unusual, there is normally always that 1 person). And Gremlin, voiced by B-99's Jason Mantzoukas, epic. Some people say this show was too raunchy, but nothing a generation that grew up watching American Pie and Hangover would find shocking. And the action was a blast, there are car chases, car crashes, helicopter chases, guns, physical fights, knife fights hell yeah. So imo, this show has a lot of gas left in the tank, they can make 1 season every couple of years (ala Witcher) set in different locations and different \"missions\". Then I found out it was canned....wtf. I really think the reception of the show would have turned out very differently if:\n\n1. Change the fucking title to something easier to remember. I found this show when I accidentally pressed \"O\" in the search bar. And it took me a while to remember the name.\n2. Have a token A-lister in the cast. Shows like Hangover and Bullet Train would've been duds if it wasn't for Bradley Cooper or Brad Pitt - just sayin'. It's not fair to the cast because they were great, it's just Hollywood economics.\n\nSo...when S2?",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kx8cey/just_discovered_obliterated_why_was_this_cancelled/"
    },
    {
        "id": "1kxk64q",
        "author": "Shot_Tough_1232",
        "title": "Hi I need a bit of help",
        "content": "Basically I’m asking that do I need to watch the other fear street trilogy first or prom queen first before them or is it meant to be a standalone movie that has no connection to the trilogy and just the name ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxk64q/hi_i_need_a_bit_of_help/"
    },
    {
        "id": "1kxjuzs",
        "author": "Technical-River-772",
        "title": "Not part of Netflix household but I'm in the house on Wifi",
        "content": "I was trying to open Netflix, but now it says that my device isn't part of the Netflix household. I used it the other day no problem. I'm a college student but I'm home for summer break and I'm on my house's internet right now. The device limit thing has never seemed to be an issue for me or my family before, and it's always recognized my computer. Most advice I saw about this was to connect to the known network, but I'm on it.  My dad owns the account so I'm not 100% sure, but I'm pretty sure we have the standard plan. I'm the only one home, and my dad is working, so I know nobody else is using it right now. I'm just mainly confused as to why this is happening now of all times. Any advice or ways to fix this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxjuzs/not_part_of_netflix_household_but_im_in_the_house/"
    },
    {
        "id": "1kwwrqc",
        "author": "Selena_beauregard",
        "title": "Sirens Opinion - I don’t get why people don’t like this character",
        "content": "So, I have watched Sirens and, on online discussions, a lot of people seem to hate Devon “for being manipulative of Simone” and love Simone for “leaving and going after a better life”.\n\nFor me, Simone was in fact in danger. Is really clear though the show that she 1. Is not taking her med and is an emocional mess, 2. Being groomed by Micaela and very vulnerable, 3. In the end, she is just trying to survive and ends up in the worst spot she could: in the hands of a very wealthy older man who has all the power in the relationship and a history of disregard for his wives.\n\nIn the end, Devon actually lets Simone go when she realizes that 1. Simone will be as auto destructive as she was because it’s her life, and Devon will drown with her if she keeps trying to save her, and 2. Devon realizes she doesn’t know Simone that well too. Also, it is very clear Devon has a lot of mental issues and doesn’t got the money for treatment (thus the affairs with a lot of guys, impulsive decisions and emotional outbursts).\n\nAnd yes, she was not right to expect Simone to take care of their father, but it makes sense she did. Devon was not expected to take care of Simone either, she was not responsible for her and yet she took that role. In her mind, at the start of the show, she thought that she was obligated to take care of Simone because they were family, and that’s the same reason she takes care of the dad and why she thinks Simone should too. In the end, she realizes that taking care of family was a choice and one she was very happy and proud to make.\n\nI really liked Devon actually, because by the end she finally finds a “light” and starts to follow a good path. I don’t get the hate.",
        "upvotes": 38,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kwwrqc/sirens_opinion_i_dont_get_why_people_dont_like/"
    },
    {
        "id": "1kx39uo",
        "author": "CryptographerAny7171",
        "title": "Looking for reality show recommendations!",
        "content": "I love the intensity and drama of Hell’s Kitchen, Culinary Class Wars, Single’s Inferno, Love Island, Love is Blind, Squid Game The Challenge, and Physical: 100. Got any suggestions with a similar feel?",
        "upvotes": 12,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1kx39uo/looking_for_reality_show_recommendations/"
    },
    {
        "id": "1kxddi2",
        "author": "Chimpoboyo",
        "title": "Constant glitch on TV shows with black bars at the side shifting the entire screen right to left",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oq8pfns3zh3f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kxddi2/constant_glitch_on_tv_shows_with_black_bars_at/"
    },
    {
        "id": "1kxh1qz",
        "author": "adwcta",
        "title": "Peppa Pig S7 languages",
        "content": "Season 7 just released, and the entire show is in English only (even subs are English only), whereas for prior seasons there's a whole bunch of other languages available.\n\nDoes anyone know if/when Netflix will be adding the dubs for the other languages?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxh1qz/peppa_pig_s7_languages/"
    },
    {
        "id": "1kxbtnj",
        "author": "QuietCelebration5229",
        "title": "forgot the name of removed netflix show",
        "content": "\n\nhello, I just told my friend about a drama that I watched in like 2018 or 2019 but I can’t remember it at all and it used to be on Netflix but I don’t remember a lot of details. It was about a family and they all seemed really normal. It was like a huge apartment or like a studio apartment and it was an Asian drama too I think. I can’t remember if it ended with them all dying or killing people, but I do remember that the ending was about death and I think that they were hiding deaths from people as well. I really can’t remember that much about it but I just know that there was one season and it wasn’t really that popular either. It kind of seemed like they were in a lower class area and just moved into there while hiding stuff from their neighbors.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kxbtnj/forgot_the_name_of_removed_netflix_show/"
    },
    {
        "id": "1kwyqlt",
        "author": "Xrusha_001",
        "title": "Favorite Shows - Neurodivergent/Highly Sensitive/Mental Health related",
        "content": "- Atypical \n- Fern Brady, Autistic Bikini Queen\n- North of North \n- Maid\n- Nobody Wants This\n- Never Have I Ever\n- The Queen's Gambit\n- Running Point\n- Crazy Ex Girlfriend (sadly no longer on Netflix)",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kwyqlt/favorite_shows_neurodivergenthighly/"
    },
    {
        "id": "1kxap5w",
        "author": "Ihadtosubscribe",
        "title": "Weird glitching on PC while fullscreen",
        "content": "Using the official app from the Microsoft Store. Tried disabling all Edge extensions, didn’t help. Doesn’t happen of Firefox for some reason (no, I don’t wanna use Firefox because it won’t go above 1080p and also no HDR). The glitching stops when I move the mouse and the overlay with controls comes up. It doesn’t seem to happen with every show, just with those who have a 16:9 aspect ratio. It happens even when the show is paused, as long as there isn’t the overlay as I said earlier. Anybody had the same issue?",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/a0ose6ta2h3f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kxap5w/weird_glitching_on_pc_while_fullscreen/"
    },
    {
        "id": "1kx5ors",
        "author": "Over_Cake9611",
        "title": "Why is there not an option to skip intro on all tv shows?",
        "content": "As the title says. Why can’t I automatically skip intro on all tv show episodes? It should be a setting i can opt into or out of. Maybe into the deeper settings that you have to go looking for.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kx5ors/why_is_there_not_an_option_to_skip_intro_on_all/"
    },
    {
        "id": "1kwn95n",
        "author": "Junior_Apartment6388",
        "title": "The house from Sirens looks so different in real life! It’s in Long Island and they used so much CGI",
        "content": "",
        "upvotes": 22,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kwn95n/the_house_from_sirens_looks_so_different_in_real/"
    },
    {
        "id": "1kx8tyd",
        "author": "funlover_87",
        "title": "Netflix issue",
        "content": "Hi, I am from Pakistan. I am unable to access Netflix. Is there any issue connecting to Netflix? Netflix says \"Not available\". I tried to open it using Android, iPhone and even on PC.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kx8tyd/netflix_issue/"
    },
    {
        "id": "1kx5djf",
        "author": "UpsetDiscipline9385",
        "title": "Series",
        "content": "Can anyone give me a recommendation for a series to watch that is sci-fi and very good with a great main and side plot and has various plots among different characters ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kx5djf/series/"
    },
    {
        "id": "1kweoyx",
        "author": "AuldTriangle79",
        "title": "Nobody Wants this - Nick Kroll",
        "content": "I am watching the new armchair expert and Nick Kroll mentions he was offered the Adam Brody role in nobody wants this and turned it down. Can you imagine? It seems unbelievable. ",
        "upvotes": 24,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kweoyx/nobody_wants_this_nick_kroll/"
    },
    {
        "id": "1kx2r63",
        "author": "SYSTEMOFADAMN",
        "title": "Help! What's this Netflix show?",
        "content": "I saw a trailer of a Hindi show of a woman and a man on a date. Guy seemed boring and didn't ask the girl questions about herself. Girl walks out but the guy chases her and they end up buying ice cream. Guy orders vanilla. Any leads what this show could be?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kx2r63/help_whats_this_netflix_show/"
    },
    {
        "id": "1kwrafj",
        "author": "lYMKl",
        "title": "Your TV, Phone, device isn't part of the Netflix Household for this account",
        "content": "Sure, here's the English translation:\n\n\n---\n\nI’m using the subscription in the same house, but our house has 4 floors, so it’s impossible to connect through a single Wi-Fi point. What’s happening is that the ground and first floors are on one Wi-Fi network, and the second and third floors are on a separate one.\n\nBut Netflix doesn’t allow me to connect through more than one Wi-Fi network, and this issue has been going on for almost a year now. It’s making me consider canceling my subscription.\n\nDoes anyone have a solution, or should I just cancel it?\n\n\n---\n\nLet me know if you want a more formal version or if you're posting this somewhere.\n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kwrafj/your_tv_phone_device_isnt_part_of_the_netflix/"
    },
    {
        "id": "1kwvrvp",
        "author": "Apex_Predator0001",
        "title": "Money Heist",
        "content": "New one just finished Season 1.So can anyone please explain the ending of the season like what was it with the singing of the song between Professor and Berlin?And also how Raquel suddenly got the idea of their location while having lunch?\nWill be a great help if u say.Thanks",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kwvrvp/money_heist/"
    },
    {
        "id": "1kwtvp8",
        "author": "PinkClouds20",
        "title": "Netflix adapts Steinbeck's 'East of Eden,' starring Florence Pugh",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kwtvp8/netflix_adapts_steinbecks_east_of_eden_starring/"
    },
    {
        "id": "1kwxqmh",
        "author": "brirritobowl",
        "title": "Hacked… but with their own card??",
        "content": "A few months ago I got an email that my payment method had been changed. My account was compromised and my payment method was taken off and a whole different card was added. I changed it back to mine and changed my password so that I could have my account back. A few weeks later I try to watch Netflix and I’ve been logged out. I check my email and I had an email saying that my email to my account was changed. I got access back to it with a new email after chatting with Netflix. This time my card was in there. I have logged out of all devices and changed my email and password with hopes to keep my account. I have two questions. 1. Why is it so easy for someone to change information on there without it needing to be verified with a code or something? And 2. What is the point of hacking if they’re going to use their own card. Couldn’t they just make their own account? lol",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kwxqmh/hacked_but_with_their_own_card/"
    },
    {
        "id": "1kwakb3",
        "author": "ladeepurple",
        "title": "The Four Seasons (finally came around to watching it)",
        "content": "I watched the series a few weeks ago and just finished the film. Overall, it stayed pretty true to the original, with most changes feeling purposeful — except for &gt;!Nick’s death.!&lt;\n\nWhat bothered me in both versions was Ginny’s lack of self-awareness — and how no one really calls her out on it. In the series, Anne makes it clear how out of place it would’ve been for Ginny to speak at &gt;!Nick’s memorial,!&lt; especially in front of friends and family who’ve known him for decades, primarily as Anne’s husband. Outside of that, no one makes a peep. \n\nI hate when characters are expected to take the high road just to accommodate a specific circumstance or someone else’s mess and that's *exactly* what happens.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kwakb3/the_four_seasons_finally_came_around_to_watching/"
    },
    {
        "id": "1kwelx2",
        "author": "Robemilak",
        "title": "Netflix Brazil Confirms 'Sintonia' Spin-Off, Football Docu 'Brazil 1970', and More",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kwelx2/netflix_brazil_confirms_sintonia_spinoff_football/"
    },
    {
        "id": "1kvqy5w",
        "author": "Busy_bee7",
        "title": "Secrets that we keep!",
        "content": "This show is a must watch! Definitely screamed “the perfect couple” vibes of a rich family on Netflix . Where are they from? Missed that. Anyway this show was hard to watch but also weirdly realistic in a very weird way. Like what in the world would so many of us do in this situation?? It’s that insane. If we found out our nanny was dealing with our child in this fashion. I don’t have words.\n\nIn addition there is so much going on. So many different dynamic characters and the scenery. Loved Cecille. You can tell she’s independent of her husband (her office is literally on the water or wherever she works) and i just had the vibes of how he never talks back to her (I know men who think their better then their wives). Aka that beautiful house is 100% half hers and well earned. I’m convinced she makes more than the lawyer husband. Again, she didn’t say it outright but she mentioned the neighbor is his biggest client and looked completely un phased like the true queen she is. Every woman that makes their own money (usually more) knows this discussion well with their man. And it shows. \n\nHave yall watched this on Netflix? Thoughts?",
        "upvotes": 55,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kvqy5w/secrets_that_we_keep/"
    },
    {
        "id": "1kvp1e4",
        "author": "Informal_Extent5834",
        "title": "Sirens",
        "content": "!!!Spoilers for Sirens!!!\n\nOkay I just finished Sirens and I need to rant (I apologize this is long)\n\nI hate Devon. Like with a burning passion.\n\nShe called her sister a wh\\*re for sending fruit then sucks a guy off because she can't smoke??? And then licks the guy who drives her to a hotel???? Goes to a bar want just wanting to f\\*ck?? Then f\\*cks a gardner. And not to mention she's been sleeping with a married man. Pot is calling the kettle black here.\n\nShows up to her sister's work and threatens to basically cause trouble for her instead of just waiting later to talk like her sister asked.\n\nIs rude to her sister's boss before even really knowing her and then says that she should have been told her sister got a nose job as if Simone isn't an adult and can make her own choices.\n\nDemands her sister move back and help with their father. I get siblings should but she offered to help with money which would be good cause it sounds like he needs a home nurse or go to a place where they can take care of him full time or someone who can take care of him full time. Either sibling spending all their time taking care of a parent is not it. And let's not forget the dad neglected and abused Simone, so why would she want to help in the first place.\n\nSays personal stuff about their life to random people SHE DOESN'T EVEN KNOW!!!!\n\nGoes to the party after Simone told her to stay in the house until she was done with work and she shows up causing problems. No respect for Simone at all.\n\nThey give her money to take care of her dad because Simone doesn't want her there and demands her sister come home???? Like what. She clearly doesn't want to go. A sibling showing up to their siblings work and demanding their grown adult sibling to go home with them when it's clear the sibling doesn't want to is beyond wild.\n\nTalks about how her boss is controlling AS IF DEVON ISN'T. Girl is trying to force her sister home to take care of their dad because she doesn't want to do it alone and thinks Simone's owes her and wants her on meds. Says \"You're going to buffalo with me\" like huh?!?! How is that not controlling?\n\nBelieved strangers about gossip and ran with it. Gossip she heard in jail by a drunk lady who couldn't even remember Devon's name.\n\nSimone doesn't owe her anything. Simone was in an abusive environment before Devon come back and when her sister was somewhere else she shows up demanding she return home to help take care of their dad. And tries to guilt her into coming back when she refuses multiple times. What person wants to help someone who neglected and abused them and furthered their trauma?? And even says \"You don't feel any responsibility for him?\" um no. Since when are children supposed to be indebted to their abusers. And then she tries to tell her \"You sound like a b\\*tch off your meds\". You mean her anxiety meds? The ones her doctor told her she doesn't need to take because you can heal from it. Then says \"you are only alive because of me\", and that means she owes you? She then left her to be abused/neglected and are actively trying to manipulate her, she owes her nothing. And then storms away saying \"You don't need me anymore well good f\\*cken luck\" as if Simone hasn't been doing things on her own for 10 years!!!! Like dear lord.\n\nLater kinda blames her drinking and DUI on someone else as if they forced her to. Like you chose to drink he just drank with you. And got mad when he offered her a drink, which is what she normally does and she yells at him. He didn't even know she was sober when she yelled at him!! Like girl you are the problem.\n\nSimone isn't a saint at all but dear god why is Devon so insufferable. The ultimate victim mentality. I get she's mad and has trauma but dear lord above.\n\nAnd honestly I don't see how Peter is a monster either. The ending seems like Devon and Michaela are calling him one. But like what did he do that's monstrous? Sure he lied about going to see his son and grandchild, not exactly a terrible thing and completely understandable. Yes he kissed Simone and it wasn't right but neither pursued it after until Michaela fired her. And Michaela then fires her knowing what the job means to her and lies about it because she wants to get the upper hand on Peter or to keep her marriage that isn't exactly working anyway cause neither are very happy (wasn't very clear to me). Like no one in this situation is really a monster or all that terrible. Honestly the worst people to me are Devon and Ethan. Devon for all the reasons above and Ethan cause man over stepped his bounds  and didn't respect her privacy then acted like a man child and wouldn't take no for an answer at first then was being a jerk.\n\nEnd of rant.",
        "upvotes": 49,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1kvp1e4/sirens/"
    },
    {
        "id": "1kw7ja7",
        "author": "ZinChao",
        "title": "Recommend me a show based in my interest [Action, Thriller, Comedy]",
        "content": "For more context, my favorite shows that I’ve ever watched are the following: Blacklist, The Office, Dark, Black Mirror, Love Death &amp; Robots, Narcos, Ozark (up until S2), One Body Problem",
        "upvotes": 1,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kw7ja7/recommend_me_a_show_based_in_my_interest_action/"
    }
]