[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p4l0s5",
        "author": "hard2resist",
        "title": "What Netflix show kept you up all night binge-watching recently?",
        "content": "I just finished The Beast in Me in one sitting and realized I haven't had that \"just one more episode\" feeling in a while. Now I'm looking for my next obsession.\n\nWhat's the last Netflix show that had you completely hooked? The kind where you tell yourself you'll watch one episode and suddenly it's 3 AM.\n\nLooking for something that grabs you from episode one and doesn't let go.",
        "upvotes": 905,
        "comments": 704,
        "media": null,
        "permalink": "/r/netflix/comments/1p4l0s5/what_netflix_show_kept_you_up_all_night/"
    },
    {
        "id": "1p4wmz4",
        "author": "peacharooroo",
        "title": "What’s up with all the blue and brown in The Beast In Me",
        "content": "I’m curious what the purpose is behind the color scheme in The Beast In Me. All the characters wear shades of blue and brown through each episode, and all their eyes are bright blue. Beyond that, the houses, apartments and business offices all have blue and brown walls and accent pieces, even the outdoor Safari birthday party has decor and guests in those colors. There are also smaller accents of purples and greens. There’s enough to let me know it was more than intentional, it’s meant to be noticed. But why? ",
        "upvotes": 45,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p4wmz4/whats_up_with_all_the_blue_and_brown_in_the_beast/"
    },
    {
        "id": "1p586fm",
        "author": "MiddlePath2",
        "title": "Should I watch the series 'Supernatural'?",
        "content": "What are 3 episodes I can watch that will pull me into the show without revealing too much lore? \n\nLike filler episodes.\n\n(I want to see if its even going to pull me in before I start from episode 1 and get too invested into something I dont like) \n\nPreferably scary episodes.",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p586fm/should_i_watch_the_series_supernatural/"
    },
    {
        "id": "1p5bha6",
        "author": "radicalCartoonist",
        "title": "Need a way to permanently STOP Netflix from skipping intros and outros.",
        "content": "I'm a huge anime nerd and I just want to jam out to the intros and ending themes of every episode. I want to watch without having to always be diligent to manually make sure nothing's being skipped. I know I can turn off autoplay entirely which would fix the skipping but the point is to keep autoplay AND turn off skipping so I don't have to think about it.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p5bha6/need_a_way_to_permanently_stop_netflix_from/"
    },
    {
        "id": "1p5bv0e",
        "author": "Curious-Monitor497",
        "title": "Need recommendations for thrillers",
        "content": "Please recommend really good thriller shows/movies. Mainly short series, as I don't want to watch multiple seasons to get a conclusion. \n\nI recently watched the following:\nMindhunter (liked this, but 2 seasons of detectives working on sexual crimes was too disturbing)\nThe sinner (liked this)\nBodkin (liked this)\nUntamed (it was okay, not a fan)\nInside man (okay, not a fan)",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p5bv0e/need_recommendations_for_thrillers/"
    },
    {
        "id": "1p51bkj",
        "author": "Stretch1164",
        "title": "What to watch",
        "content": "I am home alone for several days, as my husband and kids are camping. I want to eat a gummy or two and laugh my butt off. What should I watch?\n\nMy brand of comedy is heavily influenced by British sitcoms, ie The IT Crowd, Keeping Up Appearances, and Are You Being Served. My favorite movie is Ghostbusters, and taboo jokes are completely on the table.",
        "upvotes": 8,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p51bkj/what_to_watch/"
    },
    {
        "id": "1p55n31",
        "author": "garrettj100",
        "title": "Whiskey from s1e5 of *The Beast In Me*",
        "content": "Matthew Rhys is waving the bottle around at the 6:39 mark while playing *Psycho Killer* on the record player.  The bottle appears to say CALLIS or CALLIE or perhaps DALLIS or BALLIS.  And there is a second (empty) bottle that Danes was drinking from at the end of s1e4.\n\nAre these real bottles or just TV props?  Anybody recognize either?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p55n31/whiskey_from_s1e5_of_the_beast_in_me/"
    },
    {
        "id": "1p57g32",
        "author": "Techiesarethebomb",
        "title": "Netflix Games Doesn't Work for New Samsung TVs?",
        "content": "So I have a 2023 Samsung QLED TV and I tried to access the netflix games selection (tetris, boggle, pictionary, lego party) and I noticed when I clicked on it I got the \"play on select TVs only\" response...but when I go to the FAQ my TV clearly looks like one of the eligible smart TVs to use it. It's fully updated and I am just confused why my TV can't access it. Has anyone else had this problem?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p57g32/netflix_games_doesnt_work_for_new_samsung_tvs/"
    },
    {
        "id": "1p5280z",
        "author": "joe_m___",
        "title": "I just found out that netflix hides seasons or shows depending on profile language",
        "content": "I live in sweden so the standard language for my profile was swedish. Now when the language is set to swedish for example scissor seven has 4 season but when i changed it to english it got 5 seasons. Now this is only when i changed the setting for a profile and not the full account.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p5280z/i_just_found_out_that_netflix_hides_seasons_or/"
    },
    {
        "id": "1p5cd7e",
        "author": "AssociateLittle1487",
        "title": "Did Squid Game deserve the reviews it got?",
        "content": "I can’t provide any pictures so I’ll list the Rotten Tomatoes scores below: \nCritics: S1 95%, S2 84%, S3 78% OVERALL? 85%! \nAudience: S1 85%, S2 64%, S3 51% OVERALL? 67%!\n\nIMO? Critics: S1 is excellent. S2 is fine, maybe 5-10% too much. S3 is way too overrated, should be 60% or less. Audience: S1 and S2 should absolutely be 5-10% higher. S3 is very much deserved.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p5cd7e/did_squid_game_deserve_the_reviews_it_got/"
    },
    {
        "id": "1p562in",
        "author": "wilcojunkie",
        "title": "Netflix Fire TV app issue - content immediately starts",
        "content": "I feel like this is a bit of a Boomer app tech question but, here goes. I use the Netflix app for my smart TV. I haven't used it in a while but, when I go to click a movie or show instead of a landing page appearing where you can see the info, add it to your watchlist etc, the content immediately starts. So I can't figure out if this is a settings issue or what. No clue. Anyone have any idea on what to do or have encountered this issue before? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p562in/netflix_fire_tv_app_issue_content_immediately/"
    },
    {
        "id": "1p5c034",
        "author": "Lazii_Xy",
        "title": "HOW DO I TURN OFF THE BETA SEARCH",
        "content": "This is gonna send me into some weird frenzy. I literally cannot escape the Beta AI search after accidentally somehow turning it on and it's driving me nuts. Someone please tell me how to get rid of it cause there's NO option up to opt out on my screen.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5c034/how_do_i_turn_off_the_beta_search/"
    },
    {
        "id": "1p5brot",
        "author": "Live_Sort5110",
        "title": "The Beast In Me",
        "content": "Hi Netflix, just finished watching the show and it was so good. Maybe the end was tad bit predictable but it had me on my edge throughout the episodes.\nHowever, please correct “Karma” is a concept from Hinduism. It mentioned Buddhism in the last episode. \nKindly, research better next time ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p5brot/the_beast_in_me/"
    },
    {
        "id": "1p561nw",
        "author": "Doctor-Wayne",
        "title": "Speculative Fiction recommendations",
        "content": "I'm looking for Speculative Fiction recommendations, whether scifi, cosmic horror, philosophy, thriller or whatever. Preferably movies but series are fine. Some people i know are almost immune to mentally engaging with hypothetical scenarios and I'd like to see if I'm able remedy this buy consuming media with them and trying to have a chat. Extra points if on Australian netflix ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p561nw/speculative_fiction_recommendations/"
    },
    {
        "id": "1p53bcr",
        "author": "Midasisgolden",
        "title": "What Did You Think Of “From Scratch”?",
        "content": "I think it’s one of the best romantic dramas I’ve watched in a very long time. The writing, the chemistry between the actors, the ACTING, the storyline and the ending 🤌\nI cried so many different tears, especially the last few episodes 😭 \nI wasn’t even really paying attention until the scene where Amy drew a heart on Lino’s knee, writing “Amo”. \n\nMy poor heart strings 😭😭",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p53bcr/what_did_you_think_of_from_scratch/"
    },
    {
        "id": "1p4qraj",
        "author": "photoshop_2023",
        "title": "Would you recommend watching Absentia?",
        "content": "Would you recommend watching Absentia? I just saw this series on Netflix and was wondering if you have watched it? \n\nWould you recommend it to someone?",
        "upvotes": 9,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p4qraj/would_you_recommend_watching_absentia/"
    },
    {
        "id": "1p4wnkx",
        "author": "NarrowChair4783",
        "title": "Suggest me a romantic movie in which extroverted girl meets an introverted boy",
        "content": "Shuggest me something like perks of being a wallflower a high school or teen love story with a love story that starts with friendship,a slow burn love story. ",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p4wnkx/suggest_me_a_romantic_movie_in_which_extroverted/"
    },
    {
        "id": "1p56izg",
        "author": "noodle_boi22",
        "title": "is supernatural still available in the us?",
        "content": "i checked less than 2 weeks ago and it was still available, but today it’s not showing up for me. i’m aware it was scheduled to be removed on december 17th, but this is way too early, plus the netflix website and rest of the internet still said it’s available when i looked it up. just wanna check if it’s something on my end (netflix keeps crashing &amp; acting up), ty!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p56izg/is_supernatural_still_available_in_the_us/"
    },
    {
        "id": "1p55091",
        "author": "ShopLongjumping9285",
        "title": "New Stranger Things Care Bears Spotted Early In-Store!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p55091/new_stranger_things_care_bears_spotted_early/"
    },
    {
        "id": "1p4r2w9",
        "author": "Uenoyama_Ritsuka_",
        "title": "Can anyone recommend me something mainstream similar to 13 Reasons Why?",
        "content": "God, I loved this series so much! All the seasons were good and obv I cried at the ending scene. \n\nCan you guys recommend me something similar to 13 reasons why, Class (Indian one), Love Simon, etc. basically any Slice-of-Life/Drama/High-school series where each episode ends with a twist or cliffhanger. \n\nI am planning to watch Elite. ",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p4r2w9/can_anyone_recommend_me_something_mainstream/"
    },
    {
        "id": "1p4pttl",
        "author": "niseynisey",
        "title": "Had fun at Netflix House Philly",
        "content": "Had a fun time at the Netflix house. Here are my opinions:\n\nAs soon as you walked in, the host invited you to a movie screening and it was completely free. Not sure if that was only because we went on a Saturday. Their theater is a gorgeous Netflix red color and the fabric seats are very comfortable with plenty of room. The seats do not recline. \n\nThe host will also give you a rundown of everything available &amp; answer any questions you have. There was definitely no shortage of staff wherever you went and everyone was so pleasant. They also had security guards on duty in high traffic areas. \n\nTons of selfie/picture opportunities available in the general admission areas. You’ll find yourself dodging photobombing people left &amp; right during the busy times.  My favorite section was definitely the Bridgerton display; was gorgeous! \n\nThe gift shop was also in the general area &amp; extensive! They had so many unique things available for purchase, so if unique Netflix related swag is your thing, you’ll like their shop. \n\nI didn’t try their restaurant in the general area, but a full restaurant is available to purchase sit down meals. \n\nPaid features:\n\nMini golf - we didn’t do the Netflix show-themed mini golf so I can’t give my opinion on this experience. \n\nPuzzle experience - the Philly location currently has The One Piece puzzle. It was so much fun. I recommend it for teens &amp; older fans as you have to figure out clues to proceed in the game. You also have to participate in slightly physical games and you have to work together as a team. You do not have to be a fan of One Piece to enjoy the game, but fans appreciated all the detail even more than the average attendee. They estimate a 45minute completion of the game, but my team only took 30 minutes; I guess we’re a smart bunch. That leads me to say, if you’re anti-social, avoid at all costs. Each game needs 12 players for very specific reasons. Unless you bring 11 people with you, you WILL be grouped with people you do not know. Please don’t be that person that ruins the fun for everyone. \n\nArcade experience - The Philly location has Wednesday as its gaming adventure. I assumed Wednesday would be a puzzle just like One Piece as it was the same price, but it was not a puzzle experience. This adventure is for sure for all ages but younger kids &amp; teens that are fans of Wednesday Adam’s will have the best time. The main area is an arcade themed around the Adam’s family. The rest are gorgeous photo opportunities. If you are not a fan of Wednesday, I wouldn’t suggest this experience. This area’s attention to detail was far beyond my expectation and it was amazing being able to take photos in live scenes from the show. There is a small puzzle aspect to this area, if you can find it ;). Definitely keep your eye out for posters telling you about the puzzle. I’m still a bit confused why this experience is timed. You basically enter &amp; can do whatever you want. My only thought is that it’s to keep it from getting too crowded at one time. I did enjoy this experience but did not feel it was worth the hefty price tag. \n\nVR experience - The VR game was by far my favorite part of the Netflix house and well worth the money. We did the 45 minute Stranger Things VR and maaan, that thing was tons of fun. It’s a physical experience &amp; lots of movement is involved. You’ll be grouped as 6 people per experience &amp; the hosts give you a thorough walk through on how to setup your gear. When purchasing, you can choose 25 minutes of 45 minutes. Afterwards you’ll be able to sit and watch snippets from your experience that the team records and edits. You’ll also be given access to your recorded session afterwards. You can either wait for them to email you a copy of the video, or you can scan the host’s QR code &amp; download it immediately. \n\nAll in all, it was a fun experience. The biggest stand out was the staff. I don’t know what they’re feeding those people in the cafeteria but everyone “drank the koolaid” and was 100% dedicated to their characters. \n\nEven if you just want to stop by and check out only the free stuff, as a fan of the bigger Netflix shows, you’ll find something for you to enjoy. If you pay for anything, do the VR. It is the best bang for your buck as it’s a lower price than One Piece &amp; Wednesday. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p4pttl/had_fun_at_netflix_house_philly/"
    },
    {
        "id": "1p4vgd2",
        "author": "pjand08",
        "title": "Suggest me some good romantic movies from Netflix",
        "content": "Suggest me some good romantic movies like Jerry Maguire , how to lose a guy in 10 days or something in teen movie like fault in our stars,5 feet apart or 10 things I hate about you.",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p4vgd2/suggest_me_some_good_romantic_movies_from_netflix/"
    },
    {
        "id": "1p4uxwa",
        "author": "wellsortakindah",
        "title": "Need shows to binge as an artist",
        "content": "Title 😭 as an artist, I get so fricken bored doing my work like I love what I do but I work 10 times better when Im watching something,  its gotten to the point where work has piled up and Id love anything to watch while I work and even do chores, i have youtube premium but even its not enough\n\nPersonally I dont like super gorey shows? Case be case though for example I couldn't finish the first episode of Homelander, just not for me, but I did like Wednesday (dont judge me it was immersive!!) For example.\n\nAlso personal preference nothing too old\n\nI like fantasy/fun storylines/romance/anything thats immersive really just no gore or horror\n\n(Since im not American or in the west, I also haven't watched most western classics like hunger games, star wars or game of thrones feel free to recommend those too)\n\nIm sorry if this is incoherent im not exactly sure what to say ",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p4uxwa/need_shows_to_binge_as_an_artist/"
    },
    {
        "id": "1p4tyu4",
        "author": "InitialFan8",
        "title": "A Merry Little Ex-Mas odd choices",
        "content": "What is with the main character being named “Kate Holden” which sounds very similar to Kate Hudson, which is Oliver Hudson’s (Everett) sister IRL?? Eww",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p4tyu4/a_merry_little_exmas_odd_choices/"
    },
    {
        "id": "1p5083j",
        "author": "AcanthocephalaNo8810",
        "title": "Stranger Things Predictions",
        "content": "Winner takes it all! I made this form to track prediction. I’ll change it to a quiz once the final episode comes out and we’ll see who got the most right!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5083j/stranger_things_predictions/"
    },
    {
        "id": "1p506am",
        "author": "Comfortable-Carpet28",
        "title": "Can anyone recommend a show like Shadow and Bone on Netflix Pleasee?",
        "content": "Maybe with a relationships sort of similar to Kaz and Inej, but preferably they actually end up together? Also hopefully one that wasn’t cancelled on the first season like all the ones I’ve been watching recently. Thank youu!!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p506am/can_anyone_recommend_a_show_like_shadow_and_bone/"
    },
    {
        "id": "1p4z8u9",
        "author": "pemunoz93",
        "title": "Travel/multiple locations",
        "content": "I travel most weekends for work and leave my teens at home. Is it possible for me to log into my account and watch while I stay out of town and also allow my kids to use the account at home? If I say that I’m traveling, would this make my account inaccessible at the house?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p4z8u9/travelmultiple_locations/"
    },
    {
        "id": "1p549uh",
        "author": "NiffleWhit900",
        "title": "Tf is going on with Netflix interface?",
        "content": "I have a Sony Bravia smart TV and just got Netflix again after a hiatus. There's no add to library button or more details available on the main interface. I literally have to start a show to access those buttons at the bottom of the screen. It doesn't matter if I double click enter, press play, press and hold, try the cog icon on my remote, etc etc. I have to start a show to add to my list.\nAnyone else having this problem? Am I insane? What's going on?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p549uh/tf_is_going_on_with_netflix_interface/"
    }
]