[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hz3l5s",
        "author": "AgreeableOnion1453",
        "title": "KAOS was one the best, most creative shows of the decade",
        "content": "Just finished a second watch. It’s absolutely unbelievable that Netflix canceled it, and a testament to how empty and soulless their programming has become. It was funny, smart, visually beautiful, genuinely unique, and the next season would have been incredible! Huge thumbs down to Netflix. Enough empty reality shows and cheap crap. ",
        "upvotes": 136,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1hz3l5s/kaos_was_one_the_best_most_creative_shows_of_the/"
    },
    {
        "id": "1hz77fh",
        "author": "Tomilesean",
        "title": "Why is to skip intro so high up?",
        "content": "",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hz77fh/why_is_to_skip_intro_so_high_up/"
    },
    {
        "id": "1hyo1pm",
        "author": "SnooCauliflowers4833",
        "title": "What makes Squid Game more popular compared to Alice in Borderland when most people seem to say the latter is a way better death game show?",
        "content": "\nI’ve read a lot of reviews on both series and people keep comparing those two. I know one is way more popular than the other but people seem to agree that AiB has way more deadly and better quality games overall?, which made me curious about what made the series less popular then. \n\nIs this just for a marketing? What made the difference?",
        "upvotes": 191,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1hyo1pm/what_makes_squid_game_more_popular_compared_to/"
    },
    {
        "id": "1hzbc0z",
        "author": "Late-Rule-752",
        "title": "down?",
        "content": "is it down i saw my pfp go from silco arcane to a orange little character and i didn’t change it and avatar the last Airbender  isn’t showing up anywhere ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hzbc0z/down/"
    },
    {
        "id": "1hyalkj",
        "author": "Sudden_Pop_2279",
        "title": "'Squid Game' Season 2 Becomes Netflix's 2nd Most Popular Non-English Show Ever With 126 Million Views",
        "content": "",
        "upvotes": 1125,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1hyalkj/squid_game_season_2_becomes_netflixs_2nd_most/"
    },
    {
        "id": "1hz637j",
        "author": "MyEgoDiesAtTheEnd",
        "title": "Rhythm and Flow, Season 2... Rigged or just a Joke? ",
        "content": "Sura Ali shocked everyone by saying it was rigged when she lost and walked off stage. At the time, I thought that was mad disrespect. Then my girl and I were wondering why the last 2 were the obvious worst (DreTL) and the obvious best (Jay Taj). Ain't no drama in that!\n\nThen BOOM! the decision that shocked the Internet and turned the show into a freakin joke. \n\nHas Luda said anything about this? Man, I like his positivity, but this season just killed the legitimacy of the series and also of the judges' abilities to understand music and stardom. Jay was amazing (\"perfect!\" they said) throughout and DreTL....well, nice kid, but I dunno how he made it past the first round. \n\nI know Jay will make it big; hopefully he doesn't need the money to kick it off. And I also know DreTL will never be heard from again (sorry buddy). \n\nAnd lastly, I know we won't be watching this show again. No Season 3!. What a joke! ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hz637j/rhythm_and_flow_season_2_rigged_or_just_a_joke/"
    },
    {
        "id": "1hzbkrf",
        "author": "Silnetman",
        "title": "Was You removed from the US servers?",
        "content": "Started watching You just yesterday, and suddenly I couldn’t see it on my TV and only allowed me to see news of the new season.\n\nI had the last episode I was watching open on my laptop, so I reloaded the page and it said it was no longer available in my country.\n\nAnyone else have this issue or just me?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hzbkrf/was_you_removed_from_the_us_servers/"
    },
    {
        "id": "1hyum6b",
        "author": "limsus",
        "title": "Looking for the Best Murder Mystery Movies (No Web Series, Please!) ",
        "content": "Hey everyone! \n\nI'm looking for some great murder mystery movies to watch. I’m not interested in web series, just standalone films. Any recommendations for suspenseful, well-crafted mysteries would be greatly appreciated. Thanks in advance! ",
        "upvotes": 19,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1hyum6b/looking_for_the_best_murder_mystery_movies_no_web/"
    },
    {
        "id": "1hydunw",
        "author": "UnRegularConfidence3",
        "title": "Who TF greenlit all these shitty Harlan Corban series???",
        "content": "Rant coming.. I have not made it through 1 episode on any of them.  The main character is always so infuriatingly stupid it makes my want to punch a hole in my TV.  This last one, a detective inspector blags her way into prison to question the cold blooded assassin that murdered her father. She proceeds to cry and beg him to tell her why sir, why'd you kill my daddy??, which unsurprisingly doesn't work. Then the nurse drugs him, tells her she only has a few minutes to get the truth out of him.  He reveals he was paid to take the fall for the murder, and she decides to argue with him. But you confessed! They found the weapon on you! I am guessing a DI doesn't know what paid to take the fall means?  Only after a few minutes does she finally ask \"who paid you?\" Of course too late, he has passed out. Then she crys more.  Christ on a cracker, are the books this stupid too? How does this guy have a career.  ",
        "upvotes": 275,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1hydunw/who_tf_greenlit_all_these_shitty_harlan_corban/"
    },
    {
        "id": "1hyzll0",
        "author": "No_Tomorrow3907",
        "title": "4k option ",
        "content": "So I just got a 4K TV and when I opened Netflix it came with a popup about streaming with 4k or 1080p but my partner accidentally clicked on 1080p but now I can’t find this popup anywhere now, can someone help me figure out how to stream in 4K? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyzll0/4k_option/"
    },
    {
        "id": "1hz6th6",
        "author": "nicklz",
        "title": "The Mystery of Kilgore | Season 1 Trailer [SD] | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hz6th6/the_mystery_of_kilgore_season_1_trailer_sd_netflix/"
    },
    {
        "id": "1hz6bb9",
        "author": "ThatOculusKid",
        "title": "Can someone help me with this issue?",
        "content": "The movie is avaliable to watch but I can't watch it due to a glitch.",
        "upvotes": 0,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ee21lorwmfce1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hz6bb9/can_someone_help_me_with_this_issue/"
    },
    {
        "id": "1hyk9jb",
        "author": "JOMO_Kenyatta",
        "title": "So the Netflix top 10 is the current most popular films on the site, right?",
        "content": "I’m watching rush hour and it says it’s too 10? Is this global or just us statistics and is this a current measurement? It’s weird but kinda like the idea that the entire world is re enjoying this movie. But I just wanted to get some details",
        "upvotes": 37,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hyk9jb/so_the_netflix_top_10_is_the_current_most_popular/"
    },
    {
        "id": "1hz2ye1",
        "author": "kohan678",
        "title": "Video not playing.",
        "content": "Whenever I go to watch anything on Netflix, the audio, subtitles, and even the preview works but the video never plays. I've googled and tried everything but nothing has worked. (It's mobile if that helps)\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hz2ye1/video_not_playing/"
    },
    {
        "id": "1hz7i3i",
        "author": "Ok_Bag_3020",
        "title": "You need to watch this.",
        "content": "For all the fans of romance and thriller,you guys need to watch “fake profile”.It’s so underrated. I have to admit that the first couple of episodes and some things seems banal and stupid with stereotypes,but you need to reach the half of season 1. I bing watched season 2 in one day. It’s so good,full of mystery,sexy and bloody.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hz7i3i/you_need_to_watch_this/"
    },
    {
        "id": "1hz14rc",
        "author": "doggydawg1980",
        "title": "Voice over change ",
        "content": "Is there any way to change the voice over to the original version?  Watching Netflix with a different voice is so weird.  How can you change this.  This is so frustrating and weird to watch a show",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hz14rc/voice_over_change/"
    },
    {
        "id": "1hz0s21",
        "author": "cinnamonpit",
        "title": "Help with profile sound while watching movies",
        "content": "Hello everyone. I desperately need help with an issue for which I can't find any solution online. Sometimes when I'm watching a movie in Netflix a sound (the same sound when selecting a profile) randomly appears in the middle of the movie. I updated the Netflix app and reset all audio settings but the sound just reappeard now and it absolutely drives me crazy. My TV is a SAMSUNG QE55Q60CAUXXN. Thank you so much for advice and sorry because I'm not a native English speaker.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hz0s21/help_with_profile_sound_while_watching_movies/"
    },
    {
        "id": "1hzaoe7",
        "author": "betterdazeoneday",
        "title": "Opinions on peaky blinders?",
        "content": "I have no idea what it is about, but I had a friend suggest it to me. Ive seen some stills from the series. Looks interesting. \nShould i watch it and how would you rate it?\n\nIn addition, does anyone have any recommendations somewhat historically accurate series on any streaming platforms at the moment?\n\nI have trouble getting into the modern style of many netflix shows, overly produced, too cinematic , relies on shock value.\n(Unless it depicts something from history. Im a history nerd.)\n\nI saw Nosferatu in theaters recently. Hopefully not entirely nontopical to this sub considering it is a movie. But i would suggest seeing that in theatres for anyone that also likes a more “retro” or realistically flawed style of filmmaking",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hzaoe7/opinions_on_peaky_blinders/"
    },
    {
        "id": "1hyl5jb",
        "author": "evaintheus",
        "title": "The Breakthrough",
        "content": "I binged this show based on a true story in one sitting today. What do you guys think? I loved it! Believable characters, great actors! \n\nFrom Netflix:\n\nBased on a true story, the crime drama series The Breakthrough follows the second-largest criminal investigation in Swedish history. In the early 2000s, the small city of Linköping was rocked by a double homicide in broad daylight. Two people — a child and a woman in her late 50s — were stabbed to death. But with no motive or suspect, the case eventually grew cold. Nearly two decades later, the police made headway after a genealogist entered the fray.  Starring Peter Eggers and Mattias Nordkvist, the series was directed by Lisa Siwe (The Bridge) and written by Oskar Söderlund (Snabba Cash). “Though this is a fictional drama series about a crime, it is, above all, a depiction of a human tragedy — where we place our focus on the victims and the investigation rather than the perpetrator,” Siwe told Netflix. “It’s a story about the compassion and care for one another that is needed to move on when terrible things happen.”",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hyl5jb/the_breakthrough/"
    },
    {
        "id": "1hyzal7",
        "author": "tavakym",
        "title": "Name of opening song from Legends of Fluffy special ",
        "content": "Hi folks, the opening song from Gabriel Iglesias’ Legends of Fluffy special, is that a real thing? \nSounded great and I was hoping to learn what it’s called.\n\nEdit: found it! Trendsetter - Connor Price\n\nThank you",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hyzal7/name_of_opening_song_from_legends_of_fluffy/"
    },
    {
        "id": "1hywwqv",
        "author": "RealCanadianDragon",
        "title": "Keep profile logged in on specific devices",
        "content": "Is there a way to keep a profile automatically logged in on Netflix or do I have to manually select it every time I open the app?\n\nFor instance, I'm only using my profile on my devices, but can I just keep it auto logged in on that profile, and the person using the other profile automatically has it logged in on their profile instead of us having to open the app and select our specific name/profile each time?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hywwqv/keep_profile_logged_in_on_specific_devices/"
    },
    {
        "id": "1hz37ex",
        "author": "potato31031",
        "title": "Sonic x gone from netflix",
        "content": "I have been rewatching sonic x lately, and I just went on Netflix and it's gone. It's annoying that my progress is gone. I wasn't far in rewatching it luckily. But really annoying. Why do you think it would be removed when sonic prime is a Netflix exclusive. Couldn't have been a 4kids dispute because the English dub would be gone but not the Japanese.\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hz37ex/sonic_x_gone_from_netflix/"
    },
    {
        "id": "1hz4t8x",
        "author": "brynte5",
        "title": "Too old for netflix...",
        "content": "I have an ipad air 2.  \nThe latest ios version is 15.8 (or very close to that).  \nI wanna download a netflix show, to watch offline.  \nIt says my ios is too old.  \nAre there any solutions for this problem (except buying a new ipad)?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hz4t8x/too_old_for_netflix/"
    },
    {
        "id": "1hz2nym",
        "author": "enseven94",
        "title": "Rec for medical drama",
        "content": "Can you please recommend be medical dramas to watch on Netflix? That's worth watching?\nI tried to navigate on my one but I get overwhelmed and couldn't decide one",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hz2nym/rec_for_medical_drama/"
    },
    {
        "id": "1hxziv7",
        "author": "tatarigoroshi",
        "title": "Netflix says I'm not part of the household when I'm inside my house",
        "content": "How do they decide what is and isn't part of the household?? No, I am not travelling. Don't give me a code to log in for a limited time period .... how can I fix this? \n\nWhen I google this issue I only find netflix's page saying if my device is not associated with the household, I need to create my own plan. But I live with my family in my parent's house who are paying for netflix. No one else has this problem, all TVs, laptops, ipads work for them. This is really frustrating. ",
        "upvotes": 166,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1hxziv7/netflix_says_im_not_part_of_the_household_when_im/"
    },
    {
        "id": "1hyh9ll",
        "author": "CaligulaQC",
        "title": "How many good seasons can I expect out of Parenthood?",
        "content": "Watching the 3rd episode now, I love it. It’s funny and I can relate. \nI just hope its doesn’t turned into a snooze fest after a season or something. \n\nNetflix gave me trust issues. ",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hyh9ll/how_many_good_seasons_can_i_expect_out_of/"
    },
    {
        "id": "1hyrtp2",
        "author": "mattxhewww",
        "title": "Please help me with some recommendations",
        "content": "The shows I've been really into are\n\n\\- salvation\n\n\\- suits\n\n\\- the night agent\n\n\\- designated survivor \n\nAny recommendations will be awesome thank you!!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hyrtp2/please_help_me_with_some_recommendations/"
    },
    {
        "id": "1hz9qar",
        "author": "Glittering_Land6067",
        "title": "Primeval looks too much like a Revenant knock off. ",
        "content": "I have yet to watch the series but just after first glance, the male character looks exactly like Tom Hardy in the Revenant with his head band. Secondly, I noticed a winter fight scene down by a stream tucked in the mountains (final scene of the revenant).\n\nIs it just me or is there a pattern of shows coming out following and pulling from a more successful title of the same niche??? Lastly, after Yellowstone, many westerners seemed to come out as well. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hz9qar/primeval_looks_too_much_like_a_revenant_knock_off/"
    },
    {
        "id": "1hyznwo",
        "author": "Horror_Effective12",
        "title": "American Primeval Review - Does the show fulfil its potential?",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hyznwo/american_primeval_review_does_the_show_fulfil_its/"
    },
    {
        "id": "1hykwh2",
        "author": "Ok_Slide_1973",
        "title": "War horror film recommendations?",
        "content": "I just want to see any horror war film on Netflix if there is any to watch and I want movies like hosts of war or nazi zombies so I you could tell me one I would appreciate it",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hykwh2/war_horror_film_recommendations/"
    }
]