[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 42,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hgbyi3",
        "author": "LosFrikis",
        "title": "Hey /r/movies! We’re Tyler Nilson and Michael Schwartz, writers/directors of LOS FRIKIS and PEANUT BUTTER FALCON! LOS FRIKIS is out 12/20 in LA+NY and 12/25 in other cities. Ask us anything!\n",
        "content": "",
        "upvotes": 39,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lnz131ri6f7e1.jpeg?auto=webp&amp;s=541a37cc1e59700c3a5f184c5086fd7ec0c3ac6e"
        },
        "permalink": "/r/movies/comments/1hgbyi3/hey_rmovies_were_tyler_nilson_and_michael/"
    },
    {
        "id": "1hnpft7",
        "author": "sdfddfdaa",
        "title": "I need film to make a grown man cry.",
        "content": "Ok so... I (17) made a bet with my dad (old) to make him cry within 3 movies. It all started when I showed him and my mom a movie that came out a while ago, Look Back. Both my mom and I cried over it, but he didn't shed a tear, which got me thinking... I don't think I've seen him cry during a movie like EVER... Don't get me wrong he still liked the movie and said it DID \"move him\", I just need something to push him over the edge of tears, yk? What he told me It's apparently honest stories about strong friendships or true love that make him cry, also nothing like purposeful tearjerker (ex: Titanic). Any recommendations? He doesn't discriminate, so can be pretty much anything.\n\nBtw he cried over Futurama, to be exact the part where Leela and Fry read their future together, but that's like the only example I have...",
        "upvotes": 1947,
        "comments": 5012,
        "media": null,
        "permalink": "/r/movies/comments/1hnpft7/i_need_film_to_make_a_grown_man_cry/"
    },
    {
        "id": "1hnjcbd",
        "author": "MarvelsGrantMan136",
        "title": "‘The Batman’ Sequel Heads To October 2027, Tom Cruise &amp; Alejandro G. Iñárritu Pic Sets 2026 Release, ‘Sinners’ &amp; ‘Mickey 17’ Switch Places",
        "content": "",
        "upvotes": 4006,
        "comments": 799,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZUEr7LCTsjqRE9t1mEAtttbdlUJQQfrPE43jlBSdSKY.jpg?auto=webp&amp;s=af219878f8a0cea9e7f412f208172c6927e1dc7a"
        },
        "permalink": "/r/movies/comments/1hnjcbd/the_batman_sequel_heads_to_october_2027_tom/"
    },
    {
        "id": "1hnpvcg",
        "author": "Gato1980",
        "title": "Netflix’s ‘Chronicles of Narnia’ Adaptation from Greta Gerwig Targeting December 2026 Release",
        "content": "",
        "upvotes": 1177,
        "comments": 228,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rnATP0wW0mExG7OhsO4hMKdghv8NWtUQKq_REYkhJc8.jpg?auto=webp&amp;s=468f23d55a1f11bfd2e0ec2a2863ca660ea82d0f"
        },
        "permalink": "/r/movies/comments/1hnpvcg/netflixs_chronicles_of_narnia_adaptation_from/"
    },
    {
        "id": "1hnqmbl",
        "author": "Wheres_MyMoney",
        "title": "So many erotic thriller from the past decade seem to be afraid to be erotic or thrilling",
        "content": "In the days of Yore, before internet porn and Instagram thots, the erotic thriller held a special place in American pop culture. \n\nMovies like Basic Instinct or Fatal Attraction in the 80's, Wild Things or Poison Ivy in the 90's pushed boundaries and tantalized viewers. They were scandalous enough that you might be quiet about watching them in the theater, but not graphic enough to be in \"that section\" at your local video rental store.\n\nHowever, I feel like these movies are all but long gone both in terms of the number they are produced in and in what they portray on screen.\n\nFor example, Babygirl released this week. I won't give any spoilers, but a lot of the reviews and comments seem to be on how for as much sex as is in the movie, it isn't really erotic. Nor is the \"mystery\" aspect all that thrilling.\n\nSimilarly, Miller's Girl released earlier this year with Jenna Ortega at the height of her fame and the story being about her sexual relationship with her professor. Yet it was so bland, seemingly afraid to \"go there\".\n\nA few years ago, The Voyeurs came out with Sydney Sweeny fresh off her Euphoria season. There was sex. There was murder. There were plot twists. There was revenge. Most of all, it was meh. \n\nI am curious, why is this (if you even agree with the premise)? Is it because graphic material is so readily available? Has society become more sex-averse? Is it something else?",
        "upvotes": 281,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1hnqmbl/so_many_erotic_thriller_from_the_past_decade_seem/"
    },
    {
        "id": "1hn42jc",
        "author": "thermal7",
        "title": "How did Tommy Wiseau come up with $6 million dollars for his film 'The Room'?",
        "content": "So I recently read the book 'The Disaster Artist' (fantastic, hilarious read), and learned that Tommy Wiseau spent about $6 million (equivalent to about $10 million in 2024) to create his movie 'The Room'. \n\nThere seems to be some ambiguity on how Mr. Wiseau came up with the money, so I'm wondering if the knowledgable people on this forum might have some insights. \n\nThank you",
        "upvotes": 5280,
        "comments": 658,
        "media": null,
        "permalink": "/r/movies/comments/1hn42jc/how_did_tommy_wiseau_come_up_with_6_million/"
    },
    {
        "id": "1hnnav8",
        "author": "Davis_Crawfish",
        "title": "\"Dead Calm\" (1989): A pulsating, nerve-wrecking thriller about a couple separated from each other in the wide Pacific ocean, struggling to survive.",
        "content": "I love this movie. Sam Neil and Nicole Kidman play a married couple who've gone through the trauma of losing their child in an accident and are dealing with it by going on a vacation on their Ocean on the Pacific. Mid-travel, they find an abandoned boat with one survivor who rows himself to their Yach for help, but when the husband decides to go to the stranger's sinking schooner to see what is in there, he's confronted with a horrifying, shocking truth, which causes the separation of the couple and puts their lives in danger. \n\n\"Dead Calm\" was a disturbing, tense and suspenseful film. Both leads experience a different kind of danger, the husband is trapped on a sinking boat that is quickly submering, leaving him into MacGyver move, whereas the wife is trapped in the Yacht with a psycho and she's forced to do everything she can to stay alive. As the movie progresses, the film becomes more about the wife and Kidman manages to dominate the movie as her character, Rae, finds her inner strength, while Billy Zane's Hughie, exudes danger and menace but at the same time, sex-appeal. You can see that he's a time bomb, seemingly nice and hot but whose temper becomes increasingly psychotic as he reaches his unhinged limit (which isn't hard to do so). \n\nI must say I had no idea Kidman was 20/21 in this movie. She looks pretty mature for her role and she is very headstrong  halfway through it. You could tell she was about to be big.",
        "upvotes": 160,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1hnnav8/dead_calm_1989_a_pulsating_nervewrecking_thriller/"
    },
    {
        "id": "1hnkfs8",
        "author": "indiewire",
        "title": "Denis Villeneuve Interview: Director on His Career, Indies, and Dune",
        "content": "",
        "upvotes": 194,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/igovn4aCnM47vGaPezp7Y8bhjo3ZnE2TrG6ZcoCWj5s.jpg?auto=webp&amp;s=94edb992ce5dfa14f59f5a1dcd5dc19a73ea330f"
        },
        "permalink": "/r/movies/comments/1hnkfs8/denis_villeneuve_interview_director_on_his_career/"
    },
    {
        "id": "1hnelds",
        "author": "AporiaParadox",
        "title": "Hollywood executive decisions that baffle you",
        "content": "Although most of the time Hollywood executives make reasonable decisions, most of which we never know about and we never really give them credit for, they often also do things that we consider to be quite dumb. Sometimes those decisions actually paid off in the end (like the Hobbit being split into 3 movies which ended up being huge box office hits despite their questionable quality) and other times there is at least something resembling an argument for why the decision was made even though many would disagree with it (like WB canning Batgirl and Coyote vs. Acme as a tax write-off, or 20th Century Fox allowing George Lucas to have the Star Wars merchandising rights because at the time merchandising for movies wasn't seen as profitable).\n\nBut sometimes they make decisions so stupid and baffling that you wonder how the hell these people still have jobs. Like why the hell did Sony keep doubling down on their Spider-Man without Spider-Man movie franchise? Venom was a hit, but Venom is Venom, an already popular character. Nobody but big comic book fans or people who watched certain Spider-Man cartoon were aware of who Morbius, Madame Web, or Kraven were. You'd think that the failure of Morbius would have made them reconsider, but nope they instead doubled down by releasing Madame Web and Kraven in the same year, and they flopped just like everyone predicted. The movies were just plain bad, the scripts were terrible, the acting was meme-worthy at best, they made movies about villains but instead turned them into anti-heroes that barely do anything villainous, there was no fun \"popcorn\" spectacle to at least keep audiences interested like with Venom, and the marketing didn't make anyone want to see the movie. Contrary to popular belief, they didn't need to make all of these movies to keep the Spider-man film rights, they did it only because they genuinely believed audiences would go see them. And they could have included Spider-Man in these movies if they'd wanted to, but they chose not to under the belief that it would confuse audiences.\n\nSo what other Hollywood executive decisions do you believe were genuinely stupid ideas?",
        "upvotes": 430,
        "comments": 1005,
        "media": null,
        "permalink": "/r/movies/comments/1hnelds/hollywood_executive_decisions_that_baffle_you/"
    },
    {
        "id": "1hnow27",
        "author": "KriibusLoL",
        "title": "Movie experience became so much better for me after I stopped looking things up on IMDB",
        "content": "For years I had this weird pre determined idea that a movie has to be better than 7.5/10 rating on IMDB for it to be atleast decent. I don't know why this was the case, but anything below that I usually didn't bother to watch. \n\nIn the last year I have been starting to slowly realise how bad of a metric that is. For example, Annihilation is 6.8/10 on IMDB and for years I put it off because of this exact stupid reason, it didn't met the quota of 7.5. After my friend nagged me multiple times to watch it, I finally gave in and oh my god that movie is amazing. There was particulary one scene that blew me away and immediately after watching the movie I started thinking of how many good movies I missed because of some stupid random metric I followed for years.\n\nSo my question is, are there any other movies that have under 7/10 rating on IMDB but are actually really good movies?",
        "upvotes": 98,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1hnow27/movie_experience_became_so_much_better_for_me/"
    },
    {
        "id": "1hnrw5x",
        "author": "basman11",
        "title": "Train to Busan is a brilliant movie. ",
        "content": "I am not a big fan of horror movies or zombie movies but I have been recommended to watch this movie by a lot of people. Finally watched it after being it on my watch list for years. \nI was so surprised by how crazy my experience was watching the movie. Cried like a baby towards the end for a good 5 minutes. Totally unexpected before deciding to watch a zombie movie. Loved the performances, especially of the small girl's and the making as well. \nWill explore more movies in this genre so please do recommend some! ",
        "upvotes": 54,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1hnrw5x/train_to_busan_is_a_brilliant_movie/"
    },
    {
        "id": "1hnrt9m",
        "author": "lawrencedun2002",
        "title": "The Most-Anticipated Movies of 2025",
        "content": "",
        "upvotes": 34,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FU_jIgfbflLliPUHmsmzb0W_TV6duNmemzFdwPdkgFg.jpg?auto=webp&amp;s=3708364764a32ad5f2db33784de5a88bef0c4e14"
        },
        "permalink": "/r/movies/comments/1hnrt9m/the_mostanticipated_movies_of_2025/"
    },
    {
        "id": "1hnsa6h",
        "author": "SanderSo47",
        "title": "Kevin Smith’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 31,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ApyheE3lunJFuOZYSG9V7ZeGMrfmpK8KqAU8RUmfLJg.jpg?auto=webp&amp;s=83a7edd413d8da8f8929652ebc5c4d089d838899"
        },
        "permalink": "/r/movies/comments/1hnsa6h/kevin_smiths_criterion_movie_closet_picks/"
    },
    {
        "id": "1hn50kf",
        "author": "Accomplished_Side853",
        "title": "You’re stuck on an island with the catalog of only one actor to watch. Who’s your pick?",
        "content": "Assume you have access to anything they’ve ever done. \n\nIf they were in that one episode of a show, it counts (but only that episode, not the whole series). \n\nIf they had a 10 second cameo in a movie, it counts. \n\nWho are you going with? I’m conflicted and see the merits of a few:\n\nTom Hanks for the depth and variety.\n\nDenzel because it’s Denzel.\n\nDicaprio has an incredible range of stuff to keep it interesting…",
        "upvotes": 846,
        "comments": 1926,
        "media": null,
        "permalink": "/r/movies/comments/1hn50kf/youre_stuck_on_an_island_with_the_catalog_of_only/"
    },
    {
        "id": "1hnjur1",
        "author": "I_Like_Metal_Music",
        "title": "What cinematography style is Poor Things (2023)?",
        "content": "I’m looking for movies have the same type of cinematography as Poor Things by Yorgos Lanthimos. Movies that are kind of surrealistic/gothic. I have a certain movie in the back of my mind that I’ve been trying to pinpoint that reminds me of this film but I just can’t quite grasp it. Movies that are just really weird and so is the cinematography, just kind of disjointed and surrealistic. If y’all could either give recs for similar movies or tell me what the cinematography style of it is, that would be great!",
        "upvotes": 58,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1hnjur1/what_cinematography_style_is_poor_things_2023/"
    },
    {
        "id": "1hn8kas",
        "author": "JokerDeSilva10",
        "title": "Who is the best actor with the worst filmography?",
        "content": "A simple question, but I saw this mentioned on TikTok and it made me curious what the popular consensus is: who do you think is the best or most talented actor who keeps making terrible movies? Who badly needs to fire their agent? Hit me with those luckless saps that can't pick a project to save their lives.\n\nInterestingly, the main one in the TikTok was Chris Hemsworth, which I don't particularly agree with - though I don't think he's a bad actor - but I guess outside of his Marvel projects he has been in largely pretty mediocre movies with the exception of Bad Times at the El Royale, Star Trek (which he was barely in), and Furiosa, which I still haven't seen but heard was good.",
        "upvotes": 438,
        "comments": 954,
        "media": null,
        "permalink": "/r/movies/comments/1hn8kas/who_is_the_best_actor_with_the_worst_filmography/"
    },
    {
        "id": "1hn11a9",
        "author": "ProudReaction2204",
        "title": "As Hollywood Struggles, the Region’s Economy Feels the Pain.\nFilm production has failed to bounce back after major strikes last year, and competition from other locales has gotten stiffer.",
        "content": "",
        "upvotes": 1382,
        "comments": 233,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kWD6Aybr_84LszRJ-JvFkPxNhmFhPM4_2CiAsd4moXI.jpg?auto=webp&amp;s=8025f2238596abd1eef511efa084c9473540b3de"
        },
        "permalink": "/r/movies/comments/1hn11a9/as_hollywood_struggles_the_regions_economy_feels/"
    },
    {
        "id": "1hnix3s",
        "author": "Mst3Kgf",
        "title": "Clint Eastwood's \"High Plains Drifter\" and \"Pale Rider\" make for an interesting double-bill, not just because they're both excellent Westerns that Eastwood directed as well as starred in, but because of the supernatural element they share with each other.",
        "content": "Both films have the same basic premise; Eastwood portraying a mysterious, nameless gunslinger (dubbed \"The Stranger\" in \"Drifter\" and \"Preacher\" in \"Rider\") who rides into an isolated community with a hidden agenda and gets involved in violent antics. But what they also share is the implication that both the Stranger and Preacher are not even human, but supernatural revenants back from the grave for retribution. Eastwood himself has especially liked this aspect and played it up since both films' releases (he even called Preacher an \"out and out ghost\") and it gives what would have been straight-forward Westerns an air of eeriness and dark fantasy (especially \"Drifter\", which often comes off like a horror movie).\n\nOf course, there's a lot of difference as well, since Preacher is a truly heroic figure (as expected give how much \"Rider\" owes to \"Shane\") while the Stranger is a VERY dark anti-hero. But the shared element of them being supernatural figures makes for an interesting back to back viewing.",
        "upvotes": 41,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1hnix3s/clint_eastwoods_high_plains_drifter_and_pale/"
    },
    {
        "id": "1hn53cp",
        "author": "GratedParm",
        "title": "It feels like Hollywood theatrical releases only want Avengers money",
        "content": "The major studios do pepper in other films throughout the year, but these feel like they're existing for form and appearance. \n\nI feel that trying to get those large sums, which usually come from expensive films, they should put more effort into other films by finding out what overall trends in viewership are and choosing pitches that will appeal to people to see as a group. The physical media market may be vanishing, but they can still shop for which streaming service will get it.\n\nHorror seems to be the one exception, where a number of less expensive films are made which subsequently lowers the amount required at the box office to be successful.",
        "upvotes": 457,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1hn53cp/it_feels_like_hollywood_theatrical_releases_only/"
    },
    {
        "id": "1hmy3ol",
        "author": "RianJohnsonIsAFool",
        "title": "What is the greatest on-screen kiss?",
        "content": "My gf and I are currently watching It's a Wonderful Life for the umpteenth time and we would contend that it has at least two of the greatest kisses in film: first, when George and Mary are on the phone with Sam Wainwright and George realises he's in love with Mary (\"He says... it's the chance of a lifetime.\"); and second when Mary sets up their honeymoon at what will become their home.\n\nWe've always liked how \"You want me to kiss her, eh?\" earlier in the film was filmed almost like a fourth wall break. Of course we want you to kiss her!\n\nWhat would you say is the greatest on-screen kiss?",
        "upvotes": 1028,
        "comments": 993,
        "media": null,
        "permalink": "/r/movies/comments/1hmy3ol/what_is_the_greatest_onscreen_kiss/"
    },
    {
        "id": "1hnd3on",
        "author": "JoelAwesome",
        "title": "VHS to DVD to Blu-Ray to 4K",
        "content": "So me and the missus bought ourselves the 30th Anniversary 'Pulp Fiction' 4K for Christmas. Our fav movie of all time.\n\nWe've seen this movie upwards of 20 times I would say. A yearly rewatch since 2003 at the least.\n\nThe jump in quality is astro-fucking-nomical from VHS to 4K.\n\nCan remember renting this in '98 from the Video Ezy. Riding my push bike home with 10 VHS for $10. Watching it in my dingy arse smelly teenager room.\n\nTo now, 4K, 50' inch LCD. Spotting the awesome flower decal on Esmeralda Villa Lobos's shirt. Or pieces of Martin's skull and brain in Jules hair after Vince shoots him.\n\nAnyone else got similar journeys of their own?",
        "upvotes": 64,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1hnd3on/vhs_to_dvd_to_bluray_to_4k/"
    },
    {
        "id": "1hnufrx",
        "author": "Bandana-Verdana",
        "title": "What caused the massive drop in quality between Shrek 2 &amp; 3?",
        "content": "Regardless of your thoughts of the Shrek movies, or whether you believe the latter two films of the tetralogy get too much hate, almost all can agree that Shrek 1 and 2 are far superior to 3 and 4. I’ve always wondered what caused this sudden drop in quality. The films weren’t released very far apart from another and Shrek the Third picks up pretty much exactly where Shrek 2 left off. Yet, for whatever reason, the storytelling and quality of jokes simply come up lacking. Worse yet, the pacing in Shrek 3 seems glacial compared to the rapid-fire speed of the precious film. Does anyone have any theories as to why this happened?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hnufrx/what_caused_the_massive_drop_in_quality_between/"
    },
    {
        "id": "1hn2hvc",
        "author": "BunyipPouch",
        "title": "First Image of Felicity Jones &amp; Joel Edgerton in 'Train Dreams' - A logger works to develop the railroad across the United States causing him to spend vast times away from his wife and daughter, and is struggling with his place in a changing world. - Also Starring William H. Macy &amp; Kerry Condon",
        "content": "",
        "upvotes": 248,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ma463bnqda9e1.jpeg?auto=webp&amp;s=8a76ed9e739ed7c5d597d03d5f7bbc85caae1476"
        },
        "permalink": "/r/movies/comments/1hn2hvc/first_image_of_felicity_jones_joel_edgerton_in/"
    },
    {
        "id": "1hmy67b",
        "author": "OkBack1574",
        "title": "The Family Man (2000) is one of the most amazingly comforting christmas movies/romcoms there is. 5/5. ",
        "content": "Just rewatched it last night with my family and I can safely state that it goes HARD. Tea Leoni is just breathtaking and the chemistry between her and Cage is on point. Also, Annie’s “Welcome to Earth” is such a good line. As  “I'm talking about us finally having a life that other people envy.\nJack. They already do envy us.” is. ",
        "upvotes": 412,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1hmy67b/the_family_man_2000_is_one_of_the_most_amazingly/"
    },
    {
        "id": "1hmrmwx",
        "author": "GenButter",
        "title": "DVD is dead. Long live DVD.",
        "content": "",
        "upvotes": 1006,
        "comments": 350,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ksJBOT5UFcGXSFdKfvd8G1MjKKPL0llAbTET61yrX-s.jpg?auto=webp&amp;s=69841bdd5f617a9cd0f03db76ecf626845228328"
        },
        "permalink": "/r/movies/comments/1hmrmwx/dvd_is_dead_long_live_dvd/"
    },
    {
        "id": "1hn43z8",
        "author": "indiewire",
        "title": "Lily-Rose Depp On How Isabelle Adjani in 'Possession' Inspired 'Nosferatu' (Interview)",
        "content": "",
        "upvotes": 153,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/di8H_0qiPP2S44iCrG6WX4dGxvH7koAQuHdF6M7k0Cc.jpg?auto=webp&amp;s=1a5834cd6ad466033dd18d7c9cd1553932a1a6bd"
        },
        "permalink": "/r/movies/comments/1hn43z8/lilyrose_depp_on_how_isabelle_adjani_in/"
    },
    {
        "id": "1hmz2n2",
        "author": "RemLezar64_",
        "title": "Moving Violations (1985) starring Bill Murray's brother John Murray, Meg Tilly's sister Jennifer Tilly and Stacy Keach's brother James Keach. Has there ever been another movie like this starring less famous siblings?",
        "content": "Yes you heard that right. Moving Violations is a comedy from 1985 starring Bill Murray's brother John Murray, Meg Tilly's sister Jennifer Tilly and Stacy Keach's brother James Keach. Any other movies like this starring less famous siblings? \n\nI have fond memories of this unjustly forgotten comedy from it endlessly playing on HBO as a kid and I think it still holds up pretty well.\n\nIt even has Fred Willard, Sally Kellerman and the \"Where's the beef?\" Lady\n\nHas there ever been a movie starring so many siblings of other actors? Kind of wish there where lol\n\nEdit: Here's the trailer\n\nhttps://youtu.be/BKU85IV0_Bw",
        "upvotes": 295,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w0gS19jAY_lybT2PUFhcbNug4jnV-rLE-6sg6fAYgRI.jpg?auto=webp&amp;s=effbaab2b8bc11ae22a06f7fde9e3c79a5ba4752"
        },
        "permalink": "/r/movies/comments/1hmz2n2/moving_violations_1985_starring_bill_murrays/"
    },
    {
        "id": "1hn53sf",
        "author": "masterofnuggetts",
        "title": "What is the silliest on-screen kiss?",
        "content": "Inspired by the discussion about the greatest on-screen kiss, I started thinking about the silliest one.     \nThere are plenty of times when the characters kiss by straight up eating each others faces, but I just could not stop thinking about the kiss from Hot Shots 2:    \n&gt;Kiss me like you've never kissed me before      \n\nWhat do you think is the silliest on-screen kiss?",
        "upvotes": 81,
        "comments": 153,
        "media": null,
        "permalink": "/r/movies/comments/1hn53sf/what_is_the_silliest_onscreen_kiss/"
    },
    {
        "id": "1hmxcbf",
        "author": "indiewire",
        "title": "Marielle Heller on Nightbitch: Amy Adams, a Beautiful Dog and Weird Al",
        "content": "",
        "upvotes": 236,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aF3wCh7YCnJw9q3WrEZGw6IE_q8Cx9yDzRSY3f2Qavw.jpg?auto=webp&amp;s=e236e64d376b12d1310f1039d4e8a84eef212cda"
        },
        "permalink": "/r/movies/comments/1hmxcbf/marielle_heller_on_nightbitch_amy_adams_a/"
    },
    {
        "id": "1hnpskz",
        "author": "Still_Sun1824",
        "title": "Total Recall (2012)",
        "content": "In this movie at the start he dreams of Melina before he even enters Rekall (which is open to interpretation if he even succeeded in entering the simulation) so it makes me think it was real. But also there’s points where it seems like it is all a simulation, like when Harry tries to sway our main character back into “reality” so what do you think? Was it all real or was it fake? It could go both ways.",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1hnpskz/total_recall_2012/"
    },
    {
        "id": "1hnudi7",
        "author": "ScrotiedotBiz",
        "title": "Lethal Weapon 2 \"Diplomatic Immunity\" \"Your License has just been Revoked\"",
        "content": "I watched this movie a bunch of times as a kid and just thought this was a hardcore thing to say to a villain you just shot in the head. \n\nIt occurred to me a few years ago this is actual exposition: Murtaugh had had conversations with the State Department. As absurdly illegal as \"Lethal Weapon\" climactic executions of criminal cartels might seem, the government had legalized it, at least in terms of insane \"Lethal Weapon\" world where nobody says a goddamn thing about this, in the next movie. Their diplomatic immunity was revoked, they'd murdered 9 cops or whatever--obviously that would be no bullshit in fictional or real world--and invite extreme reactions. \n\nSo me and my friend were asking AI and all the answers are bullshit. I guess I stop at script-intent: these movies were very fast. Maybe they wanted you to think Riggs and Murtaugh were on suicide mission, but now it was kinda-legal, at the end? Obviously: these are the bad guys. They got shot in the head.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hnudi7/lethal_weapon_2_diplomatic_immunity_your_license/"
    }
]