[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1og8tmv",
        "author": "liveoutdoor",
        "title": "I really hate Netflix at the moment.",
        "content": "As a pet/house sitter I am usually away from my house. I bring my own device to stream, so far tonight I have had to update my household, ener codes etc 5 times. Then the family back at home gets booted it is so ridiculous.\n\nJust a rant. ",
        "upvotes": 92,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1og8tmv/i_really_hate_netflix_at_the_moment/"
    },
    {
        "id": "1ogee04",
        "author": "Western_Quit_4966",
        "title": "Netflix doesn’t care about good writing anymore",
        "content": "The platform is full of shows with huge production value but terrible scripts. It’s all visuals and marketing, zero substance. People only praise it because it’s on Netflix. Who’s tired of this?",
        "upvotes": 21,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ogee04/netflix_doesnt_care_about_good_writing_anymore/"
    },
    {
        "id": "1ogbg13",
        "author": "Short_Pin_6243",
        "title": "House of Dynamite was so close to being great",
        "content": "*Potential minor spoiler*\n\nJust watched the movie and I don’t think I’ve ever felt this way about a film before. Everything was right there to make a great film but they veered off so unnecessarily. \n\nAll the film needed to do was continue to build off the tension of the first act. It felt plausible yet unbelievable at the same time. It captured the complete panic that would take place. \n\nThen they had to switch perspectives…..twice. It completely took me out of the tense feeling of the first third. It sucks because it was completely unnecessary. ",
        "upvotes": 15,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ogbg13/house_of_dynamite_was_so_close_to_being_great/"
    },
    {
        "id": "1ofvchr",
        "author": "ShirtyManhole",
        "title": "Why do they shoot these shows in literal darkness?",
        "content": "Just finished The Black Rabbit. Really enjoyed it. Slow burn… two kids forged by a rough upbringing, bound together by brotherly love in a highly toxic way.\n\nBut why do they shoot half of these shows in literal darkness? I spent more time squinting at shadows than actually watching. At some points, it was more similar to listening to an audiobook than watching a show. I get that it’s moody, atmospheric, and dark for effect. However I feel I need military-grade night-vision goggles to follow the plot.",
        "upvotes": 124,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1ofvchr/why_do_they_shoot_these_shows_in_literal_darkness/"
    },
    {
        "id": "1ogep7t",
        "author": "YeetMyM3at",
        "title": "Anyone else spend more time scrolling than actually watching?",
        "content": "I open Netflix planning to watch something, then end up scrolling for 30 minutes trying to pick a show.  \nBy the time I finally choose, I’m not even in the mood anymore.\n\nDoes anyone else do this, or is it just me?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogep7t/anyone_else_spend_more_time_scrolling_than/"
    },
    {
        "id": "1ofsij2",
        "author": "wilhelmstarscream",
        "title": "Netflix changed country of my account to get me to end grandfathered lower rate",
        "content": "Netflix changed my account from U.S. to Venezuela to try to get me to close my grandfathered $5.99 account. I don’t know where that rate came from, Netflix had it as an option. \n\nSuddenly my billing said it was paused and I had to update payment,  but Netflix blocked every option I had to update the payment method. I opened the account in the U.S. in 2010 and they changed my billing and phone number to Venezuela and said the account was opened in Venezuela a year ago. Their customer service just keeps pushing for me to close the account and open a new one under the new rates. When I try to update the billing, they changed my U.S. phone number to a Venezuela phone area code and it doesn’t let me change it or verify the new billing method.\n\nI have email proof that the account was opened in the U.S. in 2010. Netflix claims they only keep billing records for a year so they have no record of it. At first I thought I might have been hacked but their customer service is so intent on me ending the account. \n\nTheir customer service actually said,” and just to let you know if your account was created in United States you should be paying us $17.99 not $5.99.”\n\nSeems like I have no recourse and it’s a dirty way they’re getting longtime customers to end their grandfathered rate accounts.",
        "upvotes": 87,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ofsij2/netflix_changed_country_of_my_account_to_get_me/"
    },
    {
        "id": "1ofzwn9",
        "author": "MakeMeToasty",
        "title": "Need help finding a show I watched.",
        "content": "Edit: It was the sinner thank you everyone who replied\n\nI’m almost certain this show was on Netflix at some point but I may be wrong about it. The premise of it was that they would show what was a seemingly random murder at the start of episode 1 and then the rest of the season would be about everything that led up to that point. I swear it was a multiple season thing with different stories and characters each time, or maybe it was like different shows all kind of linked by a premise. The season I remember most vividly, the initial murder happened on the beach of a lake, and the story behind why the woman did it was because her sickly sister wanted to come out and party with her and they ended up taking ecstasy or something and because of her condition she went into cardiac arrest and the guy who was murdered at the start tried to perform cpr and ended up caving her chest in and killing her. I thought it was called Monsters or something but that seems to be a true crime thing. That’s about all I remember though pls help thank you v much everyone",
        "upvotes": 26,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ofzwn9/need_help_finding_a_show_i_watched/"
    },
    {
        "id": "1ogeycg",
        "author": "Leen88",
        "title": "Just finished a show and now I have that what do I watch next",
        "content": "I just finished my latest binge and now nothing else feels interesting.  \nI scroll for like 20 minutes but can’t commit to a new show.\n\nAnyone else get that empty feeling after finishing a really good series?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeycg/just_finished_a_show_and_now_i_have_that_what_do/"
    },
    {
        "id": "1ogeyj4",
        "author": "energyim497",
        "title": "Netflix deletes itself",
        "content": "Im not sure if its netflix or something on my phone. For context, I found out netflix had disappeared and later found out it had been deleted. However, when I tried downloaded it again, it just stops when its at the installation part. Any help?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeyj4/netflix_deletes_itself/"
    },
    {
        "id": "1og85bx",
        "author": "JunkyYT",
        "title": "YOU (so far)",
        "content": "Season 1 is absolutely fire, it was amazing and seeing it gave me chills and excitement, Elizabeth lail was perfect, only issues that she died 💔\n\nSeason 2 started off boring but became a lot more interesting, but I really hated forty he’s such an annoying character, ending was good, \n\nJust started of season 3 and I don’t feel like finishing it, I feel like it should’ve ended at season 2, it’s a bit too boring now,\n\nWhat do yall think?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1og85bx/you_so_far/"
    },
    {
        "id": "1ofzf13",
        "author": "Jerswar",
        "title": "I'm being asked to update my payment information. Is this legit?",
        "content": "I got an email saying my membership is on hold, and to update my payment info... by the end of November. Why is it on hold already, but... I  have a month to update?\n\nWell, either way, I can't access Netflix shows without updating.",
        "upvotes": 6,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ofzf13/im_being_asked_to_update_my_payment_information/"
    },
    {
        "id": "1ogaw88",
        "author": "MrBlank123456",
        "title": "Question about preview club",
        "content": "I was invited to the preview club and am just wanting to make sure about something.\n\nI watched the movie and the credits rolled but I skipped through. Was watching on my Apple TV, was I supposed to get a survey on the screen or an email following it?\n\nBecause I have received neither and it’s been a few hours now. I just want to make sure I still get previews in the future so want to make sure to do things right. Does it take a few days for a follow up? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogaw88/question_about_preview_club/"
    },
    {
        "id": "1ogamux",
        "author": "DueLand5304",
        "title": "help me with title the movie",
        "content": "I'm looking for a movie with the following plot: a young woman gets a babysitting job on a farm to care for two children. When she arrives, the father answers and tells her that the mother abandoned them and ran off with another baby. One night, the babysitter has a relationship with this old man, and then everything turns into a nightmare, as the man turns into a madman. He begins to abuse her psychologically and sexually. When he discovers that the babysitter is secretly taking birth control pills and still gets pregnant, he beats her until she loses the baby. In the end, she manages to escape, and he is arrested, but he claims to have mental problems.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogamux/help_me_with_title_the_movie/"
    },
    {
        "id": "1of2s3h",
        "author": "Longjumping_Land_977",
        "title": "Ajike Owens’ mother shares brutal response to so-called ‘apology’ Susan Lorincz gave her",
        "content": "",
        "upvotes": 541,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1of2s3h/ajike_owens_mother_shares_brutal_response_to/"
    },
    {
        "id": "1ofm2aq",
        "author": "Dragonbite2020",
        "title": "Netflix Monster Series Has Competition: Gacy’s Devil in Disguise Is as Good as Dahmer S1",
        "content": "Just started watching *Devil in Disguise: John Wayne Gacy* by accident. I was watching *The Gacy Tapes* on Netflix, then googled it and found out Peacock made a whole series. I was curious if Monster would ever do Gacy, but another platform just created it. It is a good watch if you like Monster series and have seen the Gacy tapes as well. \n\nWow — Netflix really has to step up its game now.\n\nI’d say *Devil in Disguise: John Wayne Gacy* is just as good as *Dahmer: Monster* Season 1. Seasons 2 and 3 of *Monster* are okay, but now Netflix has real competition — everyone’s jumping into the true crime series game.",
        "upvotes": 24,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ofm2aq/netflix_monster_series_has_competition_gacys/"
    },
    {
        "id": "1og7spg",
        "author": "randomperson365247",
        "title": "video player doesnt work it shows black on fullscreen and my desktop on window mode",
        "content": "**technical info: i use opera gx browser alr updated on my mac**  \n  \nit works fine until i start watching a show then it either a: turns black on fullscreen or B: shows my desktop on window mode. the only way i can see what im watching is popping out the video. PLS HELP ME i have disabled every extension for this and when i try on safari it works so idk what to do.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1og7spg/video_player_doesnt_work_it_shows_black_on/"
    },
    {
        "id": "1og6zai",
        "author": "Warm_Ad_7917",
        "title": "Whats your secret?",
        "content": "How do you people know what you want to watch? Everytime I open netflix I just get slapped with choice. Even my save for later is filling giving me to much to choose from.   \nNeed suggestions for good movies (classics) but also advice on how know what to watch with all these options.  \nThank you!",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1og6zai/whats_your_secret/"
    },
    {
        "id": "1offdqx",
        "author": "TurbulentFlame",
        "title": "A House of Dynamite felt more like a fizzle than a bang.",
        "content": "I don't want to say too much about it, because I know it just came out for streaming and people are going to be watching it. But I just watched *A House of Dynamite* and I'm both so frustrated and beyond disappointed, at the same time.\n\nThe trailer for this movie had me super hyped. I've been looking forward to watching this movie all week. While the movie underperformed, in my opinion, it wasn't actually terrible; just kind of a let down from what I expected out of the trailer. But still not awful...at least not until that \"ending\". That was just so anticlimactic and bad. I don't know for sure what I was expecting instead, but that wasn't it.\n\nWhat is it with Netflix and these cliffhangers? So many quality films have felt ruined by poor endings: *How It Ends*, *Fractured*, *Leave the World Behind* and now *A House of Dynamite*, just to name a few.\n\nWhy does Netflix keep doing this?",
        "upvotes": 65,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1offdqx/a_house_of_dynamite_felt_more_like_a_fizzle_than/"
    },
    {
        "id": "1og6j6d",
        "author": "Time_Writing4634",
        "title": "Is streaming still cheaper than cable",
        "content": "For context my family splits who pays for which streaming service but as the password crackdowns continue that becomes less true. If you take into account that streaming has ads now Im not sure it is any different than cable. Sure streaming services have original content but I’m hard pressed to say original content is even worth it anymore. People are afraid to admit Netflix original content is cheeks. Apple original content is the only streaming service I’d stand on business for. HBO is $10/mo with cable vs $20/mo as a standalone.\n\nI’m not switching to cable but at what point does the streaming pig get slaughtered? ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1og6j6d/is_streaming_still_cheaper_than_cable/"
    },
    {
        "id": "1ofy2w5",
        "author": "saywhatIneedtosay26",
        "title": "Nobody Wants This S2: I did not mind it. It did not make my heart race, but actually showed what a stable relationship with turbulences can feel like?",
        "content": "1. Kristen Bell and Adam Brody's chemistry or let’s call it effort to be together- You genuinely believe that Joanne and Noah are deeply in love and would fight this hard to be together. Bell’s character has grown too. \n\n2. The season smartly widens the spotlight to other characters. We get much more of Sasha, Esther, and Morgan (love her!!). Imo it gave depth to characters who felt a bit one dimensional in Season 1, like Sasha or even Joane’s parents\n\n3. I liked it had some modern cues- like Noah’s people pleasing nature, Esp the whole Noah arc of relying on social scripts to be a \"good boyfriend\" instead of genuinely showing up for their earlier partner. Infact in S1, I had a problem that they never really showed much of Noah’s side. He felt bit like a love bomber. Even the fact that he sneakily kept slowing down the relationship but wouldn’t confront her? (Reminded me of April and Jackson wedding runaway storyline in grey’s anatomy LOL) \n\n4. The show offers a realistic look at navigating interfaith dynamic. Instead of a dramatic, single episode conversion, the season explores the messy, non-linear process of Joanne contemplating Judaism. Esp considering how faith is literally Hot Rabbi’s careerr! \n\n5. It shows how the honeymoon phase ends, making the main couple face their own tedious, slow moving reality. Noah and Joanne are shown moving past the electric newness of their courtship into the day to day mundane of a committed life. And that’s what S2 meant for me too, not the butterfly in stomach moments but the slow stability. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ofy2w5/nobody_wants_this_s2_i_did_not_mind_it_it_did_not/"
    },
    {
        "id": "1ofgi68",
        "author": "sa1218329",
        "title": "Layout change",
        "content": "I know this sounds petty, but the new menu layout is awful. Why bury “continue watching” and my list. And why default ti the generic “home” instead of “my Netflix”? The thumbnail carousel shows less movies at one time causing more scrolling. I wish there was a setting to retain classic layout ",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ofgi68/layout_change/"
    },
    {
        "id": "1ofcsi5",
        "author": "Logical_Order",
        "title": "We didn’t get any fun Halloween movies this year",
        "content": "Or did I miss it?\n\nWas just thinking Netflix usually releases some cheesy Halloween stuff. We have not had anything like that this year which is a bummer. Anyway, any recommendations on a cozy watch but not horror? ",
        "upvotes": 34,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ofcsi5/we_didnt_get_any_fun_halloween_movies_this_year/"
    },
    {
        "id": "1ofreen",
        "author": "peoplemagazine",
        "title": "Seth Rogen Went 'Way Off Script' in Nobody Wants This Season 2, Adam Brody Reveals: 'He Just Let It Rip'",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ofreen/seth_rogen_went_way_off_script_in_nobody_wants/"
    },
    {
        "id": "1ofeeph",
        "author": "Original2021",
        "title": "Bravo to the writers of the diplomat!",
        "content": "I just started watching the series. The season two ending is one of the best finales I’ve ever seen. Bravo to the cast and writers. Give Allison Janey the Emmy already! Well done! ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ofeeph/bravo_to_the_writers_of_the_diplomat/"
    },
    {
        "id": "1oen44j",
        "author": "gailthesnail2",
        "title": "The Perfect Neighbor - Lorincz’s lone supporter in court, her sister, charged with felony child neglect",
        "content": "I’m assuming this was the boy seen in the documentary. I was wondering how anyone could show up after the shooting to help this woman. They’re both narcissistic and antisocial with no regard for others, particularly children. ",
        "upvotes": 212,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1oen44j/the_perfect_neighbor_lorinczs_lone_supporter_in/"
    },
    {
        "id": "1ofi58n",
        "author": "Mix_Loves_Typhlosion",
        "title": "Children's television show that was available on Netflix sometime from 2015-2017. Anyone else remember it?",
        "content": "I'm gonna separate the definitive details from the possibly false details, because I was pretty young at the time.\n\nHere are the definitive details:\n\n1. Very few episodes, less than five.\n2. Was a collection of videos with costumed animal characters and kids singing well known nursery rhymes.\n3. Was probably filmed sometime in the 90s, but no earlier.\n4. There was no plot, simply a compilation of short songs.\n5. One of the episodes had a Yankee Doodle song filmed in the forest.\n6. (This one is really important) One of the characters was a green bipedal reptile in a purple wizard outfit with a cap and robes. He may have had yellow stars on his hat and robes as well but not definitive.\n7. The intro to each episode was a very short looping animation of the animal characters dancing in a 2D hand-drawn style over some type of patterned background.\n\nThere is only one possibly false detail, one of the characters may have been a bipedal bear with a top hat (lol now that I think about it it kinda reminds me of freddy fazbear)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ofi58n/childrens_television_show_that_was_available_on/"
    },
    {
        "id": "1oeueiw",
        "author": "Last-Maize7926",
        "title": "Anyone started watching A HOUSE OF DYNAMITE ?",
        "content": "Hi all, just wanted to know if anyone watching this movie and whats your thought so far about it. Do u really like it specially the characters and story. ",
        "upvotes": 29,
        "comments": 305,
        "media": null,
        "permalink": "/r/netflix/comments/1oeueiw/anyone_started_watching_a_house_of_dynamite/"
    },
    {
        "id": "1oelz5y",
        "author": "honeywormss",
        "title": "The Perfect Neighbor what happened with the tow truck?",
        "content": "Was she trying to break her car out of the impound lot? I didn't quite catch what was going on. Did she sneak into the lot and was trying to break down the gate to get out? ",
        "upvotes": 120,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1oelz5y/the_perfect_neighbor_what_happened_with_the_tow/"
    }
]