[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oen44j",
        "author": "gailthesnail2",
        "title": "The Perfect Neighbor - Lorincz’s lone supporter in court, her sister, charged with felony child neglect",
        "content": "I’m assuming this was the boy seen in the documentary. I was wondering how anyone could show up after the shooting to help this woman. They’re both narcissistic and antisocial with no regard for others, particularly children. ",
        "upvotes": 55,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1oen44j/the_perfect_neighbor_lorinczs_lone_supporter_in/"
    },
    {
        "id": "1of2s3h",
        "author": "Longjumping_Land_977",
        "title": "Ajike Owens’ mother shares brutal response to so-called ‘apology’ Susan Lorincz gave her",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1of2s3h/ajike_owens_mother_shares_brutal_response_to/"
    },
    {
        "id": "1oelz5y",
        "author": "honeywormss",
        "title": "The Perfect Neighbor what happened with the tow truck?",
        "content": "Was she trying to break her car out of the impound lot? I didn't quite catch what was going on. Did she sneak into the lot and was trying to break down the gate to get out? ",
        "upvotes": 47,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1oelz5y/the_perfect_neighbor_what_happened_with_the_tow/"
    },
    {
        "id": "1oeueiw",
        "author": "Last-Maize7926",
        "title": "Anyone started watching A HOUSE OF DYNAMITE ?",
        "content": "Hi all, just wanted to know if anyone watching this movie and whats your thought so far about it. Do u really like it specially the characters and story. ",
        "upvotes": 9,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1oeueiw/anyone_started_watching_a_house_of_dynamite/"
    },
    {
        "id": "1oergog",
        "author": "livingamoment",
        "title": "What Queen Charlotte Taught Me About Happiness",
        "content": "The other night, I started watching Queen Charlotte: A Bridgerton Story on Netflix.\n\nI wasn’t expecting much-- just another royal drama filled with silks, chandeliers, and scandal.\n\nBut one scene caught me off guard.\n\nLady Danbury sends out an invitation for the first ball of the season. Another Lady-- I forget her name -- becomes visibly agitated that the honour had been “snatched” from her.\n\nIt was such a simple moment, yet it reminded me something.\n\nHere were people surrounded by unimaginable wealth and luxury -- yet burning with the same insecurities and jealousies that haunt us all.\n\nThe King and Queen, for all their power, suffer in their own ways.\n\nThe Lords and Ladies suffer for attention, for prestige, for a sense of being seen.\n\nAnd suddenly, it reminded me-- this isn’t just their story. It’s ours.\n\nWe chase new jobs, new relationships, new milestones, believing each next thing will finally make us happy. But it never really does. It’s the same script, just in modern clothes.\n\nThat night, I remembered something Sadhguru once said: If you have tried every possible way to fulfill yourself, and you have realized that nothing really works, it means you have come to the point: ‘And now, Yoga.’\n\nIt took me years to understand this. Growing up, I was brainwashed to be in constant pursuit of happiness. But Yoga showed me something different. It turned my gaze inward and revealed that what I was chasing was never missing-- it was just within.\n\n\n\n",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oergog/what_queen_charlotte_taught_me_about_happiness/"
    },
    {
        "id": "1oe1sq9",
        "author": "dommimommyy",
        "title": "The Perfect Neighbor",
        "content": "After a quick search I see this documentary has been talked about quite a bit here, but the one thing I haven’t seen mentioned is the fact the documentary is almost entirely filmed on police body cam.\n\nI personally found this fascinating as someone who enjoys seeing live clips, police interviews, especially when tied into a documentary.  (For me it adds an extra layer of “realness” to the documentary.)\n\nI wonder if we will see more true crime documentaries filmed this way with the advancements of technology and body cam footage etc. I think the documentary was beautiful put together and even with majority of the documentary being on body cam footage, it still told a very clear story.\n\nCurious to know anyone’s thoughts on this? Did you think the body cam footage made things “too real”? Invasion of privacy? Would you like to see more true crime documentaries that include police body cam footage etc?\n\nTIA! 💋",
        "upvotes": 428,
        "comments": 380,
        "media": null,
        "permalink": "/r/netflix/comments/1oe1sq9/the_perfect_neighbor/"
    },
    {
        "id": "1oej5kn",
        "author": "Ember_Grove20",
        "title": "Which Netflix series or movie do you think deserves a sequel?",
        "content": "Ever finish something on Netflix and feel like it ended too soon? Some stories just have so much more to give. Which series or movie do you think deserves a proper sequel?",
        "upvotes": 35,
        "comments": 188,
        "media": null,
        "permalink": "/r/netflix/comments/1oej5kn/which_netflix_series_or_movie_do_you_think/"
    },
    {
        "id": "1of0jim",
        "author": "Imhotep397",
        "title": "What block of movies were promoted with \"The Killers\"?",
        "content": "\n\nWhen they released The Killers there were two or three other films that were part of the same national broadcast campaign.  I forgot about them and there’s no collection of them along with The Killers either on the front page or in search.  Does anyone remember the names of the other films?\n\nThey did the same thing with the Harlan Corben series’.  They had him on a bunch of morning talk shows and then no Harlan Corben tile in the Netflix app.  I saw Stay Close, got busy and I know there are more Corben limited series I probably would like, but it took me writing this post to dig deep and remember it was Corben series I need to sift through Netflix to find.\n\nThey did the same thing with the Elvira campaign on Youtube a couple of years ago.  This was a bit better because it was easily searchable on youtube and I saw the ones I was interested in, but no trace of it at all in the Netflix app felt like a huge disconnect.  A Tile” within the rows. from search.\n\nThe thing that’s bad is that it feels like it was a waste of effort for Netflix to have made the promotions because the content very quickly fades back into the obscurity of the catalogue.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1of0jim/what_block_of_movies_were_promoted_with_the/"
    },
    {
        "id": "1oevus0",
        "author": "sohaniadi",
        "title": "A House of Dynamite - Sketch Poster &amp; Base Drawing",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oevus0/a_house_of_dynamite_sketch_poster_base_drawing/"
    },
    {
        "id": "1oebdgs",
        "author": "Fifi343434",
        "title": "The Perfect Neighbor - Can someone help me understand why she didn't move?",
        "content": "In the doc, it says Susan was going to move but then didn't.  I know she was widow and not to be judgemental but the homes seemed like section 8 perhaps?  Not big, only a few doors and no property.  But is there a reason Susan didn't just move rather than let this continue on for 3 years? Why not move, invest in a white noise machine, go to therapy rather than let this eat at you?",
        "upvotes": 66,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1oebdgs/the_perfect_neighbor_can_someone_help_me/"
    },
    {
        "id": "1of3atn",
        "author": "Kaskelontti",
        "title": "The Sound Of Your Heart",
        "content": "I like these half-hour Korean comedies, even though I end up binge-watching two or three hours at a time. The Sound Of Your Heart is one of them.  In general, Korean comedies are reminiscent of Finnish \"country comedies,\" which is quite a familiar kind of slapstick. There is no sense or logic in these, but they make you laugh and forget your worries for a little while.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1of3atn/the_sound_of_your_heart/"
    },
    {
        "id": "1of32bp",
        "author": "Minute_Practice_8462",
        "title": "Security procedures in The Diplomat",
        "content": "In The Diplomat on Netflix, the security team always opens car doors for officials the same way — one hand on the handle, the other gripping the top of the door frame — before letting them out. It’s done so deliberately and consistently that it looks like a real-world protocol.\n\nIs that actually a standard close-protection or diplomatic-security procedure, or just something stylized for TV?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1of32bp/security_procedures_in_the_diplomat/"
    },
    {
        "id": "1of2xnn",
        "author": "hdrytx",
        "title": "some titles not available on certain accounts",
        "content": "i was watching suits on netflix and then suddenly it said it wasn’t available in my region. i just dealt with it but then my mom opened netflix on her profile on the tv and suits was in her recommended and she could watch it normally. meanwhile on my profile it still said it wasn’t available.\n\ni checked other movies and shows to see if they were available and the same thing happened. they showed up for her but not for me. it can’t be parental controls i already checked and i’m using the primary account.\n\nanyone know what could cause this?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1of2xnn/some_titles_not_available_on_certain_accounts/"
    },
    {
        "id": "1oej3br",
        "author": "Soft_Significance718",
        "title": "Nobody [EVERYBODY] Wants This",
        "content": "How did I not know that it was coming back today?! I had no warning! No time to prepare myself and clear my schedule for an evening to watch it in one night!\n\nI really love this show. Unfortunately, I watched the first season with my best friend of 20 years, who passed away unexpectedly last December at 35 years old, so this season is going to hurt. But it will also make me happy to remember our time watching it together and laughing together.\n\nAnyways, welcome back, Joanne and Noah!",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oej3br/nobody_everybody_wants_this/"
    },
    {
        "id": "1of1h4i",
        "author": "rod_7789",
        "title": "Ending of \"Beef\"",
        "content": "I know the show has been out for a while but I just finished it. I wanted to know what you guys thought about the ending, because I'm enraged by it. I loved all the episodes up to the last two. I genuinely cannot believe how badly they fucked everything up, it actually makes me mad.\n\nFirst off, Amy and Danny. Everything about the relationship between these two in the last episode is so confusing to me. The car chase that led Amy and Danny to crash was so avoidable and unrealistic. Amy has just lost everything, literally everything, and yet she still completely forgets about all that and chases Danny, showing no emotions to what had just happened (I can let this go because it could just show her obsession with all of this and her inability to let it go, even at the cost of her life). But then, instead of ramming into the car or just chasing him until he stops, she goes BESIDE HIM, and they both look AT EACH OTHER, DRIVING, NEAR A CLIFF. It's such a dumb way to cause the crash, there were so many better ways to go about this.   \nThis also brings me to another point: after the crash when they're chasing each other, they're making jokes, almost flirting with each other, but they also hate each other? Have you ever seen two people who want each other dead talk in such a friendly way? cause i haven't. His brother had just died (for all he knew), and she had just lost everything, and yet they are all lovey dovey with each other. Maybe I'm not getting the point of the story, but a few minutes ago she completely ignored the fact that she lost everything to chase this man, and now she's asking him to carry her and casually talking to him? It's just like one second they hate each other and they're threatening each other to die, and then the next they're all emotional and cracking jokes.  \n  \nThen there's George. The entire show he was an extremely nice person who wouldn't hurt a fly (to an extent, since he did basically cheat on his wife but you get the point). When he finds out his wife cheated, he gently grabs her hand and calmly says he wants a divorce, and now, all of a sudden, he shoots someone without a second thought? Don't get me wrong, I understand that he was worried and so he did rash things, but we've seen him worried/stressed along the show and not make such aggressive decisions, like at least show that he has a bit of remorse or is scared to end someone's life. I just found it so unlike him.   \nThen there's Paul. It's understandable that he'd be mad, but leaving your BROTHER to die because he threw away your college letters? 5 seconds before that, he was all proud, saying he wasn't going to leave, that Danny had accepted his flaws so many times, but then just by saying one little sentence, Paul did a whole 360 and hated him, texting him that he never wanted to see him again? And why did he even text him?! for all he knew Danny was dead, he left him with the knowledge that he was gonna die.\n\nI also want to point out one thing that made me very irritated. The scene where Danny and Paul split up is just so weak man. You're telling me Paul couldn't have put his hand a bit further down, or Danny couldn't have boosted the jump using the wall, fuck, or they could've looked around a bit, and they would've found the vent Danny used. Such a dumb and infuriating scene.\n\nAnyway, I don't want to make this rant too long since I want to know your opinions. I have so many other things to criticize, but I think I gotta take a deep breath and calm down cause this shit made me mad bro, what a waste.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1of1h4i/ending_of_beef/"
    },
    {
        "id": "1oej32s",
        "author": "JPTOT",
        "title": "The Perfect Neighbor needs its own subreddit!",
        "content": "So much to discuss, so many questions, and there's a million threads about it in various subreddits. We need one single place to discuss this insanely captivating (and heartbreaking) documentary!",
        "upvotes": 19,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oej32s/the_perfect_neighbor_needs_its_own_subreddit/"
    },
    {
        "id": "1oeynrg",
        "author": "eldabash",
        "title": "Netflix games over Chromebooks?",
        "content": "Hi. I've been unable to play Netflix game Civilization VI over Chromebook (Lenovo Duet 5). It's the only Netflix game I have tried over it but I get a consistent error upon trying to sign in the game saying not eligible. That's not the case over my android phone. I tried months ago getting support from Netflix and they said they were aware of the issue and will fix it but that was never resolved.\nAnyone with a different experience with Netflix games over Chromebooks?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oeynrg/netflix_games_over_chromebooks/"
    },
    {
        "id": "1oet045",
        "author": "Desperate-Piccolo829",
        "title": "Keep getting a warning that somebody is watching and i need to upgrade for 2 people to watch at the same time",
        "content": "It says a streaming stick is watching with my profile. While i do have a streaming stick, its not logged in with my account. I just changed the password and logged out of all devices and its still not working.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oet045/keep_getting_a_warning_that_somebody_is_watching/"
    },
    {
        "id": "1oevk7a",
        "author": "H4RZ3RK4S3",
        "title": "What is with all these guys in Monster of Florence?",
        "content": "Dear all,\n\nI have just finished watching the Monster of Florence and don't really understand why all these guys are such weirdos. I know that this is not a documentary and that it only covers one track of a very large case. I'm more interested in the psychology (or more precise the psychological disorders) and motivations of the male characters. Can someone give me a more detailed explanation of these characters and why they are like this?\n\nHighly appreciated. Thanks!",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1oevk7a/what_is_with_all_these_guys_in_monster_of_florence/"
    },
    {
        "id": "1oeuuma",
        "author": "TarHeelFan81",
        "title": "Last days of sub—what to watch?",
        "content": "I’ve only got a few days left on my subscription; is there anything I might regret not watching? I could just binge on GBBS, but perhaps there’s a great show or two?",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1oeuuma/last_days_of_subwhat_to_watch/"
    },
    {
        "id": "1oegk5j",
        "author": "StockCaterpillar7303",
        "title": "What to watch with my kid like stranger things",
        "content": "He’s 8. Stranger things was perfect because it’s not just constant sex scenes like almost everything else I try to put on. But we finished stranger things. \n\nWhat else could we watch together, we kinda like spooky vibes. ",
        "upvotes": 8,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1oegk5j/what_to_watch_with_my_kid_like_stranger_things/"
    },
    {
        "id": "1oerr7y",
        "author": "DaftVapour",
        "title": "Mobile App refused service",
        "content": "Hi, I usually watch Netflix on my sky puck but occasionally use my phone, usually in bed when I’m having trouble sleeping.\n Last night was one of those nights. I hadn’t used the mobile app for a few weeks so wasn’t that surprised when it prompted me to log in, but when I submitted my details it told me my phone wasn’t on my list of approved household devices and only gave me the option to use it temporarily for 14 days. My account wasn’t being used on any other devices at the time.\n Does anyone know how I can continue to use my phone after the 14 days is up? I thought I could use as many devices as I want, provided I only use one at a time. My phone is only the second device being used at it is and apparently they don’t even want me using that.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oerr7y/mobile_app_refused_service/"
    },
    {
        "id": "1oerjvn",
        "author": "fireflame999",
        "title": "How to change to old format?",
        "content": "I use the Fire stick to access Netflix. \n\nIs there any way to switch it back to the old formatting? I hate the new one they have now. It’s so irritating and is drives me mad every time I try to find a show to watch.\n\nIf anyone could tell me step by step how to change it back, I’d be ever grateful!\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oerjvn/how_to_change_to_old_format/"
    },
    {
        "id": "1oergf1",
        "author": "petalpower678",
        "title": "Bro can they just get a gun",
        "content": "Black rabbit is pissing me off so much. It’s good of course the acting is incredible but the amount of times they’ve had a gun pulled on them you’d think they’d finally get one! Sorry had to get this off my chest",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oergf1/bro_can_they_just_get_a_gun/"
    },
    {
        "id": "1oejjd8",
        "author": "Kryds",
        "title": "Please explain this.",
        "content": "Why did Inside job get canceled after two great seasons, when the Big mouth embarrassment has eight seasons and a spin-off?\n\nIt just doesn't make sense.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oejjd8/please_explain_this/"
    },
    {
        "id": "1oejcr1",
        "author": "wh1tef3rrari",
        "title": "Netflix barely works on my ipad",
        "content": "Whenever I log onto netflix on my ipad, i’m logged out. No matter what, I’m always logged out. Irritating but whatever, I just log back in but it doesn’t work. I will do it three, four five times yet every time it acts as if it’s logging me in then immediately takes me to the login home page again. Sometimes i’ll swipe out the app and come back and i’m logged in, but it never lasts. Also, if I manage to get in i can only watch one episode of a show. When the episode ends it won’t automatically go to the next episode, it’ll say some error code and when I click on it, it says that error code as well. Then I try something else and the error code is there too. I swipe netflix out, and I’m logged out yet this time it won’t log me in regardless no matter what, I have to wait a couple hours or for me usually the next day. Is this common? Thanks. This has never happened in my ipad ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oejcr1/netflix_barely_works_on_my_ipad/"
    },
    {
        "id": "1odbsqb",
        "author": "Warm-Barracuda3302",
        "title": "‘I’ve been in tears’: Ajike Owens’ cousin opens up after ‘reliving’ her death in Netflix doc",
        "content": "",
        "upvotes": 766,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1odbsqb/ive_been_in_tears_ajike_owens_cousin_opens_up/"
    },
    {
        "id": "1oedrs1",
        "author": "futureman45",
        "title": "Fauda. Not sure why I’m watching this show. Time to cut bait.",
        "content": "First this is a terrible series but even worse is the translation to English compared to closed captioning.  For example. The mossad agent says, “I promise you we will get him back”. However closed captioning says, “By hook or by crook”\n\nwtf. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oedrs1/fauda_not_sure_why_im_watching_this_show_time_to/"
    }
]