[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 54,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l9hv75",
        "author": "turnipsnbeets",
        "title": "Just got the new layout. It’s unusable. Thinking of switching services.",
        "content": "I just tried to browse for a movie to watch and turned off my tv after about 45 seconds. Had to look up what this layout shift was all about. What makes finding a title easy is to categorize and condense the list so you can see a lot of things at once; that's what makes for a good experience. I'm now literally browsing to find something 3 titles at a time I have no comprehension of what I looked at a few clicks back.. no ability to see a group of titles at once and make that nerve wracking decision of should I watch John Wick again or Interstellar? I fucking hate having to decide on a movie sometimes and always love when I find just what I'm looking for, and right now I'm not even going to attempt to find anything on this constricting layout that's just going to frustrate me and not provide literally the experience I'm paying for which is to REALX. Whoever thought this was a good idea..I hope you're reading the feedback. At least give me an option to switch back to the old layout. Shopping other streaming services immediately after I post this.",
        "upvotes": 41,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1l9hv75/just_got_the_new_layout_its_unusable_thinking_of/"
    },
    {
        "id": "1l9b53o",
        "author": "Meko26",
        "title": "I cannot handle the new Netflix update",
        "content": "I can’t handle it, it only allows me to look really at one show at a time and it drives me insane…..\nI find myself going to other streaming services because I dislike it so much?\n\n\nAnyone else agree?????",
        "upvotes": 101,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1l9b53o/i_cannot_handle_the_new_netflix_update/"
    },
    {
        "id": "1l8pzf4",
        "author": "S4v1r1enCh0r4k",
        "title": "David Harbour Says Goodbye to Stranger Things: \"After 10 Years, It’s Time to Move On\"",
        "content": "",
        "upvotes": 966,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1l8pzf4/david_harbour_says_goodbye_to_stranger_things/"
    },
    {
        "id": "1l9q2je",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 36 Films Streaming",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9q2je/the_best_indie_movies_on_netflix_36_films/"
    },
    {
        "id": "1l9q6ed",
        "author": "Full-Metal-Jake-it",
        "title": "Missing program",
        "content": "Last night, I noticed the addition of the docuseries “turning point: the Vietnam war” and I really wanted to watch it but I was laying down to go to sleep. I just tried to find it again about five minutes ago and it won’t pull up anywhere. It was added April 30  2025 so I wouldn’t think it was already taken off. Any ideas?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9q6ed/missing_program/"
    },
    {
        "id": "1l9pxut",
        "author": "oceanicitl",
        "title": "Dept. Q is based on Jussi Adler-Olsen's books",
        "content": "He's written a series of 10 Department Q books based in Copenhagen. I highly recommend them. No the series isn't exactly like the book but it was a very good adaption. Edinburgh had a similar vibe to the Nordic city and the casting was excellent.\n\nIf you enjoyed the show please check out the books and read them in order. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9pxut/dept_q_is_based_on_jussi_adlerolsens_books/"
    },
    {
        "id": "1l98jsy",
        "author": "KarmaDeliveryMan",
        "title": "Why change the UI?",
        "content": "Between attempting to force me to have WWE on My List and not allowing me to remove it and now this new UI, I’m about fed up with this company. The UI was fine. I never had complaints but they felt the need to change it for what reason? They’ll probably charge us more for it too.",
        "upvotes": 15,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l98jsy/why_change_the_ui/"
    },
    {
        "id": "1l9o3vs",
        "author": "Thin_Environment_244",
        "title": "In Your Dreams | Official Teaser | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9o3vs/in_your_dreams_official_teaser_netflix/"
    },
    {
        "id": "1l9o3pi",
        "author": "Pogrebnik",
        "title": "Netflix Reveals Trailer for 'The Diplomat' Season 3, Confirms Fall Release",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9o3pi/netflix_reveals_trailer_for_the_diplomat_season_3/"
    },
    {
        "id": "1l9fr38",
        "author": "Illustrious-Royal162",
        "title": "Shows like Mercy For None",
        "content": "I recently watched Mercy For None and loved how action-packed and fast-paced it was. Do you have any recommendations with a similar vibe?\nI enjoy crime, thriller and revenge action. Movies or series will do. Thank you.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9fr38/shows_like_mercy_for_none/"
    },
    {
        "id": "1l9m60o",
        "author": "Remarkable-Toe-4413",
        "title": "Ginny and Georgia",
        "content": "Season 3 really left me dissatisfied and disappointed. The same drama was dragged out for over 7 hours with only a few twists to keep it going. Georgia, as usual, was busy with her endless rants and chaotic sex life—constantly yapping without much depth.\n\nGinny looked sexy but stayed low-key throughout the season, which felt like a missed opportunity to develop her character. As for Paul, I couldn’t tolerate his forced masculinity and lack of real emotions. He seemed to be living in a bubble of idealism—felt bad for him at times, but not enough to care deeply.\n\nOn the brighter side, I loved Lynette’s character. She was a truly supportive mother and mother-in-law, probably one of the few genuine personalities this season. Meanwhile, Georgia’s so-called friends proved they’re not even loyal to each other, let alone to her. That dynamic felt hollow.\n\nOverall, compared to the previous seasons, this one gets a 6/10 from me. Wouldn’t recommend wasting time on it.\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l9m60o/ginny_and_georgia/"
    },
    {
        "id": "1l9l4ff",
        "author": "muchtoomuch123",
        "title": "us and them chinese movies",
        "content": "i have read a lot of good reviews about this or chinese movie US AN THEM. Can anybody tell if i should really give my 2 hrs to this movie ? is it worth watching or should i skip it ? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9l4ff/us_and_them_chinese_movies/"
    },
    {
        "id": "1l95sum",
        "author": "Steerpike58",
        "title": "Department Q - question about Lyle - SPOILERS",
        "content": "I just finished Dept. Q and loved it!  I loved the writing/dialog, the characters, and the acting.   At first I thought Matthew Goode (Mr nice guy in Downton Abbey) was too 'soft' for this role as Carl, but he turned out great.  And of course, Rose and Ackram nailed it.   I do have a question, which came up already in a response to another thread, but I want to post it here as a new question so it gets more eyeballs. \n\nThe question relates to Lyle (Harry's brother, Ailsa's son), and Sam Haig. I THINK I've got it mostly figured out now, so most of this is how I think it happened, but there are still some questions. \n\nMerritt as a teenager was 'dating' Harry.  She didn't see much of Lyle (Harry's brother) - he just came over occasionally and 'interrupted' them. So I guess there's no reason to think she was that familiar with Lyle.  Meritt, Willliam, Lyle and Harry all live on the remote island of \"Mohr\" - an island that is now in decline due to the demise of the oil industry. \n\nHarry robbed Merritt's household, and during that event, Harry first struck William, but then we later discover that it was Lyle who severely beat William.   The local policeman pursued the event, but mistakenly thought Harry was the culprit and chased him to his death on the ferry.   Merritt came back to Mohr to attend Harry's funeral (and presumably met Lyle again there). \n\nMany years later (10, 15 years?) ('current time'), Lyle is obsessed with Merritt (as a romantic target? Sexual? - not clear).  \n\nLyle has spent a lot of time in an institution, and while there, encountered 'Sam Haig', another inmate.  Sam was smart, and taught Lyle the art of deception / investigation / etc.  Now, Sam and Lyle are both out of captivity and working.  Sam was now an investigative journalist, doing well, driving a Porsche.  Lyle was struggling, working as a grunt on the local ferry. \n\nLyle decides he wants to get closer to Merritt. He knows she is a prosecutor (she's been on TV a few times so 'well known') and decides to impersonate Sam Haig, claiming to want to share information about corruption, etc with Merritt. Merritt finally meets him in a cafe, and 'warms' to him. She has no idea that it is Lyle and she's never met Sam Haig before so has no reason to doubt who he is.  So this is 'issue/question 1' - is it feasible that Merritt would not recognize Lyle 15 years later?  Lyle (as Sam) sleeps with Merritt.  'question 2' - is the real Sam Haig still alive at this point? \n\nIn addition to meeting with Merritt at the hotel on a regular basis for sex, Lyle is spying on her at her home - he's seen by William through the window one night.  So that explains how Lyle knows Merritt's movements. \n\nMerritt loses the case she's working on, and on the spare of the moment, decides to leave, with William, for Mohr on the ferry. \n\nLyle has followed Merritt onto the ferry (since he's been following her in general, this makes sense) and kidnaps her.  But - also on the ferry is Ailsa - Lyle's mum - who assists with the kidnapping.  How could Ailsa be on the ferry that day, given that it was a spare of the moment decision by Merritt to go that day?  Plot Hole? \n\nHaving kidnapped Merritt, Lyle then goes to kill the real Sam Haig at the 'cliff face' to tie up any loose ends, since he's been impersonating him.  Is this the correct timeline for Sam's death - AFTER the kidnap of Merritt? \n\nI don't normally pay this much attention to a show but there was something about the 'style' of this show that really connected with me, so I got really invested.  Now we have to wait to see if there's a second season! \n\nI thought the first 8 episodes were fantastic; I though E9 was a bit 'happy ever after', with the therapist showing up at Carl's house, soft music, etc but it was still great, and did set up for a second season - with the team well-funded and now respected.",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l95sum/department_q_question_about_lyle_spoilers/"
    },
    {
        "id": "1l8uxy5",
        "author": "CuntHuntingBull",
        "title": "How famous Mindhunter among this group?",
        "content": "I have been watching Mindhunter again like 7th time now. I just wonder how famous this  really since I heard it didn't get attention as it needed to be. Also it is costly interms of production.  \n\nI would say it is one of the gold in Netflix and definitely the following seasons would be more catchy. Anyone else thinks the same?",
        "upvotes": 32,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1l8uxy5/how_famous_mindhunter_among_this_group/"
    },
    {
        "id": "1l9mfit",
        "author": "InvestigatorOk9521",
        "title": "How to lock profile settings",
        "content": "Recently, my brother keeps changing my profile settings like my profile picture and my profile language to one that I do not understand on the TV. I have a profile lock set but it seems like the profile settings can be changed without the pin. Is there a way to stop him from changing my profile settings? Thanks in advance.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9mfit/how_to_lock_profile_settings/"
    },
    {
        "id": "1l8nuv1",
        "author": "ApolloApex",
        "title": "“Why ‘OceanGate: The Avoidable Disaster’ would be a more accurate title than ‘tragedy’”",
        "content": "The Netflix documentary frames this as a tragedy, but the reality is that many safety concerns were ignored, and it was a high-risk luxury expedition. The story highlights how ego and money can cloud judgment, leading to preventable disasters. I’m annoyed that they advertise it as a tragedy.",
        "upvotes": 93,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1l8nuv1/why_oceangate_the_avoidable_disaster_would_be_a/"
    },
    {
        "id": "1l9bvmx",
        "author": "Single_Pressure9715",
        "title": "Behind Her Eyes",
        "content": "I finally gave in last Friday, after it kept popping up in my “Top Picks for You.”\n\nThrew on while I was on the stairmaster, just to pass time. But what the hell?! Talk about mind bending\n\nDid anyone else feel really bad for Adam?\nLosing his mom— not physically, of course. But the person she became? He clearly knew she wasn’t the same anymore.\n\nRob is crazy and the whole time I’m thinking Adele was the problem! I can’t imagine wanting someone that badly.\n\nDefinitely a great binge.\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9bvmx/behind_her_eyes/"
    },
    {
        "id": "1l9gc96",
        "author": "S4v1r1enCh0r4k",
        "title": "Here’s What’s Coming to Netflix in July 2025",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l9gc96/heres_whats_coming_to_netflix_in_july_2025/"
    },
    {
        "id": "1l9ahdi",
        "author": "Ok-Permit4484",
        "title": "What series or movie should I start with?",
        "content": "Whenever I hang out with friends someone always starts talking about movies or series, and I’ve never been one to watch many of them because I prefer to be outside. If I wanna be able to at least understand what they’re talking about 😂, which series should I start with? Or movies? What would you say are the most popular ones. Thanks ",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l9ahdi/what_series_or_movie_should_i_start_with/"
    },
    {
        "id": "1l8zh5t",
        "author": "PatienceNo417",
        "title": "Just Finished Anne with an E…",
        "content": "…and I’m so upset it’s OVER. CANCELLED. DONE WITH. I know. I’m late on the bandwagon, but this is truly such a lovely show. It’s just what I needed to watch with all that is going on in this world. \n\nI’m so upset this show was cancelled. Can someone contact Amybeth McNulty to get a movie going? 🥲 I have to see the story of Anne and Gilbert unfold! I want to see Diana grow older! And what about Ka’kwet? Matthew’s chest pain? C’mon Netflix. Let’s partner with whatever Canada wants and make it happen. I’ll be part of the production team if you need help. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l8zh5t/just_finished_anne_with_an_e/"
    },
    {
        "id": "1l98a2q",
        "author": "ToonAdventure",
        "title": "My Melody &amp; Kuromi | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l98a2q/my_melody_kuromi_official_trailer_netflix/"
    },
    {
        "id": "1l9a7f1",
        "author": "NothingIsACoolHand",
        "title": "Emily Arlook On The Mystery Of Rebecca In ‘Nobody Wants This’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9a7f1/emily_arlook_on_the_mystery_of_rebecca_in_nobody/"
    },
    {
        "id": "1l8zagg",
        "author": "_Diogenes_Hosidius_",
        "title": "device is not part of netflix household",
        "content": "This message appeared today while i was watching a movie. This is the first time it happened. I don't live with my family cause i go to university in a different city, but that's never been an issue before. For the record the account is created using my email and i'm paying for it so Netflix locking me out is freakin crazy. Any way to fix this? ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l8zagg/device_is_not_part_of_netflix_household/"
    },
    {
        "id": "1l9gq15",
        "author": "macaroniguess",
        "title": "Limited time show aren’t limited basically",
        "content": "idk why but there are show from 2019 That NETFLIX CLAIMS ARE LIMITED BUT HAVE BEEN ON THE PLATFORM FOR 6 YEARS! SIX YEARS NETFLIX. FIX IT NETFLIX. ITS JUST STUPID!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9gq15/limited_time_show_arent_limited_basically/"
    },
    {
        "id": "1l8xw8b",
        "author": "eduison",
        "title": "Can we please talk about Havoc??",
        "content": "Im fairly new to Reddit, so I don’t know if this has already been discussed. But can we please talk about Havoc? I watched it yesterday and after taking a bit of time to think about the movie, I now ask myself what it was even about. In hindsight it just seems like someone wanted to make a movie about people killing each other and then decided to wrap this motive into a little bit of story. And many have done this before, like in John Wick. But in Havoc.. well I feel like they messed it up. During every major fighting scene I had the same questions: How is she still alive? How did they get here? Where has he been? And the same goes for the scenes afterwards. The fights take do long that I forget what the story is even about and after it ends I’m left wondering what just happened, what is the situation and who’s friend with who now? \n\nIn conclusion, I am not necessarily saying that it was a bad movie. I even think the choreography was quite alright. But it just seemed like it got a bit.. out of hand, I guess.. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8xw8b/can_we_please_talk_about_havoc/"
    },
    {
        "id": "1l8saed",
        "author": "MasterAroma",
        "title": "Anyone here that have watched/watching Tastefully Yours?",
        "content": "I have recently started to watch korean series on Netflix and I have watched the last episode of Tastefully Yours! Have anyone here watched it and what did you think about it? I would give it a 8/10. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8saed/anyone_here_that_have_watchedwatching_tastefully/"
    },
    {
        "id": "1l93fqn",
        "author": "Tianjin936",
        "title": "Prison Princesses - Korean Drama",
        "content": "Surprising heartwarming and happy a women in prison comedy.\nThe story builds slowly but the interactions between the women inmates blossoms to a fun and intimate introspection of Korean women in prison.\nI assume that there is a big license between IRL reality and made for TV presentations of actual life in prison for as this offering is presented..\nNon-the-less, this 10 episode story brings a fun and enlightened experience between disparate women who meld into one spirit.\nExceptionally fun and well worth your time to watch a happy story.\nI actually was surprised that it was so much fun to watch.\nThis is my insignificant take on it.\nHope you also enjoy it.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l93fqn/prison_princesses_korean_drama/"
    },
    {
        "id": "1l92r8y",
        "author": "Knotknighm",
        "title": "Did MASHLE just vanish for anyone else?",
        "content": "I noticed that Netflix had dropped the Season 2 with dub and I started watching it. After 2 episodes it put me on the trailer for Dept. Q and I thought alright it must only have 2 episodes so far. Then I tried to find the series page and it had completely vanished. All I could do was set a reminder for it.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l92r8y/did_mashle_just_vanish_for_anyone_else/"
    },
    {
        "id": "1l8aw7o",
        "author": "PlasticViolinist4041",
        "title": "I want the old UI interface back!",
        "content": "It's awful . can't find anything and you see 4 times less info than before\n\nAnd the \"game\" thing is totally irrelevant to me. I have a Playstation for that\n\nBring the old UI back!\n\nOr at least offer the choice to users to select one or the other",
        "upvotes": 66,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l8aw7o/i_want_the_old_ui_interface_back/"
    },
    {
        "id": "1l99zmr",
        "author": "mjmilian",
        "title": "User uproar on UI Update featured in the UK's most popular newspaper:.",
        "content": "[https://metro.co.uk/2025/06/11/netflix-fans-threaten-cancel-subscriptions-worst-update-possible-23384679/](https://metro.co.uk/2025/06/11/netflix-fans-threaten-cancel-subscriptions-worst-update-possible-23384679/)\n\nAlso here: [https://www.ladbible.com/entertainment/netflix/netflix-users-cancel-subscriptions-new-changes-352850-20240705](https://www.ladbible.com/entertainment/netflix/netflix-users-cancel-subscriptions-new-changes-352850-20240705)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l99zmr/user_uproar_on_ui_update_featured_in_the_uks_most/"
    }
]