[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mpgf7q",
        "author": "ocluf",
        "title": "Oggetto rubato con AirTag – ricompensa di €1000",
        "content": "Ciao a tutti,\n\nDi recente ero in vacanza a Torino e, purtroppo, mi è stato rubato un oggetto molto costoso. Avevo nascosto un AirTag all’interno e ho passato diversi giorni della mia vacanza cercando di rintracciarlo, senza successo. L’AirTag mi ha portato a un luogo a cui non potevo accedere e alla fine ho dovuto lasciare la città.\n\nL’AirTag continua ancora oggi a trasmettere un segnale, quindi spero che il ladro non lo abbia trovato. Tuttavia, non essendo più a Torino, non posso fare altro da solo. Per questo sto riponendo la mia ultima speranza in questo post su Reddit.\n\nPosso condividere la posizione in tempo reale dell’AirTag con altre persone. Ecco la mia proposta: se vuoi aiutarmi, ti invierò la sua posizione. Se noti che si muove nei prossimi giorni e riesci a recuperarlo, offro una ricompensa di €1000 a chi lo riporta indietro.\n\nSe sei interessato, mandami un messaggio privato. Posso anche darti più dettagli sull’oggetto rubato. C’è la possibilità che venga messo in vendita su siti come Subito o Facebook Marketplace. Il tuo aiuto significherebbe moltissimo per me.\n\nORIGINAL ENGLISH TEXT\n\nHey everyone,\n\nI was recently on vacation in Torino, and unfortunately, a very expensive item was stolen from me. I had placed an AirTag inside it and spent several days of my trip trying to track it down without success. The AirTag led me to a location I couldn’t access, and I eventually had to leave the city.\n\nThe AirTag is still sending a signal, so I have hope the thief hasn’t discovered it. However, since I’m no longer in Torino, I can’t take further action myself. That’s why I’m putting my last hope in this Reddit post.\n\nI can share the AirTag’s live location with others. Here’s my proposal: if you’re willing to help, I’ll share its location with you. If you notice it moving in the coming days and you’re able to retrieve it, I’m offering a €1000 reward to whoever recovers it.\n\nIf you’re interested, please DM me. I can also share more details about the stolen item. There’s a chance it could appear for sale on platforms like Subito or Facebook Marketplace. Your help would mean the world to me.",
        "upvotes": 21,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1mpgf7q/oggetto_rubato_con_airtag_ricompensa_di_1000/"
    },
    {
        "id": "1mpnrlz",
        "author": "PublicPractical2358",
        "title": "Gym",
        "content": "Ciao io sono un ragazzo di monca che vorrebbe iniziare palestra mensilmente perche' me la devo pagare io, sono di moncalieri, qualche palestra che non costi troppo? sono disposto anche ad andare lontano.\n\ngrazie per l'aiuto",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mpnrlz/gym/"
    },
    {
        "id": "1mpur19",
        "author": "esme87_",
        "title": "Invasione di libellule?",
        "content": "Stamattina mi sono svegliata e, guardando il cielo, mi sono apparse numerosissime libellule. All’inizio pensavo di essere pazza, invece ce n’erano davvero un centinaio, se non migliaia. La foto non è ottimamente rappresentativa, ma il cielo ne era pieno. A cosa può essere dovuto? Forse alla temperatura?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0w4fce2n3yif1.jpeg?auto=webp&amp;s=82474c41f8a123aa44df03cd39b9e1eb27b64264"
        },
        "permalink": "/r/torino/comments/1mpur19/invasione_di_libellule/"
    },
    {
        "id": "1mpu150",
        "author": "Dangerous_Bite_7601",
        "title": "Opinioni sul lago di Sirio?",
        "content": "Vorremmo fare una gitarella da Torino in qualche zona eventualmente balneabile (ma non è strettamente necessario che lo sia). Ci hanno parlato bene del lago di Sirio qualcuno che c'è stato ha consigli/pareri?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mpu150/opinioni_sul_lago_di_sirio/"
    },
    {
        "id": "1mpbw2w",
        "author": "Slight_Chemistry6585",
        "title": "Raccomandazione per la pizzeria",
        "content": "Nel fine settimana andrò a Torino con la mia ragazza per festeggiare il suo compleanno. Sto cercando una pizzeria che non sia affollata di turisti.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mpbw2w/raccomandazione_per_la_pizzeria/"
    },
    {
        "id": "1mp2eua",
        "author": "OkPin6450",
        "title": "BORSA EDISU",
        "content": "✅✅ BORSA EDISU ✅✅\nciao a tutti! \n\nSono una studentessa internazionale, \nSto preparando la documentazione per borsa e vorrei un chiarimento.\nI miei genitori sono divorziati e vivo solo con mia madre.\nPer la documentazione economica, devo fornire solo il reddito di mia madre e il certificato di divorzio oppure devo includere anche il reddito e i documenti di mio padre? \nGrazie in anticipo. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mp2eua/borsa_edisu/"
    },
    {
        "id": "1mp8u5a",
        "author": "GalacticMaraja",
        "title": "Matricole UniTo (qualcuno sa qualcosa?)",
        "content": "Ciao a tutt*!\nSono un futuro studente di filosofia presso l'Università di Torino. Qualcuno di voi sa se esiste già un gruppo Facebook/Whatsapp/Telegram con le future matricole, non solo di filosofia, ma in generale di UniTo o addirittura della città?\nGrazie.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mp8u5a/matricole_unito_qualcuno_sa_qualcosa/"
    },
    {
        "id": "1mp88va",
        "author": "Murky_Giraffe8700",
        "title": "Treno per Aeroporto",
        "content": "Sto guardando gli orari per andare all'aeroporto da Porta Susa e il tempo di arrivo previsto è di un'ora\n\nVa bene? Ricordo che l'ultima volta ci ho messo molto meno\n\nInoltre, c'è un treno alle 5 del mattino che impiega 15 minuti per arrivare\n\nÈ sicuro prenderlo?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mp88va/treno_per_aeroporto/"
    },
    {
        "id": "1mpl51p",
        "author": "Fit_Variety_3523",
        "title": "Può essere peggio?",
        "content": "Chiesto così per noia a ChatGPT",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9b2hb2rmmvif1.png?auto=webp&amp;s=63c8f737c11f59ec63bd018fc9ed6cab936bfc57"
        },
        "permalink": "/r/torino/comments/1mpl51p/può_essere_peggio/"
    },
    {
        "id": "1moseid",
        "author": "Esp3t0",
        "title": "Looking for Affordable Farmers’ Markets and Grocery Stores",
        "content": "Hello!\nI'm moving to Turin with my wife and will stay for at least 9 months.\n\nI'm looking for tips of good places to shop for fresh produce and groceries at reasonable prices. I’d really appreciate your recommendations for:\n\n- Farmers’ markets with fresh fruits and vegetables\n\n- Grocery stores or supermarkets with good deals\n\n- Any hidden gems for affordable food shopping\n\nAlso, could anyone share an estimate of the average monthly grocery costs for two people in this area? It would help me a lot with budgeting. \n\nThanks in advance!",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1moseid/looking_for_affordable_farmers_markets_and/"
    },
    {
        "id": "1mohw6f",
        "author": "scemo_chi_legge123",
        "title": "dove poter bivaccare",
        "content": "Ciao!\nIo e degli amici vorremmo fare una notte in tenda quindi dovremmo trovare una zona in cui poter bivaccare con la possibilità di accendere un fuoco se possibile. Noi siamo di Torino e potremmo spostarci in prossimità della provincia. Preferiremmo un posto un po' in alto ma non troppo (non siamo alpinisti professionisti hahahah) (per vedere le stelle!!)\nGrazie mille per chiunque risponderà!!\n(punti bonus se il posto ha vicino o sulla strada specchi d'acqua dove poter fare il bagno!!q)\n",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mohw6f/dove_poter_bivaccare/"
    },
    {
        "id": "1mo6ipf",
        "author": "toiletclogger2671",
        "title": "Oulx - Bardonecchia è possibile in bici?",
        "content": "Ciao a tutti, scusate per l'italiano, sono novice ma ho troppo ego per usare un traduttore.\n\n  \nHo un opportunita di vacanza d'ultimo minuto a Briancon la prossima settimana (3g) e voglio andare in bicicletta questo itinerario: montgenevre -&gt; oulx -&gt; bardonecchia -&gt; colle delle scale \n\n  \nC'è un ciclisto o qualcuno che vive nella valle qui?\n\n  \nSto cercando di trovare se è possibile:\n\n\\-So che il colle de montgenevre è molto utilizzato - è meglio la mattina presto (\\~7:00)? Ci sono lavoratori fra frontieri?\n\n\\-Vedo che la strada unica fra Oulx e Bardonecchia è una strada statale ma c'è l'autostrada parallelo ad esso. Significa chè 90% delle auto usa l'autostrada? \n\n\\-Non ho andato mai (ancora) in italia ma tutti qui dicono che gli conduttore vengono dall'inferno. Sto per morrire o è vero solo in roma e sud?\n\n\\-Nella riscerca ho visto che Bardonnechia aveva un grande landslide a luglio ma non trovo niente piu nuovo . Qualcuno è stato recentemente o sa?\n\n  \nGrazie ",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mo6ipf/oulx_bardonecchia_è_possibile_in_bici/"
    },
    {
        "id": "1mo7euh",
        "author": "Apoworld",
        "title": "Dune Uprising/Bloodlines",
        "content": "Ciao :)\n\nSiamo un gruppo di 4/5 amici che si ritrovano spesso a giocare al gioco da tavola Dune Uprising - o Insurrezione in italiano (fra poco ci arriverà l’espansione Bloodlines - o Lignaggi in italiano).\n\nC’è qualche altro giocatore a Torino che nel caso vorrebbe unirsi ogni tanto?",
        "upvotes": 3,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cwwk7kcj1lif1.jpeg?auto=webp&amp;s=abdabc5b0425c08ab50ee2c74e5c8ba03c869d5d"
        },
        "permalink": "/r/torino/comments/1mo7euh/dune_uprisingbloodlines/"
    },
    {
        "id": "1mo9c4s",
        "author": "mozambique_best_gun",
        "title": "Personalizzazione maglie da calcio",
        "content": "Domenica ho acquistato due magliette dell'arsenal, purtroppo però nello store adidas non era a disposizione il servizio di personalizzazione. \nSapreste consigliarmi un negozio/sito che possa personalizzare le magliette con il font  della woman's super league? (WSL) \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mo9c4s/personalizzazione_maglie_da_calcio/"
    },
    {
        "id": "1mo9bdr",
        "author": "FreeAd8663",
        "title": "Festa birrificio Curtis Canava di Bairo Canavese giorno 14 agosto 2025, con concerto della Only One Black band (Hard rock, Heavy Metal, Progressive)",
        "content": "Mi scuso, ripubblico il post poiché il correttore aveva deciso di cambiare nel titolo il nome del locale da Canava a Cantava... vabbè che suonerà una band ma certe volte questi aiuti fanno solo danni.\n\nRiproviamo.\n\nGiovedì 14/08 presso il birrificio Curtis Canava di Bairo Canavese si terrà festeggerà  l' 11° anniversario e per l'occasione scorreranno fiumi di birra, con spettacoli infuocati e concerto live della band piemontese, giovane ma davvero talentuosa, degli Only One Black, che porterà sul palco inediti in stile Progressive e versioni personali di tanti successi, principalmente Hard Rock &amp; Heavy Metal.\n\nSe desiderate passare una serata mangiando di gusto (e bevendo il giusto) e ascoltando tanta ottima musica, rigorosamente live, questa festa potrebbe davvero fare al vostro caso!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/auz0o5jyflif1.jpeg?auto=webp&amp;s=b2c6d70ee3c90d057e140fcca34a79ec1d9b773e"
        },
        "permalink": "/r/torino/comments/1mo9bdr/festa_birrificio_curtis_canava_di_bairo_canavese/"
    },
    {
        "id": "1mod2ag",
        "author": "LizaBean24",
        "title": "Travel to Torino — last minute car rental or private transfer",
        "content": "Hi everyone,\n\nI’m arriving in Turin very soon and need to get to Mougins, France. Looking for advice on last-minute options for either:\n\t•\tRenting a car (preferably automatic, with cross-border permission to France)\n\t•\tBooking a private transfer from Turin to Mougins\n\nWould love recommendations for:\n\t•\tReliable local rental agencies besides the big international brands\n\t•\tPrivate driver/transfer services that can handle cross-border trips on short notice\n\t•\tAny tips to avoid crazy one-way or cross-border fees\n\nThanks in advance for any help — I’m trying to sort this quickly so any leads or personal experiences are hugely appreciated!!!!\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mod2ag/travel_to_torino_last_minute_car_rental_or/"
    },
    {
        "id": "1mo7ngc",
        "author": "Answere_08",
        "title": "Aiuto ricerca meccanico",
        "content": "Buona sera a tutti, mi trovo a Torino con l’auto per alcuni giorni, ma nel tornare ho sentito strani rumori che un po’ mi preoccupano per il ritorno… chi mi consiglia un meccanico che non mi spenni solo perché vengo da fuori? Intanto sto in zona Lingotto",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mo7ngc/aiuto_ricerca_meccanico/"
    },
    {
        "id": "1mo7ivt",
        "author": "Ok-Palpitation-1086",
        "title": "Cerco amicizie LGBT ecc",
        "content": "Cerco amicizie su Torino e provincia sia LGBT che etero, per fare delle cose insieme, andare al cinema, discutere di arte ecc",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mo7ivt/cerco_amicizie_lgbt_ecc/"
    },
    {
        "id": "1mniqtr",
        "author": "sunurban_trn",
        "title": "Migliore migliorissimo ristorante specializzato in pesce?",
        "content": "Ciao taurinensi, voglio portare la mia bella a cena per una sera che siamo senza pupo. Tema della serata: pesce (pun intended). Dove la porto per una cena come se deve mangiando le delizie del mare?",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mniqtr/migliore_migliorissimo_ristorante_specializzato/"
    },
    {
        "id": "1mnzfb7",
        "author": "Pretty-Gur-6902",
        "title": "fare amicizia",
        "content": "Ciao a tutti, sto usando un traduttore, quindi spero che funzioni. Mi piacerebbe chiacchierare con la gente del posto, magari qualche donna, e scoprire di più sull'Italia, la sua cultura, il cibo e la sua gente. C'è qualcuno interessato a fare amicizia?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mnzfb7/fare_amicizia/"
    },
    {
        "id": "1mnd7mn",
        "author": "Difficult_Bowl7351",
        "title": "Fancy restaurant for anniversary",
        "content": "Hi all. I'm going to Torino with my husband in the beginning of October and I am looking for a nice restaurant for our Anniversary. \nIt can be more to the expensive side (but not overpriced for what you get), preferably more creative dishes with exiting flavors rather than traditional cuisine. Good wines are also a plus. Reachable by public transport or Uber.\n\nThank you in advance!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mnd7mn/fancy_restaurant_for_anniversary/"
    },
    {
        "id": "1mnb3tp",
        "author": "Potential-Annual7427",
        "title": "Cerco psicologo a Torino Sud",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mnb3tp/cerco_psicologo_a_torino_sud/"
    },
    {
        "id": "1mmoai8",
        "author": "FantasticKoala4168",
        "title": "Looking for Federico from Torino – EasyJet Lisbon → Milan Linate",
        "content": "Hi everyone,\nThis is a long shot, but Reddit has pulled off stranger reunions.\n\nEarlier today I met a guy named Federico from Torino on my EasyJet flight from Lisbon to Milan Linate. He’s late 20s/early 30s, brown hair in a bun, speaks French and Italian, and seems like he’s well travelled. He’s currently in Torino visiting his family.\n\nNot sure if he’s single — I just know I enjoyed our conversation and would like to finish it. If you know him, give him a nudge toward this post.",
        "upvotes": 43,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mmoai8/looking_for_federico_from_torino_easyjet_lisbon/"
    },
    {
        "id": "1mnd9is",
        "author": "Top-Researcher3197",
        "title": "Qualcuno vuole fumarsi una cannetta? Torino è vuotaa",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mnd9is/qualcuno_vuole_fumarsi_una_cannetta_torino_è/"
    },
    {
        "id": "1mm3jx9",
        "author": "Quentin_T84",
        "title": "Luna dello Storione",
        "content": "Scatto amatoriale della🌛 dello Storione. Volvera (TO) 10/08/2025",
        "upvotes": 34,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wqdzr31yw2if1.jpeg?auto=webp&amp;s=39bac8f8804390b42d68673fd93fa3f6a5a4b801"
        },
        "permalink": "/r/torino/comments/1mm3jx9/luna_dello_storione/"
    },
    {
        "id": "1mmc1tm",
        "author": "borisbanana77",
        "title": "Torino's Questora vs. UniTo students",
        "content": "It seems like recently the Questura in Torino changed the needed documents to apply or renew students' Permesso di Soggiorno.\n\nUp until now, they required a simple approval (self-declaration) from UniTo that the student is enlisted for the following semester or year.\n\nThey now \\*allegedly\\* require that document to be officially sign, which costs 32 euros (!!!) and getting it as a signed copy takes quite a few steps.\n\nDid you recently go through the process of \\*newing\\* a Permesso di Soggiorno and a student from University of Torino?  \nI suspect it might be related to the country of origin of students. If you will, please share what passport you hold.\n\n  \nEdit: misspelled Questura, can't edit tittle :(",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1mmc1tm/torinos_questora_vs_unito_students/"
    },
    {
        "id": "1mmcrcj",
        "author": "farouchska",
        "title": "how easy to meet people in torino?",
        "content": "Hi! I am 24yo, I am german and thinking about moving to Torino for 6 months (I work remote but with an Italian contract so I gotta live in Italy). I was wondering how easy it is to meet other young people In Torino. I have lived in cities like Brussels where the overall vibe is vibrant and there is always something to do, people to meet, etc, and I really love this vibe. Therefore I was wondering how living in Torino would be regarding this aspect. Is there a big european/international scene? Thank you in advance for any answers! :)",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1mmcrcj/how_easy_to_meet_people_in_torino/"
    },
    {
        "id": "1mmjexl",
        "author": "Wasting_my_time_FR",
        "title": "One-day stay in Torino",
        "content": "Hi everyone, I will be for a few hours in Torino on Monday and I was wondering what you would advise me to do during this time? \nI would like also to find a great restaurant that proposes local cuisine.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mmjexl/oneday_stay_in_torino/"
    },
    {
        "id": "1mm18pt",
        "author": "Murky-Ad3318",
        "title": "Furto (ennesimo) Cellulare",
        "content": "Ciao a tutti e la prima volta che scrivo, ma leggo sempre tutti, volevo raccontare un episodio accaduto oggi, tra corso 11 Febbraio e via Pisano, ho assistito al furto di un cellulare. Il ladro è scappato a piedi verso Porta Palazzo; alcune persone hanno provato a inseguirlo in auto e un tizio con la moto, ma si è dileguato.\n\nIo e la mia fidanzata siamo rimasti fermi, io bloccato dal pensiero: e se lo inseguo e poi mi ritrova sotto casa? Vivendo nello stesso quartiere, la paura non è irrazionale.\n\nDa un lato rabbia e frustrazione per non aver fatto nulla, dall’altro ammirazione per chi ci ha provato.\nVoi cosa avreste fatto? Vale la pena rischiare o è meglio pensare prima alla propria sicurezza?\n\n(Premetto che da casa ne ho sentiti altri, la classica ragazza che urlava aiuto al cellulare, ma oggi è stato diverso, da oggi il telefono resta sempre in tasca davvero)",
        "upvotes": 17,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1mm18pt/furto_ennesimo_cellulare/"
    },
    {
        "id": "1mm4yvd",
        "author": "Hot-Garage-4536",
        "title": "Giornata estetista",
        "content": "Buongiorno a tutti,\nvorrei un consiglio per un regalo. \nVorrei fare a una mia amica una giornata di massaggi, cura del viso, unghie, piega ecc… in cui la trattino bene e si possa riposare. C’è un posso che offra questi servizi a Torino e che li gestisca bene? Magari facendomi pagare un pacchetto e non tanti servizi separatamente?\nGrazie per l’aiuto, spero esista qualcosa di questo tipo :,,)",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mm4yvd/giornata_estetista/"
    }
]