[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 20,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pfanad",
        "author": "HehroMaraFara",
        "title": "What was everyone’s dumbest thing from S5 of Stranger Things so far?",
        "content": "So much to choose from, but for me it was to be the end of episode 4 when the Demogorgons get to the base. \n\nThe soldiers….standing in literal circle around one of them all firing at….each other essentially. Whoever directed and edited that has to of been operating in a coma. All of them would have killed each other. ",
        "upvotes": 120,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1pfanad/what_was_everyones_dumbest_thing_from_s5_of/"
    },
    {
        "id": "1petx4m",
        "author": "TheMirrorUS",
        "title": "BREAKING: Netflix acquires Warner Bros in $83 billion deal after tense bidding war",
        "content": "",
        "upvotes": 864,
        "comments": 228,
        "media": null,
        "permalink": "/r/netflix/comments/1petx4m/breaking_netflix_acquires_warner_bros_in_83/"
    },
    {
        "id": "1pfgn40",
        "author": "Dark_Schneider28",
        "title": "\"I Am Not Okay With This\" deserves a second Season ong",
        "content": "Jjst finished watching it (ik im veryyyy latee), and the ending was crazy, I mean ik they stopped it cause of covid but didn't they continue after the pandemic stopped? Like did they just forget abt it? Shd Ik smt that I dont?. I just need a season 2😭😭",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pfgn40/i_am_not_okay_with_this_deserves_a_second_season/"
    },
    {
        "id": "1pfgzsh",
        "author": "cheno103",
        "title": "Owning Manhattan's jaw-dropping $250m NYC penthouse finally sold at massive discount after Ryan Serhant's team fails",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pfgzsh/owning_manhattans_jawdropping_250m_nyc_penthouse/"
    },
    {
        "id": "1pexbm3",
        "author": "businessinsider",
        "title": "Netflix investors don't seem to like its blockbuster deal with Warner Bros. Discovery",
        "content": "",
        "upvotes": 62,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1pexbm3/netflix_investors_dont_seem_to_like_its/"
    },
    {
        "id": "1pfihs1",
        "author": "Next-Material-292",
        "title": "What's this tv show? (No these weren't dreams)",
        "content": "(edit) the show is creeped out\n\n\nSo I'm trying to remember this tv show from like 2014-2018 that was on Netflix and it was not horror but like cryptid and every episode was either connected or not connected (no it's not black mirror) one episode was about a girl who was talking to someone on like a phone and she was being harassed and they she got turned ugly for some reason. Another episode was there was this well in this kids back yard that did something I can't remember what I'm pretty sure it was time traveling forward. Another episode was about a puppeteer on a beach and he turned a little kid into a puppet. I can't remember any more episodes but I remember the show being awesome and I want to watch it again.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pfihs1/whats_this_tv_show_no_these_werent_dreams/"
    },
    {
        "id": "1pfjaud",
        "author": "lostfrequency13",
        "title": "Tell about your Favourite show/webseries/movie briefly",
        "content": "What is truly special about it? What makes it different from others in its genre?\nWhy should anybody watch it? What is the main reason that makes it worth spending time on?\nHow can this show help me or entertain me? Does it make you think deeply, feel emotionally connected, laugh, learn something, or escape from stress?\nWhat impact does it leave on the viewer after finishing it?\nDoes it have strong characters, deep storytelling, great acting, suspense, comedy, emotions, or meaningful messages?\nCan you explain in detail what makes the audience stay hooked and what makes this show memorable?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfjaud/tell_about_your_favourite_showwebseriesmovie/"
    },
    {
        "id": "1pfkqhc",
        "author": "DismalShallot2513",
        "title": "Addictivness of TV shows",
        "content": "I assume everybody here is aware of the release of the new season of \"Stranger Things\", so I'm no different and decided to watch it as soon as someone told me about it.\n\nI'm not a big a fan of watching any kind of TV shows — at most I would watch a movie once a month and that's pretty much it. And the thing that got me really confused about this new season of Stranger Things is that it's not even the plot, or atmosphere that makes you binge watch it as soon as you finish 1st episode — it's the effects, cuts, timing and how it's put together that makes you want to watch it.\n\nLet me cllarify it for you: when you watch movies (or some TV shows too, like Better Call Saul) from 10-20 years ago like Matrix, Inception, Shutter island you just want to keep watching it because of how amazed you are by the plot and the twists are so unpredictable that you have these \"a-ha\" moments where you picture the whole image in your head with the wow effect.\n\nIn case with this new season though, the plot itself seemed okay to me, but while watching it I had a feeling that I'm watching tiktok lol. Just how fast-paced it seemed to me and the constant change of the enviroment, going back and forth between characters. As soon as you supposed to get bored and chill, produecer hits you with another dopamine hit to keep you engaged. So after watching first episode I turned it off as I knew where it was leading — watching it until 4 am.\n\nIf that't the case, it's not necessarily a bad thing — they are just evolving to attention span of its users and that's it.\n\n**Is it just my observation or there's somebody else who also felt that way? How do they make them so addictive to keep watching and what are the tricks that are using?**",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfkqhc/addictivness_of_tv_shows/"
    },
    {
        "id": "1pfk6yw",
        "author": "morecoffeemore",
        "title": "Was our planet 1 and 2 ever released on disc?",
        "content": "Would like to down a 4k/uhd blue ray disc of our planet 1 and 2. Just better quality than streaming. \n\nWas it ever released on disc/will it ever be released on disc?\n\nThanks. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfk6yw/was_our_planet_1_and_2_ever_released_on_disc/"
    },
    {
        "id": "1pfk52z",
        "author": "Hot-Slide-7305",
        "title": "Horror",
        "content": "I love horror TV shows and certainly love horror movies to, I'm a big fan of Stranger Things, to others that have been watching Stranger Things to, do you think there is any other TV show that I may like that in a way it is similar to stranger things ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfk52z/horror/"
    },
    {
        "id": "1pfk12h",
        "author": "1991fly",
        "title": "Thanks for excellent customer service",
        "content": "I got the cryptic \"something went wrong\" error code 7006 today. The customer \"service\" agents deftly checked my identity, but never asked the content call that triggered the error. I pay for content access: I shouldn't find you're no longer carrying content from 3rd party source.,",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pfk12h/thanks_for_excellent_customer_service/"
    },
    {
        "id": "1pfjaet",
        "author": "blizeH",
        "title": "How come I can block titles from my profile, but not my Kids profile? Is there a workaround?",
        "content": "Hi, my son can now find his way around Netflix pretty well and I’d love to block some shows from his profile - I can do this fine for mine, but on his profile the option isn’t even there\n\nAm I doing something wrong? Thank you ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pfjaet/how_come_i_can_block_titles_from_my_profile_but/"
    },
    {
        "id": "1pel907",
        "author": "somacula",
        "title": "Netflix Wins the Warner Bros. Discovery Bidding War, Enters Exclusive Deal Talks - The streaming giant hit the magic $30-a-share target and has an exclusive window to negotiate a final deal.",
        "content": "That's a wrap.",
        "upvotes": 146,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1pel907/netflix_wins_the_warner_bros_discovery_bidding/"
    },
    {
        "id": "1pfgiqu",
        "author": "lilnoah27",
        "title": "Audio Description automatically turning on",
        "content": "Not sure how to fix this, but when I watch Netflix specifically on my phone, every time a new episode of a show starts or a new movie starts that’s has “English-Audio Description” available, it turns on and I have to turn it off every time and it’s so annoying. Plus, it only does it on my phone, not my TV or any other device I’ve used on the same account ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfgiqu/audio_description_automatically_turning_on/"
    },
    {
        "id": "1pfg0gz",
        "author": "harpreetthind",
        "title": "Movies suggestions on Netfli",
        "content": "Just got done watching the beast and me such a great show. Does anybody have any other recommendations? Need something new to watch now? thanks for the suggestions.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfg0gz/movies_suggestions_on_netfli/"
    },
    {
        "id": "1pem9ht",
        "author": "Obvious_Shoe7302",
        "title": "Netflix Wins Bidding War For Warner Bros. Discovery, Starts Exclusive Deal Talks",
        "content": "",
        "upvotes": 63,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pem9ht/netflix_wins_bidding_war_for_warner_bros/"
    },
    {
        "id": "1peruai",
        "author": "Purple_Pay_1274",
        "title": "Is anyone else watching  Victoria? I find one thing super distracting?",
        "content": "Generally enjoying the show Victoria, but there is one thing that takes me out of the show every time I notice it. The (gorgeous and talented) actress who plays the queen is wearing the most god awful blue contacts. Everytime she is in the light she literally looks like a twilight vampire with these huge cheap looking contacts sitting unnaturally over her eyes.\n\nOf course I understand that the real queen had large blue eyes, but I hate the way these contacts look and it’s all I can look at in any scene where she’s in the light. No one else on the show has such strange contacts in… \n\nIt honestly looks like she is wearing gag gift/Halloween costume contact lenses sometimes! Has anyone else noticed this? I am only on season one, so do they get better over time? Or is this something I should just do better ignoring? It seems strange to me that a show that went to such lengths to have amazing costumes, sets, and historical accuracy would allow such a wildly weird element and expect people not to notice. ",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1peruai/is_anyone_else_watching_victoria_i_find_one_thing/"
    },
    {
        "id": "1pfdus1",
        "author": "Timewilltell755",
        "title": "I wanted to like Jake Kelly?",
        "content": "But the dialogue was just not natural.  I didn’t feel much chemistry with between anyone.  The dialogue between Adam Sandler and Laura Deron about her leaving him at the Eiffel Tower 19 years ago was just so contrived and kind of ridiculous.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfdus1/i_wanted_to_like_jake_kelly/"
    },
    {
        "id": "1pemlo8",
        "author": "Easy_Pen5356",
        "title": "Thoughts on Unbreakable Kimmy Schmidt?",
        "content": "I’m new to Netflix. I’m looking for a good show to watch! I’m looking for something lighthearted to watch while I pack since I’m moving and got recommended this show by my sister, but I’ve heard mixed reviews while I’ve been briefly looking..\n\nSo just wanted some firsthand opinions without spoilers! I just tried to watch Schitt’s Creek and found it too slow even though I heard it gets better. I’m gonna come back to it.\n\n(I’ve liked shows like the office and superstore in the past I tend to watch more lighthearted, shows where you don’t have to follow the plot with every detail)",
        "upvotes": 42,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pemlo8/thoughts_on_unbreakable_kimmy_schmidt/"
    },
    {
        "id": "1pf2adk",
        "author": "janeofalltradez1",
        "title": "Annoyed please help!",
        "content": "Is there any way to get the shows/movies to stop immediately starting? The new layout is driving me nuts when I wanna see similar suggestions or taking a movie off my list. I feel like im old and they've changed the grocery store around. Is there anyway to get it to bring the menu up again when clicking a show/movie? Or am I stuck w it starting right away and having to try and navigate the icons at the bottom. Thank you! ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pf2adk/annoyed_please_help/"
    },
    {
        "id": "1pfao5k",
        "author": "Fit_Stomach_6483",
        "title": "Zerocalcare deserves more attention from people outside Italy!",
        "content": "Zerocalcare is an Italian illustrator who has made two animated shows on Netflix \"Tear along the dotted line\" and \"This world can't tear me down\" but since he's Italian himself and speaks italian with a specific accent called \"roman\" accent, it might be difficult to understand him. It's mostly aimed towards Italian speaking people. But people outside Italy should definitely give zerocalcare a try and watch his shows and maybe even read his graphic novels. I really just think that people are Missing out on something peak. He's already pretty well known in Spanish talking countries, like south America and Spain.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pfao5k/zerocalcare_deserves_more_attention_from_people/"
    },
    {
        "id": "1pf1oqq",
        "author": "Prestigious-Suit746",
        "title": "Cannot get rid of menu overlay",
        "content": "Not sure if I'm phrasing it correctly but for 1 certain show it won't remove the overlay.\nIf I go back to the menu it forgets my progress in the show. \n\nI've tried other shows and they don't have this issue. \n\nI can't press pause, only button that works is the back button or home button. \nIt seems like it is not registering that I'm watching something as it constantly jumps to the \"sleep menu that you usually get from being idle in netflix main menu\"\n\n\nAnyone know how to fix this?\nI tried reopening netflix but it didn't help",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1oqq/cannot_get_rid_of_menu_overlay/"
    },
    {
        "id": "1pf5p6e",
        "author": "willemavjc",
        "title": "Airing over months: Yes or No?",
        "content": "Receiving those notifications:\n\n— \n\nNew Episode [Your show] is waiting for you. This episode is all new. Take a break and watch now. \n\n—\n\n…make me actually react like this:\n\n*No, you [censored] bunch of directors. You chose to air the show you made over months. I’m fed up waiting for the next episodes to come, and I’ve started to lose how it all started anyway now.*\n\nGenuinely curious to know if this is pissing other people too. The Netflix I first subscribed to had not this business model, which I hate so much.\n\nI would have made a poll but this is forbidden, here. So, are some of you getting fed up with how Netflix is heading?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pf5p6e/airing_over_months_yes_or_no/"
    },
    {
        "id": "1pf9v83",
        "author": "Due_Let_8691",
        "title": "Dinner time live with David Chang waitress Mandy",
        "content": "What is the waitress full name on dinner time live with David Chang? I found out her first name is Mandy but when I try to look her up it just shows Mandy more ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pf9v83/dinner_time_live_with_david_chang_waitress_mandy/"
    },
    {
        "id": "1pf4ajq",
        "author": "TheoryBrief9375",
        "title": "How to find out what's coming to UK netflix?",
        "content": "Brit here, when I try searching online for this, all I get is us information, which can differ from the content of the UK version quite a bit \n\nI often want to look a month ahead to see what's going to be released",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pf4ajq/how_to_find_out_whats_coming_to_uk_netflix/"
    },
    {
        "id": "1pexzp1",
        "author": "DesperateAuthor3493",
        "title": "Netflix not loading on windows app and chrome",
        "content": "its in white screen and is stuck loading. Netlix doesnt work on chrome, edge and the software on PC. I have turned off every extension, neflix only works on firefox fine elsewhere its just a white screen and not loading   \nBtw i just got netflix like a few minutes ago even restarted my pc ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pexzp1/netflix_not_loading_on_windows_app_and_chrome/"
    },
    {
        "id": "1pecmsn",
        "author": "LollipopChainsawZz",
        "title": "Netflix is leading bidder for Warner Bros. Discovery: Sources",
        "content": "",
        "upvotes": 53,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pecmsn/netflix_is_leading_bidder_for_warner_bros/"
    },
    {
        "id": "1pf3bmi",
        "author": "KevinsThrone",
        "title": "Squid game idea",
        "content": "In the Dalgona game in squid game they should have made the star a square and the umbrella the shape of the frontman’s mask who agrees you should like",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pf3bmi/squid_game_idea/"
    }
]