[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 476,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gpynmr",
        "author": "opheliasdinosaur",
        "title": "Stop first season cliffhangers",
        "content": "Is anyone else ever really frustrated with a good, unique first series that ends on a cliff hanger and then gets cancelled because it didn't hit the top 5 viewing figures in week 1 or 2?\n\nNetflix needs to stop this crap. Either have a rule that all first seasons have a closed story arc or give shows time to build viewership.\n\nGood example - dead boy detectives = I'm devastated there's no season 2, but it was a closed arc, all major ploy points resolved and I don't feel that netflix stole 8 hours of my life.\n\nBad example - the midnight club, or a whole bunch of others that I had on a watch list and then removed when I found out they were cancelled but left on a cliff hanger. I have no incentive to watch them now. \n\nAt least where there is a closed arc, I may still go and watch a cancelled show.\n\nDoes anyone else feel like this?",
        "upvotes": 79,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1gpynmr/stop_first_season_cliffhangers/"
    },
    {
        "id": "1gpxwsn",
        "author": "D01211",
        "title": "Netflix offers lower quality  for extra members ",
        "content": "I’ve noticed that 4K isn’t available on my account that has been invited as an extra member to a 4K account. Looks like Netflix lowers the quality on the extra account if you purchased the plan with ads even if the main account is 4K. This isn’t communicated anywhere on the website as the website clearly says:\n\nThe same video and audio quality as the member who invited them.\n\nI asked the customer service and apparently you have to contact them in order to find out that the plan you’ve purchased is different to what Netflix advertises. ",
        "upvotes": 48,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gpxwsn/netflix_offers_lower_quality_for_extra_members/"
    },
    {
        "id": "1gq7a6x",
        "author": "LetterheadFun3697",
        "title": "'Avatar: The Last Airbender' Season 2 Finds Its Joo Dee, Long Feng, The Boulder and Casts 'Sympathizer' Star Hoa Xuande",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7a6x/avatar_the_last_airbender_season_2_finds_its_joo/"
    },
    {
        "id": "1gq7ja4",
        "author": "ColleenLotR",
        "title": "Why do people fall for fake Netflix posters?",
        "content": "Like I just saw a CLEARLY non-official page post about Wednesday coming out on November 23rd and im like, this poster is clearly fake, it doesn't even look professionally edited, the outfits are from the first season, and there is nothing about the page even in the title alone to indicate its a credible source, so people should know better right?\n\nWrong. So many people commenting \"Finally!\" \"Oh I can't wait i will have to set a reminder!\" \"So excited!\" \"I hope this is real!\" Etc like I genuinely don't understand how *so many people* are *that* gullible. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7ja4/why_do_people_fall_for_fake_netflix_posters/"
    },
    {
        "id": "1gpas31",
        "author": "Kamala_lost",
        "title": "Enough Mark Wahlberg!",
        "content": "He plays the same character in every movie! He's not that charasmatic and in my opinion can't carry a movie alone. He's fine in something like The Departed. He must have one hell of an agent - he is the star in half the movies on Netflix. \n\nAlso, Chris Pratt is not a good voice actor. I wanted to watch the new Garfield movie but can't tolerate his voice acting. \n\nBoth Wahlberg and Pratt are better off in ensemble casts - they're not interesting enough on their own.  ",
        "upvotes": 664,
        "comments": 171,
        "media": null,
        "permalink": "/r/netflix/comments/1gpas31/enough_mark_wahlberg/"
    },
    {
        "id": "1gq8a05",
        "author": "Historical-Pizza6330",
        "title": "Need some help",
        "content": "\n\nHey everyone, I’m having a frustrating issue with Netflix and hoping someone here can help. Whenever I try to watch certain shows or movies \"mostly happens using the netflix app\", instead of giving me the “Play” option, it just says “Remind Me.” I’m unable to watch anything I want because it keeps showing this button, even on shows I’ve watched before. I’ve tried logging out and back in, restarting my device, and even uninstalling and reinstalling the app, but nothing seems to fix it. It happens across multiple devices, so I don’t think it’s a problem with just one. Has anyone experienced this, or does anyone know what’s causing it and how to fix it? Any advice would be greatly appreciated – I just want to be able to watch my shows again! Thanks in advance!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq8a05/need_some_help/"
    },
    {
        "id": "1gq9hn3",
        "author": "Last_Day_2282",
        "title": "Help me find this show. ",
        "content": "I’ve been driving myself absolutely insane over this. \nSo, back in 2017ish, 2015-2018, I watched this show on Netflix. It was a limited series (one season) about a crime/psychological mystery thriller with a detective who was hunting a serial killer. I remember him with brown hair and kind of looked like the actor who plays Kronk? He was friends or became friends with this other middle age man with blonde hair (I see his face so vividly but do NOT know where he’s from). \nI’m pretty sure the “friend” the detective made was actually the father or step father of this girl who was killed by the serial killer. There’s a plot twist at the end that I don’t want to say, but the show was so damn good. \nI think they took it off Netflix, I can’t find it. I think the title was like one word? Something really unexpected idk it might have started with an S. \n\nPLEASE HELP ME IVE BEEN GOOGLING FOR HOURS AND GOT NOTHING",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gq9hn3/help_me_find_this_show/"
    },
    {
        "id": "1gpqr6c",
        "author": "AffectionateBit5872",
        "title": "Why is every new show 6 eps?",
        "content": "The diplomat is my favorite show on Netflix and it's 6 ep run was way to short compared to it's 8 ep first season which also felt to short. As well as the excellent new show Territory was only 6 eps. I was also looking ahead and 2 shows I'm insanely excited for Black Doves and American Primevil are also going to be only 6 eps. It's insane that every few years it feels like they push the ep count lower. Which is extra crazy because they count shows on minutes watched which basically sets new shows up to fail and is the reason we have no new shows.",
        "upvotes": 23,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqr6c/why_is_every_new_show_6_eps/"
    },
    {
        "id": "1gq8kbq",
        "author": "amigoreview",
        "title": "Alita: Battle Angel Advertised as 4K, but Playing Back in 1080p?",
        "content": "I recently came across a report from [4KFilmDb](https://4kfilmdb.com/) about some streaming quality issues on Netflix. *Alita: Battle Angel* is listed as 4K in both Australia and the UK, but it seems the actual playback resolution is only 1080p with a bitrate around 3.3 Mbps.\n\nFor those who keep an eye on Netflix quality, it’s not uncommon for streaming platforms to advertise a title as 4K while delivering at HD quality instead. Just to rule out network issues on my side, I upgraded to a 750 Mbps plan and receive a steady 940 Mbps via Ethernet, so speed limitations aren't a factor here.\n\nDoes anyone else see the same with *Alita* or other Netflix titles? If you have access to Netflix's \"Stats for Nerds\" menu, it'd be interesting to compare results!\n\nhttps://preview.redd.it/3anw95aatm0e1.png?width=1938&amp;format=png&amp;auto=webp&amp;s=2708dc9676d68a801737675e500530b44f344b14",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gq8kbq/alita_battle_angel_advertised_as_4k_but_playing/"
    },
    {
        "id": "1gqdzhu",
        "author": "MarcelinosPrizFightr",
        "title": "Paul Tyson fight",
        "content": "I won’t be able to watch live at home.  Does anybody know if it will be available on a Netflix app on my phone? Will it be available on replay post live event?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqdzhu/paul_tyson_fight/"
    },
    {
        "id": "1gq7w5h",
        "author": "tiredandstressedokay",
        "title": "Pandemic is Over: Is Re-renewing \"I Am Not Okay With This\" a possibility?",
        "content": "What do you all think? I came across an article stating that \"I Am Not Okay With This\" could have filled the void left by \"Stranger Things\" but it was squandered due to Covid. I think it could still work. There was concerns of cast member aging out of their roles. For most of the cast members they hadn't aged a day (Exception for Aidan Wojtak-Hissong who plays Liam). It was genuinely a great show, the reason it was probably renewed initially before Covid. They had already been working on the script. Do you think it's possible to produce a Season 2?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7w5h/pandemic_is_over_is_rerenewing_i_am_not_okay_with/"
    },
    {
        "id": "1gqgddd",
        "author": "sunsetpark12345",
        "title": "Anyone watch Dan Da Dan, and can you help me with trigger warnings?",
        "content": "I've watched the first couple of episodes of this and there is so much to love! The animation absolutely blows me away, and the romantic tension is surprisingly nuanced and believable.\n\nBut the first episode has an almost-rape scene that was extremely hard for me to get through. It was presented as simultaneously menacing and titillating, and it was rather drawn out. &gt;!The character is ultimately rescued before anything really happens so it was okay, but still. There's a giant metal phallus brandished with the promise to hurt and ultimately kill her with it while she's strapped to a table in her underwear - it's really triggering.!&lt;\n\nI need to know if this is a theme that's going to keep recurring, and how bad it gets. If you can give me an idea while minimizing spoilers, that would be great. Like *many* people, I have SA in my background. My love for good animation is strong, but not enough to retraumatize myself.\n\nEven if the answer is \"Yes it comes up repeatedly, but only in X number of episodes, and no one *actually* gets sexually assaulted\" I can handle it. But if I'm going to get subjected to repeated lingering, sexified, escalating scenes of these characters being sexually abused, I'll just tap out now.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqgddd/anyone_watch_dan_da_dan_and_can_you_help_me_with/"
    },
    {
        "id": "1gpx9ea",
        "author": "TheDadThatGrills",
        "title": "The Rise of the Golden Idol (released today- $20) is available as part of your Netflix membership.",
        "content": "Tried posting this to /r/Games but the mods removed it as not being relevant to their sub. Understand that most subscribers sleep on the game portion of their membership, but give this one a serious look if you enjoy murder mysteries. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpx9ea/the_rise_of_the_golden_idol_released_today_20_is/"
    },
    {
        "id": "1gqa4x1",
        "author": "sidroy81",
        "title": "Dibakar Banerjee's stalled film Tees premieres at DIFF to rousing reception: Here's why Netflix India isn't releasing it",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqa4x1/dibakar_banerjees_stalled_film_tees_premieres_at/"
    },
    {
        "id": "1gq6zdx",
        "author": "TomorrowPitiful2410",
        "title": "Netflix take my story",
        "content": "Let me be the next Baby Reindeer ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gq6zdx/netflix_take_my_story/"
    },
    {
        "id": "1gqeydo",
        "author": "gumOnShoe",
        "title": "Post writing strike content has been terrible [US]",
        "content": "I've been a member since early dvd days and I'll admit having access to other content was what made Netflix great. There was a between time when Netflix made great shows before it gave in to reality slop and it still has access to shows from other sources. \n\nBut these days I turn on Netflix, do the equivalent of a channel surf, and then leave without watching anything. This is exactly what happened with HBO /Max before we cancelled it. I'm thinking about taking this staple service and putting it on the rotation of on for a month off for 11.\n\nI have no interest in reality, sitcom, or live programming. \n\nWhat does my family like? Witty, adventure, and scifi/fantasy. We're up for a good procedural cop story too - but we'd be in it for the characters/mystery and not have much interest in gore/horror.\n\nMy wife and I just started big door prize and just finished severance on Apple tv. These both look like they were probably low budget (no special effects dominating the screen), though maybe the talent cost some money. The thing that really marks these shows as interesting is that they have good solid writing and story telling chops.\n\nOutside of stranger things, Netflix doesn't appear to know how to pick shows that are what most of us would call good. (Who the fuck thought it was a good idea to finance the man who ruined the DC universe?) At this point it appears to be a strategy and that I'm simply not in the target market. If this is wrong, well here's one anecdote from one guy who can't care anymore and certainly can't justify the recurring payment anymore. 5 episodes every 3 months isn't enough.\n\nYou're not pulling your weight anymore. Bye.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gqeydo/post_writing_strike_content_has_been_terrible_us/"
    },
    {
        "id": "1gq6ih3",
        "author": "dr_van_nostren",
        "title": "Downloads gone?",
        "content": "Anyone else have this issue? I’m travelling and knew I’d be in China for some long layovers so I downloaded some content. Worked fine for a few days. Now they’re all gone. They shouldn’t have expired cuz I only downloaded them like a week before. \n\nThe only thing I found online was that your downloads get wiped if the app gets updated? Ok my fault I guess for not knowing that and having auto update on. But then I go to download something and it says I’ve hit my monthly limit. You mean you wiped my downloads and are still holding me to that limit? Seems rather stupid. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq6ih3/downloads_gone/"
    },
    {
        "id": "1gpvz68",
        "author": "Vojvodjanin110",
        "title": "I watched majority of crime documentaries.",
        "content": "I watched majority of crime documentaries. What should I do now, buy HBO or something? Are there any documentaries that are different than on Netflix?\nOnly interested in real life one, not series and dramas.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gpvz68/i_watched_majority_of_crime_documentaries/"
    },
    {
        "id": "1gqc6id",
        "author": "LKS983",
        "title": "Return of the King - Elvis Presley",
        "content": "Disappointing.\n\nI was 10 years old in 1968 and so didn't see Elvis' '68 special at the time.  **The same applies to most of those commenting in this documentary.**\n\nEven more disappointing that they left one of his best songs (I can dream) until the very end.\n\nElvis had a **TRULY** great voice, and is still a legend - even though he went downhill in the '70s.\n\n ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqc6id/return_of_the_king_elvis_presley/"
    },
    {
        "id": "1gq0buo",
        "author": "galiumgirl",
        "title": "Can't Find Scene",
        "content": "Hi! I just watched Metal Lords and I swear Netflix used to preview it with a scene that wasn't in the movie.\n\nThe scene was of the protagonists (Hunter) while in black and white metal makeup. He was sitting at his desk when a trio of girls approached to ridicule his appearance. But he claps back and skillfully ridiculed their outfits in return.\n\nAm I thinking of the wrong movie? Is there another movie on Netflix with this scene? I swore it was Metal Lords but it wasn't in there! Please help, I have been ceaseless trying to find where it's from but I cant figure it out.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gq0buo/cant_find_scene/"
    }
]