[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jbk6vh",
        "author": "BlogEraForever",
        "title": "Why have I never heard of the show Unreal?",
        "content": "I thought I had scoured every corner of Netflix, but there is an old show called Unreal that is actually insanely good. The premise is arguably dumb - a drama focused on the production team behind the scenes of a reality show a-la the bachelor, but the writing and acting is so good. Do people know about this show??",
        "upvotes": 47,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jbk6vh/why_have_i_never_heard_of_the_show_unreal/"
    },
    {
        "id": "1jb65cs",
        "author": "Internal-Bed-3150",
        "title": "Daniel Craig in talks to join the Narnia Netflix movies",
        "content": "",
        "upvotes": 210,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1jb65cs/daniel_craig_in_talks_to_join_the_narnia_netflix/"
    },
    {
        "id": "1jbq59u",
        "author": "Liquid_Lunch_1991",
        "title": "Adolescence",
        "content": "It takes a lot for a show/movie to upset and unsettle me and I wanna say with total honesty this show completely and utterly fucked my shit up. I admire the audacity of the filmmaking and writing and omg the acting is incredible, but seriously….this is the first time I’ve ever watched something I wished I could unwatch\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbq59u/adolescence/"
    },
    {
        "id": "1jbpt8x",
        "author": "Royal-Principle6138",
        "title": "Adolescent",
        "content": "Ooh only seen the first episode so no spoilers please but my god what some amazing actors Stephen Graham really is an incredible actor and the child is amazing great story ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jbpt8x/adolescent/"
    },
    {
        "id": "1jbc3nu",
        "author": "TVHcgn",
        "title": "When Netflix Search just works!",
        "content": "Funny things happening when searching for “Gentlemen” or “Gentleman” ",
        "upvotes": 29,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jbc3nu/when_netflix_search_just_works/"
    },
    {
        "id": "1jbl8dt",
        "author": "skellafella",
        "title": "Me after every single episode of Adolescence",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbl8dt/me_after_every_single_episode_of_adolescence/"
    },
    {
        "id": "1jbk4fc",
        "author": "MindToxin",
        "title": "Why can’t Netflix afford better English speaking voice actors?",
        "content": "Even though Netflix has so many great foreign language movies, the English voice acting is always so terrible that I can’t stand watching them with English audio on. The movies are so much better in their original foreign language audio with just reading the English subtitles!\n\nHow can a company like Netflix not be able to get better English voice actors? \n\nDoes anyone else feel the same? Are there any really good foreign language movies on Netflix that actually have good English voice actors? If so please give movie titles! \n",
        "upvotes": 7,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jbk4fc/why_cant_netflix_afford_better_english_speaking/"
    },
    {
        "id": "1jbq0ko",
        "author": "Retro_uk",
        "title": "Thumb ratings no longer being remembered",
        "content": " It used to be that once I gave something a thumb rating, it would stay \"filled in\" unless I changed it. But lately whenever I pause a show, the thumbs are all blank again no matter what I clicked previously. That's not normal is it? Cheers",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbq0ko/thumb_ratings_no_longer_being_remembered/"
    },
    {
        "id": "1jboynv",
        "author": "OwlEye2010",
        "title": "Are there any Netflix originals you'd wanna see get a good Blu-ray/4K release?",
        "content": "While there have been some originals that've gotten home media releases over the years, many of them seem hit-or-miss. Sure, stuff like *The Irishman* got a Blu-ray release on the Criterion Collection, but then you got something like *Kipo and the Age of Wonderbeasts* released on a bare-bones DVD set, or *She-Ra* not only being a DVD release, but for only the first three seasons.\n\nSo what Netflix originals would you wanna see get a good Blu-ray and/or 4K release?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jboynv/are_there_any_netflix_originals_youd_wanna_see/"
    },
    {
        "id": "1jbkm69",
        "author": "Kfchoneychickensammi",
        "title": "The electric state movie [SPOILER]",
        "content": "Alright so I actually liked the movie even though supposedly everyone hates it so much, I didn't take it too seriously and it was a family friendly action packed sci fi. But the ending was weird when the character Chris Pratt was playing was grieving his robot friends death, saying he loved him so much, saying even \"more then a friend\", then mentioning how all his other friends are married so he can't hang out with them. Is this some weird dialogue made by directors for human robot love or am I misinterpreting immensely? ",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jbkm69/the_electric_state_movie_spoiler/"
    },
    {
        "id": "1jbgnrm",
        "author": "iPhone13pm",
        "title": "Most Watched Movies on Netflix (As of 2025)",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jbgnrm/most_watched_movies_on_netflix_as_of_2025/"
    },
    {
        "id": "1jbo3kh",
        "author": "MissStone130",
        "title": "Stand up, Rosebud Baker the mother lode.",
        "content": "I know this is a newly released stand up special but for anyone that has watched it already did you notice her stand up goes from pregnant to after pregnant and for some reason it really annoys me that she can’t just do one full stand up special. It keeps changing to her full on pregnant in a black  maternity jumpsuit to her thin obviously after the baby because she says at first something about having her baby 11 weeks ago while also wearing black pants and a black tee. I don’t know if they were trying trying to work this as a before and after but I just took it as they thought the viewers were idiots and wouldn’t notice.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbo3kh/stand_up_rosebud_baker_the_mother_lode/"
    },
    {
        "id": "1jbqxeh",
        "author": "Things2SayToo",
        "title": "Netflix is overrated. Fight me.",
        "content": "Netflix spends Hundreds of Millions on movies that SHOULD have a theatrical run and would do well in theaters, but instead release it only on their platform and then get buried on their service that most people only subscribe to because of brand recognition and social viability. Most of their movies are mid at best and their shows are ok to bad. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbqxeh/netflix_is_overrated_fight_me/"
    },
    {
        "id": "1jbpoe1",
        "author": "theboyroberts",
        "title": "Manage access and devices - All devices being used not showing",
        "content": "Hey folks,\n\nLast night I noticed (well my Son did!) that my ex-wife was logged into my Son's xBox watching Netflix on my account.  Had a bit of a giggle about it with my boy, and we watched Netflix as usual.\n\nOnce finished watching, I took a look at the \"Manage access and devices\" page on the web version of Netflix and noticed that the only devices which were showing on the list were the browser based access from my phone, and then desktop PC.  None of the other devices I know are used to access Netflix, including: iOS (iPad &amp; iPhone), xBox (my Son's xBox both at my house and his Mum's) or my LG TV.\n\nAs a bit of a test to see if i could force any of these devices to show in the list, I changed my password &amp; forced a logout.  Not only did the LG TV get logged out, the only device which were forced to input the new password was the browser based devices.\n\nCouple of questions:\n\nDo any of you have an idea as to why the device list is incomplete?\n\nHow quickly, following a password change will a user be logged out of the account?\n\nCheers!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jbpoe1/manage_access_and_devices_all_devices_being_used/"
    },
    {
        "id": "1jbpmrz",
        "author": "Vivid-Dependent-2383",
        "title": "What do you think about With love, Meghan?",
        "content": "I am a big Martha Steward fan, i'm only 17 but I like baking, cooking and hosting. I was a fan of Meghan too, but this show seems so boring and basic it's borderline insulting lol. Teaching people how to dry fruits and make ice? Like it is kinda obvious... Some recipes were fine, but they were basic, pinterest ideas. I'm honestly disappointed, I thought it will be sth I will enjoy and look forward to next seasons. I don't think anything about Meghans behavior, or anything, i'm just disappointed by the content. I will stick to Martha Steward's youtube channel lol. What do you think?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jbpmrz/what_do_you_think_about_with_love_meghan/"
    },
    {
        "id": "1jawu8i",
        "author": "FlannelPenguin_",
        "title": "What’s the most heartbreaking movie/series you’ve watched on Netflix?",
        "content": "Up to this day, nothing will ever top “From Scratch” for me. The fact that it’s based on a true story makes me even more sad, it just really gave so much detail into their lives. It’s been 2 years since I watched it and it still makes me sad as if I was a part of their lives. ",
        "upvotes": 106,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1jawu8i/whats_the_most_heartbreaking_movieseries_youve/"
    },
    {
        "id": "1jbmsp7",
        "author": "Delicious-Raise-3189",
        "title": "Quality issues",
        "content": "Umm is anyone else’s Netflix producing terrible quality videos.. I’m trying to watch Walter boys and it just turned sooo pixelated on me.. does anyone know how to fix it ? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jbmsp7/quality_issues/"
    },
    {
        "id": "1jazk6t",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix absolutely dominated streaming for the week of February 10 to February 16 with 4 out of 5 most watched series",
        "content": "",
        "upvotes": 22,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jazk6t/netflix_absolutely_dominated_streaming_for_the/"
    },
    {
        "id": "1jbjp7t",
        "author": "melomelomelo-",
        "title": "How to handle Netflix locking in your wifi when you move all the time?",
        "content": "We've moved 3 times in the last 6 months (traveling for work). I got a popup that I can only login for 14 days now because my wifi isn't my \"home wifi\". \n\nWhat do? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jbjp7t/how_to_handle_netflix_locking_in_your_wifi_when/"
    },
    {
        "id": "1jbmw63",
        "author": "Shininblade",
        "title": "Ads on netflix?",
        "content": "Just found out that netflix discontinued my old plan to push their new plan with ads, not only that but their new plan keeps some movies and shows hidden unless you upgrade to their higher cost plan,  starting to really not see why people keep this company's subscriptions active if they engage in shady practices like this. \n\nI've had netflix since the early days but because of this i'll be removing my subscription,  here's hoping they don't illegally charge my account upon cancelation because I've been reading some threads that netflix charged them even after cancelations. \n\nI gave them a chance cause it was convenient to have netflix so I kept my subscription active until now to remain loyal even though they hardly update their movies or shows, I can't remember the last time they updated their horror library for example, same old movies constantly. \n\nIt's just no longer convenient to have netflix,  especially if they are willing to push away loyal customers to enforce shady practices.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbmw63/ads_on_netflix/"
    },
    {
        "id": "1jbhia0",
        "author": "ajdzan",
        "title": "Bad quality on one TV, but great on another",
        "content": "Hello! As I mentioned in the title, there is a distinct difference between streaming quality on two of my Smart TVs. One is LG (the one with worse quality), while the other one is Samsung. Even though they're not the same size - LG - which is smaller, has a full HD panel and the picture seems to be of lower resolution. \n\nI was watching Total Drama in my sister's bedroom on her Samsung, and I noticed quite a difference in quality. Everything was much sharper and the colours stood out.\n\nWhat am I to do? It's not that Netflix on LG is unwatchable, but I would prefer it being better.\n\nP.S. Both televisions are connected to the same WIFI network.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jbhia0/bad_quality_on_one_tv_but_great_on_another/"
    },
    {
        "id": "1jbh2lv",
        "author": "Ok-Plankton-2393",
        "title": "There is any way to play Netflix games on a PC?",
        "content": "I want to play some games that are not available in my phone, i tried to use Nox but for some reason i cant download the games or start the Netflix app\n\nThere is any way to make it work?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jbh2lv/there_is_any_way_to_play_netflix_games_on_a_pc/"
    },
    {
        "id": "1jbgir1",
        "author": "Psychological_Act813",
        "title": "Everything’s Black",
        "content": "Trying to watch the film “The Electric State” and it gets to about 30 ish seconds in and the rest of the film is black with audio still playing. Is this my Netflix bugging or is this issue specific to the film? Anyone know if I can fix this??  ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jbgir1/everythings_black/"
    },
    {
        "id": "1jbg326",
        "author": "BlueRose99x",
        "title": "Back on Netflix after 5 years. (Recommend me your favorite Movies/Shows)",
        "content": "Back on Netflix after 5 years. (Recommend me your favorite Movies/Shows) As title says. Ready to binge!!! It’s has been a while. \n\nFull disclosure I’m all caught up with Squid Games 😆",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1jbg326/back_on_netflix_after_5_years_recommend_me_your/"
    },
    {
        "id": "1jbeqp6",
        "author": "jetsrfast",
        "title": "UHD Quality Issues – Disappointed &amp; Considering Cancelling",
        "content": "Dear Netflix,\n\nI pay for the full UHD 4K plan because when I do watch something, I want the best quality available. Honestly, I don’t watch Netflix that often, and I’ve debated whether it’s worth keeping given the price. But when a show I’m excited about drops, I expect it to be available in top quality, that’s what I’m paying for.\n\nSo when Drive to Survive came out, I was really looking forward to downloading it and watching on my iPad Pro while on vacation. But the quality has been massively disappointing. I’ve double-checked my settings, my Wi-Fi, and even looked up discussions here and elsewhere to troubleshoot. I see that there might be some factors outside of Netflix’s control, but the bottom line is that other streaming platforms (Apple, for example) don’t seem to have this issue.\n\nWhether it’s a Netflix-side problem or something with the service provider, it’s frustrating. At this price point, I expect reliability. If I can’t count on getting the high-quality experience I’m paying for when I actually want to use it, it’s hard to justify keeping my subscription.\n\nIs anyone else experiencing the same issue?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jbeqp6/uhd_quality_issues_disappointed_considering/"
    },
    {
        "id": "1jannra",
        "author": "taurusmo",
        "title": "Just finished Adolescence",
        "content": "Started and then could not stop. \n\nI’m speechless. The way it’s filmed, acting…\n\nThere will be only 2 types of people after this one: full haters, full lovers. There is just nothing between. ",
        "upvotes": 74,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1jannra/just_finished_adolescence/"
    },
    {
        "id": "1jbd83t",
        "author": "ReactiveNylon",
        "title": "Netflix on Mobile Data only (no WiFi)",
        "content": "I have no WiFi where I live and function only using mobile data. I own my own netflix account but I know that they've introduced the idea of a netflix household that is related to a WiFi network.\n\nWill my netflix cut out if I never connect to WiFi or is there a way to make my phone data or hotspot the household?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbd83t/netflix_on_mobile_data_only_no_wifi/"
    },
    {
        "id": "1jbbkob",
        "author": "indiewire",
        "title": "The Best Movies New to Every Major Streaming Platform in March 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jbbkob/the_best_movies_new_to_every_major_streaming/"
    },
    {
        "id": "1ja988s",
        "author": "Sweaty-Toe-6211",
        "title": "Dungeons &amp; Dragons: Honor Among Thieves returned to the Netflix charts, debuting at No. 10 in the U.S.",
        "content": "",
        "upvotes": 372,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1ja988s/dungeons_dragons_honor_among_thieves_returned_to/"
    },
    {
        "id": "1jb7mtb",
        "author": "Ok_Cantaloupe_3344",
        "title": "You Vs Wild is not interactive for me!",
        "content": "You Vs Wild is not interactive for me! It just plays through without giving me the option to make a choice. I am using a Samsung smart TV (not apple). I didn't get an error code or anything! Help!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jb7mtb/you_vs_wild_is_not_interactive_for_me/"
    }
]