[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q1rl8k",
        "author": "GuineaPKilledMe",
        "title": "Dave Chappelle - The Unstoppable",
        "content": "I have never seen something so unfunny in a long time. Genuinely what happened to this dude?? I mean I know what happened, but all he does it spew bitterness and hate.\n\nHe immediately came out preaching and ranting. Idek when he's actually telling jokes because all he does is go on and on about how he can't do this and can't do that. What a whiny baby.\n\nI used to love his standup specials. I just cannot believe that almost ten years later this man can absolutely not let anything go. I turned it off twenty minutes in without cracking as much as a smile.\n\nEdit: Some of y'all are so far up Dave Chappelle's ass that you're sending me Reddit Care alerts. You are a absolute pathetic loser to do that. Please grow up and choose to use those when someone is actually in dire need of help. I do not need help because I find your favorite comedian to be a bitter old man who rants at the clouds.",
        "upvotes": 151,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1q1rl8k/dave_chappelle_the_unstoppable/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 1381,
        "comments": 217,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q16vhz",
        "author": "Zedaso",
        "title": "Stranger things finale, big moments and big questions. I can't stop thinking about what WASN'T in the finale.",
        "content": "This is far longer than expected. I'll put a TL;DR at the bottom.\n\nOverall, I enjoyed the finale, have to say Jamie as Henry/Vecna stood out, he absolutely killed it. There were a lot of amazing moments, but I can't shake the feeling that a lot was missing, it even felt rushed in some places and I'm left with a lot of questions.\n\nWe saw zero demogorgons, demodogs or demobats in the finale, weird from a show that started with the demogorgon. \n\nWe didn't see the \"army\" Vecna showed Nancy in Season 4 and she talked about. I remember her speech: \"Vecna showed me so many terrible things. This giant creature with a gaping mouth, and this creature wasn't alone, there was so many monsters. An army, and they were coming into Hawkins. Into our homes.\" \n\nVecna had no defence, yet he knew Eleven and the gang would be coming, he even saw into her mind, he knew all their plans.\n\nThe military did nothing to the gang and just let them go after the crimes they committed, murdering their soldiers etc? They even let Hopper who had a fight with Dr. Kay become chief of police again?\n\nVecna was impaled and decapitated, the mind flayer was shot and burned yet Will felt nothing when he was right there? What happened to the hive mind? Not long before the big fight we see him reacting to when Henry felt pain from his memory of being shot in the cave as a kid. I thought he would have been seriously hurt or even killed being right near the hive mind when they were attacking the mind flayer and Vecna.\n\nVecna and the mind flayer were these otherwordly eldritch horrors with god-like powers and they were defeated so easily with not much loss for the gang.\n\nThis part is a bit too sci-fi for me and I love this sort of stuff, I'm just not smart enough to understand it, but: The whole blowing up the wormhole at the lab with the C4 at the dark matter seemed off. It completely wipes out all of the upside down, and probably the other dimension, but leaves Hawkins at the gate completely fine where we see \"Eleven\" standing to be killed? Would it not have also wiped out Hawkins, or at least done some damage?\n\nI understand the idea behind the Eleven ending, it was a smart idea in theory, but I don't think they pulled it off too well. Maybe I missed something, but she was right next to Mike in the truck right as they exit the gate, all of the El-Jammers were pointed at her and normally she's crippled and can't do anything but she manages to then escape the truck and get to the gate. Maybe it was an illusion like Mike later says, but she wasn't at the truck part from what I can see, and then how did Mike know about Kali? He never met her. He never witnessed what happened to her.\n\nThere was an 18 month time skip before Mike plays D&amp;D with the gang and tells them about El? Why do Hopper and Joyce not get told anything?\n\nFinally, where is Suzie? I thought Dustin and Suzie were together, we didn't see her at all. Also Vickie? Wasn't Robin going to take Vickie out?\n\nHonestly, not trying to hate on the finale, I love Stranger Things, but as mentioned I was left with a lot of questions. I'm interested in how others interpreted all this or if anyone can explain any of it.\n\n  \n**TL;DR:**  \nI enjoyed the finale, but it felt rushed and oddly incomplete. Key things set up earlier never paid off (no demogorgons/monster army, no real Vecna defence, hive mind inconsistencies with Will). Vecna and the Mind Flayer felt underpowered for supposedly god-like threats. The military’s response made no sense, the wormhole/C4 resolution felt inconsistent, and the Eleven ending was confusing (illusion logic, Kali reference, escape). Several characters/subplots (Suzie, Vickie, Hopper/Joyce learning about El) were just dropped. I love Stranger Things, but the finale left me with more questions than answers and I’m curious how others interpreted it.\n\n",
        "upvotes": 297,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1q16vhz/stranger_things_finale_big_moments_and_big/"
    },
    {
        "id": "1q1h7an",
        "author": "Few-Consequence2702",
        "title": "Personally",
        "content": "I loved Stranger Things. Sure, it had its imperfections, but it was such an incredible ride. The second half of the finale hit hard. The flashbacks - the nostalgia. The glimpses of the future for each of the characters we grew to love and connect with. I’m sad. I’ll miss it. Thank you Duffers! Over &amp; Out ",
        "upvotes": 58,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q1h7an/personally/"
    },
    {
        "id": "1q1bvke",
        "author": "pjand08",
        "title": "Finally Stranger things ended...",
        "content": "After being a fan of this show for almost 6 years, today it all concluded. I have followed every leak and made different theories, and it was all worth it. NGL, the final season, had its flaws, but in the end, everything was completed beautifully. Today, I am feeling very empty. I am not able to rewatch the finale, I am not able to express my feelings, and today I am very sad, and with the end of Stranger Things, now there is no other series left that I am as excited about as I was for Stranger Things. Truly the end of an era....",
        "upvotes": 106,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1q1bvke/finally_stranger_things_ended/"
    },
    {
        "id": "1q1gbmp",
        "author": "Dry_Philosophy_6825",
        "title": "Stranger Things has officially ended — or… has it?",
        "content": "(Spoiler alert)  \nWhen you look at the series through the lens of Dungeons &amp; Dragons, the ending of Season 5 does not feel final. It feels less like the closing of a story and more like a party reaching the end of a campaign while the world around them keeps breathing.\n\nStart with the Mind Flayer. In Dungeons &amp; Dragons it is not a god and not a cosmic ruler. It is one aberration among many, dangerous but not ultimate. The important detail is that it existed long before Henry entered Dimension X. Vecna did not create it and never truly commanded all of it. He only shaped a fragment, the way someone might force smoke into the shape of a spider. Even if that fragment was defeated, the deeper intelligence remains. It was already there before Henry and it will continue after him.\n\nFrom there, Dimension X becomes easier to interpret. In D&amp;D, the Far Realm is not a parallel universe. It sits outside reality and leaks into it only when reality cracks. It is ancient, hostile to reason, impossible to conquer in any permanent sense. Its beings are not merely evil. They are alien in ways the mind cannot safely hold. Dimension X behaves in the same way. That suggests it may not be the true source of horror, but rather a fissure, a place where something far larger presses through. The Upside Down is then not the enemy itself, but the distorted echo of what lives beyond.\n\nVecna fits into this structure. In myth and in D&amp;D lore, he is terrifying, but he exists inside a chain of command. If he falls, the machine does not stop. Someone else assumes the role. That is why Eddie Munson becomes such an intriguing figure. He died in the enemy’s realm. His body was never recovered. He carried fear, guilt and unfinished purpose. Legends and campaigns are full of such characters, pulled back into the fight, not because they choose evil, but because something stronger claims them.\n\nThe experiments surrounding Kali point to the same unfinished world. Dr. K did not work on only one subject. Several women received her blood. That leaves the possibility of children with powers that remain unseen, unstable, unpredictable. Some of them may become protectors. Others may be consumed. A few might be taken by the same forces that shaped the Mind Flayer.\n\nThe creatures of the Upside Down also do not simply vanish. The Demodogs seen in such numbers in earlier seasons behave like an army that waits for new orders. They retreat, recover and emerge again when called.\n\nAnd then there is Will. He carries something the others do not. His connection to the Hive Mind has never been completely broken. In stories and in campaigns, there is always one character who leaves the battlefield changed forever. That mark does not fade. It becomes a thread the enemy can tug on.\n\nThe final image of the show quietly reinforces all of this. Children gather around a Dungeons &amp; Dragons table and begin to play, while the original group ages into mentors, guardians and witnesses. One generation finishes its chapter. Another one sits down, opens the rulebook and starts rolling.\n\nPerhaps Stranger Things did not truly end. Perhaps only one party reached the final session, while the greater campaign continues, waiting for whoever is brave or foolish enough to take the next seat at the table.",
        "upvotes": 49,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1q1gbmp/stranger_things_has_officially_ended_or_has_it/"
    },
    {
        "id": "1q1mmnc",
        "author": "krullhammer",
        "title": "The man in the high castle",
        "content": "Is this show coming to Netflix or not because of the mgm content deal with Netflix that I read on online along with other shows from mgm and the James Bond series of movies ",
        "upvotes": 12,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1q1mmnc/the_man_in_the_high_castle/"
    },
    {
        "id": "1q1671g",
        "author": "OdiseoX2",
        "title": "Regarding Kali in Stranger things (spoilers)",
        "content": "I just feel they did Kali’s character dirty this season. The only two reasons i can think of that they brought her back was to kill someone so they wouldn’t have to kill anyone from the main group, and to close the gap about what happened to her after the show ended. ",
        "upvotes": 79,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q1671g/regarding_kali_in_stranger_things_spoilers/"
    },
    {
        "id": "1q1t1mc",
        "author": "DrownMeInSalsaPlease",
        "title": "Another ticked off customer",
        "content": "I wanted to watch netflix on my break. Netflix says no because my phone is on roaming data that means i’m on some magically different device or something.\n\nSo every 14 days i have to ask for a code for access.\n\nI work 80 hrs. My mother works 80 hrs. We live in the same house. I pay for internet. She pays for netflix.\n\nWhich my mother is asleep at that hour.\n\nI can’t wait for them to open up clinics where we can implant chips that blur our vision on the screen if we dont have a separate plan and happen to look at a netflix.\n\nDystopian nightmare.\n\nI’m done. These companies have gotten too much ego.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q1t1mc/another_ticked_off_customer/"
    },
    {
        "id": "1q1nl4q",
        "author": "Meegz-8366",
        "title": "Has anyone watched “members only” Palm beach on Netflix?",
        "content": "So with all the chaos of the past year I just happened upon this show &amp; decided to watch it in its entirety. My takeaway was that the people on that show were very much living in a fantasy reality. Everyone is fake towards each other and mar-a-Lago came up a million times. It was fairly sad to see how people decided that if you weren’t living in a certain place they weren’t worthy as a human being. I also saw how very much a melting pot Palm Beach is. It’s hilarious to see what we’ve been going through in the past year of “immigrants are not wanted here” when some of the richest people around immigrated to the U.S. a lot of the  architecture in Palm Beach is Spanish inspired! The people all are super tan. Just reminds me how much hypocrisy is the biggest theme these days. The whole show was an ode to that.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q1nl4q/has_anyone_watched_members_only_palm_beach_on/"
    },
    {
        "id": "1q1hpr0",
        "author": "Miserable-Bother-572",
        "title": "Run Away",
        "content": "I have just finished Run Away, a new mini series based on Harlan Coben's book. Generally, I have enjoyed it, it is his typical misery story with a few plot twists, shocks and red harrings. Perfect for a lazy day. What I do mind are some loose ends. Did someone else finish it and wants to share an opinion?",
        "upvotes": 9,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1q1hpr0/run_away/"
    },
    {
        "id": "1q0xodo",
        "author": "Naive_Fee258",
        "title": "Thoughts on the Stranger Things final episode?",
        "content": "Thoughts/concerns/questions\n\nThe ending was amazing and Holly was my favorite character this season!!\n\nI don't have a favorite season I like them all for different reasons but I think the final  ending was 🤯🤯.\n\nA lot of people were divided about this season.",
        "upvotes": 186,
        "comments": 666,
        "media": null,
        "permalink": "/r/netflix/comments/1q0xodo/thoughts_on_the_stranger_things_final_episode/"
    },
    {
        "id": "1q1m0c6",
        "author": "Wild_Description8052",
        "title": "Jamie Campbell Bower",
        "content": "THE MAN THAT YOU ARE!\n\nWhile there were things I didn’t enjoy about season 5 of stranger things - he was a welcome acting masterclass! This show has some good acting but wow he absolutely smashed this role, especially last season!! I doubt he will but I would love to see some sort of award for it because he had me captivated!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1m0c6/jamie_campbell_bower/"
    },
    {
        "id": "1q1sbur",
        "author": "BoriDomi11",
        "title": "I can’t be the only one 😩",
        "content": "I just started watching the new Simon Cowell show on Netflix “The next act” and I can’t help but feel like something is OFF with Simon’s fiancé Lauren. It seems like she is always putting him down in front of the camera! In one part she even says to him “you are only saying this in front of the filming crew so they can hear you” like what!! That’s probably what you do that’s why she even came up with that. She is constantly speaking negative about him! IMO Simon needs to RUN!! I can’t be the only one who noticed! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1sbur/i_cant_be_the_only_one/"
    },
    {
        "id": "1q15rk9",
        "author": "OriginalRequirement6",
        "title": "Members Only: Palm Beach",
        "content": "Gale is a racist uneducated xenophobe. I don't care about anyone's opinions of Romina but the fact that this woman couldn't understand her country of origin (kept saying Pakistan instead of Uzbekistan) THREE TIMES, criticized her cultural way of eating and then said in interviews she needs to go back to her country is wild. Like this is straight up xenophobic.",
        "upvotes": 20,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q15rk9/members_only_palm_beach/"
    },
    {
        "id": "1q12s2s",
        "author": "Itzsuvo",
        "title": "Kali (spoilers)",
        "content": "The entire fandom owes an apology to Kali, ever since she appeared on screen people started LOATHING her, like since s2, the hate for her in s5 was insane, people were like shes with mind flayer, shes a traitor and blah blah.\n\nShe played the most important role in the season, not only she saved max and the kids, she always stood for the truth, she knew only if she and el died it would be possible for El's friends and family to live, she was ready to sacrifice herself, and she did but hop changed her mind and made her realise her death can make El live, so she sacrificed herself and came up with the greatest mastermind plan while bleeding to death and moments away from dying, she used her powers to save El while dying, goodness gracious! she is the real hero of the season, will and el together killed one but she single handedly saved the protagonist of the show from death with her life, she died so El could live, she is the hero the fandom never deserved. She definitely wasn't on Vecna and El's level on power but her powers were beyond them, Kali the reality manipulator. She has my respect and she is definitely my fav s5 character.\n\n",
        "upvotes": 33,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q12s2s/kali_spoilers/"
    },
    {
        "id": "1q1jskj",
        "author": "isnotacrayon",
        "title": "Physical: Welcome to Mongolia missing episodes?",
        "content": "I thought this show was supposed to be four total episodes, and the last two were meant to drop on 12/30, but they have not yet. Does anyone know why this could be?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jskj/physical_welcome_to_mongolia_missing_episodes/"
    },
    {
        "id": "1q1nqoz",
        "author": "FrogPuppet1041",
        "title": "Netflix problem",
        "content": "Help me fix netflix \n\n\nMy account is logged in but today I was gonna watch a new show on netflix but it kept kicking me out of the app. How do I stop netflix from stopping this? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1nqoz/netflix_problem/"
    },
    {
        "id": "1q1n4ce",
        "author": "grilledchorizopuseye",
        "title": "Unable to watch Netflix while traveling abroad",
        "content": "Originally from Canada and travelling in Asia for 3 months. \n\nWhen I left I had the 7.99 add plan and when I got here it wasn’t supported and my options given were 20$ plans so decided to just take a break and cancel.\n\nNow I’m in Vietnam and want Netflix back and am trying to reactivate my account but when I try to use my Canada credit card it doesn’t work. I contacted support and they say you need a Vietnamese card to pay here and I should get one. I even tried getting friend at home to buy gift card that also didn’t work.\n\nAm I really stuck not being able to watch Netflix while abroad with Canadian credit cards or is there some work around?\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q1n4ce/unable_to_watch_netflix_while_traveling_abroad/"
    },
    {
        "id": "1q1jzmc",
        "author": "IslandGirl8412",
        "title": "What would you have liked to see during the final season?",
        "content": "***Caution: SPOILERS ahead!***\n\nI'm one of many who feel that Stranger Things 5 was underwhelming. There were some decent moments and the finale was alright, but overall I feel that the whole season, including the finale, failed to live up to expectations. Yes, know this is partly a me problem, but there were also issues with pacing, lazy writing, and a feeling that the stakes weren't as high as they had been in previous seasons.\n\nI know I'm not alone in feeling this, and would love to know what others were hoping to see during the course of the final season. Here's my list:\n\n* A major death early on would have been powerful. As hard as it would be to lose one of the key characters, it could have raised the stakes and firmly established Vecna as a real threat, since he didn't feel like much of one throughout S5. That loss could then echo through the rest of the season, with the characters’ grief driving them to defeat Vecna and keeping viewers on edge because we truly don't know who's safe.\n* The return of past characters for Vecna to use as psychic weapons. Barb for Nancy, Eddie for Dustin, Bob for Joyce, maybe even Billy for Max again. I liked what they did with the montage near the end, but it would have been nice to see the actual actors again.\n* I'm probably going to be in the minority here, but I think Will's death could have brought the story full circle. Don't get me wrong, I thought the actual ending was lovely, but there could have been so much more complexity if by killing Vecna/MF, the characters were forced to confront the cost of saving the world versus saving their best friend/brother/son. Maybe a tender moment where Joyce reflects on how lucky she was to see the rest of her son’s childhood—even if it was borrowed time.\n* There should have been more demogorgons, dogs, bats, maybe even something new, &gt;!at least in the final battle scene with the mind flayer. The scene felt a bit anticlimactic and the mind flayer was defeated too easily!&lt;. I've seen a theory that these creatures are maybe absent because they make up the body of the mind flayer but if this is what the Duffer's had in mind, they could have written a more layered action sequence. Maybe something where the group is fighting an army of demos, and we think our side is winning, they retreat, but then the mind flayer rises up...\n* After so much build-up, we really needed stronger forces on both sides this season. I would have liked to see the army somehow team up with the core group to fight the final battle together. Give Linda Hamilton's character some extra depth. At the end, it could create an even stronger conflict when the army reverts back to their original goal of capturing El.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jzmc/what_would_you_have_liked_to_see_during_the_final/"
    },
    {
        "id": "1q1onih",
        "author": "DancingKitten33",
        "title": "El's Fate, Stranger Things (SPOILERS FOR SEASON 5)",
        "content": "I think El's fate in the finale &gt;!(obviously up to interpretation) is kind of perfectly ambiguous. I began this post first thinking I was going to write how it seems much more likely that she's alive, but after rewatching, pausing, etc., I'm more in the middle. These are the major points as I see them:!&lt;\n\n&gt;! !&lt;\n\n1. &gt;!Kali's Death. We do not see Kali die until Hopper leaves the room and comes back. So her being dead may be an illusion, the plan of which they hatched while he was out of the room (consistent with Mike's theory essentially).!&lt;\n\n&gt;! 2. !&lt;&gt;!The Truck Scene. This is where I became unsure one way or the other. If you watch the scene, pause, etc., the military men literally touch El as she gets down from the truck. So either, 1) She then went invisible at just the right time when everyone wouldn't be like,, \"oh she just turned invisible!!!\" OR in the \"she died\" fact pattern, she somehow, with the hedgehog machines blaring, was able to make her way to the gate unnoticed. Both of these seem far-fetched. Honestly, I think there's even an open question of whether those hedgehog speakers were even on---we never see them make the sound they usually make (from El's perspective), we never see El in distress at all in the van / getting out of it, which she would have been. Like if they were on, she should have been struggling hard in the van, but we see absolutely zero sign of that. Not sure why they would be off (and I don't really think they are off) but that is really strange.!&lt;\n\n&gt;! !&lt;\n\n&gt;!If we assume they were on, and them not effecting her in the van / while getting out of it was an oversight, then El making it to the gate that quickly under their influence seems difficult to imagine, especially with so many soldiers around (again including the ones who have literally just taken her off the van). I guess it's possible she made it to the gate even with them on, she has shown the ability to move, some times better than others, when the speakers are on (she is moving somewhat fast to get to Kali and Hopper before Murray blows up the helicopter; she also moves to try and attack the lady scientist with a pair of scissors or something in one of the earlier episodes).!&lt;\n\n&gt;! !&lt;\n\n&gt;!(As support for the \"she died\" theory, many are claiming that the \"hedgehog\" sound machines only effect her when pointed at her but this is absolutely not true. In the first episode it shows up (season 5, ep 3), it's clearly still effecting her big time even when it's pointed at the wall and she is way off to the side / behind it. It effects her \\*more\\* when they then turn it around and point it at her, but prior to that it still impacts her hugely.)!&lt;\n\n\n\n&gt;! 3. !&lt;&gt;!Her nose doesn't bleed when she connects in her mind to Mike, and usually it would. (Support for the illusion theory.) But maybe this is such a minor use of her powers that it just didn't bleed. If arguing in favor of the \"she died\" theory, and the speakers are on, then I guess we'd have to say since she was in the doorway to the upside down maybe the speakers didn't work specifically there and so she could still use her powers, but who knows.!&lt;\n\n&gt;! !&lt;\n\n&gt;!I think those are the major pieces at issue. The ambiguity of everything outlined in #2, makes it so it's hard to feel super strongly one way or the other. There are arguments for the \"she's dead\" and Mike is just rationalizing, and their are arguments for the \"she lived and it was Kali fooling people\" theory. There's probably other theories / branches of those two that could be posited as well. But I think the ambiguity was done well and makes for an interesting ending that people will be talking about for a while.!&lt;",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q1onih/els_fate_stranger_things_spoilers_for_season_5/"
    },
    {
        "id": "1q1jktm",
        "author": "Lobo_o",
        "title": "Quick thoughts from a critic of Stranger Things S5 who loved the last episode",
        "content": "Episodes 1-7, in my opinion were objectively not good and for many reasons. We fell in love with the Stranger Things characters because they went through many ups and downs. Elle struggling with jealousy, Mike being a butthole, Max learning how to socialize, Steve growing from a selfish prick into a considerate man worthy of fatherhood. Those felt like real issues with decent dialogue and writing that had us yearning for growth, and satisfaction when it came.\n\nIn season 5 there was hardly any of that. All of the characters were these unrealistic, perfect versions of themselves who handled every situation like they were in a Walgreens commercial (remember those?) Everybody around will had exactly the right reactions to him coming out. That would be insane for the time period, even though all of our main characters are “the good guys”, and that itself just felt fake. Don’t get me wrong, him coming out was great but every scene with him and Robin felt drawn out and the dialogue more annoying than inspiring, more phony than sincere. \n\nEleven’s interactions with Hopper, where she and he both were brooding and upset with each other for seemingly no reason. And again, the dialogue felt forced and almost like it was written by AI, hard to believe at times. How could she be so upset with him for willing to be a martyr and go down with the ship and then it not even be addressed when she herself decided to do the same thing? \n\nThere was a lot of disconnect and the rubrics for interactions felt repetitive. Gang struggles to come up with a plan, one character has a revelation, grabs items in the room to explain their plan, everybody finishes each other’s sentences and then we get a private conversation between two of the characters as the others move along. It happened so often, over and over again, that it felt like somebody in the writing room should’ve been self-aware enough to call it out. Hell I started to hate the Kate Bush song I loved so much last season with how repetitive it became. \n\nAll of the events leading up to the last episode felt very campy. BUT, I will say as someone who was struggling with being a hater, I did enjoy the last episode in its entirety. Quite a bit and was moved to tears a couple time. The pacing was good, the action was awesome, the music moments were really good, and the series did feel like it concluded so well, for me. It almost felt like everything was put into the last episode though and the ones leading up to it were the afterthoughts. That’s just my opinion though. It specifically reminded me of Kenobi. Where every episode before the last one was painstaking and riddled with issues. Ones that took me out of the viewing experience and made me feel the need to express opinions about the many poor choices to a friend and even online. But then it all did pay off with the finale encounter on that Moon\n\nI guess this is what happens when a show goes on for so long. The acting was honestly bad from some of the kids, but that’s what happens when you pick from a bunch of young actors and you can’t predict who will work out later on. I also think the whole show was an allegory about child abuse and maybe that was explicitly intentional from the Duffers. But I’ll save that for another post. Anyway, that wasn’t as quick as I thought it would be and if you got this far thanks for reading my thoughts. Roast me if you’d like",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jktm/quick_thoughts_from_a_critic_of_stranger_things/"
    },
    {
        "id": "1q11co4",
        "author": "Prestigious-Play8863",
        "title": "Stranger Things finale felt… surprisingly calm (no spoilers)",
        "content": "While most people were celebrating New Year’s, ST fans were up and about waiting for Episode 8. I started it the moment it dropped.\n\nI expected tears. I had the tissue box ready. I barely needed it.\n\nThe finale isn’t bad at all, but it feels gentler and easier than I expected after ten years of buildup. \n\nCurious how others felt. Did the calm ending work for you, or were you expecting something heavier?\n\nHere's a Link to full spoiler-light thoughts - https://medium.com/@fbgmb/spoiler-alert-9bbccf39f57c\n",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q11co4/stranger_things_finale_felt_surprisingly_calm_no/"
    },
    {
        "id": "1q1im6b",
        "author": "Buddhapanda75",
        "title": "Low Quality Video",
        "content": "I feel like I'm getting screwed over by using my PC. Twice in the past month, whether I use the desktop app or the browser, I have pulled up titles that wouldn't even play in 720 (\"Caught Stealing\" is 540 right now). It works fine on some title, but others simply will not stream at decent quality regardless of what device I use (laptop or PC, app or browser). These are new titles, specifically, \"Karate Kid: Legends\" and \"Caught Stealing.\" I'm paying for the highest tier, so why are these titles only available in sub-par quality? Anyone else having similar problems? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1im6b/low_quality_video/"
    },
    {
        "id": "1q0gmea",
        "author": "DetectiveHot2071",
        "title": "The Evil Influencer completely leaves out Jodi and Ruby’s secret ‘intimate relationship’",
        "content": "",
        "upvotes": 313,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1q0gmea/the_evil_influencer_completely_leaves_out_jodi/"
    },
    {
        "id": "1q1if6k",
        "author": "SH18AYN",
        "title": "Does anyone have issues with downloaded content disappearing on iOS?",
        "content": "Working at sea with very limited access to internet. I download a few series’ and watch them for a while, then one day they just disappear (not expire) from the Netflix app but are still in my iPad storage. Really irritating as I need to wait a few days till the internet access is back to redownload everything again.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1if6k/does_anyone_have_issues_with_downloaded_content/"
    },
    {
        "id": "1q0zc4s",
        "author": "HehroMaraFara",
        "title": "Was “What’s in the Box?” A fake game show?",
        "content": "Something felt a bit off about it. The dynamics, the personalities and the prizes were too perfect. \n\nThen I see that the Laith(sp?) guy was an actor in the Stranger Things series finale, but a bit part where it wouldn’t be too obvious. I’m guessing all the other contestants have some connection to show biz in some way. So was it just a contrived 6 episode fake game show used as filler content and a promotion for multiple Netflix programs?",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q0zc4s/was_whats_in_the_box_a_fake_game_show/"
    },
    {
        "id": "1q1fte2",
        "author": "MissMystery11",
        "title": "We can now only hope that:",
        "content": "Blue Eye Samurai, Wednesday, and All Of Us Are Dead as the last 3 of the greatest titles expected to have a good written finale. I think Alice in Borderland should’ve just been left with only 3 seasons as there already was a happy ending. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q1fte2/we_can_now_only_hope_that/"
    }
]