[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1recvyj",
        "author": "monroe099",
        "title": "Is there any way to hide movies that I already watched?",
        "content": "Netflix needs to stop recommending me the same movies I’ve already watched like I don’t pay a subscription to discover something new 😭 Is there any way to stop seeing these on my main page please ?  It takes me longer to find something to watch than to actually watch a movie.",
        "upvotes": 116,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1recvyj/is_there_any_way_to_hide_movies_that_i_already/"
    },
    {
        "id": "1rdub1c",
        "author": "Wonderful-Refuse642",
        "title": "‘The Night Agent’ Season 3 Viewership Down Up To 59% on Prior Seasons In Opening Week",
        "content": "",
        "upvotes": 69,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1rdub1c/the_night_agent_season_3_viewership_down_up_to_59/"
    },
    {
        "id": "1rdcfs5",
        "author": "[deleted]",
        "title": "Why are all the shows made for 20 year olds? I mean, as the older bill payer of the house, I can't find anything new to watch.",
        "content": "Just saying... Every new series is... absolutely rubbish... Wouldn't hurt to try and appeal to demographics of all ages. \n\nPlease don't suggest K Pop demon Hunters to me...",
        "upvotes": 283,
        "comments": 315,
        "media": null,
        "permalink": "/r/netflix/comments/1rdcfs5/why_are_all_the_shows_made_for_20_year_olds_i/"
    },
    {
        "id": "1reikft",
        "author": "twcosplays",
        "title": "Looking for a long series that's perfect for background watching",
        "content": "I’m in need of a long series to binge that isn’t too popular but still worth the watch. Something I can put on while cleaning or cooking without having to pay full attention every second. Any recommendations? I’m looking for something easy to follow with a decent plot, but not too heavy. Would love to hear what you all are watching that fits this vibe!",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1reikft/looking_for_a_long_series_thats_perfect_for/"
    },
    {
        "id": "1reguxy",
        "author": "Worldly-Ebb-7891",
        "title": "What do you think about Netflix recommendation system?",
        "content": "I think it is using ML behind the system for personalization, just wondering what others think about it. Like good or bad or your thoughts. Pros and cons.   \nSorry for bad grammar, English is not my first language :}",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1reguxy/what_do_you_think_about_netflix_recommendation/"
    },
    {
        "id": "1regpja",
        "author": "Financial-Donkey194",
        "title": "Virgin River Staffel 7: Dieses Highlight erwartet dich",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1regpja/virgin_river_staffel_7_dieses_highlight_erwartet/"
    },
    {
        "id": "1rd8svi",
        "author": "Prudent-Scar-9656",
        "title": "Netflix: Please do a documentary on 90s/00s Howard Stern next",
        "content": "I watched the ANTM documentary and have seen all the outrage from people who are shocked by the antics of Tyra and the 00's ANTM show. Yes, it was trashy, misogynistic reality tv, exploiting naive young women by forcing them into humiliating situations or into having emotional reactions. But you know who was the absolute king of exploiting women in the 90s/00s, and who has never had a documentary made about him, or had his disgusting reality radio/tv shows exposed to the younger generation? Howard Stern. Anyone who was alive back then knows exactly what I'm talking about. I don't even want to describe the misogynistic filth that man did to young women on his shows. If Tyra Banks is going to be raked over the coals for her middling at best reality tv show, which actually wasn't even the worst of the lot, then someone really needs to take a hard look at the biggest offender of them all: HS.  This man should have been called to account YEARS ago. Netflix, please make this your next documentary.",
        "upvotes": 349,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1rd8svi/netflix_please_do_a_documentary_on_90s00s_howard/"
    },
    {
        "id": "1rdq6ha",
        "author": "Iamthelizardking887",
        "title": "I just want the credits to play after a movie ends. Is there a way to toggle this?",
        "content": "So I’m on a PS5, and when a movie ends, it plays the credits for 20 seconds before a pop up takes over the entire screen and tells you the title. You then have 3 seconds to quickly select watch credits for the movie credits to just play out as normal, otherwise the entire bottom half of the screen will then be filled with titles of other titles. If you try to find the watch credits option after that, it will just kick you out to the movie title.\n\nThis is such an annoying feature to me. Maybe I’m one of the 5% who actually care about the credits and want them to play normally, but they serve as a good outro to a film and let you relax and decompress after an intense film. I already have autoplay turned off, but is there another option to just turn off the pop ups altogether? I just want a movie to play from beginning to the end of the credits.",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rdq6ha/i_just_want_the_credits_to_play_after_a_movie/"
    },
    {
        "id": "1reefxm",
        "author": "FudgeAffectionate155",
        "title": "Netflix Referral",
        "content": "Hi — I’m planning to apply for Data Engineer roles at Netflix and was hoping to connect with someone willing to provide a referral.\n\nI have 15 years of experience in data engineering and distributed data platforms, including 5 years at Amazon working on large-scale data pipelines and analytics systems.\n\nHappy to share my resume and job IDs via DM. Really appreciate any help — thank you! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1reefxm/netflix_referral/"
    },
    {
        "id": "1reds7n",
        "author": "Ok_Following1323",
        "title": "Harlen Coben shows AI?",
        "content": "Are the scripts generally AI it’s like each show they make is compacted into like 2-3 sub plot twists that cohesively have nothing to do with each other and water down to the most thrill killing conclusions. It’s so in your face that you think it’s not what’s happening but it is. There’s some amazing actors without doubt but you’re so overwhelmed by the flashbacks and the connections all for them to lead back to nothing. The subplot about the secret child of the detectives husband in the show “ The Stranger” got given about 30 minutes of focus even though we literally didn’t care nor did it add to the actual plot.\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1reds7n/harlen_coben_shows_ai/"
    },
    {
        "id": "1re6jwd",
        "author": "glimmerware",
        "title": "HOW do I disable \"continue watching\" interruption popup???",
        "content": "I play netflix through a browser pulled over to my tv (I use it as a second monitor) and every hour or two while I'm fullscreen in a game on my main monitor, the stupid popup appears that says \"continue watching\" or \"back to browse\" and it halts the show and I have to alt tab out of my game to reset it\n\nI cannot find anything in settings to fix this...do I simply have to live with this annoyance? It literally causes my specific game lately to crash because it gets cranky when alt tabbed sometimes",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1re6jwd/how_do_i_disable_continue_watching_interruption/"
    },
    {
        "id": "1rdaimf",
        "author": "Helpful_Peanut_860",
        "title": "Tyra and ATM",
        "content": "Did Tyra think this docuseries was some sort of soft attempt to make everything okay and cover up whatever bad image she has now after ATM? But have no idea that all the people around her were actually throwing her under the bus one by one? I watched the show in the first few seasons (never really into it) and had zero idea the awful things this show had turned into. But this docuseries made me legit dislike her immensely. She is smug and fake and just completely full of bullsh\\*t. And while she thought she was redeeming herself, all people around her just outed her for who she truly is. And I really love that for all of them to get the truth out. ",
        "upvotes": 55,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1rdaimf/tyra_and_atm/"
    },
    {
        "id": "1re4he0",
        "author": "vueltas88",
        "title": "maggie and bianca: fashion friends",
        "content": "when i was like 8 or 9 i used to watch this show maggie and bianca on kids Netflix, im trying to find people who used to watch it too because like i haven’t seen ANY one who has 😭 \n\nonly seasons 1 &amp; 2 were dubbed, how do i watch the others?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1re4he0/maggie_and_bianca_fashion_friends/"
    },
    {
        "id": "1rdec62",
        "author": "RolyPolyOnSidewalk1",
        "title": "How to get Netflix to stop asking if I’m still watching?",
        "content": "On the Apple TV (streaming device), how do I get Netflix to stop asking if I’m still watching? I think it ask like every 30 minute. I think they changed the settings so, I can’t figure it out on the app. I tried to by logging in on my account on a search engine but, no luck finding those settings. Is there a way to change this? Thanks",
        "upvotes": 10,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1rdec62/how_to_get_netflix_to_stop_asking_if_im_still/"
    },
    {
        "id": "1rdxfon",
        "author": "elthecrafta",
        "title": "Video freezes, Audio keeps playing and Error Code D7702-1290",
        "content": "Since a while now, after like 5 Minutes watching a show or a movie on my Windows Laptop, the Video freezes while the sound keeps playing. After reloading the website in the web version, the sound still keeps playing, while, after some time, the Error Code D7702-1290 comes up. It happens BOTH on the web and the app version.\n\nThe audio first stops when I close the software or the browser.\n\nAnd yes, my drivers and windows systems are all up to date and I tried to contact the Customer Support several times. All which concluded in them telling me to contact the laptops manufacturer. But what is with the Error Code? I mean, it is NOT listed in the Netflix Support Center and I saw several people having the same issue.\n\nAnyone experiencing a similar issue or can help? It would be VERY appreciated!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rdxfon/video_freezes_audio_keeps_playing_and_error_code/"
    },
    {
        "id": "1rd6jj9",
        "author": "Leo_23-O",
        "title": "Does anyone else actually miss the \"Surprise Me\" button?",
        "content": "I was thinking about how Netflix killed the \"Play Something\" button a while ago because \"nobody used it.\" Honestly, at the time I didn't care, but now that the library feels so oversaturated, I kind of miss having a \"random\" option.\nThe current algorithm just keeps pushing the same 5 shows into every category, and I spend more time scrolling than actually watching anything. It feels like the discovery process is totally broken now.\nSince that button is gone, what are you guys using to break the loop? Do you use any external sites or just keep scrolling until your food gets cold? I’m so tired of this that I’m actually considering making my own tool to filter the catalog properly.",
        "upvotes": 26,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1rd6jj9/does_anyone_else_actually_miss_the_surprise_me/"
    },
    {
        "id": "1rdonwr",
        "author": "3ndCraft",
        "title": "I made a Chrome extension that returns access to over 900 Netflix profile icons!",
        "content": "Here's the extension if you want to go check it out!\n\n[https://chromewebstore.google.com/detail/restore-retired-netflix-p/alpmhadlelgmdgahangpkfnnpbeeagep?hl=en&amp;authuser=0](https://chromewebstore.google.com/detail/restore-retired-netflix-p/alpmhadlelgmdgahangpkfnnpbeeagep?hl=en&amp;authuser=0)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rdonwr/i_made_a_chrome_extension_that_returns_access_to/"
    },
    {
        "id": "1rcrmc8",
        "author": "lingeringneutrophil",
        "title": "Gordon Ramsey documentary: an overly long advertisement",
        "content": "In general, I like Gordon and have eaten at two of his restaurants in London. The food was very good. He can cook, he is a competent chef no doubt.\n\nHe is also a brand rather than a chef these days, and he works with media very well.\n\nThis whole documentary could have been half its length very easily. A lot of it felt very repetitive.\n\nYes, there are always some growing pains when opening a new restaurant. Yes, the food looks fabulous and influencers are gonna love it. Is it sustainable? Is it nutritious?! What about the overall environmental impact of serving this kind of food during the winter in London. Nobody asks these questions that matter more and more.\n\nWhat honestly bothered me was his empty-eyed wife having so much space where she didn’t really say anything too interesting. If you cut her bits out nothing of substance would be missing.\n\nHe brings up the wedding of his daughter so many times yet it is not a part of this documentary so we don’t even get to see the dress, flowers or food. Just an engagement party that feels a bit forced as the cameras are there.\n\nIt is an ad for his new restaurant in London, and the bits about him being a family man felt incredibly disingenuous and staged. He does a lot of cuddling with the kids but very little parenting. He doesn’t even cook for them in the show.\n\nHe says he loves his kids so much yet is gone easily six weeks at a time. His whole arrival in a helicopter to their country house in Cornwall was just silly and wasteful. He honestly comes across an absent father no matter the editing.\n\nHim talking about fitness? Bro I was a volunteer at London Marathon in 2009 and you didn’t even make it past 10 km. I was waiting to snap your photo yet you never made it to my mark (mile 15). Like give me a break. You travel, take photos with fans, shake hands, make TV shows, you have zero time for fitness or your kids so you’re in no position to lecture anyone about buying iPads for their kids.\n\nOverall, there was very little food shown, too much disingenuous family moments that weren’t even interesting, too much talking by his wife saying absotely nothing, and all those emotional reveals were spoken about many times before.\n\nA total meh for me",
        "upvotes": 113,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1rcrmc8/gordon_ramsey_documentary_an_overly_long/"
    },
    {
        "id": "1rcjq44",
        "author": "Competitive_Gene_898",
        "title": "‘Wednesday’ Season 3 Welcomes Winona Ryder to the Cast",
        "content": "",
        "upvotes": 185,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rcjq44/wednesday_season_3_welcomes_winona_ryder_to_the/"
    },
    {
        "id": "1rdphce",
        "author": "StayComprehensive743",
        "title": "Ranking the episodes of The Society",
        "content": "1. Episode 8 - Poison\n\n2. Episode 3 - Childhood’s End\n\n3. Episode 6 - Like a F-ing God or Something\n\n4. Episode 5 - Putting on the Clothes\n\n5. Episode 9 - New Names\n\n6. Episode 1 - What Happened\n\n7. Episode 4 - Drop by Drop\n\n8. Episode 7 - Allie’s Rules\n\n9. Episode 10 - How it Happens\n\n10. Episode 2 - Our Town",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rdphce/ranking_the_episodes_of_the_society/"
    },
    {
        "id": "1rdk3dl",
        "author": "NoraMason1986",
        "title": "Question about 11.22.63 and Sadie",
        "content": "SPOILERS BELOW\n\nI just finished watching 11.22.63 and enjoyed it.   I have not read the book so my basis is the Hulu series only.   I have watched videos about the differences between the book and series, however.  \n\nTime travel always raises interesting scenarios and questions.  \n\nSomething that crossed my mind relates to Jake’s plan to take Sadie to the future with him after he saves JFK.  \n\nSince Sadie is from that time period, wouldn’t she return to the future as the old woman we see at the end of the series?   \n\nThe premise is that the time traveler loses two minutes when they return.   \n\nThoughts? ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rdk3dl/question_about_112263_and_sadie/"
    },
    {
        "id": "1rd7rq0",
        "author": "Appropriate_Gur7902",
        "title": "Discussion: Can we please talk about Japanese dating show The Boyfriend!",
        "content": "Ughh I love this show much and a lot of the Japanese dating shows. The contrast between American and Japanese dating shows specifically The Boyfriend is so stark. Even when comparing it to The Ultimatum: Queer Love which is way better than a lot of other American hetero dating shows. The Boyfriend is so sweet and understated. This is one of the few reality dating shows that exists that is devoid of unethical and exploitative producers stringing together narratives and creating storylines to stir drama and boost ratings. It's also so raw and real in a way that can make some people maybe feel uncomfortable. There is a lot of silence and pauses in the episodes something that I think more closely mirrors reality than most of \"reality tv.\" Everyone is sohonest on the show in a way that makes you \"awww\" instead of cringe!",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rd7rq0/discussion_can_we_please_talk_about_japanese/"
    },
    {
        "id": "1rd3izr",
        "author": "CodDefiant2710",
        "title": "Winona Ryder To Appear in Third Season of Netflix’s ‘Wednesday’",
        "content": "[Winona Ryder](https://www.imdb.com/name/nm0000213/) will be joining the cast of Netflix’s [***Wednesday***](https://www.imdb.com/title/tt13443470) as it enters is third season. Ryder, who has starred in [***Stranger Things*** ](https://www.imdb.com/title/tt4574334/)and [***Beetlejuice***](https://www.imdb.com/title/tt0094721), will reportedly play the role of Tabitha, a new character in the series. Eve Green will also appear in the role of Morticia Addams’s troubled sister Aunt Ophelia. What do you think their decision? \n\n[https://cinemadailyus.com/news/winona-ryder-to-appear-in-third-season-of-netflixs-wednesday/](https://cinemadailyus.com/news/winona-ryder-to-appear-in-third-season-of-netflixs-wednesday/)",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rd3izr/winona_ryder_to_appear_in_third_season_of/"
    },
    {
        "id": "1rdthxk",
        "author": "Retrobanana64",
        "title": "What should I watch next",
        "content": "Behind her eyes or th chest nut man or paradise  on Hulu \n\nI’ve watched the first episode of paradise twice and it can’t hold my attention but everyone is raving about ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rdthxk/what_should_i_watch_next/"
    },
    {
        "id": "1rcmiyx",
        "author": "amarainn",
        "title": "What is your favorite show or movie that isn't in English?",
        "content": "I love that Netflix has so much content that isn't in English, but I get the feeling I don't see all the options that are available when it comes to non-English language content, so I would love to know some of your favorite recommendations!",
        "upvotes": 44,
        "comments": 229,
        "media": null,
        "permalink": "/r/netflix/comments/1rcmiyx/what_is_your_favorite_show_or_movie_that_isnt_in/"
    },
    {
        "id": "1rdp63p",
        "author": "Most_Shirt_5791",
        "title": "Subtitels bugging out while watching The Flash",
        "content": "Currently watching the flash and on season 3, everything was fine until yesterday night when my subtitels changed font for somereason, and also started bugging out and going off center and wierd places like bottom left or right corner out of nowhere. Checked my settings, reset everything still the same (PC/TV/Phone), everyone of them has this glitch or w/e. Decided to check out other shows and/or older season of the flash, and everything seems to be fine with the subtitles there. Wierd thing is, i did go up to episode 3 on season 3 with no problems at all, but when i go back to episode 2 or 1, now the problem occurs there aswell. Any help might be appriciated. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rdp63p/subtitels_bugging_out_while_watching_the_flash/"
    },
    {
        "id": "1rcv428",
        "author": "Crafty_Two5432",
        "title": "Documentaries/reenactments not about murders:",
        "content": "I loved Fyre, Unknown Number, Poop Cruise, Tinder Swindler, Bad Vegan, Woodstock 99’. \n\nI know I said no murders but I also reaaally liked docuseries that aren’t too murdery like The Thing About Pam and Dr Death and The Act. I’m not really into anything about prisons or abductions. ",
        "upvotes": 10,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1rcv428/documentariesreenactments_not_about_murders/"
    },
    {
        "id": "1rcs2m4",
        "author": "Edexote",
        "title": "Extremelly low bitrate on Netflix",
        "content": "I recently saw Dune Two on 1080p Blu-Ray and I decided to compare the image with Netflix. I was greeted with an AV1 1080p stream of 0.49 Mbps. I was shocked. It's a brand new TCL TV running Google TV and the info showed this. Of costumer support doesn't fix this, I'll cancel. This is what they serve to paying customers?\n\nEdit: after I contacted Netflix support, the account was canceled. Their support is useless, they just direct you to the KBs and you're unable to escalate the situation. There are plenty of other streaming platforms anyway, all of them with better image quality.",
        "upvotes": 16,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1rcs2m4/extremelly_low_bitrate_on_netflix/"
    }
]