[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 650,
        "comments": 415,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1kt8f5n",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mission: Impossible - The Final Reckoning / Lilo &amp; Stitch / Friendship) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dinosaur](https://old.reddit.com/r/movies/comments/1kt8baq/official_throwback_discussion_dinosaur_spoilers/?)\n\n[Road Trip](https://old.reddit.com/r/movies/comments/1kt8bc6/official_throwback_discussion_road_trip_spoilers/?)\n\n\n# Still in Theaters\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 82,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kt8f5n/official_discussion_megathread_mission_impossible/"
    },
    {
        "id": "1kvlltr",
        "author": "freudian_nipps",
        "title": "Werner Herzog on shooting extra footage for films",
        "content": "",
        "upvotes": 5543,
        "comments": 307,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7hg3zzon023f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kvlltr/werner_herzog_on_shooting_extra_footage_for_films/"
    },
    {
        "id": "1kvcddc",
        "author": "Honkydoinky",
        "title": "The princess bride just stole my heart",
        "content": "I watched the princess bride for the first time today, and everything about that movie is perfect in my eyes. At no point of the movie was I bored for a moment, I went in thinking I’d watch half and finish it later. Boy was I wrong. Every character felt charming and fleshed out enough for their role in the story. I really was rooting for Inigo, hoping Westley and buttercup would find a way to end up together. There were funny enough gags to get a chuckle out of me like the mawwage part towards the end. I just wanted to get a short rant off about how much I love this movie",
        "upvotes": 5166,
        "comments": 526,
        "media": null,
        "permalink": "/r/movies/comments/1kvcddc/the_princess_bride_just_stole_my_heart/"
    },
    {
        "id": "1kvf79v",
        "author": "Dramatic-Airline-415",
        "title": "Missing scene in The Apprentice 2024 was it cut for streaming",
        "content": "I saw The Apprentice in the cinema and remember a scene where Trump, after the scalp reduction procedure, shouts at Ivana saying “Your f***ing doctor has ruined me.”\n\nI just rewatched the movie on a streaming platform and that scene is gone. I checked IMDb and Wikipedia and found no mention of different versions or edits.\n\nIs it possible this scene was removed between the theatrical release and the streaming version? Or am I misremembering? If it was cut, does anyone know the reason?",
        "upvotes": 1311,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1kvf79v/missing_scene_in_the_apprentice_2024_was_it_cut/"
    },
    {
        "id": "1kvgu3r",
        "author": "indiewire",
        "title": "Scarlett Johansson Says She Has Always Wanted to Direct, but Acting Took Precedence",
        "content": "",
        "upvotes": 658,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C7tsG-ngybjw6IKfH3PuJWZyvjfrLLTWZd-WKtV8oE4.jpg?auto=webp&amp;s=a9c7626cf85c64658af03c5fc1409e97814485d3"
        },
        "permalink": "/r/movies/comments/1kvgu3r/scarlett_johansson_says_she_has_always_wanted_to/"
    },
    {
        "id": "1kv1jou",
        "author": "Amaruq93",
        "title": "\"Braveheart\" at 30: Mel Gibson’s gory, hokey 1995 Oscar winner plays like a biblical epic",
        "content": "",
        "upvotes": 5268,
        "comments": 1120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/44nV70BuAJpxiEJHbSuNSBw5gLjWPG5MKNDBhvXBJSg.jpg?auto=webp&amp;s=77743073bedaaf1e1328ae7a3081f9e99ab16413"
        },
        "permalink": "/r/movies/comments/1kv1jou/braveheart_at_30_mel_gibsons_gory_hokey_1995/"
    },
    {
        "id": "1kvkaq3",
        "author": "Wonder-Lad-2Mad",
        "title": "Holy shit, Wrath of Khan (1982) blew my mind. When Star Trek is good, It's *really* fucking good.",
        "content": "My only experience with Star Trek was the first JJ movie, so I have some basic familiarity with the setting. Suddenly I got the urge to go back and experience the classic series. I'm not still sure about commiting to watching any of the shows so I decided to check out the movies.\n\n\nI saw Star Trek The Motion Picture. Man, that was slow as hell. The story is fine, but the plot progresses at the speed of snails. So many unnecessary exterior shots and scenary. But despite that, I got a taste for what classic Trek was like and I dug it.\n\n\nRn I finished Wrath of Khan. Ah that hit the spot man. It was so good. Ugh I love old timey acting so much. So much class and the performances are so elegant.\n\n\nWhat a kick ass story, high stakes and emotional. They totally got me. I &gt;!wasn't expecting at all to see Spock die, bravo. And the eulogy scene is brilliant!&lt;\n\n\nShatner's great as Kirk. I love how cunning and willful his Kirk is, compared to the wildcard rebel that's Chris Pine's Kirk. I'm really curious now what young Kirk must be like.\n\n\n\nBest performance is hands down Ricardo Montalban. Holy shit that guy can act and deliver a mean monolouge. Every line he speaks is iconic. 10/10 delivery. Ironicly this isn't the first time I've seen Montalban. I knew him as the villain from Naked Gun 1 lmao. He was performing his heart out in that too. What a great actor.\n\n\n\nOh man, I dug the vibes of the this movie so much that I'm gonna watch Star Trek 3 and 4 too. I don't care if they're not as good, as long as I get more from the cast I'm gonna enjoy it.\n\n\n\nAlso, R.I.P. &gt;!Captain Terrell!&lt;, you're only crime was wearing a red coat.",
        "upvotes": 291,
        "comments": 115,
        "media": null,
        "permalink": "/r/movies/comments/1kvkaq3/holy_shit_wrath_of_khan_1982_blew_my_mind_when/"
    },
    {
        "id": "1kvfwij",
        "author": "LiquidDreamtime",
        "title": "School of Rock - Only Jack Black could do that",
        "content": "I watched School of Rock (2003) this morning with my kids and it’s a wonderfully cute film that is paced well and really does a great job of setting up and playing out the whole story.\n\nI think the adults were not cast/acted particularly well, his buddy Ned (Mike White) isn’t a very convincing anything and Patty (Sarah Silverman) as the grating-annoying GF was flat. I even found Principal Mullins (Joan Cusack) to be over the top in all ways. And despite this, Dewey Finn (Jack Black) absolutely steals the show and magically brings along a bunch of kids to fit in perfectly.\n\nWhile watching it, I couldn’t help but think ANY other actor on earth as Dewey Finn and this movie is very quickly just horrible. Who else can do what he does? Or has their own version that fits here?\n\nWhat are some other movies that would seemingly be awful with a different actor/actress, but are actually really great because a special talent pulled it off?",
        "upvotes": 473,
        "comments": 107,
        "media": null,
        "permalink": "/r/movies/comments/1kvfwij/school_of_rock_only_jack_black_could_do_that/"
    },
    {
        "id": "1kvg4qs",
        "author": "nickrashell",
        "title": "What movies were unexpectedly tear jerkers for you?",
        "content": "For me it was Warrior 2011. I remember going into the theater with a few of my friends excepting an action packed MMA movie. By the end we were all in tears. \n\nI still don’t think I have seen a movie that has evoked a more emotional response. There are at least two scenes that no matter how many times I have seen the film cause tears to fall down my face.\n\nThe movie itself is unique in that there are no true antagonists, except for the past and the pride and bitterness that keeps us from forgiveness. There are two heroes you are equally invested in. \n\nIf you have held out on seeing it because you aren’t into MMA, don’t short change yourself, I am not into MMA either. And if you’ve never heard of it I urge you to seek it out.\n\nBut, what are some movies you didn’t expect to move you emotionally but did?",
        "upvotes": 369,
        "comments": 849,
        "media": null,
        "permalink": "/r/movies/comments/1kvg4qs/what_movies_were_unexpectedly_tear_jerkers_for_you/"
    },
    {
        "id": "1kvgtnh",
        "author": "Bennett1984",
        "title": "Empire Records, The Doom Generation, Pump Up the Volume and more great forgotten 90s teen movies",
        "content": "",
        "upvotes": 321,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k1negrQEUY2-EP9KcBc-aAyPiEMJr1UQRnELL2MddgM.jpg?auto=webp&amp;s=7ef77b9582d128d344c201bf6a1e49b7106e45ae"
        },
        "permalink": "/r/movies/comments/1kvgtnh/empire_records_the_doom_generation_pump_up_the/"
    },
    {
        "id": "1kvi4my",
        "author": "trep88",
        "title": "Best examples of a teacher/mentor showing a student that’s the impossible is possible.",
        "content": "In Top Gun: Maverick, Tom Cruise’s character, “Maverick”, completes the mission simulation by flying the course 15 seconds faster than the previously set “impossible” time goal.\n\nAnother example, Yoda lifting the X-wing out of the swamp after Luke failed to do so in Empire. \n\nWhat are your favorite examples of a mentor inspiring a mentee by doing “the impossible”?  ",
        "upvotes": 230,
        "comments": 130,
        "media": null,
        "permalink": "/r/movies/comments/1kvi4my/best_examples_of_a_teachermentor_showing_a/"
    },
    {
        "id": "1kvkgkb",
        "author": "KindaDrunkRtNow",
        "title": "What are the most overused lines in movies?",
        "content": "I asked this somewhere else, but I think it fits in this subreddit better. I was watching the new mission impossible last night and one of the characters said, \"he did it. The son of a bitch did it\", and I swear to God I looked at my brain when I rolled my eyes at that. Other examples would be somebody telling somebody to speak English when they're talking about some sort of technical stuff. So what do y'all think?",
        "upvotes": 143,
        "comments": 393,
        "media": null,
        "permalink": "/r/movies/comments/1kvkgkb/what_are_the_most_overused_lines_in_movies/"
    },
    {
        "id": "1kvj2im",
        "author": "BunyipPouch",
        "title": "New Poster for Thriller 'Bark' - A man wakes up in the middle of a remote forest, tied to a tree with no recollection of how he got there. With time running out, a mysterious stranger appears and he must reckon with the demons of his past and fight to survive to find a way out of his nightmare.",
        "content": "",
        "upvotes": 156,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0qcqn9q0b13f1.jpeg?auto=webp&amp;s=a4dbdece91dd3ec6c43e4c425e03906212e17df8"
        },
        "permalink": "/r/movies/comments/1kvj2im/new_poster_for_thriller_bark_a_man_wakes_up_in/"
    },
    {
        "id": "1kv4um1",
        "author": "Unused_Content19",
        "title": "What is the most disturbing movie ending you ever saw?",
        "content": "Smile. As much as I hate this movie, seeing that monster come out of the skin and enter Rose’s body, and Joel entering only for the curse to pass onto him as he watches Rose burn herself is quite disturbing for me.                                                                    \n                              \nAnd, I just wanna say, Rose’s burning body being seen in Joel’s eyes is something this movie actually does good.",
        "upvotes": 762,
        "comments": 936,
        "media": null,
        "permalink": "/r/movies/comments/1kv4um1/what_is_the_most_disturbing_movie_ending_you_ever/"
    },
    {
        "id": "1kv970y",
        "author": "crumble-bee",
        "title": "Whenever I say the word \"accoutrement\" I can't help but think of the 40 year old virgin - do you have anything similar?",
        "content": "\"I spent like three hours... like three and a half hours making like, the eggs and the paprika, and the onions and all the other ***accoutrement*** - and then by the time I was done I really didn't feel like eating it. \n\nAnd I didn't have any bread.\"\n\nI think that's just such a funny joke in an excellent movie, but accoutrement is burned into my brain and will forever be associated with this movie. \n\nDo you have one single word that takes you immediately back to the movie you first saw it in? ",
        "upvotes": 296,
        "comments": 302,
        "media": null,
        "permalink": "/r/movies/comments/1kv970y/whenever_i_say_the_word_accoutrement_i_cant_help/"
    },
    {
        "id": "1kvplm0",
        "author": "mrjohnnymac18",
        "title": "Hush over Hollywood: why has it become so hard to make films in Los Angeles?",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EiNGwa7L5o2bLg92ZOors2DY-BfelbicXy4rdtxcKfE.jpg?auto=webp&amp;s=0a8b8bf54727eb0e9bb6185c9084923e94478bcd"
        },
        "permalink": "/r/movies/comments/1kvplm0/hush_over_hollywood_why_has_it_become_so_hard_to/"
    },
    {
        "id": "1kvg55b",
        "author": "LemmyLola",
        "title": "Asteroid City... What an absolute joy",
        "content": "I found it by accident while looking through filmographies and there it was..We watched the trailer and knew it was a must see. So, we're watching it tonight and its so utterly brilliant in its writing, cinematography and casting, I am in love with this film. \nIf you enjoy Coen brothers movies like Intolerable Cruelty and the Hudsucker Proxy, you would likely enjoy this also. Its a Wes Anderson, Roman Copolla film.\nThe cast is stellar and its one of those 'everyone is in it' movies which is why I'm even more bewildered by only finding it now.\nAnyways... All that to say.... Highly recommend:) ",
        "upvotes": 74,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1kvg55b/asteroid_city_what_an_absolute_joy/"
    },
    {
        "id": "1kvebo8",
        "author": "paulfromatlanta",
        "title": "Iran summons French envoy in diplomatic row over 'insulting' Cannes remarks",
        "content": "",
        "upvotes": 95,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lUbqQvR716eIIHQ6AyQfv7kb6MkjfiZzyhVAEf7rTcY.jpg?auto=webp&amp;s=388496c05bd7dd0aeeb206af78ddfb4a03726847"
        },
        "permalink": "/r/movies/comments/1kvebo8/iran_summons_french_envoy_in_diplomatic_row_over/"
    },
    {
        "id": "1kutr6k",
        "author": "blac_sheep90",
        "title": "Justin Long's physical performance in Dodgeball is fantastic.",
        "content": "Rewatched dodgeball for the millionth time this evening and every time Justin is on screen he's doing something with his body that makes me laugh. Be it getting tangled up in exercise equipment, crushed by a large woman, catching and dropping then exploding a beer all over himself, taking wrench to the face, or taking a hard hit from a dodgeball from the White Goodman. He's one of the best aspects of the movie.\n\nDodgeball remains an extremely funny movie.",
        "upvotes": 2382,
        "comments": 179,
        "media": null,
        "permalink": "/r/movies/comments/1kutr6k/justin_longs_physical_performance_in_dodgeball_is/"
    },
    {
        "id": "1kul1g6",
        "author": "LookAtThatBacon",
        "title": "For the movie adaptation of The Martian, Ridley Scott changed the day the crew left Mars from sol six to sol 18 because he wanted to justify the higher amount of human waste used to make fertilizer. What are other instances of a movie adaptation making changes for interesting reasons?",
        "content": "Source for the fact about The Martian: https://www.thedailybeast.com/the-man-behind-the-martian/\n\n&gt; But the movie changed how long the crew spent on the planet for a funny reason. In the book they left after sol six, but in the movie they leave after sol 18. Ridley wanted Mark to stir a nice big bucket of shit when he was creating the fertilizer for the crops. Ridley said, after only six days of six people shitting that’s 36 packets. He wanted them to stay longer, so that the bucket of shit could be full.",
        "upvotes": 11308,
        "comments": 1596,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5BSO5UiPNnyQaThrBsXIGITSv-lq-stoG6S3M-z3qhs.jpg?auto=webp&amp;s=f9bedfeef1801f2abac4b8e982f04f37b475cd4e"
        },
        "permalink": "/r/movies/comments/1kul1g6/for_the_movie_adaptation_of_the_martian_ridley/"
    },
    {
        "id": "1kvkpnt",
        "author": "dcterr",
        "title": "The Man Who Shot Liberty Vallance",
        "content": "I'm almost done with my Jimmy Stewart marathon, and I just watched this one tonight. I've seen it once before, and though I'm not a big fan of Westerns, I do really like this one! Jimmy Stewart is excellent in it as the righteous law-abiding citizen who wants to bring Liberty Vallance to justice and bring law and order to an old Texas town. I'm not crazy about the ending though, though I don't know if I should talk about it here because it could be a spoiler! I hate John Wayne, by the way, and this movie doesn't raise my opinion of him as an actor!",
        "upvotes": 27,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1kvkpnt/the_man_who_shot_liberty_vallance/"
    },
    {
        "id": "1kuvdoh",
        "author": "JenL0159",
        "title": "Annihlation",
        "content": "Why aren’t more people obsessed with this movie?! All female cast. Sci-Fi/Horror/drama. Natalie Portman. Aliens. With a few twists. This movie has everything and it’s incredibly interesting and terrifying!!! And kinda deep haha! I’ve heard it’s starting to be considered a cult-classic, but I’m surprised it’s didn’t win some kind of award. It has a slightly independent-feel. They’re is a lot going on here and it’s well done. Great acting. Not cliche. Suspenseful. Creative. Scary. I am rarely impressed by anything Sci-fi ish but this movie is amazing. It’s one of very few that keep me from multi tasking or playing on my phone at the same time. Iykyk. And I will never recover from the bear…\n\nThis movie is not for kids imo. it’s a little intense.",
        "upvotes": 1389,
        "comments": 373,
        "media": null,
        "permalink": "/r/movies/comments/1kuvdoh/annihlation/"
    },
    {
        "id": "1kv3blw",
        "author": "ubcstaffer123",
        "title": "Mara Corday Dies: ‘Tarantula’ Cult Film Star &amp;amp; ‘Playboy’ Playmate Was 95",
        "content": "",
        "upvotes": 265,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jiow24u_BtUt5cgWfLvjWZF8kNTAQHEJC9TXxmr-MAc.jpg?auto=webp&amp;s=ecde91f773ff03671c59e2a93ea5371a04432086"
        },
        "permalink": "/r/movies/comments/1kv3blw/mara_corday_dies_tarantula_cult_film_star_amp/"
    },
    {
        "id": "1kuy64g",
        "author": "NotSoEnlightenedOne",
        "title": "Ocean’s 11 is closer to the MIssion Impossible TV show than the films ever were.",
        "content": "I remember watching the original mission impossible when it came out and thought it was good but it was missing the team element and more about Tom Cruise. 8 films on and that has never changed.\n\nThe team dynamic in Ocean’s 11 was fun and sparked the thought the spirit of the MI TV show is much better depicted in that than Tom Cruise’s output.\n\nAnyone else think they should emphasise the team dynamic and the long con/heist going forward once Cruise leaves the building?",
        "upvotes": 666,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1kuy64g/oceans_11_is_closer_to_the_mission_impossible_tv/"
    },
    {
        "id": "1kvic0m",
        "author": "Alternative-Cake-833",
        "title": "A full list of movies from major and mini-major studios that remain shelved with no release dates yet.",
        "content": "This list includes 12 movies that were shot a while back but so far, they remain shelved and haven't had any release dates yet. This list doesn't include any direct-to-streaming releases, only ones meant for theatrical releases.\n\nAnniversary (Lionsgate): This movie was shot in the summer of 2023 during the SAG-AFTRA strike as an Interim Agreement was signed to finish filming but so far despite the film being rated by the MPA in October 2024, there's no U.S. release date for the film so far.\n\nDistant (Universal): Despite the film being released in select international territories via streaming, there's still no sign of a U.S. release coming anytime soon. As per the U.S. Copyright Records, it does seem like that the distribution rights reverted to Amblin back in April 2024. This movie was shot in late 2020 during COVID and the directors did Lyle, Lyle Crocodile during post-production for this film.\n\nFaces of Death (Legendary): This movie was shot in spring 2023, had test screenings in late 2023/early 2024 and was rated by the MPA in May 2024 but apparently, it's stuck in post-production limbo. The film was originally supposed to go out through Sony Pictures as part of a distribution deal they had with Legendary but that deal was cut short late last year.\n\nHarvest Moon (Miramax): This Paul Bettany movie was shot in fall 2021 but since filming wrapped, there's been no news about it and it's possibly that it got shelved during the post-production phase.\n\nHorizon - An American Saga - Chapter 2 (Warner Bros.): This movie was supposed to be released on August 16, 2024 but after Chapter 1 underperformed, WB then took off the movie from the release schedule in July 2024. Despite screenings at the Venice International Film Festival in September 2024 and at the Santa Barbara Film Festival in February, this movie still hasn't gotten a new release date yet and after those legal issues, I don't think that we are seeing it anytime soon.\n\nIn the Blink of an Eye (Searchlight): This movie was shot from March 2023 to May 2023 and was supposed to come out last year but never did. It got rated by the MPA in March 2025 so it should come out later this year, probably on Hulu.\n\nIn the Grey (Lionsgate): This movie was shot from August 2023 to October 2023 with a SAG-AFTRA Interim Agreement in place. Originally set to be released on January 17, 2025. In November 2024, Lionsgate removed the film from their release schedule mainly because the film wasn't completed on-time such as reshoots and pick-up shots being delayed for months as they still haven't happened. Director Guy Ritchie has since done two movies: Fountain of Youth for Apple TV+ which just came out on Friday and Wife &amp; Dog which is currently in post-production.\n\nThe Haunting in Wicker Park (Sony): This movie was shot in spring 2022 and was supposed to come out on January 6, 2023 but M3GAN caused the film to move off of its release date and despite being rated by the MPA in April 2023, there's also no sign of a release date anytime soon.\n\nThe Strangers - Chapter 3 (Lionsgate): This movie was shot simultaneously as all three of them were shot from September 2022 to November of 2022. Originally set to be released in early 2025, no release plans have been announced so far but I assume that it's definitely coming out next year as Chapter 2 is coming out in September after being delayed by a WHOLE year.\n\nVicious (Paramount): This movie just wrapped filming about a year ago but it was originally supposed to debut on August 8, 2025 before being moved up by a whopping six months to February 28, 2025. Two months before its supposed release date, the film was removed on Paramount's release schedule and so far, hasn't been redated on the calendar. A Paramount+ dump is definitely incoming but they need movies for their 2026 slate anyways.\n\nWar of the Worlds (Universal): was shot in fall 2020 and was rated by the MPA in April 2024. At one point, it was rumored to go to Peacock but nothing since then.\n\nWizards! (A24): This movie was shot in the summer of 2022. It was originally scheduled to premiere in 2024 and despite the film being rated by the MPA in October 2023, the film was undergoing a re-edit in late 2023/early 2024 but since then. Nothing. And the director behind it (David Michôd) has since shot an another movie with Sydney Sweeney late last year.",
        "upvotes": 34,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1kvic0m/a_full_list_of_movies_from_major_and_minimajor/"
    },
    {
        "id": "1kvo66y",
        "author": "Left-Way-7343",
        "title": "Please recommend me some awesome and trippy movies for my movie night.",
        "content": "Hi people.\nI am not sure if this is allowed but I'm in a dire need of some movie recommendations. I am hosting a mushroom movie night with a few close friends of mine and I am stumped on what to choose as I want something none of us has seen before.\n\nMovies in the same vein as House (Japanese movie), Fantastic Planet, Brazil, Being John Malkovich or even something like Dollman would be awesome.\n\nThe movies I have curated already is only Wizards (1977) and Mad God. \n\nAny genres are welcome. I would like a mix of movies to choose from depending on everyone's moods. \n\nThanks all.\n\nEdit: please nothing too \"artsy fartsy\" like Holy Mountain. \nAlso the more obscure and niche the better... I want movies I probably never heard before. ",
        "upvotes": 8,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1kvo66y/please_recommend_me_some_awesome_and_trippy/"
    },
    {
        "id": "1kvq5ls",
        "author": "C-i-d",
        "title": "Best book about the Hollywood blacklist?",
        "content": "Can anyone recommend a book about the post-war blacklist that gives a good overview/history of the time? I'm specifically *not* after memoirs or oral history/interview type books, which quite a lot of books on the topic seems to be.\n\nThe books I've seen that give a simple history don't seem to have great reviews, hence hoping for a recommendation here. I might go for the 'High Noon' focused book, but much as I like that film I'm not looking for a history of one movie in particular.\n\nThanks for any replies.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1kvq5ls/best_book_about_the_hollywood_blacklist/"
    },
    {
        "id": "1kvm8po",
        "author": "quick_draw_mcgraw_3",
        "title": "The sound effects during the shootouts in Den of Thieves is really well done.",
        "content": "I recently watched Den of Thieves. To be honest id never heard of it until the second one came out and I learned it was a sequel. Reviews seemed to indicate it was pretty decent so gave it a watch and man, the shoot outs/sound effects at the beginning and end of the movie are so well done. It felt authentic (as someone who has zero experience with firearms) and you could really feel each shot.\n\nIt reminded me a little of a game I played years ago called Black that had similar sound effects/authentic feeling gun play.",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kvm8po/the_sound_effects_during_the_shootouts_in_den_of/"
    },
    {
        "id": "1kv51j3",
        "author": "KnightofGarm",
        "title": "Movies you heard bad things about, but ended up liking after seeing it",
        "content": "I watched the first Kingsman movie a few years ago and thought it was a lot of fun. I didn't even know there was a second one until I read some people saying that it was bad, that it disrespected the characters from the first movie, and some going as far as to say that you should only watch the first movie and pretend the sequel doesn't exist.\n\nYesterday I finally got around to watching it, and... just like the first one it was a lot of fun... not as good, but I didn't even think it was mediocre let alone anywhere near as bad as people made it out to be.\n\nThere are a lot of other movies I can think of that fit this criteria (such as The Lost World: Jurassic Park), but most of them I already saw before hearing the bad word of mouth, so I was curious what your experiences are of hearing a movie is bad/mediocre only to end up enjoying it are.",
        "upvotes": 140,
        "comments": 271,
        "media": null,
        "permalink": "/r/movies/comments/1kv51j3/movies_you_heard_bad_things_about_but_ended_up/"
    },
    {
        "id": "1kv9334",
        "author": "BunyipPouch",
        "title": "Miles Teller To Play A Nashville Country Music Star in Fantastical-Comedy ‘Possum Song’ For ‘Sing Sing’ Writer-Director Greg Kwedar",
        "content": "",
        "upvotes": 75,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H_OeltFM5Pq7w3jPyDxhBMfv1qCqMzglIb5YQmvcWcA.jpg?auto=webp&amp;s=3f9bc624d7f1b534ee759e280a1b772a04e93d5e"
        },
        "permalink": "/r/movies/comments/1kv9334/miles_teller_to_play_a_nashville_country_music/"
    },
    {
        "id": "1kve1w8",
        "author": "One_Impression_363",
        "title": "King Petar the First - Best WW1 Movie I have seen so far",
        "content": "Also know as “Blood of the Brave”\n\nIf you want to see the reality of the struggles for a brave nation in the Balkans with the highest percentage of population lost in the Great War for freedom - then look no further.\n\nThe film is a masterpiece. Great acting, beautiful shots from the nature and mountains and a one of a kind story about true leadership and hardships people face even beyond the battle field during war. Shows a king who truly serves the people and was loved for it.\n\nYou can find it on Amazon Prime, Tubi with subtitles or the dubbed version is on YouTube.\n\nTrailer: https://youtu.be/PPrSU9dIBrs?si=6XJYGePnFcCKMRdf",
        "upvotes": 31,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p2n6R3UkUOYahcAV836QPg3QIfMlvd7G7zl5pYZMZq0.jpg?auto=webp&amp;s=c34dae5f6670916f7b566517b80505777c4e1a78"
        },
        "permalink": "/r/movies/comments/1kve1w8/king_petar_the_first_best_ww1_movie_i_have_seen/"
    }
]