[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pe1a2i",
        "author": "Competitive_Pop_2345",
        "title": "Gruppo whatsapp per uscite e conoscenze nuove 🫂",
        "content": "Ciaoo popolo di Reddit! Sto notando l’ennesimo post di questo subreddit di gente che ha voglia o bisogno di fare conoscenze nuove. Ebbene sempre attraverso questa magnifica piattaforma siamo riusciti a creare un gruppo WhatsApp da un’annetto (ATTIVO)e legare delle profonde amicizie e spesso quando è possibile partecipiamo a degli eventi anche all’infuori di Torino.\n\nHo deciso di dare spazio ad accogliere nuove persone, tenendo conto di:\n\n-Il target del gruppo di ragazzi e ragazze va dai 21 fino ai 29 anni, non ci spingiamo più di 30 se non in alcuni casi.\n\n-Non si tratta di un gruppo superficiale composto da 100 e passa persone dove poi ci si ritrova in pochi a uscire. Siamo una trentina circa ma ben selezionati in base alle partecipazioni.\n\n-È un gruppo FATTO per dare spazio a nuove amicizie che si possono legare profondamente col tempo, non a dei Dating ☺️ \n\n-Le uscite sono di solito 2/3 a settimane e possono prevedere l’uscita come il classico aperitivo, giochi da tavoli tranquilli e quando c’è un’evento più interessante si propone sempre volentieri.\n\nPer chi fosse interessato/a mi scriva in DM per saperne di più.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pe1a2i/gruppo_whatsapp_per_uscite_e_conoscenze_nuove/"
    },
    {
        "id": "1pe5903",
        "author": "asilorepublic95",
        "title": "Enjoy a torino",
        "content": "Ultimamente sull app si vedono meno auto enjoy,come mai secondo voi? Alternativa ad enjoy?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pe5903/enjoy_a_torino/"
    },
    {
        "id": "1pdflzg",
        "author": "Tullio_Ostello",
        "title": "Si diceva qualche giorno fa che erano rimaste 16 Enjoy a Torino",
        "content": "Mi sa che pure quelle sono andate",
        "upvotes": 41,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4ieqczddu15g1.jpeg?auto=webp&amp;s=3a571e4de37ffe6501301fba21796015bd86b719"
        },
        "permalink": "/r/torino/comments/1pdflzg/si_diceva_qualche_giorno_fa_che_erano_rimaste_16/"
    },
    {
        "id": "1pdyzi5",
        "author": "Wonderful_Wafer_386",
        "title": "TEATRO TORINO",
        "content": "Salve, da anni mi piacerebbe frequentare dei corsi di teatro in modo molto amatoriale, un qualcosa di urbano, senza roba accademica o corsi a pagamento, tipo i teatri sociali o quelle iniziative che si fanno nei centri sociali\nChi piú aiutarmi?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pdyzi5/teatro_torino/"
    },
    {
        "id": "1pd8o8s",
        "author": "Infinite_Sale2042",
        "title": "Miglior sushi di Torino che non è \"all you can eat\"?",
        "content": "Mi riferisco a quelli dove paghi alla carta che di solito hanno una qualità migliore, vorrei una volta andare in uno di questi. Ovviamente si pagherà di più però è giusto per provare se non hai tanta fame magari.\n\nUna volta sono andato in uno pensando fosse un \"all you can eat\" ma ci siamo ritrovati a mangiare 3 cose a testa perché si doveva pagare tutto a parte.",
        "upvotes": 43,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1pd8o8s/miglior_sushi_di_torino_che_non_è_all_you_can_eat/"
    },
    {
        "id": "1pdym6m",
        "author": "Few-Cheetah8476",
        "title": "Miglior toeletta cagnolini ridicoli",
        "content": "Ho una cagnolina piuttosto ridicola (shitzu) e piuttosto anziana (quasi 15 anni). Da circa un anno la toeletto in modo amatoriale a casa, perché il suo parrucchiere di fiducia non vuole più prenderla: ha un soffietto al cuore e ha paura che ci resti stecchita. Sono d'accordo con lui, perciò finora ho evitato, ma al momento, con la pioggia e le foglie, le zampe sono diventate dei grovigli, e io sento di non avere le competenze né gli strumenti per gestire la situazione. Dunque cerco, a costo di spendere, un toelettatore bravissimo e delicatissimo per il mio tesoro pulcioso e odoroso. Vi ringrazio in anticipo per i consigli!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pdym6m/miglior_toeletta_cagnolini_ridicoli/"
    },
    {
        "id": "1pdgjdm",
        "author": "Daelien14",
        "title": "Auto vandalizzata in Corso Unione Sovietica",
        "content": "Buonasera, scrivo questo post alla disperata ricerca di una soluzione.\n\n**Storia breve:** due settimane fa qualcuno ha rotto il vetro della mia auto, una Citroen C3), entrandovi senza rubare nulla, oggi, è successo di nuovo. Cosa fare? come posso evitarlo?\n\n**Qualche dettaglio:** lavoro nelle palazzine in fondo a corso unione sovietica (612), vicino la tangenziale. Dato che il parcheggio interno è sempre pieno (circa 40 posti auto, per diverse palazzine piene di uffici), io, come molti altri, lascio quasi sempre la macchina su corso unione sovietica, dove ci sono due benziani.  \nDue settimane fa ho subito un primo furto, qualcuno è entrato in auto e ha divelto il borsone sportivo al suo interno, ha ignorato catene, palloni e cibo che erano presenti in auto (quindi il soggetto non era un bisognoso/affamato) e se n'è andato senza portare via nulla.  \nOggi, dopo aver fatto sistemare il vetro giovedì scorso, qualcuno ha nuovamente rotto lo stesso vetro, entrando in auto e rubando il borsone che vi tenevo dentro.  \nSono stati nuovamente ignorati palloni, catene e dei coprisedili ancora incelofanati, il borsone era vecchio e rotto, contenete abiti da rugby, consumati e strappati.\n\nIn nessuno dei due casi era visibile nell'auto qualcosa se non il sacchetto di plastica (trasparente) che fa da spazzatura e un quantitativo non indifferente di fazzoletti usati. L'auto non è nuova, anzi, è anche relativamente sporca e con qualche graffio.\n\nSo che la zona di mirafiori non è la più tranquilla e sicura al mondo, ma mi sembra assurdo che la mia sia l'unica auto ad essere vandalizzata tra le centinaia parcheggiate lì (tra controviale lato benzinai e parcheggio centrale), in più in pieno giorno (tra le 9 e le 18), in una zona non così disabitata, auto che passano di continuo, capolinea del tram e due benzinai aperti.\n\nCome posso evitare che arrivi la terza effrazione? 400 E in riparazioni in un mese, sono una batosta colossale per un 25enne che vive da solo.\n\nUna dashcam potrebbe scoraggiare reati, ma, immaginando che qualcuno lo faccia più che altro per gioco, potrebbe anche incoraggiarli, oltre ad avere un'efficacia marginale.\n\nTorinesi esperti, che fare?",
        "upvotes": 16,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1pdgjdm/auto_vandalizzata_in_corso_unione_sovietica/"
    },
    {
        "id": "1pdwbyk",
        "author": "Grand_Satisfaction21",
        "title": "Capodanno a Torino — consigli per 4 amici trentenni?",
        "content": "Ciao a tutti!  \nSaremo in quattro amici, tutti sulla trentina, a Torino per la notte di Capodanno (31 dicembre) e vorremmo qualche consiglio da chi conosce bene la città.\n\nCerchiamo un modo carino per festeggiare: una buona cena, un posto piacevole per bere qualcosa, ci saranno i fuochi d’artificio a mezzanotte?Oppure una festa/club con un’atmosfera simpatica dove ballare un po’ dopo mezzanotte. Niente di troppo folle, ma qualcosa di divertente e sociale.\n\nAvete suggerimenti per:  \n• ristoranti o “cenoni” di Capodanno  \n• bar o cocktail bar in zone come San Salvario / Quadrilatero  \n• locali o feste interessanti (Centralino, The Beach, Murazzi…?)  \n• eventuali eventi pubblici in città per il countdown  \n• consigli su prenotazioni o zone da evitare quella sera\n\nGrazie mille per qualsiasi dritta — buone feste e buona serata! 🥂",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pdwbyk/capodanno_a_torino_consigli_per_4_amici_trentenni/"
    },
    {
        "id": "1pdve9w",
        "author": "Coccorocco1",
        "title": "Padrone di casa aggiornamento acconto oneri accessori",
        "content": "Salve a tutti, sono in affitto e qualche giorno fa ho ricevuto qualche giorno fa una mail dalla commercialista della padrona di casa dove mi dice che c'è stato un'aggiornamento acconto oneri accessori, aumentando l'affitto di 10 euro. Ma io mi chiedo, visto che già in passato hanno fatto casini su aumenti, possono aumentare a piacere l'affitto quando vogliono? \n\n  \nEcco il corpo della comunicazione:\n\n  \n**Oggetto: Contratto di locazione unità immobiliare di via \\*\\*\\*\\*\\* in Torino. Aggiornamento acconto oneri accessori. La presente per comunicare che, in riferimento a quanto in oggetto, il continuo aumento del costo della vita obbliga ad aggiornare l'acconto per gli oneri accessori ad €.50,00 mensili, salvo conguaglio a fine anno, dal 1° gennaio 2026. L'importo mensile complessivo (canone ed oneri accessori) da versare sarà pertanto di euro 582,55 come da riepilogo in calce. Si ricorda inoltre di saldare il conguaglio anno 2024 entro il 31 dicembre p.v. Distinti saluti.**\n\n  \nGrazie a tutti per l'aiuto!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pdve9w/padrone_di_casa_aggiornamento_acconto_oneri/"
    },
    {
        "id": "1pd3qez",
        "author": "Ok-Occasion-1280",
        "title": "Amicizie",
        "content": "cerco nuove amicizie, ho 16 anni, sono un ragazzo nerd a cui piace sia stare in casa che uscire, usciamo magari per un caffè o ci incontriamo da qualche parte? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pd3qez/amicizie/"
    },
    {
        "id": "1pc4jy2",
        "author": "DistributinOfWealth",
        "title": "Appena trasferito in un palazzo “signorile” e già drama con i vicini",
        "content": "scrivo per condividere una situazione surreale che sto vivendo da quando mi sono appena trasferito in un nuovo palazzo a Torino.\n\nIo sono inglese (UK) e mi sono trasferito qui con mia moglie, che è italiana. Il problema è che il mio italiano è ancora molto… rotto. Capisco abbastanza, ma quando devo parlare mi incarto spesso.\n\nCi siamo appena spostati in un palazzo definito “signorile”, pieno di persone anziane abbastanza “posh” e molto attente all’immagine del condominio. E già dai primissimi giorni ho avuto la sensazione che non mi vedano benissimo, probabilmente perché non parlo bene italiano e magari sembro “fuori posto”.\n\nLa scena assurda è questa: il giorno del trasloco ho lasciato il furgone parcheggiato fuori un attimo per scaricare. Niente di strano, il classico van del trasloco.\n\nE invece alcuni condomini si sono arrabbiati parecchio perché, a detta loro, “fa sembrare brutto” il palazzo e rovina lo stile del posto. Ok, già qui ero un po’ basito, ma vabbè.\n\nPoi il bello: più tardi bussano alla porta per lamentarsi e “chiedere spiegazioni”. Io provo a rispondere educatamente ma, nel caos e con l’italiano spezzato, mi è scappato di dare del **“tu”** invece del **“lei”**.\n\nApriti cielo. Si sono offesi ancora di più come se avessi insultato la famiglia per tre generazioni. Io giuro che non volevo mancare di rispetto, semplicemente non ci penso ancora in automatico, e nella mia testa esce il “tu”.\n\nOra pare che alcuni abbiano pure chiamato il mio proprietario per raccontargli sta storia…cioè, siamo a questi livelli. Sinceramente non ci credo ancora.\n\nNon so bene cosa fare: **da un lato mi viene da ridere per quanto è assurdo, dall’altro vorrei iniziare bene e non vivere in guerra fredda con tutto il palazzo.**\n\nQualcuno ha avuto esperienze simili con condomini “di un certo tipo” qui a Torino?   \n  \nConsigli su come gestire la cosa senza diventare il nemico pubblico n.1? 😅",
        "upvotes": 318,
        "comments": 190,
        "media": null,
        "permalink": "/r/torino/comments/1pc4jy2/appena_trasferito_in_un_palazzo_signorile_e_già/"
    },
    {
        "id": "1pd995z",
        "author": "yeco407",
        "title": "scelta universitaria",
        "content": "salve a tutti, com'è il corso di psicologia dell'università di Torino? sto valutando la città ma ho poche informazioni sull'ateneo. il corso è strutturato come nelle altre città o possiede qualche peculiarità? eventuali specialistiche che spiccano rispetto ad altri corsi dello stesso tipo? \nringrazio già eventuali risposte",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pd995z/scelta_universitaria/"
    },
    {
        "id": "1pd4tw0",
        "author": "_crisz",
        "title": "Siete riusciti a prendere i biglietti per capodanno?",
        "content": "Se sì, come avete fatto? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pd4tw0/siete_riusciti_a_prendere_i_biglietti_per/"
    },
    {
        "id": "1pd44wo",
        "author": "Knifehead27",
        "title": "Midnight transportation from airport",
        "content": "Ciao. \n\nI'll be arriving at the Torino airport at 23:20, in late January, and I'm wondering what my options are. \n\nLast Arriva bus leaves at midnight 0:00. Is there a chance I will be able to catch that bus if my plane arrives in time (I'll have a check in bag)? If not, are taxis my only other option?\n\nAlso, if anyone has had experience with Arriva: it says that luggage over 10kg will be put into external baggage boxes. Does that mean that the bus has a separate box/cart attached to the back for luggage or does it mean the storage space that's accessed on the side of those large buses and it's just an awkward translation/explanation?\n\nThanks for any info.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pd44wo/midnight_transportation_from_airport/"
    },
    {
        "id": "1pczbha",
        "author": "maborg",
        "title": "Surfskate al Parco?",
        "content": "Ci sono appassionati di surfskate interessati a organizzare un appuntamento settimanale?   \nSi potrebbe fare ad esempio una sera in settimana al Parco Valentino ? Magari mercoledì?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pczbha/surfskate_al_parco/"
    },
    {
        "id": "1pd1p4s",
        "author": "lolwadufakDANK",
        "title": "Where to get laundry rack near porta nuova?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pd1p4s/where_to_get_laundry_rack_near_porta_nuova/"
    },
    {
        "id": "1pcobvj",
        "author": "Jancar890",
        "title": "È davvero così difficile fare amicizia a Torino?",
        "content": "Vivo saltuariamente a Torino da ormai più di due anni. La presenza ad intermittenza ha sicuramente influenzato i risultati, ma nonostante ciò, me la sono sbrogliata a livello sociale.\nNon ho fatto grandi e profonde amicizie, né trovato persone compatibili al 100% (tranne due amici che, però, si son trasferiti all'estero), ma diciamo che qualche conoscenza, anche solo per un uscita o una passeggiata, sono riuscito a trovarla.\nPer chi si è trasferito da poco, come ve la state vivendo?\n\nComunque sono sempre aperto a nuove amicizie! Ho 23 anni e non sono sempre in cittá, ma in ogni caso non disto tanto",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1pcobvj/è_davvero_così_difficile_fare_amicizia_a_torino/"
    },
    {
        "id": "1pd0lbg",
        "author": "FreeAd8663",
        "title": "Venerdì 5 concerto Prog Metal della Only One Black band presso birrificio Curtis Canava di Bairo (TO)",
        "content": "Venerdì 5 dicembre concerto della Only One Black band presso il birrificio Curtis Canava di Bairo (TO). \nLa band presenterà brani Prog Metal estratti dall' album \"Set Me Free\" da poco pubblicato, nonché storici pezzi dei grandissimi dell' Hard Rock &amp; Heavy Metal, e se non li avete mai visti suonare dal vivo...beh...non sapete cosa vi siete persi!\nVenerdì non prendete impegni, c'è una serata a base di  musica rigorosamente live che vi aspetta! (senza dimenticare che troverete ottime birre e  gustosissimi panini)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d3bx6tcgty4g1.jpeg?auto=webp&amp;s=d52a05f64ba2164a6498b9d3bf982526ac1251d5"
        },
        "permalink": "/r/torino/comments/1pd0lbg/venerdì_5_concerto_prog_metal_della_only_one/"
    },
    {
        "id": "1pczsl2",
        "author": "davivesp",
        "title": "Associazione/sindacato per aiuto contratto di affitto?",
        "content": "Ciao, avrei intenzione di mettere in affitto il mio appartamente per un un determinato periodo, qualcuno conosce associazioni/sindacati/commercialisti a cui potrei rivolgermi per delucidazioni fiscali?\n\nGrazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pczsl2/associazionesindacato_per_aiuto_contratto_di/"
    },
    {
        "id": "1pchdin",
        "author": "fsuran",
        "title": "Consigli libri su Torino magica",
        "content": "Ciao a tutti! Sono uno studente che da poco abita a Torino. Il compleanno di mio papà e tra qualche settimana e siccome lui è un gran lettore e appassionato sfegatato della magia, storia e chi più ne ha più ne metta, ho pensato che sarebbe una bella idea regalargli un libro che parli della storia che collega Torino alla magia. \nSo che Torino è molto particolare in questo senso e sono sicuro che in questo sub ci sia qualcuno esperto che saprà consigliarmi il libro ideale.\n\nIo purtroppo non ne so niente e non sono un grande appassionato del tema. Spero che qualcuno qui mi possa aiutare per fare un bel regalo originale.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pchdin/consigli_libri_su_torino_magica/"
    },
    {
        "id": "1pciaqw",
        "author": "Intelligent-Deal-759",
        "title": "GITA DOMENICALE, CONSIGLI?",
        "content": "Ciao a tutti! Vivo a Torino da un anno e mi piacerebbe iniziare a esplorare meglio i dintorni.\n\nAvete consigli per una gita domenicale? Nello specifico cerco posti carini con mercatini di Natale o dell'usato/antiquariato. Avevo pensato a Ivrea o Susa, ma accetto volentieri suggerimenti, tenendo conto però che preferirei spostarmi con treno o pullman.\n\nGrazie mille a chi risponderà!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pciaqw/gita_domenicale_consigli/"
    },
    {
        "id": "1pcby2d",
        "author": "GhostGirl_34",
        "title": "Posto in cui fare i piercing al lobo",
        "content": "Heyyy\n\nSto cercando un posto in cui fare 3 piercing al lobo che abbia dei prezzi non troppo esagerati \n\nSe volete potete anche raccontarmi la vostra esperienza :)",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pcby2d/posto_in_cui_fare_i_piercing_al_lobo/"
    },
    {
        "id": "1pc4j2v",
        "author": "SafeZookeepergame573",
        "title": "Macchine fotografiche analogiche",
        "content": "Ciao a tutti , secondo voi posso ( e nel caso dove?) trovare delle macchine fotografiche analogiche usa e getta ( anche non usa e getta) in giro per Torino? \nBudget massimo 10-15€ - è per un regalo\nGrazie",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pc4j2v/macchine_fotografiche_analogiche/"
    },
    {
        "id": "1pc3s4k",
        "author": "AliceOnDrugs",
        "title": "oculista a Torino (cerco consigli)",
        "content": "Ciao a tutti, mi sono stato trasferito a Torino e ci sono un paio di giorni che ho una malattia nell’ occhio sinistro.\n\nLa mia prima lingua è lo spagnolo, e sono vicino a porta Susa, ma questa sarà la prima volta che devo andare a un oculista in Italia e cerco consigli da dove andare, e più o meno quanto costa.\n\nGrazie mille",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pc3s4k/oculista_a_torino_cerco_consigli/"
    },
    {
        "id": "1pbrfm0",
        "author": "Miaomiciomiao",
        "title": "Macellerie con bovini allevati al pascolo nel benessere dell’animale",
        "content": "Buonasera, sto cercando delle macellerie o posti dove vendono carne di bovini allevati al pascolo, il grass fed non mi fido troppo perché potrebbe essere che semplicemente tengono le mucche chiuse in stalla e le danno l’erba. Vedo che è molto importante la macelleria di Marco e Elisa, ma non dicono molto sulla provenienza sul sito. Io preferirei andare sul posto perché ora con le spedizioni non mi trovo, se sapete dirmi qualcosa, grazie mille. Magari a porta palazzo c’è qualche stand che mi sono persa",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pbrfm0/macellerie_con_bovini_allevati_al_pascolo_nel/"
    },
    {
        "id": "1pbs1sf",
        "author": "_-Rick-Sanchez-_",
        "title": "Spot per fumare?",
        "content": "Ciao a tutti, chiedevo se ci fosse qua a Torino qualche posto chill per fumare lontano da occhi indiscreti... Una volta sono andato al monte dei cappuccini (sotto consiglio di amici) e mi sono ritrovato la polizia di stato lì davanti... Qualcuno ha qualche posto un po' più tranquillo e magari con una bella vista / nella natura, insomma qualcosa di easy? Sinceramente mi sono rotto il cazzo di fumarmele sul balcone",
        "upvotes": 2,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1pbs1sf/spot_per_fumare/"
    },
    {
        "id": "1pbc9vm",
        "author": "alexsimi",
        "title": "Satsumaimo o patata dolce giapponese: dove trovarla?",
        "content": "Sto cercando la patata dolce giapponese o “satsumaimo”, l’ho mangiata solo una volta e me la sto ancora sognando. Cercando nei supermercati, anche quelli “di nicchia” come il Banco Fresco, si trova solo quella americana arancione. Quella giapponese è viola dentro e bianca fuori, qualcuno la compra o l’ha vista in giro e saprebbe indicarmi dove trovarla? Anche mercati va bene. ",
        "upvotes": 15,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/am33npmycl4g1.jpeg?auto=webp&amp;s=0c795546772737e069ebea3b290cc09b9a6038f7"
        },
        "permalink": "/r/torino/comments/1pbc9vm/satsumaimo_o_patata_dolce_giapponese_dove_trovarla/"
    },
    {
        "id": "1pbh03p",
        "author": "Dangerous_Bite_7601",
        "title": "Pareri Lingotto",
        "content": "Buongiorno, lavoro nella provincia sud di torino ed attualmente ci vivo ma per questioni di vita sociale ecc sto valutando trasferimento zona lingotto (via nizza fermata Spezia circa). Parei sulla zona? Malfamato? Alto rischio furti in casa? Rischio smembramento dopo il tramonto? Aggiungo che so essere una zona abbastanza periferica però mi è comodo per il tragitto poi verso il lavoro.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pbh03p/pareri_lingotto/"
    }
]