[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1joqfkr",
        "author": "Salt-Lake5807",
        "title": "I just finished the Adolescence",
        "content": "As a father of a boy and a daughter (both under 12yr) this serie really hit me hard. Especially third third and the fourth episode. Jamie being interviewed by the therapist was something I've never seen before. You can feel the rage and anger the boy is holding inside of himself. The acting was just perfect.\n\nThe final episode blew me away. When Jamie called and said that he's gonna plea guilty I just stopped breathing. The reactions of the parents and the sister were so real and heartfelt. \n\nI started to cry at the end of the final episode when Lisa (sister) came and said \"Jamie is ours\".  As the dad went to Jamie's room I was blubbering. I'm still weeping as I'm writing this.\n\nNever ever has a movie or a serie made me feel so much. Made me think about my own kids and the world they're living. ",
        "upvotes": 120,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1joqfkr/i_just_finished_the_adolescence/"
    },
    {
        "id": "1joqis7",
        "author": "Loose_Clock609",
        "title": "Gone Girls: The Long Island Serial Killer' - Are the cops morons or just in on it?",
        "content": "Why was the docuseries made? We literally learned nothing new about the case or the victims. \n\nI don't believe the cops are this incompetent. It's impossible for any police department this large to be so stupid. With all the technology we have available, how are these cases still so unsolved or at least identify the victims. Either a cop did it or some rich guys with kinks pay them to look the other way\n \nIt's definitely more than one killer in the area. I wouldn't go from burlap sacks to dismemberment to just random dumpings... Rex isn't the only killer. \n\nI thought the documentary would answer big questions like, who are the other victims? Who is the baby? Who was the male? Nope...\n\nAnd if I hear the journalist says she's shocked again... \n\n ",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1joqis7/gone_girls_the_long_island_serial_killer_are_the/"
    },
    {
        "id": "1jonklp",
        "author": "Cena_Beana",
        "title": "can someone recommend me a show that hasn’t been canceled/is finished",
        "content": "I just finished Good Girls to find out that it left on a really interesting cliffhanger and it was canceled 💔\nI am so disappointed every time I watch a show and I look up if there’s gonna be a next season and news flash ITS ALWAYS CANCELLED, im open to any recommendations please helpppp ",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jonklp/can_someone_recommend_me_a_show_that_hasnt_been/"
    },
    {
        "id": "1jp0gcg",
        "author": "Available_Can7525",
        "title": "Just six weeks before their split, Love Is Blind's Mark wrote this sweet message to his wife Aubrey",
        "content": "[https://realitytvshrine.com/2025/04/01/just-six-weeks-before-their-split-love-is-blinds-mark-wrote-this-sweet-message-to-aubrey/](https://realitytvshrine.com/2025/04/01/just-six-weeks-before-their-split-love-is-blinds-mark-wrote-this-sweet-message-to-aubrey/)\n\nI don't get how he went from praising her to then them revealing they've split weeks later! Social media really isn't everything guys...\n\nDo you guys remember Mark when Jessica said no to him at the altar??\n\n[Credit: Netflix](https://preview.redd.it/0ixsnl3l69se1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=3f21e725d2ee1fd9d68ba7618aaf9db21f86a7e9)\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp0gcg/just_six_weeks_before_their_split_love_is_blinds/"
    },
    {
        "id": "1joq985",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1joq985/cancelled_shows/"
    },
    {
        "id": "1jozl4t",
        "author": "McNasty420",
        "title": "This day in history- Will Arnett narrates Netflix Live",
        "content": "This was from April Fools many years ago, I can't remember when exactly.  It is Will Arnett narrating video of an office.  The funniest thing ever. \n\n[https://www.youtube.com/watch?v=ZbsRwH2jbac](https://www.youtube.com/watch?v=ZbsRwH2jbac)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jozl4t/this_day_in_history_will_arnett_narrates_netflix/"
    },
    {
        "id": "1jozk5d",
        "author": "abhilash512",
        "title": "Confirmed WWE WrestleMania 41 Match Card in Ghibli Style",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jozk5d/confirmed_wwe_wrestlemania_41_match_card_in/"
    },
    {
        "id": "1joz0iv",
        "author": "-Xoz-",
        "title": "Adolescence to be shown in UK schools for free as British PM Keir Starmer meets creators",
        "content": "",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1joz0iv/adolescence_to_be_shown_in_uk_schools_for_free_as/"
    },
    {
        "id": "1joyjuv",
        "author": "Available_Can7525",
        "title": "As Mark's relationship crumbles, what's Jessica from Love Is Blind season one up to now?!",
        "content": "[https://realitytvshrine.com/2025/04/01/as-marks-relationship-crumbles-whats-jessica-from-love-is-blind-season-one-up-to-now/](https://realitytvshrine.com/2025/04/01/as-marks-relationship-crumbles-whats-jessica-from-love-is-blind-season-one-up-to-now/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joyjuv/as_marks_relationship_crumbles_whats_jessica_from/"
    },
    {
        "id": "1jo7gh8",
        "author": "Pogrebnik",
        "title": "Meryl Streep Is in Talks to Join Greta Gerwig's 'Narnia' Series in Central Role",
        "content": "",
        "upvotes": 46,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jo7gh8/meryl_streep_is_in_talks_to_join_greta_gerwigs/"
    },
    {
        "id": "1jo5pen",
        "author": "womanmuchmissed",
        "title": "Survival of the thickest",
        "content": "Older millennial stylist trying to live her fashion dreams in New York. She and her two best friends are in periods of growth in their personal and professional lives. This is a coming of age story but for seasoned adults. The characters are in their 30s, mature and talented but still trying to find their footing. \n\nIf you liked Sex in the City, Girlfriends, Gossip Girl, Entourage, The Game, RHONY, RHOBH, Friends, How I Met Your Mother or any other show about adult friends in the big city, then this show is for you!!!",
        "upvotes": 55,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5pen/survival_of_the_thickest/"
    },
    {
        "id": "1jozo54",
        "author": "Internal-Bed-3150",
        "title": "Meryl Streep is reportedly in talks to play a gender-swapped Aslan in Netflix's Chronicles of Narnia movies",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jozo54/meryl_streep_is_reportedly_in_talks_to_play_a/"
    },
    {
        "id": "1joti5c",
        "author": "Inspired_Owl",
        "title": "I have been charged twice  a month for a year",
        "content": "I was looking at my bank statements and noticed that I’ve been charged £4.99 twice every month for a year. I shutdown and deleted my last account before starting this one. How do I go about sorting this out? I’m not expecting £60 back but I need this to stop. I pay for the cheapest plan for a reason ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1joti5c/i_have_been_charged_twice_a_month_for_a_year/"
    },
    {
        "id": "1jot91k",
        "author": "Unlikely_Fan65",
        "title": "Whitney Houston - I wanna Dance with Somebody",
        "content": "I LOOOVE WHITNEY. Were my expectations too high? Am I way off the mark...or was this absolutely shit house!?!?!  I don't want to blame the actress - no one else can be Whitney. It was just lacking though. Severely ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jot91k/whitney_houston_i_wanna_dance_with_somebody/"
    },
    {
        "id": "1joxkay",
        "author": "Available_Can7525",
        "title": "The tragic way Million Dollar Secret's Cara lost her brother",
        "content": "[https://realitytvshrine.com/2025/04/01/everything-we-know-about-the-tragic-way-million-dollar-secrets-cara-lost-her-brother/](https://realitytvshrine.com/2025/04/01/everything-we-know-about-the-tragic-way-million-dollar-secrets-cara-lost-her-brother/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joxkay/the_tragic_way_million_dollar_secrets_cara_lost/"
    },
    {
        "id": "1josnsn",
        "author": "alicemerowypt24",
        "title": "ok so this is strange. uk netflix.",
        "content": "I recently watched the live action  monster high 2 film on my tablet and I want to watch monster high live action the first film on my tablet but I can't find it on my tablet and I can find it on my phone , both of them.\n\nI am in the uk.\n\nI have updated both apps on my phone and tablet.\n\nmy tablet is a amazon kindle thats  really old , 2017. so yeah.\n\nhelp anyone and comment.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1josnsn/ok_so_this_is_strange_uk_netflix/"
    },
    {
        "id": "1jo5dnk",
        "author": "LushCharm91",
        "title": "'Black Mirror' Season 7 Trailer: Six New Episode Titles Revealed",
        "content": "",
        "upvotes": 31,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5dnk/black_mirror_season_7_trailer_six_new_episode/"
    },
    {
        "id": "1jp020r",
        "author": "Longjumping_Land_977",
        "title": "On its 8th anniversary, a reminder of the controversy of the 13 Reasons Why ‘bathtub scene’ and why Netflix axed it",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jp020r/on_its_8th_anniversary_a_reminder_of_the/"
    },
    {
        "id": "1joquq0",
        "author": "ctrolaltdelete",
        "title": "On Payment Plans",
        "content": "Does anyone on here know what happens if you upgrade to a higher payment plan when your previous plan ha already been paid for? Like do you add the difference or do they make you pay it in full? (I hope this makes sense I don't know how to phrase this better😭)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joquq0/on_payment_plans/"
    },
    {
        "id": "1jonn0x",
        "author": "Certain_Passion1630",
        "title": "Just finished White Collar and I highly recommend",
        "content": "One of the best shows I’ve seen in a while. If you didn’t see my other post, it is very similar to Suits…but better (imo). The closest thing I can think of to compare them is Law and Order vs SVU. \n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jonn0x/just_finished_white_collar_and_i_highly_recommend/"
    },
    {
        "id": "1joe47u",
        "author": "MythicMythness",
        "title": "Million Dollar Secret: hot takes only",
        "content": "Is it the casting? The editing? Or is it just the nature of the game itself? Not sure, but these folks just don’t come across as very likable. \n\nAnyone else have any hot takes on this newest Netflix game show? \n\n**I’m not trying to soapbox here. I’m not saying they are or aren’t actually likable — they just don’t come across as likable. They’d probably be lovely to stand next to in a line and gab about whatever with. Lol",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1joe47u/million_dollar_secret_hot_takes_only/"
    },
    {
        "id": "1jopubo",
        "author": "SelfAmbitious",
        "title": "EGO,JEALOUSY AND HATE Wwe Raw Review (1/4/25)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jopubo/egojealousy_and_hate_wwe_raw_review_1425/"
    },
    {
        "id": "1joyfx3",
        "author": "thepunkrockprincess",
        "title": "The deeper meaning behind Netflix’s Adolescence",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joyfx3/the_deeper_meaning_behind_netflixs_adolescence/"
    },
    {
        "id": "1jogcqn",
        "author": "Damienisok",
        "title": "Show or movies that are a similar vibe to Locke and key?",
        "content": "Locke and key is one of those shows I thought I wouldn't like but actually turned out good, I really liked the element of the people not having magical powers themselves but their powers instead being a certain object, that was a really big part of what I liked about Locke and key.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jogcqn/show_or_movies_that_are_a_similar_vibe_to_locke/"
    },
    {
        "id": "1joorus",
        "author": "Wolffe359",
        "title": "I keep randomly losing most of my shows",
        "content": "Ok so I'm in Australia and have been using netflix since like 2018 at this point and this is the first proper issue I've come across. I like to watch lots of anime and house m.d but lately every now and then I go into netflix and it doesn't have most of the shows in watching but then the next day it does? So when frieren came on to netflix I was crazy happy and I watched the first couple episodes but then it wasn't there the next day but it was there the day after?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joorus/i_keep_randomly_losing_most_of_my_shows/"
    },
    {
        "id": "1jns3i1",
        "author": "lydocia",
        "title": "Any series on Netflix that just leave you feeling really bad?",
        "content": "Looking for recommendations for series that just leave you feeling awful, like truly gut-wrenching, depressing, based-on-true-events kind of shows. The kind that aren’t just sad but actually make you sit in silence for a while after an episode ends, just processing everything.\n\nI’m talking about shows that cover real-world tragedies, injustices, or historical events in a way that really sticks with you. Stories that aren’t just entertainment but actually make you think about how messed up the world can be. I know *Dopesick* and *Apple Cider Vinegar* fall into this category, but I’m sure there are plenty of others out there.\n\nIdeally, I’d like something available on Netflix, but if there’s something really good on another platform, I’d still be interested in hearing about it. I just want something that’s powerful, disturbing, and leaves an impact.\n\nAny recommendations? Would love to hear what shows have left you completely drained after watching.",
        "upvotes": 179,
        "comments": 588,
        "media": null,
        "permalink": "/r/netflix/comments/1jns3i1/any_series_on_netflix_that_just_leave_you_feeling/"
    },
    {
        "id": "1jo3ie2",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Releases New Teaser for ‘The Eternaut’",
        "content": "",
        "upvotes": 17,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jo3ie2/netflix_releases_new_teaser_for_the_eternaut/"
    },
    {
        "id": "1jo23hr",
        "author": "Alan_Stamm",
        "title": "'Gone Girls: The Long Island Serial Killer' [Review]",
        "content": "",
        "upvotes": 19,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1jo23hr/gone_girls_the_long_island_serial_killer_review/"
    },
    {
        "id": "1joa4sb",
        "author": "Connorb08",
        "title": "Best Watch Party Option in 2025?",
        "content": "Looking for Watch Party apps/plugins that actually work.  Everyone I try breaks or wont sync properly.  What are you using these days?\n\nI have tried Teleparty, Watch2gether, Rave and some sketchy ones.  Not looking for discord or zoom.  Its 2025 and I still cant watch with my GF with ease.  Someone get on this!",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joa4sb/best_watch_party_option_in_2025/"
    },
    {
        "id": "1joeuvk",
        "author": "Rbsadie",
        "title": "Don't Come Home",
        "content": "Has anyone else been watching this Thai horror series? I'm really itching to discuss the ending.\n\nSPOILER: \n\nThe time travel aspect left me scratching my head. How on earth did that ending explain the paradox of the mother-daughter switch? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joeuvk/dont_come_home/"
    }
]