[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pclmvl",
        "author": "BurgerNugget12",
        "title": "‘Stranger Things 5’ Opens With 59.6 Million Views, Netflix’s Biggest English-Language TV Debut Ever",
        "content": "",
        "upvotes": 581,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1pclmvl/stranger_things_5_opens_with_596_million_views/"
    },
    {
        "id": "1pctv6n",
        "author": "Glad-Ad-6240",
        "title": "sean combs the reckoning",
        "content": "This doc was put together so well. What really gets me is how he got so huge without much talent, just by attaching himself to other people’s success. Diddy has harmed a lot of people, but the part that blew my mind was the evidence pointing toward his involvement with Pac’s death. I honestly think he had something to do with both Biggie and Pac’s death and was jealous of both him and Biggie, like he created this whole “beef” to get rid of them. A 50-month sentence isn’t long enough.\n",
        "upvotes": 123,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pctv6n/sean_combs_the_reckoning/"
    },
    {
        "id": "1pd6pbo",
        "author": "JelliBabySkyyy",
        "title": "Sean Combs: The Jury",
        "content": "In my country, we don't use the jury system. Watching the interviews with the jury members really shocked me. They seemed so chuffed in their interviews. I was losing my mind!\nIs this normal? For people in jury system countries, are you guys comfortable putting your life in the hands of randos that didn't go to law school and are exposed to uneducated tik tok opinions?",
        "upvotes": 14,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6pbo/sean_combs_the_jury/"
    },
    {
        "id": "1pcw8wa",
        "author": "YaNiBBa",
        "title": "Wolf of Wall Street is censored now?",
        "content": "So Wolf of Wall Street is back on Netflix and I decided to watch it, yet again. But this time for whatever reason, it's censored with blurred out genitals which I've never seen on Netflix, especially when it wasn't censored before.",
        "upvotes": 50,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pcw8wa/wolf_of_wall_street_is_censored_now/"
    },
    {
        "id": "1pczyi7",
        "author": "huffpostuk",
        "title": "Netflix Defends Sean Combs Documentary After Diddy Brands Series 'Shameful'",
        "content": "",
        "upvotes": 24,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pczyi7/netflix_defends_sean_combs_documentary_after/"
    },
    {
        "id": "1pd5cy5",
        "author": "ohsoyouhunnii",
        "title": "The Beast in Me",
        "content": "I'm sitting here watching episode 6 &amp; I have been so annoyed at this show since the beginning &amp; am finally feeling the urge to tell someone. \n\nWhy am I annoyed might you ask? 1. because its such a slow burner &amp; 2. Aggie DOES NOT KNOW HOW TO SAY NO TO NILE. Its annoying as hell. Then the faces she makes, the stuttering every time she speaks to him—I'm aware that its acting but she is so bad &amp; needs to tell his weird ass NO. \n\n😆 I just needed to rant!",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5cy5/the_beast_in_me/"
    },
    {
        "id": "1pcdorr",
        "author": "SaberNoble47",
        "title": "The Matt Rife Xmas auto-play trailer ruins Santa in its immediate first second of dialog (US) upon entering the Netflix menu",
        "content": "Look I get it, there’s custom settings, you can turn off the auto-play trailers, you can mute, you can have kid friendly user accounts that won’t play more mature content but for the most part I don’t give a sh*t about that, my little kids don’t care and aren’t paying attention. Yes this one is ultimately on me, but I feel like  you turn Netflix on and IMMEDIATELY the auto trailer is that comedian sitting in a chair and he blurts out “it was hard when you find out your parents are Santa clause” and it’s loud and crisp and you’re just in the opening menu without navigating anywhere I think it’s a jerkoff move. Also that guy sucks. ",
        "upvotes": 232,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pcdorr/the_matt_rife_xmas_autoplay_trailer_ruins_santa/"
    },
    {
        "id": "1pcu3uc",
        "author": "michelob81",
        "title": "Sean Combs the reckoning",
        "content": "Fantastic watch but surely 4 years in prison can't be the end of the story! The female jury member came across like she'd been on an interview for Pop idol instead of a court case. Puffy appeared to be demonic and should have received at another 2 years for his fixation with baby oil alone.",
        "upvotes": 28,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcu3uc/sean_combs_the_reckoning/"
    },
    {
        "id": "1pd9j83",
        "author": "updatemonger",
        "title": "Why can’t I download the app?(iPhone)",
        "content": "I’d add a screenshot, but I can’t post pictures. Whenever I try to download the app, I keep getting a “Verification Required” message, telling me I need to sign in to view my billing info. When I hit continue, I add my card, and it says my payment method failed. \n\nWhat am I supposed to be paying for here? I already have a Netflix account, I just want to download the app, which should be free, right? Any answers appreciated.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd9j83/why_cant_i_download_the_appiphone/"
    },
    {
        "id": "1pcakae",
        "author": "businessinsider",
        "title": "Netflix show developer to stand trial for $11 million spending spree, including 5 Rolls-Royces, $638,000 in mattresses",
        "content": "",
        "upvotes": 155,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1pcakae/netflix_show_developer_to_stand_trial_for_11/"
    },
    {
        "id": "1pd2n0o",
        "author": "RtimesThree",
        "title": "Ex-Netflix executive details how a 'visionary' project slowly unraveled into an alleged $11 million fraud",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd2n0o/exnetflix_executive_details_how_a_visionary/"
    },
    {
        "id": "1pda5el",
        "author": "Zcrow17",
        "title": "Way more ads?",
        "content": "Im watching the Diddy Documentary, and I swear I’m getting minute ads every 10 minutes. It’s insane, anyone else noticing this? I feel like I’m watching cable tv.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pda5el/way_more_ads/"
    },
    {
        "id": "1pd9rxa",
        "author": "Ill-Requirement-7029",
        "title": "Female serial killers who could be portrayed in ‘Monster’ Season 4? Sarah Paulson rumoured to be playing Aileen Wuornos.",
        "content": "Season 4 will examine the Lizzie Borden story and its rumoured there will feature other stories throughout with Sarah Paulson potentially playing Aileen Wuornos. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd9rxa/female_serial_killers_who_could_be_portrayed_in/"
    },
    {
        "id": "1pd8kfv",
        "author": "Beautiful-Bed-412",
        "title": "Extra member on mobile",
        "content": "Hey yall, so im on my parents neflix account as an added member as I no longer live with them. However this happened AFTER i got their account on my phone. However now I STILL am on their account and dont know how to connect to my \"extra member\" account on mobile.\n\nI dont want to have to use their guest account and guess where im at on my shows does anyone know how to fix this? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd8kfv/extra_member_on_mobile/"
    },
    {
        "id": "1pd82ph",
        "author": "YippyYeti",
        "title": "What does this error code mean?",
        "content": "Can’t log in on my phone at all. When it doesn’t provide this error code, it says network error. \n\nThe code is this: \"The operation couldn’t be completed. (MSL error 5403 - HTTP error: 403 - forbidden)\"\n\nMy network connection is fine though. Anyone else encounter this?\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pd82ph/what_does_this_error_code_mean/"
    },
    {
        "id": "1pd7nf5",
        "author": "mag_man85",
        "title": "Profile Selection Page Content",
        "content": "Is there any way, other than going through each profile on my list, to remove content from the profile selection page?   Support chat was less than helpful.   \n\nBasically, my 4 year old is kinda bothered by the Stranger Things image on the profile selection page on my apple TV app and I\"m trying to figure out a way to hide that.   ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd7nf5/profile_selection_page_content/"
    },
    {
        "id": "1pd6ul7",
        "author": "harpreetthind",
        "title": "Movie or TV show suggestions",
        "content": "Yesterday I got done watching the haunting of Bly Manor. Does anybody know any other shows similar to it? Thanks. Let me know in the comments what you guys would recommend or recommendations are appreciated.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6ul7/movie_or_tv_show_suggestions/"
    },
    {
        "id": "1pd5q17",
        "author": "There_He-Goes",
        "title": "Dearest Reddit boys and girls, give me the most underrated anime on Netflix",
        "content": "Please don't even bother mentioning the famous ones. Some underrated and lowkey ones I liked:-\n\nThe Wrong Way To Use Healing Magic\nThe Unwanted Undead Adventurer\nHell's Paradise\n7th Time Loop: The Villainess Enjoys A Carefree Life Married To Her Worst Enemy!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5q17/dearest_reddit_boys_and_girls_give_me_the_most/"
    },
    {
        "id": "1pd0dhy",
        "author": "Complex_Grass6312",
        "title": "Netflix downloads are incomplete and force me online mid-movie?",
        "content": "This is driving me absolutely insane and I can’t find anyone talking about the exact same thing.\n\nI’m trying to download full movies on the Netflix Windows app (Windows 11, latest version) for a long flight tomorrow. The download finishes, it says 100%, shows the little green checkmark, everything looks normal.\n\nBut when I go completely offline (airplane mode + disabled Wi-Fi) and try to watch the downloaded movie, it plays fine for like 30-60 minutes and then suddenly stops with the message:\n\n“You need an internet connection to continue watching.”\n\nWTF?? It’s downloaded! I’ve quadruple-checked that I’m in the Downloads tab, not streaming. \n\nIs there a hidden setting I’m missing or is the Windows app just completely broken for long movies right now? Really don’t want to be stuck staring at the seat in front of me for 12 hours tomorrow, help plz.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pd0dhy/netflix_downloads_are_incomplete_and_force_me/"
    },
    {
        "id": "1pd4p7q",
        "author": "wait_ididnotcomeyet",
        "title": "Sean Combs: The Reckoning taken down?",
        "content": "I am trying to watch the show and only 10 minutes left on episode 1, and it keeps popping up with error tvq-pb-101.\nAll other shows are working, movies are working. \n\nI know there are things that the lawyers of Diddy are doing to take it down, but I am not sure if that already happened.\nIt’s 9:30 pm, December 3, I’m in Philippines.\n\nEdit: I did the troubleshooting: restart router, restart smart tv, force closed Netflix, deleted and updated Netflix. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pd4p7q/sean_combs_the_reckoning_taken_down/"
    },
    {
        "id": "1pd4k8l",
        "author": "HandsomeGuts",
        "title": "I'm bored, want something that's more like \"mystery box\" then \"murder mystery\" any recommendations? I've seen",
        "content": "lost\nFrom\nThe outsider,\nWayward pines\nThe leftovers \n\nA show something like the movies, identity, hateful eight, The Thing \n\nFew characters (not alot) in one place, and I'm figuring out with them what'll happen \n\nWith atmospheric vibes (intense, snowy or rainy) \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pd4k8l/im_bored_want_something_thats_more_like_mystery/"
    },
    {
        "id": "1pd9rh4",
        "author": "Vegetable_Hearing477",
        "title": "What do you think Katie and Jamie said to each other on the CCTV before the murder?",
        "content": "From Adolescence on Netflix. \n\nI imagine Jamie (who was intent on the murder from the very beginning - why else would he bring the knife with him) demanding her to apologise or something to that effect , and Katie calling him creep and pushing him off. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pd9rh4/what_do_you_think_katie_and_jamie_said_to_each/"
    },
    {
        "id": "1pcv2pd",
        "author": "Southern-Brother5693",
        "title": "Troll 2 (2025) - A perfectly decent sequel",
        "content": "A worthy sequel to the first film. The design of the Trolls is extremely well done with great details. On par with the Warner Monsterverse films. The characters are kinda stock but it isn't that big an issue here.\n\nHere's to hoping we got more film with Norse mythology creatures.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcv2pd/troll_2_2025_a_perfectly_decent_sequel/"
    },
    {
        "id": "1pcfjd3",
        "author": "DizzyBeyBlade",
        "title": "Ozarks is top 10",
        "content": "I'm on my 4th rewatch of this show and I'm willing to argue that it is an absolute masterpiece. I take into account everyone has their own taste in media and the fact that what resonates with me might not work for others, but the storytelling, character development, and emotional depth here are unmatched in my eyes. The only contenders I have to this show are THE BODYGUARD &amp; HOUSE OF CARDS (prior to the bullshxt)",
        "upvotes": 21,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfjd3/ozarks_is_top_10/"
    },
    {
        "id": "1pczs9t",
        "author": "vishesh_07_028",
        "title": "When All of us are dead season 2 is coming?",
        "content": "When I first saw the season 1 of All of us are dead in midnight, I had pure goosebumps.\n\nI have watched zombie based series for the first time ever in my whole life.\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pczs9t/when_all_of_us_are_dead_season_2_is_coming/"
    },
    {
        "id": "1pct4zy",
        "author": "Spudnic16",
        "title": "Season 2 of Squid Game reality show seems kinda fishy (plants/paid actors)?",
        "content": "I’m about half way through the second season of Squid Game reality show and the whole thing seems kinda fishy imo. When my family was watching it, my brother theorized that certain players were actually paid actors that sabotage the game to make it more interesting. He said this during the six legged pentathlon game when the player who was portrayed a spoiler brat did horrendously at it when faces against the twins. \n\nMy brother then theorized that she was an actress planted into the game to be unlikable and get the pre-established “main” characters through the first game. I felt his claim had some merit due to how badly she in particular did in the game, but I wrote this off as her just genuinely doing terribly and the producers simply playing up her “spoiler brat” past in post-production. Still, I kept the thought in the bad of my mind.\n\nCut to the end of episode 4. Everybody simultaneously agrees to just refuse to play the game. That on its own it very strange. Players had every reason to betray that agreement, and all it would have taken was one team to do so for the whole thing to fall apart. Then they get in teams of 2 anyway, and that’s how the producers decide marbles opponents.\n\nIt seems extraordinary unlikely that ALL players would simply refuse to keep playing, and that the producers either a. had planned on that happening or b. had all the marbles ready to go within minutes of that happening. \n\nHow could the producers have planned on that happening, if all players were genuinely just playing the game?\n\nIt all seemed to line up a bit too well.\n\nMakes me think that the show either has plants disguised as players to influence the outcome or is just outright scripted.\n\nWhat do you think?\n\nTL;DR: it seems highly unlikely that the producers of Squid Game reality show could have anticipated everyone refusing to play at the end of game 3. Makes me suspect the show has paid actors or is just outright scripted. What do you think?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pct4zy/season_2_of_squid_game_reality_show_seems_kinda/"
    },
    {
        "id": "1pcwscq",
        "author": "MrProobYT",
        "title": "RDR Netflix Bug",
        "content": "# RDR netflix got released today and i am not able to play because of all this bug wher the screen becomes glitchy green does anyone have the same problem and how to solve it (I use iphon e 10 XS Max)",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pcwscq/rdr_netflix_bug/"
    },
    {
        "id": "1pcvev6",
        "author": "y2corbin",
        "title": "Episode choosing feature",
        "content": "Is anyone else having the issue where you can’t see the episode list anymore? I clicked on Stranger Things after I watched Season 5 to look at the extras and it started playing Season 1 Episode 1 and the episode list is now blank. I restarted my TV and it still had the same behavior. I really don’t like the new feature where it starts a show automatically without letting us choose the episode first. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcvev6/episode_choosing_feature/"
    }
]