[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 68,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lkabs8",
        "author": "Longjumping_Land_977",
        "title": "Carnival Cruises has issued a new statement about the Trainwreck: Poop Cruise documentary",
        "content": "",
        "upvotes": 291,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1lkabs8/carnival_cruises_has_issued_a_new_statement_about/"
    },
    {
        "id": "1lkp6rl",
        "author": "FukudaSan007",
        "title": "'Bet' Renewed For Second Season By Netflix",
        "content": "I really like this show and I thought for sure it wouldn't be renewed. Very happy to be wrong. I have seen the anime it's based on, of which I was also a fan, and Bet is quite a departure. However, it doesn't bother me and can stand apart from the source material. Hopefully, the second season will be as good as the first. \n",
        "upvotes": 34,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lkp6rl/bet_renewed_for_second_season_by_netflix/"
    },
    {
        "id": "1lkrm3k",
        "author": "gubigal",
        "title": "Dept. Q - Has it been renewed for another Season?",
        "content": "It needs to be.  Best show I’ve seen on Netflix in a long time.  Not what I was expecting and there are so many things I just love about the show.  The casting is phenomenal, the subplots and stories associated with each character aren’t over done or exploited.  It’s a proper amount of mysterious but powering through  and are more reflective of real life where everyone has their own struggle.  The main plot was great.  Ending was awesome.\n\nThere needs to be a season 2.  I need more of this.  Netflix - are you listening?  Season 2.",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lkrm3k/dept_q_has_it_been_renewed_for_another_season/"
    },
    {
        "id": "1lk447f",
        "author": "IrishStarUS",
        "title": "Cobra Kai stars seen in furious row after Martin Kove 'bit' Alicia Hannah-Kim",
        "content": "",
        "upvotes": 124,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1lk447f/cobra_kai_stars_seen_in_furious_row_after_martin/"
    },
    {
        "id": "1lklx58",
        "author": "lalauvte",
        "title": "what movie should i watch tonight? no horrors plz",
        "content": "just wondering i really need to watch a movie that will entertain me and enjoyable for my adhd if that makes sense. i like romance, mystery , murder , sci fi  and anime comment below plz (:",
        "upvotes": 9,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1lklx58/what_movie_should_i_watch_tonight_no_horrors_plz/"
    },
    {
        "id": "1lktx2a",
        "author": "Adritenki",
        "title": "Why is Scissor Seven season 5 still not on Netflix, not even any announcement or new?",
        "content": "Scissor Seven is really an amazing show (a donghua, a Chinese animated show, to be specific) which also has an awesome dub.\n\nSeason 5 was released in China in October 2024, which means 8 months ago. I would understand 6 months later, like I think it happened with season 4. But 8 months and any single announcement or something? At least Netflix could say if they really are going to something or it is cancelled or something.\n\nBasically, this all sums up in: Scissor Seven season 5 on Netflix? Yes? No? And, if yes, when?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lktx2a/why_is_scissor_seven_season_5_still_not_on/"
    },
    {
        "id": "1lktrpe",
        "author": "SnapSketchStudios",
        "title": "Hmm",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lktrpe/hmm/"
    },
    {
        "id": "1lktarq",
        "author": "Decent_Patience_4384",
        "title": "The Decameron (2024) - A Netflix Series Review",
        "content": "https://literatureandreview.blogspot.com/2025/06/the-decameron-2024-netflix-series-review.html?m=1 \n   It is more than a comedy mixed with the flavours of emotions. We can relate the plague happenings with Corona happenings",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lktarq/the_decameron_2024_a_netflix_series_review/"
    },
    {
        "id": "1lkjggi",
        "author": "Ok-Display-6604",
        "title": "The rookie",
        "content": "I've tried google'ing it but haven't seen a solid answer to the question, is season 7 of 'The rookie' ever coming to Netflix or not? Thanks in advance! ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lkjggi/the_rookie/"
    },
    {
        "id": "1ljwlqb",
        "author": "CorpseJuiceSlurpee",
        "title": "Thoughts on Trainwreck: Poop Cruise",
        "content": "I just finished the documentary and I was pretty disappointed in the quality of this documentary.\n\nGenerally, it seems like an interesting topic, and something that I remember happening but don't really know the details of; and I feel like the events leading up to and the cause of the outage were covered pretty well. And that's kind of where my compliments on this doc stops.\n\nThe crew they interviewed were somewhat interesting.The lady who was the voice of the ship was had some great detail of the event because she was where the action and decisions were happening. The chef had some funny anecdotes. The Russian lady was solely there to be horny and call Americans stupid.\n\nThey seemingly found the absolute worst passengers to comment on their experiences. There was little more relayed than it was gross and upsetting. The bachelorette party was insufferable and somehow 12 years later hasn't changed a bit. They acted like such stereotypical bachelorette \"woo girls\" that I can't tell if they were putting on an act or if that's genuinely how they are. \n\nThe entirety of the father-daughter footage can be summed up in, \"I was scared and this experience was not what we paid for.\"\n\nI don't know if this was just the interviewees in particular or maybe it's a true cross section of the type of people who go on cruises, but all the passengers acted like pooping in the red biohazard bags was the absolute end of the world. The son in law seemed to care for little else except that. His grand victory was finding a working toilet. That's might have been the highlight of his life. I've shit into wag bags before and carried it out with me. It's not the most pleasant thing but you do what you gotta do. And they didn't even have to pack it out, they could put it in garbage cans around the ship.\n\nAdditionally all the passengers acted like they were alone on a raft weathering the elements, forced to hand deliver their turds into red bags. Let's be real, they say on their asses while the crew did actual work amidst spoiled people on their worst behavior.\n\nI would have loved to hear what the crew was doing to help passengers day to day, and they did a bit here and there, but it was never really covered. And I would have loved to hear what went on interpersonally on the ship between passengers. People were doing shitty things like hoarding and claiming territory, was there bartering? Did people form loose alliances? This could have been an interesting study on human behavior and instead the biggest takeaway was poop lasagna.\n\nAlso, there's a tie for biggest piece of shit between the Carnival Marketing guy and the Cruise Lawyer.  \n\n3/10 - Still not as bad as Untold: The Liver King",
        "upvotes": 105,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwlqb/thoughts_on_trainwreck_poop_cruise/"
    },
    {
        "id": "1lkquxu",
        "author": "FancyKraken",
        "title": "KPop Demon Hunters Merch sizes",
        "content": "I want to purchase some KPop Demon Hunters merch, but there are no size charts for any of the shirts and hoodies. I can't order anything without knowing what the measurements are. Does anyone know if there is one for their products or one for the KPop products specifically? Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkquxu/kpop_demon_hunters_merch_sizes/"
    },
    {
        "id": "1lkqaxe",
        "author": "Thivious",
        "title": "Kpop demon hunter",
        "content": "Hello someone know how to find the full ost of kpop demon hunter in french, i find in VO very easily but for all the other language its very harder, i can only find the scene where the music play. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkqaxe/kpop_demon_hunter/"
    },
    {
        "id": "1lkq32j",
        "author": "Gullible-Ad178",
        "title": "KPop Demon Hunters \"New Honmoon\"?",
        "content": "Hi. Just wanted to hear other people's opinion on this bc I haven't been able to see any discourse about this anywhere else but I finished watching KDH and I felt the ending fell a bit flat for me.\n\nSpoilers ahead, if you haven't seen it.\n\n\nThe entire setup was rooted on how Rumi's double identity potentially changes the perspective of hunters' roles and what demons are. I thought Rumi coming into terms with her identity and who Jinu was, making a new Honmoon meant accepting that demons were just manipulated by Gwi-Ma.\n\nInstead, though, we get Jinu as the only redeemable demon who sacrifices himself, and the rest of the Saja Boys getting killed together with other demons. \n\nSo my question really is, how is the new honmoon any different for the demons ? Is it only different for Rumi?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkq32j/kpop_demon_hunters_new_honmoon/"
    },
    {
        "id": "1lk19la",
        "author": "Complex_Grass6312",
        "title": "Just watched The Twelve — why is no one talking about this??",
        "content": "I randomly clicked on The Twelve last night and ended up bingeing the entire thing. It’s one of the best courtroom dramas I’ve seen. I’ve seen zero promotion for this, and it’s honestly criminal how buried it is.\n\nHas anyone else seen this? Or know of any similar hidden gems I should check out next?",
        "upvotes": 20,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lk19la/just_watched_the_twelve_why_is_no_one_talking/"
    },
    {
        "id": "1ljoc5n",
        "author": "Vashknives",
        "title": "Any way to get Netflix for cheaper?",
        "content": "Was wondering if theres any way to get the Netflix subscription for cheaper? Currently paying around $25 and looking to see if theres any discounts or promos for the premium plan. Any help would be greatly appreciated!",
        "upvotes": 389,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ljoc5n/any_way_to_get_netflix_for_cheaper/"
    },
    {
        "id": "1lk3f8n",
        "author": "EconomistAdvanced120",
        "title": "FUBAR",
        "content": "Surely I am not alone in wanting a Season 3!?! So many good things going for this show… i can’t help but think it just kept getting better and before I knew it I was at the end of season 2 😥I just wish I had the words to describe a show that had the thrill of action yet literally wetting my pants laughing! Please let me know I’m not alone in loving this show!\n",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lk3f8n/fubar/"
    },
    {
        "id": "1lkky5m",
        "author": "MaterialDate5460",
        "title": "Is it worth downgrading if I’m only using for one show?",
        "content": "I have been paying for standard for about 6 months, and everything that I have seen is pretty much meh, except for Venture Bros. I am asking for advice on whether I should downgrade for just that show specifically. If I do and I finish the show, should I cancel immediately afterwards? Thanks for your time",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lkky5m/is_it_worth_downgrading_if_im_only_using_for_one/"
    },
    {
        "id": "1ljevku",
        "author": "Gnnz",
        "title": "The Good Place worth watching?",
        "content": "This pops up constantly on my Netflix and I am considering starting. For those of you that have watched it or are currently watching it, is it worth the watch?",
        "upvotes": 299,
        "comments": 201,
        "media": null,
        "permalink": "/r/netflix/comments/1ljevku/the_good_place_worth_watching/"
    },
    {
        "id": "1lkk11y",
        "author": "Ok-Display-6604",
        "title": "Don't know what to watch!",
        "content": "I just finished 'The rookie' and don't know what to watch next! Some things I've liked are : shadow&amp;bone, b99, Dexter, sherlock, The society, Inside man, House, Derry girls, The sandman, Lucifer. Can you recommend me anything based on this? Thanks in advance! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lkk11y/dont_know_what_to_watch/"
    },
    {
        "id": "1lkjgoy",
        "author": "MamaMia1325",
        "title": "The Waterfront characters...",
        "content": "I'm on episode 6 and Cane has grown on me and is now my favorite character. I hated Bree at first but now I love her. I can't stand Topher Grace's character. I think they made him too over the top. I'm loving the brother and sister dynamic between Bree and Cane but neither parent has grown on me. They really didn't make either one very likable.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkjgoy/the_waterfront_characters/"
    },
    {
        "id": "1lk34iv",
        "author": "ineedhelp6789",
        "title": "How to revert to old layout?",
        "content": "The new netflix layout is horrendously useless. Im using google chromecast.\n\nI have a lot in \"my list\", and i have to scroll through each of them just to find the shows.\n\nI always check the \"coming this week\" and \"coming next week\", now it's gone.\n\nAny way to revert back to the old layout?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lk34iv/how_to_revert_to_old_layout/"
    },
    {
        "id": "1ljj0a1",
        "author": "OkStretch9367",
        "title": "Dept Q",
        "content": "Me and my partner loved this. I just hope the do a season 2. So many unanswered question about what happened to the main character. Anyone who loves police shows should give this watch",
        "upvotes": 130,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ljj0a1/dept_q/"
    },
    {
        "id": "1lkg3dc",
        "author": "keltoid15",
        "title": "4 pm EST June 25",
        "content": "And I get nothing on Netflix -- black screen - every other app works -- anyone else having a problem? I was watching it earlier today, no problem!!  So, not sure!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkg3dc/4_pm_est_june_25/"
    },
    {
        "id": "1lkb7bi",
        "author": "theipaper",
        "title": "Squid Game season 3 release date - and exact time it drops on UK Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lkb7bi/squid_game_season_3_release_date_and_exact_time/"
    },
    {
        "id": "1lk6sx8",
        "author": "bubblez4eva",
        "title": "KPop Demon Hunters (Korean or English)",
        "content": "Hi All,\n\n\nI've read a few reviews in how good this movie is and want to watch it. However no one ever says if they watched it in English or Korean. I want to knowbwhat's the optimal version? I keep hearing how good the songs are, and want to be able to enjoy them tot the fullest. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lk6sx8/kpop_demon_hunters_korean_or_english/"
    },
    {
        "id": "1lk1s9c",
        "author": "Indoril-Nerevar337",
        "title": "‘Cobra Kai’ Actor Accused of Biting Co-Star Hard Enough to Nearly Draw Blood: \"He Grabbed My Arm Again to Kiss it\"",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lk1s9c/cobra_kai_actor_accused_of_biting_costar_hard/"
    },
    {
        "id": "1ljrcp2",
        "author": "Blue-Steel1",
        "title": "Anyone actually like Netflix with ads ?",
        "content": "I switched because of the most recent price jump.  I actually like it because I can take a quick bathroom break without having to pause the current show.  Plus there aren’t too many ads ",
        "upvotes": 7,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1ljrcp2/anyone_actually_like_netflix_with_ads/"
    },
    {
        "id": "1ljwfk0",
        "author": "intheworldwithu",
        "title": "Abducted in Plain Sight",
        "content": "I am only 24 minutes in and had to pause to verify the name of this documentary. I think the title of this film is in need of renaming. ‘Dumb and Dumber To’ - much more fitting….",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwfk0/abducted_in_plain_sight/"
    },
    {
        "id": "1ljuu3g",
        "author": "mrbmi513",
        "title": "Cannot remove WWE New Episode Reminders?",
        "content": "I'm pulling my hair out trying to find where to disable the WWE Raw reminders I accidentally set. Every upcoming episode prompts me for a reminder, it's out of my list, and I still get them. It seems like I might not be alone.\n\nAnyone know where the magic button is?!?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljuu3g/cannot_remove_wwe_new_episode_reminders/"
    },
    {
        "id": "1lje2j3",
        "author": "MindFlourish2919",
        "title": "The latest Trainwreck review",
        "content": "Trainwreck: Poop cruise\n\nI watched the full thing and I was shocked and relieved that no one went crazy and a bigger disaster occurred. I really liked how the passengers and crew handled the whole situation. Overall very good documentary.\n\n9/10",
        "upvotes": 25,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1lje2j3/the_latest_trainwreck_review/"
    }
]