[
    {
        "id": "1qgdlpp",
        "author": "SheepdogAMA",
        "title": "Hey r/movies! I’m Steven Grayhm (writer/director/producer/star) of the award-winning\nmovie SHEEPDOG—out in theaters now. SHEEPDOG addresses our current global\nmental health crisis, explores the physical and psychological repercussions of trauma\nfrom war with an uplifting message. Ask me anything!",
        "content": "Hey r/movies! I’m Steven Grayhm (writer/director/producer/star) of the award-winning movie SHEEPDOG—out in theaters now. SHEEPDOG addresses our current global mental health crisis, explores the physical and psychological repercussions of trauma from war with an uplifting message that focuses on Post Traumatic Growth (PTG).\n\n**Cast:** \n\n* Academy Award Nominee ® Virginia Madsen (Sideways)\n* Emmy Nominee ® Vondie Curtis Hall (The Recruit)\n* Tony Nominee ® Lilli Cooper (The First Snow of Fraggle Rock)\n* SAG Nominee ® Dominic Fumusa (Dexter: Resurrection)\n* HFA Nominee ® Matt Dallas (Kyle XY)\n* Steven Grayhm (The Five People You Meet in Heaven)\n\n**Distributor:** \n\nAllen Media Group\n\n**Release date:** \n\nJanuary 16th, 2026 (in theaters!)\n\n**Trailer:** \n\n[https://www.youtube.com/watch?v=Qx7LB1gpWL4\\&amp;amp;t=147s](https://www.youtube.com/watch?v=Qx7LB1gpWL4&amp;amp;t=147s)\n\n**Synopsis:**\n\nA decorated combat Veteran is court ordered into treatment when an ex-convict shows up on his doorstep and reveals that he must put himself back together again.\n\n  \nI'll be back tomorrow (Monday 1/19) at 3 PM ET to answer questions. Ask me anything!",
        "upvotes": 8,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y4e6xju705eg1.png?auto=webp&amp;s=0a5c5e3ff03c2ca0ddd9202b766765c18b4b68a0"
        },
        "permalink": "/r/movies/comments/1qgdlpp/hey_rmovies_im_steven_grayhm/"
    },
    {
        "id": "1qdihk3",
        "author": "SamRaimiAMA",
        "title": "Hey /r/movies! I'm Sam Raimi. Ask me anything!",
        "content": "Hey reddit. I'm Sam Raimi. You might know me as the director (and sometimes writer) of **The Evil Dead** Trilogy, the Tobey Maguire **Spider-Man** Trilogy, **Doctor Strange in the Multiverse of Madness**, **Drag Me To Hell**, **Darkman**, **A Simple Plan**, **For the Love of the Game**, **The Gift**, and other things. I've also produced and/or acted in a few things!\n\nI'm here today to answer your questions.\n\nMy new film, **SEND HELP**, is out in theaters January 30 via 20th Century Studios. It stars Rachel McAdams and Dylan O'Brien. More info:\n\n*Synopsis*:\n\n&gt;Two colleagues become stranded on a deserted island, the only survivors of a plane crash. On the island, they must overcome past grievances and work together to survive, but ultimately, it's an unsettling, darkly humorous battle of wills and wits to make it out alive. \n\n**SEND HELP** is directed by genre-bending visionary Sam Raimi and stars Oscar-nominee Rachel McAdams and Dylan O’Brien. The film is produced by Raimi and Zainab Azizi, executive produced by JJ Hook and written by Damian Shannon &amp; Mark Swift, with original music by Danny Elfman. The all-original darkly comedic psychological thriller from 20th Century Studios releases in theaters nationwide on January 30, 2026.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=R4wiXj9NmEE](https://www.youtube.com/watch?v=R4wiXj9NmEE)\n\n*“The Sam Raimi Experience” BTS Content Piece:*\n\n[https://www.youtube.com/watch?v=coCPLJMU4X0](https://www.youtube.com/watch?v=coCPLJMU4X0)\n\nAsk me anything! Back at 12 PM PT/3 PM ET to chat with you all.",
        "upvotes": 12749,
        "comments": 3566,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4g2u245didg1.jpeg?auto=webp&amp;s=cc13e141b90c183d0be8040f35c355ddf1105ded"
        },
        "permalink": "/r/movies/comments/1qdihk3/hey_rmovies_im_sam_raimi_ask_me_anything/"
    },
    {
        "id": "1qgaz2t",
        "author": "DemiFiendRSA",
        "title": "‘Marty Supreme’ Becomes A24’s Highest-Grossing Film Domestically With $80 Million",
        "content": "",
        "upvotes": 7507,
        "comments": 849,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gq3tHwggetJ2tHhmUfPHu-fM0tuuDRans6zzBg8uDJk.jpeg?auto=webp&amp;s=d7e60e2a187bcf1d62083872e5aabb9fc2b66850"
        },
        "permalink": "/r/movies/comments/1qgaz2t/marty_supreme_becomes_a24s_highestgrossing_film/"
    },
    {
        "id": "1qgderu",
        "author": "AnnenbergTrojan",
        "title": "'Zootopia 2' Is Now Hollywood's Highest Grossing Animated Film Ever",
        "content": "",
        "upvotes": 4501,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1fB2Fgm7bZf74KrmvKUBgGEziwq30T6TNF9ir3BEWE8.jpeg?auto=webp&amp;s=77b433a3931eb8f358357f252978055c622a0943"
        },
        "permalink": "/r/movies/comments/1qgderu/zootopia_2_is_now_hollywoods_highest_grossing/"
    },
    {
        "id": "1qgbfu2",
        "author": "flowersnifferrr",
        "title": "I don't understand the point of Disney live action remakes",
        "content": "The original films are always infinitely better, as the remakes lack in artistry, cohesion, imagination and execution. They're so grey and muddled. They're ugly, poorly adapted and so so GREY! \n\n\nIf they're not washing out the colors of what was once a vibrant animated feature, then they're completely missing the point of central story and character arcs. They also ruin the music!\n\n\nWhat's the point of engaging with these? What's the point of entertaining this kind of mediocrity in the industry, when the originals are available and always much better? \n\n\nEDIT: I miss integrity :/ \n\n\nEDIT 2: My first edit was a joke ",
        "upvotes": 2254,
        "comments": 1081,
        "media": null,
        "permalink": "/r/movies/comments/1qgbfu2/i_dont_understand_the_point_of_disney_live_action/"
    },
    {
        "id": "1qgim05",
        "author": "MarvelsGrantMan136",
        "title": "‘The Lion King’ Co-Director Roger Allers Dies at 76",
        "content": "",
        "upvotes": 961,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1qgim05/the_lion_king_codirector_roger_allers_dies_at_76/"
    },
    {
        "id": "1qghgc6",
        "author": "InvestigatorFull7520",
        "title": "Just finished The Prestige 2006 and my brain is broken (Full Spoilers)",
        "content": "Just finished The Prestige and damn my brain is spinning. I went in thinking it’s just two rival magicians trying to outsmart each other. But nah, this movie is way twisty..  \n\n\nThe biggest shock for me was Borden being two people. Alfred and Fallon were twins the whole time, living one life as one man. That’s why sometimes he is loving and sometimes cold. Sometimes he cares for his wife and sometimes he feels like a stranger. They literally destroyed their personal lives just to protect one magic trick. That’s crazy dedication.\nThen Angier… this part really messed me up. I thought he finally used a double. But no, Tesla’s machine was real. It was cloning him. Every single show, one Angier survives and the other one dies in the tank. He never even knows if he will be the man who lives or the man who drowns. He keeps killing himself again and again just to win. That is straight up disturbing.\n\nThen I realized the opening murder wasn’t even normal murder. Angier planned his own death to frame Borden. He sacrificed himself just to destroy his enemy. That’s how deep his obsession went.\nThe ending hurt. One Angier is drowning in the tank and the other is bleeding on the floor. No winners at all. Just two broken men who ruined their lives for obsession.",
        "upvotes": 1069,
        "comments": 243,
        "media": null,
        "permalink": "/r/movies/comments/1qghgc6/just_finished_the_prestige_2006_and_my_brain_is/"
    },
    {
        "id": "1qgd9af",
        "author": "4thGenTrombone",
        "title": "Who Framed Roger Rabbit is an all-time banger, but why are nearly no other live-action/hand-drawn hybrid films?",
        "content": "I get that production on this elite film was INSANE and basically no other hybrid film like that could match it. But why, in nearly 40 years, has nearly no studio greenlit something similar? Is it because Cool World bombed colossally? Literally the only examples I can think of after that are Looney Tunes: Back in Action, and the upcoming Coyote vs. Acme. (Space Jam doesn't really count in this way, it only has two scenes that blend 2D characters into a 3D world) I mean, sure, theatrical hand-drawn animation in the West is on life support, but  Coyote vs Acme had to be dragged out the doldrums to even be released!",
        "upvotes": 750,
        "comments": 329,
        "media": null,
        "permalink": "/r/movies/comments/1qgd9af/who_framed_roger_rabbit_is_an_alltime_banger_but/"
    },
    {
        "id": "1qgpeo3",
        "author": "kryonik",
        "title": "Examples of anti-Chekhov's guns?",
        "content": "A rule of thumb for playwrights is that any significant story element introduced early in the play should have some sort of payoff before the play ends. If you introduce a gun in act one of a three act play, it better go off in act three or it was an extraneous detail that should be excised from the script. The same rule is often applied to movies as well.\n\nMy question is what examples of an anti-Chekhov gun are there: not just a plot device that has no payoff but a plot device that is introduced and subsequently works in a way antithetical to the way the movie explains. Basically how many movies lie to the audience.\n\nTwo examples come to mind: in Jurassic Park, it's shown early on that the t-rexes are so massive that their footsteps can be heard from far away and shake the ground but later in the climax, a T-Rex seemingly appears out of nowhere with no warning. In Ant Man, it's explained that items that are shrunk down maintain their mass, that's why a punch from a microscopic Ant Man packs the punch of a full grown adult yet we see later in the movie that Hank Pym is carrying around a shrunk down tank that should way thousands of pounds on a keychain.",
        "upvotes": 154,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1qgpeo3/examples_of_antichekhovs_guns/"
    },
    {
        "id": "1qglr4p",
        "author": "SanderSo47",
        "title": "Almost Famous (2000, dir. Cameron Crowe) – William Miller meets Lester Bangs.",
        "content": "",
        "upvotes": 131,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bi8c1aifk6eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qglr4p/almost_famous_2000_dir_cameron_crowe_william/"
    },
    {
        "id": "1qgqc70",
        "author": "KillerQ97",
        "title": "When someone mentions “DVD Special Features,” what is the FIRST one that pops into your head from yesteryear?",
        "content": "When someone mentions “DVD Special Features,” what is the FIRST one that pops into your head from yesteryear?\n\nFor me, it’s definitely \"The Lost Tape: Andy's Terrifying Last Days Revealed\" on the DAWN OF THE DEAD (2004) remake.  That 17 minutes just really stuck with me…\n\nFor me, it’s definitely \"The Lost Tape: Andy's Terrifying Last Days Revealed\" on the DAWN OF THE DEAD (2004) remake.  That 17 minutes just really stuck with me…",
        "upvotes": 73,
        "comments": 170,
        "media": null,
        "permalink": "/r/movies/comments/1qgqc70/when_someone_mentions_dvd_special_features_what/"
    },
    {
        "id": "1qfmjhd",
        "author": "MarvelsGrantMan136",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the Plot Three or Four Times in the Dialogue Because Viewers are on Their Phones While They’re Watching",
        "content": "",
        "upvotes": 57725,
        "comments": 3911,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x4iP0OUZbExEaet_5zEh2w5OKmZizJ-8001d6mwAliM.jpeg?auto=webp&amp;s=cfcb82c0022152937a06e5091151531c5c2d1e3a"
        },
        "permalink": "/r/movies/comments/1qfmjhd/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qfr1xo",
        "author": "BIGxBOSSxx1",
        "title": "Has there ever been any actor or actress that was brutally honest about the movie they’re making during a press tour?",
        "content": "I’m seeing people post videos of the Stranger Things cast kind of having weird reactions to the story/writing, and it reminded me of the time where this exact thing happened with Game of Thrones, where the final season was not well received and it looked apparent that the cast also didn’t like it. \n\nIt got me wondering, has there ever been a notable instance where an actor or actress was like “Yeah no, this shit straight up sucks”  on a press tour? I understand this means they’d probably get blacklisted and probably wouldn’t find any acting jobs after, but I’m wondering if maybe someone with enough notoriety could get away with it. ",
        "upvotes": 2641,
        "comments": 1208,
        "media": null,
        "permalink": "/r/movies/comments/1qfr1xo/has_there_ever_been_any_actor_or_actress_that_was/"
    },
    {
        "id": "1qgd9lq",
        "author": "vipertwin",
        "title": "I would encourage everyone to watch “Rental Family” It’s emotional but such a good film.",
        "content": "Ive just watched it today. I am an older person, however this did kick me in the feels. Wonderfully shot, beautifully made.  Make the time to see it. \n\nIt’s a slow burner however it did make me think about life and how we see it.  \n\nIt made me feel like something is missing in my own life.  Maybe for the good or not, i don’t know. Just take out some time and watch. ",
        "upvotes": 95,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1qgd9lq/i_would_encourage_everyone_to_watch_rental_family/"
    },
    {
        "id": "1qg4hng",
        "author": "Newez",
        "title": "Bruce Leung Siu-Lung, veteran Hong Kong actor and martial arts star, passes away at 77",
        "content": "",
        "upvotes": 308,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1qg4hng/bruce_leung_siulung_veteran_hong_kong_actor_and/"
    },
    {
        "id": "1qgpyv9",
        "author": "Morgan-Moonscar",
        "title": "\"Ran\" 乱 (1985, Akira Kurosawa) - The death of Lady Kaede (Mieko Harada)",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jwK7_KdzJiePmRf_o8sH5FD913R22epWrNFlkfUbDCc.jpeg?auto=webp&amp;s=5b040870b36cd1b69e79e0dea69a93ccbe02c5e3"
        },
        "permalink": "/r/movies/comments/1qgpyv9/ran_乱_1985_akira_kurosawa_the_death_of_lady_kaede/"
    },
    {
        "id": "1qgl3z3",
        "author": "Bikewer",
        "title": "The Third Man",
        "content": "I thought I had watched The Third Man long ago, but I did all I remembered was the jangly zither music.\n\nAnother masterful noir film.    Post-War Vienna, with its magnificent architecture so damaged by the war, and all those characters that were hired…. Really set the tone. \n\nAnd Welles’ performance was terrific.    Going from that jaunty, cocky con-man (when he finally appears) to the hunted and hopeless individual in the end scenes….  ",
        "upvotes": 31,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1qgl3z3/the_third_man/"
    },
    {
        "id": "1qfy8n1",
        "author": "Southern-Brother5693",
        "title": "Dodgeball - A True Underdog Movie",
        "content": "Saw this last night and really enjoyed it. A lot of the humour is more hit than miss for me. Laughed out loud several times. Which I didn't even do when I saw The Naked Gun (2025).\n\n1) Hard to believe Ben Stiller has been married to this hottie for over 20 years!\n\n2) And the cameos! One of them in particular has not aged well.\n\nAll in all, I am glad I saw this.",
        "upvotes": 728,
        "comments": 329,
        "media": null,
        "permalink": "/r/movies/comments/1qfy8n1/dodgeball_a_true_underdog_movie/"
    },
    {
        "id": "1qgd0nf",
        "author": "Caesar213",
        "title": "Rental Family is one of those movies where speaking two languages feels natural",
        "content": "When two characters talk between each other in a language, and switch to another (mainly English), most of the time it feels weird, forced. For example, when Legolas and Aragorn speak Elvish just to suddenly change to English to deliver *the* phrase.\n\nIt delivers, it serves a dramatic purpose, but most of the time it feels unrealistic.\n\nIn Rental Family, this felt completely the opposite. When Brendan Fraser's character speaks in Japanese, it's natural, it fits the context, and it's a realistic use: ordering ramen, when first contacting a person... And when he switches to English, it feels so real, he speaks it with people that fit it: a child learning it in school, a renowned filmmaker who has probably traveled around the world...\n\nNot only the context is \"justified\", but he's constantly switching from English to Japanese, and it flows so naturally. It was beautiful to hear and see this movie.",
        "upvotes": 71,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1qgd0nf/rental_family_is_one_of_those_movies_where/"
    },
    {
        "id": "1qgbn8n",
        "author": "John_Snow80",
        "title": "Which movie do you think was amazing until its third act, and how would you have ended it differently?",
        "content": "Some films build incredible tension, character development, and momentum, only to stumble in the final act with a rushed resolution, a contrived twist, or a tonal shift that doesn’t land.  \nThis isn’t about endings you simply didn’t like, but ones that felt like a narrative or structural letdown after a strong setup.\n\nConsider:\n\n* ***I Am Legend*** (original vs. alternate ending).\n* ***Sunshine*** (2007) – shift from sci-fi to horror.\n* ***Law Abiding Citizen*** – final resolution debates.\n* ***10 Cloverfield Lane*** – divisive finale.\n\nIf you were in the editing room, how would you have reshaped the final act to preserve the film’s earlier brilliance?",
        "upvotes": 76,
        "comments": 346,
        "media": null,
        "permalink": "/r/movies/comments/1qgbn8n/which_movie_do_you_think_was_amazing_until_its/"
    },
    {
        "id": "1qfiy2q",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Lewis Pullman and Maya Hawke in ‘Wishful Thinking’ - Follows a volatile couple who discovers their emotional state has supernatural consequences on the world around them.",
        "content": "",
        "upvotes": 4209,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r9w1ae5r0ydg1.jpeg?auto=webp&amp;s=c1bcf2744d05bf0a6233a5986275f6f21209d68c"
        },
        "permalink": "/r/movies/comments/1qfiy2q/first_image_of_lewis_pullman_and_maya_hawke_in/"
    },
    {
        "id": "1qgnub3",
        "author": "PlusCompetition9196",
        "title": "Post movie depression",
        "content": "Does anyone else get so easily depressed after finishing a movie/series? I dread completing a film, because I know I will get sad and numb after and it just makes me less enthusiastic to watch more films. I just completed \"A silent voice\" it is a beautiful movie and I got so invested that when it ended it felt like i fell into a void, I have no idea how to explain it. \n\nI dont know if this is the appropriate place to Post this but I will anyway. ",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1qgnub3/post_movie_depression/"
    },
    {
        "id": "1qg320f",
        "author": "Big-Property7157",
        "title": "DOGTOWN AND Z-BOYS (2002)- TRAILER",
        "content": "",
        "upvotes": 158,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uOd4qmnasg8yqVkTy2AVlNyCRJKB8HDgQWSRlfK-2mc.jpeg?auto=webp&amp;s=4f30e0f63dd1272cdbb0dfd4c30020f31f19d959"
        },
        "permalink": "/r/movies/comments/1qg320f/dogtown_and_zboys_2002_trailer/"
    },
    {
        "id": "1qgqvlr",
        "author": "Used-Opposite-7363",
        "title": "What are your favorite horror movies and why?",
        "content": "​What are your top horror movies? Why/what's the movie about?\n\nFor me it's ghosts, hauntings. So, these are my go-to's but what else should be on the list?\n\nThe Shining\n\nAmityville Horror\n\nRosemary's Baby\n\nThe Exorcist\n\nCarrie\n\nStepford Wives original\n\n​​That 70s movie about that lady named Sally with the little weird creatures that escaped from the furnace. That was wild.\n\n​​Scary Movie 2 is a comedy but I'll put it on the list anyway\n\n​​I haven't watched Scream in so long that I don't really remember if I was scared at all when I saw that.\n\n​​I don't care for gruesome gore. Back in the day a group of guys invited me to go watch Saw with them and I went having no backstory on the movie.\n\n​​I walked out of the theater after the first scene.\n\n​​What other haunting movies should be on my list? What have you watched and enjoyed? Thanks in advance.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1qgqvlr/what_are_your_favorite_horror_movies_and_why/"
    },
    {
        "id": "1qgqc5f",
        "author": "Mikeyboy101591",
        "title": "The Naked Prey (1965)",
        "content": "A safari guide (Cornel Wilde) cautions the hunting party he is leading to respect the African natives they encounter. Instead of heeding this advice, one of the party actively insults the tribe, which captures and kills the entire group. Only the guide is spared. But he is stripped of his clothing, and given a head start before the warriors give chase. Using his knowledge of the land and resourcefulness, the guide must make his way back to the closest British fort. I liked the film it’s very intense but I wouldn’t say it’s a favorite of mine, there are scenes where animals are being hunted but the film is very well shot in the African landscape. Cornel Wilde not only stars in the film but he also co produced and directed the film. The film’s language is 95% Afrikaans and 1% English but you watch the film for the intensity. The film is crazy how they got away with some of the scenes back in 1965. ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1qgqc5f/the_naked_prey_1965/"
    },
    {
        "id": "1qfwxu5",
        "author": "ajjt21",
        "title": "What is the job of a Producer for a movie?",
        "content": "What does a producer do? I have seen many times that an actor is also listed as a Producer for a movie that he/she stars in.\n\nAre co-producer and producer different or the same jobs?\n\nWhat does an executive producer mean?\n\nFor example, if Disney made a certain movie then why does individual names are attached to that movies as producers? Isn't it the company who made that movie? Isn't it the studio who made it?\n\nIs being a producer on a movie different from being one on a TV Show?\n",
        "upvotes": 305,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1qfwxu5/what_is_the_job_of_a_producer_for_a_movie/"
    },
    {
        "id": "1qflvg2",
        "author": "NeonMeateOctifish",
        "title": "Children of Men (2006) Dir. Alfonso Cuarón -\"The Car Oner\" - Clive Owen, Julianne Moore, Chiwetel Ejiofor",
        "content": "",
        "upvotes": 1008,
        "comments": 125,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ql4j73vqiydg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qflvg2/children_of_men_2006_dir_alfonso_cuarón_the_car/"
    },
    {
        "id": "1qg3axv",
        "author": "Tardigr4d",
        "title": "38th European Film Awards: ‘Sentimental Value’ Wins Best Film, Director, Actor, Actress",
        "content": "",
        "upvotes": 81,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O_umnC1IXtgKDShVYGqHBZV5i6AjGxJLPX2kcabVbEc.png?auto=webp&amp;s=5370c1e5f21e78929e7d2efad8825d4f477ff7ce"
        },
        "permalink": "/r/movies/comments/1qg3axv/38th_european_film_awards_sentimental_value_wins/"
    },
    {
        "id": "1qghnq6",
        "author": "yesthenshaggers",
        "title": "First Viewing, Should I Watch Godfather 3 or Godfather Coda?",
        "content": "Going through some of the best rated films of all time,\n\nI've been in absolute awe at Godfather and Godfather part 2, genuinely wondering why I waited so long to watch them.\n\nI've been told the third installment isn't as strong, but I'd still like to finish the trilogy, with it being my first Viewing, should I watch the original cut or the 2020 recut?",
        "upvotes": 11,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1qghnq6/first_viewing_should_i_watch_godfather_3_or/"
    },
    {
        "id": "1qfkzxu",
        "author": "NYCWriterOfAllThings",
        "title": "Why do the Inglourious Basterds remove the German soldiers' boots and toss them away?",
        "content": "Seen this movie probably 15 times at least at this point and only during this current viewing did I stop to wonder why, when the Basterds are first shown scalping Nazis next to that brick bridge, they remove their dead enemies' boots and toss them in the direction of that bridge. Does anyone have any idea why they do this? It surely stems from some real-life practice of soldiers from the war. ",
        "upvotes": 747,
        "comments": 135,
        "media": null,
        "permalink": "/r/movies/comments/1qfkzxu/why_do_the_inglourious_basterds_remove_the_german/"
    }
]