[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jl9kwj",
        "author": "Snoo-67870",
        "title": "Dove mangiare con meno di 10 euro: la lista definitiva",
        "content": "Ieri ho fatto un post dove vi chiedevo i vostri posti preferiti dove mangiare con meno di 10 euro e sta venendo fuori una bella lista!\n\nECCO A VOI LA LISTA COLLABORATIVA, potete dunque modificarla come volete, aggiungere, togliere e mettere descrizioni! (Vi scongiuro, se conoscete uno dei posti nella lista, dite la vostra nella descrizione)\n\nNon temete di aggiungere, se salvate la lista, diventa anche vostra! ✨✨\n\nRegole:\n1) potete aggiungere quello che volete purché realmente il prezzo sia inferiore a 10 euro per un pasto decente;\n2) kebabbari, paninari e pizzerie SOLAMENTE se reputate che siano veramente wow E MOTIVATE il perché;\n3) mi raccomando, se potete, scrivete una descrizione a ogni posto che aggiungete, anche stupida! (Meglio se stupida);\n4) se volete dire la vostra su un posto già aggiunto, lasciate la vecchia descrizione e aggiungete la vostra dopo a quella.\n\n\nDETTO QUESTO, ECCO A VOI IL LINK!\nhttps://maps.app.goo.gl/ndtcvPzQPbkq8PRT7?g_st=ac\n\n\nEdit: NOVITÀ! Siamo a... 200 collaboratori! Raga ma che cazzo, siete fortissimi ed un sacco collaborativi... vi amo. Mi viene veramente voglia di fare altre cose così!\nSe trovate un posto che conoscete, scrivete pure la vostra opinione nella descrizione (credo sia la cosa più importante rispetto ad aggiungere solo).\nOh, giuro che poi riordino la lista, a meno che qualcuno di voi non voglia farlo 🫡\n\nGrazie mille a quello che ha premiato il post🥹✨",
        "upvotes": 88,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zuLUkdnDXsEn1kBaqo6gnW40tCCyDbL3DtAULcnB3Qg.jpg?auto=webp&amp;s=58de6a91676290e1489073c4e91c5cd0e058f169"
        },
        "permalink": "/r/torino/comments/1jl9kwj/dove_mangiare_con_meno_di_10_euro_la_lista/"
    },
    {
        "id": "1jlrrof",
        "author": "Original_Truth920",
        "title": "Affitto nell' Corso Novara per studenti",
        "content": "Siamo due studenti e abbiamo visto un appartamento in affitto in Corso Novara, com'è vivere in quella zona? e com'è la vita delle\\`studenti in Torino? Grazie mille",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jlrrof/affitto_nell_corso_novara_per_studenti/"
    },
    {
        "id": "1jlros4",
        "author": "salvo955",
        "title": "Amicizia",
        "content": "Ciao a tutti, sono un ragazzo di 29 anni in cerca di semplici chiacchere/un caffè/passeggiata. Mi adeguo e parlo di tutto in serenità purché ci sia rispetto ed educazione. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1jlros4/amicizia/"
    },
    {
        "id": "1jlu79a",
        "author": "thanos649262",
        "title": "Carta GTT smarrita",
        "content": "Ciao a tutti, purtroppo come si intuisce dal titolo ho smarrito la carta GTT e volevo chiedere se qualcuno sa cosa fare in questi casi (per carta GTT intendo la tessera che si usa per bippare e dove ho l'abbonamento).\n\nGrazie mille ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jlu79a/carta_gtt_smarrita/"
    },
    {
        "id": "1jlajxu",
        "author": "rideontim3",
        "title": "DUBBIO ESISTENZIALE!!!",
        "content": "è da giorni che rimugino sull'esistenza del goofiest bus ever torinese, ovvero lo star1. lo trovo ovunque, nei momenti piu randomici della giornata. che giro fa?",
        "upvotes": 22,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1jlajxu/dubbio_esistenziale/"
    },
    {
        "id": "1jlbsm8",
        "author": "Carlossss11",
        "title": "Facciamo Smartworking insieme?",
        "content": "Ho la fortuna di lavorare da dove voglio quando voglio ma, chi lavora come me in Smart e non ha famiglia o figli, capirà che dopo un po’ è molto alienante. Mi piacerebbe creare un gruppo di smartworkers da radunare tutte le volte che si desidera in bar, aule studio, centri sociali, parchi o a casa di chi la offre. Dove vogliamo insomma. Se anche tu come me stai cercando compagnia nelle ore di lavoro, commenta che vediamo come creare il gruppo 💪🏼💪🏼",
        "upvotes": 19,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1jlbsm8/facciamo_smartworking_insieme/"
    },
    {
        "id": "1jlrxiw",
        "author": "Oscaruzzo",
        "title": "Smashburger a Torino?",
        "content": "Il titolo dice già tutto. Vorrei provare ad assaggiare uno smashburger, anzitutto per curiosità, e secondo perché da sempre sono convinto che un hamburger \"grosso\" debba essere larghissimo, non altissimo; non c'ho voglia di spaccarmi la mascella per morderlo, non sono un'anaconda.\n\nSi accettano quindi graziosi suggerimenti. No fast food, grazie :)",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1jlrxiw/smashburger_a_torino/"
    },
    {
        "id": "1jlpfwk",
        "author": "DPPenjoyer18",
        "title": "Google maps è affidabile per gli orari dei mezzi? Alternative?",
        "content": "Salve a tutti, dovendo trasferirmi a Torino, sto utilizzando google maps per controllare approssimativamente il tempo impiegato per raggiungere il luogo di lavoro da ogni possibile casa che sto trovando. Tuttavia, volevo chiedere, specie per i bus, è affidabile google maps come orari? Perché tante volte sto notando che nel percorso di andata mi da la linea del bus da prendere, mentre al ritorno non mi segna alcun bus",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jlpfwk/google_maps_è_affidabile_per_gli_orari_dei_mezzi/"
    },
    {
        "id": "1jl0za5",
        "author": "Adventurous_Train897",
        "title": "Torino, pareri sinceri: vita quotidiana tra qualità dell'aria e costi reali",
        "content": "Ciao a tutti! Ho letto tantissimi post di questo sub, ma vorrei delle opinioni oneste e aggiornate al 2025.\n\nSto seriamente valutando di trasferirmi a Torino con la mia famiglia (abbiamo un bambino piccolo) e vorrei conoscere le vostre esperienze dirette su alcuni punti cruciali:\n\n**INQUINAMENTO REALE:** **Quanto pesa davvero lo smog nella vita quotidiana?**\n\n* Chi vive a est del Po (Borgo Po, Cavoretto, Madonna del Pilone) nota differenze tangibili?\n* La collina è una valida alternativa o troppo isolata?\n\n**PRO &amp; CONTRO VARI**\n\n* Quali sono i difetti di Torino che nessuno vi aveva detto prima di trasferirvi?\n* Pro e contro in generale?\n\n**COSTO DELLA VITA**\n\n* Quanto spendete in media per lo svago personale (aperitivi, teatro, eventi culturali, palestra/corsi sportivi)? So che è soggettivo, ma in generale per avere una bella vita sociale e culturale, quanto bisogna mettere in conto a Torino?\n\n**ZONE CONSIGLIATE -** **Se doveste scegliere oggi, dove andreste a vivere in città considerando:**\n\n* Qualità dell'aria\n* Collegamenti con il centro\n* Servizi e vita di quartiere\n\n  \nLavoriamo da remoto, quindi non dovremo affrontare la questione lavoro, ci interessa la qualità di vita (e il relativo costo).  \n\nGrazie mille anticipatamente a chi vorrà condividere la propria esperienza!",
        "upvotes": 8,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1jl0za5/torino_pareri_sinceri_vita_quotidiana_tra_qualità/"
    },
    {
        "id": "1jldz1k",
        "author": "aaronrandomguy",
        "title": "Catena antifurto bicicletta",
        "content": "Oggi finalmente sono diventato un ciclista!! Sono molto felice ma non vorrei dover passare subito alla tristezza.. per questo vi chiedo:\n\nQuale catena consigliate? Ma soprattutto conoscete un negozio fisico a Torino dove acquistarla?\n\nDa quello che ho potuto capire quelle ad ‘U’ sono più sicure ma vorrei capire quanto effettivamente siano limitanti\n\nAggiungo che ho una bici del valore di 85€\nPagata 0€ perché era cortile del palazzo abbandonata da non so quanto tempo, 85€ spesi per aggiustarla\n\nPer la riparazione sono andato da Triciclo vicino al parco Ruffini, volevo chiedere a chi andrà di rispondere se aveva senso sistemarla o meglio comprare direttamente una funzionante \n\nPs: la bicicletta ha punti di ruggine qua e la ed è verniciata in stile antifurto (in due colori a caso per essere facilmente riconoscibile)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jldz1k/catena_antifurto_bicicletta/"
    },
    {
        "id": "1jl638m",
        "author": "BarberIllustrious985",
        "title": "Ripetizioni a Torino",
        "content": "Ciao! Sono uno studente fuorisede del poli e sto cercando di arrotondare qualcosa facendo ripetizioni, ma sembra impossibile trovare qualcuno qui. Ho già provato Letuelezioni, super prof, bakeka, gruppi Facebook e altri siti simili. Qualcuno sa come funziona a Torino? (Ho visto anche per part time nel weekend/domenica ma non so né come funzionano e non ne ho trovati) Grazie in anticipo! :( ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jl638m/ripetizioni_a_torino/"
    },
    {
        "id": "1jkzhba",
        "author": "Sirio_3451",
        "title": "Trasferito a Torino da meno di un anno, cerco nuove amicizie",
        "content": "Ciao a tutti, (30m) mi sono trasferito per lavoro a Torino nell'estate dell'anno scorso, in questo periodo ho fatto qualche amicizia sporadica con il fatto che vado in palestra e pratico un arte marziale ma mi piacerebbe conoscere gente nuova, mi piacciono film, serie TV (fantascienza in particolare), anime e manga, quando posso gioco al PC, se qualcuno ha piacere di fare una chiacchierata, un caffè, una passeggiata mi scriva! ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jkzhba/trasferito_a_torino_da_meno_di_un_anno_cerco/"
    },
    {
        "id": "1jl9lf1",
        "author": "_pigreco_",
        "title": "corso ciclomeccanica",
        "content": "ciao, sto cercando un corso di ciclomeccanica gratis a torino. ho visto certi prezzi assurdi su internet, so che la gente non lavora gratis per questo cerco un corso che sia tenuto in modo “amatoriale” ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jl9lf1/corso_ciclomeccanica/"
    },
    {
        "id": "1jl9686",
        "author": "Proper-Prune-6806",
        "title": "AOO qualcuno ha provato l'osteria di Franchino??",
        "content": "Quanto costa? C'è qualche sola da evitare?? ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jl9686/aoo_qualcuno_ha_provato_losteria_di_franchino/"
    },
    {
        "id": "1jko01r",
        "author": "Snoo-67870",
        "title": "Posti dove mangiare sotto i 10 euro",
        "content": "Nato e cresciuto a Torino, universitario, vorrei censire un po' di posti dove si possa mangiare sotto i dieci euro che non siano né kebabbari né ristoranti cinesi AHAHAHAHAH (scherzo, i ristoranti cinesi vanno bene).\nL'idea era fare una sorta di lista google, magari collaborativa, che coprisse un po' tutta la città!\n\n\nEcco alcuni ottimi (pessimi) esempi di roba:\nhttps://maps.app.goo.gl/2XJ8opzeDKDABkha7?g_st=ac\nhttps://maps.app.goo.gl/eDMK3waFUDgxbovR6?g_st=ac\nhttps://maps.app.goo.gl/7En4b3R91vDs4Yg67?g_st=ac\n\n\nOppure che so (questo è una hit):\nhttps://maps.app.goo.gl/TL8gRb4gtJcD5nZv8?g_st=ac\n\n\nEDIT: Ho creato il post con il link della lista (MODIFICABILE), se mi andate a mettere up e aggiungete posti vi potrei dare un biscotto!\n\nhttps://www.reddit.com/r/torino/s/FAUq1Gbtlg",
        "upvotes": 25,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sZXOC3nbJnrkBZg_QbCbGauWO1GYLe1vufh5zCuhY0.jpg?auto=webp&amp;s=1bd5b19e6c9a601ebf26b14c0905aa39e5496386"
        },
        "permalink": "/r/torino/comments/1jko01r/posti_dove_mangiare_sotto_i_10_euro/"
    },
    {
        "id": "1jkedn2",
        "author": "RandomRemember",
        "title": "Perchè piove a Torino se sull’app dice che c’è il sole??",
        "content": "É la fine del mondo.",
        "upvotes": 45,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1jkedn2/perchè_piove_a_torino_se_sullapp_dice_che_cè_il/"
    },
    {
        "id": "1jl0u6u",
        "author": "Geralt_of_Bals",
        "title": "Bar o pub per guardare le partite?",
        "content": "Salve Torino, vengo a visitare la città nel weekend però sabato sero vorrei guardarmi Lecce - Roma in un bar/pub, qualche consiglio magari vicino al centro? Se di solito non troppo affollato ancora meglio.\n\nGrazie mille!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jl0u6u/bar_o_pub_per_guardare_le_partite/"
    },
    {
        "id": "1jl8s8u",
        "author": "rideontim3",
        "title": "ho bisogno di una mano",
        "content": "ciao a tutti, sono un* ragazz* fuorised* a torino e sto avendo problemi con una questione: qualcuno sa dove si trova in questa cittá un posto tipo Moneta?? grazie mille per l'aiut*!!",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jl8s8u/ho_bisogno_di_una_mano/"
    },
    {
        "id": "1jkp1aj",
        "author": "Repulsive-Yak-126",
        "title": "Parts of the city",
        "content": "Cia tutti, my landlord is giving me 3 options, apartment near the milano barieri, lingotto and  Porto nuovo, but the one in Porto nova is kinda shit. What can u tell about lingotto and this place",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a8zt4ago44re1.jpeg?auto=webp&amp;s=da5a96f5c4217296ac8a8882260def09439007b3"
        },
        "permalink": "/r/torino/comments/1jkp1aj/parts_of_the_city/"
    },
    {
        "id": "1jka9d3",
        "author": "Andrea-Franeschi",
        "title": "Giro delle Fiandre",
        "content": "Ciao a tutti, sto cercando compagni di viaggio per andare a vedere il Fiandre partendo in bici da Torino. \n\nL’idea sarebbe fare Flixbus (o treno) fino a Parigi e poi, passando per Roubaix, proseguire verso uno dei muri classici per vedere la gara e lunedì tornare a Parigi e prendere il treno per Torino.\n\nSarà tutto un po’ low budget, sto valutando se portarmi la tenda o appoggiarmi a degli ostelli economici\n\nSono molto flessibile con i piani, è un’improvvisata, una piccola avventura, nessuna tabella di marcia precisa.\n\nAccetto anche consigli su dove mettersi per vedere la gara!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jka9d3/giro_delle_fiandre/"
    },
    {
        "id": "1jkmpux",
        "author": "therapeutic_Grizzly",
        "title": "Apertivo/pasto laurea Politecnico",
        "content": "Buonasera a tutti! \nAd aprile dovrei festeggiare una laurea zona politecnico, non sapendo ancora a che ora sarà, stavo valutando luoghi sia per un aperitivo o un pranzo/cena. Qualcuno di voi ha qualche consiglio per un locale in questa zona? \nConosco già Aldo's bakery ma stavo valutando anche altri luoghi. Vi ringrazio ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jkmpux/apertivopasto_laurea_politecnico/"
    },
    {
        "id": "1jk8wwn",
        "author": "Mv3tt",
        "title": "Migliori pizzerie napoletane",
        "content": "Buondì, leggendo i vari post su questo subreddit, ho notato che spesso la discussione degenera su pizzerie molto buone ma non napoletane.\n\nVorrei che questo post fosse un hub esclusivamente incentrato sulla pizza napoletana e su quali pizzerie a Torino siano più abili nel rispettarne la tradizione. \n\nVi ringrazio in anticipo per i consigli!",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1jk8wwn/migliori_pizzerie_napoletane/"
    },
    {
        "id": "1jkeaev",
        "author": "peter_plays",
        "title": "Petizione",
        "content": "Petizione per riempire di piscio e sborra la buca davanti all incrocio dell Lidl e del giropizza se volete partecipare lasciate un commento di conferma ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jkeaev/petizione/"
    },
    {
        "id": "1jkbhsn",
        "author": "AxelRowley",
        "title": "Riparazioni pc",
        "content": "Ciao a tutti, qualcuno saprebbe consigliarmi un buon centro assistenza per riparazioni pc con prezzi quantomeno onesti? Ho un pc fisso che ha deciso di abbandonarmi e vorrei almeno provare a ripararlo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jkbhsn/riparazioni_pc/"
    },
    {
        "id": "1jjpekw",
        "author": "Ultraviolet_law",
        "title": "A Torino da poco, vorrei davvero evitare di chiudermi in casa dopo il lavoro",
        "content": "Salve a tutti, come da titolo sono da poco a Torino per questioni lavorative. Non ho contatti qui, e se ho capito l’andazzo finirò molto probabilmente a diventare un totale asociale entro le prossime due settimane, cosa che vorrei evitare. Sono un ragazzo di 26 anni, pratico la palestra, il teatro, e apprezzo i manga e i videogiochi, nonché sfornare dolci.\nQuindi se qualcuno fosse nella mia stessa situazione e volesse uscire a bere qualcosa mi farebbe molto piacere, mi piacerebbe farmi nuovi amici già dall’inizio (non gente troppo più piccola di me pls) ",
        "upvotes": 31,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1jjpekw/a_torino_da_poco_vorrei_davvero_evitare_di/"
    },
    {
        "id": "1jk8uzb",
        "author": "Alux_11",
        "title": "Amicizie a Cenisia/San Paolo",
        "content": "Ciao a tutti!\n\nSono un fuorisede di 22 anni che si è trasferito da qualche mese a Torino per frequentare la magistrale in Computer Science al poli.\n\nSono abbastanza nerd e appassionato della fantascienza, amante della natura e LGBT friendly🏳️‍🌈\n\nSe qualcuno ha voglia di uscire per fare due chiacchiere e bere qualcosa contattatemi ;)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jk8uzb/amicizie_a_cenisiasan_paolo/"
    },
    {
        "id": "1jjgua1",
        "author": "ItaSecretaccount",
        "title": "Escort e centri massaggi consigliati a Torino",
        "content": "Salve, mi sono arreso all'idea che una relazione romantica non sia possibile e sto cercando escort o centri massaggi per cui valga la pena spendere i soldi che risparmierò non uscendo più con nessuno.\nGrazie in anticipo per le risposte ",
        "upvotes": 16,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1jjgua1/escort_e_centri_massaggi_consigliati_a_torino/"
    },
    {
        "id": "1jjkd17",
        "author": "sturmfrey",
        "title": "Ammenda ingiusta gtt",
        "content": "Ciao. Sono uno studente che vive a Torino e ho ricevuto una tessera annuale GTT a gennaio. La settimana scorsa, l'assegno gtt è arrivato sul tram in cui mi trovavo e dopo averlo visto, mi sono reso conto di aver lasciato il portafoglio a casa. Immediatamente tocco il mio telefono per pagare a bordo e vengo multato perché ho pagato quando l'ho visto (avrei pagato se avessi saputo che non avevo la mia carta con me all'inizio del viaggio. Ho pagato 1 fermata dopo) \nMi ha detto di presentare il mio passaporto e di pagare 17 €, ma non portavo con me il mio passaporto. Così mi ha detto di pagare 39 € ed entro 7 giorni, di portare il mio passaporto e la mia carta GTT alla stazione GTT per ottenere un rimborso di 20 € perché se ho un abbonamento, devo pagare solo 17 €. \nIeri sono andato alla stazione porta nuova e la signora non parla inglese. Alla fine hanno trovato qualcuno da tradurre e mi hanno detto che non possono rimborsarmi 20€. Dice che sarei dovuta venire a pagare la multa di 17 € alla stazione. ma dato che ho già pagato la multa di 37 € sul tram, non possono restituirmi 20 €. \nOra mi chiedo, com'è possibile? Il loro stesso impiegato mi ha incaricato di farlo e mi ha fatto pagare la multa. Perché devo pagare 20 € in più quando dice chiaramente nelle regole GTT che se hai un abbonamento valido e vai alla stazione prima di 7 giorni dalla multa, paghi solo 17 €. Non sono responsabile per l'errore di comunicazione tra i dipendenti, ma sono solo uno studente per il quale 20 € sono un sacco. in particolare quando ho pagato 255 € per una carta intera. \n\nLa signora alla stazione mi ha detto di scrivere una e-mail e forse tra due mesi, potrebbero rispondere e vedere il caso. Com'è possibile? È certo che otterrò il rimborso? Non lo so \n\nSono molto deluso e confuso su come affrontare la questione. Mi dispiace, sto anche usando un traduttore  \n",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jjkd17/ammenda_ingiusta_gtt/"
    },
    {
        "id": "1jjo030",
        "author": "SkyMilesEnthusiast",
        "title": "Question about renting with Prohouse",
        "content": "Hello, I am looking for places on idealista and have been talking to Prohouse about a short-term rental in Torino. \n\nThey want one month of rent to reserve the apartment, and then two months of rent as a security deposit for the registrazione del contratto. Does this sound like a scam, or is it normal for Turin/Italy? Thank you in advance :)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jjo030/question_about_renting_with_prohouse/"
    },
    {
        "id": "1jjm2z5",
        "author": "Intelligent-Deal-759",
        "title": "Cercasi: partite di pallavolo o beach volley",
        "content": "Ciao a tutti! \n\nSapreste dirmi se esitono app o gruppi facebook / telegram dove posso trovare persone interessate ad organizzare partite di pallavolo o di beach volley.\n\nLo cerco per divertimento e non perché sia forte.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jjm2z5/cercasi_partite_di_pallavolo_o_beach_volley/"
    }
]