[
    {
        "id": "1rcehkp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 9,
        "comments": 358,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rcehkp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1rd0mqe",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] Real Madrid vs Benfica, UCL Loser's round up",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1rd0mqe)",
        "upvotes": 31,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rd0mqe/prematch_thread_real_madrid_vs_benfica_ucl_losers/"
    },
    {
        "id": "1rdfitm",
        "author": "Bijay12356",
        "title": "OTD 8 years ago, Cristiano captained Real Madrid for the last time.He wore the armband 101 times for us.We never lost a single game in those matches.",
        "content": "",
        "upvotes": 530,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/flox1tuuwflg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rdfitm/otd_8_years_ago_cristiano_captained_real_madrid/"
    },
    {
        "id": "1rdhnmk",
        "author": "No-Independent2522",
        "title": "Kroos responding to the interview of Ancelotti recalling Kroos being mad when he subbed him.",
        "content": "Valdano: \"Has anything like what happened with Xabi and Vinícius ever happened to you?\"\n\nCarlo Ancelotti: \"Once I took Kroos out and he got mad. The next day I didn't talk to him. We ran into each other before going out onto the field. I asked him if we needed to talk and he told me it was over.\"…….",
        "upvotes": 348,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/018ms1cxcglg1.jpeg?auto=webp&amp;s=45db41d7a6259cf82dab3a43d36421f2fb53c196"
        },
        "permalink": "/r/realmadrid/comments/1rdhnmk/kroos_responding_to_the_interview_of_ancelotti/"
    },
    {
        "id": "1rdd6q8",
        "author": "twogk",
        "title": "What do you mean make a run? Attack the box? What is that?",
        "content": "I guess we'll find him dragging the defenders to his nearest ball holding teammate instead of making runs and creating chances, effectively limiting his options to do anything.\n\nOr worse, like this case, complain about a perfect chance not being turned into a back pass for him to dribble into a defender and lose the ball \n\nI repeat he may be a great goal scorer but thats all he has to offer and it's simply not enough, he isn't fit for this team Ancelotti knew it and that's why he asked for a true 9 in Kane. \n\nI mean, why does he offer that we didn't have before? Goals? We had Joselu ona fraction of everything Mbappe has and still delivered those regularly. \n\nCreating chances? Lol, lmfao even. \nBut anyway, we had Vini and Rodrygo handing those out like hot cakes. \n\nHis first touch is mediocre, his deibbling atrocious, his passing mediocre, his off the ball movement? Non-existent.\n\nMaybe Benzema raised the bar too high, but I expect the 9 that palys for Real Madrid to be perfect in all the above mentioned aspects. \n\nTwerked for 5 years  befor joining just to drag down the entire team's chemistry  and to do what? Bring 40 goals a season? I'd rather have Joselu and his 20+ goals (mind you, as a sub) and team's perfectly balanced than whatever this is.  Either he improves or hopefully gets sold. \n\nMind you I'm not saying he's the only culprit, but the other get plenty of criticism already, this dude got away for so long with his bs. First season was \"not judge to hastily\"  now for the most part, up until like 3 games ago  the scapegoat was Vinicius.  When will it be enough? \n\nDude ghost the entire game, we play in 10 v 11 for 80 min, the he scores a random goal (possibly a pen earned by someone else hard work, probably the aforementioned Vinicius) and almost everyone forgets he made Casper look like and amateur for the entirety of the match. ",
        "upvotes": 332,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eti22j3zbflg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rdd6q8/what_do_you_mean_make_a_run_attack_the_box_what/"
    },
    {
        "id": "1rdkhdj",
        "author": "Outrageous-Brain-395",
        "title": "Thinking about all the bench players during the Galácticos 2.0 era, which ones would be starters today?",
        "content": "I feel like Isco, James, Kovacic and Asensio would all be starters. Potentially even Morata. It’s kinda crazy how when you look back at it, so many good players were on the bench at the time simply because KCM and BBC were too good, and it seemed impossible to dislodge them. Bale was only dislodged by Isco because he couldn’t stay healthy but when all conditions were equalized, Bale was always usually starting.",
        "upvotes": 10,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdkhdj/thinking_about_all_the_bench_players_during_the/"
    },
    {
        "id": "1rco75j",
        "author": "Aggressive_Gate_1046",
        "title": "GOAT IS BACK ! ....🚨 BREAKING: Jude Bellingham is back training on the ball.",
        "content": "",
        "upvotes": 609,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hqus36nu6alg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rco75j/goat_is_back_breaking_jude_bellingham_is_back/"
    },
    {
        "id": "1rdj2su",
        "author": "Willing-Neck-7417",
        "title": "La Undécima! 2016 - Real Madrid vs Atletico Madrid 1-1 (pen 5-3)",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uLxGXA3ffnNUgZp1LQH_Byw-fDqfWxsb5Ylv-wwOPh0.jpeg?auto=webp&amp;s=351700cd21fc1dce15e3ed74b938f57e1766c9e6"
        },
        "permalink": "/r/realmadrid/comments/1rdj2su/la_undécima_2016_real_madrid_vs_atletico_madrid/"
    },
    {
        "id": "1rct356",
        "author": "7dek",
        "title": "OFFICIAL:UEFA inform Benfica that their complaint about Fede Valverde and Samuel Dahl situation has been dismissed. Valverde will be available for Real Madrid vs benfica on Wednesday",
        "content": "",
        "upvotes": 268,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rct356/officialuefa_inform_benfica_that_their_complaint/"
    },
    {
        "id": "1rdaxpv",
        "author": "cyrusmancub",
        "title": "Huijsen underwent new tests yesterday. The centre-back is showing positive signs but it's difficult he will be ready for the Benfica game.",
        "content": "",
        "upvotes": 28,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdaxpv/huijsen_underwent_new_tests_yesterday_the/"
    },
    {
        "id": "1rd0xh1",
        "author": "FergieBall_FC",
        "title": "Martin Samuel – The Times: It's not just Jose Mourinho — abuse of Vinicius Jr has been enabled at every level | Real Madrid star has been subjected to racism on several occasions in Spain — Mourinho's reaction to his allegations against Gianluca Prestianni is not the first of its kind",
        "content": "Full Writeup: **Martin Samuel – The Times: It's not just Jose Mourinho — abuse of Vinicius Jr has been enabled at every level | Real Madrid star has been subjected to racism on several occasions in Spain — Mourinho's reaction to his allegations against Gianluca Prestianni is not the first of its kind** \n\nWhy did José Mourinho feel entitled to speak that way about Vinícius Jr? He was enabled, as others have been before him. Enabled by Uefa, by the Spanish league, by tame local media, by all the figures in authority who, across many years, could have ended this, but did not. It’s not just about Mourinho, it’s about Javier Tebas; it’s not just about Benfica, it’s about Porto, too. What Vinícius claimed occurred last week at the Estádio da Luz has been going on for years; because those with power have allowed it to happen. \n\nIt would be easier to list the grounds in Spain where Vinícius hasn’t been racially abused, but here are a few where he has: Barcelona, Atletico Madrid, Valencia, Albacete, Real Mallorca, Real Valladolid, Real Sociedad, Getafe, Osasuna, Real Betis and Sevilla. Since 2021, La Liga has logged 26 different racist incidents involving Vinícius at 11 distinct stadiums. Sometimes the trouble is brought to his home. In January 2023, a dummy dressed as the player was found hanging from a bridge near Real Madrid’s training ground. Four Atletico fans received suspended prison sentences for this affront, more than two years later. \n\nYet the year Vinícius was hung in effigy was also the year Tebas, the La Liga president, was forced to apologise for his reaction to the player’s threat to leave the field at the Mestalla, after being subjected to monkey chants by Valencia fans. When Vinícius said it was a problem he was encountering across Spain, Tebas went on the defensive. “Before you criticise and insult La Liga, you need to inform yourself well, Vini Jr. Don’t let yourself be manipulated,” he posted on social media, his instinct being to protect the brand. “I think that the message, and the intention I had, was not understood by a significant number,” he later clarified. “If I hurt someone, if they thought I was racist, it’s far from reality.” \n\nWhat is reality, however, is that Mourinho’s reaction, in which he sought to blame Vinícius’s goal celebration for what may have been a ­racist tirade from one of his Benfica players — Kylian Mbappé alleges that he heard Gianluca Prestianni use the word “monkey” towards Vinícius five times — is not the first of its kind. In 2022, Pedro Bravo, the president of Spain’s association of football agents, went even further. “You have to respect your rivals,” he told the television show *El Chiringuito*. “If you want to dance samba, go to a sambodromo in Brazil. Here you have to respect your colleagues, and stop acting like a monkey.” Not a fool, not a clown; a monkey. You know what Freud would say about that dismal serving of word association? Naturally, a clarification followed. “It always ends with an apology and ‘I was misinterpreted,’ ” Vinícius commented, ruefully. \n\nYet this isn’t his problem alone. While Vinícius attracts a disproportionate number of racist incidents compared to other black players, he is not the first to struggle to get his case heard. In March 2024, the Spanish third-tier team Rayo Majadahonda walked off during a game with Sestao River, in protest that their goalkeeper was being racially abused. The Spanish federation punished the accusers, not the abusers, with a 3-0 defeat, a three-point deduction and a €3,000 fine. Later that year, Christantus Uche, a Nigerian playing for Getafe at the time, gave an interview complaining about racism. “He doesn’t understand, he can’t say that,” the Getafe president, Ángel Torres, said. “When he has been here for one or two years and understands Spanish, he can say whatever he wants.” Uche decided not to test this and signed for Crystal Palace. \n\nWind back to 2011-12, the season Manchester City made their first appearance in the modern Champions League. Knocked out at the group stage and dropped to the Europa League, they drew Porto. City were new to this. During the match, their executives thought they heard an ugly sound. It seemed to erupt every time Mario Balotelli or Yaya Touré were on the ball. Fearing inexperience in the European game, and not wishing to offend their hosts, they first checked with the travelling press pack that the noise was what they thought it was. The press, then Balotelli, confirmed it. City complained to Uefa, whose match representatives were uninterested, and their hosts were indeed offended. Porto’s executives behaved as if City were just troublemaking newcomers unused to the big stage. Ultimately, Porto were fined a paltry £16,000 by Uefa. In the next round, City were a minute late back onto the pitch against Sporting Lisbon and fined £24,000. \n\nEuropean football is littered with instances like that. Messengers shot, complainants ridiculed. It was always the English press who were accused of stirring controversy by asking awkward questions after matches. It happened in Bulgaria in 2019. A local cameraman told the England manager Gareth Southgate to f\\*\\*\\* off as he left the room, having fielded questions about racist chanting during a European Championship qualifier. Bulgarian journalists laughed when the subject was raised. Thankfully, there is now a Uefa protocol around racist incidents and at least it was applied last week in Lisbon. But Vinícius may have to line up against Prestianni again on Wednesday because Uefa investigations move about as fast as law enforcement officers investigating brutalised protesters on the streets of Minneapolis. \n\nAnd media are culpable, too. It was May 2023 when Vinícius confronted fans at Valencia, accusing them of calling him a monkey. A case went to court in October that year and Vinícius gave evidence. After misreporting of his words, Valencia insisted he apologised. The local newspaper, Superdeporte, produced a front page with his picture and a long, superimposed, nose. “PINOCHIUS”, read the headline. Soon after the trial, Vinícius again excelled in a Champions League match against Sporting Braga, all sparkle and step-overs. “It’s not racism, he deserves a slap for being a clown,” Miquel Camps, a Barcelona board member, posted on social media. \n\nNobody should think tackling racism is easy. Liam Rosenior, Chelsea’s head coach, was asked about the Vinícius incident and its fallout, and said that any coach or player found guilty of racism “shouldn’t be in the game”. This was interpreted as a call for a life ban on Prestianni if the accusations were proven. Yet proven to what level? In football, a balance of probabilities is often enough to get a guilty verdict. But can, or should, a career be ended on that? John Terry was found guilty of racially abusing Anton Ferdinand this way, but the same case in Westminster magistrates’ court ended in acquittal. Might that happen to Prestianni with need for a greater burden of proof? He covered his mouth with his shirt so couldn’t be lip-read, and Benfica claim Mbappé was too far away to have heard what was said. Uefa may be able to rule given the balance of probability but, if the penalty was a life ban, would surely need to meet more exacting standards. Any hearing could then just deteriorate into he said, she said, with no verdict at the end. The higher the penalty, the more concrete the proof required. \n\nWhat is undeniable, however, is that Vinícius and others like him have been poorly served. Mourinho spoke as he did because he knew he could; because others had done so before him and got away with it. We may never know what Prestianni uttered beneath the protection of his collar. We can presume, however, that it may hardly be worse than what is often permitted to occur around Vinícius, very much in plain sight. ",
        "upvotes": 92,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rd0xh1/martin_samuel_the_times_its_not_just_jose/"
    },
    {
        "id": "1rcg9ub",
        "author": "Messmers",
        "title": "Mbappe mad at Guler taking corner instead of passing to him",
        "content": "",
        "upvotes": 633,
        "comments": 151,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f5anbbj6o8lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rcg9ub/mbappe_mad_at_guler_taking_corner_instead_of/"
    },
    {
        "id": "1rciiia",
        "author": "o6ohunter",
        "title": "This video critiquing Mbappè’s positioning vs Osasuna",
        "content": "",
        "upvotes": 419,
        "comments": 136,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u6x9029j59lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rciiia/this_video_critiquing_mbappès_positioning_vs/"
    },
    {
        "id": "1rcixlw",
        "author": "IWantAnOreoShake",
        "title": "Prestianni Provisionally Suspended by UEFA",
        "content": "Statement by UEFA:\n\n**Provisional suspension of SL Benfica player Gianluca Prestianni**\n\nFollowing the appointment of a UEFA Ethics and Disciplinary Inspector (EDI) to investigate allegations of discriminatory behaviour during the UEFA Champions League 2025/2026 Knock-out Play-off match between SL Benfica and Real Madrid CF on 17 February 2026, and upon request of the EDI with an interim report, the UEFA Control, Ethics and Disciplinary Body (CEDB) today decided to provisionally suspend Mr. Gianluca Prestianni for the next (1) UEFA club competition match for which he would otherwise be eligible for the prima facie violation of Article 14 of the UEFA Disciplinary Regulations (DR) related to a discriminatory behaviour.\n\nThis is without prejudice to any ruling that the UEFA disciplinary bodies may subsequently make following the conclusion of the ongoing investigation and its respective submission to the UEFA disciplinary bodies.\n\nFurther information about this matter will be made available in due course.\n\nLink - [https://disciplinary.uefa.com/02a2-1ffea06e0006-61224c1efc56-1000/](https://disciplinary.uefa.com/02a2-1ffea06e0006-61224c1efc56-1000/)",
        "upvotes": 315,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/isO-Ibr-yBworPuviSUpNqpV0r7b4qz3iN_RWY0P5W8.jpeg?auto=webp&amp;s=eb358dee38ac8ed1327c1d3c7cb782be9c0ce23d"
        },
        "permalink": "/r/realmadrid/comments/1rcixlw/prestianni_provisionally_suspended_by_uefa/"
    },
    {
        "id": "1rcybz6",
        "author": "Small_Citron_6506",
        "title": "Folks - Score Prediction for Tomorrow?",
        "content": "Honeslty - I am a bit nervous. I have this feeling that we might face an upset of sorts and can be dumped out of the Champions league. Highly unlikely but I don't why, I have this dreadful feeling.\n\nI hope we give Benfica a thrashing and make them pay for all that abusive racism that Vini faced in the last leg.",
        "upvotes": 23,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rcybz6/folks_score_prediction_for_tomorrow/"
    },
    {
        "id": "1rcfwv5",
        "author": "7dek",
        "title": "Define obsession: Here you go 🤮",
        "content": "",
        "upvotes": 174,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/717src1xk8lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rcfwv5/define_obsession_here_you_go/"
    },
    {
        "id": "1rbwlc8",
        "author": "Resident-Stretch9723",
        "title": "Ronaldo vs Osasuna | 2012",
        "content": "",
        "upvotes": 1454,
        "comments": 100,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hzozw72ou3lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbwlc8/ronaldo_vs_osasuna_2012/"
    },
    {
        "id": "1rcnm37",
        "author": "lafabricarealmadrid",
        "title": "Where can I find the Castilla matches (previous, 25/26 season) fot free?",
        "content": "how can I watch the replays/ full match of Real madrid castilla of 2025/26 season? give me some free sources, please, except the matches on YouTube. I am actually looking for the first 20 matches of this season. (tjough there are 4/5) matches are on Youtube. If anyone have some links, please help.\n\nhow can I watch the replays/ full match of Real madrid castilla of 2025/26 season? give me some free sources, please, except the matches on YouTube. I am actually looking for the first 20 matches of this season. (tjough there are 4/5) matches are on Youtube. If anyone have some links, please help.",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rcnm37/where_can_i_find_the_castilla_matches_previous/"
    },
    {
        "id": "1rblun3",
        "author": "7dek",
        "title": "Vini was seen telling Mbappé to make more runs into the box yesterday against Osasuna",
        "content": "",
        "upvotes": 1102,
        "comments": 152,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/98amag7ls1lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rblun3/vini_was_seen_telling_mbappé_to_make_more_runs/"
    },
    {
        "id": "1rbmipx",
        "author": "7dek",
        "title": "Vini after dribbling past the opposition's rb then looking up to see. Mbappé 40 yards away in the midfield chilling with tchouaméni:",
        "content": "",
        "upvotes": 982,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3wafbnf0y1lg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbmipx/vini_after_dribbling_past_the_oppositions_rb_then/"
    },
    {
        "id": "1rbqez7",
        "author": "AgeKay93",
        "title": "Blame the midfield all you want, this is the main reason this team is unable to perform.",
        "content": "",
        "upvotes": 484,
        "comments": 156,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n3s068haq2lg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbqez7/blame_the_midfield_all_you_want_this_is_the_main/"
    },
    {
        "id": "1rbp2h9",
        "author": "No-Independent2522",
        "title": "Interviewer to Carlo : Has anything like what happened with Xabi and Vini ever happened to you?",
        "content": "Ancelotti in a latest interview : “Once I took Kroos out and he got angry. The next day I didn’t speak to him. We ran into each other before going out onto the field. I asked him, do we talk about what happened yesterday or is it over? And he said, it’s over.”\n\n………………………………………………………………………………………………………………",
        "upvotes": 392,
        "comments": 111,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tzeyg2v1h2lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbp2h9/interviewer_to_carlo_has_anything_like_what/"
    },
    {
        "id": "1rbnegs",
        "author": "Messmers",
        "title": "This isn't normal anymore, why is he all the way there? We desperately need box presence (esp now that Jude is out) and he insist on being anywhere BUT the box",
        "content": "",
        "upvotes": 388,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2smieo1r42lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbnegs/this_isnt_normal_anymore_why_is_he_all_the_way/"
    },
    {
        "id": "1rbhyf0",
        "author": "MrFreedom133",
        "title": "Does Mbappe lacks this type of movements and awareness ?",
        "content": "",
        "upvotes": 675,
        "comments": 131,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zsvfwlllq0lg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbhyf0/does_mbappe_lacks_this_type_of_movements_and/"
    },
    {
        "id": "1rbu1l7",
        "author": "Bijay12356",
        "title": "Last Season Madrid vs This Season Madrid",
        "content": "Real Madrid this season so far:\n\n- 38 games\n- 27 wins\n- 8 losses \n- 3 draws\n\nReal Madrid at this time last season:\n\n- 42 games\n- 29 wins\n- 7 losses\n- 6 draws\n\nCarlo had Lucas at RB. Everybody knows that time defense was much worse than this time. If we had had some luck on our side last season, then we could have won the CDR. We disrespected our greatest coach so much last season 🥲🥲",
        "upvotes": 131,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zahsyg4ee3lg1.jpeg?auto=webp&amp;s=d350f50e09eb890db248899bb9ad64f83987599c"
        },
        "permalink": "/r/realmadrid/comments/1rbu1l7/last_season_madrid_vs_this_season_madrid/"
    },
    {
        "id": "1rbs118",
        "author": "Kavazou77",
        "title": "I think it’s a good time to re emphasize what this club is and how despite all, talent has always won out through rough patches",
        "content": "It seems this season has had an uptick in fans trickling in and flooding the sub with very reactionary, and agenda-driven posts. \n\nIt’s normal that with social media and Madrid having some of the most recognizable names on the planet in their squad, the 2023 UCL run would have brought a massive increase in supporters. I’ve seen many of the OP’s here have relatively new accounts or just be younger in general. \n\nI point this out because I think to any fan that’s been following this team a while, you’ll know that this is yet another cycle, during another era, in Madrid history. The story of this club keeps repeating itself because of how it’s run and it’s what’s made it the best sports club to ever exist. \n\nI am not diminishing or gatekeeping any fans’ attachment and loyalty to the club, new or old. I’d just like to put into perspective for some who are new or who have forgotten what this club is and always will be.\n\nThis club will: \n\n\\- Always have the best or most marketable player on the planet, despite having other positional needs.\n\n\\- Go through 10 managers before they question if any stars are the problem. \n\n\\- Always build a squad around talent rather than system. \n\n\\- Never have a manager bigger than its stars. \n\n\\- Never spend money in the winter.\n\n\\- Never prioritize homegrown talent. \n\nThese are the basics that have been true since the 90s. If you are okay with this, then this is the club for you. \n\nAs an aside…I suggest that before a reactionary post is made, you look up the history of the Zidane, R9, Beckham era. A lot of y’all wouldn’t have survived that era. ",
        "upvotes": 100,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbs118/i_think_its_a_good_time_to_re_emphasize_what_this/"
    },
    {
        "id": "1rc4gkc",
        "author": "Galego_ACB",
        "title": "[Basketball] Real Madrid lost against Baskonia (89-100) in Copa del Rey final",
        "content": "",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rc4gkc/basketball_real_madrid_lost_against_baskonia/"
    },
    {
        "id": "1rbpcma",
        "author": "asensia-kopfschmerz",
        "title": "Out of possession stats: Xabi Alonso vs Arbeloa",
        "content": "",
        "upvotes": 51,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hm9z9x41j2lg1.jpeg?auto=webp&amp;s=7938aa579695008722bf716e21ae3e49e225e83f"
        },
        "permalink": "/r/realmadrid/comments/1rbpcma/out_of_possession_stats_xabi_alonso_vs_arbeloa/"
    },
    {
        "id": "1rbljlc",
        "author": "cyrusmancub",
        "title": "Dani Ceballos suffered an injury against Osasuna and will be out for 7 weeks",
        "content": "",
        "upvotes": 80,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbljlc/dani_ceballos_suffered_an_injury_against_osasuna/"
    },
    {
        "id": "1rb322h",
        "author": "Usorojnr",
        "title": "This is completely unacceptable",
        "content": "It’s like beating a dead horse at this point, but we can’t win things with this kind of attitude. The first line of defence are the forwards. These are the basics in 2026, how long are we going to keep having these discussions? \n\nIt’s funny if all our players can just do the basics efficiently we’d be able to win most games. It’s a shame a team of this quality is underperforming because of an attitude problem. ",
        "upvotes": 1217,
        "comments": 183,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6woowyzd1xkg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rb322h/this_is_completely_unacceptable/"
    }
]