[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 624,
        "comments": 4789,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nh8v1b",
        "author": "indiewire",
        "title": "Owen Cooper Wins Emmy for 2025 Best Supporting Actor",
        "content": "",
        "upvotes": 186,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8v1b/owen_cooper_wins_emmy_for_2025_best_supporting/"
    },
    {
        "id": "1ngxqjc",
        "author": "CultOfCurtis1",
        "title": "Love Con Revenge is honestly the most amateur, misleading, defamatory, insulting to our intelligence \"documentary\" I've ever watched.",
        "content": "I honestly don't know where to start with this. The primary host is presented as some expert — even speaking about psychology she clearly has no understanding of — when in reality she's just someone who fell for a scam. The private investigator? She doesn't seem to understand the law at all, calls up people and says *\"I'm investigating this person\"* with zero clue if the recipient of the call is friends with the target (which could expose her), and tails cars by following them in U-turns, parking lots, etc while wondering \"Do you think he spotted us?\"\n\nSeveral guys on the show are clearly unpredictable criminals. Which also makes it nuts that they're taking these women to confront them face to face when they should be calling the police. They tracked a guy who was a fugitive from justice, and instead of calling the cops, they went to yell at him (tipping their hand and potentially giving the target time to flee). Even worse? It's the misleading crap and leaving information out. \n\nThroughout the series, the show presents claims that are in no way verified. It's like they took *every* \"case\" that came their way, and when stuff started to look sus, they kept going and just left out info. For instance, [another Redditor](https://www.reddit.com/r/netflix/s/tymYcHrKzg) looked up the clinic from the Dr. Wilkerson episode and discovered that the victim was *heavily* involved in the practice — with many of the complaints over the years specifically mentioning her behavior. \n\nAnd while we're on that episode, the \"victim\" dropped her civil suit? And she's facing charges for filing a false police report? And even though there's a claim that the guy opened fake accounts in the daughter's name (a clear crime that would result in arrest), there's been no charges filed? And Netflix didn't feel like showing us evidence of those alleged fraudulent accounts? Even worse, the \"after story\" text at the end of the episode was up for mere seconds. I'm not into conspiracies, but it's almost like they *didn't want us* to read the additional info that cast doubt onto the entire story. \n\nLeading up to the Dr Wilkerson episode, I was already a little irked by the show. Even when it was established that there was no evidence of crimes, the hosts would say things like \"At least he's been exposed.\" Been exposed about what? That an ex partner is saying negative stuff about them? Stuff you completely didn't prove, not even enough to support a civil lawsuit (which isn't a high evidentiary standard)?\n\nBut yeah, the episode with the doctor is going to be it for me. By marrying his \"victim,\" he ensured that any debt would be his responsibility too. Great con artist, right? The episode clearly left out all information that showed the \"victim\" might be lying. And while earlier episodes *clearly* showcased real con artists, the way in which they were handled was dangerous, amateur, and is very likely to result in defamation lawsuits against Netflix. \n\nThis show idea was great, but the execution is absolutely pathetic. Did these two ladies just go out filming stuff on their own and then show up to Netflix like, *\"You should show this\"*? The \"private investigator\" is essentially using Google and hiring others to find info for her, and Cecilie Fjellhøy's only place in the show should be in a \"this is what happened to me\" role rather than speaking as if she's a subject matter expert (she's clearly not). Even worse, they're pushing unverified claims that will ruin people even if they end up not being true. \n\nAnd by the way, repeatedly badmouthing the police *is not* a smart way to ensure the police keep discussing cases with you in future seasons. This is worse than amateur hour. It's amateurs manufacturing anger for ratings — because they know a large portion of folks won't care about pesky little things like a lack of facts while treating real scam incidents and jilted ex scenarios as if they're equivalent. \n\nNetflix, do better. ",
        "upvotes": 229,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ngxqjc/love_con_revenge_is_honestly_the_most_amateur/"
    },
    {
        "id": "1ngvjx4",
        "author": "McKenna1981",
        "title": "Cancellations",
        "content": "When is netflix going to realise they're a streaming platform.  \n\nThis means new shows will not attract viewers the instant they drop, because they're already busy binging other shows.\n\nSo they need to stop cancelling new shows within weeks of their first season appearing.\n\nGetting very annoyed with netflix lately.  Rant over.",
        "upvotes": 164,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ngvjx4/cancellations/"
    },
    {
        "id": "1nh8alw",
        "author": "Relevant_Beyond_5058",
        "title": "Kidfluencing and Piper Rockelle promoted again",
        "content": "Ok I know this has been discussed, but I just watched this documentary and have the same reaction as everyone else.  I had never heard of her but I've witnessed grooming.  But everything online is from April.  So I did a search just in the past month and lo and behold!  Here's teen vogue making her whole life just cool superstardom, and oh by the way concerns about child exploitation are just haters hurting her feelings.  Oh and look praising turning 18 so you can look sexualized on camera and it not illegal!  After that whole documentary, pop culture is continuing to tell little girls to look up to this. It's not just the government turning a blind eye on Piper's situation, this type of media is trying to spread it to other girls.\n\n[https://www.teenvogue.com/story/piper-rockelle-profile](https://www.teenvogue.com/story/piper-rockelle-profile)",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8alw/kidfluencing_and_piper_rockelle_promoted_again/"
    },
    {
        "id": "1nha26l",
        "author": "Ok_Independent5571",
        "title": "A light hearted not so long show to binge?",
        "content": "Ive seen a LOT of shows ok? But currently I'm not in the mood at all to watch a breaking bad type. \nOr better call saul. But it doesn't have to be that light hearted, as long as it has good writing, and not traumatizing like baby reindeer or Orange is the new black then I'll take it.\n\nShows I've seen: \nThe good place (I want something like this, even tho it was 4 seasons, it was so well written and i loved the lightness of it.) \n\nArcane (loved the animation, and the writing, season 2 sorta flopped but its ok) \n\nBojack horseman (😭😭😭i fucking love this show) \n\nAvatar the last Airbender (i would sell a kidney to experience it for the first time again) \n\nQueens gambit (10/10) \n\nMaid (😭👍🏻) \n\nThe last kingdom (AMAZING) \n\nCrazy ex girlfriend (it was insane that i randomly found this show and it became my FAV SHOW ever.) \n\nBlack mirror (i loved the way the episodes made me think. One of my favs, perfect level of disturbing)\n\nDark (🥀🤧✨️) \n\nbridgerton (its good... but a bit cringe, not the most amazing writing, QUEEN CHARLOTTE however was amaziinggg) \n\nWednesday (kinda felt like it wasted my time) \n\nBlue eye samurai (loved it) \n\nDerry girls (😍) \n\nBaby reindeer (it was rlh good..., it was so triggering😰) \n\nHeartstopper (THIS SHIT IS ADORABLE UGH idc if its not the most amazing wtiting, the characters chemistry is adorable)\n\nBEEF (it was good....) \n\nOrange is the new black (its a good show but i 100% regret watching it. It was way too dark for me. I still get flashbacks to it like it was traumatizing)\n\nMO (haha funny) \n\n\nSex education (fun, later seasons a bit ass) \nThe end of the fucking world (loved it) \n\nOne day (😐) \n\nYou (i have no idea how to feel about this show. I wouldn't recommend it to ppl but i wouldn't call it a waste of time) \n\nDead to me (i liked it.., cliche but still..) \n\nSquid games (darn)\n\n\n\n\n",
        "upvotes": 4,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1nha26l/a_light_hearted_not_so_long_show_to_binge/"
    },
    {
        "id": "1nh3gw5",
        "author": "Creative_Contract_17",
        "title": "Unknown person’s card on our Netflix account twice in two months.",
        "content": "Good day all. I’m looking for some advice. \n\nBack in June we lost access to our Netflix account and we found out that someone had hijiacked our account. \n\nWe changed the email to our account and password and apparently the next month someone gained access to our account again and added a credit card that was not ours. That card was charged for service in July and August. This month we had a notice to update our card because it was being declined. When we checked before updating it we found that the card was not ours. We were never notified that any changes had happened to our account either time. \n\nWe called Netflix who offered that we could again change our email and password as a fix again but offered no insight into how this happened again nor how they can guarantee that it will not happen again or if our own information was secure. \n\nThe first email was mine, the second was my husbands and has never been compromised nor have we ever shared our Netflix account info with anyone or used it anywhere but our home. We have no issues with any other service that we use. \n\nWe are looking to get answers for our privacy concerns as the customer service representative was unable to provide any other info or a pathway to figure out what happened. Twice in 2 months is concerning. \n\nUntil our concerns are addressed we have canceled our account. \n\nCan anyone provide somewhere for us to get some answers or file a formal complaint regarding the lack of security at Netflix? \n\nThank you in advance.  ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nh3gw5/unknown_persons_card_on_our_netflix_account_twice/"
    },
    {
        "id": "1ngbunt",
        "author": "Lonely_College2451",
        "title": "Breaking Bad, yay or nay? Bingeable or no?",
        "content": "I'm about to start Breaking Bad for no reason other than that I've heard it's good. \n\nI avoided it I think because my dad raves about it and y'know, when you're a teen and your dad starts raving about something, you're like ew I don't wanna watch that! Well now that I'm older, and I also have a better relationship with my dad, I've learned that I'm allowed to watch/listen to/read the same things he does and like it and it doesn't have to mean anything. \n\nI'm biting the bullet. I saw a reel the other day on Instagram with some dude from the show, played by Giancarlo Esposito, walking out of a room with HALF HIS FACE GONE??? And I was like DAMN! Apparently he knocks his role out of the park and I do love the guy. \n\nSo, am I in trouble? Is it really a great show? Will I find myself sucked in? Be honest lol I wanna know how bad I'm about to fixate on this shit. I wanna know how dynamic and bingeable it is. ",
        "upvotes": 288,
        "comments": 537,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbunt/breaking_bad_yay_or_nay_bingeable_or_no/"
    },
    {
        "id": "1nh5zwb",
        "author": "Safe-Inevitable2218",
        "title": "What is your Netflix series recommendation?",
        "content": "What’s your must-watch show or movie on Netflix?  \nShare your top recommendations and see what everyone else is loving.  \nWhether you’re looking for your next binge or want to suggest a hidden gem, this is the place to find (and share) the best of Netflix!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nh5zwb/what_is_your_netflix_series_recommendation/"
    },
    {
        "id": "1nhbj7d",
        "author": "New-Marketing2863",
        "title": "\"Adolescência...",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhbj7d/adolescência/"
    },
    {
        "id": "1ngyqrg",
        "author": "SpecialistReality907",
        "title": "Beauty In Black Sylvie",
        "content": "This girl was pissing me off so much during season two 😭😭 Apparently she’s 18 but to me she acts like a literal child when she’s supposed to go to college. Don’t get me started on the Glen situation either I mean you just met the dude and you already were doing the act? 😭 Angel was gone for two seconds. I don’t even blame rain but she shouldn’t have pushed him off that balcony. I don’t know if it was just me but the way she was portraying her character and was speaking gave 10 year old vibes idk.",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ngyqrg/beauty_in_black_sylvie/"
    },
    {
        "id": "1nh6n6n",
        "author": "Ill-Rise841",
        "title": "Beauty and the Bester Soundtrack",
        "content": "Beauty and the Bester documentary telling the story of Thabo Bester and Dr Nandipha Magdumana was just released, and I just finished watching it. I have actually been unable to get this one song out of my head. They have used it at the start of all the three episodes. I tried to Shazam it thrice, checked all the production credits, Spotify, couldn't find the artist or the song anywhere.\n\nCan someone please help me find it?\nIt starts like this -\n\n\"If they sayyyy, our love is criminal...\"\n\nIf you can find this song, I'd be grateful!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nh6n6n/beauty_and_the_bester_soundtrack/"
    },
    {
        "id": "1ngvq9r",
        "author": "cd69iskandn",
        "title": "Help",
        "content": "I truly feel like I have seen all of the best shows. There are on Netflix. I have seen shameless, breaking bad, the hunting wives, the OA, Ginny and Georgia, Wednesday, Ozark &amp; more that I can’t think of off the top of my head. I’m looking for suggestions I need something that’s Bingeable and keeps my interest! I’m finishing up with four seasons right now and I’ve enjoyed it not as much as the others listed though. ",
        "upvotes": 4,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ngvq9r/help/"
    },
    {
        "id": "1nfww65",
        "author": "Haunting_Tie_589",
        "title": "Are you actually joking?",
        "content": "How DARE they? Like ads aren't bad enough now they block some shows and films unless you go and free?\n\nI am genuinely so angry about this.\n\nWhat do you guys think???",
        "upvotes": 427,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1nfww65/are_you_actually_joking/"
    },
    {
        "id": "1ngkfj4",
        "author": "Aware_Ad_1647",
        "title": "Anyone else planning to boycott the next Jake Paul fight?",
        "content": "They got me good with the Mike Tyson fight, saying all claims of it being rigged were illogical when there is clear footage of Mike Tyson pulling punches. I am for sure not watching anything else with that clown Paul. On top of that, the boxing matches last night had audio issues all night long. Fool me once Netflix....",
        "upvotes": 14,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ngkfj4/anyone_else_planning_to_boycott_the_next_jake/"
    },
    {
        "id": "1nh0q6x",
        "author": "KojiKumi",
        "title": "Unwanted Marketing Emails",
        "content": "Does Netflix send you guys unwanted emails you can't unsubscribe from? I recently started getting ads for fights that I'm not interested in sent to my email. I tried to unsubscribe but there was no button. Also, my settings show that I have all unnecessary emails turned off.  I am very deliberate with the services I sign up for with my email addresses and I will probably have all Netflix emails sent to my spam folder via rules. But I was just wondering if it is a me thing or if others were getting these emails as well.\n\nhttps://preview.redd.it/5qgcm1npo6pf1.png?width=631&amp;format=png&amp;auto=webp&amp;s=dcb40b334c8ad3aa25f2a023629ac97c8c956b30\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nh0q6x/unwanted_marketing_emails/"
    },
    {
        "id": "1nh05mk",
        "author": "DesertCentipede12",
        "title": "Which Show are you most Excited for on September 19th; Haunted Hotel or Knights of Guinevere?",
        "content": "There are these two animated shows that both come out on September 19th. They both seem really popular and I was wondering which show are you most excited to watch.\n\nWill you be watching...\n\n**Haunted Hotel**  \nOr  \n**Knights of Guinevere**\n\n  \nComment Down below",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nh05mk/which_show_are_you_most_excited_for_on_september/"
    },
    {
        "id": "1ngzpw0",
        "author": "Lulu_Mania",
        "title": "Shows with a Walter White style transformation?",
        "content": "Hi everyone, I loved how Breaking Bad evolves and how Walter White’s personality transforms.\nCan you recommend other shows where either a main character or the show’s overall style changes drastically over time?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ngzpw0/shows_with_a_walter_white_style_transformation/"
    },
    {
        "id": "1ngz4k0",
        "author": "Unfair-Mousse4183",
        "title": "IOS 26 screen resizing for netflix",
        "content": "Does anyone know if (or can test tomorrrow with IOS 26 with an ipad) if netflix can be resized in a screen and will carry on playing e.g. netflix on the left, chrome or safari on the right?   Trying to decide on buying an iPad right now. TIA.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ngz4k0/ios_26_screen_resizing_for_netflix/"
    },
    {
        "id": "1nhasi9",
        "author": "SneakyFire23",
        "title": "The AI dubbing is just painful",
        "content": "I was watching a legal Kdrama today \"Beyond the Bar\" and the AI dubbing is just brutal to listen to, I'm not sure who thought this was a good idea, but it effectively destroys what seems to be a pretty decent show. \n\nThe inflection is flat, everything sounds artificial, and it's just difficult to enjoy. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nhasi9/the_ai_dubbing_is_just_painful/"
    },
    {
        "id": "1nhbr7o",
        "author": "Lopsided-Plenty-7866",
        "title": "Forced Hate on Meena",
        "content": "One thing I never understood is the hate towards Meena from sing like some of y’all were just over the top and that’s an understatement. She’s literally a good singer she just needed confidence in the first movie. And honestly there was no absolute reason to hate on Meena at all.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nhbr7o/forced_hate_on_meena/"
    },
    {
        "id": "1ngs6ec",
        "author": "407ThroatChamp",
        "title": "Random Freezing",
        "content": "Hey! Does anybody else experience random freezing while watching programs? I was JUST watching Brett Favre documentary and it froze, then completely went back to my main home screen on my roku tv. This has been happening for over a year. I've deleted and re-installed the app multiple times. And this action only happens when watching a program on netflix. Hulu, paramount, peacock, prime are all working just fine.\n\n  \nUpdate: I was speaking with customer service via chat. The rep asked for my entire card number to verify my account. Before proceeding, I looked on reddit to see if this was legit and per some convos, it seemed to be. After confirming, the chat ended with the rep stating she sent a password reset link.....I never told her I needed my password reset. I told her I was having an issue with the netflix app freezing. Starting to think I just got scammed.....",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngs6ec/random_freezing/"
    },
    {
        "id": "1nglgnf",
        "author": "EfficiencyHonest9381",
        "title": "Do you like Squid Game or Alice in Borderland more?",
        "content": "The third and final season of Alice in Borderland is just right around the corner. Been seeing an influx of people on YouTube reacting to the show. Squid Game, too, had just recently wrapped up and with a controversial finale at that. \n\nAnyway, I had just finished watching a reactor saying that Squid Game was \"way better produced\" and had \"way better casting\" than AiB. *To each their own* of course, but I guess I was a bit taken aback by this comment since I personally felt like AiB actually took the notch of the survival show genre higher. This is not to say that Squid Game was bad or anything. I also liked Squid Game, especially the first season. In fact, I think that Squid Game had more of a social commentary than AiB. It's just that when it comes to the games and overall premise, I'm definitely more biased towards AiB. \n\nBTW not saying that people should like AiB more than SG. I could see why some people would like SG over AiB. It's just my personal bias when I say that Squid Game is not in any way \"waaaay better\" than AiB. They might be equally good, but SG is definitely not far off better than AiB imo.\n\nFor those who have watched both, which one do you like better?",
        "upvotes": 6,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1nglgnf/do_you_like_squid_game_or_alice_in_borderland_more/"
    },
    {
        "id": "1nghavv",
        "author": "Historical-Phrase106",
        "title": "Stand By Me rewatch",
        "content": "I’m rewatching Stand By Me… an iconic film in my opinion… \nThere is a scene where Chris (River Phoenix) tells Gordy (Wil Wheaton) about starting junior high and basically trying to get across to Gordy how intelligent he is… and how middle school will be different than grammar school and it will distance them because Gordy will meet smart guys, unlike the “shop guys” like Chris, Vern and Teddy… \nAnyway… it really reminded me of the scene in Good Will Hunting where Ben Affleck tells Matt Damon that he will kill him if he wastes his intelligence and ends up being a laborer like the rest of them.\nAnyway… I absolutely love both movies… \nClearly, Stand By Me preceded Good Will Hunting so perhaps it was a homage to Stand By Me. ",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nghavv/stand_by_me_rewatch/"
    },
    {
        "id": "1ngxag2",
        "author": "Unhappy_Exchange_875",
        "title": "Film/serie tv simili a Stranger Things",
        "content": "Salve a tutti, sono nuova su questa community, volevo chiedervi se per favore potreste dirmi il nome di alcuni film o serie Netflix che sono simili a Stranger Things, è la mia serie preferita in assoluto e finora non ho mai trovato qualcosa che possa somigliarle, alcuni mi hanno consigliato DARK, gli somiglia come dicono? Ne vale la pena oppure no? Ho già visto i Goonies e mi sono piaciuti molto. Però cercavo qualcos’altro. Soprattutto adesso che sto facendo il Rewatch in vista dell’uscita della quinta stagione il 27 novembre. Vi ringrazio intanto a tutti per l’aiuto in anticipo.                                      ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ngxag2/filmserie_tv_simili_a_stranger_things/"
    },
    {
        "id": "1ngd85i",
        "author": "Crackiller1733",
        "title": "Has Netflix not learned from the Tyson/Paul fight ?",
        "content": "Netflix not loading . Is it too many users trying to watch the fight? Like come on this is getting ridiculous. Trying to watch this fight and can’t load. Anyone else having issues?",
        "upvotes": 22,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ngd85i/has_netflix_not_learned_from_the_tysonpaul_fight/"
    },
    {
        "id": "1nh94nc",
        "author": "a_san_38",
        "title": "Emmys 2025 Full Winners List - Who Were The Biggest Snubs?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nh94nc/emmys_2025_full_winners_list_who_were_the_biggest/"
    },
    {
        "id": "1ngk9ba",
        "author": "OfflineBot5336",
        "title": "movie recommendation system",
        "content": "hi, i just wanted to watch some movie/series on netflix but did not find any that catches me. but that's not the reason i post here.   \nwhile looking out for new stuff i kinda got the feeling that a few movies go recommended me much more often on the same page. like one movie about 3 to 4 times? i felt like that's too much. if i don't click on it the first time i wont click on it the second or third time when showing up. this somehow got me look more into it.\n\ni counted them on the page. just the movies that were visible without using the arrows on the right to find more of that genre which resulted in about 100-120 movies/series on average (i counted multiple times). and about 10% of them were duplicates. so every 10th movie got already recommended.   \nafter counting again but with all movies withing a genre/row i got an average of 380 movies/series and from 25-33% duplicates. every third movie was already recommended twice. on average i got about 2-3 movies 4 times on the page. 9 different movies 3 times on the page. on my latest scan i got 35+ movies that showed up 2 times.  \ni always count one page. that means only the movies page, series page, starting page, ...  \none thing i found is that the worst stats were on the series page. the 33% of duplicates were from the series page. the movies page \"only\" went up to 25% at its peak. the starting page was pretty much the average from the series and movie page which should be expected (was at least for me). \n\nthis took me about an evening to figure out and im pretty sure my method is not optimal but i did not expect it to be that bad. like some movies being recommended twice is ok but a fourth of the movies and a third of the series being duplicates is pretty bad. or is this ok? when i want to discover movies i want as much as possible and not the same over and over again..\n\nwhat is your opinion on that?  \n(english is not my native language so sorry for mistakes)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngk9ba/movie_recommendation_system/"
    },
    {
        "id": "1ngk1s2",
        "author": "Low-Entertainer7541",
        "title": "Adolescence 4th ep",
        "content": "Hey, so I finished this series last night and I've been reading about it online for the last couple of hours. I understood the whole context of the series- towards the whole anti women propaganda mivement thing that a 13 yo can be affected by through the internet, misogyny, toxic masculinity, bullying etc etc and the whole psychology behind it. but in the 4th ep, i did not understand the point of showing that whole car ride where the mum dad and sister are bonding while they go to the store. i mean... what was the point of those 15-20 mins? Was it to show how they're trying to live despite Jamie's actions? Or was it only like that because it's a one take show? i understood the coming back home ride when Jamie calls, but i'm very confused about the going to the store ride where the mum and dad talk about their first meet and stuff like that.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ngk1s2/adolescence_4th_ep/"
    },
    {
        "id": "1ngf709",
        "author": "Real_Bad7735",
        "title": "Why does Netflix not have different format for live sports events?",
        "content": "I have the Canelo Crawford fight playing live on Netflix and wanted to check (in-app) which fight it was on and how many to go to the main event, and the description section looks exactly like it does for movies and TV shows!\n\nEven if you forget about the fights over the last couple of days, there are 20 boxers fighting today, and the list of \"cast members\" on the Netflix description only includes 8 names.\n\nBro, this is one of the biggest boxing events of the century and they can't even do a customized blxing-centric description section that lists the full fight card and maybe even has betting odds, placement on the card, their boxing record or anything? It's boxing, not love island FFS, sort your shit out Netflix and put some effort into your sports entertainment.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ngf709/why_does_netflix_not_have_different_format_for/"
    },
    {
        "id": "1ngnx2q",
        "author": "Shararizard",
        "title": "Cool series to watch on Netflix in Germany?",
        "content": "Hey I’m looking for some newish series I can find on Netflix Germany. Something kinda horror or thriller? I really liked to the lake, home sweet home, Alice in borderland, Resident Evil,\nDark, 1899 and into the night. Maybe I like to watch sort of sci fi, mystery, action, thriller or horror series… ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ngnx2q/cool_series_to_watch_on_netflix_in_germany/"
    }
]