[
    {
        "id": "1hf9e5i",
        "author": "BunyipPouch",
        "title": "Join us Tuesday 12/17 at 5:00 PM ET for a live AMA/Q&amp;A with Tyler Nilson &amp; Michael Schwartz, co-directors of 'The Peanut Butter Falcon' and 'Los Frikis'",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6z7yjv3sj47e1.png?auto=webp&amp;s=6ba06cedd0247950f09a7e335c8512e7149167eb"
        },
        "permalink": "/r/movies/comments/1hf9e5i/join_us_tuesday_1217_at_500_pm_et_for_a_live/"
    },
    {
        "id": "1hd2xa8",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Kraven the Hunter / The Lord of the Rings: The War of Rohirrim / Queer / Flow / Maria / The Piano Lesson)",
        "content": "# New Theatrical Releases\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)\n\n[Queer](https://old.reddit.com/r/movies/comments/1hd2vby/official_discussion_queer_spoilers/?)\n\n[Flow](https://old.reddit.com/r/movies/comments/1hd2vdk/official_discussion_flow_spoilers/?)\n\n# Streaming Releases\n\n[Maria](https://old.reddit.com/r/movies/comments/1hd2vew/official_discussion_maria_spoilers/?)\n\n[The Piano Lesson](https://old.reddit.com/r/movies/comments/1hd2vg7/official_discussion_the_piano_lesson_spoilers/?)\n\n[Carry-On](https://old.reddit.com/r/movies/comments/1hdths9/official_discussion_carryon_spoilers/?)\n\n# Still in Theaters\n\n[Y2K](https://old.reddit.com/r/movies/comments/1h7rhq7/official_discussion_y2k_spoilers/?)\n\n[Werewolves](https://old.reddit.com/r/movies/comments/1h7rhry/official_discussion_werewolves_spoilers/?)\n\n[The Return](https://old.reddit.com/r/movies/comments/1h7rht7/official_discussion_the_return_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)",
        "upvotes": 43,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hd2xa8/official_discussion_megathread_kraven_the_hunter/"
    },
    {
        "id": "1hfjiis",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for James Gunn’s ‘Superman’",
        "content": "",
        "upvotes": 8106,
        "comments": 1100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zneipeuyt77e1.jpeg?auto=webp&amp;s=10c0efd2db5b7e3202bee0bbeb67c9074e93f8c0"
        },
        "permalink": "/r/movies/comments/1hfjiis/official_poster_for_james_gunns_superman/"
    },
    {
        "id": "1hfid0q",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'Karate Kid: Legends'",
        "content": "",
        "upvotes": 2860,
        "comments": 463,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tggs1wq2j77e1.jpeg?auto=webp&amp;s=718e22711c7b1d071235db3dc1db27475e936373"
        },
        "permalink": "/r/movies/comments/1hfid0q/first_images_from_karate_kid_legends/"
    },
    {
        "id": "1hfij17",
        "author": "MarvelsGrantMan136",
        "title": "Warfare | Official Trailer | A24",
        "content": "",
        "upvotes": 1619,
        "comments": 513,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MDzava3dt7znK083JnK3jCSBR_x-bXtKmwi54TPft2g.jpg?auto=webp&amp;s=fabf7ea331db5c4824dc02b83788a1109769cb15"
        },
        "permalink": "/r/movies/comments/1hfij17/warfare_official_trailer_a24/"
    },
    {
        "id": "1hfmgpm",
        "author": "Davis_Crawfish",
        "title": "Catherine O'Hara is simply spectacular as Kevin's mom in the Home Alone movies. She made the most out of a thin role, giving it more humor and depht than it deserved.",
        "content": "If you go through the Home Alone movies, the bond between Kevin and his mom is the heart of the Film. They have a love-hate relationship in which Kate (O'Hara) always sees the bad in Kevin (Macaulay Culkin), because he's a kid  who allows his emotions to get the best of him when he's bullied by Buzz or cursed at by his no good Uncle, but she also has a lot of love for him. But when Kevin is lost or left by the wayside, it's the mom who bears the guilt and tries to figure out what went wrong as well as acknowledging her mistakes. \n\nOne thing I felt lacked in Lost in New York was the mom's subplot. I loved the Catherine O'Hara and John Candy's scenes in the first movie, great chemistry and O'Hara's character got to do a self-examination. \n\nThe sequel, O'Hara is given less to do but the crux of the film continues to be the bond between Kevin and his mom. It's no accident that she's always the one whom Kevin runs to whenever he misses his family. The father is an after-thought in all of this. \n\nAnd Catherine O'Hara is superb as Kate. She gives a true depiction of motherhood, one which isn't perfect and it's often flawed but the love and care is still there. And O'Hara is an incredible comedienne and juices up a part which could have easily been another generic mom role.",
        "upvotes": 205,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1hfmgpm/catherine_ohara_is_simply_spectacular_as_kevins/"
    },
    {
        "id": "1hflaki",
        "author": "Critcho",
        "title": "It's now ten years since Peter Jackson directed a non-documentary film",
        "content": "The third Hobbit film came out ten years tomorrow, and there's no sign of him directing anything else any time soon.\n\nI think those movies are ever-so-slightly underrated (I stick up for the EEs as the best versions, as unnecessary as an even *longer* version of that story might sound). But it's hard not to think something about their troubled production, and maybe the ways Hollywood has changed over the years, broke something in old PJ.\n\nNot that he hasn't been keeping busy at all. They Shall Not Grow Old was a really good documentary, and Get Back is essential viewing for Beatles fans. Not to mention his part in getting their 'new' song made. He seems happy enough tinkering with his pet interests.\n\nIt's a little sad though to think back on when the LOTRs came out and he was gearing up for King Kong and was still in his early 40's, you could imagine he was only just getting started. But now he seems more or less retired as a director and accepting that LOTR is probably what he'll be remembered for.\n\nIn a way, that's fair enough. LOTR is more than most people achieve. Still, it would be nice to see him back and doing something new, even if it's just shooting another horror movie in his backyard like he used to talk about doing.",
        "upvotes": 188,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1hflaki/its_now_ten_years_since_peter_jackson_directed_a/"
    },
    {
        "id": "1hfj9dl",
        "author": "KillerCroc1234567",
        "title": "First-Look Images from “M3GAN 2.0”",
        "content": "",
        "upvotes": 141,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SQXNV46gSI9ZDfQ_py2H5KhLit7DVsDKwU0XL0XTWhQ.jpg?auto=webp&amp;s=c7aef2d06f18c5f5df10bd6c87149a8a708df93c"
        },
        "permalink": "/r/movies/comments/1hfj9dl/firstlook_images_from_m3gan_20/"
    },
    {
        "id": "1hfacbd",
        "author": "PeaWordly4381",
        "title": "The Kingdom of The Crystal Skull opening is one of the weirdest things ever",
        "content": "Never been a fan of Indiana Jones, didn't grow up on his movies, seen only the first one on TV at some points. Started watching them in order and just finished The Kingdom of The Crystal Skull.\n\nSo this is the grand return of the character to the big screen and Harrison Ford's return to the role. Indiana Jones always struck me as a less cliched action hero. Sure, there's a pulpy feel to his adventures and they're generally pretty light hearted, but he still feels less like a typical invincible soldier with a machine gun type of an action hero and more of a everyman, an archeology professor who rarely uses his gun, who's not in it for the money or glory, who often gets captured, gets hit during brawls and is afraid of snakes.\n\nAnd one of the first things he does in this movie is survives a nuclear explosion. Now I've always heard about the fact that Indiana Jones hid from a nuclear explosion in a fridge, but I've thought that it was either a meme I didn't understand or a climactic moment in one of the movies. But no, this is literally happening in an opening, he randomly stumbles upon a nuclear testing site and hides in a fridge to miraculously survive. And then the movie actually starts. Like, due to the law of drama, him being fired due to red scare(isn't 1957 too late for McCarthyism?) feels more dramatic than him living through a nuclear explosion without even breaking a bone from that flying fridge.\n\nI know that this movie is not very well liked by the fans(it is okay-ish, though the CGI is pretty cheap, the nuclear fridge is dumb and also Indy being dumbed down and trusting Mac about \"I've left you to die with the soviets, but I'm actually a double agent\" and then ignoring the fact how he openly thirsts for the treasure in the El Dorado is ridiculous). But I'm curious how did people react to this opening after seeing their favourite hero return.\n\nEDIT: Didn't realize this would start a huge discussion about internal consistency, established rules and the word \"physics\".",
        "upvotes": 870,
        "comments": 593,
        "media": null,
        "permalink": "/r/movies/comments/1hfacbd/the_kingdom_of_the_crystal_skull_opening_is_one/"
    },
    {
        "id": "1hfb0ac",
        "author": "Single_Reason7898",
        "title": "Lindsay Lohan is phenomenal in The Parent Trap",
        "content": "\nI just watched The Parent Trap for the first time, and she seriously surprised me. She should’ve been nominated for a golden globe, at the very least.\n\nShe’s so believable as twins it’s crazy. She gives each of the twins subtle characteristics that make them feel like 2 completely different people. I mean they actually felt like real twin girls, who were separated at birth. The way she gives the one twin certain mannerisms, to distinguish the two apart is so cool. Not a single time during my viewing was I confused at which “twin” was on my screen. The fact that it was her first movie is insane to me. It was a performance way beyond her years. \n\nEvery single line delivery of hers is incredible. Every single joke lands.\n\nThere’s a certain scene about 20 mins into the movie, where the 2 girls discover that they’re twins. There’s a specific line that she delivers that absolutely broke my heart, and brought a tear to my eye. She delivers this line with a single tear and a voice crack, and it was fantastic. It’s so subtle, but packs a big punch. Never in a millions years, did I ever think I’d start to tear up watching The Parent Trap, of all movies…\n\nShe’s so good, and the movie seriously surprised me. I would definitely watch it again \n\n\n\n",
        "upvotes": 712,
        "comments": 107,
        "media": null,
        "permalink": "/r/movies/comments/1hfb0ac/lindsay_lohan_is_phenomenal_in_the_parent_trap/"
    },
    {
        "id": "1hfh5dx",
        "author": "Phantom90AG",
        "title": "Studiocanal to release new 4K restoration of 'The Lion In Winter'",
        "content": "",
        "upvotes": 187,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9SvJk-fbenUPnMwjyxDvqZbGM9jw5cypfF-u2FJwOfo.jpg?auto=webp&amp;s=e2f0f32a7fddf4346a60af7634a088ba0c0af264"
        },
        "permalink": "/r/movies/comments/1hfh5dx/studiocanal_to_release_new_4k_restoration_of_the/"
    },
    {
        "id": "1hew03m",
        "author": "BunyipPouch",
        "title": "First Image from Sci-Fi Thriller 'Didn't Die' - A podcast host desperately clings to an ever-shrinking audience in the zombie apocalypse.",
        "content": "",
        "upvotes": 4821,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xkw9udhdf17e1.jpeg?auto=webp&amp;s=7f88f0bc22a30cff70bd7fdd6aa0a0c2a8ccafbc"
        },
        "permalink": "/r/movies/comments/1hew03m/first_image_from_scifi_thriller_didnt_die_a/"
    },
    {
        "id": "1hfn2w8",
        "author": "BuckPuckers",
        "title": "Alien Covenant is a lot better than I remembered ",
        "content": "I rewatched it last night for the first time since it came out, and its a lot better than I remembered it being. The sets/costumes are all beautiful, and I liked the \"smart\" approach this and Prometheus took on the Alien lore. \n\nCan we also talk about Fassbender as David?  I think he is one of the better villains we have seen in recent years. Terrifying and well acted!\n\nThe movie does devolve into Hollywood shlock a bit by the end, but it is still entertaining.\n\nWould love to hear your thoguhts! \n\nEdit: I forgot to mention, I really would love to see a follow up showing the results of David’s experiments on the colony!",
        "upvotes": 53,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1hfn2w8/alien_covenant_is_a_lot_better_than_i_remembered/"
    },
    {
        "id": "1hf8jq1",
        "author": "YohannT",
        "title": "Before the release of Nosferatu : The best vampire movies of all time\n",
        "content": "",
        "upvotes": 603,
        "comments": 222,
        "media": null,
        "permalink": "/r/movies/comments/1hf8jq1/before_the_release_of_nosferatu_the_best_vampire/"
    },
    {
        "id": "1hfe7p4",
        "author": "watermunch",
        "title": "Was there a time you accidently watched a sequel first without realizing?  ",
        "content": "I ask this question, because it just happened to me. I was on Hulu randomly looking for a movie, when I saw 28 weeks later, and I was in the mood for a gritty zombie movie, and I heard it was really good. What I didn't realize was that 28 weeks later was the sequel to 28 days later, the film I thought I was watching. I was kind of  lost with the characters and plot, but I just thought that It would explain more as the movie went on. Only halfway through I looked up the reviews for the movie, and saw my mistake.\n\n  \nHas this ever happened to you? and what was it like?",
        "upvotes": 192,
        "comments": 545,
        "media": null,
        "permalink": "/r/movies/comments/1hfe7p4/was_there_a_time_you_accidently_watched_a_sequel/"
    },
    {
        "id": "1hf3trx",
        "author": "Mees51",
        "title": "What are the best ‘slice of life’ movies? ",
        "content": "I love movies that depict every day life, but with a bit of absurdity thrown in. The plot doesn’t revolve around saving the world or a big bank heist that’s happening, just small stuff that people experience. \n\nSome examples are Napoleon Dynamite, Once Upon a Time in Hollywood and Kikujiro. \n\nWould really appreciatie some suggestions! ",
        "upvotes": 684,
        "comments": 943,
        "media": null,
        "permalink": "/r/movies/comments/1hf3trx/what_are_the_best_slice_of_life_movies/"
    },
    {
        "id": "1hf6viz",
        "author": "BunyipPouch",
        "title": "First Poster for Action-Comedy 'The Gardener' - Starring Jean-Claude Van Damme - Serge holds a state secret. He, his family and gardener Leo appear on a government death list. They attempt to devise a plan to stay alive.",
        "content": "",
        "upvotes": 432,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2rfzezf7w37e1.jpeg?auto=webp&amp;s=6089c99c8883524ac4409264c91838e006067d9a"
        },
        "permalink": "/r/movies/comments/1hf6viz/first_poster_for_actioncomedy_the_gardener/"
    },
    {
        "id": "1hfehpc",
        "author": "TheBodhy",
        "title": "\"Constant questioners\" whilst watching a movie - annoying, or no?",
        "content": "I was watching a movie with a friend on the weekend, and he has this IMO extremely annoying habit of constantly asking questions during the movie. Like 'why did they do that?' 'what was that for?' 'what's he planning with that' etc etc.\n\nSuffice it to say, I find this extremely fucking annoying and I told him so in no uncertain terms. His response was to play the victim like \"Man, why so aggressive?\".\n\nThe thing is, constant questioners IMO, basically know they're being annoying and do it anyway. We're watching the same movie. We're up to the same point in the movie since we're watching it together. I don't have any knowledge of the movie you don't, unless you weren't paying attention - but even still, that is not on me to rectify for you, you need to pay attention.\n\nAnd even still, he asks questions I couldn't possibly have the answer for and it's strongly implied the movie will answer them for you anyway as long as you keep watching. Like, why ask me that question when you know I don't know the answer? The movie hasn't given us the information yet but you know it will later!\n\nIs it just me, or are constant questioners the worst people to watch movies with? I'm basically banning him from watching movies at my place now. Sorry to say, it's just extremely annoying even if the person is a friend.",
        "upvotes": 104,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1hfehpc/constant_questioners_whilst_watching_a_movie/"
    },
    {
        "id": "1hf5t3k",
        "author": "Lower_Love",
        "title": "What's the saddest/most unfair thing to happen to a character that didn't deserve it?",
        "content": "It doesn't necessarily have to be a massive Earth-shattering tragedy, but what's something that happened to a film character that made you go \"Man, that's not fair\"\n\nI'd say in The Big Lebowski &gt;!Donny was a complete innocent and he needlessly died from fright!&lt;\n\nJaws &gt;!Quint was getting deranged there by the end, but seeing him being eaten by the shark (his greatest fear) is still disturbing and very sad!&lt;\n\nHow about you?",
        "upvotes": 383,
        "comments": 787,
        "media": null,
        "permalink": "/r/movies/comments/1hf5t3k/whats_the_saddestmost_unfair_thing_to_happen_to_a/"
    },
    {
        "id": "1hf9slu",
        "author": "LittleFatMax",
        "title": "Movement is marvelous- a short, stylish video on varying types of camera movements",
        "content": "",
        "upvotes": 173,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SCKwWsk7h-bYGkO5RNIhizDtmcil9hQ0SMpH1NmCxjs.jpg?auto=webp&amp;s=ba7aeae215906edc9ee5b58325cd38769bf6454c"
        },
        "permalink": "/r/movies/comments/1hf9slu/movement_is_marvelous_a_short_stylish_video_on/"
    },
    {
        "id": "1hf40nv",
        "author": "seveer37",
        "title": "Soylent Green is still one of the most terrifying dystopia’s I’ve ever seen! ",
        "content": "It’s definitely dated in a few spots but gosh I don’t think any other future film has felt so disturbing to me. Particularly because the human population is still very much alive but now extremely overpopulated. Planet of the Apes, I Am Legend, or most post apocalypse films have very few humans left. Granted I know the population will never get this bad but it felt more real to me. \n\nAnd the final twist which I’m sure everyone knows by now, most humans are processed to be converted into food for the rest also feels real. I’ve recently learned much of the food we eat is grown in sewage! A shocking truth but hey what else can we do? We need food! And the rich practically get away with everything! Again who do we know recently this has happened with? \n\nGosh the film has really left me shaken still all these years.",
        "upvotes": 406,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1hf40nv/soylent_green_is_still_one_of_the_most_terrifying/"
    },
    {
        "id": "1hewv0u",
        "author": "YohannT",
        "title": "Weirdest end credit songs in movies",
        "content": "",
        "upvotes": 955,
        "comments": 558,
        "media": null,
        "permalink": "/r/movies/comments/1hewv0u/weirdest_end_credit_songs_in_movies/"
    },
    {
        "id": "1henqg6",
        "author": "ICumCoffee",
        "title": "‘Peaky Blinders’ Movie Wraps Filming - Starring Cillian Murphy, Rebecca Ferguson, Barry Keoghan, Tim Roth, and Stephen Graham",
        "content": "",
        "upvotes": 4091,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lzSCB872GjTfi7SDeeKyvvxFUZfMfrbX9e5nvghs3ys.jpg?auto=webp&amp;s=20349e3bec6835d072be6264fea34ab3e8d1ec34"
        },
        "permalink": "/r/movies/comments/1henqg6/peaky_blinders_movie_wraps_filming_starring/"
    },
    {
        "id": "1hfnnil",
        "author": "Britneyfan123",
        "title": "Lisa Kudrow Criticizes Robert Zemeckis Film ‘Here’ As “Endorsement For AI”",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qp4T_YGCF6cf2eXqIDqg-8HQMV0KhNQh3tZosIURmms.jpg?auto=webp&amp;s=e51db7de03c77a0e99a112aef16dce4d6ff9a3ed"
        },
        "permalink": "/r/movies/comments/1hfnnil/lisa_kudrow_criticizes_robert_zemeckis_film_here/"
    },
    {
        "id": "1hf21l2",
        "author": "mrjohnnymac18",
        "title": "Karolyn Grimes looks back on her role as Zuzu in It's a Wonderful Life",
        "content": "",
        "upvotes": 178,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3cn0L9YmF6Zd7PnwrtJE1MG4GR8vzwiSrZmPN66TVbY.jpg?auto=webp&amp;s=079fd58b0e276a5903adbfc027017bb7fcbe5b3a"
        },
        "permalink": "/r/movies/comments/1hf21l2/karolyn_grimes_looks_back_on_her_role_as_zuzu_in/"
    },
    {
        "id": "1hfd060",
        "author": "Noskcaj27",
        "title": "Neil Breen's Influence on Megalopolis",
        "content": "Did Neil Breen have an influence on the script for Megalopolis, direct or indirect?\n\nTo clarify what I mean, I highlight a number of similarities between Breens work and Megalopolis:\n- In Breens movies, every attractive woman wants to sleep with Breen, resulting in a romantic subplot or love triangle. In Megalopolis, Wow, Julia, and Vesta all sleep and/or want to sleep with Ceasar.\n- In Double Down, Niel Breen has constant flashbacks to his dead girlfriend. In Megalopolis, there are four random flashbacks to Caesar's dead wife.\n- In Breens movies, there are many disjoint plots taking place simultaneously. In Megalopolis, there is the plot between Caesar and Cicero amd the bank takeover plot with Wow and Shia Labeouf to name two.\n- In Breens movies, Breen is always endowed with supernatural power. One of the biggest selling points of Megalopolis is that Caesar has the power to stop time among others.\n- In Breens movies, the villains/antagonists are corrupt politicians and/or corrupt businessmen. In Megalopolis, the main antagonists are Mayor Cicero and the banker Crassus.\n\nI'm not claiming that Neil Breen wrote the script to Megalopolis. However is it possible that Breens work had an influence on Megalopolis?",
        "upvotes": 26,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1hfd060/neil_breens_influence_on_megalopolis/"
    },
    {
        "id": "1hetrq0",
        "author": "Mst3Kgf",
        "title": "I have a soft spot for \"Die Hard 2\" even though I admit it's basically the least of the original three \"Die Hard\" entries.",
        "content": "There's no way, of course, that \"2\" could hope to escape the shadow of the legendary original, but it's also overshadowed by \"Vengeance\" given that features such things as Bruce Willis and Sam Jackson's interplay and Jeremy Irons's terrific villain turn. It plays often like a rehash of the original (even making fun of it, like when Willis asks how it can happen to him twice). The villains are fine, but not anywhere near as memorable as Alan Rickman or Irons. And so on.\n\nBut I still really like it as a fun action flick and a worthy successor even if it doesn't quite compare to its predecessor and successor. The setting is great as an airport at Christmas is a fabulous setting for maximum carnage and chaos. Willis still has John McClane in this one as a beleaguered everyman thrown into a situation he didn't expect or want (guy just wants to pick up his wife and get back for Christmas with the in-laws) and we see him at arguably his most vulnerable at certain points. And it keeps the tradition of the first one by having even minor characters be memorable (like the cute Avis clerk who both aids and flirts with John or Holly's Taser-wielding seatmate). I frankly like watching both this and the original at Christmas as a pair for some good holiday-themed action.\n\nI'd also add another aspect that stands out; this is the darkest and most brutal entry in the franchise. Not only does it have arguably the most graphic deaths of the series (see John stabbing the mook Baker through the eye with an icicle or Major Grant getting kicked into the plane turbine), but the villains are genuine terrorists in this one, not just using it for cover. Bill Sadler plays Lt. Col. Stuart as a cold-blooded sociopath with none of Hans or Simon's charisma or likable traits, which makes him arguably the scariest \"Die Hard\" villain (easily the most hatable; Sadler apparently considers it a compliment when people tell him how much they hate the character, because that's what he intended). And worst of all, THEY CRASH A PLANE. A plane with over 200 people on it, including children. And no one makes it out alive. You have to respect an action film with the guts to do that to show just how serious the threat is.",
        "upvotes": 361,
        "comments": 276,
        "media": null,
        "permalink": "/r/movies/comments/1hetrq0/i_have_a_soft_spot_for_die_hard_2_even_though_i/"
    },
    {
        "id": "1heunkv",
        "author": "Odd_Advance_6438",
        "title": "Hugh Jackman is phenomenal in Les Miserables",
        "content": "I always loved Hugh Jackman as an actor since I was young, but really only just from playing Wolverine for a while. Now that I’ve seen a lot of his other roles, I’ve realized just how versatile and talented he really is.\n\nI haven’t seen the musical, but I really enjoyed the film version of Les Mis, and it has a pretty incredible performance from Jackman. All the performances were great (I even enjoyed Russell Crowe as Javert) but he really stands out as Jean Valjean, particularly in the scene early on where he decides to turn his life around after being touched by the man’s kindness",
        "upvotes": 303,
        "comments": 149,
        "media": null,
        "permalink": "/r/movies/comments/1heunkv/hugh_jackman_is_phenomenal_in_les_miserables/"
    },
    {
        "id": "1hf9ilf",
        "author": "GoblinTenorGirl",
        "title": "Dear Santa was impressive",
        "content": "Never before have I seen a movie that went from \"honestly really fun, nice Christmas movie with some flaws\" to \"awful\" as quickly or as hard as this one did. \n\nJack Black was fun, I liked this role of his alot, the kids were great, the premise is fun, but holy crap that ending tanked the film so hard, what an awful resolution, a failure of emotional storytelling with no meaning. If you want to watch a movie do that plotline well, I beg you, watch The Christmas Chronicles.",
        "upvotes": 34,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1hf9ilf/dear_santa_was_impressive/"
    },
    {
        "id": "1hey2ql",
        "author": "harrychapp",
        "title": "The ultimate Oscars Checklist",
        "content": "I've made a website called OscarsChecklist.com. It's similar to IMDB or Letterboxd, where you can mark which films you've watched, but this one is specifically for ALL the Oscar nominated movies since 1929.\n\nAll of the 10,000+ nominations are here, and you can browse by category, year, film, person and more! You can see your friends' progress, and you'll be able to predict winners, which then allows a live scoreboard to gamify the ceremony!\n\nIt's all free, there's no ads, l've just made it because I knew if I wanted it to exist, other people in the world probably do too.",
        "upvotes": 138,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dBuQ9gRq7c5NbQoOu3JdwrARnTzadGGA_TTDdhmP7rM.jpg?auto=webp&amp;s=101e461b3e4f2e6bf1fe7eb398129828411e2475"
        },
        "permalink": "/r/movies/comments/1hey2ql/the_ultimate_oscars_checklist/"
    },
    {
        "id": "1hesdiv",
        "author": "Physical_Plastic138",
        "title": "What are the more incredible “must-see” films you’ve ever watched, that you never want to watch again? ",
        "content": "Some films just evoke that paradoxical sense of, “what a masterpiece… And I never want to see any of it ever again.”\n\nSaving private ryan is firmly atop this list for me. No country for old men and the green mile spring to mind too. I loved all three of them, especially NCFOM… And yet. \n\nWhat’s on your list - and why? These much loved but “un-rewatchable” films are in their own very interesting category, especially when a large audience feels the same way about it. ",
        "upvotes": 299,
        "comments": 868,
        "media": null,
        "permalink": "/r/movies/comments/1hesdiv/what_are_the_more_incredible_mustsee_films_youve/"
    },
    {
        "id": "1hf3c83",
        "author": "MatiasMJK",
        "title": "A.I. See Dead People",
        "content": "",
        "upvotes": 57,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XSJXHQTK2E3lg31n3InKM7afMf5KosE1pjg9t4gpUVs.jpg?auto=webp&amp;s=fac07e40f496bb52a21549d798fac24bb3c42b7d"
        },
        "permalink": "/r/movies/comments/1hf3c83/ai_see_dead_people/"
    }
]