[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1q5wrnj",
        "author": "ChocolateSprinkles7",
        "title": "What's the best Sim card to but in Turin",
        "content": "Hey ya'll, I'm an international student here in Turin, I have an Iliad Sim card, but the internet speed is not it at all and in many places it goes to almost zero. I'm currently living in San Salvario area and I would like the best for a fast and reliable internet connection, many thanks. \n\nP.S: you guys have a beautiful city, I love it! (Except for the sidewalks full of dogs \"leftovers\") ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1q5wrnj/whats_the_best_sim_card_to_but_in_turin/"
    },
    {
        "id": "1q61fmb",
        "author": "Juno_Panda",
        "title": "Consigli zona San Salvario",
        "content": "Sto cercando casa a Torino e ho ricevuto due proposte in zona San Salvario. Rispettivamente Via Ormea e Via Saluzzo. Nell’immagine ho indicato a che altezza sono le case. Tra le due, qual è la più sicura per muoversi e prendere la metro o i mezzi da sola? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q61fmb/consigli_zona_san_salvario/"
    },
    {
        "id": "1q5gnzy",
        "author": "futureaddict8",
        "title": "university student life in torino",
        "content": "Ciao! As an international student currently considering the University of Torino for their economics and finance with data science program in english, i would like to ask for some information.\n1) How is Turin as a student city? Is the nightlife vibrant with events and clubbing, and are there many international students around?\n2) How easy would you say it is to socialise in Turin?\n3) Will the professors use Italian in class for discussions or english will be the only language used?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q5gnzy/university_student_life_in_torino/"
    },
    {
        "id": "1q4s7k2",
        "author": "BrutalSock",
        "title": "Se sleghi il cane, non chiedere ad alti di gestire la situazione.",
        "content": "Scrivo questo post perché è la seconda volta che mi capita questa cazzata in pochi giorni ed evidentemente a molti non è chiaro come funziona questa roba:\n\nSe un cane libero (il vostro) si avvicina a un cane legato (il mio) é inutile che pretendiate che io “mi allontani” o “lo tenga”. Al di là della questione che il cane \\*\\*é vietato liberarlo fuori dalle aree cani\\*\\* (e che quindi non so cosa vogliate), se quello si avvicina io non posso più fare nulla, l’interazione a quel punto la gestisce completamente il vostro cane.\n\nSe io mi metto a tirare al guinzaglio non faccio che aumentare il rischio che si attacchino. Posso solo stare fermo.\n\nColgo anche l’occasione per dirvi che, sempre al di là del fatto che sarebbe vietato a prescindere, se sapete che il vostro cane litiga coi maschi forse sarebbe un motivo in più per non togliergli il guinzaglio.\n\nSaluti.",
        "upvotes": 174,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1q4s7k2/se_sleghi_il_cane_non_chiedere_ad_alti_di_gestire/"
    },
    {
        "id": "1q5eams",
        "author": "emanueleoggiano",
        "title": "Shopping di qualità (vestiario) in alternativa a fast fashion (a Torino)",
        "content": "",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1q5eams/shopping_di_qualità_vestiario_in_alternativa_a/"
    },
    {
        "id": "1q5syep",
        "author": "enoughtodo67",
        "title": "Qualcun* che ha difficoltà nel relazionarsi disponibile per amicizia?",
        "content": "Ciao popolo! 🫶🏻\nVolevo sapere se è possibile trovare su questa piattaforma nuova per me, persone che abbiano timidezza o problemi nel relazionarsi e le quali vorrebbero fare amicizia.\nC'è un ragazzo di 21 anni che vorrebbe conoscere nuove persone con le quali uscire, però è molto timido. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q5syep/qualcun_che_ha_difficoltà_nel_relazionarsi/"
    },
    {
        "id": "1q50cwl",
        "author": "_crisz",
        "title": "Per quale diavolo di motivo Arriva e l'SFM hanno gli stessi identici orari sia all'andata che al ritorno?",
        "content": "Abbiamo una ferrovia e abbiamo un'azienda privata che mette a disposizione pullman per l'aeroporto. È così difficile intervallare i passaggi? Non dico tanto per l'SFM che arriva da Fossano o da Alba e non ha questa flessibilità, ma un'azienda privata quanto ci metterebbe a controllare gli orari dei treni e accorgersi che sta facendo lo stesso giro praticamente in contemporanea? E non solo una, ma praticamente tutte sia all'andata che al ritorno dall'aeroporto. Poi nei festivi entrambi hanno un passaggio all'ora, lasciando quindi un buco di un'ora per poi passare insieme",
        "upvotes": 16,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9mty1ecvwlbg1.jpeg?auto=webp&amp;s=4acfe54be00ea73a85b642a3d19078ad06d6f099"
        },
        "permalink": "/r/torino/comments/1q50cwl/per_quale_diavolo_di_motivo_arriva_e_lsfm_hanno/"
    },
    {
        "id": "1q5efu3",
        "author": "nessunoste",
        "title": "Pareri sulle scuole primarie in zona piazza statuto.",
        "content": "Abitiamo nei dintorni di piazza statuto e a breve dovremo iscrivere nostro  figlio di 6 anni alla scuola elementare (primaria).\nAttualmente siamo molto indecisi tra la scuola Boncompagni (via vidua) e il Convitto Umberto I (via Bligny).\nQualcuno ha esperienze, pareri o consigli in merito?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q5efu3/pareri_sulle_scuole_primarie_in_zona_piazza/"
    },
    {
        "id": "1q5h702",
        "author": "pietrosantoro13",
        "title": "Progetto Coabitazione",
        "content": "Salve a tt sto cercando delle persone con cui cercare una casa a Torino città, possibilmente con qualcuno con disponibilità economiche da lavoro avviato. contattatemi se siete interessati. Non so se il post concerne di più la bacheca degli annunci ma questultima mi sembra poco frequentata ed inutile",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q5h702/progetto_coabitazione/"
    },
    {
        "id": "1q5euvi",
        "author": "vici0608",
        "title": "Italian course not too expensive?",
        "content": "Hi guys, I am currently learning Italian and I‘m at the Ciao Italy school here in Turin. Unfortunately, the courses are pretty expensive and idk if I can continue them with that price. Do you have any tips where I can find Italian courses that are not super expensive, or at least more affordable? Almost 400€ every 6-8 weeks is not possible :(\n\nRn I’m doing in person courses but I‘m also ok with online ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q5euvi/italian_course_not_too_expensive/"
    },
    {
        "id": "1q5pz99",
        "author": "Dapper-Connection500",
        "title": "Hey, io M17 che cerca compagnia, se volete fatevi aventi sia m che f",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q5pz99/hey_io_m17_che_cerca_compagnia_se_volete_fatevi/"
    },
    {
        "id": "1q5dci3",
        "author": "Bobbx98",
        "title": "Conoscenze",
        "content": "Ciao a tutte, m27 single da poco, vorrei un po' di compagnia, chi ne ha voglia scriva pure in privato ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q5dci3/conoscenze/"
    },
    {
        "id": "1q4huk5",
        "author": "Mental_Plane6451",
        "title": "Situazione senzatetto",
        "content": "Ciao a tutti,\nSolo io ho notato sempre più persone che fuori dai supermercati chiedono cibo?\nNon chiedono neanche soldi ma direttamente pane e tonno. E i senzatetto sono sempre messi peggio, con piedi o denti marci\nSiccome non riesco a dirgli di no, ho fatto due chiacchiere con uno , mi ha detto che i dormitori sono pieni ed è difficine trovare posto. \n\nE niente volevo chiedere, se qualcuno ha conoscenza del mondo del volontariato, se mi sa dire di com'è la situazione a Torino, se mi sa dire come funziona per un senzatetto, e se è vero che si fa fatica a trovare posto per dormite o del cibo.",
        "upvotes": 52,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1q4huk5/situazione_senzatetto/"
    },
    {
        "id": "1q54ckh",
        "author": "DangerousPermit599",
        "title": "dove sciare",
        "content": "ciao a tutti, a febbraio ho un volo per torino e vorrei chiedere qualche consiglio su dove andare a sciare. \n\npreferibilmente raggiungibile con i mezzi pubblici, \n\n vorrei evitare di noleggiare un'auto. \n\nvengo per una settimana - sabato-sabato. fino a domenica sera/lunedì mattina vorrei rimanere in città, e poi tornare venerdì mattina a torino. dove vale la pena andare? io sciatrice da 20 anni, il mio ragazzo è uno snowboarder di livello intermedio (verso forte). dovremo anche noleggiare l'attrezzatura. grazie :) ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1q54ckh/dove_sciare/"
    },
    {
        "id": "1q4qfuf",
        "author": "wisefun22",
        "title": "Piscina Torino zona barriera?",
        "content": "Ciao a tutti/e\n\nMi sapete consigliare una bella piscina in Torino per rimettermi in forma quindi con qualche corso per adulti decente, e sopratttutto dove posso farmi la doccia nuda? non sopporto il divieto del costume. grazie",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q4qfuf/piscina_torino_zona_barriera/"
    },
    {
        "id": "1q3t5r5",
        "author": "ISO_Dreamer",
        "title": "Uno scatto dalla basilica di Superga",
        "content": "Ciao community! \nScatto molto frequentemente con la mia mirrorless, nella mia amata Torino.\nVorrei quindi presentarmi con una foto realizzata la scorsa settimana.",
        "upvotes": 229,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ac5yvc8oscbg1.jpeg?auto=webp&amp;s=3cd4e4185afb9291e12bbc119b9eb947b9b3a26b"
        },
        "permalink": "/r/torino/comments/1q3t5r5/uno_scatto_dalla_basilica_di_superga/"
    },
    {
        "id": "1q4iepm",
        "author": "SimoSian93",
        "title": "Uscite ShakeUp Torino 2k26",
        "content": "Queste sono le prime uscite del 2026 organizzate da ShakeUp Torino, il gruppo Whatsapp creato per fare nuove amicizie in città e provincia (senza secondi fini, senza doversi scrivere a chissà che, senza nulla di strano). Se siete interessati, volete unirvi al gruppo e magari già ad una di queste uscite, contattatemi qua in privato o meglio ancora seguite la pagina Instagram @shakeuptorino e contattatemi lì in DM ✌🏻😁",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k2b8gohleibg1.jpeg?auto=webp&amp;s=e089f27b07cb13bc17fb5ebd39616d45b59ea839"
        },
        "permalink": "/r/torino/comments/1q4iepm/uscite_shakeup_torino_2k26/"
    },
    {
        "id": "1q4n2jt",
        "author": "lebmont98",
        "title": "Intervento per cataratta🩺👁️",
        "content": "Ciao a tutti! \nDa un paio di giorni sto soffrendo di cataratta all’occhio destro. 👁️🚫\nVorrei chiedere per chi ci ha sofferto:\n- consigliate un intervento nel pubblico(asl oftalmico a Torino) o nel privato? \n- quello che mi preme di più: i COSTI per l’operazione? \n- ho letto che comprende anche la cura per l’eventuale miopia: ciò va ad incidere sui costi? Intendo dire, ho la possibilità di NON farmi curare la miopia perchè attualmente non dispongo di molti soldi?\nPurtroppo, né il mio medico di base né l’operatore per la prenotazione al CUP mi hanno saputo rispondere.🥲🤷🏻‍♂️\n\nVi ringrazio in anticipo per l’attenzione. 👋\n",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1q4n2jt/intervento_per_cataratta/"
    },
    {
        "id": "1q4jpgl",
        "author": "kit_kat1210",
        "title": "Dove imparare il tedesco a Torino",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q4jpgl/dove_imparare_il_tedesco_a_torino/"
    },
    {
        "id": "1q4m1s5",
        "author": "eclipsx-e",
        "title": "signore ambulante che vende orecchini",
        "content": "Circa un anno fa sono andata a torino (primavera 2025) e sotto i portici di piazza san carlo ho incontrato un signore con due grandi tele piene di orecchini STUPENDI. tra l’altro a un prezzo molto basso e la qualità fantastica. shout out a lui, e mi chiedevo se qualcun altro lo abbia mai incontrato e se è fisso a torino, con degli orari o dei giri. Io non sono di torino e non l’ho mai più incontrato, vado a torino occasionalmente e non ho avuto modo di “cercarlo”. quindi se qualcuno ha delle informazioni su di lui ne sarei davvero grata. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q4m1s5/signore_ambulante_che_vende_orecchini/"
    },
    {
        "id": "1q4h2h8",
        "author": "Pure-Meat4016",
        "title": "I want to develop my Italian, where can I find a good community?",
        "content": "I would like to hangout and also develop my Italian. Do you know any groups where I can do this?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q4h2h8/i_want_to_develop_my_italian_where_can_i_find_a/"
    },
    {
        "id": "1q4jfct",
        "author": "Conan5678",
        "title": "Amicizie per praticare 🇪🇸🇫🇷",
        "content": "Ciao, vivo a Torino e sto cercando nuove amicizie con cui praticare spagnolo e francese in modo informale, semplicemente chiacchierando e passando del tempo insieme. In francese ho circa un livello B1, mentre con lo spagnolo sono quasi all’inizio. Sono madrelingua italiano e rumeno, quindi se qualcuno ha piacere di praticare l’italiano posso dare volentieri una mano. Sono più da cose tranquille che da attività troppo movimentate. Se vi va, potete scrivermi in privato. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q4jfct/amicizie_per_praticare/"
    },
    {
        "id": "1q4icn8",
        "author": "siv_lab",
        "title": "Consigli su corsi sportivi",
        "content": "Ciao a tutta la community\n\nPer il 2026 avrei intenzione di iniziare qualche nuova attività per spezzare un po’ la solita routine casa-lavoro-palestra :)\n\nVorrei concentrarmi su (una delle) attività che mi incuriosiscono e che non ho mai praticato seriamente, in particolare:\n- Corso di tennis livello base per adulti\n- Corso di boxe livello base per adulti\n- Corso di go-kart livello base per adulti\n\nPreferibilmente orari serali (prima delle 18:00 per me è molto difficile), no particolari vincoli nel weekend, senza agonismo o pretese elevate, con prezzi non troppo elevati possibilmente :D\n\nZone a me comode (casa-lavoro): Lingotto, Mirafiori Sud, Borgo Filadelfia o Cenisia. Ma sono auto munito quindi non ho nessun problema nel muovermi un po’ ovunque. \n\n\nAvete consigli da darmi o esperienze dirette su questo tipo di corsi?\n\n\nGrazie in anticipo a chi vorrà condividere la propria esperienza!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q4icn8/consigli_su_corsi_sportivi/"
    },
    {
        "id": "1q4gejr",
        "author": "Full_Prize_8462",
        "title": "Looking for Gay Friends",
        "content": "Hi, I am a 25 year old male from the LGBTQ+ community. I am interested in making gay friends for conversation, friendship, and meaningful connection. Respect and comfort matter to me.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q4gejr/looking_for_gay_friends/"
    },
    {
        "id": "1q404x3",
        "author": "arminredditer",
        "title": "Luoghi simili ad un'aula studio per poter lavorare?",
        "content": "Stavo cercando un posto (o categoria di posti) a Torino per poter lavorare al PC, idealmente come in un'aula studio (non sono più studente da un pò, non so se posso effettivamente usare un'aula studio). Consigli?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q404x3/luoghi_simili_ad_unaula_studio_per_poter_lavorare/"
    },
    {
        "id": "1q3yhtl",
        "author": "consulent-finanziar",
        "title": "Nel caso passassi per Torino, cosa dovrei visitare assolutamente?",
        "content": "",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1q3yhtl/nel_caso_passassi_per_torino_cosa_dovrei_visitare/"
    },
    {
        "id": "1q417jz",
        "author": "HoustonsAwesome",
        "title": "Ho bisogno di babysitter per un settimana. Avete qualche consiglio?",
        "content": "Viaggerò a Torino per un settimana a Maggio con il mio bambino di due anni. Vorrei trovare un babysitter per tre ore ogni giorno. Conoscete chiunque? Parlo l’inglese ma solo  l’italiano è va bene. Sto imparando l’italiano. Grazie. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q417jz/ho_bisogno_di_babysitter_per_un_settimana_avete/"
    },
    {
        "id": "1q3ry79",
        "author": "insulaTropicalis",
        "title": "Colonia felina data alle fiamme a Nichelino",
        "content": "[https://www.quotidianopiemontese.it/2026/01/03/devastata-una-colonia-felina-a-nichelino/](https://www.quotidianopiemontese.it/2026/01/03/devastata-una-colonia-felina-a-nichelino/)\n\n[https://www.torinosud.it/animali/nichelino-colonia-felina-bruciata-capodanno-denuncia-33788](https://www.torinosud.it/animali/nichelino-colonia-felina-bruciata-capodanno-denuncia-33788)\n\nOgni aiuto è ben accetto. Non solo donazioni, ma anche aiutare a cercare i gatti ancora mancanti e a farli tornare a casa.",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/slKg32pNNfRNZ9VK8P1LQO1IuR3s7qYsNnwjRroO4HA.jpeg?auto=webp&amp;s=8b5894e688a745b4c3cf33b5cf7e899af9d71713"
        },
        "permalink": "/r/torino/comments/1q3ry79/colonia_felina_data_alle_fiamme_a_nichelino/"
    }
]