[
    {
        "id": "1hkx7rr",
        "author": "SanderSo47",
        "title": "December 20-22 Box Office Recap: 'Sonic the Hedgehog 3' tops 'Mufasa: The Lion King' in the domestic market. While 'Mufasa' leads overseas, its $122.2 million worldwide debut is very underwhelming. Meanwhile, 'Kraven' and 'War of the Rohirrim' collapsed 72% and 73%, respectively.",
        "content": "https://preview.redd.it/pa090wakvn8e1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=bad30e582d782417c82593228c0a7bf97e777c0f\n\nThere was a new box office king, and it wasn't Mufasa or any other lion.\n\nThat honor belonged to ***Sonic 3***, which managed to outgross ***Mufasa*** to top the box office. The latter still won the foreign box office, even if the numbers are way below the expectations. In limited release, A24's ***The Brutalist*** had one of the best per-theater averages of the year so far. While last week's newcomers, ***Kraven*** and ***The Lord of the Rings: The War of the Rohirrim*** had poor drops after their anemic starts.\n\nThe Top 10 earned a combined $139.7 million. That's up a massive 62% from last year, when ***Aquaman and the Lost Kingdom*** topped and flopped.\n\nDebuting in first place, Paramount's ***Sonic the Hedgehog 3*** earned $60.1 million in 3,761 theaters. That's below the $72 million debut from the previous film, but that's not really a cause for concern as of now; December titles are often known for decreasing openings but strong legs.\n\nWhile not a franchise best, this is still a very solid debut. As the previous film teased, the introduction of Shadow was key to the hype. Adding Keanu Reeves to the mix was also a strong choice to get the Internet going wild. It's a film where Paramount aggressively campaigned and got people talking. The fact that there were 3 ***Sonic*** films in the span of almost five years is impressive, especially when the third film has the strongest reviews so far. While it might sound disappointing that the film didn't outperform the second film, at least it has the December excuse. \n\nAccording to Paramount, 59% of the audience was male and 43% was in the 18-34 demographic. They gave it a strong \"A\" on CinemaScore, which is the same score as the previous films. Despite its lower-than-expected opening, it's gonna have some legs through the holidays. For now, $200 million should happen. Paramount clearly believes in the franchise; they already announced development on a fourth film before the film even opened. \n\nHaving to settle for second place, Disney's ***Mufasa: The Lion King*** earned just $35.4 million in 4,100 theaters. That's down a massive 82% from the 2019 film, which broke so many records back then. Even if we have to accept that December lowers the opening weekend numbers, that's still a horrible drop.\n\nDisney clearly believed in the potential of the 2019 ***Lion King*** remake. After all, it earned $1.6 billion worldwide. But the thing is that the film's reputation is not the same as it was 5 years ago. The audience liked the film and ate it up, but like a lot of live-action remakes, the audience moved on afterwards. All while the criticism for the 2019 film just increased. \n\nBut still, how can it explain a 82% drop? Even if we have to ignore the fact that people moved on from the 2019 version, there's the fact that this is completely new story with new songs. There's no nostalgia to be milked here, and the prequel aspect is also a double-edged sword; we already know Mufasa and Scar will live and eventually become enemies. Audiences can simply skip the film and won't really miss anything, unless you're insanely passionate to learn questions like... how did Rafiki got his staff? Even with the presence of a fantastic filmmaker like Barry Jenkins, you can tell this was just a paycheck; it's sitting at a weak 57% on RT. So if you didn't care or forgot about the 2019 film, there are no reasons to check this out.\n\nAccording to Disney, 54% of the audience was female and 39% was in the 18-34 demographic. They gave it a fine \"A–\" on CinemaScore, which is lower than the previous film. Even if the film legs out to a 6x multiplier, that would still be just $212 million, which is like 60% down from the previous film. Needless to say, it's unlikely there will be a third ***Lion King*** film.\n\nUniversal's ***Wicked*** was on third place, easing just 38% and adding $14.1 million. That takes its domestic total to $384.5 million, and it should continue holding incredibly well through the holidays.\n\nAfter topping the box office for three weekends, ***Moana 2*** was hit by ***Sonic*** and ***Mufasa***. The film fell to fourth place, and it had another rough drop, officially losing to ***Wicked*** on the weekends. This time, it fell 50%, adding $13.2 million this weekend. While the film has had a huge opening weekend, the legs are leaving a lot to be desired. The film has made $359.1 million, and it has zero shot at hitting $450 million domestically. That's quite disappointing, signaling that the film was very front-loaded.\n\nAngel Studios also released ***Homestead*** this weekend. Opening in 1,886 theaters, it earned a solid $6 million. While critics lambasted the film, the audience gave it a middling \"B\" on CinemaScore. It should hold well thanks to the holidays, but it would be a surprise if it came anything close to $30 million by the end of its run.\n\n***Gladiator II*** is still showing some legs, even if they arrived a little too late to make a difference. The film dropped 40%, adding $4.5 million this weekend. The film has made $154 million so far, and the holidays should get it to around $170 million.\n\nAfter its pathetic debut, ***Kraven the Hunter*** didn't save face on its second weekend. The film earned just $3 million, which marks a horrible 72% drop, almost on par with ***Morbius***. Through ten days, the film has made a poor $17.3 million so far, and with four films opening in wide release, it will continue falling. Even with the holidays, it'd be a surprise if it made much more than $25 million domestically.\n\nAmazon's ***Red One*** had its worst drop so far, falling 65% and earning only $1.4 million. With more theater drops on the way, it's now guaranteed to finish below $100 million, which is quite disappointing.\n\nSo ***Kraven*** had a horrible drop, yet ***The Lord of the Rings: The War of the Rohirrim*** was ready to introduce itself. It made just $1.2 million this weekend, which is a horrible 73% drop and the worst drop in the franchise. The film has earned a meager $7.3 million, and it's gonna struggle to hit $10 million lifetime, which is just pathetic. Just a few minutes ago, it was announced that the film will hit digital at home on December 27, just 2 weeks of theatrical exclusivity. Ouch.\n\n***The Best Christmas Pageant Ever*** rounded up the Top 10, earning $780,000 this weekend. That takes its domestic total to $38.4 million. It has a few more days to make money before completely free falling.\n\nA24's ***The Brutalist*** debuted in 4 theaters. Despite its commanding 215-minute runtime, the film earned $266,791, which translates to a very strong $66,698 per-theater average (third best of the year). With strong awards buzz on the way, the film will continue expanding in the coming weeks.\n\n#**OVERSEAS**\n\nIn some consolation, ***Mufasa*** topped the foreign box office. Even though that's by default; ***Sonic*** didn't debut in any market, opting to start its international run on Christmas.\n\nWith that out of the way, ***Mufasa*** debuted with $87.2 million in the overseas markets, for a $122.2 million worldwide debut. That's far below the projected $180 million debut, and a far cry from the original. It had soft debuts across the world, with its best numbers in China ($7.8M), France ($7.7M), Mexico ($7.1M), the UK ($5.5M) and Germany ($5M). Even with the benefit of holidays, it's tough to see the film making much more than $600 million worldwide, more than $1 billion below the 2019 title. Which means it will break the record for the biggest sequel-to-original drop.\n\n***Moana 2*** added $32.8 million this weekend, as its worldwide total is nearing $800 million. The best markets so far are France ($46M), UK ($37.6M), Germany ($29M); Mexico ($26.2M) and Brazil ($24M). That billion is gonna take a few more weeks.\n\n***Wicked*** added $12.6 million this weekend, taking its worldwide total to $572 million. The best markets are the UK ($60.8M), Australia ($22.5M), Korea ($13.1M), Mexico ($9.6M) and Germany ($8M). \n\nIn some notable news, ***Gladiator II*** has finally crossed $400 million worldwide, with a $416.3 million run so far.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEK**\n\nWe'll have four films hitting wide release.\n\nThe first is Robert Eggers' new film ***Nosferatu***, a remake of the 1922 film. Eggers is coming off ***The Northman***, which was his highest grossing film. Even though it wasn't theatrically successful, it was reported that it broke even through ancilliaries, which is why this film exists. Pre-sales are very strong for its opening day, and with fantastic reviews so far, it looks like Eggers might have a new highest grossing film.\n\nAnother release is Searchlight's ***A Complete Unknown***, which stars Timothée Chalamet as Bob Dylan. The film has earned very good reviews, but Chalamet has received acclaim so far, building strong awards buzz. Perhaps we're looking at another sleeper hit.\n\nA24 is also releasing ***Babygirl***, which stars Nicole Kidman and Harris Dickinson. Once again, another title with decent reviews so far, and Kidman earning Oscar buzz for her performance.\n\nThe final title is Amazon's ***The Fire Inside***, which marks Rachel Morrison's directorial debut, written by Barry Jenkins. The film stars Ryan Destiny and Brian Tyree Henry, and follows the true story of American professional boxer Claressa \"T-Rex\" Shields as she trains for the 2012 Summer Olympics. Amazon's ***The Boys in the Boat*** performed quite well last year, so perhaps this could surprise.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 71,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wFGUs2fqXnoz34Csnmk0CxkDpAHLyF8g1YQUCh8Lvq0.png?auto=webp&amp;s=b09b32366c077c8ba739f38a3628063c4640d380"
        },
        "permalink": "/r/movies/comments/1hkx7rr/december_2022_box_office_recap_sonic_the_hedgehog/"
    },
    {
        "id": "1hk2j4a",
        "author": "HeavierTrip",
        "title": "Hello! We're Jukka Vidgren and Jusso Laatio, writers/directors of HEAVIER TRIP, a comedy about death metal band Impaled Rektum and sequel to 2018's cult hit HEAVY TRIP. Ask us anything! We'll be back to answer your questions Monday 12/23 at 12 PM ET!",
        "content": "",
        "upvotes": 81,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/88lpt1otkf8e1.jpeg?auto=webp&amp;s=ae4d66a7e5a236000053603d5f0a81e11005305a"
        },
        "permalink": "/r/movies/comments/1hk2j4a/hello_were_jukka_vidgren_and_jusso_laatio/"
    },
    {
        "id": "1hkytk8",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s Next Movie is an Adaptation of Homer’s 'The Odyssey'",
        "content": "",
        "upvotes": 10105,
        "comments": 1335,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aII8wcddxsfzksSiagxGj6JKRFQA8yQVH28t-bHWmsE.jpg?auto=webp&amp;s=01b2449f0602ec09416d4e83589cbd5390455e07"
        },
        "permalink": "/r/movies/comments/1hkytk8/christopher_nolans_next_movie_is_an_adaptation_of/"
    },
    {
        "id": "1hknmwz",
        "author": "MarvelsGrantMan136",
        "title": "Burt, Reptilian Star of ‘Crocodile Dundee,’ Dies at More Than 90 Years Old",
        "content": "",
        "upvotes": 11904,
        "comments": 239,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wn3OiPKG4SNCYhlIDIlqgq_zeFQFBBKJOp7r_wnTGrM.jpg?auto=webp&amp;s=9c2e1616b90220a5a809f9440b74568da2f93c98"
        },
        "permalink": "/r/movies/comments/1hknmwz/burt_reptilian_star_of_crocodile_dundee_dies_at/"
    },
    {
        "id": "1hkx04d",
        "author": "DemiFiendRSA",
        "title": "‘Lord Of The Rings: The War Of The Rohirrim’ Heading Into Homes on December 27 After 14-Day Theatrical Window",
        "content": "",
        "upvotes": 1299,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GrjtM2b4BkvkJ0R74xDGNam5x93ifp_5ySmnpd8UwOY.jpg?auto=webp&amp;s=2ef8a0fe3b7d0ab3a895b18e1c624d738743beec"
        },
        "permalink": "/r/movies/comments/1hkx04d/lord_of_the_rings_the_war_of_the_rohirrim_heading/"
    },
    {
        "id": "1hl29op",
        "author": "MarvelsGrantMan136",
        "title": "Alec Baldwin Manslaughter Case Is Over, as ‘Rust’ Prosecutor Drops Appeal",
        "content": "",
        "upvotes": 407,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/96tYviSJwfPyEriLFcKOffr_Km6PjzaMbfJKTUBdJXs.jpg?auto=webp&amp;s=41f4d703bf826fcbae3e5bfd13129ec7bd30d8a3"
        },
        "permalink": "/r/movies/comments/1hl29op/alec_baldwin_manslaughter_case_is_over_as_rust/"
    },
    {
        "id": "1hktwu8",
        "author": "egnards",
        "title": "We went to the movies 54 times this year [2024], and here are my personal feelings about those films.",
        "content": "**Previous Years**\n\n[2023](https://www.reddit.com/r/movies/comments/18s4re1/we_went_to_the_movies_55_times_this_year_and_here/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)  \\-  [2022](https://www.reddit.com/r/movies/comments/zgw1vo/we_went_to_the_movies_39_times_this_year_and/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\nThis is now my third year doing something like this, and I really enjoyed talking to people last year about where my movies fell versus where they felt things needed to land. There were definitely a few criticisms last year that I'd like to clear up beforehand:\n\n* I do view myself as a \"typical moviegoer\" and don't see myself as a cinephile at all.\n* My wife and I tend to go during the weekends at daytime hours, it's just our preference, which does limit us sometimes with movies that aren't as popular and are in their 3rd-4th week of a run.\n* There are a lot of movies we'd like to see but don't get around to just because a smaller release happens during a time where we're very busy and don't get to the theater for a few weeks.\n* Many of you were critical of the fact that I often took small naps during movies - It never bothered me, but I did find out that I was vitamin D deficient early this year, and taking vitamins has helped out a lot\n* This list does include movies from 2023 that I either saw at the beginning of 2024, or we saw in 2023 after releasing my list last year.\n\n**A Quick Note on Categories:**\n\nOther than \"Favorite of the Year\" I don't particularly have other categories ranked top to bottom in terms of favorite. There are movies in the \"Enjoyed it, but Probably Wouldn't Watch Again\" category that I liked better than movies in the \"Enjoyed it and Would Watch Again\" category, but I prefer fun and more relaxed movies for multiple viewings.\n\n# Favorite of the Year [Ranked in Order]\n\n* **My Old Ass:** I expected to like this one, as a comedy. . .But I came out of the theater with tears in my eyes. Yea sure it's about a drug induced romp \\[on the surface\\], but as I get older I feel this one really spoke to me on a deeper level.\n* **We Live in Time:** I don't know if I'll ever watch it again. It doesn't strike me as the type of movie that I am going to want to watch a second time, just because of the subject nature and how deeply sad it is. . .But it moved me pretty significantly as is the second time I've ever found myself crying at a movie theater.\n* **Lisa Frankenstein:** I was surprised to learn some people really hated this one, because I think it was the perfect amount of fun. . and weird. . .and campy.\n\n# I Enjoyed it and Would Watch Again\n\n* **Deadpool &amp; Wolverine:** It's just a fun love letter of a movie, right? I don't go to a Deadpool movie expecting everything to make sense. I just want a good old fashioned 4th wall breaking bromance, and this movie delivers.\n* **Saturday Night:** The movie has a very frenetic energy to it and didn't give me a lot of breathing room to process different things going on, which is something that I typically don't enjoy. For some reason \\[maybe it's the fact that I do watch SNL and kind of have that expectation anyway\\] it just works, and I'd probably want to watch it again to see what nuances I might pick up on.\n* **Inside Out 2:** Inside Out 2 does a far better job \\[in my opinion\\] of being a fun Disney sequel than Moana 2 does. I think I'd need to watch both entries of this franchise back to back to really decide which one I like better.\n* **Heretic:** I don't know if I ever thought I'd see Hugh Grant in a horror movie like this. It hits all the notes that I expect from the genre, but I really liked the Book of Mormon x Horror vibe, and the almost chess like mentality his villain hits throughout the entire movie.\n* **Fly Me to the Moon:** We live in a time where people just make shit up, so even though this takes place before the moon landing, it still sort of felt topical. . .Except it's also a very funny comedy.\n* **Speak No Evil:** I'm writing this after writing a few other similar thoughts further down the list - Once again, another movie that feels totally ruined by the trailers. . Why do they keep doing this to us? Except it honestly doesn't even matter. The movie just works. . I'd watch it 10 more times just to see if I pick up on anything in the background.\n\n# Enjoyed Far More Than I Expected\n\n* **Kingdom of the Planet of the Apes:** I saw and enjoyed the first remake but have become disillusioned by the movies with each passing sequel. I really didn't think this would be very interesting, but was happily very surprised.\n* **Civil War:** Given the political climate of The United States around the time that this started to promo/release, I was very nervous as to this one having a bullshit political agenda \\[for either side\\]. Given that it did not, and took steps to really make sure the audience couldn't try to pull an agenda out of it, I was able to fully enjoy the romp.\n* **Gladiator II:** I'm getting sick of these 20 years later sequels and really had very low expectations for the movie. I don't think it's the amazing film my wife thinks that it is, but I was definitely. . .Entertained.\n* **Trap:** I was really annoyed by the trailers for this movie, which seemingly gives away \"the big reveal\" and ruins the entire thing - Except they pull back that curtain very early in the movie, and it's a non issue. Really enjoyed this way more than I expected to.\n* **The Fall Guy:** This is one of those movies I went into ready to be annoyed, because I had seen promos for it way too many times and was just sick of seeing that stupid trailer over and over again. I just had zero expectations going in and was pleasantly surprised. At the time of this blurb I think I've seen it 3 times, which is unusual for me.\n* **Wicked:** Coming off the heels of Mean Girls. . And Dear Even Hanson. . And pretty much all modern Broadway movies, I had almost no expectations at all for this one. I love Broadway, and was ready to nap my way through it. . .Though Wicked definitely proved me wrong, that you can do a musical correctly.\n* **The Iron Claw:** If you told me I'd ever feel bad for a jacked up Zac Efron I would have laughed at you, and yet here we are. The only thing that stops this from being a top contender for me is that technically it came out last year, though I saw it after that list.\n* **Alien: Romulus:** I know I'll be crucified for saying this, but I've never seen a full Alien movie all the way through. It just wasn't ever my thing, though we both really enjoyed it. I have since wanted to make my way through a chronological of the entire series, though have found myself lacking time to get around to it.\n* **I Saw The TV Glow:** This is a movie that I didn't expect very much from, other than having a weird nostalgia feel to it. I really enjoyed most of it, but as it started to get really trippy towards the end it lost me.\n* **Twisters:** On the list of movies that I ever thought would get a sequel this far down the road? I mean Twister seems like an easy enough candidate with a very generic premise, but I never really imagined it would happen. . .And yet it works. . .It works because it's no more a sequel of Twister than any generic disaster movie is \\[not\\] a sequel to another generic disaster movie of the same disaster. . . Does that even make sense? I don't know, but it was fun.\n\n# Enjoyed it, but Probably Wouldn't Watch Again\n\n* **Here:** The movie is just different, unlike anything I've ever seen before. I don't know if the gimmick is worth a second viewing, but it captivated me on the first one.\n* **Red One:** Generic holiday action romp, we've been getting a bunch of these in the last few years. Glad I saw it, don't regret the time spent. . .Might get 2-3 minutes of my time if I'm ever flipping through channels and it happens to be on.\n* **A Real Pain:** If I wasn't limiting myself to 3 movies in \"Favorites of the Year,\" this would probably be number 4. . Though The ambiguity of the ending feels pointless \\[there really isn't much to think about in that regard\\]. \n* **Arthur the King:** This is probably the first movie that has ever made me legitimately cry. I walked out of the theater nearly bawling. I give it props for that, but I have no desire to subject myself to it again.\n* **American Fiction:** I'd say the first 2 acts of the movie are almost perfect, but I really didn't care for the way they did the ending in multiple paths. Like. . I got it from an author perspective, but I just don't feel like it worked.\n* **Challengers:** I think my wife has probably seen this 5 times since it came out. I don't know if I can watch it again. Its a slower moving film, which isn't really my thing - I enjoyed it, I liked it a lot actually, but I don't think I'll be returning to the couch to see it again.\n* **Babes:** It's funny in the same way all of those comedies about a very specific situation being dramatized for comedy are funny. The movie works because its a premise that I haven't seen before. But I don't think the magic will work a second time.\n* **Dune: Part Two:** Look, both Dune movies are very good. . And yea I've read the source material, but they're also very long and slow. I'm glad I saw it, but I don't need to watch it again.\n* **The Bikeriders:** I'll be honest - I write these things at the end of the year, because I want to focus on the feelings of my experience, and not really the plot itself. . .And while I remember enjoying it, I also remember thinking it was very long; but other than that I couldn't give you much else.\n* **Blink Twice:** Blink Twice covers some rough themes that people don't typically want to think about, but the movie works as a crazy drug induced thriller. There's a decent revenge payoff, and I go home happy.\n* **Bob Marley: One Love:** No idea how accurate the movie is, but it's a fun ride.\n* **Sonic The Hedgehog 3:** It's cute, just like the first 2. The story is pretty basic but I appreciate it's the type of movie that is made for kids, but the writers didn't forget that Sonic is a 90s icon, and that its older fans would be watching it too.\n\n# The Mediocre Movie I Expected it to be\n\n* **Beetlejuice Beetlejuice:** It hits a lot of the notes you need a sequel like this to hit, but I also felt like everything was reductive and surface level. We went with the in-laws, who loved it, but I didn't think it was that great.\n* **Venom: The Last Dance:** Just like Venom 1 and 2 it has its moments - I'm not sure if 2 or 3 is the weaker movie, and I almost certainly will never watch it again, but I don't regret the time. . Or the laughs.\n* **It Ends with Us:** I might be biased because my wife dragged me to this on the same weekend I dragged her to Borderlands, which maybe artificially props up my feelings of it - But I didn't totally hate it. \n* **A Quiet Place: Day One:** Is Day One necessary? Probably not. But I think it's definitely a better entry into this mythos than the sequel was.\n* **Monkey Man**: Indian John Wick. . .It's decent, but nothing I haven't seen before.\n* **Longlegs:** The movie isn't scary, and it's not really much of a thriller, but it certainly is creepy and Nicholas Cage has always played the weirdo card really well. . .Or that's just who he is.\n* **Abigail:** It's just fun - There's nothing special about it - The reveal in the end isn't anything interesting, hell the ending itself is confusing with all the back and forth. But there are vampire ballerina kids, and that's just the kind of silliness we need sometimes.\n\n# Expected More and Left Disappointed\n\n* **MaXXXine:** Two years ago X was one of my top movies of the year. And even Pearl with all of its Wizard of Oz whimsy felt like a pretty strong movie. It's not that MaXXXine is a bad movie, I just expected more than a semi-generic horror/thriller. It felt as though the movie itself was written to be its own thing and the X mythos was just tacked onto it before shooting.\n* **IF:** I don't really know what I was expecting with this one. . .But I always sort of hoped it would be some kind of Fosters Home for Imaginary Friends x Ryan Reynolds movie. It sort of just felt like too much was going on, and not enough was going on. . All at the same time.\n* **Ghostbusters: Frozen Empire:** Afterlife may have been really reductive of previous Ghostbusters movies, but it was enjoyable and fun. Frozen Empire was just flat the entire time and at 2h4m it felt about 45 minutes longer than necessary.\n* **The Book of Clarence**: I can't quite tell if this movie just wasn't for my particular audience, or if it just wasn't very good. But it felt very long and confusing the entire way through.\n* **Imaginary:** Generic gimmick horror movie is generic gimmick horror movie. Nothing special, move along.\n* **The Watchers:** I don't know why I expected more, that's stupid of me. I don't actually hate The Watchers, but I do think the whole ending is kind of stupid.\n* **Y2K:** I wasn't expecting a masterpiece with this one, but I thought it would be a fun nostalgia trip. I do think the first 20-30 minutes are super solid, but once we start getting into the \"AI takes over the world\" problem the whole thing sort of just falls apart, and none of the payoff feels earned.\n* **Moana 2:** The original is a true favorite of mine, but this one feels like it's exclusively for the kids. And that's totally fine, just wasn't for me.\n\n# Didn't Expect Much, and Got What I Expected\n\n* **The Crow:** I've actually never seen the original The Crow \\[I know\\] but I typically don't expect much from remakes/reimaginings anyway. There were parts that I \"didn't hate\" but overall it fell flat for me.\n* **Mean Girls:** Mean Girls, the Broadway Show, is really good. This entire movie felt flat with a lot of the songs pushed into more monotone registers to makeup for hiring talent that didn't have very high vocal range. . Other than Renee Rapp. I also felt like a lot of the nods to the original movie were done in an \"ok fine we have to\" way, instead of honoring the source material.\n* **The Front Room:** I didn't expect much. . Actually I don't know what I was expecting. . .Certainly it wasn't a seemingly ancient woman shitting herself constantly. It felt like The Front Room kept building to something that never paid off.\n* **Immaculate:** Sydney Sweeny starring in \"i'm hot, oh but also I'm a nun that fucked up.\" The movie has no substance to it and I was grateful when it was over. The only thing saving it from Worst of the Year is just how bad some of those movies are.\n\n# Worst of the Year\n\n* **Night Swim:** I liked the premise of this one and really wanted to like it, but it just felt like it was missing pretty much everything a good horror movie needs.\n* **Madame Web:** This movie doesn't deserve my thoughts or punctuation\n* **Borderlands:** I didn't expect Borderlands to be a good movie at all - It's one of my favorite game franchises and I had no hope that Hollywood wouldn't screw it up, but I was at least hoping for something that made sense and might hit the \"so bad it's good\" point. The movie is just bad, and oddly the one casting choice everyone thought made no sense \\[Kevin Hart\\] is the one casting choice that I felt actually worked.\n* **Argylle:** This may be the worst movie I've ever seen, and I used to make a point to watch some of the worst movies \\[as reviewed on IMDB\\] as a fun group activity with friends. At no point in its incoherent rambling did Argylle make any sense, and I wish it would be erased from my brain.\n\n**Note:** At roughly $23/m for the AMC subscription that means I spent about $5/ticket to see each movie. My wife sometimes do buy concessions \\[sometimes with points, sometimes without\\], maybe next year I'll track that too, just to see how expensive a hobby this actually is.\n\n**Movies we will probably see in the next week:**\n\n* Mufasa\n* A Complete Unknown\n* Nosferatu\n* Babygirl",
        "upvotes": 270,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1hktwu8/we_went_to_the_movies_54_times_this_year_2024_and/"
    },
    {
        "id": "1hkmeed",
        "author": "Marisssssa2021",
        "title": "Stranded on an Island, you can take only a few movies with you. The only catch? They must combine for a Rotten Tomatoes score of 100% or lower.",
        "content": "Using the Tomatometer score, and you can pick any number of movies you like. As a bonus, can also take one film with 0%, if you so please. Here’s my lineup as an example.\n\nThe Life Aquatic With Steve Zissou (57%)\nThe Wicker Man (15%)\nFreddy Got Fingered (12%)\nJoe Dirt (9%)\nMiss March (5%)\nEpic Movie (2%)\n\nLife Aquatic is one of my favorite films and is definitely doing the heavy lifting. I wanted a wider range of films, but with only 43% to go around, I had to rely on 2000s comedic flops who’s stupidity seems to bother the film critic community a lot more than it bothers me. I’m a bit of a sucker for 2000s  unnecessarily raunchy and/or cringe, intentional or not (looking at you, wicker man).\nFor fun, I’ll make Fred: The Movie (0%) my bonus pick, as the guiltiest pleasure in a whole host of guilty pleasures.\n\nDefinitely harder than I thought, but was a fun exercise. Interested to see what people do with this.",
        "upvotes": 682,
        "comments": 387,
        "media": null,
        "permalink": "/r/movies/comments/1hkmeed/stranded_on_an_island_you_can_take_only_a_few/"
    },
    {
        "id": "1hknzwb",
        "author": "Amaruq93",
        "title": "Disney's \"20,000 Leagues Under the Sea\" at 70 | How legendary writer Jules Vernes defined a Hollywood golden age of Sci-Fi movies",
        "content": "",
        "upvotes": 322,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tOEI1VRn1EoAlURkksRrk911OFqjWK_VMb3TurNT9fg.jpg?auto=webp&amp;s=ae9477311bfe4064da5edaae2ef6c413f7ce40a4"
        },
        "permalink": "/r/movies/comments/1hknzwb/disneys_20000_leagues_under_the_sea_at_70_how/"
    },
    {
        "id": "1hk8e7w",
        "author": "NeonBuckaroo",
        "title": "National Lampoon’s Christmas Vacation hits different when you’re older",
        "content": "Just watched it - first Christmas a married man and kid on the way. Grew up with this film - holds up as hilarious and stupid as ever. But saw it differently this time.\n\nFrom the moment Ellen says “I know how you build things up in your mind” to the ending where Clark says “I did it” and it’s the only part not followed up with a punchline.\n\nJust brilliantly encapsulating the Christmas spirit and a feel good reminder that it’s okay to feel pressed at this time of year. \n\nAfter all, we can always have a lot of help from Jack Daniels.\n\nMerry Christmas all! ",
        "upvotes": 6753,
        "comments": 997,
        "media": null,
        "permalink": "/r/movies/comments/1hk8e7w/national_lampoons_christmas_vacation_hits/"
    },
    {
        "id": "1hkia69",
        "author": "Super-Cry5047",
        "title": "Best Lines Spoken Right Before Dying In Film ",
        "content": "Was watching John Woo’s Hard Target. Lance Hendrickson gets a grenade down his pants. He fishes out the grenade and unscrews the top. He pulls the fuse from the base and holds it there, laughing. Then, a spark between the fuse and the base ignites the grenade. His last line as he watches the spark ignite is: “Whoop!” And then he explodes. \n\nReminds me of Gary Oldman in The Professional just saying “Shit.” As he uncovers a vest of grenades on Léon.\n\nWho else has awesome end lines? \n",
        "upvotes": 703,
        "comments": 1134,
        "media": null,
        "permalink": "/r/movies/comments/1hkia69/best_lines_spoken_right_before_dying_in_film/"
    },
    {
        "id": "1hkp1ic",
        "author": "nandu79",
        "title": "Filmmaker Shyam Benegal passes away",
        "content": "Shyam Benegal dead ",
        "upvotes": 170,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q-t97Rju2dNmiBKcSfasTbfeoJdZXvVd9WqjE-l2xiQ.jpg?auto=webp&amp;s=8d2fe1acaaf163e15debae6c1caa8652b8114d94"
        },
        "permalink": "/r/movies/comments/1hkp1ic/filmmaker_shyam_benegal_passes_away/"
    },
    {
        "id": "1hkt3r6",
        "author": "NoCulture3505",
        "title": "The Animation Guild Ratifies Deal With Studios",
        "content": "",
        "upvotes": 63,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r0dRyM9J1nBSftEu0awqXZVQ4FK4_X4WdLguMVi8Exg.jpg?auto=webp&amp;s=9f03115791f75b59bc98544c394ab095aee8a27c"
        },
        "permalink": "/r/movies/comments/1hkt3r6/the_animation_guild_ratifies_deal_with_studios/"
    },
    {
        "id": "1hkf2vj",
        "author": "eggflip1020",
        "title": "I just reached The Fugitive. Great googly moogly. ",
        "content": "*edit: Rewatched* autocorrect is wild these days\n\nSpoilers for a 31 year old film. \n\nI like that Hollywood is starting to play around mid-budget, little to no vfx, “dude dropped into a crazy situation” movie. \n\nA couple of recent movies that spring to mind are Hitman and The Killer. Denzel in The Little things, Plane, The Madness series, and that Jake Gyllenhall court drama thing on Apple. Even more recently was Nicholas Hoult in both Juror #2 and The Order, the latter in which he was a categorical bad guy version of the role. \n\nAlso made me think, damn I know it’s a movie but it made wonder how many people have gotten dropped into some insane circumstance in real life and didn’t get out it. ",
        "upvotes": 697,
        "comments": 229,
        "media": null,
        "permalink": "/r/movies/comments/1hkf2vj/i_just_reached_the_fugitive_great_googly_moogly/"
    },
    {
        "id": "1hk9kh9",
        "author": "HeStoleMyBalloons",
        "title": "Diane Delano Dies: ‘Northern Exposure’, ‘Popular’ &amp; ‘Wicker Man’ Actor Was 67",
        "content": "",
        "upvotes": 1491,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xvN8lk7SH4yV5T7jBolFrm30nzEjuEvxxeWSKjkoYFk.jpg?auto=webp&amp;s=145a26a2d115d8c002615743eb5199053dbbe1ce"
        },
        "permalink": "/r/movies/comments/1hk9kh9/diane_delano_dies_northern_exposure_popular/"
    },
    {
        "id": "1hkwq0e",
        "author": "PGP-",
        "title": "What team are you on from Jingle All the Way?",
        "content": "Are you on Howard's team or Myron's team? As a kid I was all in on team Howard, as an adult my opinion has totally changed and now I'm team Myron all the way! \n\nI feel it's one of those films that changes the way you view it as you age and gain more life experience, at least thats how it is for me lol. What do you guys think? What team were you on and has that changed over time? \n\nGreat film btw, a lot of fun. 😁 ",
        "upvotes": 27,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1hkwq0e/what_team_are_you_on_from_jingle_all_the_way/"
    },
    {
        "id": "1hks06k",
        "author": "book-nerd-2020",
        "title": "Bringing ‘One Hundred Years of Solitude’ to the Screen Took Decades—Here’s Why",
        "content": "",
        "upvotes": 38,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5U1d1Pr4-DTnwbErhm1l1hBnENsuCBp5lgv1cNhyiHA.jpg?auto=webp&amp;s=33a08a092cdc535203b160ef304c9dfc86a70656"
        },
        "permalink": "/r/movies/comments/1hks06k/bringing_one_hundred_years_of_solitude_to_the/"
    },
    {
        "id": "1hk7xju",
        "author": "cmaia1503",
        "title": "Art Evans, ‘Die Hard 2’ and ‘A Soldier’s Story’ Actor, Dies at 82",
        "content": "",
        "upvotes": 1063,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_8lz9do6tEMzWKJUU_tzCyZIhzeQcJP1GdLqvX-tpNE.jpg?auto=webp&amp;s=bf28aff8e30ef2eb709c66c936f1d0e00cd306de"
        },
        "permalink": "/r/movies/comments/1hk7xju/art_evans_die_hard_2_and_a_soldiers_story_actor/"
    },
    {
        "id": "1hklhs2",
        "author": "thesmartcoolguy",
        "title": "I think Arthur Christmas is the BEST Christmas movie ever.",
        "content": "You guys I beg if you have a Stan subscription to watch on Christmas Eve. The film gives you so much Christmas vibes. The film is kid friendly while not being kiddish. Arthur Christmas is a 2011 animated Christmas film produced by Aardman Animations. It focuses on Arthur, the clumsy but well-meaning son of Santa Claus, who works in the high-tech North Pole operation that delivers presents worldwide. In the film, Santa’s modern, gadget-filled sleigh and sophisticated delivery system make the process of gift-giving appear efficient and flawless.\n\nHowever, a mix-up occurs when one child is accidentally missed on Christmas Eve. While Santa and his older son Steve (who runs the operation) don’t see it as a big deal, Arthur is determined to make sure every child receives their gift. With the help of his Grandsanta (Santa’s father, who is old-fashioned) and a team of elves, Arthur embarks on an adventurous mission to deliver the last present in time.\n\nThe movie emphasizes the themes of family, the spirit of Christmas, and the importance of doing the right thing, even if it seems difficult. It’s a heartwarming, humorous tale about overcoming challenges and keeping the magic of Christmas alive.",
        "upvotes": 68,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1hklhs2/i_think_arthur_christmas_is_the_best_christmas/"
    },
    {
        "id": "1hl2iu2",
        "author": "Odd_Advance_6438",
        "title": "The whole opening montage of Watchmen is incredible, and I forgot how tragic it really is",
        "content": "One of my favorite opening scenes, and one of the best sequences Snyder has ever directed. Condenses a really in depth alternate history into a 5 minute sequence set to “the times they are a changin”\n\nWe see the rise and fall of costumed heroes, and after reading the “before Watchmen comics” the fate of the Minutemen seems even sadder. Dollar Bill is killed from his cape getting stuck in a revolving door. Silhouette is killed in a hate crime after revealing her homosexuality. Mothman is forcefully sent to a mental hospital after a mental breakdown. In the corner of the last supper scene, you can see Hooded Justice and Captain Metropolis confiding in one another, a little Easter egg to their own relationship that they always had to keep secret\n\nThere’s something incredibly disturbing to me seeing the images of these cheesy golden age parodies having such dark ends, which I think is really well done. The contrast of Dollar Bill’s bright blue and red starred suit being covered with blood in a very unceremonious situation",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1hl2iu2/the_whole_opening_montage_of_watchmen_is/"
    },
    {
        "id": "1hkirw1",
        "author": "infamousglizzyhands",
        "title": "‘Belle’ Director Mamoru Hosoda’s Princess Tale ‘Scarlet’ Lands at Sony",
        "content": "",
        "upvotes": 109,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HhU_AQsWEwBEQPt9JGasfM62Go_K8W-wv7e85tUXw7c.jpg?auto=webp&amp;s=6035e35a7cb8c514c7fa8decec3a1f89c8fdc577"
        },
        "permalink": "/r/movies/comments/1hkirw1/belle_director_mamoru_hosodas_princess_tale/"
    },
    {
        "id": "1hk0tb1",
        "author": "Amaruq93",
        "title": "\"The Black Hole\" at 45 | A supposed Disney misstep is secretly a Sci-Fi classic",
        "content": "",
        "upvotes": 1954,
        "comments": 231,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pHiL-_iU3bgQ5ACu8mNKtan-oKdIBhrelNwOqskwPaw.jpg?auto=webp&amp;s=40d567e9c0180a5f40afc0d70571e167b6962f96"
        },
        "permalink": "/r/movies/comments/1hk0tb1/the_black_hole_at_45_a_supposed_disney_misstep_is/"
    },
    {
        "id": "1hjrw3i",
        "author": "ICumCoffee",
        "title": "Justin Baldoni Dropped By WME After Blake Lively Files Complaint Accusing Him of Sexual Harassment &amp; Retaliation",
        "content": "",
        "upvotes": 12740,
        "comments": 2993,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/taTmou2e0qXLVLlDuvpecMxSMtiGKFoJmqhctk6C4_Q.jpg?auto=webp&amp;s=baa4514977a12023254e13b32edaa98f27a5479e"
        },
        "permalink": "/r/movies/comments/1hjrw3i/justin_baldoni_dropped_by_wme_after_blake_lively/"
    },
    {
        "id": "1hl1y0p",
        "author": "musecorn",
        "title": "Good movies like Cube?",
        "content": "I love Cube, and that type of movie. I've seen the Platform, the Circle, and shows like Alice in Borderlands for example. Any other recommendations of movies like that, that are actually good? A lot of that type is bad I find. I'm not a fan of horror as much or jump scares, more of the psychological thriller aspect\n",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1hl1y0p/good_movies_like_cube/"
    },
    {
        "id": "1hkvepz",
        "author": "indiewire",
        "title": "17 Best Final Films by Great Directors",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zGotKZ8BihiP7TZY-w-euyUo5S7lHnutkrenTRG015o.jpg?auto=webp&amp;s=a62bf27f331084914efc46d5e04f5d5e58a68abc"
        },
        "permalink": "/r/movies/comments/1hkvepz/17_best_final_films_by_great_directors/"
    },
    {
        "id": "1hl1fgg",
        "author": "ProudReaction2204",
        "title": "The Best Movies About Politics (According to You). Tired of real politics? Try the silver screen instead.\n\n",
        "content": "",
        "upvotes": 2,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ne0pZE7Tgt1j-vJ6AqU8P_wNODLUBl-A0r6hjcdfux4.jpg?auto=webp&amp;s=8d7395eda31655ecfbe91aae0b81322abf33dd42"
        },
        "permalink": "/r/movies/comments/1hl1fgg/the_best_movies_about_politics_according_to_you/"
    },
    {
        "id": "1hk04ab",
        "author": "sami002on",
        "title": "Why the Ending of ‘The Mist’ Still Haunts Me",
        "content": "I recently rewatched *The Mist* (2007), and honestly, that ending still hits like a gut punch. It’s one of the few movies where I genuinely needed a moment of silence after the credits rolled. The sheer hopelessness and irony of the final scene make it unforgettable—and so divisive.\n\nWhat gets me is how the movie perfectly builds the tension and despair, only to deliver an ending that’s so bleak, it almost feels cruel. But that’s what makes it stand out. Love it or hate it, you have to admit it takes guts to go there.\n\nIt’s one of those films that sticks with you, whether you want it to or not.",
        "upvotes": 1377,
        "comments": 555,
        "media": null,
        "permalink": "/r/movies/comments/1hk04ab/why_the_ending_of_the_mist_still_haunts_me/"
    },
    {
        "id": "1hl2npk",
        "author": "pompingcircumstance",
        "title": "Jim Henson's The Christmas Toy ",
        "content": "I saw this recently for the first time even though I'm a fairly big fan of Jim Henson and most muppet adjacent works, I somehow didn't even know about how it's (very understandably) seen as the influence for Toy Story- the idea of toys coming to life when people are absent is quite a broad one that's probably in folklore generally but when a scifi action figure who's oblivious to the fact they're a toy shows up, Toy Story's similarities become pretty glaring. Toy Story details aside it's a pretty great TV movie, with the wamrth whimsy and imagination usually expected of Henson- sudden plotpoints and the overfeaturing of human characters (it'd have been better if they were only heard but never fully seen) are the only faint issues. I recently made a really short video talking about it, I don't make any points there I haven't heard really but for those who prefer that medium it's here [https://youtu.be/28Q\\_iIUIJxE](https://youtu.be/28Q_iIUIJxE) I'll also include an old video from the channel stitch1993 devoted to underrated christmas movies which includes the christmas toy among others [https://www.youtube.com/watch?v=oQxjHGyn9gw](https://www.youtube.com/watch?v=oQxjHGyn9gw) \n\nfeel free to share any memories of watching this special or similar, and happy holidays!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3KDoRFZ6DRCaFfGl06zdfaofUH2LiMg9az0VuduScMk.jpg?auto=webp&amp;s=5a8c31a7a5f0deebad194899852c8e24bd66899e"
        },
        "permalink": "/r/movies/comments/1hl2npk/jim_hensons_the_christmas_toy/"
    },
    {
        "id": "1hkev2e",
        "author": "alienleader57",
        "title": "Die hard (1988) terrorists ranked",
        "content": "The 1988 classic die hard features a wide array of 13 (13 not 12, 13) villains for Bruce Willis to take out but how do they rank aganist each other\n\n13 - Heinrich - he is incharge of - spoiler - putting the C4 on the top of the building and is killed in a fairly boring way by McClane, plus he has no screentime so, here he goes\n\n12 - Alexander - he is the ordinarg looking missle guy who blew up the SWAT RV.\n\n11 - Kristof - does absolutley nothing but he does get the honour of being spared by McClane and being one of two terrorists to survive the night. He is Theo's assistant\n\n10 - James - he is the strong missle guy, he is Alexanders assistant, he along with Alexander are killed when McClane blow them up.\n\n9 - Fritiz is Karls long-haired bodygaurd. He appears a bit throughout the movie and is killed when McClane fires wildly into the lift. \n\n8 - Tony - Karls brother places low because the action scene he dies in is the worst in the movie\n\n7. Franco - getting shot in the kneecaps and landing on glass got him here\n\n6. Marco - \"next time you have the chance to kill someone, don't hessitate\" shoots him \"thanks for the advice.\" This is one of my favourite action scene in the movie and the franchise. such a fun sequence from the shoot out to the police car escaping the gunfire from the other terrorists. Very cool, very fun. Not sure who shot at the car so i am mentioning it here.\n\n5. Uli - he is the person who loves chocolate so much he eats some when preparing for a shootout.\n\n4. Eddie - all right, its just the main 4 left (A.K.A the ones with any plot relevance) so we know the ranking but lets continue anyway. Eddie is pretending to be the secetary for the first half of the movie, hangs around by the vault for the second and has a laugh off with Hans and McClane before he is shot in the head. His actor does a good job, the slight akwardness with the laugh is good, everything is good... but everything can be even more good.\n\n3. Theo - he is the 2nd terrorist to survive the events that took place in nakatomi plaza on christmas eve 1988. It would of been cool if they acknowleged they're survival. Anyway he is pretty darn great, but he has little screentime and like Hans and Eddie, isn't very physical as he never fights McClane.\n\n2. Karl - finally the proper good stuff. Karl is so fun. The way his only goal is to kill McClane, for killing his brother. I mean they didn't need to add that to the movie but they did and his actor gives a pretty good performance, plus his fight with McClane is cool, double plus the way he could get away but doesn't want McClane to survive is pretty cool too. \n\n1. Hans Gruber - go read an article on why he works as a villain, that exists. In short, he is perfect. Top five villains of all time.\n\n\n",
        "upvotes": 111,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1hkev2e/die_hard_1988_terrorists_ranked/"
    },
    {
        "id": "1hl1nnx",
        "author": "ahnmin",
        "title": "Question about The Brutalist",
        "content": "SPOILERS AHEAD:\n\nWhat’s the deal with the niece? Anyone have a read on why her interrogation scene served as the bookends? And why there were so many shots of her in the beginning? There were many closeups of her when she first arrives in the US. Did I miss a plot point?\n- Was it implied that she was not their actual niece?\n- Did she rat them out and that’s how Laszlo and Erzsebet got sent to the concentration camp?\n- Was there some foul play between Laszlo and Zsofia? Erzsebet kept saying “I know what you did, I forgive you.”\n- Or is it just thematic: Zsofia became mute due to her trauma, and in the end is able to overcome it to become a voice for Laszlo and his artistic legacy.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hl1nnx/question_about_the_brutalist/"
    },
    {
        "id": "1hk3jo6",
        "author": "mayukhdas1999",
        "title": "First Image of Chloë Sevigny in 'MAGIC FARM' - A film crew sent to Argentina to profile a musician accidentally ends up in the wrong country. As they collaborate with locals to create a trend, unexpected connections form, while a looming health crisis remains unaddressed in the background",
        "content": "",
        "upvotes": 544,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3ea2t16etf8e1.jpeg?auto=webp&amp;s=d4bb06bd7aa2c4a864e47011106d8b3809ecaf2b"
        },
        "permalink": "/r/movies/comments/1hk3jo6/first_image_of_chloë_sevigny_in_magic_farm_a_film/"
    },
    {
        "id": "1hl2k16",
        "author": "Living-Cap7833",
        "title": "The Santa Clause movie posters (Disney + covers) drop the “the” in the title after the first film",
        "content": "Okay, couldn’t find anyone else in the history of the internet (according to Google search) who ever cared about this, but I do! It’s so annoying that the movie title of THE Santa Clause 2 is shortened to just “Santa Clause 2” on (for example) Disney Plus covers (or whatever you call that placard/image you tap/click to watch the movie). \n\nWhy is it ok to not put the whole title of the movie?! “THE” is part of the title according to everything I’ve read, so the title should be “The Santa Clause 2” on the movie cover. Correct me if I’m wrong, and does this bug you, too? Couldn’t find others complaining about it.\n\nPS: Love the movie.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hl2k16/the_santa_clause_movie_posters_disney_covers_drop/"
    }
]