[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 501,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jo5pen",
        "author": "womanmuchmissed",
        "title": "Survival of the thickest",
        "content": "Older millennial stylist trying to live her fashion dreams in New York. She and her two best friends are in periods of growth in their personal and professional lives. This is a coming of age story but for seasoned adults. The characters are in their 30s, mature and talented but still trying to find their footing. \n\nIf you liked Sex in the City, Girlfriends, Gossip Girl, Entourage, The Game, RHONY, RHOBH, Friends, How I Met Your Mother or any other show about adult friends in the big city, then this show is for you!!!",
        "upvotes": 40,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5pen/survival_of_the_thickest/"
    },
    {
        "id": "1jo7gh8",
        "author": "Pogrebnik",
        "title": "Meryl Streep Is in Talks to Join Greta Gerwig's 'Narnia' Series in Central Role",
        "content": "",
        "upvotes": 29,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jo7gh8/meryl_streep_is_in_talks_to_join_greta_gerwigs/"
    },
    {
        "id": "1joe47u",
        "author": "MythicMythness",
        "title": "Million Dollar Secret: hot takes only",
        "content": "Is it the casting? The editing? Or is it just the nature of the game itself? Not sure, but these folks just don’t come across as very likable. \n\nAnyone else have any hot takes on this newest Netflix game show? \n\n**I’m not trying to soapbox here. I’m not saying they are or aren’t actually likable — they just don’t come across as likable. They’d probably be lovely to stand next to in a line and gab about whatever with. Lol",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1joe47u/million_dollar_secret_hot_takes_only/"
    },
    {
        "id": "1jo5dnk",
        "author": "LushCharm91",
        "title": "'Black Mirror' Season 7 Trailer: Six New Episode Titles Revealed",
        "content": "",
        "upvotes": 17,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5dnk/black_mirror_season_7_trailer_six_new_episode/"
    },
    {
        "id": "1jo3ie2",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Releases New Teaser for ‘The Eternaut’",
        "content": "",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jo3ie2/netflix_releases_new_teaser_for_the_eternaut/"
    },
    {
        "id": "1jns3i1",
        "author": "lydocia",
        "title": "Any series on Netflix that just leave you feeling really bad?",
        "content": "Looking for recommendations for series that just leave you feeling awful, like truly gut-wrenching, depressing, based-on-true-events kind of shows. The kind that aren’t just sad but actually make you sit in silence for a while after an episode ends, just processing everything.\n\nI’m talking about shows that cover real-world tragedies, injustices, or historical events in a way that really sticks with you. Stories that aren’t just entertainment but actually make you think about how messed up the world can be. I know *Dopesick* and *Apple Cider Vinegar* fall into this category, but I’m sure there are plenty of others out there.\n\nIdeally, I’d like something available on Netflix, but if there’s something really good on another platform, I’d still be interested in hearing about it. I just want something that’s powerful, disturbing, and leaves an impact.\n\nAny recommendations? Would love to hear what shows have left you completely drained after watching.",
        "upvotes": 149,
        "comments": 516,
        "media": null,
        "permalink": "/r/netflix/comments/1jns3i1/any_series_on_netflix_that_just_leave_you_feeling/"
    },
    {
        "id": "1jogcqn",
        "author": "Damienisok",
        "title": "Show or movies that are a similar vibe to Locke and key?",
        "content": "Locke and key is one of those shows I thought I wouldn't like but actually turned out good, I really liked the element of the people not having magical powers themselves but their powers instead being a certain object, that was a really big part of what I liked about Locke and key.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jogcqn/show_or_movies_that_are_a_similar_vibe_to_locke/"
    },
    {
        "id": "1joa4sb",
        "author": "Connorb08",
        "title": "Best Watch Party Option in 2025?",
        "content": "Looking for Watch Party apps/plugins that actually work.  Everyone I try breaks or wont sync properly.  What are you using these days?\n\nI have tried Teleparty, Watch2gether, Rave and some sketchy ones.  Not looking for discord or zoom.  Its 2025 and I still cant watch with my GF with ease.  Someone get on this!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joa4sb/best_watch_party_option_in_2025/"
    },
    {
        "id": "1jokbzr",
        "author": "moongonee",
        "title": "Tired of paying for Netflix, Disney+, Amazon Prime and still missing out on the best content? How do you make it work?",
        "content": "I'm starting to feel like I'm caught in an endless cycle of subscription fees. Between Netflix, Disney+, Amazon Prime, and all the other streaming services, I'm paying a fortune—and yet, I still end up missing out on some of the shows and movies I want to watch because of geo-restrictions and blackout windows.\n\nI'm curious: how do you all manage this? Do you subscribe to multiple services, use VPNs, or have you come up with a better workaround to get the complete viewing experience? Share your tips and experiences—I’d love to hear what’s working for you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jokbzr/tired_of_paying_for_netflix_disney_amazon_prime/"
    },
    {
        "id": "1joeuvk",
        "author": "Rbsadie",
        "title": "Don't Come Home",
        "content": "Has anyone else been watching this Thai horror series? I'm really itching to discuss the ending.\n\nSPOILER: \n\nThe time travel aspect left me scratching my head. How on earth did that ending explain the paradox of the mother-daughter switch? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joeuvk/dont_come_home/"
    },
    {
        "id": "1jo252r",
        "author": "Alan_Stamm",
        "title": "'Gone Girls:' Three Things We Learned From Netflix’s New Long Island Serial Killer Doc",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo252r/gone_girls_three_things_we_learned_from_netflixs/"
    },
    {
        "id": "1jo24hn",
        "author": "Alan_Stamm",
        "title": "The Story Behind 'Gone Girls: The Long Island Serial Killer'",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo24hn/the_story_behind_gone_girls_the_long_island/"
    },
    {
        "id": "1jo5cvo",
        "author": "Somethingman_121224",
        "title": "Britt Lower, Milo Ventimiglia, Logan Browning and Erin Richards Have Joined the Cast of Netflix's New Harlan Coben Series",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5cvo/britt_lower_milo_ventimiglia_logan_browning_and/"
    },
    {
        "id": "1jo4nxc",
        "author": "MysteriousDelay6266",
        "title": "The Eternaut | Official Trailer | Netflix | APRIL 30",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo4nxc/the_eternaut_official_trailer_netflix_april_30/"
    },
    {
        "id": "1joet2t",
        "author": "AvatarAntonia",
        "title": "When I log onto or go back to the tab on Netflix",
        "content": "When I do either of those things, for some reason, for 2 weeks or so now it will auto play the top show/game without me clicking on it. I click carefully, but it always happens. Not sure how I can get it to stop.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joet2t/when_i_log_onto_or_go_back_to_the_tab_on_netflix/"
    },
    {
        "id": "1jo23hr",
        "author": "Alan_Stamm",
        "title": "'Gone Girls: The Long Island Serial Killer' [Review]",
        "content": "",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jo23hr/gone_girls_the_long_island_serial_killer_review/"
    },
    {
        "id": "1jo8rlq",
        "author": "evila_elf",
        "title": "Netflix Preview Club - Do we all see the same movies?",
        "content": "I was wondering if we all see the same stuff, or if there is a A group and a B group.\n\nJust got a movie last week. And before that, a series a little over a month before that. Normally get something every two months at the longest.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo8rlq/netflix_preview_club_do_we_all_see_the_same_movies/"
    },
    {
        "id": "1jocret",
        "author": "hereinthedarkness",
        "title": "Change main profile for household?",
        "content": "Hey,\n\nI moved out of my parents' house a while ago, and now I was hit with the \"this device is not part of the household\" message on my TV.\n\nSince I'm the only one no longer living in that household, vs the three remaining members of my family, I was just going to add my own profile as a non-household member with extra payment. The problem is that I'm the account owner, the one who pays for it, and the one whose profile is set as the main profile. Because of this, it won't let me select my own profile to give access to from a different location, only the rest of my family members.\n\nI did some googling, and realized I likely only have the following options, neither of which are satisfying to me:\n\n\\- I make a new account using profile transfer, change email and payment info of the existing account to my parents' -&gt; not great, because then I'll have to pay more for my own account vs just adding the extra cost for one person, PLUS the cheapest option doesn't even come with good quality  \n\\- My family makes a new account for themselves using profile transfer -&gt; same issue where I end up paying more than with the extra member option  \n\\- I make a new profile for myself on the existing account which I add as the non-household member -&gt; I'll lose my viewing history doing this  \n\\- I make a new account, transfer my profile to it, transfer it back to the existing account as a non-household member, cancel the new account -&gt; very convoluted way of doing it, but possibly the best outcome?\n\nSo if anyone can tell me about another option (ideally how to change the main profile, though from my research so far I'm not very hopeful that's actually possible), that would be very much appreciated because I'm already paying half a fortune for this subscription and I'd very much like to actually *use it.*\n\nThanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jocret/change_main_profile_for_household/"
    },
    {
        "id": "1jocihc",
        "author": "mrkinkybilly",
        "title": "La Palma series review on Netflix",
        "content": "This 4 part series about the volcano on La Palma and part of it falling into the Atlantic Ocean and causing a tsunami ~ well it started off really interesting and got me watching it, episode 2-3 were also okey but the last one, episode 4 = shocking and so so rubbish, was like it was rushed and is so unbelievable. Shame really as was pretty good ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jocihc/la_palma_series_review_on_netflix/"
    },
    {
        "id": "1jobx7s",
        "author": "Perfect_Theory6899",
        "title": "Looking for something like slinwalker ranch",
        "content": "Me and my dad are looking for a show of a similar nature to skinwalker ranch, but we want to see something where they actually find the cryptids. Does anyone know a show like this? Thank you for your time, and have a nice day.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jobx7s/looking_for_something_like_slinwalker_ranch/"
    },
    {
        "id": "1joadxr",
        "author": "NoHopeOnlyDeath",
        "title": "Movie Missing?",
        "content": "Was just watching Den of Thieves 2 last night, and when I went to continue today, the movie is just.....gone. Doesn't appear in searches, not in my Continue Watching, and Google links to \"Watch On Netflix\" bring up the standard movie info pop-up complete with my viewing progress bar, but no play button. Other movies work fine. \n\n  \nAnyone else seeing this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joadxr/movie_missing/"
    },
    {
        "id": "1jo8zpv",
        "author": "widdumqueso717",
        "title": "Physical Media Releases",
        "content": "Does Netflix still release physical media for its originals? I know Orange is the New Black is available for home video but has Netflix released any since then? I’m asking because I collect physical media (dinosaur, I know lol) and Netflix has released some sequels that I’d like the own physically. For example, I have the complete series for Luther on DVD and would love to add Luther: The Fallen Sun to my collection. Same thing for Beverly Hills Cop: Axel F, and probably the upcoming Happy Gilmore 2. Anyone know?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo8zpv/physical_media_releases/"
    },
    {
        "id": "1jnsatm",
        "author": "OppositeOctopi",
        "title": "The Walking Dead",
        "content": "Okay I know I'm very late to this party. But. I've been binge watching and I'm at season 3, episode 10. I DONT WANNA DO ANYTHING ELSE! So salty I have to go to work tomorrow so I have to make myself turn this off. ",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jnsatm/the_walking_dead/"
    },
    {
        "id": "1jnwcni",
        "author": "manyiak90",
        "title": "Home page only showing me the game banners for the last few months",
        "content": "Netflix has been promoting only games to me for the last few months. I don't get it, I don't play games and have never shown any interest in Netflix games. But even then, why show me netflix game banners for months at a stretch. I have not seen a single new show/movie being promoted on my home page. I keep having to scroll down or go to the new/popular tab or search for stuff I might want to watch, which is terrible user experience. \n\nIs there a way to remove the banner or make sure I get shown relevant banners on home page?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnwcni/home_page_only_showing_me_the_game_banners_for/"
    },
    {
        "id": "1jnbnsh",
        "author": "South_East_Gun_Safes",
        "title": "Why is every documentary a 3-parter now? This new format of choice seems to stretch out ~1.5hrs of genuine content with repetition and filler.",
        "content": "I’ve watched so many 3 part Netflix docs now that I know the format and they’re far to drawn out to be enjoyable, so avoid them. But now it’s seemingly EVERY new doc!\n",
        "upvotes": 87,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1jnbnsh/why_is_every_documentary_a_3parter_now_this_new/"
    },
    {
        "id": "1job15q",
        "author": "dailystar_news",
        "title": "WWE Raw on Netflix in London LIVE as John Cena returns and The Rock rumoured to appear",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1job15q/wwe_raw_on_netflix_in_london_live_as_john_cena/"
    },
    {
        "id": "1jnz3ux",
        "author": "Idealemailer",
        "title": "Screen intermittently darkens",
        "content": "I've experienced an odd effect like the screen momentarily darkening then coming up to normal brightness while using the Netflix app on android, almost as if I were blinking. Anyone experiencing the same? Is it a bug? Early April fools day joke?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnz3ux/screen_intermittently_darkens/"
    },
    {
        "id": "1job4zf",
        "author": "centpgal",
        "title": "Adolescence",
        "content": "Has anyone seen the scene in adolescence where jamie is slowly getting influenced by the red pill content? Like there was this Andrew Tate scribbly cartoon or something beside him forcing him to do things and such. That was the scene that drew my attention to Adolescence. And I was waiting for that scene in all four episodes and it didn't show up. So I searched up everywhere and it's like it don't even exist. I'm going mad, please help. Was it a dream or am I mixing up with some other show? I'm so much confused.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1job4zf/adolescence/"
    },
    {
        "id": "1jogyf3",
        "author": "BuffaloMushroom",
        "title": "In Netflix's effort to rape grandparents of an extra $12/mo they've made it so every country you visit requires a new account. Absurd.",
        "content": "Recently discovered during a trip to South America &amp; Europe that each country needs its own account registration. Spoke with customer service twice to confirm - when you get the location error you need to close and reopen the account in country\n\nAbsolute madness",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jogyf3/in_netflixs_effort_to_rape_grandparents_of_an/"
    },
    {
        "id": "1jnnmxm",
        "author": "Unprotectedtxt",
        "title": "Million dollar Secret",
        "content": "What happens if someone guesses the millionaire on say episode 2. (I just finished 1) does the person(s) who guesses the millionaire get any money for that? \n\nAlso wouldn’t it have been more engaging if we all (the audience at home) also had to guess and wonder throughout the season? Kinda like how engaging the White Lotus is because we are all guessing right up until the seas final. It keeps to so much more invested. \n\nWe could even all be discussing who we suspect right now. But we don’t cause we know who has the money. \n\n",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jnnmxm/million_dollar_secret/"
    }
]