[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lvd8pf",
        "author": "umudyy",
        "title": "torino",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5vjnq61c4tbf1.jpeg?auto=webp&amp;s=49cdf82353dbf86c3b9622c31d076b100f6dbdf1"
        },
        "permalink": "/r/torino/comments/1lvd8pf/torino/"
    },
    {
        "id": "1luvd6w",
        "author": "Feb-_-",
        "title": "Voglio portare la mia ragazza a vedere Torino",
        "content": "Ciao a tutti, sono M16, la mia ragazza M17, (potete skippare questo paragrafo se volete saltare subito alla conclusione) io vivo in provincia di Alessandria e lei in provincia di Asti, il 26 giugno di quest'anno abbiamo fatto 1 anno e l'ho portata a Torino, il mattino a 2 musei (il museo impossibile e il museo delle illusioni), a pranzo al Sushi Sound (il sito diceva che costava 13,90€, senza parlare del coperto che era di 3€, in piu col cibo di scarsa qualità, e ciò lo ha confermato pure la mia ragazza, insomma, ci siamo trovati male), il pomeriggio invece l'ho portata al parco Valentino, il suo posto preferito di Torino (nel tragitto c'è stata una tempesta di 10 minuti e invece di aspettare sotto al portico, o dentro alla stazione di Porta Nuova abbiamo preso un ombrello a 3€ e abbiamo provato da andare comunque, e oltre al fatto che si sia aperto verso l'alto, è pure volato via lasciando noi sotto la pioggia ma anche sotto ad un ricoedo divertentissimo) e dopo questa avventura siamo andati a fare un giro a via roma (mamma mia una bottiglietta d'acqua 3€), e infine siamo tornati a casa soddisfatti.\n\nBene, io per il 26 luglio la volevo portare all'acquario di Genova, ma questa è un'altra storia. Io volevo chiedergli, visto che ce una caterba di cose da fare a Torino che io non so nemmeno, molto probabilmente, oltre a quello descritto nel paragrafo precedente (ah ops è vero che vi avevo detto di skipparlo, perdonatemi) potreste consigliarmi qualcos'altro da fare in una giornata a Torino visto che (a parte essermi preso i pidocchi, aver incontrato una sudafricana fingersi una napoletana chiedendoci soldi, e aver quasi fatto una rissa contro un barbone, non sto scherzando purtroppo) vorrei riportarla visto che non abbiamo fatto molto quella giornata e considerando che il nostro treno arriva a Torino porta nuova (vi prego non fateci camminare troppo / pagare troppo per il bus)? vi faccio notare cari lettori che siamo in treno e per ora siamo ancora minnorenni, quindi per ora limitiamoci ad una giornata, poi si vedrà, grazie dell'aiuto, per chi risponderà",
        "upvotes": 17,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1luvd6w/voglio_portare_la_mia_ragazza_a_vedere_torino/"
    },
    {
        "id": "1lvdoru",
        "author": "EdgelordMcMeme",
        "title": "Nuovi posti per mangiare bene",
        "content": "Ciao a tutti!\n\nTra poco sarà l'anniversario mio e della mia ragazza e come di consueto andremo a cena fuori. Ho bisogno di un vostro consiglio per trovare posti nuovi dove si mangia bene (ci piace andare ogni volta in un posto nuovo). I miei unici criteri sono che al primo posto il cibo sia buono (ovviamente la cosa più importante), il posto deve essere carino e non una bettola ma senza per forza essere super elegante (anzi, meglio se non eccessivamente elegante) e che abbia un buon rapporto qualità prezzo. Poi per quanto riguarda il tipo di cucina va benissimo qualsiasi cosa, anche se lei penso preferisca cucina tradizionale piemontese (ma se avete in mente altre proposte che fanno altro ditele pure). Voi che posti consigliereste?\n\nUnica cosa: non scrivete Scannabue in duecento perchè lo conosco già e vorrei provare un posto che non ho mai provato.\n\nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lvdoru/nuovi_posti_per_mangiare_bene/"
    },
    {
        "id": "1lvc0xs",
        "author": "serReakt",
        "title": "Patente B - Aiuto!",
        "content": "Devo fare domanda per la patente B e vorrei sapere quali sono i passi da seguire. Devo fare tutto da zero, teoria, pratica, ecc. Inoltre, ci sono dei requisiti particolari per potersi iscrivere all'esame?\n\nLavoro a tempo pieno e l'ufficio della motorizzazione è aperto solo dalle 8:30 alle 11:30, quindi mi farebbe davvero comodo avere qualche informazione prima di andarci solo per chiedere.\n\nMi sono trasferito di recente ad Asti, ma il suo subreddit è poco attivo, quindi sto scrivendo qui. Se c'è qualcuno di Asti anche in questo gruppo, mi farebbe piacere avere qualche dritta specifica!\n\nGrazie in anticipo!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lvc0xs/patente_b_aiuto/"
    },
    {
        "id": "1luyl8u",
        "author": "Frengo_17",
        "title": "Come si vive in via Ormea?",
        "content": "Ciao a tutti, sono uno studente che presto andrà a studiare al poli, ho trovato una bella casa in via Ormea e vorrei sapere com'è la vita in quella zona, anche perché ho sentito che in quella via, anni fa, erano molto presenti sia spaccio che prostituzione, queste voci valgono anche oggi? Grazie per le risposte ",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1luyl8u/come_si_vive_in_via_ormea/"
    },
    {
        "id": "1lup7b1",
        "author": "AcousticBassGuitar",
        "title": "The Pilgrimage",
        "content": "Federico!\n\n\n\n\n\n\nGiovanni…",
        "upvotes": 14,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1oc92zlronbf1.jpeg?auto=webp&amp;s=cbf90374e4d50470db0b30d7786c9bd55e3c7b55"
        },
        "permalink": "/r/torino/comments/1lup7b1/the_pilgrimage/"
    },
    {
        "id": "1luylax",
        "author": "vici0608",
        "title": "Torino as a foreigner",
        "content": "Ciao Torino :) \nI am moving to Turin in September and wanted to know what your impression is as to how life is as a foreigner here. Are the people overall open or more closed up? I know, speaking Italian is very important - and I am currently learning - but even with a lot of practice I won’t get rid of my accent so it will be always noticeable that I am not Italian. (I am from Austria, if that makes a difference) \nI would be happy about some inside information or also tips on how to integrate better 😊",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1luylax/torino_as_a_foreigner/"
    },
    {
        "id": "1lujfgd",
        "author": "Not-a-cyclist",
        "title": "Cosa fare con vestiti usati?",
        "content": "Scusatemi se faccio errori, sono Canadese e mi sono appena trasferita qui.\nLa storia è che purtroppo il papà del mio compagno è mancato poco tempo fa.\n\nDobbiamo svuotare la sua casa per poi venderla, ma non abbiamo nessun idea di cosa fare con i sui verstiti usati, o altri oggetti che aveva a casa.\nQuelli rovinati possono essere usati come stracci. Quelli ancora validi ma di qualità normale (magliette e jeans) possono essere messi nei bidoni per vestiti usati.\nMa quelli belli, sartoriali? Che sono ancora in condizioni perfette, che di sicuro hanno un costo altissimo? Tipo dei giubbotti di lana vergine, pantaloni e giacche sartoriali, ecc.\n\nHo provato di venderli su Vinted, ma il costo è troppo alto. La gente che va su Vinted cerca di comprare roba a 5 euro massimo.\n\nCi sono posti che comprano cose belle? ",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lujfgd/cosa_fare_con_vestiti_usati/"
    },
    {
        "id": "1luwo2a",
        "author": "sp_cp",
        "title": "Ricerca informazioni vecchie caramelle.",
        "content": "Salve  sto cercando delle informazioni su delle vecchie caramelle e dell'azienda che le produceva.So' che l'azienda che le produceva era la Stobbia a Torino.Su internet non ho trovato molte informazioni,so' solo che l'azienda chiuse negli anni 80.Mi serve qualsiasi informazione sull'azienda e sulle caramelle.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1luwo2a/ricerca_informazioni_vecchie_caramelle/"
    },
    {
        "id": "1lumnhu",
        "author": "mitochondria_muse",
        "title": "Ho bisogno di aiuto per scegliere la zona in cui vivere – consigli?",
        "content": "Ciao!\nIo e un mio amico studieremo all'ospedale San Luigi di Orbassano. Stiamo cercando un appartamento in una zona che non sia a più di 20 minuti dall’ospedale con i mezzi pubblici, ma che non sia nemmeno troppo lontana dal centro città.\n\nVorremmo vivere in un quartiere non troppo isolato, con qualche bar, supermercato, ristoranti, magari anche un parco. Insomma, con tutto quello che di solito serve a degli studenti.\nAvete qualche consiglio su quale zona scegliere?\n\nQualcuno ci ha suggerito Santa Rita e Piazza Caio Mario. C’è qualcuno che vive lì e può dirci com’è la zona?\n\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lumnhu/ho_bisogno_di_aiuto_per_scegliere_la_zona_in_cui/"
    },
    {
        "id": "1lu0x62",
        "author": "ArtistaFortunato",
        "title": "Quanti anni prima di una Torino 100% ciclabile e senza o poche auto?",
        "content": "Ciao a tutti, io sono a Padova, la città con più auto per persone del veneto, ma le strade sono tutte con poche auto, parcheggi pochissimi e prettamente ciclabile. Non parlo di strade che ci siamo trovati, ad esempio il comune ancora prima di mettere una fermata di un tram fa una pista ciclabile e ne fa un sacco di nuove e per ogni pista ciclabile nuova c'è una campagna stampa, oltremodo le piste vengono mantenute e spesso riasfaltate o divise con nuovi divisori dalla strada o con nuove luminarie o si ridipingono le strisce sopra le pedonali (molte piste ciclabili sono sopra dossi con accanto strisce pedonali), la chiamano ciclopolitana, si tende anche ad unire le piste ciclabili con delle zone naturali, quindi alcuni parchi hanno le zone per le bici, due corsie, con vigilanza che ferma le bici e scendere, le fa andare nelle corsie e nel centro sono la norma, ci sono parcheggi per le bici e cestini ovunque\n\nQuesto preambolo perché sono stato da poco a Torino e cazzo le vostre strade sembrano perfette per queste cose, invece sembrano degli showroom per le auto, giravo e pensavo \"Ok a Padova pochi parcheggi , ma qui si supera il limite, perché le auto sono davanti agli esercenti? Cazzo, ci sono più auto che esercenti!\" Ci sono vie che hanno una corsia ma due parcheggi, corsi con 8, mi sembra esagerato. Io leverei parcheggi, multerei l'impossibile e con quei soldi farei politiche green. Facendo anche scrivere sul giornale dei milioni presi dalla cosa e delle politiche che verranno fatte grazie a quei soldi.\n\nVisto il problema dell'inquinamento non penso sarà lontano un futuro tutto ciclabile, secondo voi quanto tempo manca? 10, 20? 30 anni?",
        "upvotes": 35,
        "comments": 129,
        "media": null,
        "permalink": "/r/torino/comments/1lu0x62/quanti_anni_prima_di_una_torino_100_ciclabile_e/"
    },
    {
        "id": "1lun3x3",
        "author": "Emotional-Kangaroo3",
        "title": "Mathematical and physical methods for space sciences and industrial applications",
        "content": "Ho una laurea magistrale in Information Systems e sto valutando una laurea magistrale di secondo livello in Mathematical and physical methods for space sciences and industrial applications a Unito. Qualcuno ha esperienza con questo percorso o può condividere opinioni a riguardo? Grazie mille",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lun3x3/mathematical_and_physical_methods_for_space/"
    },
    {
        "id": "1ltr1k2",
        "author": "Coccorocco1",
        "title": "Trovato gatto Via Brindisi",
        "content": "Salve a tutti, ieri sera abbiamo trovato questo gatto in Via Brindisi. Stiamo cercando i padroni, per favore aiutatemi 🙏. Grazie a tutti ",
        "upvotes": 40,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5eao223umfbf1.jpeg?auto=webp&amp;s=d8d0679c10b08472bd5797f080a4ad57066dd3f9"
        },
        "permalink": "/r/torino/comments/1ltr1k2/trovato_gatto_via_brindisi/"
    },
    {
        "id": "1lu7d5c",
        "author": "allexj",
        "title": "Come si dice bambino in piemontese? Per caso si dice \"boca\"?",
        "content": "",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1lu7d5c/come_si_dice_bambino_in_piemontese_per_caso_si/"
    },
    {
        "id": "1lu4xpg",
        "author": "LucaWalker92",
        "title": "Consigli su biliardo",
        "content": "Ciao a tutti, faccio una premessa, una dozzina di anni fa esisteva un locale che si chiamava Hustler, vicino a via Catania. \nEra un bar con una discreta selezione e aveva tre bellissimi tavoli da biliardo!\nPurtroppo non è sopravvissuto alla prova del tempo, ma era il mio piccolo angolo di paradiso... da allora ripiego sul Planet, ma sto cercando un posto più simile a quello.\n\nPotete consigliarmi dei locali o circoli in cui andare a giocare a biliardo Palla8, senza trovarmi in mezzo a cento persone, ma allo stesso tempo in cui si possa parlare e giocare senza temere di essere di disturbo?\n\nEdit per specificare Palla8 e non Goriziana ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lu4xpg/consigli_su_biliardo/"
    },
    {
        "id": "1lt8ckw",
        "author": "AcousticBassGuitar",
        "title": "Sopprimetela",
        "content": "Una sedia del McDonalds di via Monginevro, fossi in loro porrei fine alle sue sofferenze (è chiaramente in astinenza da crack) ",
        "upvotes": 39,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gqze1bgzrabf1.jpeg?auto=webp&amp;s=191fd4da7d59d5abbdea9b8c53e53fa02922cd95"
        },
        "permalink": "/r/torino/comments/1lt8ckw/sopprimetela/"
    },
    {
        "id": "1lszagc",
        "author": "Apoworld",
        "title": "Ho deciso di trasferirmi fuori città",
        "content": "Voi avete mai considerato di uscire dalla città? \n\nUn po’ di contesto, M32 con famiglia (moglie e due bambini molto piccoli).\n\nNato e cresciuto in città: mi sono trasferito in diversi quartieri (Centro da bambino, poi San Salvario da Adolescente, poi Crocetta e ora da diversi anni risiedo in zona Parco Dora (quartiere che adoro).\n\nAbitando al 13esimo piano, ho la fortuna di vedere tutta Torino dall’alto, e, per la sfortuna invece, di poter scorgere ogni mattina la kappa (non festival purtroppo) di smog che ingloba la città.\n\nHo deciso dunque, un po’ per l’inquinamento (fattore che personalmente mi influenza tantissimo), un po’ per la calura insopportabile d’estate ed un po’ per poter dare uno spazio che non sia il solito appartamento ai bimbi, di trasferirmi.\n\nPer lavoro devo rimanere nelle vicinanze della città: ho dunque preso in considerazione le zone che vedete sulla mappa (le più vicine sopra ai 400m o comunque in rilievo con una buona esposizione). \n\nDopo tantissime perlustrazioni, l’indecisione era forte tra Almese (inizio Val di Susa), Villarbasse (collina Morenica) e Front (inizio Canavese). \n\nAll’ultimo poi è spuntata una casa tra Sciolze e Marentino (collina Torinese, lato alto) e mi sono perdutamente innamorato del contesto, del collegamento con Torino (bretella di Gassino sull’A4 + tangenziale) e della natura che la fa da padrona.\n\nQuindi dopo 32 anni dico addio alla città, aprendo così una nuova fase, tutta nuova della mia (nostra) vita.\n",
        "upvotes": 117,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/13hvsr0zr8bf1.jpeg?auto=webp&amp;s=3e38d926cbac76c9b16689f6e42694b863602fb5"
        },
        "permalink": "/r/torino/comments/1lszagc/ho_deciso_di_trasferirmi_fuori_città/"
    },
    {
        "id": "1lth3hg",
        "author": "Diucristini",
        "title": "Ho perso la scadenza Apply@UniTo, posso ancora iscrivermi nel 2025/26?",
        "content": "Ciao a tutti,\nsono una studentessa brasiliana, residente fuori dall’UE, e mi sto preparando da tempo per studiare all’Università di Torino nell’anno accademico 2025/26. Ho superato il TOLC-SU e possiedo il certificato CILS B2.\n\nPurtroppo ho perso la scadenza per la candidatura Apply@UniTo (30 aprile), ma ho creato un account MyUniTo e ho provato a fare la pre-iscrizione per un corso ad accesso libero. Tuttavia, il sistema mi dà questo errore: “Errore durante l’accesso ai servizi”.\n\nHo contattato l’università, ma la risposta che ho ricevuto è stata molto generica e non ha chiarito la mia situazione.\n\nVorrei sapere se posso fare la pre-iscrizione direttamente tramite Universitaly o se è obbligatorio inviare la pre-iscrizione tramite Apply@UniTo per essere ammessa.\n\nQualcuno sa se esiste una possibilità, anche minima, per essere considerata in questa situazione?\n\nGrazie mille in anticipo a chi potrà aiutarmi 🙏\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lth3hg/ho_perso_la_scadenza_applyunito_posso_ancora/"
    },
    {
        "id": "1lt9841",
        "author": "heromatte",
        "title": "Perchè è così difficile trovare una stanza da studente?",
        "content": "A settembre farò la magistrale al polito, ed è da settimane che sto cercando una stanza per abitare ma non riesco a trovare nulla. Qualcuno riesce ad aiutarmi?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lt9841/perchè_è_così_difficile_trovare_una_stanza_da/"
    },
    {
        "id": "1lsmtaf",
        "author": "AcousticBassGuitar",
        "title": "Una bella giornata, una cima e una paperella molto piccola che vuole mangiarsela",
        "content": "il Paperoide ",
        "upvotes": 100,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dfuukpng15bf1.jpeg?auto=webp&amp;s=4cd7513948496f362abd25dd10a66135c11ddca4"
        },
        "permalink": "/r/torino/comments/1lsmtaf/una_bella_giornata_una_cima_e_una_paperella_molto/"
    },
    {
        "id": "1lsympr",
        "author": "BobbyBubble777",
        "title": "Mercati",
        "content": "Salve, quali mercati alimentari sono aperti dal lunedì al venerdì nel centro di Torino ? Passiamo la settimana a Torino e vorremmo pranzare con prodotti freschi e locali. Grazie.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lsympr/mercati/"
    },
    {
        "id": "1lszqiy",
        "author": "DependentPost9445",
        "title": "Zaino per viaggio in Norvegia",
        "content": "Ciao, dovrò fare un viaggio in Norvegia questa estate, spostandomi con i treni. Devo comprare uno zaino da Backpacking sui 60 L. Conoscete qualche negozio che offre un buon assortimento per questa tipologia di zaini (al netto dei vari decathlon/cisalfa).\nGracias\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lszqiy/zaino_per_viaggio_in_norvegia/"
    },
    {
        "id": "1lsxn0e",
        "author": "Confident-Art-8800",
        "title": "Bei posti dove festeggiare una laurea",
        "content": "Ciao ragazzi,\nSono il tizio del posto in cui portare la propria ragazza a ristorante. Visto il successo del ristorante  e della serata, ora vuole chiedere a Reddit posti molto bellini dove festeggiare una laurea.\n\nL’unico criterio è che siano zona Valentino \n\nGrazi a tutti ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lsxn0e/bei_posti_dove_festeggiare_una_laurea/"
    },
    {
        "id": "1lsj9su",
        "author": "AcousticBassGuitar",
        "title": "Amo i miei ricircoli d’aria minimi orari",
        "content": "",
        "upvotes": 21,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/te8zpxx184bf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1lsj9su/amo_i_miei_ricircoli_daria_minimi_orari/"
    },
    {
        "id": "1lsjx53",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx53/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1lswbzf",
        "author": "Cira94",
        "title": "Palestre poco affollate",
        "content": "Buongiorno vorrei consigli per palestre poco affollate in orario di punta avete consigli? \nAnni fa frequentavo Anytime Fitness in via Bogino ed era perfetta, so che ha aperto anche in zona Lancia avete info? L'unica cosa che ho sentito è che costa 75 euro al mese e per quel prezzo di va alla Virgin no?\n\nZona preferibilmente non troppo lontana dal centro ma mi posso spostare",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lswbzf/palestre_poco_affollate/"
    },
    {
        "id": "1ltdje4",
        "author": "niki-docet",
        "title": "IL KAPPA È FINITO, GRAZIE AL CIELO",
        "content": "Vivo nei dintorni del Parco Dora ormai da due anni e ogni anno attendo come un incubo il ritorno del Kappa Future Festival. Chi come me abita nei dintorni, sa della tortura uditiva obbligata fino all'1 del mattino e dei fiumi di disagio che si riversano nei quartieri. Perché organizzare una cosa del genere in un parco circondato da zone abitate? Non solo la musica che arriva a fare vibrare la casa, ma anche la fiumana di gente che si riversa in una zona già di per sé molto affollata. È pieno di locali e zone simili poco fuori dalla città, lontane da centri abitati, perché si ostinano a distruggere il nostro parco Dora?",
        "upvotes": 0,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1ltdje4/il_kappa_è_finito_grazie_al_cielo/"
    },
    {
        "id": "1lsjx5v",
        "author": "allexj",
        "title": "Torinesi, si pronuncia \"toret\" o \"turet\"",
        "content": "",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lsjx5v/torinesi_si_pronuncia_toret_o_turet/"
    },
    {
        "id": "1ls87tk",
        "author": "DirectInteraction825",
        "title": "Luoghi dove poter fare smart working",
        "content": "Tra poco inizierò a fare smart working e vorrei trovare un posto comodo dove poter parlare (a volte mi chiamano o devo fare meeting, quindi no biblioteche o posti silenziosi), siccome a casa d’estate non ci voglio stare. Suggerimenti? ",
        "upvotes": 14,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1ls87tk/luoghi_dove_poter_fare_smart_working/"
    },
    {
        "id": "1lslq0r",
        "author": "emiliooow",
        "title": "Kappa futur festival",
        "content": "Vorrei prendere i biglietti in rivendita per la domenica da gente su instagram/telefram, ecc..sapete se esiste un modo per confermare che i biglietti siano veri?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lslq0r/kappa_futur_festival/"
    }
]