[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pttlqg",
        "author": "intelerks",
        "title": "'Stranger Things' sets up a marathon finish as final runtimes are confirmed",
        "content": "",
        "upvotes": 72,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1pttlqg/stranger_things_sets_up_a_marathon_finish_as/"
    },
    {
        "id": "1ptkxbr",
        "author": "Notoriously_So",
        "title": "‘Stranger Things’ Shatters Nielsen Record It Already Held As Season 5 Premiere Ushers In Highest Weekly Viewing Total Ever For A Streaming Title",
        "content": "",
        "upvotes": 135,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ptkxbr/stranger_things_shatters_nielsen_record_it/"
    },
    {
        "id": "1ptuqyd",
        "author": "AssociateLittle1487",
        "title": "Worst/ disappointing Netflix shows of 2025? (Rate out of 10)",
        "content": "While there are some good TV shows on Netflix this year, there are also a lot of very bad TV shows that people have been outraged at for Netflix milking them or creating so badly.\n\nFor example, I think that Squid Game 3 is the worst/ most disappointing  Netflix show of 2025, and would rate it a 3-4/10 because of how pointless everything was. (And not in a way which is supposed to be the message of the show- just lame and cringey writing).\n\nHow about you? Please upvote and share this.",
        "upvotes": 18,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1ptuqyd/worst_disappointing_netflix_shows_of_2025_rate/"
    },
    {
        "id": "1ptvocv",
        "author": "AssociateLittle1487",
        "title": "What are the best Netflix shows of 2025?",
        "content": "Since I’m doing a post on the worst Netflix shows of 2025, I’ve also decided to make people more optimistic about shows in Netflix by asking this question- what are the best Netflix shows of 2025? There are definitely some iconic shows that have come out of this year. ",
        "upvotes": 9,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ptvocv/what_are_the_best_netflix_shows_of_2025/"
    },
    {
        "id": "1ptmrbr",
        "author": "dk_x",
        "title": "Netflix’s The One Piece Anime Once Again a No-Show Nearly 3 Years After Announcement",
        "content": "",
        "upvotes": 39,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ptmrbr/netflixs_the_one_piece_anime_once_again_a_noshow/"
    },
    {
        "id": "1ptgzom",
        "author": "IceCat767",
        "title": "Ed Gein being a virgin was too boring for Ryan Murphy?",
        "content": "Had to sex him up I guess. Is sexing something or someone up really that interesting? Ed Gein being a life-long virgin is plenty interesting to me. What do you guys think?",
        "upvotes": 54,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ptgzom/ed_gein_being_a_virgin_was_too_boring_for_ryan/"
    },
    {
        "id": "1ptxydv",
        "author": "-medicalthrowaway-",
        "title": "The Great Flood",
        "content": "If Interstellar, The Matrix and Inception… all influenced some South Koreans to make a lazy, dumb movie\n\nIt reminded me of the South Park episode, mocking Inception, where they say, “just because it’s complicated, doesn’t mean it’s cool”\n\nNote\\* Interstellar, The Matrix and Inception are some of my favorite movies",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ptxydv/the_great_flood/"
    },
    {
        "id": "1ptn037",
        "author": "Similar-Ad-1945",
        "title": "Prestige &gt;&gt;&gt; shutter island",
        "content": "I’ve watched both The Prestige and Shutter Island, and while Shutter Island is a solid psychological thriller, Prestige operates on a much higher level for me. Shutter Island is powerful on the first watch, but once the twist is revealed, a lot of its impact fades. The film leans heavily on atmosphere and shock.\n\nPrestige, on the other hand, is built for rewatching. Every scene matters. The structure itself is part of the illusion, and the   themes-obsession, sacrifice, rivalry, and identity run far deeper than just a single twist. It doesn’t just surprise you; it plays with you.\n\nShutter Island tells you its truth at the end. Prestige hides it in plain sight from the very beginning. That’s the difference. One is a great experience once; the other is a masterclass that gets better every time you revisit it.",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ptn037/prestige_shutter_island/"
    },
    {
        "id": "1pthkog",
        "author": "PoolOk6674",
        "title": "Does anyone know why this victorinox carry-on has a Netflix logo?",
        "content": "",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pthkog/does_anyone_know_why_this_victorinox_carryon_has/"
    },
    {
        "id": "1psve36",
        "author": "domrayn",
        "title": "Fargo (S1-S5) just dropped. OMG",
        "content": "Dunno if other countries already have this but this just dropped yesterday in mine (Philippines). I can't recommend this show enough guys. Every season is self contained so there are little to no pacing issues. The story is quirky, weird, violent but very engrossing. It's masterful storytelling at its finest. I used to religiously wait for a new episode every week but now everything is available. Lucky you. That's all. I'm gonna do a rewatch XD",
        "upvotes": 159,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1psve36/fargo_s1s5_just_dropped_omg/"
    },
    {
        "id": "1ptt3pn",
        "author": "Kralgore",
        "title": "Power Rangers (Original) wibbly wobbly.",
        "content": "So, my kids have been watching this, and with my own previous love from the 90s, I have sat with them and noticed this, so I ask, does anyone know why the Original Power Ranger show panning causes serious artifact drag?\n\nThis doesn't happen on any other show or streaming service.  It only seems to occur on original Power Rangers.  It is actually quite nauseating.  I don't get travel sick, but I feel that this would be the feeling...\n\nIt only happens on the panning movements. It looks like the screen is only able to update at a really low refresh rate.\n\nI have been wondering if it is part of the cheap recording at the time or very poor digital conversion.  I originally thought it wasn't happening on the sentai stuff, but it actually is,  just less obvious. \n\nThe TV isn't the issue.  I see the same thing on my PC.  Not as obvious on the phone though.\n\n\nHas anyone else seen this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ptt3pn/power_rangers_original_wibbly_wobbly/"
    },
    {
        "id": "1ptqzug",
        "author": "Shuttaappp",
        "title": "Netflix not working on TV. 'error tvq-pb-101 (5.2.102)'",
        "content": "Netflix suddenly stopped working on my Smart TV about 3 days ago. It used to work perfectly before.\nEvery time I try to play anything, I get the error tvq-pb-101 (5.2.102) saying there’s an issue with the streaming device.\nThings I’ve already tried (the tv screen asked me to do this, also called the helpline and they asked to do this) :\n- Exiting and reopening Netflix\n\n- restarting the TV\n\n- Unplugging the TV and plugging it back in\nTurning off manual date/time and setting it to automatic\n\n- checking internet connection (other apps work fine)\n\n\nNetflix still doesn’t play anything.\nIf anyone has faced this on a Smart TV and knows a fix, please pleaseeeeeeeeee let me know. Holidays are here and I'm stuck with no Netflix on TV :(",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ptqzug/netflix_not_working_on_tv_error_tvqpb101_52102/"
    },
    {
        "id": "1ptf8ty",
        "author": "Lucas-Peliplat",
        "title": "The Masculine Urge to Live Alone in the Woods (Train Dreams, 2025)",
        "content": "Somewhere along the line of progress, guys decided that enough is enough. In the past couple years, I can't count how many pictures of scenic landscapes I've seen online with the caption, \"this and forgetting that Teams exists,\" or \"someone saw this and really decided to invent Excel.\" Perhaps because of our inability to escape the capitalist-corporate world, men in the 21st century yearn for a simpler time. That's why a movie like Train Dreams makes perfect sense in this year's Oscar race.\n\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ptf8ty/the_masculine_urge_to_live_alone_in_the_woods/"
    },
    {
        "id": "1ptps7h",
        "author": "chenks76",
        "title": "process to move extra member to their own login",
        "content": "hi,  \nwhat is the correct process to move someone that uses our netflix login (at another location) to their own netflix account, but still via our netflix subscription?\n\nthe subscription (premium 4k\\_hdr) has the people outside household (extra member) add-on.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ptps7h/process_to_move_extra_member_to_their_own_login/"
    },
    {
        "id": "1psjdzz",
        "author": "Alldogsgotoheaven12",
        "title": "Dave Chapelle The Unstoppable Reaction",
        "content": "This didn’t feel like stand up as much as it felt like a victory lap. The vibe was basically I’m richer than all of you combined. I’m wiser. I’m philosophical. I’ve made it. And you can tell I’ve made it because I talk really slow now, pause a lot, smoke a cigarette on stage, and let the crowd applaud my existence. There were way more stories than jokes. Not sharp stories that build to something clever, just rambling anecdotes that relied on the audience already being on his side. It felt less like he was trying to make people laugh and more like he knew people would cheer no matter what he said. And they did. This felt safe, comfortable and almost lazy. Like he knows the brand is bulletproof, so why bother tightening the material? I get that he’s earned the right to do whatever he wants. He’s one of the greatest to ever do it. But greatness doesn’t mean every mic drop deserves a standing ovation. At some point, slowing your delivery and sounding profound isn’t the same thing as being funny.\n\nIt just feels like we’re watching a legend turn into a motivational speaker with better lighting, and the crowd keeps rewarding it.",
        "upvotes": 585,
        "comments": 373,
        "media": null,
        "permalink": "/r/netflix/comments/1psjdzz/dave_chapelle_the_unstoppable_reaction/"
    },
    {
        "id": "1ptgybb",
        "author": "ethanw214",
        "title": "Recommendations for 70 year old mother",
        "content": "\nHi all! My 70 year old mother (US) joined Netflix recently. Currently I do not have a subscription. I am looking for recommendations for her. Some guides:\n\n-She hates cruising especially F-bombs. A high amount of cursing not bleeped she will turn it off. An occasional minor curse word could slide.\n\n-not a movie person. Doesn’t want to pay attention. Wake Up Deadman she checked out.\n\n-outside of Netflix, she watches mostly reality. She watches Naked and Afraid, Court TV, Survivor, some married at first site, and Alaska homestead rescue regularly.\n\n- so far she’s watched Simon Cowell boy band show and the latest Diddy doc (hated the cursing, but wanted to know court case stuff). \n\nThanks for your help!",
        "upvotes": 2,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1ptgybb/recommendations_for_70_year_old_mother/"
    },
    {
        "id": "1pto8a5",
        "author": "Hot-Slide-7305",
        "title": "Protection",
        "content": "We all see as fans that Hopper likes to keep El save, he may very reluctantly let her out to a certain time of the day with friends or friends over to spend time with her, as we saw on season 2 where we constantly saw him promise she could see everyone soon (I think we all knew she wasn't going to) and discovering he lied about her mother it led her to run away, when she returned she was able to see people but only on his rules, which personally I can understand why he was being protective of her , he didn't want her taken away again, but I think he was being overprotective, which caused Mike lying to her, then led them into a break up, which I thought was unfair, why not be brave and talk to both now there getting older? Why act like a coward and take it out on mike ?\nDo you think he was being overprotective?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pto8a5/protection/"
    },
    {
        "id": "1ptfftm",
        "author": "Powerpoil",
        "title": "Has anyone else watched dogs in space?",
        "content": "I think it’s such a cute, charming show and was sad to see it’s been cancelled when I looked it up. Almost finished with it now and I think it’s really well written, although I’m a bit confused on the target audience. To me it seems like something a family would enjoy sitting down to watch, it’s light hearted enough for children, and has interesting themes/jokes that adults and teens would enjoy. At least I think so. I love the characters too, it’s actually hard for me to even pick a favorite lol. I’m wondering where this show stands with other people, I assume it never got popular if it got cancelled after two seasons",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ptfftm/has_anyone_else_watched_dogs_in_space/"
    },
    {
        "id": "1ptcwtv",
        "author": "Bozzaha",
        "title": "Ad-free alternatives with great foreign shows?",
        "content": "Any suggestions on alternative platforms without ads that have great foreign shows? I’ve enjoyed a number of the shows set in Spain, Mexico, Greece, Korea, Japan, Australia, etc.\n\nNetflix can’t tell my workout TV is in my household, two rooms away from the main TV.  My iPad and iPhone keep getting logged out and I’m sick of having to relogin over and over. \n\nI’m happy to pay for ad-free services, but they need to work if I pay for them. I won’t watch ads.\n\n\\-Premium subscriber since 2013.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ptcwtv/adfree_alternatives_with_great_foreign_shows/"
    },
    {
        "id": "1pto94g",
        "author": "Hot-Slide-7305",
        "title": "Protection",
        "content": "We all see as fans that Hopper likes to keep El save, he may very reluctantly let her out to a certain time of the day with friends or friends over to spend time with her, as we saw on season 2 where we constantly saw him promise she could see everyone soon (I think we all knew she wasn't going to) and discovering he lied about her mother it led her to run away, when she returned she was able to see people but only on his rules, which personally I can understand why he was being protective of her , he didn't want her taken away again, but I think he was being overprotective, which caused Mike lying to her, then led them into a break up, which I thought was unfair, why not be brave and talk to both now there getting older? Why act like a coward and take it out on mike ?\nDo you think he was being overprotective?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pto94g/protection/"
    },
    {
        "id": "1ptjbad",
        "author": "CreamAdventurous632",
        "title": "Movies &amp; Web Series I Plan to Watch in 2026 – What About You?",
        "content": "In 2026, I’m planning to finally watch and complete the following movies and web series:\n\n**Web Series:**\n\n1. Game of Thrones\n2. True Detective\n3. Better Call Saul\n4. From\n5. The Walking Dead\n\n**Movies:**\n\n1. Harry Potter series\n2. Batman &amp; Spider-Man series\n3. 13 Going on 30\n4. Me Before You\n5. 500 Days of Summer\n6. The Notebook\n7. Fight Club\n\nThis is my watchlist for 2026.  \nWhat about you guys? What movies or web series are on your list? 🎬🍿",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ptjbad/movies_web_series_i_plan_to_watch_in_2026_what/"
    },
    {
        "id": "1ptdsko",
        "author": "NoahxAnderson",
        "title": "Dolby Vision/Atmos not working with Stranger Things?",
        "content": "I’ve confirmed my setup is working properly Sonos Arc Ultra, 2 Era 300s, LG C3 — other Netflix shows and movies trigger the Dolby Vision and Dolby Atmos pop-ups without any issues. However, Stranger Things is not triggering either format for me, even though I’m on the Netflix Premium plan.\n\nI’m using an Apple TV 4K, and my audio system plays Atmos correctly with other content, so this doesn’t seem like a hardware or settings issue on my end.\n\nIs this a known issue with certain seasons or episodes of Stranger Things, or is Netflix currently limiting DV/Atmos for this show?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptdsko/dolby_visionatmos_not_working_with_stranger_things/"
    },
    {
        "id": "1pt89dq",
        "author": "skystarlune",
        "title": "Spanish language show recommendations?",
        "content": "Hey! I’m looking for TV/series recommendations that are in Spanish — Spain, Mexico, South America, anything works as long as it’s en español.\n\nI’m currently learning Spanish and want shows that are engaging enough to stick with. I’ve tried popular ones like La Casa de Papel (Money Heist), but it just wasn’t for me.\n\nI’m more into thought-provoking, darker shows like mystery, thriller, sci-fi or psychological stuff. For example, I love Severance, The Last of Us, and 3 Body Problem. I’m not really into romance or comedy heavy series.\n\nAny good Spanish-language shows that lean more mystery/thriller/intellectual?\n\nThanks",
        "upvotes": 2,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pt89dq/spanish_language_show_recommendations/"
    },
    {
        "id": "1pto54a",
        "author": "Hot-Slide-7305",
        "title": "Mike and Will",
        "content": "Right from the first episode of the season you clearly see alongside Lucas and Dustin that Mike and Will are very close friends, but over the seasons 4 seasons and now we are into season 5 many fans have thought that Will is gay and loves Mike and that is why he has always been jealous of Mike's relationship and feelings for Eleven \nWhat do you think?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pto54a/mike_and_will/"
    },
    {
        "id": "1ptpslh",
        "author": "stefanjanoski23",
        "title": "Dave Chappelle",
        "content": "Dave is built different. He’s worked hard over the years he’s done stand up for over 40 years. Do you think money for a show even if it was for free speech and lots of money in Saudi Arabia he was selling out? Or maybe taking up a great opportunity to profit from being a comedian. I know he’s just doing typical bits for comedy (they bring in politics because of relevancy) but he’s always spoken the truth about that stuff. So curious what’s on people’s minds Dave is a killer on the mic and definitely murdered it with the 2025 surprise special.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ptpslh/dave_chappelle/"
    },
    {
        "id": "1ptasg0",
        "author": "Granopoly",
        "title": "Anyone else get a sort of weird patina over the picture for certain shows when certain cameras are used?",
        "content": "This is on the stock app on my Bush smart TV. I've noticed it on Brooklyn 99 and house so far.\n\nA weird sort of geometric overlay, maybe a grid type. It doesn't obscure the picture, just a sort of filter.\n\nBy 'cameras' I mean when one scene is shown from different angles, it's just one of the angles that has this issue.\n\nWorks fine in my firestick 🤷‍♂️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptasg0/anyone_else_get_a_sort_of_weird_patina_over_the/"
    },
    {
        "id": "1ps65y7",
        "author": "Pope_Twitch",
        "title": "Netflix keeps cancelling shows",
        "content": "Hello everyone,\n\n  \nThis post is mostly a rant about Netflix and the way they handle stuff with many of their shows. I came to realize Netflix has an absurd strategy to keep customers locked in releasing new series/shows at a steady pace but for the majority, series are almost never finished unless they are really classics or series they have acquired. I am really annoyed but the number of times I locked into one of the series and then have to realize there will not be any ending of the show. It came to the point where I even start to lookup whether or not there is going to be a final season before investing the time to check it out. \n\n  \nSeries which have left a bitter taste to me personally since there is no \"what's next\":\n\n* Marco Polo\n* Away\n* 1899\n* Snowpiercer\n* Barbarians\n* Pulse\n* The recruit\n* Boots\n* Lost in space (it has an ending but there was more imo)\n* ..\n\nI know this post is not going to make any difference and I understand more than anybody else the business, it is money first, customers second but damn me, damn me for watching unfinished series. Especially the science fiction seems to be affected by this problem quite a lot. (or maybe that is because I watch too many of those)\n\nI just hope I am not the only one who has this feeling and who has been disappointed more than once in the past years?",
        "upvotes": 348,
        "comments": 447,
        "media": null,
        "permalink": "/r/netflix/comments/1ps65y7/netflix_keeps_cancelling_shows/"
    },
    {
        "id": "1ptlygw",
        "author": "Parking-Claim-6657",
        "title": "Fck Netflix. The honey scam part 2 and Epstein files part 8 dropped 😂",
        "content": "Is this better than what Netflix has been putting out? What do you think? Do we still pay for this mid content they've been pumping out? I liked the Diddy documentary but I understand 50 has been working on it and it was mostly done before Netflix bought it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ptlygw/fck_netflix_the_honey_scam_part_2_and_epstein/"
    }
]