[
    {
        "id": "1pmkghu",
        "author": "theywillkillyoumovie",
        "title": "We are Zazie Beetz, Barbara Muschietti &amp; Kirill Sokolov from the new horror film THEY WILL KILL YOU. Ask Us Anything!",
        "content": "https://preview.redd.it/kw4o52oug77g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b11d7a93232e32b23d21045e64cf8a0beb2c538c\n\nHey Reddit, Zazie Beetz, Barbara Muschietti, and Kirill Sokolov here. You might know us from films/series like IT, IT: Welcome to Derry (Muschietti), Joker, Deadpool 2 (Beetz), and Why Don’t You Just Die! (Sokolov) and more. We're here to answer your questions! \n\nOur newest film, **THEY WILL KILL YOU**, is out in theaters March 27, 2026. \n\nAsk us anything - we’ll be back at 10am PT December 15th! ",
        "upvotes": 107,
        "comments": 169,
        "media": null,
        "permalink": "/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/"
    },
    {
        "id": "1pjha1y",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Thomasin McKenzie - Monday 12/15 at 4:10 PM ET - Actress in 'Jojo Rabbit', 'Last Night In Soho', 'The Testament of Ann Lee', 'The Power of the Dog', 'Leave No Trace', 'Eileen', 'Old', 'The King', and lots more.",
        "content": "",
        "upvotes": 233,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4afrrwxqhg6g1.png?auto=webp&amp;s=2ae5da175a3384c29e41c31b5aa8a55be79c5fe6"
        },
        "permalink": "/r/movies/comments/1pjha1y/amaqa_announcement_thomasin_mckenzie_monday_1215/"
    },
    {
        "id": "1pmxczv",
        "author": "MoviesMod",
        "title": "Legendary Director Rob Reiner ('This Is Spinal Tap', 'The Princess Bride') &amp; Wife Michele Singer Found Dead in LA Home in Apparent Homicide",
        "content": "",
        "upvotes": 21344,
        "comments": 1891,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qW4I05XEdXEwIfR4E_1wn6koxsUK6UmTRPVvSwPdObQ.jpeg?auto=webp&amp;s=d2f80b755ee53c9dc212905a0713791545cbff53"
        },
        "permalink": "/r/movies/comments/1pmxczv/legendary_director_rob_reiner_this_is_spinal_tap/"
    },
    {
        "id": "1pmjjom",
        "author": "DemiFiendRSA",
        "title": "‘Zootopia 2’ Overtakes ‘Lilo &amp; Stitch’ to Become 2025’s Highest Grossing Hollywood Movie With $1.13 Billion",
        "content": "",
        "upvotes": 8506,
        "comments": 479,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-iLGH7udsGspyCOt1a4__64oANApJr8g3DiZ_9GJGFk.jpeg?auto=webp&amp;s=186016a275c89a7b4daf2233eb65acd8ebffba69"
        },
        "permalink": "/r/movies/comments/1pmjjom/zootopia_2_overtakes_lilo_stitch_to_become_2025s/"
    },
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 4493,
        "comments": 806,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pmwtek",
        "author": "FreshmenMan",
        "title": "Original ‘Home Alone’ Casting Notes Reveal Shortlist Of Potential Stars, Including Jimmy Stewart, Susan Sarandon, Tim Curry &amp; More",
        "content": "",
        "upvotes": 424,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fsTTqpWkc6K1NFFkqe5uVIXPNGgKvqlcIK9gx1iRCsk.jpeg?auto=webp&amp;s=19cad7edea2025d440522d58182118df8fb1fb8b"
        },
        "permalink": "/r/movies/comments/1pmwtek/original_home_alone_casting_notes_reveal/"
    },
    {
        "id": "1pmooau",
        "author": "ZazieBeetzAMA",
        "title": "Hi /r/movies, I'm Zazie Beetz. You might know me from Joker, Atlanta, Deadpool 2, Bullet Train, Nine Days, The Harder They Fall, The Bad Guys. My newest movie, They Will Kill You, is out in theaters March 27. Ask me anything!",
        "content": "Hi r/movies! I'm Zazie Beetz. You might know me from **Joker**, **Atlanta**, **Deadpool 2**, **Bullet Train**, **Nine Days**, **The Harder They Fall**, **The Bad Guys**.\n\nMy newest film, THEY WILL KILL YOU, is out in theaters March 27, 2026 via Warner Bros.\n\n&gt;A woman takes a job as a housekeeper in a NYC high-rise, unaware of the building's history of disappearances. She soon realizes the community is shrouded in mystery.\n\nPlease head here to ask questions:\n\n[https://www.reddit.com/r/movies/comments/1pmkghu/we\\_are\\_zazie\\_beetz\\_barbara\\_muschietti\\_kirill/](https://www.reddit.com/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/)\n\nBack tomorrow at 10 AM PST to answer things.",
        "upvotes": 1107,
        "comments": 211,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y03v1nopf87g1.png?auto=webp&amp;s=9335b99ce0dedb75ffc810c4bd76dad211477e3b"
        },
        "permalink": "/r/movies/comments/1pmooau/hi_rmovies_im_zazie_beetz_you_might_know_me_from/"
    },
    {
        "id": "1pmso58",
        "author": "Donny-Moscow",
        "title": "What are the most interesting examples of directors doing something irregular to get a genuine response from actors?",
        "content": "I’m sure most of us have heard that while filming the scene where Hans gets thrown from the roof in Die Hard, Alan Rickman was expecting a 3 second countdown and they dropped him on 2 to get a genuine surprise. \n\nI’ve also heard that the “funny like a clown” dialogue of Goodfellas was left out of the script and rehearsals so that everyone’s had a genuine awkward response to the interaction between Ray Liotta and Joe Pesci. \n\nOn the darker side, Stanley Kubrick basically terrorized poor Shelly Duvall on the set of The Shining. Definitely immoral, but she also gave a fantastic performance for that movie (not justification for her treatment, just an observation). \n\nWhat are some other examples of this?",
        "upvotes": 287,
        "comments": 216,
        "media": null,
        "permalink": "/r/movies/comments/1pmso58/what_are_the_most_interesting_examples_of/"
    },
    {
        "id": "1pmgn70",
        "author": "BunyipPouch",
        "title": "Jeff Wexler Dies: Pioneering Oscar-Nominated &amp; BAFTA-Winning Sound Mixer of 'Fight Club', 'Almost Famous', 'The Last Samurai', 'Jerry Maguire', 'Spaceballs', and 'Independence Day' Was 78",
        "content": "",
        "upvotes": 942,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B-D488rI7yIRyGdWT3usRMz2NFCGFwUHKoY6-UIaunM.jpeg?auto=webp&amp;s=bea0f93cc85cef1f6355572122120b85db560636"
        },
        "permalink": "/r/movies/comments/1pmgn70/jeff_wexler_dies_pioneering_oscarnominated/"
    },
    {
        "id": "1pminii",
        "author": "MarvelsGrantMan136",
        "title": "Michael Giacchino To Compose Score For 'Spider-Man: Brand New Day'",
        "content": "",
        "upvotes": 698,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WjVoAiSEuQZFLJMaLtgj-721p4YA7ULIlTbuVKM2AWE.png?auto=webp&amp;s=b526c84083df8fa25c97147095bef53876aa2bdf"
        },
        "permalink": "/r/movies/comments/1pminii/michael_giacchino_to_compose_score_for_spiderman/"
    },
    {
        "id": "1pmu41r",
        "author": "BarbMuschiettiAMA",
        "title": "Hi /r/movies :) I'm Barbara Muschietti. I've produced IT, IT: Chapter Two, The Flash, Mama, IT: Welcome to Derry, and more. They Will Kill You is out in theaters on March 27. Ask me anything!",
        "content": "Hi reddit! I'm Barbara Muschietti.\n\nOur newest film, THEY WILL KILL YOU, is out in theaters March 27, 2026 via Warner Bros. I'm joined by Zazie Beetz (star of the film) and Kiril Sokolov (director)\n\n&gt;\n\nPlease head here to ask questions:\n\n[https://www.reddit.com/r/movies/comments/1pmkghu/we\\_are\\_zazie\\_beetz\\_barbara\\_muschietti\\_kirill/](https://www.reddit.com/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/)\n\nBack tomorrow at 10 AM PST to answer questions.",
        "upvotes": 143,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j7grdnvbm97g1.png?auto=webp&amp;s=43d4df41bbe981b170736338fbfd2a7dadfd0582"
        },
        "permalink": "/r/movies/comments/1pmu41r/hi_rmovies_im_barbara_muschietti_ive_produced_it/"
    },
    {
        "id": "1pmhr7j",
        "author": "rowlfthedogfriend",
        "title": "Anti Chekhov gun scenes?",
        "content": "Spoilers for a 60 year old movie below.\n\n\nI watched the apartment last night and realized this has the quintessential anti Chekhov gun moment. About halfway through Jack Lemmon’s character is talking about his past suicide attempt by shooting himself. At the end of the movie he has seemingly lost everything and is packing up his apartment when we see him pick up a gun. At the end of the film we hear what sounds like a gunshot but it turns out the gun was never used, violating the rule. What other movies have scenes like this?",
        "upvotes": 689,
        "comments": 342,
        "media": null,
        "permalink": "/r/movies/comments/1pmhr7j/anti_chekhov_gun_scenes/"
    },
    {
        "id": "1pmvbl7",
        "author": "BiggieSmallz98",
        "title": "What is the all-time funniest moments in Christmas movies ??",
        "content": "It's kinda flexible but the Top 3 funniest moments in Christmas movies for me are:\n\n1. Marv's scream after the tarantula is placed on his face\n2. Harry getting his head burned by the torch trap at the door\n3. When Uncle Lewis says \"So what's the matter wit you?\" after burning up the tree\n\nLemme know your list !!",
        "upvotes": 105,
        "comments": 374,
        "media": null,
        "permalink": "/r/movies/comments/1pmvbl7/what_is_the_alltime_funniest_moments_in_christmas/"
    },
    {
        "id": "1pmih67",
        "author": "BunyipPouch",
        "title": "First Image from Comedy 'The Incomers' - Starring Domhnall Gleeson ('Ex Machina') - On a remote Scottish isle, siblings Isla and Sandy hunt birds and talk to mythical beings while fighting off outsiders. Their lives change when Daniel, an awkward official, arrives to relocate them.",
        "content": "",
        "upvotes": 538,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t68jw085777g1.jpeg?auto=webp&amp;s=13c392ec56a63c10936ac350b22b7f6bba1589ad"
        },
        "permalink": "/r/movies/comments/1pmih67/first_image_from_comedy_the_incomers_starring/"
    },
    {
        "id": "1pmxsx5",
        "author": "verissimoallan",
        "title": "Veteran actor Héctor Alterio dies in Madrid aged 96",
        "content": "",
        "upvotes": 61,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k_mJTjNAAo_JQN26IygKvPhcpB-oSiuqQqbxeNAA2Xc.jpeg?auto=webp&amp;s=7591c3644db0d16c43a3739a1d7b8c2241dcea65"
        },
        "permalink": "/r/movies/comments/1pmxsx5/veteran_actor_héctor_alterio_dies_in_madrid_aged/"
    },
    {
        "id": "1pmvzx5",
        "author": "Top_Report_4895",
        "title": "The Muppet Christmas Carol (1992) - Trailer #1",
        "content": "",
        "upvotes": 76,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ixTCVM53rWAo1wn0WnmUue5amuQmx26ChYI5vH-Rkf4.jpeg?auto=webp&amp;s=671d918836bd7d3b7e1dd8f5ec0329a244a52fd6"
        },
        "permalink": "/r/movies/comments/1pmvzx5/the_muppet_christmas_carol_1992_trailer_1/"
    },
    {
        "id": "1pmeglq",
        "author": "Lone_Lunatic",
        "title": "Children of men is such a beautiful film.",
        "content": "I watched the 2025 Frankenstein a day before watching Children of Men. I was about to joke how Frankenstein shows how badly men want to give birth and this film was definitely inspired by that but I can't.\n\nIt's too beautiful for that. The dystopian world in the film might seem hopeless but characters portray otherwise. There is this slick contrast between the world and the characters. They reek of courage and hope unlike the world.\n\nThe famous scene shot in one take when the fishes and army ceasfires after hearing a baby's cry is such a powerful one. For a moment the world seems full of hope and peace; all because of a baby. Only for the firing to begin right after. This as per me is a contrast between the world we can have and the world we have made into our reality. We keep getting glimpse of this hopeful world through different characters be it Theo, Julian, Jasper, Miriam, Marichka, the family that helped them and finally everyone; from the people in the building to the army when there was ceasefire.\n\nPersonally speaking I feel like this film portrays today's situation really well. We might not be infertile(yet) but the hatred people seem to have for one of their own knows no bound. Looking at it; everything may seems like the end of the world but then you meet someone like Theo, Julian, Jasper or Marichka and the world starts glimmering with hope.\n\nAlright, that's it. Thank you for listening to my Ted talks and I hope everyone of you get pregnent quickly.",
        "upvotes": 721,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1pmeglq/children_of_men_is_such_a_beautiful_film/"
    },
    {
        "id": "1pmwm9m",
        "author": "EuphoricButterflyy",
        "title": "Gone Girl (2014)- Cool Girl monologue. Directed by David Fincher",
        "content": "",
        "upvotes": 61,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wajkhx5l8a7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pmwm9m/gone_girl_2014_cool_girl_monologue_directed_by/"
    },
    {
        "id": "1pn0u61",
        "author": "Jakepr26",
        "title": "Aside from Watchmen, is there any other story told over and over again with slightly altered perspectives which you enjoy exploring?",
        "content": "On HBO Max, there is the Watchmen live action movie, an episodic series of the motion comic book, and a two chapter movie series; all telling the same story. Most of the visuals, flashbacks, and plots are the same.\n\nThe main differences I’ve seen so far have mostly been when the information was given to the audience, whether this is when the flashbacks are cut into the present day narrative or the conversation pacing. An example of the latter being Rorschach’s “You quit.” in reply to Dan’s musing of what happened to the “great times”. In on version, Rorschach waits a beat, and another he sharply cuts off Dan’s question. This former shows Rorschach longs for his friend to take up the mantle again, while the latter shows Dan’s abandonment stills hurts. That being said, it feels like every version is sharing both sentiments.\n\nEdit: What I’m getting at is like you get to watch a different cut of your favorite movie, or how the scene would have played out in a different setting. Like the chronological cut of Pulp Fiction someone posted on YouTube years ago.",
        "upvotes": 26,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1pn0u61/aside_from_watchmen_is_there_any_other_story_told/"
    },
    {
        "id": "1pmzd01",
        "author": "Lokitusaborg",
        "title": "The Rocky Horror Picture Show",
        "content": "I remember (doing the time warp) when I was 13 years old. I am the son of a very conservative southern Baptist pastor, and a very conservative southern Baptist pastor’s wife. We couldn’t say fart in my family. That’s enough context for this story.\n\n\nI was 13 and I had heard of The Rocky Horror Picture Show, but I had never seen it. I had just received a tv for my birthday a month prior, a little 13 inch color tv, and I was so proud of it. It was October and I stumbled across TRHPS on VH1. I was entranced, the music was amazing and it was scandalous and dirty and I am just watching it with eyes as wide as saucers. I’m in the middle of sweet Transvestite, and I hear my mom knock and begin opening the door. I fumble the remote and Jesus, knowing my shame…makes the remote not work. My mom walk in and looks at the TV, and I know I’m busted. She’s going to have a heart attack and call my dad in and I’m going to get a lecture and possibly my tv taken away. My mom looks at me and I know what’s coming….\n\n“You’re watching Rocky Horror…I saw it in the theater.”\n\n\nWhaaaaaaaat?!?!?!\n\nIt was on that day, 31 years ago that I realized my mom was cooler than me. Over the next few years I realized how cool she was. She could play any hymn by ear…but she also knew Beth by KISS, Come Sail Away by STYX. She knew Alice Cooper, Ozzy, Led Zeppelin. She had been in a band as a teen with my cousin who grew up to play lead guitar for the Osmond Brothers, and his band has opened for Alice, and The Beach Boys, and David Cassidy, and STYX, and the Bay City Rollers. And she was just as cool. \n\nShe still is. She’s slowed down a lot, she fell over Thanksgiving and broke her hand so she’s not playing piano for a while. We’ve been doing end of life planning as she is approaching 80, and my dad has Parkinson’s, and she is giving me her 1974 Rhodes stage piano which is in absolute mint condition. All this has been on my mind lately and tonight I saw Rocky Horror was on Disney+. I had my 13 year old daughter come into my room and watch it with me, and told her this story of my rocker preachers wife mom. I think it’s a cool legacy to hand down, and I just thought I’d share it here.\n\nEven today, Rocky Horror Picture Show is one of the best rock operas in existence; and it is special to me because it reminds me that people are very complex…even moms.",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1pmzd01/the_rocky_horror_picture_show/"
    },
    {
        "id": "1pn10xi",
        "author": "cosmiq_teapot",
        "title": "I finally understood Blade Runner yesterday",
        "content": "Over the years I've watched Blade Runner a couple of times, but it never sat right with me. I kind of understood why it is considered a masterpiece, but I also kind of didn't.\n\nI watched it again yesterday, and it finally clicked and I also know why: I watched the theatrical version for the first time. The one with Deckard's voice-overs. I don't remember ever having voice-overs in this movie, so it must be that before I've always watched Ridley Scott's Director's Cut or the Final Cut.\n\nI now understand that what I was missing was context. Blade Runner has always been awing me with its imagery and music, but I also found the dialogues to be on the philosophical rather than the logical side and I didn't understand why certain things were happening as they were. This took me out of the movie pretty early, thus I couldn't really appreciate what I was seeing. Now, with Deckard's voice-overs, I do. And the film finally works for me. And it makes me happy, because I too can now fully appreciate a milestone of filmmaking as much as so many other people do.",
        "upvotes": 19,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1pn10xi/i_finally_understood_blade_runner_yesterday/"
    },
    {
        "id": "1pm0r9p",
        "author": "RealJohnGillman",
        "title": "Huntr/x from ‘KPop Demon Hunters’ perform “Golden” live at “A Year in TIME”",
        "content": "",
        "upvotes": 3891,
        "comments": 362,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Sm1sqtHzEJ8xd9q6YPf0FnOi-SFIK_WMxA-ZUJ8FG0.jpeg?auto=webp&amp;s=634f413b33daa2b80c976955bd301e321efe7e50"
        },
        "permalink": "/r/movies/comments/1pm0r9p/huntrx_from_kpop_demon_hunters_perform_golden/"
    },
    {
        "id": "1pm99bx",
        "author": "Big-Property7157",
        "title": "O Brother, Where Art Thou? (2000) - The Feared George \"Baby Face\" Nelson | ...",
        "content": "",
        "upvotes": 828,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1xy_luMbfZU8TZkWyYTWEvrYCesT6RGQC7qeupeUFC4.jpeg?auto=webp&amp;s=cbfb302eb5113f0ed467936aa0349b5a1621e781"
        },
        "permalink": "/r/movies/comments/1pm99bx/o_brother_where_art_thou_2000_the_feared_george/"
    },
    {
        "id": "1pms3cy",
        "author": "OatSoyLaMilk",
        "title": "Movies where the language barrier hid some bad acting?",
        "content": "There's this low budget Japanese cult movie called Versus from 2000 or so that I was obsessed with as a kid. It's basically about a bunch of Yakuza that guys go to meet up with some escaped convicts in a forest where all the people they've killed over the years start rising from the dead, and it turns out both the convicts and the boss they were waiting for are more than they seem.\n\nNow according to the filmmakers, especially the director, the lead actor Tak Sakaguchi delivers his dialogue terribly in a lot of scenes, which I guess is unsurprising for an early effort from an inexperienced director like Ryuhei Kitamura was. I don't know if he's wooden in his inflection, emotes incorrectly, or what because I can't speak a single sentence of Japanese.\n\nRobert Rodriguez also speculated about his breakout feature El Mariachi that he figured Americans took it more seriously and got more out of it because the fact it was in subtitled Spanish convinced them it must be more highbrow that the kind of silly, contrived B movie that it he felt it actually was. One of the lead villains was 19 years old and delivered his lines very woodenly in Spanish but looked old enough to still be intimidating to an English speaker. \n\nAre there any movies you've seen from your home country being watched by people in other countries where you think you'd enjoy them less if they were native speakers of your language?",
        "upvotes": 42,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1pms3cy/movies_where_the_language_barrier_hid_some_bad/"
    },
    {
        "id": "1pmffq3",
        "author": "LaserDiscCurious",
        "title": "Why did \"The Pagemaster\" fail to find an audience when it first came out?",
        "content": "When it first came out, it only made 13 million. It had Macaulay Culkin in his last major film role, voicing an animated character who goes on an adventure with antromorphic books voiced by Whoopi Goldberg, Patrick Stewart and Frank Welker. Christopher lloyd as a wizard/librarian. A nice soundtrack with songs by Wendy Moten, Lisa Stansfield and Babyface. And a positive message about convincing kids to read, pretty much what The NeverEnding Story was supposed to be as well. But nobody saw it back then. \n\nNow, it's regarded as a cult classic, because many folks watched it on cable, home video. I discovered this movie thanks to a VHS tape that was lended to me and I loved it. Definitely my favorite 90s Hanna Barbera animated movie.",
        "upvotes": 179,
        "comments": 165,
        "media": null,
        "permalink": "/r/movies/comments/1pmffq3/why_did_the_pagemaster_fail_to_find_an_audience/"
    },
    {
        "id": "1pmf2w4",
        "author": "MrGittz",
        "title": "One of Jim Carey’s finest performances is for a movie I don’t see a lot of love for &amp; it’s a real shame. Robert Zemeckis’s 2009 “A Christmas Carol” is a wonderful adaptation &amp; has become a holiday tradition for my family",
        "content": "So I’ll admit when I first saw the 2009 version of A Christmas Carol starring Jim Carey, I was kind of unimpressed. Another Polar Express style film, this time costing 200 million dollars(!!!), of a movie we’ve seen dozens of iconic adaptations for. \n\nBut then one year I caught it on TV and was just blown away by Jim Carey’s Scrooge. And now it’s become what I consider to be the best Christmas Carol adaptation. It’s neck &amp; neck with Mickeys Christmas Carol(whose only weakness is that it’s not long enough!). Yet it’s Jim Carey who really impresses me. This is not phoned in, not just another role. The man gives it his all and gives what I think is one of his finest performances. \n\nI can’t say it enough. Carey is a stunning here. He plays multiple roles(including 2 of the Ghosts) but his Scrooge is something else. I honestly believe that had this been live action instead of animated, he might’ve received an Oscar nomination. \n\nHis performance in the “Ghost of Christmas Past” sequence really gets to me. “I could walk it blind folded”. This is a Scrooge who seems generally amazed &amp; awed by the things he’s seeing. \n\nI think a lot of people get turned off on the movie because it’s done in that Polar Express motion capture style. There’s one or two moments when the technology keeps us at an arms length but generally I find the visuals here to be terrific. Scrooge flying through the city, in the night sky? Great stuff. \n\nSo for those of you out there who maybe got turned off from the motion capture style, i really suggest giving this film another shot. I did and I’m so thankful. It’s just a wonderful Christmas film with a very underrated Jim Carey performance.",
        "upvotes": 186,
        "comments": 105,
        "media": null,
        "permalink": "/r/movies/comments/1pmf2w4/one_of_jim_careys_finest_performances_is_for_a/"
    },
    {
        "id": "1pm63hq",
        "author": "Insightful23blue",
        "title": "Planes, Trains and Automobiles, 1987-Wrong Way",
        "content": "",
        "upvotes": 975,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vg0rzw5ks37g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pm63hq/planes_trains_and_automobiles_1987wrong_way/"
    },
    {
        "id": "1pmk3fa",
        "author": "throw0101d",
        "title": "Seven years and 1,907 pages of music: The secrets of the Avatar soundtrack",
        "content": "",
        "upvotes": 96,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A1MLdnYdNxHjLEtkX0PGEyKgjCF-YmgrARnal2as-64.png?auto=webp&amp;s=df93150e23e12314410f739b6aebf9c238d592bd"
        },
        "permalink": "/r/movies/comments/1pmk3fa/seven_years_and_1907_pages_of_music_the_secrets/"
    },
    {
        "id": "1pmn0h0",
        "author": "EuphoricButterflyy",
        "title": "‘Mother of Flies’ trailer- When a young woman faces a deadly diagnosis, she seeks dark magic from a witch in the woods - but every cure has costs. Directed by John Adams, Zelda Adams and Toby Poser",
        "content": "",
        "upvotes": 64,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b5s5utkt387g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pmn0h0/mother_of_flies_trailer_when_a_young_woman_faces/"
    },
    {
        "id": "1pn04kn",
        "author": "stellifer_arts",
        "title": "Down With Love (2003) directed by Peyton Reed - it's the 1960s, and Catcher Bloch (Ewan McGregor), a successful writer for popular Know magazine, is reluctant to interview Barbara Novak (Renée Zellweger) in order to promote her feminist book so as to sway the men of Banner House publishing",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LP5k5pOq5XmCbTFZwvVNxAyKM-psmgdOH9rPNv34UyQ.jpeg?auto=webp&amp;s=f9fd06c9498a98d8831c16192e91dbb0bd06f185"
        },
        "permalink": "/r/movies/comments/1pn04kn/down_with_love_2003_directed_by_peyton_reed_its/"
    }
]