[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 42,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kyevkp",
        "author": "jerkoff1610",
        "title": "Anyone else tired of the four-year-long wait between seasons of Stranger Things, where kids don't look like kids anymore?",
        "content": "They all look so different now! Weren't they supposed to be 16-17 in season 5??\n\nAlso, correct me if I'm wrong, but isn't Erica, who btw just graduated high school and is an adult now, supposed to be THIRTEEN in season 5????\n\nApparently, they have pushed the release date for season 5 to 2026. This is just crazyyy!!!  \n",
        "upvotes": 121,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1kyevkp/anyone_else_tired_of_the_fouryearlong_wait/"
    },
    {
        "id": "1ky84ax",
        "author": "theipaper",
        "title": "Dept Q is the best police procedural Netflix has ever made",
        "content": "",
        "upvotes": 74,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ky84ax/dept_q_is_the_best_police_procedural_netflix_has/"
    },
    {
        "id": "1kxwgqn",
        "author": "EmptyPocketsXotics",
        "title": "A Deadly American Marriage",
        "content": "I'm finishing up watching this documentary and came across an interesting tidbit. At 1:06:00, Molly is talking about having voice activated recording devices in different parts of the house, including one behind the headboard in the bedroom. How is it this was conveniently not brought up during any part of the trial? Does anyone have any info on this?",
        "upvotes": 76,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1kxwgqn/a_deadly_american_marriage/"
    },
    {
        "id": "1kxx2qz",
        "author": "stellacampus",
        "title": "Yes I know \"Pig\" sounds insane, but if you haven't seen it you really should.",
        "content": "Yes, Nic is way over the top, but it somehow works here - I think this has to be considered one of his best performances.  The story line does not sound like something anyone would be interested in, and yet it ends up being fairly compelling.  It's a really good, odd little movie that you might like if you give it a chance.",
        "upvotes": 45,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kxx2qz/yes_i_know_pig_sounds_insane_but_if_you_havent/"
    },
    {
        "id": "1ky99n9",
        "author": "Relative_Recording47",
        "title": "Jackie Chan and Ralph Macchio Return for a Messy and Uninspired Addition to the Franchise",
        "content": "",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ky99n9/jackie_chan_and_ralph_macchio_return_for_a_messy/"
    },
    {
        "id": "1kxp7zz",
        "author": "Internal-Bed-3150",
        "title": "The Gentlemen season 2: Netflix confirms production is underway",
        "content": "",
        "upvotes": 54,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kxp7zz/the_gentlemen_season_2_netflix_confirms/"
    },
    {
        "id": "1ky5yf6",
        "author": "Low-Helicopter-2696",
        "title": "Sirens and the photo",
        "content": "There's been a lot of discussion about the photo of Peter kissing Simone.  Mainly, people are saying it's not really believable that there wouldn't be a digital copy, therefore kiki would be able to present evidence of infidelity.\n\nIf there was a digital photo, the meta data would likely have a time stamp showing it happened BEFORE the gala ever started.  That would mean Peter couldn't even claim that he ended the relationship informally, if not officially, prior to that photo being taken.\n\nI think the only possible explanation here is that Kiki is not tech savvy, as evidenced by the fact that she was trying to get into Peters various devices and was unsuccessful. Only after Simone disclosed that he does not lock his personal phone was she able to gain access.  But that feels kinda weak.\n\nSo is there a better reason why Peter would be so confident that the photo Jose destroyed is the only copy in existence? Is this just an unresolved plot hole? Or is it more along the lines of the chocolate box, (where even Peter admits he made a rookie mistake), and he's actually miscalculated?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ky5yf6/sirens_and_the_photo/"
    },
    {
        "id": "1ky73d4",
        "author": "SplitNational2929",
        "title": "Tarantino loves Netflix's Havoc",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ky73d4/tarantino_loves_netflixs_havoc/"
    },
    {
        "id": "1kydhol",
        "author": "indiewire",
        "title": "A Very Serious Athletic Analysis of John Mulaney’s Teen Fight Night",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kydhol/a_very_serious_athletic_analysis_of_john_mulaneys/"
    },
    {
        "id": "1ky0txe",
        "author": "Comprehensive-Way482",
        "title": "Netflix's New Crime Thriller Show 'Secrets We Keep' Is For 'Big Little Lies' Lovers",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ky0txe/netflixs_new_crime_thriller_show_secrets_we_keep/"
    },
    {
        "id": "1ky9tii",
        "author": "SWANDSH7",
        "title": "I'm looking for a CGI cartoon series set in old Italy about Inventors",
        "content": "It was a long time ago, one of the 2000s, I stumbled upon a comedy CGI series set in old Italy about a man who wants to be an inventor and his apprentice who just cares about food.\n\nDoes anyone know what it was?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky9tii/im_looking_for_a_cgi_cartoon_series_set_in_old/"
    },
    {
        "id": "1ky9fs9",
        "author": "Desperate_Style13",
        "title": "NEED RECOMMENDATIONS",
        "content": "Hey, recently I've just not been able to find anything to watch. I want to watch a 15 or below. With limitedsex if possible. Recently I've watched ihostage, adolescence, bodyguard and prison break. I also do like documentary so if there's any of them asw. I don't mind if it's a documentary or not, or if it's film or series. I also have enjoyed realities shows but these ones NEED sex in it haha",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky9fs9/need_recommendations/"
    },
    {
        "id": "1ky0lri",
        "author": "Emirates_aviationer",
        "title": "My opinion on the Sweet Tooth ending",
        "content": "Day 1 watcher here! My dad and I have always loved watching shows as a kid together. We watched all the Star Wars shows and movies, marvel movies and shows, stranger things, and a bunch of Netflix/Paramount shows. Sweet Tooth was probably the only show that him and I watched each season on day 1. We were so hooked on S1 that we kept watching on every launch day. Now we weren’t able to find time to watch the last season but the past 2 days we watched a bunch of episodes and I’m going to say this. The ending made me cry. I have never cried for a show before but it just made me feel different about my whole life ahead of me (I’m 15 currently). I just thought that how Gus expressed on how all things have an ending in a beautiful way was so touching and inspirational. I’m not going to spoil it for people who haven’t watched but I’ll give an actor review. I HATED Dr. Singh and Mrs. Zhang. The actors did very well on making me hate them which is actually a great thing as they acted amazing. The guy that Becky killed in the beast also made me pissed off. Overall I loved Sweet Tooth and I suggest you watch it if you haven’t. Best show I’ve watched in a long time.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ky0lri/my_opinion_on_the_sweet_tooth_ending/"
    },
    {
        "id": "1ky4f3e",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Drops Cryptic Teaser for 'Wake Up Dead Man: A Knives Out Mystery'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ky4f3e/netflix_drops_cryptic_teaser_for_wake_up_dead_man/"
    },
    {
        "id": "1kxz4o3",
        "author": "BobDeenghus",
        "title": "My list in new TV app interface",
        "content": "My TV app updated today. Does anyone know how I can expand “My List” section to see all the movies and shows I’ve got stored there? Or do I have to spend half an hour on scrolling to the right in My List row view? I’ve got tons of shows saved there that I watch gradually but today it took a lot of time to scroll to “that movie” with “that actor” that I saved for later. I tried going to “My Netflix” section but the My List is also in a row view. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxz4o3/my_list_in_new_tv_app_interface/"
    },
    {
        "id": "1ky6cyg",
        "author": "kiwiantitheist",
        "title": "Does anyone else have issues with the iPad App?",
        "content": "I have the iPad app for Netflix on which I have 3 accounts. One is mine, one is an older child (&gt;18) and one is an 8-year old child for whom I’ve set up a kids account.  The problem is, the 8-year old can access my account and has been watching age-inappropriate content via my account. Is there any way I can prevent the child from accessing my account?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ky6cyg/does_anyone_else_have_issues_with_the_ipad_app/"
    },
    {
        "id": "1ky4sjz",
        "author": "DJSpadge",
        "title": "A couple of questions",
        "content": "A family member (Same house) just got the standard (No advert) plan.\n\nIt says watch on 2 devices at once.\n\nIs that the same movie/tv or different ones on each device?\n\nAlso it's unclear how the second user accesses Netflix, Is it the same Email/PW as the primary user? or...\n\n\n Cheers.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ky4sjz/a_couple_of_questions/"
    },
    {
        "id": "1kxyflm",
        "author": "coffee_and-cats",
        "title": "Sirens",
        "content": "Should I continue watching?\n\nOn episode 3. Finding it drawn out and boring. Does it get better?\n\n\nI've purposely not read any other threads. I don't want spoilers in case its worth watching.\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kxyflm/sirens/"
    },
    {
        "id": "1kxh8bq",
        "author": "boobooball5",
        "title": "New show suggestions please",
        "content": "\nMy fav genres are crime, psychological thrillers, a bit of teen drama and romance, witty humor, steamy shows are my guilty pleasures! I enjoy shows like YOU, Handmaids Tale, The diplomat, ginny and Georgia , Virgin River, Marvelous Mrs Maisel, Fleabag, Elite, Bridgerton, The Empress, Behind her eyes, obsession, unbelievable, White Lotus, Normal People, The Bold Type , Gilmore Girls, Modern Family, classics like Vampire Diaries!\n\nPlease help a bored girl out! Thanks in advance ",
        "upvotes": 26,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1kxh8bq/new_show_suggestions_please/"
    },
    {
        "id": "1ky2qy7",
        "author": "Quail-Fancy",
        "title": "Netflix updated its menu and I hate it..",
        "content": "How do I undo this new menu format and go back to the old one?\nI'm using a like 6 year old lg smart TV with an Amazon firestick.\nI've tried opting out of the update on their site.\nI uninstalled the app and reinstalled it.\nTried clearing cache and clearing data.\nNone of these have done anything.\n\nMy TV downstairs in my living room has not switched to this new menu yet and I'm really trying to divert that from happening there too. \n\nAny help is greatly appreciated as this new menu is super annoying to navigate and makes the ease of selecting more of a hassle.. bad move Netflix.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ky2qy7/netflix_updated_its_menu_and_i_hate_it/"
    },
    {
        "id": "1kxyhtl",
        "author": "dailystar_news",
        "title": "'House of Horrors' fiend Rose West changes name in prison but still 'has no friends'",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxyhtl/house_of_horrors_fiend_rose_west_changes_name_in/"
    },
    {
        "id": "1kxamzx",
        "author": "bitchandmoan69",
        "title": "Its really fucking annoying that the starter of the binge streaming model of TV keeps interrupting me to ask if I'm watching.",
        "content": "At least rate limit it to 2 hours or something, dont do it by episode count because short episode things like Love Death and Robots exists. I had it ask me if I'm still watching twice in one hour, very annoying.",
        "upvotes": 45,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kxamzx/its_really_fucking_annoying_that_the_starter_of/"
    },
    {
        "id": "1kxfnoo",
        "author": "ValuableExact4899",
        "title": "shows to watch",
        "content": "just finished rewatching breaking bad and dexter and i need a new show to watch! i love the vibes of breaking bad and dexter, and i like the crime and gore and stuff that they have. \n\nive seen people recommend Ozark so i may start watching that. does anyone recommend this? \n\nany other great shows i can watch that give these vibes??? ",
        "upvotes": 12,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kxfnoo/shows_to_watch/"
    },
    {
        "id": "1kxkzn3",
        "author": "Same_Cat6189",
        "title": "Is Pernille worth sticking with? I’m on S2 and struggling with how much of a pushover she is…",
        "content": "I’m on Season 2 of Pernille and I’m torn. The acting and writing are excellent, and I want to keep watching—but it’s getting exhausting seeing the main character constantly swallow her feelings and let everyone, especially her daughters, walk all over her.\n\nIt’s hard to watch someone be emotionally bullied over and over without advocacy. Do characters eventually show growth?\n\nI want to stick with it if there’s a character arc, but if the whole show is just pain with no change, I might have to tap out.\n\n",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kxkzn3/is_pernille_worth_sticking_with_im_on_s2_and/"
    },
    {
        "id": "1kybfvc",
        "author": "Arkyja",
        "title": "After 5+ years i'm unsubbing due to sub/audio licencing",
        "content": "I'm just tired of audio and subs begin region locked. I live in the german part of switzerland and my options for animes are japanese, french and uhm.. dutch? okay.\n\nFor me the problem is just anime, but im not swiss to begin with, and neither is my girlfriend, and while i grew up here and can just watch stuff in english or german, she doesnt understand those languages good enough to watch stuff in those languages. And when i watch something with her, i can only watch like a quarter of the catalog because subs aren't offered.\n\nAnd the language settings on the website is a scam. It literally doesn't do anything. Not only does it not add the languages you select, which i know, licensing, but it also doesn't remove any of the languages you have unselected. If a movie or show can show you ALL the audio and sub options, it sure does and you can scroll every time.\n\nI know it's not entirely netflixes fault but they should be the ones pushing for change. What am i gonna do? Write to whatever companies make the subs in one country and beg them to think of the immigrants? Not that i could even find that information for my country, i checked. But presumably Netflix can pay to have access to them and if that's the case they should either pay for ti or offer a reduced price to people affected. I mean not at the very least, not having the local language of your location like it's the case with anime here, should be seen as unacceptable.\n\nI honestly cant imagine why companies would even care? especially for languages like portuguese (pt), which is what my girlfriend would need. You're only fucking over your people by restricting it. No one was gonna use those dubs except your citizens living abroad.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kybfvc/after_5_years_im_unsubbing_due_to_subaudio/"
    },
    {
        "id": "1kxtl5o",
        "author": "anandasheela5",
        "title": "Nonlinear storytelling shows or movies ?",
        "content": "I just finished Thank you, next - I liked the plot and the narrative.. Is there any other shows or movies that you would recommend with nonlinear storytelling ? \n",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kxtl5o/nonlinear_storytelling_shows_or_movies/"
    },
    {
        "id": "1kxsgx6",
        "author": "Dark-N1ghtmar3",
        "title": "Can’t revert back to original design",
        "content": "Just got the new update for the redesign, and it is horrible. I had the “ do not test” set to off for beta tests. I logged out and cleared the date cache, and now it won’t revert back to the original design. Am I screwed, or is this permanent?\n\nUpdate: I just uninstalled the app, then it reverted back to the original design. Then I went into the Play Store app and turned off auto updates so it doesn’t do it again.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxsgx6/cant_revert_back_to_original_design/"
    },
    {
        "id": "1kxq1er",
        "author": "MaikyTheory",
        "title": "Is The Flash series Dubbed?",
        "content": "I Wonder if the flash series is transleted to czech cause I dont have netflix yet and I wanted to buy it because it has the flash series but I want it in czech dabing so could anyone tell me if it is? I really need to know thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kxq1er/is_the_flash_series_dubbed/"
    },
    {
        "id": "1kx8cey",
        "author": "temeria_123",
        "title": "Just discovered Obliterated, why was this cancelled?",
        "content": "What the hell Netflix, you cancelled one of the most fun shows ever. Alright, this is no \"White Lotus\" or \"Severance\" or whatever, and the best part is...it never tries to be. This is one of those cheesy, over-the-top, brainless action shows that is sexy, funny and addictive. It's a throwback to shows I watched as a kid, Airwolf, Miami Vice, Knight Rider...the 80s baby. And c'mon, it's better than the shitty movies Netflix puts out like Red Notice, Old Guard, Extraction and those 100 generic Ryan Reynolds movies. The cast is hot, doing hot things, while saving U.S. from a nuclear detonation. What's more American than that? The storyline is cliche, but still decent, Russians are bad (of course), but rather than pitting them against another foreign power, there are rogue U.S. ex-military operatives vying for the bomb. There are some genuine twists (don't expect Sixth Sense/Fight Club level twists), that I found good. There are a lot of zingers in the dialogue, c'mon references to Rambo and Mission Impossible (\"fuck, we've been Ghost Protocol-ed\" had me lmao). There were even some deep philosophical shit, like the Gremlin representing Paul's inner demons, fantastic.  Characters, Ava, McKnight, Trunky, Tech Chick, Haggerty, Paul, Gomez were all likeable af, and the cast really delivered. Does help that everyone is hot, yes even Tech Chick. I didn't want any of them to die (which is unusual, there is normally always that 1 person). And Gremlin, voiced by B-99's Jason Mantzoukas, epic. Some people say this show was too raunchy, but nothing a generation that grew up watching American Pie and Hangover would find shocking. And the action was a blast, there are car chases, car crashes, helicopter chases, guns, physical fights, knife fights hell yeah. So imo, this show has a lot of gas left in the tank, they can make 1 season every couple of years (ala Witcher) set in different locations and different \"missions\". Then I found out it was canned....wtf. I really think the reception of the show would have turned out very differently if:\n\n1. Change the fucking title to something easier to remember. I found this show when I accidentally pressed \"O\" in the search bar. And it took me a while to remember the name.\n2. Have a token A-lister in the cast. Shows like Hangover and Bullet Train would've been duds if it wasn't for Bradley Cooper or Brad Pitt - just sayin'. It's not fair to the cast because they were great, it's just Hollywood economics.\n\nSo...when S2?",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kx8cey/just_discovered_obliterated_why_was_this_cancelled/"
    },
    {
        "id": "1kxnjuk",
        "author": "MysticCrest1830",
        "title": "'Wednesday' creators preview a darker season 2 (exclusive)",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kxnjuk/wednesday_creators_preview_a_darker_season_2/"
    }
]