[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 61,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1le525o",
        "author": "Ionazano",
        "title": "Is there anything new in \"Titan: the Oceangate Submersible Disaster\"?",
        "content": "So a new addition on Netflix that I noticed is \"Titan: the Oceangate Submersible Disaster\". It's currently in the top 10 most watched. On the one hand as someone with an engineering background I'm very interested in engineering cautionary tales. On the other hand I've already read about everything that happened leading up to the Titan submersible disaster in great detail.\n\nSo my main queston in deciding whether it's worth watching for me is the following: does this documentary contain any new information or perspective?",
        "upvotes": 69,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1le525o/is_there_anything_new_in_titan_the_oceangate/"
    },
    {
        "id": "1lehdfn",
        "author": "bearsbeetspie",
        "title": "Justin Willman's New Netflix Special",
        "content": "TL;DR - Two things: \nFirst, the special - thoughts?\nSecond, upcoming tour - who's going?\n\n\n\nHow did everyone feel about the recently released special? \n\nI always wonder if I'm the only one who gets this feeling like I'm both happy AND want to cry after watching his performances Lol \nI know nothing he's doing is a \"miracle\", but he's just so uplifting even when he's cheeky or the jokes get going. At the end of his shows, it's like we all went on this journey, and I didn't realize how much I needed that lately. \n\n\nAnyways - as we were watching, I thought to myself \"huh, it seems that when comedians do a comedy special on Netflix, they're going on tour and they might come to Toronto\"... \nAnd sure enough, Justin is! \n\nWe got tickets to his show in Toronto, and I'm super stoked for it. \nAnyone else going? \nAnyone here seen him live before? What was your experience?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lehdfn/justin_willmans_new_netflix_special/"
    },
    {
        "id": "1lebpwh",
        "author": "Successful_Blood3995",
        "title": "Your device isn't part of your household BS?",
        "content": "I am the account holder.  There is no one outside of my house using my account.  It's me and my two sons.  I am pretty much the only one who uses Netflix.  My kids are gamers.  All 4 pcs (2 kids, one me, one living room) are hardwired through the wall ethernet jack.  \n\nToday, I clicked on Netflix (Chrome browser) and it said that both my living room and bedroom pcs are not part of my household!  What? Lol.  I can sign in temporarily for 2 weeks and then I must create my own account lmao or use wifi.  How tf do I use wifi when I'm directly connected through the wall jack?  Netflix is crazy.  Anyone know how to deal with this?  \n\nIf this doesn't resolve I'm cancelling my subscription.  ",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lebpwh/your_device_isnt_part_of_your_household_bs/"
    },
    {
        "id": "1ldssxz",
        "author": "Swordfish353535",
        "title": "Having a lazy day at home, any good Netflix docu-series things of recent years to watch?",
        "content": "Haven't watched one in a while but have seen a lot of the old ones so wondering if there's any good ones released in the last 2 years or so?\n\nI'm seeing this Osama Bin Laden one although seeing mixed reviews. Ideally something that'll keep me gripped.",
        "upvotes": 118,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1ldssxz/having_a_lazy_day_at_home_any_good_netflix/"
    },
    {
        "id": "1ldrjv1",
        "author": "Sea_Cookie2373",
        "title": "Too long ago",
        "content": "Does anyone else ever just start a whole show over because they forgot what happened, because it was so long since they made the last episode? Sometimes it's been what feels like a year...",
        "upvotes": 111,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrjv1/too_long_ago/"
    },
    {
        "id": "1lemtoc",
        "author": "smcneal",
        "title": "Charly Barby and Kelly Villares Are the Comeback Queens of the Dallas Cowboys Cheerleaders",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lemtoc/charly_barby_and_kelly_villares_are_the_comeback/"
    },
    {
        "id": "1lem8s3",
        "author": "greycaffelatte",
        "title": "What Makes Netflix Worth Paying For? (Master’s Thesis Survey)",
        "content": "Hi Netflix fans! I’m a Master’s student researching what features make streaming apps feel premium.\n\nFor Netflix, is it original shows, no ads, or multiple streams?\n\nI've created a survey to explore this. It takes 10-15 mins, and it would be a huge help if you took part. When the survey begins, please select Netflix as the app you're evaluating.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lem8s3/what_makes_netflix_worth_paying_for_masters/"
    },
    {
        "id": "1leafxn",
        "author": "BerryDolly171819",
        "title": "I wanna watch more movies",
        "content": "The Kingsman movies are my favorite. I also loved the following:\nHunger Games,\nThe Match (Korean),\n7 Women and a Murder,\nThe Six Triple Eight\n\nI don’t really like movies that are pure romance. \n\nCan you please recommend something?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1leafxn/i_wanna_watch_more_movies/"
    },
    {
        "id": "1lebfhh",
        "author": "Strong-Intention-596",
        "title": "La Brea",
        "content": "The introduction in the pilot is the most cookie cutter Shi I’ve ever seen 😭 “hey sister that disability you have” “yes brother and you’re going to college soon” (the brother proceeds to see a girl in a opposite car and tries to hit on her which is summed up to) “oh brother you’re such a flirt” “La is too hard mom we should move back to old town and give divorced dad a chance” why does every show nowadays insist on telling instead of showing ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lebfhh/la_brea/"
    },
    {
        "id": "1lehdd5",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reveals Nevermore Academy’s Dark Return, Fans Can Apply &amp; Meet The New Principal",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lehdd5/netflix_reveals_nevermore_academys_dark_return/"
    },
    {
        "id": "1le38m7",
        "author": "Blue_Steve945",
        "title": "Why Does Netflix Always Skip the Second Movie?",
        "content": "Anyone else notice Netflix has the first, third, and even fourth movies in a series—but never the second? Like with Kung Fu Panda, it’s so frustrating!\n\nI get there are rights issues, but why tease us with an incomplete series? If they can’t have the whole thing, maybe don’t show any of it.\n\nAnyone know why the second movie always disappears? Would love to hear other examples!",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1le38m7/why_does_netflix_always_skip_the_second_movie/"
    },
    {
        "id": "1ldt8wy",
        "author": "RepairmanJack2025",
        "title": "I need a tv series to watch on Netflix.",
        "content": "Comedy or drama fine, but not too dark.  \n\nSave me from boredom, especially with a show that is maybe not the water cooler talk.  If you have a moment, tell us why we should watch. [US]",
        "upvotes": 24,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1ldt8wy/i_need_a_tv_series_to_watch_on_netflix/"
    },
    {
        "id": "1le4tof",
        "author": "Wild-Resolution-6703",
        "title": "Need Feel Good Netflix Recs",
        "content": "I’m having surgery soon and I’ll be off work for about a week while I recover. I’m looking for some good rom-coms or anything light and funny on Netflix. Just stuff that’ll make me laugh or feel good. Nothing too serious.\n\nWould love your recs. Thanks!",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1le4tof/need_feel_good_netflix_recs/"
    },
    {
        "id": "1lec500",
        "author": "Airiririforlife",
        "title": "Movie Recommendations",
        "content": "I’m a teenage girl and I absolutely fell in love with the to all the boys I’ve loved before movies. I haven’t been able to find a teen rom-com like it. Any recommendations for a good rom com?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lec500/movie_recommendations/"
    },
    {
        "id": "1le54ss",
        "author": "xergame",
        "title": "UI changes",
        "content": "I remember the home UI being like huge, rounded, and really sleek a few days ago, didn't really care since the overall watching was pretty much the same, but now I opened up Netflix today and found the UI back to what it was originally before the rounded UI, but the UI while watching changed, you can no longer change the dub below the progress bar, you would have to go to the Audio and Subtitles button now? Don't know if it's just me or anything. Wtf is Netflix doing? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1le54ss/ui_changes/"
    },
    {
        "id": "1le1jqs",
        "author": "Friendly-Chest6467",
        "title": "Those who watched Forever (2025) please tell me what happens.",
        "content": "My coworker wants me to watch this show because she wants to talk to someone about it but I really don’t want to as it sounds really sad. I will watch it but I’d really appreciate it if someone tells me what happens each episode so nothing surprises me. Google only shows the ending. You can dm me so it’s not spoiled for the rest of the community. \n\nThanks again. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1le1jqs/those_who_watched_forever_2025_please_tell_me/"
    },
    {
        "id": "1ldm4r8",
        "author": "moon-1992",
        "title": "Do you know similar psychological thriller shows like “the sinner” or “broadchurch”?",
        "content": "I love these kind of shows. The vibe of both is irreplaceable. I love the detectives, they are broken but not the depressive fallen kind like in “river” and the whole trauma mystery vibe. “The fall” is also a show I really loved!",
        "upvotes": 32,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ldm4r8/do_you_know_similar_psychological_thriller_shows/"
    },
    {
        "id": "1leawrd",
        "author": "_AvgCanadianEh_",
        "title": "Audio keeps cutting out",
        "content": "So here is what I am using. LG C1 Oled smart TV. Got Netflix downloaded on it. And for audio, I have a pair of Sony Wireless Headphones connected through bluetooth to my tv\n\nMy issue is, everytime I watch Netflix with this exact set up, the audio always cuts out while whatever im watching keeps playing. Ive looked it up before and something about Dolby audio settings in Netflix, but that's not a thing, the only options are subtitles and audio language. Thats all. I need to know why this is happening and if there is a fix please 🙏 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1leawrd/audio_keeps_cutting_out/"
    },
    {
        "id": "1ldmz2h",
        "author": "cheese-balls28",
        "title": "astroworld documentary",
        "content": "no words my heart aches so hard i just can’t make this shit up what the fuck was astroworld 2021? why didn’t it stop earlier? 10 people DIED. it’s so insane to me. i feel so overwhelmed. #stoptheshow",
        "upvotes": 24,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ldmz2h/astroworld_documentary/"
    },
    {
        "id": "1lekw6w",
        "author": "Double-Community1559",
        "title": "Why isn't there “Bundled” Services in Singapore? (Netflix, grabunlimited, anytime fitness and spotify)",
        "content": "Hi everyone!\n\nWhy hasn't everyone created some sort of lifestyle bundled subscription services in Singapore. Like a bundle of netflix, grabunlimited, anytime fitness and spotify. (Based on one's lifestyle)\n\nI recently heard about a service called “Bundled” in the US that lets users combine and manage all their digital subscriptions under one login and bill. It sounds like a dream for anyone tired of subscription overload and I'm sure it would be cheaper as well when it comes in a bundle.\n\nDoes SG have something like that.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lekw6w/why_isnt_there_bundled_services_in_singapore/"
    },
    {
        "id": "1ldnc65",
        "author": "Pep_Baldiola",
        "title": "The Sandman: Season 2 | Official Trailer | Netflix ( Vol. 1 - July 3 | Vol. 2 - July 24)",
        "content": "",
        "upvotes": 22,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ldnc65/the_sandman_season_2_official_trailer_netflix_vol/"
    },
    {
        "id": "1le7url",
        "author": "ddben",
        "title": "Need a series for 6 hour flight",
        "content": "Flying cross countries week and need entertaining series to save.  Have enjoyed the “neighbors” series, “the Pitt”, and American crime dramas.\nAlso, how do you save each episode on an iPad and where does it go? TIA",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1le7url/need_a_series_for_6_hour_flight/"
    },
    {
        "id": "1ldrz5n",
        "author": "S4v1r1enCh0r4k",
        "title": "Carla Gugino Teams Up with Brad Pitt for David Fincher’s Netflix Thriller",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrz5n/carla_gugino_teams_up_with_brad_pitt_for_david/"
    },
    {
        "id": "1le3zgk",
        "author": "dicedtomatoes55",
        "title": "'Deep Cover's Comedic Trio Is Funnier Than It Has Any Right To Be",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1le3zgk/deep_covers_comedic_trio_is_funnier_than_it_has/"
    },
    {
        "id": "1lda1uo",
        "author": "clist186",
        "title": "Anyone else in Canada notice the Naked Gun trilogy on Netflix got removed after a day?",
        "content": "It's been advertised for weeks as releasing Sunday June 15th, and I even started watching the second movie yesterday. I logged in today to continue watching and all three movies have been removed completely. Not even a \"coming soon\".\n\nEDIT (06/17): It does now say \"Coming Saturday\" (June 21), but only if you search 'Naked Gun Netflix' in Google and click the Netflix link. It's not searchable from within Netflix and doesn't show up in Netflix \"Coming Soon\".",
        "upvotes": 60,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1lda1uo/anyone_else_in_canada_notice_the_naked_gun/"
    },
    {
        "id": "1le1ix1",
        "author": "watchman28",
        "title": "Netflix stops playing the moment credits start, and watch credits option is gone",
        "content": "For a while now rather than minimising the credits in a little window in the top left and either playing a preview or counting down to the next episode, it's been stopping playback altogether, meaning I can't watch the credits. The 'watch credits' option doesn't appear, and if I go back to the window on the top right it doesn't resume from the start of the credits, it starts the episode/movie over again. This is a pain in the bum for a number of reasons, not least that I've been watching Love, Death and Robots and I've no idea who's been doing the voices in each episode as I can't watch the credits. \n\nI've tried everything I can think of - refreshing the app, updating the TV software, turning off auto play previews and next episode, and nothing seems to work. \n\nIt appears to only be happening on my TV (through the Sky Netflix app) - it doesn't happen if I watch on the iPad or through the PS5. Anyone got any ideas? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1le1ix1/netflix_stops_playing_the_moment_credits_start/"
    },
    {
        "id": "1le9dm2",
        "author": "DiedOfATheory",
        "title": "Why did viewer numbers crash!?",
        "content": "If you like Arnold movies, you'll like this show. It's funny and action packed, and it's just a fun show to watch. I can't understand why people aren't watching it this season.... ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1le9dm2/why_did_viewer_numbers_crash/"
    },
    {
        "id": "1ldxszh",
        "author": "Flyaway_5",
        "title": "Movies about a person who lost their mother at birth?",
        "content": "I'm looking for any movies or series about a person, it can be a child or an adult, who lost their mother at birth. And they are trying to cope or something like that. Are there any movies about something like this? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ldxszh/movies_about_a_person_who_lost_their_mother_at/"
    },
    {
        "id": "1ldxnmw",
        "author": "ItsGeekFN",
        "title": "not saving place/episode when I switch from mobile to tv",
        "content": "I'm currently on episode seven of Death Note, and I'm watching it on my phone, when I went to go and watch it on my tv, it went back to episode one, so I went and hit play on the first episode to skip back to the current episode I'm on, then a bit later when I go back to my phone to watch it, it defaults to a certain point in episode 7 with that and the first episode being \"the only ones viewed/watched\", so I'm just asking if there's a netflix genius who could help me out.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldxnmw/not_saving_placeepisode_when_i_switch_from_mobile/"
    },
    {
        "id": "1lclhx2",
        "author": "moistwound",
        "title": "Netflix is punishing me for traveling",
        "content": "So I’m on vacation in the Caribbean with my girlfriend — we live together in CO, and like most people these days, we pay for the cheapest version of Netflix (with ads) because streaming’s gotten outta control. Between all the different platforms, we keep it low tier just so we can still have access to most stuff.\n\nAnyway, we’re chilling on vacation, decide to throw on a movie, and go straight to Netflix — our usual go-to. And what do we get? A notification saying:\n“Your subscription tier is not available in this region.”\nSo… basically, we can’t use Netflix at all.\n\nAnd THEN — get this — it hits us with:\n“You can change your subscription [here]” with a link to upgrade.\nLike that’s gonna make me go “oh yeah sure, let me give Netflix more money just so I can use it on my vacation.” Bro, be serious.\n\nI’ve been paying for Netflix for years. I’m not asking for a free ride — just some common sense. Would it really kill them to say:\n“This tier isn’t available in your current region. You have 7 days of access while traveling — enjoy your vacation!”\nGive me a little grace period. A little respect. I’m not a new user. I’m just out of town for a minute.\n\nSo what now? Am I supposed to pause or cancel my Netflix sub every time I leave the country? Is it even worth paying anymore if I’m gone for part of the month? It shouldn’t be that complicated.\n\nAnd this is why people are done with streaming services. They nickel-and-dime loyal users, and act surprised when people jump ship. It’s like they want to lose us.\n\nNetflix — if you’re listening — stop punishing your paying customers for traveling. It’s not a good look. Especially when all we wanted to do was watch a damn movie on vacation.",
        "upvotes": 640,
        "comments": 176,
        "media": null,
        "permalink": "/r/netflix/comments/1lclhx2/netflix_is_punishing_me_for_traveling/"
    }
]