[
    {
        "id": "1k6ywov",
        "author": "Mickey17AMA",
        "title": "Hi /r/movies - I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Alien: Covenant, Venom 2, and recent Doctor Who episode 'Lux'). My team created the baby creepers, mother, and the ice cavern environments for Mickey 17. Ask Me Anything!",
        "content": "Hi r/movies \\- I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Aline: Covenant, and recent Doctor Who episode 'Lux'). My team created the baby creepers and ice cavern environments for Mickey 17. Ask Me Anything!\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1176327/](https://www.imdb.com/name/nm1176327/)\n\nI'll be back tomorrow (Friday 4/25) at 10:00 AM ET to answer your questions. Please feel free to ask away in the meantime.\n\nMore information:\n\nMickey 17 was written, produced, and directed by Bong Joon Ho, (Parasite, Snowpiercer, Okja, Memories of Murder, The Host)\n\nThe film stars Robert Pattinson in the title role, alongside Naomi Ackie, Steven Yeun, Toni Collette, and Mark Ruffalo. Set in the year 2054, the plot follows a man who joins a space colony as an \"Expendable\", a disposable worker who gets cloned every time he dies.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=osYpGSz\\_0i4](https://www.youtube.com/watch?v=osYpGSz_0i4)\n\nFramestore VFX Supervisor Stuart Penn and his team created the mother and baby creepers, as well as the ice cavern environments, working closely with Director Bong Joon Ho.",
        "upvotes": 1048,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fna7sd36otwe1.png?auto=webp&amp;s=f9075c344bc679024be1b322226a962a7b14b0fc"
        },
        "permalink": "/r/movies/comments/1k6ywov/hi_rmovies_im_stuart_penn_vfx_supervisor_for/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n# Check back tomorrow for a Havoc discussion plus some streaming catch up titles like G20 and 2073!",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1k79mi4",
        "author": "cmaia1503",
        "title": "Sydney Sweeney to Star in ‘Split Fiction’ Film Adaptation From Director Jon M. Chu, ‘Deadpool and Wolverine’ Writers",
        "content": "",
        "upvotes": 2315,
        "comments": 362,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UCowCxwwlo8BlkYRLeBSNc4pSwRA2_DO427Jw1A4uYA.jpg?auto=webp&amp;s=aee76f2395b5d5d33f66ff10cad25dedc3c027a2"
        },
        "permalink": "/r/movies/comments/1k79mi4/sydney_sweeney_to_star_in_split_fiction_film/"
    },
    {
        "id": "1k6ttdz",
        "author": "BunyipPouch",
        "title": "First Image from Netflix's Mystery-Comedy 'The Thursday Murder Club' - Starring Helen Mirren, Pierce Brosnan, Ben Kingsley, Richard E. Grant, Naomi Ackie, and Jonathan Pryce - Four retirees spend their time solving cold case murders for fun, until they find themselves stuck in a real whodunit.",
        "content": "",
        "upvotes": 8220,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zyathbiinswe1.jpeg?auto=webp&amp;s=b66582a4c04c65c89cf6646b67a292620241a381"
        },
        "permalink": "/r/movies/comments/1k6ttdz/first_image_from_netflixs_mysterycomedy_the/"
    },
    {
        "id": "1k71xfp",
        "author": "orthos",
        "title": "One of my favorite movie scenes ever - Amadeus (1984) - Salieri realizes he will never be on Mozart's level of genius.",
        "content": "",
        "upvotes": 2303,
        "comments": 257,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_o44XPMi0SEMntLV14bHhe-ZughQZaPKN-vtKek2G4c.jpeg?auto=webp&amp;s=cbb88d87a7fc8c464349f198a04bef6338348835"
        },
        "permalink": "/r/movies/comments/1k71xfp/one_of_my_favorite_movie_scenes_ever_amadeus_1984/"
    },
    {
        "id": "1k7eggx",
        "author": "Dizzy_Hotwheelz",
        "title": "New Poster for 'BALLERINA' featuring Lance Reddick in theaters June 6th.",
        "content": "",
        "upvotes": 237,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/16zobtlagxwe1.jpeg?auto=webp&amp;s=a6706ed521989b11c7e4713ec5d467dca8ff8d15"
        },
        "permalink": "/r/movies/comments/1k7eggx/new_poster_for_ballerina_featuring_lance_reddick/"
    },
    {
        "id": "1k6riqi",
        "author": "CheechandChong-AMA",
        "title": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please.",
        "content": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please. \n\nWe'll be back at 4 PM ET today to answer your quesitons.\n\nMore info about our new movie:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH &amp; CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech &amp; Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarrirg: Cheech Marin and Tommy Chong",
        "upvotes": 5113,
        "comments": 694,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/49f8k6yg5swe1.png?auto=webp&amp;s=6f02add6c1451bd7f77e76129c4ae7557293a6e5"
        },
        "permalink": "/r/movies/comments/1k6riqi/hey_man_were_cheech_and_chong_were_doing_one_of/"
    },
    {
        "id": "1k72l9p",
        "author": "Past-Outside8050",
        "title": "What's the greatest fake sports moment or athlete cameo in a movie or TV show?",
        "content": "What's the greatest fake sports moment or athlete cameo in a movie or TV show? I know there  are a lot to choose from. I think it’s even better when the athletes go along with the joke. \n\nMy answer is Mark Wahlberg’s character in the Other Guys. If you don’t know he plays a cop and accidentally shot Derek Jeter on the night of game 7 of the World Series. \n\n",
        "upvotes": 594,
        "comments": 650,
        "media": null,
        "permalink": "/r/movies/comments/1k72l9p/whats_the_greatest_fake_sports_moment_or_athlete/"
    },
    {
        "id": "1k7cquy",
        "author": "Bluntfeedback",
        "title": "Movies that aged like fine wine",
        "content": "What older movie (20+ years) do you think has aged like fine wine and is even more impressive when watched today?\n\nNetwork (1976) seemed over-the-top and satirical when it was released, but watching it now feels eerily prophetic about our modern media landscape and reality TV culture. What other older films initially missed the mark but became more relevant with time?",
        "upvotes": 101,
        "comments": 221,
        "media": null,
        "permalink": "/r/movies/comments/1k7cquy/movies_that_aged_like_fine_wine/"
    },
    {
        "id": "1k70ec4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Guy Ritchie’s ‘The Fountain of Youth’",
        "content": "",
        "upvotes": 495,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/skhofj92ztwe1.jpeg?auto=webp&amp;s=180f570b397b4dbffdfeb63d16dd28db5d5b5eb8"
        },
        "permalink": "/r/movies/comments/1k70ec4/official_poster_for_guy_ritchies_the_fountain_of/"
    },
    {
        "id": "1k70824",
        "author": "Ticus6866",
        "title": "Whiplash ending hit like a truck, and I can’t stop thinking about how neither of them were really victims.",
        "content": "Just rewatched Whiplash and that ending hit different this time. Everyone talks about how epic the final scene is and it is but TBH it kind of cemented how much Andrew completely lost the plot by then.\n\nThe whole movie builds up this toxic cycle between him and Fletcher, and yeah, it looks like Fletcher is the manipulative villain while Andrew is just this ambitious underdog. But by the end, it’s not that simple. Andrew needs Fletcher’s validation. He’s been so brainwashed that he’ll go to any length for that one moment of acknowledgment.\n\nAnd Fletcher.. well he’s a wreck too. He loses his job, his respect, everything but still clings to this idea that greatness only comes from suffering. In that final scene, he basically traps Andrew, tries to humiliate him and Andrew still gives him what he wants. It’s messed up. They’re not enemies, they’re enablers.\n\nThere’s no real “winner” here. They both pushed each other past the edge. And while it ends with that incredible solo, it’s not triumphant. It’s tragic. Andrew isn’t free..he’s all in, and there’s no coming back. He’s chasing this impossible standard that’ll probably destroy him.",
        "upvotes": 438,
        "comments": 116,
        "media": null,
        "permalink": "/r/movies/comments/1k70824/whiplash_ending_hit_like_a_truck_and_i_cant_stop/"
    },
    {
        "id": "1k7bluo",
        "author": "KillerCroc1234567",
        "title": "Oscars: Film Academy Revokes, Then Reinstates Screenings Access for Widows and Widowers After Backlash",
        "content": "",
        "upvotes": 54,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N4vafNdyir7Og6IrtAgwBUJCZlZa1_aldCXKrMBzLRw.jpeg?auto=webp&amp;s=4bd66a402f858df568a12dedfd70c75470b79b64"
        },
        "permalink": "/r/movies/comments/1k7bluo/oscars_film_academy_revokes_then_reinstates/"
    },
    {
        "id": "1k6yvw7",
        "author": "ChiefLeef22",
        "title": "'Havoc' - Review Thread",
        "content": "Director: Gareth Evans\n\nCast: Tom Hardy,  Jessie Mei Li, Timothy Olyphant, Forest Whitaker, Justin Cornwell\n\nLogline: *After a drug deal gone wrong, a bruised detective must fight his way through the criminal underworld to rescue a politician's estranged son, unravelling a deep web of corruption and conspiracy that ensnares his entire city.*\n\n**Rotten Tomatoes:** [67/100](https://www.rottentomatoes.com/m/havoc_2025)\n\n**Metacritic:** [59/100](https://www.metacritic.com/movie/havoc/)\n\nSome Reviews:\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/havoc-review-tom-hardy-gareth-evans-netflix-1236198216/)\n\n&gt;With Hardy in fine form at the wheel, *Havoc* knows what its audience wants. It also looks great, with regular Evans DP Matt Flannery’s dynamic cameras zipping in and out of the bloody fray and textured visuals slashed with throbbing colors. The setting is a city so grim and seedy it seems to exist only at night. The fact that the environments were mostly constructed at a studio in Cardiff suggests there’s lots of ace craftspeople hiding out in Wales.\n\n[SlashFilm - Chris Evangelista](https://www.slashfilm.com/1842207/havoc-movie-review-tom-hardy-gareth-evans/)\n\n&gt;To be clear: I love a good, violent action movie as much as the next dude, but you have to give me something more than just one extreme shootout followed by another. Perhaps if the hyperviolence was a little more stylized it would play better. Instead, it's just ugly stuff repeated in numbing fashion. By the time \"Havoc\" ended, I felt as exhausted as Hardy's beaten and bruised character. I suppose Evans and company deserve some credit for making an action movie that really leans into the brutality, but there's only so much of that you can put up with before it starts to grow tedious.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/havoc-review-tom-hardy-gareth-evans-1236375320/)\n\n&gt;There’s a reason big-studio producers looked to Sundance darlings like Colin Trevorrow, Rian Johnson and Jon Watts to handle their tentpoles: not because those guys are great at action, but because they keep the interpersonal dynamics interesting. That’s precisely where Evans wreaks the most havoc, ignoring (or simply not understanding) what connects us to such characters in the first place — and therefore ensuring that his unwieldy Netflix vehicle is dead on arrival.\n\n[NextBestPicture - Giovanni Lago](https://nextbestpicture.com/havoc/) \\- 6/10\n\n&gt;After years of waiting, it feels like “Havoc” was never going to reach the pre-conceived levels of hype that it was supposed to live up to. It’s clear that whenever certain moments were filmed years later than the original period of principal photography (mainly due to Hardy’s more than apparent changes in beard thickness), there’s doubt it made any real difference in the final cut that Evans envisioned. Still, when “Havoc” hits, it only reminds us how awesome it feels when Evans gets to do his own thing. Even a flawed Gareth Evans film satisfies more than most action flicks today.\n\n[Empire - Beth Webb](https://www.empireonline.com/movies/reviews/havoc/) \\- 4/5\n\n&gt;There’s also something refreshingly egoless to it; Hardy may have top billing but takes not only many sucker punches to the face but an entire roof to the head. Around him Evans utilities his full cast, throwing greener actors like Quelin Sepulveda, who plays Charlie’s partner Mia, into the eye of the storm, armed with a meat cleaver and a mission to survive. The result is a throbbing, bone-crunching diorama of violence with the occasional horrifying, glorious flourish (you’ll never want to see a fishing harpoon again).\n\n[Slant Magazine - Jake Cole](https://www.slantmagazine.com/film/havoc-review-tom-hardy-gareth-evans/)\n\n&gt;Instead of elaborate exchanges of close-quarters strikes and counters, the characters here tend to get the upper hand based on who has the quickest reflexes in tackling an assailant or getting a block up at the last possible second. Despite the advanced choreography that Evans and Flannery capture with a generally superior sense of visual fluidity than they displayed in the *Raid* movies, there’s an overwhelming sense of chaos here that feels realistic.\n\n[Nick Schager - The Daily Beast](https://www.thedailybeast.com/obsessed/tom-hardys-havoc-review-the-action-extravaganza-of-the-year/)\n\n&gt;*Havoc* is such relentless, hardhearted business that the squeamish need not enlist. Nonetheless, those with a hankering for escalating insanity will be well satiated by this saga, whose narrative convolutions are untangled in a second half that puts a premium on combat. Disappointingly, Evans (who wrote the script) shortchanges Olyphant in a role that’s barely one-dimensional and receives no stand-out moments—to a large extent because he shares only scant screen time with Hardy. The director makes up for it, however, with a barrage of broken bones and mutilated corpses—and set pieces drenched in slow motion and decorated with flying glass, splinter, and bodily debris—that tips the material into sensory-overload territory.\n\n[Collider - Tania Hussain](https://collider.com/havoc-movie-review-netflix-tom-hardy/)\n\n&gt;*Havoc* might deliver on its promise of blood, guts, and glory, but it’s these committed performances that keep it from completely collapsing under its self-induced chaos. While the vision by Evans swings hard as a stylishly savage brawler, it rarely lands with meaning, which also feels like an injustice to the filmmaker’s incredible past work. Despite a top-tier cast and bone-rattling action to keep you engaged, the Netflix flick buckles under a cluttered story with chaotic execution. It’s watchable, even entertaining in bursts — but beneath all the bruises and broken bones, there’s not much else to hold onto.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/havoc-review-netflix-tom-hardy-1235117850/?utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter) \\- B-\n\n&gt;Rote as Evans’ plot might be, and wasteful as its treatment of certain characters *definitely* is (pour one out for Jessie Mei Li, whose screen time as Walker’s new partner greatly outweighs her purpose to the story), he has a well-developed ear for ice-cold gangster speak, and he isn’t afraid to make people pay a steep price for their penance. It’s enough to forgive him — and/or the movie gods — for making us wait so long to see him do it again. ",
        "upvotes": 277,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7hWAQleIbcA6y75_a03X6blRKmGvmi0ViOAiY80WWqU.jpg?auto=webp&amp;s=8cd1f6d1c9117179cc576e9fc628451fcf1cf688"
        },
        "permalink": "/r/movies/comments/1k6yvw7/havoc_review_thread/"
    },
    {
        "id": "1k7dur9",
        "author": "The_Spaghetti_yeti",
        "title": "Trainspotting 2 is a Top-Tier Film",
        "content": "Just as the title says. I watch this movie around once a year, and it's easily in my top 5. \n\nIt's fantastic movie about aging, friendship and loneliness. It's heartbreaking, funny, thought provoking, and well directed (crisp and creative visuals) + acted. I really like the original as well, but there's just something about this film. \n\nAnyone else think Trainspotting 2 is top notch? ",
        "upvotes": 30,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1k7dur9/trainspotting_2_is_a_toptier_film/"
    },
    {
        "id": "1k79o90",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Until Dawn [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/oS6HYtAvNujW)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/oS6HYtAvNujW)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**  \n*Until Dawn* is a horror film directed by David F. Sandberg, based on the 2015 video game of the same name. The story follows Clover and her friends as they venture into a remote valley to investigate the mysterious disappearance of Clover's sister, Melanie. They find themselves trapped in a time loop, reliving the same night where they are hunted by a masked killer. Each iteration introduces new and more terrifying threats, and the group realizes they have a limited number of chances to survive until dawn. The film explores various horror subgenres, including slasher, supernatural, and body horror.\n\n**Director**  \nDavid F. Sandberg\n\n**Writers**  \n- Blair Butler  \n- Gary Dauberman\n\n**Cast**  \n- Ella Rubin as Clover  \n- Michael Cimino  \n- Odessa A’zion  \n- Ji-young Yoo  \n- Maia Mitchell  \n- Belmont Cameli  \n- Peter Stormare as Dr. Alan J. Hill\n\n**Rotten Tomatoes**: [63%](https://www.rottentomatoes.com/m/until_dawn_2025)  \n**Metacritic**: [56](https://www.metacritic.com/movie/until-dawn/)\n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=2b3vBaINZ7w)**\n\n---",
        "upvotes": 56,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/"
    },
    {
        "id": "1k75qcp",
        "author": "verissimoallan",
        "title": "'Friday the 13th Part VII’ Star Lar Park Lincoln Has Passed Away",
        "content": "",
        "upvotes": 106,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1k75qcp/friday_the_13th_part_vii_star_lar_park_lincoln/"
    },
    {
        "id": "1k6uxsf",
        "author": "cmaia1503",
        "title": "Chloe Zhao’s ‘Hamnet,’ Starring Paul Mescal and Jessie Buckley, Sets November 27th Release Date",
        "content": "",
        "upvotes": 403,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZbukI1OVl6GWpIQhB5rVLqRgPzuaSeRXe9ZFXg_ygoQ.jpg?auto=webp&amp;s=bd43d18b911f6255f6c3367ba22c94ac0561a973"
        },
        "permalink": "/r/movies/comments/1k6uxsf/chloe_zhaos_hamnet_starring_paul_mescal_and/"
    },
    {
        "id": "1k7d6qt",
        "author": "tme77",
        "title": "Just for fun. What movie do you always watch if it happens to come on",
        "content": "Point Blank just came on while I was flipping through channels, and I haven't watched it since it came out, but I have come across it 2x in the last year and watched both times.  Not my favorite by any means, but still find it a good watch/stands the test of time.  So it got me thinking what movies my fellow redditors also rewatch (not necessarily seeking it out) when it comes on.\n\nNot asking for favorites necessarily, just for fun, and maybe I'll find a movie or two to check out from your responses! \n\nEdited: typos and RIP Patrick Swayze ",
        "upvotes": 25,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1k7d6qt/just_for_fun_what_movie_do_you_always_watch_if_it/"
    },
    {
        "id": "1k6vy1y",
        "author": "KillerCroc1234567",
        "title": "‘Ballerina’: Exclusive Character Posters from the John Wick Universe Movie",
        "content": "",
        "upvotes": 265,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AeHF_yE-qyrivaC3tvd5_qe35iTU-e7bX0lqOM1viJo.jpg?auto=webp&amp;s=3a903238f8fdf1f90b4d9a31d81941877266eccf"
        },
        "permalink": "/r/movies/comments/1k6vy1y/ballerina_exclusive_character_posters_from_the/"
    },
    {
        "id": "1k71dlk",
        "author": "dcterr",
        "title": "The Gods Must Be Crazy",
        "content": "How many of you watched this one? If not, I highly recommend it! I think it captures quite well what's wrong with \"civilized men\", in particular, to how we relate to more \"primitive societies\", and I think it has a very strong moral message, or perhaps a few! In addition, I think the story is quite entertaining and inspiring. Watch where you drop your Coke bottle!",
        "upvotes": 132,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1k71dlk/the_gods_must_be_crazy/"
    },
    {
        "id": "1k6wpmp",
        "author": "cmaia1503",
        "title": "‘Hunger Games: Sunrise On The Reaping’ Movie At Lionsgate Taps Mckenna Grace In Maysilee Donner Role",
        "content": "",
        "upvotes": 181,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uf3vqLNngnQoPq4ibYpA5UxTPxukloNv6BlFFQysl6c.jpg?auto=webp&amp;s=b580421a26821546c3d35b254a2abc554b8b0e5d"
        },
        "permalink": "/r/movies/comments/1k6wpmp/hunger_games_sunrise_on_the_reaping_movie_at/"
    },
    {
        "id": "1k69iod",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Pee-wee as Himself’",
        "content": "",
        "upvotes": 8450,
        "comments": 589,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v08wrwas9nwe1.jpeg?auto=webp&amp;s=9287d80c9fbd39fc3172ef2d64b3507c704756ef"
        },
        "permalink": "/r/movies/comments/1k69iod/official_poster_for_peewee_as_himself/"
    },
    {
        "id": "1k7egcf",
        "author": "hcknbnz",
        "title": "What film is the 'wrong entry point' for either an actor or director?",
        "content": "What film represents the wrong entry point for an actor or director when viewed against the rest of their body of work? This isn't necessarily about their worst or least successful film, but rather about a movie that serves as the wrong starting place to their career. Their first film is off-limits, choosing that would be too easy and feel like a cop-out. The film should stand out in some distinct way from the rest of their work, which makes the question even more interesting and more difficult when applied to someone with a long and varied career.\n\nSome examples might include Arnold Schwarzenegger in Junior, Francis Ford Coppola's Jack, Kevin Smith's Red State, or Judi Dench in The Chronicles of Riddick.",
        "upvotes": 13,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1k7egcf/what_film_is_the_wrong_entry_point_for_either_an/"
    },
    {
        "id": "1k71c2e",
        "author": "StellaZaFella",
        "title": "In Casino, why did Ace trust Ginger when it was clear she shouldn't/couldn't be trusted?",
        "content": "At the beginning of Casino, there's a voiceover of Ace where he says, \"When you love someone, you gotta trust them, there's no other way. You've got to give them the key to everything that's yours. Otherwise, what's the point? And for a while, that's the kind of love I believed I had\". \n\nHow did Ace ever trust Ginger as much as he did? He's a smart guy, and suspicious of everyone. He knew she was a hustler/grifter. And there are moments pretty early on where she blatantly lies to him or cheats him--when she takes money for a drink and doesn't give him change and says she spent it on some tables on the way back; when she calls Lester after their wedding. \n\nI don't get why he was so blind to her being untrustworthy to the point he gives her the only key to the money that might need to be used to get him out of trouble. (And I'm surprised she didn't take any of it before the end of things.)\n\nAm I missing something--why did Ace think he had the kind of love where he could trust her with everything when she never showed herself to be worthy of that trust in the first place? ",
        "upvotes": 99,
        "comments": 82,
        "media": null,
        "permalink": "/r/movies/comments/1k71c2e/in_casino_why_did_ace_trust_ginger_when_it_was/"
    },
    {
        "id": "1k74918",
        "author": "KillerCroc1234567",
        "title": "TCM Classic Film Festival To Open With George Lucas And ‘The Empire Strikes Back’ &amp; More Popular Blockbusters Than Ever From ‘Jaws’ To ‘Back To The Future’ To ‘Superman’",
        "content": "",
        "upvotes": 59,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8PEsJ8VGaQ_Rn-JiNCmoTbpZ0Emtv8SebdnbzA1Urp0.jpeg?auto=webp&amp;s=9576398d7a2de653314736a6be24b37f44be78df"
        },
        "permalink": "/r/movies/comments/1k74918/tcm_classic_film_festival_to_open_with_george/"
    },
    {
        "id": "1k79o5r",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Accountant 2 [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/cyPFmDgtrtMx)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/cyPFmDgtrtMx)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**  \n*The Accountant 2* picks up nine years after the original, with Christian Wolff (Ben Affleck) drawn back into a deadly investigation when his former boss, Treasury Director Ray King (J.K. Simmons), is murdered. The cryptic message \"find the accountant\" leads Agent Marybeth Medina (Cynthia Addai-Robinson) to seek Christian's help. Teaming up with his estranged brother Brax (Jon Bernthal), Christian uses his exceptional skills to unravel a conspiracy involving human trafficking and corruption. As they delve deeper, they attract the attention of ruthless killers intent on stopping them. The film combines intense action with moments of dark humor, exploring themes of neurodiversity and familial bonds.\n\n**Director**  \nGavin O'Connor\n\n**Writer**  \nBill Dubuque\n\n**Cast**  \n- Ben Affleck as Christian Wolff  \n- Jon Bernthal as Brax  \n- Cynthia Addai-Robinson as Marybeth Medina  \n- Daniella Pineda as Anaïs  \n- Allison Robertson as Justine  \n- J.K. Simmons as Ray King  \n- Robert Morgan as Burke  \n- Grant Harvey as Cobb  \n- Andrew Howard as Batu \n\n**Rotten Tomatoes**: [75%](https://www.rottentomatoes.com/m/the_accountant_2)  \n**Metacritic**: [60](https://www.metacritic.com/movie/the-accountant-2/)  \n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=)**\n\n---",
        "upvotes": 31,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/"
    },
    {
        "id": "1k6vy5t",
        "author": "Task_Force-191",
        "title": "Fountain of Youth — Official Trailer 2 | Apple TV+",
        "content": "",
        "upvotes": 153,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BEBuJpjQelvxeEDMwJzf7dOiLfoD4ccbYZ8MJ5YWdaE.jpg?auto=webp&amp;s=e99483c3aae488e4a8c89bdabf43e6240b234d82"
        },
        "permalink": "/r/movies/comments/1k6vy5t/fountain_of_youth_official_trailer_2_apple_tv/"
    },
    {
        "id": "1k79och",
        "author": "LiteraryBoner",
        "title": "Official Throwback Discussion - The Virgin Suicides [SPOILERS]",
        "content": "# As an ongoing project, in 2025 /r/movies will be posting Throwback Discussion threads weekly for the movies that came out this same weekend 25 years ago. As a reminder, Official Discussion threads are for discussing the movie and not for meta sub discussion.\n\n\n---\n\n**Summary**  \n*The Virgin Suicides* is a haunting coming-of-age drama directed by Sofia Coppola in her feature debut. Set in 1970s suburban Michigan, the film follows the lives of the five Lisbon sisters—Cecilia, Lux, Bonnie, Mary, and Therese—through the eyes of a group of neighborhood boys who become obsessed with them. After a series of tragic events, including the suicides of the sisters, the boys reflect on their memories and the mystery surrounding the girls' lives. The film explores themes of adolescence, isolation, and the complexities of female identity.\n\n**Director**  \nSofia Coppola\n\n**Writer**  \nSofia Coppola\n\n**Cast**  \n- Kirsten Dunst as Lux Lisbon  \n- Josh Hartnett as Trip Fontaine  \n- James Woods as Mr. Lisbon  \n- Kathleen Turner as Mrs. Lisbon  \n- A.J. Cook as Mary Lisbon  \n- Hanna Hall as Cecilia Lisbon  \n- Chelse Swain as Bonnie Lisbon  \n- Leslie Hayman as Therese Lisbon\n\n**Rotten Tomatoes**: [80%](https://www.rottentomatoes.com/m/virgin_suicides)  \n**Metacritic**: [77](https://www.metacritic.com/movie/the-virgin-suicides/)\n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=Q3YtQqGzP1M)**\n\n---",
        "upvotes": 21,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YPB9qN8cLNIsqoiyslqZMyCJ1CrsuoEAuQkgePiWdG8.jpg?auto=webp&amp;s=2d3cc1fe3ab241f68646c691d89222b26e7cff28"
        },
        "permalink": "/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/"
    },
    {
        "id": "1k6s3wt",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for ‘Mission: Impossible – The Final Reckoning’",
        "content": "",
        "upvotes": 150,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZ2GvoTSFT5pK0l9HETouDlFSzyuLfpnEgUukEyIpKk.jpg?auto=webp&amp;s=25a68c54017aa9c039db4c0e7a6f93cc0617d29b"
        },
        "permalink": "/r/movies/comments/1k6s3wt/new_character_posters_for_mission_impossible_the/"
    },
    {
        "id": "1k7dxoj",
        "author": "jumbos_clownroom",
        "title": "Do not use Fandango",
        "content": "I bought IMAX tickets through fandango and the theater cancelled the showing (got moved to non-IMAX). Fandango never emailed me to let me know so I drove 45 mins to a theater that wasn’t showing my movie. They refunded my card but kept their service fee!! I called them and they told me tough shit that’s our policy and they can’t refund me the service fee. \n\nWhat kind of scammy ass company does this?? I’ll never purchase through them again. ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1k7dxoj/do_not_use_fandango/"
    },
    {
        "id": "1k761nm",
        "author": "Ghostmoderator",
        "title": "Which sports movie made you want to play that sport?",
        "content": "This probably happens a lot less as an adult, but I think every one of us as a kid saw a movie and right after it we wanted to play that sport. I don't necessarily mean professionally. I mean, you just wanted to go out and do what you saw in the movie. I remember after watching kingpin me and my sister wanted to go bowling. She also wanted me to train her how to box after we watched Rocky.",
        "upvotes": 21,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1k761nm/which_sports_movie_made_you_want_to_play_that/"
    },
    {
        "id": "1k674z3",
        "author": "MovieMike007",
        "title": "Small Soldiers is getting a 4K release!",
        "content": "",
        "upvotes": 3604,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5DWgQrEF1wIIxmLh3whsm9CR5-WGSqjszIjBPPzZJPA.jpg?auto=webp&amp;s=a2d2e50cdf0397f363f4403e12a14837b6522328"
        },
        "permalink": "/r/movies/comments/1k674z3/small_soldiers_is_getting_a_4k_release/"
    }
]