[
    {
        "id": "1pqpfyk",
        "author": "ClarkGreggAMA",
        "title": "Hi /r/movies! I'm Clark Gregg. You might know me from Agents of SHIELD, Iron Man, Thelma, 500 Days of Summer, The Avengers, State and Main, The West Wing, The Shield, and more. Ask me anything!",
        "content": "Hi r/movies! I'm Clark Gregg. You might know me from things like **Agents of SHIELD**, **Iron Man**, **Thelma**, **500 Days of Summer**, **The Avengers**, **Magnolia**, **State and Main**, **Much Ado About Nothing**, **Being the Ricardos**, **Snowpiercer**, **The West Wing**, **The New Adventures of Old Christine**, **The Shield**, and more. Maybe you've also seen me on Broadway in A Few Good Men or Good Night, and Good Luck. Full list of credits [here](https://www.imdb.com/name/nm0163988/).\n\nI also star in **The Artist**, a new murder-mystery series which is streaming exclusively on [TheNetwork.Stream](http://TheNetwork.Stream)\n\nI'm here to answer your questions.\n\nMore information about my newest project:\n\n**The Artist** \\- In the twilight of the Gilded Age, murder strikes the estate of an eccentric and failing tycoon. As he hosts the era's biggest celebrities including Thomas Edison, Edgar Degas and Evelyn Nesbit, lies, mystery and ambition collide as the truth is shockingly revealed.\n\n*Trailer*: [http://youtube.com/watch?v=xoA7msjfqkA](http://youtube.com/watch?v=xoA7msjfqkA)\n\nStarring Mandy Patinkin, Janet McTeer, Danny Huston, Hank Azaria, Patti Lupone, Katherine McPhee, Clark Gregg, Ever Anderson, and Zachary Quinto. Streaming exclusively on The Network.\n\nPart 1 premiered on Thanksgiving, and Part 2 will be premiering on Christmas day.\n\nAsk me anything! Back at 3:30 PM today (Friday 12/19) to answer your questions.",
        "upvotes": 3190,
        "comments": 712,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f6kw5v5jt68g1.jpeg?auto=webp&amp;s=f719cc49435ab34b2b61ff80a61d0f750eb38dcd"
        },
        "permalink": "/r/movies/comments/1pqpfyk/hi_rmovies_im_clark_gregg_you_might_know_me_from/"
    },
    {
        "id": "1pqbjno",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Avatar: Fire and Ash / The Housemaid / The SpongeBob Movie: Search for SquarePants)",
        "content": "**New In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwbacks this week as we try to align the weeks so we can continue next year. Next batch of movies were Christmas day releases so we will post them with the Christmas day '26 releases.**\n\n**Still In Theaters**:\n\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 51,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pqbjno/official_discussion_megathread_avatar_fire_and/"
    },
    {
        "id": "1pt09ip",
        "author": "MarvelsGrantMan136",
        "title": "The Odyssey | Official Trailer",
        "content": "",
        "upvotes": 7855,
        "comments": 2152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b-c-luSTpSRK1YN-gyS4IXB7LaVMP-g3Nrix6Won_b0.jpeg?auto=webp&amp;s=19de7a05ecb5d0140eb8b9c46ae765f3a0331460"
        },
        "permalink": "/r/movies/comments/1pt09ip/the_odyssey_official_trailer/"
    },
    {
        "id": "1pt06b4",
        "author": "cnn",
        "title": "Paramount’s new, hostile offer to Warner Bros. Discovery: Larry Ellison will personally guarantee $40 billion",
        "content": "",
        "upvotes": 2799,
        "comments": 417,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sF-kB3KVCB-Ic8YaZTrqDid6td3mwH7_ChyyVzQlS6Q.jpeg?auto=webp&amp;s=161185d2e12509beaf1ee595cece1c90ed9b273a"
        },
        "permalink": "/r/movies/comments/1pt06b4/paramounts_new_hostile_offer_to_warner_bros/"
    },
    {
        "id": "1psewuz",
        "author": "MarvelsGrantMan136",
        "title": "James Ransone, ‘The Wire’ &amp; ‘It: Chapter Two’ actor, dead by suicide at 46",
        "content": "",
        "upvotes": 25035,
        "comments": 1573,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8XMLJ65Jyd9DlG3dGrPTbDDZCqO3w_iiH4yFKDHxfYM.jpeg?auto=webp&amp;s=430bd82114cb69d991f1afdaf9e6c4facf1b8347"
        },
        "permalink": "/r/movies/comments/1psewuz/james_ransone_the_wire_it_chapter_two_actor_dead/"
    },
    {
        "id": "1pszmhv",
        "author": "Hoenirson",
        "title": "Movies where humans are the invading aliens?",
        "content": "With Avatar Fire and Ash coming out, it got me thinking that this concept is strangely rare. At least in mainstream movies. \n\nAside from Avatar and Starship Troopers (kind of), are there any decent movies that reverse the Alien invasion trope and it's humans who without provocation violently invade a planet that has intelligent life? \n\n",
        "upvotes": 466,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1pszmhv/movies_where_humans_are_the_invading_aliens/"
    },
    {
        "id": "1pt14om",
        "author": "CinefiloAmador",
        "title": "Shelley Duvall was magnificent in \"The Shining\" and a strong contrast with Jack Nicholson. Hard to take she got a Razzie nomination for it back then.",
        "content": "To be fair, The Shining didn't get a positive reception when it came out. It took years for the movie to be reevaluated as a Horror classic. \n\nI got to see the remastered version in theaters a few weeks ago and besides Jack Nicholson's tour de force as Jack Torrance (everybody was good including the kid actor), I must say I got to enjoy Shelley Duvall a whole lot more. Her performance is much more subtle than Nicholson's because her character, Wendy, internalizes everything. She's trying to make the household as tension-free as possible because she's scared of her husband so she comes up with these cookie cutter comments but everything she does or say irritates her husband. \n\nOne scene in particular which had me near tears was when Wendy sees Danny from afar while Jack is breaking down. In her mind, she's trying to keep Danny away so as to not irritate Jack more but as she comes closer to Danny and sees the bruises in his neck, she explodes. She lets Jack have it after weeks of trying to keep the peace. All the fear and tension was gone because now all she could see was her kid is hurt and visibly traumatized and she wanted to rail against the man she assumes hurt him.",
        "upvotes": 358,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1pt14om/shelley_duvall_was_magnificent_in_the_shining_and/"
    },
    {
        "id": "1psrxx0",
        "author": "nioctibrofkcidkcusi",
        "title": "Looking for Erotic movie suggestions",
        "content": "Call me weird, i dont care; I enjoy a good erotic movie here and there. Im pretty new to that scene but my favorites ive seen are the 70s Alice in Wonderland Musical Comedy and Through the Looking Glass. Ive been looking at Melusine to pick some stuff out but the selection is vast and im sure a large chunk of it isn't worth anybodys time or money so I'm wondering what else is out there that people tend to enjoy, maybe some stuff that's like historically significant too like Behind The Green Door. ",
        "upvotes": 1575,
        "comments": 695,
        "media": null,
        "permalink": "/r/movies/comments/1psrxx0/looking_for_erotic_movie_suggestions/"
    },
    {
        "id": "1psnubl",
        "author": "gimmeluvin",
        "title": "What movie features a plot point where the financials don't add up and the plot device would be impractically expensive?",
        "content": "I know Demolition man is sci-fi, but it just seems to me that it would be insanely expensive to hold someone in cryonic suspension for seventy years.\n\nThe equipment looks like it was super expensive to develop.\n\nThey still have to have prison staff to move the prisoner.\n\nThe maintenance costs for the whole setup would have to be insane.\n\nI guess the only savings would be in not having to provide meals and laundry.\n\n",
        "upvotes": 1544,
        "comments": 970,
        "media": null,
        "permalink": "/r/movies/comments/1psnubl/what_movie_features_a_plot_point_where_the/"
    },
    {
        "id": "1pt3m39",
        "author": "Task_Force-191",
        "title": "ALL YOU NEED IS KILL | Official English Trailer - In Theatres January 16",
        "content": "",
        "upvotes": 73,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RivF_cRPRYULJZli62Um-TCFYlUPB1Qa4Cd1WfNRysw.jpeg?auto=webp&amp;s=f49135cbd44763ed15ff275f1a204c8af2f1a0ec"
        },
        "permalink": "/r/movies/comments/1pt3m39/all_you_need_is_kill_official_english_trailer_in/"
    },
    {
        "id": "1psjlu9",
        "author": "PastorParcel",
        "title": "Why I believe the receptionist in Die Hard deserved his fate.",
        "content": "My wife and I are watching that festive classic, Die Hard. \n\nEvery year I notice that when John goes to the reception at the start of the film he's told to look up Holly's location on the computer. \n\nOnly when he's finished does the receptionist tell him that the party is on the 30th floor, and they're the ONLY ones left in the building!\n\nThanks, thanks a lot Mr. receptionist. You knew EXACTLY where everyone was, so there was no reason for John to have to use the computer, you just wanted to make him dance for the sake of your ego you sick little man.\n\nThe receptionist gets shot 5 minutes later, deservedly I say.\n\n\nEdit: I shouldn't have to post this edit, but it seems some of you don't understand this is humour. \n\nDie Hard, like all action movies, is about silly gratuitous violence which we would never condone in real life.\n\nI also fully understand it's a plot device, I just think it's funny.\n\n\nEdit 2: Thank you to all you very sincere and humourless folk who have graced this thread with your comments. You have really made me chuckle, and I have enjoyed having fun with each of you. I have replied to lost of you but if there's anyone I missed please let me know.\n\nI know fun may not be your natural stance, as your inability to laugh at action movies shows, but you have still brightened my evening with your wonderfully literal and serious comments that completely missed the joke. 😂 \n\nI genuinely hope you all have a wonderful Christmas, and that maybe you get a sense of fun from Santa this year. You'll enjoy 2026 a whole lot more if you can laugh. \n\nBless you all, Merry Christmas! 😁 🎄",
        "upvotes": 1686,
        "comments": 210,
        "media": null,
        "permalink": "/r/movies/comments/1psjlu9/why_i_believe_the_receptionist_in_die_hard/"
    },
    {
        "id": "1psugdj",
        "author": "Lianafelice21",
        "title": "What's the most heartbreaking scene you've seen in a movie?",
        "content": "Mine was in the 2007 movie \"I am Legend\" when Will Smith \"Robert Neville\" dog protected him and got beaten by other dogs with a virus. Later on, he killed his dog Sam due to the virus.\n\nThe way he sings and comforted until the end. I really bawled my eyes at that scene. I didn't know that the song \"Three little birds\" would be that sad.",
        "upvotes": 231,
        "comments": 640,
        "media": null,
        "permalink": "/r/movies/comments/1psugdj/whats_the_most_heartbreaking_scene_youve_seen_in/"
    },
    {
        "id": "1psnwnc",
        "author": "Top_Report_4895",
        "title": "If some movies are \"love letters\", which ones are \"diss tracks\"?",
        "content": "A love letter in this case, is a letter expressing love or admiration\n\nMeanwhile, a diss track in this case is a track that verbally attacks someone.\n\nWhat I'm talking is a movie that talking about how awful something is. Pointing out their flaws, insulting and attacking it about the genre.\n\nIf a movie is like \"all of me\" for certain genre, which ones are like \"Not like Us\"?",
        "upvotes": 536,
        "comments": 596,
        "media": null,
        "permalink": "/r/movies/comments/1psnwnc/if_some_movies_are_love_letters_which_ones_are/"
    },
    {
        "id": "1pslil9",
        "author": "Ghost070607",
        "title": "Which director do you feel has the best top 3 movies?",
        "content": "I’ve seen many discussions about \n\ndirectors’ best films and filmographies.  However, I’m curious to know which director you think has the best top three films compared to others.  \n\nOf course, this is all subjective. \n\nSo for example: do you feel Spielberg’s top 3 are superior to Nolan’s top 3?\n\nAre directors with a mixed bag of filmography (Ridley Scott) actually very strong when considering their top 3 best? ",
        "upvotes": 744,
        "comments": 1238,
        "media": null,
        "permalink": "/r/movies/comments/1pslil9/which_director_do_you_feel_has_the_best_top_3/"
    },
    {
        "id": "1pse22u",
        "author": "BunyipPouch",
        "title": "Timothee Chalamet's ‘Marty Supreme’ Scores Best Limited Opening Weekend Of 2025 with $845K in Only 6 Theaters ($146K Per Theater), An All-Time Record for A24 &amp; Best Overall In Almost 10 Years ('La La Land'), Lands 92 Sold Out Screenings",
        "content": "",
        "upvotes": 1636,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dpR_rwA1ZCkfEKcQI1-J3uZ_94YrhMidM31Cj2PLsy8.jpeg?auto=webp&amp;s=b2e6f606beb6798d7460987a5b4d39bd05da5e19"
        },
        "permalink": "/r/movies/comments/1pse22u/timothee_chalamets_marty_supreme_scores_best/"
    },
    {
        "id": "1pt0pqe",
        "author": "browniebiscuitchildr",
        "title": "What’s a song that became completely inseparable to you from a film scene?",
        "content": "For examples, a few feel welded together in pop culture. “Stuck in the Middle With You” instantly drags people into Reservoir Dogs. “Don’t You (Forget About Me)” basically is The Breakfast Club. “My Heart Will Go On” and Titanic are fused at the molecular level. “Where Is My Mind?” can’t escape the last moments of Fight Club.",
        "upvotes": 40,
        "comments": 152,
        "media": null,
        "permalink": "/r/movies/comments/1pt0pqe/whats_a_song_that_became_completely_inseparable/"
    },
    {
        "id": "1pt1xww",
        "author": "EThorns",
        "title": "Films exploring the dark side of motherhood are proving a challenge to awards voters",
        "content": "",
        "upvotes": 37,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0ZeSum0lFnSv4KaesMRtpd39rwDwOfHvI25NPIxee-c.jpeg?auto=webp&amp;s=a0eba8c8107bdd7142a2ef7c4512691bd520ce7c"
        },
        "permalink": "/r/movies/comments/1pt1xww/films_exploring_the_dark_side_of_motherhood_are/"
    },
    {
        "id": "1pstnrc",
        "author": "Hixy",
        "title": "I Just finished Octopus Teacher loved the concept, but the ethics of intervention confused me",
        "content": "I know I’m very late to the party, but I’ve just finished Octopus Teacher. I remember it being a big deal forever ago, and it’s one of those films I’ve been meaning to get to. I really liked the idea of him befriending the octopus and documenting it. Nature films almost always have a hands-off approach, which makes sense when you’re just trying to capture their life. However, seeing an approach focused on interspecies relationships with a wild creature is quite unique. His daily visits, the curiosity, the way he interacted with her over time it felt like a genuine study of the relationship between a human and an octopus. Watching how she responded, how her behavior changed with his presence, all of that was fascinating, and I think framing it as a relationship makes total sense. That’s what the film really captures well, the give and take, the trust, the exploration of interspecies connection, even calling her his teacher.\n\nBut at the same time, I found it really conflicting. Once you’re part of her world, once she’s used to your presence, you’re already influencing her. So when he refuses to intervene against predators, it doesn’t make sense to me. It’s not just philosophy or respect for nature.. it’s ignoring the consequences of your own presence, and I’d argue it’s actually a huge missed opportunity to observe how the relationship changes, if at all, after saving her. From both a human and a scientific perspective, saving her would make sense: it would show how she responds to care, trust, and protection. Not doing it while acting like he admires her comes across as disingenuous, even if she ultimately gets away. It’s an interspecies relationship that’s being studied. A very human response is to protect her… Just do your part and be a human during these interactions. No human would let that happen to their friend. I get non-intervention when it’s the end of her life, like after laying eggs, but the middle sections felt inconsistent, and that’s what kept bothering me. I also understand the approach to never intervene when OBSERVING nature but that’s not what he is doing. ",
        "upvotes": 106,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1pstnrc/i_just_finished_octopus_teacher_loved_the_concept/"
    },
    {
        "id": "1pt4m2x",
        "author": "BunyipPouch",
        "title": "Magnolia Pictures Buys Willem Dafoe and Greta Lee Drama ‘Late Fame’, Planning 2026 Theatrical Release",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_K7EbALg_5q7Y3zVyXc0qcRz9WUsQYTiywvh-cJ-EVo.jpeg?auto=webp&amp;s=322d1dff1c9d173fdb746b52042de9a307b2053c"
        },
        "permalink": "/r/movies/comments/1pt4m2x/magnolia_pictures_buys_willem_dafoe_and_greta_lee/"
    },
    {
        "id": "1psatox",
        "author": "BunyipPouch",
        "title": "'By Design' - Official Trailer - Starring Juliette Lewis - A woman swaps bodies with a chair, and everyone likes her better as a chair.",
        "content": "",
        "upvotes": 1253,
        "comments": 227,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1p-aSHY1r8T0NNt8ByDakhU-87xJKw58RaJ-goys_8c.jpeg?auto=webp&amp;s=503f36ba98d7f914fd05454da7ada71a57e8c256"
        },
        "permalink": "/r/movies/comments/1psatox/by_design_official_trailer_starring_juliette/"
    },
    {
        "id": "1pt3tcv",
        "author": "cronenber9",
        "title": "Inland Empire (2006)",
        "content": "I can't really explain how much I love this movie, there's just something about it. A strange atmosphere and incredible dialogue that draws you in and ties it all together. This movie is 3 hours long and the deleted scenes are another hour and I always watch them both, back to back. I just can't get enough of this.\n\nMy only gripe is that it was shot on digital, because in 2006 digital did not look very nice. Lynch manages to have it look as Lynchian as possible but there's limits. On film, his stuff always looked so much better. But this project couldn't have existed without digital; film is so much more expensive and what he did was basically get a digital camera and just shoot whatever, writing new scripts from day to day, figuring it would all fit together in the end. Digital gave him the freedom of shooting so many hours of this stuff, making it up as he went along, so it's integral to the project.\n\nLynch may not have had everything worked out as he shot the film, but he clearly had a mood, and possibly an overarching structure (I think he might have worked that out after though). This movie always hypnotizes me and I oddly never feel like it's too long or confusing. I love it.\n\nNow as for the key to the story, I don't want to put all of my thoughts here, but I think Deleuze's becoming-animal offers a way in. Thinking ourselves to be totally other allows escape from a certain reified, oedipalized subjectivity. We can trace the different inchoate, situational, and historical subjectivities that exist within the unconscious. Going inward to schizophrenize, to realize the body without organs. To explore the unconscious and all who reside within as partial, larval subjects.\n\nFilm reflects reality, reality reflects film. It's no wonder that an actress can get lost in a character that thousands of women have played throughout their lives, the stories always the same. Trauma as pure affect, a Joycean literature of experience and difference beyond discrete subjects and representation. The spectator experiences the film in the same way the actress does, beyond representation and as affective relation and intensive individuation. A character is created, a larval self, and it exists alongside many other selves. What is that character doing inside the unconscious when we are not inhabiting it with awareness at the moment? Is she scared, running blindly in the darkness? Is the film the fantasy and the character real? Is the viewer part of the film?\n\nHegel, Deleuze, Buddhism. Going inward may allow us to exteriorize, to realize that there is no difference between the self and the other. This is an exploration of a Hegelian \"spirit coming to know itself\", but in a Deleuzian mode of anti-representation. That's why this is Lynch's magnum opus. All of his other films gave us subjects, traditional stories with psychoanalytic symbolism. The story would break down over time, true, but always in service of a symbolic metaphor. Inland Empire is Lynch's first and only film to go beyond this symbolic mode of filmmaking and enter a Deleuzian anti-psychoanalysis, a minoritarian mode of affect without subject. That's why this film is so difficult, yet entrancing.\n\nTracing trauma across bodies, across space and time, through the bodies of women. A geneology of trauma without respect to subjects or traditional story structure. Representational and symbolic interpretations of this film are doomed to fail. I read a complex and well written hermeneutics of the movie, but I don't think it's entirely correct; there's an excess at the seams. There's an element of a girl going through purgatory, yes, reincarnation, murder. It's overdetermined, it's also an exploration of the unconscious with a psychoanalyst. But it's also every woman's story, the shared trauma of womanhood. It traces affect across bodies. There are multiple stories, vague structures that cohere and collapse. It's Deleuzian, Hegelian, Buddhist, psychoanalytic. It's art. Pure art, and at its core it's about giving us feminine trauma and then going through it, killing the negative, and emerging above it. Accepting the unity of difference or negation and purging ourselves of the bad, flying away. It's a beautiful last film.",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1pt3tcv/inland_empire_2006/"
    },
    {
        "id": "1psclz8",
        "author": "DistillCollection",
        "title": "The 2025 “Which movies can I watch with my parents” thread",
        "content": "It’s that time of year again. Time to be with one’s family and catch up on the year in movies. But does it need to be a time to blush one’s way through on-screen steaminess?\n\nHelp me avoid that special brand of mortification that comes from the unexpected, unbridled sexual movie-moment in the presence of one’s parents. Each year, I think I’ll outgrow this. And each year, it’s still there waiting for me like my childhood Christmas stocking. \n\nPlease help. \n\nFor example, I loved Sinners, but I don’t think I could stand to be in my mother’s presence as Hailee Steinfeld says horrible, beautiful things. \n\nWhich movies are safe? Which should be avoided?\n\nI know the real answer is therapy. But I don’t think I can sort that out by Christmas. ",
        "upvotes": 595,
        "comments": 294,
        "media": null,
        "permalink": "/r/movies/comments/1psclz8/the_2025_which_movies_can_i_watch_with_my_parents/"
    },
    {
        "id": "1ps4l9e",
        "author": "RobustPolygon",
        "title": "TENET Blew Me Away.",
        "content": "I finally watched TENET, and I'm blown away how one of my favorite directors could make such a poor film.\n\nWhen TENET first came out, I missed in in theaters, but tried to watch it at home. I lasted maybe 30 minutes, but was so confused and bored, I stopped watching it.\n\nI finally decided to watch it in full, properly, thinking maybe I just wasn't in the right headspace at the time.\n\nAnd for those that might say the film would have been better if it was experienced in IMAX or theatres, I did watch it on a fairly decent setup. 4K Bluray/UB820, LG G5 Oled + Q990D. I fully appreciate the theater experience, but I don't think it would in any way change my feelings.\n\nAnd after 2.5 hours, I think it's the worst film Nolan has ever made, a director who's films I've generally loved.\n\nInterstellar is one of my favorite films of all time, and I've loved his other films like Memento, Dunkirk, Inception, Batman Trilogy, Oppenheimer, etc... Almost without fail, his films have been complex spectacle with fantastic writing and an emotional core that carried the films.\n\nTENET was none of those things, IMO.\n\nTENET is far too complex for it's own good, and even after fully understanding the different flows of time the characters are going through, it's just a bad story. It's complexity for the sake of complexity, without serving the actual story.\n\nThere are precisely 0 characters you care about, there is no emotional core to the film, at all. The final \"idea\" of the film that Neil and the Protag had this great friendship in two different directions was cool, but it was never earned.\n\nI thought John David Washington's performance was pretty awful, he has the charisma of a wet paper bag, and the writing of the film does him no favors. I've liked him in other roles, so I would put more of this on the writing than him to some degree. The writing in general for all the dialog was AWFUL. People talk like CHAT GPT robots, in unnatural ways.\n\nI at least thought the action spectacle would be worth the price of admission, but I thought it was pretty disjointed and unemployable to watch. The fights where people going forward through time were fighting people going backwards just looked disjointed, and unappealing to watch.\n\nSome of the music was kind of cool, but it felt more like soundscapes than a true OST.\n\nOverall, the entire film felt more like an \"idea\" than an actual film, it was insanely disappointing.",
        "upvotes": 1875,
        "comments": 1519,
        "media": null,
        "permalink": "/r/movies/comments/1ps4l9e/tenet_blew_me_away/"
    },
    {
        "id": "1psb96g",
        "author": "DuckLordOfTheSith",
        "title": "What is your favorite example of a character being clever in a movie?",
        "content": "One of the most satisfying feelings for me is when a character - protagonist or otherwise- makes a really clever decision to solve a problem, showing not only intelligence on behalf of the character but also the writers.\n\nI know it’s not very highbrow, but I always come back to Doctor Strange’s “I’ve come to bargain” gambit. Fits with the time motif, shows character growth, and is genuinely just a clever solution.\n\nWhat’s your favorite example?",
        "upvotes": 642,
        "comments": 654,
        "media": null,
        "permalink": "/r/movies/comments/1psb96g/what_is_your_favorite_example_of_a_character/"
    },
    {
        "id": "1psa2uk",
        "author": "No_Poetry_9986",
        "title": "biggest surprise movie of the year and biggest let down?",
        "content": "I was at the cinema yesterday watching Avatar, and I actually really enjoyed it (minus the 3D — that always gives me a headache). It got me thinking, so here’s my yearly post to this community. Also to get some more movie inspiration for the upcoming days.\n\nAs the title says: what movie that came out this year surprised you? Something you expected to be bad or mediocre, but ended up really enjoying.\n\nOn the flip side, what movie disappointed you? One you had high expectations for, but that just couldn’t live up to the hype?",
        "upvotes": 734,
        "comments": 793,
        "media": null,
        "permalink": "/r/movies/comments/1psa2uk/biggest_surprise_movie_of_the_year_and_biggest/"
    },
    {
        "id": "1psu9qq",
        "author": "wouldudoitforme",
        "title": "Must watch “disturbing” movies?",
        "content": "For some reason, I thought I had a full list but nothing comes to mind besides Requiem for a Dream and Eyes Wide Shut (I watched it as a kid!), and maybe.. Mullholand Drive? Actually no nvm, I’ve seen that one twice. \n\nWhat are your guys’ choices? \n\nAnother disturbing one was Human Centipede but I would NOT categorize it as a “must watch”.  \n\n",
        "upvotes": 40,
        "comments": 307,
        "media": null,
        "permalink": "/r/movies/comments/1psu9qq/must_watch_disturbing_movies/"
    },
    {
        "id": "1psz3m0",
        "author": "Amaruq93",
        "title": "Mrs. Munchnik (Madeline Kahn) needs rescuing after she's trapped in the broken down elevator on Christmas Eve - from \"Mixed Nuts\" (1994, directed by Nora Ephron)",
        "content": "",
        "upvotes": 18,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zbw9pdcu7r8g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1psz3m0/mrs_munchnik_madeline_kahn_needs_rescuing_after/"
    },
    {
        "id": "1pslvoe",
        "author": "Amaruq93",
        "title": "Dudley the Angel (Cary Grant) takes Julia (Loretta Young) and Sylvester the cabbie (James Gleason) out for some ice skating - from \"The Bishop's Wife\" (1947, directed by Henry Koster)",
        "content": "",
        "upvotes": 133,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y5nbl3y5jn8g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pslvoe/dudley_the_angel_cary_grant_takes_julia_loretta/"
    },
    {
        "id": "1psocmy",
        "author": "nat2r",
        "title": "What is your all-time favorite movie heist?",
        "content": "There are a ton of amazing movie heists out there. I am curious to hear some community favorites.\n\nPersonally my favorite is the National Treasure heist. It's not particularly lengthy, but the combination of two opposing parties with the fact that it's an actual well known object makes it a thrilling sequence.\n\n",
        "upvotes": 82,
        "comments": 192,
        "media": null,
        "permalink": "/r/movies/comments/1psocmy/what_is_your_alltime_favorite_movie_heist/"
    },
    {
        "id": "1pszae8",
        "author": "ovalteens",
        "title": "Movies that offer hope about aging?",
        "content": "Been dealing with parents’ declining health and feeling particularly old, fearful for the future, and out of step with all of the chaos in the world. What are some movies (for me to watch, not them) that have a bit of optimism or are uplifting when it comes to subject of aging/failing health?\nAs a parent, I recently rewatched The Road and that was a mistake. ",
        "upvotes": 10,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1pszae8/movies_that_offer_hope_about_aging/"
    }
]