[
    {
        "id": "1pmkghu",
        "author": "theywillkillyoumovie",
        "title": "We are Zazie Beetz, Barbara Muschietti &amp; Kirill Sokolov from the new horror film THEY WILL KILL YOU. Ask Us Anything!",
        "content": "https://preview.redd.it/kw4o52oug77g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b11d7a93232e32b23d21045e64cf8a0beb2c538c\n\nHey Reddit, Zazie Beetz, Barbara Muschietti, Andy Muschietti, and Kirill Sokolov here. You might know us from films/series like IT, IT: Welcome to Derry (Muschietti), Joker, Deadpool 2 (Beetz), and Why Don’t You Just Die! (Sokolov) and more. We're here to answer your questions!\n\nOur newest film, **THEY WILL KILL YOU**, is out in theaters March 27, 2026.\n\nWatch the trailer now: [https://youtu.be/AqNFJUihSHg](https://youtu.be/AqNFJUihSHg)",
        "upvotes": 170,
        "comments": 250,
        "media": null,
        "permalink": "/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/"
    },
    {
        "id": "1q51x2u",
        "author": "SanderSo47",
        "title": "January 2-4 Box Office Recap – 'Avatar: Fire and Ash' crosses $1B worldwide; James Cameron becomes first director with four films to reach that milestone. 'Zootopia 2' nears $1.6B worldwide. The series finale of 'Stranger Things' sold $25M-$30M in concession cash to movie theaters.",
        "content": "https://preview.redd.it/9ndiblif7mbg1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=cdac8b4984b3d4d52c969b2622d97647e2f4a804\n\n2026 got to a pretty good start, even though there was a lack of notable newcomers this week. Unsurprisingly, ***Avatar: Fire and Ash*** held the top spot for the third week. In the process, it broke past the $1 billion mark worldwide. And ***Zootopia 2*** had another insane performance overseas, raising the bar for where it will finish.\n\nThe Top 10 earned a combined $124.4 million this weekend. That's up 26% from last year, when ***Mufasa: The Lion King*** reached #1 on its third weekend.\n\nStaying on top for the third weekend, ***Avatar: Fire and Ash*** earned $41.4 million. That represents a light 34% drop. Although ***The Way of Water*** actually increased on its third weekend and it was also much higher ($67 million), given that it only started to benefit from the holidays.\n\n***Fire and Ash*** has amassed $307.6 million to date. Last week, it was $44.1 million behind ***The Way of Water***, and now that has grown to $117.8 million. And it will only continue growing over the next days. It could still hit $500 million domestically, but it's not guaranteed.\n\n***Zootopia 2*** has enjoyed some great legs thanks to the holidays. It eased just 2%, for a great $19.3 million weekend. With $364 million domestically, it has officially passed the original's gross ($341.2 million). Given the lack of competition on January, it should definitely reach $400 million domestically.\n\nIn third place, Lionsgate's ***The Housemaid*** is breaking past any expectations. It dipped a very slight 1%, earning $15.1 million this weekend. The film has amassed $75.9 million domestically, and it should finish its run with over $120 million domestically. The biggest Lionsgate title since ***The Hunger Games: The Ballad of Songbirds &amp; Snakes***.\n\nIn fourth place, A24's ***Marty Supreme*** is showing word of mouth is on its favor. The film dipped just 29%, earning $12.5 million this weekend. Through 11 days in wide release, the film has earned a fantastic $56 million. It's already A24's third biggest ever film, and it will pass ***Civil War*** ($68 million) by next week. Given its great word of mouth and heavy Oscar buzz, ***Marty Supreme*** could get as high as $90 million domestically.\n\nSony's ***Anaconda*** eased just 31%, adding $10 million. After 11 days, the film has earned $45.8 million, and should make its way to almost $80 million by the end of its run.\n\n***The SpongeBob Movie: Search for SquarePants*** eased 25%, for a $8.3 million. The film's domestic total stands at $57.7 million, and it should continue holding well thanks to no animated competition in January.\n\nAngel Studios' ***David*** eased 39%, earning $7.6 million this weekend. That takes its domestic total to $69.7 million, although perhaps it seems $100 million will be a bit of a challenge.\n\n***Song Sung Blue*** eased just 17% on its second weekend, earning $5.8 million. The film's 11-day total stands at $25 million, and it could still reach $40 million if it keeps holding well.\n\n***Wicked: For Good*** dipped 39%, for a $3.2 million weekend. The film has amassed $339.8 million so far.\n\nRounding out the Top 10 was ***Five Nights at Freddy's 2*** with $2.6 million, just a 39% drop. The film has earned $125.2 million, and it looks like it will fall off now that holidays are over.\n\nThere was one single wide release this week, Vertical's ***We Bury the Dead***. But it finished outside the Top 10, earning $2.5 million in 1,172 theaters. That's Vertical's best ever debut, although it just speaks volumes on how low they are as a distributor.\n\nIt seems like Park Chan-wook's ***No Other Choice*** is picking up some steam. Even though it's playing in just 45 theaters, the film hit the 12th spot with $1 million this weekend. That's a dazzling $22,247 per-theater average, signaling great word of mouth. It will continue expanding, and could possibly hit the Top 10 next week.\n\nOn December 31st through January 1, 620 theaters screened the series finale of ***Stranger Things***. There are no official figures, although the trades report that it sold an estimated $25 million-$30 million in consessions. As Netflix does not report figures, this was all reported as concession vouchers. They allowed theaters to keep 95% of the sales, a fantastic figure.\n\n#**OVERSEAS**\n\nJames Cameron did it again.\n\n***Avatar: Fire and Ash*** has crossed the $1 billion milestone, thanks to a $169.6 million overseas haul this week. With this, he has become the first director to have four titles reach $1 billion worldwide, after ***Titanic*** and the prior ***Avatar*** films. There's not a market breakdown for now, but its biggest market has been China with $138 million. Given the empty January, it should continue legging out just fine.\n\nBut even with ***Avatar*** taking the spotlight, ***Zootopia 2*** continues destroying records. This weekend was actually better than last week, as it added $81.7 million overseas. That takes its worldwide gross to an insane $1.590 billion. It already passed ***Frozen II*** ($1.453 billion) to become Walt Disney Animation Studios' biggest ever film. \n\nIn China, ***Zootopia 2*** actually increased to $38 million over a five-day holiday. It already surpassed ***Avengers: Endgame*** in ticket sales, but this weekend, it eclipsed that film's ¥$4.249 billion total to become the biggest ever Hollywood title in the market. That's roughly ¥4.250 billion ($604.1 million), which means it has both the adjusted and unadjusted record.\n\nNot content with taking down ***Frozen II***, ***Zootopia 2*** is now aiming for another record: the biggest ever Hollywood animated film, ***Inside Out 2*** ($1.698 billion). It's just $108 million away, which means it could get there as early as next week. After that, ***Zootopia 2*** will try to reach $1.8 billion, and could get as high as $1.9 billion. Which means that there's a possibility that it outgrosses ***Avatar: Fire and Ash*** to become the biggest Hollywood title of 2025.\n\n***Anaconda*** added $13.4 million overseas, taking its worldwide total to $88.3 million. The best markets are Australia ($5.8M), the UK ($5.3), and Mexico ($4M). In the next few days, it will cross the $100 million mark.\n\nWhile there's no complete overseas breakdown, ***The Housemaid*** is proving to be a success outside America. It has crossed $130 million worldwide, and with the legs it's showing, it should easily get to $200 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Now You See Me: Now You Don't* | Nov/14 | Lionsgate | $21,013,793 | $61,882,396 | $211,216,528 | $90M\n\n- A vanishing act. Lionsgate's ***Now You See Me: Now You Don't*** has closed with $211 million worldwide. It clearly shows there's still interest in the franchise, although it also shows it already hit a ceiling. It didn't quite change the fact that it's the lowest grossing film in the franchise, as this is a 37% drop from the second film. Lionsgate is clearly confident in this franchise, and they already have a fourth film in development. But given how the film performed, it's likely that it will continue the franchise's decline at the box office.\n\n#**THIS WEEKEND**\n\nAlright, we finally getting some notable wide releases.\n\nAs it's now a tradition, Gerard Butler has another January film. That's ***Greenland 2: Migration***, sequel to the 2020 film. Even though it only made $52 million worldwide (pandemic you know?), the film was a huge success in PVOD, which is what motivated Lionsgate to pick up the rights to the sequel. Although the film's $90 million budget is a huge concern.\n\nParamount is also releasing ***Primate***, the first major horror title of the year, following a family's chimpanzee who goes bananas and starts killing people. The film has premiered at Fantastic Fest and earned some great reviews so far (92% on RT). Will this surprise?\n\nIn limited release, Row K Entertainment will start its run as distributor with Gus Van Sant's ***Dead Man's Wire***. It stars Bill Skarsgård as Tony Kiritsis, who was involved in the 1977 Indianapolis hostage standoff. The film debuted in Venice with a fantastic response (98% on RT), although usually a film of this caliber is released in fall to contend for fall season. Nevertheless, it should score a great per-theater average ahead of its wide expansion next week.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 94,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7miOtUcuUFl1f_hU_FloNS5cZSBOKksN7Z6z2VGd8O4.png?auto=webp&amp;s=19d127a43131a39f2642e087480c1810cc561f30"
        },
        "permalink": "/r/movies/comments/1q51x2u/january_24_box_office_recap_avatar_fire_and_ash/"
    },
    {
        "id": "1q4z0q3",
        "author": "MarvelsGrantMan136",
        "title": "Jack Black Regrets Turning Down ‘The Incredibles’; Rejected Offer to Voice Syndrome After Asking the Director for Rewrites",
        "content": "",
        "upvotes": 17783,
        "comments": 1195,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/80iQtMb_t68qJM13t9DFHeZd0HV1ZN-MqBGkbZgtFow.png?auto=webp&amp;s=b0d2ae9e557a6e78f48e09d18c8c8c7d8b674892"
        },
        "permalink": "/r/movies/comments/1q4z0q3/jack_black_regrets_turning_down_the_incredibles/"
    },
    {
        "id": "1q55nwv",
        "author": "MarvelsGrantMan136",
        "title": "Bodybuilder Jayne Trcka, Who Played Miss Mann in 'Scary Movie', Dies at 62",
        "content": "",
        "upvotes": 1231,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zM2VH3l-yp5knoEDxUVhjlh92dGqBxWzHN68zgDYPPE.jpeg?auto=webp&amp;s=10614cd5cb29963130e50d933ff00369865ada00"
        },
        "permalink": "/r/movies/comments/1q55nwv/bodybuilder_jayne_trcka_who_played_miss_mann_in/"
    },
    {
        "id": "1q51s6z",
        "author": "cmaia1503",
        "title": "John Mayer And McG Finalize Purchase Of Jim Henson Lot &amp; Chaplin Studios",
        "content": "",
        "upvotes": 1867,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2GSbNfZRiVGpxDJpAmwemEFq-wdGRrJVeM9h3BTao7c.png?auto=webp&amp;s=0558f3bfa067e4c9fd22e9dbfc3528c0d184177a"
        },
        "permalink": "/r/movies/comments/1q51s6z/john_mayer_and_mcg_finalize_purchase_of_jim/"
    },
    {
        "id": "1q4mffo",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Death of Robin Hood' Starring Hugh Jackman",
        "content": "",
        "upvotes": 9250,
        "comments": 1428,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4vxg7qmqejbg1.jpeg?auto=webp&amp;s=d1a9f87b60011f088387a5d303cd03d014d48643"
        },
        "permalink": "/r/movies/comments/1q4mffo/official_poster_for_the_death_of_robin_hood/"
    },
    {
        "id": "1q4ozxt",
        "author": "browniebiscuitchildr",
        "title": "What’s a movie that went from beloved to hated over time (and for good reason)?",
        "content": "Ya’ll know I’m gonna start this with *The Blind Side.* I *love* seeing this movie rightfully get dragged through the mud for the same shit I was calling out *years* ago while I was still in college, being dismissed as a hater of this “heartwarming” film. The white saviorism, the portrayal of young black man as an absolute Neanderthal with only his immense strength to fall back on, etc. Hearing Primm Hood Cinema call it “12 Years a Football” had me *crying* laughing 🤣. And of course the real story exposes even more about how Michael was done dirty by everyone, including his so-called loving ‘family’.",
        "upvotes": 4575,
        "comments": 2809,
        "media": null,
        "permalink": "/r/movies/comments/1q4ozxt/whats_a_movie_that_went_from_beloved_to_hated/"
    },
    {
        "id": "1q54nsb",
        "author": "BunyipPouch",
        "title": "Con Pederson, Oscar-Winning ‘2001: A Space Odyssey’ Special Effects Supervisor, Dies at 91",
        "content": "",
        "upvotes": 717,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G6WwrxAUkwXiLbUSX659j5wvhXcCFkG0PrAtP1ZhyJs.jpeg?auto=webp&amp;s=9935eef96ee1c9a423427399f09b7fc93167faf0"
        },
        "permalink": "/r/movies/comments/1q54nsb/con_pederson_oscarwinning_2001_a_space_odyssey/"
    },
    {
        "id": "1q57yeh",
        "author": "bobbdac7894",
        "title": "Why does Troy 2004 get such a bad reputation?",
        "content": "I know it’s not faithful to the source material. But it’s epic, the choreography is amazing, Brad Pitt is perfect as Achilles imo, all the other actors/characters are great. Is it faithful? No. Is it corny at part? Yes. But I honestly think it’s a really fun, entertaining movie with some really good performances, great action, music is underrated too.",
        "upvotes": 370,
        "comments": 305,
        "media": null,
        "permalink": "/r/movies/comments/1q57yeh/why_does_troy_2004_get_such_a_bad_reputation/"
    },
    {
        "id": "1q56f1q",
        "author": "joesen_one",
        "title": "‘KPop Demon Hunters’ and ‘Elio’ Lead 2026 Annie Awards Nominations With 10 Nods Each",
        "content": "",
        "upvotes": 266,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Vul2t-qe_mq386rJVtzefzhiNJzQBind7UQIS9R_xDg.jpeg?auto=webp&amp;s=d8705a082eddbc869506e3c9f1f71ac83c2a7b7e"
        },
        "permalink": "/r/movies/comments/1q56f1q/kpop_demon_hunters_and_elio_lead_2026_annie/"
    },
    {
        "id": "1q4r4vl",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'They Will Kill You' - A woman (Zazie Beetz) answers a help-wanted ad to be a housekeeper in a mysterious New York City high-rise, not realizing she is entering a community that has seen a number of disappearances over the years.",
        "content": "",
        "upvotes": 1340,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vryt9bt1akbg1.jpeg?auto=webp&amp;s=5acc1fef386b4b15ecd6ae06df97bc35b548c7d9"
        },
        "permalink": "/r/movies/comments/1q4r4vl/official_poster_for_they_will_kill_you_a_woman/"
    },
    {
        "id": "1q5cta1",
        "author": "AfricanMan_Row905",
        "title": "Ed Harris and Amy Madigan refusing to clap when Elia Kazan received an honorary Oscar in 1999.",
        "content": "Ed Harris and Amy Madigan refusing to clap when Elia Kazan received an honorary Oscar in 1999. Kazan who was briefly member of the Communist party in the 30s, was subpoenad in 1952 by the HUAC where he named former colleagues as communist, leading to them being blacklisted.\n\nKazan stopped considering himself a communist before the HUAC started their investigation and is quoted as saying “What the hell am I giving all this up for? To defend a secrecy I didn’t think right and to defend people who’d already been named or soon would be by someone else? I said I’d hated the Communists for many years and didn’t feel right about giving up my career to defend them.”",
        "upvotes": 101,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tary6a5ssobg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q5cta1/ed_harris_and_amy_madigan_refusing_to_clap_when/"
    },
    {
        "id": "1q4l8ez",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Rip' Starring Ben Affleck and Matt Damon - A group of Miami cops discovers a stash of millions in cash, leading to distrust as outsiders learn about the huge seizure, making them question who to rely on.",
        "content": "",
        "upvotes": 1950,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ifsjbsh55jbg1.jpeg?auto=webp&amp;s=978c50333b0683a79b222b3f30e65fed4756202e"
        },
        "permalink": "/r/movies/comments/1q4l8ez/new_poster_for_the_rip_starring_ben_affleck_and/"
    },
    {
        "id": "1q4x749",
        "author": "Desafinado777",
        "title": "Epic 3+ hour movies.",
        "content": "Hey!\n\nRecently I've watched The Godfather I + II, Apocalypse Now redux, The brutalist, Lawrence of Arabia, but I'm still thirsty for more Epic movies. \n\nCould I get some recommendations, please?\n\nHopefully, a drama or thriller with a cast full of great character actors, and an average age that isn't 20.\n\nNo marvel or comic book movies. \n\nCheers!\n\nEdit * doesn't have to be exactly 3 plus hours - It can be a little less, I just mean a big movie with beautiful shots and a great story. \n\nThanks for the response! Some suggestions seem really interesting.\n\nI've seen all three lord of the rings. ",
        "upvotes": 476,
        "comments": 1008,
        "media": null,
        "permalink": "/r/movies/comments/1q4x749/epic_3_hour_movies/"
    },
    {
        "id": "1q51u2j",
        "author": "BunyipPouch",
        "title": "Ahn Sung-ki, one of South Korean cinema’s most enduring and respected screen actors, whose six-decade career spanned more than 130 films and included landmark hits such as “Silmido” and “Radio Star,” has died at 74 from blood cancer.",
        "content": "",
        "upvotes": 203,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ozYNBr-7iwwU9hNOhyft3NQsMq68UxvyRybllWjwBk0.jpeg?auto=webp&amp;s=3ff1b958c986a9be7501c2c92de174a0931be281"
        },
        "permalink": "/r/movies/comments/1q51u2j/ahn_sungki_one_of_south_korean_cinemas_most/"
    },
    {
        "id": "1q5a113",
        "author": "lomubz",
        "title": "I grew up mostly watching rom-coms, comedies, and family movies. I just discovered “Snatch” and realized I missed out on so many films. Please suggest other movies I should check out.",
        "content": "Because of my limited exposure, I just assumed I wouldn’t like “boy movies.” I felt tired of watching the same stuff, then I saw a clip of Brad Pitt’s accent in Snatch and thought I’d try something different. I really enjoyed the movie! Now I know I have lots of catching up to do. Any suggestions on what I else I should watch? (I’m not a horror fan, but other genres I’m open to).\n\nI have seen “Blow,” “Memento,” and “Rescue Dawn.” \n\nReally appreciate the suggestions. ",
        "upvotes": 62,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1q5a113/i_grew_up_mostly_watching_romcoms_comedies_and/"
    },
    {
        "id": "1q5907l",
        "author": "BJntheRV",
        "title": "What's the worst movie to have a really amazing soundtrack?",
        "content": "Just the title. I love soundtracks and as I was going through my collection I saw the soundtrack for The Guru. I really don't remember if the soundtrack was good, but I'm guessing I enjoyed it since I bought it, but Idr that it was a pretty unanimous feeling among my whole friend group that the movie sucked. I remember one friend walked out and waited for us rather than sitting through it. Part of me wants to watch it again just to see if I still think it's bad. ",
        "upvotes": 59,
        "comments": 221,
        "media": null,
        "permalink": "/r/movies/comments/1q5907l/whats_the_worst_movie_to_have_a_really_amazing/"
    },
    {
        "id": "1q50ilt",
        "author": "Mattone_Martello",
        "title": "What do you think about \"Stop Making Sense\" (1984)?",
        "content": "I just finished watching this masterpiece. Let's start by saying that I'm a Talking Heads fan, so I knew many of the songs and even something about their stage mannerisms. And yet, it left me speechless.\n\nI don't think I've ever had so much fun and felt so involved watching a film. Byrne and the rest of the band not only manage to bring all their songs to life perfectly, but they do something even more difficult: they make them believable. The cinematography is simple, precise, and tries to make room for all the characters, while the audience is revealed only in the final moments. The set design changes as the songs progress, and the frontman's movements reflect the mood of the song. The song list is also wonderful, each one better than the last.\n\nSo, what do you think of Stop Making Sense?",
        "upvotes": 130,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1q50ilt/what_do_you_think_about_stop_making_sense_1984/"
    },
    {
        "id": "1q4r6zg",
        "author": "theywillkillyoumovie",
        "title": "They Will Kill You - Watch the Official Trailer Now",
        "content": "Cult Curious? They Will Kill You - only in theaters March 27.\n\nJoin Zazie Beetz, Barbara Muschietti, Andy Muschietti, and Kirill Sokolov for the official Reddit AMA this Friday at 12pm PT: [https://www.reddit.com/r/movies/comments/1pmkghu/we\\_are\\_zazie\\_beetz\\_barbara\\_muschietti\\_kirill/?sort=new](https://www.reddit.com/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/?sort=new)",
        "upvotes": 347,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cn1EAO9pQkuonqw9c52M_VP9uYQHPfkcvQmuesHlvg0.jpeg?auto=webp&amp;s=df6c39beec1548e2d0f59436cdde32d11ea3c1bf"
        },
        "permalink": "/r/movies/comments/1q4r6zg/they_will_kill_you_watch_the_official_trailer_now/"
    },
    {
        "id": "1q4xkoc",
        "author": "Colinthecat59",
        "title": "What’s a scene from a movie which traumatised you as a child?",
        "content": "For me it was the leech scene in Stand By Me, I remember having no idea what leeches were and when I saw them I was absolutely terrified. I didn’t watch the movie in theatres, I watched it with my parents years after it came out, and after rewatching it the memory came back to me. When Gordie pulled the leech out of his pant, I recall being so scared I covered my eyes 😭 \nWhat’s a scene any of you guys got traumatised by?",
        "upvotes": 138,
        "comments": 577,
        "media": null,
        "permalink": "/r/movies/comments/1q4xkoc/whats_a_scene_from_a_movie_which_traumatised_you/"
    },
    {
        "id": "1q58161",
        "author": "doc_zoid_md",
        "title": "There is LOTR score prototype in Dogma",
        "content": "Around 2:10 in the clip is when I noticed it. Was watching and near the end of the movie I was like “Man, that sounds like the LOTR score” then credits roll and I see Howard Shore was the composer. Absolutely some prototype score for LOTR. Would have been just a few years earlier. Anyone know of other notable examples like this?",
        "upvotes": 29,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pWNQhrWnTpOMZ2l-Sldqma7hwn-iqy_IpN6JJlftNjQ.jpeg?auto=webp&amp;s=52e5d23d0a9b159e60a9a3645cdb707a3be6a56a"
        },
        "permalink": "/r/movies/comments/1q58161/there_is_lotr_score_prototype_in_dogma/"
    },
    {
        "id": "1q4xloe",
        "author": "BunyipPouch",
        "title": "'Black Phone 2' Sets January 16 Streaming Premiere Date on Peacock",
        "content": "",
        "upvotes": 88,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fbleuPbwIeb7DMEu3do2-x-QbEQe7aQfbhuBj3_xqvs.jpeg?auto=webp&amp;s=7b211842883dd60dd0fbe6b86f252fb3749fd715"
        },
        "permalink": "/r/movies/comments/1q4xloe/black_phone_2_sets_january_16_streaming_premiere/"
    },
    {
        "id": "1q59bki",
        "author": "DanGleenutz",
        "title": "Been on a Korean Neo-Noir Binge",
        "content": "I saw *Oldboy* back when I was a teenager and remember being like \"Well, that was dope, but probably not gonna do it again.\"\n\nSaw *Parasite* not long after it came out and then recently *Memories of Murder* and that's sort of kicked off a total binge on Korean movies — *The Host,* *No Other Choice, Yellow Sea,* and most recently *The Chaser.*\n\nI'm absolutely exhausted, but at the same time, I can't help but wonder what else is out there. I'm familiar with a few other more popular ones, like *Sympathy for Mr. Vengeance* and *I Saw the Devil*, but I might need a few days and a bottle of whiskey to recover from *The Chaser* before watching either of those.\n\nYou know that scene in *Sinister* when Ethan Hawk is drinking whiskey and watching the murder tapes? That's basically how I feel binge watching Korean neo-noir. Absolutely ruthless films and unlike in recent Western movies where you expect the movie to end on a happy note, you really have no idea what you're going to get with these. They don't even care to give you closure half the time. And you know what? I dig it. I do.\n\nWould love some suggestions in the meantime.",
        "upvotes": 19,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1q59bki/been_on_a_korean_neonoir_binge/"
    },
    {
        "id": "1q4alvi",
        "author": "G_Marius_the_jabroni",
        "title": "Maximus Decimus Meridius (Russell Crowe) absolutely dismantling those 6 dudes in that random colosseum on the outskirts of the Empire in \"Gladiator\" (2000) was such hard-core scene when it first came out.",
        "content": "I think I saw \"Gladiator\" in the theater 3 or 4 times, and [this scene](https://youtu.be/BPNOdkLcL_g) blew me away every single time I saw it. The first time, I vividly remember the whole theater gasping as he  straight up dismantled each of those gladiators one at a time with such ease that it looked like he was hardly even trying. The whole movie was just unlike anything that had ever come out before. It has a few small editing issues, but damn man, it is just one of those movies that had to be seen in the theater to fully appreciate how good it was. That was peak Russell Crowe and peak Ridley Scott.",
        "upvotes": 1850,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ixUnRZ1WPP4L0ji60HTyqbqgRMtFB5_TAdxeKRZdrmE.jpeg?auto=webp&amp;s=8d61cbdb2d956729204cab3b6b95ace3023c92c5"
        },
        "permalink": "/r/movies/comments/1q4alvi/maximus_decimus_meridius_russell_crowe_absolutely/"
    },
    {
        "id": "1q4l29g",
        "author": "MarvelsGrantMan136",
        "title": "The Rip | Official Trailer | Netflix",
        "content": "",
        "upvotes": 296,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Q0vH3xj3tDtlo0GnUswYP4F5_kRyGKcUhAXNfz0Rq_4.jpeg?auto=webp&amp;s=32422d68630b56376c0e6fcf0fb19a476b0f7e58"
        },
        "permalink": "/r/movies/comments/1q4l29g/the_rip_official_trailer_netflix/"
    },
    {
        "id": "1q5cbwi",
        "author": "Plaztec1037",
        "title": "Which CRIME/THRILLER movie has stuck with you for years, and why?",
        "content": "Just looking for extremely good movies to watch. I really like movies that stay extremely interesting, having huge cliff hangers and overall something that keeps you engaged. \n\nGone girl was really unique extremely, no country for old men was great, goodfellas obviously. \n\nWhat are some 10/10s you’ve seen? Not just action cool visual looking but extremely realistic and something just great. ",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1q5cbwi/which_crimethriller_movie_has_stuck_with_you_for/"
    },
    {
        "id": "1q4a103",
        "author": "MarvelsGrantMan136",
        "title": "Critics Choice Awards Winners: ‘One Battle After Another’ Wins Best Picture and Director; Timothée Chalamet, Jessie Buckley, Jacob Elordi &amp; Amy Madigan Win Acting Awards",
        "content": "",
        "upvotes": 1533,
        "comments": 194,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Pjbh1v_0w8Yz4t-YZfNe3PI4yFzJUlh6YffhZctRHs.jpeg?auto=webp&amp;s=01e5c944b6b93abdf9386342132449de0d9d311a"
        },
        "permalink": "/r/movies/comments/1q4a103/critics_choice_awards_winners_one_battle_after/"
    },
    {
        "id": "1q4sx47",
        "author": "emotibear",
        "title": "Movies better off with ambiguous endings",
        "content": "I recently rewatched First Blood, and while I genuinely enjoy all the sequels, I usually recommend the first film as a standalone tragic character study. In my head, the rest of the franchise exists in a “what if” universe and can live there just fine.\n\nThe original ending’s ambiguity feels essential to the character’s arc. Once later films provide clearer resolutions, more backstory and direction, the emotional weight of that first story shifts in a way that makes it feel less complete on its own.\n\nAre there other films you feel were better served by ambiguity rather than explanation or continuation? And I’m not anti-sequel...another example for me is Stranger Than Fiction. Had that ending remained more open (and maybe tragic) I think we’d still be debating it as something truly special.",
        "upvotes": 87,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1q4sx47/movies_better_off_with_ambiguous_endings/"
    },
    {
        "id": "1q420wn",
        "author": "Kristofferabild",
        "title": "Does Steven Spielberg never get angry on set?",
        "content": "Watching the great documentary on the The West Side Story , I realised something. I have never seen footage of Steven Spielberg being angry, annoyed or yelling at someone on set. I seem to remember, I have seen David Lynch , Janes Cameron , Stanley Kubrick and David Fincher being angry and annoyed on set. \nSo is all footage of Spielberg on set heavily edited, or is that just not the kind of director he is? \nI know he used to be harder on sets, and especially on E.T. he changed his approach. ",
        "upvotes": 3565,
        "comments": 796,
        "media": null,
        "permalink": "/r/movies/comments/1q420wn/does_steven_spielberg_never_get_angry_on_set/"
    },
    {
        "id": "1q58w9r",
        "author": "Quiet_Kaleidoscope3",
        "title": "Frailty interpretations",
        "content": "Just rewatched Frailty, and what I’ve always loved about this film is that they leave enough ambiguity to have several valid competing interpretations. \n\nI found one review that I think sums this and its relation to Adam as an unreliable narrator pretty well: https://manorvellum.medium.com/truth-defies-reason-perception-reality-and-frailty-dca03c20d04a. \n\n“At the title credit in the writer commentary, Brent Hanley says \"Frailty to me was always about the frailty of perception, the frailty of morality, the frailty of right and wrong.\" At around 2 mins he adds, \"I liked the idea of an abstract title.\"” (IMDb trivia)\n\nIt seems most people completely buy into everything Adam tells them and accept that Fenton was a demon and the “God’s hand killer,” that he kept his victims in his basement, and that all of Adam and dad’s visions were legit, all the victims were indeed demons. While I think this is a valid read, it surprises me a little that it seems to be so universally accepted. \n\nI think the film actually presents three equally valid interpretations that compete with each other, and that’s what makes it so fun and effective. The film is a bit of a litmus test that lends itself to varied interpretations based on viewers’ own world views and biases. I think this is the brilliance of the film. Here are the 3 possible realities, as I see it:\n\n1. Adam and his dad are legit demon hunters; Fenton is a demon and serial killer. I think this is both the least scary and actually least probable take. I’ll explain why further down. \n\n2. Fenton is not a demon, and Adam and dad are crazy. No one is a demon, but both Adam and Fenton were so warped from the immense abuse and trauma of their childhood that they both become serial killers. Adam kills people he thinks are demons, and Fenton becomes “God’s hand killer,” and keeps bodies in his basement. \n\n3. Fenton is neither a demon nor a serial killer. He never killed and kept corpses in his basement. That’s all just part of Adam’s delusion, and Adam has killed those people and framed Fenton because Adam is suffering such severe delusion that Fenton is a demon that Adam must make it real and commits all of the crimes but convinces himself Fenton killed the ones Adam framed Fenton for as well as all the ones he takes credit for as “destroying demons.”  -To me, this is the scariest and most compelling take. \n\nIt’s important to remember that Adam is established as an \\*unreliable narrator\\*, and we cannot take anything we see through his eyes as factual. We only see the “demons” sins \\*through Adam’s eyes\\* in \\*his visions\\*, which are at least as likely to be delusions as they are to be real. We know that Adam frames Fenton for Agent Doyle’s murder by placing the list with his name crossed off at the scene so everyone will think Doyle is “Fenton’s last victim.” We have no real legitimate reason to think Adam could not also have framed Fenton for the rest of the murders in the basement as well. It’s plausible he may have no conscious memory of committing those crimes because his fractured psyche needs to believe his dad was a good man under God’s guidance and must believe Fenton is a demon to protect his delusions. His delusions are so strong, he creates the crimes he needs to believe Fenton guilty of and the evidence for them so he can have peace in believing he “destroyed the demon” Fenton rather than murdered his brother who was the only person trying to protect him from their abuse. It’s not that Fenton is guilty or a demon: that’s all part of Adam’s delusions. When we see Fenton ask to be buried in the rose garden, we are seeing it \\*through Adam’s eyes\\*, and like everything else Adam tells us, we can’t trust it because he is an unreliable narrator suffering from violent psychotic delusions. He believes everything he says, but we should not. \n\nIn this version of reality, the tired rookie agent just wasn’t paying that much attention to the features of a potential witness he spoke to briefly; Adam was wearing a baseball hat, and the agent just didn’t get a good look. The tapes glitched because tapes glitch sometimes. Fenton was simply a poor tortured soul traumatized by his experiences as a child and then murdered by the brother he tried so hard to save. Adam is suffering murderous delusions and will go on killing innocent people with impunity and likely raise his unborn child to believe it all and carry on his work. This is the scariest and most heartbreaking interpretation, and for that reason is my favorite. I do feel it’s very intentional that we get all three possible realities and support for each of them. There is an inherent “frailty of perception” not just of the characters and their viewpoints but in our own perceptions, and this is reinforced by the beautiful use of Adam’s unreliable narration as our main view. \n\nWhat’s really interesting in terms of trivia for the film is that it’s loosely based on a serial killer who claimed god gave him visions (per IMDB trivia tidbits). “Loosely based on the case of American serial killer Joseph Kallinger who murdered three people and tortured four families. He committed these crimes with his 13-year-old son Michael between 1974-1975 in New Jersey. Kallinger pleaded insanity, claiming God had told him to kill.” I think knowing this connection further supports the idea all the supernatural parts are all fruit of Dad and Adam’s delusion tree. \n\nI enjoy this film as much today as when it came out. It really holds up and is so layered and such a great use of unreliable narrator. It’s so intriguing to me that most people seem willing to buy into everything our unreliable narrator says even though he is very clearly revealed to be unreliable. Why is everyone so ready to accept Adam’s perspective as fact when all the evidence to the opposite is equally there? I think that’s what makes it fun. ",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1q58w9r/frailty_interpretations/"
    }
]