[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hsuod8",
        "author": "Background_Silver702",
        "title": "Best show I’ve seen in a while: Man on the Inside",
        "content": "The title says it all. But this was such a heart-warming show. One of the best shows I’ve seen on Netflix in a while. \nGreat acting, laugh out loud moments, poignant, good storytelling and great cinematography. \nI am so enthused that there’s going to be a second season. \n10/10 for me. ",
        "upvotes": 131,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1hsuod8/best_show_ive_seen_in_a_while_man_on_the_inside/"
    },
    {
        "id": "1hstkcy",
        "author": "VeracitiSiempre",
        "title": "Cunk on Life now airing",
        "content": "I watched it, and it was outstanding, as usual. If you’re a fan of the  Philomena, you’re in for a treat!\n\nDeadline link because I felt like I was supposed to add *something\n",
        "upvotes": 49,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hstkcy/cunk_on_life_now_airing/"
    },
    {
        "id": "1ht1ei1",
        "author": "Ready-Flamingo6494",
        "title": "Horizon An American Saga, how have I not heard of this before until Netflix just released chapter 1?",
        "content": "I will admit, I'm not one that pays close attention to new releases on Netflix or mainstream media releases. But holy #$@&amp; hell. This came out of nowhere for me.\n\nI do not think I've been more emotionally distraught, angry, hopeless - utterly overwhelmed with grief - all of it at once from a movie in a long time, if ever. \n\nSPOILER\n\nThe scene where the raiding Apache open up the tent as the family prays. I...I just can't... I can't get my head around it. Wow just wow. \n\n",
        "upvotes": 12,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ht1ei1/horizon_an_american_saga_how_have_i_not_heard_of/"
    },
    {
        "id": "1hstsvv",
        "author": "Lars_Olav",
        "title": "Are reviews of non-English shows poorer when the reviewer isn't used to subtitles?",
        "content": "I’ve been noticing something lately, and I’m curious if anyone else feels the same way. It seems like reviews of non-English shows often get lower ratings or feel less in-depth compared to English-language ones. I wonder if it has to do with the fact that many reviewers aren't used to reading subtitles? It feels like there's a certain disconnect when people aren't accustomed to watching things with subtitles, and it shows in their reviews.\n\nIt seems to me that reviewers who are more familiar with non-English media are able to offer more thoughtful critiques, but those who are less used to subtitles sometimes struggle to engage with the show properly. Does anyone else notice this trend?\nI often see this in Europan non English shows ",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hstsvv/are_reviews_of_nonenglish_shows_poorer_when_the/"
    },
    {
        "id": "1ht57pe",
        "author": "Only-Ordinary1146",
        "title": "Fire tablet not opening my profile, only open kids profile ",
        "content": "So started today my Netflix app on my fire tablet only open the kids profile, when I try to open my profile it crashes. I use it while on the treadmill 😭😭😭 I tried uninstalling the app etc etc etc nothing helps. It started out of nowhere today. What’s going on? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ht57pe/fire_tablet_not_opening_my_profile_only_open_kids/"
    },
    {
        "id": "1hta7wf",
        "author": "S4v1r1enCh0r4k",
        "title": " R.L. Stine confirms the writers are currently working on three more Fear Street movies ",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hta7wf/rl_stine_confirms_the_writers_are_currently/"
    },
    {
        "id": "1ht0ov8",
        "author": "Lars_Olav",
        "title": "Why do Harlan Coben's stories grip us with suspense and twists, but we forget them quickly after finishing?\"",
        "content": "Harlan Coben is a master at creating stories packed with suspense, unexpected twists, and turns that make his books and Netflix series almost impossible to put down. The tension, the mysteries, and the twists keep us hooked until the very end. But here's the interesting thing—once we finish a story, it often seems to fade from our memory quickly. Why is that?\n\nIt can't be as simple as just following a formula—because if it were, many writers would be able to do it. What makes Coben's stories so compelling in the moment but forgettable after? Is it the pacing, the focus on plot over deep characters, or something else? ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ht0ov8/why_do_harlan_cobens_stories_grip_us_with/"
    },
    {
        "id": "1hshzrx",
        "author": "gorram1mhumped",
        "title": "Do people talk about Glow? I'm kinda shocked how good it is, but nobody every pushed it. If you haven't seen it, for whatever reason, consider this a push.",
        "content": "The show takes its time, don't expect to get hooked right away. But i think they nailed the tempo. Very fun, silly, touching, and cool. Really unique viewing experience, and everyone is acting their asses off, often with just a few lines an episode.",
        "upvotes": 77,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hshzrx/do_people_talk_about_glow_im_kinda_shocked_how/"
    },
    {
        "id": "1ht81ke",
        "author": "Fluffyfrogfred",
        "title": "Black dove, no good deed or Missing you?",
        "content": "Alright. I’m wanting to binge a show and don’t know which one of the three I should start with and complete. I have probably watched one episode of black dove and no good deed, however I don’t retain anything unless I watch it a few times so basically  it’s like I’m starting over again. Pls tell me which one you enjoyed most, if any. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ht81ke/black_dove_no_good_deed_or_missing_you/"
    },
    {
        "id": "1ht72l1",
        "author": "Key_Village4870",
        "title": "Immersive banners",
        "content": "So a few weeks ago, Netflix released **Spellbound.** I saw my brother who was a kid watch it but before he pressed play on it, there was a big banner promoting it with an intro. Can somebody introduce me to what this is?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ht72l1/immersive_banners/"
    },
    {
        "id": "1hsmvg2",
        "author": "indiewire",
        "title": "The 27 Best Rom-Coms on Netflix: Friends with Benefits, Hit Man &amp; More",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsmvg2/the_27_best_romcoms_on_netflix_friends_with/"
    },
    {
        "id": "1ht61e1",
        "author": "hesyouknow",
        "title": "No Good Deed Episode 8 - Looking for rug",
        "content": "Not sure if this kind of post is appropriate here but hoping someone can help me out. I binged No Good Deed over the holiday break. A good show. \n\nStop reading - this might be a spoiler \n\n\nIn episode 8 Lydia goes to Abbi &amp; Sarahs house. I’m looking for the rug in the living room scene. Anyone know the brand? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ht61e1/no_good_deed_episode_8_looking_for_rug/"
    },
    {
        "id": "1hswv38",
        "author": "Alxyhq",
        "title": "I forgot a name of this k-drama(?)",
        "content": "So there was a woman who was married with wealthy men and had 1 kid with him. She met a girl who was an artist, and asked her for a drawing classes. Once she couldn’t come to her, she asked her boyfriend to go instead of her. He fell in love with this woman and they fled to Ireland. But after one year she left him bc of lack of money. This guy had an accident and he lost his memory. Back to his girlfriend and her friend: she still loved him and couldn’t imagine life without him so she found him in Ireland after accident, returned to Korea and pretended like they always were an couple.\n\nSorry if there are a lot of mistakes I tried😭😭🙏",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hswv38/i_forgot_a_name_of_this_kdrama/"
    },
    {
        "id": "1ht0ajq",
        "author": "Psychological_Ad1202",
        "title": "Can't watch netflix while in whatsapp call?",
        "content": "Greetings,\n\nI've been having this issue ever since I started using Whatsapp which has been a long time now.\n\nI have a Samsung Galaxy S20+ and anytime I'm in a Whatsapp call, I for some reason can't get anything to actually play in the Netflix App. The app will open, but any time you actually try to play the movie/show, it doesn't do anything.\n\nIs there a way around this? Perhaps a web browser of some sorts that will allow me to watch Netflix while still in a Whatsapp call?\n\nThanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ht0ajq/cant_watch_netflix_while_in_whatsapp_call/"
    },
    {
        "id": "1hsyulv",
        "author": "Motor-Replacement-77",
        "title": "ABSOLUTELY LOVE THIS SHOW!",
        "content": "I just finished Jin on Netflix. It was recently added and it was spectacular. Definitely give it a watch if you like time travel and a really heart string pulling story. I learned a great deal of history about Japan from it too.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsyulv/absolutely_love_this_show/"
    },
    {
        "id": "1hsxk9l",
        "author": "Numerous_Cook9842",
        "title": "Korean gameshow about geniuses solving riddles?",
        "content": "I watched a series on Netflix and forgot the name. \n\nIt was about a group of (real) people who were all very intelligent and the games were intellectually challenging. Rewards for winning were gathering golden coins, punishment was going to a jail cell over night. \n\nPlease help.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hsxk9l/korean_gameshow_about_geniuses_solving_riddles/"
    },
    {
        "id": "1ht22ao",
        "author": "BLAZEISONFIRE006",
        "title": "They changed a couple important things a while back",
        "content": "I watch Netflix on my laptop with the app. \nI've always hated how the screen darkens and gigantic controls show up on the screen when you pause the show.\n\nBut you used to be able to tap the screen and the controls and darkness would disappear. Now you can't do that. It makes you wait for them to vanish every time you pause. \n\nSince this can make it hard to spot details, I wonder if you can fix this. \nIs it doing this to you guys too? \n\nI'm on an old-ish touchscreen Chromebook. You can't really seek with the arrow keys anymore either; but this bothers me way less than losing control of the pause-screen-darkness.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ht22ao/they_changed_a_couple_important_things_a_while/"
    },
    {
        "id": "1hsvloi",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in January 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsvloi/best_new_movies_streaming_on_netflix_in_january/"
    },
    {
        "id": "1ht4g2m",
        "author": "elguspeo_elpro",
        "title": "Am I the only one having lag spikes?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6w31am4h4wae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ht4g2m/am_i_the_only_one_having_lag_spikes/"
    },
    {
        "id": "1hsom5q",
        "author": "No-Confidence-7997",
        "title": "How does Khalil from Survival of the Thickest afford his giant loft apartment?",
        "content": "With a rooftop? On an art teacher’s salary? While sending his mother money?\nI understand he does commissions like the coffee shop mural wall but seriously how is he paying for this apartment. \n\nEdit: Mavis’s living arrangement clearly aligns with her finances, she was with Jaque and they had a pretty nice apartment. Once they broke up she moved to a crappier two bedroom with a roommate. \n\nThe writers are clearly intentional about it with Mavis so I’m just wondering if there’s something I missed about Khalil’s situation.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hsom5q/how_does_khalil_from_survival_of_the_thickest/"
    },
    {
        "id": "1hsmvnu",
        "author": "indiewire",
        "title": "The 15 Best Thrillers on Netflix in January",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsmvnu/the_15_best_thrillers_on_netflix_in_january/"
    },
    {
        "id": "1ht5f5r",
        "author": "OkImpression1223",
        "title": "Dubai Bling Season 3 new cast member additions",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ht5f5r/dubai_bling_season_3_new_cast_member_additions/"
    },
    {
        "id": "1hsqrbt",
        "author": "Immediate_Rip_8706",
        "title": "Account problem",
        "content": "I have my account on TV but I has an email address that was never an email address somehow. I also don't know my password so what should I do to sign in on other devices",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsqrbt/account_problem/"
    },
    {
        "id": "1hsq99x",
        "author": "isthisagoodusername9",
        "title": "Dolby Vision not available anymore on Netflix",
        "content": "Hi everyone, I'm trying to watch Squid Game 2 on my W11 Asus Zephyrus G16 2023 that supports DV natively on its panel. Yesterday everything worked smoothly, today I can't find a way to do so in any show. I've tried:\n\n\n- Multiple restarts and shut downs\n- Various restarts and reinstalls of Netflix app\n- Deleting cookies/data on Edge, just in case\n- Checked if DV worked outside Netflix and it does\n- Checked Windows HDR and video playback settings: HDR video streaming is on\n- This happens regardless if laptop is plugged in or on battery \n\nAny other ideas?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hsq99x/dolby_vision_not_available_anymore_on_netflix/"
    },
    {
        "id": "1hrqrxt",
        "author": "Whobitmyname",
        "title": "Netflix Canceled the Most Shows in 2024 (16), More Than Any Other Streamer or Network",
        "content": "",
        "upvotes": 222,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqrxt/netflix_canceled_the_most_shows_in_2024_16_more/"
    },
    {
        "id": "1hs3yi4",
        "author": "bluntprincess99",
        "title": "No Good Deed - Was it Lisa Kudrow's best performance till date?",
        "content": "No Good Deed had a lot of hangover of Dead To Me, especially the chronic ailments, feelings of loss and grief. Linda Cardellini just seemed like she was still a part of Dead To Me. Lisa Kudrow on the other hand was fantastic. She did the part of a grieving mother so well. Ray Romano too was so good and Luke Wilson as well. It seemed like such a sweet and a good holiday binge kind of a show that isn't too heavy or hard on your brains and eyes. They should bring it back for another season with different characters and a story. Just shame how it wasn't promoted as well or we don't have many people talking about it. ",
        "upvotes": 35,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hs3yi4/no_good_deed_was_it_lisa_kudrows_best_performance/"
    },
    {
        "id": "1hs5ihh",
        "author": "Sensitive_Rock6788",
        "title": "Missing you?",
        "content": "Just started it yesterday because it was recommended to me, thought I’d like it because  the Harlan Coben world is usually pretty good; but I’m also starting to feel like once you’ve seen a few, you’ve seen them all. It’s like the old Lifetime network with repeat actors and actresses, but for whatever reason, I just can’t get into this one. I’ll have to wait a bit and give it another shot. Idk if there’s too much going on, or if I’m not wild about the casting, I cant put my finger on it. ",
        "upvotes": 26,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1hs5ihh/missing_you/"
    },
    {
        "id": "1hsndeq",
        "author": "EpicFoolol",
        "title": "English Subtitles suddenly gone",
        "content": "So i was watching one piece on netflix  with english subtitles after entering season 3 the subtitles were suddenly off and I can only turn on Japanese subtitles. First I thought only the first 2 seasons have english subtitles but apparently the english subtitles are also missing for the episodes in season 2 I just watched wirth englisch subtitles.\nI'm  currently in Japan and created the account in Vietnam but the first 3 days I had no Problems.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hsndeq/english_subtitles_suddenly_gone/"
    },
    {
        "id": "1hsxbf0",
        "author": "Bong-bingwassup",
        "title": "FOOL ME ONCE. I NEED A ANSWER ",
        "content": "I need to know why maya (Michelle keegan) wore one lobe earring in one ear and 3 in the other lobe??? \n\nIt’s literally driving me insane is it her in the show and means something or just MK in general? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsxbf0/fool_me_once_i_need_a_answer/"
    },
    {
        "id": "1hsegjl",
        "author": "Burning-Atlantis",
        "title": "Marco Antonio González Ospina",
        "content": "From 100 Years of Solitude. Wtf else has this actor starred in? I have absolutely seem him before, and it's driving me crazy because I've searched google, reddit, Wikipedia, IMDB, everything I can think of, and nothing comes up except his role as Jose Arcadio Buendia. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsegjl/marco_antonio_gonzález_ospina/"
    }
]