[
    {
        "id": "1i91uga",
        "author": "BunyipPouch",
        "title": "Announcement: Today's AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist' has unfortunately been cancelled.",
        "content": "",
        "upvotes": 116,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lhkbu3klfzee1.jpeg?auto=webp&amp;s=0d23f73e5cc6f009fb15f0af7adf892fad781c82"
        },
        "permalink": "/r/movies/comments/1i91uga/announcement_todays_amaqa_with_brady_corbet/"
    },
    {
        "id": "1i6llai",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched Last Week? (01/14/25 – 01/21/25)",
        "content": "The way this works is that you post a review of the Best Film you watched this week. It can be any new or old release that you want to talk about.\n\n**Here are some rules:**\n\n1. **Check to see if your favorite film of last week has been posted already.**\n2. **Please post your favorite film of last week.**\n3. **Explain why you enjoyed your film.**\n4. **ALWAYS use SPOILER TAGS.**\n5. **Comments that only contain the title of the film will be removed.**\n\n[Last Week's Best Submissions:](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/)\n\n|Film|User|\n|:-|:-|\n|[Nosferatu (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m748z7l/)|Comic\\_Book\\_Reader|\n|[The Last Samurai (2003)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rn48/)|acerage|\n|[Get Away (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rdky/)|parky101|\n|[Better Man (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m75mj6u/)|\\_Maui\\_|\n|[Asteroid City (2023)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m77zpoc/)|roadrunner440x6|\n\n​",
        "upvotes": 32,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1i6llai/what_is_the_best_film_you_watched_last_week/"
    },
    {
        "id": "1iaaskr",
        "author": "Kingkill66",
        "title": "Seriously, what better sequel is there than Terminator 2?",
        "content": "From the beginning of the movie, to the end, every scene is just perfect. Not to mention that this movie changed the whole dynamics of what Hollywood CGI could do, (Jurassic Park also did a lot) and won 4 Oscars for it. I’m just asking…. Am I wrong to think that this is the best sequel to ever been made? Aliens…maybe… Empire Strikes Back? But…. Seriously…. Can Terminator 2 be the best?\nAhh shit… I forgot about Paddington 2. 😂 \n",
        "upvotes": 1877,
        "comments": 1589,
        "media": null,
        "permalink": "/r/movies/comments/1iaaskr/seriously_what_better_sequel_is_there_than/"
    },
    {
        "id": "1iagfcs",
        "author": "MaxProwes",
        "title": "I think Man on Fire is Tony Scott's best movie, with True Romance almost up there",
        "content": "",
        "upvotes": 269,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ALtS2KT--qoWwZDz_Skl3lbeaRfHtSerIE6Mcm9x1X4.jpg?auto=webp&amp;s=bf365862141168c290a2e9e008a3b7b90cf42298"
        },
        "permalink": "/r/movies/comments/1iagfcs/i_think_man_on_fire_is_tony_scotts_best_movie/"
    },
    {
        "id": "1iags3h",
        "author": "Expensive-Stuff3781",
        "title": "The Princess Bride is back in theaters for a limited time!",
        "content": "It’s showing at select theaters nationwide today and Wednesday!",
        "upvotes": 211,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cf1N50W5xLQHnpksiRksrgt5rbpZvvVriYsHpGZuXSA.jpg?auto=webp&amp;s=f03b8eb1e148634c4ae46b3bb3d5ceb5178fc489"
        },
        "permalink": "/r/movies/comments/1iags3h/the_princess_bride_is_back_in_theaters_for_a/"
    },
    {
        "id": "1i9w70o",
        "author": "manuelconhache",
        "title": "Emilia Perez and the lack of dialect coaches.",
        "content": "I just finished watching “Emilia Perez” and I have to say, the lack of attention to the Spanish language in this production is absolutely disappointing. It’s baffling how a movie of this scale, with a cast full of internationally recognized actors, didn’t invest in proper dialect coaching. Mexican audiences, myself included, are extremely upset by how the film handles the Spanish language—or rather, “butchers” it.  \n\nSelena Gomez doesn’t even attempt to explain or adjust her poor pronunciation. Then there’s Zoë Saldaña, whose character conveniently throws in a “Deus ex machina” explanation that she was born in the Dominican Republic to justify her accent. And Sofia Gascon? Her voice had to be AI generated because she couldn’t even sing the notes of the songs. \n\nIt’s as if the production, being French, didn’t even bother to take the language seriously. The songs—written in French and awkwardly translated into Spanish—make little to no sense, and it’s painfully obvious. It feels like they threw words together without understanding cultural nuances, making the whole thing feel artificial and disconnected from its supposed Mexican setting.  \n\nThis brings me to the larger issue: why is it that English or Australian actors go through extensive dialect training when portraying American accents (e.g., Andrew Lincoln, Kelly Reilly, Andrew Garfield), yet “Emilia Perez” gets away with such a glaring lack of effort? Even Gael García Bernal trained extensively to sound like a Spaniard in Almodóvar’s “La Mala Educación”, proving that the right effort -can- and -should- be made.  \n\nAnd yet, despite all of this, the Academy is showering the film with nominations. It’s disheartening to see how -actual- Mexican films, with authenticity and cultural accuracy, don’t receive this level of recognition. Instead, we get a film that diminishes the importance of language and cultural representation, all for the sake of style over substance. Imaging making an Italian language movie where Brad Pitt keeps his Italian in  “Inglorious Basterds” not as a comedy but as a serious drama, that was this movie. A joke. \n\nHonestly, I’m sad and disappointed. Mexican culture and language deserve better.",
        "upvotes": 6796,
        "comments": 1097,
        "media": null,
        "permalink": "/r/movies/comments/1i9w70o/emilia_perez_and_the_lack_of_dialect_coaches/"
    },
    {
        "id": "1ia7usd",
        "author": "Abi_Jurassic",
        "title": "David Koepp's 'Jurassic World Rebirth' will feature a sequence from Michael Crichton's Original JP Novel",
        "content": "",
        "upvotes": 465,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kvxGaSUxWCsz5UQsIU54edgMOQmwudYC8tzmhMoZKaI.jpg?auto=webp&amp;s=7e899658490c079dd31046b190c388b04616dfe1"
        },
        "permalink": "/r/movies/comments/1ia7usd/david_koepps_jurassic_world_rebirth_will_feature/"
    },
    {
        "id": "1i9trfg",
        "author": "mayukhdas1999",
        "title": "First Image from 'GOOD BOY' - Do you ever wonder why your dog stares at empty corners, barks for no reason, or refuses to go into the basement? This is the story of a dog who sees everything that goes bump in the night. No talking pets, just terrifying scares",
        "content": "",
        "upvotes": 3161,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vqhfy8mcq6fe1.jpeg?auto=webp&amp;s=c496c61ff5698df540ae677b98ae5917f1852d9c"
        },
        "permalink": "/r/movies/comments/1i9trfg/first_image_from_good_boy_do_you_ever_wonder_why/"
    },
    {
        "id": "1iaeafg",
        "author": "QouthTheCorvus",
        "title": "The Club Silencio scene in Mulholland Drive is one of the most powerful scenes I've ever watched. It's filled with so much sorrow.",
        "content": "",
        "upvotes": 87,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cSotQzfwg-e0h_srstJjHbMKfM0Z0h4l9h81R0p0Mzw.jpg?auto=webp&amp;s=b42c40e63d60242855d8b8ec3b583c836974ffe0"
        },
        "permalink": "/r/movies/comments/1iaeafg/the_club_silencio_scene_in_mulholland_drive_is/"
    },
    {
        "id": "1iaanxh",
        "author": "Crafty-Bunch-2675",
        "title": "Stephen King's Carrie is a powerful story because of how real the tragedy is. Why didn't anybody stop the bullies ?",
        "content": "Basically the only thing about Carrie that is \"unrealistic\" is the fact that Carrie has powers. BUT, the 3rd act of the movie could have played out the exact same way, even without anything supernatural.\n\nWe have seen those types of tragedies on the evening news.\n\nAnd, it just makes me sad everytime I watch this movie.\n\nHow relentless the bullying is, and how **utterly impotent, incompetent and passive** the adults are to stop the bullying.\n\nSome people complain, about why \"others\" were caught in the tragedy...well simply: all of them were complicit.\n\nThere are so many opportunities in the story where somebody saw the bullying take place, they recognize it is wrong, but then do nothing to stand up for Carrie; or at the best only make a half hearted effort, and then immediately forget.\n\nIt's not rocket science to stop a school bully. It's not international politics. They don't have weapons. They are just kids playing mean pranks. The adults should have easily been able to clamp down on the bullying if they really cared.\n\nAnd in the 1976 version; nobody has learnt their lesson...because they still continue defacing her grave afterward...\n\nThat's not supernatural evil. That's very real. This sort of evil exists in the real world.\n",
        "upvotes": 151,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1iaanxh/stephen_kings_carrie_is_a_powerful_story_because/"
    },
    {
        "id": "1i9vode",
        "author": "whitepangolin",
        "title": "Indiana Jones was an homage to James Bond, so they cast Sean Connery as his father. What are other instances of homage casting?",
        "content": "Was thinking about this. Spielberg and Lucas have long said that \"Indiana Jones\" was born from their desire to make a James Bond film, mixed with the 1930s action serials they also used to love. There's a bunch of James Bond castings in the Indiana Jones franchise - namely Sean Connery, but also Allison Doody and Julian Glover as well.\n\nAnother example is \"Joker\" taking cues from DeNiro films \"Taxi Driver\" and \"The King of Comedy,\" with them ultimately casting Robert DeNiro in their film as well.\n\nWhat other examples exist of this? A movie inspires another movie, so they cast folks from that first movie in this one. ",
        "upvotes": 1328,
        "comments": 765,
        "media": null,
        "permalink": "/r/movies/comments/1i9vode/indiana_jones_was_an_homage_to_james_bond_so_they/"
    },
    {
        "id": "1ia1hn1",
        "author": "quietwhiskey",
        "title": "Training Day - Getting Wet scene",
        "content": "",
        "upvotes": 567,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cOxWnhusYMNlBRfJ0y71TrznqGiVEz_ozg6JOYprK6U.jpg?auto=webp&amp;s=a84c7958b06b2c0ab7cc5405173d1a7b8706a32f"
        },
        "permalink": "/r/movies/comments/1ia1hn1/training_day_getting_wet_scene/"
    },
    {
        "id": "1i9oyhj",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Kate Mara in 'The Astronaut' - Following her first space mission, astronaut Sam Walker is placed under NASA’s care for rehabilitation and medical testing. However, when disturbing occurrences begin happening, she fears that something extraterrestrial has followed her back to Earth",
        "content": "",
        "upvotes": 2910,
        "comments": 317,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/brdgtqpno5fe1.jpeg?auto=webp&amp;s=f6cecaa61e3942d7072c9f25fd8c345e3e31971c"
        },
        "permalink": "/r/movies/comments/1i9oyhj/first_image_of_kate_mara_in_the_astronaut/"
    },
    {
        "id": "1iaiqhu",
        "author": "JustTony35",
        "title": "Sir Christopher Lee, a villain on the screen and true hero in real life.",
        "content": "He performed as Count Dracula nine times over his fifty-year career. In the James Bond movie \"The Man With the Golden Gun,\" he played  Francisco Scaramanga. He may also be recognizable to audiences as Saruman from \"Lord of the Rings.\" (Alternatively, we don't discuss Count Dooku from \"Star Wars Episode II: The Clone Wars.\"\n\nBefore his acting career, Lee served in the Royal Air Force as an intelligence officer, attached to the No. 260 Squadron RAF during World War II. After the war, Lee worked for the Central Registry of War Crimes, where he was responsible for **identifying and apprehending Nazis**. He visited Dachau and other concentration camps throughout Europe for this work. Regarding his tenure with the company, Lee stated: \"We were given dossiers of what they'd done and told to find them, interrogate them as much as we could and hand them over to the appropriate authority\".\n\nLee was knighted for services to drama and charity in 2009. He died on 7 June 2015 (aged 93) in London, England.",
        "upvotes": 24,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1iaiqhu/sir_christopher_lee_a_villain_on_the_screen_and/"
    },
    {
        "id": "1i9p1z1",
        "author": "QouthTheCorvus",
        "title": "Willem DaFoe is truly such an incredible actor. He elevates every movie he's in",
        "content": "I just watched The Florida Project, and his performance in that is so amazing. It's crazy how watchable he is as an actor. You're so immersed in his role and the world around him. Despite being such a well known actor, you completely accept that he's Bobby, manager of the Magic Kingdom. \n\n  \nThere's also The Lighthouse, a movie that completely lives or dies by his performance, and he puts on a fantastic show. It's a very stage play performance, but it's so fun to watch. [The curse in The Lighthouse](https://www.youtube.com/watch?v=I3vcK-ppzqE&amp;ab_channel=TheOncomingStorm) alone is one of the greatest pieces of acting I've ever seen. Such a powerful scene. \n\n  \nI can't believe this man hasn't won an Oscar yet. He's a complete gift to the film industry. ",
        "upvotes": 961,
        "comments": 181,
        "media": null,
        "permalink": "/r/movies/comments/1i9p1z1/willem_dafoe_is_truly_such_an_incredible_actor_he/"
    },
    {
        "id": "1ia3pyt",
        "author": "bob_loblaw_0211",
        "title": "What actor has lived through the Holocaust the most times?",
        "content": "I saw The Brutalist today (huge recommend) but while watching I realized this is not the first movie made starring Adrien Brody as a Holocaust survivor. It got me thinking: has an actor before been in multiple Holocaust movies before? Or better yet, is there an actor who has \"lived\" through the same war multiple times?",
        "upvotes": 110,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1ia3pyt/what_actor_has_lived_through_the_holocaust_the/"
    },
    {
        "id": "1ia6qt0",
        "author": "mementopueri",
        "title": "What movie ending made you cry the most?",
        "content": "For me, there are two: The Return of the King and Kong: Skull Island. I watched both movies in the last 4 days, and also watch the first two LOTR movies after Skull Island and before TROTK.\n\nI'll give more attention to the last one because it depends less on the rest of movie itself than the ending of TROTK, which, despite being more emotional, is so because it is a farewell to a journey, both for the film's protagonists and for those who watched them. \n\nOn the other hand, the ending of Skull Island is almost completely independent of the rest of the movie. Of course, it's more beautiful when you've seen the movie, especially because of Gunpei's katana and the hot dog and cold beer while watching a Cubs game. But even so, you can show this scene to someone who hasn't seen the film and that person will perfectly understand the scene and what it means for the characters involved, and this without any speech other than the sports commentator saying that the impossible dream became the possible dream.",
        "upvotes": 53,
        "comments": 326,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D609ugVMWytSDQrg50VW2RftEzOk39lZ-31DCqDFNb0.jpg?auto=webp&amp;s=36f1762611a9d3dd0fe1e8ea5526d98fdd9bcef8"
        },
        "permalink": "/r/movies/comments/1ia6qt0/what_movie_ending_made_you_cry_the_most/"
    },
    {
        "id": "1ia5ya7",
        "author": "LilNello1",
        "title": "The Wild Robot",
        "content": "Just finished watching and I must say not only one of the best animated, but most beautiful and emotionally touching movies I have ever seen. There was quite a few times where I was moved to tears or near tears with how emotionally beautiful certain points of the movie just really hit home. Which is kind of crazy cause of how growing up like most Mexican and/or Hispanic American homes and especially even more so with boys as you grow into men. You are taught to be so macho and not as emotional. This definitely not only deserves the best animated Oscar, but really should have been nominated in the best pictures of the year too.  So what is everyone else who has seen it thoughts on the movie?",
        "upvotes": 47,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1ia5ya7/the_wild_robot/"
    },
    {
        "id": "1i9wxn1",
        "author": "Apprehensive_Fly9352",
        "title": "Monica Barbaro, First-Time Oscar Nominee, Is Plotting a Way to Meet Joan Baez",
        "content": "",
        "upvotes": 197,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xv4q89wXlWmSCJJH7lkIx6bhpV78xplzXDms9dacsLw.jpg?auto=webp&amp;s=6ccea4ca849afa6abfa0e64fce9986d857cdff04"
        },
        "permalink": "/r/movies/comments/1i9wxn1/monica_barbaro_firsttime_oscar_nominee_is/"
    },
    {
        "id": "1i9qeso",
        "author": "indiewire",
        "title": "‘If I Had Legs I’d Kick You,’ Starring a Sensational Rose Byrne, Is a Welcome Shock to Sundance’s System (Commentary)",
        "content": "",
        "upvotes": 358,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aq4kpJzuu2UeRNVLXOYcCmsITNHEuOUG6e9BncOf7NE.jpg?auto=webp&amp;s=a25e5621c543dcda702a69e2cd2ef2aea0505698"
        },
        "permalink": "/r/movies/comments/1i9qeso/if_i_had_legs_id_kick_you_starring_a_sensational/"
    },
    {
        "id": "1i9ojec",
        "author": "BunyipPouch",
        "title": "Poster for the 50th Anniversary 4K Restoration &amp; Re-Release of Peter Weir's 1975 Masterpiece 'Picnic at Hanging Rock'",
        "content": "",
        "upvotes": 425,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8hhl8ae0l5fe1.jpeg?auto=webp&amp;s=b7866c810e2a08c45ac0f27546b0a048ff3b2728"
        },
        "permalink": "/r/movies/comments/1i9ojec/poster_for_the_50th_anniversary_4k_restoration/"
    },
    {
        "id": "1ia4has",
        "author": "Gingerbread0596",
        "title": "“Different Man” is brilliant",
        "content": "As I finish this movie, this movie does so many things right. It makes you think of the beginning situation one way and throughout the movie it comes out to be something deeper. Seeing Edward be so self conscious, and seeing him think that once he gets this miracle drug then his life will be better. Until he meets someone who has the same disease he then sees how much they embrace life, how confident they are in their own skin. It’s such a beautiful and smart film that this for me is a Top 3 A24 film! ",
        "upvotes": 44,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1ia4has/different_man_is_brilliant/"
    },
    {
        "id": "1iaj0lb",
        "author": "PrithvinathReddy",
        "title": "Martin Scorsese’s Top 10 recommendations.",
        "content": "1. Paisan - ROBERTO ROSSELLINI\n. \n2. The Red Shoes - MICHAEL POWELL AND EMERIC PRESSBURGER\n. \n3. The River - JEAN RENOIR\n. \n4. Ugetsu - KENJI MIZOGUCHI\n. \n5. Ashes and Diamonds - ANDRZEJ WAJDA\n. \n6. L’avventura - MICHELANGELO ANTONIONI\n. \n7. Salvatore Giuliano - FRANCESCO ROSI\n. \n8. 8½ - FEDERICO FELLINI\n. \n9. Contempt - JEAN-LUC GODARD\n. \n10. The Leopard - LUCHINO VISCONTI",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1iaj0lb/martin_scorseses_top_10_recommendations/"
    },
    {
        "id": "1i9o9xm",
        "author": "griefofwant",
        "title": "Who will the 14 be if they make Ocean's 14?",
        "content": "David Leitch is in talks to direct a new Ocean's movie. \n\nOf the original cast of Ocean's 11, Carl Reiner and Bernie Mac have both passed away.\n\nAssuming the rest of the cast comes back, that leaves five spots open on the crew. Who do you think they should cast?\n\nThey could bring back Julia Roberts, Eddie Izzard and Andy Garcia who were in the team in 12 and 13.\n\nThere's also Ocean's 8 cast members like Sandra Bullock or Cate Blanchett. \n\nOr they could bring in some new actors. Ryan Gosling would be a good fit and he just did The Fall Guy with Leitch. \n\n",
        "upvotes": 228,
        "comments": 303,
        "media": null,
        "permalink": "/r/movies/comments/1i9o9xm/who_will_the_14_be_if_they_make_oceans_14/"
    },
    {
        "id": "1i9ztal",
        "author": "808gecko808",
        "title": "Lights, camera, popcorn! Molokaʻi to get first movie theater in nearly 20 years",
        "content": "",
        "upvotes": 45,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VdO0CTjX6wk0SwT16NAcCHjl-CwjwIUX1v-q7W8Mhog.jpg?auto=webp&amp;s=e0f08bf585ee32509d48ed0eb09c22ac9525bf4d"
        },
        "permalink": "/r/movies/comments/1i9ztal/lights_camera_popcorn_molokaʻi_to_get_first_movie/"
    },
    {
        "id": "1i99efa",
        "author": "Sisiwakanamaru",
        "title": "Sandra Bullock and Nicole Kidman will officially return for ‘Practical Magic 2.’",
        "content": "",
        "upvotes": 3066,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/arFthvZbWgIQZN-ZI2aPrABalZOvMWFTj2uwXVwQAL4.jpg?auto=webp&amp;s=55157e771f3262dd1250dab67d4e296193de7be5"
        },
        "permalink": "/r/movies/comments/1i99efa/sandra_bullock_and_nicole_kidman_will_officially/"
    },
    {
        "id": "1i9rfxx",
        "author": "Bullingdon1973",
        "title": "Great interview with Lucy Liu about her innovative new Steven Soderbergh horror movie 'Presence.'",
        "content": "",
        "upvotes": 114,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/axOsD4EDTk8_rNFfQ0l0hB_Tn-Y1ku4o6sThVU5AvRE.jpg?auto=webp&amp;s=046a779d93446424967d1979747734dec0339215"
        },
        "permalink": "/r/movies/comments/1i9rfxx/great_interview_with_lucy_liu_about_her/"
    },
    {
        "id": "1ia5b3u",
        "author": "PbCuSurgeon",
        "title": "I'm seeking movies with a particular Protagonist / Antagonist dynamic",
        "content": "I'm doing some film study for a story I'm writing and needed a grasp on a particular trope.  \nFrom the beginning, my protagonist will be teamed up with a secondary character, both after the same antagonist. The midpoint twist will have this secondary character defeat the main antagonist, but become a bigger threat our protagonist must now face alone.\n\nWhat movies can I watch that feature this trope?\n\nEdit: I’m leaning towards movies with a serious tone to them.",
        "upvotes": 17,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ia5b3u/im_seeking_movies_with_a_particular_protagonist/"
    },
    {
        "id": "1iagevc",
        "author": "JediTigger",
        "title": "Happy tears?",
        "content": "Over my time here I have seen a plethora of comments of films that cause people to sob - *Graveyard of the Fireflies*, *Schindler’s List*, *Hachi*, etc. - but what about movies that have evoked happy crying because they’re so sweet, happy and/or beautiful? For me, *Kubo and the Two Strings* is one; the end of *The Lion King*, when Simba is walking up Pride Rock with that glorious Hans Zimmer score swelling, is another. \n\nThe biggest ones probably: \n\n- Peter Falk’s gentle “As you wish,” at the end of *The Princess Bride* is so sweet I check my blood sugar after watching. \n\n- Colin Firth proposing in broken Portuguese to Lúcia Moniz in the restaurant in *Love Actually* is peak romance. Not a huge fan of the whole movie now but that part is exquisite. \n\nWhat about you? Anything make you cry happy tears?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1iagevc/happy_tears/"
    },
    {
        "id": "1i9nn3p",
        "author": "MrGittz",
        "title": "What are scenes cut/deleted from a film that SHOULDNT have been cut out?",
        "content": "Deleted scenes have always fascinated me. There are quite a few infamous cut out sequences. Some have been put back in alternate or extended cuts, others released as bonus features, and some have never seen the light of day. Others were scripted but never even filmed.\n\nThe ones that come to mind for me are Michael Corleone killing Fabrizo in Godfather part 1(apparently part of this scene was shot before it got cut and the idea saved for part 2 where it was cut again). There’s a picture of this sequence, or part of it, where Michael apparently shoots Fabrizio with a shot gun. No idea where would it would fit in but the pictures are floating around the internet. I can see why it was cut but it’s something id love to see. \n\nSuperman TMP. Added to the special edition but cut from theatrical is a sequence where Lex Luthor tests Superman’s powers before he can enter Lex’s underground lair. He shoot’s Superman with machine gun bullets, sets him on fire and then freezes him whole. It’s a fun sequence with some cool FX. Even the director, Richard Donner, on the dvd commentary is puzzled why he ever cut the scene.\n\n\nI always loved the Sentry Gun sequence in Aliens which was added back in for the special edition. \n\nGhostbusters 2 has a number of deleted scenes. Many have never been seen. One that’s never been seen is Ray getting possessed by Vigo and crashing the Ecto 1A(remnants of this scene remain in the first montage sequence where we see Peter in the back of the Ecto 1 looking repeatedly to Ray whose running a red light.)\n\n\nAnother from GB2 but has been released which is Dana addressing the fact that she’s involved in another paranormal event and so is there something that makes her vulnerable to these situations? This one is good because it makes light of something we the audience are thinking about. Dana Barrett just so happened to walk in that Slime?Out of all the people it was her AND she has a baby the bad guy wants? After what happened in the first film? Really?\n\nThe alternate ending of Little Shop of Horrors works way better in my opinion. Much darker. But funnier. Great miniature work.\n\nSpider-Man 2 has an extended cut which some extra bits of action on the train but more than anything there’s a scene with MJ and her friend going shoe shopping that I love. It really delves into who MJ is and her friend really gives a nice performance. Plus J Jonah Jameson trying on the Spidey suit is GREAT, the one brought in by garbage man\n\nKill Bill. Ok. This is an interesting one. The Kill Bill that’s been released(both volumes) is not the Kill Bill originally planned. QT wrote an earlier draft and he cut out what I consider to be the best chapter in the entire saga. “Yuki’s Revenge”. This was never filmed. And it’s a damn shame. Gogo has a twin sister and she tracks down Beatrix right after killing Vernita Green. In the film we hear an Ice Cream Truck roaming Vernitas neighborhood. In the script? That’s Yuki and shes found The Brusge and they both go on destroying the neighborhood in an explosive action sequence. Beyond that, there’s a version of the film called “Kill Bill The Whole Bloody Affair” which combines both parts into one film. The House of Blue Leaves is in color and extended(as it was , Extended anime sequence, a new anime sequence but most importantly? We, the audience, spend the entire film thinking Beatrix lost her baby. We don’t find out until SHE finds out that BB is alive. I can only imagine the power of this sequence. It removed the stinger from the end of volume 1 where Bill reveals the truth.\n\nSo those are some of my favourites. I have more but don’t want to name them all.\n\n What are yours?",
        "upvotes": 183,
        "comments": 316,
        "media": null,
        "permalink": "/r/movies/comments/1i9nn3p/what_are_scenes_cutdeleted_from_a_film_that/"
    },
    {
        "id": "1i9dt36",
        "author": "New_Transition8925",
        "title": "Movies that capture the *feel* of the 1990s",
        "content": "I was born the in early 1990s, but was really too young to remember how exactly those times felt (socially, politically, aesthetically, etc.) It doesn’t have to necessarily be a movie *made* in the 90s (I’m sure that will make the most sense though), I’m just looking for movies that highlight the general feeling of the time. \n\nI’m hoping to watch some films that really capture the era, all recs are welcome! ",
        "upvotes": 1046,
        "comments": 2145,
        "media": null,
        "permalink": "/r/movies/comments/1i9dt36/movies_that_capture_the_feel_of_the_1990s/"
    },
    {
        "id": "1iajct3",
        "author": "clubfungus",
        "title": "Dumb movie: Salem's Lot (2024)",
        "content": "I wasn't expecting a thoughtful meditation on something or other with Salem's Lot.  I was just hoping for a watchable Stephen King adaption.  \n\nBut here is when I shut if off:\n\nTwo of the characters, fully convinced that a vampire is living in the creepy house on the hill, go to the house on the hill.  Let me make it clear that they weren't going to confirm a suspicion; they'd already made up their minds that a vampire was living there.\n\nBy the way, each had found their own path there; they were not working together.  So what do they both happen to do?  They go at night, and both go right down into the basement.  Does either one bring, say, a flashlight?  No. One hadn't brought anything, and the other happened to have matches because he's a smoker.  The one who hadn't brought anything was supposed to be the precocious smart kid.  The one with matches was sort of the town intellectual, a highly-regarded school teacher.  But neither one had thought to bring a flashlight, or even a candle?\n\nSo yea, that was just too dumb for me to stomach, and I had to shut it off.  I can live with unwary teens calling out, \"Frank, is that you?\" not knowing the killer is lurking nearby, though it is a tired trope.  But this sort of plain stupidity was too much for me.\n\nHave you ever shut off a movie just because of what a character did was so unbelievably dumb?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1iajct3/dumb_movie_salems_lot_2024/"
    }
]