[
    {
        "id": "1kpmc3t",
        "author": "BridgeportAMA",
        "title": "Hey /r/movies, I'm Justin Royce, director/writer/editor/actor of BRIDGEPORT: THE MOVIE and DEAD IN A DAY. Both are available on digital. Ask me anything.",
        "content": "Hey r/movies, I'm Justin Royce, director/writer/editor/actor of BRIDGEPORT: THE MOVIE and DEAD IN A DAY. Both are available on digital. Ask me anything.\n\nYou can watch Bridgeport here on Tubi:\n\n[https://link.tubi.tv/pN7e3HD2hTb](https://link.tubi.tv/pN7e3HD2hTb)\n\nTrailer: [https://www.youtube.com/watch?v=ATahxtVnHg8](https://www.youtube.com/watch?v=ATahxtVnHg8)\n\nAnd Dead In A Day on Prime Video:\n\n[https://www.amazon.com/Dead-Day-Justin-Royce/dp/B0DMV1BZQ3](https://www.amazon.com/Dead-Day-Justin-Royce/dp/B0DMV1BZQ3)\n\nTrailer: [https://www.youtube.com/watch?v=pWF4355b6ds](https://www.youtube.com/watch?v=pWF4355b6ds)\n\nMy website: [https://royceempire.com/](https://royceempire.com/) \n\nI produced, directed, edited and acted in both of these films. Ask me anything! Back on Monday (5/19) at 6 PM ET to answer questions.\n\n\n\n\n\n",
        "upvotes": 12,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o5i1nr9c4k1f1.png?auto=webp&amp;s=65ac17576ea8c90f5e8008466c5181c6046712df"
        },
        "permalink": "/r/movies/comments/1kpmc3t/hey_rmovies_im_justin_royce/"
    },
    {
        "id": "1knppue",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Final Destination: Bloodlines / Hurry Up Tomorrow)",
        "content": "# New Theatrical Releases\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n# Still in Theaters\n\n[Clown in a Cornfield](https://old.reddit.com/r/movies/comments/1ki7l69/official_discussion_clown_in_aa_cornfield_spoilers/?)\n\n[Fight or Flight](https://old.reddit.com/r/movies/comments/1ki7l7u/official_discussion_fight_or_flight_spoilers/?)\n\n[Shadow Force](https://old.reddit.com/r/movies/comments/1ki7l93/official_discussion_shadow_force_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 36,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1knppue/official_discussion_megathread_final_destination/"
    },
    {
        "id": "1kpzuad",
        "author": "borrisimo",
        "title": "Shia LaBeouf’s Theater Company From Hell: Cannes Doc Reveals Actor’s Misconduct With Students and Hopes for Redemption",
        "content": "Leo Lewis O’Neil’s documentary “Slauson Rec” was one of the late additions to the Cannes Film Festival lineup, but it’s certainly now one of the festival’s buzziest titles following its premiere in the Cannes Classics section.\n\nThe film, which received a two-minute ovation on Sunday, had been teased for weeks as a rollercoaster ride through an experimental theater company run by a famous (or infamous, according to some) actor. In a smaller theater inside the festival’s Grand Palais on Sunday, however, the full two-hour-and-25-minute documentary was no trip to the theme park.",
        "upvotes": 2829,
        "comments": 304,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EKxsJe6BIWuNaO11ij7Ir03LVLFoKwHXTN1zP-IAWs0.jpg?auto=webp&amp;s=955ee5629357cfa55f9be86b32cb0f34a82e57e2"
        },
        "permalink": "/r/movies/comments/1kpzuad/shia_labeoufs_theater_company_from_hell_cannes/"
    },
    {
        "id": "1kplder",
        "author": "MarvelsGrantMan136",
        "title": "Nicole Kidman Has Now Worked With 27 Women Directors in 8 Years; She Urges Financial Mentors to Invest in Unknown Female Filmmakers and Take a Risk",
        "content": "",
        "upvotes": 28067,
        "comments": 878,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IDb5HbKGV10sNrB0_Am5cwjqsV9opYZtYjxSgv0UVDg.jpg?auto=webp&amp;s=1a71f8190a19cb3db3b177346d16c80252604f65"
        },
        "permalink": "/r/movies/comments/1kplder/nicole_kidman_has_now_worked_with_27_women/"
    },
    {
        "id": "1kpu6ze",
        "author": "MarvelsGrantMan136",
        "title": "Guillermo del Toro Teases Incredibly Emotional ‘Frankenstein’ at Cannes, Says It’s Not a Horror Movie",
        "content": "",
        "upvotes": 2487,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6rrc6GP4ao7rYsX9NTqxLErYMTdrDH4oHHe-I_CFP_I.jpg?auto=webp&amp;s=0301f7603d8898a2d209bf5b61943e5b993eba87"
        },
        "permalink": "/r/movies/comments/1kpu6ze/guillermo_del_toro_teases_incredibly_emotional/"
    },
    {
        "id": "1kpy0lc",
        "author": "M_the_Phoenix",
        "title": "Which movie pissed off a preexisting fan base the most?",
        "content": "In your opinion which movie comitted the worst offense of insulting a preexisting fan base?\n\nYou know, by completely disrespecting the source material or trashing major character arca from previous installments?\n\nin my mind, there is no worse offense than the dumpster fire of an Artemis Fowl adaptation.\n\nI was so excited when I heard that movie planned.\n\nBut I was horrified by what they put out there. Completely erasing Artemis's entire character, and replacing him with an empty, shallow, wannabe kid hero.\n\nWhat a wasted opportunity that we'll probably never get back.",
        "upvotes": 560,
        "comments": 1075,
        "media": null,
        "permalink": "/r/movies/comments/1kpy0lc/which_movie_pissed_off_a_preexisting_fan_base_the/"
    },
    {
        "id": "1kpll09",
        "author": "MarvelsGrantMan136",
        "title": "Ten Years After 'Kung Fury' Rocked Cannes, Director David Sandberg Unwraps 'Heartbreaking' Legal Chaos That Left Feature-Length Sequel in Limbo",
        "content": "",
        "upvotes": 1530,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UUhmZvP6c86o5xEUgNYFHbp79QtPuuWDx85dJSG5OGc.jpg?auto=webp&amp;s=7761482dc7321f06c35ce96b23f3687c2c2f2790"
        },
        "permalink": "/r/movies/comments/1kpll09/ten_years_after_kung_fury_rocked_cannes_director/"
    },
    {
        "id": "1kpl7wi",
        "author": "indiewire",
        "title": "Lynne Ramsay Wanted Jennifer Lawrence and Robert Pattinson to Attack Each Other Like Tigers on First Day of ‘Die My Love,' Asking if They Could Do It Naked",
        "content": "",
        "upvotes": 1467,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L9q-87rr0ZSBvEBzLk2gSXe8zT9-UxdvKHb1sQFoneA.jpg?auto=webp&amp;s=34e46f4d86a6d41e19de41304c046827efa7cb21"
        },
        "permalink": "/r/movies/comments/1kpl7wi/lynne_ramsay_wanted_jennifer_lawrence_and_robert/"
    },
    {
        "id": "1kpqvsx",
        "author": "schlongjohnson69",
        "title": "What movie were you SUPER hyped for that turned out to be...something else entirely.",
        "content": "Not necessarily \"they said it was gonna be good, but it was actually bad.\" Any movie you feel was kind of built up on a certain sales pitch that ended up being something completely different when you watched it?\n\nFor me, something like \"Bad Times At The El Royale\" comes to mind, where i feel like i was sold a quirky, weird, all-out-gun-fest like Smoking Aces, but experienced a more subdued, measured, and secretive movie. Being in the wrong headspace going in kinda made me feel like i got ripped off.",
        "upvotes": 607,
        "comments": 1062,
        "media": null,
        "permalink": "/r/movies/comments/1kpqvsx/what_movie_were_you_super_hyped_for_that_turned/"
    },
    {
        "id": "1kppsfe",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie is proof you should never judge a movie by its cover?",
        "content": "Thought I’d make this post after watching Tucker &amp; Dale vs Evil. Expected a typical b-movie slasher, turns out it’s way more than that. Genuinely funny, likeable characters and a wildly entertaining plot. It gave me Cabin in the Woods vibes. \n\nWhat movies are great examples of not judging a movie by its cover/first impressions? ",
        "upvotes": 541,
        "comments": 393,
        "media": null,
        "permalink": "/r/movies/comments/1kppsfe/what_movie_is_proof_you_should_never_judge_a/"
    },
    {
        "id": "1kpmxgl",
        "author": "reble02",
        "title": "Wes Anderson Remembers Gene Hackman Being “Furious” About ‘The Royal Tenenbaums’ Flat-Fee Salary: “We Had Friction”",
        "content": "",
        "upvotes": 736,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EC1H2fBBDCpY34u_aUjsiLnWHc4fsCeBU4X8zxMIih4.jpg?auto=webp&amp;s=401a913f4ab3f138934c761506e48d2696d8a27e"
        },
        "permalink": "/r/movies/comments/1kpmxgl/wes_anderson_remembers_gene_hackman_being_furious/"
    },
    {
        "id": "1kppg2h",
        "author": "ChiefLeef22",
        "title": "Wes Anderson's 'The Phoenician Scheme' - Review Thread",
        "content": "*Wealthy businessman, Zsa-zsa Korda appoints his only daughter, a nun, as sole heir to his estate. As Korda embarks on a new enterprise, they soon become the target of scheming tycoons, foreign terrorists, and determined assassins.*\n\nCast: Benicio Del Toro, Michael Cera, Scarlett Johansson, Benedict Cumberbatch, Bryan Cranston, Bill Murray, Riz Ahmed, Truman Hanks, Steve Park, Scott Shepherd, Willem Dafoe\n\n**Rotten Tomatoes:** [83%](https://www.rottentomatoes.com/m/the_phoenician_scheme)\n\n**Metacritic:** [71/100](https://www.metacritic.com/movie/the-phoenician-scheme/)\n\nSome Reviews:\n\n[The Standard - Jo-Ann Titmarsh](https://www.standard.co.uk/culture/film/the-phoenician-scheme-review-wes-andersons-film-just-doesn-t-soar-b1228420.html)\n\n&gt;As with many of Anderson’s films, there is a lot to look at: there are ingenious set designs and costumes, a meticulous attention to the minutest detail. And there are some nice touches, such as Liesl’s ‘jewel-encrusted rosary as she gradually eschews her calling and embraces secular life. ‘You could still believe in God if you want,’ says her father. Whether that is enough to keep you on board for the 105 minutes of Wes Anderson’s latest venture (which he also wrote and produced), appearing in Cannes in competition, probably depends on how much you love Anderson’s oeuvre and how forgiving you are of his flimsy tales.\n\n[The Hollywood Reporter - Lovia Gyarkye](https://www.hollywoodreporter.com/movies/movie-reviews/the-phoenician-scheme-review-wes-anderson-benicio-del-toro-1236220124/)\n\n&gt;As with all Anderson films, *The Phoenician Scheme* boasts an enchanting world in which viewers can get lost. The director shows off his meticulous attention to detail and symmetrical composition, as well as a muted and moody color grading that serves as a steady reminder of the film’s darker themes. Collaborating again with Roman Coppola (*Asteroid City*) on the story, Anderson constructs one of his most complicated narratives yet.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/the-phoenician-scheme-review-wes-anderson-1235124323/) \\- B-\n\n&gt;Unburdened by the depth that has allowed earlier work like “The Royal Tenenbaums” and “The Darjeeling Limited” to resonate for decades on end (even as it’s saddled with twice the texture), “The Phoenician Scheme” is free to focus all of its attention on the simple idea that family is the richest inheritance that anyone could ever hope to receive or pass down, even if some people — fathers most of all — usually have to lose everything else before they can learn to appreciate its value. “Planning doesn’t matter, Zsa-zsa says, “what matters is the sincerity of your devotion.” It’s a strange thing to hear towards the end of an Anderson film that’s been too obsessed with the planning stage to meaningfully devote itself to *anything*, but “The Phoenician Scheme” is a movie with its heart in the right place, and a souvenir hand grenade within arm’s reach just in case it’s needed.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/the-phoenician-scheme-review-wes-anderson-1236402578/)\n\n&gt;Less conceptually quirky than the eccentric auteur’s recent “Asteroid City” (with its layered film-within-a-stage-rehearsal-within-a-“Playhouse 90”-esque-TV-special meta-framing), but no less profound, “The Phoenician Scheme” once again finds Anderson incorporating existential matters into a seemingly satirical form. Not a frame goes by without myriad comedic details to tickle his audience, and yet beneath it all, the director dares to confront questions of mortality.\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/05/the-phoenician-scheme-review-benicio-del-toro-hilariously-dominates-wes-andersons-latest-cannes-film-festival-1236401800/)\n\n&gt;The film belongs lock stock and barrel to Del Toro, playing this Onassis-style billionaire who proves again to be so adept to the rhythms of Anderson’s dialogue and delivers flawlessly here, as does newcomer Threapleton as Liesl, and Cera, a newcomer to Anderson’s stock company who will undoubtedly be asked back. Ahmed and Cumberbatch are also welcome additions,as is regular Richard Ayoade as a terrorist leader. Look for Willem Dafoe and F. Murray Abraham as popups along the way with Hanks, Cranston, Johansson and others in for a fun day’s work.\n\n[Next Best Picture - Matt Neglia](https://nextbestpicture.com/the-phoenician-scheme/) \\- 6/10\n\n&gt;While those expecting typical Wes Anderson fare will likely get what they came for with “The Phoenician Scheme,” there’s no denying the director has provided more substantial efforts with poignant and memorable results. Certain aspects, such as the crafts and the performances from Cera and Threapleton, are striking all the right qualities to make this another Anderson outing worth examining. But outside of the shenanigans and the surface-level reading of a lack of religion in a dishonest man’s life, there isn’t as much to pry into here compared to “The Grand Budapest Hotel” or “Asteroid City.” Much like Tarantino, Scorsese, Lynch, or any other revered filmmaker, opinions may differ from person to person regarding their favorite Wes Anderson film and how they would rank his work.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/the-phoenician-scheme-review-wes-anderson/)\n\n&gt;“The Phoenician Scheme” is a serious work of art that plays like a boondoggle. Anderson could be accused of copping out of making a decision to choose between God and, you know, owning stuff, but I think he finds that there’s a bit of spirituality in all of us that can’t be ignored, and a desire to relish in life’s little indulgences as well, and that the two aren’t mutually exclusive. Del Toro hasn’t had a role this juicy in ages, and he’s captivating at all times. Mia Threapleton is hitting all the right notes as well, spending much of the film with a wallflower entomologist named Bjørn, played by Michael Cera (who is, predictably, a natural vessel for Anderson’s sensibilities). They seem destined to fall, well maybe not in love, but perhaps in laconic mutual interest. Riz Ahmed, Tom Hanks, Bryan Cranston, Mathieu Amalric, Richard Ayoade and Benedict Cumberbatch all get their own delightful moments, and the list of cameos is as long as your arm, depending of course on the typeface and font size.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/the-phoenician-scheme-review-benicio-del-toro-and-wes-anderson-unite-for-espionage-comedy-drama/5204703.article)\n\n&gt;Del Toro makes for an enigmatic Korda, one of Europe’s richest men who will discover the limits of his power. The actor’s droll performance amuses, but the character never really surprises or taps into something deeper about the immoral capitalists who have plundered the globe for their own profit. Del Toro shares a wry, prickly rapport with Threapleton, but Liesl feels similarly underdeveloped. And *The Phoenician Scheme*’s wealth of stellar supporting players only get scant screen time, with few managing to shine. That said, Cera, a newcomer to Anderson’s acting stable, acquits himself nicely as Korda’s ineffectual Norwegian helpmate who begins to pine for this aloof nun. He plugs into the filmmaker’s deadpan style, but he can’t fully enliven it.\n\n[BBC - Nicholas Barber](https://www.bbc.com/culture/article/20250518-the-phoenician-scheme-review-wes-anderson-takes-his-quirkiness-to-a-whole-new-level) \\- 3/5\n\n&gt;Some directors boast that they make the films that they want to see, and they don't care about pleasing anyone else. In the case of The Phoenician Scheme, it feels as if Anderson and his team were enjoying it more than audiences ever will. It's one of the ironies of Anderson's films: in many respects they are planned with obsessive attention to detail, and yet the plot of The Phoenician Scheme could have been scribbled on the back of the envelope in the small hours of the morning. It's good fun, but unless your tolerance for the director's idiosyncrasies is stratospherically high, the chances are that the story will seem too random for you to care about by the halfway point.\n\n",
        "upvotes": 418,
        "comments": 295,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hsv7cozNCZ3snlaJUPVb5OBcg8mBL3FEk9lppf2vXWw.jpg?auto=webp&amp;s=6f69ca81905b362fe7a3e21d8bc55390ce55ae65"
        },
        "permalink": "/r/movies/comments/1kppg2h/wes_andersons_the_phoenician_scheme_review_thread/"
    },
    {
        "id": "1kpnvzf",
        "author": "NoCulture3505",
        "title": "Tom Cruise Is “Working On” Ideas For ‘Top Gun 3’, ‘Days of Thunder’ Sequel",
        "content": "",
        "upvotes": 476,
        "comments": 200,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e5DKbdAjQ7n7ecElslkT_sMalIhqquFTMtJf9QWhp_w.jpg?auto=webp&amp;s=a1364f6afb67603d07ab7bff676b06f5fcb7c51a"
        },
        "permalink": "/r/movies/comments/1kpnvzf/tom_cruise_is_working_on_ideas_for_top_gun_3_days/"
    },
    {
        "id": "1kposxl",
        "author": "BunyipPouch",
        "title": "Jennifer Lawrence-Robert Pattinson Drama ‘Die My Love’ Picked Up By Mubi For U.S. Release In First Big Cannes Film Festival Deal - The possible Oscar contender will be Mubi's biggest film since 'The Substance'.",
        "content": "",
        "upvotes": 334,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1VsB9RaEvj3cZN61AGZ22jlh663cAW0psTitQKZQKUI.jpg?auto=webp&amp;s=b42b6e9497aeb928eb7026968c6c82795f57a74a"
        },
        "permalink": "/r/movies/comments/1kposxl/jennifer_lawrencerobert_pattinson_drama_die_my/"
    },
    {
        "id": "1kpoqhv",
        "author": "BunyipPouch",
        "title": "Denis Villeneuve’s ‘Incendies’ Receiving 4K Restoration Re-Release in Several Markets Including Canada, Greece, Turkey, Portugal, and Japan",
        "content": "",
        "upvotes": 332,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6L81kH0wgqD1Lrrc4DrVueOUffTUSsjMAl4I70L1WDg.jpg?auto=webp&amp;s=2eb7023e40a8ee2027ab5fc1819c771deb2f4c47"
        },
        "permalink": "/r/movies/comments/1kpoqhv/denis_villeneuves_incendies_receiving_4k/"
    },
    {
        "id": "1kpqqzp",
        "author": "tired_and_aslep",
        "title": "What happened to Brad Bird?",
        "content": "Doing a rewatch of the MI series and Ghost Protocol once again reminded me how good he is. I find it sad that one okay-ish movie (Tomorrowland), which I enjoyed, slowed down his directing career, atleast in live action.   \nSame with Gore Verbinski, another director who I wish would direct more because I love all his movies!",
        "upvotes": 209,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1kpqqzp/what_happened_to_brad_bird/"
    },
    {
        "id": "1kpd12t",
        "author": "Educational_Carry_98",
        "title": "Reflecting on Bo Burnham's Inside",
        "content": "I remember that night very well actually. I was playing video games with my friends, but decided to relax before bed and threw on Netflix at around 1am, May 30th 2021. That's when I saw Bo Burnhams \"Inside\" on the front title screen, ready to  go. I thought, perfect, I loved Bo and I can't wait to zone out and hit the hay. \n\nHoly fuck was I not prepared for that Covid Special. I was sitting straight up and at attention the whole time like a pre-teen watching their first porno. I couldn't take my eyes off the screen if I wanted to. It was exactly the movie/special I needed to see a year into the pandemic. The emotion, progression, and cinematography were unreal. I went to work the next day and couldn't help myself from talking to every person about the show. They had to see it. \n\nAnd now almost 4 years layer to the day, this special takes me back to a time where the whole world was scared out of their mind. An entire younger generation was stuck in time because they couldn't develop socially. \n\nAll I know is, if someone in the far and distant future asks me how the 2020 pandemic was to me, I'll send them a link to Inside by Bo Burnham. ",
        "upvotes": 2062,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1kpd12t/reflecting_on_bo_burnhams_inside/"
    },
    {
        "id": "1kpv2qs",
        "author": "arashtp",
        "title": "Christopher McQuarrie is credited on 8 films since 2014. All 8 are with Tom Cruise: Edge of Tomorrow, MI5, Jack Reacher 2, The Mummy, MI6, Top Gun 2, MI7, MI8",
        "content": "| Title | Year | Dom | WW | RT | IMDb | MC | Director(s) | Writer(s) | Producer(s) | Actor |\n|-------|------|---------------------|-----------------------|------------------|------|-------------|--------------|------------|--------------|-------------|\n| *Public Access* | 1993 | N/A | N/A | N/A | N/A | N/A | Bryan Singer | Christopher McQuarrie | N/A | Ron Marquette |\n| *The Usual Suspects* | 1995 | $23.3M | $34.4M | 88% | 8.5 | 77 | Bryan Singer | Christopher McQuarrie | N/A | Kevin Spacey |\n| *The Way of the Gun* | 2000 | $5.9M | $13.1M | 45% | 6.6 | 49 | Christopher McQuarrie | Christopher McQuarrie | N/A | Ryan Phillippe |\n| *Valkyrie* | 2008 | $83.1M | $200.3M | 62% | 7.1 | 56 | Bryan Singer | C. McQuarrie, N. Alexander | B. Singer, C. McQuarrie | Tom Cruise |\n| *The Tourist* | 2010 | $67.6M | $278.3M | 20% | 6.0 | 37 | F.H. von Donnersmarck | C. McQuarrie, J. Fellowes, F.H. von Donnersmarck | N/A | Johnny Depp |\n| *Jack Reacher* | 2012 | $80.1M | $218.3M | 63% | 7.0 | 50 | Christopher McQuarrie | Christopher McQuarrie | T. Cruise, D. Granger, P. Wagner | Tom Cruise |\n| *Jack the Giant Slayer* | 2013 | $65.2M | $197.7M | 52% | 6.2 | 51 | Bryan Singer | D. Lemke, C. McQuarrie, D. Studney | N/A | Nicholas Hoult |\n| *Edge of Tomorrow* | 2014 | $100.2M | $370.5M | 91% | 7.9 | 71 | Doug Liman | C. McQuarrie, J. &amp; J-H Butterworth | E. Stoff, T. Lassally, J. Silver | Tom Cruise |\n| *Mission: Impossible – Rogue Nation* | 2015 | $195.0M | $682.7M | 94% | 7.4 | 75 | Christopher McQuarrie | Christopher McQuarrie | T. Cruise, J.J. Abrams, B. Burk | Tom Cruise |\n| *Jack Reacher: Never Go Back* | 2016 | $58.7M | $162.1M | 38% | 6.1 | 47 | Edward Zwick | R. Wenk, E. Zwick, M. Herskovitz | T. Cruise, D. Granger, C. McQuarrie | Tom Cruise |\n| *The Mummy* | 2017 | $80.1M | $409.2M | 16% | 5.4 | 34 | Alex Kurtzman | D. Koepp, C. McQuarrie, D. Kussman | A. Kurtzman, C. Morgan, S. Daniel | Tom Cruise |\n| *Mission: Impossible – Fallout* | 2018 | $220.2M | $791.1M | 97% | 7.7 | 86 | Christopher McQuarrie | Christopher McQuarrie | T. Cruise, J.J. Abrams, C. McQuarrie | Tom Cruise |\n| *Top Gun: Maverick* | 2022 | $718.7M | $1.496B | 96% | 8.3 | 78 | Joseph Kosinski | E. Kruger, E.W. Singer, C. McQuarrie | J. Bruckheimer, T. Cruise, C. McQuarrie | Tom Cruise |\n| *Mission: Impossible – Dead Reckoning Part One* | 2023 | $172.1M | $567.5M | 96% | 7.8 | 81 | Christopher McQuarrie | C. McQuarrie, E. Jendresen | T. Cruise, C. McQuarrie | Tom Cruise |\n| *Mission: Impossible – The Final Reckoning* | 2025 | TBD | TBD | TBD | TBD | TBD | Christopher McQuarrie | C. McQuarrie, E. Jendresen | T. Cruise, C. McQuarrie | Tom Cruise |",
        "upvotes": 100,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1kpv2qs/christopher_mcquarrie_is_credited_on_8_films/"
    },
    {
        "id": "1kq0d2r",
        "author": "bynapkinart",
        "title": "What is your favorite peak 90’s action film?",
        "content": "Thinking like classic Don Simpson/Jerry Bruckheimer films…personally The Rock always rises to the top, but Crimson Tide and Speed are also in heavy rotation when I’m feeling this genre. Something about the pacing, camera movement, tight storytelling and a pretty consistent rotation of actors always makes this era and genre of movie stand out to me, with the benefit of hindsight.\n\nNo they’re not particularly smart or compelling in the traditional film sense, but in an age where everything is franchised it’s interesting to look back to an era when popcorn movies were original and stood alone. What are your favorite films from this era and genre?\n\nEdit: oh man, the problem with writing this kind of post sparked by watching one movie (The Rock in this case) is you forget all the other great movies in the genre. Just a quick edit on my Mount Rushmore of 90s films it has to be Fifth Element, T2, The Rock, and Speed. But also love all these others in the comments!",
        "upvotes": 44,
        "comments": 174,
        "media": null,
        "permalink": "/r/movies/comments/1kq0d2r/what_is_your_favorite_peak_90s_action_film/"
    },
    {
        "id": "1kpo8gf",
        "author": "OBrian_176",
        "title": "Movies To Watch While Feeling Hopeless &amp; Struggling With Depression?",
        "content": "I'm looking for movie reccomendations to watch that are ideal to watch when feeling down, not neccesarily a comedy movie but a life-affirming movie that will make an impact on me. Movies similar to The Way Way Back maybe?\n\nAre there any films you’d suggest or that have helped you get out of a rut? Thanks in advance. ",
        "upvotes": 218,
        "comments": 445,
        "media": null,
        "permalink": "/r/movies/comments/1kpo8gf/movies_to_watch_while_feeling_hopeless_struggling/"
    },
    {
        "id": "1kplkx2",
        "author": "indiewire",
        "title": "Kristen Stewart’s First Feature ‘The Chronology of Water’ Felt So Good, She Says, She’ll Direct Again (Interview)",
        "content": "",
        "upvotes": 258,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s9MiQ_mHcv6FmkwwiVqUGZjUlcZle7Pqu_uBDLWZFfo.jpg?auto=webp&amp;s=3078a25d26446b9a9e92852d71bff241f35e648f"
        },
        "permalink": "/r/movies/comments/1kplkx2/kristen_stewarts_first_feature_the_chronology_of/"
    },
    {
        "id": "1kpk13k",
        "author": "Odd_Advance_6438",
        "title": "I think I’ve finally accepted that I’m a Southland tales defender, even if I don’t fully understand it",
        "content": "",
        "upvotes": 328,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ctWDiQ74PInlhkLVzJVcnEGCOHHsQcUixTE_w0jLLHM.jpg?auto=webp&amp;s=419a5aed131329632a96b6ca5624b314c8a33bab"
        },
        "permalink": "/r/movies/comments/1kpk13k/i_think_ive_finally_accepted_that_im_a_southland/"
    },
    {
        "id": "1kq2o0z",
        "author": "VoldemortPoutin",
        "title": "What are some movies like Encino Man or The Visitors(Les Visiteurs) where people from olden times accidentally arrive in the modern world?",
        "content": "Les Visiteurs was worth watching, exploring a new idea. Though it does not have a very high rating it was a good watch. I would like to watch some more like this. Also, I haven't watched Encino Man yet but it seems interesting, exploring the same idea of a person with no knowledge of the modern world navigating through it. ",
        "upvotes": 16,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1kq2o0z/what_are_some_movies_like_encino_man_or_the/"
    },
    {
        "id": "1kpjnv6",
        "author": "KillerCroc1234567",
        "title": "Andrew Garfield &amp; Focus Features Nearing Deals To Join Paul Greengrass Peasant Revolt Movie ‘The Rage’: Cannes Market",
        "content": "",
        "upvotes": 163,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FaEgLfN91Ch62pwoRL2W3xl5Uo-tsJsnQAusFhTg1p4.jpg?auto=webp&amp;s=e9f3bc01b947a7699c9185067309acf52f3e73fa"
        },
        "permalink": "/r/movies/comments/1kpjnv6/andrew_garfield_focus_features_nearing_deals_to/"
    },
    {
        "id": "1kphq4z",
        "author": "rdtismyadctn",
        "title": "'Thief' by Michael Mann was absolutely awesome! Gimme more hidden diamonds like this.",
        "content": "What a phenomenal film. Came out in 1981 and I only saw it last night. Hooked from first scene, to the end of credits (watched the creds for the awesome music). \n\nAwesome performance by Caan and Porksky. Everyone else was awesome too. Sharp writing. Spectacular performances. I had tough time deciding should I mark it as 8 or 9 on IMDB. \n\nRecommend me more amazing, hidden gems of movies. Any genre, doesn't matter, just want absolute peak cinema.\n\nAnd those of you who haven't seen Thief yet, and enjoy heist, crime capers or noir, this one needs to be high on your must watch list. Thanks all!\n\nETA: Thanks for the great recommendations, keep them coming. Apologies if I'm not able to respond to all comments, but you've all come through on my ask and for that I wish you all good fortune and good times at the movies :)",
        "upvotes": 178,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1kphq4z/thief_by_michael_mann_was_absolutely_awesome/"
    },
    {
        "id": "1kq0dgj",
        "author": "Darmin",
        "title": "Movie similar to brightburn",
        "content": "Someone posted a gif, either on this sub or r/horror from a movie where a character is floating above people and waving/pointing at people and they're turning to ash. \n\nI remember in the thread people had said it was a good \"if superman was evil\"\n\nThe character that turns people to ash, only just got powers, and just last night/day was able to lift something small with their mind. \n\nIt was live action, it isn't watchmen or the boys. I put chronicle on at 2x speed and skipped around a lot and it didn't have the scene. \n\nU/SignificantDetail28\n\nSolved it. It's thunderbolts\n\nThe context I saw the gif in was something along the lines of \"superhero horror movies\" and the gif that was posted was just of void dusting people. I wouldn't have thought it was an MCU movie. ",
        "upvotes": 12,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1kq0dgj/movie_similar_to_brightburn/"
    },
    {
        "id": "1kpon38",
        "author": "Serious_Statement702",
        "title": "Movies for 5.1 sound system?",
        "content": "So I just installed sony's 5.1 surround sound system and very excited to try it out. I want to get the best experience possible. What movie should i go for? I have Netflix subscription. But open to other recommendations as well (not bound by netflix only). Any help would be great. \nLanguage: preferably english",
        "upvotes": 56,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1kpon38/movies_for_51_sound_system/"
    },
    {
        "id": "1kpbwoe",
        "author": "Appropriate_Arm_1339",
        "title": "Which movie series has the worst naming conventions?",
        "content": "From the humble number, to the subtitle, to something a little more creative, what to name different movies in a series is a question that, to this day, nobody has seemed to figure out. Either due to being vague, confusing, or just plain bad, which movie series has the worst naming conventions?\n\nMy personal pick is probably the predator series for: predator, predator 2, predators, the predator, and prey because it would be hard to make a more confusing order if you tried.",
        "upvotes": 426,
        "comments": 412,
        "media": null,
        "permalink": "/r/movies/comments/1kpbwoe/which_movie_series_has_the_worst_naming/"
    },
    {
        "id": "1kopb6s",
        "author": "ErgoNonSim",
        "title": "Cannes reactions to Irreversible",
        "content": "",
        "upvotes": 23147,
        "comments": 3369,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ft9ij3u2eb1f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kopb6s/cannes_reactions_to_irreversible/"
    },
    {
        "id": "1kpropq",
        "author": "dismal-icious",
        "title": "Movies like “Super Dark Times” and “On the Count of Three” with female leads?",
        "content": "Pretty much just the title! I love dark movies that deal with themes about mortality and friendship, and how different people react to different traumas and cope with their own internal struggles. I’ve been struggling to find movies like these that have a predominantly female cast. Language doesn’t matter to me! ",
        "upvotes": 29,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1kpropq/movies_like_super_dark_times_and_on_the_count_of/"
    },
    {
        "id": "1kp2vrv",
        "author": "lardparty",
        "title": "What 'big' movies of the last decade flopped but are actually pretty awesome in hind sight?",
        "content": "I'm looking for blockbuster type movies that have big production values but failed in the BO\n\nLike The Mummy (2017) or Annihilation (2018) for example (I haven't seen them but I could see myself enjoying them if they aren't just total garbage)\n\nLooking for similar movies that I could watch for a fun 'big' movie experience at home. \n\n",
        "upvotes": 1590,
        "comments": 1366,
        "media": null,
        "permalink": "/r/movies/comments/1kp2vrv/what_big_movies_of_the_last_decade_flopped_but/"
    },
    {
        "id": "1kpzx6m",
        "author": "peachdads",
        "title": "movies about friendship breakups",
        "content": "currently trying to deal with my friendship of 12 years coming to an end. i always see movies about romantic relationships ending but i’d really love some about losing friends. honestly the sadder the better. if it doesn’t have a happy ending i would LOVE that but of course i can’t be too picky so i’ll take anything. thank you in advance &lt;3",
        "upvotes": 5,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1kpzx6m/movies_about_friendship_breakups/"
    }
]