[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 511,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k72ro9",
        "author": "TCACampbell",
        "title": "Unable to use certain profiles",
        "content": "Hi, i’m currently trying to use my profile but any time I use it or my friends on the same account they cause netflix to bring up the error code tvq-st-149. \nOther profiles on the account don’t cause this. just these two. Both accounts were working fine earlier and I am trying to access them from the netflix household. Signing out and i’m in again/ reloading seems to have no effect. any help is appreciated.",
        "upvotes": 59,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1k72ro9/unable_to_use_certain_profiles/"
    },
    {
        "id": "1k6xlxi",
        "author": "ToonAdventure",
        "title": "LOVE DEATH + ROBOTS VOLUME 4 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 46,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k6xlxi/love_death_robots_volume_4_official_trailer/"
    },
    {
        "id": "1k6zj5x",
        "author": "PressureForsaken7147",
        "title": "Netflix household sucks",
        "content": "I know this isn’t new, but I still want to share my thoughts on Netflix’s household policy.\n\nJust because a family doesn’t live under the same roof doesn’t mean they’re not family. In today’s world, it’s normal for siblings or parents to live in different cities. We still stay connected, so why can’t we share a Netflix account — especially when we’re already paying for one with multiple profiles?\n\nNetflix used to be okay with sharing. They even encouraged it back in the day. And now they’re changing the rules just to make more money. It doesn’t feel fair.\n\nWhat’s more annoying is that even though this policy started a while ago, I was still able to use Netflix on my laptop — just not on the mobile app. But today I got a notification on my laptop saying I can’t use it anymore either. So that’s it, I guess. One more reason to unsubscribe.",
        "upvotes": 21,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k6zj5x/netflix_household_sucks/"
    },
    {
        "id": "1k6p399",
        "author": "theipaper",
        "title": "Fans deserve better than You's insulting final season",
        "content": "",
        "upvotes": 70,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1k6p399/fans_deserve_better_than_yous_insulting_final/"
    },
    {
        "id": "1k71jeq",
        "author": "ChewysCorner",
        "title": "Can anyone help with an issue on the Netflix SkyTV app?",
        "content": "It keeps displaying the error tvq-st-149 and getting stuck in an error loop. I've tried pressing the reset option, sign out and restart and can occasionally get to the profile section but then get sent back to the error screen again. It's working on my phone so I don't think it's an account issue. Any help would be great thanks!",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1k71jeq/can_anyone_help_with_an_issue_on_the_netflix/"
    },
    {
        "id": "1k756h7",
        "author": "PalmTrees_City",
        "title": "Show question",
        "content": "Hey everyone, I’m curious.. Has anybody watched the show called ‘’You’’ apparently it was trending for like 14 weeks and I started watching it and it’s pretty psycho and weird but interesting?? I ended up loving it and I’m still watching it. Any thoughts?? ",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1k756h7/show_question/"
    },
    {
        "id": "1k6c43k",
        "author": "indiewire",
        "title": "Netflix Co-CEO Says They’re Not in China Because ‘Not a Single Episode’ Cleared the Censorship Board",
        "content": "",
        "upvotes": 351,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1k6c43k/netflix_coceo_says_theyre_not_in_china_because/"
    },
    {
        "id": "1k6vgsp",
        "author": "IGleeker",
        "title": "Million dollar secret episode 3",
        "content": "I’m watching this new reality/game show and something is irritating me. Why are the others acting like Lauren is such a devil for lying on a show MADE for deception. Of course she’d lie??! Why would she tell you she’s the millionaire. Idky Jaimi and Sydney are acting so high and mighty as if they’d tell the truth if they had the million dollars. 😒",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1k6vgsp/million_dollar_secret_episode_3/"
    },
    {
        "id": "1k786bv",
        "author": "Luminous-Mari24",
        "title": "Netflix logs me out of entire account when opening certain profile",
        "content": "I have 5 profiles on my netflix account, and 4 of them work. However, when I open a specific profile on my phone, it completely signs me out of the account. As for the TV, after clicking the profile I got stuck in a loop of error screens every time I open the app. \n\nHow do I solve this?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k786bv/netflix_logs_me_out_of_entire_account_when/"
    },
    {
        "id": "1k6yw3n",
        "author": "Texas_Monthly",
        "title": "The Creators of ‘Ransom Canyon’ Set Their Show in the Texas Hill Country. Have They Been?",
        "content": "The new Netflix soap is *Yellowstone* lite, but Taylor Sheridan would never have gotten Texas geography so wrong. Read: [https://www.texasmonthly.com/arts-entertainment/ransom-canyon-netflix/?utm\\_source=reddit&amp;utm\\_medium=webcta&amp;utm\\_campaign=tm-free&amp;gift\\_code=OTM5MTMzOzg4OTMyZDY5LWVlNTgtNGVkYi04ZDI0LTE1MmJhYjg5MjBiMDsyMDI1MDQyNA==](https://www.texasmonthly.com/arts-entertainment/ransom-canyon-netflix/?utm_source=reddit&amp;utm_medium=webcta&amp;utm_campaign=tm-free&amp;gift_code=OTM5MTMzOzg4OTMyZDY5LWVlNTgtNGVkYi04ZDI0LTE1MmJhYjg5MjBiMDsyMDI1MDQyNA==)",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k6yw3n/the_creators_of_ransom_canyon_set_their_show_in/"
    },
    {
        "id": "1k6k1i2",
        "author": "FalconLeading",
        "title": "Animal abuse in Million Dollar Secret episode 3",
        "content": "I don't know how many of you watched this game show, but I'm on episode 3 and the use of live exotic animals is very disturbing to me.\n\nThe scene begins with each animal trapped under a cloche, those silver-dome things that cover plates. \n\nThe animals are frogs, hedgehogs, snakes, cockroaches, rats. \n\nAnyone whose worked on a film production knows behind the scenes things are extremely slow. Who knows how long those animals were there. \n\nThe contestants are then asked to transport these animals to \"terrariums\" that are basically glass boxes with a thin screen for ventilation on top. It's visible that these boxes are receiving direct sunlight and temperatures must be very high inside.\n\nYou can tell the floor of the boxes are not grass but also glass or transparent plastic. Regardless, that means that if those boxes have been in the sun it's likely that the floors were extremely hot. Once again, who knows how long they remained in those hot boxes. \n\nIt could have been cut, but it doesn't appear that any of the contestants have recieved orientation on how to handle these animals. The show is relying on the contestants fear of the animals for dramatic effect and these aren't domesticated animals, at any time they could jump out from their hands and drop to the floor. \n\nI was actually enjoying this dumb show but I just find extremely distasteful to use non-domesticated animals as \"props\" in conditions that are clearly unhealthy. ",
        "upvotes": 39,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1k6k1i2/animal_abuse_in_million_dollar_secret_episode_3/"
    },
    {
        "id": "1k788zz",
        "author": "CockGobblin",
        "title": "Ad that says there won't be any pre-show ads... followed by a 30s pre-show ad?",
        "content": "Has this happened to anyone else?  I thought it was hilarious.\n\nYou get a 6 second ad that says something like \"No pre-show ads brought to you by ____\" and then they show a 30 second ad from that same company before the show...  In this case, both ads were from Audible.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k788zz/ad_that_says_there_wont_be_any_preshow_ads/"
    },
    {
        "id": "1k725o3",
        "author": "Lightbearer2002",
        "title": "Not sure what to watch?",
        "content": "I’ve just finished watching cobra Kai and I’ve been wanting to watch something new but something that has a lot of series, I was tempted to go back to Riverdale just for how long it is but I’m not sure, any suggestions would be appreciated.",
        "upvotes": 2,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k725o3/not_sure_what_to_watch/"
    },
    {
        "id": "1k6n9ze",
        "author": "FairLingus",
        "title": "Don’t Look Up -&gt; Current Presidency",
        "content": "First watched don’t look up when it released end of 2021. Even then it was an exaggeration of events. \n\nHowever, now with the current situation and Musk’s involvement in the White House, Mark Rylance’s character (Peter Isherwell) has even more of a similarity.\n\nJust a general observation, that’s all!",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k6n9ze/dont_look_up_current_presidency/"
    },
    {
        "id": "1k75pqt",
        "author": "LouisTully9000",
        "title": "Down Goes the Brawler: Gareth Evans’ Havoc Fumbles Into the Void",
        "content": "By the time Havoc limps to its joyless, bullet-infused conclusion, it becomes clear that something curious; if not outright tragic; has happened to Gareth Evans. Once revered as one of the most kinetic action filmmakers of his generation, Evans now seems adrift in the genre he helped revitalize. Havoc, his fifth feature and his second with Netflix, feels less like a film than a misguided obligation; one of those streaming-era curios that exist more to fulfill contractual quotas than to entertain, provoke, or even merely impress.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k75pqt/down_goes_the_brawler_gareth_evans_havoc_fumbles/"
    },
    {
        "id": "1k6rc34",
        "author": "Legitimate_Ad3625",
        "title": "'The Age Of Innocence' Limited Series Adaptation Greenlit By Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6rc34/the_age_of_innocence_limited_series_adaptation/"
    },
    {
        "id": "1k752kx",
        "author": "Prof_Palaeo",
        "title": "My profile suddenly breaks the app (PS5)",
        "content": "EDIT - Leaving this in case anyone else finds this issue, i got it working again. Looked on my phone again and for some reason my fiancés name had been added to my profile so they both had the same name. When I went to edit on my phone it immediately showed that I can’t have the same name as my fiancé, which made me suspect this was the problem. Changed it back to my name, reloaded the app on PS5 and now no issues. Very odd, very relieved I’m not losing my algorithm!\n\nBit of a random one but up until this evening there have been no issues, but when I went to watch something this evening I get stuck on an error screen with tqv-st-149 showing. I have to delete the app, re-download and sign back in to get it off this screen. \n\nThe odd thing is this is only happening on my profile. My finances profile works fine (just watched a movie on their profile on the PS5) but when I try to switch to my profile it breaks all of a sudden. No issues outside of this in the past. Anyone have any clue what might be going on? For reference I can access my profile fine on my IPhone",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k752kx/my_profile_suddenly_breaks_the_app_ps5/"
    },
    {
        "id": "1k74xmb",
        "author": "starkz22",
        "title": "won’t let me load onto my account but will let me onto others?",
        "content": "i share a netflix account with my family and we all have our separate profiles, wherever i click onto mine it says “cannot connect to netflix” and kicks me off the app. But, if i were to click on another profile it works completely fine. What should i do?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k74xmb/wont_let_me_load_onto_my_account_but_will_let_me/"
    },
    {
        "id": "1k74oq0",
        "author": "AssExpress420",
        "title": "How do I update my household if I don't have a TV?",
        "content": "Hello everyone.\n\nSo I'm just trying to netflix and chill, but it keeps telling me that my PC is not part of my household? How do I fix this? I don't own a TV, but I did logg on to my girlfriends TV once. I have removed all connected devices and it still doesn't work.\n\nAny tips on how to fix this?\n\nThanks in advance",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k74oq0/how_do_i_update_my_household_if_i_dont_have_a_tv/"
    },
    {
        "id": "1k6n4cq",
        "author": "Sweaty-Toe-6211",
        "title": "David Harbour Thought His ‘Stranger Things’ Character Should Have Died by the End of Season 1",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k6n4cq/david_harbour_thought_his_stranger_things/"
    },
    {
        "id": "1k6xxcy",
        "author": "filipinaspice",
        "title": "Rating for each episode",
        "content": "I’m not sure if I’m emotionally prepared for season 7 of BlackMirror, but I’ve been invested since the beginning!! This show in general is a comfort even though it’s so creepy at the same time lol. My rating for each episode would be in the end\n\nEpisode 1: “Common people”\n3.7/5 - It was a beautiful episode but I didn’t feel a personal connection with the characters. They were both strongly in love with each other, but you can see the desperation within their sufferings as time progressed. The tactics for the health care system truly shows how bad social influences can cause breaking points for people &amp; how far they’re willing to go in order to make ends meet. \n\nOverall this episode was a prime example of the twisted tales &amp; anthology that reveals humanity’s worst traits within greatest innovation. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6xxcy/rating_for_each_episode/"
    },
    {
        "id": "1k733sd",
        "author": "omnixe-13c",
        "title": "Netflix is becoming impossible to use",
        "content": "I never had issues with Netflix until they went to the two factor authentication. I travel often and used to be able to text myself a code, not its email. As of today, I can’t sign into any devices other than my tablet. I keep getting a notification that the devices have been inactivated but we didn’t change anything. \n\nThere doesn’t seem to be a fix and the subscription isn’t worth it if it’s only available sometimes. \n\nAnyone else feeling the frustration?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k733sd/netflix_is_becoming_impossible_to_use/"
    },
    {
        "id": "1k71q2m",
        "author": "1913waspeakhumanity",
        "title": "Has anyone else seen Hunyadi?",
        "content": "There is a new series, called Hunyadi, which only has english subtitles but, it is top 1 in my country. Watched the first 3 episodds already and it looks pretty high quality. Anybody watched it before?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k71q2m/has_anyone_else_seen_hunyadi/"
    },
    {
        "id": "1k76eoh",
        "author": "RedditUser_130",
        "title": "Can someone please help me I am still fairly new to Netflix",
        "content": "So I bought a subscription a while ago which has now ran out. I payed for my subscription using a Netflix gift card. I have just gotten onto Netflix and I’ve tried to pay for another subscription because I have credit left over from the gift card and it’s saying to fix my payment method first and then it says for me to add a payment method. Does this mean I can’t use the credit I have left over to pay for another subscription ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k76eoh/can_someone_please_help_me_i_am_still_fairly_new/"
    },
    {
        "id": "1k64esn",
        "author": "misterpopculture",
        "title": "First Look at Charlize Theron in THE OLD GUARD 2 premiering on Netflix July 2.",
        "content": "",
        "upvotes": 113,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1k64esn/first_look_at_charlize_theron_in_the_old_guard_2/"
    },
    {
        "id": "1k65hu3",
        "author": "Whisky118228",
        "title": "IHOSTAGE IS WORST MOVIE BY NETFLIX.",
        "content": "No thriller in the name of thriller movie.\nNo tense, No Action, No side story of Amaar. \nIdc if it's real story it's just waste. I don't know why it's trending #2. Just wasted 2hrs and typing here. Beleive me don't waste your precious time.",
        "upvotes": 73,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1k65hu3/ihostage_is_worst_movie_by_netflix/"
    },
    {
        "id": "1k6np4a",
        "author": "Environmental-Bug300",
        "title": "You disappearing from my list",
        "content": "So I was watching You season 5 and once I finished episode 2 the pop up that only shows when you finish a movie/series shows up, it wouldn’t let me move on to the next episode, and when I went back to the episode list all the episodes disappeared and it just has a “remind me” pop up, I’m really confused as to what’s going on and this has been happening a lot to shows I’ve been watching. It also disappeared from my list and I can’t find it when I search anymore",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k6np4a/you_disappearing_from_my_list/"
    },
    {
        "id": "1k6wt08",
        "author": "b-radw",
        "title": "Is chrome cast not compatible anymore?",
        "content": "My chrome cast works with every other device and streaming service I use, but it just doesn’t show up with Netflix. I was chatting with Netflix support for an hour and they gave up, asking me to send a screen recording of my issue and said they will use it for their own research without any timeline for a resolution. \n\nAnyways, I’m on iPhone, everything is on the same network, all updated firmwares, reset everything. It used to work, hasn’t for about a year, maybe 2 ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6wt08/is_chrome_cast_not_compatible_anymore/"
    },
    {
        "id": "1k6cdz4",
        "author": "Designer-Ad5042",
        "title": "Oklahoma City Bombing: American Terror should have been a series!",
        "content": "I watched the documentary today, it's just over an hour and admittedly is a good summary for people who don't know much about the bombing, like me (I was 14 when it happened). But after doing more reading it barely scratched the surface. Wish it had been a series, or even a scripted series like Manhunt: Unabomber.",
        "upvotes": 25,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k6cdz4/oklahoma_city_bombing_american_terror_should_have/"
    },
    {
        "id": "1k686tb",
        "author": "TimesandSundayTimes",
        "title": "Use subtitles watching Adolescence, Netflix boss tells Americans",
        "content": "",
        "upvotes": 40,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k686tb/use_subtitles_watching_adolescence_netflix_boss/"
    }
]