[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iwazcd",
        "author": "feudingfandancers",
        "title": "Price rise is ridiculous (UK)",
        "content": "I’m guessing they just think people will roll over and take it but I’m cancelling my subscription that I’ve had continuously for many years. \n\nNetflix is the one streaming service I’ve kept each month because I felt it was worth it, but a £2 rise is ridiculous. So instead of my £11 (already most expensive sub) each month, I’ll probably use it a few times a year now. ITV now has loads of comedies (which is what I use Netflix for the most) and is much cheaper. \n\n\nI hope others will also cancel and it will affect their profits. \n",
        "upvotes": 33,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1iwazcd/price_rise_is_ridiculous_uk/"
    },
    {
        "id": "1ivwhz3",
        "author": "NostalgicRetro73",
        "title": "There’s something in Worst Roommate Ever that I already knew but people still do…",
        "content": "That is find roommates on Craigslist. Are you out of your damn minds?  That place is a big ol nest of evil people.  So much so, Netflix should do a show just on the cases about everything evil on Craigslist. ",
        "upvotes": 48,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ivwhz3/theres_something_in_worst_roommate_ever_that_i/"
    },
    {
        "id": "1iw7uxb",
        "author": "Agreeable_Iron4560",
        "title": "Where is the Home from Cassandra?",
        "content": "I’m trying to find the location of the home featured in the Netflix series Cassandra. Based on what I’ve seen, it looks like a modern 1970s home, with a style that reminds me of American architecture from that era. I’ve come across some information suggesting that this house could be located in the Cologne area in Germany, but I’m not sure if that’s accurate. The design of the house, with its clean lines and spacious feel, is definitely very reminiscent of mid-century modern homes found in the United States. I’m really curious if anyone knows the exact location of this home or has more details on where it was filmed. Is it a real house or just a set built for the show? If anyone has any insights or further information about the home, I’d love to hear from you. Thanks in advance for your help!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iw7uxb/where_is_the_home_from_cassandra/"
    },
    {
        "id": "1ivxs8m",
        "author": "Greenfrog2023",
        "title": "Sweet Magnolias",
        "content": "I find the characters in this show insufferable now (especially Dana Sue) and its becoming harder to get through each new season... Is it just me or is this show boring? I just needed to get this off my chest.... 🤣",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ivxs8m/sweet_magnolias/"
    },
    {
        "id": "1iw74n9",
        "author": "AstralKatOfficial",
        "title": "PIP not working despite it being enabled in my phone settings?",
        "content": "Im not on an ad supported plan so that isnt the issue. I have PIP enabled in the settings of my phone but no matter what I do netflix will not go to PIP mode. It works perfectly fine with other streaming services but specificaply Netflix refuses to work and I have no idea why?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iw74n9/pip_not_working_despite_it_being_enabled_in_my/"
    },
    {
        "id": "1iwd6fy",
        "author": "stuwozere1",
        "title": "Totally unusable!!!",
        "content": "I have been a Netflix customer for the last 14 years and up until the last year I've been happy (although getting slightly annoyed at price). However, as a truck driver in the UK the app has increasingly become unusable with Netflix constantly locking me out. I use the temporary logins when I'm away from home but now Netflix say I'm in breach of T&amp;C's and have locked my account. I've tried to contact them and they just keep apologising but offering no solution but cancel my membership. \nEven if I try to set up again with a new email address, my IP address has been logged so will not allow sign in, again, all they can do is apologise. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwd6fy/totally_unusable/"
    },
    {
        "id": "1ivzfrf",
        "author": "Formfeeder",
        "title": "Aftermath 2024",
        "content": "This has to be one of the worst movies out on the platform.  The storyline is unbelievable, the acting is as ridiculous as the premise.  Blowing up the main supports on a bridge would put it in the water.  135 minutes I’ll never get back.  ",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ivzfrf/aftermath_2024/"
    },
    {
        "id": "1iwb32g",
        "author": "IntrepidPotential661",
        "title": "Sharing netflix premium",
        "content": "Hello,\n\nI haven’t used Netflix before, but I’m now planning to subscribe to Netflix Premium. However, my decision depends on the answer to the following question.\n\nThree of us would be using the same account on our laptops/phones, but since we are students, we are rarely at home on the same Wi-Fi, we live on different campuses. \n\nMy question is: in this case, can we share the profile without issues, or is this against Netflix’s rules, meaning we wouldn’t be able to use it together?\n\nNote: We wouldn’t be using it on a TV at home, only on our laptops.\n\nI looked for answer at help center, but no help. \n",
        "upvotes": 1,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1iwb32g/sharing_netflix_premium/"
    },
    {
        "id": "1iwaxwh",
        "author": "soy1usuri0",
        "title": "¿Opiniones de esta serie?",
        "content": "¿La han visto?",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/44o6smk5cwke1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iwaxwh/opiniones_de_esta_serie/"
    },
    {
        "id": "1iwaq9l",
        "author": "JbreezyReviews",
        "title": "Greatest Netflix Original Series?",
        "content": "Netflix got a crazy line up but what are yall favourite Netflix original series? Here’s my video on my top 5 ( I forgot You , I know my bad ) . But yeah what are yall top 5 series? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iwaq9l/greatest_netflix_original_series/"
    },
    {
        "id": "1ivko3t",
        "author": "S4v1r1enCh0r4k",
        "title": "Ben Affleck Reportedly ‘Thrilled’ to Star with Longtime Crush Gillian Anderson in New Netflix Thriller!",
        "content": "",
        "upvotes": 67,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ivko3t/ben_affleck_reportedly_thrilled_to_star_with/"
    },
    {
        "id": "1ivz4tn",
        "author": "sohaniadi",
        "title": "Zero Day - Sketch Poster &amp; Base Drawing",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivz4tn/zero_day_sketch_poster_base_drawing/"
    },
    {
        "id": "1iv2f9k",
        "author": "ellissabain",
        "title": "This is what the police officer who stopped Gabby Petito said after she was murdered",
        "content": "",
        "upvotes": 1288,
        "comments": 541,
        "media": null,
        "permalink": "/r/netflix/comments/1iv2f9k/this_is_what_the_police_officer_who_stopped_gabby/"
    },
    {
        "id": "1iw9htl",
        "author": "Inside-Afternoon4343",
        "title": "Valeria - anyone else find every single character insufferable?",
        "content": "I watched the first three seasons to freshen up my Spanish and actually liked them well enough, but the more the show progresses the more I‘m starting to dislike literally everyone. They can‘t communicate, they‘re very often bad friends, selfish, self-centred, making stupid mistakes that could‘ve been avoided if they‘d used their brains for just one second, they don‘t really grow at all, and they‘re just plain annoying and cringe. I know the „humor“ of the show is built entirely on this and the exaggeration of the character‘s flaws is used for comedic effect, but I feel like this show could‘ve been funny without this, too. I started watching the new season and not even half an episode in I was like, ok, I can‘t do this lmao. Valeria trying to seduce Bruno at the café and not letting him have his coffee? Cringe. Also the writer’s block trope is getting so old, I DONT CARE THAT SHE KEEPS HAVING WRITER’S BLOCK. ITS SO BORING. \n\nThen, Nerea being unnecessarily rude to that person at the apartment viewing. THAT WOMAN LIVES THERE AND CAN HEAR YOU. Not to mention that a lot of people couldn’t even afford to live there, and you’re walking around crinkling your nose bc it’s „dirty“. And then, being unable to communicate that she doesn‘t want to live alone but with her gf? Girl, you‘re a grown ass woman. Also her gf not picking up on the facial acrobatics during that scene?? Aren‘t you supposed to be a couple??? \n\nThen, Lola forgetting her (considerably younger) bf needed the flat for his work when he had told her about it, and then having the nerve to be annoyed. DUMP HER. \nAnd Carmen… oh, Carmen. Control freak of the century. \n\nIdk if this show is popular or not but am I alone in feeling like this???? They‘re the same annoying people they were at the beginning of the show and there‘s been zero character growth. Idk, I‘m sure there are other ways to build tension bc this is just not it for me",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iw9htl/valeria_anyone_else_find_every_single_character/"
    },
    {
        "id": "1iw645g",
        "author": "Scared_Cow9483",
        "title": "Chanelle McAuliffe - something’s not right ….",
        "content": "So I’ve watched a few interviews involving her, and I don’t believe her reasons for revealing/outing Belle are at all altruistic. \n\nI could be wrong but there is something about Chanelle that has always felt off, in every interview her body language just seems to …. It’s just, I don’t know - I think there is more there, I feel like something else or some other events happened that ended with her revealing Belle. \n\nI dunno, could be completely wrong, but my behavioural background is shooting up flags and I can’t put my finger on it…. But she certainly comes across completely insincere. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iw645g/chanelle_mcauliffe_somethings_not_right/"
    },
    {
        "id": "1ivgkx5",
        "author": "Legitimate_Ad3625",
        "title": "Pantheon Season 2 Is Finally Available to Watch Worldwide – Finds New Home on Netflix",
        "content": "",
        "upvotes": 38,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ivgkx5/pantheon_season_2_is_finally_available_to_watch/"
    },
    {
        "id": "1iw0xi2",
        "author": "Oniawyn",
        "title": "Language not working",
        "content": "Hey so I just got Netflix to watch Ninjago. But it only show in Norwegian language (dub/sub). While I want it to be English. All the other shows/cartoons on Netflix are in English. But only season 1 of Ninjago is in English and the rest of seasons are only in Norwegian.\nHow can I change it to English? My language settings are in English. \n\nFirst image of Season 1 Ninjago language settings\nSecond image Season 2+ Ninjago settings ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iw0xi2/language_not_working/"
    },
    {
        "id": "1iwanjs",
        "author": "Stony17",
        "title": "all streaming platforms content is painfully limited",
        "content": "since each production/network has their own paid streaming platforms the content on all of them is weak, i wouldve thought by now some of these services would have been bought out by one or two major players allowing for better selection but somehow most are still in existence even with mostly garbage content and few watchable titles. i feel Netflix has suffered the most in recent years",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iwanjs/all_streaming_platforms_content_is_painfully/"
    },
    {
        "id": "1ivx2gx",
        "author": "Bobitsababbyitsaboy",
        "title": "Title of Movie/Show",
        "content": "Definitely a shot in the dark here, I think it was a series of short stories . The one that sticks out is with a Rich father that has a daughter, daughter introduces her boyfriend to father who disagrees with the relationship. Father and boyfriend end up fighting and falls down some type of vent that teleports them to Hell like landscape(think some old guy invented the portal) where the father dies instantly and the boyfriend has to crank some machinery. Another man serves his term from the hellish place and returns to the real world to his wife . ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivx2gx/title_of_movieshow/"
    },
    {
        "id": "1ivoz6r",
        "author": "Somethingman_121224",
        "title": "'Karma' Webtoon to Air Live-Action Adaptation on Netflix This Year",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivoz6r/karma_webtoon_to_air_liveaction_adaptation_on/"
    },
    {
        "id": "1iwaprg",
        "author": "malayanchely",
        "title": "What If Netflix Had a Comment Section? 😂",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwaprg/what_if_netflix_had_a_comment_section/"
    },
    {
        "id": "1iw1fs0",
        "author": "Prestigious-Neat-625",
        "title": "'Zero Day' intro meaning?",
        "content": "This might mean literally nothing, but I noticed in zero day the intro goes from the text in black, then to white, however the \"Os\"/Holes in the text doesn't appear in Black ( the O, D, and A, in zero day had the the hole filled in black)\n\nIdk maybe it's nothing, but I have a feeling it means something I don't understand haha ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iw1fs0/zero_day_intro_meaning/"
    },
    {
        "id": "1ivcypa",
        "author": "Keven250",
        "title": "American Murder Series - I Found A Theme...",
        "content": "I just finished the new docuseries on Gabby Petito.\n\nWhat reminded me of the Watts story was that both men seemed to be totally enabled by their parents.\n\nWhereas the men obviously committed the crime, you get a sense that their parents are pretty terrible people who \"created\" a narcissist.\n\nI then thought of the Laci Peterson Netflix docu, where I was stunned to hear Scott's family still believes he's innocent and is trying to prove it after all these years!\n\nThere's a theme here, that explains how these guys thought they would get away with gruesome murder - they've presumably been getting away with everything their whole lives, without consequences...",
        "upvotes": 47,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ivcypa/american_murder_series_i_found_a_theme/"
    },
    {
        "id": "1iw15sn",
        "author": "lonestarbaddie",
        "title": "I really dislike Mo in Mo (2022)",
        "content": "I am currently finishing up season 2 of Mo. The show is great, and I love the storyline and relatability. But the main character Mo makes me mad!!! Have you ever seen a main character who keeps making bad choices no matter how many lessons they have to learn? I understand that is the way to keep the story going, but Mo makes his problems everyone else’s problem. He makes every situation about him and always has to be the center of attention. He is a 35+ man who acts like a child and has no growth during the show. I love this show so much but the main character is insufferable!! Did anyone else think this while watching it?",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1iw15sn/i_really_dislike_mo_in_mo_2022/"
    },
    {
        "id": "1iwbbxm",
        "author": "Plane-Cloud-5837",
        "title": "All the conspiracy theories about Gabby Petito and Brian Laundrie",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iwbbxm/all_the_conspiracy_theories_about_gabby_petito/"
    },
    {
        "id": "1iw950f",
        "author": "TheMirrorUS",
        "title": "Netflix fans already adding series dubbed 'Friday Night Lights meets Yellowstone' to their watchlist",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iw950f/netflix_fans_already_adding_series_dubbed_friday/"
    },
    {
        "id": "1iv4n3f",
        "author": "Seismic_Salami",
        "title": "Can we remove the games section? Or at least hide it?",
        "content": "I'm willing to bet over 99% of users don't gaf about the games section. It's just bs cash farm mobile games, nothing actually fun. Netflix is for movies and shows. If someone wants to play a bs mobile game, they'll play it on mobile. If someone wants to play a real game worth playing, they'll play it on Steam. No one wants this section. It's dumb af. Remove it or allow users to at least hide it. I'm considering just dropping netflix entirely at this point the way they've been going recently. This is like adding local weather to pr0nhub. makes no f\\*\\*\\*ing sense.\n\nedit:: everyone saying there's great games on there, but seriously all I can see are shitty mobile-esque games. there's only like 14 different games, same ones every time i log in. maybe because im in Canada?",
        "upvotes": 161,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1iv4n3f/can_we_remove_the_games_section_or_at_least_hide/"
    },
    {
        "id": "1iv8xbd",
        "author": "Artdiction",
        "title": "As a breast cancer survivor, watching belle gibson in apple cider vinegar makes me sick to my stomach, how can these people exist preying on vulnerable cancer patients during their lowest time?",
        "content": "I don’t believe in ALTERNATIVE therapy but many cancer patients who need hope and become prone to this snake oil type of salesman fall into these scammers, and nowadays there are so many famous wellness influencers who keep giving out advices without even a degree in medicine. It’s sickening. ",
        "upvotes": 67,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1iv8xbd/as_a_breast_cancer_survivor_watching_belle_gibson/"
    },
    {
        "id": "1ivy000",
        "author": "JenZen_2001",
        "title": "What’s going on?",
        "content": "So:\n\n- just come back from holiday from another country\n- Netflix worked fine during the next day I came back from holiday \n\nNow when I connect to wifi (in the UK) my Netflix just don’t show much, it ain’t showing me wwe or “lost” etc but when I’m in my mobile data it shows me all my regular stuff like it did before going on holiday\n\nWhat’s going on here?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivy000/whats_going_on/"
    },
    {
        "id": "1iwasgj",
        "author": "Echo_Drift",
        "title": "Netflix, you're on thin ice....",
        "content": "Why oh why do add shows like YELLOWSTONE and only post 4 seasons when there are 5 seasons. You must understand the disappointment this causes your users, right? So rude!\n\nYou also did this to me when you only posted 7 episodes of ALL CREATURES GREAT &amp; SMALL. \n\nIt makes me want to break up with you since I consider this behaviour abusive. Really.\n\n  \nI'm hoping others chime in and maybe then NETFLIX will pay attention. We're not gonna take this anymore.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iwasgj/netflix_youre_on_thin_ice/"
    }
]