[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1j42omh",
        "author": "sagar-sugar",
        "title": "Terzo pacco consegnato e con contenuto rubato",
        "content": "Come da titolo è il terzo pacco che muovo a Torino (zona San Salvario) \n\n* **Bartolini** uno ricevuto  da Amazon a inizio dicembre: consegnato a tabaccheria punto di ritiro, rotto (aperto) e con dei post-it all'interno anziché delle cuffie (180eur, rimborsati da Amazon ma perso la promozione del prodotto) \n* **Poste** Uno spedito da Torino tramite Poste a gennaio: contenente un power bank e un telefono (200eur) mai arrivato e tornato al mittente divelto e vuoto dopo settimane. Impossibile fare reclamo e ricevere assitenza\n* **UPS** Uno ricevuto da e-commerce oggi, telefono (450eur) pacco intonso ma vuoto. Ho chiesto al corriere di restare mentre aprivo il pacco ma si è girato ed è corso via, il tempo di aprirlo ed era vuoto anche questo \n\nSta succedendo solo a me? Avete qualche suggerimento su come posso fare per tutelarmi un minimo visto che anche facendo i reclami  non posso comprare più nulla online perché qulasiasi ordine mi viene rubato?",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1j42omh/terzo_pacco_consegnato_e_con_contenuto_rubato/"
    },
    {
        "id": "1j43y4x",
        "author": "justAChair__",
        "title": "Noleggio Auto a Torino per 3 settimane",
        "content": "Ciao! avete consigli su dove io possa affittare un'auto a prezzi più contenuti possibili? avremo ospiti a breve e dovremo spostarti in 5 per la città e zone limitrofe, vorrei davvero spendere il meno possibile, si tratta di andare a venaria o posti vicini, che potrebbero non essere coperti da servizi come enjoy o simili, grazie!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j43y4x/noleggio_auto_a_torino_per_3_settimane/"
    },
    {
        "id": "1j3zxhn",
        "author": "Bulky_Bison_9822",
        "title": "Acqua potabile",
        "content": "Sondaggio\n\nAvete idea se l’acqua che esce dal vostro rubinetto è buona? E nel caso in cui voleste avere la certezza sareste disposti a spendere soldi (più di 60€) per fare un controllo in un laboratorio? Vi basterebbe sapere che l’acqua che arriva nel vostro condominio è buona? \n",
        "upvotes": 2,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1j3zxhn/acqua_potabile/"
    },
    {
        "id": "1j3ze0v",
        "author": "jj_supermarket",
        "title": "bici a porta susa",
        "content": "Qual'è il posto più sicuro per lasciare una bici alla stazione di porta susa un pomeriggio?  \n(bici da città non elettrica, non particolarmente figa)\n\nPerdonate la paranoia ma la uso per andare a lavoro, preferirei ritrovarla :)\n\nEdit: l'idea è lasciarla lato corso Inghilterra vicino a qualche negozio/locale un po' trafficato",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1j3ze0v/bici_a_porta_susa/"
    },
    {
        "id": "1j40qth",
        "author": "CorvoPazzo02",
        "title": "Serata zona santa Giulia",
        "content": "Ciao a tutti! Faccio una cena con degli amici(una ventina)  in zona santa Giulia di venerdì sera, poi volevo spostare il gruppo a bere qualcosa  in un locale in zona. Essendo che tipografia e la piazza sarà pienissima (pure le panche immagino ) , sapete  qualche  locale in quella zona che mi renda il compito logisticamente meno difficile ? (Scusate ma non sono di Torino). Grazie in anticipo. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j40qth/serata_zona_santa_giulia/"
    },
    {
        "id": "1j3weg9",
        "author": "stalkingheads",
        "title": "Visiting late September",
        "content": "Hello specialists, thank you for reading. I’m traveling to northern Italy in late September for a cooking workshop that is located in Torino and Piemonte and I’m wondering what restaurants I would be absolutely foolish to miss?? Thank you! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j3weg9/visiting_late_september/"
    },
    {
        "id": "1j39xnh",
        "author": "SteamPaz",
        "title": "Sinagoga, Luna, Venere",
        "content": "",
        "upvotes": 44,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mce9k9x65ome1.png?auto=webp&amp;s=d4419fe8822d94cc0928093293cadf8bb98e488f"
        },
        "permalink": "/r/torino/comments/1j39xnh/sinagoga_luna_venere/"
    },
    {
        "id": "1j43trq",
        "author": "CryptographerFit5858",
        "title": "Canale telegram affidabile",
        "content": "Mi sono appena trasferito a Torino e sto cercando un canale telegram affidabile che mi permetta di evitarmi lo sbatti di fare roulette russa con quello che trovo per strada. Dm me. Grazie in anticipo",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j43trq/canale_telegram_affidabile/"
    },
    {
        "id": "1j3l62b",
        "author": "juulu",
        "title": "Cerco commercialista - Italiano/Inglese",
        "content": "Ciao, cerco un commercialista che parli inglese, zona Vanchiglia/Vanchiglietta/Madonna del Pilone.\n\nQualcuno ha dei consigli? Grazie.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j3l62b/cerco_commercialista_italianoinglese/"
    },
    {
        "id": "1j3pddk",
        "author": "Newyork301",
        "title": "Kappa Futur festival 2025",
        "content": "Hey everyone! \n\nI’m really considering going to the Kappa Futur Festival this July! The line up is amazing and it will be my first time in Torino\n\nHas anyone been to the festival? And what was your experience? Also what are other things to see/do while in Torino?\n\nThanks!!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j3pddk/kappa_futur_festival_2025/"
    },
    {
        "id": "1j3f7hu",
        "author": "sirburro",
        "title": "Locali karaoke in stanze private",
        "content": "Ciao a tutti, verso fine marzo sarò a Torino per salutare un po’ di amici che studiano/lavorano lì. Avevo pensato a fare una serata tranquilla in compagnia andando al karaoke ma preferiremo un locale che abbia disponibilità di piccole stanze dove poter cantare non davanti a tutti.\nAvete qualche consiglio da darmi con magari sevizi che offrono e costi?\nGrazie mille.",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1j3f7hu/locali_karaoke_in_stanze_private/"
    },
    {
        "id": "1j37669",
        "author": "DBonny101",
        "title": "Festival dell'Oriente",
        "content": "Ciao, sono qua per sapere le vostre opinioni. Ne vale la pena andarci? Sono attratto delle arti orientali, vorrei capire se è solo un evento commerciale fine a se stesso o meno.\nGrazie per le risposte ",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1j37669/festival_delloriente/"
    },
    {
        "id": "1j3eksn",
        "author": "CowEnvironmental3401",
        "title": "Concerto GY!BE OGR",
        "content": "Per chi va a vedere sabato i GY!BE ci becchiamo il pomeriggio e ci beviamo quelle sette/otto birrette nel frattempo?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j3eksn/concerto_gybe_ogr/"
    },
    {
        "id": "1j3hauj",
        "author": "frisk99",
        "title": "Ristorante piemontese con scelte vegetariane?",
        "content": "Ciao ragazzi, ho esplorato un po' il subreddit di Torino ma essendo la cucina piemontese peculiarmente a base di carne, vorrei chiedere ai più esperti:\nUn'amica romana verrà a trovarmi a Torino il prossimo weekend e si pensava di portarla a mangiare qualche specialità piemontese.\nOra, il problema è che la mia ragazza è vegetariana e non so come conciliare le due cose.\nPer caso qualcuno conosce un posto che faccia cucina tipica ma che abbia anche scelte vegetariane? Vi ringrazio in anticipo",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j3hauj/ristorante_piemontese_con_scelte_vegetariane/"
    },
    {
        "id": "1j3ge7d",
        "author": "OneThousandFreezes",
        "title": "Corsi di chitarra",
        "content": "Ciao a tutt*!\nSono uno studente che nel tempo libero prova a suonare la chitarra classica, sono alla ricerca di scuole/associazioni che abbiano corsi di livello base/intermedio a prezzi abbastanza accessibili.\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j3ge7d/corsi_di_chitarra/"
    },
    {
        "id": "1j3alxm",
        "author": "xclajre",
        "title": "biciclettaro zona San Donato/Porta Susa",
        "content": "ciao! come da titolo, sto cercando un'officina a prezzi accessibili per dare una controllatina alla mia bici e sostituire i freni per non rischiare di morire nuovamente ❤️ \nconoscete qualcuno di affidabile in quelle zone? grazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j3alxm/biciclettaro_zona_san_donatoporta_susa/"
    },
    {
        "id": "1j37qh6",
        "author": "Kruznica-Groznica",
        "title": "Prezzo per servizi di pulizia domestica a Torino: è normale o troppo alto?",
        "content": "Ciao, sono uno studente qui a Torino e sto cercando i servizi di un'agenzia di pulizie per aiutarmi a pulire un po' l’appartamento. L’appartamento è di 80 metri quadrati e comprende una camera da letto spaziosa, un soggiorno, una cucina, un bagno e un corridoio ampio. Mi servirebbero principalmente servizi come la pulizia dei pavimenti, la rimozione della polvere dagli scaffali, la pulizia del bagno e la pulizia completa della cucina (compresi gli interni dei mobili della cucina, il frigorifero, ecc.). Non ho bisogno di una pulizia profonda dei mobili o simili.\n\nHo contattato alcune agenzie che ho trovato su Google, ma nessuno parlava inglese, quindi ho dovuto comunicare con il mio italiano un po’ limitato. Mi hanno chiesto di registrare un video dell’appartamento e di inviarlo tramite WhatsApp per potermi fornire un preventivo.\n\nL’ho fatto e sono rimasto sorpreso dai prezzi, quindi vorrei capire se si tratta di prezzi normali o se mi stanno facendo pagare di più perché sono straniero.\n\nUn'agenzia mi ha offerto il servizio a 300 EUR, mentre un'altra ha chiesto 400 EUR.\n\nPrima vivevo a Londra e persino lì i servizi di pulizia erano più economici rispetto a Torino.\n\nCosa ne pensate di questi prezzi?",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1j37qh6/prezzo_per_servizi_di_pulizia_domestica_a_torino/"
    },
    {
        "id": "1j3asoh",
        "author": "HAldo0",
        "title": "Bar/Biblioteche/Aule studio zona Stazione Porta Susa",
        "content": "Ciao a tutti! Ho un cambio Treno-Flixbus di alcune ore a Torino in zona Stazione Porta Susa. Ci sono bar tranquilli o biblioteche, o aule studio, in cui riposare in zona? Grazie",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j3asoh/barbibliotecheaule_studio_zona_stazione_porta_susa/"
    },
    {
        "id": "1j2jxth",
        "author": "lollopollo18",
        "title": "Scam assurdo da \"Museo Impossibile\"",
        "content": "Oggi, 3/03/25 sono andato a questa \"mostra\" se così vogliamo chiamarla poiché non era organizzata... costava 13 euro a persona (una rapina), niente aria RESPIRABILE, attrazioni per BAMBINI max 3 anni immagini attaccate alle pareti che dovrebbero essere \"illusioni\" dovrebbero fare 5 euro a bambino e adulto GRATIS.... qualità delle strutture scadente come da foto...\nNON CI ANDATE!!!",
        "upvotes": 58,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8bcvatwhjhme1.jpeg?auto=webp&amp;s=5b30a999c2b417a05af613efd2300828e30ec1a8"
        },
        "permalink": "/r/torino/comments/1j2jxth/scam_assurdo_da_museo_impossibile/"
    },
    {
        "id": "1j380hp",
        "author": "Remarkable-Foot-7919",
        "title": "Medici sportivi a Torino",
        "content": "Ciao! Qualcuno sa suggerirmi uno o più medici sportivi a prezzi ragionevoli su Torino (eventualmente anche prima cintura)? Grazie mille! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1j380hp/medici_sportivi_a_torino/"
    },
    {
        "id": "1j2l2w5",
        "author": "silviuzX2",
        "title": "Zaini su tram/bus",
        "content": "Ma é veramente un concetto così complicato mettervi lo zaino tra le gambe o tenerlo almeno di fronte a voi ? Perché ingombra lo spazio di altre due persone e muoversi é molto più difficile, oggi ero sul 10 (ma capita ovunque) e ovviamente non è la prima volta che capita ma volevo sfogarmi, c’era una ragazza che aveva più che uno zaino sembrava una valigia con gli spallacci, per non parlare delle altre decine di persone facendo lo stesso….non vi capirò mai",
        "upvotes": 28,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1j2l2w5/zaini_su_trambus/"
    },
    {
        "id": "1j2ue2s",
        "author": "Academic-Wave-2596",
        "title": "con 1500usd a Torino?",
        "content": "Hey guys, I was wondering the possibility of living a Torino with a dignity life with 1500usd.\n\nI'm talking about eat healthy, make one or two food outside a month, 1 quick trip a month let's say.\n\nWhat you think?",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1j2ue2s/con_1500usd_a_torino/"
    },
    {
        "id": "1j2zsd3",
        "author": "Diecast_5682",
        "title": "Ci sono appassionati di bourbon a Torino?",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wn7wve0uxkme1.jpeg?auto=webp&amp;s=ab0a2556d1a4fb46361938c4e2cdf6fb97567f37"
        },
        "permalink": "/r/torino/comments/1j2zsd3/ci_sono_appassionati_di_bourbon_a_torino/"
    },
    {
        "id": "1j2lmce",
        "author": "notrimbaud",
        "title": "volontariato a torino?",
        "content": "ciao :) mi sono trasferita a Torino a settembre x università. \nCerco posti per fare volontariato (preferibilmente a che fare con sanità/medicina e animali/matura/ambiente) o gruppi/collettivi creativi e ambientalisti etc… anche altra toba che ha a che fare con arte e biblioteche varie mi interesserebbe!  \nvorrei trovare ambienti con persone gentili e non giudicanti :•) \n\ngrazie in anticipo! ♡ \n\n(conosco già un po’ di posti carini però faccio un po’ di fatica ad andarci da sola perché sono un po’ ansiosa… mi piacerebbe riuscire a trovare un posto dove stare bene) ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j2lmce/volontariato_a_torino/"
    },
    {
        "id": "1j2prv8",
        "author": "One-Tour9392",
        "title": "Com'è vivere a Falchera?",
        "content": "È una zona che non ho mai visitato. Dal punto di vista geografico mi sembra una posizione comoda per muovermi, vicino a ferrovia, autostrada, 4. \n\nInoltre, le case hanno prezzi accessibili, anche troppo a volte...per cui, com'è viverci? A livello sociale che situazione c'è? ",
        "upvotes": 2,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1j2prv8/comè_vivere_a_falchera/"
    },
    {
        "id": "1j2qym9",
        "author": "Altruistic_Leg7460",
        "title": "sito web per trovare lavoro e affitto",
        "content": "Ciao!\n\nVorrei sapere da qualsiasi sito web per trovare lavoro e affitto!\n\nGrazie :)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j2qym9/sito_web_per_trovare_lavoro_e_affitto/"
    },
    {
        "id": "1j2h28g",
        "author": "ddddxsxs",
        "title": "Auto a Torino",
        "content": "Ciao,\n\nProbabilmente nel prossimo futuro verrò a Torino con la mia ragazza. Io lavorerò all'ospedale San Lazzaro, lei invece studierà al Politecnico (sede di Corso duca degli abruzzi). Dal momento che sto valutando l'acquisto di un auto (una berlina) in sostituzione della mia utilitaria, mi chiedevo come fosse la situazione auto/parcheggi a Torino.\n\nIpotizzando di prendere una casa in zona ospedale/zona politecnico pensate che sarà semplice trovare parcheggio in queste zone?\n\nRitenete che l'auto a Torino sia utile oppure i mezzi sono efficienti e frequenti e quindi rendono un po' inutile l'uso dell'auto? Mi è stato raccontato da conoscenti che a Torino i mezzi si rompono a metà corsa, saltano corse, fanno scioperi a profusione e in generale non ci si può fare molto affidamento. Confermate?\n\nMi piacerebbe avere l'opinione di chi ci vive ",
        "upvotes": 2,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1j2h28g/auto_a_torino/"
    },
    {
        "id": "1j2op6l",
        "author": "Ligarchy",
        "title": "Tatuatori cybersigilism",
        "content": "Conoscete dei bravi tatuatori dj cybersigilism a Torino i dintorni?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j2op6l/tatuatori_cybersigilism/"
    },
    {
        "id": "1j1qlwl",
        "author": "sbrodolino_21",
        "title": "Oggi tutti in piazza Carignano alle 17 per supportare l'Ucraina!",
        "content": "",
        "upvotes": 94,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4wwdv8b11ame1.jpeg?auto=webp&amp;s=3591b3b9d0125bcab624e3cd27eba3ee5a377792"
        },
        "permalink": "/r/torino/comments/1j1qlwl/oggi_tutti_in_piazza_carignano_alle_17_per/"
    },
    {
        "id": "1j1nzsi",
        "author": "maldinoia",
        "title": "Vi consiglio una mostra",
        "content": "Se nella giornata di oggi non sapete cosa fare, vi consiglio una bella mostra sull'impatto dei cambiamenti climatici del fotografo Mitch Epstein.\nOggi è l'ultimo giorno, se ci siete stati o ci andrete fatemi sapere i vostri pareri",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1j1nzsi/vi_consiglio_una_mostra/"
    }
]