[
    {
        "id": "1iyobt1",
        "author": "MyDeadFriendZoe",
        "title": "Hey /r/movies! I am Kyle Hausmann-Stokes, the director/co-writer/producer of the dark comedy ‘MY DEAD FRIEND ZOE.’ (Ed Harris, Morgan Freeman, 100% RT, SXSW Audience Award). I’m a former paratrooper, the film is autobiographical, and got made by totally nontraditional means. AMA! (Back at 7 PM ET)",
        "content": "",
        "upvotes": 16,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4ch4ia2bqhle1.png?auto=webp&amp;s=2d0d7729ff3f4acb5b9406fb7215321c373cd5bf"
        },
        "permalink": "/r/movies/comments/1iyobt1/hey_rmovies_i_am_kyle_hausmannstokes_the/"
    },
    {
        "id": "1iy98cm",
        "author": "MarvelsGrantMan136",
        "title": "Roberto Orci Dies: ‘Star Trek’, ‘Transformers’ &amp; ‘Hawaii Five-0’ Writer-Producer Was 51",
        "content": "",
        "upvotes": 2328,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4PGTB061g93g40q-abF9kS7x-gzKY5swo8yxilzx0D4.jpg?auto=webp&amp;s=4d687a5d01d9acee2e9e604a63455ca79a730c39"
        },
        "permalink": "/r/movies/comments/1iy98cm/roberto_orci_dies_star_trek_transformers_hawaii/"
    },
    {
        "id": "1ixydm8",
        "author": "MarvelsGrantMan136",
        "title": "Official 20th Anniversary Poster for 'Star Wars: Episode III - Revenge of the Sith', Returning to Theaters April 25",
        "content": "",
        "upvotes": 10250,
        "comments": 869,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/keaxfxiu5ble1.jpeg?auto=webp&amp;s=784f791203d4a4efe78c307c4bd852b92fcd4b63"
        },
        "permalink": "/r/movies/comments/1ixydm8/official_20th_anniversary_poster_for_star_wars/"
    },
    {
        "id": "1iy4yti",
        "author": "ohhgreatheavens",
        "title": "Pixar absolutely cooked with The Incredibles (2004)",
        "content": "More than 20 years and dozens and dozens of feature-length superhero movies later, I still think that **The Incredibles** sits at the top of the list by a fairly wide margin. \n\nThis movie has so much to say about personal and familial growth. Every member the family is well-written in their struggle with finding their place in the family and in the greater world. On top of that each one of their superpowers perfectly reflects their character’s *personal* strengths and weaknesses without being hamfisted about it! You get to see how both suppression and expression of their powers affects each family member differently. \n\n\nIt’s really a masterclass in movie writing and I only scratched the surface: the retro-futuristic setting, the surprisingly emotional and intense story beats, the villain… all of it is so thoughtful and well-executed.\n\nThen there’s the music, the voice acting, and the creative *action*! \n\nBrad Bird’s fingerprints are all over the action set pieces. From the kids discovering the broader range of their superpower abilities while under extreme pressure, to Bob’s strength paired with his brute force tactics, to Helen’s ingenuity and quick-thinking skills in both the plane and hallway sequences, all of it is so clever and entertaining. \n\nThe absolute worst thing I can say about this movie is that the animation looks 20 years old, because it is. But otherwise this movie has been both a blessing and a curse all these years for me because I hold every other superhero movie to this standard. Unfortunately 95% of them have not been even close to this level of excellence. \n\n\n\n",
        "upvotes": 3192,
        "comments": 377,
        "media": null,
        "permalink": "/r/movies/comments/1iy4yti/pixar_absolutely_cooked_with_the_incredibles_2004/"
    },
    {
        "id": "1iyquza",
        "author": "MarvelsGrantMan136",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 84,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H057gCadG0t7FdW1UPhGJu1tCvpzy7bfYd4_XgSCcFo.jpg?auto=webp&amp;s=00089beed78952af1be8e9b681549011dee38ec4"
        },
        "permalink": "/r/movies/comments/1iyquza/havoc_official_teaser_netflix/"
    },
    {
        "id": "1iyknhb",
        "author": "soalone34",
        "title": "Inside the Oscar-Nominated Film That No Studio Will Touch: “No Other Land”",
        "content": "",
        "upvotes": 191,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f0O48djayP_VPaPlTUBOuWu_-W_Q65wUrw6sHhURyXg.jpg?auto=webp&amp;s=c865902fffaef437cb9cd26ccd46ad0741e25ef2"
        },
        "permalink": "/r/movies/comments/1iyknhb/inside_the_oscarnominated_film_that_no_studio/"
    },
    {
        "id": "1iyqgdd",
        "author": "YohannT",
        "title": "Guy Pearce Next Movie will be a western : 'Killing Faith'",
        "content": "",
        "upvotes": 74,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u88emkSGtOFkPdQFP0jn42UM8S-XqrbYuffTX3JuxYo.jpg?auto=webp&amp;s=7dcccd14d679db26258ee071927a0238bbb6b166"
        },
        "permalink": "/r/movies/comments/1iyqgdd/guy_pearce_next_movie_will_be_a_western_killing/"
    },
    {
        "id": "1iyr09p",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Gareth Evans' 'HAVOC' Starring Tom Hardy - After a drug deal gone wrong, a bruised detective must fight his way through a criminal underworld to rescue a politician's estranged son, while unravelling a deep web of corruption and conspiracy that ensnares his entire city.",
        "content": "",
        "upvotes": 60,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/63qpxxrubile1.jpeg?auto=webp&amp;s=b5f7fabf0e3d3891b3b88935aaf8f66906a1c6d7"
        },
        "permalink": "/r/movies/comments/1iyr09p/official_poster_for_gareth_evans_havoc_starring/"
    },
    {
        "id": "1ixyf6k",
        "author": "DemiFiendRSA",
        "title": "Ayo Edebiri Tapped To Write Live-Action Barney Movie For Mattel, A24",
        "content": "",
        "upvotes": 3061,
        "comments": 524,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIhjRxIFqJBY6jsICuLi4pXM38T-5V6u4-sAopR1f8A.jpg?auto=webp&amp;s=8b1e53c8f74c158f71319bc03cf3869c9a5a18e5"
        },
        "permalink": "/r/movies/comments/1ixyf6k/ayo_edebiri_tapped_to_write_liveaction_barney/"
    },
    {
        "id": "1iyefpy",
        "author": "Odd_Advance_6438",
        "title": "Willem Dafoe was fucking hilarious in Beetlejuice Beetlejuice",
        "content": "So I just watched the movie for the first time. I’m not even a huge fan of the original, but I still felt the sequel was kind of underwhelming. There wasn’t a lot of interesting stuff overall even if there were a lot of great parts. I know Beetlejuice didn’t have much screen time in the original, but it still feels like this movie is missing his presence.\n\nBut Willem Dafoe was absolutely hysterical in it. I loved every scene he was in, the way he talked so proudly of himself and his career as an action Star, the fact that his assistant used cue cards and brought him coffee just for him to crush it every single time into a big trash can",
        "upvotes": 288,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1iyefpy/willem_dafoe_was_fucking_hilarious_in_beetlejuice/"
    },
    {
        "id": "1iyq7bj",
        "author": "30Bones",
        "title": "REDUX REDUX | SXSW Festival Teaser | In an attempt to avenge her daughter's death, a woman travels through parallel universes, killing her daughter’s murderer over and over again.",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1en-c0NlA-qwGwKwGI5q_bkj7VkPYEIHz9pOVJ0wqyw.jpg?auto=webp&amp;s=229e927b81ad1ca9e39470d9a6193bf1079dfbcf"
        },
        "permalink": "/r/movies/comments/1iyq7bj/redux_redux_sxsw_festival_teaser_in_an_attempt_to/"
    },
    {
        "id": "1iyo2sw",
        "author": "Odd_Advance_6438",
        "title": "I really disagree with the take that the Watchmen movie glorifies the characters",
        "content": "So I really like the movie, I think it does a good job translating some very challenging source material. It’s got its flaws, but I think overall it’s an entertaining movie.\n\nI do see a lot of people claim it misses the point of the book, specifically in how the heroes are portrayed, but I think that’s a little unfair.\n\nIn my opinion, the heroes are still very much portrayed as incredibly flawed individuals. Rorschach is still a homophobic psychopath (I’ve seen a lot of people say that was cut out of the movie, but he definitely still says bigoted stuff), the Comedian is still a douche, Dr Manhattan is increasingly apathetic, and Nite Owl has to fight crime just to get hard rather than out of the goodness of his heart.\n\nI think a lot of it comes down to how people perceive Snyders style in the movie. The main argument is that the way he frames action and the camera makes the heroes look too badass. I can kind of see that criticism, but it doesn’t change what kind of people they are. Just because Rorschach has a cool shot in the rain doesn’t make him any less of a nut job.\n\nAs for the action, I feel like it’s deliberately shot in an exaggerated violent way to make the characters look even more irresponsible and messy, like in the alleyway mugging. I feel like it makes Silk Spectre and Nite Owl not look very heroic to see them getting excited over the prospect of breaking bones out of peoples arms. It may be shot in a cool way, but it also demonstrates how that lifestyle might seem intoxicating for the characters ",
        "upvotes": 42,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1iyo2sw/i_really_disagree_with_the_take_that_the_watchmen/"
    },
    {
        "id": "1iybidl",
        "author": "Embarrassed-Belt-693",
        "title": "Movie/tv trope you can’t stand…",
        "content": "What’s something that happens on screen that makes you question if directors know anything about real life…. I’ll go first..\n\nWhen someone is trying to secretly smoke a cigarette in a bathroom or out a bedroom window and when they are about to get caught they toss is out the window and waft around the air with their hand and then 2 seconds later someone walks in and are none the wiser. If you have ever smoked a cigarette you know that once that fucker is lit there’s no hiding. That entire room and your clothes are gonna smell after one drag. Anyways that’s one always get an eye roll out of me lol \n\nEdit thought of another one….. when someone is being chased and they hide somewhere and after whoever is looking for them looked in that area they immediately come out of hiding like have you never heard of people turning around?? Like the bad guys just walked away and yall pop up out of hiding and start talking?? They gotta be like 10 feet away tops. ",
        "upvotes": 326,
        "comments": 753,
        "media": null,
        "permalink": "/r/movies/comments/1iybidl/movietv_trope_you_cant_stand/"
    },
    {
        "id": "1ixzuff",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Surfer' Starring Nicolas Cage - A man returns to the idyllic beach of his childhood to surf with his son, but is humiliated by a group of powerful locals and drawn into a conflict that rises with the punishing heat of the summer and pushes him right to his breaking point.",
        "content": "",
        "upvotes": 1222,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/enj0mb6jgble1.jpeg?auto=webp&amp;s=40e8f8201da68e724965f9558cc2a40830c65934"
        },
        "permalink": "/r/movies/comments/1ixzuff/official_poster_for_the_surfer_starring_nicolas/"
    },
    {
        "id": "1iya92j",
        "author": "Physical_Soil746",
        "title": "The Godfather Part lll feels so bizarre compared to the first two",
        "content": "Putting aside the absence of Robert Duvall and Sophia Coppola's acting abilities the whole movie is so brazenly over the top that it almost feels like your watching a Godfather parody movie.\n\nJust to name a few scenes \n\nVincent biting the ear of a mafia boss which is then quickly forgotten about\n\nMichael expanding his family from the power sphere of a few corrupt politicians to now the entire Vatican \n\nThe shootout scene with a helicopter hovering over the mafia bosses and the one guy screaming MY LUCKY COAT \n\nZasa getting killed by Vincent dressed up as a police officer while riding a horse through the street \n\nMichael than makes some guy who he just met a few weeks ago with poor judgment skills the next Don in exchange for not having incest sex with his daughter \n\nThe absolute ridiculous Pacino yell let out in the end when his daughter is killed. \n\nAs a standalone movie it wouldn't be so bad but coming off the first two it absolutely feels out of place.",
        "upvotes": 294,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1iya92j/the_godfather_part_lll_feels_so_bizarre_compared/"
    },
    {
        "id": "1iy582f",
        "author": "Task_Force-191",
        "title": "Christopher Nolan's ‘Oppenheimer’ will be re-released in select IMAX &amp; 70mm theaters this weekend",
        "content": "",
        "upvotes": 548,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SLM9lSXKpq-KpKoPCPenKY9Kijyy9yQPXJse5Loa4c4.jpg?auto=webp&amp;s=ec29f540829344572ff4de62c0c22947b5d9c8e3"
        },
        "permalink": "/r/movies/comments/1iy582f/christopher_nolans_oppenheimer_will_be_rereleased/"
    },
    {
        "id": "1ixvr6k",
        "author": "NoCulture3505",
        "title": "Poster for 'Holland' Starring Nicole Kidman",
        "content": "",
        "upvotes": 1584,
        "comments": 578,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h45srnx8lale1.jpeg?auto=webp&amp;s=9a20f0d8d24bbc72d6c04edac476f4a63ff54126"
        },
        "permalink": "/r/movies/comments/1ixvr6k/poster_for_holland_starring_nicole_kidman/"
    },
    {
        "id": "1iy38ok",
        "author": "WerdNerd88",
        "title": "Remember The 13th Warrior (1999) starring Antonio Banderas?",
        "content": "https://youtu.be/ZeGbSOdedqI?si=lWWzTf4J1Jafgs6Y\n\nA movie where a Muslim Antonio Banderas has to join forces with a group of bloodthirsty Vikings to battle an invading army of cannibal cave-men? Yes please. This movie deserves more love.\n\nThe trailer for Satan's Alley, the fake trailer from Tropic Thunder, parodies the 13th Warrior trailer.\nhttps://youtu.be/vuziQsUrbeM?si=MYpiubGbYwVbW8uN\n\n\nDo not worry, my brother. More are coming.",
        "upvotes": 569,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ynmPTomYJJMC6cziRhCPJzqkMSQXVGKTx-q_ULnW4bI.jpg?auto=webp&amp;s=e8e7b7b946e23d143db42340dcd9dd7097125ada"
        },
        "permalink": "/r/movies/comments/1iy38ok/remember_the_13th_warrior_1999_starring_antonio/"
    },
    {
        "id": "1iypg8u",
        "author": "NoCulture3505",
        "title": "Another Simple Favor - Official Teaser Trailer | Prime Video",
        "content": "",
        "upvotes": 11,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hr6GKM0Dh_uJ9c4NFvJTZWHswyNEXQ7abhINRlWEBUc.jpg?auto=webp&amp;s=dd6cab756c9b253de54752007462f201e958a501"
        },
        "permalink": "/r/movies/comments/1iypg8u/another_simple_favor_official_teaser_trailer/"
    },
    {
        "id": "1iyf1yq",
        "author": "tedistkrieg",
        "title": "What are some movies where everyone is incredibly competent at something?",
        "content": "Just finished watching September 5 and what made the movie so compelling to me was how damn good everybody was at their jobs. \n\nFrom Marianne finding out the names of the athletes to the woman making the captions and everyone in-between. They did their job or task with the the utmost professionalism and skill. And on top of that, everyone worked together so well.  \n\nWhat are some other movies with similar levels of competency?",
        "upvotes": 69,
        "comments": 235,
        "media": null,
        "permalink": "/r/movies/comments/1iyf1yq/what_are_some_movies_where_everyone_is_incredibly/"
    },
    {
        "id": "1iym26f",
        "author": "Lionel_Hislop",
        "title": "\"Jean de Florette\" and \"Manon des Sources\"(1986): A film about greed and revenge, the first movie will have you enraged and the second film will have questioning if it's worth it",
        "content": "I love these two movies by Claude Berri, which were filmed back to back and both came out in the same year. \n\nAdapted from the two-part novel by Marcel Pagnol, *Manon des Sources*, the overall narrative is about how Ugolin (Daniel Auteil) and his uncle, César (Yves Montand), conspire against a family, led by Jean (de Florette) (Gerard Depardiu), who own the land they want, so they purposefully take advantage of Jean's ignorance to make his and family harder so he'd end up quitting and selling it back to César but things take a turn into tragic circumstances. \n\nFirst, the music by Jean-Claude Petit is gorgeous and iconic, it's sad and weirdly cheerful at the same time, like the usage of Verdi as well, and the characters are well-drawn and not entirely one-dimensional. César's greed turns him into a cold psychopath but by the second movie, he's more human and you see that as dismissive as he is about Ugolin, he does generally care for his nephew, whereas Ugolin is someone who willingly does what his uncle tells him to but also grows fond of Jean and his family and lives in this balance of serving orders but also feeling bad for Jean. \n\nJean de Florette starts out as this hopeful and lively man, excited about his new life, until things get bad, and even so, he never gives up, always in the hope things will get better. His wife, Aimée (Elisabeth Depardieu), is a near silent figure. She allows Jean to do what he wants and just sits back and hopes for the best. It's the daughter, Mano (Ernestine Mazurowna/Emmanuelle Beart), who becomes of crucial importance. If in the first movie, Manon is an observer who innocently sees the torment her family goes through, it's the final act of Jean de Florette where she assumes the position of the focal point, following it up in the sequel, as the grown Manon decides to do justice for what was done to her family, but halfway into the movie, one wonders if it's worth it and does it erase all the harm done to her family? Emmanuelle Beart is excellent as Manon, staying true to the restrained nature of her character, blending into the wilderness as she runs free and silent, but always cleareyed about her ultimate goal, revenge. \n\nI just think both these movies are fine films which blend well together. Separating the story into two movies work. By the end of the first movie, you want to know what will happen next and the second movie doesn't disappoint. Both movies can be watched together but I'd recommend anyone to watch it separately as the impact is greater when you're steaming after the first film.",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1iym26f/jean_de_florette_and_manon_des_sources1986_a_film/"
    },
    {
        "id": "1ixvhjp",
        "author": "bigbankmanman",
        "title": "Whats a movie you thought would be terrible but you ended up liking?",
        "content": "We have all watched a seemingly trailer, seeing bad reviews, or just hearing the premise of a movie and thinking like no way this is gonna be good. But then you actually watch it and boom you can't think of anything else besides this movie for the next couple of days.\n\nFor me it was Edge of Tomorrow. I thought it would be another generic action flick, but it turned out to be one of the best sci-fi movies I’ve ever seen. The time-loop concept was done so well and Tom Cruise and Emily Blunt absolutely killed it.\n\nWhat’s your 'pleasant surprise' movie?",
        "upvotes": 824,
        "comments": 1634,
        "media": null,
        "permalink": "/r/movies/comments/1ixvhjp/whats_a_movie_you_thought_would_be_terrible_but/"
    },
    {
        "id": "1iyiiz4",
        "author": "Lionel_Hislop",
        "title": "\"Little Giants\" (1994): The Mighty Ducks meets American Football with a feminist take and Rick Moranis and Ed O'Neil as enemies. You couldn't ask for more.",
        "content": "Little Giants was my favorite children's sport film in the 1990s. Most children's film involving sports were usually focused on boys, be it The Mighty Ducks or Rookie of the Year  or The Big Green, yet when Little Giants came out, I was struck by Becky (Icebox)'s character, a girl who's great at playing football yet gets passed over for a position in the team because she's a girl, so her dad, Danny O'Shea (Rick Moranis), decides to create a team of outsiders, including his daughter, who gradually become rivals against the team his older brother, Kevin (Ed O'Neil), created. \n\nI enjoyed Little Giants, it's empowering for girls without being \"in your face\" about it, you can't go wrong with Rick Moranis and Ed O'Neil as squabbling brothers, it gives you the agreeable entertainment of the genre and a positive message about inclusion. \n\nA film worth recommending for families. Some would find it woke, however, I'm like Jane Fonda, woke is about caring about people, so I'm woke.",
        "upvotes": 26,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1iyiiz4/little_giants_1994_the_mighty_ducks_meets/"
    },
    {
        "id": "1iyp0f0",
        "author": "Gattsu2000",
        "title": "Some Personal Thoughts About My Favorite Movie: Memento (2000) by Christopher Nolan",
        "content": "I just saw a really good [video](https://youtu.be/g3hQaX5S8-w?si=Rv7GFOUwDns3hhCX) about Memento which finally gets into something I find deeply resonating about the film. People often talk about the premise and specifically the tragedy of Leonard forgetting and manipulating himself but I also always thought that it served as an examination about how we interpret art in a way. Leonard is quite literally shifting his own information and using his condition to essential information that may contradict his purpose to kill this guy when either he has already done so long or he never got the guy in the first place. Notice how Leonard always keeps himself motivated by the fact that his wife was killed by the robbers and also reminds himself of his identity and purpose through Sammy, someone who is revealed to be a con man. It gives him something bigger, correlative to what he should do with himself. To make his goal the correct one to strive for and he confuses that with the idea that just like reports and studies, he is going for something \"objective\" and that even if his subjective mind doesn't remember it, it will somehow still have its impact and purpose. He's basically thinking in the way a person who believes in \"objectively good and bad art\" would but he's also thinking in the ways someone who is preoccupied with the idea that the art is becoming too concrete. Not abstract enough to bend the truth to their own will. Leonard wants to believe that whatever he's experiencing is exactly as what he finds value about it but we don't know if that's the case but we still hold on to it because humans, by their nature, will only be convinced by what their preconceived biases will tell them what's right to believe in. Even when we claim to believe in certain information, we are still being biased to the idea that believing in this type of information is what fits best with their truth of the world. Maybe there's no such thing as truth and in Memento, we will never know the truth of what has actually happened because everyone is lying to Leonard and the story is being told through Leonard's perspective, who is also lying to himself.\n\nTbh, for a while, I thought I mainly resonated with \"Memento\" because I think it's such a carefully structured, edited and told story with a lot of clever details ut I think it's also because it does reveal certain perspective I grew to have about the world around me and also how I see a lot of art. I personally don't like reading too much of what was supposedly intended about something if I get some very personal and abstract truth about a story. I just go ahead with that interpretation and that's what helps me live and love a story as much as I do. I love fiction and it's the way how I best communicate with people and it's how I created a lot of my friendships. And it's something I really put a lot of myself into.\n\nI contastly talk about how I love this movie that it can get tiresome but I just think it's such a brilliant piece of filmmaking and one that to me has so many layers to capture a lot of truths about art, morals and perspective. And maybe the reason I don't love his later films is that they seem to kinda detract from exploring these very complicated feelings and thoughts. It has become more about what's the face value subject that a film is exploring and about just delivering information without a mind to really interpret into something very different.\n\nSomething that the video I just mentioned pointed out is a understated scene where Leonard remembers a time with his wife reading a book she likes, which is a moment that particularly for looking seemingly inconsequential to the rest of the film but also says something that sounds interesting. He complains how it is silly for her to keep reading the same story over and over again because it'll always reach to the same ending and to the same plot points. But what his wife is doing here to me is that she's reading something more into these sequence of events. She's finding something to read about this book. And Leonard, ironically, isn't aware that he's doing the same with his revenge. He is repeating the same cycle of violence but ultimately, that doesn't matter to him that the \"story\" already ended. He needs to keep finding a reason to keep \"reading\" it. To keep finding his John G. His mind is in a sort of time loop of reading the same book over and over. And that's how it is gonna stay. This moment also shows how Leonard is using repetition to tell the story that he wants to believe in and this also gets into a truth about how \"truths\" are created: If you get to hear the same thing over and over, you're gonna start believing that this is a fact.\n\nWhen I kept thinking about this moment of the movie, I decided to look up what was the book that she was reading and it's called \"Claudius The God And His Wife Messalina\". I found this small [article](https://www.shmoop.com/study-guides/memento/claudius-messalina-symbol.html) giving further details about this moment. The book that she's reading turns out to be pretty relevant to the story of the film. The book is called Claudias The God And His Wife Messalina, where an emperor is perceived as an idiot and is then manipulated by his wife to how he gets to rule his kingdom in the same way he is manipulated by Teddy and Natalie to get what they want from him as he is trying to achieve his goal for vengeance. So in essence, Leonard, as the ruler of his own mind, is not even in control of the shift of events about how his mission will go. But it also may possibly hint that &gt;!his wife manipulated Leonard into causing her death if we believe what Teddy says to Leonard at the end of the movie and if what he said about Sammy Jenkins is just a reininterpration of his own story. The fact that this is also a very fictionalized interpretation of historical events also connects to the themes of the film: How we will shift information to fit according to a more compelling narrative that resonate with us over just the telling the mere cold truth of it all. \n\nBut yeah, just been thinking about this and I wanted to share this. It's a movie that means a lot to me and I wanna keep it relevant as what I consider to be, by far, Nolan's greatest work and his most complex and humanly complicated story. It's a movie that in its basic summary, it's a rather simple story of revenge with a unique twist of a premise but like many things, there's a lot more than meets the eye.",
        "upvotes": 8,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8qBIZe7-iv5s4KwyI-alwnT6il7HnBS6hg_Wbp6V_r8.jpg?auto=webp&amp;s=961b130c02a7b9a12081ee46c9e59b69c5090696"
        },
        "permalink": "/r/movies/comments/1iyp0f0/some_personal_thoughts_about_my_favorite_movie/"
    },
    {
        "id": "1ixpk10",
        "author": "nuttybudd",
        "title": "The opening scene in Cliffhanger (1993), a harrowing scene that was shocking for people who thought it would just be a run-of-the-mill \"action hero saves everyone\" movie with Sly Stallone.",
        "content": "",
        "upvotes": 1406,
        "comments": 414,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yLRWS7TJt6T21bf8MjcfrQMOH4-zkcivcRDTqcnAmCI.jpg?auto=webp&amp;s=e0e4129267899c9bcc12dfd93acc3c157f0a9019"
        },
        "permalink": "/r/movies/comments/1ixpk10/the_opening_scene_in_cliffhanger_1993_a_harrowing/"
    },
    {
        "id": "1ixqx12",
        "author": "Laurie_Barrynox",
        "title": "\"Rambo: First Blood Part II\" (1985) was a betrayal of the message sent by its original film, \"First Blood\" (1982)",
        "content": "Who watched First Blood and suddenly decided it would be the ideal start for the beginning of a patriotic, war celebrating, franchise. How did John Rambo go from being a traumatized Veteran, tormented by his past and turned into a social avenger after being mistreated by bullying cops, to a loyal war mercenary, serving orders from army officials and fighting the Russians? \n\nI watched First Blood Part II in disbelief. Apparently, Ronald Reagan liked the Rambo sequels which doesn't put these films in a positive light. \n\nPart II wasn't even good. The point of the first film was a critique of fascism, of how veterans are not taken care off and become social outsiders bcause the Government refused to do its part. Part II almost completely forgot what the first film said, didn't get John Rambo is not G.I. Joe and basically turned the sequels into the antithesis of the crux of the original. Part II is generic, formulaic and violent. Some scenes are as cringy as any Chuck Norris' war film. Julia Nickson as Cao exists solely as the foreigner who yearns to be saved by an American. Eye-rolling.",
        "upvotes": 867,
        "comments": 290,
        "media": null,
        "permalink": "/r/movies/comments/1ixqx12/rambo_first_blood_part_ii_1985_was_a_betrayal_of/"
    },
    {
        "id": "1iy3cm1",
        "author": "squallLeonhart20",
        "title": "Movie scenes that used silence to make things feel more tense or uncomfortable?",
        "content": "I enjoy when films pull this off. Rather than focusing on what you're hearing or what characters are saying, the scene uses silence to make things feel more uncomfortable. Long pauses in dialogue where there's more to read from what isn't being said and the stretch of silence rather than what is being said. What are some movie scenes that pull this off really well? \n\nThe Shining stands out as a really strong example. There's a scene with Jack and Grady that has plenty of silent moments in between conversation.  Just long awkward pauses within the conversation that really made the scene feel more eerie. Sometimes it isn't about what's being said but what isn't that can add a lot to a scene.",
        "upvotes": 102,
        "comments": 242,
        "media": null,
        "permalink": "/r/movies/comments/1iy3cm1/movie_scenes_that_used_silence_to_make_things/"
    },
    {
        "id": "1ixikpz",
        "author": "Clownshoes2022",
        "title": "Spielberg's Overlapping Dialogue Trick – Jurassic Park, Saving Private Ryan, and More",
        "content": "I’ve noticed a neat little trick Steven Spielberg uses in his movies, starting with *Jurassic Park*. There's a scene where Alan Grant is having raptors explained to him, while in the background, John Hammond is having a separate conversation. Both conversations are audible, but as the audience, you naturally focus on Grant’s, which is more relevant to the plot. This layering of dialogue makes the world feel more lived-in, like we’re overhearing real people rather than just following a scripted exchange.\n\nIn *Saving Private Ryan*, that moment with the translator, Upham, works similarly. His nervous, clumsy energy contrasts with Captain Miller’s (Hanks) composed discussion, reinforcing their dynamic. The overlapping dialogue makes it feel like you’re eavesdropping rather than being spoon-fed exposition, adding a level of realism that pulls you deeper into the scene.\n\nSpielberg does this in *Jaws*, too—think about Brody, Hooper, and Quint talking over each other on the boat. The chaotic energy makes their interactions feel natural and unfiltered, pulling us deeper into their world.\n\nIt’s such a clever way to enhance immersion without drawing attention to itself. Has anyone else noticed this in his other films? Would love to hear more examples!",
        "upvotes": 2920,
        "comments": 272,
        "media": null,
        "permalink": "/r/movies/comments/1ixikpz/spielbergs_overlapping_dialogue_trick_jurassic/"
    },
    {
        "id": "1iy48p1",
        "author": "CorePM",
        "title": "Movies with a 'Doomed from the start' vibe?",
        "content": "I'm trying to find some more movies to watch that kind of fit this certain vibe that I'm having a hard time describing, a bit melancholy, depressing, feeling like you know there isn't going to be a good ending right from the start. I'm thinking of movies like Hell or High Water, No Country for Old Men, Way of the Gun, Drive, Heat. I don't there is this certain sense of doom that I kind of feel from these movies and I want more, I really enjoy the types of endings these movies have and I'm looking for more. I'm just having a tough time exactly expressing what that certain feeling or vibe is.",
        "upvotes": 78,
        "comments": 384,
        "media": null,
        "permalink": "/r/movies/comments/1iy48p1/movies_with_a_doomed_from_the_start_vibe/"
    },
    {
        "id": "1iy3k57",
        "author": "tomsmac",
        "title": "The Nosferatu Rabbit Hole for an old man…",
        "content": "I’m 64 years old and I haven’t enjoyed the “Horror” genre since being a teenager. I bought the Nosferatu 4K steelbook as a blind buy.\n\nI absolutely LOVED it. Everything about it from the writing to the acting to the photography and its transfer to 4K.\n\nNow unfortunately I’ve fallen down a deep rabbit hole having now watched Bram Stoker's Dracula in 4K and loved that as well And I have the preorder in for “Renfield” at Walmart.\n\nMy question is, are there any other horror movies on the same level as Nosferatu? I didn’t like the Lighthouse and have the VVITCH on the way.",
        "upvotes": 76,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1iy3k57/the_nosferatu_rabbit_hole_for_an_old_man/"
    },
    {
        "id": "1ix8nls",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Travis Knight's 'Masters of the Universe' Movie Starring Nicholas Galitzine as He-Man",
        "content": "",
        "upvotes": 7764,
        "comments": 1007,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gsk2kry0o4le1.jpeg?auto=webp&amp;s=9c172a9a91be561b385160f47f3a627cedcf3f84"
        },
        "permalink": "/r/movies/comments/1ix8nls/first_image_from_travis_knights_masters_of_the/"
    }
]