[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ovwaue",
        "author": "dini_93",
        "title": "Why do I feel like I've been wrong about my understanding of Vietnam after watching Turning Point: The Vietnam War?",
        "content": "Context: I fell if love with Vietnam  as I travelled across the country last year. Till date, it is one the best experience in visiting a foreign country I've had. Food, Culture, Nature and the People are all fabulous. \n\nDuring my visit to Cu Chi Tunnels, I befriended my tour guide who was super informative. We spoke a lot about the culture and history of Vietnam with more focus on the war. He was from the North and his family were part of the communist party. But he was neutral and explained the whole scenario. One thing I was clear, that there's no good guy or bad guy here. Both the sides had committed war crimes. But then I visited the War Memorial, I felt the US did horrific attrocitices. They equally killed civilians as did the communists. So all in all, I had a belief that all 3 parties, The communists of North, South Vietnamese and The US were all equally guilty of inflicting so much pain to common people and created so much disruption that no one could live happlity during that period in time. \n\nBut after watching this series, I feel the South Vietnamese were the neutral guys who got stuck between the North and the US. Is this a right way of understanding the whole scenario?",
        "upvotes": 185,
        "comments": 287,
        "media": null,
        "permalink": "/r/netflix/comments/1ovwaue/why_do_i_feel_like_ive_been_wrong_about_my/"
    },
    {
        "id": "1owcp30",
        "author": "RiskAndReason",
        "title": "What are we watching today? 🍿",
        "content": "What’s on your watchlist tonight, and would you recommend it?  \n  \nI’m looking for something to unwind with this evening... could be a movie, doc, or a new series drop",
        "upvotes": 6,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1owcp30/what_are_we_watching_today/"
    },
    {
        "id": "1owhx3w",
        "author": "Officialbrandonly",
        "title": "Netflix auto-starting episodes instead of showing episode lists",
        "content": "I’m just frustrated that companies can just update their services and make them worse. I watch Netflix on a Roku stick and ever since the update instead of being able to see the description and take a peek at some of the episodes it just automatically starts the fucking episode.\n\nI don’t see any way to fix it in the settings just so annoyed because it’s probably updated like this just to make people watch more Netflix. It’s so predatory and annoying.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1owhx3w/netflix_autostarting_episodes_instead_of_showing/"
    },
    {
        "id": "1ovy7e4",
        "author": "huffpostuk",
        "title": "The Beast In Me Reviews: Critics Weigh In On Netflix Thriller",
        "content": "",
        "upvotes": 20,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ovy7e4/the_beast_in_me_reviews_critics_weigh_in_on/"
    },
    {
        "id": "1owfuo1",
        "author": "wBrite",
        "title": "Subtitles",
        "content": "Did everyone else's subtitles just change fonts out of nowhere? I can only change size and style. Now they are all in sans serif caps with a drop shadow. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1owfuo1/subtitles/"
    },
    {
        "id": "1owify2",
        "author": "volcanic_clay",
        "title": "How to add existing member with one profile on account as Extra Member?",
        "content": "I am trying to add a single dude who only has one profile in his Netflix account as an Extra Member.  They want to maintain their history and such.  Netflix chat is telling me even if a new email address is made, since their existing account only contains one profile there is no way it can be transferred and therefore that user cannot be added as an extra member and maintain their history.  Is this accurate?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1owify2/how_to_add_existing_member_with_one_profile_on/"
    },
    {
        "id": "1owhmp4",
        "author": "Ember_Grove20",
        "title": "Which Netflix series or movie had your favorite ending?",
        "content": "Some shows and movies really nail their ending, while others leave you thinking about what could have been. Which series or movie ending do you think was the best, and why? Curious to hear everyone’s thoughts and experiences!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1owhmp4/which_netflix_series_or_movie_had_your_favorite/"
    },
    {
        "id": "1ovfgtu",
        "author": "RiskAndReason",
        "title": "Just watched Netflix’s Frankenstein last night",
        "content": "Didn’t expect it to hit that hard. Beautiful cinematography, haunting score, and a surprisingly human story beneath all the darkness. What did you all think of it? What should I watch after this? ",
        "upvotes": 174,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1ovfgtu/just_watched_netflixs_frankenstein_last_night/"
    },
    {
        "id": "1ow0cjx",
        "author": "the_trend_memo",
        "title": "The Wait Is Over! Netflix House Philadelphia Officially Opens",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ow0cjx/the_wait_is_over_netflix_house_philadelphia/"
    },
    {
        "id": "1ovjlrj",
        "author": "Mindless-Platypus-75",
        "title": "Death by Lightning Thread",
        "content": "",
        "upvotes": 97,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1ovjlrj/death_by_lightning_thread/"
    },
    {
        "id": "1owdmtv",
        "author": "xxxdanixxx0",
        "title": "Building the band had favourites.",
        "content": "I feel like ALOT of the audition songs people did on the show were SET UPS.(I don't believe they picked their songs.) And I'm not just on about people who didn't make it into bands the people that did make it they tried to set them up and failed.\n\nPeople who made it into bands like nori, wennely,haley I even think elise.(and many more people.)the show was setting them up. Now don't get me wrong elise had one of the best audtions but hear me out.\n\nOn American idol she sang aretha Franklin, while on on btb she sang tate mcrae those are two VERY DIFFERENT songs.now she made it work and it was AMAZING however if you listen to the original version of the song she sang on btb...SET UP.(and this is coming from someone who likes that song)\n\nNow Haley, the songs she sings on tiktok alot of belting yk meanwhile on btb she sings feather and they want to believe she picked that no what are tou supposedto do with that... also on her tiktok she said she wanted to sing sia for her mum AGAIN two VERY DIFFERENT songs.\n\nAnd wennely and nori to choose water by tyla and greedy for an AUDITION SONG.They made  it work but there's other songs that could've showcased their vocals (which I've seen outside of the voice.)like when nori sung a victoria monet song on the 3quency tour that suited her voice unlike greedy cause she actually can sing but that song was not doing \nHer justice And wennely, singing water...what are you supposed to do with.\n\nI Don't think she was set up but you'd think brianna would sing a beyonce song considering she's huge fan or and rnb song considering she said she grew up on shirelles,destinys child etc.\n\nI could go on for ages but you get the point.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1owdmtv/building_the_band_had_favourites/"
    },
    {
        "id": "1ovwt2v",
        "author": "baguetteworld",
        "title": "Fave Netflix show in a different language?",
        "content": "Favourite Netflix show in a different language — Aka not originally in English \n\nNot sure why I need more characters :(\n\n\nIsiwndnsjejedndnvgrfyucjvjvjivific",
        "upvotes": 9,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1ovwt2v/fave_netflix_show_in_a_different_language/"
    },
    {
        "id": "1ow54v3",
        "author": "TyraneeLDP",
        "title": "Crime Scene: Zero is fascinating!",
        "content": "I’m an American watcher but I’m loving Korean competition shows. I’ve seen Devil’s Plan and Culinary Class Wars and thought they were both fantastic. Crime Scene:Zero is no exception.\n\nIt’s such a *different* concept - Actors doing their best to LARP as characters in a murder mystery yet still legitimately trying to find the killer so they win money. Each actor gets a profile of their character and only the “murderer” knows they’re the killer and has to lie and fool the others. There are these elaborate sets with different “rooms” where the contestants find evidence and debate sections where they each can sway opinion.\n\nThere are a few things in the first 2 episodes I couldn’t culturally follow but that’s to be expected. The stories are really elaborate and it’s a super fun guessing game. High recommendation. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ow54v3/crime_scene_zero_is_fascinating/"
    },
    {
        "id": "1ow0it9",
        "author": "CableBeautiful4316",
        "title": "Which upcoming new Netflix originals are you excited about?",
        "content": "Squid game ended this year and stranger things is about to end. Netflix is working on many new originals internationally. Which ones are you most excited about?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ow0it9/which_upcoming_new_netflix_originals_are_you/"
    },
    {
        "id": "1ovzsl6",
        "author": "BossJosh74",
        "title": "Last Samurai Standing switching back and forth sub vs dub.",
        "content": "I was wondering if the dub is CGI or some AI CGI magic? Does anyone else think it is a little \"uncanny valley\" or does it seem real? I love lip flaps and the art of matching them from Voice Artists. ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ovzsl6/last_samurai_standing_switching_back_and_forth/"
    },
    {
        "id": "1ow5mi7",
        "author": "suprswimmer",
        "title": "Sound messed up only on Netflix?",
        "content": "The TV sound works fine for any other streaming service or disc we watch, so it's weird -- the last week or so sound has been spotty/glitchy on Netflix. Sometimes we start something and it begins with no sound and if we restart it is back on. Or during the episode it will sound bumpy, almost? Like the noise is cutting in and out really fast like the Internet is spotty, but connection is perfect and this doesn't happen anywhere else.\n\nIs this an issue for anyone else?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ow5mi7/sound_messed_up_only_on_netflix/"
    },
    {
        "id": "1owezk6",
        "author": "Impossible-Air-2843",
        "title": "What's the best show currently on Netflix?",
        "content": "Looking for a new show to watch , any recommendations?\n\nHey guys so I'm looking for a new show to watch , I can't tell you specifically the genre I like because it really depends but I'll tell you what I've watched recently that I really liked so you can get an idea , turn of the tide , Dep q , the feud , mobland, Tulsa king , son of a donkey , so yea it's a mix , any recommendations of some good attention catching series ? Thank you ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1owezk6/whats_the_best_show_currently_on_netflix/"
    },
    {
        "id": "1ow56vo",
        "author": "Reasonable_Ad1300",
        "title": "Why is The Rookie not showing up in my profile",
        "content": "This is really weird but I’ve been watching the rookie on Netflix for the past 2 weeks and today I check my profile and I can’t find it but for some reason it’s showing up on the other profiles but not on mine I can’t seem to figure out why…and I checked the parental controls and nothing is turned on so I don’t understand why it’s not showing up. I even tried switching devices but still the same thing",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ow56vo/why_is_the_rookie_not_showing_up_in_my_profile/"
    },
    {
        "id": "1ow4pqz",
        "author": "Specialist-Change-86",
        "title": "Will Netflix pull an Untamed, and renew The Beast in Me?",
        "content": "Maybe, this time with a different storyline and characters altogether. Suspense thrillers tend to do well on Netflix. Which is why I was wondering if there will be a season 2 for The Beast in Me, like Untamed Season 2?\n\n  \n[https://www.soapcentral.com/shows/will-the-beast-me-season-2-happen-speculations-explored](https://www.soapcentral.com/shows/will-the-beast-me-season-2-happen-speculations-explored)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ow4pqz/will_netflix_pull_an_untamed_and_renew_the_beast/"
    },
    {
        "id": "1ov4re6",
        "author": "Optimal_Bet_5243",
        "title": "Best show u ever watched ❤️.",
        "content": "Kindly tell me the best show(s) u have ever watched that u wish u could forget just to watch again with awe, i m looking for some fast paced thriller which ll keep me hooked in every episode.(But all the genres r welcome)",
        "upvotes": 123,
        "comments": 742,
        "media": null,
        "permalink": "/r/netflix/comments/1ov4re6/best_show_u_ever_watched/"
    },
    {
        "id": "1ow8zf2",
        "author": "crockalley",
        "title": "Netflix won't show me credits",
        "content": "I just resubscribed after some months away. At the end any episode, the credits cut off before they can really begin. I have confirmed that there is no \"Watch Credits\" button. I have Autoplay turned off. It's very jarring when it jumps to the the screen where I can thumbs-up or down, or choose the next episode. If I choose the episode I just watched in the upper right corner, it starts from the beginning. There is no option to watch the credits.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ow8zf2/netflix_wont_show_me_credits/"
    },
    {
        "id": "1ovz7v3",
        "author": "Aromatic_Paint_1666",
        "title": "Squid Game The Challenge 1st round was so LAME",
        "content": "Why would they put a bunch of people, divide them in half and play a game that only a few could actually participate then that's it? So stupid and boring.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovz7v3/squid_game_the_challenge_1st_round_was_so_lame/"
    },
    {
        "id": "1ovnk6f",
        "author": "Financial-Flamingo62",
        "title": "comedy show recommendations",
        "content": "i have rewatched b99 and the good place like 10 times and just finished Girls5eva, and I need some more suggestions of shows like that, whats some other ones i can add that you have enjoyed?",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ovnk6f/comedy_show_recommendations/"
    },
    {
        "id": "1ovruuc",
        "author": "Jason2648",
        "title": "need some good psychological horror movies",
        "content": "i tried searching for a bunch of directors ive heard of on netflix but nothing really showed up im talkin stuff like hostel,hannibal,possessor,etc\n\n  \npretty much anything disturbing and gory",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ovruuc/need_some_good_psychological_horror_movies/"
    },
    {
        "id": "1ow12dp",
        "author": "Xongxilly69",
        "title": "UNKNOWN NUMBER: Was the whole family in on it!",
        "content": "I know this documentary has been out for a little while, but I just watched it tonight and have been searching thru Reddit. The more I’ve been reading and thinking about, the more I realize there is a chance that the whole family could’ve been in on it. Would explain the strange behavior from everyone, especially in the police interrogation scene. Think about it. Kendra could not hold a job. I have no idea what the father did. They were obviously struggling financially and needed a creative way to make money. Why not stage that your daughter is being stalked and verbally harassed and try to frame it on someone else? She literally did that with Khloe and got close. They could’ve potentially filed a lawsuit and got money from whoever got blamed. The charges wouldn’t be severe enough to serve more than a couple years in prison. The documentary focuses so much on Lauryn, but Kendra texted a LOT of people. How did she get all those numbers? To me, there’s only 2 possible ways. 1) she stole it from Lauryns phone without her knowing or, 2) Lauryn was helping her send the texts. The whole lack of a motive was so confusing to me. If she was literally having a psychotic break and trying to get close to Lauryn and/or Owen, then I feel like it would’ve resorted to something physical a lot sooner based on the texts she was sending. But it just went on for almost 2 years. I think there has to be a more logical motive.",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ow12dp/unknown_number_was_the_whole_family_in_on_it/"
    },
    {
        "id": "1ovvorc",
        "author": "headcow0304",
        "title": "Delhi Crime season 3",
        "content": "Where’s Delhi Crime season three? It’s already Nov 13 and it was supposed to drop today, but it’s nowhere to be found on Netflix USA. Is anyone actually able to access it, or is it delayed?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ovvorc/delhi_crime_season_3/"
    },
    {
        "id": "1ow1l0j",
        "author": "Specialist-Change-86",
        "title": "Titles like Marines that you can watch",
        "content": "Here are some of the military stories and documentaries that I could come up with. Which are your favourite military stories that are not on this list?\n\n[https://www.soapcentral.com/shows/enjoyed-watching-marines-netflix-these-5-marine-corps-shows-movies-watchlist-next](https://www.soapcentral.com/shows/enjoyed-watching-marines-netflix-these-5-marine-corps-shows-movies-watchlist-next)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ow1l0j/titles_like_marines_that_you_can_watch/"
    },
    {
        "id": "1ovyc8w",
        "author": "NoMathematician6731",
        "title": "Dexter",
        "content": "I Am on Dexter season 5 right now. I think it is a brilliant serie with alot of amazing handling. What do you think about Dexter? Do you seen it? I think in gonna see it later.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ovyc8w/dexter/"
    }
]