[
    {
        "id": "1j09ou7",
        "author": "riff_raff_movie",
        "title": "Hi /r/movies - I’m Dito Montiel. My latest film, Riff Raff, stars an amazing cast including Bill Murray, Jennifer Coolidge, Ed Harris &amp; Pete Davidson. I wrote and directed A Guide to Recognizing Your Saints in 2006 which jumpstarted my career as a filmmaker. Ask Me Anything!",
        "content": "",
        "upvotes": 112,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sv39e15bawle1.png?auto=webp&amp;s=ba292224b3f81657ddcb69a15eb1cea4b14e2dbd"
        },
        "permalink": "/r/movies/comments/1j09ou7/hi_rmovies_im_dito_montiel_my_latest_film_riff/"
    },
    {
        "id": "1j0i4dk",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Game Card Pickup Thread",
        "content": "#[Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) if you want to just nab one and skip the wall of text.\n\n---\n\nAlright everyone, Oscar Sunday is quickly approaching and with it the growing anticipation to simultaneously be enthralled and disappointed by the glamour and politics of Hollywood. Well, to make it all a little more interesting we are doing Oscar Bingo again this year. A week ago we [asked you guys to come up with things that might happen during the ceremony](https://old.reddit.com/r/movies/comments/1itlqyx/oscar_bingo_xii_submission_thread/) and vote for your favorites. We then collected the top 65 plausible and non redundant submissions and our friends over at www.print-bingo.com made us a Bingo game card generator that has a ton of game cards for you fine folks to download.\n\n- Feel free to get however many you want for your needs but please don't waste them! \n\n- [Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) Just do the captcha and your card will be generated via **link to a pdf.** You will have to click the link for the card, don't do the captcha a bunch of times because it's not automatically downloading. That wastes cards and each one could be a winner!\n\n- Check out [last year's game thread](https://old.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/) for reference.\n\nEveryone is welcome to participate. On Oscar Sunday we will make an official game thread for everyone to discuss their cards and the game. The game thread will also serve as a referee zone for me and participating users to make judgement calls on the more ambiguous answers. Here are some things to know about the \"competition\" side of this little shindig:\n\n- If you win just be sure to yell \"BINGO\" really loud wherever you are. And if you wanna post your gamecard to the game thread that would be fine too.\n\n- This thread will be stickied until Oscar night when we make the game thread. There will also be an official Oscar discussion thread separate from the Bingo game thread.\n\n\nFinally, none of this ridiculousness could have been possible for such a large-scale website without print-bingo.com, and they have a message for us!\n\n*\"Print-Bingo.com is used by hundreds of teachers, event hosts, party organizers, and ex-pats in all corners of the globe to make both traditional and custom bingo cards through a web browser. We are happy to help Reddit with this fun, specialized, use of our website.\"*\n\nSo hey! Pick up a gamecard. Pick up 5. Play with your friends. Play alone with your cat. And let this be a reminder to all of us not to take the Oscars too seriously.",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1j0i4dk/oscar_bingo_xii_game_card_pickup_thread/"
    },
    {
        "id": "1j0bb00",
        "author": "MarvelsGrantMan136",
        "title": "2025 Razzie Award Winners: 'Madame Web' Wins Worst Picture",
        "content": "",
        "upvotes": 18498,
        "comments": 1179,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TrjA45g8bevmcbEPBwoeUgCorGq1g1AiVG3_kS5o20k.jpg?auto=webp&amp;s=f0bba2d99bbe6bb0d3553ad85720479b94b6aa31"
        },
        "permalink": "/r/movies/comments/1j0bb00/2025_razzie_award_winners_madame_web_wins_worst/"
    },
    {
        "id": "1j0jy41",
        "author": "DemiFiendRSA",
        "title": "First image of June Squibb in Scarlett Johansson’s directorial debut ‘Eleanor the Great’ - The story follows a 90-year-old woman trying to rebuild her life after the death of her best friend. As a result, she moves back to New York City after living in Florida for decades.",
        "content": "",
        "upvotes": 1245,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d6da21exfyle1.jpeg?auto=webp&amp;s=9714c92e5f13f995148cf35032bfdd7970b32f64"
        },
        "permalink": "/r/movies/comments/1j0jy41/first_image_of_june_squibb_in_scarlett_johanssons/"
    },
    {
        "id": "1j0mpkw",
        "author": "Tall_Ant9568",
        "title": "In the Kingdom of Heaven (2005) Director’s Cut, the priest at the beginning who buried Balian’s wife and steals her necklace is actually his brother. This and other vastly important details are left out of the theatrical edition to make the movie short enough for viewers.",
        "content": "The original movie was cut greatly to appease Fox for standard viewers. The movie may as well be two different films. Ridley Scott’s Director’s cut has clarity, pace, and depth. The theatrical edition is a hack and slash film cut to have a start and an end. I recommend the first if you want to be on the edge of your seat for 3 hours! \n\nOther missing details: \n\n\n&gt;!Balian and his wife lost a baby in the beginning, she killed herself because of it, Balian was placed in custody for madness in his grief. He burned the baby’s unfinished shirt she had been sewing before killing his brother in a rage. This shows why he felt he had nothing left and went on the crusade. Also, Balian had other family in the crusades, including his uncles! His father’s backstory is further discussed and there is an entire plot about Sybilla and her son being king Baldwin that is left out!&lt;",
        "upvotes": 689,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1j0mpkw/in_the_kingdom_of_heaven_2005_directors_cut_the/"
    },
    {
        "id": "1j0jjf5",
        "author": "Oldschoolhollywood",
        "title": "The Parenting - Official Trailer - MAX",
        "content": "",
        "upvotes": 915,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6tPUnbZIZEMaEyL-x2fSXXQ2esOfiaETHHdIhXCHqsc.jpg?auto=webp&amp;s=2bdb2fbce0e59582a19f00abf6ccf375ac1fda9c"
        },
        "permalink": "/r/movies/comments/1j0jjf5/the_parenting_official_trailer_max/"
    },
    {
        "id": "1j0ukux",
        "author": "Icy_Smoke_733",
        "title": "The Highest-Paid Actors Of 2024 - The Rock Tops the List with $88M, Trailed by Reynolds ($85M), Kevin Hart ($81M), Jerry Seinfeld ($60M), And Hugh Jackman ($50M)",
        "content": "",
        "upvotes": 133,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nMtZd62ygfqdkt6mXMPXtTovwCJqPrgqGaqY51z7bl0.jpg?auto=webp&amp;s=07f9e3030089ae8d8c9232d063837766a4ef33d1"
        },
        "permalink": "/r/movies/comments/1j0ukux/the_highestpaid_actors_of_2024_the_rock_tops_the/"
    },
    {
        "id": "1j0ppbt",
        "author": "um_yeahok",
        "title": "\"Why you flanking me?\" What films and tv shows hit with the intensity of this scene from Wind River?",
        "content": "I'm an avid movie/tv junky and have been since my teen years in the 80's'.\n\nThere are a number of films that i rewatch, usually about once a year, and a few weeks ago I watched **Wind River** (2017) and it still impresses me as such a great film. I was thinking about other films and tv shows that have intense scenes like the flanking scene, and came up with a few. I'm posting to see what ya'll can add to my small list so far.\n\n**13 Hours: The Secret Soldiers of Benghazi** (2016)  \n\\- I'm watching this right now and the movie manages to maintain such intensity throughout, i just love it.\n\n**Sicario** (2015)  \n\\- The border crossing scene is so great.\n\n**Heat** (1995)  \n\\- I haven't rewatched in a while, but i do remember the big shoot-out scene as being pretty intense. It's time for a rewatch i think.\n\n**Bone Tomahawk** (2015)  \n\\- I don't want to spoil anything for those that haven't seen it, but my recommendation if you have not is to go in blind and not read anything about it. It's just a great film.\n\n**The Revenant** (2015)  \n\\- The bear attack is pretty riveting. The entire movie is pretty intense and a bit depressing, but i do like that there is a bit of justice in the end.\n\n**Saving Private Ryan** (1998)  \n\\- The Knife kill scene is etched in my memory for all time.\n\nI will also mention **Black Hawk Down** (2001) and **Band of Brothers** (2001) which both have many such scenes, too many to list here. Also time for a rewatch i thinks.",
        "upvotes": 244,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1j0ppbt/why_you_flanking_me_what_films_and_tv_shows_hit/"
    },
    {
        "id": "1j0kuzm",
        "author": "AKL_wino",
        "title": "‘I spent 12 hours a day for 16 months with Gene Hackman – but never met him’: The Conversation’s Walter Murch pays tribute",
        "content": "",
        "upvotes": 434,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/334_IPtoMb5iw5zM8LAHSQrHSqvvxzumlucDuAn9UDQ.jpg?auto=webp&amp;s=d46bc4bdc82fdb2afc941d41bd435958926853e1"
        },
        "permalink": "/r/movies/comments/1j0kuzm/i_spent_12_hours_a_day_for_16_months_with_gene/"
    },
    {
        "id": "1j0l6co",
        "author": "suddenly-scrooge",
        "title": "Ben Stiller on Gene Hackman’s Simple Truth",
        "content": "",
        "upvotes": 338,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bMgyic8nUKHLdHMTRte8pyiPwJW44V7XhNCyJFY0vMA.jpg?auto=webp&amp;s=fe5351da87ba85a3247a66bf51109624c5772369"
        },
        "permalink": "/r/movies/comments/1j0l6co/ben_stiller_on_gene_hackmans_simple_truth/"
    },
    {
        "id": "1j0urei",
        "author": "Robemilak",
        "title": "Rob Lowe on Nicole Kidman's 'Babygirl' Sex Scenes: “She’s brave because she has a sex scene? Like, that’s brave now. In our day, it was required.”",
        "content": "",
        "upvotes": 49,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gZCVxi6ttWskjRjFI6GxSi3wwS3TOQfyytdXkhz6soY.jpg?auto=webp&amp;s=928827dbfb511b0d6c8f9aa99e18cdd290db4503"
        },
        "permalink": "/r/movies/comments/1j0urei/rob_lowe_on_nicole_kidmans_babygirl_sex_scenes/"
    },
    {
        "id": "1j0k1bl",
        "author": "KillerCroc1234567",
        "title": "Joseph Wambaugh, Creator of ‘Police Story’ and ‘Onion Field’ Writer, Dies at 88",
        "content": "",
        "upvotes": 162,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U98DF6l82K-px5F9L3KyrdJOHKtf9BZbIWmXr8g5tJQ.jpg?auto=webp&amp;s=53fd0d20a4fd05b7019f5877456d251ee451996a"
        },
        "permalink": "/r/movies/comments/1j0k1bl/joseph_wambaugh_creator_of_police_story_and_onion/"
    },
    {
        "id": "1j0rblw",
        "author": "uncre8tv",
        "title": "Did 'The Boy Who Could Fly' just wreck anyone else's child mind? Just me?",
        "content": "I was 9 years old when that movie came out, and it was an acid trip before I knew what an acid trip was. The kid could fly. \n\nOf course I also didn't get the metaphor in The Life of Pi (the book) until someone pointed it out to me, so maybe my mind is just too literal for the movie. The visuals of the roof scene haunted me for at least a decade. Just such a weird, weird movie. ",
        "upvotes": 50,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1j0rblw/did_the_boy_who_could_fly_just_wreck_anyone_elses/"
    },
    {
        "id": "1j0gj8p",
        "author": "N1CK_STALK3R",
        "title": "Has Streaming Ruined An Ending's Impact For You?",
        "content": "Wanted to show the gf Before Sunset. One of my favorite movies with one of my favorite endings. First time I saw it I didn't expect it to end like that and absolutely loved it. Tried showing her and right before you realize the movie is ending suddenly the \"next up\" recommendations pop up. Completely distracting and ruined the impact of a beautiful ending. Anyone else had the mood spoiled by streaming and their popups at the end?",
        "upvotes": 236,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1j0gj8p/has_streaming_ruined_an_endings_impact_for_you/"
    },
    {
        "id": "1j0ho07",
        "author": "Hi_Im_zack",
        "title": "What are some controversial or even hated casting choices you're not mad at?",
        "content": "This isn't about choices that were initially met with negativity and later praise when the film came out (Heat Ledger). I'm talking casting choices people talk shit about even today but you kinda like\n\nFor me it's easily Scarlett Johansson as the lead in Ghost in a Shell (2017). I think she really channels the vibe of the animation and brought Motoko to life. despite not being Japanese. You can tell she did her homework on the character and it wasn't just an easy paycheck\n\nI'd say her biggest sin was being too big. she quickly became the female face of Hollywood, especially as an action star, aside from Black Widow I think Lucy came out before this and was critically panned. It also doesn't help that this movie wasn't great and didn't live up to the astronomical standards set by the anime. However, Scarjo did live up to it. I'll stand by that.",
        "upvotes": 167,
        "comments": 433,
        "media": null,
        "permalink": "/r/movies/comments/1j0ho07/what_are_some_controversial_or_even_hated_casting/"
    },
    {
        "id": "1j0jesv",
        "author": "sometimesifeellikemu",
        "title": "Going to rewatch “Air Force One” today- what’s your another good 90s action flick?",
        "content": "Perfect movie for a day off. Just sit back and let the score and the hard dialogue wash over you. I’m always wondering what people watch when they reminisce about this era, especially if you saw it in theaters. It really helps if it has one of those strong, thumping music scores that you can recognize from the next room through the walls and that draw you in….",
        "upvotes": 114,
        "comments": 353,
        "media": null,
        "permalink": "/r/movies/comments/1j0jesv/going_to_rewatch_air_force_one_today_whats_your/"
    },
    {
        "id": "1j0s7ci",
        "author": "PharaohCleocatra",
        "title": "Movies to watch with my grandma?",
        "content": "I am looking to watch a movie with my grandma, and wondering if people have some good suggestions. Nothing too graphic or violent, she likes movies that are a bit of an easy watch. Nothing too complex in storyline (she’s 85 and can get a bit lost). Nothing too silly either, something that does tug on the heartstrings a bit with good characters, told from a female perspective is nice too. \n\nHere are some examples of movies that she likes:\n- best exotic marigold hotel (2011, 2015)\n- calendar girls (2003)\n - guernsey literary and potato peel pie society (2018)\n- Brooklyn (2015)\n- she liked Downton Abbey (I know it’s a show) \n\nI appreciate all suggestions! I know my nana will be thrilled, and I love spending time with her. She’s 80% deaf now so we watch everything with closed captioning, snuggled close on her couch. I adore her. Thanks for helping bring a smile to her face ◡̈ ",
        "upvotes": 27,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1j0s7ci/movies_to_watch_with_my_grandma/"
    },
    {
        "id": "1j0srwb",
        "author": "DJDrRecommended",
        "title": "What is a really good movie that you can't watch because it's not available on any steaminng platforms?",
        "content": "I just bought 'Drop Dead Gorgeous' and 'Dead Alive'. These are two examples of movies that I cannot find on any streaming platforms. With physical media starting to disapear isn't it scary that some great films may be lost in time? I want to start collecting films that are not readily available and maybe, find a way to share them with people. ",
        "upvotes": 24,
        "comments": 127,
        "media": null,
        "permalink": "/r/movies/comments/1j0srwb/what_is_a_really_good_movie_that_you_cant_watch/"
    },
    {
        "id": "1j04qfl",
        "author": "Valuable_Row4473",
        "title": "Timothy Dalton : A Tribute to the Darkest James Bond",
        "content": "",
        "upvotes": 778,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LGMUFV0hknY6FsbAkvU1jC_TrESPO4hCmdxZ24lUf1Q.jpg?auto=webp&amp;s=dd5d10688c93654630407b0fa940f0c42ada86a9"
        },
        "permalink": "/r/movies/comments/1j04qfl/timothy_dalton_a_tribute_to_the_darkest_james_bond/"
    },
    {
        "id": "1j0e3z0",
        "author": "mrossman5",
        "title": "What’s a movie that introduced you to a band/artist you now like because of its soundtrack?",
        "content": "I was thinking of Guardians of the Galaxy 1 and the impact the soundtrack had on my overall opinion of the film. Now every time I hear “Cherry Bomb” or “Hooked on a Feeling” I think of that movie. \n\nFor me, it’s Tron Legacy and Daft Punk. I knew of them, but that movie showed me just how much I enjoy their music. ",
        "upvotes": 153,
        "comments": 388,
        "media": null,
        "permalink": "/r/movies/comments/1j0e3z0/whats_a_movie_that_introduced_you_to_a_bandartist/"
    },
    {
        "id": "1j0d3wk",
        "author": "SanderSo47",
        "title": "Brady Corbet’s Criterion Closet Movie Picks",
        "content": "",
        "upvotes": 136,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JPbSmmawAP-fK2fxd1m44rKLOYSMrUALBG04jgcH4O4.jpg?auto=webp&amp;s=587edb2f78736a6688f105ecc11784d3d4a10d22"
        },
        "permalink": "/r/movies/comments/1j0d3wk/brady_corbets_criterion_closet_movie_picks/"
    },
    {
        "id": "1j0ujc0",
        "author": "Lets_Go_Why_Not",
        "title": "Best Examples of Bringing an Audience Up to Speed in a Movie",
        "content": "I just finished watching Deepwater Horizon, which is generally fine, but one thing I really appreciated was the way it found to explain what was happening on Deepwater Horizon and what Marky Mark's company did, thus allowing the rest of the movie to be a lot easier to understand from both a technical and political perspective. Basically, an early scene has Marky Mark's young daughter practicing her speech for class on what her Dad does, with a Coke can as a demonstration. \n\nThat got me wondering, in an era where so many movies seem to just plunk two characters down and have them talk about things that they are both already aware of solely for the audience's benefit (\"Wow, I can't believe it's been 5 years since you had that car accident where you lost your young son named Michael, after which your wife left you because she couldn't process her grief, and you moved back in with your estranged father....\"), do you have any other examples where a movie found an elegant or effective way to deliver some complicated backstory or foundational knowledge required to understand the specifics of the story?",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1j0ujc0/best_examples_of_bringing_an_audience_up_to_speed/"
    },
    {
        "id": "1j0fn7i",
        "author": "ChiefLeef22",
        "title": "Al Pacino Joins Gus Van Sant Thriller 'Dead Man's Wire' - Also Starring Bill Skarsgard, Dacre Montgomery, Myha’la, Cary Elwes and Colman Domingo",
        "content": "",
        "upvotes": 67,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4KCxlmUw7Yt6quW-FkSsia2xpUJVyiNR5wCf_FQrAcY.jpg?auto=webp&amp;s=12bf119bda6582d481339ccafa9cb744fe6afabf"
        },
        "permalink": "/r/movies/comments/1j0fn7i/al_pacino_joins_gus_van_sant_thriller_dead_mans/"
    },
    {
        "id": "1j0qv8a",
        "author": "DreadPirateZoidberg",
        "title": "Source of a particular movie trope",
        "content": "My wife and I noticed a particularly specific trope while watching Despicable Me 4 tonight. An old man with a dog is sitting in front of a remote gas station when an extraordinary vehicle (space ship, high tech car, huge bus, etc.) arrives. A regular person exits the vehicle to do normal gas station things while the old man stares in stunned silence and the dog usually runs to hide. It’s not the creepy gas attendant trope. It’s always done as a comedic moment. We were wondering where this trope started from. If this isn’t the place to ask, would you please point me in the right direction? I tried tvtropes but all I got from there is the creepy gas attendant trope.",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1j0qv8a/source_of_a_particular_movie_trope/"
    },
    {
        "id": "1j0bj27",
        "author": "igby1",
        "title": "Skyler in “Enemy of the State”",
        "content": "Rewatching Enemy of the State (1998) after hearing Gene Hackman died, I noticed Anna Gunn (Skyler in \"Breaking Bad\") has a small part.\n\nFunny enough she’s talking about &gt;!a bookkeeping error!&lt; at 01:47:20.\n\nIt’s a good, fast-paced Tony Scott-directed film with Hackman, Lisa Bonet, Jack Black, Tom Sizemore, and others you’ll recognize.\n\nIt's one of Hackman's roles where it's hard to imagine anyone else doing as good a job with it.\n\nOverall still a very relevant movie in 2025.",
        "upvotes": 104,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1j0bj27/skyler_in_enemy_of_the_state/"
    },
    {
        "id": "1izj4eo",
        "author": "MarvelsGrantMan136",
        "title": "Zendaya to Star in ‘Shrek 5’ as Shrek’s Daughter",
        "content": "",
        "upvotes": 11543,
        "comments": 1403,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1YeZkhg9AIZnnXReteZGdU5fHWoMLQY5wXJeq_RQPGo.jpg?auto=webp&amp;s=574dd9ef90178ab067a925168d855440d35825b8"
        },
        "permalink": "/r/movies/comments/1izj4eo/zendaya_to_star_in_shrek_5_as_shreks_daughter/"
    },
    {
        "id": "1j0fzr5",
        "author": "JimmyMcGinty24",
        "title": "The hater's guide to the 2025 Oscars [Humorous column by Drew Magary -- Deadspin, Defector, GQ -- on Academy Awards]",
        "content": "",
        "upvotes": 45,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eJYcOfKekmKF-QL8uHzO3M1sYkEk8ZOEdGW4EtfgV3M.jpg?auto=webp&amp;s=066bda06367e7f6154b313f526724e31595c30bb"
        },
        "permalink": "/r/movies/comments/1j0fzr5/the_haters_guide_to_the_2025_oscars_humorous/"
    },
    {
        "id": "1izy4di",
        "author": "Wonder-Lad-2Mad",
        "title": "Saw The Rock (1996). I realized Michael Bay has always been like that lmao. Such a fun, over the top movie. A power play between Connery, Harris &amp; Cage",
        "content": "It has Michael Bay cinematography, Michael Bay dialouge, Michael Bay acting, Michael Bay editing, Michael Bay explosions etc. It's Bay to Bay, Ebery Bay.\n\n\n\nBut fuck, it somehow ***slaps*** though.\n\n\nCan we talk about how fucking sick the score is? Holy shit. \n\nDundundun dun da ***don***\n\n\n\nOmg this movie has some absolutely unhinged Nick Cage moments.\n\n\n\nSean Connery is just phenomenal here.\n\n\n\nHummel is a great villain, he's one of those bad guys who you wanna cheer for. I can't believe the movie ends with &gt;!the US goverment refusing to pay these guys their dues, deciding to bomb civilians instead. And it's treated like!&lt; the good ending lmao.\n\n\nBut it's okay, I forgive it cause the flare scene is god tier.\n",
        "upvotes": 695,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1izy4di/saw_the_rock_1996_i_realized_michael_bay_has/"
    },
    {
        "id": "1izj89w",
        "author": "cruelsummerbummer",
        "title": "Shrek 5 Teaser",
        "content": "",
        "upvotes": 4833,
        "comments": 1764,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l7CxQ1KsQV_FRBNd3EvrppUkM4C5cnprgXxYzLOC6ik.jpg?auto=webp&amp;s=276832f9d72342c057798fbb2d9dbdeb1de228f4"
        },
        "permalink": "/r/movies/comments/1izj89w/shrek_5_teaser/"
    },
    {
        "id": "1j0iqg5",
        "author": "Laurie_Barrynox",
        "title": "I really enjoy Chunking Express, even though I don't know why. Do you ever love movies and fail to offer a good explanation as to why?",
        "content": "Sometimes it's a feeling, a vibe. I can't really offer a viable explanation. I just love Chungking Express, It's a movie I caught on cable while I was in college and I'd be watching movies in my room and this one caught my eye. I liked it so much that I also saw Happy Together, which did not disappoint in any way. I was already obsessed with Leslie Cheung after I saw Farewell My Concubin but seeing him play such a sexually explicit role after seeing him play a LGBT-related part in Farewell where it's more toned down and restrained, I loved it. \n\nAnd I became a huge fan of Faye Wong and Brigitte Lin. I mean, Tony Leung is in it, and he's always excellent, but for me, Brigitte Lin was so fascinating as a woman with a Blonde wig, being very Ninotchka-like, not showing any emotion and still being flirted by this guy, and I adore Faye Wong in this. You can see why any man would be smitten by her.,",
        "upvotes": 19,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1j0iqg5/i_really_enjoy_chunking_express_even_though_i/"
    },
    {
        "id": "1izjgq5",
        "author": "6degrees_Cdn_Bacon",
        "title": "Okay, look… D&amp;D: Honor Among Thieves is amazing",
        "content": "I don’t play DnD, and I’m not a huge Chris Pine fan (or at all) but here’s what’s doing it for me in this movie:\n\n1) A badass female who loves potatoes as much as I do (does Michelle Rodrigues EVER consider other kinds of roles? Not that I want her to.)\n\n2) Great lines delivered exceptionally well and with perfect timing by Mr. CP.\n\n3) A fat dragon.\n\n4) Above average special effects, with the exception of one potato-throwing scene.\n\n5) Running joke about magic that echoes what I always think, but doesn’t drag on past its usefulness.\n\n6) A complex plot that’s clear enough not to feel complicated.\n\n7) An ending I should have seen coming but still made me cry. YES it’s okay to cry over a fat dragon movie, although the fat dragon didn’t make me cry and only featured in one of the quests.\n\nI look forward to all the comments agreeing with me.\n\n",
        "upvotes": 4261,
        "comments": 716,
        "media": null,
        "permalink": "/r/movies/comments/1izjgq5/okay_look_dd_honor_among_thieves_is_amazing/"
    },
    {
        "id": "1izoryi",
        "author": "UnderstandingThin40",
        "title": "Walt Disney was an FBI informant who ratted out his “communist” colleagues and made a deal with the FBI to portray them positively in his movies. What are some other crazy conspiracies in the movie industry?",
        "content": "In case people didn't know:\n\n\nhttps://www.nytimes.com/1993/05/06/movies/disney-link-to-the-fbi-and-hoover-is-disclosed.html?utm_source=perplexity\n\nLike always this always comes out decades after the fact.\n\nDisney also made a deal with the fbi for cheap land in Florida for their parks.\n\n\nDo you guys know of or have theories on any other conspiracies ?\n\nThere is definitely a lot of funny business with money laundering for what I understand. Thanks!\n\nSome other ones without any conclusive evidence:\n\n- 300 was released to stir up anger towards the Middle East to continue support in our wars\n\n- Marvel focuses on quantum computing / parallel universes so much because it's preparing the populace for those scientific revelations \n\n- all large production companies bought off and manipulated IMDb/rotten tomatoe scores\n\n- Jim Carey's man on the moon documentary and the way he went about the movie was one large kaufmanesque prank that you don't know if it's intentional or not \n\n- Kubrick was killed over the missing footage in eyes wide shut that talk about a pedo ring among the elite ",
        "upvotes": 1991,
        "comments": 390,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SS3HEAbVI4UYUPoTNqX4E-ueWFmgvyEvpZZafUakVpY.jpg?auto=webp&amp;s=dc53faf9baa561c3645a58b23c0a0d879c32f1db"
        },
        "permalink": "/r/movies/comments/1izoryi/walt_disney_was_an_fbi_informant_who_ratted_out/"
    }
]