[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qbbq72",
        "author": "Secretly_Wealthy90",
        "title": "11.22.63 IS SOOOO Good!!! highly recommended",
        "content": "how did i not know about this until now, 10 years later after it came out. Hulu did not do a good job at promoting it, Netflix put this at the top. \n\nall other streaming services should just shut down and license their content to Netflix IMO.\n\n\n\n",
        "upvotes": 900,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbq72/112263_is_soooo_good_highly_recommended/"
    },
    {
        "id": "1qbfm14",
        "author": "happymagtv",
        "title": "Shane Gillis inks major Netflix deal as ‘Tires’ season 3 enters production",
        "content": "Just saw that Shane Gillis and John McKeever, the creators behind *Tires*, have landed a big overall deal with Netflix. This is happening as they start filming Season 3.\n\nThe deal means they'll be developing new movies, shows, and unscripted stuff for Netflix, plus Gillis gets two more stand-up specials. Pretty huge vote of confidence in their specific brand of chaotic, blue-collar comedy after the show's success.\n\nThe quote from their statement is classic: \"thankfully, it's too late for them to back out.\"",
        "upvotes": 177,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qbfm14/shane_gillis_inks_major_netflix_deal_as_tires/"
    },
    {
        "id": "1qaw6fh",
        "author": "jerkoff1610",
        "title": "This hidden detail in Harlan Coben’s Run Away explains what actually happened to Henry at the end",
        "content": "",
        "upvotes": 78,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qaw6fh/this_hidden_detail_in_harlan_cobens_run_away/"
    },
    {
        "id": "1qakmje",
        "author": "Sudden_Pop_2279",
        "title": "‘KPop Demon Hunters’ Wins Golden Globes for Best Animated Feature and Best Song",
        "content": "",
        "upvotes": 403,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qakmje/kpop_demon_hunters_wins_golden_globes_for_best/"
    },
    {
        "id": "1qaya0c",
        "author": "Realistic_Leg5822",
        "title": "His&amp;Hers",
        "content": "I just finished watching his&amp;hers. 10/10 acting and storyline.  \n  \nCan anyone recommend similar films or series which are not too long but keep me hooked till the end?",
        "upvotes": 40,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qaya0c/hishers/"
    },
    {
        "id": "1qbfnqe",
        "author": "AccomplishedFly1420",
        "title": "The People we meet on vacation",
        "content": "What year is this supposed to take place n? Everything feels very early 2000s from the open space desks to the soul cycle scene. Beyond that it just feels like a shitty hallmark movie plot. I was excited for this one bc book lovers were so excited. But what is with the weird film style/filter??",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qbfnqe/the_people_we_meet_on_vacation/"
    },
    {
        "id": "1qbksc2",
        "author": "BlackestMask",
        "title": "Subtitles Always Include Audio Descriptions?!",
        "content": "I got Netflix and I'm ready to finally watch the anime Frieren. I'm watching it in the original Japanese with English subtitles, and the Audio Descriptions cannot be turned off.\n\nNothing I did could change this. **&lt;wind whistles&gt; &lt;soft music swells&gt;** and such interrupted the dialogue nonstop.\n\nWas on the phone with Netflix for 40 minutes doing everything from switching profiles to rebooting my entire system before the poor fellow I've been talking to puts me on hold to talk to his supervisor.\n\nHe returns to tell me that the Audio Descriptions cannot be turned off for Frieren.  And it looks like this is true for at least some other subtitled shows as well.\n\nCan this be true?  Seems straight up unacceptable.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbksc2/subtitles_always_include_audio_descriptions/"
    },
    {
        "id": "1qbjebb",
        "author": "queefanitor",
        "title": "Low energy viewing moments?",
        "content": "Not talking about finding the perfect show but more about those low-energy moments where you don’t want to commit, might be multitasking, and just want something on. What do you expect or wish would happen in those moments? Or what do you do? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qbjebb/low_energy_viewing_moments/"
    },
    {
        "id": "1qbgkby",
        "author": "RevolutionaryRub6553",
        "title": "People We Meet On Vacation",
        "content": "(Spoilers, duh) I've watched a few movies already released this year which is wild to me because I'm rarely ever early and to be honest a lot of movie quality has slipped in past years but People We Meet On Vacation was absolutely amazing. I love how we saw into Alex and Poppy's friendship so clearly with the how many summers ago flashbacks. At first I genuinely thought Poppy and Alex would never date and due to the title, I thought they would go on vacation and then find their significant others, but I was thankfully wrong. In some of the flashbacks we saw **that** look. You know, the \"I love you\" but can never say look. The film was diverse, sexuality wise, we had Alex's brothers gay wedding, which is expected for a film of this year. I mean quite literally every film I've seen released this year has had that diversity. We had a look into both characters different love preferences. That guy with the boat, I think his name was Buck? Don't quote me on it, and his awful \"momento mori\" tattoo. And Poppy's ex, Trey. Very handsy. Alex had Sarah, highschool sweethearts as Poppy says. I don't know what else to say but, Netflix has had some good originals yet this year and you should definitely watch this one. 10/10.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbgkby/people_we_meet_on_vacation/"
    },
    {
        "id": "1qb2v87",
        "author": "Mr-Vanderhill",
        "title": "His &amp; Hers… thoughts",
        "content": "Was this series.. supposed to be good?\n\nI thought it was bafflingly bad. A terrible story/plot, with horrible dialogue all around and some pretty awful acting. \n\nThe plot.. some high school girls coerce others into the woods in which they get paid to watch girls get abused? One of the girls changes her name and looks and also becomes an anchorwoman at the same place as the main character? She kills her own sister and turns into some sinister person.. Yawn. Lazy, horrible writing. I can go into much more but it’s truly not worth it. \n\nJon Bernthal is great and gives it his best but even he can’t really escape the again, horrible dialogue and plot. \n\nTessa Thompson is objectively horrible. Prior to this she was fine in other things. Not spectacular, not bad. She also is not given help with an awful plot and dialogue but god she was incredibly bad. So many scenes that were laughable and clearly a set of a show with soap opera type acting. \n\nTessa was not the actress to use in this show and well it shows. Nobody could’ve done the story justice sure but she made it a lot worse. \n\nThe climax.. her mom with “dementia” ends up being the killer.. yawn yawn yawn. That whole final act was such a drag and so lame. So many obvious and dumb red herrings all the way across the series. \n\nI typically won’t comment on something that I think is this bad but I’m seeing so much love that I can’t even wrap my head around. Hate to be the bearer of bad news but if you enjoyed this series, you are easy to please. ",
        "upvotes": 16,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1qb2v87/his_hers_thoughts/"
    },
    {
        "id": "1qbi35u",
        "author": "DaScrumMistress",
        "title": "Hot take on the Unlocked Jail series…",
        "content": "Prepare for the influx of Prison Brides/Prison Wives content. Netflix knows what’s up so they out here planning work on legendary status, just saying Q. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbi35u/hot_take_on_the_unlocked_jail_series/"
    },
    {
        "id": "1qbkme9",
        "author": "godguided",
        "title": "Only one subscription for life",
        "content": "If you can have only one subscription for life, what would that be? &amp; Why? \n1) Netflix \n2) Apple Tv \n3) Prime \n4) Hulu\n5) YouTube \n6) Spotify\n7) Bumble/Hinge\n8) Pornhub/Brazzers\n9) Chatgpt Plus\n10) Max\n11) Disney+\n12) Kindle Unlimited \n\n\nIf i am missing anything else you can drop that too. Interesting to see what is more valuable in today’s tech-savvy world in entertainment business. \n\n",
        "upvotes": 0,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qbkme9/only_one_subscription_for_life/"
    },
    {
        "id": "1qbd2sp",
        "author": "Lilac_Dollie",
        "title": "Best shows to download for a 40 hour bus ride?",
        "content": "I’ll be going on a (in total there and back) around 40 hours of a bus ride. In order to keep myself busy im looking for shows or movies to download.\n\n I’m a big fan of of animated shows, some of my favorites being haunted hotel, arcane, jentry chau, death note, etc. \n\nand for non animated I’ve been a big fan of sweet tooth and the umbrella academy. \n\nIf anyone knows any similar shows let me know!",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qbd2sp/best_shows_to_download_for_a_40_hour_bus_ride/"
    },
    {
        "id": "1qbafmq",
        "author": "harpreetthind",
        "title": "Thoughts about the one last adventure making of Stranger things",
        "content": "What’s everybody’s thoughts on the one last making of Stranger Things I’m watching that right now. After watching the whole season of Stranger Things movie",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbafmq/thoughts_about_the_one_last_adventure_making_of/"
    },
    {
        "id": "1qaznep",
        "author": "StatisticianFun2274",
        "title": "The Lazarus Project (2022-2024)",
        "content": "This one had been on my watch list for a while. I noticed this weekend that it was leaving Netflix soon. The better half and I binge-watched the first 6 episodes last night.   Enjoying it so far. Only 16 total episodes, but I'm guessing it ends on a cliffhanger?",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qaznep/the_lazarus_project_20222024/"
    },
    {
        "id": "1qav427",
        "author": "SolutionPatient89",
        "title": "His&amp;Hers was weird.",
        "content": "Spoilers!!\n\nI don’t get why lexy and her husband acted so weird and tried to attack her when they were not the killers. Even more confusing is lexy’s character. She kills her sister for calling her fat but doesn’t do anything to her bullies ? \n\nThe twist was meh. ",
        "upvotes": 16,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qav427/hishers_was_weird/"
    },
    {
        "id": "1qbhuw6",
        "author": "DuxxieDings",
        "title": "i think i watched every good adult animation, any hidden gems?",
        "content": "i watched arcane, wolf king, castevania, pluto, monster, tokyo override, vinland saga, ect. i dont like cartoons like big mouth though. any hidden gems?",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1qbhuw6/i_think_i_watched_every_good_adult_animation_any/"
    },
    {
        "id": "1qbhhl0",
        "author": "Fallen_Goose_",
        "title": "Can we get a podcast tab?",
        "content": "With the addition to all the podcasts being added to Netflix recently, they should probably have them separated into a separate tab. I don't plan to watch/listen to a lot of podcasts on Netflix but if I do how am I supposed to find them? \n\nHome | Shows | Movies | Games | Podcasts | New &amp; Popular | My List",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbhhl0/can_we_get_a_podcast_tab/"
    },
    {
        "id": "1qbc06a",
        "author": "Different_Chance6818",
        "title": "Netflix System Design Explained | Cloud Architecture, Microservices &amp; Global Video Streaming",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qbc06a/netflix_system_design_explained_cloud/"
    },
    {
        "id": "1qaxqkg",
        "author": "ideserveit1234",
        "title": "Don’t know why there is so much hate towards His&amp;Hers",
        "content": "It’s the first time in a long time that I want to watch something \\*again\\*.\n\nEverything about it was good, if not phenomenal, and I didn’t see many of the twists coming. I usually ALWAYS predict everything within 30 minutes of the movie… one of my biggest pet peeves. I suspected a few, but the last one was a surprise for sure.\n\nI don’t see why there is a lot of confusion around what characters are saying etc—this is to add depth to the character and give the viewer more insight on how corrupt (or what kind of corrupt) the character is. \n\nThere are some things that are left out from the story, but implied imo.\n\nAnybody else feel this way?",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qaxqkg/dont_know_why_there_is_so_much_hate_towards/"
    },
    {
        "id": "1qbgwaz",
        "author": "farahisweird",
        "title": "Run away",
        "content": "What a series! What a series! All the characters are so greyyyyyy!! When you think you know what’s going on, boom! Twists and turns for days! I absolutely love it! I haven’t finished but I wanted to afl if anyone has any similar suggestions! Thank you! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbgwaz/run_away/"
    },
    {
        "id": "1qaht5l",
        "author": "RevolutionaryRub6553",
        "title": "Why is Netflix recommendations so bad?",
        "content": "I was scrolling through YouTube shorts, this is where I find **actual** good shows and movies to watch and it's pointed me to so many good shows and movies on Netflix that I don't actually get recommended for, I only find them after I've searched them. Literal shows and movies I've never seen or heard of on the Netflix home page. Has anyone else noticed this or am I just picky? ",
        "upvotes": 114,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qaht5l/why_is_netflix_recommendations_so_bad/"
    },
    {
        "id": "1qbggjf",
        "author": "Heythereweirdo",
        "title": "Thoughts on his and hers",
        "content": "Seriously, i know the plot and all were good and the twist in it i didnt see that coming either. but was it really necessary to show the 🍇 scene so obscenely? like it was trauma p\\*\\*n period. i was not ready for it since i didnt really think sexual violence as SA tbh i think i wasnt paying much attention to the TW before starting the show. But seriously it was so tasteful and  UNNecessary. It reminded me of the uncomfortable feeling after watching JU ON because I DID not see that coming there either. I just dispise it.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qbggjf/thoughts_on_his_and_hers/"
    },
    {
        "id": "1qbg6pa",
        "author": "Apprehensive-Mode798",
        "title": "No more cliffhanger cancellations",
        "content": "Note to Netflix: there’s not a series on Netflix I’m looking forward to. I just finished stranger things 5. You cancelled lost in space, locke and key, the society, shadow and bone, Lockwood &amp; co, the OA, and ALL on cliff hangers. I’ve heard about Kaos, but also learned that was also cancelled on a cliffhanger after one season.. so what’s the point? If anyone has other recommendations, I’m open to it. But not looking for another series that ends with no answers \n\nEdit: i forgot lost in space didn’t end in a cliff hanger",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qbg6pa/no_more_cliffhanger_cancellations/"
    },
    {
        "id": "1qbfvg4",
        "author": "brain_rot_101",
        "title": "Need recommendations to get myself out of a slump...",
        "content": "I've been in a slump for months now... it started around October. I've tried watching a few shows (stranger things, superstore, how to get away with murder, six feet under, helluva boss) but I'm not able to get past their first seasons (except 'Stranger Things', decided to quit at half of S2; and 'How To Get Away With Murder', quitting cuz this show is actually pretty trash).\n\nThis phase is becoming a little too intense now as I'm not even able to complete a movie since the past 3-4 days... and I'm also stuck at the middle of two novels. \n\nPlease suggest me some good shows to break out of this. I would prefer them to not be very lengthy or too slow burny, and I mostly just watch ones that involve murder or some sort of mystery.\n\nThanks !",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbfvg4/need_recommendations_to_get_myself_out_of_a_slump/"
    },
    {
        "id": "1qbafqa",
        "author": "Psycho_66666",
        "title": "Any fixes to this problem",
        "content": "I have made the setting in the profile for the quality of the video it is set to high, but still when I open a movie or TV show it runs in so low quality that I can even count the pixels on the screen. Is there any fix on how to get the highest quality I have the 1080p plan the video is not even in 720p makes my eyes hurt I have comparison shots  ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbafqa/any_fixes_to_this_problem/"
    },
    {
        "id": "1qbf5et",
        "author": "jamesmister2000",
        "title": "An offer for Netflix regarding Wolf King season 3",
        "content": "https://youtu.be/xa5UfHafGuY?feature=shared\n\nMy 7yo daughter recently watched Wolf King. And upon finishing it, she frantically asked me to look up when season 3 was comming out. When I told her there wasnt going to be a season 3 she was disapointed almost to the point of tears. \n\nShe has something to say..",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qbf5et/an_offer_for_netflix_regarding_wolf_king_season_3/"
    },
    {
        "id": "1qbcq7j",
        "author": "CryptographerLoud461",
        "title": "Netflix constantly blurry and buffering on LG TV",
        "content": "I have Netflix with ads. I recently got a new TV and new wifi (Verizon). A few days after using the TV, every time I go to watch Netflix it buffers for a long time before starting, and then the show is in like 240p — you can barely make out faces.\n\nDo you think this is purposeful, as a way for Netflix to try to get me to upgrade to an ad-free version? It’s really frustrating :(",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qbcq7j/netflix_constantly_blurry_and_buffering_on_lg_tv/"
    }
]