[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mgj9rw",
        "author": "BrutalSock",
        "title": "Questi sono due euro di “brioche farcita” da Berlica Barbis",
        "content": "Quella roba minuscola evidenziata nella terza foto è la teorica farcitura. ",
        "upvotes": 32,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mgj9rw/questi_sono_due_euro_di_brioche_farcita_da/"
    },
    {
        "id": "1mgicz8",
        "author": "vah_man_",
        "title": "Turin Tram",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mgicz8/turin_tram/"
    },
    {
        "id": "1mgo2mx",
        "author": "MatteVat25",
        "title": "Tennis solo per ricchi",
        "content": "Raga, ma è normale pagare 28 euro per un'ora  un campo in cemento all'aperto di giorno...quindi niente luci. Mi sembra davvero esagerato. Quanto pagate dove andate voi?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mgo2mx/tennis_solo_per_ricchi/"
    },
    {
        "id": "1mgmwg3",
        "author": "Goddess1802",
        "title": "Places to visit",
        "content": "Hii! I'm going to visit Turin during 12-19 august. What places do you recommend visiting?   \nWhat are some good and affordable places to eat and what club would you recommend for students?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mgmwg3/places_to_visit/"
    },
    {
        "id": "1mglhye",
        "author": "murrayland",
        "title": "Coming Torino in a week. Any advice for club nights on the Saturday?",
        "content": "LGBT / LGBT friendly. Enjoy any music but not anything too pop / cheesy. Techno disco house etc works well. Bunker looks good but not sure if any nights are running? \n\n\nAppreciate it's a quiet time of year so any advice appreciated! \n\n\nWhile I'm here, any cool cocktail / rooftop bars and vegan restaurants would be good. And any events for the 9th - 16th August.\n\nThanks ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mglhye/coming_torino_in_a_week_any_advice_for_club/"
    },
    {
        "id": "1mfyljz",
        "author": "xXCyb3rBu11yXx",
        "title": "Perché dicono “entra in Parella, esci in barella”?",
        "content": "Mi sono trasferito in Parella un paio di mesi fa e ho sentito quella frase  ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mfyljz/perché_dicono_entra_in_parella_esci_in_barella/"
    },
    {
        "id": "1mgezs4",
        "author": "Frengo_17",
        "title": "informazioni",
        "content": "Ciao a tutti, volevo sapere se conoscete un negozio a torino che vede articoli punk rock tipo magliette, spille e stickers ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mgezs4/informazioni/"
    },
    {
        "id": "1mfwjyl",
        "author": "PsychologyCorrect152",
        "title": "amiche a torino",
        "content": "Ciao a tutti sono una ragazza di 36 anni in cerca di amicizie preferibilmente femminili.Sono molto sociale però da quando vivo qua a torino non sono riuscita a farmi molti amici...\nParlo anche perfettamente inglese se qualcuno vuole praticarlo ^^\nMi piace fare camminate,amo i gatti,mi piace cucinare e ho una passione molto grande per la Korea del sud.\nSpero di trovare qualche buon amica qua ^^",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mfwjyl/amiche_a_torino/"
    },
    {
        "id": "1mfr67p",
        "author": "Shot-Presentation250",
        "title": "Evento particolare in centro",
        "content": "Salve, non sono nato a Torino e sono qui solo da qualche anno , poi essendo studente la mia vita al di fuori della mie 4 mura non è il massimo ma non scrivo per questo, piuttosto per dirmi che non conosco i tipi famosi in zona. \n\nIeri decisi di fare una passeggiata in centro e di chillare su una panchina di fronte Biraghi . Dopo 10 minuti arriva un ragazzo con la bici, che forse qualcuno di voi conosce, che mi racconta di essere stato derubato e che aveva bisogno di soldi per comprare un biglietto flicbus per chissà dove , per tornare a casa. Gli ho fatto qualche domanda per capire la situazione ed era disperato così gli ho detto senza troppe pretese (anche onestamente perché mi intimidiva e preferivo quello ad uno scippo con minaccia annessa) che lo avrei aiutato  ma non sarei mai andato con lui da nessuna parte ad accompagnarlo chissà dove per un biglietto,  piuttosto gli davo dei soldi. Lui mi fa \"comunque guarda seguimi su instagram e chiedimi i soldi indietro , chiedine anche di più se vuoi\" alla fine gli do 20 euro e lui va verso la stazione.  Ad oggi non ho ricevuto nessun messaggio però con questo post voglio mettervi in guardia dal tipo.\nLa foto profilo la potete trovare sul suo profilo ig : mowgliskunk , ha una bici e vi farà vedere le sue mani nere perché \"ha cercato i suoi documenti sotto ogni auto di torino\" .\n\nSe ci dovessero essere sviluppi aggiornerò il post ma non penso sinceramente. ",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1mfr67p/evento_particolare_in_centro/"
    },
    {
        "id": "1mftn9e",
        "author": "_tarassaco",
        "title": "Conoscenze?",
        "content": "Ciaaao, mi trasferisco a Torino tra un mese e non conosco nessuno\nHo 19 anni, mi piace leggere, vagare senza meta per ore, guardare anime, andare a ballare, disegnare, a volte gioco alla switch o faccio robe col fil di ferro, mi piacciono un sacco le nuvole, sono dipendente solo da caffeina e nicotina, spesso mi dicono che quando parlo sembro fatta e rido molto spesso anche senza motivo\nSe qualche persona estroversa (o comunque con più capacità di socializzazione di me) volesse prendermi sotto la sua ala ne sarei molto molto grata..",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mftn9e/conoscenze/"
    },
    {
        "id": "1mfz23f",
        "author": "aanuliM",
        "title": "Planimetrie degli appartamenti di Torino",
        "content": "Buonasera, sono una studentessa fuorisede,  vivo a Torino da più di un anno, e anche se per ora non voglio ancora trasferirmi dal mio attuale appartamento, ogni tanto bazzico annunci online per curiosità, in particolare di bilocali e trilocali. Ho notato peroʻ che la maggior parte di essi, anche in belle zone, hanno delle metrature e planimetrie terribili, con questi pseudo open-space piccolissimi con divano affacciato direttamente sulla cucina, senza possibilità di mettere un bel mobile con tv, per non parlare dei bagni-corridoi nei quali si riesce a mala pena a camminare. Si tratta principalmente di appartamenti degli anni 60-70 (o anche più d' epoca a volte). \nVengo dalla provincia di milano e sono familiare con le planimetrie di quelli anni, ma qui a Torino mi sembrano fatti davvero male, con spazi angusti che difficilmente si possono sistemare con una ristrutturazione, a meno che non si voglia creare un Loft o simili. \n\nMi rivolgo quindi ad architetti o in generale chi lavora nel settore immobiliare. La mia impressione è fondata? Se si perchè si è deciso di procedere con questi progetti fatti così male? Capisco la speculazione legata al boom economico, ma ripeto nella provincia di Milano per quanto lo schema sia quello gli spazi risultano più decenti o per lo meno salvabili.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mfz23f/planimetrie_degli_appartamenti_di_torino/"
    },
    {
        "id": "1mg3loy",
        "author": "Effective_Device_356",
        "title": "Geopolitica Amatoriale",
        "content": "Ciao, ultimamente sono fissato con conferenze di Dario Fabbri, Lucio Caracciolo in alcuni si parla di Geopolitica (seguite il Podcast Imperium Areum). Mi piacerebbe scambiare qualche chiacchiera tipo: Perché il nazionalismo sembra torni sempre nei momenti di crisi? L'Italia ha bisogno di una politica alla Milei? La Cina è in crisi o ascesa? \n\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mg3loy/geopolitica_amatoriale/"
    },
    {
        "id": "1mfvvvf",
        "author": "silveringo",
        "title": "Friends",
        "content": "Ciao a tutti, mi sono lasciato 1 settimana fa e l'unico modo che ho per non pensarci è uscendo insieme a qualcuno. Vorrei fare nuove amicizie qua a Torino, maschi e femmine. Vado in palestra (fitactive) quindi potremmo andarci insieme, o semsemplicemente un'uscita tranquilla qua e là ogni tanto. \nSe mi dimentico di rispondere qua, chiedo scusa, vi lascio comunque IG: ananahhas_",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mfvvvf/friends/"
    },
    {
        "id": "1mflvjs",
        "author": "ImpressedGuy95",
        "title": "Cose divertenti",
        "content": "Ci sono attività divertenti e particolari da fare a Torino? Cerco qualcosa di diverso dalle solite proposte ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mflvjs/cose_divertenti/"
    },
    {
        "id": "1mfm7nr",
        "author": "Vinther000",
        "title": "Flower shop",
        "content": "Hello\nI’m looking for the best flower shop in the Torino area. Anyone have any recommendations?\nI’m looking to buy a bouquet of 100 red roses if possible. Any idea what the price might be?\nThank you in advance",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mfm7nr/flower_shop/"
    },
    {
        "id": "1mf2uwq",
        "author": "Careful_Molasses_496",
        "title": "Trovare un bilocale da studente è impossibile (rant)",
        "content": "Le garanzie non vanno bene: nemmeno le buste paga di qualche familiare al di sotto di 1500€ vengono prese in considerazione. I garanti devono essere in Italia, così come il contratto di lavoro a tempo indeterminato. Le agenzie chiedono due o tre mensilità, e ci sono anche agenzie fuffa e privati che truffano o vogliono affittare in nero. Spesso le richieste di affitto non vengono accettate per motivi non specificati: “la proprietà ha deciso di procedere con un altro candidato”. Prendere casa è peggio di un colloquio di lavoro. \n\nI prezzi non saranno quelli di Milano, ma è possibile che dopo quattro mesi sia ancora al punto di partenza? Non so se rassegnarmi e smettere di cercare durante agosto, ogni giorno controllo i gruppi Facebook e i principali siti d’affitto, ho anche le notifiche attive.\n\nTroverò una casa? A settembre compariranno magicamente centinaia di affitti che potranno esaudire la domanda? Chissà. \n\nP.S.: dimenticavo i bilocali di 40mq a 700€ che cadono a pezzi ",
        "upvotes": 20,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1mf2uwq/trovare_un_bilocale_da_studente_è_impossibile_rant/"
    },
    {
        "id": "1mfl4rz",
        "author": "Ryan-game",
        "title": "Distribuire volantini in centro per tredicenni",
        "content": "Vorrei guadagnare un po' di soldi e vorrei sapere (ovviamente con il consenso dei genitori) quali locali sono disposti per questo lavoro e  come chiederlo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mfl4rz/distribuire_volantini_in_centro_per_tredicenni/"
    },
    {
        "id": "1mfkmq1",
        "author": "Conscious-Trouble430",
        "title": "Searching For a Proper Pub",
        "content": "Apologies for writing in English.  I could also write this in Italian, but my target audience more likely speaks English.  \n\nI'll soon be retiring (at 60 yrs) in Rivoli and am looking for a proper pub to pass some time, drink some pints, watch some sports, and maybe even become a regular.  I understand and accept that pub culture is different in Italy and am not casting stones.  At the same time, I'd like a place to drink and speak English (although I can also carry on in Italian if needed).   Thanks in advance for any suggestions to try out.  Bonus points for 1) being &lt; 10 minute walk from the Metro and 2) having Guinness on tap.   ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mfkmq1/searching_for_a_proper_pub/"
    },
    {
        "id": "1meu7rj",
        "author": "vah_man_",
        "title": "Saturday market- Torino",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1meu7rj/saturday_market_torino/"
    },
    {
        "id": "1mfa3i0",
        "author": "yunitacuba",
        "title": "Cerco un gruppo o una comunità di mamme single.",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mfa3i0/cerco_un_gruppo_o_una_comunità_di_mamme_single/"
    },
    {
        "id": "1mewkcj",
        "author": "_jorjoVhanni",
        "title": "Gtt e abbonamento mensile",
        "content": "Sono da poco in città e volevo fare l'abbonamento mensile. Ma che razza di app/sito avete per la mobilità? Per fare l'abbonamento mensile devo fare la carta bip ma nelle opzioni nemmeno mi esce la possibilità di comprarlo. Lasciando stare la cagata di comprare un anno online e dover aspettare una tessere (tranne per la deroga di 7gg) ma mi sembra la classica cagata all' italiana per  autocomplicare le cose al cittadino. A Monaco tra un po' manco interessava chi ero quando facevo l'abbonamento.",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mewkcj/gtt_e_abbonamento_mensile/"
    },
    {
        "id": "1mfmv7k",
        "author": "Hungry_Order3086",
        "title": "Multe sospette",
        "content": "Sono incazzato nero. Due volte su 2 che mi prendo una multa (meritatamente) il sabato mattina verso le 10:30. Il problema qual è? L’unica macchina stronza con la multa ENTRAMBE le volte è la mia. La situazione è surreale e non c’è altra spiegazione se non una sorta di “razzismo” di targhe dato che la mia è targata Savona. Qual è la probabilità che fra 50 macchine senza biglietto la mia fosse l’unica con la multa. Ho le foto. Non ci credo che TUTTE le macchine fossero parcheggiate da dopo che i controlli hanno fatto le multe è impossibile. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1mfmv7k/multe_sospette/"
    },
    {
        "id": "1mf2bz1",
        "author": "4L3X_525",
        "title": "Ho trovato un mazzo di chiavi in via Caraglio",
        "content": "Vicino al lidl del palazzo lancia, se sapete scrivetemi in dm se siete i proprietari e date dettagli del mazzo. Questo lunedì lo porterò agli oggetti smarriti di via Antonio Meucci 4",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mf2bz1/ho_trovato_un_mazzo_di_chiavi_in_via_caraglio/"
    },
    {
        "id": "1meuixw",
        "author": "JazzlikeCommission30",
        "title": "Bardonecchia",
        "content": "Hello guys, my Friend and I want to spend a day in Bardonecchia  I would love to hear your advice on how to spend the day to enjoy the most of our time there. and one question how much we have to walk to get to the lake? ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1meuixw/bardonecchia/"
    },
    {
        "id": "1mf2777",
        "author": "Forward_Try3053",
        "title": "palestra a Torino: Mcfit o Fitactive?",
        "content": "Ciao!\nvivo a Torino da un po’ e stavo cercando una palestra non troppo costosa, ma con un buon rapporto qualità prezzo.\nDopo qualche ricerca sono arrivata a scegliere tra la Mcfit e la Fitactive, avete consigli? Si accettano anche altre proposte.\nIo sono circa in zona politecnico, quindi se sono ben collegate con i mezzi è anche meglio🙏🏼",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mf2777/palestra_a_torino_mcfit_o_fitactive/"
    },
    {
        "id": "1metnx1",
        "author": "Connect-Speech-7694",
        "title": "Persone al CCA",
        "content": "Ho da poco ricevuto la mail di ammissione al CCA di Torino. Questo post ha lo scopo di farmi entrare in contatto con persone che frequentano il CCA e con persone che si trovano nella mia stessa posizione.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1metnx1/persone_al_cca/"
    },
    {
        "id": "1mec7aw",
        "author": "whos_there1234",
        "title": "cerco di fare nuove amicizie questo agosto",
        "content": "Ciao a tutti. Sono 24 anni. Sono nuovo a Torino e dato che ad agosto tutti sono fuori, cerco di conoscere nuove persone. In genere la sera mi ritrovo spesso a voler uscire ma non so cosa fare (forse per mancanza di eventi o per mancanza di amici disponibili per uscite serali). Quindi spero di incontrare nuove persone con cui uscire... anche solo per un drink.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mec7aw/cerco_di_fare_nuove_amicizie_questo_agosto/"
    },
    {
        "id": "1me7pqh",
        "author": "DANYMATT47",
        "title": "Parcheggio retro Torino Stura",
        "content": "Ciao a tutti. Sapete per caso se il parcheggio all'aperto sul retro della stazione Torino Stura sia gratuito o meno? Lascio foto di Maps con posizione per riferimento.\n\nGrazie",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iq5vsqf2v8gf1.jpeg?auto=webp&amp;s=82c6d3c0a2c241d8eb7724820dfaafc2faa501f4"
        },
        "permalink": "/r/torino/comments/1me7pqh/parcheggio_retro_torino_stura/"
    },
    {
        "id": "1mdwtzm",
        "author": "0rk4n",
        "title": "Torino o Urbino? Consigli per scelta universitaria e vita in coppia",
        "content": "Ciao a tutti, io lavoro full remote nell’IT, mentre lei si è appena laureata in Scienze Farmaceutiche (triennale) e ora vorrebbe completare il percorso con la magistrale in Farmacia per poi iscriversi all’albo. Stiamo valutando dove trasferirci e le opzioni sono Torino e Urbino, perché in entrambe le sedi il corso di Farmacia non ha obbligo di frequenza – caratteristica fondamentale, visto che vorrebbe lavorare part-time mentre studia.\n\nPremetto che non siamo mai stati in nessuna delle due città, quindi ci stiamo basando su ricerche online e pareri raccolti qua e là. Vi spiego i dubbi.\n\nUrbino: cittadina molto carina, tranquilla, a misura d’uomo. Non ci piace la movida o la discoteca, quindi da questo punto di vista sarebbe perfetta. È vicina a Pesaro e al mare (ok, non la Sardegna da cui vengo io, ma sempre meglio di niente). Il costo della vita è basso e gli affitti sembrano accessibili. Però… sembra davvero molto isolata. Trasporti scarsi, nessun aeroporto vicino, collegamenti complicati. E mi sembra un po’ carente anche dal punto di vista dei servizi sanitari (mi pare che per molte cose si debba andare a Pesaro).\n\nTorino: città molto più grande e ben servita, sia a livello sanitario che trasporti (aeroporto, treni, ecc.). Più opportunità anche per lei, sia per trovare un lavoretto durante l’università, sia post-laurea. La sede della mia azienda è proprio a Torino, quindi ogni tanto potrei lavorare in sede e conoscere i colleghi dal vivo. Tante cose da fare nei weekend (senza bisogno di essere festaioli): musei, mercatini, montagne vicine, città storiche nei dintorni. Di contro: costo della vita più alto, città più dispersiva, e il corso di farmacia potrebbe essere più impegnativo rispetto a Urbino (lei teme questo).\n\nInfo aggiuntive: ho la macchina, quindi potrei tranquillamente spostarmi anche da zone un po’ più esterne.  \nA Torino, quali quartieri consigliereste per vivere tranquilli ma senza essere troppo isolati? Con un budget di circa 500/600 euro per un bilocale è ancora possibile trovare qualcosa di decente)?\n\nInsomma: qualcuno ha vissuto in una (o entrambe) le città? Come vi siete trovati?E per chi ha studiato farmacia: quanto cambia davvero la difficoltà tra le sedi? E sui costi/zone: che ne pensate?\n\nOra devo in qualche modo \"convincere\" la mia ragazza ahahaaha. In ogni caso é una cosa temporanea, male che vada, post laurea ci si sposta a Torino o altrove (se si sceglie Urbino in quanto l'universitá é piu semplice).",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mdwtzm/torino_o_urbino_consigli_per_scelta_universitaria/"
    },
    {
        "id": "1mdgf9n",
        "author": "asilorepublic",
        "title": "Ma perché se non si conosce la strada a Torino, è così difficile guidare Soprattutto agli incroci con semafori?",
        "content": "Vedo incroci con semafori fatti alla cavolo, cartelli messi alla cavolo sulla carreggiata, proprio come dire io ve l ho messo poi se lo vedete bene se no amen... Ci dovrebbe essere una regola univoca... Agli incroci senza controviali si può svoltare, Mentre quando c'è ilccontro Viale, bisogna prendere quello.. Boh.. Ci voleva tanto? ",
        "upvotes": 33,
        "comments": 51,
        "media": null,
        "permalink": "/r/torino/comments/1mdgf9n/ma_perché_se_non_si_conosce_la_strada_a_torino_è/"
    }
]