[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 156,
        "comments": 570,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n38enm",
        "author": "ADMlN-",
        "title": "What \"Unknown Number: The Highschool Catfish\" totally downplayed...",
        "content": "**Why did Kendra go after Owen's** ***new*** **girlfriend, a full year after he and Lauryn broke up?**\n\nThat isolated single detail proves this had absolutely nothing to do with protecting her daughter and everything to do with her own predatory obsession with Owen. Owen's mom tried to point it out, but they barely gave her a voice.\n\nIt feels like the real story was \"Predatory Mom Coach\" but decided \"Highschool Catfish Story\" was way more marketable. It's like they are deliberately downplaying the darkest part of this story and perpetuating Kendra's misdirection/manipulation.",
        "upvotes": 52,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1n38enm/what_unknown_number_the_highschool_catfish/"
    },
    {
        "id": "1n3505s",
        "author": "Mysterious-Hold-2",
        "title": "Thumbs down to the new Netflix layout",
        "content": "I have let it sit for moment, given it a fair go, but I really don't like the new layout. It makes it harder to scroll through shows period.\n\nDo you need a TV the size of the Titanic wooden plank that saved Rose just to make it usable?",
        "upvotes": 35,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n3505s/thumbs_down_to_the_new_netflix_layout/"
    },
    {
        "id": "1n3ajz4",
        "author": "unfiltered_12345",
        "title": "Need a thriller series to binge watch on Netflix",
        "content": "In desperate need of new series to watch, can't seem to stick to anything \nSo need a series that is dark, mysterious and very thrilling to watch.\nA series I cam binge watch in a day or over a few weeks.",
        "upvotes": 14,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ajz4/need_a_thriller_series_to_binge_watch_on_netflix/"
    },
    {
        "id": "1n2q9f9",
        "author": "BrettJoz",
        "title": "We’re getting another series based on a serial killer apart of the Monster series.",
        "content": "As a huge fan of the Monster Series, I’m glad they’re making another one based on Ed Gein.\n\nFor those who don’t know who Ed Gein is, he’s a serial killer who would skin his victims &amp; wear their skin as a mask. \n\nFun fact: Leatherface is actually based on Ed Gein",
        "upvotes": 140,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1n2q9f9/were_getting_another_series_based_on_a_serial/"
    },
    {
        "id": "1n3c3xm",
        "author": "Low_Independent_6204",
        "title": "PSA: younger",
        "content": "idk how i (f 36) slept on 7 seasons of this! no one told me it was sutton foster and hilary duff? and yes it’s not *amazing tv* but it’s different and a little edgy n silly. and i love a bingeable watch. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n3c3xm/psa_younger/"
    },
    {
        "id": "1n3a20t",
        "author": "exhaustedlittlething",
        "title": "Totally enjoyed The Thursday Murder Club movie. Any similar recommendations?",
        "content": "I just watched The Thursday Murder Club and loved it! Now I’m in the mood for more cozy-but-smart mystery stories. Do you have any suggestions for movies or series with a similar vibe (lighthearted mystery, witty characters, not too dark)? Doesn’t have to be on Netflix… open to any platform. Thank you! ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n3a20t/totally_enjoyed_the_thursday_murder_club_movie/"
    },
    {
        "id": "1n3c1bo",
        "author": "MysteriousDelay6266",
        "title": "French Lover | Official Trailer | Netflix | SEPTEMBER 26",
        "content": "# FRENCH LOVER\n\n**September 26 only on Netflix.**\n\nWhen a jaded actor meets a down-on-her-luck waitress in Paris, their unexpected love story begins — but will it survive the glare of the spotlight?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3c1bo/french_lover_official_trailer_netflix_september_26/"
    },
    {
        "id": "1n360d6",
        "author": "Special_Country228",
        "title": "My Life With The Walter Boys SEASON 2 Every SONG",
        "content": "Hi All, I made a playlist with every song from the 2nd season, following the order of the episodes. I hope you like it! :)  \n[https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5](https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n360d6/my_life_with_the_walter_boys_season_2_every_song/"
    },
    {
        "id": "1n226i0",
        "author": "Street_Firefighter_7",
        "title": "The gabby petito story was removed off Netflix",
        "content": "I noticed that the movie is now removed after only being on the platform for less than 24 hrs. I paused it and came back to watch it and now it’s gone and I’m even getting errors whenever I click on the Netflix link for the movie. Anyone know why it was removed? ",
        "upvotes": 634,
        "comments": 232,
        "media": null,
        "permalink": "/r/netflix/comments/1n226i0/the_gabby_petito_story_was_removed_off_netflix/"
    },
    {
        "id": "1n2izkg",
        "author": "peoplemagazine",
        "title": "Netflix Star Verónica Echegui Dies at 42 After Secret Cancer Diagnosis",
        "content": "",
        "upvotes": 47,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n2izkg/netflix_star_verónica_echegui_dies_at_42_after/"
    },
    {
        "id": "1n2yvon",
        "author": "Southern-Brother5693",
        "title": "My Continue Watching List - Glitches",
        "content": "For the past month, my Continue Watching list keeps including titles I have already watched. They appear and disappear suddenly. Informed Netflix about this but there has been little change.\n\nAnyone facing the same issue?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2yvon/my_continue_watching_list_glitches/"
    },
    {
        "id": "1n20z4c",
        "author": "A-Dog22",
        "title": "Sony sold Netflix the rights to ‘KPop Demon Hunters’ in a pandemic-era safety play—and now it’s Netflix’s biggest movie ever",
        "content": "",
        "upvotes": 629,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1n20z4c/sony_sold_netflix_the_rights_to_kpop_demon/"
    },
    {
        "id": "1n2uv12",
        "author": "CriticalSmile5943",
        "title": "Horror movie suggestions",
        "content": "I need a good horror movie or series to watch… tell me of one that is a little obscure that maybe i haven’t seen that is currently available to watch.\n\nCan someone help me find something good to watch??",
        "upvotes": 10,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1n2uv12/horror_movie_suggestions/"
    },
    {
        "id": "1n32heo",
        "author": "Joseph165234",
        "title": "Netflix plays indefinitely on iPad",
        "content": "Hi all, \n\nI like to fall asleep with a show playing in the background. \n\nOn my phone, after a few episodes, it knows I’m not watching anymore and turns itself off for the rest of the night. \n\nOn my new iPad, I will wake up and it’s still playing. \n\nSame account and everything. Is there any way to change this? \n\nThank you ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n32heo/netflix_plays_indefinitely_on_ipad/"
    },
    {
        "id": "1n34hn3",
        "author": "anjris",
        "title": "Stranger Things S4E9 not detecting dolby Vision",
        "content": "Hi All,  \n  \nAs a huge fan of *Stranger Things*, I was recently rewatching the series on the Ultra HD Premium plan. I observed that all episodes across Seasons 2, 3, and 4 stream in Dolby Vision—except for one specific episode:\n\n\n\n* **Season 4, Episode 9: “The Piggyback”**\n\n\n\nTo troubleshoot, I tested playback across multiple Dolby Vision–capable TVs, operating systems, and platforms, all with a stable internet connection. The issue persists everywhere. I also confirmed that the Netflix app is up to date on all devices.\n\n\n\nIt seems highly unlikely that just one episode of a particular season would not be mastered in Dolby Vision while all the others are.\n\n\n\n*(****Note****: I’m aware that Stranger Things Season 1 was not mastered in Dolby Vision, so I’m not referring to that.)*",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n34hn3/stranger_things_s4e9_not_detecting_dolby_vision/"
    },
    {
        "id": "1n30h4z",
        "author": "akay92",
        "title": "Scandal &amp; Grey's Anatomy disappeared from my Indian netflix account. Just me?",
        "content": "Apparently  Scandal returned to Netflix after 5 years this June. So not sure what's happening. I had just started S2 and now it's nowhere to be found. Logged out and logged in again already so any other solution is welcome :)\n\nAnyone else facing this? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n30h4z/scandal_greys_anatomy_disappeared_from_my_indian/"
    },
    {
        "id": "1n2zrd4",
        "author": "GenTrapstar",
        "title": "Not Under the Same Household Options",
        "content": "Right now while on my lunch break I get the notification that my account isn’t under the same roof. It’s just be and my mom on this account. We live under the same roof. For the past I don’t kno how many years on my lunch break I watch an episode of something. For the last two years it has been the same phone at the same place and same time. Now all of a sudden I’m getting this message. Is it possible to fix this or am I stuck to watching Netflix just at home? Also wonder if it matters that I only view Netflix on my phone away from home. I use Netflix on my Xbox at home so I guess since it hasn’t seen my phone signed into Netflix at home on the network it thinks it’s not under the same roof. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n2zrd4/not_under_the_same_household_options/"
    },
    {
        "id": "1n2x7ts",
        "author": "BlahblahblahLG",
        "title": "Why was the Gabby Petito Story removed from Netflix?",
        "content": "Does anyone know?\n\nI was watching it and had to pause and do something then when I came back to finish it, it had been removed!! I tried to Google what happened, but haven't found anything about it. Does anyone know? ",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1n2x7ts/why_was_the_gabby_petito_story_removed_from/"
    },
    {
        "id": "1n2va3r",
        "author": "ninjascotsman",
        "title": "Wayward Trailer",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2va3r/wayward_trailer/"
    },
    {
        "id": "1n2ar5g",
        "author": "FlareGamer64",
        "title": "Series recommendations with episodes that are specifically 20-35 minutes long?",
        "content": "Most shows I've watched on Netflix are 40-50 minutes long (Breaking Bad, Better Call Saul, Resident Alien, Untamed) which is fine but sometimes I need something a bit shorter before I go out. The Thin Blue Line has been perfect for this purpose but I'm almost done with it. I don't care if it's a drama or a animated show, just give me those recommendations.",
        "upvotes": 49,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1n2ar5g/series_recommendations_with_episodes_that_are/"
    },
    {
        "id": "1n292d8",
        "author": "BossJosh74",
        "title": "Thursday Murder Club is great!",
        "content": "I dont want to rush through the series of books, but Chris Columbus, this cast, this crew, during Christmas would be absolutely CINEMA. netflix plz more.",
        "upvotes": 44,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n292d8/thursday_murder_club_is_great/"
    },
    {
        "id": "1n2zqum",
        "author": "ConnectionStrong8385",
        "title": "'My Life With the Walter Boys' Star Carson MacCormac on Joining the Cast for Season 2, Playing Zach and that Hallway Scene with Corey Fogelmanis.",
        "content": "Exclusive 'My Life With the Walter Boys' Interview with Carson MacCormac on Playing Zach, Joining the cast for Season 2, his creative process, favourite sequence, that Hallway Scene with Corey Fogelmanis and more!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2zqum/my_life_with_the_walter_boys_star_carson/"
    },
    {
        "id": "1n2nmgs",
        "author": "Individual-Gas5276",
        "title": "Anyone else getting these Netflix “account suspended” messages?",
        "content": "I’ve been getting these weird messages saying my Netflix account is suspended and I need to “log in” to fix it. The page even has a “Continue with Facebook” button. Feels super sketchy. Is this a new scam? Anyone else seeing this?",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n2nmgs/anyone_else_getting_these_netflix_account/"
    },
    {
        "id": "1n2p74f",
        "author": "bestcmw",
        "title": "Anybody know what is going on with the loading logo?",
        "content": "Yellow graphic with negative space asterisk. I thought imagined it. Theres an image just before the Netflix logo appears. Probably nothing, but I have never seen it before. Anyone else seeing it when opening the app?",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rkwyoz7iytlf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n2p74f/anybody_know_what_is_going_on_with_the_loading/"
    },
    {
        "id": "1n2twvb",
        "author": "AccomplishedPut5175",
        "title": "Suburræterna any news for S2?",
        "content": "Any news for this show on S2?\nI try to find some news but nothing!\nIf somebody know please tell us.\nWho like Gomora tv shows,must watch this.\nGod bless you all☘️☘️",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n2twvb/suburræterna_any_news_for_s2/"
    },
    {
        "id": "1n28v3l",
        "author": "nemopost",
        "title": "Have 20 or so years I have downgraded my Netflix plan.",
        "content": "I went from the top tier 4k plan to 1080p with commercials.  We watch netflix less now and don’t see a reason why we should be paying $30 for one service when we used to pay $50 for many back in the day on cable tv.  Now I hear the prices are going up again.  Something had to give. The new shows are less intriguing than they were, its just not worth it anymore. ",
        "upvotes": 16,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1n28v3l/have_20_or_so_years_i_have_downgraded_my_netflix/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 118,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n2e0iq",
        "author": "keepitwildinwyo",
        "title": "Movie night for kids ages 4-9",
        "content": "I’m hosting a popcorn, pizza, and movie night at my house and want to have a fun movie for both groups, but maybe not something they’ve seen or popular at the moment. Any ideas/recs? ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1n2e0iq/movie_night_for_kids_ages_49/"
    },
    {
        "id": "1n2dend",
        "author": "fergrim85",
        "title": "Million Dollar Secret - i know I'm a bit behind the times here, but did anyone else notice Cara's clearly fabricated claims about her father's illness?",
        "content": "She claimed he had \"lymphoma, melanoma and leukemia\" which is nearly a statistical impossibility. (it's not impossible but the odds are astronomically low)\n\nAnd I mean, that's fine, the show is about lying liars who are lying.  But what made it bizarre is it wasn't something she talked about with fellow contestants, but in confessionals, \n\nAnd what made it even stranger to me is that the edit never keyed in on the magnitude of that particular lie.\n\nLying about a family member having a life threatening illness is tasteless and arguably immoral, but lying about it in such an exaggerated fashion is...a sign of severe issues working things out with reality.  It's the sort of thing someone with schizophrenia might say.\n\nAnyway I was just surprised not to see a single mini article mention it, or to see anyone mention it in the breakdown threads after her win.  Given it was such a gimme and an obvious WTF moment as she said it.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2dend/million_dollar_secret_i_know_im_a_bit_behind_the/"
    },
    {
        "id": "1n2xxph",
        "author": "GrayNOIEN",
        "title": "Who's realistically winning in a fight?",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n2xxph/whos_realistically_winning_in_a_fight/"
    }
]