[
    {
        "id": "1nekeg4",
        "author": "lionsgate",
        "title": "Hi /r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today. Ask me anything!",
        "content": "Hi r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today and also stars Cooper Hoffman, David Jonsson, Charlie Plummer, Ben Wang, Mark Hamill, and Judy Greer.  \n\nYou might also know me from things like Manifest, God Is A Bullet, Ransom Canyon, and Pretty Little Liars: The Perfectionists. Here to answer your questions!\n\nTrailer: \n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\nSynopsis:\n\nFrom the highly anticipated adaptation of master storyteller Stephen King’s first-written novel, and Francis Lawrence, the visionary director of The Hunger Games franchise films (Catching Fire, Mockingjay – Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes), comes THE LONG WALK, an intense, chilling, and emotional thriller that challenges audiences to confront a haunting question: how far could you go?\n\nOut in theaters today.\n\nAsk me anything! Back tomorrow Friday 9/12 at 12:00 PM ET to answer your questions.",
        "upvotes": 200,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wyz6nv6bmlof1.png?auto=webp&amp;s=f693f5d1d583890b80b7dbbb830d97d2f923dbb1"
        },
        "permalink": "/r/movies/comments/1nekeg4/hi_rmovies_im_garrett_wareing_actor_in_lionsgates/"
    },
    {
        "id": "1nf38wo",
        "author": "TheThreesomeAMA",
        "title": "Hey /r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!",
        "content": "Hey r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!\n\nMy credits:\n\n[https://www.imdb.com/name/nm1029961/](https://www.imdb.com/name/nm1029961/)\n\nMore information about the film:\n\n**Official Trailer:**\n\n[https://youtu.be/Mafhm2\\_5Pzc](https://youtu.be/Mafhm2_5Pzc)\n\n* Directed by Chad Hartigan - Written by Ethan Ogilby\n* Starring Zoey Deutch, Jonah Hauer-King, Ruby Cruz, Jaboukie Young-White, Josh Segarra, Robert Longstreet, Arden Myrin, Kristin Slaysman, Allan McLeod, and Julia Sweeney\n\n&gt;An impulsive night leads to a wild threesome between Olivia (Zoey Deutch), Connor (Jonah Hauer-King), and Jenny (Ruby Cruz), leaving both women facing unexpected consequences, thrusting all three into the raw and beautifully messy chaos of adulthood.\n\nOut now in theaters! Ask me anything I'll be back at 3 PM ET today (Friday 9/12) to answer your questions.\n\n",
        "upvotes": 58,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cufizw27jqof1.png?auto=webp&amp;s=bad2315869f069f5f47524beafd7a70585644ebc"
        },
        "permalink": "/r/movies/comments/1nf38wo/hey_rmovies_im_chad_hartigan_director_of_the/"
    },
    {
        "id": "1nh0nq2",
        "author": "EuphoricButterflyy",
        "title": "‘The Shining’ (1980) named Stephen King’s best film adaptation ever by Time",
        "content": "",
        "upvotes": 4901,
        "comments": 972,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rP56pq2cwSFh9tRM2b5Vk23l4YHYzY1n0i8M9WtWuMA.png?auto=webp&amp;s=2d83724b9e47458b2dfa82800625abd40153ac9c"
        },
        "permalink": "/r/movies/comments/1nh0nq2/the_shining_1980_named_stephen_kings_best_film/"
    },
    {
        "id": "1nh8nll",
        "author": "NoCulture3505",
        "title": "Springsteen: Deliver Me From Nowhere | Official Trailer",
        "content": "",
        "upvotes": 609,
        "comments": 181,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TWeCCO7o7WqqjQhlbyf7RjKrwUcbkYXgBrIZJCvDwGU.jpeg?auto=webp&amp;s=61117cc04304c185e82fa5c0ad5efa3e7c01786d"
        },
        "permalink": "/r/movies/comments/1nh8nll/springsteen_deliver_me_from_nowhere_official/"
    },
    {
        "id": "1ngvgp3",
        "author": "1961Deckard",
        "title": "Ann Miller dances in the musical 'Time Out For Rhythm', 1941",
        "content": "",
        "upvotes": 1990,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cbpqyr34o5pf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngvgp3/ann_miller_dances_in_the_musical_time_out_for/"
    },
    {
        "id": "1nh94sb",
        "author": "the_hudge",
        "title": "Best use of the “wait how did you know that?” reveal?",
        "content": "Many movies have done the trope where a character reveals information they technically shouldn’t have (“I never said how he died. I just said he died. How did you know he was stabbed?”) and the lead discovers they aren’t who they say they are. What do you think is the best use of this trope?\n\nMy example is pretty much ripped straight from Reindeer Games which maybe isn’t the best use of it, but I sure do love it. ",
        "upvotes": 246,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1nh94sb/best_use_of_the_wait_how_did_you_know_that_reveal/"
    },
    {
        "id": "1ngsskh",
        "author": "bilhugs",
        "title": "Movies with sequels that start immediately after the previous one ends.",
        "content": "I was trying to think of movies where the story starts immediately after when the previous one leaves off. This came up when my son and I were about to watch the Back to the Future sequels. I think Quantum of Solace is like that too. Can you think of any others?\n\n\n(These are some more characters so I can abide by the goofy rules.)\n\n\n\n\n\n\n\n\n",
        "upvotes": 1888,
        "comments": 1842,
        "media": null,
        "permalink": "/r/movies/comments/1ngsskh/movies_with_sequels_that_start_immediately_after/"
    },
    {
        "id": "1nh8nob",
        "author": "HazelsWarren",
        "title": "Debbie Reynolds jumps out of a cake and performs \"All I Do is Dream of You\" for \"Singin' in the Rain\" (1952)",
        "content": "I tried to learn this routine in high school - it's such a fun song! ",
        "upvotes": 168,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rY-oG0PBdojj-N34P6dupSMFdL_b4ZAJAMaxCbApUzk.jpeg?auto=webp&amp;s=ac31c57ad7d5172aa2c56b330660e69dcfd7dd9b"
        },
        "permalink": "/r/movies/comments/1nh8nob/debbie_reynolds_jumps_out_of_a_cake_and_performs/"
    },
    {
        "id": "1ngpmri",
        "author": "Laurie_Barrynox",
        "title": "\"Last Action Hero\" nearly ended Arnold Schwarzenegger's career and it ended up being a cult favorite. Why did the public didn't get it?",
        "content": "It probably was marketed as a generic action film and it was anything but. The film was more of a satire of the genre and Schwarzenegger, who's got a inate talent for comedy, gleefully plays with his image, mocking the films he's known for and even himself. \n\nAustin O'Brien is a decent kid lead, a solid focal point for the public, and a strong supporting cast. Switching from humor into big action scenes, Last Action Hero was a good time. \n\nUnfortunately, the public didn't get it. They expected a \"straight# action film and it wasn't what they got. You can sense the passion and fervor for film as an art throughout.",
        "upvotes": 1857,
        "comments": 900,
        "media": null,
        "permalink": "/r/movies/comments/1ngpmri/last_action_hero_nearly_ended_arnold/"
    },
    {
        "id": "1ngvnkv",
        "author": "BunyipPouch",
        "title": "First Poster for Psychological-Horror 'Somnium' - At the experimental sleep clinic Somnium, dreams become real. Side effects include hallucinations, confusion, paranoia, sleep paralysis, detachment from reality, a lost sense of self and permanent nightmares.",
        "content": "",
        "upvotes": 771,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uvhdpviap5pf1.jpeg?auto=webp&amp;s=fb3fbbc4c81190ff84bd388189d5bf3922847929"
        },
        "permalink": "/r/movies/comments/1ngvnkv/first_poster_for_psychologicalhorror_somnium_at/"
    },
    {
        "id": "1nh0xzd",
        "author": "systemstheorist",
        "title": "Double Indemnity (1944) - Accident Insurance - scene starring Barbara Stanwyck and Fred MacMurray",
        "content": "",
        "upvotes": 370,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rs41bkp5p6pf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nh0xzd/double_indemnity_1944_accident_insurance_scene/"
    },
    {
        "id": "1nhakkk",
        "author": "EmergencySherbet9083",
        "title": "A movie that’s aged well:  The Truman Show",
        "content": "I just watched it for the first time in years.  Ed Harris is masterful.  Jim Carrey is fantastic.  \n\nThe cinematography, graphics, etc are all great.   \n\nThe end scene, I couldn’t tell Truman was on a set right up until he crashed into it. And there are so many unique camera angles.  \n\nI just feel like it’s a movie that was ahead of its time. \n\nEdit:  30 years ago, the premise of this movie was laughable, satirical.\n\nIn 2025?  I’m almost surprised it hasn’t happened already ",
        "upvotes": 97,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1nhakkk/a_movie_thats_aged_well_the_truman_show/"
    },
    {
        "id": "1ngt5e5",
        "author": "adrrriz",
        "title": "Saddest movies you’ve ever seen.",
        "content": "My friend has never cried at a movie. I have pitched the following movies for her to watch that made me blubber like an idiot. Please share your recommendations in the comments. Do your absolute worst. I want her to regret this. Movies I pitched;\n\nStepmom, 98’\nSimon Birch, 98’\nGloria, 99’\nBicentennial Man, 99’\nA Walk to Remember, 02’\n\n\n",
        "upvotes": 845,
        "comments": 3447,
        "media": null,
        "permalink": "/r/movies/comments/1ngt5e5/saddest_movies_youve_ever_seen/"
    },
    {
        "id": "1nh3jvj",
        "author": "FreshmenMan",
        "title": "What is one Actor whose success surprised Everyone?",
        "content": "Question, What is one actor whose success surprise you?\n\nWhat I mean is Actors, who many people, audience or in the industry, just wrote off and didn't think they have much success and didn't think they survive long in the industry, but then surprises everyone &amp; achieving that success and becoming popular. \n\nI am just curious if there are stories like that?",
        "upvotes": 232,
        "comments": 644,
        "media": null,
        "permalink": "/r/movies/comments/1nh3jvj/what_is_one_actor_whose_success_surprised_everyone/"
    },
    {
        "id": "1nh89wi",
        "author": "AustenBoyd062172",
        "title": "what’s the most unforgettable movie scene carried entirely by performance?",
        "content": "I’m curious to hear your choice. I’ll start: the first meeting between Anthony Hopkins’ Hannibal Lecter and Jodie Foster’s Clarice Starling in The Silence of the Lambs is, to me, one of the most unforgettable scenes in film history. The writing is brilliant, of course, but the tension, menace, and vulnerability come almost entirely from the performances. At its core, it’s just an FBI trainee interviewing a prisoner—but Hopkins and Foster transform it into a masterclass in acting, making it unforgettable.\n\nEdited ",
        "upvotes": 115,
        "comments": 215,
        "media": null,
        "permalink": "/r/movies/comments/1nh89wi/whats_the_most_unforgettable_movie_scene_carried/"
    },
    {
        "id": "1ngvsnf",
        "author": "spank-you",
        "title": "I just now realized, after watching Wayne's World for 30 years, that \"Noah's Arcade\" is a play on \"Noah's Ark\".",
        "content": "What other obvious things in a movie did you not get when you saw it as a child, and should have gotten, but only got it far too long after?\n\nA bonus for me was when the blue ray for princess bride came out and I could finally turn on subtitles for Fezzik. I could never understand what he was saying during his fight with the man in black.",
        "upvotes": 450,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1ngvsnf/i_just_now_realized_after_watching_waynes_world/"
    },
    {
        "id": "1ngtw79",
        "author": "ChiefLeef22",
        "title": "TIFF 2025: Chloe Zhao's 'Hamnet' wins People's Choice Award, Guillermo Del Toro's 'Frankenstein' finishes as runner-up and 'Wake Up Dead Man' as 2nd runner-up; Park Chan Wook's 'No Other Choice' wins International People's Choice Award",
        "content": "",
        "upvotes": 468,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zx0rljAAmOFK3_s1LX8X2poiS01H3O8yr1k1MAU8wmc.jpeg?auto=webp&amp;s=30761de6a9cb2d771c018b6c5f66cb0733a7f4da"
        },
        "permalink": "/r/movies/comments/1ngtw79/tiff_2025_chloe_zhaos_hamnet_wins_peoples_choice/"
    },
    {
        "id": "1nhb13z",
        "author": "Miserable-Anxiety-40",
        "title": "Road to Perdition (2002) Tom Hanks, Paul Newman, Daniel Craigs",
        "content": "I watched it for the first time after getting a little sloshed sitting my my living room on Friday night. I watched it again today... That said...\n\nRoad to Perdition blew me away. I went in expecting just another mob movie, but it’s honestly so much more than that. Yeah, it’s got gangsters, guns, and double-crosses, but at its core it’s really about fathers and sons, and what kind of legacy you pass on. The movie hooked me.\n\nTom Hanks is not the guy you usually think of as a mob hitman, but he absolutely kills it here. He’s scary when he needs to be, but you can also see the love he has for his kid in every scene. Paul Newman, in one of his last roles, just commands the screen. Every line out of his mouth feels heavy, like he knows the end is coming. And then there’s Jude Law… holy hell. He plays this weird, creepy photographer/hitman who made me uncomfortable every time he showed up. \n\nBut honestly, the thing that pushes this movie from “good” to “great” is how it looks. The cinematography is insane. Every frame could be a painting. The way they use rain, shadows, and silence is unreal. That big rain-soaked shootout? One of the coolest scenes I’ve ever seen. No music, no flashy editing—just raw atmosphere. It’s beautiful and brutal at the same time.\n\nWhat surprised me the most was how emotional it is. By the end, I wasn’t just watching a mob story—I was thinking about family, choices, and how hard it is to break cycles of violence. It’s tragic but also kind of hopeful in its own way.\n\nThe movie left me feeling... I don't know. You know that feeling when you're sitting by yourself, late at night, in the quiet, rain outside, with a drink in your hand? Not necessarily worried about anything, but a small feeling of sadness? Thats what this movie felt like. And I love it.",
        "upvotes": 43,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1nhb13z/road_to_perdition_2002_tom_hanks_paul_newman/"
    },
    {
        "id": "1ngzmlv",
        "author": "EuphoricButterflyy",
        "title": "Marilyn Monroe performs “Every Baby Needs a Daddy” in ‘Ladies of the Chorus’ (1948)",
        "content": "",
        "upvotes": 182,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ta21sh5pg6pf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngzmlv/marilyn_monroe_performs_every_baby_needs_a_daddy/"
    },
    {
        "id": "1ngvsjb",
        "author": "cyPersimmon9",
        "title": "It would be cool if Disney made another Fantasia",
        "content": "",
        "upvotes": 278,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YxCInuk7DEXjvLn3Dc8oHrb-IQueIwKFf18BQxGlqU4.jpeg?auto=webp&amp;s=f3e905a81b0ed15c395bb634b8a8ced88a789c94"
        },
        "permalink": "/r/movies/comments/1ngvsjb/it_would_be_cool_if_disney_made_another_fantasia/"
    },
    {
        "id": "1ng6s29",
        "author": "MarvelsGrantMan136",
        "title": "Ice Cube Says He Shot His ‘War of the Worlds’ Scenes in 15 Days Without the Director or Other Actors",
        "content": "",
        "upvotes": 23956,
        "comments": 1338,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rVrRAw0k3j2rptO-AUoaXwXDT7xYMjVIFfsY2KPJExs.jpeg?auto=webp&amp;s=f5737ece3ace9be4e37848b7774830344a010487"
        },
        "permalink": "/r/movies/comments/1ng6s29/ice_cube_says_he_shot_his_war_of_the_worlds/"
    },
    {
        "id": "1ngs8wn",
        "author": "MarkWhittington",
        "title": "Apollo 13 made Jim Lovell a legend generations after the space race",
        "content": "",
        "upvotes": 295,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/70yYEqsG0d5xoDp0lc7WKYebubADAhPLYUCtuvlfAlY.jpeg?auto=webp&amp;s=42de935df10258260e57f0caf168edcbc7ee4bf5"
        },
        "permalink": "/r/movies/comments/1ngs8wn/apollo_13_made_jim_lovell_a_legend_generations/"
    },
    {
        "id": "1nheybn",
        "author": "pishposhpoppycock",
        "title": "Most satisfying revenge in a film?",
        "content": "How would you rank how satisfying their revenge felt when you watched these films, from most satisfying to least:\n\nAlessa - Silent Hill and the entire church sequence\n\nLee Woo-jin - Oldboy\n\nAnnie, Elise, and Brenda - The First Wives Club\n\nThe Bride - Kill Bill vols 1 and 2\n\nEdmond Dantès - The Count of Monte Cristo\n\nPorter - Payback\n\nJohn Wick - John Wick\n\nCarrie - Carrie\n\nInigo Montoya - The Princess Bride",
        "upvotes": 11,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1nheybn/most_satisfying_revenge_in_a_film/"
    },
    {
        "id": "1nh6sxw",
        "author": "PerroRosa",
        "title": "What classic film -from any time- lived up to the expectations once you finally got to watch it?",
        "content": "I was quite certain that I was not going to like Taxi Driver and avoided it for a long while. I knew it had to be a good movie, of course, but I was sure many of the things Scorsese is great at weren't going to be up to the level of his later works. \n\nOnce I got to watch it I realize what a masterpiece the movie is on some many aspects. Not only that, but realized it is another of those movies that either invented or highlighted stuff that are still imitated today. \n\nNow, my expectations were low and maybe that why I could appreciate it better, but I still think that I was going to appreciate this masterpiece either way.",
        "upvotes": 34,
        "comments": 127,
        "media": null,
        "permalink": "/r/movies/comments/1nh6sxw/what_classic_film_from_any_time_lived_up_to_the/"
    },
    {
        "id": "1nh5xa3",
        "author": "Demir3kardes",
        "title": "İ want to find a high quality image of this poster",
        "content": "İ want to own a copy of this poster but since its an old poster originals are expensive abd since its a turkish poster no one seems produce it so i want to print it myself but couldnt find a high quality picture of it. İf you dont have high quality version of this but find someone that sells it feel free to share.",
        "upvotes": 37,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y1zo47v9q7pf1.jpeg?auto=webp&amp;s=0d2a72de46ed76b21ac27e3cfd9fbee066461fef"
        },
        "permalink": "/r/movies/comments/1nh5xa3/i_want_to_find_a_high_quality_image_of_this_poster/"
    },
    {
        "id": "1ngn6j8",
        "author": "KlutchAtStraws",
        "title": "Movies that were terrible adaptations of their source material",
        "content": "There are so many to choose from but one of the worst adaptations for me by far is 'World War Z.' The movie is a generic zombie uprising movie with CGI fast zombies and ridiculous product placement that misses just about everything that made the book so immersive and compelling. No Battle of Yonkers, no LOBOs, no blind Japanese swordsman, no downed pilot scene, no Tiger Singh fighting square... It's almost an achievement how badly they messed this up.\n\n  \n",
        "upvotes": 401,
        "comments": 855,
        "media": null,
        "permalink": "/r/movies/comments/1ngn6j8/movies_that_were_terrible_adaptations_of_their/"
    },
    {
        "id": "1ngfqqt",
        "author": "LadyDirtyMartini",
        "title": "What film opened your eyes to what good acting really is?",
        "content": "For a very long time, I never understood \"good\" acting or what made a good actor. My parents love Tom Hanks, and I remember them obsessing over his performance in \"Cast Away\" and \"Captain Phillips\".\n\nBut, I finally watched \"Monster\" (2003) a few years ago in high school and was completely gagged by Charlize Theron's performance. Her Oscar win was the \"ah ha\" moment for me. I mean... her acting and transformation was SHOCKING and incredibly enjoyable to watch on screen.\n\nAnyone else experience this with other actors/actresses?\n\nEdit: Just thought of another performance that gagged me. Javier Bardem in “No Country for Old Men” was extraordinary.",
        "upvotes": 1504,
        "comments": 1500,
        "media": null,
        "permalink": "/r/movies/comments/1ngfqqt/what_film_opened_your_eyes_to_what_good_acting/"
    },
    {
        "id": "1nh6zqm",
        "author": "H0agh",
        "title": "Waterloo - (1970)",
        "content": "",
        "upvotes": 27,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VVml70QbGrIghC_JczbUWLSai6KSx0IoGx5lqE8HEZE.jpeg?auto=webp&amp;s=93a64e1ae92c1c9dc46c2b5b21a5b69f066133c4"
        },
        "permalink": "/r/movies/comments/1nh6zqm/waterloo_1970/"
    },
    {
        "id": "1nhcrzf",
        "author": "dcterr",
        "title": "The Right Stuff",
        "content": "This has to be one of my all-time favorite movies! I've watched it about 20 times and I try to watch it about once a year. The Space Race was such a great period in our history, even though it was part of the Cold War and largely inspired by it. I just wish we still had the same pioneering spirit of venturing into outer space as we did back in the 50s and 60s. Like they say on Star Trek, space is the final frontier, whether or not it's motivated by competition.",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1nhcrzf/the_right_stuff/"
    },
    {
        "id": "1ngr7sa",
        "author": "StrongHeart2462",
        "title": "What movie is the most historically accurate?",
        "content": "Hi All,\n\nOk. I was thinking about the movie 'Troy' and thinking there must be so many historical inaccuracies in there just to make an entertaining movie! \n\nMade me wonder, are there any movies made that are pretty close to real life events? Most real life event films do have experts on set but there's always artistic licence! ",
        "upvotes": 164,
        "comments": 428,
        "media": null,
        "permalink": "/r/movies/comments/1ngr7sa/what_movie_is_the_most_historically_accurate/"
    },
    {
        "id": "1nh612w",
        "author": "Away_Risk1757",
        "title": "What are some cool films you found in Archive.org?",
        "content": "I’ve been browsing through Archive.org lately and realized they have a huge library of old films, public domain movies, and hidden gems. It feels like digging through a cinematic time capsule.\n\nWhat are some cool or unexpected films you’ve discovered there? Could be classics, weird experimental stuff, vintage educational films, or just something you didn’t expect to find.",
        "upvotes": 21,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1nh612w/what_are_some_cool_films_you_found_in_archiveorg/"
    },
    {
        "id": "1nh87em",
        "author": "GavinGeffrey",
        "title": "What are some of the best non-conventional horror films?",
        "content": "I am looking to add to my collection of movie knowledge, and with that I want to deep dive into the realm of horror. I also am starting a movie club with friends, where every Wednesday/Saturday we watch a movie of my choice and I want some wild picks for October. Anything is fine whether it is a foreign film, silent, B&amp;W, or anything truly. Also deep cut horror films are also welcome for suggestion.",
        "upvotes": 15,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1nh87em/what_are_some_of_the_best_nonconventional_horror/"
    }
]