[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 103,
        "comments": 306,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mlvmcg",
        "author": "Old-Word6338",
        "title": "Does anyone else not like the Wednesday series on Netflix?",
        "content": "I’ve always been a big Addams Family fan, so when Netflix announced the Wednesday series, I was super excited. I didn’t expect it to be exactly like the old Addams Family. I knew it would have its own twist, but it just feels off.\n\nI honestly didn’t like the acting. It looks weird and unnatural, not in the charming, spooky Addams Family way, but in a “this doesn’t feel believable” way. The makeup doesn’t look good either, and instead of adding to the atmosphere, it makes the characters look kind of awkward.\n\nThe plot also feels too childish, like it’s trying to be edgy but still ends up being a teen drama without much depth. The detective/thriller angle is actually a good idea in theory, but the execution feels… meh.\n\nIt’s below the quality I usually expect from Netflix’s big series, and it’s disappointing because it could have been amazing.\n\nIs it just me? Or did anyone else go in with high hopes and come out feeling… meh?",
        "upvotes": 89,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1mlvmcg/does_anyone_else_not_like_the_wednesday_series_on/"
    },
    {
        "id": "1mllxlr",
        "author": "Legitimate_Ad3625",
        "title": "As Stephen Colbert Signs Off For Summer Hiatus, He Says: “Netflix, Call Me I’m Available In June”",
        "content": "",
        "upvotes": 287,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1mllxlr/as_stephen_colbert_signs_off_for_summer_hiatus_he/"
    },
    {
        "id": "1mm45d5",
        "author": "Tall_Eye4062",
        "title": "The quality of Netflix's documentaries has been dropping.",
        "content": "Considering their recent price hike, documentaries should be getting better, not worse. Jerry Springer: Fights, Camera, Action was only 2 episodes and was super surface-level. They didn't even mention Steve, who was a big part of the show. Then you have Surviving Black Hawk Down, a 3 episode documentary that had Army Rangers using full auto M16A2s (The A2 doesn't have auto, just semi and burst). The 2001 movie did a better job of telling the story than the documentary.",
        "upvotes": 16,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mm45d5/the_quality_of_netflixs_documentaries_has_been/"
    },
    {
        "id": "1mlxagw",
        "author": "Cool_Bath_77",
        "title": "PLEASE add a \"leaving soon\" section",
        "content": "Does anyone believe they would benefit from a \"leaving soon\" section added to the Netflix app?\nMy watchlist is so long and I am sure I miss out on watching titles because of them getting removed. If they added a \"leaving soon\" section to my watchlist (similar to Hulu's \"expiring\"), I would definitely always start on their app before watching something on my TV. If they added \"leaving soon\" for all the titles leaving Netflix, I probably would not watch any other app! \nWhat are your thoughts on this? Do you ever think how great it would be to have a \"leaving soon\" section added to the app or to the filter on the Netflix Mobile app?",
        "upvotes": 37,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mlxagw/please_add_a_leaving_soon_section/"
    },
    {
        "id": "1mm6j7j",
        "author": "ToonAdventure",
        "title": "ONE PIECE: Season 2 | First Look | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm6j7j/one_piece_season_2_first_look_netflix/"
    },
    {
        "id": "1mlwzik",
        "author": "Saladee_7",
        "title": "My life with the Walter boys",
        "content": "Just watched the first episode of this show. I’ve been avoiding it for the longest because I’m already exhausted with a certain other show with a similar plot (there are many shows with a similar plot). I’m tired of high school shows in general if I’m being honest. Anyways…I randomly started watching episode one and so far this has been everything I’ve feared. This show is basic, vanilla, run-of-the-mill love triangle, cringe, stiff, predictable, most boring thing ever. This show is for 14 year olds. I couldn’t even get through the first episode and this show is getting a whole other season?! Thaaaaats crazy. ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mlwzik/my_life_with_the_walter_boys/"
    },
    {
        "id": "1mm1b43",
        "author": "HieronymusGER",
        "title": "Looking for dumb shows like Hack my home or Instant Dream Home",
        "content": "Cant stop rewatching those shows to save my life...Is it cake kinda hits the same spot for me. Does anyone else have similar recommendations? Disney Plus or Amazon Prime are also fine",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm1b43/looking_for_dumb_shows_like_hack_my_home_or/"
    },
    {
        "id": "1mlmo7a",
        "author": "ysleez",
        "title": "Unbelievable- Netflix mini series, most underrated true crime series",
        "content": "If you love shows like Mindhunter, slow paced true crime show with a lot of emotions, I'm sure you'll love this. The story really gets you to feel how upset and helpless Marie (Kaitlyn Dever) gets and it's a great performance by her as well. But you have to hold your patience, there's some unnecessary stuff tho.",
        "upvotes": 21,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmo7a/unbelievable_netflix_mini_series_most_underrated/"
    },
    {
        "id": "1mm6kti",
        "author": "After-Foundation4185",
        "title": "Taco Boys - Your idol",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm6kti/taco_boys_your_idol/"
    },
    {
        "id": "1mlelak",
        "author": "Narrow_Tomorrow_7971",
        "title": "just finished apple cider vinegar",
        "content": "okay wait i need someone to talk to about this show. i had personally never heard of belle gibson (im american and not really into the health side and i was in middle school when all that happened) but i was instantly hooked. and idk i have a couple things. i do feel sympathetic for belle because its obvious she never really got love in her life and no one deserves that, but the way she went about finding it is insane. the fact that clive stayed with her when the whole time i was like babe youre too cute for this please leave her. and millas whole arc was insane and i really enjoyed this show overall and would love to hear everyones thoughts &lt;3",
        "upvotes": 67,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1mlelak/just_finished_apple_cider_vinegar/"
    },
    {
        "id": "1mm5fqz",
        "author": "Traditional-Bet2191",
        "title": "Same Household Rule?",
        "content": "So since they started the new household rule, I haven’t been able to watch on my profile on my tv at all because I would always get the “we are sorry but you’re not apart of this household” message unless we clicked on the kids profile. \n\nToday for whatever reason, I tried selecting my profile that’s on my aunts account, and it is currently working fine!! I’m scared to turn Netflix off because I’m afraid this won’t happen again lol. I’m in Alabama and my aunt is in NC but we have shared a Netflix account since as long as I can remember. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mm5fqz/same_household_rule/"
    },
    {
        "id": "1mltu2p",
        "author": "skylarkills69",
        "title": "the show “secrets we keep”",
        "content": "Dude this was so crazy and shocking, then i watched the glass dome and was more shocked. \nThese shoes are binge worthy. I was hooked on my tv screen for a while, the plot twists and jumpscares were intense. \n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mltu2p/the_show_secrets_we_keep/"
    },
    {
        "id": "1mm42i4",
        "author": "Claumered",
        "title": "K-Pop Demon Hunters in the wild",
        "content": "I was out at a restaurant with my parents and all of a sudden I hear ‘Soda Pop’ being played through the restaurant speakers. It’s crazy how mainstream this movie has become.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm42i4/kpop_demon_hunters_in_the_wild/"
    },
    {
        "id": "1mm3jn6",
        "author": "DelicateBanshee",
        "title": "Second location issues",
        "content": "I pay for Netflix for myself and my dad, who lives at a separate location, I am paying the fee for a second location, but every time I try to watch Netflix I have to say I’m the primary household, and then my dad has to do the same thing when he wants to watch. Essentially kicking the other person out. \n\nI wouldn’t mind so much if I didn’t have to log in on my back up email account every time either of us try to watch something to confirm it’s actually my account. \n\nDoes anyone know what I am doing wrong? I know it’s something but I am annoyed I’m paying for the extra location and it’s essentially wasted money. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm3jn6/second_location_issues/"
    },
    {
        "id": "1mm2nau",
        "author": "scaldinghawt",
        "title": "built an app for netflix watchers",
        "content": "if you watch netflix on your browser, i'd check out [browserbuddies.com](http://browserbuddies.com)\n\nyou might like it. find people to watch with, chat while watching, or leave comments and get into discussions",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm2nau/built_an_app_for_netflix_watchers/"
    },
    {
        "id": "1mloyoq",
        "author": "refdeser",
        "title": "Stolen : Heist of the Century",
        "content": "Just finished watching, this is exactly how I imagine a vault robbery would play out in real life. Kudos to the police officers for catching the criminals and following every clue they left behind.\n\n**spoiler**\n\nI believe this could have been the perfect crime if they had handled the rubbish differently by burning it all, so the police couldn’t follow their trail. But it happened the way it did, so all the time spent planning the robbery ended up going to waste, I guess.\n\nAt the end, Leonardo Notarbartolo still insists that he wasn’t the mastermind of the crime, but just one of the gang. What’s your opinion on this? Was he really just following the gang’s lead, or was he actually the one in charge? I still believe he’s a genius for hiding the fact that he was the mastermind. \n\nWhat happened to Agim, the police officer, in 2015, when he was found in possession of illicit diamonds is truly devastating. I believe he fell in with the wrong crowd and got caught red-handed. I hope he’s living a better life now.\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mloyoq/stolen_heist_of_the_century/"
    },
    {
        "id": "1ml07rs",
        "author": "Anxious_Cricket_1835",
        "title": "Been watching Mr. Robot and now I’m paranoid as hell about my personal info",
        "content": "I just finished watching season 1 of Mr Robot and it's great, no one warned me it's a horror series in disguise lol. I know it’s a TV show but damn watching Mr. Robot has me questioning everything. The way they gather people’s data, hack accounts, clone phones it’s way too realistic.  \n  \nNow I’m just sitting here thinking about how much of my info is floating around considering I've had the same phone number and email for years, signed up for hundreds of sites probably and no clue where half that data ended up. You hear of data breaches as well and it feels like anyone with enough motivation could piece together my whole life.  \n  \nLowkey freaking out about it lol.",
        "upvotes": 204,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ml07rs/been_watching_mr_robot_and_now_im_paranoid_as/"
    },
    {
        "id": "1mkz2o0",
        "author": "wildhawk642",
        "title": "Half Season Releases Are Awful",
        "content": "I really can’t stand these half season releases - I’d so much rather it either be week by week or the full season at a time.  With these half season releases I’m just going to wait until the full season is out and avoid discussions of the first half as best I can, which I think defeats their goal of trying to make series be in the spotlight longer. Either way, between this and their show cancellation decisions, it seems like Netflix figures out the worst thing they could do and then do that thing. ",
        "upvotes": 216,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1mkz2o0/half_season_releases_are_awful/"
    },
    {
        "id": "1mlzne7",
        "author": "Foozoolalafdarian420",
        "title": "How Do I Find Content That is Both 4k and Dolby Vision (HDR)?",
        "content": "I have a 4k OLED monitor and I recently saw a Youtube video of animals at 4k with Dolby Vision. To say I was stunned was an understatement. While Netflix probably compresses their 4k Dolby Vision content, I would still love to see what they have. \n\nIs there a way to find content that fulfills both requirements?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mlzne7/how_do_i_find_content_that_is_both_4k_and_dolby/"
    },
    {
        "id": "1mlzdgw",
        "author": "scaling_to_9_digits",
        "title": "Netflix Mac App?",
        "content": "Does anyone know why hasn't Netflix released a Mac app to allow you to watch offline? They seem to have one for iPad, windows and mobile, seems a bit strange to leave out the mac",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mlzdgw/netflix_mac_app/"
    },
    {
        "id": "1mlsi87",
        "author": "mrchase434",
        "title": "How to fix missing audio in Kpop Demon Hunters?",
        "content": "I just started the Kpop Demon Hunters movie and already 2 minutes in there's a lot of voice lines that just straight up aren't playing. The background music, sound effects, and subtitles are all working fine, the characters lips are moving, I just can't hear certain voice lines. How do I fix this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mlsi87/how_to_fix_missing_audio_in_kpop_demon_hunters/"
    },
    {
        "id": "1mlsari",
        "author": "crosstheroom",
        "title": "Does Sandman Season 2 get any better?",
        "content": "So far I'm trying to force myself thru episode 3 but so far all the episodes have had long stretches of boredom so it takes a few days to watch each one\n\nI'm about to give up, does it get better. \n\nEven in Season 1 the Diner Episode moved too slow, at least in the end it paid off.  ",
        "upvotes": 2,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1mlsari/does_sandman_season_2_get_any_better/"
    },
    {
        "id": "1mlm2pa",
        "author": "Extra_Put7162",
        "title": "Help me find this show",
        "content": "I waa watching a vlog and saw that youtuber is watching this Netflix series/youtuber. I screen shotted that part of the video. Can y'all help me find what series/show is this? \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mlm2pa/help_me_find_this_show/"
    },
    {
        "id": "1mlt8ay",
        "author": "rigellus",
        "title": "Am I the only one that uses two networks?",
        "content": "So just spent an hour on support with Netflix, and apparently, with Network Household, I have to have all devices on the same network. All of my streaming devices, which I kept on the guest network, no longer work due to my computer and my wife's iPad using Netflix on my regular wireless. And they directly told me that all devices have to be on one network or the other. Kinda sucks, since I'll probably just stop watching on my computer, but if I put the iPad on the guest network it kills a bunch of connectivity I set up for my wife for playing on the Mac for file sharing and image generation. Confirmed with Netflix.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mlt8ay/am_i_the_only_one_that_uses_two_networks/"
    },
    {
        "id": "1mln5xa",
        "author": "Disastrous_Flight969",
        "title": "Binge watching weekend #bingewatching",
        "content": "Looking for some new shows to binge. I have pretty much all streaming apps. I loved Pieces of Her, All Rise, The Good Wife, Blindspot, Fire Country and Reacher. #bingewatching #beapal",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mln5xa/binge_watching_weekend_bingewatching/"
    },
    {
        "id": "1mkyq0z",
        "author": "AltruisticAide9776",
        "title": "Has anyone started Wednesday season 2 and is finding it boring?",
        "content": "I found season 1 a bit of a drag too , it just doesn't compel you. At least if they had kept Xavier there would be something i d be curious about but as it the episode gelt a bit longer than it needed to be.",
        "upvotes": 36,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1mkyq0z/has_anyone_started_wednesday_season_2_and_is/"
    },
    {
        "id": "1mlmd2l",
        "author": "Babkat",
        "title": "Video Freezes but Audio continues",
        "content": "I found old threads with this issue but zero solutions. The internet is no help either. Everything blames it on bad luck or internet issues.\n\nSeems to happen to me immediately after going to next episode. Any slight hiccup seems to cause it. Only way to fix it is to back out of the episode and resume the episode again. It's running on my second monitor. Not sure if it's a netflix issue or something on the computer side of things.\n\non PC. Specs are near top of the line. Netflix app from Microsoft Store.\n\nEdit: I seem to have found a fix. Disabled graphics acceleration in Microsoft Edge (which is what the netflix app is technically running)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmd2l/video_freezes_but_audio_continues/"
    },
    {
        "id": "1mlm2x5",
        "author": "Jkwaks",
        "title": "How do I pay monthly each time?",
        "content": "To give a context I’ve been paying automatically for Netflix monthly with my CC. But recently I switched to a CC which uses Diners Club and I’m not able to put my card for recurring payments. So I read somewhere that Diners do not support recurring payments. So how do I pay each month without having to put card down for automatic payments. Thank you ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mlm2x5/how_do_i_pay_monthly_each_time/"
    },
    {
        "id": "1mlxf1q",
        "author": "chipotlehearts",
        "title": "Just starting Breaking Bad for the first time — what should I expect ? No spoilers!",
        "content": "I’ve heard it’s one of the greatest shows ever, but I honestly have no clue what I’m in for! \n\nWhat can I expect from the show in terms of pacing, tone, and characters — without any spoilers?\nWould love to know if it’s a slow burn, a constant adrenaline rush, or something else entirely!! 😅\n\nThankssss",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1mlxf1q/just_starting_breaking_bad_for_the_first_time/"
    },
    {
        "id": "1mlqoq4",
        "author": "Think_Lime3219",
        "title": "Help with restarting my membership",
        "content": "I had my mobile account one month back. I had set up the Autopay with Google pay UPI. Then I no longer needed the membership so I stopped the Autopay on Google pay. So netflix was not able to process the payment and my account was put on hold. Now after almost a month, I want to watch one series and hence want to restart the membership. But I am not able to do it. When I tried to update my payment method, it should this error -\"Sorry, unable to process your request. Please try again later.\" Then after trying multiple time with multiple devices, I contacted the customer support and chatted with one of their assistant. They then suggested me to delete my account and then recover it. So I followed it. But when I tried to restart my account, it shows same issue on the choose the plan page. Now, I am stuck and the customer assistant didn't also know the solution. So if there's anybody out there who has faced same issue and found any solution to this then please help me.\n\nI have attached the screenshots for the reference.\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mlqoq4/help_with_restarting_my_membership/"
    }
]