[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1l4mapr",
        "author": "Bitter-Ad-7883",
        "title": "🏠 TREGUA – coabitazione silenziosa per chi vuole ripartire",
        "content": "TREGUA – Coabitazione silenziosa e selettiva per chi vuole ripartire\n\n\n---\n\nCOSA CERCO\nSto cercando una persona con cui condividere una forma di coabitazione radicalmente diversa: non per comodità, ma per necessità reale. Un piccolo spazio da abitare in due, nel rispetto profondo del silenzio, dei ritmi personali, della vulnerabilità. Non una stanza in più. Una tregua condivisa.\n\n\n---\n\nPER CHI È PENSATA\nPer persone lucide ma in crisi. Persone che non ce la fanno più con convivenze rumorose, caotiche, invadenti. Che magari hanno vissuto o stanno vivendo:\n\ninsonnia,\n\nipersensibilità ai rumori,\n\nburnout,\n\nperiodi di transizione senza una casa stabile,\n\nun bisogno urgente di tregua, senza sentirsi etichettati come \"fragili\".\n\n\nNessun bisogno di spiegare tutto. Solo di essere rispettati.\n\n\nStudenti e/o professionisti che hanno bisogno di ASSOLUTO SILENZIO.\n\n\n---\n\nCOME FUNZIONA\nL’idea è iniziare da un primo test reale:\n\npossiamo cercare insieme una casa da abitare in due (Torino e dintorni);\n\noppure, se hai già uno spazio silenzioso e vuoi condividerlo temporaneamente, possiamo partire da lì;\n\nle spese si dividono, ma senza logiche da coinquilinaggio standard;\n\nsi vive nello stesso spazio, ma con rispetto assoluto dei limiti reciproci.\n\n\nNon si tratta di amicizia forzata. Ma di vicinanza selettiva e intelligente.\n\n\n---\n\nCOME CONTATTARMI\nScrivimi alla mail: treguabitativa@gmail.com\n(Oppure rispondi dove hai trovato questo annuncio)\n\nSe vuoi, ti chiederò alcune semplici domande per capire se possiamo essere compatibili. Nessun giudizio, solo chiarezza.\n\n\n---\n\nDOMANDE CHE TI FARÒ (o puoi già rispondere nella mail):\n\n1. Che tipo di silenzio cerchi? (Es. totale, solo notturno, solo rispetto reciproco)\n\n\n2. Hai mai vissuto esperienze di insonnia, stress abitativo o ipersensibilità?\n\n\n3. Cerchi uno spazio o puoi offrirne uno?\n\n\n4. Hai esigenze specifiche (es. orari, routine, lavoro da casa)?\n\n\n\n\n---\n\nGRAZIE\nSe sei arrivatɑ fin qui, forse stai cercando anche tu qualcosa che non esiste ancora. Costruiamolo insieme. Anche solo per un pezzo di strada.\n\n\n\nhttps://caring-lamprey-f59.notion.site/TREGUA-Coabitazione-silenziosa-e-selettiva-per-chi-vuole-ripartire-COSA-CERCO-20aee52fd9e080f48d15cb9b4f754fcd",
        "upvotes": 2,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kI1Wv-DKXBmA9RIoVavys1yjpLeZXBYJQPmH0z1y79Y.jpg?auto=webp&amp;s=7fc665b0b19d125a61ec1cd22a441c840c91feb0"
        },
        "permalink": "/r/torino/comments/1l4mapr/tregua_coabitazione_silenziosa_per_chi_vuole/"
    },
    {
        "id": "1l4ls89",
        "author": "Specialist_Fan4315",
        "title": "Cercasi Scoby per avviare kombucha",
        "content": "Buongiorno a tutti :)   \nCerco qualcuno su Torino che possa fornirmi scoby e starter per iniziare a produrre kombucha a casa :)   \nQualcuno ha degli avanzi, lo so!  \nFatevi sotto che vi offro un caffè fatto bene!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l4ls89/cercasi_scoby_per_avviare_kombucha/"
    },
    {
        "id": "1l40ry7",
        "author": "Mental_Plane6451",
        "title": "Proposta di miglioramento SFM, che ne pensate?",
        "content": "Allora, posto che il problema dell'inquinamento dell'aria è uno dei problemi principali della nostra città, e la dipendenza dall'auto è una delle ragioni principali, la priorità dei politici dovrebbe essere incentivare gli abitanti della cintura a usare il treno migliorando i servizi suburbani.\n\nHo provato a modificare la mappa della SFM, cercando di raggiungere il livello di servizio tipico di una città europea. La mia priorità è cercare di collegare tutte le aree con maggiore densità abitativa intorno a Torino, e fare che queste non siano a più di 5km di distanza da una linea. Ho cercato di utilizzare il più possibile linee già esistenti. \n\nLe modifiche sono:  \n\\- Costruzione di una bretella ferroiaria Venaria-Alpignano collegando la periferia nord di torino ( Druento, Pianezza, Casellette, ecc)\n\n\\- Prosecuzione della linea dell'interporto fino a Orbassano e Rivalta, poi Piossasco e magari Frossasco, con ramo verso Trana-Giaveno\n\n\\- Utilizzo intensivo delle linee già presenti, Torino-Ivrea, Torino-Casale, Torino-Ceres, Torino-Pont Canavese\n\n\\- Costruzione di collegamento ferroviario Ivrea-Viverone-Santhià\n\nOvviamente queste modifiche si devono accompagnare ad un miglioramento dell'affidabilità: servirebbero almeno 2 treni / ora per direzione di giorno e funzionamento dalle 5 a 1 di notte\n\nfonti:  \n[https://openrailwaymap.org/](https://openrailwaymap.org/)\n\n[https://luminocity3d.org/WorldPopDen/#3/38.34/3.34](https://luminocity3d.org/WorldPopDen/#3/38.34/3.34)",
        "upvotes": 17,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1l40ry7/proposta_di_miglioramento_sfm_che_ne_pensate/"
    },
    {
        "id": "1l4a2vv",
        "author": "Few_Willingness_5198",
        "title": "Che succede stasera? 5 giugno",
        "content": "Sirene di continuo che passano in corso novara, non so dove vanno ne se è polizia, ambulanze o altro.\n\n edit: erano i manifestanti per la nuova moschea alla fine(almeno dovrebbe)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l4a2vv/che_succede_stasera_5_giugno/"
    },
    {
        "id": "1l3ub8y",
        "author": "Careful_Molasses_496",
        "title": "Cosa ne pensate del prezzo delle spremute?",
        "content": "Da ormai un anno sono molto incuriosito da certi prezzi che trovo in giro. Spremute che partono da 4€ e arrivano fino a 6€.\n\nNon è un po’ troppo? Lo spremiagrumi è una spesa, ok, ma il resto? Il servizio alla fine è lo stesso di quello di un caffè (anzi, il/la barista fa più fatica) \n\nChiedo da ignorante. ",
        "upvotes": 27,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1l3ub8y/cosa_ne_pensate_del_prezzo_delle_spremute/"
    },
    {
        "id": "1l48m21",
        "author": "Tony_06_",
        "title": "Come si può trovare un bilocale/trilocale in affitto?",
        "content": "Salve a tutti, sono a Torino da qualche mese oramai, ma la situazione affitti mi sta facendo impazzire. Premetto che ho iniziato a cercare da quando sono arrivato e che non manco né di garanti, tantomeno di entrate mensili. \nTutto bello, tranne il fatto che un qualsiasi affitto per 2 persone non sembra poter esistere. \nAgenzie che ti mettono in banca dati e non offrono nulla da mesi, truffe con i soliti 250€ per una lista speciale di affitti, o richieste assurde. Quindi chiedo direttamente a voi che siete nati qui, o che avete esperienza nel trasferirsi in questa città, su come poter trovare qualsiasi cosa a prezzi umani. Dove dovrei cercare? Quali paesini limitrofi potrebbero essere migliori o con qualche possibilità in più? E perché le maggiori offerte sono camere da prezzi enormi? \n",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1l48m21/come_si_può_trovare_un_bilocaletrilocale_in/"
    },
    {
        "id": "1l48vmt",
        "author": "Scribbiocad",
        "title": "Ciao a tutti. Sono nato a Torino e ormai da 20 anni non vivo più in questa città. È cambiata in tutto questo tempo? Vivevo a mirafiori sud che all'epoca, era un quartiere tranquillo. Grazie a chi commenterà e mi darà pezzettini di una città che non vivrò più",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l48vmt/ciao_a_tutti_sono_nato_a_torino_e_ormai_da_20/"
    },
    {
        "id": "1l3zhzp",
        "author": "Aprilx246",
        "title": "To the person playing the Saxaphone across the Po from Parco del Valentino",
        "content": "Grazie mille! Vengo per leggere, ma oggi sono venuto per ascoltare :)\n\n  \nBellissimo!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l3zhzp/to_the_person_playing_the_saxaphone_across_the_po/"
    },
    {
        "id": "1l44npp",
        "author": "Scalog",
        "title": "🎴 Nuovo Circolo ARCI a Torino per appassionati di Magic e carte collezionabili – Evento Commander gratuito domenica 8! 🧙‍♂️",
        "content": "Ciao a tutti!\nSiamo felici di annunciare la nascita di un nuovo circolo ARCI a Torino dedicato a Magic: The Gathering e al mondo delle carte collezionabili. \n📅 Domenica 8 organizziamo il nostro primo evento gratuito di Commander – perfetto per incontrarci, giocare e conoscere altri appassionati.\n📍 Dove: Oro Birra\n📌 Indirizzo: Corso Regina Margherita 97, Torino\n🕡 Orario: Dalle 18:30 in poi\nSe ti piace giocare a Magic, collezionare carte o semplicemente vuoi scoprire un nuovo posto dove nerdare in buona compagnia, passa a trovarci!\nPorta il tuo mazzo, oppure vieni anche solo per curiosare.\nPer partecipare e avere maggiori informazioni sull'evento, segui la nostra comunità su reddit, al link: https://www.reddit.com/r/MadWizard_APS/s/S5dahqthfZ\nDove potrai trovare un linktree con tutte le info necessarie e i nostri canali social. \nSeguici per restare aggiornato su tutte le novità del nostro circolo!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l44npp/nuovo_circolo_arci_a_torino_per_appassionati_di/"
    },
    {
        "id": "1l4534a",
        "author": "tonyromero",
        "title": "Via Ugo Foscolo",
        "content": "Ciao a tutti,\n\nsto valutando di affittare casa a Via Ugo Foscolo in zona San Salvario. Purtroppo non conosco bene la zona e trattandosi di un primo piano ho paura di andare a vivere in una casa poco silenziosa. Oltre a questo possiedo anche uno scooter che lascerei per strada, sarebbe qualcosa di rischioso?\n\nGrazie, chiedo consiglio a tutti voi.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1l4534a/via_ugo_foscolo/"
    },
    {
        "id": "1l3ug6l",
        "author": "SafeZookeepergame573",
        "title": "Arrivare in aereoporto di notte",
        "content": "Ciao, devo prendere un volo da caselle alle 6 del mattino, abito vicino piazza Carducci, sapreste consigliarmi il modo più comodo e meno dispendioso (no taxi quindi ahaha) per arrivare in aereoporto almeno 1:30h prima?\nHo visto che ci sono i flibco o gli arriva rispettivamente da porta Susa e porta nuova, esperienze notturne con questi?\nGrazie ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1l3ug6l/arrivare_in_aereoporto_di_notte/"
    },
    {
        "id": "1l4021e",
        "author": "ipekx13",
        "title": "Truffa o no?",
        "content": "Non ho contattato questa persona anche se sto cercando un appartamento. Ho ricevuto questa mail dal nulla. Sembra una truffa, ma non ne sono sicura. ",
        "upvotes": 1,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1l4021e/truffa_o_no/"
    },
    {
        "id": "1l3uwbi",
        "author": "Pablitos1989",
        "title": "Trivia quiz game",
        "content": "Per info e per iscriversi\nhttps://ciboetrash.it/trivia-challenge-a-torino/\n",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vlsjay6rv25f1.jpeg?auto=webp&amp;s=883e871ca5418e3db6bee0a703bd028aec17bda6"
        },
        "permalink": "/r/torino/comments/1l3uwbi/trivia_quiz_game/"
    },
    {
        "id": "1l3rjkq",
        "author": "New_Strength27",
        "title": "Concerto 14 Giugno",
        "content": "Ciao a tutti ☺️ cerco persone che vanno al concerto di Marra il 14 giugno. Ma in generale, anche a cui piaccia andare ad eventi e feste estive",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l3rjkq/concerto_14_giugno/"
    },
    {
        "id": "1l3hp4s",
        "author": "No_Restaurant1120",
        "title": "Cerco amici per giocare a calcio",
        "content": "Ciao, sono un M16 e vorrei trovare degli amici con i quali giocare a calcio, visto che i miei amici dopo che mi sono rotto il piede giocando con loro hanno paura di giocare insieme a me, e dunque mi ritrovo a giocare da solo. Non so il mio livello perché non mi confronto con qualcuno da qualche anno, e per questo cerco gente che giochi per divertimento. Sono anche abbastanza timido, quindi mi piacerebbe trovare gruppi accoglienti, dove ci si possa sentire a proprio agio. Sono aperto a unirmi a gruppi già formati finché sono accoglienti. Sono dalle zone del lingotto. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l3hp4s/cerco_amici_per_giocare_a_calcio/"
    },
    {
        "id": "1l39lwu",
        "author": "illcalante",
        "title": "Cerco lavoro e alloggio temporaneo a Torino per iniziare una nuova vita partendo da zero.",
        "content": "Ciao a tutti!\nMi chiamo Robert vengo da Roma, sono un ragazzo di 22 anni e sto cercando di ricominciare da capo trasferendomi a Torino.\nNon ho un budget alle spalle né una base d’appoggio, ma ho tanta voglia di mettermi in gioco, lavorare e costruirmi una nuova stabilità.\nSono una persona educata, seria, affidabile e aperta a qualsiasi tipo di lavoro\n\nSono diplomato in grafica pubblicitaria ma non ho ancora esperienza lavorativa in questo ambito, in questo momento sono disposto a fare qualunque tipo di lavoro che mi permetta di cominciare.\nCerco anche una sistemazione temporanea, anche solo per le prime settimane, giusto il tempo di trovare una stanza e stabilizzarmi.\n\nSe qualcuno ha consigli, contatti, o è disposto ad aiutarmi anche solo con un’informazione o un link utile, ve ne sarei davvero grato 🙏\n\nGrazie in anticipo a chiunque leggerà questo post e a chi vorrà darmi una mano, anche piccola.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1l39lwu/cerco_lavoro_e_alloggio_temporaneo_a_torino_per/"
    },
    {
        "id": "1l3ajsg",
        "author": "CommunicationDry6582",
        "title": "Orafo a Torino",
        "content": "Ciao, mi sono trasferito da pochi mesi a Torino con la mia ragazza. Da diverso tempo desidero regalarle un anello e finalmente penso di potermelo permettere. Mi sapete consigliare un orafo che realizzi anelli moderni, non gioiellerie che rivendono le varie marche ma qualcuno in grado di realizzare un anello in oro bianco o in platino magari anche studiando un modello con me?\nGrazie a chi mi consiglierà :)",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1l3ajsg/orafo_a_torino/"
    },
    {
        "id": "1l3dk1p",
        "author": "Altruistic-Belt-8120",
        "title": "Lavorazioni artigianali / pietre preziose",
        "content": "Ciao a tutti!\nPer l’anniversario con mia moglie ero alla ricerca di un laboratorio artigianale (Torino e provincia) specializzato in lavorazione pietre preziose (orecchini, bracciali, ecc…).\n\nNon ama lo stile moderno, cercavo qualcosa di particolare e unico.\n\nIdee o consigli? Grazie mille a tutti!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l3dk1p/lavorazioni_artigianali_pietre_preziose/"
    },
    {
        "id": "1l2155q",
        "author": "troppyjacgkberry8",
        "title": "Parco Dora (Torino)",
        "content": "",
        "upvotes": 450,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lGQ0Li_8PTyXEC6_FWmwwiZPDqoae7qyw_DXzA9mbx0.jpg?auto=webp&amp;s=828d7cd56dd3349ac0c92750ff7a976da44fadf6"
        },
        "permalink": "/r/torino/comments/1l2155q/parco_dora_torino/"
    },
    {
        "id": "1l3072h",
        "author": "namedems",
        "title": "Found this VIEW Conference Workshop!",
        "content": "I just came across an event that looks super interesting for anyone who loves art, paper, illustration, and the creative world in general. I think it’s open to all levels — students, artists, educators — and it’s an in-person experience focused on creative techniques and materials.\n\nFrom June 19 to 21, 2025, VIEW Conference is hosting a 3-day workshop in Turin with Megan Brain (one of her most notable works was creating the end credits for Madagascar 2) and Liberty Worth (a multidisciplinary artist working in the textile field).\n\nHere’s the link for more info: [https://www.viewconference.it/article/1074/view-conference-creativity-deep-dive-3-day-workshop](https://www.viewconference.it/article/1074/view-conference-creativity-deep-dive-3-day-workshop)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/stdfuzd3ev4f1.jpeg?auto=webp&amp;s=3aa3c0724d0104e412fd4016775513fb359fd209"
        },
        "permalink": "/r/torino/comments/1l3072h/found_this_view_conference_workshop/"
    },
    {
        "id": "1l2wk6j",
        "author": "LobsterWise4428",
        "title": "How safe and how is the general area(student accomdation/shared accommodation)",
        "content": "I'm a international student looking for accommodation in italy and am due to start my sem in early oct at ied, i was looking at places around ied and theyre mostly priced at 565+ euros but when I went about 2 kms further from ied , i found pretty decent shared accommodation rooms in the 400-450 range, but the place looks alot more shady and different to the area near ied, i just wanted to know how the general area of  turin corso regina Margherita is , as that's the location with lower shared accommodation prices. any info on the areas around Turin and what they're notorious for is appreciated. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1l2wk6j/how_safe_and_how_is_the_general_areastudent/"
    },
    {
        "id": "1l2z5qn",
        "author": "theproverbialmatthew",
        "title": "Lavoro part time al mattino",
        "content": "Ciao bella gente. Sono qui a Torino da 6 anni, tempo in cui ho accumulato sia una laurea che un'esperienza lavorativa di un paio di anni (in un cinema). E' arrivato il momento di cambiare e, per varie esigenze, starei cercando qualcosa con turni mattutini soprattutto (e/o smart, ma so che è dura così dal nulla). Se avete idee, suggerimenti, sapete di situazioni, fatemi sapere. Grazie mille!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1l2z5qn/lavoro_part_time_al_mattino/"
    },
    {
        "id": "1l2vbkn",
        "author": "Raison55",
        "title": "Salon Recommendation",
        "content": "Hello, I am traveling to Torino this summer for a wedding and I am looking for a hair dresser/salon that can do hair. Any recommendations? Thank you.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l2vbkn/salon_recommendation/"
    },
    {
        "id": "1l2i35m",
        "author": "SignorinaSilvani",
        "title": "Consigli per affittare casa da soli",
        "content": "F24, contratto determinato con 1,5k netti al mese, abito già a Torino città con la mia famiglia ma voglio andare a vivere da sola. Consigli per cercare appartamenti in affitto ≤500€ al mese di canone? Com contratto di durata &gt;18 mesi...\n \nGuardo su Immobiliare e su Idealista ma il 70-80% di offerte che trovo sono stanze per universitari oppure appartamenti per trasferisti/contratti transitori.\nIl restante 20-30% sono:\n- annunci di agenzie che ti chiedono di pagargli 250€ da subito per aiutarti a cercare;\n- case non arredate che non hanno nemmeno la cucina e/o i sanitari in bagno :')\n\n1. Cosa mi consigliate? Conoscete altri strumenti più efficienti per la ricerca?\n2. Quali tipologie di contratti (di lunga durata) esistono? Quali sono le regole generali, i pro e contro, tutele e doveri?\n3. Quali sono tutti gli step da fare una volta che hai identificato un appartamento che ti piace e sei d'accordo su contratti e costi con il proprietario?\n4. In generale quali sono tutti i costi da sostenere per iniziare un contratto di affitto e trasferire la residenza?\n",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1l2i35m/consigli_per_affittare_casa_da_soli/"
    },
    {
        "id": "1l2k8lw",
        "author": "Spartaffi",
        "title": "Com'è lavorare come autista GTT sull'extraurbano a Torino?",
        "content": "Voglio evitare l'urbano come la peste, mi interessa l'extraurbano.\nQualcuno lavora al deposito Fiocchetto e mi può dire come sono i turni? E i festivi? \nGrazie di cuore a chi risponderà",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1l2k8lw/comè_lavorare_come_autista_gtt_sullextraurbano_a/"
    },
    {
        "id": "1l2nb5y",
        "author": "imjustme_00",
        "title": "Lavori per minorenni",
        "content": "Ciao a tutti, sto cercando un lavoretto da fare questa estate da minorenne(18 non compiuti). Sono mesi che cerco qualcosa da fare ma sembrano non esserci minimamente opzioni per minorenni. Personalmente mi adatterei a fare qualsiasi cosa nonostante abbia delle discrete competenze in vari ambiti (certificazione C2 d'inglese, profonda conoscenze di programmazione e esperienze in vari altri ambiti sia legati all'informatica, ad esempio video making e photo editing, che completamente slegati, ad esempio piccole parentesi come posatore di passatoie e altri lavori simili). Mi sarebbe molto utile qualche suggerimento. Ovviamente ho già pensato a ripetizioni ma non sono riuscito a trovare nulla (se avete qualche consiglio anche ad esempio su qualche buona piattaforma su cui trovare qualcuno a cui darle sono ben accetti)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l2nb5y/lavori_per_minorenni/"
    },
    {
        "id": "1l24dag",
        "author": "Benzinazero",
        "title": "Chieri (Torino), La psicoeconomia di 100Torri interpreta male il problema dei parcheggi, perché non tiene conto della geometria: ogni posto auto richiede 25 mq",
        "content": "# A Chieri, un comune di 36.000 abitanti della città metropolitana di Torino, hanno aumentato i prezzi dei parcheggi. [Il quotidiano online 100Torri presenta la cosa come un’ingiustizia](https://www.100torri.it/2025/05/29/parcheggi-a-chieri-ecco-perche-laumento-dei-prezzi-e-un-autogol/), in un lungo e articolato ragionamento che chiama in causa la psicoeconomia.\n\nC’è un piccolo problema: **nei centri storici lo spazio è** ***prezioso*** **e** ***limitato*****.**\n\nL’articolo parte dal presupposto che il parcheggio, gratis o a basso prezzo, sia un *ovvio diritto* e che l’auto sia l’*unico veicolo possibile* per muoversi in una città.\n\nIn queste premesse ci sono due errori:\n\n1. *Il parcheggio non è un diritto*, particolarmente dove lo spazio è limitato;\n2. *L’auto non è l’unico veicolo possibile:* ci sono anche mezzi pubblici, bicicletta, andare a piedi, e l’intermodalità, la combinazione di tutti questi. L’auto privata, che è solo *uno* dei diversi mezzi di trasporto e spostamento, e non è detto che si debba usare in esclusiva.\n\nIl motivo per cui il parcheggio a pagamento **non è** un’ingiustizia è molto semplice, anche deriva da un problema che l’industria dell’auto e molti automobilisti negano o rimuovono:\n\n**L’automobile in città è ingombrante.**\n\nLetteralmente, è impossibile consentire a tutti gli automobilisti che vorrebbero entrare in un centro storico italiano di farlo con l’automobile, e di parcheggiare dove e quando vogliono, gratis o a basso prezzo.\n\nIn campagna con l’auto si va e si parcheggia dove si vuole. In città, no, non è possibile.\n\nPer un motivo semplicissimo e verificabile geometricamente: **per parcheggiare un’auto occore lo spazio fisico.**\n\nRealizzare un posto auto in un parcheggio a raso richiede 25 metri quadri: 12,5 per il posto auto vero e proprio, 12,5 per gli spazi di manovra, per poter aprire le portiere, per entrare e uscire dall’auto e per entrare e uscire dal parcheggio.\n\nLungo un marciapiede bastano 10 mq (2×5 metri) perché le portiere si aprono usando lo spazio della strada e del marciapiede. Però lungo il marciapiede ci stanno al massimo dieci auto ogni 50 metri, qualcuna in più se sono tutte Smart, Citroën Ami o Fiat Topolino.\n\nIn una via lunga un km si possono parcheggiare teoricamente 200 auto per lato (se è abbastanza larga), ma in realtà molte meno perché ci sono i passi carrabili, gli incroci, i passaggi pedonali e altri spazi dove le auto non possono parcheggiare.\n\nNei parcheggi a raso, negli autosilo, nei parcheggi sotterranei, di riffa o di raffa occorrono 25 metri quadri per ciascuna auto che vogliamo parcheggiare: **occorre un ettaro di spazio per parcheggiare 400 automobili.** Non abbastanza per consentire a tutti di arrivare in auto.\n\nQuanto vale, quanto costa un ettaro di spazio in un centro storico?\n\nAltro dettaglio di cui l’analisi [*psicoeconomica* di 100Torri ](https://www.100torri.it/2025/05/29/parcheggi-a-chieri-ecco-perche-laumento-dei-prezzi-e-un-autogol/)non tiene conto: **le auto private stanno parcheggiate circa il 95% del tempo.**\n\n\\[Un’auto che viene usata *due ore* al giorno per andare e tornare dal lavoro, *un’ora* per andare a fare la spesa il sabato e *un’ora* per andare a mangiare dalla suocera la domenica **sta parcheggiata 156 ore alla settimana**. Ovvero: 8% del tempo in movimento, 92% del tempo parcheggiata. Ed è un’auto che viene usata parecchio. La classica auto che si usa per le vacanze e per andare a fare la spesa viene usata molto meno. \\]\n\nQuindi: più automobilisti vogliono entrare nel centro storico di Chieri, più auto dovranno essere parcheggiate, con una grande sproporzione fra tragitto e tempo di parcheggio: *10 minuti* per arrivare in auto dalla periferia al centro, *due ore* di parcheggio per fare due passi, prendere un caffè, comprare qualcosa. 10 minuti di tragitto, 120 minuti di parcheggio: un rapporto 1:12. Più auto arrivano e più problemi di parcheggio ci saranno.\n\nÈ evidente a chiunque sappia fare due conti che, siccome lo spazio è limitato, non tutti possono parcheggiare in centro.\n\nQuindi, psicoeconomia o no, è inevitabile il fatto che le risorse *limitate* abbiano un *costo*.\n\nFar pagare il parcheggio contribuirà a diminuire il traffico e a ottimizzarlo, come è dimostrato da anni di studi, perché chi non vuole pagare parcheggerà lontano e farà quattro passi a piedi, oppure userà i mezzi pubblici o la bici. Chi invece ha assoluto bisogno dell’auto cercherà di abbreviare la sosta per pagare meno.\n\nL’unica maniera per ridurre il traffico non è né fare parcheggi né offrirli gratis o a basso prezzo ma è: *potenziare i mezzi pubblici, migliorare i marciapiedi e fare piste ciclabili ben collegate fra loro*. In questo modo chi può usa mezzi alternativi, e chi ha assolutamente bisogno della macchina trova meno traffico e ha meno problemi di parcheggio.\n\n# Qui due proposte per migliorare i parcheggi:\n\n1. **Stabilire il giusto prezzo per il parcheggio in strada.** Una tariffa troppo bassa incoraggia l’uso dell’auto anche a chi non ne ha realmente bisogno, allungando la durata della sosta media, con posti auto sempre occupati. La tariffa giusta – che con l’adeguata tecnologia può essere modificata dinamicamente in base a ora di punta, stagione, giorno della settimana – è quella per cui restano sempre almeno un paio di posti liberi in ogni isolato, in modo che l’automobilista che arrriva trovi sempre parcheggio. Spiegazione dell’apparente paradosso: se la tariffa è troppo bassa, la durata media della sosta si allunga, e più persone penseranno di usare l’auto; se la tariffa è adeguata, chi non vuole pagare parcheggerà più lontano oppure userà altri mezzi; chi è disposto a pagare cercherà comunque di abbreviare il tempo di sosta, quindi ci saranno sempre dei posti liberi. Facile regola: se il parcheggio è a pagamento ma i posti sono spesso tutti occupati, la tariffa è troppo bassa.\n2. **Dedicare gli introiti dei parcheggi per migliorare i servizi pubblici e l’arredo urbano del quartiere.** In questo modo, se vedono migliori mezzi pubblici, marciapiedi più ordinati, nuove fioriere e arredi urbani, residenti e commercianti saranno più favorevoli ai parcheggi a pagamento nella loro strada perché in questo modo i posti auto a pagamento finanzieranno le migliorie di quella particolare strada e di quel particolare quartiere.\n\n**Nei centri storici e nelle aree ad alto traffico, la convivenza di parcheggi gratis e parcheggi a pagamento nella stessa strada e nello stesso quartiere invece aumenta il traffico:** l’automobilista girerà a vuoto per cercare un posto gratis, e si rassegnerà a parcheggiare a pagamento solo dopo qualche minuto e qualche km di ricerca.\n\n# Cosa succede ad aumentare la tariffa dei parcheggi?\n\nPer quel che riguarda cosa succede aumentando i prezzi dei parcheggi, i ricercatori dell’Università di Dublino hanno intervistato 1.000 persone prima e dopo un incremento dei prezzi del parcheggio del 50%. Ecco i risultati:\n\n* È aumentata la quota di utenti di classe media\n* La durata media della sosta è **calata del 17%**\n* Le soste **sopra le tre ore sono calate del 39%**\n* Le soste di **una o due ore sono aumentate del 32%**\n* È **diminuito** il numero di minuti necessari per trovare un posto libero\n* È **aumentato** il numero di **donne** utenti perché è più facile trovare posto libero\n* È **diminuita** la quota di utenti molto benestanti, perché anche loro cercano di abbreviare le soste per pagare meno\n\nNella maggior parte dei casi chi ha la necessità di arrivare in auto in centro, con prezzi un po’ più alti trova più facilmente posto e complessivamente può anche spendere una cifra uguale o minore a prima, semplicemente sostando di meno e rendendo più rapida la sua commissione.\n\nL’esperienza dimostra che le principali obiezioni sono superate:\n\n1. **~~Con i prezzi alti parcheggiano solo i benestanti.~~** In realtà ricchi e poveri preferiscono tutti pagare il parcheggio il meno possibile. Se la tariffa è giusta (ovvero NON troppo bassa) la maggior parte degli automobilisti abbrevia la sosta per pagare meno, e quando può evita di usare l’auto, preferendo i mezzi alternativi. Se invece il parcheggio è gratis o a basso prezzo, chi trova posto se ne approfitta.\n2. **~~Non tutti possono parcheggiare lontano gratis e camminare fino in centro~~**~~.~~ Esistono molte altre possibilità: prima di tutto chi non è in grado di camminare spesso non è in grado neanche di guidare. Può essere accompagnato in centro, e poi l’accompagnatore va a parcheggiare oppure torna a prenderlo più tardi. Nel caso di disabili che sono in grado di guidare, esistono le apposite agevolazioni a loro riservate e quindi il problema non si pone.\n3. **~~In centro storico c’è l’ospedale e tanti servizi essenziali.~~** I centri storici non sono immensi: sono stati costruiti quando tutti andavano a piedi, percorrerli in lungo e in largo a piedi non è difficile per la maggior parte delle persone. I disabili che non sono in grado di camminare invece hanno le agevolazioni citate nel punto precedente.\n4. **~~Basterebbe gestire la sosta con la zona disco.~~** Il disco orario è molto rigido nell’applicazione e consente facili contraffazioni. *Rigidità*: si possono prevedere soste di durata unica, o solo mezzora, o solo un’ora o solo due ore, per esempio: una misura unica per tutti. Mezzora è troppo poco, due ore sono troppe, eccetera. *Facili contraffazioni*: soprattutto nel caso di sosta consentita per un tempo di un’ora o due, è facile andare ad aggiornare il disco orario per guadagnare altro tempo di sosta.\n\nChi obietta al costo del parcheggio o non vuole spendere può ricorrere a una delle numerose alternative possibili:\n\n* Parcheggiare più lontano, gratis, e fare una passeggiata a piedi\n* Usare i mezzi pubblici\n* Fare carpooling per suddividere il costo del parcheggio\n* Usare il taxi\n* Usare la bicicletta\n* Andare a piedi\n* Chiedere un passaggio a un amico che magari transita di lì ma va altrove\n* Usare una combinazione delle soluzioni sopra\n\nInsomma, sarebbe bello avere il parcheggio gratuito per tutti nei centri storici. Ma non c’è fisicamente lo spazio. E questo comporta necessariamente parcheggi a pagamento e mezzi alternativi. Come fanno in tutta Europa. ◆\n\nLa ricerca viene riportata da Donald Shoup nel suo libro ‘The High Cost of Free Parking’.",
        "upvotes": 40,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_kuMxZCN7o8Ywckml2GUpM_wFBZ7cdSEYXE8SmKVL_M.jpg?auto=webp&amp;s=6f05572edd604b4e343f4e8590199a9c0476a7db"
        },
        "permalink": "/r/torino/comments/1l24dag/chieri_torino_la_psicoeconomia_di_100torri/"
    },
    {
        "id": "1l2i5zb",
        "author": "mig3l3l3l",
        "title": "Amianto",
        "content": "Se un vicino ha una tettoia di amianto rotta e viene segnalata alla asl, la tettoia viene rimossa dalla asl stessa anche se il proprietario non paga/non è intenzionato a rimuoverla? A Torino queste ispezioni/rimozioni sono tempestive?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l2i5zb/amianto/"
    },
    {
        "id": "1l2jh1x",
        "author": "Flat-Message6872",
        "title": "Piste atletica",
        "content": "Ciao, qualcuno sa dove si possono trovare piste di atletica o anche tipo terreni con erba continue senza troppe buche dove posso correre, non intendo fare cardio ma velocità.  \nGrazie ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l2jh1x/piste_atletica/"
    },
    {
        "id": "1l277qi",
        "author": "SprtizTime",
        "title": "Looking for people interested in startups in Turin",
        "content": "I hope this is okay to post. I am not selling anything, not posting any job offer, or promoting anything. I would just like to know if it's possible to find people with professional experience interested in startups, entrepreneurship. I have been to some events like GDG and to OGR but no luck there.\n\nWhat I am looking precisely is people interested in building startups, again I am not selling anything, not offering a job or promoting anything I just want to connect with people, grab a coffee, a beer and exchange ideas. If this is not the objective of the community, that's ok. I will look somewhere else.",
        "upvotes": 10,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1l277qi/looking_for_people_interested_in_startups_in_turin/"
    }
]