[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j15v5s",
        "author": "ellissabain",
        "title": "Gabby Petito’s parents have revealed what happened to the van",
        "content": "",
        "upvotes": 725,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1j15v5s/gabby_petitos_parents_have_revealed_what_happened/"
    },
    {
        "id": "1j1eisa",
        "author": "bvmdavidson",
        "title": "Every show I like gets cancelled",
        "content": "Title. It’s seriously unbelievable how many shows get cancelled after their first season. For me, the first big hit was Marco Polo. So good. It got cancelled on a cliff hanger. Its high production cost was cited. Fine, I guess. \n\n1899- had me hooked in the first few minutes. Cancelled. \n\nArchive 81- 8 episodes. The first one was slow to get through, granted, but by the end it was easily one of my favorite horror/suspense shows. CANCELLED. And it’s certainly not the production costs since very little special effects were used. \n\nThere were more shows that got canceled, obviously, but these were the three that really got to me. Seriously considering cancelling\n Netflix now since all they seem to care about is producing trash. \n\n\n“New on netflix” flair because it’s ironically relevant.",
        "upvotes": 42,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1j1eisa/every_show_i_like_gets_cancelled/"
    },
    {
        "id": "1j1ctgk",
        "author": "HowNow101",
        "title": "I Hate Netflix's new visual update",
        "content": "Just switched on Netflix and theres a new visual update in the UK anyway, and I hate it. When scrolling through on TV the images are just too big, I want to be able to see more options on the screen without scrolling right. Is there a way to change back to before this crappy update?",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ctgk/i_hate_netflixs_new_visual_update/"
    },
    {
        "id": "1j1aw7p",
        "author": "Simple_Beat6344",
        "title": "Don’t Look Up on Netflix",
        "content": "I watched this movie when it was first released and watched again today. I couldve sworn the last dinner scene was gory and showed everyone dying in slow motion. \n\nWas the movie edited or am I getting it confused with something else? ",
        "upvotes": 19,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j1aw7p/dont_look_up_on_netflix/"
    },
    {
        "id": "1j11xwq",
        "author": "StorthTheElder",
        "title": "Help! Adult content showing on kids profile",
        "content": "How do I fix this? The kids icon is displaying in the bottom-right and the correct profile icon showing, so I'm on the right profile. You can see configuration settings appear to be correct on the second screen. Please help!",
        "upvotes": 45,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j11xwq/help_adult_content_showing_on_kids_profile/"
    },
    {
        "id": "1j1lvqy",
        "author": "Visual_Conference144",
        "title": "Is the devtool netflix pfp hack fixed?",
        "content": "Hey so i lost my account and created a new one. But unfortunatly my preccious demogorgon pfp is now gone..i tried to bring it back with devtool but there is no tab where i can edit is. Was it fixxed? Is there another way?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1lvqy/is_the_devtool_netflix_pfp_hack_fixed/"
    },
    {
        "id": "1j1foz7",
        "author": "fuxandfriends",
        "title": "Is there a way to increase font size?",
        "content": "so I have newly terrible vision and watch netflix through samsung smart tvs. is there a hidden accessibility setting menu to make descriptions and menus a larger font? \n\ni’m so sick of having to look through my phone camera or my phone app to figure out what episode I’m on or even titles of shows. \n\n(this is not a netflix only issue i’m having so any insight is helpful at this point)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1foz7/is_there_a_way_to_increase_font_size/"
    },
    {
        "id": "1j19elo",
        "author": "backrollerpapertowel",
        "title": "\"Your device isn’t part of the Netflix Household for this account\" while sitting in my house?",
        "content": "I've suddenly started getting the above message when logging in on my PC to Netflix. The thing is, I am part of the household, I'm in my house on the same wifi and everything. it won't allow phones, PCs, nothing to log in without a code now all while in the same house/wifi. everything except the smart tv makes us put in the code every 14 days.  \n\n  \nhow do we fix this? ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j19elo/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1j1hs3u",
        "author": "Fuwaboi",
        "title": "What is an English speaking show on Netflix with either alot of cultural subtext or specific lingo in its dialogue?",
        "content": "Hi, I'm a university student studying the English language course and I had to do a writing. So I wanna find a show with the above criteria to do a writing on (specifically compare the official subtitle of a different language to the source), but I dont really know where to find one. I hope someone here can have a suggestion for me. Any kind of show is find, but comedy would be preferable. I'm not sure if this is the appropriate place to ask, but I dont know where else to find a suggestion.\n\nThe wrd limit is really annoying, so I'm just gonna spam stuff til it hit the minimum requirement. Hope y'all dont mind.\n\nSi, si, si, so, so, si, si, si, si, so, si, si, si, si, si, si,nsi, si, si, so, si, si, si, so, sk, si, siz si,nsi, si, si, si, si, si, siz si, si @*, sis, si, si, si, si, si, si, zis ,isn, sisi, si, si, si, si, si,nsi, si, si, si,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,isnzi, si, sj, si",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs3u/what_is_an_english_speaking_show_on_netflix_with/"
    },
    {
        "id": "1j0u8jy",
        "author": "Unfair_Future_9726",
        "title": "Netflix intro by Hans Zimmer",
        "content": "This was so satisfying to hear😭😭😭 I wish this was the intro of every original movies and TV shows on Netflix.",
        "upvotes": 33,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/va9ar9yz71me1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j0u8jy/netflix_intro_by_hans_zimmer/"
    },
    {
        "id": "1j1gkrm",
        "author": "Efficient_Cup_5629",
        "title": "The body next door - Question!",
        "content": "Question - Who moved the body?!?!? It doesn't matter where it was in the flat, she was in palliative care / a home. She was also dead a month before the body was found. So how did it end up in the garden?!?! Nb. A single person wouldn't have managed that as he was all juicy under the plastic.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1gkrm/the_body_next_door_question/"
    },
    {
        "id": "1j1fmba",
        "author": "leffy5",
        "title": "Any recommendation for government coverups or conspiracy shows?",
        "content": "I love stranger things but after watching it 7 or 8 times i want to watch something else. I’m very into government coverup shows so I’m wondering if there are any recccomendations you all have since i can’t seem to find any.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j1fmba/any_recommendation_for_government_coverups_or/"
    },
    {
        "id": "1j1iou9",
        "author": "i_like_the_swing",
        "title": "Just watched the first episode of american primeval. What is the appeal?",
        "content": "I understand extremism and I do enjoy other gory things I like horror movies, but I feel like horror has suspense and terror and the building of tension. So it's not that. I just feel disgusted and overwhelmed and miserable after american primeval, not entertained. For those of y'all who enjoyed it, what was the redeeming factor? Not hating, just curious if I should keep watching the rest of the season and look for a different perspective. Thanks!\n\n(Edited for clarity)",
        "upvotes": 0,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1j1iou9/just_watched_the_first_episode_of_american/"
    },
    {
        "id": "1j18rg0",
        "author": "dailystar_news",
        "title": "WWE Elimination Chamber LIVE on Netflix as John Cena and Trish Stratus return while Rock wants a 'soul'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j18rg0/wwe_elimination_chamber_live_on_netflix_as_john/"
    },
    {
        "id": "1j1cex5",
        "author": "Present_Flatworm_288",
        "title": "Why does Netflix on my TV still have the profile lock even after i removed it? The Pin that I had before doesn't work when i put it in either",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j1cex5/why_does_netflix_on_my_tv_still_have_the_profile/"
    },
    {
        "id": "1j11lda",
        "author": "StillWaitingForDad",
        "title": "somethings wrong with my Netflix profile?",
        "content": "on my netflix account there are 4 users and this issue is for my profile only and it happens on all platforms. UK netflix\n\nwhen i load up netflix on any platform my profile icon is just a red smiley face rather than what i picked for it. i dont know why. and if i go onto my profile i have limited access to shows.  and that most of the continue watching catagory is empty with only a few on these. i know this because i was going to try to watch halo but its not there? but if i go onto another profile, everything is there and available to watch? why is this only happening to my profile? its the same on pc, xbox, mobile, smart tv, everything. i just want to watch some netflix",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j11lda/somethings_wrong_with_my_netflix_profile/"
    },
    {
        "id": "1j1hs09",
        "author": "Zealousideal_Low_321",
        "title": "Recommend Cheating Wife/Girlfriend shows/movies",
        "content": "Recommend some Shows/Movies where the Wife/Girlfriend is cheating on their Partner with some other dude.\n\nIn modern times there are tons of movies/shows revolving around this plot which makes the plot insanely Dramatic &amp; I am sure Netflix has got many amazing shows/movies where The Wife/Girlfriend cheats on their Partner with some other man.. recommend some of these Shows/Movies guys 👍🏻",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs09/recommend_cheating_wifegirlfriend_showsmovies/"
    },
    {
        "id": "1j1i41c",
        "author": "Certain_Priority_906",
        "title": "How come I can still watch Netflix despite my expired subscription?",
        "content": "so, my netflix subs ended two days earlier on February 28th, but somehow I can still open the app, clicked \"X\" on the pop-ups, and continue watching. \n\nwould something bad happen in the future? \n\nI actually didn't need to worry about whether my money will be deducted from my account cuz I'm previously using a virtual wallet to purchase the subscription and i don't have any balance left.\n\npardon for my bad english.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j1i41c/how_come_i_can_still_watch_netflix_despite_my/"
    },
    {
        "id": "1j1hs7t",
        "author": "dailystar_news",
        "title": "WWE Elimination Chamber 2025 on Netflix results in full as John Cena shocks the world",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs7t/wwe_elimination_chamber_2025_on_netflix_results/"
    },
    {
        "id": "1j0lkx6",
        "author": "MBlaizze",
        "title": "The new user interface is so bad that I am thinking about canceling Netflix",
        "content": "This has to be the dumbest “upgrade” I have ever seen. I can barely see any of the content, and it feels like I am looking at the world through a tiny hole. If anything, they should have made the thumbnails even smaller so they could add more per screen. I hate it so much.",
        "upvotes": 18,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1j0lkx6/the_new_user_interface_is_so_bad_that_i_am/"
    },
    {
        "id": "1j11nga",
        "author": "hooshi_t",
        "title": "Netflix Profile Pic on TV",
        "content": "I've been watching netflix on my smart tv, today i was looking trough the profile pictures and couldn't find any i liked. Is there a way to get more pfps or customize to different ones in the Tv? Thankyou!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j11nga/netflix_profile_pic_on_tv/"
    },
    {
        "id": "1j1b546",
        "author": "Dremcis",
        "title": "little personal outburst",
        "content": "imagine paying a monthly subscription only to have the series you're watching get completely deleted from netlix, not to mention the few still sensible series that get deleted because the budget for the creation of the series has to be invested in worse films",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1b546/little_personal_outburst/"
    },
    {
        "id": "1j0907w",
        "author": "Pogrebnik",
        "title": "Netflix to Adapt Audible' Vampire Audio Drama, 'Impact Winter,' as TV Show",
        "content": "",
        "upvotes": 62,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j0907w/netflix_to_adapt_audible_vampire_audio_drama/"
    },
    {
        "id": "1j0yxuj",
        "author": "Fuwaboi",
        "title": "Is there a way I can find the transcript of the translated script from a series somewhere for free?",
        "content": "Say, I wanna find the French translated transcript of the One Piece Live Action, is there somewhere online I can find it? Thank you. I need some official translations as a school project, but the Netflix subscription is too expensive for me to use just for a small project. I did think about getting the subcription for 1 month, but I couldn't log into my account so I gave up.\nIt would be lovely if anyone can point me anywhere I can find something like that. \n\nNow, if you dont mind, I'm gonna stretch the hell out the wrd count from here. Gassy, octopussy, dex, shark, so, so, so, so ,so, so, gas, so, so ,so ,so ,so, gas, so, so, so, so, so ,so, so, so, so, so, so, gas, so, so, so, so, so, so, sk, so, so, so, so, so, so, so, so, so, so, so, so, so, so ,so, so, so, so, so, so, so, so, so, so, so, so\nHope you dont mind this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j0yxuj/is_there_a_way_i_can_find_the_transcript_of_the/"
    },
    {
        "id": "1j0r30c",
        "author": "Fkshitbitchcockballs",
        "title": "When yall gonna come out with a mechanism to pause episodes when I pass out?",
        "content": "Because I feel it’s gonna be a hit when it is eventually invented. The amount of times I fall asleep and have to figure out where I consciously left off is absurd. ",
        "upvotes": 5,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1j0r30c/when_yall_gonna_come_out_with_a_mechanism_to/"
    },
    {
        "id": "1j04ns3",
        "author": "S4v1r1enCh0r4k",
        "title": "The Night Agent was the most streamed show between Jan. 27-Feb. 2, 2025 with 2.92 billion minutes",
        "content": "",
        "upvotes": 102,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1j04ns3/the_night_agent_was_the_most_streamed_show/"
    },
    {
        "id": "1j1eluv",
        "author": "Whichbic",
        "title": "How do I remove Korean shows from my Netflix?",
        "content": "I don’t like them and it pisses me off that Netflix is showing this random shows. I have started blocking the titles but it’s too many. Is there a way to block the whole thing in one click?  ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j1eluv/how_do_i_remove_korean_shows_from_my_netflix/"
    },
    {
        "id": "1j0vm5s",
        "author": "S4v1r1enCh0r4k",
        "title": "'Stranger Things: The First Shadow' Hits the Stage in One Month, Tickets are now on sale",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j0vm5s/stranger_things_the_first_shadow_hits_the_stage/"
    },
    {
        "id": "1j0obid",
        "author": "Organic-Gas3086",
        "title": "Louis Litt vs. Diana Trout",
        "content": "After recently finishing “Younger” I’m left with the question…  \n\nWho was the better sleeper character that came out of left field to absolutely command every scene they are in and won your heart over?  Louis Litt in “Suits” or  Diana Trout in “Younger”?!? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j0obid/louis_litt_vs_diana_trout/"
    },
    {
        "id": "1j0hq5r",
        "author": "glowgurl",
        "title": "Titles missing from Netflix Germany",
        "content": "Anyone else having a problem with their netflix account in germany today? Multiple titles that I know were available in the country are suddenly not appearing today i.e. ANY of the Love is Blind seasons (from any country, even LIB Germany), Shrek, Schitt’s Creek, Parenthood. Seems odd that 4 things I’ve been watching lately are all weirdly not showing up, and were showing up yesterday. None of them were noted as “leaving soon”. Having this problem on both my Apple TV and laptop ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j0hq5r/titles_missing_from_netflix_germany/"
    }
]