[
    {
        "id": "1l3xrki",
        "author": "DanTrachtenbergAMA",
        "title": "Hi /r/movies, I'm Dan Trachtenberg. I've directed PREY and 10 CLOVERFIELD LANE. My next film, PREDATOR: KILLER OF KILLERS, is out on Hulu June 6th and PREDATOR: BADLANDS (starring Elle Fanning) is out in theaters later this year. Ask me anything!",
        "content": "Hey r/movies, I'm Dan Trachtenberg. Here to answer your questions.\n\nI've directed PREY (starring Amber Midthunder) and 10 CLOVERFIELD LANE (starring Mary Elizabeth Winstead and John Goodman). My next film, PREDATOR: KILLER OF KILLERS, is out this week, and PREDATOR: BADLANDS is out later this year.\n\nOn the TV side, I've directed the pilot episode of THE BOYS, also episodes of BLACK MIRROR, STRANGER THINGS (upcoming), and THE LOST SYMBOL.\n\nPREDATOR: KILLER OF KILLERS:\n\nTrailer:\n\n[https://www.youtube.com/watch?v=fbddYji1F8s](https://www.youtube.com/watch?v=fbddYji1F8s)\n\nSynopsis:\n\nA Viking raider, a ninja in feudal Japan, and a World War II pilot encounter a fierce intergalactic hunter.\n\nOut June 6th on Hulu.\n\nAsk me anything! Back at 1 PM ET today to answer your questions.",
        "upvotes": 851,
        "comments": 341,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q9kyq1sgp35f1.png?auto=webp&amp;s=4386ceb4c8efe76531092c582f9d0067b1b14400"
        },
        "permalink": "/r/movies/comments/1l3xrki/hi_rmovies_im_dan_trachtenberg_ive_directed_prey/"
    },
    {
        "id": "1l40io8",
        "author": "IDontUnderstandAMA",
        "title": "Hey /r/movies! We're David Joseph Craig &amp; Brian Crano, co-directors and writers of I DON'T UNDERSTAND YOU, a demented comedy-horror starring Nick Kroll, Andrew Rannells, and Amanda Seyfried. It's out in theaters nationwide this Friday and premiered at SXSW last year. Ask us anything!",
        "content": "Hey r/movies! We're David Joseph Craig &amp; Brian Crano, co-directors and writers of I DON'T UNDERSTAND YOU, a demented comedy-horror starring Nick Kroll, Andrew Rannells, and Amanda Seyfried. It's out in theaters nationwide this Friday and premiered at SXSW last year. Ask us anything!\n\nThis movie is part autobiographical account of our experience becoming adoptive parents and a babymoon/anniversary trip to Italy that left us stuck in a ditch in the middle of nowhere and part bloody murderous fiction.  Ask Me (Us) Anything!\n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=fgXrFNeVwN4](https://www.youtube.com/watch?v=fgXrFNeVwN4)\n\nSynopsis:\n\n\\&gt; Dom and Cole set out on the perfect Italian getaway. But after getting lost on the way to dinner, they end up stranded in a storm, offend the locals, and-whoops-accidentally kill a beloved restaurant owner.\n\nCast:\n\n* Nick Kroll \n* Andrew Rannells \n* Morgan Spector\n* Eleonora Romandini \n* Amanda Seyfried \n\nOur film premiered at SXSW last year.\n\nWe'll be back today at 6:00 PM ET to answer your questions. Ask us anything!",
        "upvotes": 24,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/57sd3mcqb45f1.png?auto=webp&amp;s=8ed54b38ca4277c17fd0212ba9e895618fd8ca18"
        },
        "permalink": "/r/movies/comments/1l40io8/hey_rmovies_were_david_joseph_craig_brian_crano/"
    },
    {
        "id": "1l4cykx",
        "author": "MarvelsGrantMan136",
        "title": "Fede Alvarez’s ‘Alien: Romulus’ Sequel Begins Filming in October",
        "content": "",
        "upvotes": 2061,
        "comments": 200,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_cXyKo5sJEC-_RosOfjGxZZXkD4vvU6xP_ApNmGs15w.jpg?auto=webp&amp;s=47dffaece6d954ac799be372d6619b6c9ed05f97"
        },
        "permalink": "/r/movies/comments/1l4cykx/fede_alvarezs_alien_romulus_sequel_begins_filming/"
    },
    {
        "id": "1l41w86",
        "author": "MarvelsGrantMan136",
        "title": "Guillermo del Toro’s ‘Frankenstein’ Rated “R” for Bloody Violence &amp; Grisly Images",
        "content": "",
        "upvotes": 5014,
        "comments": 203,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7ZSeRwmk7ckCVwa-T-f0Ba7432hae2oXYEpcYGtdERA.jpg?auto=webp&amp;s=11f7ea31f2661a6449aca08bac3dda4ee0bdc200"
        },
        "permalink": "/r/movies/comments/1l41w86/guillermo_del_toros_frankenstein_rated_r_for/"
    },
    {
        "id": "1l3z4dw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Luc Besson's 'Dracula' Starring Caleb Landry Jones, Christoph Waltz &amp; Zoë Bleu",
        "content": "",
        "upvotes": 3735,
        "comments": 697,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y6hvmghq045f1.jpeg?auto=webp&amp;s=0020fde2949ad60327268cc27488b34edc10f33e"
        },
        "permalink": "/r/movies/comments/1l3z4dw/official_poster_for_luc_bessons_dracula_starring/"
    },
    {
        "id": "1l48j63",
        "author": "MarvelsGrantMan136",
        "title": "'Ready or Not: Here I Come' Wraps Filming, Sets April 10, 2026 Release",
        "content": "",
        "upvotes": 641,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sinCeKoBVEQAXedX21jb8p7w6gXf4Ty7qlKA7d8qTh0.jpg?auto=webp&amp;s=96be1174d2eae393f0574ee50862a69ac5b57baa"
        },
        "permalink": "/r/movies/comments/1l48j63/ready_or_not_here_i_come_wraps_filming_sets_april/"
    },
    {
        "id": "1l4c073",
        "author": "tomarnoldlovescoke",
        "title": "Ed Harris",
        "content": "38M, will be 39 in less than a month. For a few years now I have been revisiting or rediscovering movies that my dad and brother watched as kids that he rented for the weekend. I'm totally familiar with the cast of actors that I recall in that era but I had no idea that Ed Harris was like in Everything!! Every movie I watch, he's in it. I'm so stupid. Was he that huge? I profes my ignorance.",
        "upvotes": 352,
        "comments": 290,
        "media": null,
        "permalink": "/r/movies/comments/1l4c073/ed_harris/"
    },
    {
        "id": "1l49anx",
        "author": "mrjohnnymac18",
        "title": "Spider-Man 4 filming to take over Glasgow this summer",
        "content": "",
        "upvotes": 352,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BLb_TtOGIHRLq5y_sD3fmgSy4eW1dFWNrKp0g5PyzYY.jpg?auto=webp&amp;s=74467ab4c86715ece519559db587643374b9df8f"
        },
        "permalink": "/r/movies/comments/1l49anx/spiderman_4_filming_to_take_over_glasgow_this/"
    },
    {
        "id": "1l3ybk3",
        "author": "brahbocop",
        "title": "Horror Icon Ken Foree Shares Plea to Preserve ‘Dawn of the Dead’ Mall",
        "content": "",
        "upvotes": 946,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/16u8AU7-HhxD5zIhElSn03ueKGfOWxcK_j4RiuzChUE.jpg?auto=webp&amp;s=23f802e515eab8900107636267155bf9d827848a"
        },
        "permalink": "/r/movies/comments/1l3ybk3/horror_icon_ken_foree_shares_plea_to_preserve/"
    },
    {
        "id": "1l4bi03",
        "author": "prolelol",
        "title": "Enzo Staiola, who played Bruno in The Bicycle Thieves (1948), has passed away at the age of 85.",
        "content": "",
        "upvotes": 166,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VSYYmFaFkAwSDU57v0IR2WzvrCkBN9BNgdqELLNjMBo.jpg?auto=webp&amp;s=5e71c729b7a7679f022534d56df554c0fa8d3629"
        },
        "permalink": "/r/movies/comments/1l4bi03/enzo_staiola_who_played_bruno_in_the_bicycle/"
    },
    {
        "id": "1l44vrg",
        "author": "Apprehensive_Fly9352",
        "title": "Saoirse Ronan Stars in Talking Heads’ ‘Psycho Killer’ Music Video, Directed by Mike Mills: 'I was totally daunted'",
        "content": "",
        "upvotes": 276,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbCPwNOwyuqPtAtOG-jGjwr95wIlC-c_THuPGnt-ZbE.jpg?auto=webp&amp;s=03b978fd2cec3710d5f28e85699807ed8388d359"
        },
        "permalink": "/r/movies/comments/1l44vrg/saoirse_ronan_stars_in_talking_heads_psycho/"
    },
    {
        "id": "1l42k4l",
        "author": "IvnOooze",
        "title": "Nick Jonas Set As KISS Singer Paul Stanley In STX Movie ‘Shout It Out Loud’",
        "content": "",
        "upvotes": 331,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B6PfRxI9MEuLVWyuzSpwdEkjsGF2Xpnou89hZUqleMY.jpg?auto=webp&amp;s=760f53af73b65f00b19ea37119abb02c420e78a7"
        },
        "permalink": "/r/movies/comments/1l42k4l/nick_jonas_set_as_kiss_singer_paul_stanley_in_stx/"
    },
    {
        "id": "1l3yzy4",
        "author": "JeanReptile",
        "title": "'Dracula' Official Trailer (directed by Luc Besson and starring Caleb Landry Jones)",
        "content": "",
        "upvotes": 455,
        "comments": 317,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3-2M6y2AAG0PLy9e3Pzr7O4OtpxVIiHiGgUtPovJE3s.jpg?auto=webp&amp;s=dfe959b5242f3d8d84a21aec7142041aaaf451a1"
        },
        "permalink": "/r/movies/comments/1l3yzy4/dracula_official_trailer_directed_by_luc_besson/"
    },
    {
        "id": "1l46th5",
        "author": "Haythtv",
        "title": "Why Barry Lyndon is Kubrick's Greatest Film",
        "content": "",
        "upvotes": 179,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ha-TJtKg8kVC1tUxX1V5aG4VSSQyJs4LPEvAALygznQ.jpg?auto=webp&amp;s=4d72208651a495f8b37d2c2e5af9d4d81c674fdb"
        },
        "permalink": "/r/movies/comments/1l46th5/why_barry_lyndon_is_kubricks_greatest_film/"
    },
    {
        "id": "1l3xlk6",
        "author": "NoCulture3505",
        "title": "The Man in My Basement | Teaser | Hulu",
        "content": "",
        "upvotes": 434,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wVEzz8aQCtYUPlDCdYeFg2JyQXqO6vc54Qu2d_dIJiw.jpg?auto=webp&amp;s=217ef5c5b6c31f0af709a447ac4c3f87c3864ce0"
        },
        "permalink": "/r/movies/comments/1l3xlk6/the_man_in_my_basement_teaser_hulu/"
    },
    {
        "id": "1l3h220",
        "author": "indiewire",
        "title": "Wes Anderson Says Jodie Foster Has Turned Down Starring in at Least Three of His Films",
        "content": "",
        "upvotes": 7242,
        "comments": 818,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qg2U1J4vxOoX4Sc85M3e1-eaU7eugxrK0y_pMkeJmR0.jpg?auto=webp&amp;s=c29f2119d523caa38cd57b4de85be4c4e18be416"
        },
        "permalink": "/r/movies/comments/1l3h220/wes_anderson_says_jodie_foster_has_turned_down/"
    },
    {
        "id": "1l46wc4",
        "author": "snugglecakes",
        "title": "Architecton | Official Trailer HD | A24",
        "content": "",
        "upvotes": 91,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bL7-Zw1ckwXDL8a-qcWYW4SiPLZnKEFTj1xwuLFg03Q.jpg?auto=webp&amp;s=c3012bec9aab5648166ee3976c544c3823ef8f24"
        },
        "permalink": "/r/movies/comments/1l46wc4/architecton_official_trailer_hd_a24/"
    },
    {
        "id": "1l4egj1",
        "author": "TheGirlWithTheLove",
        "title": "My story with 127 Hours",
        "content": "I’m autistic and 127 Hours is not only my favorite movie, but it’s also my main special interest/fixation. My special interest with this film has lasted over fourteen years. I thought I would share my story.\n\nThe first time I watched 127 Hours was on April 25th, 2011. It was on a Monday night. I was 16. I checked out the dvd from the library. I didn’t think it would make a big impact on me. But after that first watch, something clicked for me and I felt like a changed person. It was life affirming. I was totally blown away. I knew I had to watch it again very soon. I ended up renting it the next weekend. I fell in love with this movie. I eventually bought the dvd. It was being played so much that I was worried it’d break, so I ended up buying a second dvd copy, which is actually still sealed! At some point later, I bought the Blu Ray copy, even though I didn’t have a Blu Ray player at the time.\n\nI came across this film during my sophomore year of high school. I started showing it to my friends. There was a time in my theater class in which I had to make a movie set with a box set. I ended up creating Blue John Canyon. I also bought a book of the script and I brought it with me to school every day. 127 Hours was becoming my favorite thing in the world.\n\nNot only was 127 Hours my main source for joy and comfort, but it left a positive impact on my life. Before I watched it for the first time, I was taking my life and loved ones for granted. I learned to appreciate them so much more. But it also helped me physically. I used to refuse to drink water. I’d be forced to drink it, and I’d take the tiniest sips. Thanks to the film focusing on how important water is, it became my go-to drink. It made me a hydro homie, if you will. One thing autistic people struggle with are how their bodies lack signals, like hunger, thirst, using the bathroom, etc. The movie made me become more aware of my body’s needs.\n\nThere was also a time in my life when I was very depressed. I turned to self harm and had suicidal thoughts. My breaking point was when I posted a goodbye post on Facebook. I thankfully got help. 127 Hours was one of the things that helped me get better. And I’m forever grateful for that.\n\nI also did some pretty cool things because of 127 Hours. I was never much of an outdoor person before, but it made me fall in love with it. Whenever I’m anywhere near the mountains, I feel most at peace. Utah has become my favorite state to visit. I love to hike out there. I also met James Franco in 2014. I told him how many times I watched it at the time (around 300), and he said, “That’s a lot of times.” I had my Blu Ray copy for him to sign. He drew a heart on it. I never met Aron Ralston or Danny Boyle, but I’d love to meet them both one day, especially Aron! I have a semi-tribute tattoo for 127 Hours on my right arm. It’s a mountain outline. Every time I look at it, I think about the movie and being by the mountains. It makes me happy.\n\nThe last year really took a turn for me, both in good and bad ways. I was diagnosed with a chronic illness late last year, but I dealt with the nearly unbearable symptoms all year. I was in so much pain. Whenever I was at my worst, I turned to 127 Hours for comfort it would almost always make me feel better. And then at some point, I started to share my love for it on Reddit, particularly on r/letterboxd. I’d talk about how many times I’ve seen it. I didn’t think I’d get many responses to whenever I’d post or comment, but they ended up getting a lot of attention. I would become known as the 127 Hours girl.\n\nThe best thing about being the 127 Hours girl is that I’ve made a positive impact on people. I like to post because I like to share my love for the film. I’ve gotten so many responses from other users that sharing my love makes them happy. I feel like making people happy is one of my life’s purposes. And I definitely feel like I’m accomplishing that.\n\nBut the most exciting thing happened last month. I made a Tik Tok about my story with the film in April. I decided to tag Searchlight Pictures to see if they’d watch it. I didn’t think much of it. A few weeks go by and I open Tik Tok. I got a few notifications. I didn’t think it was anything out of the ordinary. But then I saw that Searchlight Pictures liked, commented and sent me a dm! They wanted to send me some things. I was so excited and happy that I screamed and cried!  I was so anxious to see what they were going to send me! And then it finally arrived. They sent me some merch. They got me a dvd copy (probably because I mentioned in the Tik Tok how I got a second copy in case if the first one broke), a poster, a 127 Hours Nalgene water bottle, a carabiner with a couple keychains, a t shirt they had when the film was released that says “I kept my eyes open for 127 Hours”, and a very nice handwritten note. Getting them to notice how much I love 127 Hours was always something I had on my bucket list, but I always thought it would be unrealistic to accomplish. It was a dream come true. They went above and beyond.\n\nI don’t know how many times I’ve watched 127 Hours, but my guess is at least a thousand times. I’ve watched it over 100 times this year alone. I don’t watch the whole film every day, but the biggest part of my fixation is my favorite scene, which I watch several times a day every day. It’s one of the video message scenes. I can never exactly pinpoint why it’s my favorite part of the film, but it’s been that way since the beginning. I have sessions where I’d watch it. They’d usually last between 15 minutes-to a half hour each, but there have been times where I’d watch it for an hour straight. I love it so much.\n\nI think I covered all the bases. I’m very open to answering questions. So if you have any, feel free to let me know!\n\nXOXO, 127 Hours girl",
        "upvotes": 34,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1l4egj1/my_story_with_127_hours/"
    },
    {
        "id": "1l45b0h",
        "author": "precursormar",
        "title": "In Defense of Hail, Caesar!",
        "content": "",
        "upvotes": 85,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/URAWjeljsA-P7NWnX8HIvjCsSbW-pAiVC1nN9WYLR9Q.jpg?auto=webp&amp;s=405e2062bd2c0ae1c21fb3332b10423cd4a33e95"
        },
        "permalink": "/r/movies/comments/1l45b0h/in_defense_of_hail_caesar/"
    },
    {
        "id": "1l3vkff",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie has the most bittersweet ending?",
        "content": "Inspired to make this post after being reminded of “I Saw the Devil” and its devastating ending. The main character gets what he wants or at least what he thought he wanted but at the cost of losing his humanity and essentially becoming corrupted himself. The ending shot of him walking and breaking down into tears is one of the best ending scenes ever in my opinion. \n\nWhat other movies have bittersweet endings?",
        "upvotes": 339,
        "comments": 560,
        "media": null,
        "permalink": "/r/movies/comments/1l3vkff/what_movie_has_the_most_bittersweet_ending/"
    },
    {
        "id": "1l3abba",
        "author": "BunyipPouch",
        "title": "First Image from Andy Serkis' George Orwell Adaptation 'Animal Farm' - Starring Seth Rogen, Steve Buscemi, Kieran Culkin, Woody Harrelson, Glenn Close, Andy Serkis, Gaten Matarazzo, Kathleen Turner, Laverne Cox, Jim Parsons, Iman Vellani.",
        "content": "",
        "upvotes": 10395,
        "comments": 1246,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/neaqyoepux4f1.jpeg?auto=webp&amp;s=eb511b23a8c99ee0ff9871d8b83bd0345a50c53c"
        },
        "permalink": "/r/movies/comments/1l3abba/first_image_from_andy_serkis_george_orwell/"
    },
    {
        "id": "1l40opn",
        "author": "futurafear",
        "title": "what’s a movie that isn’t horror but plays out like horror to you?",
        "content": "So I was thinking about what in movies has struck me or made me afraid and what made me avoid a rewatch, and I’ll go first to explain and wanna hear other thoughts, too!\nFirst, Sound of Metal. If I just lost my hearing and had to start over my fundamentals of communication AND lost my gateway to music among other things, I’d likely lose my mind and Riz Ahmed’s performance was so powerful to me.\nSecond, Bo Burnham’s Eighth Grade. I watched this twice, one time being a year after I finished middle school. It was too relatable and the feeling of social anxiety in the digital age that the lead goes through has likely made me block the movie from my memory each time. I probably worded this weird but lmk if you have any self-imposed horror picks!:)",
        "upvotes": 132,
        "comments": 310,
        "media": null,
        "permalink": "/r/movies/comments/1l40opn/whats_a_movie_that_isnt_horror_but_plays_out_like/"
    },
    {
        "id": "1l4f02s",
        "author": "Fickle-Winner-6549",
        "title": "The Mummy (1999)",
        "content": "What's not to love about this movie that stars Brendan Fraser, Rachel Weisz, and Arnold Vosloo. It's a supernatural action/adventure with humorous quotes; \"Hey Beni. It looks like I've got all the horses.\"\n\nFun fact: at least three actors from The Mummy have appeared on NCIS; Arnold Vosloo, Oded Fehr, and Erick Avari.",
        "upvotes": 19,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1l4f02s/the_mummy_1999/"
    },
    {
        "id": "1l3m7vg",
        "author": "DinoKYT",
        "title": "Wicked: For Good - Official Trailer",
        "content": "",
        "upvotes": 1327,
        "comments": 413,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p06koRAUYgYQGz4TxdSkWZjZGS-JoSY9CKtUNU803DI.jpg?auto=webp&amp;s=9b15201c759f573bc9b37af69b7854fdf87c8972"
        },
        "permalink": "/r/movies/comments/1l3m7vg/wicked_for_good_official_trailer/"
    },
    {
        "id": "1l4f5w1",
        "author": "Amaruq93",
        "title": "George A. Romero’s daughter, ex-wife and widow are each working on movies rooted in his \"Zombie\" legacy, even as they wrestle with their memories and a contentious split",
        "content": "",
        "upvotes": 16,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hlq13ziZFMmyIIQmDSiiteFsUuYGNzQl9Do9-RJWOc0.jpg?auto=webp&amp;s=0dfae6b06cbb2e01c2a51f5698bb358788495100"
        },
        "permalink": "/r/movies/comments/1l4f5w1/george_a_romeros_daughter_exwife_and_widow_are/"
    },
    {
        "id": "1l4d6wy",
        "author": "Contcos",
        "title": "Ang Lee To Direct 'Old Gold Mountain' Movie",
        "content": "",
        "upvotes": 20,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qeTQ2Bp3kVfEPngKerf38JlpGNdo0qy8DHBb_UtM-v4.jpg?auto=webp&amp;s=97ef3f09be1386ce1e7d5350e2a3a24278b6189d"
        },
        "permalink": "/r/movies/comments/1l4d6wy/ang_lee_to_direct_old_gold_mountain_movie/"
    },
    {
        "id": "1l47off",
        "author": "gruesomesonofabitch",
        "title": "An American Tail Fievel Goes West (1991) is a shameless rehash at its core but I find the film extremely charming and vastly more enjoyable than An American Tail (1986).",
        "content": "https://preview.redd.it/59defs8xy05f1.jpg?width=4000&amp;format=pjpg&amp;auto=webp&amp;s=d2d3a13d1a1994067d13ed62cec3ea0ebfcd4ad3\n\nI've never found An American Tail to be particularly engaging but Fievel Goes West is a movie that I adored and watched very often as a child, as an adult I've grown to appreciate Fievel Goes West in a way that my younger self likely wouldn't have grasped (I was 4 when it released). The film is cute but gritty, has a satisfyingly swift pace, terrifically charming/fun sequences, the quality of the animation and art design are much more impressive than you might expect, it's visually striking with an exquisite color palette and James Horner's western themed score is excellent. Another aspect that I love about the film is how dark Cat R. Waul's (the villain) motivations are for befriending mice, his intent is to exploit their labor for building his town then kill and eat them once they've served their purpose (he even has them unknowingly construct the giant mousetrap that will bring their demise). If you're a fan of animation and have never seen Fievel Goes West then it's absolutely worth a watch.",
        "upvotes": 36,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1l47off/an_american_tail_fievel_goes_west_1991_is_a/"
    },
    {
        "id": "1l4322j",
        "author": "DemiFiendRSA",
        "title": "Josh Greenbaum Tapped To Direct ‘Care Bears’ Movie For Warner Bros",
        "content": "",
        "upvotes": 57,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dX3BjetfUQd2YDkwHNBCO6Jl4ReG-kwWPO0mqGj6OH8.jpg?auto=webp&amp;s=00d06ac503fd963e18daeca9dda08cefcd932940"
        },
        "permalink": "/r/movies/comments/1l4322j/josh_greenbaum_tapped_to_direct_care_bears_movie/"
    },
    {
        "id": "1l4f0ik",
        "author": "ChannelEarly2102",
        "title": "Enemy at the Gates (2001)",
        "content": "Had no idea this classic was on Paramount Plus.  I saw it in the theater when it came out.\n\nD Day anniversary is tomorrow so I’m in a WW2 movie mood.  \n\nHistorically not really accurate but it’s entertaining.  I loved Jude Law in AI Artificial Intelligence that also came out in 2001.\n\nRIP Bob Hoskins.  \n\nHighly recommended viewing.  ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1l4f0ik/enemy_at_the_gates_2001/"
    },
    {
        "id": "1l35pkg",
        "author": "PM_Peartree",
        "title": "What ever happened to Liv Tyler? Her career seemed on a high after The Lord of the Rings and then, KAPUTT.",
        "content": "The only big thing she seemed to do in movies after the Tolkien trilogy was The Strangers which did well at the box-office but didn't appear to help Tyler's career out all that much. Jersey Girl flopped and The Incredible Hulk was the rare MCU under-performer. \n\nI remember Liv Tyler was like the next big thing: Armaggedon, Stealing Beauty, The Lord of the Rings, the Aerosmith music videos, she was everywhere. Just to give you an idea of how popular she was, her role as Arwen wasn't that big yet she always had her face in the movies' posters which shows how much of a star she was.",
        "upvotes": 6452,
        "comments": 1494,
        "media": null,
        "permalink": "/r/movies/comments/1l35pkg/what_ever_happened_to_liv_tyler_her_career_seemed/"
    },
    {
        "id": "1l3n9ai",
        "author": "koalabat",
        "title": "Who are the two actors you thought were the same person until you realized they were not?",
        "content": "For me - it was Charlie Hunnam and Travis Fimmel.  I would always think that Jax from Sons of Anarchy was the same person as Ragnar from Vikings.  Similarly I would tell my friends that the Warcraft movie has the guy from Green Street Hooligans. I just always thought it was funny mixup but I'm sure there are others that I just never got around to even learning the actors name.",
        "upvotes": 535,
        "comments": 1052,
        "media": null,
        "permalink": "/r/movies/comments/1l3n9ai/who_are_the_two_actors_you_thought_were_the_same/"
    },
    {
        "id": "1l36lvt",
        "author": "jimmyhoffasbrother",
        "title": "AMC to show even more ads in its theaters before the actual movie",
        "content": "",
        "upvotes": 4664,
        "comments": 972,
        "media": null,
        "permalink": "/r/movies/comments/1l36lvt/amc_to_show_even_more_ads_in_its_theaters_before/"
    }
]