[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 499,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jfng61",
        "author": "Plane-Cloud-5837",
        "title": "Netflix unveils plans for Adolescence season two and beyond",
        "content": "",
        "upvotes": 139,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1jfng61/netflix_unveils_plans_for_adolescence_season_two/"
    },
    {
        "id": "1jfkkm4",
        "author": "ManyFaithlessness404",
        "title": "Watched adolescence and it was powerful",
        "content": "The show is the need of the hour, toxic masculinity is real, incel culture is real and it is scary. I did try giving Jamie benefit of the doubt for the first 30 seconds and then I couldn't. This is so prevalent all around and I hope and pray the world becomes better but I doubt it will.\n\nNeedless to say, the show was done brilliantly - the actors did an amazing job and my heart cried for the parents and the show was so raw and I loved that. \n\nJust finished watching 30 minutes back and the raw emotions still linger in my mind and in my heart.. ",
        "upvotes": 32,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jfkkm4/watched_adolescence_and_it_was_powerful/"
    },
    {
        "id": "1jfqc21",
        "author": "BloodAndSpit36",
        "title": "Concerned with people's responses to Adolescence",
        "content": "I've seen quite a lot of reviews of the show discussing how much viewers hate Jamie, see him as evil and so on. \n\nI think these people are missing such a crucial point of the show - that being that children are growing up much too quickly in modern society. \n\nWe cannot view a 13 year old throught the lens of being evil, and responding to their behaviours so virulently as to say we hate him. \n\nEvery aspect of the show is concerned with the lost childhood. The obsession with sex for both the boys and girls in the school, the \"sexual marketplace\" competition accelerating bullying between boys, from boys to girls and from girls to boys. \n\nJamie is eerily mature for his age, we see this in how cognisant he is of the situation that he and the people his age are in; but that maturity isn't a true maturity and acts as an illusion which I can understand make people think he is responsible for his actions. \n\nThat maturity is a very fragile one. It's superficial, only existing as an expression on the surface - a performance that others his age copy from social media and force each other to fit into. \n\nI think that's the main point to take from this show. ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jfqc21/concerned_with_peoples_responses_to_adolescence/"
    },
    {
        "id": "1jf1wbf",
        "author": "seethatocean",
        "title": "Adolescence made me angry",
        "content": "As a mother of a teenage daughter, Adolescence made me angry.\n\nI mean, it was impossible to feel any sympathy for Jaimie after seeing the video evidence.\n\nI find it ridiculous that people are making excuses for Jamie and blaming online toxicity for his actions. As if he is a victim..\n\nLike - I don't care whether your son was born like this, or became an anti-women terrorist because you allowed him to watch inappropriate online content , or you yourself radicalized him - he doesn't get a right to kill teenage girl and then play the victim card. \nHe needs to be locked away in jail as per whatever law decides. \n\nWe need to perhaps revisit our laws in various countries where underage criminals get away with almost anything. \n\nDo we show the same consideration to religious islamic terrorists and to black youth? Do we say - oh come on, they are just being radicalized online, let's not blame them. \n\nBut if it is a white straight boy, then the sympathy floodgates open up huh. \n\nI also wonder if people's reactions would be different if the victim was another boy- a white straight boy - instead of Katie. Then everyone would have said that Jamie was a criminal and not blamed the victim maybe.\n",
        "upvotes": 424,
        "comments": 264,
        "media": null,
        "permalink": "/r/netflix/comments/1jf1wbf/adolescence_made_me_angry/"
    },
    {
        "id": "1jfo5x0",
        "author": "OverSyncopatedBeats",
        "title": "After Adolescence, Owen Cooper is in this new show written by and starring Aimee Lou Wood!",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfo5x0/after_adolescence_owen_cooper_is_in_this_new_show/"
    },
    {
        "id": "1jfntm9",
        "author": "elphiegal",
        "title": "Adolescence shows the importance of parental figures",
        "content": "Please don’t read if you haven’t watched or don’t want it spoiled for you.\n\n\nI have read people saying that adolescence is boring, it’s not realistic, it’s not “murder mystery” and its just not everyone is understand the point of the show?\n\nIt never ever said it was a murder mystery, we find out from the very start who the killer was, it was about why the killer did what he did. \n\nIt’s about the reasoning and the logic behind one’s actions especially at a young age.\n\nOne thing that is important and they made a big deal to point it out in episode 3, is Jamie’s relationship with his father, he says his dad is kind but can be angry and is a “good man” but can lose his temper.\n\nWe see in episode 1 that once Jamie has been arrested, his dad never comforts him once, he doesn’t reassure him, he doesn’t hug him or touch him, just looks at him awkwardly like “what do I do?”\n\nEven his mother was confused when Jamie asked for his dad to be his appropriate adult, the reason to why he didn’t have his mom was more than likely he couldn’t deal with her disapproval in her face, while with his dad he’s use to it as he says in episode 3 with his therapist, when he played football and messed up his dad would look away.\n\nUntil his dad sees the CCTV footage and realised that his son has killed someone and that is when he hugs his son, whether that was comfort to him or for his son or fear for the fact his son is going to prison!\n\nThe show shows how children learn how to react based on how their parents react to situations.\n\nIf he sees his dad acting all aggressive and angry towards his mother and sister, then he must think it’s okay for him to act like that towards other women, since his dad does it! \n\nHis dad does not give him love or affection from what we see when he’s arrested and if he doesn’t receive that from his own father how is he meant to understand how to give love and affection?\n\nEverything we know is what we have learnt from watching our parents.\n\nNow insert social media, your parents don’t show you how to act so you go to the internet and there’s the forums degrading women, then that must be how to be a man.\n\nMen need to stop thinking being masculine means not being kind and loving. \n\nThere’s so much more I would want to say but I’d be here forever. ",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jfntm9/adolescence_shows_the_importance_of_parental/"
    },
    {
        "id": "1jfcmxr",
        "author": "Inspired_Owl",
        "title": "Adolescence",
        "content": "What a masterpiece, I was sobbing at the end. \n\nFirst of all, my sympathy goes out to the family, especially the father. It was really eye opening to what goes on online and how it can affect people, especially young people. I’m 18 and had no idea about ‘incel’ or ‘exploding pill’, it was terrifying seeing what content anyone can access. \n\nI couldn’t take my eyes of the screen, 4 hours straight I was on the edge of my seat. \n\nI honestly think this is a good programme for anyone raising kids to watch. It was very eye opening.\n\nAnd the acting. Holy shit, I had to remind myself often that it was a to show and not a documentary. Hats off to everyone who worked on the programme.",
        "upvotes": 44,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jfcmxr/adolescence/"
    },
    {
        "id": "1jfohoz",
        "author": "Robemilak",
        "title": "Wonka-Inspired Series 'The Golden Ticket' Is Coming To Netflix and You Can Compete in It!",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfohoz/wonkainspired_series_the_golden_ticket_is_coming/"
    },
    {
        "id": "1jeot1i",
        "author": "flannel_flower",
        "title": "Why are so many missing the point of Adolescence?",
        "content": "There’s a lot of articles on Facebook about the new series Adolescence and the vast majority of people seem to have completely missed the point of the series and the message it’s trying to convey?                                                                   You have people asking whether Jamie really killed Katie, saying that it was left on a cliff hanger and there will be a series 2, that it was about bullying or knife crime. The series is clearly about toxic masculinity and how young boys are being brain washed by Andrew Tate and the likes. Jamie couldn’t handle being rejected by a “flat-chested” girl who was weak and vulnerable after her topless photos were circulated. He thought he was entitled to her, that he deserved her. She did ridicule him online with her comments on his Instagram which was a contributing factor but it really did come down to Jamie thinking he was entitled to Katie.",
        "upvotes": 1085,
        "comments": 401,
        "media": null,
        "permalink": "/r/netflix/comments/1jeot1i/why_are_so_many_missing_the_point_of_adolescence/"
    },
    {
        "id": "1jf78nv",
        "author": "sidroy81",
        "title": "Anurag Kashyap rips 'dishonest, morally corrupt' Netflix India, says they would 'never make' something like Adolescence",
        "content": "",
        "upvotes": 50,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jf78nv/anurag_kashyap_rips_dishonest_morally_corrupt/"
    },
    {
        "id": "1jfsncb",
        "author": "Ready-Ambassador-271",
        "title": "Adolescents, how did the police know who was in the video?",
        "content": "The murder happened about Ten in the evening and a few hours later the police are banging his door in. All they had was a black and white video taken at night time.  They also had videos from other cameras, along the way, how did they get all the footage so quick?\n\nThey obviously did not have enough video to follow his entire journey or they would have seen what he did with the knife and shoes. So how did they know who it was and where they lived?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfsncb/adolescents_how_did_the_police_know_who_was_in/"
    },
    {
        "id": "1jflcna",
        "author": "S4v1r1enCh0r4k",
        "title": "Ted Sarandos Would Work With Karla Sofia Gascón Again After Netflix’s Derailed Oscar Campaign: ‘You Have to Have Grace’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jflcna/ted_sarandos_would_work_with_karla_sofia_gascón/"
    },
    {
        "id": "1jezg16",
        "author": "Grogman2024",
        "title": "Jamie’s crime in Adolescence",
        "content": "How is there so many people asking whether or not Jamie did it when he was very clearly caught on camera stabbing Katie. I’ve even seen a lot of people saying in the video you only see Jamie pushing her when you very clearly see more than that? Just very confused overall haha",
        "upvotes": 96,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1jezg16/jamies_crime_in_adolescence/"
    },
    {
        "id": "1jfs0db",
        "author": "menelauslaughed",
        "title": "Psychologists out there - opinion on Adolescence?",
        "content": "Any idea what she may have written in her report on Jamie? How much would she focus on her own emotions during the assessments? Would she have made any sentencing recommendations?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfs0db/psychologists_out_there_opinion_on_adolescence/"
    },
    {
        "id": "1jewkoh",
        "author": "gnshgtr",
        "title": "Netflix Director Arrested for $11 Million Fraud, Spent $2.4 million on five Rolls-Royces and one Ferrari",
        "content": "",
        "upvotes": 97,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1jewkoh/netflix_director_arrested_for_11_million_fraud/"
    },
    {
        "id": "1jfjtm5",
        "author": "Robemilak",
        "title": "Netflix’s Ted Sarandos Isn’t Done Disrupting Hollywood: On Winning the Streaming Wars, a Marvel ‘Fistfight’ and Defending Meghan Markle",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfjtm5/netflixs_ted_sarandos_isnt_done_disrupting/"
    },
    {
        "id": "1jfort7",
        "author": "Carlstonio",
        "title": "Thoughts on Ad-Supported Netflix",
        "content": "Hi all, I'm a netflix user in the UK. I've had standard netflix for about a decade now, and I watch almost daily. I prefer longer shows and sitcoms, my partner watches Love is Blind and other reality shows, and my kids watch lots of kids programming. We don't tend to be limited by the number of concurrent users.\n\nI'm curious about the Ad-Supported standard plan. What are the adverts like? Are there 3 minutes of ads every 20 minutes, or fewer, or more?\n\nI'm also just wanting people's input as to whether it's worth the cost saving (£5.99 Vs £12.99 in UK), and any other thoughts about the Ad-Supported plan. What are the other positives?\n\nMy kids have almost always had Netflix/Disney over terrestrial TV, so they give me a funny look whenever their shows are interrupted by an advert.\n\nThanks in advance!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jfort7/thoughts_on_adsupported_netflix/"
    },
    {
        "id": "1jfix2l",
        "author": "yakultbiss",
        "title": "What should I watch?",
        "content": "Recently have had more free time than usual so was wondering what I should watch. Any and all Recs are appreciated! I like drama, thriller/psychological, sitcoms, and honestly most shows.",
        "upvotes": 3,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1jfix2l/what_should_i_watch/"
    },
    {
        "id": "1jf1cvl",
        "author": "lllIIIIIlllIIIII",
        "title": "Netflix show update Making a Murderer &amp; the Steven Avery case: Hidden phone call reveals the State knew about human remains being found off the property ~2 miles away.",
        "content": "[https://www.youtube.com/watch?v=liBllQYkG5w&amp;list=PLufnCEJ69\\_etoI1fUbfEHdZoPJJeiztw1&amp;index=40](https://www.youtube.com/watch?v=liBllQYkG5w&amp;list=PLufnCEJ69_etoI1fUbfEHdZoPJJeiztw1&amp;index=40)\n\nin 2018, on social media, Jerry Buting (Avery's defense lawyer in 2007) proclaimed this is the first he ever heard of this audio, and that the state knew they had found human remains in the 2 quarries adjacent to the Avery property.  (One of those properties was owned the Manitowoc County. Bones found on property owned by Manitowoc County not revealed to the defense)\n\n***Some context:***\n\n1. State of Wisconsin found Human remains on top of soil near Avery's trailer. They claimed that its where the bones were burned and cremated before even testing the burn pit soil for such evidence.\n2. State also found 4 locations (and at least some burn sites) in the quarry (piles 1-4 on map below)\n3. State wrote detailed report about the bones by Avery's trailer, and told the media, public, defense, and courts about them all the time.\n4. State didn't write any reports about the human remains in piles 1-4, didn't tell the media, public, defense, nor courts about them at all.\n5. The state forensic anthropologist examined these bones from piles 1-4 nearly a half year later, was told they were from the Avery property, and she included these bones in her summary a month before trial using the evidence numbers only and no description of where they originated from. Thus, Avery's defense team had no idea she included human remains found in the quarry in her final last minute report. Hell, she was unaware either.\n6. In court, the state claimed \"nobody knows what those are\" when referring to the quarry remains. A lie.\n\nIn short, the defense was misled about the human evidence, and they were arguing the quarry was the real crime scene. If the State had told the defense about ALL of the human remains, the defense's case would have been 100x stronger given they would be able to present human remains being found far away from their clients residence. After all, Avery wouldn't burn the body in the quarry then bring back evidence by his house to incriminate himself. No jury would buy that and the state knew that. They HAD to confine the crime scene as a whole to the Avery yard.\n\nThe kicker is the state didn't end up finding any evidence in Avery's burn pit proving a primary burn location, and their own expert testified that in her opinion, if it WASNT the primary burn location ,then she would have found other small, brittle bone fragments from other locations. (They did find exactly that, but she wasn't made aware of that when the evidence was turned over to her for examination).\n\nThose remains stashed in buckets for 6 months and never disclosed to the defense in a manner they could use. Defense claimed that area was crime scene at trial w/out this info.\n\nAnd for visual reference piles 1,2,3,4 are what the phone call is referencing, with piles 1, 2 &amp; 3 being located on the Manitowoc County quarry (same county which was being sued by Avery for framing him in 1985). Just look how far away and huge the crib\n\nhttps://preview.redd.it/di0ai89pynpe1.png?width=2664&amp;format=png&amp;auto=webp&amp;s=dd8429946c0fbc869f6afa2629d14d82c454351c\n\nEnd Result:\n\nThis map was presented by Avery's lawyer to the court in 2018/2019. The court ruled it was barred from being used because Avery once filed his own pro se (on his own, and without a lawyer) motion years before Making a Murderer came out, and the court punished Avery for not bringing this unknown information up earlier (even though the phone call wasn't released via FOIA until 2018.\n\n...This audio and Jerry Buting's admission he was never given it was not filed in court, however. Nor was it shown in Making a Murderer part 2, which was released prior to this phone call being made public.",
        "upvotes": 40,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jf1cvl/netflix_show_update_making_a_murderer_the_steven/"
    },
    {
        "id": "1jfmtpl",
        "author": "dfgooner",
        "title": "Adolescence writers 'invited to parliament' to discuss show's themes with MPs",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfmtpl/adolescence_writers_invited_to_parliament_to/"
    },
    {
        "id": "1jf55fy",
        "author": "Longjumping_Land_977",
        "title": "How many times Adolescence filmed each one-shot episode and the mistakes the show kept in",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jf55fy/how_many_times_adolescence_filmed_each_oneshot/"
    },
    {
        "id": "1jf154t",
        "author": "TheMirrorUS",
        "title": "Hollywood director charged with swindling Netflix out of $11M for unfinished sci-fi series",
        "content": "",
        "upvotes": 24,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jf154t/hollywood_director_charged_with_swindling_netflix/"
    },
    {
        "id": "1jf514b",
        "author": "S4v1r1enCh0r4k",
        "title": "Erin Doherty says starring opposite newcomer Owen Cooper in ‘Adolescence’ reignited her love of acting",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jf514b/erin_doherty_says_starring_opposite_newcomer_owen/"
    },
    {
        "id": "1jedgsd",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Adolescence’ Becomes Netflix’s Most-Watched Show of the Week",
        "content": "",
        "upvotes": 492,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1jedgsd/adolescence_becomes_netflixs_mostwatched_show_of/"
    },
    {
        "id": "1jfha7z",
        "author": "Sensitive_War2107",
        "title": "On My Block Help!",
        "content": "I am looking to know which episode a scene took place. Its the scene where Jamal, Monse, Ruby and his Abuelita (Grandma) are dancing in a room surrounded by money. Can someone please tell me the episode and specifically the time as well. Thank you!\n\nI found a gif of it here but still can't find the episode and time. https://www.buzzfeed.com/shylawatson/on-my-block-season-2-recap",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfha7z/on_my_block_help/"
    },
    {
        "id": "1jfh4n9",
        "author": "JoshieGN",
        "title": "Beautiful Scene",
        "content": "Season 13 Episode 10 - Mac Finds his Pride\n\nFor those who don’t know:\n\nThis show is a comedy about the worst “everyday” people imaginable - it’s excellent\n\nEvery episode has the main characters somehow try and win in life, nearly always at the expense of others - including each other\n\nAs viewers, we see them all as somewhat inhuman.\n\n**Spoiler Warning for Below**\n\nNever had we had an episode where any of the gang show a serious delicate, vulnerable or intimate side - which js where this scene is a diamond in the rough\n\nMac has just told his dad, who dislikes him for putting him in jail many seasons ago, that he’s gay. Dad seems indifferent to it. Meant to be funny.\n\nBut then we get this scene, where the music is an original score, where the lighting is poignant, where it doesn’t feel like it was ad-libbed or quickly thrown together.\n\nWe get something raw and meaningful and an honest statement about the LGBT+ experience.\n\nThe choreography is incredible, the connection between Mac and this unknown dancer is palpable (her character in the show I mean - she is Kylie Shea, a ballerina in real life), and Mac actually got to “use [his] body!”\n\nIt stuck with me and really meant a lot\n\nI hope it does/ did for you too\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfh4n9/beautiful_scene/"
    },
    {
        "id": "1jfjzqq",
        "author": "electricgodlew",
        "title": "Adolescence.. How did they do that shot?!",
        "content": "Like many of you I have recently watched adolescence on Netflix and thoroughly enjoyed it, but that's not the point of this post. There was some fantastic shots that would have been very difficult to perform, like the kid jumping out the window and the over the town - through the air shot in episode 2. Very cool but can probably be easily explained. \n\nHowever.. I need a media guru to tell me how a certain shot was done that I just CANNOT figure out. \n\nThe very start of episode 4 we see Stephen Graham in his shed then closes the door. The camera then side pans and appears to pass through a window pane of the shed. My natural assumption was \"Oh they've got a half built shed and the camera man walked out from a separate door or an open space\". But then the camera pans behind him and points up the garden path with a FULLY BUILT SHED! I just can't fathom how they did this in the continuous shot. If anyone has any explanation I would be very grateful and I apologise in advance if this is obvious to some!\n\nSpoiler tag added just incase... ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jfjzqq/adolescence_how_did_they_do_that_shot/"
    },
    {
        "id": "1jfnpq4",
        "author": "TimesandSundayTimes",
        "title": "What teens really think about Netflix's hit show Adolescence — in their own words",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jfnpq4/what_teens_really_think_about_netflixs_hit_show/"
    },
    {
        "id": "1jfg2yo",
        "author": "Legitimate-Hotel-990",
        "title": "Netflix says that it will be removed from my device (samsung TV) on april 17",
        "content": "why though\n\nMy dad says it's just because he needs to update payment or whatever but when I searched it up people say it's because Netflix just decided to stop updating for some specific models, like older ones i think idk. I might sound really dumb right now but I actually do not know.\n\nnetflix what 💔",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jfg2yo/netflix_says_that_it_will_be_removed_from_my/"
    },
    {
        "id": "1jffcsu",
        "author": "Remote-Breakfast3339",
        "title": "Arab show?",
        "content": "\n\nHey I’m looking for the name of this Kuwaiti drama I watched more then 5 years ago where this man had two families and left his first family because the new life did some sort of black magic. I remember one of the kids was a deaf boy who grew up to have a successful business. And in the new family they had a daughter who was an influencer. I can’t for the life of me remember the title if anyone has any leads please let me know ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jffcsu/arab_show/"
    }
]