[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o9ypkn",
        "author": "jonnyson14",
        "title": "Boots is the best show on Netflix right now",
        "content": "If you haven't watched it you absolutely need to. I laughed, I cried, I got angry, it's absolutely brilliant. I stuck it on with no knowledge of what it was, I thought I was just in for a modern take on stripes. Instead I got treated to the most compelling show I've watched in years! I'm begging people to watch it so it gets a season 2! I need it in my veins.",
        "upvotes": 25,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ypkn/boots_is_the_best_show_on_netflix_right_now/"
    },
    {
        "id": "1o9kmmk",
        "author": "Conscious-Can-5334",
        "title": "The Perfect Neighbor - thoughts?",
        "content": "This has me bawling. It’s so sad. Those poor children. That woman should have been arrested from the start. Why didn’t I hear about this in the news when it was happening? ",
        "upvotes": 228,
        "comments": 473,
        "media": null,
        "permalink": "/r/netflix/comments/1o9kmmk/the_perfect_neighbor_thoughts/"
    },
    {
        "id": "1o9mj78",
        "author": "sallymacsmack81",
        "title": "Victoria Beckham’s supposed ‘Victory’ - David Beckham has been subsidising my eyeliners.",
        "content": "The whole premise of the Victoria Beckham documentary was that she fought for 17 years to be taken seriously in fashion and build her brand, all for it to finally stabilise in 2023 after cumulative losses of -£69 million pounds, to post a triumphant profit. But the truth is she posted a EBITDA profit of around £2m pounds, but still an operating loss of -£2.9m. This year, she’s had to extend loans of £6.3m to keep it afloat. It’s not successful and hasn’t been, and if you can’t make a company generate a return in 17 years, after that much investment, it’s not going to magically start making a return. And for that £70 million investment to have meant anything, it needs to be able to generate more than that at some point, not just pay it back. Like who in god’s name pumps that much cash into something year after year, as an escalating commitment to failure, and then gets a documentary made about what a big success it is. I’m baffled! I own some of her eyeliners, and now I know David Beckham has partially subsidised them!",
        "upvotes": 140,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1o9mj78/victoria_beckhams_supposed_victory_david_beckham/"
    },
    {
        "id": "1o9zos5",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat season 3 - Right off the rip",
        "content": "\"A Real Bible. Adult size. Written by Jesus\"\n\n\"Jesus did not write the Bible\"\n\nThe Diplomat Season 3 hasn’t missed a beat. I’m only on the first episode and already hooked. Hal is such a headache, never listens... but I do think he means well. The dynamic between Grace (the President) and Kate (the Ambassador) is fantastic.\n\nThe pacing’s great too. It moves fast but knows when to slow down, like that scene where Kate helps Grace in the bathroom with her shirt. I also love how the show lets the audience in on what’s really happening, even when the truth isn’t said outright... like during the visit with Margaret Roylin.\n\nAnd it’s funny! A political thriller with perfectly timed humor is exactly the escape I needed today.\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9zos5/the_diplomat_season_3_right_off_the_rip/"
    },
    {
        "id": "1o9fgki",
        "author": "Previous-Boss-1480",
        "title": "boots 🥾",
        "content": "is anyone else obsessed with boots!? I absolutely love the show finally finished last night and I wish it had more already lol! I’m so curious where did Sargent Sullivan go? I wonder if next season it’ll actually show them in “war” I have sooo many unanswered questions 😅 did anyone else love the show?? also like why did James kinda lead cam on that irritates me so bad I truly thought they would do good together .. also love cams progress I feel like he needed that camp more than the others \nsorry for the spiraling just need someone to talk to about it 🤣",
        "upvotes": 46,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fgki/boots/"
    },
    {
        "id": "1o9q9if",
        "author": "Last-Maize7926",
        "title": "The Diplomate Season 3",
        "content": "All of you, if you have watched Season 3 of diplomate, please suggest what do you think of this season.\n\nor if you have already stated watching it what do episodes are you in and what have you liked so far",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o9q9if/the_diplomate_season_3/"
    },
    {
        "id": "1o9tvl8",
        "author": "Flat-Fig3159",
        "title": "Buffering problems",
        "content": "Has anybody else been getting insanely slow loading times? With the same wifi I have now I could have had 5 minutes of the episode loaded at any time in 2019-2022 and now with the same wifi the first 5 minutes of an episode are less than 480 pixels. For the first 2 minutes each pixel was like 4cm squares.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9tvl8/buffering_problems/"
    },
    {
        "id": "1o8wc2o",
        "author": "BradyPhoenix",
        "title": "The Perfect Neighbour",
        "content": "Just finished watching this and more than anything it was just so sad. Those poor babies.\n\nIt did warm my heart a bit to see how much the community cared for one another’s children though. I hope they’re all doing alright.",
        "upvotes": 358,
        "comments": 558,
        "media": null,
        "permalink": "/r/netflix/comments/1o8wc2o/the_perfect_neighbour/"
    },
    {
        "id": "1oa0bkf",
        "author": "schi__zoid",
        "title": "The Perfect Neighbor - it is really heartbreaking",
        "content": "What an ironic title. Losing someone close to you is one of the most difficult things, and it's even worse when the kids are still young. Luckily they seem to be well surrounded by their loved ones.\n\nChildren can be very noisy and annoying, THAT'S WHY THEY ARE CHILDREN. I felt sick when they showed Susan making a scene and refusing to just FKN stand up and go to jail. Very pathetic. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oa0bkf/the_perfect_neighbor_it_is_really_heartbreaking/"
    },
    {
        "id": "1o9zn8b",
        "author": "Noggin-Loggin",
        "title": "Netflix downloads",
        "content": "Why the hell does my downloads keep getting an unavailable status whenever it wants, and then the day later, it's working fine. And so, when I try to download it again, it stops me saying \"titles can only be downloaded a certain number of times a year\". It is such a basic issue that can be fixed so easily but why does this happen?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9zn8b/netflix_downloads/"
    },
    {
        "id": "1o9ksho",
        "author": "Kipper3469",
        "title": "The Perfect Neighbor, susans condition",
        "content": "Anyone notice Susan’s condition. Like in the first few clips she was like bigger and had a head full of hair and during the sentencing she just looked like a ghoul like she has completely decomposed in 2 years. Like I mean in my opinion I think she was more pushed to shooting by anger and fear but I just find it so crazy that she aged more in 2 years then some people do in 10. Maybe because the stress of the trial or what it is I don’t know but I just found one of the craziest parts how much she had aged in such a short amount of time ",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ksho/the_perfect_neighbor_susans_condition/"
    },
    {
        "id": "1o9xttg",
        "author": "LockedOutOfElfland",
        "title": "Does McAffey in Boots have epilepsy?",
        "content": "I believe this is implied, but how realistic is the portrayal of his management of his conditions as an adult? He passes a medical checkup, so his condition appears to be fairly mild. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9xttg/does_mcaffey_in_boots_have_epilepsy/"
    },
    {
        "id": "1o9h83z",
        "author": "VelvetOrbitXO",
        "title": "Suggest netflix series",
        "content": "HI, anyone to suggest good Netflix series that will be worth my time watching 😉 any genre that will be worth it to watch, kind of get bored when I am doing nothing during my free time 😁 ",
        "upvotes": 10,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1o9h83z/suggest_netflix_series/"
    },
    {
        "id": "1o9u6hk",
        "author": "Hypereichelkas",
        "title": "Audio/video out of sync",
        "content": "For about a month now, I've been experiencing asynchronous audio and video on my iPad and iPhone (both running the latest iOS 26.0.1). The audio comes first, and the video is about half a second behind. \n\nI have already contacted support, who are unaware of the problem and are working on a solution. It works perfectly on my girlfriend's iPhone (she still has iOS 18). \n\nEverything works fine on my YouTube or Disney+ app. \n\nHas anyone else experienced this? \n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o9u6hk/audiovideo_out_of_sync/"
    },
    {
        "id": "1o9ykw7",
        "author": "Dockland",
        "title": "Better call Saul",
        "content": "One of my all time favorite series is Breaking bad. Such a great plot, story and actors. So a while ago I decided to watch Better call Saul, hence being in the BB universe and shares producers and som of the actors and, here’s my take. It doesn’t have any plot. Is it just me that feels this way. I’m on S1:E7 already but I don’t have any clue what the plot or storyline is, other than random events. BB had one of the strongest scrips in the history of series but “Saul” doesn’t have anything near that. \n\nNow, I do love the actors, production design and the same atmospheric mood and that’s great. Breaking bad probably would be great even without the characters that “Saul” has, but not the other way around. \nTo do a spin off I think the plot has to be at least as good, or even stronger/better to justify its existence. \nWhat would “Saul” be if there were no Breaking bad in the first place?\nFor me, as an avid BB fan I just don’t get YBCS at all. Am I the only one feeling this or am I on my own?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ykw7/better_call_saul/"
    },
    {
        "id": "1o9439z",
        "author": "throughthequad",
        "title": "The next Monster Series",
        "content": "I would love to see Netflix go for an Ed Kemper story and resurrect Cameron Britton as Kemper. He was so good in MindHunter, I would love an entire miniseries seeing him portray Kemper. ",
        "upvotes": 38,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1o9439z/the_next_monster_series/"
    },
    {
        "id": "1o9k7cq",
        "author": "No_Calligrapher2005",
        "title": "Suggestions of shows I watched",
        "content": "I’m new to Netflix and movies that I have already watched keep showing up as suggestions to watch. How do I stop those movie suggestions from appearing so that I can receive new suggestions that I haven’t seen? ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o9k7cq/suggestions_of_shows_i_watched/"
    },
    {
        "id": "1o9dkr8",
        "author": "PlantNerdxo",
        "title": "‘You purchased an extra member slot’ - wait what?",
        "content": "I just got this email from Netflix. I absolutely did not purchase an ‘extra member slot’. I immediately logged on to cancel this.\n\n\nHas this happened to anyone else?",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9dkr8/you_purchased_an_extra_member_slot_wait_what/"
    },
    {
        "id": "1o9cru3",
        "author": "njdotcom",
        "title": "See all the Netflix Christmas movies premiering in 2025",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9cru3/see_all_the_netflix_christmas_movies_premiering/"
    },
    {
        "id": "1o9m4ks",
        "author": "Pudix20",
        "title": "How can I see more genres/options similar to old Netflix",
        "content": "I’m using Netflix on a Google TV. Somewhat recently, they updated to these large tiles that basically show 4 options on the screen at a time. And these hyper specific categories, each of which have 7-10 movies/shows in them. \n\n“Suspenseful movies about friendship”\n“Critically-acclaimed underdog drama movies”\n“Don’t watch hungry”\n\nAnyway I don’t actually *mind* hyper specific categories. And I know you can access the genres through search. But this seems *less* user-friendly to me. \n\nAny suggestions? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9m4ks/how_can_i_see_more_genresoptions_similar_to_old/"
    },
    {
        "id": "1o9fryn",
        "author": "Alexfd1971",
        "title": "Maze Runner: The Scorch Trials could have easily have been the end of that (ps: haven't seen the 3rd one)",
        "content": "The first Maze Runner was perfect and could have been left at that, but it was great that they made Scorch Trials to give fans more and maybe add a bit because of how cliff hang the end felt, and it was good up until TERRASSA RATTED OUT THE RIGHT ARM!!\nIt was a dumb decision and the way they paced it towards the whole crew getting jumped was faster than Wally West, I'm just saying from what I currently see that the 3rd one was just a cash grab (about to watch 3rd one anyway to see if it's worth it)\n\nUpdate: Just watched The Death Cure, was most definitely a cash grab, I crashed out every time Teresa was on. I know they probably were following the way the books were published (I didn't know it was based off a book) but still, they had Teresa as the love interest when it should have been Brenda, Gally was nice to have but still was a bit out of touch, and then newt dies, terrible, would recommend only to watch the first one and then no more, it's definitely not worth it",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fryn/maze_runner_the_scorch_trials_could_have_easily/"
    },
    {
        "id": "1o9x2ky",
        "author": "GrapefruitAlarming76",
        "title": "Carmelo on Netflix needs multiple trigger warnings 😳",
        "content": "***Major spoiler so please don’t read if you haven’t watched yet***\n\nAfter a long week, my boyfriend and I sat down on a Friday night to what we thought was going to be a lighthearted movie about a cute dog named Carmelo (who looks shockingly similar to our dog). My boyfriend used to live in Brazil, so he was excited to see the landscape, the countryside, city, and hear Portuguese. He could even decipher per accent which locale the actors were from. \n\nThe movie was labeled as “heartwarming” and it certainly started it that way. It was cute and lively, we laughed quite a bit thinking about the mannerisms of our own dog. \n\nHowever shortly into the movie, we learn that the main character has brain cancer, a theme that truly carries the movie. I’ll just say that the final 20 minutes of this movie were really hard to watch and we ended up completely shutting it off at the last 5 minutes. Our dog is 17 years old and I purposefully stay away from any movies where a dog passes away. We have also both lost parents to cancer and have witnessed the horrible effects of chemo and have witnessed their deaths. \n\nCarmelo needs the following themes to warn of triggers:\n\nGrief\nIllness\nDeath\nAnimal death\n\nI think this day and age with all the attention to mental health, this was careless of Netflix to not screen for these important themes before streaming to millions of people. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o9x2ky/carmelo_on_netflix_needs_multiple_trigger_warnings/"
    },
    {
        "id": "1o9k0uu",
        "author": "Adorable_Fig4485",
        "title": "squid games",
        "content": "I watched the first season of squid games when it came out and found it really interesting. However I haven't been able to watch the later 2 seasons. I tried watching them but they didn't intrigue me and miserably failed to catch my eye. Should I watch them like is it worthit or should I just leave it? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9k0uu/squid_games/"
    },
    {
        "id": "1o91djd",
        "author": "SufficientPrice7633",
        "title": "3 years ago, Extraordinary Attorney Woo was released",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o91djd/3_years_ago_extraordinary_attorney_woo_was/"
    },
    {
        "id": "1o8jkte",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat Is Back.",
        "content": "I've been  waiting for season 3 of the Diplomat.... It wasn't a long wait and at least there's 8 episodes. Season 2 was a longer wait with 6 episodes... I dnt think 10 episodes is a thing anymore.",
        "upvotes": 134,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o8jkte/the_diplomat_is_back/"
    },
    {
        "id": "1o9qizg",
        "author": "LittleMsJenniSolis",
        "title": "So many Alexandria Ocasio-Cortez references on \"The Big Show Show\"",
        "content": "I have been watching \"The Big Show Show\" all night long. It seems that in every episode for, the first half of the season, Representative Alexandria Ocasio-Cortez's name is referenced/mentioned at least four times per episode. It seems to me that the show is hinting at 2028's presidential election being won by AOC. Such a coincidence the writers wanted to name drop her so much.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9qizg/so_many_alexandria_ocasiocortez_references_on_the/"
    },
    {
        "id": "1o9bcry",
        "author": "bloomdaleaddict",
        "title": "Travelling and can’t watch netflix on TV",
        "content": "I travel a lot and sometimes a few weeks at a time. All these times, I can always access netflix on my hotels or apartment TV. But last night, it says that it wasn’t part of my household network (yea, cuz I am out of town). \n\nI reached out to the customer service and they said I can just update my household and it will give me 2 weeks while my family at home won’t be affected. I did what he instructed and my partner just called me saying that our netflix is not working at home.\n\nI reached out again and the agent said that I can only log in to tvs on the same network at a time and I should only watch through other media like phone or tablets while I am traveling. Then what’s the point of paying for multiple devices when I can’t even watch comfortably when I am traveling?? Aren’t their slogan watch anything from anywhere?\n\nDoes anyone know if there is a way to bypass it?\n\nThank you!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o9bcry/travelling_and_cant_watch_netflix_on_tv/"
    },
    {
        "id": "1o9fbx0",
        "author": "Dunder6002",
        "title": "In Creeped Out, episode \"A Boy Called Red\" did the aunt know Vincent travelled back in time?",
        "content": "**ENDING SPOILERS D:** plz watch it before continuing!!!\n\nI rewatched Creeped Out after a few years, and now just finished watching s1 ep9 \"A Boy called Red\" and in the end, Vincent's aunt gives him a wink and it got me thinking; Did she know Vincent was Red the entire time and that he changed the past? Instead of falling into the well where the ball of light (the portal) was, he teleported back to the future (his timeline) by touching the portal while it was in the garden?\n\n(She told Vincent his dad changed after he saw his childhood friend called Red fall into the well and disappeared forever. She also witnessed it too.)\n\nLike, did she know? Did she know that originally, Red fell into the well, but then decided to change the future by not doing it? Hinting the wink in the ending scene? Or at least she was somehow aware Vincent (Red) changed the future? And also, how did they not notice that Vincent looked exactly like his dads childhood friend? (...they don't know he time travelled and was the same person.) Cuz there's gotta be more than just her believing there was something weird with the house, right?\n\nOr am I just overthinking it over a PG-rated series?\n\nTL;DR I'm wondering if Vincent’s aunt knew he was actually Red and that he changed the past. The wink at the end got me thinking that if she aware of the altered timeline and that Vincent was Red?\n\nIt's all speculations and theories, I wanna hear what you guys think! Gimme your opinions :P",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fbx0/in_creeped_out_episode_a_boy_called_red_did_the/"
    }
]