[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 355,
        "comments": 2295,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n8dqlm",
        "author": "BlackDoom_26",
        "title": "Shows that totally lost you halfway through",
        "content": "Have you ever started a Netflix show that was amazing at the start but then kind of fell apart later on? Curious which ones had you hooked and then left you feeling disappointed.",
        "upvotes": 34,
        "comments": 181,
        "media": null,
        "permalink": "/r/netflix/comments/1n8dqlm/shows_that_totally_lost_you_halfway_through/"
    },
    {
        "id": "1n80kh8",
        "author": "thehealer2",
        "title": "Stand by Me (1986) is such an underrated gem.",
        "content": "This film is truly an underrated gem, beautifully capturing the raw essence of childhood friendships and the bittersweet journey into adulthood.\n\nFor a few hours, I felt like I was right there alongside Gordie, Chris, Teddy, and Vern, wandering through the woods, chasing whispers of a dead body, and facing their fears and dreams. The film’s strength lies in its authenticity; every laugh, heartbreak, and quiet moment feels genuine, drawing you into their world. It serves as a poignant reminder of how fleeting and impactful those youthful adventures can be.\n\nI really miss road movies like this, where a group of friends embarks on a journey to discover something meaningful.\n\nWhat did you think about this movie? I’d love to hear your thoughts and feelings after watching it!\n\nAlso, if you have any recommendations for similar movies, please share them below!",
        "upvotes": 139,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qup1tmd8r2nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n80kh8/stand_by_me_1986_is_such_an_underrated_gem/"
    },
    {
        "id": "1n86r5g",
        "author": "Glum_Reputation_9845",
        "title": "Watching Dirty Money’s Wells Fargo episode",
        "content": "I’ve been watching Dirty Money on Netflix again, and the episode about the Wells Fargo account fraud scandal really stuck with me. The whole thing about millions of fake accounts being created under people’s names without their knowledge was wild enough, but what got me was how little control regular people had over their own personal information once it was in the system. It makes me think about it, are our systems really that vulnerable nowadays that something like this can just happen to anyone? We spend so much time being told to make stronger passwords and enable 2FA, but if a bank or data broker already has your personal info in their system, what stops it from being misused?",
        "upvotes": 39,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n86r5g/watching_dirty_moneys_wells_fargo_episode/"
    },
    {
        "id": "1n8b43i",
        "author": "darth_vader39",
        "title": "MONSTER: The Ed Gein Story | Official Teaser | Netflix",
        "content": "",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n8b43i/monster_the_ed_gein_story_official_teaser_netflix/"
    },
    {
        "id": "1n7ycvl",
        "author": "TeaRemote258",
        "title": "Wednesday S2 Underwhelming?",
        "content": "Just me? I know they had to change things around when they ditched that S1 actor but this season just felt like a jumble of storylines someone started slapping together. Only pieces here and there felt cohesive like someone thought about the plot in advance. And splitting the season up just didn’t help at all. I think Agnes was a good addition, though. ",
        "upvotes": 52,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1n7ycvl/wednesday_s2_underwhelming/"
    },
    {
        "id": "1n8cj5k",
        "author": "HecticJones",
        "title": "we should know about a Murder Club sequel this week, if it's happening [source]",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n8cj5k/we_should_know_about_a_murder_club_sequel_this/"
    },
    {
        "id": "1n8egyz",
        "author": "indiewire",
        "title": "'Wednesday' Season 2 Ending Shows It's Already Out of Ideas",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8egyz/wednesday_season_2_ending_shows_its_already_out/"
    },
    {
        "id": "1n7mmgn",
        "author": "AccurateInflation167",
        "title": "KPop Demon Hunters dethrones Squid Game as Netflix’s most-watched title ever - KED Global",
        "content": "",
        "upvotes": 126,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1n7mmgn/kpop_demon_hunters_dethrones_squid_game_as/"
    },
    {
        "id": "1n884fb",
        "author": "Crazy_Guitar6769",
        "title": "I actually enjoyed Wednesday part 2",
        "content": "Like I heard people saying it wasn't good, and yeah, they definitely overdid the cliches a little, but I actually found it enjoyable.\n\nI liked the explored more of the lore, though I feel like they overdid the Gomez and Morticia secret. Should have given that to...idk, someone else.\n\nBut the rest of it, I did find it enjoyable. Especially when Wednesday and Enid...went to Rotwood.\nAnd I like the new invisible character quite a bit.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n884fb/i_actually_enjoyed_wednesday_part_2/"
    },
    {
        "id": "1n86p40",
        "author": "cl4udia_kincaiid",
        "title": "Adding an extra household to Netflix?",
        "content": "My Mum pays for the Netflix you should be able to get an extra household on, however we can’t figure out how to add me now I live interstate. For the last 2 years I’ve had to just get the temporary code sent but it seems to have run out. When following the steps and logging into her account, there does not seem to be the option to add an extra household. Is this not an option in Australia yet or something? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n86p40/adding_an_extra_household_to_netflix/"
    },
    {
        "id": "1n8eskf",
        "author": "MrBalloonHands4",
        "title": "Netflix in multiple households",
        "content": "My girl and I live in separate houses. Can we share a Netflix account? It would even be okay if one of us could have it on our TV and one on our laptop. \n\nFrom what I’m seeing is you can only have 2 devices in the same IP location but not sure if I am understanding it correctly.\n\nWhat are our options? (Cheapest the best!)\n\nThanks",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n8eskf/netflix_in_multiple_households/"
    },
    {
        "id": "1n7xsee",
        "author": "dailystar_news",
        "title": "Netflix's star Penn Badgley announces birth of twin boys with wife Domino Kirke",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7xsee/netflixs_star_penn_badgley_announces_birth_of/"
    },
    {
        "id": "1n7vybz",
        "author": "self-fix",
        "title": "Netflix urges Tencent to stop airing plagiarized 'Culinary Class Wars' in China",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vybz/netflix_urges_tencent_to_stop_airing_plagiarized/"
    },
    {
        "id": "1n8aoy3",
        "author": "dreadduck25",
        "title": "Games",
        "content": "Does anyone know if you can get netflix games free (on my sons phone for example) if you have a netflix account? &amp; if yes do you need to log out of another appliance to log him in to a game? 🙂",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8aoy3/games/"
    },
    {
        "id": "1n8a68o",
        "author": "UnderstandingFew2905",
        "title": "mini-dramas might actually be better than netflix",
        "content": "started another netflix series last night. 2 episodes in and i was already checking my phone. \n\nlike bro, i don’t have 8 spare hours just to see if the plot gets good. lately i’ve been cheating with those mini-drama things, random channels on youtube, or apps like vertical tv / storytv that give you a full story in \\~90 mins. it’s basically like a movie cut into 5–10 min episodes. weirdly enough, i actually finish those.\n\nso idk… is my attention span fried, or is this just the new way content’s supposed to be?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n8a68o/minidramas_might_actually_be_better_than_netflix/"
    },
    {
        "id": "1n89s3t",
        "author": "Fast_Buffalo_4951",
        "title": "I am convinced they are putting these huge gaps in seasons and episodes to.",
        "content": "Let people forget , so they have to go back and rewatch the start of the season or the previous seasons over again to fully know what’s going on. Current season of Wednesday for example was not memorable at the start. So of course I did not recall much that happened when part 2 was released. \n\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n89s3t/i_am_convinced_they_are_putting_these_huge_gaps/"
    },
    {
        "id": "1n7altt",
        "author": "Educational_Tea2511",
        "title": "WEDNESDAY on netflix",
        "content": "I just finished *Wednesday*, and man, I’m not getting why everyone’s obsessed! Jenna Ortega’s got that deadpan stare on lock, and the show’s got a cool spooky vibe, but the story? Total snooze-fest. It’s like someone threw every teen show into a blender with some fake cobwebs. You’ve got the usual “weird kid with a big destiny” deal, a boring love triangle, and a boarding school that’s basically Hogwarts’ less fun cousin. It’s trying to be peak Tim Burton, but it’s more like Tim Burton’s distant nephew who’s trying too hard. Some parts dragged worse than my Monday mornings, and half the characters are flatter than my phone battery at 1%. I’ve seen X users call it overhyped, whining about the same old plot. Anyone else think it’s a bit of a yawn? What didn’t vibe for you? ",
        "upvotes": 148,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1n7altt/wednesday_on_netflix/"
    },
    {
        "id": "1n82v3m",
        "author": "Maybeatordsimp",
        "title": "Help finding a show that used to be on Netflix?",
        "content": "Tbf idk if this even was on Netflix might’ve been something else. It was a kids cartoon that had birds on a plane doing rescues iirc. There was an ostrich I think and also a bat. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n82v3m/help_finding_a_show_that_used_to_be_on_netflix/"
    },
    {
        "id": "1n84dsb",
        "author": "1amtheknight",
        "title": "Anyone else have their extra profiles deleted?",
        "content": "Opened the Netflix app on my TV today to find my extra profiles gone. Went through all the troubleshooting steps:\n-Restarted TV\n-Cleared the app data and logged back in\n-logged in on a different device saw the extra profiles disappear as it loaded.\n-Logged in on a browser saw there was an error against my account for my TV. The error said the TV app couldn't access the Internet and check my network. No error message for my phone app though. \n-Checked the TV apps internet connection using the in app test which passed and tested the TVs internet connection using a speed test app full speed. \n-Contacted Netflix help and all they did was copy paste the checks from the error which I'd already done. I was then told sorry there was nothing they could do.\n\nSo now I've had to create the profiles again and all the viewing history is gone.\n\nAnyone else successfully restored \"deleted\" profiles? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n84dsb/anyone_else_have_their_extra_profiles_deleted/"
    },
    {
        "id": "1n71pyj",
        "author": "Similar_Diver9558",
        "title": "'Irrelevant meets intolerable': Meghan Markle’s Netflix show tanks - Season 2 misses Top 10 entirely",
        "content": "",
        "upvotes": 511,
        "comments": 160,
        "media": null,
        "permalink": "/r/netflix/comments/1n71pyj/irrelevant_meets_intolerable_meghan_markles/"
    },
    {
        "id": "1n7sgo1",
        "author": "Kairiste",
        "title": "Can I get some Asian dramedy recommendations?",
        "content": "I got hooked on \"Bon Appetit, Your Majesty\" because I was in between cooking competition shows and think I just found my new guilty pleasure.  I wasnt expecting the humor, and the costumes/makeup are lovely.\n\nWould appreciate getting some other recommendations I could add to my watch list... I currently have Tale of the Nine Tailed, and Beyond The Bar saved.  I like fantasy/sci fi, probably wouldnt be intrigued with 100% drama, I really liked the comedic touches.  Thanks!\n\nETA thanks for all the recommendations, everyone, I am saving them!",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n7sgo1/can_i_get_some_asian_dramedy_recommendations/"
    },
    {
        "id": "1n84fle",
        "author": "GolemancerVekk",
        "title": "Spam on Netflix email address",
        "content": "Today I've started receiving spam on an address that is unique and only used for the Netflix account. Anybody else notice anything funny? \n\nhaveibeenpwned says the address doesn't currently appear in any breach.\n\nStill, it's possible that there's either been a breach, or Netflix has shared emails with 3rd parties.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n84fle/spam_on_netflix_email_address/"
    },
    {
        "id": "1n7tk99",
        "author": "Randomname194728",
        "title": "Why can’t I choose the “English (Original)” option that makes Netflix know you don’t have surround sound?",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r8u5mx9441nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n7tk99/why_cant_i_choose_the_english_original_option/"
    },
    {
        "id": "1n7vvk8",
        "author": "Shot-Canary-5912",
        "title": "Wednesday season 2 finale",
        "content": "The finale of season 2 was something, well a few things: exciting, creepy, disastrous yet at the same time kind of expected. This season just didn’t have that “OMG” moment like season 1 did. Idk how to word it properly as I only finished it about an hour ago, but something was off. However, don’t take this review as someone who is against the season and didn’t like it. I was glued (unhealthily) to my screen the whole time. Cannot wait for the next season now either, the way they used the last few moments to set the groundings for season 3 already has me excited. PLEASE DON’T TURN EVIL ENID! Pls lmk what all u guys think!!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vvk8/wednesday_season_2_finale/"
    },
    {
        "id": "1n82ngl",
        "author": "djkhan23",
        "title": "New Fire Stick update is terrible!",
        "content": "Ugly new layout.\n\nMuch harder to scroll. Makes shifting through everything a chore.\n\nI will have to consider using my tablet to initiate a watch and search for titles from now on. It's that bad! \n\nWho's to blame! Netflix or Amazon? Apologies to Netflix if so. \n\nAlso take back that apology until Manhunter Season 3 comes out.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n82ngl/new_fire_stick_update_is_terrible/"
    },
    {
        "id": "1n79cox",
        "author": "Routine-Ad-1546",
        "title": "Katrina: Come Hell and High Water documentary",
        "content": "I know the documentary is new but its #2 of Netflix top 10 and I feel like its not talked about enough. I remember when Hurricane Katrina hit, I was 7 living in Winter Park, Florida and what we went through wasn't nearly half as bad as NOLA. I've cried so much and i'm not even finished with the 2nd ep. This documentary is so extremely devastating, a bunch of piss poor excuses working as government servants. The only one with integrity and honor being General Honoré. Its always better to be safe then sorry, mandatory evacuation of ppl in below sea level neighborhoods should've been 1st and not even second guessed. The corrupt Major Nagin, awful Governor Blanco, incompetent FEMA Director Brown, horrendous President Bush just ugh I want to vomit and I wonder if how tragically they screwed this up lives in their heads to this day.... None of them cared about their constituents or residents in the region. My heart aches.",
        "upvotes": 55,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1n79cox/katrina_come_hell_and_high_water_documentary/"
    },
    {
        "id": "1n7th23",
        "author": "Educational_Tea2511",
        "title": "Just finished watching “MY OXFORD YEAR” And what the helly",
        "content": "Yo, just watched My Oxford Year on Netflix and, girl, I’m shook AF. Thought it’d be cute Oxford romance, but that ending? Heart smashed. Sofia n Corey were legit sparks, all poetry n pub vibes, then it got heavy. The dream trip montage? Smilin then cryin, and boom, Jamie’s gone, Anna’s solo on the beach. Total mess rn. Heard the book’s softer, might read it to feel better. Anna goin prof and doin the cake thing was cute, keeps Jamie’s vibe alive. You seen it? You cryin too or just me? Spill, what hit ya?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n7th23/just_finished_watching_my_oxford_year_and_what/"
    },
    {
        "id": "1n7hgcn",
        "author": "negborhodhypersexual",
        "title": "Cole’s character from My life with the Walter boys is badly written",
        "content": "I am sorry but I had to say it. I know he is supposed to be this bad boy heartthrob stereotype, but all the interactions he has with Jackie or parts that are supposed to further his storyline are shallow and badly delivered. I don’t know if it’s the writers, the actor or everything else, but I just can’t seem to connect with him. \n\nAlso, the actor’s bone structure doesn’t fit with the overall age casting. I know this show has a lot of complaints about the actors not suiting the ages they’re supposed to be, but at the same time he’s the one that sticks out the most for me, especially next to Danny who is supposed to be his twin.\n\nThe show seems like they’re trying to have Damon and Stefan the remake, but it’s not working because those two were ancient vampires. The dark and broody bit on a teenager without going deeper into his struggles or thought process is just cringe.",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1n7hgcn/coles_character_from_my_life_with_the_walter_boys/"
    },
    {
        "id": "1n8953y",
        "author": "Simple_Stranger_7539",
        "title": "Adolescence- Was That Type of Arrest Necessary?",
        "content": "In episode 1, when they arrest Jamie, is all that truly necessary? A bunch of armed guys, breaking down the door? This is a 13 year old they are arresting. Yeah, the 13 year old viciously killed someone but from a physical standpoint, did they need that kind of man power for what appears to be a 45kg max kid? It feels like such excessive force.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n8953y/adolescence_was_that_type_of_arrest_necessary/"
    },
    {
        "id": "1n7qvxc",
        "author": "TwistNo8702",
        "title": "Music Loud, Voices Soft",
        "content": "Is there any way to change settings on Prime so that the music/sound effects are not so damn loud?! If I turn the music/sound effects down, the voices are too soft and can't hear what anyone is saying. \n\nThis seems to be the case on most TVs. Mine is an old Hisense ledn32d50, that I Chromecast to, but it happens on smart TVs, too, and I've tried playing with the settings there, but nothing. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n7qvxc/music_loud_voices_soft/"
    }
]