[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hwvqjn",
        "author": "maschera84",
        "title": "Quanto cambia la tua vita il clima di Torino",
        "content": "Io e la mia famiglia stiamo pensando seriamente di trasferirci a Torino.\n\nNon per lavoro, visto che siamo indipendenti, ma puramente per ragioni di lifestyle. Ci siamo innamorati del suo carattere, eleganza e cortesia della gente.\n\nE abbiamo vissuto in città come Barcellona, Londra, Dubai e Sydney, quindi non siamo nuovi a bellezza urbanistica.\n\nLe stelle sono allineate, eccetto per la parte clima. Siamo stati in città a Novembre quando c'erano 3-4 gradi ed anche un giorno di nebbia. Non ci è sembrato un gran dramma, nonostante oggi viviamo in una città dove ci sono 20 gradi a Gennaio. Anzi, con il surriscaldamento del pianeta, chissà che vivere in un posto con inverni più rigidi non sia una buona cosa.\n\nQuello che però mi domando, quanto questo fantomatico brutto clima (e inquinamento) di Torino di cui tutti si lamentano, è veramente così impattante sulla vostra vita, umore e deprimente come alcuni descrivono?\n\nOppure si tende ad esagerare con le lamentele?\n\nOnestamente, non mi sembra di aver visto \"facce depresse\" per strada come invece (generalizzando e stereotipizzando) in UK o Norvegia. Anzi, la gente sembra leggera e soddisfatta.\n\nCome vivete la cosa?",
        "upvotes": 13,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1hwvqjn/quanto_cambia_la_tua_vita_il_clima_di_torino/"
    },
    {
        "id": "1hx8yg1",
        "author": "Vik91N",
        "title": "Oculista a Torino",
        "content": "Ispirato da una vignetta vista da qualche parte (\"Da quando frequento reddit non riesco a comprare una bottiglia d'acqua senza prima chiedere pareri nel fottuto subreddit delle bottiglie d'acqua\"), chiedo consiglio per un oculista in città.\n\nM33+F29, non ricchissimi, entrambi occhialuti, tanto per chiarire target e budget. Chiaramente non mi aspetto di trovare niente sotto le tre cifre ma mi piacerebbe stare più al di qua possibile. \n\nAspetto i vostri consigli, grazie in anticipo!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hx8yg1/oculista_a_torino/"
    },
    {
        "id": "1hx8be2",
        "author": "fuckbrexit84",
        "title": "Sauze sunset ",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bFcervlQxIh8kolf5mSmMnKrW-vi-lB5hHBjTQJOU6M.jpg?auto=webp&amp;s=fe2faca98d8fc038780ace0c84257e147c77890a"
        },
        "permalink": "/r/torino/comments/1hx8be2/sauze_sunset/"
    },
    {
        "id": "1hx0yz5",
        "author": "bompiwrld",
        "title": "Qualcuno conosce meglio la storia?",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sz54p4j2fvbe1.jpeg?auto=webp&amp;s=41707d1b901de383c2285a8076e975d172755ccf"
        },
        "permalink": "/r/torino/comments/1hx0yz5/qualcuno_conosce_meglio_la_storia/"
    },
    {
        "id": "1hwsytt",
        "author": "Ambitious_Home8801",
        "title": "Corsica Principe Oddone",
        "content": "Hello!\n\nI’m staying in Torino for 6 months and have to book a place to stay ahead of arrival. I’ve found a guy that seems trustworthy (a lot of listings seem to be made by scammers) with a place along Corsica Principe Oddone.\n\nIs that a really noisy location for a ground floor apartment?\n\nGrazie Mille!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hwsytt/corsica_principe_oddone/"
    },
    {
        "id": "1hwziwq",
        "author": "Forsaken_Wasabi4632",
        "title": "Raccomandazioni meccanico di bici economico? ",
        "content": "Buonaseraa, qualcuno conosce un negozio di riparazione biciclette economico qui a Torino? Ho comprato questa bici da una mia amica, che mi ha consigliato di farla controllare prima di usarla. Cerco uno economico perché forse c’e più di una cosa danneggiata e il mio budget è limitato ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hwziwq/raccomandazioni_meccanico_di_bici_economico/"
    },
    {
        "id": "1hwqpgz",
        "author": "borisbanana77",
        "title": "Come asciughi il bucato?",
        "content": "Può volerci fino a una settimana per asciugare il bucato all'aperto. \nCome si asciuga il bucato senza asciugatrice a casa?  Stavo pensando di lavare i miei chiusi a casa e di andare in lavanderia self-service solo per asciugarli.",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1hwqpgz/come_asciughi_il_bucato/"
    },
    {
        "id": "1hwndjw",
        "author": "fuckbrexit84",
        "title": "Sauze d’ oulx",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YuGV4jILLO25vsDqL9wy_dw8AfPEg_4hrHKAkseBVPE.jpg?auto=webp&amp;s=c563265470582722407dd6f6fc136d95aea44e64"
        },
        "permalink": "/r/torino/comments/1hwndjw/sauze_d_oulx/"
    },
    {
        "id": "1hwmaan",
        "author": "Thecrazypacifist",
        "title": "Come trovo una casa per tre persone? ",
        "content": "Allora Io e due di miei amici stiamo cercando un appartamento. Siamo tutti studenti e cerchiamo una casa con 3 letti singoli. Il problema è che sui siti italiani non puoi scegliere il numero di camere da letto, ma solo il numero di locali! Quando scelgo \"trilocali\" mi mostra case con una cucina, un soggiorno e una camera da letto. Provo quadrilocali ma ci sono non più di due letti. E se vorrei scegliere 5 locali, non ci sono case! Allora cosa devo fare? Anche su Facebook e Telegram vedo solo stanze e posti di letto. ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hwmaan/come_trovo_una_casa_per_tre_persone/"
    },
    {
        "id": "1hwbiar",
        "author": "trebram1981",
        "title": "Locali notturni",
        "content": "\n\nCiiao a tutti! Qualcuno sa se a Torino ci sono club per single o per scambisti? Grazie in anticipo!\n\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hwbiar/locali_notturni/"
    },
    {
        "id": "1hvxtcn",
        "author": "Fun-Tap8774",
        "title": "Grupo per fare amicizia",
        "content": "ciao ragazzi, sono un ragazzo di 29 anni e lavoro come programatore, quindi non conosco tantissima gente, c'è qualche gruppo su telegram o su whatsapp per fare qualche serata oppure qualche aperitivo? ",
        "upvotes": 14,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1hvxtcn/grupo_per_fare_amicizia/"
    },
    {
        "id": "1hvxxjv",
        "author": "Informal-Flower-527",
        "title": "Multa ",
        "content": "Buona sera a tutti vi scrivo perché mi è appena arrivata una multa per mancata esibizione del bigliettino per parcheggio in strisce blu, sono certa al 100% di averlo pagato prendendo il bigliettino presso le macchinette. Essendo che ho pagato in contanti non ho modo di dimostrare che l’ho pagato. Come ci si comporta in sti casi?",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1hvxxjv/multa/"
    },
    {
        "id": "1hvs2vc",
        "author": "One_Owl_8715",
        "title": "Teatri",
        "content": "Ciao a tutti! \n\nDi recente io e il mio ragazzo ci stiamo addentrando nel mondo del teatro, fino ad ora abbiamo visto pochi spettacoli esclusivamente di danza classica (schiaccianoci, lago dei cigni etc).\n\nMa vorremmo maturare ed entrare in questo mondo ancora di più, vedere più spettacoli, frequentare i posti giusti e prendere le informazioni da fonti affidabili.\n\nQuindi la mia domanda è: quali sono gli spettacoli e i posti che consigliate?\n\nOvviamente essendo completamente ignoranti in materia siamo aperti ad ogni stile❤️",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1hvs2vc/teatri/"
    },
    {
        "id": "1hvuhup",
        "author": "LadyXulia",
        "title": "Trasferimento a Torino: corso tech e mercato del lavoro",
        "content": "Ciao ragazzi,\n\nSono cittadina italiana ma abito e lavoro in Brasile fa molti anni, affinché miei diplomi sono tutto brasiliani. Sono laureata in matematica e fisica e ho una laurea magistrale in scienza materiali, ma lavoro come software developer in un'azienda di FinTech da più di due anni.   \nAdesso, mi trasferirò in Italia a giugno e sto cercando un corso in presenza a Torino nell'area tecnologica, tra 6 mesi a 1 anno, al quale posso iscrivermi senza dover convalidare il diploma (ma prenderò la mia trascrizione scolastica tradotta). Sono interessata perché credo che avere l'obiettivo di studiare in Italia mi aiuterebbe a mantenere il mio lavoro in Brasile da remoto.\n\nUn'altra domanda: quanto sia difficile per gli \"stranieri\" entrare nel mercato tecnologico in Italia/Torino? Fare un corso italiano in tecnologia, anche se dura solo 6 mesi, ti aiuta ad entrare nel mercato? Come ho già detto ho esperienza nel settore, ma solo in Brasile.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hvuhup/trasferimento_a_torino_corso_tech_e_mercato_del/"
    },
    {
        "id": "1hvskwe",
        "author": "Kkkkkeeeemoooo",
        "title": "Can you travel with the receipt for the first time for the residence permit",
        "content": "Is it it possible to travel with the receipt for the residence permit in Italy for the first time with an expired family reunification visa, and the travel will be after the fingerprint registration towards the home country?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hvskwe/can_you_travel_with_the_receipt_for_the_first/"
    },
    {
        "id": "1hvrk5w",
        "author": "Aneruysmm",
        "title": "Accomodation in Torino",
        "content": "Hi, we are 4 boys that will move to Torino for a period of time for University (Erasmus) and we need some recommendations of any available apartments or shared housing for us. We are hoping to find a place that is close to Unito and not to pricey:) What yall think about our budget being 250-350 per person, that being said 1400 i guess. Please lmk some advices regarding that and where i should search for more.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hvrk5w/accomodation_in_torino/"
    },
    {
        "id": "1hvcxmh",
        "author": "Alocin04",
        "title": "Corsi di cucina per amatoriali",
        "content": "Buongiorno a tutti,  \nSono un ragazzo di 20 anni, negato in cucina, il quale vorrebbe presenziare a dei corsi che coprano le basi, non professionalizzanti poiché non posso lasciare il mio lavoro attuale.   \nCercando su internet ho trovato varie scuole ([Cuciniamole](https://cuciniamole.it/), [La palestra del cibo](https://lapalestradelcibo.com/), [FoodLab](https://www.accademiafoodlab.it/), ecc...) che offrono singoli corsi dai 40€ ([Cuciniamole](https://cuciniamole.it/)) fino ai 100€ ([FoodLab](https://www.accademiafoodlab.it/)) oppure dei percorsi (massimo 4 giornate) su un solo argomento dai 280€ in su.   \nLa mia domanda è: esistono delle scuole/associazioni che offrono dei percorsi composti da più giornate, spalmate in più mesi, ed eterogenei negli argomenti? Se esistessero, quanto verrebbero?",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SUu8uo2TxAdvrn5ACcFBPzErEgusWMLFuKWN2YeQLSo.jpg?auto=webp&amp;s=18fb51b96826ccdf157cb22789ba8fef32d925d4"
        },
        "permalink": "/r/torino/comments/1hvcxmh/corsi_di_cucina_per_amatoriali/"
    },
    {
        "id": "1hv9g7q",
        "author": "NomeUtente86",
        "title": "Cerco smartworking per un secondo lavoro.",
        "content": "Come da titolo cerco uno smart Working da inquadrarsi come secondo lavoro...\nNon dovrebbe avere di orari fissi in quanto secondo lavoro, quello che trovo girando su internet sono tutte fregature.. sapete come è dove poter cercare grazie mille!!!\n\nP.s. accetto eventuali proposte.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hv9g7q/cerco_smartworking_per_un_secondo_lavoro/"
    },
    {
        "id": "1huy8e4",
        "author": "pietrino97",
        "title": "Spostarsi di notte a Torino nei feriali?",
        "content": "Ciao a tutti! A breve mi trasferirò a Torino da Milano, per lavoro. Qui a Milano non ho la macchina e mi sono sempre spostato, sia in città che fuori, utilizzando mezzi pubblici o, in casi del tutto eccezionali, in taxi.\n\nAnche Torino non è messa male coi mezzi pubblici, per lavoro però mi è richiesta la macchina quindi dovrò portarla per forza, ma quando non necessaria preferirei spostarmi con i mezzi.\n\nAbiterò probabilmente vicino ad una fermata della metro (piazza Bengasi), che però ahimé non è molto servita da bus o linee tram, solo di giorno con la metro. Di notte, come ci si può spostare durante i giorni feriali dopo la chiusura della metro? Senza utilizzare i taxi, dico. So che il venerdì, sabato e prefestivi è attiva la linea nottura (una delle GTT Night Buster... che nome!!) S18 Blu, ma in tutti gli altri giorni? Ahah possibile che una quasi-metropoli che sfiora il milione di abitanti non abbia un servizio di trasporto pubblico notturno? Ok il controllo della città da parte di Fiat negli anni scorsi, ma cavolo si parla di trasporto pubblico per un motivo, dovrebbe esserci un servizio H24 anche nei giorni feriali per qualsivoglia evenienza.\n\nPer esempio, farò quasi ogni fine settimana avanti e indietro da Milano. Se la domenica sera rientro dopo cena a Pt Nuova alle 00:00/00:30, come cacchio rientro a casa (il taxi vorrei non valesse come risposta!!). Solo in bici?\n\nE domanda a parte: ci sono in programma modifiche della mobilità notturna in città?\n\n",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1huy8e4/spostarsi_di_notte_a_torino_nei_feriali/"
    },
    {
        "id": "1hv0ic9",
        "author": "Rafksl",
        "title": "Places to buy piercing jewelry?",
        "content": "I was curious to buy a new piece for my labret while i'm here, do normal piercing/tattoo shops sell them or do i have to visit someplace specific?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hv0ic9/places_to_buy_piercing_jewelry/"
    },
    {
        "id": "1hv280g",
        "author": "WizardryDJ",
        "title": "Torino FC vs Juventus ",
        "content": "Heading to Turin this weekend and just noticed it's the derby at Torino. Is this derby worth attending? Surprised to see that tickets are easy to buy which makes me think it might not be such a good atmosphere as some other derby's?\n\nThanks in advance for any advice!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hv280g/torino_fc_vs_juventus/"
    },
    {
        "id": "1hv4gle",
        "author": "Scypher_Tzu",
        "title": "Applying to politecnico di torino can anyone guide. ",
        "content": "1.) For computer engineering its written as taught in english, is it really true?  \n2.)  Expected cost?  \n3.) How to apply? (website is very confusing) \n\nintl with 790 sat math here!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hv4gle/applying_to_politecnico_di_torino_can_anyone_guide/"
    },
    {
        "id": "1huwjbx",
        "author": "MaitreRostam",
        "title": "La Stazione Stura è accessibile tramite abbonamento GTT metropolitana ?\n",
        "content": "Buongiorno a tutti, sono un lavoratore francese a Torino per un'anno a minima.\n\nLavvoro nella zona Pescarito, cè un bus alla stazione stura per ragiugibile la mia empresa, ma La Stazione Stura è accessibile tramite abbonamento GTT metropolitana ?\n\n  \nEdit : Con treno ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1huwjbx/la_stazione_stura_è_accessibile_tramite/"
    },
    {
        "id": "1hucmid",
        "author": "Koarzum",
        "title": "App GTT TO Move non funziona da un mese",
        "content": "Il titolo dice più o meno tutto, fino agli ultimi novembre funzionava, da inizio dicembre crasha ogni volta che la apro, non posso fare biglietti e non essendo di Torino non è sensato per me fare un abbonamento che userei poche volte o fare biglietti cartacei tutti in una volta che finirei per perdere dopo pochi giorni, per chi si trova nella mia situazione, come state facendo?",
        "upvotes": 7,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1hucmid/app_gtt_to_move_non_funziona_da_un_mese/"
    },
    {
        "id": "1hueu83",
        "author": "Flat-Message6872",
        "title": "Tennis ruffini",
        "content": "Chi sarebbe disponibile a giocare a tennis con me?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hueu83/tennis_ruffini/"
    },
    {
        "id": "1hu9tze",
        "author": "-Spinal-",
        "title": "Scuola Sci per bambini (2anni)",
        "content": "Stavamo pensando di andare a bardonecchia a sciare come tutti gli anni; ma non riesco a trovare una scuola sci che prende i bambini sotto ai 3 anni.\n\nSiamo costretti ad andare in Francia o Svizzera dove è comune comunicare a 2 anni con lezioni?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hu9tze/scuola_sci_per_bambini_2anni/"
    },
    {
        "id": "1hu2wcb",
        "author": "Monika-dam",
        "title": "Elettronica edm hc Torino",
        "content": "Ciao sono super appassionata di elettronica e hc vorrei cominciare ad andare in ambienti nuovi, avete consigli per Torino e Piemonte? Anche rave mi piacerebbe andare ma non ho compagnia che conosce , canali telegram ci sono? 🤟",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hu2wcb/elettronica_edm_hc_torino/"
    },
    {
        "id": "1hu81ub",
        "author": "HououinKyoma_",
        "title": "Nutrizionista ",
        "content": "Ciao a tutti,\nSono un ex giocatore di basket. Ho smesso ed ho preso peso. Qualcuno sa consigliarmi un buon nutrizionista ed i relativi prezzi? \n\nRingrazio in anticipo ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hu81ub/nutrizionista/"
    },
    {
        "id": "1hu5p51",
        "author": "_pigreco_",
        "title": "trecate piscina",
        "content": "ciao a tutti, io e una mia amica volevamo fare un po’ di nuoto libero. siccome siamo entrambi universitari volevano approfittare dello sconto offerto dal CUS, purtroppo non riesco a capire se la trecate sia aperta dato che da alcuni articoli pare di sì da altri di no. la rari nantes sarebbe un opzione anche se più lontana ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hu5p51/trecate_piscina/"
    },
    {
        "id": "1htz0yb",
        "author": "Narrow_Captain_2194",
        "title": "Un posto buono per scrivere e studiare",
        "content": "Ciao ragazzi! Sto in Torino per la prima volta e cerco un posto buono per scrivere e studiare in Torino. Aperto sulla Domenica. Puoi ricommendarmi un bar elegante/biblioteca/facoltà di Università o qualcosa? Grazie mille!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1htz0yb/un_posto_buono_per_scrivere_e_studiare/"
    },
    {
        "id": "1huatec",
        "author": "MonPorridge",
        "title": "Dentista / invisiline torino città?",
        "content": "Ciao a tutt\\*, come da titolo: qualcuno consiglia un\\* dentista a Torino? Mi piacerebbe anche fosse pratic\\* con l'invisiline. Conoscete anche dentist\\* che non chiedono un occhio della testa?\n\nGrazie mille in anticipo!\n\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1huatec/dentista_invisiline_torino_città/"
    }
]