[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 9,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 54,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l7wj8y",
        "author": "rainj97",
        "title": "Furious Netflix users are ‘reporting’ platform over ‘horrible’ new update",
        "content": "",
        "upvotes": 496,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1l7wj8y/furious_netflix_users_are_reporting_platform_over/"
    },
    {
        "id": "1l8aw7o",
        "author": "PlasticViolinist4041",
        "title": "I want the old UI interface back!",
        "content": "It's awful . can't find anything and you see 4 times less info than before\n\nAnd the \"game\" thing is totally irrelevant to me. I have a Playstation for that\n\nBring the old UI back!\n\nOr at least offer the choice to users to select one or the other",
        "upvotes": 29,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l8aw7o/i_want_the_old_ui_interface_back/"
    },
    {
        "id": "1l8gk41",
        "author": "timcaviness",
        "title": "Another Post about the new Horrible UI change ... with suggestions",
        "content": "What follows is an email I attempted to send Netflix ... I logged in and chatted with them and the employee gave me a bad \"support\" email ... so I'm posting here for all to enjoy.\n\n\\-----------------------\n\nHi, I'm not just a long-time customer (under my wife's email), I'm a computer programmer and UI specialist who's been programming on the web since 1995. The new UI changes you've made have some major problems.\n\n1. I have lots of items in the \"My List\" queue ... more than 50+. When I want to find something to watch now, I have no choice but to cycle through them ONE AT A TIME. In the past, the My List screen would show items 5-6 on a line, and I could hit the down arrow to quickly find what I wanted.\n   1. Now? There's no way I have the patience to find the end of the list by scrolling one-by-one to the right.\n   2. And once I do get there and decide what I'm in the mood for is at the beginning? I have to scroll one-by-one back through all the titles to the left? Sorry, but are you kidding me? Horrible design. You've made my user experience 10x worse.\n   3. The purpose of a new UI is to make the user's experience better/quicker with the ability to get the same (or new) job done with less clicks ... not a hundred more. You've backslid.\n2. I see what you were going with by splitting the My List screen into different rows, but I don't care about what I've already watched and what I've given thumbs up to. I've already seen those. I'm not 10 years old. I don't want to re-watch the same show/movie over and over. I want something new!!! **That's the entire reason for the My List queue.**\n   1. I usually choose what I want to watch by how much time I have and what mood I'm in ... so ... please make rows for the following:\n      1. \"My List TV Shows\"\n      2. \"My List Limited Series\"\n      3. \"My List Movies\"\n      4. \"My List Documentaries\"\n      5. etc.\n3. Also, when I'm scrolling down through shows, sometimes I just want to shut the tv up without reaching for a different remote. In the past, I'd skip down a row and slide to the left (to open the left menu) ... and that would \"pause\" all the constant trailers you bombard users with. Now ... I have no way to make the TV quiet with the remote I have in my hand ... and have to reach for another remote and find the button for Mute. Again, you've made my UI experience worse instead of better.\n\nThank you and please consider changes to the new UI. It's different and pretty and you have bigger boxes now for previews ... but it doesn't make me the User happier or help me get to my goal easier or quicker.  \n  \nInstead, it makes me impatient and not want to use the system. We're already subscribing, why would you want to make our experience worse?  \n  \nThank you for your time,  \nTim",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l8gk41/another_post_about_the_new_horrible_ui_change/"
    },
    {
        "id": "1l8hox9",
        "author": "Ace-0987",
        "title": "Netflix glitching?",
        "content": "Anyone else having issues where Netflix keeps glitching? Never had this before - its not a buffering or connection issue - the screen just keeps glitching. \n\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l8hox9/netflix_glitching/"
    },
    {
        "id": "1l87xp5",
        "author": "katiebxby",
        "title": "Series/Movie suggestions?",
        "content": "Hi all, looking for some new things to watch, it can take me a while to get into something so sometimes I struggle finding something. I love horror, but I don't watch it that much anymore so some horror suggestions would be nice, but more so on the serial killer type of vibe rather than supernatural. I also have started to enjoy romance, especially when it is kind of forbidden or unique, like the film 'The Tearsmith' I thought that was amazing. Maybe drop some of your favourite movies and series and let me know why you liked it!  I'll list some stuff that I have watched and enjoyed. \n\n\\- Vampire Diaries\n\n\\- Stranger Things \n\n\\- Heartstopper\n\n\\- Lost \n\n\\- I enjoy Harlan Coben's limited series\n\n\\- All of us are dead\n\n\\- Alice in borderland\n\n\\- Young royals\n\n\\- You\n\n\\- The summer I turnt pretty\n\n\\- Big fan of the Texas Chainsaw massacre franchise\n\nThanks in advance! :) ",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l87xp5/seriesmovie_suggestions/"
    },
    {
        "id": "1l87pbf",
        "author": "LectureJaded1233",
        "title": "The Survivors 2025…Yay? Or Nay?",
        "content": "Please tell me if I should continue watching the show. I am slowly getting through the first episode and I’m really not sure what to think! Does the show actually get better?!",
        "upvotes": 7,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1l87pbf/the_survivors_2025yay_or_nay/"
    },
    {
        "id": "1l8jqsx",
        "author": "Less_Razzmatazz6308",
        "title": "¿Qué están viendo últimamente en Netflix?",
        "content": "Tengo libre este fin de semana y quiero maratonear algo bueno. Me gustan series con suspenso o historias bien escritas (tipo Mindhunter o Dark).\n\n¿Qué recomiendan ustedes?  \n*(Y si a alguien le interesa un grupo donde siempre andamos compartiendo recomendaciones, puede escribirme por privado.)*",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l8jqsx/qué_están_viendo_últimamente_en_netflix/"
    },
    {
        "id": "1l8jczw",
        "author": "Aggravating_Park3174",
        "title": "Full screen bug on windows 11",
        "content": "Anyone else have the screen bug when the « camera angle change » on full screen? For info: when we see the time bar with option (play, advance etc…) it doesn’t do it. Anyone have a solution ? Thank’s in advance! ",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z9uudxku386f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l8jczw/full_screen_bug_on_windows_11/"
    },
    {
        "id": "1l8ix2p",
        "author": "pearlyberry",
        "title": "should i watch ginny and georgia?",
        "content": "i’ve seen so many marcus and ginny edits on tiktok lately that have me wanting to watch ginny and georgia, but i’m wondering if it’s worth it? i know the earlier seasons are not that good/hard watches, but i’ve heard the newest season is pretty good. mostly just wanna watch for marcus and ginny’s relationship and georgia and joe’s. thoughts??",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ix2p/should_i_watch_ginny_and_georgia/"
    },
    {
        "id": "1l8ivcw",
        "author": "Low-Ad-1542",
        "title": "Dept Q: want to read the books now!",
        "content": "Hi all,  \nQuestion to folks who have read the books as well as watched the show. I just wrapped up season1 of Dept Q and absolutely loved it. Now, I want to read the books . But question is : Can I directly jump to the second book in the series ? Since I already know the characters and the relationship between them ? I do understand that the setting has been changed ( Denmark vs Scotland), but other than that, any issues if I directly start with book 2 ? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ivcw/dept_q_want_to_read_the_books_now/"
    },
    {
        "id": "1l8ihi9",
        "author": "damanwithaplan_",
        "title": "2x playback option",
        "content": "I wish netflix had 2x playback option when you hard press on phone like youtube has it. It is just so continent. I am mostly finding myself pressing on my screen during boring scenes hoping it would 2x. also 10sec skip option is a bit too much as much can be missed and I find myself constantly skipping 10sec and then realising I missed something and then going back 10sec again. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ihi9/2x_playback_option/"
    },
    {
        "id": "1l889yb",
        "author": "MamaMia1325",
        "title": "Fell into America's Sweethearts-Dallas Cowboy Cheerleaders...",
        "content": "And I can't stop watching it lol. I guess I'm lucky because the new season starts in about a week.(I'm a straight, married woman in her late 40's and grew up with these ladies on the ultimate pedestal so I  completely disagree with all the \"misogyny\" blah, blah, blah comments.) If cheerleading isn't for you then fine. But it's still a thing and these women are crazy talented. Anyone else watching? All the posts I see are from almost a year ago.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l889yb/fell_into_americas_sweetheartsdallas_cowboy/"
    },
    {
        "id": "1l8gfh4",
        "author": "Mysterious_Peace9060",
        "title": "Help Finding This African Movie Please!",
        "content": "I saw this on Netflix around 2016–2017 and I cannot remember the title. It was kind of like Queen &amp; Slim but African.\n\t•\tAn African man meets a beautiful woman in a bar (with African music playing)\n\t•\tThey wore leather jackets and had a rebellious vibe\n\t•\tThere was a bar fight, possibly with the bar owner\n\t•\tAt one point they drew something in the sand (maybe a heart or something funny)\n\t•\tIt had visuals of military or protests\n\t•\tI think the guy went to her house after an argument\n\t•\tIt ends tragically — the guy gets shot on a rooftop at night or smth like that \n\t•\tThe whole thing had a dramatic, gritty, emotional tone — almost like an indie political romance\n\nI know I saw it on Netflix, but I don’t have access to that account anymore.\nIf anyone remembers this movie or has any clue what I’m talking about — please let me know!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8gfh4/help_finding_this_african_movie_please/"
    },
    {
        "id": "1l8ga7y",
        "author": "Miserable_Quail_8236",
        "title": "New Season for The Sandman",
        "content": "My Netflix App on Apple TV has still not updated to the newer version yet but the VIZIO TV on board App has and it shows that a new season of The Sandman is coming soon. Anyone have details on when?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ga7y/new_season_for_the_sandman/"
    },
    {
        "id": "1l87x1i",
        "author": "Every-Personality-95",
        "title": "Audio delay issue",
        "content": "Facing an audio delay problem in one of the kdramas i m watching on ios app. \nIt gets corrected if i change it to korean captions (idk korean but seems like it is correct based on the video) and the problem again starts the moment i convert it back to English cc. \nWhat can i do to solve it ? \n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l87x1i/audio_delay_issue/"
    },
    {
        "id": "1l795gv",
        "author": "niktrop0000",
        "title": "Department Q is great",
        "content": "\n\nThis show was great. Great cast and production. In the end they hint clearly at season 2. It being on Netflix I can’t wait to have it cancelled or to watch season 2 in about 4 years time. \n\nEDIT: yes Akram is the best",
        "upvotes": 391,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1l795gv/department_q_is_great/"
    },
    {
        "id": "1l8ibni",
        "author": "ahhhdaddyhard",
        "title": "I'm trying to find a show and I cannot its driving me crazy",
        "content": "So I remember a non-animated show show where there was 2 main characters one was some guy i think he was a scientist and the other was a girl like his assistant and the show was about a bunch of gross stuff like farts,germs,boogers, and fungi and also one about spiders and webs and stuff  and also there was a sock puppet and I think it was either a talking pile of garbage or laundry and I also Rember these 2 clean freak characters that were the uncles of the girl I've been trying to find it for ages and cannot Rember the name or any of the characters names.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ibni/im_trying_to_find_a_show_and_i_cannot_its_driving/"
    },
    {
        "id": "1l823ok",
        "author": "SplitInfinitive8139",
        "title": "Change UI?",
        "content": "Hi all, I’m new to Netflix (finally got it a few months ago), so apologies if this isn’t a thing they allow…\n\nWhat I see in the app (google tv dongle) changed recent, and the new UI is remarkably unusable.  Is there any way to revert the interface to the previous version?  Or is there an alternate view that is better at showing list views or denser information?  \n\nI’ve looked though account prefs and didn’t see anything 😣 but I’m hoping I missed something…",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l823ok/change_ui/"
    },
    {
        "id": "1l7atee",
        "author": "Educational_Base_301",
        "title": "Any Good Netflix Shows That Premiered in 2025 So Far?",
        "content": "Hey all,  \nJust wondering if there have been any new Netflix original shows that started in 2025 and are actually worth watching. I'm always trying to catch something fresh before it gets too popular or disappears from the homepage.\n\nLooking for anything that’s well-written, mysterious, or addictive. I’m open to other genres too if the story and acting are solid. Just don’t want anything slow or boring.\n\nIf you’ve seen something this year that’s underrated or really good, I’d love your suggestions.\n\nThanks in advance.",
        "upvotes": 221,
        "comments": 269,
        "media": null,
        "permalink": "/r/netflix/comments/1l7atee/any_good_netflix_shows_that_premiered_in_2025_so/"
    },
    {
        "id": "1l8ivt1",
        "author": "9jarvis",
        "title": "Dept Q - Guy in the mask",
        "content": "Okay, Reddit, I need to get this out there and see if anyone else noticed. \n\nBelieve me or not, the guy in the mask at the very beginning of the first episode, the one who shoots three people? I am convinced it's none other than our beloved \"Akram\".\n\nSeriously, just look at his eyes. Same eyes. can't unsee it now.\n\nHas anyone else picked up on this? Or am completely off base here?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ivt1/dept_q_guy_in_the_mask/"
    },
    {
        "id": "1l8anxy",
        "author": "QUALCUNOofficial",
        "title": "Can’t see standard with ads in albania",
        "content": "I can’t use netflix in albania, i created the account for it in italy. The first image is netflix on a philips smart tv the second is s screenshot from my iPhone. It says “this plan can’t be used on this geographical area. Try watching contents from a location where this plan is available. You can change your plan online on netflix[dot]com”",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l8anxy/cant_see_standard_with_ads_in_albania/"
    },
    {
        "id": "1l8i5i4",
        "author": "CopeH1984",
        "title": "Dept Q question",
        "content": "Really enjoying the show so far. Just had one question. What's with everyone treating the Syrian guy like a pariah? Is that just some sort of British/Scottish cultural thing that is just supposed to be understood naturally?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8i5i4/dept_q_question/"
    },
    {
        "id": "1l8icwc",
        "author": "OkOutlandishness7677",
        "title": "Fubar Season 2-Freaky Friday 2= GARBAGE",
        "content": "Both will be released soon and both look like garbage. That said Fubar should have been a 90 minute movie , not sure where they are going with this is the daughter going to be the SPY going forward?\n\n2nd why is  Schwarzenegger , Tom Arnold and Jaime Lee Curtis subjecting themselves to this trash churning out garbage yet  NOT making True Lies 2. Why cant Netflix pick up True Lies 2 from from 20th Century Fox?! Weve been waiting 31 years!  James Cameron STOP making Avatar 8. We dont need 13 Avatar movies!! Why REFUSE to release  a theatrical?! Its  infuriating",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8icwc/fubar_season_2freaky_friday_2_garbage/"
    },
    {
        "id": "1l87tw8",
        "author": "Vyltyx",
        "title": "Using extensions on tablet",
        "content": "If anybody has ever done this before, or something like this, I'd appreciate the advice. \n\nI've just purchased an Amazon Fire tablet, basically with the express purpose of watching Netflix on-the-go. The only reason I have a Netflix account is so I can use a specific extension in conjunction with Netflix (Lingopie). This extension works just fine when watching on my desktop.\n\nJust so you can understand the limitations I'm trying to work around, I'll list them out here.\n\n1. I have to use a tablet (or other mobile form-factor) so I can use it while travelling\n2. I cannot use the Netflix app, it doesn't allow extensions at all\n3. I cannot use Chrome, it doesn't allow extensions while on mobile/tablet\n4. I cannot use Firefox, my extension isn't available as an add-on\n5. I'm using Lemur browser. I haven't tried other browsers such as Kiwi, Brave, etc but I'm like 90% sure the issue isn't the browser.\n\nWhile using Lemur browser, I've gotten to the point where I've logged in to the desktop site, and I have the extension downloaded and seemingly working just fine alongside the site. I can browse my shows and I can see the extension the same way it works on my desktop. \n\nHowever, once I press play on a show, I get an error:\n\n    This title is not available to watch instantly. Please try another title.\n    \n    Error Code E100\n\nI've tried everything on the Help Page, but nothing has worked. I'm open to whatever can allow me to use my Netflix extension while travelling, even if it means going back to the drawing board.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l87tw8/using_extensions_on_tablet/"
    },
    {
        "id": "1l7zi7d",
        "author": "jamboween",
        "title": "Dialogue but no music",
        "content": "Hope this is the right place! I'm only getting the dialogue and foley/background noise but no music when watching Netflix. On the parts of the episode where music is supposed to play, I only get silence. I've tried to reset but no avail. Not sure what to do? Thanks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7zi7d/dialogue_but_no_music/"
    },
    {
        "id": "1l850tw",
        "author": "ex0ll",
        "title": "Netflix from Chrome browser is the only thing that makes my monitors flicker and my PC freeze.",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z7a3wr3wy46f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l850tw/netflix_from_chrome_browser_is_the_only_thing/"
    },
    {
        "id": "1l8509g",
        "author": "GrayMalchin",
        "title": "Greyed out UK series",
        "content": "As I muse upon my viewing habits whilst performing my daily constitutional, within the hulk of a service that playfully calls itself Streamberry, a grey cloud haunts my brain, such as the grey cloud that haunts almost every UK series I’ve watched in the few months, The Terror and Dept. Q. This may not be a new phenomenon, but today felt more overcast than a thick London fog. \n\nAt first, I considered that I was the problem, knowing full well that my mental and physical health dwindle at an ever increasing pace, due to age, economics and the travesty we call politics. My therapist confirmed that my self diagnosed early onset dementia was not producing visual impairment and my optometrist reviewed the test results and ruled out glaucoma or macular degeneration. I consulted with Seth Rogan who’s depth of the industries inner workings is beyond measure, reassured me that it’s not a common issue, and is likely due to a poor understanding of post production processes. Lastly, the geopolitical storm I’m told does not affect or is an effect on image quality, the oligarchs and despots are too occupied with 4-D chess than to meddle in a $100B industry; it’s a battle that no one wins. \n\nSo, I’ve concluded, after much debating with the factions in my brain, and just before I blot my nethers dry post a thorough washlet blasting, that I refuse to watch another visually depressed, smoke filled, grainy darkness while clearly filmed in broad daylight travesty. No matter the depth and nuanced interpretation of a Pulitzer novel or a gripping horror where tension is built with the lack of knowing what’s around the corner or behind the billowing curtain, I cannot, no, will not be bothered with the crap eye strain that comes from this channel that tags itself as Moody or Dark. \n\nRaise your arms in protest, nay raise your finger the next time one of these disappointments catch your attention. Do not give to the promises of rich storytelling and star studded casts. \n\n/s, so much /s that Monty Python would cringe. \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8509g/greyed_out_uk_series/"
    },
    {
        "id": "1l8123h",
        "author": "S4v1r1enCh0r4k",
        "title": "Sanbox VR Is Developing A New 'Stranger Things' VR Experience, 'Catalyst,' Coming Out In Late 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8123h/sanbox_vr_is_developing_a_new_stranger_things_vr/"
    },
    {
        "id": "1l7zqug",
        "author": "redneck2022",
        "title": "Catalog",
        "content": "Hello everyone, is there a way to see the catalog from a different country?\nReason being is I watch movies with my significant other when they are away and it’s annoying to have to keep asking if this movie is available in that country. I know that most Titles with the Netflix logo are available everywhere but not the ones from other studios. Thanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7zqug/catalog/"
    },
    {
        "id": "1l7z09r",
        "author": "Rempex446",
        "title": "The Genius",
        "content": "I just watched both season of The Devil’s Plan and I really enjoyed it. I wanted to watch something similar on netflix but I didn’t find anything. But today I found out that exists a show called The Genius made by the same creator of The Devil’s Plan. I would like a lot if Netflix could ever get the rights to publish it, maybe even dubbing it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7z09r/the_genius/"
    }
]