[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j074yp",
        "author": "Benzinazero",
        "title": "'Fleximan' era una banda di ladri: tagliava gli autovelox per non essere ripresi dalle telecamere dopo i colpi",
        "content": "",
        "upvotes": 64,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gPbrDZOfqG1ysNFrpoS8gbEwQ2WKlHAv3L3vAo6_aBQ.jpg?auto=webp&amp;s=65ed519d1ab8e47cd7e79511076e500c0f568e29"
        },
        "permalink": "/r/torino/comments/1j074yp/fleximan_era_una_banda_di_ladri_tagliava_gli/"
    },
    {
        "id": "1j0cyqi",
        "author": "Remarkable_State_474",
        "title": "Rivoli",
        "content": "Ciaoo a tutti e tutte. (M23 se è rilevante, ma tutti su Reddit lo specificano sempre, boh) Sono di Barriera, ma probabilmente tra poco otterrò un lavoro a Rivoli, e la mia intenzione è di trasferirmici appena possibile. Non conosco per niente la città, ho solo sentito genericamente dire che è bellina. Siete d'accordo e volete argomentare, o al contrario smentite? Quali sono le belle realtà che è possibile trovarci, quali i pregi e i difetti di viverci? \nIo starei preferibilmente a Cascine Vica. È abbastanza tranquilla come zona?\n\nQualunque opinione o suggerimento possa venirvi in mente è bene accetto :)",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1j0cyqi/rivoli/"
    },
    {
        "id": "1j0mms0",
        "author": "Altruistic_Leg7460",
        "title": "consigli per trasferirmi",
        "content": "ciao! sto pensando a trasferirmi a Torino perché ogni volta che vengo a visitarla mi piace di più, che consigli mi potreste dare per riuscire a farlo? in relazione al quartiere e il prezzo dell’affitto, se è facile conoscere della gente, cioè vita sociale,… cosa direste a un’amica che vuole vivere qui?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1j0mms0/consigli_per_trasferirmi/"
    },
    {
        "id": "1j0ikw1",
        "author": "BothCondition7963",
        "title": "Donna scomparsa nel Torinese, riprese le ricerche nei boschi",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QkYjgBqRpzlny_Z878zDOkJghfsaF_eKT0CTS89Jq4g.jpg?auto=webp&amp;s=780c52f4832a1ae86704243127088bbac7e6e8bd"
        },
        "permalink": "/r/torino/comments/1j0ikw1/donna_scomparsa_nel_torinese_riprese_le_ricerche/"
    },
    {
        "id": "1j0as6d",
        "author": "Ok-Action6233",
        "title": "Does Politecnico Di Torino accepts 1300 score or only 650 for each section",
        "content": "and also i am wondering that can i get around 600-650 english score and 700-750 math score and still get acceptted to torino",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j0as6d/does_politecnico_di_torino_accepts_1300_score_or/"
    },
    {
        "id": "1j025mt",
        "author": "Cecco-Flores",
        "title": "Concerto Th Da Freak (Bordeaux) e Corvida (Torino) al Blah Blah",
        "content": "Amic* appassionati di rock in tutte le sue forme, se non sapete cosa fare domenica 16 marzo, c'è un bel concerto al Blah Blah. Suoneranno i Th Da Freak, gruppo francese molto interessante e variegato (influenze psichedelia anni 60 e alternative anni 90), e in apertura i Corvida (alt-rock con contaminazioni anni 90-2000 e punk), torinesi. \nConsiglio vivamente di dare un ascolto ai Th Da Freak, sono veramente forti. Faccio parte dei Corvida, quindi non esprimo giudizi a riguardo, ma vi aspettiamo per fare un po' di festa!",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5v600y2qztle1.jpeg?auto=webp&amp;s=552f83b78502de0000bdd86204b6022bdc450d87"
        },
        "permalink": "/r/torino/comments/1j025mt/concerto_th_da_freak_bordeaux_e_corvida_torino_al/"
    },
    {
        "id": "1j0bt6m",
        "author": "freffo_",
        "title": "Palestra ben attrezzata",
        "content": "Nei prossimi mesi mi trasferirò a Torino e sto valutando la zona in cui cercare casa, volevo quindi sapere da chi conosce già, quali siano le palestre con i migliori macchinari (Panatta, Hammer Strength, Cybex, Nautilus ecc.). Non mi interessa sapere tanto i prezzi, poi valuterò io, vorrei quantomeno sapere quali siano e dove si trovino. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1j0bt6m/palestra_ben_attrezzata/"
    },
    {
        "id": "1j0bnvh",
        "author": "Intelligent-Deal-759",
        "title": "PARTITA DI CALCIO DOMENICA POMERIGGIO VANCHIGLIA",
        "content": "Ragazzi cerchiamo 2 persone che vogliono giocare a calcetto domenica primo pomeriggio/tardo pomeriggio, zona vanchiglia o aurora. \n\nGià siamo 8 e ne mancano solo 2.  \nLivello: medio/basso, giochiamo per il meme",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j0bnvh/partita_di_calcio_domenica_pomeriggio_vanchiglia/"
    },
    {
        "id": "1j07gu5",
        "author": "Beneficial-Two-1732",
        "title": "Concertini Torino",
        "content": "Ciao a tutt! Cerco concertini alternativi o stand up comedy o altre cose carine per questa sera a Torino (28 febbraio 2025), ma se ci sono anche cose nei prossimi giorni ogni suggerimento è ben accetto\nGrazieeeeeee",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1j07gu5/concertini_torino/"
    },
    {
        "id": "1izy4ym",
        "author": "medieval_punk",
        "title": "Visting Torino (March 18-23)",
        "content": "My girlfriend and I are visiting Torino as part of our trip through Italy, and I'm looking for some recommendations for food, bars, wineries and any other authentic experiences—whether it’s a lesser-known viewpoint, a lively local market, or something cultural off the beaten path.\n\nThanks in advance for your tips!",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1izy4ym/visting_torino_march_1823/"
    },
    {
        "id": "1iziuiw",
        "author": "PureLight4802",
        "title": "myUnito+ app per android?",
        "content": "Buonasera ragazzi, ho cambiato cellulare (rimanendo android) e volevo reinstallare sul nuovo l'app myUnito+, ma mi sono accorto che non è proprio disponibile nel PlayStore... Qualcuno sa dirmi cosa sia successo a quest'app? So che dava problemi, ma non pensavo optassero per rimuoverla del tutto. ",
        "upvotes": 12,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8qv69ojmdple1.jpeg?auto=webp&amp;s=21f54089427b938e82d157f21c7cff96fd960288"
        },
        "permalink": "/r/torino/comments/1iziuiw/myunito_app_per_android/"
    },
    {
        "id": "1izlz3o",
        "author": "Active_Quail_6520",
        "title": "Da vivere",
        "content": "Ciao a tutti! C'è qualcuno che sa dove posso trovare un posto temporaneo? Per esempio, su Airbnb. Oppure c'è qualcuno che vorrebbe guadagnare qualche soldo extra e condividere con un uomo di 28 anni per uno o due mesi? Grazie!.\nP.S: per motivi di vacanza \n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1izlz3o/da_vivere/"
    },
    {
        "id": "1izlifh",
        "author": "Benzinazero",
        "title": "Torino, ‘si tuffa nel laghetto con l’auto’. Non si sa chi, non si sa perché, non si sa come [*Come i giornali e i giornalisti raccontano gli scontri stradali*]",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vtu7M48XmkD_oeJt70KTM_xIXMZJyJDFqdexYU5XJmY.jpg?auto=webp&amp;s=e4a953d3bdd393b6dfe8d8e67d52c399afbd1b43"
        },
        "permalink": "/r/torino/comments/1izlifh/torino_si_tuffa_nel_laghetto_con_lauto_non_si_sa/"
    },
    {
        "id": "1izq1lq",
        "author": "bear_onmars",
        "title": "Elettricista in zona Santa Rita (please help us)",
        "content": "Ciao! Stiamo cercando un elettricista in zona Santa Rita per fare una riparazione abbastanza tranquilla. Se è economico anche meglio. Abbiamo contattato una persona, ma alla fine non ci sta cagando più.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1izq1lq/elettricista_in_zona_santa_rita_please_help_us/"
    },
    {
        "id": "1izkds8",
        "author": "gabri_omt",
        "title": "cercasi amici di corsa Torino nord",
        "content": "ciao,\ncomplice il bel tempo un arrivo volevo trovare degli amichetti  con i quali andare a correre il pomeriggio.\nnulla di impegnativo e a qualsiasi livello. giusto per condividere quattro passi assieme.\n\nio m31, tipo regolare. attualmente vivo in zona nord. parco della colletta per capirci.\nciao scrivete!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1izkds8/cercasi_amici_di_corsa_torino_nord/"
    },
    {
        "id": "1izscd9",
        "author": "HighwayRaccoon",
        "title": "Dove posso comprare l'acqua in lattina a Torino?",
        "content": "Ciao, sto cercando di bere meno bibite energetiche e bere più acqua, e tra le varie cose, come metodo di \"disintossicazione\", ho pensato di iniziare a bere acqua in lattina (non in bottiglia per motivi ecologici)\nMi ricordo di averla vista in passato in altre città, della San Benedetto se non sbaglio, ma qua a Torino non l'ho mai vista, e ho girato per tanti negozi/supermercati. Per caso l'avete mai vista a Torino/sapete dove comprarla? Grazie",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1izscd9/dove_posso_comprare_lacqua_in_lattina_a_torino/"
    },
    {
        "id": "1iz1c49",
        "author": "verdreht-",
        "title": "È sicuro parcheggiare una bici elettrica in università a Torino?",
        "content": "Ciao a tutti!\n\nSto valutando di usare una bici elettrica per il percorso casa-università (sedi polo teologico, orto botanico e dipartimento biologia).\n\nHo notato che la maggior parte di quelle parcheggiate all'interno dei dipartimenti sono bici malconce, e questo mi sta facendo sorgere dubbi sulla sicurezza.\n\nCi tengo alla mia bici, non è neppure tanto economica (pagata sui 1500€), non vorrei lasciarla con l'ansia di non trovarla a fine giornata. \n\nVolevo chiedere secondo voi quanto sia elevato il rischio furto, ed eventualmente quali accorgimenti e strumenti mi consigliate per ridurlo.\n\nPreciso che terrei la bici negli spazi interni delle sedi, per circa 4-5h, e andrei via prima di sera.\n\nGrazie!",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1iz1c49/è_sicuro_parcheggiare_una_bici_elettrica_in/"
    },
    {
        "id": "1iyi4np",
        "author": "Top-Text-7727",
        "title": "La gente non sa stare sui mezzi pubblici",
        "content": "Perché se i corridoi dei bus e dei tram sono liberi, non vi mettete li? Eppure ci sono anche le corde di appoggio.\n\nPoi perché vi mettete davanti la porta se non dovete scendere?\n\n\nScusate lo sfogo, torno al lavoro. Buon inizio giornata a tutti.",
        "upvotes": 74,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1iyi4np/la_gente_non_sa_stare_sui_mezzi_pubblici/"
    },
    {
        "id": "1iyl6ki",
        "author": "Business_Two7230",
        "title": "Com’è vivere a Torino?",
        "content": "La consigliate come città? Attualmente vivo a Bologna",
        "upvotes": 16,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1iyl6ki/comè_vivere_a_torino/"
    },
    {
        "id": "1izd7dl",
        "author": "mimi0-03",
        "title": "Vegan Community",
        "content": "Ciao a tutti, ci sono vegani a Torino? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1izd7dl/vegan_community/"
    },
    {
        "id": "1iz1wr5",
        "author": "OnlyClimb_V2",
        "title": "Consiglio parcheggio coperto/custodito",
        "content": "Ciao a tutti, devo lasciare l'auto vicino a Porta Susa per 5 giorni perché prendo un treno da li, sapete consigliarmi un parcheggio custodito in cui non si spende una fortuna come in quelli della gtt e my parking?? Grazie",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1iz1wr5/consiglio_parcheggio_copertocustodito/"
    },
    {
        "id": "1iyk33z",
        "author": "_Mini_Hulk_",
        "title": "[Help Needed] - Starting a TTRPG Store in Turin – Your Thoughts and Suggestions!",
        "content": "Heyy everyone!\n\nI'm kind of nervous posting about this but if not on reddit then where hahah. I’m contemplating starting a unique project here in our city, and I’d love to hear your thoughts and feedback from the local community.\n\nThe idea is to open a store focused on **handmade dice, TTRPG books, miniatures and terrain, snacks, drinks, and even hosting game nights** for tabletop role-playing game enthusiasts. I’ve been brainstorming the concept and trying to get a feel for whether this kind of store could thrive in Turin, so I’m turning to you for some advice and insights!\n\nHere are a few questions I’d love your thoughts on:\n\n1. **Is this something you’d be interested in?** Would you be excited to have a store that caters to the TTRPG community here? Do you think a mix of handmade dice, gaming accessories, snacks, and game nights would be appealing?\n2. **Do you think it’s a viable project in Turin?** Do you think there’s a strong enough market for it? Would this concept thrive here, or is there not enough demand?\n3. **Where do you think we should open the shop?** Any areas in Turin that would be a good fit for this type of store? Ideally, I’m looking for a location that’s accessible, close to where people hang out (maybe near universities, gaming hubs, etc.), but I’d love your input on the best spots. \n4. **Is there a big TTRPG community in Turin?** Do you think there’s a large enough community here that would be excited about a store like this? Are there already groups or venues where local TTRPG players gather? (I know about jolly joker and wistery, can't remember other ones off the top of my head)\n5. **Suggestions? What would you love to see in a TTRPG store?** I’m trying to think of all the things that could make this store special. What would you love to see offered, whether it’s specific products, services (like custom dice-making or miniature painting), or events? Any tips on what would make this a welcoming and fun spot for the community?\n\nI’m in the early stages, so your input could make all the difference in shaping the vision and ensuring this project is something people will enjoy and support.\n\n\n\n**TL;DR**: I’m thinking about opening a TTRPG store in Turin with handmade dice, TTRPG accessories, snacks, drinks, and game nights. Is this something you'd be interested in? Do you think it’s viable in Turin? Any suggestions on where to open the store or what you’d like to see there? Let me know your thoughts!",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1iyk33z/help_needed_starting_a_ttrpg_store_in_turin_your/"
    },
    {
        "id": "1iyx1u5",
        "author": "soul6781",
        "title": "Consiglio",
        "content": "Vorrei trasferirmi a Torino per iniziare la specializzazione all’ospedale Regina Margherita. Dove consigliate di cercare la casa come zona? Grazie mille!",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1iyx1u5/consiglio/"
    },
    {
        "id": "1iythb4",
        "author": "_L_-",
        "title": "Food challenge a Torino",
        "content": "Conoscete locali che fanno sfide in cui ad esempio hai tot tempo per mangiare tot portate? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1iythb4/food_challenge_a_torino/"
    },
    {
        "id": "1iy8uf6",
        "author": "KeyTree687",
        "title": "Am so lost",
        "content": "Hello I am international student here , in Torino am trying to learn Italian but it’s so difficult for me. I am feeling so lost and sad about my professional life as am not able to find any job here in Italy. Does anyone have any leads ? Or some job that I can do ? Also some interesting things to do in Torino? Just feeling like am not doing anything lately and am a fun person I don’t want to turn into a boring person like this ",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1iy8uf6/am_so_lost/"
    },
    {
        "id": "1iy955w",
        "author": "Comfortable-Key4316",
        "title": "medico di base per fuorisede",
        "content": "ciao a tutti! sono una studentessa fuorisede al terzo anno, vorrei sapere se qualcuno di voi ha fatto il passaggio al medico di base qui a torino. mi hanno detto che é possibile scegliere il medico temporaneo per un anno previa rinuncia al medico di giù, cosa che ho fatto, ma ora non so come scegliere il nuovo qui. ho provato sul sito di Salute Piemonte ma non riesco perché mi da errore, forse perché non ho la residenza?\nqualcuno di voi lo ha fatto e può darmi una mano?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1iy955w/medico_di_base_per_fuorisede/"
    },
    {
        "id": "1ixpmto",
        "author": "No-Bit-2036",
        "title": "Cenare sul tram. Buona idea o trappola pigliaturisti?",
        "content": "A Pasqua i miei genitori verranno a trovarmi a qui a Torino, perciò stavo pensando di fare qualcosa con loro. Ho scoperto che esiste \"cene in movimento\", dove praticamente si consuma il pranzo o la cena a bordo di un tram. Come vi è sembrata, se avete provato questa esperienza (a Torino o in altre città)? A me incuriosisce un pochino ma ho paura di beccare un inculata.",
        "upvotes": 23,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ixpmto/cenare_sul_tram_buona_idea_o_trappola/"
    },
    {
        "id": "1iy2xjs",
        "author": "athousandpiece",
        "title": "locker bagagli porta nuova",
        "content": "qualcuno sa consigliarmi dove lasciare un bagaglio a mano in zona porta nuova che non chiuda presto? cercavo un 24/7 ma non riesco a trovarne uno, mi segna solo porti aperti fino alle 19/20",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iy2xjs/locker_bagagli_porta_nuova/"
    },
    {
        "id": "1ixx23v",
        "author": "Repulsive-Yak-126",
        "title": "Electrician",
        "content": "Yesterday I posted in order to find an electrician in Torino. I was recommended one guy but he wasn't in town. I need another phone number, it's rly fucking cold at night in an uptown",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ixx23v/electrician/"
    },
    {
        "id": "1ix3sf3",
        "author": "AppropriateSelf8827",
        "title": "Cost of living in Torino",
        "content": "Hi guys! Sorry I don’t have any knowledge on Italian.\nI have a question for you\n\n\nToday I got a job offer in Torino which is 52k€/year. I am living in Germany my salary is around 4000€ after tax.\n\nHow this salary sounds for Torino? Does it worth to move from Germany to Italy? I mean job in Italy look more satisfying than job that I have in Germany right now. \n\nIs there a tax advantage for “newcommers” in Italy or is there anyone who recently relocated?\n\nI am thanking you in advance have a nice day!\n\n",
        "upvotes": 15,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1ix3sf3/cost_of_living_in_torino/"
    }
]