[
    {
        "id": "1kkfz46",
        "author": "ThingsLikeThisAMA",
        "title": "Hi r/movies! I’m Max Talisman: writer, director, actor &amp; producer of Things Like This, a romantic comedy about self-worth, connection and queer love without apology. It hits theaters Friday, May 16. Excited to chat with you. Ask me anything!",
        "content": "Hi r/movies! I’m Max Talisman: writer, director, actor &amp; producer of Things Like This, a romantic comedy about self-worth, connection and queer love without apology. It hits theaters Friday, May 16. Excited to chat with you. Ask me anything!\n\nSynopsis:\n\nStruggling writer Zack Anthony meets Zack Mandel, an assistant to a talent agent. Their connection begins with a small act of kindness and soon grows after a disastrous but comedic first date. As they spend more time together, they uncover a surprising shared past that feels like fate. Despite personal challenges and misunderstandings, their bond deepens as they navigate what could be the start of something special.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=tMQIedljySI&amp;pp=0gcJCdgAo7VqN5tD](https://www.youtube.com/watch?v=tMQIedljySI&amp;pp=0gcJCdgAo7VqN5tD)\n\n  \nI'll be back tomorrow Monday 5/12 at 8:00 PM ET to answer your questions. Ask me anything!",
        "upvotes": 20,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ftx9k4j090f1.png?auto=webp&amp;s=f18a735f4fd5cc0b3e99723a897c8c180a247911"
        },
        "permalink": "/r/movies/comments/1kkfz46/hi_rmovies_im_max_talisman_writer_director_actor/"
    },
    {
        "id": "1ki7y48",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Clown in a Cornfield / Fight or Flight / Shadow Force) Plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Clown in a Cornfield](https://old.reddit.com/r/movies/comments/1ki7l69/official_discussion_clown_in_aa_cornfield_spoilers/?)\n\n[Fight or Flight](https://old.reddit.com/r/movies/comments/1ki7l7u/official_discussion_fight_or_flight_spoilers/?)\n\n[Shadow Force](https://old.reddit.com/r/movies/comments/1ki7l93/official_discussion_shadow_force_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Gladiator](https://old.reddit.com/r/movies/comments/1ki7lag/official_throwback_discussion_gladiator_spoilers/?)\n\n[I Dreamed of Africa](https://old.reddit.com/r/movies/comments/1ki7lci/official_throwback_discussion_i_dreamed_of_africa/?)\n\n\n# Still in Theaters\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ki7y48/official_discussion_megathread_clown_in_a/"
    },
    {
        "id": "1kk39jf",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Matt Smith &amp; Austin Butler in Darren Aronofsky’s ‘Caught Stealing’ - Follows Hank Thompson, a former baseball player, as he's unwittingly plunged into a wild fight for survival in the downtown criminal underworld of '90s NYC.",
        "content": "",
        "upvotes": 1683,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8uj8u6ii560f1.jpeg?auto=webp&amp;s=a20167706e11f0712681a14c20ffcf18d1f716d3"
        },
        "permalink": "/r/movies/comments/1kk39jf/new_image_of_matt_smith_austin_butler_in_darren/"
    },
    {
        "id": "1kk96t5",
        "author": "NoCulture3505",
        "title": "Michelle Yeoh To Star In Action Film ‘The Surgeon’ For ‘John Wick’ Outfit Thunder Road — Cannes Market",
        "content": "",
        "upvotes": 551,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7VUUD3qP5NWc5VXKcg_o5MaK7LLPocvZYxPHgioFJmY.jpeg?auto=webp&amp;s=0081f08dfcfef39d6bba5a08e5015377444bbfe3"
        },
        "permalink": "/r/movies/comments/1kk96t5/michelle_yeoh_to_star_in_action_film_the_surgeon/"
    },
    {
        "id": "1kkaqoe",
        "author": "Sp00kbee",
        "title": "What are some of the best revenge lines you've heard in a movie?",
        "content": "Star Trek  II: The Wrath of Khan\n\nAfter being completely out manuvered by his nemesis James T. Kirk. Khan, played by Richardo Montalban, has one last move he can make. Bloodied and filled with hatred, he clutches the detonation device for project Genesis. On the view screen he can see that the Enterprise is badly damaged and only able to slowly limp away. Knowing that they will not be able to outrun the blast once detonated, Khan delivers a line from Herman Melville's novel Moby Dick.\n\n\"To the last, I will grapple with thee... from Hell's heart, I stab at thee! For hate's sake, I spit my last breath at thee!\"\n\nThis moment of hate filled vengeance is absolutely incredible. What are some of your favorites?",
        "upvotes": 440,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1kkaqoe/what_are_some_of_the_best_revenge_lines_youve/"
    },
    {
        "id": "1kkb4ok",
        "author": "desiigner1",
        "title": "The Big Lebowski has more picture in the 4:3 version than the 16:9 widescreen cut",
        "content": "So I was going through some old DVDs to back them up to my media server and popped in The Big Lebowski. Noticed the disc has two video tracks one in 4:3 and the other in 16:9 widescreen. I figured the 16:9 one was the “real” version since that’s what was apperantly shown in theaters.\n\nBut I realized the 4:3 version actually shows more of the image vertically kind of like an IMAX movie. -&gt; look at the beer bottle at the top\n\nI always thought 4:3 versions were just cropped in some way, but apparently not in this case. I’m debating which one to keep. I’m leaning towards the 4:3 because... well, more picture.\n\nhttps://preview.redd.it/a47xpn9ku70f1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=d32802ce8387b3bb9728ffefd6f0ae73e9e2609a\n\nSince I can only add one picture here the scene in 16:9: [click](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fthe-big-lebowski-dvd-has-more-picture-in-the-4-3-version-v0-u4rhg5m9u70f1.png%3Fwidth%3D2559%26format%3Dpng%26auto%3Dwebp%26s%3D08d83c5ff43a2868b084e8c467064a6e2f124983)\n\nor as a youtube clip: [https://www.youtube.com/watch?v=gk5WiQWOXtY](https://www.youtube.com/watch?v=gk5WiQWOXtY)",
        "upvotes": 347,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/68EurkhErniJlvrs417F7L0w0YBEKEUsA12EnjgKWkI.jpeg?auto=webp&amp;s=c314c6f7b39b7ecf42ebc4d8e30c18066c92212c"
        },
        "permalink": "/r/movies/comments/1kkb4ok/the_big_lebowski_has_more_picture_in_the_43/"
    },
    {
        "id": "1kjzndd",
        "author": "FilmWaffle-FilmForum",
        "title": "What are some of the “worst” movie twists you’ve seen?",
        "content": "Everyone always talks about the best movie twists but I’m curious, what twists fell completely flat in your opinion? \n\nFirst one that comes to mind is Vanilla Sky. The movie is pretty messy all around but the big reveal didn’t hit anywhere near as hard as intended in my opinion. It’s a shame because the potential was there.",
        "upvotes": 1398,
        "comments": 2362,
        "media": null,
        "permalink": "/r/movies/comments/1kjzndd/what_are_some_of_the_worst_movie_twists_youve_seen/"
    },
    {
        "id": "1kk6dmt",
        "author": "We5Nile",
        "title": "Bad ass movie scenes",
        "content": "What’s one movie scene that you can think of that every time you see it it sends chills down your spine and when you watch it with someone who’s never seen it before you turn the volume up and make sure they get the same feeling as you? \n\nOne that comes to my mind off the rip is the first fight scene from Book of Eli where Denzel Washington backs into the shadows of the overpass taking on the crew of guys trying to rob him and you just see the silhouettes of them fighting with the intense music and chainsaw swinging around. \n",
        "upvotes": 231,
        "comments": 536,
        "media": null,
        "permalink": "/r/movies/comments/1kk6dmt/bad_ass_movie_scenes/"
    },
    {
        "id": "1kkbvhe",
        "author": "Rosstin316",
        "title": "What’s an example of a movie that did exposition right?",
        "content": "I often see movies get made fun of for too obviously explaining character relationships, history, lore and/or plot in a manner than feels unnatural and shoehorned, i’m wondering which films are known for handling these elements in a way that perfectly balances providing the viewer with necessary information while also being seamless enough that it feels organic and well paced.",
        "upvotes": 108,
        "comments": 200,
        "media": null,
        "permalink": "/r/movies/comments/1kkbvhe/whats_an_example_of_a_movie_that_did_exposition/"
    },
    {
        "id": "1kk85k9",
        "author": "RaIZeNArC",
        "title": "After watching thousands of movies. What are your top 5 movies of all time?",
        "content": "I would like to know your rankings as I have watched so many movies &amp; want to know about peoples top 5 favourite movies of all time.\nI'll appreciate your answer.\n\nI would like to know your rankings as I have watched so many movies &amp; want to know about peoples top 5 favourite movies of all time.\nI'll appreciate your answer.\n\n\n",
        "upvotes": 145,
        "comments": 980,
        "media": null,
        "permalink": "/r/movies/comments/1kk85k9/after_watching_thousands_of_movies_what_are_your/"
    },
    {
        "id": "1kk73es",
        "author": "thebigeverybody",
        "title": "There are some wild entries on this list of obscure box office bombs",
        "content": "I thought I'd share this video because I thought this guy did a fascinating take on the biggest bombs in Hollywood. He broke it down by year and I've never heard of a ton of these movies, even though I'm fascinated by box office bombs (which makes sense because, you know, they bomb when nobody sees them so there's nobody who remembers them). \n\nHis description and the footage he shows makes me want to watch a lot of these.\n\nhttps://www.youtube.com/watch?v=UZK8irOr5A0\n\nHere are the crazier-sounding ones I'd never heard of before:\n\nSEXTETTE - 1978 - famous sexpot Mae West's last picture. She was 85, deaf and disoriented. People had to hold cue cards really close to her and she seemed to have no idea who her co-actors were in what seems to be a plot where a young Timothy Dalton is trying to seduce her.\n\nHONKEY TONK FREEWAY - 1981 - at the time, the most expensive comedy ever made. Apparently it made no sense, but they painted a real town pink, blew up a real bridge and put a real elephant on water skis.\n\nKRULL - 1983 - apparently meant to be the next Star Wars, this bomb had a young Liam Neeson. This one stands out to me because I had a Krull comic when I was a kid and I loved it. I had no idea it was based on a movie. I kind of want to see this *and* read the comic again.\n\nTHE COTTON CLUB - 1984 - Coppola's first bomb? The studio took it away to recut it, someone was murdered, the entire thing was derailed by a FBI investigation and it took 36 years for Coppola to do his intended cut of it.\n\nREVOLUTION - 1985 - I feel like I'm having a stroke writing this one out. Al Pacino was cast in a period piece, but he refused to wear period-appropriate footwear so they had to shoot him from the knees up to hide his modern boots. \n\nNORTH - 1994 - kid Elijah Wood in a bomb that had the director asking critics to go easy on it. I'm pretty sure I saw Bruce Willis, Julia Louise Dreyfuss and Jason Alexander in the footage.\n\nMARY REILLY - 1996 - I kind of remember this one, a movie about Dr. Jekyl's housekeeper, which turned out to be a pretty boring story.\n\nLEGENDS OF OZ: DOROTHY'S RETURN - 2014 - I had never heard about this, but I'm just going to quote the video, \"A disaster on every possible level. Legend of Oz pulled in just three point seven million on it's opening weekend... It wasn't just a flop, it was a scam. The shady studio behind it strong-armed pension funds into investing.\"\n \nPAN - 2015 - \"Another year, another reboot that tanked. Studio execs pitched this one as a dark reboot with a Moulin Rouge vibe. What they delivered was Hugh Jackman, in eyeliner, singing Nirvana with a children's choir.\"\n\nPLAYMOBIL: THE MOVIE - 2019 - I can't believe I never heard of this Lego rip-off starring Daniel Radcliffe. Narrator: \"Critics called it the biggest box office flop of all time, but they just didn't know what was going to happen next.\" (Covid happened next.)\n\nCHAOS WALKING- 2021 - I have no memory of this. It was filmed in 2017 and sat on a shelf for 4 years. Tom Holland and Daisy Ridley starred in this bomb that had the studio reshoot major parts of it (without the director) because test audiences had no idea what was going on.\n\nSTRANGE WORLD - 2022 - nothing noteworthy about this bomb except I'm shocked at how many recent films I'd never heard of. I expected to be pretty clueless about the ones from when I was a kid, not the ones from the most recent years of my life.\n\nLand Of The Lost was on this list and I genuinely like it. I'd heard about most of the other movies on the list because they're such famous bombs and you probably have, too.\n\nI'm not connected to the youtube channel, I'm just bored and needed something to pass the time.",
        "upvotes": 113,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yByV_1uNRFfdKWLg6PeYMwVXctHssJJTw7XGBAY7xVA.jpeg?auto=webp&amp;s=02d34b5a1be31a5c12f97cf650b0e2b40b0fc894"
        },
        "permalink": "/r/movies/comments/1kk73es/there_are_some_wild_entries_on_this_list_of/"
    },
    {
        "id": "1kjzgwf",
        "author": "Discomat86",
        "title": "Parody or “Spoof” films… which one is the GOAT?",
        "content": "Who remembers all the greatest comedy films that spend 90 minutes poking fun at other film genres? \n\nWhat is your greatest parody film of all time? \n\nFor me, the Mt Rushmore would have Naked Gun, Hot Shots, Scary Movie and Not Another Teen Movie. I don’t personally classify Austin Powers as a spoof film but others may consider it. \n\nFor me, it’s stood the test of time and still cracks me up - Hot Shots is my GOAT. \n\nWhat’s yours? Have I missed any bangers? \n\n\nUpdate: oh man after reading the comments there are so many I have missed. This is harder than I thought! ",
        "upvotes": 326,
        "comments": 1047,
        "media": null,
        "permalink": "/r/movies/comments/1kjzgwf/parody_or_spoof_films_which_one_is_the_goat/"
    },
    {
        "id": "1kjz9gm",
        "author": "BunyipPouch",
        "title": "Poster for the 4K Restoration and Re-Release of 'Little Buddha' - Directed by Bernardo Bertolucci ('Last Tango In Paris') - Starring Keanu Reeves, Bridget Fonda, and Ying Ruocheng",
        "content": "",
        "upvotes": 335,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5eyshycq550f1.jpeg?auto=webp&amp;s=dd7abdf274090cbf0e4ec19c5f2a9a2a2133eb57"
        },
        "permalink": "/r/movies/comments/1kjz9gm/poster_for_the_4k_restoration_and_rerelease_of/"
    },
    {
        "id": "1kk0owa",
        "author": "Mst3Kgf",
        "title": "I'm not sure there's a movie that's more creatively daring for the most cynical of reasons than the original animated \"Transformers: The Movie.\" The most traumatic TV commercial ever.",
        "content": "Anyone who saw this movie as a kid, especially in the 80s, can probably remember how shocked they were when this movie ruthlessly killed off the bulk of the cast from the TV series within the first act, including having Optimus Prime, the main hero and symbol of the franchise, getting shot in the gut and perishing on an operating table. This is an insane and seemingly ballsy creative decision (imagine if \"Avengers: Infinity War\" had Thanos killing all the main Avengers in the first act), until you realize why it was done; to sell more toys. The film is a feature-length toy commercial and they were simply clearing out the old line to make room for the new toys. They just did it in the most upsetting way possible.\n\n\"Hey, kids, guess what? Remember all those toys you love and cherish? They're all DEAD! WE KILLED THEM ALL!!!...so how about buying some new ones? We got them right here!\"\n\nOf course, the joke is, they played themselves and not only made what was intended as nothing more than a toy commercial a memorable film, they also were hit with a backlash to Optimus Prime's demise that was so fierce, they eventually ordered the character brought back to life. (The backlash even spilled over to other projects; the similar \"G.I. Joe\" animated movie hastily rewrote a major character death to just going into a coma to avoid a repeat reaction.) Sometimes, the craziest movies can be made for the most cynical of reasons.\n\n",
        "upvotes": 211,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1kk0owa/im_not_sure_theres_a_movie_thats_more_creatively/"
    },
    {
        "id": "1kkeu8c",
        "author": "WorldsBestWrestling",
        "title": "Ben Wheatley directed a secret sci-fi project called BULK, which is set to premiere this year",
        "content": "",
        "upvotes": 30,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IOnn98pSo0cVH2M8dO5mrg3eCZzWcwG9jXrbvyE1PXk.jpeg?auto=webp&amp;s=17a32a5378761de867d2a073cc45c859f25f9036"
        },
        "permalink": "/r/movies/comments/1kkeu8c/ben_wheatley_directed_a_secret_scifi_project/"
    },
    {
        "id": "1kkfu66",
        "author": "ImaVeganShishKebab",
        "title": "What's a movie scene that you've seen and knew immediately that it was clearly unnecessary and likely a kink belonging to the director?",
        "content": "Here's my provision to this question: the scene where a teenage Leonardo Dicaprio masturbates on top of a roof in Basketball Diaries, out of absolutely nowhere. Also the scene where him and Mark Wahlberg are playing basketball with their butt cheeks hanging out. I get the idea of being a youth, going crazy, and it's a rated R movie for the drugs, but this scene did not advance the plot forward and can be skipped over and you'd miss nothing.",
        "upvotes": 25,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1kkfu66/whats_a_movie_scene_that_youve_seen_and_knew/"
    },
    {
        "id": "1kkb952",
        "author": "BlkNtvTerraFFVI",
        "title": "Does anyone remember Toys (1992)? I think about it all the time",
        "content": "Great, funny, poignant movie with creative sets. Joan Cusack is fantastic. \n\nI think it flopped, but it deserved better. Robin Williams is wonderful in it as well. \n\nI really loved weird/off-putting movies like that, that were kind of sweet and kind of subtly disturbing. \n\nSometimes I wish more movies were being made in this style. ",
        "upvotes": 36,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1kkb952/does_anyone_remember_toys_1992_i_think_about_it/"
    },
    {
        "id": "1kjzzgn",
        "author": "Davis_Crawfish",
        "title": "\"The Reflecting Skin\" (1990): A young boy suspects his strange neighbor of being a vampire. A suspicion which leads into tragic circumstances. A eerie, spooky picture set in the American midwest.",
        "content": "",
        "upvotes": 160,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p5eGYG7PfWNipP4E5A4zMyz7tOe0KF_C9gABTKTsloA.jpeg?auto=webp&amp;s=61f3a169bd6938a87cbf25a632395f9201b304c7"
        },
        "permalink": "/r/movies/comments/1kjzzgn/the_reflecting_skin_1990_a_young_boy_suspects_his/"
    },
    {
        "id": "1kjdwne",
        "author": "DamnThatsInsaneLol",
        "title": "Director Chad Stahelski Confirms ‘Highlander’ Reboot Starring Henry Cavill Will Shoot in September",
        "content": "",
        "upvotes": 6176,
        "comments": 512,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a35QB1ifCAARFnXiKC7zNbVv-IPuXATY5NF4D7WvXTc.jpeg?auto=webp&amp;s=40405a5aa36183e7e63eeac119ef0bde71759b15"
        },
        "permalink": "/r/movies/comments/1kjdwne/director_chad_stahelski_confirms_highlander/"
    },
    {
        "id": "1kju8fq",
        "author": "MeatDiddler",
        "title": "What are some movies that are surprisingly okay for kids to watch?",
        "content": "My daughter walked in while I was watching Mission Impossible: Rogue Nation and I ended up starting it over and watching it with her. Now we’re in the process of going through all of them before The Final Reckoning comes out. There are a few intense scenes (especially in 3 with Phillip Seymour Hoffman), but for the most part they’re not THAT bad. So it got me thinking…what are some other movies that you would think would be inappropriate for a 10 year old, but they’re not that bad? ",
        "upvotes": 381,
        "comments": 253,
        "media": null,
        "permalink": "/r/movies/comments/1kju8fq/what_are_some_movies_that_are_surprisingly_okay/"
    },
    {
        "id": "1kkdvsp",
        "author": "DickNJaneNumber1Fan",
        "title": "What movies surprised you when you found out they were feature debuts?",
        "content": "Sometimes, I am floored to find out that a movie was the director’s feature debut. Either because of the beauty in its content or just that they have such a distinct style. Some that come to mind are:\n\n- *Past Lives*\n- *It’s What’s Inside*\n- *His House*\n- *Lars and the Real Girl* (technically Craig Gillespie also released Mr. Woodcock around the same time, but I choose to ignore that)\n- *Bachelorette* \n- *Aftersun*\n- *Little Miss Sunshine* (they did a doc earlier, but their first fiction feature)\n- *Swiss Army Man*\n- *Sorry to Bother You*\n- *Saint Maud*\n- *Eraserhead*",
        "upvotes": 14,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1kkdvsp/what_movies_surprised_you_when_you_found_out_they/"
    },
    {
        "id": "1kkbiic",
        "author": "Various-Most2367",
        "title": "Any recommendations for a good romance movie, that isn’t a romantic comedy?",
        "content": "I mean outside of the really obvious ones like Titanic,or Casablanca, and honestly I prefer happy endings like Like Pride and Prejudice, but that's not a dealbreaker if the story is really good. I especially like westerns and historical films, but again, would love any recommendations even if a movie doesn't fall into that category. ",
        "upvotes": 16,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1kkbiic/any_recommendations_for_a_good_romance_movie_that/"
    },
    {
        "id": "1kjhj3d",
        "author": "MarvelsGrantMan136",
        "title": "‘Supergirl: Woman of Tomorrow’ Wraps Filming",
        "content": "",
        "upvotes": 1976,
        "comments": 289,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HXSYHio30I_kiRVyNvWprg-oosmPmUP2tta7az3jQlY.jpeg?auto=webp&amp;s=a4258f8c35a5130a111ee9bdb17c212b00f492c2"
        },
        "permalink": "/r/movies/comments/1kjhj3d/supergirl_woman_of_tomorrow_wraps_filming/"
    },
    {
        "id": "1kk036b",
        "author": "MojonConPelos",
        "title": "What movie left you speechless… and no one else seems to remember it?",
        "content": "There are films that didn't win awards or appear on famous lists, but that left their mark on you because of their story, atmosphere, or performances. Those are the ones you saw once and couldn't forget, even though few others talk about them. What is that film that had a lasting impact on you and you feel has been unfairly forgotten?",
        "upvotes": 60,
        "comments": 231,
        "media": null,
        "permalink": "/r/movies/comments/1kk036b/what_movie_left_you_speechless_and_no_one_else/"
    },
    {
        "id": "1kj9etr",
        "author": "MarvelsGrantMan136",
        "title": "Dev Patel’s Action-Thriller ‘The Peasant’ Snapped Up By A24 For Worldwide Rights On Eve Of Cannes Market",
        "content": "",
        "upvotes": 4466,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X-GJQ6rQLs5TIVV5i0DlqW-MwVRKZ-b0kCzmawwCtMg.jpeg?auto=webp&amp;s=3f7fc54af176219dfee3549a4dfb48bf5af3505b"
        },
        "permalink": "/r/movies/comments/1kj9etr/dev_patels_actionthriller_the_peasant_snapped_up/"
    },
    {
        "id": "1kkfwmm",
        "author": "Bennett1984",
        "title": "The Bonkers Comedies of Andrew McCarthy",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qwZBKYuOxRtCBz7ApTJzE8hiU0lTVfvBsF0B-8jhcTk.jpeg?auto=webp&amp;s=69773d1eea5d7198639e0240ddcedb79443a9c04"
        },
        "permalink": "/r/movies/comments/1kkfwmm/the_bonkers_comedies_of_andrew_mccarthy/"
    },
    {
        "id": "1kjd910",
        "author": "mayukhdas1999",
        "title": "First Image of Harry Melling &amp; Alexander Skarsgård in A24's 'PILLION' - A timid man is swept off his feet when an enigmatic, impossibly handsome biker takes him on as his submissive",
        "content": "",
        "upvotes": 2145,
        "comments": 232,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0r7703ca6zze1.jpeg?auto=webp&amp;s=0475c4f880b7b966936720cbb406d12a8746e128"
        },
        "permalink": "/r/movies/comments/1kjd910/first_image_of_harry_melling_alexander_skarsgård/"
    },
    {
        "id": "1kk2l6r",
        "author": "AbbreviationsAway500",
        "title": "What Are The Best Examples Of Movies That Intertwine Real Historical Events/Items/People To Tell A Good Story?",
        "content": "Most \"historically inspired\" films are best when real history is weaved into the story such as Edward Laboulaye's role in \"National Treasure; Book of Secrets\" compared to movies that miss the mark such as Scots wearing kilts in Braveheart.\n\nWhat are movies that do a solid job and share the event that worked well to tell the story?",
        "upvotes": 31,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1kk2l6r/what_are_the_best_examples_of_movies_that/"
    },
    {
        "id": "1kjzdli",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - David Mamet - Monday 5/12 at 2:00 PM ET - Oscar-nominated, Pulitzer-prize-winning, Tony-nominated director, writer, and playwright 'Glengarry Glen Ross', 'The Untouchables', 'House of Games', 'Wag the Dog', 'Hannibal', 'Homicide', 'Hoffa', 'The Verdict', and 'Henry Johnson'",
        "content": "",
        "upvotes": 39,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/26qz9ze0750f1.png?auto=webp&amp;s=f32013a51757802407f43b289ee954d914d91360"
        },
        "permalink": "/r/movies/comments/1kjzdli/amaqa_announcement_david_mamet_monday_512_at_200/"
    },
    {
        "id": "1kkcqgt",
        "author": "StillStanding_96",
        "title": "The Terminator and the art of contrivance",
        "content": "The Terminator (1984) has one of the best examples of a contrivance hidden in plain sight. Take two separate pieces of exposition from Kyle Reese. \n\n1) The machines had begun making humanoid infiltration units to sneak into human bases. The first of these had rubber skin and so were easy to spot. Later versions like Arnold were given real skin and other attributes to make them practically undetectable as machines (except to dogs).\n\n2) The time travel machine can only send back organic matter, so no laser guns and no naked robots. \n\nSo when Skynet first learned of the Time Machine and its limitations it must have thought it was Christmas! “I just so happen to have a line of robots that are already covered in living human skin! This isn’t what they were created for, but darned if they aren’t perfect for this very particular situation.”\n\nHad the delivery of that exposition been less skillful I would have probably thought it was silly for the clearly-superior machine forces to make a unit with human skin and bone teeth. But no, it took me decades to realize how lucky Skynet was that it already had units that were perfectly compatible with a technology that should have been completely unavailable to it.\n\nDoes anyone have any similar examples?",
        "upvotes": 4,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1kkcqgt/the_terminator_and_the_art_of_contrivance/"
    },
    {
        "id": "1kjc29x",
        "author": "DamnThatsInsaneLol",
        "title": "Christopher Nolan’s ‘Dunkirk’ Tops Poll of UK’s Favourite World War II Films",
        "content": "",
        "upvotes": 1724,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fe_4RD4n188oRoYMoX2Qvn5rOztR4getjpt4Wp75u8c.jpeg?auto=webp&amp;s=dd80d970dc28f8d114939dd82e99f9fff850944b"
        },
        "permalink": "/r/movies/comments/1kjc29x/christopher_nolans_dunkirk_tops_poll_of_uks/"
    },
    {
        "id": "1kjurmj",
        "author": "Boss452",
        "title": "Movies are magic.",
        "content": "Just a salute to the artform. As a lover of film, I always appreciate how a good film takes you on a journey for a couple of hours and makes you forget your real life problems for a brief period of time.\n\nAlong the way you experience great visuals, engaging stories, connect with characters, hear gorgeous music, and often times learn a thing or two about the world or human emotions. Sometimes there are themes that make you reflect and ponder over.\n\nThere is a lot written about the future of movies and there is increasing competition from various forms of entertainment for people's time. There are also reports that newer gens are not that much interested in movies as previous gens were.\n\nBut I feel movies have a place in the world and is a beautiful form of art and entertainment.",
        "upvotes": 82,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1kjurmj/movies_are_magic/"
    }
]