[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 66,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lk447f",
        "author": "IrishStarUS",
        "title": "Cobra Kai stars seen in furious row after Martin Kove 'bit' Alicia Hannah-Kim",
        "content": "",
        "upvotes": 77,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1lk447f/cobra_kai_stars_seen_in_furious_row_after_martin/"
    },
    {
        "id": "1ljwlqb",
        "author": "CorpseJuiceSlurpee",
        "title": "Thoughts on Trainwreck: Poop Cruise",
        "content": "I just finished the documentary and I was pretty disappointed in the quality of this documentary.\n\nGenerally, it seems like an interesting topic, and something that I remember happening but don't really know the details of; and I feel like the events leading up to and the cause of the outage were covered pretty well. And that's kind of where my compliments on this doc stops.\n\nThe crew they interviewed were somewhat interesting.The lady who was the voice of the ship was had some great detail of the event because she was where the action and decisions were happening. The chef had some funny anecdotes. The Russian lady was solely there to be horny and call Americans stupid.\n\nThey seemingly found the absolute worst passengers to comment on their experiences. There was little more relayed than it was gross and upsetting. The bachelorette party was insufferable and somehow 12 years later hasn't changed a bit. They acted like such stereotypical bachelorette \"woo girls\" that I can't tell if they were putting on an act or if that's genuinely how they are. \n\nThe entirety of the father-daughter footage can be summed up in, \"I was scared and this experience was not what we paid for.\"\n\nI don't know if this was just the interviewees in particular or maybe it's a true cross section of the type of people who go on cruises, but all the passengers acted like pooping in the red biohazard bags was the absolute end of the world. The son in law seemed to care for little else except that. His grand victory was finding a working toilet. That's might have been the highlight of his life. I've shit into wag bags before and carried it out with me. It's not the most pleasant thing but you do what you gotta do. And they didn't even have to pack it out, they could put it in garbage cans around the ship.\n\nAdditionally all the passengers acted like they were alone on a raft weathering the elements, forced to hand deliver their turds into red bags. Let's be real, they say on their asses while the crew did actual work amidst spoiled people on their worst behavior.\n\nI would have loved to hear what the crew was doing to help passengers day to day, and they did a bit here and there, but it was never really covered. And I would have loved to hear what went on interpersonally on the ship between passengers. People were doing shitty things like hoarding and claiming territory, was there bartering? Did people form loose alliances? This could have been an interesting study on human behavior and instead the biggest takeaway was poop lasagna.\n\nAlso, there's a tie for biggest piece of shit between the Carnival Marketing guy and the Cruise Lawyer.  \n\n3/10 - Still not as bad as Untold: The Liver King",
        "upvotes": 61,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwlqb/thoughts_on_trainwreck_poop_cruise/"
    },
    {
        "id": "1lk19la",
        "author": "Complex_Grass6312",
        "title": "Just watched The Twelve — why is no one talking about this??",
        "content": "I randomly clicked on The Twelve last night and ended up bingeing the entire thing. It’s one of the best courtroom dramas I’ve seen. I’ve seen zero promotion for this, and it’s honestly criminal how buried it is.\n\nHas anyone else seen this? Or know of any similar hidden gems I should check out next?",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lk19la/just_watched_the_twelve_why_is_no_one_talking/"
    },
    {
        "id": "1lkabs8",
        "author": "Longjumping_Land_977",
        "title": "Carnival Cruises has issued a new statement about the Trainwreck: Poop Cruise documentary",
        "content": "",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lkabs8/carnival_cruises_has_issued_a_new_statement_about/"
    },
    {
        "id": "1ljoc5n",
        "author": "Vashknives",
        "title": "Any way to get Netflix for cheaper?",
        "content": "Was wondering if theres any way to get the Netflix subscription for cheaper? Currently paying around $25 and looking to see if theres any discounts or promos for the premium plan. Any help would be greatly appreciated!",
        "upvotes": 379,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1ljoc5n/any_way_to_get_netflix_for_cheaper/"
    },
    {
        "id": "1ljevku",
        "author": "Gnnz",
        "title": "The Good Place worth watching?",
        "content": "This pops up constantly on my Netflix and I am considering starting. For those of you that have watched it or are currently watching it, is it worth the watch?",
        "upvotes": 278,
        "comments": 196,
        "media": null,
        "permalink": "/r/netflix/comments/1ljevku/the_good_place_worth_watching/"
    },
    {
        "id": "1lk3f8n",
        "author": "EconomistAdvanced120",
        "title": "FUBAR",
        "content": "Surely I am not alone in wanting a Season 3!?! So many good things going for this show… i can’t help but think it just kept getting better and before I knew it I was at the end of season 2 😥I just wish I had the words to describe a show that had the thrill of action yet literally wetting my pants laughing! Please let me know I’m not alone in loving this show!\n",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lk3f8n/fubar/"
    },
    {
        "id": "1ljj0a1",
        "author": "OkStretch9367",
        "title": "Dept Q",
        "content": "Me and my partner loved this. I just hope the do a season 2. So many unanswered question about what happened to the main character. Anyone who loves police shows should give this watch",
        "upvotes": 112,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ljj0a1/dept_q/"
    },
    {
        "id": "1lkb7bi",
        "author": "theipaper",
        "title": "Squid Game season 3 release date - and exact time it drops on UK Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lkb7bi/squid_game_season_3_release_date_and_exact_time/"
    },
    {
        "id": "1lk9xz2",
        "author": "Soulless2k4",
        "title": "Netflix TV UI is a really bad user experience",
        "content": "Dont normally complain about things on Reddit but my Netflix tv app just updated to new UI. All the items are way too large now and navigating to the menu used to be a click to the left. Now I need to scroll all the way to the top to access the menu.\n\nBrowsing the catalogue is a massive chore now. Its honestly such a bad UI update that Im considering cancelling my sub over it. Whats the point in having access to a large catalogue if I cant ever see it.\n\nAt least give users the option on what size thumbnails they prefer.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lk9xz2/netflix_tv_ui_is_a_really_bad_user_experience/"
    },
    {
        "id": "1ljrcp2",
        "author": "Blue-Steel1",
        "title": "Anyone actually like Netflix with ads ?",
        "content": "I switched because of the most recent price jump.  I actually like it because I can take a quick bathroom break without having to pause the current show.  Plus there aren’t too many ads ",
        "upvotes": 8,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ljrcp2/anyone_actually_like_netflix_with_ads/"
    },
    {
        "id": "1lk34iv",
        "author": "ineedhelp6789",
        "title": "How to revert to old layout?",
        "content": "The new netflix layout is horrendously useless. Im using google chromecast.\n\nI have a lot in \"my list\", and i have to scroll through each of them just to find the shows.\n\nI always check the \"coming this week\" and \"coming next week\", now it's gone.\n\nAny way to revert back to the old layout?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lk34iv/how_to_revert_to_old_layout/"
    },
    {
        "id": "1lk6sx8",
        "author": "bubblez4eva",
        "title": "KPop Demon Hunters (Korean or English)",
        "content": "Hi All,\n\n\nI've read a few reviews in how good this movie is and want to watch it. However no one ever says if they watched it in English or Korean. I want to knowbwhat's the optimal version? I keep hearing how good the songs are, and want to be able to enjoy them tot the fullest. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lk6sx8/kpop_demon_hunters_korean_or_english/"
    },
    {
        "id": "1ljwfk0",
        "author": "intheworldwithu",
        "title": "Abducted in Plain Sight",
        "content": "I am only 24 minutes in and had to pause to verify the name of this documentary. I think the title of this film is in need of renaming. ‘Dumb and Dumber To’ - much more fitting….",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwfk0/abducted_in_plain_sight/"
    },
    {
        "id": "1lk1s9c",
        "author": "Indoril-Nerevar337",
        "title": "‘Cobra Kai’ Actor Accused of Biting Co-Star Hard Enough to Nearly Draw Blood: \"He Grabbed My Arm Again to Kiss it\"",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lk1s9c/cobra_kai_actor_accused_of_biting_costar_hard/"
    },
    {
        "id": "1lk050u",
        "author": "cheetos0408",
        "title": "Anyone knows how to fix the \"Your device isnt part of the Netflix household for this account\".",
        "content": "My netflix isnt letting me watch anything even tho I LIVE in the same house as the registered account. This wasn't an issue before and it happened so suddenly, I didn't even know this \"Household\" thing existed. It works fine on my phone but it wont work on my laptop.\n\nIs there any way to fix this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lk050u/anyone_knows_how_to_fix_the_your_device_isnt_part/"
    },
    {
        "id": "1lje2j3",
        "author": "MindFlourish2919",
        "title": "The latest Trainwreck review",
        "content": "Trainwreck: Poop cruise\n\nI watched the full thing and I was shocked and relieved that no one went crazy and a bigger disaster occurred. I really liked how the passengers and crew handled the whole situation. Overall very good documentary.\n\n9/10",
        "upvotes": 18,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1lje2j3/the_latest_trainwreck_review/"
    },
    {
        "id": "1ljuu3g",
        "author": "mrbmi513",
        "title": "Cannot remove WWE New Episode Reminders?",
        "content": "I'm pulling my hair out trying to find where to disable the WWE Raw reminders I accidentally set. Every upcoming episode prompts me for a reminder, it's out of my list, and I still get them. It seems like I might not be alone.\n\nAnyone know where the magic button is?!?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljuu3g/cannot_remove_wwe_new_episode_reminders/"
    },
    {
        "id": "1ljxgaa",
        "author": "ZMaiden",
        "title": "Looking for a show it’s driving me crazy.",
        "content": "So it’s half animated, the characters are introduced. Dragon riders . Everyone lives on floating islands in the sky. The water is poisonous. And then some characters get popped into the real world by a dragon. The whole world is supposedly created by a woman who then falls into a coma. Her daughter meets a guy transported from the anime world and his dragon.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ljxgaa/looking_for_a_show_its_driving_me_crazy/"
    },
    {
        "id": "1ljsnlj",
        "author": "Square_Community_812",
        "title": "Animal Kingdom",
        "content": "In Season 5.  Really enjoying the show. Does anyone else dislike J? I can’t stand him. I don’t understand why they let him get away with his shit. \nAnother thing. The time line and nick name Smurf don’t Jive. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsnlj/animal_kingdom/"
    },
    {
        "id": "1lk58fu",
        "author": "FantasticEast2286",
        "title": "Lucifer Morningstar Once Said:",
        "content": "Ella: \"I've seen some guys with some pretty tiny lady hands.\"  \nLucifer: \"Dan doesn't count.\"                                                                                                                                                    \n\nLeave your answers in the comments!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lk58fu/lucifer_morningstar_once_said/"
    },
    {
        "id": "1ljfzhf",
        "author": "intelerks",
        "title": "Martin Kove allegedly bites co-star of ‘Cobra Kai’ Alicia Hannah-Kim at fan convention in Washington",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ljfzhf/martin_kove_allegedly_bites_costar_of_cobra_kai/"
    },
    {
        "id": "1ljplom",
        "author": "Rich-Ambassador9683",
        "title": "Is Anne with an E and the gentlemen worth watching",
        "content": "One of my friend is pushing me to watch it \nIs it worth anne with an e .\nI have watched you and derry girls recently \nNeed a show to start \nWas thinking about the gentlemen but idk",
        "upvotes": 4,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ljplom/is_anne_with_an_e_and_the_gentlemen_worth_watching/"
    },
    {
        "id": "1lju57f",
        "author": "mangl3dmang0",
        "title": "I cant verify my TV. Located in Australia",
        "content": "I work away, weekly, to the same location for 3 days with the same IP address. I'm currently at work and I've gone to use netflix and it came up saying \"your TV isn't part of the Netflix household for this account\" \nI tried to verify the TV but it wanted me to do the same process on another TV listed at my home 1.5hrs away.. \nIs there any short-term fix? \nAlso for future is there anyway I can make it so both of my places are verified? \nTIA :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lju57f/i_cant_verify_my_tv_located_in_australia/"
    },
    {
        "id": "1ljsszz",
        "author": "superpowers335",
        "title": "Is there a downside to setting your default playback quality to high?",
        "content": "I have my settings for my playback quality set to high instead of default. I assume that this is the better option but I was just wondering if there was maybe a reason the default option would even exist. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsszz/is_there_a_downside_to_setting_your_default/"
    },
    {
        "id": "1ljsrbc",
        "author": "MamaCass",
        "title": "Netflix on Roku now breaks after ads",
        "content": "We've got Netflix with ads for the first time, and I hate it. Not because of the ads but because they've somehow broken the Roku app. After every 2-3 ads, the show doesn't come back on. It just hangs at a black screen.\n\nI've updated the Roku, deleted and reloaded the app, etc. None of it helps. Do I need to just spring for the ad-less plan or is there something I'm missing?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ljsrbc/netflix_on_roku_now_breaks_after_ads/"
    },
    {
        "id": "1lj3xi4",
        "author": "Logos1789",
        "title": "PSA About “Leaving Soon” Labels",
        "content": "Depending on the platform you’re watching Netflix on, the “Leaving Soon” labels may not appear on the thumbnail of the show or movie. \n\nInstead, you’ll only see the note about the movie leaving Netflix on X date after selecting the thumbnail to view more info.\n\nI happened to be browsing Netflix on my phone when I noticed that a movie on my list had the “Leaving Soon” label. Upon using my gaming console to pull up the movie, I noticed that the label wasn’t displayed.\n\nIn case this is a one-off mistake, the movie is The Net.",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3xi4/psa_about_leaving_soon_labels/"
    },
    {
        "id": "1ljxy0q",
        "author": "Hopeful-Attempt-6016",
        "title": "One thing I noticed about KPOP Demon Hunters",
        "content": "The Saja Boys only sings songs related to love, while Hunter X(The Protagonists) never does. Thought it was because the boys needed to get attention to suck souls, but Hunter X did just that well without the love songs, so I'm wondering.\n\nLove songs are very common in music, probably even the majority. But is this just a coincidence? Then why did Hunter X never sing any songs related to love? Their exorcism works by igniting people's souls with music, and through that creating bonds with people. Love songs would have worked just fine, and a lot of people would have loved it too.\n\n  \nOne could say that it's a concept of the band, but the bands that these characters were influenced from(TWICE, BLACKPINK, IZZY for girls, TOMORROW X TOGETHER, BTS, Stray Kids, ATEEZ, MONSTA X, BIGBANG for boys) mostly sang both love and non-love related songs. \n\n  \nWondering if this is implying anything.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ljxy0q/one_thing_i_noticed_about_kpop_demon_hunters/"
    },
    {
        "id": "1ljctdm",
        "author": "Indoril-Nerevar337",
        "title": "First Look: Cillian Murphy Leads Reimagining of 'Shy' in Upcoming Drama 'Steve'",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljctdm/first_look_cillian_murphy_leads_reimagining_of/"
    },
    {
        "id": "1ljml0e",
        "author": "Strange_Motor2261",
        "title": "Video quality",
        "content": "I have the best Netflix plan, a fast internet connection, the app is set to the highest quality and yet the video playback quality seems to be practically 480p. However, on the Netflix app from the Microsoft Store, on the computer, the quality is incredible. How can I solve this problem? I'd like to watch TV programmes on the mobile app in the best quality, since I'm paying for it (my mobile phone is a Xiaomi Redmi Note 11).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ljml0e/video_quality/"
    }
]