[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ooabb4",
        "author": "Iaco_V8",
        "title": "Il Museo Egizio di Torino non è più il secondo museo più grande al mondo interamente dedicato all'antico Egitto",
        "content": "Oggi, 4 novembre 2025, ha aperto al pubblico il Grand Egyptian Museum a Giza, che è ufficialmente il più grande museo egizio al mondo, con oltre 100.000 reperti su 500.000 m².\n\nCon questa apertura, il Museo Egizio di Torino perde il titolo di secondo museo interamente dedicato all’antico Egitto più grande al mondo.\n(Specifico “interamente dedicato” perché non mi è chiaro se la sezione egizia del British Museum sia più grande o meno)\n\nMolti reperti verranno trasferiti gradualmente dal Museo del Cairo al nuovo Gran Egyptian Museum, ma il museo storico del Cairo resterà aperto, diventando il secondo museo egizio più grande al mondo.",
        "upvotes": 34,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9my4c7gye9zf1.jpeg?auto=webp&amp;s=0de5508e480bae15b3a2718e9724d403bb1edf4d"
        },
        "permalink": "/r/torino/comments/1ooabb4/il_museo_egizio_di_torino_non_è_più_il_secondo/"
    },
    {
        "id": "1ooa4zi",
        "author": "Resident_Welcome9276",
        "title": "Join me for sushi event",
        "content": "🇬🇧 Heyy everyone, I will go to Miyo Sushi to have \"all you can eat\" menu in a few days, any sushi lovers who'd love to join me?\n\n🇮🇹 Ciao a tutti, tra qualche giorno andrò al Miyo Sushi per provare il menù \"all you can eat\". C'è qualche amante del sushi che vorrebbe unirsi a me?\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ooa4zi/join_me_for_sushi_event/"
    },
    {
        "id": "1oob43d",
        "author": "nickname1917",
        "title": "ATP Finals...",
        "content": "praticamente la cronaca locale è al delirio:\n\n\\- la stanza dove alloggia sinner\n\n\\- il ristorante dove mangia sinner\n\n\\- l'ospedale dove fa beneficienza sinner\n\n\\- l'automobile con cui è arrivato sinner...\n\nquando finiscono le ATP finals?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oob43d/atp_finals/"
    },
    {
        "id": "1oo6si8",
        "author": "davivesp",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, mi sono trasferito a Torino da qualche anno, ma tra una cosa e l’altra non sono mai riuscito a fare davvero nuove amicizie.  \nHo 30 anni, mi piace la fotografia, passeggiare e in generale passare del tempo in modo tranquillo.  \nMi piacerebbe conoscere qualcuno/a con cui fare due chiacchiere, uscire ogni tanto o semplicemente condividere interessi. \n\nSe anche voi siete nella stessa situazione o vi va di ampliare la compagnia, scrivetemi pure :)",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oo6si8/nuove_amicizie/"
    },
    {
        "id": "1oo9znx",
        "author": "eliss00000000",
        "title": "Cerco nuove amicizie/gruppi per uscite",
        "content": "Ciao a tutti, sono una ragazza di 25 anni che vive a Torino da 3 per l'università ed è in procinto di laurearsi tra qualche mese (finalmente ahah). Ho diverse amicizie a Torino, ma non un gruppo numeroso con cui organizzare uscite, per cui mi chiedevo se esistessero dei gruppi con questa finalità in cui essere inserita, oppure se qualcuno ha intenzione di crearne uno mi scriva pure🤗",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oo9znx/cerco_nuove_amiciziegruppi_per_uscite/"
    },
    {
        "id": "1on8yx9",
        "author": "DistributinOfWealth",
        "title": "Torino, città di Dio",
        "content": "Sono sud americano, vivo qui a Torino da cinque anni e penso davvero che la vita in questa città sia fantastica; tutti si lamentano di quanto sia brutta la vita qui, di quanto sia diffusa la criminalità (haha lol), questo e quello\n\nMa in realtà, la città è davvero spettacolare\n\nSo che la città ha dei problemi, ma tutte queste persone che si lamentano non sanno come si vive in Sud America; lì abbiamo dei problemi, qui quasi tutti hanno il pane da mangiare e un'auto per andare al mare, che dista quasi due ore a piedi.\n\nÈ quasi incredibile come gli italiani (dal mio punto di vista) vivano male, perché hanno tutto ciò che serve per vivere bene, e sì, lo so, ci sono dei problemi, ma in realtà tutti i paesi hanno i loro problemi.\n\nE sì, il Paese è indietro in alcune cose come la tecnologia, la corruzione, ecc., ma tu fai parte di questa società, quindi inizia da te stesso, vai a votare per eliminare ciò che non ti piace e leggi e impara per evitare che altre persone ripetano il problema, non piangere su Reddit; poco a poco renderemo di nuovo bella la città e il Paese.\n\nHai ancora un futuro, se lo vuoi.\n\n",
        "upvotes": 182,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1on8yx9/torino_città_di_dio/"
    },
    {
        "id": "1oo8rjr",
        "author": "Embri21",
        "title": "Indicazioni mezzi di trasporto",
        "content": "Ciao raga, settimana prossima per motivi lavorativi sarò a Torino. Precisamente dovrei raggiungere Val della Torre. \nHo avuto di guardare Maps ma è poco chiaro e probabilmente dà indicazioni errate. Mi sapete dire in che modo arrivarci, che mezzo prendere ?\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oo8rjr/indicazioni_mezzi_di_trasporto/"
    },
    {
        "id": "1oo8lxw",
        "author": "Resident_Welcome9276",
        "title": "Looking for friends",
        "content": "Heyyyy everyone, it's been 2 months since I came to Torino to study my master's degree. I have so far met some great people but since I love socializing quite a lot, I'm looking for new friends. I'm a 26yo male, open to friends from both genders, please don't hesitate to contact me, so we can be great friends and do activities together 🥳",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oo8lxw/looking_for_friends/"
    },
    {
        "id": "1oo65u4",
        "author": "VaderFloyd",
        "title": "Lavoro e studio al politecnico",
        "content": "Ciao ragazzi, sono un ragazzo straniero e stavo pensando di iniziare un corso di ingegneria al Politecnico di Torino, probabilmente quello di Ingegneria della Produzione Industriale. Volevo conoscere la vostra esperienza riguardo a tutto ciò che dovete studiare e al fatto di lavorare per pagare le spese. Riuscite a trovare un equilibrio mentre lavorate e studiate abbastanza per gli esami? Inoltre volevo chiedervi se è possibile ottenere una borsa di studio.\nÈ possibile trovare un lavoro correlato ai propri studi fin dal primo anno, anche se si tratta solo di un lavoro basilare? Quali tipi di lavoro sono disponibili?\nApprezzo qualsiasi informazione tu possa fornirmi.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oo65u4/lavoro_e_studio_al_politecnico/"
    },
    {
        "id": "1oo1wnd",
        "author": "fracxjo",
        "title": "Questo dovrebbe essere il sito del Museo delle Illusioni?",
        "content": "Stavo cercndo il sito del Museo delle Illusioni di Palazzo Barolo e mi sono imbattuto in questo (link: [https://www.museoillusionitorino.com/](https://www.museoillusionitorino.com/) ) e la schermata che si presentava era la seguente:\n\nhttps://preview.redd.it/omung3n277zf1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9ba801e1639b0f4f430ffcd8a8c7daa528bc62d4\n\nSicuramente non è questo (ora ho trovato quello giusto), ma allora cos'è?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oo1wnd/questo_dovrebbe_essere_il_sito_del_museo_delle/"
    },
    {
        "id": "1onjv3g",
        "author": "DistributinOfWealth",
        "title": "Affitti a Torino: ma com’è possibile pagare 1200 € per un trilocale?",
        "content": "Ciao a tutti,\n\nsto cercando un appartamento con due camere a Torino e non riesco a trovare nulla sotto i \\~1200 € al mese. Parlo di zone comune come San Salvario, Cit Turin, Santa Rita, etc\n\nMi chiedo seriamente come faccia la gente a permettersi questi affitti con stipendi “medi”, anche da 1.300/2.000 € al mese, se va bene..\n\nA questo punto mi viene da pensare: ha più senso comprare? Qualcun altro nella stessa situazione? ",
        "upvotes": 20,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1onjv3g/affitti_a_torino_ma_comè_possibile_pagare_1200/"
    },
    {
        "id": "1oo483l",
        "author": "vici0608",
        "title": "Looking for a cat sitter",
        "content": "Hi people! I have a cat and I will go on a trip for four days so I am looking for a pet sitter who could come twice a day for giving food and playing a bit with her. Do you have any tips for organizations or websites where I can find a trusted sitter? \nThanks in advance! :)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oo483l/looking_for_a_cat_sitter/"
    },
    {
        "id": "1oo2oq6",
        "author": "Super_Season3039",
        "title": "Com'è la zona barriera di lanzo?",
        "content": "Ciao a tutti, sto cercando un appartamento per una studentessa e mi chiedevo se la zona barriera di lanzo è abbastanza sicura per una ragazza. Grazie in anticipo a tutti!",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1oo2oq6/comè_la_zona_barriera_di_lanzo/"
    },
    {
        "id": "1oo2lh9",
        "author": "KindheartednessRich1",
        "title": "Aiuto per aperitivo di laurea",
        "content": "Buongiorno a tutti! \n\nA marzo mi laureo magistrale e stavo pensando di organizzare una piccola festa - pensavo ad un aperitivo, per circa 13 persone totali. \nC'è qualcuno che ha fatto un aperitivo di laurea da qualche parte che mi può consigliare ed eventualmente indicare il prezzo a persona? Considerate che me lo autofinanzio perciò non vorrei superare i 20/25€ a testa. \n\nGrazie a chi mi risponderà! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oo2lh9/aiuto_per_aperitivo_di_laurea/"
    },
    {
        "id": "1onipss",
        "author": "Cilindro_958",
        "title": "Non ce la faccio, è insopportabile",
        "content": "Qualcuno sa spiegarmi che cazzo è quella puzza immonda che si sente sui tram più vecchi? Quella specie di polvere che si alza i cui componenti probabilmente mi distruggeranno i polmoni. Si sente sia in prossimità dei binari quando passa, sia una volta a bordo. Non mi capacitò nemmeno di come puntualmente io sia l'unico che tenti in qualche modo di coprirsi il naso. Non ci credo che sono l'unico a sentire quell'odore.\n\nScusate lo sfogo purtroppo non posso staccarmi il naso....",
        "upvotes": 16,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1onipss/non_ce_la_faccio_è_insopportabile/"
    },
    {
        "id": "1oo1om0",
        "author": "Floofs-In-Space",
        "title": "Optional coperto?",
        "content": "I go to an all-you-can-eat sushi place. Although some folks order with a paper and pen, most use the app. \n\nOn the app, there's an option for coperto. I think it's 2 euros. \n\nIs this a way to \"tip\" the staff? But it's optional?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oo1om0/optional_coperto/"
    },
    {
        "id": "1onrlfl",
        "author": "Abject-Analysis-4179",
        "title": "Capodanno a Torino: cercasi idee non banali",
        "content": "Ciao r/Torino!  \nSto cercando idee per Capodanno in città. Qualcosa di carino ma non da ipotecare un rene.  \nE soprattutto, vorrei evitare sia il “cenone infinito con parenti di terzo grado”, sia la discoteca da 120 dB dove si perde la voce dopo dieci minuti.\n\nQualcuno ha dritte su eventi, locali, serate, o anche cose alternative (tipo concerti, karaoke, posti all’aperto, cene tranquille ma non noiose)?  \nInsomma: qualsiasi modo decente per salutare l’anno nuovo senza finire a guardare il concerto in tv con lo spumante Lidl.\n\nGrazie in anticipo a chi mi darà qualche spunto!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1onrlfl/capodanno_a_torino_cercasi_idee_non_banali/"
    },
    {
        "id": "1oni1ls",
        "author": "Mindless_Debate2559",
        "title": "Dating women in Turin",
        "content": "Hello all, I am a dude 35 (RO). I was living in Denmark for the last 10 years moved to Turin 2 years ago, but my dating live is 0. I tried tinder (not a chance) also BOO (still not a change) and I don't know where I could meet women. Also I am a bit introverted and shy until I get comfy with people, which also dosen't help. So any advice where I could find a partner in my 35's since I am completley lost at the dating scene/game?",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1oni1ls/dating_women_in_turin/"
    },
    {
        "id": "1onpn6z",
        "author": "liborio_01",
        "title": "Cerco lavoro!",
        "content": "Ciao a tutti, sono un ragazzo di 24 anni con diploma scienze umane. Ho fatto un po' di esperienze lavorative ma tutte piuttosto brevi, anche se la più lunga è con un'assicurazione.\n\nStavo cercando un nuovo lavoro a Torino, tutto va bene basta che non abbia la necessità della partita iva.\nGrazie a chi risponderà.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1onpn6z/cerco_lavoro/"
    },
    {
        "id": "1onmyr0",
        "author": "Minute_Personality79",
        "title": "Cerco lavoro a Torino",
        "content": "Ciao a tutti, sono una neolaureata di 23 anni in filosofia magistrale: ora sto cercando lavoro a Torino, senza pretese particolari di ambiti. Sono disponibile anche per lezioni di inglese e come per Sitter, qualcuno di voi mi sa consigliare qualche posto che cerca personale o sito particolarmente utile?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1onmyr0/cerco_lavoro_a_torino/"
    },
    {
        "id": "1ona8g8",
        "author": "PisicaIntergalactica",
        "title": "Disabile seviziato nella notte di Halloween: la procura procede per sequestro e violenza",
        "content": "Ma cosa sta succedendo? Questa notizia mi ha spezzata in due. ",
        "upvotes": 9,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TcIbwq8NLht6Xj1IScNYj_IIM1YSIr7gjzWo5qmB04k.jpeg?auto=webp&amp;s=85728f4cfef38bbfb3915496b5e511242a299ec0"
        },
        "permalink": "/r/torino/comments/1ona8g8/disabile_seviziato_nella_notte_di_halloween_la/"
    },
    {
        "id": "1onme6a",
        "author": "7pm-11pm",
        "title": "automotive deisgn portfolio request",
        "content": "hello, I was wondering if any of you, car designers, could send me a reference to your portfolios you submitted for going to uni? I want to go to the Turin IED automotive deisgn university in turin, so I'm not aware of how good my portfolio must look, and I couldnt find any before-university portfolios online...\nthank you",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1onme6a/automotive_deisgn_portfolio_request/"
    },
    {
        "id": "1on6dsj",
        "author": "SteamPaz",
        "title": "La Luna e la Sinagoga",
        "content": "\"Custos, quid de nocte?\" (Nov. 3, 2025)\n\nBACKGROUND\nISO100, 180mm f/4.5, 1/1000s\n\nFOREGROUND (Sinagoga di Torino)\nISO800, 180mm f/4.5, 60s",
        "upvotes": 16,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/22m9h26l50zf1.jpeg?auto=webp&amp;s=83d93ff2b736b157095ce59099e1ca96de39fbc9"
        },
        "permalink": "/r/torino/comments/1on6dsj/la_luna_e_la_sinagoga/"
    },
    {
        "id": "1onqsic",
        "author": "ChocolateSprinkles7",
        "title": "Where to find Healthy snacks",
        "content": "Hey ya'll, I'm new to town and I've been looking for healthy snacks, like some healthy biscuits or salted snacks, but I failed to find any, if there's specific type or brands that your recommended Please let me know ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1onqsic/where_to_find_healthy_snacks/"
    },
    {
        "id": "1oncfoc",
        "author": "mrs_beat_10",
        "title": "C2C Festival Turin ...seriously?",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oncfoc/c2c_festival_turin_seriously/"
    },
    {
        "id": "1onpmgp",
        "author": "Forward_Sherbert4650",
        "title": "Help to find bulk tobacco",
        "content": "My buddy studies in Turin and is struggling to find a place to buy tobacco in bulk. He normally makes his own cigarettes with tubes, and the biggest pack he could find is 50 grams. He’s looking like 250 grams plus. Please let me know where he could find larger quantities. Thank you!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1onpmgp/help_to_find_bulk_tobacco/"
    },
    {
        "id": "1onpad5",
        "author": "cicciograziani69",
        "title": "Affitti",
        "content": "Buonasera ragazzi, a breve devo trasferirmi a torino e sto cercando casa. La sede di lavoro è ad  Orbassano, mi sapreste consigliare zone dove cercare casa? Possibilmente che non siano tanto lontane/incasinate col traffico e dove è facile trovare parcheggio, spero di non essere troppo pretenzioso.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1onpad5/affitti/"
    },
    {
        "id": "1ongd7s",
        "author": "FutureVirtual6811",
        "title": "Questura email",
        "content": "Guys anybody can help about the questura email? I couldn’t find it. And is there a dedicsted email for immigration office of the questura?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ongd7s/questura_email/"
    }
]