[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 510,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 16,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kaqv79",
        "author": "Somethingman_121224",
        "title": "Netflix Releases Full Trailer for Upcoming Slasher, 'Fear Street: Prom Queen'",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kaqv79/netflix_releases_full_trailer_for_upcoming/"
    },
    {
        "id": "1kagcp4",
        "author": "ElectronicSpeed3785",
        "title": "Suggest me a movie on Netflix right now!!!!",
        "content": "Hi everyone! I'm in the mood to watch a really good psychological thriller with lots of suspense, mind games, and unexpected twists. Something that keeps you guessing until the very end and leaves you thinking afterward. Preferably available on Netflix. It could be intense, disturbing, emotional, or slow-burn — I'm open to anything as long as it messes with your mind and keeps the tension high. I'd love some recommendations from you all! Thanks in advance!",
        "upvotes": 62,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1kagcp4/suggest_me_a_movie_on_netflix_right_now/"
    },
    {
        "id": "1k9y0cj",
        "author": "theipaper",
        "title": "TV is better with subtitles - whether you need them or not",
        "content": "",
        "upvotes": 307,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1k9y0cj/tv_is_better_with_subtitles_whether_you_need_them/"
    },
    {
        "id": "1kaigcq",
        "author": "j-pop97",
        "title": "Why does Netflix use filter on female actors' faces?",
        "content": "Watching the latest season of You (no spoilers thank you), and I'm noticing they use some kind of blurring filter on the female characters but not the male characters, at least not as much. Is this of the request from the actresses ,or is this purely editors/Netflix choice?",
        "upvotes": 8,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kaigcq/why_does_netflix_use_filter_on_female_actors_faces/"
    },
    {
        "id": "1kal5o5",
        "author": "Robinshadow91",
        "title": "I just watched manifest, and i'm blown away",
        "content": "This serie is probably the only series that made me watch with full dopamine the entire time.\n\nThe story was so good, and i wish they continued with it, but obviously nothing goes forever.\n\nBut it's all connected! :) ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1kal5o5/i_just_watched_manifest_and_im_blown_away/"
    },
    {
        "id": "1kaaqhz",
        "author": "United_Credit_6264",
        "title": "You series/Bronte character question",
        "content": "Just to be clear, there will be spoilers if you have not watched season five episode seven and so on.\n\nAnd before I get to the spoilers, can I just ask has anyone been bored with this last season? Every other season I have stayed very interested but this time around I get easily distracted and want to stop watching. Am I the only one?\n\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n\nSPOILER ALERT\n‼️\n\nSo Brontë doesn’t know that Joe killed her friend Beck?!!!!!!? Like I’m so confused. How does she still not know it was him…….?",
        "upvotes": 17,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kaaqhz/you_seriesbronte_character_question/"
    },
    {
        "id": "1k9qon6",
        "author": "usmannaeem",
        "title": "There should be an option to completely remove a title that I am never going to watch.",
        "content": "There is only an option to hide a title but then, still Netflix will recommend titles similar to it as well. Would be nice if Netflix allowed me to completely remove a title that is never to be seen again and therefore the algorithm will never recommend something like it either.",
        "upvotes": 286,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1k9qon6/there_should_be_an_option_to_completely_remove_a/"
    },
    {
        "id": "1kaowve",
        "author": "BunyipPouch",
        "title": "Scott Mann, the director of 2022 survival-thriller FALL, which was a huge hit on Netflix and resulted in two announced sequels, is doing an AMA/Q&amp;A in /r/movies today for anyone interested. It's live now, with answers at 4 PM ET.",
        "content": "Scott Mann, the director of 2022 survival-thriller FALL, which was a huge hit on Netflix and resulted in two announced sequels, is doing an AMA/Q&amp;A in /r/movies today for anyone interested. It's live now, with answers at 4 PM ET.\n\nIt's live here now for anyone interested:\n\nhttps://www.reddit.com/r/movies/comments/1kanxim/hey_rmovies_im_scott_mann_director_writer_and/\n\nThey'll be back at 4 PM ET to answer questions. Any question/comment is much appreciated.\n\nVerification photo:\n\nhttps://i.imgur.com/qOJYP9k.png",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kaowve/scott_mann_the_director_of_2022_survivalthriller/"
    },
    {
        "id": "1kamd34",
        "author": "HorseshoeOverlook2",
        "title": "you ahead to be using a proxy... On one profile only?",
        "content": "Over the weekend I was watching a series and as it rolled over from one episode to the next, Netflix stopped playing and provided an error message saying \"You appear to be using a proxy...\", you know the rest. \n\nIt's been that way ever since, on my profile only. My wife can watch whatever she wants with no error message but I can't watch a thing, on the same device. \n\nAny thoughts as to why this is happening on one profile and not another in the same account?\n\nAny idea how to fix it? (Not workaround or bypass but FIX)?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kamd34/you_ahead_to_be_using_a_proxy_on_one_profile_only/"
    },
    {
        "id": "1kahpw9",
        "author": "WildAutonomy",
        "title": "What It Was Like Dubbing Squid Game S2: Voice Actor's Perspective",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kahpw9/what_it_was_like_dubbing_squid_game_s2_voice/"
    },
    {
        "id": "1kagesq",
        "author": "Adventurous-Tea-9460",
        "title": "Will changing my billing country cause the sharing rule to kick in?",
        "content": "A few years ago, I moved back to the US. I was living in the UK and that's where I created my Netflix account. I never got around to change the country so I still get billed in pounds. I have premium and I currently pay £18.99. According to the Netflix website, I need to cancel my account, wait till the end of my billing period, then restart my account. A few years ago, Netflix introduced the extra members fee where anyone outside your household has to pay for Netflix or something along those lines. As far as I can tell, this never took affect for me. I have friends in other countries, who use my account with no issues. And I'm still able to use it when I travel and stuff. Maybe I don't understand how it's supposed to work but if I change my billing country, will it mess everything up for me? Will other people outside my household get kicked off my account? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kagesq/will_changing_my_billing_country_cause_the/"
    },
    {
        "id": "1kapmjn",
        "author": "GalicDr",
        "title": "Glitching on PC",
        "content": "Having issues while watching on PC, gets way worse than example given in video. ",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ls1pd3obdsxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kapmjn/glitching_on_pc/"
    },
    {
        "id": "1kai6i5",
        "author": "Jules1864",
        "title": "Account accessed in radom American cities??",
        "content": "This is the decond time I've had to change my password because I got three simultaneous emails from Netflix saying my account was accessed by a new device, each email with an  American location (one California and the other two Illinois).\n\nI know the location isn't always accurate, but I live in the UK, so there's no chance it was me or another member of my household. \n\nWhat's going on? Has this happened to anyone else? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kai6i5/account_accessed_in_radom_american_cities/"
    },
    {
        "id": "1kaj40w",
        "author": "HamsterOk3112",
        "title": "Paid for 4k plan and still can't watch it on Edge browser.",
        "content": "Guys, please help me this driving me crazy.\n\n**1. My 4K monitor supports HDCP 2.3**\n\nThe LG 32GS95UE-B gaming monitor supports HDCP 2.3 on both its HDMI and DisplayPort connections, according to [the LG Electronics website](https://www.lg.com/us/monitors/lg-32gs95ue-b-gaming-monitor). Here's a breakdown of the HDCP support: \n\n* HDMI (HDCP Version): 2.3\n* DisplayPort (HDCP Version): 2.3\n\n  \n**2. I do have AMD RX 9070 and it supports HDCP 2.3**\n\nThe RX 9070 series cards support HDCP 2.3, the latest version of HDCP, through their HDMI 2.1b and DisplayPort 2.1a connections.\n\n**3. I do have 4k Netflix Plan.**\n\nhttps://preview.redd.it/u1c3kpbvjqxe1.png?width=1222&amp;format=png&amp;auto=webp&amp;s=65d368177ecdfce23f9d8098130e466327496a99\n\n**4. I bought HEVC Codec from Microsoft App Store for $0.99**\n\nhttps://preview.redd.it/guw2ckt0kqxe1.png?width=897&amp;format=png&amp;auto=webp&amp;s=25bcb63d3a1a2da44567b248690caa486160ac40\n\n**5. AND Netflix won't enable 4k for me**\n\nhttps://preview.redd.it/xsjl3vqakqxe1.png?width=948&amp;format=png&amp;auto=webp&amp;s=bd72127c2b3ead45729c7cdbb6edfdbaf1e94e81\n\nPLEASE HELP!!!!!!!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kaj40w/paid_for_4k_plan_and_still_cant_watch_it_on_edge/"
    },
    {
        "id": "1kaf83z",
        "author": "SelfAmbitious",
        "title": "CHOICES HAVE CONSEQUENCES TOO! Wwe Raw Review (29/4/25)",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kaf83z/choices_have_consequences_too_wwe_raw_review_29425/"
    },
    {
        "id": "1kaf36c",
        "author": "PrettyGirlChaz431",
        "title": "Black Mirror Season 7",
        "content": "So I found out about a week late that there was a new season of black mirror and I just finished the first episode recently and onto the 2nd one but how did everyone feel about this season without spoilers? I remember reading on Twitter that people weren't happy about season 6 except for maybe one or two episodes. ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kaf36c/black_mirror_season_7/"
    },
    {
        "id": "1kapq8b",
        "author": "MedianNameHere",
        "title": "$300 for 4k after 12Y bye",
        "content": "First time canceling Netflix, member since 2013 on this account used to get mail ordered games and movies. HOW is Netflix $300( 216 for base). \n\nUsed to use to watch a ton, never really questioned the price. Once I finally got a 4k tv last year upgraded to 4k and damn it looks good but how can I justify $300. If this was sitting in Fidelity at %4 annual return for 10 years that's $3300 principal and $745.91 in interest. Is Netflix worth $4,045.91?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kapq8b/300_for_4k_after_12y_bye/"
    },
    {
        "id": "1kadwdf",
        "author": "DaddyyBlue",
        "title": "The Residence, E6 - who’s the young woman in the jungle?",
        "content": "I’m curious who the actress is because she looks familiar. In episode 6, The Third Man, she’s in the very first scene. Shes the one who comes to deliver the stuff to Cordelia in her birdwatching treehouse. I tried googling and I couldn’t find anything.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kadwdf/the_residence_e6_whos_the_young_woman_in_the/"
    },
    {
        "id": "1kadm92",
        "author": "Dragon-_-Lady",
        "title": "Help with Netflix Error 5.7.6",
        "content": "One night I can set my timer app to play a series to fall asleep to on Netflix and the next night it opens Netflix but no videos will play and I get this error. I've cleared the cache on my phone for Netflix, I've restarted my phone, and just now I un-installed Netflix and reinstalled it and still no videos will play. And yes, my phone has the latest update. I've done nothing different with my phone. Netflix plays fine on my TV. Any ideas or help would be most appreciated, thanks! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kadm92/help_with_netflix_error_576/"
    },
    {
        "id": "1kad8is",
        "author": "Pitiful_Shoulder8880",
        "title": "Anyone want to watch some Netflix together?",
        "content": "Just looking for a friend to watch stuff with! Currently in the mood to rewatch Black Mirror, You, The Office, Friends, or even movies (horror, actions). PM me :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kad8is/anyone_want_to_watch_some_netflix_together/"
    },
    {
        "id": "1kap3o3",
        "author": "TornSphinctor",
        "title": "Netflix has adds now",
        "content": "I'm in Aus, I barely use my account. But keep it as it has been convenient at times. Last weekend I wanted to watch a bit of TV. Apparently Netflix has adds now and has for months. I don't watch it enough to warrant paying more. nor do I want to pay for a service and receive adds. So I'm cancelling my subscription.",
        "upvotes": 0,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1kap3o3/netflix_has_adds_now/"
    },
    {
        "id": "1kajtbh",
        "author": "dailystar_news",
        "title": "Netflix viewers have same complaint about Tom Hardy flick as they spot 'problem'",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kajtbh/netflix_viewers_have_same_complaint_about_tom/"
    },
    {
        "id": "1k9zdht",
        "author": "StardewValleyTrash",
        "title": "Anyone else?",
        "content": "Anyone else’s Netflix continuously crashing? This is the 2nd day in a row it keeps crashing on my TV. I know earlier this week it was down for a bit, but this is getting ridiculous. It’ll be fine for like 20 minutes then crash over and over. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9zdht/anyone_else/"
    },
    {
        "id": "1ka0vep",
        "author": "Somethingman_121224",
        "title": "Alice Osman Teases 'Heartstopper' Volume 6 and Finale Movie",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ka0vep/alice_osman_teases_heartstopper_volume_6_and/"
    },
    {
        "id": "1k9huca",
        "author": "Active_Taste9341",
        "title": "I loved Yellowstone and really wanted to like Ransom Canyon, but half of the series makes no sense - straight up stupid",
        "content": "theres barely going on anything along the whole season, but some things just made me frown:\n\n1: Lauren at the Football match realizing her bf not showing up - sad face. five minutes later Lucas shows up (as expected) and she get distracted so much she fails standing on a pyramid?\n\n2: Quinn doesnt seem like that stupid signing any contract without reading. austin water demanding money back (in absurd short time of 1 week) for something obviously never existed any kind of contract\n\n3: getting Staten proven of unaccountable for hitting someone in the face once for getting provoked under witnesses makes zero sense.\n\n\nand many more i won't waste time writing down.\n\nwhat are your thoughts?",
        "upvotes": 35,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1k9huca/i_loved_yellowstone_and_really_wanted_to_like/"
    },
    {
        "id": "1k9ppps",
        "author": "SillyFlyGuy",
        "title": "Murder at Yellowstone City",
        "content": "Number 4 in US movies today. \n\nExcellent casting and acting, great sets and world building, some fascinating characters, interesting plot setup, decent twist..\n\nThen everybody just starts shooting everybody else. Ugh, what a letdown.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9ppps/murder_at_yellowstone_city/"
    },
    {
        "id": "1k9q7jv",
        "author": "S4v1r1enCh0r4k",
        "title": "What’s Coming to Netflix in May 2025: New Releases and Fan Favorites",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9q7jv/whats_coming_to_netflix_in_may_2025_new_releases/"
    },
    {
        "id": "1k9oc2j",
        "author": "Outrageous-Dog-7249",
        "title": "Series recommendation",
        "content": "Pls recommend me a series which is not very attention grabbing (ie:thriller) and can watch while doing some other work as i am doing an internship where mostly i have to work on a computer so i can watch smth on the side, 1 ep shouldn’t be an hour long, most recommend are sitcoms and yes before you recommend me all the sitcoms i have watched friends, the big band theory, young Sheldon, the office, broklyn 99, two broke girls so pls recommend me smth new ",
        "upvotes": 7,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1k9oc2j/series_recommendation/"
    },
    {
        "id": "1k9y4u1",
        "author": "trevorandcletus",
        "title": "Can your tv influence your netflix experience much?",
        "content": "I have 2 available devices, with others being smartphones. My awol ltv 3500 provides clear vibrant visuals, whatever I am watching. On the other hand, I have been having issues with my Lg.                                                                        The settings are all off, can you tell me how to get similar visuals? The Lg in question is a bit old, like I got it back in 2016. Could that be the reason that I am not getting good visuals?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k9y4u1/can_your_tv_influence_your_netflix_experience_much/"
    },
    {
        "id": "1kacu39",
        "author": "DisneyPrincess1992",
        "title": "Netflix double charged me for 3 months",
        "content": "This admittedly happened around about 18 months ago but wanted to let people know if you were looking into Netflix, and or vent incase this happened to you as well.\n\nMy PayPal notified me that my Netflix subscription charge had gone through and I was surprised cuz my card had been charged earlier that week for the same subscription.  I looked over my PayPal account to realize they had been charging me for 3 months previously while also charging my card days before. I called Netflix to ask why this had happened. Got nowhere. Basically they told me that couldn’t have possibly happened because they could see only one account under my information and that account charged my card not PayPal.\n\nI admittedly was not in the best mood and told them to cancel my account. They did and then discovered the second account and the reason I was being overcharged. The CSA admitted that they had never seen a double account with the same information including the same login but told me that I had to get refunded by my card and or PayPal.\n\nI laughed and said “I’m not hanging up with you until you tell me both accounts are canceled.” They canceled the second account while trying to convince me to stay with the service. “I’ll stay if you give me 3 months of free Netflix” “I’m very sorry miss that’s not something we are authorized to do”\n\nAs you can imagine I have not given Netflix a $1 since then but exactly one year later I see a charge on my card for Netflix and I call my bank they saw the charge and also the immediate refund of that charge that hadn’t been processed yet when I started the call to them. They asked if there was something else they could do for me and I said yes “have any other Netflix charges on the account that may come after this flagged as fraud please.” They were more than happy to do that.\n\nSo here I am 18 months later with no Netflix and happier for it. Till they give me 3 free months I won’t be coming back.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kacu39/netflix_double_charged_me_for_3_months/"
    }
]