[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 677,
        "comments": 5043,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1noosxn",
        "author": "borderlineactivity",
        "title": "DARK",
        "content": "I can’t believe I slept in this absolute piece of art for SO long. Best show I have seen in a loooong time. If you haven’t watched it yet; you are definitely missing out! \n\n\n",
        "upvotes": 135,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1noosxn/dark/"
    },
    {
        "id": "1noo4wa",
        "author": "peoplemagazine",
        "title": "Animal Handler Linked to Tiger King's Joe Exotic Was Killed by Tiger in Front of His Wife and Daughter: Sheriff",
        "content": "",
        "upvotes": 81,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1noo4wa/animal_handler_linked_to_tiger_kings_joe_exotic/"
    },
    {
        "id": "1noqv2x",
        "author": "Sea-Procedure-7988",
        "title": "True crime psychological thriller",
        "content": "Hello, I’m looking for a tv series to get into, something that will hook me and keep me wanting more. I enjoy shows where it’s not obvious who committed the crime, etc. also please nothing tooo old or outdated :)\n\nHere’s a list of some of my favorite tv series: the sinner \nPresumed innocent \nUnbelievable \nAnimal kingdom \nOzark \nBlood lines \nHunting wives \nThe keeper \nKaren read trial \nMind hunter \nHeist \nThe program \nHe’ll camp \nMr robot \nUntamed \nBehind her eyes \nDexter \nBreaking bad \nYour honor \nSeven seconds \nThe infiltrator \nThe night of \nAmerican nightmare \nAccused \nWorst roommate ever \nLincoln lawyer \nYou \nMaid \nTell me lies \nPainkiller \nMaking a murder \nGinny &amp; Georgia \nSurviving black hawk down",
        "upvotes": 35,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1noqv2x/true_crime_psychological_thriller/"
    },
    {
        "id": "1notdw9",
        "author": "SerialSeriesQueen",
        "title": "Black Rabbit and the restaurant business",
        "content": "Black Rabbit did a phenomenal job at portraying life in a big city restaurant, especially its seedy underbelly. I grew up in Philadelphia with a step dad who owned multiple successful restaurants in the city and Jake reminded me so much of him as he was in the early 2000s. Charming, charismatic, ambitious but underneath, stressed out, under pressure, and constantly worrying about money trying to keep up appearances. Even the staff brought back early memories of my life as a hostess/bartender at some of those restaurants/nightclubs. Very close, very tight knit, but riddled with drug use and drama, and overlooking major red flags. I really appreciated the effort they went through in giving the viewer a realistic representation of that world. ",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1notdw9/black_rabbit_and_the_restaurant_business/"
    },
    {
        "id": "1noe0i1",
        "author": "GalacticGazelle49",
        "title": "Coded Bias on Netflix made me rethink how much we can really trust AI with anything",
        "content": "Watched Coded Bias recently and it raised some serious concerns. The documentary dives into how facial recognition and AI systems aren’t actually neutral at all. Because they’re trained on flawed datasets, they end up making mistakes that disproportionately affect women and people of color.\n\nThe unsettling part is how widely this technology is already being deployed in policing, workplaces, schools, even housing, often without the public really knowing or having much of a say. If these systems are already showing bias, what happens when they become a permanent part of everyday life? AI is often framed as being smarter and more objective than humans, but if it’s just reinforcing the same prejudices at scale, is it really progress? At what point do we step back and question whether some decisions, especially around law enforcement and surveillance, should even be left to algorithms at all?\n\nFor anyone who’s seen it or works with AI, do you think these are just early flaws that can be fixed with better design and regulation, or are we headed toward a future where algorithms quietly shape more of our lives than we realize?",
        "upvotes": 52,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1noe0i1/coded_bias_on_netflix_made_me_rethink_how_much_we/"
    },
    {
        "id": "1notcp3",
        "author": "RockStars007",
        "title": "Jude Law...Jake and Rory",
        "content": "  \nHe brilliantly plays roles that start like a normal dude, slightly off but not completely damaged beyond imagination and you can't put your finger on it exactly. And then he disintegrates into an empty shell with zero substance.\n\nJake reminded me of Rory in The Nest. Rory is able to get people to think it will work out, and as an observer, you think there is no way this is going to work out.\n\nReally great acting.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1notcp3/jude_lawjake_and_rory/"
    },
    {
        "id": "1norp5o",
        "author": "moon-1992",
        "title": "Similar shows to Haunted hotel?",
        "content": "Out of work tiredness  I started haunted hotel today because I just needed something to relax and I just can’t stop watching it. Oh my god I love it, especially Abbadon is my favorite. Never watched Rick and Morty, does it have the same vibe or is it weirder? Do you know similar show with similar humor? It doesn’t matter if it’s animated or not.  ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1norp5o/similar_shows_to_haunted_hotel/"
    },
    {
        "id": "1noinq8",
        "author": "Infinite_Pool_4918",
        "title": "Black rabbit",
        "content": "This show kinda fucked me up lol. It was a great one but ending is giving me so much melancholy. Jack and Vince’s relationship reminds me of the one between my ex and I. And I’m jack.",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1noinq8/black_rabbit/"
    },
    {
        "id": "1nosmf8",
        "author": "roxxy_287",
        "title": "Any suggestions with similarities of Beef?",
        "content": "Just finished Beef and loved it. Is there anything else similar to it?\n\nI watched and liked Baby Reindeer, that's similar. So something like that?\n\nThanks!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nosmf8/any_suggestions_with_similarities_of_beef/"
    },
    {
        "id": "1noh5t1",
        "author": "Areyouforeall",
        "title": "Netflix basic plan vs standard plan",
        "content": "I recently received a new email from Netflix saying that my basic plan that has recently gone up from 7.99 euros per month to 9.99 euros per month has been discontinued.\n\nNetflix inform me that my new plan, called standard plan is 13.99 euros per month.\n\nI quote the email :\n\n'What you need to know:\nYour Basic plan is being discontinued, and your new EUR 13.99 Standard plan automatically begins November 8.\nYour new plan includes:\n•\t\nBetter video quality: Stream in Full HD (1080p).'\n\n-------------------\n\nI already received pretty accurate viewing with the basic plan...\nWhat are these Netflix people on about? \nIt feels kind of crazy. \n\nIt just seems like inflation and not much else. ",
        "upvotes": 5,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1noh5t1/netflix_basic_plan_vs_standard_plan/"
    },
    {
        "id": "1noszz2",
        "author": "flippiethehippie420",
        "title": "Weird cut in a netflix movie called 'Banden von Marseille' (Gangs of Marseille)",
        "content": "Honestly dont know wich flair this is, there was none applicable.  Anyways, never seen this kind of a mistake wich is obviously one in the post production ",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lx2oskzu8zqf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1noszz2/weird_cut_in_a_netflix_movie_called_banden_von/"
    },
    {
        "id": "1noezwi",
        "author": "SplitNational2929",
        "title": "Producer Mark Ronson is Composing Greta Gerwig’s Netflix Narnia Movies",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1noezwi/producer_mark_ronson_is_composing_greta_gerwigs/"
    },
    {
        "id": "1nn8wrx",
        "author": "iSwaggyP",
        "title": "They are joking right?",
        "content": "This shit made me cancel. How many more subscribers do you think they are going to lose because of this? I’m officially done with this disgrace of a streaming app  ",
        "upvotes": 1173,
        "comments": 370,
        "media": null,
        "permalink": "/r/netflix/comments/1nn8wrx/they_are_joking_right/"
    },
    {
        "id": "1nohxif",
        "author": "Ill-Shame-4663",
        "title": "Kpop demon hunters dub",
        "content": "So i have searched a long long time but i cant find who voiced the korean dub and i ask that because the original voice actors are korean so did they or did they not voice the dub",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nohxif/kpop_demon_hunters_dub/"
    },
    {
        "id": "1no5nhg",
        "author": "Peppermint07_",
        "title": "Black Rabbit - question about plot",
        "content": "In one scene, detective Seung mentions to her partner or someone that they found the watch box inside her (Anna Dixon) closet. What watch box? Junior left Vince’s fake watch there, how come a watch box also shows up there? Can anybody explain? Thanks in advance!",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no5nhg/black_rabbit_question_about_plot/"
    },
    {
        "id": "1no3lhi",
        "author": "hurricanescout",
        "title": "Billionaires bunker",
        "content": "Starting a thread for the hatewatch. I can’t get over how BAD it is. Like it had potential: they could’ve had romance between the ppl working there and the billionaires. They could’ve had multiple attempts to scam the different billionaires out of their money. They could’ve actually had some dramatic tension of folks figuring it out, trying to escape, an actual uprising. Folks on the outside could’ve figured it all out and it turns into a hostage negotiation without the billionaires knowing they were hostages. Instead other than them actually getting them in to the bunker, I’m in episode 8 and there’s been more action in an hour of my abuela’s daily telenovela. Not to mention dead lesbian syndrome within an hour of her appearing, and some casual antisemitism (come on, the wealthiest most evil billionaire just happens to be Jewish and he’s the only one whose religion or ethnicity is mentioned? 🙄🤦‍♀️). I’m not even getting to the plot holes. So yeah. Feel free to pile on: worst thing I’ve seen since Berlin came out. Guys, Money Heist was great. But that was your one great idea. Let it go. ",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1no3lhi/billionaires_bunker/"
    },
    {
        "id": "1nnvai0",
        "author": "Monkeyallens",
        "title": "Black Rabbit is too Dark",
        "content": "It was worth binge watching, great acting, story was OK and it kept you interested. It was just too dark. I really wish they lightened it up a bit, it would be more enjoyable to watch. ",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nnvai0/black_rabbit_is_too_dark/"
    },
    {
        "id": "1nnzy6i",
        "author": "golosee",
        "title": "Haunted Hotel Nathan",
        "content": "Am I the only one that can’t stop thinking about Nathan??? He broke my heart and the relationship he has with Katherine is so touching! I hate growing attached to characters this quickly (especially if they’re from an animated Netflix show) but I really do love that character. I NEED to see how he develops…",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nnzy6i/haunted_hotel_nathan/"
    },
    {
        "id": "1noj73r",
        "author": "No-Advantage4069",
        "title": "Why are the ice road and ice road vengeance rated so poorly on imdb when they are really good?",
        "content": "like they are even in the top ten on netflix why are they rated so poorly on imdb? im just curious i have seen worse movies in my life and they got better ratings on imdb what's going on exactly?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1noj73r/why_are_the_ice_road_and_ice_road_vengeance_rated/"
    },
    {
        "id": "1no3ph5",
        "author": "pinkyepsilon",
        "title": "Isn’t Black Rabbit a retelling of Othello?",
        "content": "While not direct, I see the psychological manipulation, trauma, and unraveling of the characters an interesting retelling of Othello with these similar themes?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no3ph5/isnt_black_rabbit_a_retelling_of_othello/"
    },
    {
        "id": "1no29du",
        "author": "babtundeog",
        "title": "Why do I still see ads",
        "content": "I have the standard package which doesn't include ads. However when watching a live event,im getting ad breaks on my laptop and my tv. This doesn't happen on my phone though. Is there a specific reason for it, or is it an app issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no29du/why_do_i_still_see_ads/"
    },
    {
        "id": "1nnlqvr",
        "author": "Aggravating-Big-6248",
        "title": "Can we talk about Billionaires' Bunker?",
        "content": "So, can we talk about *Billionaires' Bunker*? I’m kinda pissed about how it ended. I hate finales like that – they could’ve at least given us one more episode. Obviously I went straight to Google to check if season 2 is coming.\n\nI *do* love this type of show – kind of a mix between *Fallout* and *Silo*, but with a melodrama twist. Still, I’m torn. It got so over the top at times that it lost all sense of authenticity, and some of the relationships really started to bug me.\n\nAnd don’t even get me started on Guillermo Falcón and all his endless affairs… that got exhausting real fast.\n\nI don’t even know how to fully put my feelings into words yet, which is why I’m curious what you all thought.",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlqvr/can_we_talk_about_billionaires_bunker/"
    },
    {
        "id": "1no0rii",
        "author": "Just-Professional667",
        "title": "Help me find this show/movie??",
        "content": "A few years ago I remember watching this show or movie. It had to have been a short one season show I know that. All I can remember about the general premise is that a woman wanted a man who was married. She was wealthier and all I know the show was dark and mysterious 💀send help please. I can’t remember if she hurt the wife or something but somehow he was manipulated into sleeping w her or something? \n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1no0rii/help_me_find_this_showmovie/"
    },
    {
        "id": "1nndyfm",
        "author": "TransmanLSD",
        "title": "i need a show to watch where i’m not going to want to pause it",
        "content": "i need a show to binge that’s really good. i like psychological, teen drama, supernatural (vampires preferably)\ni also enjoy cop/detective shows. \nrecent ones i binged and finished:\n- The Bates motel\n- beauty in black \n- Adolescence \n- Your Honor\ni’ve also enjoyed LOST and TWD\n",
        "upvotes": 47,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1nndyfm/i_need_a_show_to_watch_where_im_not_going_to_want/"
    },
    {
        "id": "1no9423",
        "author": "cmatty12",
        "title": "Why did Vince go to the same fence that junior setup?",
        "content": "I just finished *Black Rabbit*. What an amazing and intense show.\n\nSomething that doesn’t make sense to me though is the ending. **Spoilers ahead — stop reading if you haven’t finished.**\n\nAt the end, Junior forces Vince to rob the Black Rabbit with him. Since Vince was masked, no one knew who the second gunman was. Later, Vince kills Junior to save his brother Jake, which obviously puts him on a collision course with Junior’s father.\n\nHere’s my confusion: why on earth does Vince go to the *same fence* that Junior was planning to use? By doing that, he exposes his identity. Junior’s father learns exactly who he is, and it puts everyone in danger.\n\nIf Vince had just stayed away, no one would have ever been able to confirm for sure that he was the other shooter. Going to the fence with the jewels was basically like announcing, “Yes, I was the second robber.”\n\nAm I missing something here? Was there a reason he *had* to go to that fence, or is this just a plot hole?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1no9423/why_did_vince_go_to_the_same_fence_that_junior/"
    },
    {
        "id": "1no2rya",
        "author": "chloe-decker666",
        "title": "I’m so confused",
        "content": "Ok so I have Netflix (obviously) and it’s doing this weird thing where if I try to watch it on my tv it changes my icon and there are shows that are no longer there that should be like supernatural I was watching it and now it’s just disappeared off of my tv Netflix but it’s still there on my phone. What is wrong with it and how can I fix it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1no2rya/im_so_confused/"
    },
    {
        "id": "1nnwhpa",
        "author": "[deleted]",
        "title": "Series like Top Boy?",
        "content": "I'm currently watching Top Boy for the second time in my life and it's still as enjoyable as ever, however I would love to see a new series. Any suggestions?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nnwhpa/series_like_top_boy/"
    },
    {
        "id": "1nnx22g",
        "author": "Mediocre-Fan-495",
        "title": "Jamie's sweater in Adolescence Ep.1",
        "content": "When Jamie had to change his clothes at the station, I swear the sweater looks like it's on backwards.  Way too high on the neck in the front and lower in the back.  I noticed it immediately and it was bothering me the rest of the episode.\n\nAnyone else catch that?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nnx22g/jamies_sweater_in_adolescence_ep1/"
    },
    {
        "id": "1nnlie0",
        "author": "Less-Information-463",
        "title": "Low quality movies",
        "content": "Like the title says, some movies, or shows, just have bad quality. I watched Sisu, Becoming Led zeppelin and The darkest hour, all of them have low resolution, even on the phone. But other movies have great resolution. Am I the problem or Netflix?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlie0/low_quality_movies/"
    },
    {
        "id": "1nmsohn",
        "author": "HushedCamel",
        "title": "Is there a way to stop shows you've already watched being suggested?",
        "content": "As the title says.  Half the suggestions are movies and tv series I've just watched - I want fresh things!\n\nALSO, is there a way to block certain genres being suggested?  I watch mostly English and Korean language shows/movies... but now I'm getting constant suggestions for Indian things which I have 0 interest in.  Is there a settings function I'm missing?",
        "upvotes": 115,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1nmsohn/is_there_a_way_to_stop_shows_youve_already/"
    }
]