[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p6c1kj",
        "author": "bohnonlosoahahahah",
        "title": "Incroci di merda (aiuto)",
        "content": "Allora. Voi dovete aiutarmi a capire che cazzo è successo/come devo comportarmi la prossima volta.\n\n  \nLa situazione è questa: è la prima volta che mi immer~~d~~**g**o nel pieno della contorta viabilità di Torino. Come in foto, mi trovo su corso Vittorio Emanuele II, all'incrocio con via Cesana. Voglio svoltare a destra, quindi attendo che il semaforo diventi verde, al chè (*in assenza di ulteriori segnalazioni*) lo prendo come un segnale che POSSO PASSARE, DATO CHE IL SEMAFORO E' VERDE. Se non chè, udite udite, mentre svolto a destra mi rendo conto che all'usicta del cazzo di incrocio c'è lì bello bello un ALTRO semaforo, ma rosso. A questo punto io ormai sono già in mezzo alla strada, se mi fermo blocco o il controviale o l'attraversamento ciclabile, (anche perchè non c'è una minchia di linea d'arresto quindi cosa ne so io di dove mi devo ficcare?), inoltre so di altri casi a Torino in cui il secondo semaforo va ignorato, quindi in una frazione di secondo decido di completare la svolta, ma proprio mentre attraverso il controviale mi trovo un'altra macchina (linea blu nell'immagine) che stava andando sparatissima ed inchioda ad un metro dalla carrozzeria della mia macchina uscita dalla concessionaria una settimana fa. Mi aspetto una strombazzata di 45 minuti in classico stile torinese, invece io e l'altro autista ci guardiamo nelle palle degli occhi per un secondo, entrambi spaesati e sperduti, poi io riparto e mi levo dai maroni (nonostante il semaforo ancora rosso.)\n\nIn sostanza, cosa minchia si fa in queste situazioni per non farsi ammazzare da qualcuno che arriva dal controviale e non essere megamultati?",
        "upvotes": 135,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fhn6kej8je3g1.png?auto=webp&amp;s=5145e886e63e9b2eebce72f8f53389ba293c72bd"
        },
        "permalink": "/r/torino/comments/1p6c1kj/incroci_di_merda_aiuto/"
    },
    {
        "id": "1p6l3ca",
        "author": "dave-lon",
        "title": "Come si guida a Torino e in tutte Europa in realtà",
        "content": "Stanco di sentire che non si sa come guidare a Torino ho preparato una breve guida, per viali e controviali e semafori pedonali  \n\\----------------------------------------\n\nLa segnaletica stradale può essere verticale, orizzontale oppure luminosa.\n\nIl semaforo pedonale è a tutti gli effetti un insieme di segnaletica luminosa, e segnaletica orizzontale dedicata (le strisce pedonali e la linea di arresto).\n\nQuando guidate devi verificare sempre tutti i tipi di segnaletica:\n\nverticale (cartelli),  \nluminosa (semafori),  \norizzontale (linee a terra, attraversamenti, stop, ecc.).\n\nNel caso specifico del video/foto: non è presente la linea di arresto dello STOP davanti al semaforo.\n\nQuesto significa che quel semaforo è pedonale, non è un semaforo veicolare di arresto obbligatorio.\n\nSe non ci sono pedoni che stanno attraversando, puoi superare il semaforo anche se è rosso, perché quel rosso riguarda solo l’attraversamento pedonale.\n\nÈ proprio per questo che si chiama “pedonale”: regola le persone a piedi, e le auto solo se è ci sono persone a piedi.\n\nhttps://preview.redd.it/cfuhxvs0ag3g1.jpg?width=1855&amp;format=pjpg&amp;auto=webp&amp;s=d0cb48c37f7878f8c188ae17c9f48befc1fc82bd\n\nEsempio visivo  \nin \"immagine 1\" ( in rosso) , dove è presente la segnaletica orizzontale completa (linea di stop + attraversamento), il rosso è obbligatorio per i veicoli.\n\n\"immagine 2\"  è una simulazione\n\nSe quella segnaletica non c'è, il semaforo non impone l’arresto ai veicoli, ma solo attenzione ai pedoni. (in verde)\n\nAltro esempio: Corso Bramante \"immagine 3\"\n\nNel caso di Corso Bramante (evidenziato in giallo), ci sono due semafori non pedonali distanti circa 50 metri.\n\nQuello più a sinistra era pedonale fino a pochi anni fa:\n\nmolti guidatori si fermavano comunque al rosso anche senza linea di stop, chi conosceva il codice della strada giustamente si irritava ,la soluzione “all’italiana” è stata trasformarlo in semaforo veicolare, adeguandolo ai comportamenti errati della maggioranza anziché far rispettare la regola corretta.  \nEd è un peccato: era pedonale da 80 anni.\n\nLa regola definitiva (valida ovunque)  \nQuando guidate, guardate tutte e tre le segnaletiche non solo una.\n\nC’è la linea di STOP?  \nTi devi fermare sempre al rosso.\n\nNon c’è la linea di STOP?   \nÈ un semaforo pedonale: ti fermi solo se ci sono pedoni.\n\nSvolta a destra\n\nDi solito non c’è linea di stop, come nei casi evidenziati in verde (Corso Bramante e Corso Vittorio):\n\nQuindi di norma puoi passare anche col rosso, sempre dando la precedenza a pedoni e ciclisti.\n\nOra ho io una domanda per voi, che vi lamentate della circolazione a Torino (che, paradossalmente, è una delle migliori in Europa): infatti il viale serve per andare lontano perchè nessuno che ti gira a dx, e hai tre corsie, quella veloce di sx, lenta di dx per girare a dx,  mentre il contro viale serve per raggiungere la destinazione, quindi o giri a dx prima della tua destinazione o giri dx dopo la tua destinazione.\n\nNella vostra città, quando svoltate a destra, vi fermate al semaforo anche se è rosso e non c’è la linea di STOP?\n\nPerché se la risposta è sì… allora il problema non è Torino. È che non conoscete il codice della strada.\n\nse la risposta è no anche se ci sono i pedoni idem.\n\nio credo che vi non vi rendiate conto della segnaletica orizzontale.\n\nun abbraccio chi chiede chiarimenti.\n\nD.",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1p6l3ca/come_si_guida_a_torino_e_in_tutte_europa_in_realtà/"
    },
    {
        "id": "1p66sos",
        "author": "MicheleCaracas",
        "title": "Indovina cosa si è bloccata di nuovo oggi per imprecisate cause tecniche?",
        "content": "Ormai la metro si blocca sistematicamente tutte le mattine tra le 7 e le 9 per un \"problema tecnico\". Il blocco è variabile tra dieci minuti e più di mezz'ora, se va bene, altrimenti viene proprio chiusa e attivati bus sostitutivi.\n\nQualcuno sa a cosa è dovuto il blocco del mattino? Com'è possibile che con una sola linea di metro da gestire accadano queste cose? \n\nObligatory: Gtt merda, il prossimo candidato sindaco che prometterà di brillare tutta l'attuale gestione e rifarla da zero avrà il mio voto. ",
        "upvotes": 38,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p66sos/indovina_cosa_si_è_bloccata_di_nuovo_oggi_per/"
    },
    {
        "id": "1p5saz3",
        "author": "mirageoflower",
        "title": "Oggi, come sempre, GTT merda",
        "content": "Motivo di questo ennesimo sclero contro la GTT, che ormai su questo subreddit è all'ordine del giorno, è la grandissima troiata che è far pagare la multa per dimenticanza di tessera BIP (con abbonamento valido).\n\nDitemi se è normale dover pagare 17 euro di multa per essermi dimenticata la tessera nella giacca che ho usato fino a ieri, nonostante basta che io acceda alla mia area riservata per poter constatare che sono in possesso della suddetta tessera e che essa ha un abbonamento attivo caricato sopra. Per me è una cosa che non sta nè in cielo nè in terra. Ho chiesto spiegazioni di questa cosa al controllore che mi ha fatto la multa, e le uniche cose che ha saputo blaterarmi sono state \"eh sa, il regolamento\" e, udite la cagata del secolo:\n\n\"Perchè sa, poi magari uno si fa dare le credenziali da un amico ed usa la sua tessera, e comunque anche farsi presentare la carta d'identità non serve a niente, perchè magari gliel'ha rubata\". \n\nEro talmente stanca e incazzata che non ho ribattuto, ma una me più in forma gli avrebbe caldamente fatto presente che magari le stracazzo di tessere fisiche si possono prestare ancora più facilmente delle credenziali dell'area riservata, e chissà lui quante tessere prestate (o rubate) controlla al giorno senza battere ciglio. E quindi niente, col cazzo che faccio la procedura online: domani vado in uno dei centri assistenza della GTT ed esporrò quanto più freddamente possibile i miei pensieri riguardo questa idea geniale.\n\nPagherò e continuerò a pagare perchè mi ritengo una persona onesta, ma a volte sembra veramente che ti prendano per il culo. Il servizio fa pena, gli autobus non passano e spesso sono fatiscenti, ma sì, facciamo pagare la multa a chi paga l'abbonamento! È così che si risolvono i problemi!",
        "upvotes": 74,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1p5saz3/oggi_come_sempre_gtt_merda/"
    },
    {
        "id": "1p66pnn",
        "author": "jenefaisquebadiner",
        "title": "Quale panettone artigianale comprerete?",
        "content": "Ispirata dal [post](https://www.reddit.com/r/milano/comments/1p2tl9a/quale_panettone_di_pasticceria_comprerete/) dei nostri vicini di r/milano, ecco il nostro spazio ufficiale per scambiarci consigli d'acquisto sui panettoni artigianali made in Torino (o in Piemonte)!  Spazio aperto anche gli amici dei pandori e delle specialità locali - Nuvola anyone?",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1p66pnn/quale_panettone_artigianale_comprerete/"
    },
    {
        "id": "1p68l6h",
        "author": "PanettoneFannullone",
        "title": "Qual è il miglior ristorante di Torino?",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kutc9tr6ld3g1.jpeg?auto=webp&amp;s=296e5e4d031e386bec13fdeb2aefabe370b77e5f"
        },
        "permalink": "/r/torino/comments/1p68l6h/qual_è_il_miglior_ristorante_di_torino/"
    },
    {
        "id": "1p6igfz",
        "author": "festa-bianca-torino",
        "title": "Gruppi social",
        "content": "Ciao a tutti cerco gruppi social dive postare ciò che ho da vendere grazie",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p6igfz/gruppi_social/"
    },
    {
        "id": "1p6huwg",
        "author": "Ok-Mouse-7256",
        "title": "Til admission how working???",
        "content": "Hi everyone,\n\nI am a 17-year-old student from Brazil preparing to apply to Politecnico di Torino for the 2026/2027 academic year. I am targeting the Engineering program and need some specific guidance regarding the TIL-I exam and the financial aid process.\n\n**My Profile:**\n\n* **Languages:** Italian C1 and English C1.\n* **Academic:** Math Olympiad Champion (Brazil).\n* **Current Status:** High School Senior.\n\nDespite my background, I want to ensure my preparation for the TIL-I is bulletproof, as standardized tests in Brazil are quite different from the European format.\n\n**My Questions:**\n\n1. **TIL-I Preparation:** Aside from the official PoliTo simulations, are there specific textbooks (like Alpha Test or Hoepli) or question banks you recommend specifically for the *Engineering* TIL? Is the math section comparable to the SATs or strictly harder?\n2. **Scholarships &amp; ISEE Parificato:** I am trying to figure out the EDISU Piemonte brackets. My family income is approximately **140k BRL (Brazilian Reais)** per year, which converts to roughly **€23,000 EUR**. Does this typically fall within the threshold for the scholarship and canteen/accommodation waiver? I've heard the limit is often around €24k ISEE, but I am unsure how the \"Parificato\" calculation affects this.\n\nAny insights from current international students would be highly appreciated.\n\nThanks in advance.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p6huwg/til_admission_how_working/"
    },
    {
        "id": "1p67njc",
        "author": "DanielFHD4K",
        "title": "Carrozzerie",
        "content": "Buongiorno popolo torinese di reddit, long story short, ho fatto incidente ed è la mia prima volta e non so cosa devo fare. È un piccolo tamponamento, credo sia solo da cambiare il paraurti e rimettere a posto i pezzi che si sono spostati di conseguenza. Avete da consigliare qualche Carrozzeria? La macchina è una Nissan Micra, se la carrozzeria è autorizzata Nissan è un plus.\n\nPlus plus se mi sapete consigliare come procedere per la valutazione del danno e se devo passare prima da un meccanico, in caso, per sicurezza. Non ho spie accese e nulla in realtà, però non si sa mai, boh. (Già fatto Cai per assicurazione, io ero dietro e mi hanno dato torto quindi Ez devo pagare)\n\nGrazie!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1p67njc/carrozzerie/"
    },
    {
        "id": "1p6awp2",
        "author": "LowFuel6683",
        "title": "Miglior dentista convenzionato",
        "content": "Qualcuno avrebbe dei consigli su un ottimo dentista a Torino che sia specializzato in impianti o ricostruzione dentale e convenzionato con metasalute in modo da applicare dei rimborsi su queste prestazioni?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p6awp2/miglior_dentista_convenzionato/"
    },
    {
        "id": "1p6avsd",
        "author": "Similar_Profit_7298",
        "title": "Tokyo Godfathers al Reposi",
        "content": "Qualcuno che è già andato a vedere il film saprebbe dirmi quanto costa il biglietto al Reposi? Dovrebbe essere film evento",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p6avsd/tokyo_godfathers_al_reposi/"
    },
    {
        "id": "1p65m9x",
        "author": "alnews",
        "title": "Qualcuno oggi ha problemi con il teleriscaldamento?",
        "content": "Ho già contattato la mia amministrazione ma per cercare di capire se è un problema diffuso, qualcuno stamattina si è svegliato al freddo zona Campidoglio al confine con Parella?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p65m9x/qualcuno_oggi_ha_problemi_con_il_teleriscaldamento/"
    },
    {
        "id": "1p65j8f",
        "author": "Zzzzzzzzzzzcc",
        "title": "Uni project poll",
        "content": "Hello,\n\nFor a final project at uni we need to gather some data from the following poll. It would be very helpful if you guys were so kind to answer it. Thank you very much for taking the time reading this!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F52FsDYU1RSg6PgtzFeUW2UnflxN3r2RrGgPF00KpaM.png?auto=webp&amp;s=c189b34ff709bd3be3cf8d4d0e9654e80c66b5de"
        },
        "permalink": "/r/torino/comments/1p65j8f/uni_project_poll/"
    },
    {
        "id": "1p5de9e",
        "author": "al_amhara1987",
        "title": "Affitti impossibili in città",
        "content": "In sostanza: non ci sono monolocali/bilocali in affitto, quelli che ci sono costano una fraccata, è pieno di scammer e di abusivi che intasano di annunci finti, quello veri chiedono sempre contratti a tempo determinato o garanti. Altri non affittano a chi ha già la residenza in torino o addirittura in provincia di torino. È praticamente impossibile così trovare una casa. Se avessi un contratto a tempo indeterminato, infatti, la casa la comprerei!  \n\nEdit: contratti a tempo INdeterminato ovviamente",
        "upvotes": 29,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1p5de9e/affitti_impossibili_in_città/"
    },
    {
        "id": "1p4w001",
        "author": "jjewjjitsu",
        "title": "Ma che bella sei Torino!",
        "content": "Ho fatto qualche foto in giro per la città oggi, volevo condividerle con voi!",
        "upvotes": 308,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p4w001/ma_che_bella_sei_torino/"
    },
    {
        "id": "1p5op8b",
        "author": "mario_grondaia",
        "title": "Info capodanno pls, scusate è quel momento dell'anno",
        "content": "Allora per dare un po' di contesto siamo un gruppo storico di amici toscani di 23 anni e da 7 anni ci ritroviamo per capodanno a casa di qualcuno e niente ceniamo, beviamo e via. Quest'anno volevamo fare una cosa diversa, un po' più movimentata, ed adesso avendo un appartamento a Torino avevo proposto di fare una cosa fuori porta qui. Sapete consigliarmi eventi/ un programma che sapete esserci a capodanno? \n\nChiedo qua su reddit che così evito figuracce ed inculate che potrei prendermi cercando solamente su internet senza avere pareri esterni. \n\nSerate o locali con la musica se sapete consigliare vanno benissimo, l'unica cosa NO serate in discoteca che tanto vale le facciamo in Toscana senza fare 6 ore di treno. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p5op8b/info_capodanno_pls_scusate_è_quel_momento_dellanno/"
    },
    {
        "id": "1p5j1nn",
        "author": "quintus69",
        "title": "Affordability in Torino as a foreign student",
        "content": "I am an international student, and I just got an offer for a summer project at Istituto Nazionale di Ricerca Metrologica (INRIM) in Torino. The project is very closely aligned with my research field, and the professor is one of the greats in the field. However, the catch is they won't be able to provide any funding for my travel and stay. Now I can self-fund a certain part of the money, but staying for approximately 3 months seems to be out of my budget. I was wondering if there are any freelance/part-time jobs I can do there to fund the rest of my stay and if they employ foreign students at all. I don't speak Italian but am fluent in English and also know a bit of French. Also what would be the approximate cost of staying for that duration at a place near INRIM? Any input is appreciated.\n\nTLDR: I'm an international student looking to stay in Turin next summer and need an estimate for the cost and if I could work part-time jobs to make it up.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p5j1nn/affordability_in_torino_as_a_foreign_student/"
    },
    {
        "id": "1p5tq56",
        "author": "External-Start-6640",
        "title": "Scena techno/clubbing",
        "content": "Salve! Da qui a un anno pensavo di trasferirmi a Torino ma prima di ciò volevo sapere com'è la scena techno da voi!!! Io attualmente vivo a Bologna e la vedo un po' smorta sotto questo punto di vista, qualcuno saprebbe darmi info a riguardo?",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p5tq56/scena_technoclubbing/"
    },
    {
        "id": "1p5rgzx",
        "author": "Imaginary_Hour6285",
        "title": "Qualcuno qui ha vinto il concorso per assistente sociale?",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p5rgzx/qualcuno_qui_ha_vinto_il_concorso_per_assistente/"
    },
    {
        "id": "1p5bwpo",
        "author": "salvo_2000",
        "title": "Pub/bar per giovani a Torino ?",
        "content": "Buongiorno , sapete mica se qualche bar o pub , o comunque qualche luogo per giovani dai 18 in su a Torino e dintorni ? ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p5bwpo/pubbar_per_giovani_a_torino/"
    },
    {
        "id": "1p4kx6z",
        "author": "Cairoli23",
        "title": "perché la statua davanti al Madama parla dei milanesi?",
        "content": "ciao! sono spagnolo e da quando ho visto questa statua mi sono fatto una domanda: perché è intitolata ai milanesi se è a Torino. capisco quella roba dell'esercito sardo ma... perché i milanesi? è stato un regalo e messa nella capitale in quelli tempi?",
        "upvotes": 95,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/unedm12zwz2g1.png?auto=webp&amp;s=c88e960010e37e2d3786968ff91c143b7ef2425e"
        },
        "permalink": "/r/torino/comments/1p4kx6z/perché_la_statua_davanti_al_madama_parla_dei/"
    },
    {
        "id": "1p51va6",
        "author": "Wrong_County_6738",
        "title": "RETTILI TORINO",
        "content": "Ciao ragazzi, cerco appassionati di rettili a Torino con cui fare due chiacchiere e magari scambiare qualche ISOPOD ecc ... Grazie ciao!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p51va6/rettili_torino/"
    },
    {
        "id": "1p5405c",
        "author": "Yeltsin86",
        "title": "Cinema con sottotitoli in inglese?",
        "content": "Buongiorno, ci sono cinema con sottotitoli per non udenti disponibili in Inglese? Sono interessato specificamente a Zootopia 2 al momento, ma sarebbe buono avere un'opzione anche in generale.\n\nAltrimenti ogni volta che esce un film nuovo mi tocca aspettare mezzo anno per l'uscita su streaming/dvd...",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p5405c/cinema_con_sottotitoli_in_inglese/"
    },
    {
        "id": "1p4pxhr",
        "author": "Top-Pension4334",
        "title": "(sfogo) la situazione parcheggi in centro è imbarazzante",
        "content": "Ricordo quando,  5/10 anni fa, quando si voleva andare a cena in centro, la scelta era: se vuoi parcheggiare vicino, accetta di pagare un parcheggio a pagamento, se non vuoi pagare, accetta di parcheggiare un po' lontano, o di girare in attesa di trovare un posto libero.\n\nA distanza di pochi anni, la scelta è: se vuoi avere una qualsiasi possibilità parcheggiare, mettiti in coda per un parcheggio a pagamento sperando che esca qualcuno, o torna a casa.\n\nLa situazione che ho trovato ieri sera era imbarazzante: posti dove uno può effettivamente parcheggiare inesistenti, tra riservati ai residenti, una miriade di posti per disabili, lavori, gente in doppia fila. Roba che se per caso ne trovi uno libero (e non avendo altre possibilità!) fai il segno della croce che non ti arrivi una multa. Nessun parcheggio a pagamento libero: tutti occupati, con gente IN CODA all' entrata in attesa che qualcuno esca.  \n\nUnica alternativa, se vuoi cenare in centro, è parcheggiare in zone a 40 minuti a piedi e attraversarti tutto il centro, magari in inverno e magari insieme a famiglia/persone anziane\n\nSiamo una città ridicola.",
        "upvotes": 8,
        "comments": 56,
        "media": null,
        "permalink": "/r/torino/comments/1p4pxhr/sfogo_la_situazione_parcheggi_in_centro_è/"
    },
    {
        "id": "1p4y8g8",
        "author": "Neat-Clue-1950",
        "title": "Tennis Torino",
        "content": "Ciao! Cerco persone a Torino con cui giocare a tennis, livello intermedio! 💐",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p4y8g8/tennis_torino/"
    },
    {
        "id": "1p4rqsk",
        "author": "Complex_Lynx_8546",
        "title": "SOS LAVANDERIA",
        "content": "Ciao \nSapete per caso qualche lavanderia a gettoni che ha l’asciugatura che non costa tantissimo? \nIo abito vicino porta palazzo e vado spesso alla lavarmi le in via Maria ausiliatrice che con la tessera ti fa 90 centesimi 8 minuti di asciugatura(altrimenti 1 euro) solo che da un mese circa funziona solo un’asciugatrice su 2 e se la trovo occupata sono fregato. Le scorse volte ho provato 2 asciugatrici in via Cigna, entrambe vicino al fiume Dora, solo che una ora anche lì su 2 ne funziona solamente una e l’altra che ha 3 asciugatrici mi ha lasciato la roba con un odore strano, metallico, non so come spiegarlo. Se qualcuno conosce qualche lavanderia in zona accetto consigli, grazie 🙏 ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p4rqsk/sos_lavanderia/"
    },
    {
        "id": "1p4w7dq",
        "author": "StruggleOk5642",
        "title": "DrPepper anywhere in Torino?",
        "content": "Hey, I recently moved to Torino. I really DrPepper but I cant find it in anywhere. Does anyone know if it's being sold anywhere? Thanks in advance. ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1p4w7dq/drpepper_anywhere_in_torino/"
    },
    {
        "id": "1p3y04x",
        "author": "_Giulio_Cesare",
        "title": "Botte e minacce a un professore, “sei un pedofilo”: arrestato Don Alì, il “re dei maranza”",
        "content": "",
        "upvotes": 107,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gd6d0WXTyTEhcSXB5CGc0rnUrTSslly_fIWYbADy19o.jpeg?auto=webp&amp;s=51f1cb6f9793992d178f7f7fb04a67af59121825"
        },
        "permalink": "/r/torino/comments/1p3y04x/botte_e_minacce_a_un_professore_sei_un_pedofilo/"
    }
]