[
    {
        "id": "1khzkkk",
        "author": "EliCraigAMA",
        "title": "Hi r/movies! I’m Eli Craig, director of CLOWN IN A CORNFIELD (starring Katie Douglas, Kevin Durand, Will Sasso). It will be released in theaters this Friday, May 9. I also wrote and directed the horror-comedy cult classic TUCKER AND DALE VS. EVIL. Ask me anything!",
        "content": "Hey Reddit,\n\nI’m Eli Craig. I’m the director and co-writer of CLOWN IN A CORNFIELD which will be in theaters May 9! The film is based on the Bram Stoker Award-Winning Novel of the same name by Adam Cesare.\n\nI also wrote and directed the horror-comedy cult classic TUCKER AND DALE VS. EVIL, LITTLE EVIL starring Adam Scott and Evangeline Lilly and the award-winning comedy short THE TAO OF PONG. \n\nFeel free to ask me any questions. I'll be back tomorrow Friday, May 9, at 7 PM ET for answers.\n\nMORE ABOUT CLOWN IN A CORNFIELD\n\nIn CLOWN IN A CORNFIELD, Quinn (Katie Douglas) and her father (Aaron Abrams) have just moved to the quiet town of Kettle Springs hoping for a fresh start. Instead, she discovers a fractured community that has fallen on hard times after the treasured Baypen Corn Syrup Factory burned down. As the locals bicker amongst themselves and tensions boil over, a sinister, grinning figure emerges from the cornfields to cleanse the town of its burdens, one bloody victim at a time. Welcome to Kettle Springs. The real fun starts when Frendo the clown comes out to play.\n\nThe film stars Katie Douglas (“Ginny &amp; Georgia”), Kevin Durand (Kingdom of the Planet of the Apes), Aaron Abrams (“Blindspot) and Will Sasso (The Three Stooges).\n\nCheck out the trailer: [https://www.youtube.com/watch?v=gww5V8BPpj8](https://www.youtube.com/watch?v=gww5V8BPpj8)\n\nFollow the Film u/clown_in_a_cornfield\n\nTalk to you all later! Ask me anything.\n\n",
        "upvotes": 504,
        "comments": 149,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vn44groe5mze1.png?auto=webp&amp;s=8f764bf444720fdacce92699dfdc7c19c3653920"
        },
        "permalink": "/r/movies/comments/1khzkkk/hi_rmovies_im_eli_craig_director_of_clown_in_a/"
    },
    {
        "id": "1ki7y48",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Clown in a Cornfield / Fight or Flight / Shadow Force) Plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Clown in a Cornfield](https://old.reddit.com/r/movies/comments/1ki7l69/official_discussion_clown_in_aa_cornfield_spoilers/?)\n\n[Fight or Flight](https://old.reddit.com/r/movies/comments/1ki7l7u/official_discussion_fight_or_flight_spoilers/?)\n\n[Shadow Force](https://old.reddit.com/r/movies/comments/1ki7l93/official_discussion_shadow_force_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Gladiator](https://old.reddit.com/r/movies/comments/1ki7lag/official_throwback_discussion_gladiator_spoilers/?)\n\n[I Dreamed of Africa](https://old.reddit.com/r/movies/comments/1ki7lci/official_throwback_discussion_i_dreamed_of_africa/?)\n\n\n# Still in Theaters\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ki7y48/official_discussion_megathread_clown_in_a/"
    },
    {
        "id": "1kjslox",
        "author": "Billybob35",
        "title": "One of the most blatantly commercial scenes in any movie",
        "content": "This comes from the 2006 superhero comedy \"Zoom\", where the plot comes to a halt so the protagonists can go to Wendy's in an spaceship. To my knowledge, this was the second time that a Peter Hewitt directed film had a plug for Wendy's, the first being \"Garfield (2004)\".\n\n[https://www.youtube.com/watch?v=MdBSvtaHQew](https://www.youtube.com/watch?v=MdBSvtaHQew)",
        "upvotes": 733,
        "comments": 588,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rBrFPFPZjm1pU4I8huip1rmDdQ8ijaiWt4JikXOqJxQ.jpeg?auto=webp&amp;s=dd990f6b3c88f0fde2d9b3ab6eeb9cdd3b6c817d"
        },
        "permalink": "/r/movies/comments/1kjslox/one_of_the_most_blatantly_commercial_scenes_in/"
    },
    {
        "id": "1kjdwne",
        "author": "DamnThatsInsaneLol",
        "title": "Director Chad Stahelski Confirms ‘Highlander’ Reboot Starring Henry Cavill Will Shoot in September",
        "content": "",
        "upvotes": 4921,
        "comments": 453,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a35QB1ifCAARFnXiKC7zNbVv-IPuXATY5NF4D7WvXTc.jpeg?auto=webp&amp;s=40405a5aa36183e7e63eeac119ef0bde71759b15"
        },
        "permalink": "/r/movies/comments/1kjdwne/director_chad_stahelski_confirms_highlander/"
    },
    {
        "id": "1kjhj3d",
        "author": "MarvelsGrantMan136",
        "title": "‘Supergirl: Woman of Tomorrow’ Wraps Filming",
        "content": "",
        "upvotes": 1603,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HXSYHio30I_kiRVyNvWprg-oosmPmUP2tta7az3jQlY.jpeg?auto=webp&amp;s=a4258f8c35a5130a111ee9bdb17c212b00f492c2"
        },
        "permalink": "/r/movies/comments/1kjhj3d/supergirl_woman_of_tomorrow_wraps_filming/"
    },
    {
        "id": "1kj9etr",
        "author": "MarvelsGrantMan136",
        "title": "Dev Patel’s Action-Thriller ‘The Peasant’ Snapped Up By A24 For Worldwide Rights On Eve Of Cannes Market",
        "content": "",
        "upvotes": 3877,
        "comments": 244,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X-GJQ6rQLs5TIVV5i0DlqW-MwVRKZ-b0kCzmawwCtMg.jpeg?auto=webp&amp;s=3f7fc54af176219dfee3549a4dfb48bf5af3505b"
        },
        "permalink": "/r/movies/comments/1kj9etr/dev_patels_actionthriller_the_peasant_snapped_up/"
    },
    {
        "id": "1kjd910",
        "author": "mayukhdas1999",
        "title": "First Image of Harry Melling &amp; Alexander Skarsgård in A24's 'PILLION' - A timid man is swept off his feet when an enigmatic, impossibly handsome biker takes him on as his submissive",
        "content": "",
        "upvotes": 1730,
        "comments": 211,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0r7703ca6zze1.jpeg?auto=webp&amp;s=0475c4f880b7b966936720cbb406d12a8746e128"
        },
        "permalink": "/r/movies/comments/1kjd910/first_image_of_harry_melling_alexander_skarsgård/"
    },
    {
        "id": "1kjc29x",
        "author": "DamnThatsInsaneLol",
        "title": "Christopher Nolan’s ‘Dunkirk’ Tops Poll of UK’s Favourite World War II Films",
        "content": "",
        "upvotes": 1393,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fe_4RD4n188oRoYMoX2Qvn5rOztR4getjpt4Wp75u8c.jpeg?auto=webp&amp;s=dd80d970dc28f8d114939dd82e99f9fff850944b"
        },
        "permalink": "/r/movies/comments/1kjc29x/christopher_nolans_dunkirk_tops_poll_of_uks/"
    },
    {
        "id": "1kjurmj",
        "author": "Boss452",
        "title": "Movies are magic.",
        "content": "Just a salute to the artform. As a lover of film, I always appreciate how a good film takes you on a journey for a couple of hours and makes you forget your real life problems for a brief period of time.\n\nAlong the way you experience great visuals, engaging stories, connect with characters, hear gorgeous music, and often times learn a thing or two about the world or human emotions. Sometimes there are themes that make you reflect and ponder over.\n\nThere is a lot written about the future of movies and there is increasing competition from various forms of entertainment for people's time. There are also reports that newer gens are not that much interested in movies as previous gens were.\n\nBut I feel movies have a place in the world and is a beautiful form of art and entertainment.",
        "upvotes": 41,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1kjurmj/movies_are_magic/"
    },
    {
        "id": "1kjhrqm",
        "author": "matadinosaurios",
        "title": "Suggest an unintentionally bad movie that's not comedic I can day drink to",
        "content": "My perfect example of what I'm looking for (sorry if I ruffle any feathers) is Dan Foreman's Life Itself, where everything is competently made, everyone is giving it their all, but something about the script is just so over the top cheesy that you can't help but marvel at the characters' choice of words and decision making. I fucking love that movie.\n\nWhat are your best suggestions for something more drama leaning and earnestly made like that but still fun to watch for those reasons?\n",
        "upvotes": 313,
        "comments": 524,
        "media": null,
        "permalink": "/r/movies/comments/1kjhrqm/suggest_an_unintentionally_bad_movie_thats_not/"
    },
    {
        "id": "1kju8fq",
        "author": "MeatDiddler",
        "title": "What are some movies that are surprisingly okay for kids to watch?",
        "content": "My daughter walked in while I was watching Mission Impossible: Rogue Nation and I ended up starting it over and watching it with her. Now we’re in the process of going through all of them before The Final Reckoning comes out. There are a few intense scenes (especially in 3 with Phillip Seymour Hoffman), but for the most part they’re not THAT bad. So it got me thinking…what are some other movies that you would think would be inappropriate for a 10 year old, but they’re not that bad? ",
        "upvotes": 38,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1kju8fq/what_are_some_movies_that_are_surprisingly_okay/"
    },
    {
        "id": "1kjh1vz",
        "author": "Davis_Crawfish",
        "title": "\"Bad Boys\" (1983): Sean Penn as a Juvenile delinquent, lands himself in jail after running over a kid, and ends up being targeted by his victim's brother as well as having to deal with violent cellmates. Co-starring Esai Morales, Clancy Brown and Ally Sheedy",
        "content": "",
        "upvotes": 306,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7XPBKrgZJsx_YmjLwekZyaORJk0sqQgrAZDJDacfufk.jpeg?auto=webp&amp;s=8c27155c3ec3df3e3d647f8bb9a3f740927c221f"
        },
        "permalink": "/r/movies/comments/1kjh1vz/bad_boys_1983_sean_penn_as_a_juvenile_delinquent/"
    },
    {
        "id": "1kjm678",
        "author": "BunyipPouch",
        "title": "'September 5' Sweeps German Film Awards - The real-life thriller based on the terrorist attacks on the 1972 Munich Olympics won 9 awards: Best Film, Director, Screenplay, Editing, Cinematography, Supporting Actress, Sound Design, Makeup, and Production Design.",
        "content": "",
        "upvotes": 145,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dwb1Ht5Eln9FX6kpnMppa-Q0ifmgMtn-4lqIrKm3S-E.jpeg?auto=webp&amp;s=cee20af0a429be7364420ffc7a9ebe3f3fdef95d"
        },
        "permalink": "/r/movies/comments/1kjm678/september_5_sweeps_german_film_awards_the/"
    },
    {
        "id": "1kj8w04",
        "author": "PI_______",
        "title": "Which films do people wrongly associate with a director / actor? Like how \"A Nightmare Before Christmas\" wasn't directed by Tim Burton.",
        "content": "Are there any films that people wrongly think of being directed or starring certain people? I know Tim Burton wrote the story for A Nightmare Before Christmas, but I was pretty shocked to find out he didn't direct it. Are there any other examples of this? \n\nThe same goes for actors. Are there any films that people often think star someone who wasn't actually in the movie?\n\nEdit: guys, I know Tim Burton was very much involved. I'm just pointing out that most people probably thought he directed it.",
        "upvotes": 877,
        "comments": 626,
        "media": null,
        "permalink": "/r/movies/comments/1kj8w04/which_films_do_people_wrongly_associate_with_a/"
    },
    {
        "id": "1kj980j",
        "author": "clubofab7",
        "title": "New images of Alison Brie &amp; Dave Franco in Neon's \"TOGETHER\"; scheduled to release on 30.7.2025",
        "content": "",
        "upvotes": 661,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w4q0jofc8yze1.jpeg?auto=webp&amp;s=a8bc5480658c8f0adb0cc22bff2909b57a9b0f3e"
        },
        "permalink": "/r/movies/comments/1kj980j/new_images_of_alison_brie_dave_franco_in_neons/"
    },
    {
        "id": "1kjp7p5",
        "author": "indiewire",
        "title": "Mia Threapleton Says That She Struggled to Focus on ‘The Phoenician Scheme’ Opposite Tom Hanks",
        "content": "",
        "upvotes": 41,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ILSjb03oFORkd8LEEwf-VWNkRq4g1j05psQmse5VGlo.jpeg?auto=webp&amp;s=875dfe2358e3dff6873ba4d7bd7f5f5e8a832ebb"
        },
        "permalink": "/r/movies/comments/1kjp7p5/mia_threapleton_says_that_she_struggled_to_focus/"
    },
    {
        "id": "1kjmd3z",
        "author": "cmdrbrock",
        "title": "Hard Boiled - 2025 Cannes Selection (with remastered trailer)",
        "content": "",
        "upvotes": 58,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kjmd3z/hard_boiled_2025_cannes_selection_with_remastered/"
    },
    {
        "id": "1kjd2t8",
        "author": "Davis_Crawfish",
        "title": "\"Indiana Jones and the Temple of Doom\" gets a bad rep but it's the one movie in the series which offers you the biggest thrills while also being a big fun adventure and a Horror movie at the same time (PG-13 founder?)",
        "content": "We all know Steven Spielberg hates Temple of Doom because he was going through a rough time and the film reflected his mood as well as George Lucas. \n\nBut as someone who was not that impressed by the other Indiana Jones movies, this movie gave me everything I wanted: it was epic, it was funny, it was never boring for a second and it even made scared at one point. Spielberg rarely does Horror but when he does, you're going to have a Horror classic like we saw in Jaws and then, Temple of Doom. \n\nOh, but Short Round and Willie Scott were annoying! Well, I didn't find Short Round annoying. Every kid who saw this in the 80s loved Short Round, and Short Round felt like a real kid who just so happened to be a sidekick, we could relate to him in a way I could never with other kids in adventure movies like those dorky brats from Jurassic Park (\"I'm a Vegetarian!!!\").\n\nAnd I like Willie Scott. First, the Anything Goes number was a stunning opening. It shows the prowess Spielberg had for the musical genre. \n\nPeople bash Willie because she's a shrieking diva but that's what she is. She's not a archeologist like Marion. She didn't even want to go on this mission. She's a character placed in a situation which is out of her comfort zone so she behaves accordingly. And I thought Kate Capshaw did a good job. The way she tries to pass on the townspeople food turning it into an even more awkward moment. And how she grows but not too much. Which is a far cry from what we see today where every female lead needs to be a Lara Croft in training. \n\nHarrison Ford is spectacular in it. Especially when Indiana gets possessed and becomes a temporary baddie. Ford is amazing at playing heroes but I do wish he had played a bad guy just once.",
        "upvotes": 219,
        "comments": 157,
        "media": null,
        "permalink": "/r/movies/comments/1kjd2t8/indiana_jones_and_the_temple_of_doom_gets_a_bad/"
    },
    {
        "id": "1kju6jo",
        "author": "JasonVoorhees3",
        "title": "Recommendations for films about starting over after divorce/major life change.",
        "content": "My 12 year Marriage is about to come to end and I want some recommendations for films about starting life over again, how to get used to living alone again, living life in general alone. There must be some good films about people doing crazy whacky things after suddenly becoming  single after a long time.",
        "upvotes": 14,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1kju6jo/recommendations_for_films_about_starting_over/"
    },
    {
        "id": "1kjtjow",
        "author": "MaybeTodaySatan0",
        "title": "What is that one song you associate a movie with?",
        "content": "For me, Mondo '77 is the Vanilla Sky song. Great song. American Dad did a funny parody of the scene. Is that movie still divisive amongst the crowd? I personally loved that movie. I think people are starting to reflect well on it. Maybe. \n\nOr Don't You Forget About Me is the Breakfast Club song. Weird Science is the Weird Science song. \n\nWhat are you personal examples?",
        "upvotes": 14,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1kjtjow/what_is_that_one_song_you_associate_a_movie_with/"
    },
    {
        "id": "1kjq7j2",
        "author": "AdministrativeAir879",
        "title": "Horror movies to help relieve anxiety. (Movie recommendations)",
        "content": "I’m unsure if this is the right sub but I’m on the lookout for more movies to watch and recommendations.\n\nI have severe social anxiety and I’m dealing with a cycle of Burnout relapses. I’ve been trying everything. My doctor is considering some sort of stress disorder, disassociation or something.\n\nMy therapist suggested staying away from the news, the true crime I used to watch and any content that could be “bad to my mental health”.\n\nWell, today I broke the rules and just watched the movie “Us” (I watched when it was released, but remembered very little). And it was surprisingly good to my anxiety.\n\nI laughed at the comical relief moments. I enjoyed the suspense and also enjoyed the meanings I could take from it. Also led me to acknowledge my own “shadow(s)” and not neglect them (?), at least that’s how I took it. Also, the suspense grows and so does my physical and mental tension, but then these symptoms I already felt anyway gets released. It was a good experience, contrary to my expectations. If I had any.\n\nI feel more grounded and more connected to reality for now. So I’d really like recommendations. I’ve watched “Run” a few years ago and really liked it. Shutter Island. Midsommar. Psychological horror movies. Don’t need to be heavy on the horror, just the building suspense. Also ones that make you think, have or could have deeper meanings. Plot twists. Good movies.\n\nAppreciate it.",
        "upvotes": 26,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1kjq7j2/horror_movies_to_help_relieve_anxiety_movie/"
    },
    {
        "id": "1kjrqof",
        "author": "DakPrescoot",
        "title": "Warfare",
        "content": "Sorry if I’m late to this, I just joined this sub literally to talk about this movie. I kinda like war movies, whether it’s something like fury or saving private ryan, there’s TONS of Great War movies. I haven’t seen one like this though. I don’t know really what it was about this one, it was just different. And I have read that it was incredibly realistic, and people with PTSD actually had a hard time sitting through it. But watching the end credits was a really cool finish, especially seeing the actual people go through how they would clear a street/area. So am I kinda overreacting here or was this legit a good movie?",
        "upvotes": 19,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1kjrqof/warfare/"
    },
    {
        "id": "1kju416",
        "author": "Humble-Airport4295",
        "title": "Goodfellas or Casino; Better fed raid?",
        "content": "Personally, despite falling in love with everything Goodfellas, from the iconic death of Tommy for killing Batts and the alleyway scene, I think the segment when feds taped off the Tangiers as a crime scene, arrested everyone, coupled with the brutal deaths of Ginger and Nicky, everything just went to sh\\*t for 10 minutes, the casino was blown up and Sam was involved in multiple car bombings. Casino over Goodfellas.\n\n",
        "upvotes": 9,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kju416/goodfellas_or_casino_better_fed_raid/"
    },
    {
        "id": "1kildqq",
        "author": "ChiefLeef22",
        "title": "New Image of Ralph Fiennes, Jodie Comer and Alfie Williams from '28 Years Later'",
        "content": "",
        "upvotes": 10048,
        "comments": 552,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p6jb8721zrze1.jpeg?auto=webp&amp;s=adf35f9e3d6b2696d6952519eac50ed88847269e"
        },
        "permalink": "/r/movies/comments/1kildqq/new_image_of_ralph_fiennes_jodie_comer_and_alfie/"
    },
    {
        "id": "1kiw48d",
        "author": "Amaruq93",
        "title": "Rosanna Norton, Oscar-nominated Costume Designer (TRON, Carrie, Airplane, The 'Burbs) has died at age 80",
        "content": "",
        "upvotes": 1807,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7nwyp79fnz1LzkTrVfPA8fdPp466bYMCR6t0fcqdx5A.jpeg?auto=webp&amp;s=d8802d83a8fee23eeb00b9a72a27525a499f2304"
        },
        "permalink": "/r/movies/comments/1kiw48d/rosanna_norton_oscarnominated_costume_designer/"
    },
    {
        "id": "1kja3zs",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Ana de Armas - Tuesday 5/13 at 11:00 AM ET - Oscar-Nominated Actress and Star of Ballerina, Knives Out, Blonde, Blade Runner 2049, No Time To Die, Ghosted, The Gray Man, Deep Water",
        "content": "",
        "upvotes": 107,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zu4w0n8bgyze1.png?auto=webp&amp;s=8c64441eeac67cdd4473fdeed55e4270a12c4739"
        },
        "permalink": "/r/movies/comments/1kja3zs/amaqa_announcement_ana_de_armas_tuesday_513_at/"
    },
    {
        "id": "1kiosi4",
        "author": "DemiFiendRSA",
        "title": "Netflix To Remove ‘Black Mirror: Bandersnatch’ and ‘Unbreakable Kimmy Schmidt: Kimmy vs The Reverend’ From Platform on May 12 In an Effort to Ditch Interactive Programming",
        "content": "",
        "upvotes": 3685,
        "comments": 306,
        "media": null,
        "permalink": "/r/movies/comments/1kiosi4/netflix_to_remove_black_mirror_bandersnatch_and/"
    },
    {
        "id": "1kiuqqh",
        "author": "Dragon_kawai",
        "title": "What’s something that seems totally normal in movies but would be absolutely insane in real life?",
        "content": "I’ve been thinking about how movies get away with showing things that we just accept as normal on screen, but if they happened in real life, people would either call the police, question your sanity, or it would just be physically impossible.\n\nFor example — movie hackers can break into government systems or highly secured databases in under 10 seconds, typing furiously on a keyboard covered in green code with zero explanation. In real life, you’d be lucky if your WiFi connected that fast.\n\nWhat are some other examples you’ve noticed? I’m sure there’s a ton of ridiculous stuff we don’t even question anymore in movies.",
        "upvotes": 1513,
        "comments": 1586,
        "media": null,
        "permalink": "/r/movies/comments/1kiuqqh/whats_something_that_seems_totally_normal_in/"
    },
    {
        "id": "1kisqmu",
        "author": "PrincessRuri",
        "title": "Kung Fury 2 LEAKED Sizzle Real",
        "content": "",
        "upvotes": 1772,
        "comments": 227,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FcRQTIXd9Ra3wIVu9RSovkLJzIoNWaGudQzt2r4ZEiI.jpeg?auto=webp&amp;s=c7c46776e7c0646fa2b8d98e0028866997f434d6"
        },
        "permalink": "/r/movies/comments/1kisqmu/kung_fury_2_leaked_sizzle_real/"
    },
    {
        "id": "1kisj66",
        "author": "Edm_vanhalen1981",
        "title": "Kevin Smith's Dogma to screen at this year's Cannes",
        "content": "",
        "upvotes": 1609,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SNH317OfHWjBO1zvXbYTiKdW4t8YfGFh2Kf2UrjLAgM.jpeg?auto=webp&amp;s=22dd8d747c0b0b535b69a5796a3bb5cfae598994"
        },
        "permalink": "/r/movies/comments/1kisj66/kevin_smiths_dogma_to_screen_at_this_years_cannes/"
    },
    {
        "id": "1kiuh9u",
        "author": "Offscreenshaman",
        "title": "How Jurassic Park Subtly Lets John Hammond Off the Hook",
        "content": "He’s not the villain. He’s the grandfather. The dreamer. The face of wonder.\n\nBut rewatching *Jurassic Park*, I was struck by how softly the film lands on Hammond’s choices. There’s early critique, Ellie’s speech, Malcolm’s warning, but by the end, he’s grieving a lost dream, not facing consequences.\n\nI’m not saying he needed to be the villain. But it’s fascinating how the story wraps systemic failure in nostalgia, and leaves us mourning *with* him.\n\nIs that emotional sleight of hand? Or just good character work?\n\nCurious what others think.",
        "upvotes": 1192,
        "comments": 305,
        "media": null,
        "permalink": "/r/movies/comments/1kiuh9u/how_jurassic_park_subtly_lets_john_hammond_off/"
    },
    {
        "id": "1kjf6zr",
        "author": "mystery5009",
        "title": "Which movie did you think came out late?",
        "content": "Have you watched any movie and thought that if it had been released, for example, in the 80s, it would have been a classic, but for the year of its release it already seems outdated?\n\nI can give you an example of Paul Blart: Mall Cop. Like, a lot of people laugh at this movie because it's bad and unfunny. But if it had been released in the 80s, many would have considered it a comedy classic.",
        "upvotes": 33,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1kjf6zr/which_movie_did_you_think_came_out_late/"
    }
]