[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 53,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r52dkf",
        "author": "Immediate_Strike7720",
        "title": "The Lincoln Lawyer",
        "content": "I’ve just finished season 4 and this was by far the best season in my opinion. The whole case and how it played out was done brilliantly as well as integrating the side cases with Lorna. I see that they’ve renewed another season, not sure it can top this one though and wondering if they should’ve ended on a high? What’s everyone else’s thoughts on this? ",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r52dkf/the_lincoln_lawyer/"
    },
    {
        "id": "1r4flrh",
        "author": "Particular-Can-8382",
        "title": "drop your “cancelled after once season” show",
        "content": "i just started archive 81 and promptly found out the series stops at a cliffhanger and was cancelled. this just keeps happening to the shows i watch or the shows i find after the fact. i love it, binge it, and then proceed to find out that the idiots in charge somewhere decided to cancel after the first season despite some significant viewership for some shows. \n\ni get that 2020 was difficult with covid, then we had the writers strike. but it just keeps happening. i seem to watch less and less on netflix, i try to hunt for a good show but if they all just get cancelled after one season, whats the point? \n\ni just need to commit and cancel my subscription. Netflix is too focused on getting content out and doesn’t find it worth the effort to continue the shows they start. here’s my top 10 for shows they cancelled for (mostly) no reason\n\n1. Archive 81\n\n2. 1899\n\n3. Resident Evil\n\n4. The Midnight Club (thank you mike flanagan for providing us a mini synopsis of what season 2 would have been about)\n\n5. Lockwood &amp; Co.\n\n6. Kaos \n\n7. Midnight Gospel\n\n8. High Rise Invasion (i don’t think this was confirmed cancelled, but it has been 5 years)\n\n9. The Society\n\n10. In From the Cold",
        "upvotes": 105,
        "comments": 251,
        "media": null,
        "permalink": "/r/netflix/comments/1r4flrh/drop_your_cancelled_after_once_season_show/"
    },
    {
        "id": "1r4mrxm",
        "author": "queenstutter",
        "title": "His &amp; Hers",
        "content": "What other movies or series can you recommend that are similar to His &amp; Hers? In terms of plot, twists and length. We really enjoyed it and we like to see more like this!",
        "upvotes": 15,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1r4mrxm/his_hers/"
    },
    {
        "id": "1r462pn",
        "author": "ArmHefty8722",
        "title": "If you havent watched breaking bad yet, watch it",
        "content": "Breaking bad is the best show ive watched in so long, its perfect. Everything about it, the pasing, characters, story are so entertaining. If you havent watched this show I recommend 10/10 i promise you will love it💯",
        "upvotes": 204,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1r462pn/if_you_havent_watched_breaking_bad_yet_watch_it/"
    },
    {
        "id": "1r4ty7a",
        "author": "Creative-Lynx-1561",
        "title": "Competitions",
        "content": "Hi, where are the competitions of Netflix? I used to watch Glow Up, Drink Masters, Blown Away, and others like culinary. IDK if its bc of my country, but I don't have new seasons of competitions. I like \"Is it cake?\" but I want to see others too. \n\n  \n\\*english is not my first language. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r4ty7a/competitions/"
    },
    {
        "id": "1r4ogjb",
        "author": "IceCat767",
        "title": "The Eternaut - the Chinese kid and his family",
        "content": "I think I missed something on his story, they find him in the school then he says he will take them to their daughter's friend's house. Then at the house they find a frozen Chinese family and he shouts, \"mom!\" Was it his family, did he take them to his house instead? I didn't get it",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r4ogjb/the_eternaut_the_chinese_kid_and_his_family/"
    },
    {
        "id": "1r530db",
        "author": "aj12309",
        "title": "Better call Saul",
        "content": "About to finish better call Saul for the first time. I’ve seen breaking bad once about 10 years ago. When I finish better call Saul should I go back and watch break bad?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r530db/better_call_saul/"
    },
    {
        "id": "1r51t7l",
        "author": "Simply_Red1",
        "title": "The perfect neighbor - Belbuca",
        "content": "What a terrible terrible story. I really feel sorry for the kids and the family of AJ and I hope they find strength to heal from this. I have however read in another comment that Susan was taking a strong painkiller called Belbuca. Now I don't in any way defend her, she was a narcissist and is somewhat evil, but I think the effects of medications are never taken into account in these cases. Susan was a lonely old lady with some trauma from life, and I think people underestimate the effects of medicine and how It can mess up with your head over a period of time. I started thinking about that because when I saw her later at conviction time, she looked skinny and she looked relatively normal. While in the police footage she looked like a deranged schizophrenic, distant eyes, let herself go, paranoia, obsession with kids in this case. As I said, I am happy she will spend the rest of her life in prison, but I just wonder what role could the medication have played, if any, in her slow degradation. \n\nThere was a documentary I saw once, guy was taking Zoloft or something, killed his whole family during dinner, doesn't remember a thing. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r51t7l/the_perfect_neighbor_belbuca/"
    },
    {
        "id": "1r51q80",
        "author": "Gleis7",
        "title": "Finding Her Edge is poorly written! But a very enjoyable Binge.",
        "content": "Honestly, I still had a great time watching the show. It’s not the next masterpiece, but it was a fun, quick 8-episode binge. I’ve read complaints about the poor acting, but I couldn't care less because I actually enjoy a bit of trashy love triangle drama. However, one thing that really annoyed me was the relationship between the sisters, Adriana and Elise. They literally went from loving each other to being die-hard enemies wishing the worst on each other within five minutes. It didn't just happen once, it felt like it happened every single episode. It was laughable and made zero sense. Another thing that bothered me was how unrealistic the money situation was. Being 30k in debt is laughable if ALL of your pro athletes are going to the World Finals. I don't know exactly what figure skaters make, but I do know what sponsorships pay for a whole roster of World Champs. It made the debt plot point feel really weird. Also, why was there no winning party at the end? That felt like a huge missed opportunity!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r51q80/finding_her_edge_is_poorly_written_but_a_very/"
    },
    {
        "id": "1r4pv4m",
        "author": "Fluffy_Tie5709",
        "title": "red rose ending question",
        "content": "I just finished watching this series. First of all, I watched the series quite interestingly. Except Rochelle, who I thought was the main character, died in E2... but didn't the ending seem to suggest S2? of course this is a limited series. I guess a series called \"Yellow Rose\" set in Tokyo will be released on Netflix.😅 what do u think?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r4pv4m/red_rose_ending_question/"
    },
    {
        "id": "1r4sd5m",
        "author": "pjand08",
        "title": "Suggest me a movie or series like this",
        "content": "Suggest me a teen series in which a boy and a girl has to go on an adventure together alone due to circumstances,In the beginning they hate each other but slowly they start to love each other something like his dark materials.And there should be a fantasy or supernatural element into it",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r4sd5m/suggest_me_a_movie_or_series_like_this/"
    },
    {
        "id": "1r4s7o9",
        "author": "twefh",
        "title": "Subtitle style not working",
        "content": "I've got a Roku TV and I've always had the Netflix subtitle style set to the white text with no background. For some reason, Netflix stopped using that style and forces the white text with black background subtitles. I try to go in to the Change Subtitle Style and select the no background style option but it doesn't actually change. I can successfully select the other three style options, however. All Netflix's website said to do was restart the app basically. I also tried messing with Roku's caption options to see if that was affecting Netflix but that did nothing. \n\nIs this happening to anyone else or does anyone know what I can do to fix it? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r4s7o9/subtitle_style_not_working/"
    },
    {
        "id": "1r4pdck",
        "author": "PhoenixBoi69",
        "title": "Question",
        "content": "My favourite anime is available in chinese but not in english. All i did was swap languages and not countries, now all of a sudden i cant rewatch it anymore, is this normal",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r4pdck/question/"
    },
    {
        "id": "1r3z2fj",
        "author": "Right_Piano9460",
        "title": "His and hers plot hole/ weird thing",
        "content": "Just finished the show, it was okay overall but there’s something which bugged me from the second they did it. When Jack needs to do a DNA swab as requested by the coroner why on earth would he choose his niece? Not only is he going to share \\~25% of his DNA with her but they’re not even the same sex, picking a female relative has to be quite literally the worst person possible.",
        "upvotes": 36,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1r3z2fj/his_and_hers_plot_hole_weird_thing/"
    },
    {
        "id": "1r4cols",
        "author": "harpreetthind",
        "title": "Recommendations for a Netflix movies or TV shows",
        "content": "Watching the final season of night agent what other show does everyone recommend watching that has a similar vibe thanks for all their recommendations",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1r4cols/recommendations_for_a_netflix_movies_or_tv_shows/"
    },
    {
        "id": "1r4dmg7",
        "author": "pjand08",
        "title": "Suggest me a series like \"From\"",
        "content": "Suggest me a series or movie like From with same concept likable characters and don't suggest \"lost\" I have already watched it.There should be a mystery element in it.",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1r4dmg7/suggest_me_a_series_like_from/"
    },
    {
        "id": "1r4hobh",
        "author": "Affectionate_Dog8143",
        "title": "Why was Old Guard 2 so incredibly slow? A theory.",
        "content": "I deeply regret watching Old Guard 2. I thought the first film was a pretty solid mid-budget action flick.\n\nOld Guard 2 is a huge step down in all aspects, but my main problem was how slow it was. Boy did it drag! Then it didn't finish!?! The story finishes in Old Guard 3 it seems?\n\nWas the script for the sequel stretched out so it could be split into two? Is that why it's so slow?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r4hobh/why_was_old_guard_2_so_incredibly_slow_a_theory/"
    },
    {
        "id": "1r426sh",
        "author": "iPhone13pm",
        "title": "Top 10 Most Watched Netflix English TV Seasons of All Time",
        "content": "I’m surprised to see Dahmer on this top 10 list, while my favorite show is The Queen’s Gambit. Anya Taylor-Joy did absolute justice to this character.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r426sh/top_10_most_watched_netflix_english_tv_seasons_of/"
    },
    {
        "id": "1r4fc02",
        "author": "Luc1fer_10",
        "title": "Video quality",
        "content": "My netflix was working fine a week ago but when I opened it to watch some content yesterday, the video quality seems blurry/downgraded like SD quality. I've premium plan and also checked playback specs. I've widevine L1 with 16.0.0 version and have also tried all troubleshooting steps like uninstalling and reinstalling it after clearing cache and data from settings. I also changed the playback settings to HD from browser but no luck. Currently, I'm using redmi note 8 pro. Please help if someone has any solution or fix to this. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r4fc02/video_quality/"
    },
    {
        "id": "1r3x0md",
        "author": "Capybara_oranges",
        "title": "Can’t mirror Netflix to TV",
        "content": "Tried to watch a downloaded Netflix show from my iPad on the van TV via hdmi cable but it won’t play the video because I have an ad supported Netflix subscription. Thanks Netflix! The prices keep going up, I now have to watch ads, and I can’t push the video to a larger screen. Also, I had to buy the expensive apple branded usb-c to hdmi adapter because apparently the apple devices can recognize the cheaper knock off adapters and won’t allow video to pass. \n\nThese tech companies make everything so specific and incompatible with each other and they think of every nuance to squeeze more money out of you that it just makes the whole experience suck. \n\nTech is supposed to make our lives easier and better but I swear to god I spend more time troubleshooting tech and creating passwords, etc that I think life was better/easier before all this. ",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1r3x0md/cant_mirror_netflix_to_tv/"
    },
    {
        "id": "1r2tosl",
        "author": "Fun_Molasses5215",
        "title": "Love Is Blind cast member had to be hospitalised after she poured nail glue directly into her eye during the show",
        "content": "",
        "upvotes": 882,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1r2tosl/love_is_blind_cast_member_had_to_be_hospitalised/"
    },
    {
        "id": "1r4inig",
        "author": "MaybeIneffable",
        "title": "Can’t watch one serie..",
        "content": "Im going on a 10 hour plane ride tomorrow and I want some series downloaded of course. I had my fathers account and was going to download serie A but it didn’t work beacuse everyone else also downloaded stuff. \n\nI changed account to my mothers and started downloading. I then looked for serie A but couldn’t find it, I went to google and found it that way back on the app. But without any episodes or a download button? \n\nI tried pressing play but I got a message ”internet problems”. LIKE WHAT? is it internet problems with only this serie on only my mothers account? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r4inig/cant_watch_one_serie/"
    },
    {
        "id": "1r3gml2",
        "author": "DJ-Praxis",
        "title": "Twilight of the Gods was AWESOME",
        "content": "But it was INCREDIBLY NSFW. I don't mind that personally at all- that's how the myths go. But I definitely do understand why it got canceled. It dives straight into some of the most uncomfortable themes that the Myths were originally all about. Not to say there is one true interpretation of the individual Gods, but the Thor we get in TotG is written waaaaay more like the Thor of old, a far cry from the Marvel Thor the majority of modern consumers are more used to.  \nThat's just one example. The Myths are filled to the brim with murder, torture, damnation, war, death just to name a few of the more... comfortable examples.   \nI hope it gets picked back up. I want to see the next chapter of the story. And I absolutely believe it stands well on it's own as a fantastic take on the stories. ",
        "upvotes": 44,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r3gml2/twilight_of_the_gods_was_awesome/"
    },
    {
        "id": "1r4dk65",
        "author": "StandCommon8051",
        "title": "is there any way to bypass the “drive isn’t a part of the household” on a mac?",
        "content": "I used to just turn off my wifi and load it onto my chrome browser and it would load and work, but that suddenly isn’t working anymore. i can’t send an email to watch temporarily. if there are any solutions out there please let me know! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r4dk65/is_there_any_way_to_bypass_the_drive_isnt_a_part/"
    },
    {
        "id": "1r3j63x",
        "author": "messengers1",
        "title": "'The Empress' Makers Set Historical Epic 'Witches' at Netflix",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r3j63x/the_empress_makers_set_historical_epic_witches_at/"
    },
    {
        "id": "1r40pd7",
        "author": "Dependent_Ad5216",
        "title": "english subtitles only in the preview",
        "content": "Hi,\n\nI started watching the movie \"Operation fortune\" and when I mouseover the preview I see english subtitles while the video is running. But in the movie itself I can only choose German, my mother language. Is this a bug or is there any way to fix this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r40pd7/english_subtitles_only_in_the_preview/"
    },
    {
        "id": "1r48tge",
        "author": "Miserable_Fig860",
        "title": "Why do I still have black subtitles?",
        "content": "I was watching series on Netflix and I saw that you can change how the subtitles look. So I played with it and when I’m done I put it to back to the original but it still had a black background. I tried many times to press the original but it still didn’t work so I thought if I ignore it, it will go back to the original but it’s still the same. (none of the episodes I watched before this incident had a black background)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r48tge/why_do_i_still_have_black_subtitles/"
    },
    {
        "id": "1r3zv16",
        "author": "firey_88",
        "title": "Valentine’s day movie suggestions?",
        "content": "Valentine’s Day is coming up and I’m trying to plan a cozy night in. I don’t want something too cheesy, but I also don’t want a super sad breakup movie.\n\nWhat’s a good Netflix movie that feels romantic but still has a good story? Any hidden gems you think are perfect for a date night?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r3zv16/valentines_day_movie_suggestions/"
    }
]