[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 43,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qakmje",
        "author": "Sudden_Pop_2279",
        "title": "‘KPop Demon Hunters’ Wins Golden Globes for Best Animated Feature and Best Song",
        "content": "",
        "upvotes": 65,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qakmje/kpop_demon_hunters_wins_golden_globes_for_best/"
    },
    {
        "id": "1qaht5l",
        "author": "RevolutionaryRub6553",
        "title": "Why is Netflix recommendations so bad?",
        "content": "I was scrolling through YouTube shorts, this is where I find **actual** good shows and movies to watch and it's pointed me to so many good shows and movies on Netflix that I don't actually get recommended for, I only find them after I've searched them. Literal shows and movies I've never seen or heard of on the Netflix home page. Has anyone else noticed this or am I just picky? ",
        "upvotes": 82,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qaht5l/why_is_netflix_recommendations_so_bad/"
    },
    {
        "id": "1qakhyr",
        "author": "Kurtz62",
        "title": "‘Adolescence” domination",
        "content": "‘Adolescence’ was clearly the best tv show on Netflix in 2025. \n\nIt swept the Emmys and looks to be on their way to sweeping the Golden Globes. \n\nThey deserve every single award they are nominated for. \n\nComplete, total domination. \n\nOnly complaint: they’re beating ‘The Beast in Me’ which I thought was an incredible show as well. ",
        "upvotes": 32,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qakhyr/adolescence_domination/"
    },
    {
        "id": "1qa6yu9",
        "author": "RiskAndReason",
        "title": "“Wait… you STILL haven’t watched this?!”",
        "content": "It’s 2026 and there are still some iconic shows or movies people somehow missed.\n\nDrop your best “How have you not watched this yet?” recommendation and tell us why it’s a must-watch.",
        "upvotes": 101,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1qa6yu9/wait_you_still_havent_watched_this/"
    },
    {
        "id": "1q9n7yj",
        "author": "hasanahmad",
        "title": "Netflix is now the Walmart/Amazon of entertainment media",
        "content": "You can find a lot . You can find sporadic quality , a lot of trash but America is all over it everyday. It’s way too big to fail at this point after after the competitors came in and all have flatlined to be barely there or rarely competing ",
        "upvotes": 1496,
        "comments": 176,
        "media": null,
        "permalink": "/r/netflix/comments/1q9n7yj/netflix_is_now_the_walmartamazon_of_entertainment/"
    },
    {
        "id": "1qagrhr",
        "author": "Hot_Purple_7082",
        "title": "His &amp; Hers",
        "content": "Am I the only one who expected the ending? The mom’s energy seemed off the entire show, but that could just be me being hyper observant.\n\nAll in all it was a good show, I just definitely thought it was the mom",
        "upvotes": 19,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qagrhr/his_hers/"
    },
    {
        "id": "1qajxjj",
        "author": "Salty_Low_4081",
        "title": "His &amp; Hers question",
        "content": "Spoiler so stop reading if not done. Why did Lexie’s husband buy all that kill kit stuff? If Lexie didn’t kill the other 3 why were they going to kill Anna? And what was the original plan before the hotel got cancelled?",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qajxjj/his_hers_question/"
    },
    {
        "id": "1qa4r9w",
        "author": "OkCartographer4028",
        "title": "I can’t connect with “The Diplomat”",
        "content": "I’m currently on season two of “The Diplomat” and something about this show is just not doing it for me. I can’t take it seriously. I can’t tell if it’s comedy or goofy drama or it’s just plain boring and dumb. I’m just holding on because I’m a huge fan of Keri Russell. Everyone recommends it but it’s a miss for me. I felt the same way about “The Recruit”. \n\nWhat am I missing? What is it about the show that’s not connecting? Anyone else feel this way? Those who love it, pls tell me why you love it, maybe I can watch it from a different perspective. ",
        "upvotes": 33,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1qa4r9w/i_cant_connect_with_the_diplomat/"
    },
    {
        "id": "1qakuk7",
        "author": "121scoville",
        "title": "It's me. I'm the person binge-watching all the Harlan Coben series.",
        "content": "I haven't been subscribed to Netflix for almost five years and just re-upped. Apparently I'm the mood for mid formulaic thriller limited series. Now that I've exhausted the HC supply, is there similar stuff to move on to? (Certainly wouldn't mind BETTER. But hopefully of the same \"vibe\"). Tried Beast in Me but Claire Danes was stressing me out. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qakuk7/its_me_im_the_person_bingewatching_all_the_harlan/"
    },
    {
        "id": "1qalzql",
        "author": "Elmer-J-Fudd",
        "title": "Unlocked: A Jail Experiment S2",
        "content": "What self governance tools could the inmates be briefed on to give them the greatest chance for success?\n\nHow could new inmates be integrated to reduce the risk to the self governance of the community?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qalzql/unlocked_a_jail_experiment_s2/"
    },
    {
        "id": "1qa6kck",
        "author": "sarahal3xis",
        "title": "His &amp; Hers",
        "content": "Spoiler!! I thought the show was really good but I haven’t seen anyone questioning why they didn’t go after the men. Ik the show was focused on the female friend group but I think the men deserved just as bad if not worse.",
        "upvotes": 23,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qa6kck/his_hers/"
    },
    {
        "id": "1qam5dn",
        "author": "humblebragphotog",
        "title": "HIS&amp;HERS (spoilers)",
        "content": "Just finished watching His &amp; Hers and I’m curious - this post is for all the moms in the building - how did you feel about the way the show ended? As a mother, is that an extent you could comfortable go to for your child? \n\nPS. If revenge and vengeance ain’t your game please don’t share your opinions 🤭",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qam5dn/hishers_spoilers/"
    },
    {
        "id": "1qa52zb",
        "author": "Independent-One-5164",
        "title": "Shows like 3 body problem and plaribus, shows about aliens",
        "content": "I'm looking for shows that discuss about Fermi paradox,aliens,type civilizations,dark forest theories etc..\n\nThe 2 series I absolutely got obsessed with, I binged watch both in a day.i want series that ca  hook me up like that,especially stuffs with aliens,alien attack,invasion etc..any hidden gems or series?​",
        "upvotes": 16,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qa52zb/shows_like_3_body_problem_and_plaribus_shows/"
    },
    {
        "id": "1qaj59c",
        "author": "noorf360",
        "title": "Just getting started on Netflix—looking for some thriller, suspense, or mystery picks. Anyone got a list of must-watch shows or movies?",
        "content": "Hey everyone! I’m just getting started on Netflix and I’m on the hunt for some solid thriller, suspense, or mystery shows and movies. I love stuff that keeps me guessing, with twists that actually surprise me, edge-of-your-seat moments, or clever detective work. I’ve seen the big names like Sherlock Holmes and Shutter Island, but I’d love recommendations for hidden gems or binge-worthy series too. What are your must-watch picks that will keep me hooked and questioning everything until the very end?",
        "upvotes": 2,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qaj59c/just_getting_started_on_netflixlooking_for_some/"
    },
    {
        "id": "1q9thpg",
        "author": "abriellecaton",
        "title": "His &amp; Hers",
        "content": "I had to write about this somewhere. This show is AMAZING!  If you love detective/crime WATCH THIS SHOW!  Plot twist and a good storyline with good actors and characters.  AMAZING. ",
        "upvotes": 100,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1q9thpg/his_hers/"
    },
    {
        "id": "1qaoyd8",
        "author": "Effective-Today2992",
        "title": "[NO SPOILERS] Prerequisites for DARK",
        "content": "I'm thinking to watch Dark. I've heard that it's really mind boggling, so what are the things I should keep in mind before I start watching? Like something to keep my attention on and not to miss, or any science time travel concept or something...",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qaoyd8/no_spoilers_prerequisites_for_dark/"
    },
    {
        "id": "1qandx6",
        "author": "sexymawma",
        "title": "Unlocked : a jail experiment",
        "content": "Where did the tall bald guy that brought the drugs into the pod go ?? I know I'm not crazy? He was there and then he wasn't. Did they purposely place him into the pod to get the guys high? He wasn't present at the search nor was he present at the meeting held by the guys. He literally just disappears. Please tell me someone else noticed this lol",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qandx6/unlocked_a_jail_experiment/"
    },
    {
        "id": "1qafb1t",
        "author": "njakwow",
        "title": "The Lazarus Project",
        "content": "We binged The Lazarus Project over the last week. Wow, what a different take on time travel. It's a completely different concept and gets more and more complicated every episode. \n\n2 seasons / 16 episodes. No fillers, all very tight and action packed.   \n\nSatisfying ending but leaves the door open to more.\n\nIt leaves Netflix just before the end of the month. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qafb1t/the_lazarus_project/"
    },
    {
        "id": "1q9mjlu",
        "author": "Famous-Donut-2394",
        "title": "What was the WORST Ending to A Netflix Original Series??",
        "content": "Just throwing it out there, since I have seen people complain about many Netflix shows ending. Cancelled series do NOT count (ex. Lockwood &amp; Co.) Neither do unfinished series (Wednesday, OBX etc.)",
        "upvotes": 149,
        "comments": 315,
        "media": null,
        "permalink": "/r/netflix/comments/1q9mjlu/what_was_the_worst_ending_to_a_netflix_original/"
    },
    {
        "id": "1qacai8",
        "author": "Its_ria_",
        "title": "His &amp; Hers",
        "content": "It was binge-able sure but…eh I like Jon Bernthal’s acting in other shows but omg for a “detective” he was doing EVERYTHING wrong in the show trying not to look suspicious which pissed me of lol also while I like the whole “vengeance” thing at the end the last 20 min of the killer reveal was so rushed it reminded me of something you’d see in one of Tyler Perry’s movies 🫩",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qacai8/his_hers/"
    },
    {
        "id": "1qak8xi",
        "author": "PaleontologistNo9283",
        "title": "Error code O7037-1103-400",
        "content": "I keep getting this error code while watching Breaking Bad its the only show/movie it happens on. cant watch more than 30 seconds of the show before it pops up. Says \"please check your internet connection and try again\" but i never disconnect from the internet. Has anyone else had this problem and if so is there a fix??",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qak8xi/error_code_o70371103400/"
    },
    {
        "id": "1qa48sb",
        "author": "Kshiti_salman",
        "title": "Is it just me or Georgia accent is too annoying and overstretched? (GINNY AND GEORGIA)",
        "content": "Whenever I hear Gerogia voice, it seems like a fake and elongated not amusing accent, does she have a default accent like that? It kind of just seems annoying to hear. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qa48sb/is_it_just_me_or_georgia_accent_is_too_annoying/"
    },
    {
        "id": "1qae289",
        "author": "ZenBacle",
        "title": "How to Stream 4k on your PC.",
        "content": "I saw this come up again in a post, and there isn't a lot of good info out there on how to fix 4k streaming... so here's what worked for me.\n\nThe issue is that all streaming sites limit quality to prevent people from *'the unmentionable act of yo hoing and yarring with a parrot on your shoulder that gets your post auto moded'*. They do this through a few different types of DRM. Most notably AV1, HEVC, and Playready.\n\nCurrently the only browser capable of being DRM compliant is Microsoft Edge. To see if you are DRM complaint type \"Edge://gpu\" into your MS edge address bar and look for this section\n\n    Media Foundation Rendering Capabilities\n    =======================================\n    PlayReady Hardware DRM disabled: false\n    Direct Composition             : true\n    Dolby Atmos support            : false\n    AV1 installed                  : true\n    AV1 activable                  : true\n    AV1 version                    : AV1:2.0.6.0\n    HEVC installed                 : true\n    HEVC activable                 : true\n    HEVC version                   : HEVC:2.4.39.0\n    Display:                       : Scaled: [0,0 1920x1080] Scale: 2.00 Actual: [0,0 3840x2160]\n    GPU Index                      : GPU0\n    HEVC - Dolby Vision support    : false\n    HEVC - HDR10 support           : true\n    HDCP 2.2 support               : true\n    HEVC - 4K support              : true\n\nWhat you care about is Av1 being true, HEVC 4k being true, and Playready disabled being false (double negative, it means your hardware is not being disabled because it is playready compliant).\n\nYou can download the HEVC and AV1 codecs in the MS store if you need them. If your playread is set to true... well that's going to be a fun rabbit hole for you to go down to see if your Monitor, Cable, and GPU are PlayReady supported.\n\nHope this helps.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qae289/how_to_stream_4k_on_your_pc/"
    },
    {
        "id": "1qaiupt",
        "author": "GhoshProtocol",
        "title": "No English non SDH subtitle option , but only on Apple TV. Why is that ?",
        "content": "Strange issue on ATV.\n\nFor Stranger things , S05E01 My Samsung TV and my Roku TV apps both shows \"English\" and \"English SDH\" options .\nBut ATV only shows \"English SDH\" option , no non  sdh option .\nThis is true for other titles too , like the latest Knives out movie . Why is that?\nThis is so annoying as I just want a plain subtitle and not a subtitle littered with [birds chirping ] throughou",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qaiupt/no_english_non_sdh_subtitle_option_but_only_on/"
    },
    {
        "id": "1q9o2l9",
        "author": "NoEstablishment205",
        "title": "Homeland",
        "content": "How on earth am I just now watching Homeland!?! I have been hooked. I love Claire Danes anyways but wow. Great acting. Great plot. They don’t make shows like this anymore. ",
        "upvotes": 72,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1q9o2l9/homeland/"
    },
    {
        "id": "1qagwj0",
        "author": "DuxxieDings",
        "title": "did anyone else like the adult animations arcane, wolf king and blue eye samurai?",
        "content": "I loved them! I hope Blue Eye Samurai finished up well with its 2nd season! Wolf King and Arcane wrapped up with 2 seasons! I hope there will be more animations like those 3 that aren't kiddy and dumbed down. I love my animated stories i can watch without kids and with other adults. People in real life love those 3 adult animated shows and I hope there will be more shows like Arcane, Wolf King and Blue Eye Samurai!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qagwj0/did_anyone_else_like_the_adult_animations_arcane/"
    },
    {
        "id": "1q9yi25",
        "author": "Only-Author-7067",
        "title": "Best Netflix Shows of All Time",
        "content": "What’s the best Netflix show of all time that you’ve watched. \n\nI loved the crown, the bodyguard, the queen’s gambit, the night agent, one day and stranger things.  ",
        "upvotes": 10,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1q9yi25/best_netflix_shows_of_all_time/"
    },
    {
        "id": "1q8z5px",
        "author": "Deadpool-fan-466",
        "title": "What was the point of casting Linda Hamilton in Stranger things S05?",
        "content": "When I first found out about it, I thought it's gonna be interesting. Either she's gonna be an important character, or Netflix wants star power (as usual) to hype up the final season.\n\nThen it became as bland as it could be: She's the new \"Papa\", trying to restore \"the program\". She even does exactly what was shown in the trailer, shooting at Eleven &amp; co.\n\nI know that being Sarah Connor in those 2 terminator movies is the only career highlight of her, but being in Stranger things doesn't change much either (for her &amp; the show)",
        "upvotes": 1145,
        "comments": 207,
        "media": null,
        "permalink": "/r/netflix/comments/1q8z5px/what_was_the_point_of_casting_linda_hamilton_in/"
    }
]