[
    {
        "id": "1i3qboh",
        "author": "BunyipPouch",
        "title": "Join us Friday 1/24 at 3 PM ET for a live AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist'. It stars Adrien Brody, Felicity Jones, and Guy Pearce. The 3h35 epic-drama was recently nominated for 7 Golden Globes and is releasing nationwide next week.",
        "content": "",
        "upvotes": 36,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zkllw8td9mde1.jpeg?auto=webp&amp;s=e2ff5e06beea46e0088a96cabed5015e2326a2cd"
        },
        "permalink": "/r/movies/comments/1i3qboh/join_us_friday_124_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1i36zgg",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wolf Man / One of Them Days / The Last Showgirl / The Brutalist)",
        "content": "# New Theatrical Releases\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i36zgg/official_discussion_megathread_wolf_man_one_of/"
    },
    {
        "id": "1i3gynj",
        "author": "MarvelsGrantMan136",
        "title": "Official IMAX Poster for 'Captain America: Brave New World'",
        "content": "",
        "upvotes": 8828,
        "comments": 2816,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ilhqypqu8kde1.jpeg?auto=webp&amp;s=80c021b5498c7b17ee4f6ec5e051193f130d4d52"
        },
        "permalink": "/r/movies/comments/1i3gynj/official_imax_poster_for_captain_america_brave/"
    },
    {
        "id": "1i3ew7w",
        "author": "Horror_Builder_971",
        "title": "Official poster for \"Queen of the Ring\"",
        "content": "",
        "upvotes": 4006,
        "comments": 849,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0skqd7shojde1.jpeg?auto=webp&amp;s=b737bd7678c59dfce6a96a9cdbeff1f88f7adedb"
        },
        "permalink": "/r/movies/comments/1i3ew7w/official_poster_for_queen_of_the_ring/"
    },
    {
        "id": "1i3zeme",
        "author": "Bullingdon1973",
        "title": "‘What Do I Do With This Grief?’: A fascinating interview with the woman who owns Laura Palmer’s house from TWIN PEAKS, whose home has become a pilgrimage spot for David Lynch obsessives.",
        "content": "",
        "upvotes": 192,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vlIB3pp8lanlNhFsnrkpibSZGad3pu1ACunSTpCukVU.jpg?auto=webp&amp;s=859ca5c9c0770daf11ab0afbf2f1a4444bfe6479"
        },
        "permalink": "/r/movies/comments/1i3zeme/what_do_i_do_with_this_grief_a_fascinating/"
    },
    {
        "id": "1i3k9g8",
        "author": "Liquidmurr",
        "title": "Has a \"sidekick\" ever successfully taken over a movie franchise?",
        "content": "With the various opinions around if Anthony Mackie in Captain America: Brave New World, I was wondering if any movie buffs are aware of a \"sidekick\" or \"new generation\" has successfully carried a franchise forward?\n\nI am aware the new avengers set-up didn't track so well with moviegoers and reportedly has been cancelled and I can't really think of a strong even loved sidekick that has led a franchise forward.\n\nEdit: Sam/Falcon got his own spin-off show as have many characters. The character is now tasked with carrying the primary franchise \"Captain America\". I was mostly asking about instead of spin-offs having a secondary character lead the primary franchise.",
        "upvotes": 1630,
        "comments": 1330,
        "media": null,
        "permalink": "/r/movies/comments/1i3k9g8/has_a_sidekick_ever_successfully_taken_over_a/"
    },
    {
        "id": "1i3njh1",
        "author": "delugetheory",
        "title": "'Nightbitch' (2024) with Amy Adams got pretty terrible reviews and we almost skipped it but are very glad we didn't. I cannot recommend it highly enough for current and recent toddler-parents.",
        "content": "9:30pm, our three-year-old daughter is finally down, and my wife and I decide to crash on the couch and watch TV for \"20 minutes\" before switching off our consciousness for a few hours and doing it all over again.  I was an indie film nerd in my former life and am slowly getting back into it after the mind void of the first two years of parenthood.  As it turns out, that 20-or-30-minutes before lights-out every night is the perfect time to start up a weird new film and determine whether or not it's worth sticking with.  If it's intriguing, that is the film of the week and we'll watch it in three segments over the next few evenings.  If it's not, no big loss.\n\nSomething about *Nightbitch* appealed to me, probably Amy Adams and the unique premise, but I knew that it had pretty terrible reviews (and not just from casual film viewers but from indie film nerds too -- generally not a good sign).  But I suggested it to my wife, thinking that it would probably be a stinker and that we'd give it 20 minutes and then never think of it again.\n\nWrong.  We kept our eyes pried open for an hour-and-a-half to see it through to the end.  We had no choice --we were in a state of enraptured catharsis.  We have been discussing the film whenever we have a free moment for the past three days.  This ridiculous film somehow opened up a little hidden vault of empathy that my wife and I didn't know that we had for each other.  Watching it together on the couch after a day of battle did more good than ten couples counseling sessions.  That was **us** up on the screen in so many ways, and we were seeing each other and ourselves in this detached and absurd way that just melted away all of our built-up defenses.  It also made us take notice of the ways in which our individual personal strengths had averted at least some of the struggles that the on-scene couple was going through.\n\nI understand why *Nightbitch* was not popular.  As a *film*, it's no *Casablanca* or anything, just a pretty standard indie dark comedy, sometimes a little on-the-nose or messy.  For someone who has never been through the...  experience...  of toddler-parenting, I can see how it would feel like 100 minutes of nausea-inducing psychological torture with a healthy side-serving of cringe.  But, if you're going through this, or went through it recently enough that your brain hasn't smoothed over the rough edges of your memories -- this film was made for you, made for us.  And for those of you, I know that you might be thinking, \"Why would I want to see that on the screen?  That's my every day.\"  Well, that's where the artistic aspect of it all comes in.  The film presents the struggle that we all know too well in absurd, darkly humorous ways that just might give you a fresh perspective on parenting and on yourself.  And I think anyone would go a little bit easier on themselves (and their partner, should they have one) after viewing *Nightbitch*.",
        "upvotes": 1010,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1i3njh1/nightbitch_2024_with_amy_adams_got_pretty/"
    },
    {
        "id": "1i3y5br",
        "author": "Blind_Paris",
        "title": "The Rocketeer?",
        "content": "The 1991 film The Rocketeer.\n\nI need advice from those who have seen it, I have not yet seen it. However, it is my boyfriend's FAVORITE movie, and I do intend to watch it with him the next time we can find time for it. \nNow, here's the hitch; help me make it memorable for him.\n\nI want to have this as a themed movie night.\nWhat foods, drinks, snacks, comfy items, etc would you recommend me using to decorate for this movie?\nI also apologize if this doesn't go here, but I am not certain on where else to post it.\n\nThanks I'm advance! ",
        "upvotes": 147,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1i3y5br/the_rocketeer/"
    },
    {
        "id": "1i3mrhj",
        "author": "MarvelsGrantMan136",
        "title": "Official Posters for A24's 'OPUS' - A young writer is invited to the remote compound of a legendary pop star who mysteriously disappeared 30 years ago. Surrounded by the star’s cult of sycophants and intoxicated journalists, she finds herself in the middle of his twisted plan.",
        "content": "",
        "upvotes": 593,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hiw4xocxhlde1.jpeg?auto=webp&amp;s=029536bf38e0708be917dd7c5e8e5e98d3edafcc"
        },
        "permalink": "/r/movies/comments/1i3mrhj/official_posters_for_a24s_opus_a_young_writer_is/"
    },
    {
        "id": "1i3aam1",
        "author": "Aggressive-Bowl5196",
        "title": "The wife in Pursuit of Happiness is as almost completely justifiable",
        "content": "I grew up thinking the wife in Pursuit of Happiness was a bitch but as an adult, I completely understand her. \n\nThe movie tells us at the very beginning they were doing decently enough as a middle class/working class family *until* Chris invested their entire life savings into a portable bone-density scanner. A medical device whose concept and price tag would have been immediately bullshit to any sensible person. A man as intelligent as the movie sells Chris to be, would have to be extremely arrogant in order to pursue it. \n\nImagine you have a small child and your husband throws everything away on a delusional business idea. That alone alone would be justifiable enough for a divorce but to make matters worse, he refused to count his losses and get a real job to help support their family. She worked countless hours and seemed to do the brunt of the child care while he wasted all day and night trying to sell those machines. When he gives her last minute calls to tell her she’ll have to pick up their son, he is almost sociopathic in his annoyance when she complains about how it effects her job or that she won’t have any break. When she is finally at her wits end from the stress and desperation of their situation, he tells her that he wants to take a low paying internship to be a stockbroker. His wife and child were a breath away from starving on the streets while he jumps from one outlandish dream to the next. She was right to cut her losses at the moment. \n\nHer only failure was not fighting harder to keep custody of their son since she seemed to have slightly better financial stability and job security. She should not have let Christ guilt and bully her into believing their son was better off with him. Chris loved his son but a person who would selfishly allow their child to be homeless on the street so he could keep a low paying internship instead of getting a decent paying job has no right to keep custody of that child. Chris could have still been an active parent by visiting him instead of forcing his son to live that way. \n\nThe only reason why it’s heartwarming is because he got the job in the end instead of he and his son being shanked one random night while living in public bathrooms. The reward doesn’t justify the risk he took with his son’s safety just so he could be a father. ",
        "upvotes": 4976,
        "comments": 401,
        "media": null,
        "permalink": "/r/movies/comments/1i3aam1/the_wife_in_pursuit_of_happiness_is_as_almost/"
    },
    {
        "id": "1i3e8rg",
        "author": "SafeBodybuilder7191",
        "title": "Greta Gerwig has managed to get her Narnia movie a 4-week run at theatres, with more than 1000 IMAX screens being readied for the film's premiere in Christmas 2026",
        "content": "",
        "upvotes": 1900,
        "comments": 220,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W4C6qf0VeBDaJHxfEIDqDSl-gh8kXd8FLygAd_PrQk4.jpg?auto=webp&amp;s=8c34724872138b273ccb27de0cfe6b5711fd4f70"
        },
        "permalink": "/r/movies/comments/1i3e8rg/greta_gerwig_has_managed_to_get_her_narnia_movie/"
    },
    {
        "id": "1i3r29o",
        "author": "MarvelsGrantMan136",
        "title": "‘Supergirl: Woman of Tomorrow’ Adds David Krumholtz, Emily Beecham ",
        "content": "",
        "upvotes": 259,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0fBXt6Z5uGr-Nl_5oyrdRtaihhsXR2zkTjkwLCZ6X70.jpg?auto=webp&amp;s=2148bc7586923432654e8804ec03f7912172513e"
        },
        "permalink": "/r/movies/comments/1i3r29o/supergirl_woman_of_tomorrow_adds_david_krumholtz/"
    },
    {
        "id": "1i3r3hj",
        "author": "KillerCroc1234567",
        "title": "New ‘Anaconda’ Movie Ensnares Thandiwe Newton, Selton Mello, Steve Zahn, &amp; Ione Sky",
        "content": "",
        "upvotes": 158,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xErQ__HVeRNuuueBUhg2clG40u9Sui7D-0jevgz_tTc.jpg?auto=webp&amp;s=2507b2bb0f95a87920a94b75f8b71c74aa22909d"
        },
        "permalink": "/r/movies/comments/1i3r3hj/new_anaconda_movie_ensnares_thandiwe_newton/"
    },
    {
        "id": "1i3l6t9",
        "author": "NoCulture3505",
        "title": "‘Gladiator II’ Gets Paramount+ Streaming Release Date (Jan 21st)",
        "content": "",
        "upvotes": 342,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/98RjDVk8rS8i_LTd2wNl37B6WY9YRkrZPDFTCy5duVA.jpg?auto=webp&amp;s=102b30e686970c1f5b7c9892f87ac3a9fd7ea6b4"
        },
        "permalink": "/r/movies/comments/1i3l6t9/gladiator_ii_gets_paramount_streaming_release/"
    },
    {
        "id": "1i3hpar",
        "author": "ExpertAvocado3",
        "title": "You are remaking Face/Off in 2025. Who are you casting?",
        "content": "Face/Off is one of the most iconic action movies ever, where two enemies swap faces in a mind-bending game of identity and revenge. If you were tasked with remaking it today, who would you cast to bring the same intensity, drama, and over-the-top action to this epic story and why? Cage and Travolta were so iconic in the 90s and the versatility of them both playing good and bad was epic. Let’s hear your picks!",
        "upvotes": 397,
        "comments": 1162,
        "media": null,
        "permalink": "/r/movies/comments/1i3hpar/you_are_remaking_faceoff_in_2025_who_are_you/"
    },
    {
        "id": "1i2vhjn",
        "author": "MarvelsGrantMan136",
        "title": "David Lynch, Visionary Director of ‘Twin Peaks’ and ‘Blue Velvet,’ Dies at 78",
        "content": "",
        "upvotes": 47940,
        "comments": 2482,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NdWt9zeBXvvp-yWkQwLur6Mta6phoo4BICyTBoF-UdQ.jpg?auto=webp&amp;s=2319f9a4496a489baa4e3c1f34ac40ff990cc1a5"
        },
        "permalink": "/r/movies/comments/1i2vhjn/david_lynch_visionary_director_of_twin_peaks_and/"
    },
    {
        "id": "1i3jxe6",
        "author": "CapWild",
        "title": "What's your favorite Black and White movie? ",
        "content": "I feel that the newer generations really miss out on some great films just because of the stereotype associated with being old. Feel that way about musicals too, but for another discussion...\n\nWith that being said, I'm thinking Duck Soup.  I'm mostly comedies.  Marx Brothers verbal banter and clever usage of of word play is right up my alley.  When I try to convince people to watch it/them, I tell people Ryan Reynolds is Groucho reborn.",
        "upvotes": 205,
        "comments": 1220,
        "media": null,
        "permalink": "/r/movies/comments/1i3jxe6/whats_your_favorite_black_and_white_movie/"
    },
    {
        "id": "1i3negq",
        "author": "SyristSMD",
        "title": "Which movie moment gave you the biggest \"wow\" reaction?",
        "content": "So this could be a scene in a movie that completely left you speechless and in total awe when you first saw it. It could be a scene that was so well executed that it blew your mind. Maybe an unexpected twist that completely turned the plot on it's head. Or perhaps a huge reveal that you didn't see coming.",
        "upvotes": 129,
        "comments": 704,
        "media": null,
        "permalink": "/r/movies/comments/1i3negq/which_movie_moment_gave_you_the_biggest_wow/"
    },
    {
        "id": "1i3l7r6",
        "author": "mrlilhobbes",
        "title": "The Village, by M. Night Shyamalan, one of my favorite films",
        "content": "*The Village* by M. Night Shyamalan is one of my all-time favorite films. It’s a film I feel is highly underrated and doesn’t get enough credit for its depth and complexity. For me, it’s a cinematic gem that dives into the human psyche, exploring how fear shapes societies and personal identities in a way that few films dare to.\n\nAt the heart of The Village is its exploration of fear—not just the fear of the unknown or the creatures in the woods, but fear as a tool of manipulation. &gt;!The Elders intentionally cultivate this fear to control and limit the villagers’ lives.!&lt; Fear isn’t just an emotional response to a threat; it’s a driving force in the village, shaping everything from their beliefs to their behavior. What makes this film so powerful is how it shows fear as both a societal construct and a personal experience. The fear instilled in the villagers dictates their choices, confines them to the “safe” world they know, and even affects those who perpetuate the fear. This dynamic reinforces the chilling truth that the fear we’re taught to embrace can sometimes be more damaging than the very threats it’s meant to protect us from.\n\nOne of the most compelling aspects of the film is Ivy, the blind protagonist. At first, her blindness might seem like a disadvantage, but as the story unfolds, it becomes a symbol of strength and resilience. Ivy represents the idea that even when we are “blind” to the truth, we still have the ability to overcome obstacles. &gt;!In fact, her blindness becomes an asset, allowing her to see past the lies the village has been built on. She’s able to question what others blindly accept as truth, and in doing so, becomes the hero of the story.!&lt;\n\nWhat really stands out to me is the way the film builds up the fear of the monsters. Throughout the movie, we, like Ivy and the rest of the villagers, are terrified of these creatures. The idea of the monsters becomes so much scarier than the monsters themselves. The fear is what’s truly terrifying, not the actual beings. &gt;!The Elders have carefully crafted this fear to maintain control, and the film does a great job of showing how fear can be more powerful than reality itself. When we finally see the “monsters” for what they really are, it’s a revelation—not just for Ivy, but for the audience. It’s in this moment that we see how much the villagers have been lied to, and it’s a powerful shift in perspective.!&lt;\n\nThere’s so much more I could touch on, but these are just a few of the key reasons I believe The Village is a masterpiece. It’s a film that’s layered with symbolism, thoughtful commentary, and emotional depth.\n\nA few other things I love:\n\n* The muted colors throughout the film, which create a sense of isolation, and the use of &gt;!red!&lt; as a symbol of danger and warning.\n* The haunting score, especially the violin solos that not only enhance the emotional weight of the story but also promote a sense of silence that mirrors the isolation of the village.\n* &gt;!The fact that even when the truth is revealed, the villagers continue living in this world of fear. It’s a stark commentary on how difficult it can be to break free from a reality that has been ingrained in us, even when the truth is fully understood.!&lt;\n\nIf you haven’t watched *The Village* in a while, I highly recommend giving it another chance. It’s a film that challenges you to think deeply about the nature of fear, control, and how we shape our own perceptions of the world around us.\n\n(This is my first post, so I’m not sure if I used too many spoiler bars. Even though the film is over 20 years old, I wanted to ensure this review doesn’t spoil anything for those who haven’t yet had the chance to experience it.)",
        "upvotes": 140,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1i3l7r6/the_village_by_m_night_shyamalan_one_of_my/"
    },
    {
        "id": "1i40iaq",
        "author": "Mundane-Turnover-913",
        "title": "(Theory) Escape from New York and L.A are in the same universe as Evil Biff's Back to the Future II",
        "content": "We see that in Back to the Future Part II (1989), that old Biff Tannen steals the time machine and uses it to go back to 1955 and give the Sports Almanac to his younger self, introducing a new much darker timeline that significantly changes world history. The world presented to us in this alternate timeline could even be described as dystopian, which isn't surprising given the easter eggs we see in the film. We find out that in this timeline, the Vietnam War continues deep into the 1980s, and Richard Nixon isn't exposed in the Watergate Scandal (likely do to Biff who probably is friends with Nixon in this timeline), meaning Nixon abolishes that two term limit and continues to be president by 1985 (ala Watchmen).\n\nIn the Escape From movies including Escape from New York (1981) and Escape from L.A (1996), we know that America seemingly goes right down the crapper for reasons never fully explained to us. We know that in 1988, the crime rate in the US has risen by a whopping 400%, in the midst of what can only be described as World War III. In this timeline, the Soviet Union continues to be a dominant world power and forms a powerful alliance with China against the west. We know this has escalated into a full war, since it's mentioned that Snake Plissken flew in Leningrad, which is obviously enemy territory, and Hauk even mentions that they're at war. For reasons unknown, this war doesn't go nuclear, but maybe they signed some type of mutual agreement, who knows.\n\nEither way, we never find out why in the Escape From universe, these historical events are so drastically different to our own. Why does tension between the US and the Soviet Union escalate to the point of war by the late 80s? I think if we apply the Back to the Future II timeline, it suddenly makes a lot of sense. In a timeline where Biff attains wealth and power, he befriends President Nixon (a man who we know deliberately sabotaged the war effort in order to get elected), and uses his wealth to keep Nixon's scandals hidden from the public, maybe with the idea that Biff himself will run for President one day. We also know as mentioned earlier that because of this alliance, the war in Vietnam doesn't end in 1975, but rages on a decade longer. It's not too hard to believe that these events would cause a timeline where the Soviets more directly begin warring with America. Clearly, peace cannot occur in a timeline where Biff and Nixon are controlling America.\n\nAnother thing, is that Escape From New York shows crime rates have risen by 400% in the US. In BTTF2, we see that crime rates have clearly risen. Biff has bought out the police department and clearly little to no criminals are actually being arrested, likely the only people being arrested are Biff's business or political opponents. I mean we see that things like drive-by shootings happen on a regular basis and fucking TANKS are just rolling down the street, almost like Hill Valley has become a war zone. It's not hard to think that THIS is where the crime rates rise by 400%, because of Biff and Nixon corrupting America beyond recognition.\n\nWhy then, you might be wondering, do we not see or hear about Biff in either of the Escape From movies? Simple: he's dead. It was revealed at some point that eventually the abused and practically enslaved Lorraine, sees no way out of her situation than to simply kill Biff, which she does by shooting him in 1996, shortly after she discovered his involvement in George McFly's murder. Escape From New York takes place in 1997, meaning Nixon and Biff would both be dead, Nixon in 1994 and Biff in 1996. The world we see in the Escape From movies, is a world permanently damaged by their combined power. America may have a new President by 1997, but it doesn't matter, the damage has been done, and the new President was shown to be a fairly artificial person by film's end anyway, meaning America is far from the road to recovery.\n\nAnother interesting detail to note is that Buck Flowers was in both Escape from New York and Back to the Future. In one he plays an inmate who Snake initially believes is the kidnapped POTUS but turns out to be a drunken prisoner. In BTTF he plays the former Mayor of Hill Valley: Red Thomas, and eventually becomes Red the Bum by the 80s. What if Biff sent Red to the New York prison due to vagrancy outside his Tower, or plain old wanting to get rid of old politicians? Maybe in this alternate timeline, Red attempts to run for Mayor again and actually gains popularity due to being more of a representation of the common American that the Nixon-Tannen Administration neglect. So, they conspire to have him arrested and sent to the New York prison. Maybe that's why he thinks he's the President in Escape From New York. He's recalling his days as Mayor.\n\nAnother thing I noticed was the newspaper reporting George's murder mentioned the Indian Wounded Knee Occupation of 1973. While that is period accurate, it could also tie into Escape From New York, since the World Trade Center is actually occupied by Native American criminals. Maybe in this timeline, the Wounded Knee Occupation went on longer because of Biff having the President's ear, resulting in Natives continuing to protest against the US government, and eventually ending in many Natives being arrested and sent to New York. There they take over one of America's greatest symbols as a further sign of protest. \n\nIn Escape From L.A, we even find out that an earthquake in 1998, completely separates Los Angeles from the rest of the continental United States. Hill Valley is in Caifornia, and President Uncle Ben mentions that LA held the most so-called sinners, and that the earthquake was God punishing the wicked. If LA isn't that far from Hill Valley, which is where this entire timeline revolved around, it's not surprising that LA would be equally if not more crime-ridden.\n\nIn short, in this timeline, Biff Tannen befriends Nixon, keeps him from becoming scandalized and allows the Vietnam war to rage on until at least 1988. War with the Soviet Union and China ensues, and crime rates rise by 400% due to the government's focus on their problems overseas, combined with general negligence. When Nixon and Biff die in 1994 and 96, a new President is elected who is also vain and because of Snake switching tapes at the end, peace is not made, and the war rages on, eventually leading to a tyrannical theocratic dictator of a President to take power, and leaving Earth with only one realistic route to peace: using the Sword of Damocles satellite to rid the world of it's power, and start the world over again with a clean slate.",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1i40iaq/theory_escape_from_new_york_and_la_are_in_the/"
    },
    {
        "id": "1i3d1cb",
        "author": "CriesWhenEjaculates",
        "title": "Dame Joan Plowright dies at 95",
        "content": "",
        "upvotes": 484,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e8CruVqads_UU4QhLf8XGcFgtjO7fxYuan9W35PxETg.jpg?auto=webp&amp;s=c89f12d6440ecb044acdec9c5679b7f5da070633"
        },
        "permalink": "/r/movies/comments/1i3d1cb/dame_joan_plowright_dies_at_95/"
    },
    {
        "id": "1i3krjg",
        "author": "Puzzled-Tap8042",
        "title": "‘One Of Them Days’ Review: Keke Palmer-SZA Physical Comedy Highlights Pure Comic Premise",
        "content": "",
        "upvotes": 118,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sgldjN-xMHB4ew7A2MKU0Wq94hbV_QFHXlXcIfmIuNo.jpg?auto=webp&amp;s=968af4acddb133622aa759f0d57e3f94ad931aae"
        },
        "permalink": "/r/movies/comments/1i3krjg/one_of_them_days_review_keke_palmersza_physical/"
    },
    {
        "id": "1i42932",
        "author": "DemiDevil69",
        "title": "Movie reccs for a good cry ",
        "content": "Look I’ve been on a emotional roller coaster where I feel like I’ve lost all emotions and I need to feel something and get a good cry on\n\nHere’s some things that make me cry\n\n• Family - Complicated family relationships make me cry\n\n• Community - People finding comfort within a community\n\n• Complicated relationship among friends \n\n• Old people - Kind of self explanatory \n\nI’m pretty open to movies so maybe drop some of the movies that made you cry too!",
        "upvotes": 8,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1i42932/movie_reccs_for_a_good_cry/"
    },
    {
        "id": "1i3ul51",
        "author": "ben_watson_jr",
        "title": "Diabolik ",
        "content": "Amidst the kaleidoscopic backdrop of the psychedelic 60s, a shadowy figure emerges, wielding a devilish charm and a penchant for chaos. Diabolik, the notorious thief, orchestrates a symphony of mayhem across a nameless European landscape, driven by a lust for wealth and a thirst for adrenaline. Alongside his seductive accomplice, they dance through a world of danger, their clandestine escapades fueled by a desire for thrills and riches. But as the stakes escalate and adversaries close in, Diabolik finds himself entangled in a high-stakes game of cat and mouse, where every twist and turn could spell either triumph or downfall.\n\nStarring: John Phillip Law, Marisa Mell, Michel Piccoli\n\nDirected by: Mario Bava",
        "upvotes": 26,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yhgp1JEv-BHHFTPyTvc_TJVibZMAobgV-fXc2irs7eY.jpg?auto=webp&amp;s=3d02290b58224e73549857385a7926a6688377c6"
        },
        "permalink": "/r/movies/comments/1i3ul51/diabolik/"
    },
    {
        "id": "1i3yg9z",
        "author": "SensitiveExpert4155",
        "title": "The Rose of Versailles - Trailer",
        "content": "",
        "upvotes": 16,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yIumZL5Z5fD_jxjPMXDSqkLMRBQ6Xw4VB7TjFxSp7Rc.jpg?auto=webp&amp;s=d9cd704198544e5dac9a629161fd9afda6426b60"
        },
        "permalink": "/r/movies/comments/1i3yg9z/the_rose_of_versailles_trailer/"
    },
    {
        "id": "1i2ohzo",
        "author": "MarvelsGrantMan136",
        "title": "Conan O’Brien to Receive 2025 Mark Twain Prize for American Humor",
        "content": "",
        "upvotes": 9173,
        "comments": 324,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1-mYRAHyidcNIph78xyuYV-Z5Ye8a1XfdjhVFZKjCE4.jpg?auto=webp&amp;s=593ce28c1e49284e2208383285775d39a7c68a24"
        },
        "permalink": "/r/movies/comments/1i2ohzo/conan_obrien_to_receive_2025_mark_twain_prize_for/"
    },
    {
        "id": "1i3xhnt",
        "author": "PapaBlemish",
        "title": "Movies About Tudor England for Kids",
        "content": "My tween is really into the musical \"Six\" but I'd like to introduce them to some more historically accurate movies (and TV?) about Henry VIII. I know they won't go for something like \"A Man for All Seasons\" and they're not quite old enough for \"The Tudors\". The only other movie I can come up with is \"The Other Boleyn Girl\". What suggestions might the hive mind have?",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1i3xhnt/movies_about_tudor_england_for_kids/"
    },
    {
        "id": "1i3tdse",
        "author": "Odd_Advance_6438",
        "title": "I really dig the opening scene of the movie Sucker Punch.",
        "content": "I love all the openings of Snyders films, each one is basically the highlight of their respective movie.\n\nSucker Punch has a great one, Sweet Dreams is played in the background in an awesome rendition as it sets the stage of how Babydoll ends up in the asylum.\n\nIt’s overly dramatic, it’s edgy, it’s very 2010s, but I really like it, especially with the title card of the rain on the car window. Aesthetically the whole thing is perfect. I like this grungy shithole version of the 1940s we see in the main reality of this movie, and how it contrasts to the colorful extravagance we see later on",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1i3tdse/i_really_dig_the_opening_scene_of_the_movie/"
    },
    {
        "id": "1i2tkbw",
        "author": "cmaia1503",
        "title": "Joel McHale Joins ‘Scream 7’ As Sidney Prescott’s Husband Mark",
        "content": "",
        "upvotes": 2742,
        "comments": 574,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zvKOPaBf4WwJmMdrGJVRavxOU9YERkq-E0VxoXXz5JE.jpg?auto=webp&amp;s=4b0e454f4e045568fd5aa1b2cf1e5d9c77d7115a"
        },
        "permalink": "/r/movies/comments/1i2tkbw/joel_mchale_joins_scream_7_as_sidney_prescotts/"
    },
    {
        "id": "1i42o0c",
        "author": "Brokeskull1",
        "title": "Movies suggestions for kids from the late 80s early 90s",
        "content": "I'm father who just turned 40 and I have a 5yo.\nWe love watching movies together.\nI'm trying to the of movies I watched as a young kid around her age.\nNot just the normal Disney animated movies.\n\n\nA few we have watched \n Addams Family, Richie Rich, Casper, Ninja Turtle (1990), Spice World and Home alone as well as a few others.\n\nAny suggestions so I can make an awesome list would be appreciated. Cheers.",
        "upvotes": 1,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1i42o0c/movies_suggestions_for_kids_from_the_late_80s/"
    },
    {
        "id": "1i42le7",
        "author": "Disgruntled_Oldguy",
        "title": "Confused about once upon a time in the west",
        "content": "Saw it for the the first time on Pluto TV w/ commercials and there seems to be a bunch missing or maybe I am dense:\n\n1. Mrs. McBain shoots Harminica in the night/jump cut to the day and Cheyanne is there...then Harmonica is in the barn and not injured??\n2. Morton kicks Frank iff the train, then jump cut to them on a cliffside in different clothes..how/ why are they there?\n3. How does Harmonica capture Cheyanne before the auction? \n4.  After Frank leaves town he goes to the train and everyone is dead with no explanation..wtf?\n5. Why does Harmonica get scars 1/2  way through the movie?\n6. Why does Frank send the 3 guys to kill Harmonica at the start if be didn't know who he was and why did he agree to meet him?\n7. The scenes seem out of order, esp. the mountainside cave scene and the rape scene\n8. Why is Cheyanne all of a sudden dying at the end when he seemed fine during the fight?\n\nDid the commercials on Pluto run over the movie so i missed some of the film or is it just cut really weird?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i42le7/confused_about_once_upon_a_time_in_the_west/"
    },
    {
        "id": "1i37yra",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Brutalist [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/rTsU0RWTm3mj)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/rTsU0RWTm3mj)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nWhen a visionary architect and his wife flee post-war Europe in 1947 to rebuild their legacy and witness the birth of modern United States, their lives are changed forever by a mysterious, wealthy client.\n\n**Director:**\n\nBrady Corbet\n\n**Writers:**\n\nBrady Corbet, Mona Fastvold\n\n**Cast:**\n\n* Adrien Brody as Laszlo Toth\n* Felicity Jones as Erzsebet Toth\n* Guy Pearce as Harrison Lee Van Buren Sr.\n* Joe Alwyn as Harry Lee\n* Raffey Cassidy as Zsofia\n* Stacy Martin as Maggie Lee\n* Isaac De Bankole as Gordon\n\n**Rotten Tomatoes:** [93%](https://www.rottentomatoes.com/m/the_brutalist)\n\n**Metacritic:** [89](https://www.metacritic.com/movie/the-brutalist/)\n\n**VOD:** Theaters",
        "upvotes": 322,
        "comments": 315,
        "media": null,
        "permalink": "/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/"
    }
]