[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1omvr9a",
        "author": "Ko_tatsu",
        "title": "Petardi zona mirafiori sud/lingotto",
        "content": "Esattamente qualcuno è al corrente del motivo per cui OGNI SINGOLA SERA sembra che nella zona in cui abito (tra lingotto e mirafiori sud) verso mezzanotte ci debbano essere essere esplosioni comicamente rumorose? Ormai succede così spesso che il mio cervello le filtra automaticamente",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1omvr9a/petardi_zona_mirafiori_sudlingotto/"
    },
    {
        "id": "1omenmr",
        "author": "nullstuff",
        "title": "Avvistato 64 storico (double-decker)",
        "content": "",
        "upvotes": 28,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lnvz4y7autyf1.jpeg?auto=webp&amp;s=c641e4b1adaa26e9ef88b5d88ade7c27e4ea6b73"
        },
        "permalink": "/r/torino/comments/1omenmr/avvistato_64_storico_doubledecker/"
    },
    {
        "id": "1omltyn",
        "author": "Desperate-Law-2070",
        "title": "How Torinese people take taxis?",
        "content": "with the low salarios across the city, how you can afford to take a mafia-taxi?\n\neach trip takes you 15 euros and dont even get me started if you are at the airport\n\nmamma mia che mafia\n",
        "upvotes": 9,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1omltyn/how_torinese_people_take_taxis/"
    },
    {
        "id": "1omsqo2",
        "author": "Feeling_Smile7869",
        "title": "A good public notary in Turin",
        "content": "Does anyone know a good public notary in Turin who happens to speak English? I need some legal advices about buying an apartment.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1omsqo2/a_good_public_notary_in_turin/"
    },
    {
        "id": "1omp8yp",
        "author": "Infinite-Gazelle-885",
        "title": "Aule studio a Collegno?",
        "content": "Ciao a tuttə! Qualcuno sa se ci sono aule studio a Collegno aperte tutto il giorno?\nLa biblioteca purtroppo ha orari piuttosto limitati, quindi cercavo alternative — magari anche all’interno dell’università alla Certosa Reale. Grazie 🙏",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1omp8yp/aule_studio_a_collegno/"
    },
    {
        "id": "1omf0je",
        "author": "Imaginary_Stable3987",
        "title": "Nuove Amicizie",
        "content": "Ciao raga, sono uno studente fuori sede di 21 anni e mi sono trasferito a Torino da 2 mesetti. Vorrei fare nuove conoscenze/amicizie in questa meravigliosa città. Frequento il 3zo anno di ign info al polito. Nel tempo libero mi piace fare un po' di tutto: nerdare al pc su qualche single player o multiplayer, uscire un po' a bere qualcosa, andare al cinema (adoro i film Horror)... Ho una passione smisurata per il motociclismo e anche per gli sport da combattimento. Pratico pugilato. Infine ascolto Metal (principalmente deathcore e hardcore punk) ma sono apertissimo anche all'ascolto di altri generi.  \nScrivetemi, magari abbiamo degli interessi comuni",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1omf0je/nuove_amicizie/"
    },
    {
        "id": "1omrv07",
        "author": "akkyuz",
        "title": "Spese condominiali",
        "content": "Ciao a tutti!\n\n\nDevo acquistare casa, ho trovato un appartamento che mi piace, molto spazioso che comprende anche una mansarda, circa 200 mq totali.\n\n\nIl problema sono le spese condominiali, che sono di circa 2600 euro l'anno a cui poi aggiungere il riscaldamento che è autonomo. \n\n\nLe spese includono pulizie e luce scale, ascensore, sistemazione del giardinetto condominiale, acqua.\n\n\nNon riesco a capire se considerarle di un importo giusto e dovuto all'ampia metratura dell'appartamento oppure altre.\n\n\nHelp!\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1omrv07/spese_condominiali/"
    },
    {
        "id": "1olue49",
        "author": "Aztekos",
        "title": "Napoli - Torino, primo mese. Prime impressioni.",
        "content": "Mi sono trasferito a torino con la mia compagna, e per 6 mesi staremo qui per lavoro. Sono di napoli ed ho speso il primo mese qui a torino. Ci sono alcune cose che mi hanno sorpreso non poco:\n\n1)I torinesi non sanno guidare. \n- Pensavo che a Napoli la gente guidasse male ma qua ho visto incidenti sfiorati con corsie larghissime vuote.\n- Fugroni parcheggiati letteralmente sulla striscia continua tra due corsie a senso opposto.\n- Auto che si fermano a metà incrocio immesso, improvvisamenre senza motivo.\n- Auto che invece di darti la precedenza, accellerano sfiorandoti l'auto di pochi centimetri. \n- Auto che bussano a caso senza nessun motivo.\n- Ho rimpianto napoli.\n\n2)Linea di trasporti eccellente ed allo stesso tempo poco ottimizzata. Pee andare da Bèngasi a Parco Dora per l'oktoberfest ho dovuto prendere la metro e 2 autobus, ma parliamo della stessa città. Tuttavia i mezzi che ci sono, sono eccellenti e puntuali. Complimenti per questo. Una sola metro non basta tuttavia.\n\n3) Torino è genuinamenre bella, anche le zone considerate peggiori come Aurora, sono belle e poco degradate. Napoli ha delle zone molto belle, ma quelle degradate sono terrificanti.\n\n4)Non sanno fare il pane, costa anche troppo. La pasticceria di contro è eccellente.\n\n5)Nonostante la carne sia centrale nellq cicina torinese, costa di più del pesce ma non mi pare di aver visto Marina di Torino, mi ha stupito questa cosa.\n\n6)Una città con tantissimi eventi ed iniziative interessanti, trovi sempre qualcosa da fare.\n\n7)Molto tranquilla come città, forse troppo per un napoletano abituaro al casino anche di notte.\n\n8)I torinesi che ho incontrato sono stati tutti molti aperti di mente e cordiali. Ho ricevuto molto amore, devo dire la verità.\n\n9)Diventano animali quando si deve prendere un bus.\n\nSono solo mie impressioni, o qualcosa è condivso dagli stessi torinesi?\n",
        "upvotes": 108,
        "comments": 61,
        "media": null,
        "permalink": "/r/torino/comments/1olue49/napoli_torino_primo_mese_prime_impressioni/"
    },
    {
        "id": "1omotr2",
        "author": "FutureVirtual6811",
        "title": "Can I stay outside Italy for long periods as a student in Turin?",
        "content": "Hey everyone,\n\nI’m new to Turin and recently applied for my residence permit (permesso di soggiorno) for the first time as a student. I have a question about how long I’m allowed to be outside Italy as a student.\n\nBasically, can I go back home for 4–5 months, or is there a limit on how long I can be away from Italy while holding the ricevuta and my fingerprint appointment is in april. Also note that I have a multi entry visa valid for a year.\n\nAlso, whats the rule for after I get the actual permesso? For example, once I have the permit, do I have to stay in Italy for a minimum period each year?\n\nHas anyone been in a similar situation or knows the official rule?\n\nThanks in advance!\n",
        "upvotes": 1,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1omotr2/can_i_stay_outside_italy_for_long_periods_as_a/"
    },
    {
        "id": "1omg96x",
        "author": "feddue",
        "title": "Calzolaio economico",
        "content": "Conoscete un buon calzolaio con prezzi accessibili per re-incollare una suola?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1omg96x/calzolaio_economico/"
    },
    {
        "id": "1olzy5q",
        "author": "Objective_Airline285",
        "title": "I bambini a Torino",
        "content": "Apro un thread su una cosa che non ho trovato e che mi sembra interessante non solo per me ma per tutte le famiglie con bambini piccoli. \nConsigliate i parchi gioco per bambini, belli, con tanti giochi, grandi? A Torino centro o nelle vicinanze con Pullman o tram?\nConosciamo la pellerina, parco Dora, parco Valentino, Giardino Don Gnocchi (cerco qualcosa del genere), Vittorio in lingotto. \nSinceramente mi sembra una città che ha dimenticato la sua infanzia. Non ci sono musei, spettacoli all'aperto o gratuiti, bar o ristoranti dove hanno un posto dove giocare o bellissimi spazi verdi per i nostri figli e figlie. \nAiutami a rendere il nostro soggiorno qui un momento meno triste.",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1olzy5q/i_bambini_a_torino/"
    },
    {
        "id": "1oljhso",
        "author": "Less-Animator-4648",
        "title": "Porta Susa, ma che vergogna!",
        "content": "Voglio solo dire quanto mi fa schifo vedere Porta Susa in queste condizioni.\nNon so se i bagni siano sempre chiusi, ma ogni volta che ci sono passata erano chiusi.\nIeri sera avevo davvero tanta urgenza di andare in bagno e ho dovuto camminare un bel po’ per trovare un ristorante con i servizi aperti e chiedere di poterli usare.\n\nQuindi sì, non c’è da sorprendersi se tutta la stazione puzza di piscio ed è piena di sporcizia.\nLe rotaie sono piene di spazzatura, e sinceramente è davvero triste vedere una cosa del genere.\n\nE non stiamo parlando di una stazione sperduta: Porta Susa è nel centro della città, dove passano turisti, pendolari e visitatori ogni giorno.\nCom’è possibile che una delle stazioni principali di Torino sia ridotta così male?\n\nFinché resta in queste condizioni, le persone avranno sempre meno voglia di rispettarla e tenerla pulita. È un vero circolo vizioso di degrado e indifferenza.",
        "upvotes": 75,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1oljhso/porta_susa_ma_che_vergogna/"
    },
    {
        "id": "1olxueo",
        "author": "Careful-Pea4309",
        "title": "Creepiest/Most Haunted Places in Torino?",
        "content": "Hey!\n\nWe are ***Raven and the Dark Shadows***, a rock band out of Miami Beach, and are currently planning our 2026 \"no longer halloween\" tour to promote our upcoming album, Miami Noir.\n\nWe are looking to have concerts in unique, out of the box spaces. Something like a barn, former church, dungeon, castle, ruin, field, or classic dive bar would work wonderfully. We will be filming both music video and documentary footage in these places. It doesn't have to be in the city proper, we will have a van and are willing to make the drive.\n\nSince Reddit has always been a great forum for us to find places we are wondering if you guys had any suggested small venues that could work for a small performance. We also were wondering if anyone here would like to help out and be extras in the film (we have extra masks). If interested in being an extra, please send a PM.\n\nFor those curious about our music, our bands first studio album, An Unkindness, featured members of Pearl Jam, Blink 182, Guns and Roses, and the Foo Fighters. Last year, we played Stephen Kings 75th birthday celebration. Next month, our new single, “*Dracula-New World Remix*”, will be on the new trailer of GTA-6.\n\nHope to hear some great suggestions\n\nthank you!!",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1olxueo/creepiestmost_haunted_places_in_torino/"
    },
    {
        "id": "1olyyxa",
        "author": "Alexex2010",
        "title": "Trip with my friend",
        "content": "Hi, I want to go on trip near Turin in a small village or in the land, where should I go for the week-end ? (accesible by train if possible). With beautiful scenery or in a calm place. \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1olyyxa/trip_with_my_friend/"
    },
    {
        "id": "1om3ahg",
        "author": "stanzithebig",
        "title": "Nuove conoscenze",
        "content": "M19, studierò all'its ict nei prossimi due anni e arrivo a Torino sabato 8 novembre. Sono appassionato di palestra (powerlifting) e tech, cerco modi di fare nuove conoscenze e gente con cui uscire. Ig: luciano.stanziani\n\nGrazie in anticipo per eventuali suggerimenti :)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1om3ahg/nuove_conoscenze/"
    },
    {
        "id": "1olqyy6",
        "author": "Few-Connection-8313",
        "title": "Posti ignoranti dove passare una serata a Torino?",
        "content": "Ciao! Io e i miei amici stiamo impazzendo perché non riusciamo più a trovare posti \"ignoranti\" e locali/pub a Torino e provincia dove bere e divertirsi come si deve senza dover necessariamente mangiare lì prima (conosco il Befed ad esempio ma so che bisogna tassativamente cenare li).\n\nLocali e pub dove si fa karaoke con i classiconi della musica ma dove si salta anche sui tavoli e ci si diverte.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1olqyy6/posti_ignoranti_dove_passare_una_serata_a_torino/"
    },
    {
        "id": "1olhrjz",
        "author": "Inner-Corner889",
        "title": "Un po’ di voglia di cambiare aria oggi",
        "content": "Oggi a Torino il cielo è un po’ coperto, e forse è proprio quel tipo di giornata che ti fa venire voglia di cambiare aria. Stavo leggendo qualche [articolo](https://viaggiarenelmondo.com/viaggi-dubai) su nuove mete da visitare e mi sono imbattuto in una proposta di viaggio che mi ha fatto sognare un po’. Ultimamente sto pensando se valga la pena affidarsi a qualcuno per organizzare tutto, oppure se sia meglio gestire le cose da soli. Voi come fate di solito? Preferite il fai-da-te o i viaggi già pianificati?",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1olhrjz/un_po_di_voglia_di_cambiare_aria_oggi/"
    },
    {
        "id": "1ol1dn1",
        "author": "cosyquaza",
        "title": "Nuove amicizie Torino HERE",
        "content": "Ciao, sono una ragazza di 28 anni nuova a Torino, appena trasferita per lavoro e studio! Vago per la città da qualche settimana e mi sembra abbastanza spenta in settimana, ma magari mi sbaglio (spero)\n\nSe vi va sto creando un gruppo telegram per persone nuove del posto come me, o anche chi ha voglia di conoscere nuova gente per organizzare cose easy: un caffè o un giro per mercatini, serate gioco di ruolo o da tavolo, serate film, gite nel weekend e simili.  \nSe avete bho dai 23 ai 33 anni (range ipotetico intorno alla mia età) scrivetemi pure, magari creiamo una bella community per non passare l'inverno a bere cioccolata calda da soli! \n\n&lt;3 ",
        "upvotes": 47,
        "comments": 65,
        "media": null,
        "permalink": "/r/torino/comments/1ol1dn1/nuove_amicizie_torino_here/"
    },
    {
        "id": "1olacky",
        "author": "Icy_Sand_1453",
        "title": "Bicerin",
        "content": "Where I can find the best bicerin in the city?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1olacky/bicerin/"
    },
    {
        "id": "1ol591b",
        "author": "Outside-Campaign-39",
        "title": "Nuove conoscenze che giocano nelle sale arcade? [19M]",
        "content": "Buona sera a tutti, sono 19M, cercavo compagnia per giocare prossima settimana alla sala arcade del King Bowling Funmily (sono innamorato di In The Groove 2).\n\nSe qualcuno è interessato/a, mi scriva nei DM.\n\nGrazie in anticipo :)\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ol591b/nuove_conoscenze_che_giocano_nelle_sale_arcade_19m/"
    },
    {
        "id": "1ola7vh",
        "author": "Icy_Sand_1453",
        "title": "Museo Nazionale del Cinema",
        "content": "Had anyone already visited?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ola7vh/museo_nazionale_del_cinema/"
    },
    {
        "id": "1ol015l",
        "author": "PureRaisin",
        "title": "C2C buddy",
        "content": "Sto andando al C2C da solo, sia alla serata di oggi che domani. Arrivo col treno da Trieste. Se ci sono altre persone che vanno da sole e vogliamo andare assieme, scrivetemi. \n\n\nGoing to C2C tonite and tomorrow, travelling alone from Trieste. If you are also going to C2C alone and fancy going with someone let's meet up!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ol015l/c2c_buddy/"
    },
    {
        "id": "1oksyty",
        "author": "Difficult_Leek_5693",
        "title": "È sicuro prendere l’autobus alle 5 del mattino da via Frejus e Racconigi?",
        "content": "Ciao a tutti! Sono nuovo in città e devo prendere un autobus verso l’aeroporto intorno alle 5 del mattino, partendo dalla zona di via Frejus e corso Racconigi.  \nQualcuno sa se è sicuro muoversi a quell’ora? \n\nGrazie mille!",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1oksyty/è_sicuro_prendere_lautobus_alle_5_del_mattino_da/"
    },
    {
        "id": "1okif9f",
        "author": "cake1066",
        "title": "Is Piedmontese worth studying, or just stick to Italian?",
        "content": "(Title) + sorry for the English",
        "upvotes": 8,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1okif9f/is_piedmontese_worth_studying_or_just_stick_to/"
    },
    {
        "id": "1ojzf46",
        "author": "SteamPaz",
        "title": "Una Cometa su Borgata Frassati",
        "content": "C/2025/A6 (Lemmon) a magnitudine apparente +4.2 in cielo con indice Bortle 8 (27/10/25, ore 18:30-19:00).\n\n55mm f/6.3 su sensore aps-c (Canon EOS 2000D), ISO800, 198x10s (33min).",
        "upvotes": 70,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2zepueo19yf1.jpeg?auto=webp&amp;s=751f3384dd48ddc220bdbd1d6db0b11f63a0b159"
        },
        "permalink": "/r/torino/comments/1ojzf46/una_cometa_su_borgata_frassati/"
    },
    {
        "id": "1okog4l",
        "author": "Top-Text-7727",
        "title": "Prezzi dentro al c2c?",
        "content": "Ciao, sarò al festival in questi giorni e ho scaricato la app. Quanto costeranno dentro le consumazioni?  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1okog4l/prezzi_dentro_al_c2c/"
    },
    {
        "id": "1ok34yu",
        "author": "sixlaneve4_0",
        "title": "Lungo dora Firenze.",
        "content": "Per chi è di Torino.\nNon entro nei dettagli, ma lungo dora Firenze - zona Aurora, che zona è?\nHo trovato un annuncio per una casa per studenti al n'31, ma su Google Maps, mi sembra più una pseudo casa popolare.",
        "upvotes": 3,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1ok34yu/lungo_dora_firenze/"
    },
    {
        "id": "1ok7m1b",
        "author": "Wyvern57",
        "title": "M1S non accetta pagamento con carta?",
        "content": "Ciao, mi è scaduto l’abbonamento sulla tessera BIP e non intendo rinnovarlo.\nQualche sera fa ho preso un sostitutivo della metro e nessuna delle due obliteratrici ha accettato la mia carta. \n\nSono stato sfortunato o sono tutti così? \nQuali altre linee hanno questo problema?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ok7m1b/m1s_non_accetta_pagamento_con_carta/"
    }
]