[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oe1sq9",
        "author": "dommimommyy",
        "title": "The Perfect Neighbor",
        "content": "After a quick search I see this documentary has been talked about quite a bit here, but the one thing I haven’t seen mentioned is the fact the documentary is almost entirely filmed on police body cam.\n\nI personally found this fascinating as someone who enjoys seeing live clips, police interviews, especially when tied into a documentary.  (For me it adds an extra layer of “realness” to the documentary.)\n\nI wonder if we will see more true crime documentaries filmed this way with the advancements of technology and body cam footage etc. I think the documentary was beautiful put together and even with majority of the documentary being on body cam footage, it still told a very clear story.\n\nCurious to know anyone’s thoughts on this? Did you think the body cam footage made things “too real”? Invasion of privacy? Would you like to see more true crime documentaries that include police body cam footage etc?\n\nTIA! 💋",
        "upvotes": 99,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1oe1sq9/the_perfect_neighbor/"
    },
    {
        "id": "1odbsqb",
        "author": "Warm-Barracuda3302",
        "title": "‘I’ve been in tears’: Ajike Owens’ cousin opens up after ‘reliving’ her death in Netflix doc",
        "content": "",
        "upvotes": 645,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1odbsqb/ive_been_in_tears_ajike_owens_cousin_opens_up/"
    },
    {
        "id": "1odk4j9",
        "author": "Lateralus46N2",
        "title": "The Perfect Neighbor Unseen Bodycam Not Shown in Doc",
        "content": "Like many of you, I'd fallen down the Susan Lorincz rabbit hole since watching the documentary. I had thought I'd seen most key pieces by now and had moved on to other things when this video popped up in my suggestions. It begins with Bodycam footage not included in the movie or the trial. It shows the neighborhood and police discussions in the immediate aftermath, as well as other footage from that night woven throughout that I haven't seen elsewhere. I thought some of you may find it interesting.  https://youtu.be/lYXD9SMCa-w?si=k3Zi0efuzmhFAxjh\n\nFor those just starting down the rabbit hole: \n\nRecent interview from prison \n\nhttps://youtu.be/V5-DIGPi_dU?si=DPZbUg5M2dhTuD7w\nHere are the full interrogation videos post shooting \n\nInterview 1 \nhttps://youtu.be/puQmH_d8yVw?si=YxWmWv-fCoGlTBax\n\nInterview 2\n\nhttps://youtu.be/lZ74O5qxI0w?si=3IurVUXKQjU0f2vr\n\nFor those who haven't seen the trial, I will post those links as well. There was some pretty important evidence that I wish had been included in trial. She is actually am even bigger monster than what we saw in the movie. Note: Trial videos are about half as long as advertised as there is a lot of dead space to fast forward through such as when the court breaks for recesses \n\nDay 1\nhttps://www.youtube.com/live/ygm__xISYAM?si=xT2Di6bgMw_Gxe4L\n\nDay 2 (State Rests)\nhttps://www.youtube.com/live/kJKQqjVfvnE?si=_nApwK5qtP2nafJt\n\nDay 3\nhttps://www.youtube.com/live/SN8lCIq7ivM?si=EbRML6cWwHN1xTdk\n\nDay 4 (closing arguments)\nhttps://www.youtube.com/live/EA_K8tmog4o?si=5jDc92HXULnin0W4\n\nSentencing \nhttps://youtu.be/9dHWMI2HEyw?si=GoiRNU2VUwymxzs1\n\n",
        "upvotes": 92,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1odk4j9/the_perfect_neighbor_unseen_bodycam_not_shown_in/"
    },
    {
        "id": "1odqs4u",
        "author": "michelob81",
        "title": "I am a killer",
        "content": "Just watched this delightful little show. It's basically Netflix interviewers going into prisons and letting scumbag murderers run their mouths. I think we're supposed to question if these evil cretins are somehow the victims in their horrific acts. I've an idea for the next season. Don't go anywhere near the prisons and let these people rot.",
        "upvotes": 34,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1odqs4u/i_am_a_killer/"
    },
    {
        "id": "1oe8ejm",
        "author": "TexanToTheSoul",
        "title": "Can't watch on work PC. Activate Extra Member",
        "content": "I am trying to watch the new season of Nobody Wants This while at lunch at work.  I haven't used NF in a while at work, and nobody else is logged into the account.  I am getting the \"Activate extra member to watch now\" message after the netflix home screen shows for a few seconds.  I was able to get into my account settings and turn off the \"extra member\" part but it says it'll be active till 11/18, and I have no way to watch from my work PC.  Any way I can get around this.  It's totally frustrating.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oe8ejm/cant_watch_on_work_pc_activate_extra_member/"
    },
    {
        "id": "1oe6whm",
        "author": "Turbulent_Arrival_55",
        "title": "Need some films/series recommendations",
        "content": "So thing is I enjoy films that contain modern vibes, involves psychology aspects (like Alice in Borderland for example) that also contains a cool side character (kinda like Chishiya for example in AIB). I just enjoy films that involve \"thinking\", involve planning strategic and stuff like that (for example: Money Heist). A bit of fighting aspects are also additional points too (kinda like Bloodhounds or Weak Hero)\n\n\nI'm looking for people with the same interests and give me some recommendations with films that sorta have the same background since I don't know much films with the same vibes lol.\n\nThank you so much!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oe6whm/need_some_filmsseries_recommendations/"
    },
    {
        "id": "1odk8bj",
        "author": "GoldDerby",
        "title": "‘KPop Demon Hunters’ takes the lead at Golden Globes as new toys and games are announced:",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odk8bj/kpop_demon_hunters_takes_the_lead_at_golden/"
    },
    {
        "id": "1oe3zy6",
        "author": "Special_Country228",
        "title": "Nobody Wants This Season 2 Netflix Soundtrack",
        "content": "Hi All,\n\nHere is every song of Season 2 of Nobody Wants This: [https://open.spotify.com/playlist/2jbYCG2laFDZI78JJ3zPfW?si=iYhbm7f9QXeQH04AL4Bhng](https://open.spotify.com/playlist/2jbYCG2laFDZI78JJ3zPfW?si=iYhbm7f9QXeQH04AL4Bhng)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oe3zy6/nobody_wants_this_season_2_netflix_soundtrack/"
    },
    {
        "id": "1oe3udv",
        "author": "Historical-Brick1736",
        "title": "I hope they give Vecna/Henry a redemption arc in ST5.... listen",
        "content": "I like that he was the main villain of season 4 even tho it looked a bit of an after-thought storyline, like they really wanted a \"human\" enemy on the show so they made his storyline along the way BUT, I really hope that the mastermind and bad guy in the end is still the Mind Flayer... he was MORE scary than Vecna and also it added to the cosmic horror of monsters from another dimension clashing into our world and the fear of the unknown.\n\nSo i really hope they end up going for the First Shadow lore and make Henry a minion of the Mind Flayer because heaving a human be the Final Boss instead of an unknown creature sounds so lame hahaha like what was the point of introducing a new dimension and these mosnters if the final boss is human? IDK...\n\nWhat do you prefere? Am i the only one that doesn't want a human as the final boss?????\n\nSorry if i made mistakes, im from spain and english is not my first language :)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oe3udv/i_hope_they_give_vecnahenry_a_redemption_arc_in/"
    },
    {
        "id": "1oda16w",
        "author": "Bubbly-Comparison-29",
        "title": "Boots is SO GOOD.",
        "content": "i just finished watching the last episode after binging it all in a couple of days. its AMAZINGGG it has great acting, great balance between comedy and seriousness and really makes you care about each character. guys give it a shot pleasee \n\n  \nalso on a side note max parker's eyes are absolutely gorgeous ",
        "upvotes": 72,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1oda16w/boots_is_so_good/"
    },
    {
        "id": "1odr3d0",
        "author": "RiseDelicious3556",
        "title": "Mob War: Philadelphia vs. The Mafia     This is my Review",
        "content": "Excellent documentary on the Mafia in Philadelphia in the 1990's As a 3rd generation native Philadelphian, I'd say very authentic description of the culture of South Philly and the FBI, with whom I've had the pleasure of being personally acquainted when they were investigating a business I was working for in the 80's. Definitely worth watching. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odr3d0/mob_war_philadelphia_vs_the_mafia_this_is_my/"
    },
    {
        "id": "1oe19m5",
        "author": "TheMirrorUS",
        "title": "Chase Stokes and Madelyn Cline forced to intervene as Outer Banks EP allegedly grabs and screams at PA on set",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oe19m5/chase_stokes_and_madelyn_cline_forced_to/"
    },
    {
        "id": "1oe11n6",
        "author": "cappyyybaaaraa",
        "title": "Next watch??",
        "content": "I loved Brooklyn nine nine. Also When Life gives you Tangerines. Also enjoyed Brigerton and Stranger Things.\nWhat show should I watch next??\n(Not office or friends plss, have tried and didn't like it; couldn't watch more than 2 episodes😭)\nPls recommend shows from Netflix.",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1oe11n6/next_watch/"
    },
    {
        "id": "1oduh67",
        "author": "dicedtomatoes55",
        "title": "Am I the only one watching Turn of the Tide? The two-year gap between seasons killed the momentum but it's still a very good crime drama.",
        "content": "",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oduh67/am_i_the_only_one_watching_turn_of_the_tide_the/"
    },
    {
        "id": "1od007p",
        "author": "pandasoondubu",
        "title": "The Perfect Neighbor",
        "content": "Did Sue plan out how to get away with the murder?\n\nIt was briefly mentioned in the interrogation that she researched “stand you ground” laws before this all happened. Not sure if anyone has seen anything about this, but if that’s true it feels more calculated than a moment of anger.\n",
        "upvotes": 213,
        "comments": 193,
        "media": null,
        "permalink": "/r/netflix/comments/1od007p/the_perfect_neighbor/"
    },
    {
        "id": "1odtljc",
        "author": "Cybertronian1512",
        "title": "Netflix slumps, as investors start to question its lofty valuation",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1odtljc/netflix_slumps_as_investors_start_to_question_its/"
    },
    {
        "id": "1odse3b",
        "author": "Reggies_Father",
        "title": "Random pauses and black screen",
        "content": "I watch netflix on xbox, and for the past 2 or 3 years my netflix randomly pauses, probably about 7 or 8 times per episode. It just pauses, with no other messages. Now, my netflix screen randomly goes black (i can still hear the audio). It is making netflix super infuriating to watch as i have to constantly keep unpausing, and rewinding (to get the black screen to fix). Is anyone else having this problem on xbox?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1odse3b/random_pauses_and_black_screen/"
    },
    {
        "id": "1odhcy7",
        "author": "ToonAdventure",
        "title": "Mitchells vs Machines 2 in Works at Sony Animation, Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odhcy7/mitchells_vs_machines_2_in_works_at_sony/"
    },
    {
        "id": "1odqz9v",
        "author": "poetic-isolation",
        "title": "Netflix shop- Do they have a birthday coupon code or a Black Friday sale?",
        "content": "I'm hoping to get some KPDH merch and my birthday is coming up in November, and so is Black Friday. Netflix says that when you sign up for emails, \"By entering your birthday, you unlock an exclusive discount on your special day each year!\" But I'm not sure what the percentage is, or how long the discount lasts. I also don't know if the shop has a Black Friday sale, so I'm wondering what my best option would be.\n\nAdvice or experience with the shop appreciated!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odqz9v/netflix_shop_do_they_have_a_birthday_coupon_code/"
    },
    {
        "id": "1od0r1z",
        "author": "MeanderFlanders",
        "title": "The Perfect Neighbor: Where was the tablet found?",
        "content": "Something that has been nagging me, was the location of the tablet, the cause of the last confrontation. I watched a bit of the trial when it occurred but didn’t catch that it was addressed. Wondering it was in her house, on her porch, etc. ",
        "upvotes": 65,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1od0r1z/the_perfect_neighbor_where_was_the_tablet_found/"
    },
    {
        "id": "1odulhn",
        "author": "Gemmi_bear",
        "title": "Recommendations?",
        "content": "Looking for horrors or thrillers that don't include hangings \n\nI experienced a suicide earlier this year and it seems every show or movie horror or thriller has hangings and its just awful to be reminded ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1odulhn/recommendations/"
    },
    {
        "id": "1ocvyvf",
        "author": "Legit_Train_Hopper",
        "title": "“Tell them You Love Me” documentary..",
        "content": "I seriously cannot express how angry, sad and generally appalled I feel after watching this, this is one of the most disturbing fucking documentaries I have *ever* seen. \n\nAnna stubble field is *the* true definition of the devil. \n\nShe left scars on DMan’s body. She, an able bodied woman, raped a disabled man. I’m so sick and angry after watching this.\n\nDaisy (DMan’s mom) said he now masturbates. She said he would’ve never had known about anything sexual if it weren’t for Anna showing it to him. \n\nAND THE WORST PART ABOUT ANY OF THIS is at the end she STILL doesn’t think she’s wrong for this oh.. my god…\n\nThis documentary I felt in my *soul*. ",
        "upvotes": 138,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ocvyvf/tell_them_you_love_me_documentary/"
    },
    {
        "id": "1oddfor",
        "author": "idlaughless",
        "title": "'Outer Banks' Director Jonas Pate Accused Of Grabbing and Shaking Production Assistant",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oddfor/outer_banks_director_jonas_pate_accused_of/"
    },
    {
        "id": "1odftcn",
        "author": "SOLO_OBSERVER",
        "title": "New Documentary Idea",
        "content": "Can they just do documentaries on like the wildness of late night Tv like Skinamax or like the rise and fall of Girls Gone Wild, that be pretty damn interesting.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1odftcn/new_documentary_idea/"
    },
    {
        "id": "1odqb4b",
        "author": "dudepersson",
        "title": "is there any way to bypass the singular household thing",
        "content": "i'm 17 and i live with my parents, they're divorced so i often switch houses. up until now my netflix account has worked fine at either house. just tonight on my mac, it said that i was not in the correct household for my account. is there anything i can do about this? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1odqb4b/is_there_any_way_to_bypass_the_singular_household/"
    },
    {
        "id": "1odwyjl",
        "author": "That_one_Man123",
        "title": "Interstellar's last day on Netflix",
        "content": "Today, October 23rd 2025, Interstellar, one of the most aclaimed sci-fi movies of all time, is getting removed from Netflix. What are your thoughts on this?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1odwyjl/interstellars_last_day_on_netflix/"
    },
    {
        "id": "1odryj4",
        "author": "DuxxieDings",
        "title": "Adult Animated Series you need to check out!",
        "content": "Alot of adult animated series on Netflix is underated and I want to share some of my favorites. Alot of anime but some are adult cartoons. \n\nA list of Animated series for adults I enjoy on Neflix! \n\nBrand New Animal\nBeastars\nJujustu Kaisen\nArcane\nWolf King\nNe Zha\nToyko Override\nBlue Eye Samurai\nThe Summer Hikaru Died\nPluto\nMy Happy Marriage\nLeviathan\nGreen Snake\nSkull Island\nSuzume\nMaborshi\nThe Fragrant Flower Blooms with Dignity. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odryj4/adult_animated_series_you_need_to_check_out/"
    },
    {
        "id": "1odm13m",
        "author": "Sudden_Pop_2279",
        "title": "Wednesday Season 2 OTT Verdict (Week 11): Jenna Ortega’s Hit Cracks Netflix’s All-Time Top 5 Most-Watched Shows",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odm13m/wednesday_season_2_ott_verdict_week_11_jenna/"
    }
]