[
    {
        "id": "1iar138",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dhbezfcyoefe1.png?auto=webp&amp;s=7138e0803d55462d46163373a454ecb3c9530095"
        },
        "permalink": "/r/movies/comments/1iar138/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1i8mkoh",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Presence / Flight Risk / Nickel Boys / The Room Next Door)",
        "content": "# New Theatrical Releases\n\n[Presence](https://old.reddit.com/r/movies/comments/1i8m8gp/official_discussion_presence_spoilers/?)\n\n[Flight Risk](https://old.reddit.com/r/movies/comments/1i8m8i2/official_discussion_flight_risk_spoilers/?)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Room Next Door](https://old.reddit.com/r/movies/comments/1i8m8ka/official_discussion_the_room_next_door_spoilers/?)\n\n\n# Still in Theaters\n\n[Wolf Man](https://old.reddit.com/r/movies/comments/1i36wh1/official_discussion_wolf_man_spoilers/?)\n\n[One of Them Days](https://old.reddit.com/r/movies/comments/1i36wmw/official_discussion_one_of_them_days_spoilers/?)\n\n[The Last Showgirl](https://old.reddit.com/r/movies/comments/1i36wob/official_discussion_the_last_showgirl_spoilers/?)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n# Oscar Rewind\n\n[Anora](https://old.reddit.com/r/movies/comments/1ggv4yg/official_discussion_anora_spoilers/)\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/)\n\n[The Brutalist](https://old.reddit.com/r/movies/comments/1i37yra/official_discussion_the_brutalist_spoilers/?)\n\n[Conclave](https://old.reddit.com/r/movies/comments/1gbjlm7/official_discussion_conclave_spoilers/)\n\n[Dune: Part Two](https://old.reddit.com/r/movies/comments/1b3jo9s/official_discussion_dune_part_two_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)\n\n[Nickel Boys](https://old.reddit.com/r/movies/comments/1i8m8iz/official_discussion_nickel_boys_spoilers/?)\n\n[The Substance](https://old.reddit.com/r/movies/comments/1fl1bpl/official_discussion_the_substance_spoilers/)\n\n[Wicked](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)",
        "upvotes": 25,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1i8mkoh/official_discussion_megathread_presence_flight/"
    },
    {
        "id": "1iameli",
        "author": "Pyro-Bird",
        "title": "Steven Spielberg Says He Fought to Stop E.T. Sequel From Being Made",
        "content": "",
        "upvotes": 10765,
        "comments": 577,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JN4QcwpqybYvCZ-Xc2CrjgKiGQydv24CGgdslFoH4iY.jpg?auto=webp&amp;s=1263c53a6fc9ab3b517d85c1bc855cad2cbaba54"
        },
        "permalink": "/r/movies/comments/1iameli/steven_spielberg_says_he_fought_to_stop_et_sequel/"
    },
    {
        "id": "1iarpio",
        "author": "Ovid738",
        "title": "Rewatched Forrest Gump. Totally forgot how dark it is.",
        "content": "Great movie, but I hadn’t seen it since I was a kid myself. On rewatch it’s crazy just how many things fly under the radar when you’re young. From Jenny’s abuse, to all the characters suffering so badly that if you put yourself in your shoes for a moment, you wonder how they haven’t gone crazy.\n\nBiggest shock factor for me was the scene at the start where Mrs Gump is essentially coerced into sex with the principal to get her son into school. As a child I had no idea - for some reason I thought the principal was just having an asthma attack in the house, which explained the weird noises he made. \n\nAnyway, any other films you rewatched and were surprised at as an older person? ",
        "upvotes": 4597,
        "comments": 942,
        "media": null,
        "permalink": "/r/movies/comments/1iarpio/rewatched_forrest_gump_totally_forgot_how_dark_it/"
    },
    {
        "id": "1iawzi5",
        "author": "KnewMedalPhan",
        "title": "What Movie Sex Scenes Are Etched Into Your Mind Permanently?",
        "content": "For me, it will always be Mulholland Drive, RIP to David Lynch. I will NEVER forget being like 12 and just flipping through channels with my mom. Stumbled upon that film RIGHT before the first lesbian scene. I was absolutely mesmerized but was also trying to fumble for the remote to turn the movie off. My mom (who ALWAYS jokingly gave me a hard time about that kind of thing, this also happened with movies like Bound and Love &amp; Other Drugs) quipped, as I frantically shut the TV off that I had to have been enjoying it... she wasn't wrong. I'm still so captivated by that whole scene and having the movie's full context later. It's so beautiful.\n\n\n\nEdit: Didn't expect this much engagement! I love seeing everyone's answers. Seems like someone needs to make a compilation of a lot of the top answers...",
        "upvotes": 1330,
        "comments": 2210,
        "media": null,
        "permalink": "/r/movies/comments/1iawzi5/what_movie_sex_scenes_are_etched_into_your_mind/"
    },
    {
        "id": "1iat7ma",
        "author": "Throwaway921845",
        "title": "Hollywood Work Was Already Drying Up. Then the Fires Hit.",
        "content": "",
        "upvotes": 764,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dPyXciC4RAnd6J91aLDfab3scDdB2_f0yKKiKmbmQSQ.jpg?auto=webp&amp;s=8f02da8c5ed8214d281194062d19e19ba7ccd2e5"
        },
        "permalink": "/r/movies/comments/1iat7ma/hollywood_work_was_already_drying_up_then_the/"
    },
    {
        "id": "1iaaskr",
        "author": "Kingkill66",
        "title": "Seriously, what better sequel is there than Terminator 2?",
        "content": "From the beginning of the movie, to the end, every scene is just perfect. Not to mention that this movie changed the whole dynamics of what Hollywood CGI could do, (Jurassic Park also did a lot) and won 4 Oscars for it. I’m just asking…. Am I wrong to think that this is the best sequel to ever been made? Aliens…maybe… Empire Strikes Back? But…. Seriously…. Can Terminator 2 be the best?\nAhh shit… I forgot about Paddington 2. 😂 \n",
        "upvotes": 5437,
        "comments": 3236,
        "media": null,
        "permalink": "/r/movies/comments/1iaaskr/seriously_what_better_sequel_is_there_than/"
    },
    {
        "id": "1iam9ii",
        "author": "1991mgs",
        "title": "Nosferatu (2024) compared side-by-side, shot-for-shot with the 1922 and 1979 films",
        "content": "",
        "upvotes": 832,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VCjz8TXDokwfF5DNdtRlhl9_CWEFsAUAUSHo4d5fghk.jpg?auto=webp&amp;s=1e35f74d0101f7e272fec003e056152912d41865"
        },
        "permalink": "/r/movies/comments/1iam9ii/nosferatu_2024_compared_sidebyside_shotforshot/"
    },
    {
        "id": "1iags3h",
        "author": "Expensive-Stuff3781",
        "title": "The Princess Bride is back in theaters for a limited time!",
        "content": "It’s showing at select theaters nationwide today and Wednesday!",
        "upvotes": 1219,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cf1N50W5xLQHnpksiRksrgt5rbpZvvVriYsHpGZuXSA.jpg?auto=webp&amp;s=f03b8eb1e148634c4ae46b3bb3d5ceb5178fc489"
        },
        "permalink": "/r/movies/comments/1iags3h/the_princess_bride_is_back_in_theaters_for_a/"
    },
    {
        "id": "1iaxsuy",
        "author": "Waste_Opportunity408",
        "title": "The Equalizer trilogy with Denzel Washington is phenomenal",
        "content": "Denzel really owned this role, and made every film so enjoyable to watch, but these films absolutely delivered on the simple premise of a badass, retired ex D.I.A Vigilante delivering justice to the bad guys and being the guardian angel of death to the hopeless that need him. Im gonna do my best to avoid spoilers.\n\n  \nEqualizer 1- My personal favorite out of the trilogy. The mystique of robert Mcall was at it's highest due to how little we knew about him, and we see the duality of his character by how he could be such a wise, supportive, kind hearted person that pushes others around him to be the best they can be, but also an absolute, cold, calculating, menacing killer to the ones that deserve it. Great acting, despicable villians, feel good vigilante justice, and a good ending.\n\n  \nEqualizer 2- The theme of this is revenge, and this is really personal for Robert Mcall. Good classic vigilante justice, with also Robert being a great father figure to a young man that needed guidance. When that very tragic thing happens to robert, you want the bad guys to get the worst that could come to them, and boy oh boy does Robert do what robert does best. Honestly probably even more satisfying than the first on the justice side of things, but i prefer the overall story of the first.\n\n  \nEqualizer 3- I have mixed feelings on this one. It has the least action, and slowest pace out of the 3, but DAMN this has got to be my favorite portrayal of robert mcall out of all 3. Robert in equalizer 3 is basically a brutal, horror movie slasher with good morals that is genuinely terrifying and at his most violent by far. Even gave me Michael myers vibes in some scenes with ominous soundtrack.  However the italian mob in this is so evil, i enjoyed every scene when Robert gave them what was coming to them. It has a beautiful setting, awesome soundtrack, despite the lack of action when the action does happen it's a A+ and a satisfying conclusion to the trilogy.\n\n  \nOverall the equalizer series is my second favorite action series of all time (only behind the john wick series) and i really enjoyed my time with them, and consider them classic action films.\n\n  \nDenzel already revealed he is working on a equalizer 4 and 5, and although i feel Equalizer 3 ended the series perfectly, as long as Robert is portrayed the way he is in equalizer 3, i am looking forward to them.\n\n  \nWhat are your thoughts on the equalizer series?",
        "upvotes": 117,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1iaxsuy/the_equalizer_trilogy_with_denzel_washington_is/"
    },
    {
        "id": "1iasvp7",
        "author": "GeekyNiceGuy1985",
        "title": "John Carter",
        "content": "Just sat down and watched John Carter. Unfortunately, when it first came out, I listened to the opinions of critics instead of seeing it and forming my own opinions. If I remember correctly, it came out on the same date as another big movie and Disney lost money on it because of poor planning.\nI thought it was a solid stand-alone sci-fi movie, although I haven't read any of the source material by Edgar Rice Burroughs.\n\nJust my two cents.",
        "upvotes": 175,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1iasvp7/john_carter/"
    },
    {
        "id": "1iaoy1a",
        "author": "G00bre",
        "title": "I wish Nolan would make another movie with Hugh Jackman.",
        "content": "Nolan's \"Oppenheimer\" and upcoming Odyssey movies are stuffed to the brim with every celebrity you can shake a stick at, but you know who's missing from those lists?\n\nHugh Jackman!\n\nJackman was the co-lead in \"The Prestige\" and he was great!\n\nBut while he ended up making two more movies with Christian Bale, Jackman hasn't gotten the same love.\n\nNolan obviously has a couple of actors he likes working with on multiple projects (Bale, Caine, Murphy, Hardy) and he often brings out the best in them, or at least some of the most interesting stuff.\n\nIt would be great to see what Nolan and Jackman could do together TWENTY DANG YEARS after their first and only collab.\n\nJackman is great as an actor in regular drama films, but also has lots of experience in genre movies. Same goes for Nolan as a director.\n\nSo what are you waiting for, Chris? Either announce Hugh's gonna play Poseidon, or that your next movie will give him a starring role!",
        "upvotes": 220,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1iaoy1a/i_wish_nolan_would_make_another_movie_with_hugh/"
    },
    {
        "id": "1iayraq",
        "author": "shortbusporkchop",
        "title": "Which Michael Crichton novel that isn't already a movie would you most like to see get made into one?",
        "content": "Jurassic Park, Sphere, Congo, Andromeda Strain, Disclosure, Rising Sun, and The Great Train Robbery are all excellent films. In a Hollywood that has run out of ideas, where could they go back to the well?\n\nI think I have to go with Prey. That is one of the most edge-of-your-seat suspense thrillers I have ever read. It would be beyond awesome if somebody got Villeneuve to direct it.\n\nBut Crichton was the master of writing the line where science stops and fiction begins. Next, Micro, State of Fear - in the hands of the right screenwriter &amp; director, any of those would be a badass film. Hell, even Pirate Latitudes would be a killer popcorn flick.\n\nPretty sure I read a studio has already optioned Eruption. Fingers crossed we don't get another Timeline.",
        "upvotes": 52,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1iayraq/which_michael_crichton_novel_that_isnt_already_a/"
    },
    {
        "id": "1iar0c9",
        "author": "mildOrWILD65",
        "title": "Prey",
        "content": "I quite liked \"Prey\", in the Predator franchise. The female lead was strong. The Predator's behavior was consistent with the franchise. The scene with the bear was interesting (poor bear!)\n\nI won't speak to the veracity of the portrayal of Native American culture except that nothing seemed out of place and also seemed entirely respectful.\n\nAltogether, a very good movie, imo.",
        "upvotes": 164,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1iar0c9/prey/"
    },
    {
        "id": "1ial4v7",
        "author": "BunyipPouch",
        "title": "Poster for Body-Horror 'Grafted' - A bright but socially awkward exchange student takes her craving for popularity to horrifying heights.",
        "content": "",
        "upvotes": 236,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hjoetmgemdfe1.jpeg?auto=webp&amp;s=25613bbf4b49d74f60599e29d1f5688bb988c00b"
        },
        "permalink": "/r/movies/comments/1ial4v7/poster_for_bodyhorror_grafted_a_bright_but/"
    },
    {
        "id": "1iarlw7",
        "author": "letsgopablo",
        "title": "Sing Sing is an anomaly",
        "content": "A prison drama that doesn't tread the same ground as the others in its genre. No scenes featuring gratuitous violence, homophobia or any of the other tropes. Instead it's about the healing and reforming power of art, and features one of the strongest depictions of male friendship and comraderie outside of a war movie. It subverts the typical toxic masculine energy of its genre and shows us real men who have been inside having the time of their lives playing dress up, communicating with emotional maturity, crying. As a young man growing up in the age of the redpill movement, i think movies like this are not only a breath of fresh air, but necessary. I found it incredibly moving and it currently stands as my movie of the year of 2024. Clarence Maclin was snubbed for a best supporting actor nom, but I would love if he won for Best Adapted Screenplay. A masterpiece in my opinion, and fully deserves every win it gets.",
        "upvotes": 106,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1iarlw7/sing_sing_is_an_anomaly/"
    },
    {
        "id": "1iaeafg",
        "author": "QouthTheCorvus",
        "title": "The Club Silencio scene in Mulholland Drive is one of the most powerful scenes I've ever watched. It's filled with so much sorrow.",
        "content": "",
        "upvotes": 416,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cSotQzfwg-e0h_srstJjHbMKfM0Z0h4l9h81R0p0Mzw.jpg?auto=webp&amp;s=b42c40e63d60242855d8b8ec3b583c836974ffe0"
        },
        "permalink": "/r/movies/comments/1iaeafg/the_club_silencio_scene_in_mulholland_drive_is/"
    },
    {
        "id": "1iass10",
        "author": "CheezTips",
        "title": "Michelle Lemuya Ikeny: Kenyan actress takes on child marriage in Nawi",
        "content": "",
        "upvotes": 62,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9IEve2yzhsfyxT6ipeS8jLNhoJ07GjD66nkHxidfR9E.jpg?auto=webp&amp;s=f691487d14cbbd0d46afc423ec7bb13248123862"
        },
        "permalink": "/r/movies/comments/1iass10/michelle_lemuya_ikeny_kenyan_actress_takes_on/"
    },
    {
        "id": "1i9w70o",
        "author": "manuelconhache",
        "title": "Emilia Perez and the lack of dialect coaches.",
        "content": "I just finished watching “Emilia Perez” and I have to say, the lack of attention to the Spanish language in this production is absolutely disappointing. It’s baffling how a movie of this scale, with a cast full of internationally recognized actors, didn’t invest in proper dialect coaching. Mexican audiences, myself included, are extremely upset by how the film handles the Spanish language—or rather, “butchers” it.  \n\nSelena Gomez doesn’t even attempt to explain or adjust her poor pronunciation. Then there’s Zoë Saldaña, whose character conveniently throws in a “Deus ex machina” explanation that she was born in the Dominican Republic to justify her accent. And Sofia Gascon? Her voice had to be AI generated because she couldn’t even sing the notes of the songs. \n\nIt’s as if the production, being French, didn’t even bother to take the language seriously. The songs—written in French and awkwardly translated into Spanish—make little to no sense, and it’s painfully obvious. It feels like they threw words together without understanding cultural nuances, making the whole thing feel artificial and disconnected from its supposed Mexican setting.  \n\nThis brings me to the larger issue: why is it that English or Australian actors go through extensive dialect training when portraying American accents (e.g., Andrew Lincoln, Kelly Reilly, Andrew Garfield), yet “Emilia Perez” gets away with such a glaring lack of effort? Even Gael García Bernal trained extensively to sound like a Spaniard in Almodóvar’s “La Mala Educación”, proving that the right effort -can- and -should- be made.  \n\nAnd yet, despite all of this, the Academy is showering the film with nominations. It’s disheartening to see how -actual- Mexican films, with authenticity and cultural accuracy, don’t receive this level of recognition. Instead, we get a film that diminishes the importance of language and cultural representation, all for the sake of style over substance. Imaging making an Italian language movie where Brad Pitt keeps his Italian in  “Inglorious Basterds” not as a comedy but as a serious drama, that was this movie. A joke. \n\nHonestly, I’m sad and disappointed. Mexican culture and language deserve better.",
        "upvotes": 7751,
        "comments": 1209,
        "media": null,
        "permalink": "/r/movies/comments/1i9w70o/emilia_perez_and_the_lack_of_dialect_coaches/"
    },
    {
        "id": "1ia7usd",
        "author": "Abi_Jurassic",
        "title": "David Koepp's 'Jurassic World Rebirth' will feature a sequence from Michael Crichton's Original JP Novel",
        "content": "",
        "upvotes": 878,
        "comments": 200,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kvxGaSUxWCsz5UQsIU54edgMOQmwudYC8tzmhMoZKaI.jpg?auto=webp&amp;s=7e899658490c079dd31046b190c388b04616dfe1"
        },
        "permalink": "/r/movies/comments/1ia7usd/david_koepps_jurassic_world_rebirth_will_feature/"
    },
    {
        "id": "1iaanxh",
        "author": "Crafty-Bunch-2675",
        "title": "Stephen King's Carrie is a powerful story because of how real the tragedy is. Why didn't anybody stop the bullies ?",
        "content": "Basically the only thing about Carrie that is \"unrealistic\" is the fact that Carrie has powers. BUT, the 3rd act of the movie could have played out the exact same way, even without anything supernatural.\n\nWe have seen those types of tragedies on the evening news.\n\nAnd, it just makes me sad everytime I watch this movie.\n\nHow relentless the bullying is, and how **utterly impotent, incompetent and passive** the adults are to stop the bullying.\n\nSome people complain, about why \"others\" were caught in the tragedy...well simply: all of them were complicit.\n\nThere are so many opportunities in the story where somebody saw the bullying take place, they recognize it is wrong, but then do nothing to stand up for Carrie; or at the best only make a half hearted effort, and then immediately forget.\n\nIt's not rocket science to stop a school bully. It's not international politics. They don't have weapons. They are just kids playing mean pranks. The adults should have easily been able to clamp down on the bullying if they really cared.\n\nAnd in the 1976 version; nobody has learnt their lesson...because they still continue defacing her grave afterward...\n\nThat's not supernatural evil. That's very real. This sort of evil exists in the real world.\n",
        "upvotes": 338,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1iaanxh/stephen_kings_carrie_is_a_powerful_story_because/"
    },
    {
        "id": "1iayd6k",
        "author": "Training-Republic301",
        "title": "1984 - Real Coffee Scene",
        "content": "",
        "upvotes": 13,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbmlnRiWson5orKAEyjKCVL-JjKrM8WydmbOVy-klbw.jpg?auto=webp&amp;s=fdd49d18431d6b9c6f08b6888660d6360c1c552e"
        },
        "permalink": "/r/movies/comments/1iayd6k/1984_real_coffee_scene/"
    },
    {
        "id": "1iam59e",
        "author": "reecord2",
        "title": "My Favorite movies of 2024 that didn't get talked about enough",
        "content": "Not good at movie reviews, but feel compelled nonetheless:\n\n**Kneecap** \\- maybe the most fun I had in a theater in 2024.  Irish hip-hoppers (playing themselves) rap in Gaelic as political protest, and entice people to come to their shows by way of free drugs.  Just a blast from start to finish.\n\n**In the Land of Saints and Sinners** \\- Liam Neeson's best movie since The Grey.  Dressed up as revenge movie #24 but so much more than that.  A beautiful \"Irish western\", Kerry Condon is a superb villain, and great to see Jack Gleeson (Joffrey!) enter his grown-up era of acting.  Everything on paper about this movie makes it sound unremarkable, down to the poster with Liam stoically holding a gun, but this is the absolute best version of this type of movie.\n\n**Problemista** \\- as if they unearthed a secret Michel Gondry movie from the early 2010s, and I mean that in the best way.  I love movies that aren't afraid to dip into surrealism.  The depiction of craiglist as trippy garage sale genie is worth the price of admission alone.  Tilda Swinton having the absolute time of her life (File! Maker! Pro!).\n\n**The Dead Don’t Hurt** \\-  Viggo Mortensen was born to play this type of role.  I'm not even much of a western person, but this is just a beautiful story that takes its time.  No fireworks, just a deliberately-paced western done right.  Take your dad to this one.\n\nSlasher Section:\n\n**In a Violent Nature** \\- This is for slasher purists.  Barebones, masterfully borrows/steals all the best stuff from the early Friday the 13th and Halloween.  What other people might criticize is why I loved it: doesn't explain much, revels in being gruesome, and a strange unbalanced ending that doesn't wrap anything up.  Perfect.\n\n**Azrael** \\- Samara Weaving rips in this one, and without speaking the entire movie (if memory serves).  I don't want to give anything away by comparing it to at least two other movies this year where a certain plot point also happens &gt;!we really loved demon babies in 2024, eh?!&lt;, but this is the lesser known of the bunch.\n\nSpecial mention:\n\n**La Chimera** \\- beautiful, charming, strangely life-affirming, just a beautiful move that did not get a big enough theatrical run.  I know it's technically a 2023 movie but it came out in late December, and it's absolutely worth seeing.",
        "upvotes": 51,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1iam59e/my_favorite_movies_of_2024_that_didnt_get_talked/"
    },
    {
        "id": "1ib2q34",
        "author": "These_Feed_2616",
        "title": "Mystic River (2003)",
        "content": "I absolutely love this movie, I honestly think it’s a perfect thriller, great performances by everyone in the film, especially Sean Penn, great atmosphere, great cinematography, great direction, great acting, it’s an extremely dark depressing film and I mean that in a good way, I honestly think it’s Clint Eastwood’s best when it comes to his directing career, fantastic film!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ib2q34/mystic_river_2003/"
    },
    {
        "id": "1i9trfg",
        "author": "mayukhdas1999",
        "title": "First Image from 'GOOD BOY' - Do you ever wonder why your dog stares at empty corners, barks for no reason, or refuses to go into the basement? This is the story of a dog who sees everything that goes bump in the night. No talking pets, just terrifying scares",
        "content": "",
        "upvotes": 3575,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vqhfy8mcq6fe1.jpeg?auto=webp&amp;s=c496c61ff5698df540ae677b98ae5917f1852d9c"
        },
        "permalink": "/r/movies/comments/1i9trfg/first_image_from_good_boy_do_you_ever_wonder_why/"
    },
    {
        "id": "1iakwba",
        "author": "SushiTornado",
        "title": "Denis Villeneuve is mentioned a lot in the sub, but nobody mentions Polytechnique (2009).",
        "content": "It's a great movie based on a true story, and every movie fan, Villeneuve fan and the \"disturbing movies\" gang should give it a go. Warning: it's heavy stuff. You may want to read the synopsis before going in.\n\nPolytechnique is a 2009 Canadian drama film directed by Denis Villeneuve and written by Villeneuve and Jacques Davidts. Starring Maxim Gaudette, Sebastien Huberdeau, and Karine Vanasse, the film is based on the 1989 École Polytechnique massacre and re-enacts the events of the incident through the eyes of two students (Huberdeau and Vanasse) who witness a gunman (Gaudette) murder fourteen young women.  \n",
        "upvotes": 34,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1iakwba/denis_villeneuve_is_mentioned_a_lot_in_the_sub/"
    },
    {
        "id": "1ia1hn1",
        "author": "quietwhiskey",
        "title": "Training Day - Getting Wet scene",
        "content": "",
        "upvotes": 716,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cOxWnhusYMNlBRfJ0y71TrznqGiVEz_ozg6JOYprK6U.jpg?auto=webp&amp;s=a84c7958b06b2c0ab7cc5405173d1a7b8706a32f"
        },
        "permalink": "/r/movies/comments/1ia1hn1/training_day_getting_wet_scene/"
    },
    {
        "id": "1ib3hip",
        "author": "Far_Manufacturer2565",
        "title": "Mystery Noir &amp; Thriller Genre Film Advice",
        "content": "I recently watched Angel Heart and really enjoyed its blend of mystery, noir, and thriller elements. I’m looking for recommendations for similar films in this genre. I’m also a big fan of classic film noir and enjoy movies with dark atmospheres, complex characters, and intriguing plots. If you have any suggestions for films that capture a similar vibe, I’d love to hear them.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1ib3hip/mystery_noir_thriller_genre_film_advice/"
    },
    {
        "id": "1i9vode",
        "author": "whitepangolin",
        "title": "Indiana Jones was an homage to James Bond, so they cast Sean Connery as his father. What are other instances of homage casting?",
        "content": "Was thinking about this. Spielberg and Lucas have long said that \"Indiana Jones\" was born from their desire to make a James Bond film, mixed with the 1930s action serials they also used to love. There's a bunch of James Bond castings in the Indiana Jones franchise - namely Sean Connery, but also Allison Doody and Julian Glover as well.\n\nAnother example is \"Joker\" taking cues from DeNiro films \"Taxi Driver\" and \"The King of Comedy,\" with them ultimately casting Robert DeNiro in their film as well.\n\nWhat other examples exist of this? A movie inspires another movie, so they cast folks from that first movie in this one. ",
        "upvotes": 1497,
        "comments": 804,
        "media": null,
        "permalink": "/r/movies/comments/1i9vode/indiana_jones_was_an_homage_to_james_bond_so_they/"
    },
    {
        "id": "1i9oyhj",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Kate Mara in 'The Astronaut' - Following her first space mission, astronaut Sam Walker is placed under NASA’s care for rehabilitation and medical testing. However, when disturbing occurrences begin happening, she fears that something extraterrestrial has followed her back to Earth",
        "content": "",
        "upvotes": 3073,
        "comments": 329,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/brdgtqpno5fe1.jpeg?auto=webp&amp;s=f6cecaa61e3942d7072c9f25fd8c345e3e31971c"
        },
        "permalink": "/r/movies/comments/1i9oyhj/first_image_of_kate_mara_in_the_astronaut/"
    },
    {
        "id": "1iawexy",
        "author": "Comprehensive_Ad8624",
        "title": "Movies like whiplash",
        "content": "My friends and I really liked whiplash and were looking for something similar with a sort of over the top incredibly intense character like the one Jk Simmons plays. We loved his crazy insults and stuff like that too. Also where the stories very intense and thrilling without it being a horror of sorts. I’m not sure if a movie like that exists but any suggestions are appreciated 🙏",
        "upvotes": 4,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1iawexy/movies_like_whiplash/"
    },
    {
        "id": "1iam8ln",
        "author": "blackdesks",
        "title": "Indiana Jones map of all locations visited",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zR2jrIeg0MxNkB278KYdW2J21PtEoh0zsLfeTGNxeoQ.jpg?auto=webp&amp;s=fd04769133db2fc40c84a23055304087c47ba379"
        },
        "permalink": "/r/movies/comments/1iam8ln/indiana_jones_map_of_all_locations_visited/"
    }
]