[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 924,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q16vhz",
        "author": "Zedaso",
        "title": "Stranger things finale, big moments and big questions. I can't stop thinking about what WASN'T in the finale.",
        "content": "This is far longer than expected. I'll put a TL;DR at the bottom.\n\nOverall, I enjoyed the finale, have to say Jamie as Henry/Vecna stood out, he absolutely killed it. There were a lot of amazing moments, but I can't shake the feeling that a lot was missing, it even felt rushed in some places and I'm left with a lot of questions.\n\nWe saw zero demogorgons, demodogs or demobats in the finale, weird from a show that started with the demogorgon. \n\nWe didn't see the \"army\" Vecna showed Nancy in Season 4 and she talked about. I remember her speech: \"Vecna showed me so many terrible things. This giant creature with a gaping mouth, and this creature wasn't alone, there was so many monsters. An army, and they were coming into Hawkins. Into our homes.\" \n\nVecna had no defence, yet he knew Eleven and the gang would be coming, he even saw into her mind, he knew all their plans.\n\nThe military did nothing to the gang and just let them go after the crimes they committed, murdering their soldiers etc? They even let Hopper who had a fight with Dr. Kay become chief of police again?\n\nVecna was impaled and decapitated, the mind flayer was shot and burned yet Will felt nothing when he was right there? What happened to the hive mind? Not long before the big fight we see him reacting to when Henry felt pain from his memory of being shot in the cave as a kid. I thought he would have been seriously hurt or even killed being right near the hive mind when they were attacking the mind flayer and Vecna.\n\nVecna and the mind flayer were these otherwordly eldritch horrors with god-like powers and they were defeated so easily with not much loss for the gang.\n\nThis part is a bit too sci-fi for me and I love this sort of stuff, I'm just not smart enough to understand it, but: The whole blowing up the wormhole at the lab with the C4 at the dark matter seemed off. It completely wipes out all of the upside down, and probably the other dimension, but leaves Hawkins at the gate completely fine where we see \"Eleven\" standing to be killed? Would it not have also wiped out Hawkins, or at least done some damage?\n\nI understand the idea behind the Eleven ending, it was a smart idea in theory, but I don't think they pulled it off too well. Maybe I missed something, but she was right next to Mike in the truck right as they exit the gate, all of the El-Jammers were pointed at her and normally she's crippled and can't do anything but she manages to then escape the truck and get to the gate. Maybe it was an illusion like Mike later says, but she wasn't at the truck part from what I can see, and then how did Mike know about Kali? He never met her. He never witnessed what happened to her.\n\nThere was an 18 month time skip before Mike plays D&amp;D with the gang and tells them about El? Why do Hopper and Joyce not get told anything?\n\nFinally, where is Suzie? I thought Dustin and Suzie were together, we didn't see her at all. Also Vickie? Wasn't Robin going to take Vickie out?\n\nHonestly, not trying to hate on the finale, I love Stranger Things, but as mentioned I was left with a lot of questions. I'm interested in how others interpreted all this or if anyone can explain any of it.\n\n  \n**TL;DR:**  \nI enjoyed the finale, but it felt rushed and oddly incomplete. Key things set up earlier never paid off (no demogorgons/monster army, no real Vecna defence, hive mind inconsistencies with Will). Vecna and the Mind Flayer felt underpowered for supposedly god-like threats. The military’s response made no sense, the wormhole/C4 resolution felt inconsistent, and the Eleven ending was confusing (illusion logic, Kali reference, escape). Several characters/subplots (Suzie, Vickie, Hopper/Joyce learning about El) were just dropped. I love Stranger Things, but the finale left me with more questions than answers and I’m curious how others interpreted it.\n\n",
        "upvotes": 184,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1q16vhz/stranger_things_finale_big_moments_and_big/"
    },
    {
        "id": "1q1bvke",
        "author": "pjand08",
        "title": "Finally Stranger things ended...",
        "content": "After being a fan of this show for almost 6 years, today it all concluded. I have followed every leak and made different theories, and it was all worth it. NGL, the final season, had its flaws, but in the end, everything was completed beautifully. Today, I am feeling very empty. I am not able to rewatch the finale, I am not able to express my feelings, and today I am very sad, and with the end of Stranger Things, now there is no other series left that I am as excited about as I was for Stranger Things. Truly the end of an era....",
        "upvotes": 60,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1q1bvke/finally_stranger_things_ended/"
    },
    {
        "id": "1q1gbmp",
        "author": "Dry_Philosophy_6825",
        "title": "Stranger Things has officially ended — or… has it?",
        "content": "(Spoiler alert)  \nWhen you look at the series through the lens of Dungeons &amp; Dragons, the ending of Season 5 does not feel final. It feels less like the closing of a story and more like a party reaching the end of a campaign while the world around them keeps breathing.\n\nStart with the Mind Flayer. In Dungeons &amp; Dragons it is not a god and not a cosmic ruler. It is one aberration among many, dangerous but not ultimate. The important detail is that it existed long before Henry entered Dimension X. Vecna did not create it and never truly commanded all of it. He only shaped a fragment, the way someone might force smoke into the shape of a spider. Even if that fragment was defeated, the deeper intelligence remains. It was already there before Henry and it will continue after him.\n\nFrom there, Dimension X becomes easier to interpret. In D&amp;D, the Far Realm is not a parallel universe. It sits outside reality and leaks into it only when reality cracks. It is ancient, hostile to reason, impossible to conquer in any permanent sense. Its beings are not merely evil. They are alien in ways the mind cannot safely hold. Dimension X behaves in the same way. That suggests it may not be the true source of horror, but rather a fissure, a place where something far larger presses through. The Upside Down is then not the enemy itself, but the distorted echo of what lives beyond.\n\nVecna fits into this structure. In myth and in D&amp;D lore, he is terrifying, but he exists inside a chain of command. If he falls, the machine does not stop. Someone else assumes the role. That is why Eddie Munson becomes such an intriguing figure. He died in the enemy’s realm. His body was never recovered. He carried fear, guilt and unfinished purpose. Legends and campaigns are full of such characters, pulled back into the fight, not because they choose evil, but because something stronger claims them.\n\nThe experiments surrounding Kali point to the same unfinished world. Dr. K did not work on only one subject. Several women received her blood. That leaves the possibility of children with powers that remain unseen, unstable, unpredictable. Some of them may become protectors. Others may be consumed. A few might be taken by the same forces that shaped the Mind Flayer.\n\nThe creatures of the Upside Down also do not simply vanish. The Demodogs seen in such numbers in earlier seasons behave like an army that waits for new orders. They retreat, recover and emerge again when called.\n\nAnd then there is Will. He carries something the others do not. His connection to the Hive Mind has never been completely broken. In stories and in campaigns, there is always one character who leaves the battlefield changed forever. That mark does not fade. It becomes a thread the enemy can tug on.\n\nThe final image of the show quietly reinforces all of this. Children gather around a Dungeons &amp; Dragons table and begin to play, while the original group ages into mentors, guardians and witnesses. One generation finishes its chapter. Another one sits down, opens the rulebook and starts rolling.\n\nPerhaps Stranger Things did not truly end. Perhaps only one party reached the final session, while the greater campaign continues, waiting for whoever is brave or foolish enough to take the next seat at the table.",
        "upvotes": 31,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1q1gbmp/stranger_things_has_officially_ended_or_has_it/"
    },
    {
        "id": "1q1h7an",
        "author": "Few-Consequence2702",
        "title": "Personally",
        "content": "I loved Stranger Things. Sure, it had its imperfections, but it was such an incredible ride. The second half of the finale hit hard. The flashbacks - the nostalgia. The glimpses of the future for each of the characters we grew to love and connect with. I’m sad. I’ll miss it. Thank you Duffers! Over &amp; Out ",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q1h7an/personally/"
    },
    {
        "id": "1q1671g",
        "author": "OdiseoX2",
        "title": "Regarding Kali in Stranger things (spoilers)",
        "content": "I just feel they did Kali’s character dirty this season. The only two reasons i can think of that they brought her back was to kill someone so they wouldn’t have to kill anyone from the main group, and to close the gap about what happened to her after the show ended. ",
        "upvotes": 59,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1q1671g/regarding_kali_in_stranger_things_spoilers/"
    },
    {
        "id": "1q0xodo",
        "author": "Naive_Fee258",
        "title": "Thoughts on the Stranger Things final episode?",
        "content": "Thoughts/concerns/questions\n\nThe ending was amazing and Holly was my favorite character this season!!\n\nI don't have a favorite season I like them all for different reasons but I think the final  ending was 🤯🤯.\n\nA lot of people were divided about this season.",
        "upvotes": 158,
        "comments": 627,
        "media": null,
        "permalink": "/r/netflix/comments/1q0xodo/thoughts_on_the_stranger_things_final_episode/"
    },
    {
        "id": "1q12s2s",
        "author": "Itzsuvo",
        "title": "Kali (spoilers)",
        "content": "The entire fandom owes an apology to Kali, ever since she appeared on screen people started LOATHING her, like since s2, the hate for her in s5 was insane, people were like shes with mind flayer, shes a traitor and blah blah.\n\nShe played the most important role in the season, not only she saved max and the kids, she always stood for the truth, she knew only if she and el died it would be possible for El's friends and family to live, she was ready to sacrifice herself, and she did but hop changed her mind and made her realise her death can make El live, so she sacrificed herself and came up with the greatest mastermind plan while bleeding to death and moments away from dying, she used her powers to save El while dying, goodness gracious! she is the real hero of the season, will and el together killed one but she single handedly saved the protagonist of the show from death with her life, she died so El could live, she is the hero the fandom never deserved. She definitely wasn't on Vecna and El's level on power but her powers were beyond them, Kali the reality manipulator. She has my respect and she is definitely my fav s5 character.\n\n",
        "upvotes": 27,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q12s2s/kali_spoilers/"
    },
    {
        "id": "1q15rk9",
        "author": "OriginalRequirement6",
        "title": "Members Only: Palm Beach",
        "content": "Gale is a racist uneducated xenophobe. I don't care about anyone's opinions of Romina but the fact that this woman couldn't understand her country of origin (kept saying Pakistan instead of Uzbekistan) THREE TIMES, criticized her cultural way of eating and then said in interviews she needs to go back to her country is wild. Like this is straight up xenophobic.",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q15rk9/members_only_palm_beach/"
    },
    {
        "id": "1q1jzmc",
        "author": "IslandGirl8412",
        "title": "What would you have liked to see during the final season?",
        "content": "***Caution: SPOILERS ahead!***\n\nI'm one of many who feel that Stranger Things 5 was underwhelming. There were some decent moments and the finale was alright, but overall I feel that the whole season, including the finale, failed to live up to expectations. Yes, know this is partly a me problem, but there were also issues with pacing, lazy writing, and a feeling that the stakes weren't as high as they had been in previous seasons.\n\nI know I'm not alone in feeling this, and would love to know what others were hoping to see during the course of the final season. Here's my list:\n\n* A major death early on would have been powerful. As hard as it would be to lose one of the key characters, it could have raised the stakes and firmly established Vecna as a real threat, since he didn't feel like much of one throughout S5. That loss could then echo through the rest of the season, with the characters’ grief driving them to defeat Vecna and keeping viewers on edge because we truly don't know who's safe.\n* The return of past characters for Vecna to use as psychic weapons. Barb for Nancy, Eddie for Dustin, Bob for Joyce, maybe even Billy for Max again. I liked what they did with the montage near the end, but it would have been nice to see the actual actors again.\n* I'm probably going to be in the minority here, but I think Will's death could have brought the story full circle. Don't get me wrong, I thought the actual ending was lovely, but there could have been so much more complexity if by killing Vecna/MF, the characters were forced to confront the cost of saving the world versus saving their best friend/brother/son. Maybe a tender moment where Joyce reflects on how lucky she was to see the rest of her son’s childhood—even if it was borrowed time.\n* There should have been more demogorgons, dogs, bats, maybe even something new, &gt;!at least in the final battle scene with the mind flayer. The scene felt a bit anticlimactic and the mind flayer was defeated too easily!&lt;. I've seen a theory that these creatures are maybe absent because they make up the body of the mind flayer but if this is what the Duffer's had in mind, they could have written a more layered action sequence. Maybe something where the group is fighting an army of demos, and we think our side is winning, they retreat, but then the mind flayer rises up...\n* After so much build-up, we really needed stronger forces on both sides this season. I would have liked to see the army somehow team up with the core group to fight the final battle together. Give Linda Hamilton's character some extra depth. At the end, it could create an even stronger conflict when the army reverts back to their original goal of capturing El.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jzmc/what_would_you_have_liked_to_see_during_the_final/"
    },
    {
        "id": "1q1jskj",
        "author": "isnotacrayon",
        "title": "Physical: Welcome to Mongolia missing episodes?",
        "content": "I thought this show was supposed to be four total episodes, and the last two were meant to drop on 12/30, but they have not yet. Does anyone know why this could be?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jskj/physical_welcome_to_mongolia_missing_episodes/"
    },
    {
        "id": "1q1im6b",
        "author": "Buddhapanda75",
        "title": "Low Quality Video",
        "content": "I feel like I'm getting screwed over by using my PC. Twice in the past month, whether I use the desktop app or the browser, I have pulled up titles that wouldn't even play in 720 (\"Caught Stealing\" is 540 right now). It works fine on some title, but others simply will not stream at decent quality regardless of what device I use (laptop or PC, app or browser). These are new titles, specifically, \"Karate Kid: Legends\" and \"Caught Stealing.\" I'm paying for the highest tier, so why are these titles only available in sub-par quality? Anyone else having similar problems? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1im6b/low_quality_video/"
    },
    {
        "id": "1q1if6k",
        "author": "SH18AYN",
        "title": "Does anyone have issues with downloaded content disappearing on iOS?",
        "content": "Working at sea with very limited access to internet. I download a few series’ and watch them for a while, then one day they just disappear (not expire) from the Netflix app but are still in my iPad storage. Really irritating as I need to wait a few days till the internet access is back to redownload everything again.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1if6k/does_anyone_have_issues_with_downloaded_content/"
    },
    {
        "id": "1q0gmea",
        "author": "DetectiveHot2071",
        "title": "The Evil Influencer completely leaves out Jodi and Ruby’s secret ‘intimate relationship’",
        "content": "",
        "upvotes": 304,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1q0gmea/the_evil_influencer_completely_leaves_out_jodi/"
    },
    {
        "id": "1q11co4",
        "author": "Prestigious-Play8863",
        "title": "Stranger Things finale felt… surprisingly calm (no spoilers)",
        "content": "While most people were celebrating New Year’s, ST fans were up and about waiting for Episode 8. I started it the moment it dropped.\n\nI expected tears. I had the tissue box ready. I barely needed it.\n\nThe finale isn’t bad at all, but it feels gentler and easier than I expected after ten years of buildup. \n\nCurious how others felt. Did the calm ending work for you, or were you expecting something heavier?\n\nHere's a Link to full spoiler-light thoughts - https://medium.com/@fbgmb/spoiler-alert-9bbccf39f57c\n",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q11co4/stranger_things_finale_felt_surprisingly_calm_no/"
    },
    {
        "id": "1q1hpr0",
        "author": "Miserable-Bother-572",
        "title": "Run Away",
        "content": "I have just finished Run Away, a new mini series based on Harlan Coben's book. Generally, I have enjoyed it, it is his typical misery story with a few plot twists, shocks and red harrings. Perfect for a lazy day. What I do mind are some loose ends. Did someone else finish it and wants to share an opinion?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q1hpr0/run_away/"
    },
    {
        "id": "1q1fte2",
        "author": "MissMystery11",
        "title": "We can now only hope that:",
        "content": "Blue Eye Samurai, Wednesday, and All Of Us Are Dead as the last 3 of the greatest titles expected to have a good written finale. I think Alice in Borderland should’ve just been left with only 3 seasons as there already was a happy ending. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q1fte2/we_can_now_only_hope_that/"
    },
    {
        "id": "1q1f296",
        "author": "futurehistorianjames",
        "title": "How Accurate is the The Ranch to Real Life Ranching",
        "content": "I always binge The Ranch during the holidays. It’s one of my favorite shows and feel good holiday series. My question is just how accurate is the show to the real world of ranching? How the Bennetts make their money and actually run the ranch. Just curious. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1f296/how_accurate_is_the_the_ranch_to_real_life/"
    },
    {
        "id": "1q0zc4s",
        "author": "HehroMaraFara",
        "title": "Was “What’s in the Box?” A fake game show?",
        "content": "Something felt a bit off about it. The dynamics, the personalities and the prizes were too perfect. \n\nThen I see that the Laith(sp?) guy was an actor in the Stranger Things series finale, but a bit part where it wouldn’t be too obvious. I’m guessing all the other contestants have some connection to show biz in some way. So was it just a contrived 6 episode fake game show used as filler content and a promotion for multiple Netflix programs?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q0zc4s/was_whats_in_the_box_a_fake_game_show/"
    },
    {
        "id": "1q0hhi8",
        "author": "CrimsonSigh",
        "title": "What’s one Netflix show you wish you could watch again for the first time?",
        "content": "Looking for recs and curious what really stuck with people.\n\nWhat’s that one show that ruined other shows for you because it was that good?\n\nFeels like I spend more time choosing than actually watching.\n\nWhat are you currently watching that’s actually worth starting?",
        "upvotes": 161,
        "comments": 665,
        "media": null,
        "permalink": "/r/netflix/comments/1q0hhi8/whats_one_netflix_show_you_wish_you_could_watch/"
    },
    {
        "id": "1q1djyc",
        "author": "BroccoliManl",
        "title": "My netflix is freezing my TV",
        "content": "So this started about 1 year on one of my tvs. I try to open netflix and it's just stuck. I can't enter on any account or better yet I can't even move on any account and I can't even exit. Restarting my TV is not even working and sometimes it dosent even open properly.\n\n Only thing that worked is pulling the cable because it restarts the TV completely. \n\nFrom my deduction (prob a bad one), netflix runs on the background or smt so that if it's not closed properly sometimes it doesn't open correctly.\n\nOn a separate TV (from another brand) it is stuck on the profile choose and either loads forever or just gets stuck. On this one I can press the prime video button and it works and I can exit netflix.\n\nI am searching for something like a take manager for TV to fully stop netflix but idk how. \n\nIf you guys have any idea comment pls.\n\n\nPS: It only happens on netflix and not on any other app",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1djyc/my_netflix_is_freezing_my_tv/"
    },
    {
        "id": "1q1bw89",
        "author": "iNhab",
        "title": "The perfect neighbour- share your stories that are similar to this one.",
        "content": "Hey people. I've just watched this crime documentary. It's insane. But also I can relate to it a lot due to having family members being similar to it.\n\nHave you ever had such experiences? If so, what was it like? Share your story, share the detail ks to the point that you're comfy with.\n\nThe experiences that I personally am referring to- most likely a delusion or oversensitive person, misjudging situations, constant complaints or fuss caused by one person and then it ends up being them over reacting.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1bw89/the_perfect_neighbour_share_your_stories_that_are/"
    },
    {
        "id": "1q1bamg",
        "author": "cdymphna",
        "title": "netflix asking to update profile every time i open it",
        "content": "i’ve been on the phone with support for 30 mins. they just keep telling me to try reloading or logging out and back in. every single time i select my profile, it goes to the “Let’s update your profile” page and I have to select a birthdate and gender to get through. every single time. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1bamg/netflix_asking_to_update_profile_every_time_i/"
    },
    {
        "id": "1q1b3pa",
        "author": "Key-Promotion-4766",
        "title": "English Audio Track Not Working?",
        "content": "Watching Netflix this morning and we have music coming through but no voice/dialogue audio track. Tried switching the audio tracks to other languages and those work just fine, but not the English one. Have an AppleTV and TCL TV. \n\nAnyone have a fix for this??? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1b3pa/english_audio_track_not_working/"
    },
    {
        "id": "1q1a9ws",
        "author": "Curious-Dingo-756",
        "title": "How did you find the ending of stranger things? Was it near to satisfaction?",
        "content": "Done with entire stranger things. Probably felt like getting just over with it. I don't know I was glued till season 3 and half of season 4 but season 5 nah, just wanted to get it over with. What about you? ",
        "upvotes": 1,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1q1a9ws/how_did_you_find_the_ending_of_stranger_things/"
    },
    {
        "id": "1q1ioxw",
        "author": "Calm_B4_TheStorm",
        "title": "Netflix gift card",
        "content": "I don't have a Netflix account by wish to watch last season of stranger things. \nHow do the gift cards work? We just want to get about 1 or 2 months worth just to watch stranger things, then delete Netflix.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q1ioxw/netflix_gift_card/"
    },
    {
        "id": "1q1krl8",
        "author": "ApartmentSad9283",
        "title": "Is anyone else hoping for an Extended Edition of Cobra Kai's final season?",
        "content": "With the series wrapped up, there’s been a lot of talk about the footage that didn't make the final cut. Fans have been pointing out that the Sekai Taikai brawl was reportedly meant to be much longer, and several actors have mentioned alternate character resolutions—specifically for Kwon and even the fate of Kreese—that were filmed but edited down for the streaming release.\n\nAs someone who has followed the show since the YouTube Red days, I feel that a Revised Extended Version of Season 6 would be the perfect way to give the series the epic finale it deserves on physical media. Restoring these fights and character moments would add so much more depth to the final arc.\n\nI’ve started a community initiative to show Sony and Netflix that there is a massive market for an Extended Master Cut release. If you could restore just one deleted scene or fight from the final season, what would it be? Personally, I want to see the full unedited dojo brawl.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1krl8/is_anyone_else_hoping_for_an_extended_edition_of/"
    },
    {
        "id": "1q18w5u",
        "author": "Aggressive-Ad-8298",
        "title": "Juvenile Justice questions",
        "content": "So I have some questions about the last few episodes. Please help cause I might have missed some details and now I can't sleep.\n\n\n1. The whole car-crash, underage driving case. So the bullies just get away with it all? I thought they were setting the story up for the girlfriend to confess. Because of that I was eagerly waiting until the end but did that plotline just end like that? So unsatisfactory\n\n2. Baek Do-Seok and Hwang In-Jung. Ms.Na's decision was only the start as I understood, right? Criminal case will be opened against them for the p*rn, r*pe, the shoe-collecting, blackmailing, scamming etc, right? Cause I was also waiting for the girlfriend and the other runaway victims to testify against them. \n\n3. Baek and Hwang can only be sentenced maximum 20 yrs???? For me it should be for life but that's what they established at the beginning of the show, right? The devils\n\n4. Did the whole Juvenile Act thing Mr.Kang wanted to do come to fruition? Cause the last scene showed him looking at a document and smiling? \n\nThank you to everyone who will answer my questions cause this show won't let me sleep ugh",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q18w5u/juvenile_justice_questions/"
    }
]