[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1la96x3",
        "author": "theallglowing",
        "title": "VHS ambiguo in zona Porta Susa. Esperimento sociale?",
        "content": "Due sere fa' ho trovato questo VHS, posizionato in modo \"strategico\". Qualcuno sa se si tratta di una campagna pubblicitaria/esperimento sociale di qualche content creator? \n\nÈ stato veramente strano trovare un VHS, così de botto, con scritto 'sex' sopra e mi ha incuriosito! ",
        "upvotes": 84,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7lan7jkm4n6f1.jpeg?auto=webp&amp;s=42525433dcdb0361e3a49d7feaf9a1e15bd1787e"
        },
        "permalink": "/r/torino/comments/1la96x3/vhs_ambiguo_in_zona_porta_susa_esperimento_sociale/"
    },
    {
        "id": "1lac6v8",
        "author": "dreamskij",
        "title": "Anche il todays e' morto... (si', sono in ritardo)",
        "content": "E insomma, oggi d'improvviso mi rendo conto di non avere ancora visto i manifesti per il Todays... e scopro che dopo l'ultima edizione col cambio di sede (venue troppo grande in effetti, a parte per i Massive Attack), e' morto un festival che aveva lineup senza dubbio fighi e che per tanti anni e' stato l'ultimo regalo dell'estate.\n\nSul pratino dello Spazio 211 avevo visto Pj Harvey, gli Editors, gli Interpol, i Sonic Youth... e Anna Calvi, Black Country New Roads, Jarvis Cocker, The War on Drugs, King Hannah e altri che ora dimentico. Peccato, e' la morte di una piccola era per me :(",
        "upvotes": 35,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lac6v8/anche_il_todays_e_morto_si_sono_in_ritardo/"
    },
    {
        "id": "1laftih",
        "author": "kaiserxol",
        "title": "Metro e GTT: perfavore tenete i bocchettoni aria sempre aperti",
        "content": "Come da testo, sono proprio ora in metro e finalmente scorre parecchia aria all’interno, ovviamente solo in movimento. Sicuramente hanno aperto qualcosa nella parte superiore, cosa che non mi capita di sentire da tempo.\n\nSono vagoni sigillati, vi prego teneteli sempre aperti almeno in primavera/estate. Non fanno miracoli, ma almeno si riesce a respirare e non manca l’aria!!\n\nGrazie 🙏 ",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1laftih/metro_e_gtt_perfavore_tenete_i_bocchettoni_aria/"
    },
    {
        "id": "1laf670",
        "author": "cerebralme",
        "title": "Furto cassa automatica Esselunga",
        "content": "Oggi ero in coda per le casse dell esselunga di porta nuova, la commessa mi indica di andare a una delle automatiche dove una ragazza stava imbustando tipo 8 confezioni di tofu, mi metto lì  vicino mentre questa freneticamente si spinge il tofu nello zaino, le dico che non deve fare di corsa, che aspetto bolentieri e mi cade l'occhio  sul conto scansionato ancora da pagare: 2.99 euro, mi rendo conto della situazione e del perché  sia così  in ansia. Le rivolgo un piccolo sorriso e lei dice \"allora io vado\" e con ancora lo zaino aperto scappa verso l'uscita lasciando il conto aperto, la commessa mentre mi sbloccava la cassa lasciata aperta ha notato la cosa e credo abbia mandato qualcuno a vedere di \"bloccare la ragazza\"\n\nOra io non giudicherò mai qualcuno che ha bisogno di mangiare seppur devo dire 8 confezioni di tofu sono una dieta poittosto triste  ma la tecnica utilizzata mi e sembrata talmente stupida: è  uscita denza pagare nemmeno lo scontrino \"ridotto\" e con un evidente impedimento al sembrare nonchalant. Boh. \n\nVorrei chiedervi le vostre esperienze con queste casse che ormai è  il segreto di pulcinella vengano usate  per rubare.\n\n Vi è  mai successo di \"dimenticarvi\" di scannerizzare un articolo? Di essere beccati?\n\n Per essere chiari con i nostri amici delle forze dell ordine prego di scrivere solo storie di nostri amici lontani 🫣",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1laf670/furto_cassa_automatica_esselunga/"
    },
    {
        "id": "1lajgaw",
        "author": "Dense_Statistician_4",
        "title": "Parcheggio supermercato coperto",
        "content": "Buonasera devo partire per alcuni giorni e volevo chiedere se dovessi lasciare l'auto nel parcheggio coperto del mercatò o del Carrefour zona corso Montecucco risciò qualcosa?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lajgaw/parcheggio_supermercato_coperto/"
    },
    {
        "id": "1lacxlz",
        "author": "helenahjlee_01",
        "title": "Winery tour for Solo traveler from Torino",
        "content": "Hi all, \nIs there any soli traveler interedted in going to a winery tour on 16th of June? I am trying to book one but everyone says that minimum 2 people to book!! 😢 \n\nI would like to have another solo trVeler who wants to do the winery tour with me. \n\nMessage me if you are keen. \n\nThank you!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lacxlz/winery_tour_for_solo_traveler_from_torino/"
    },
    {
        "id": "1lafmtg",
        "author": "edwardemeo",
        "title": "Posti per studiare",
        "content": "Qualcuno conosce aule studio/bar/università aperte di sabato (l'ideale sarebbe anche domenica, e anche ad Agosto)? \n\nSono sempre stato abituato alle aule studio della mia università ma nel weekend è chiusa e ovviamente anche ad Agosto, a casa è improponibile per il caldo.. \n\nQualcuno conosce posti del genere? \nGrazie in anticipo ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lafmtg/posti_per_studiare/"
    },
    {
        "id": "1laezbb",
        "author": "Potential-Gain47",
        "title": "Affitare in zona Campus Einaudi (via Catania)",
        "content": "Abito in quella zona ma devo trasferirmi per lavoro, vorrei affittare il bilocale che ho in zona. Secondo voi quanto potrei chiedere d'affitto? È completamente ammobiliato.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1laezbb/affitare_in_zona_campus_einaudi_via_catania/"
    },
    {
        "id": "1l9zzto",
        "author": "LinguisticScarpa",
        "title": "Affittare in piazza della repubblica",
        "content": "Ciao, so che sono già stati fatti dei post su questa cosa ma non mi sono chiarita troppo le idee, quindi cerco altre opinioni. \n\nSono una ragazza che vive a Torino da tre anni, e ho trovato una stanza carina a porta palazzo, esattamente in piazza della repubblica.\nAlcune persone dicono che è sicura, altre che è da evitare come la peste. Ho vissuto in zona piazza statuto finora, e generalmente la sera sto a casa, ma mi capita di uscire e di tornare da sola. Ho la bici, che mi fa sentire più sicura, ma non so se a prendere la stanza rischio di mettermi in situazioni pericolose.\n\nConsigli?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1l9zzto/affittare_in_piazza_della_repubblica/"
    },
    {
        "id": "1l9q9l9",
        "author": "blunathan",
        "title": "Anche da voi blackout da un'ora?",
        "content": "Auto tra Aurora e Barriera e la corrente è saltata da un'ora. i semafori vanno ma dalle case vicino continuano a suonare gli allarmi\n\nedit: tornata alle 19:10 dopo più di un'ora e mezza",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1l9q9l9/anche_da_voi_blackout_da_unora/"
    },
    {
        "id": "1la0his",
        "author": "Libertymobile",
        "title": "Cosa pensa su straniero che vive solo in tua citta?",
        "content": "Vedo molte persone che si trasferiscono in Italia e si lamentano di sentirsi sole, di non fare amicizie, e di quella vecchia storia che sembra ripetersi all'infinito in tante storie. Ma volevo capire il lato di chi vive in Italia e vede queste persone arrivare. Cosa ne pensi? Hai qualche opinione sul perché ci siano così tante storie di persone che si trasferiscono e si lamentano di sentirsi sole? Come le vede una persona nata e che vive in Italia?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1la0his/cosa_pensa_su_straniero_che_vive_solo_in_tua_citta/"
    },
    {
        "id": "1l9o4m0",
        "author": "akkyuz",
        "title": "Palestra di boxe",
        "content": "Ciao, vorrei iscrivermi a una palestra di boxe, ho già fatto un anno di boxe in un'altra città quindi non parto proprio da zero, ma non sono neanche un veterano.\n\nSapreste consigliarmi? Possibilmente con un coach che ti segua e con ambiente regolare senza troppi invasati\n\nGrazie!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l9o4m0/palestra_di_boxe/"
    },
    {
        "id": "1l9p1jn",
        "author": "human_sam_",
        "title": "Aree attrezzate per grigliare in piemonte e/o vicino a Torino?",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l9p1jn/aree_attrezzate_per_grigliare_in_piemonte_eo/"
    },
    {
        "id": "1l9k6o9",
        "author": "bandbxb",
        "title": "Qualcuno che va al Kappa?",
        "content": "Cerco persone con cui andare al Kappa music festival il 4, 5 o 6 luglio. La data è indifferente, devo ancora comprare il biglietto! \n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1l9k6o9/qualcuno_che_va_al_kappa/"
    },
    {
        "id": "1l8zs14",
        "author": "LuxJupiterian",
        "title": "Trekking partendo da Torino con destinazione fiume dove fare il bagno",
        "content": "Ciao a tutti! Sono a Torino da 6 mesi, sono alla ricerca di qualche bel trekking montano con meta fiumi vari dove rinfrescarsi come premio post camminata.\nAvete consigli? Grazie mille :)",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1l8zs14/trekking_partendo_da_torino_con_destinazione/"
    },
    {
        "id": "1l93kpq",
        "author": "stiwi9",
        "title": "Idee originali festa di laurea?",
        "content": "Caro popolo di reddit torinese,\nmi laureo a inizio luglio dopo un percorso piuttosto lungo e travagliato e mi piacerebbe festeggiare a dovere con un po' di amici. Avete idee originali per fare festa una sera a Torino o in prima cintura, esempio qualche circolo dotato di piscina viste le temperature, o locali particolari che si possano riservare per una serata di bevute, possibilmente senza spendere uno sproposito? Grazie a chi contribuirà al brainstorming collettivo",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l93kpq/idee_originali_festa_di_laurea/"
    },
    {
        "id": "1l9jkl1",
        "author": "Mossfy",
        "title": "Juventus",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1l9jkl1/juventus/"
    },
    {
        "id": "1l8orlq",
        "author": "Beneficial-Spot5049",
        "title": "Cose insolite da fare a Torino durante l’estate?",
        "content": "Torno a Torino per qualche settimana quest’estate e vorrei fare qualcosa di diverso dalle solite attrazioni turistiche. Qualcuno consiglia attività alternative o eventi locali? Stavo anche guardando su [Bakeca.it](http://Bakeca.it) e Kijiji nella sezione “Eventi” e “Corsi”, ma non so se siano sempre affidabili. Qualche dritta da chi ci vive?",
        "upvotes": 12,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1l8orlq/cose_insolite_da_fare_a_torino_durante_lestate/"
    },
    {
        "id": "1l95ngu",
        "author": "Warm_Impress9930",
        "title": "Arti marziali",
        "content": "Buonasera, una domanda per caso c è qualcuno che pratica arti marziali e se si, quale?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l95ngu/arti_marziali/"
    },
    {
        "id": "1l8mn8t",
        "author": "scimmia3a",
        "title": "Tornata a Torino dopo Erasmus, consigli per nuove amicizie?",
        "content": "Ciao a tutti (((((:\nsono una ragazza di 21 anni, tornata da poco a Torino dopo quasi sei mesi di Erasmus.\n\nIl problema è che qui ormai non ho praticamente più amici. Le poche persone con cui uscivo prima si sono allontanate nel tempo (,: e sento di non conoscere più bene la mia città.\n\nMi chiedevo se qualcuno avesse consigli su dove o come conoscere nuove persone a Torino. Aperitivi di scambio linguistico? Eventi sociali? App utili? Anche solo qualche posto dove sia più facile socializzare senza sembrare strani 💀\n\nSono una persona tranquilla, socievole, adoro chiacchierare davanti a un caffè, fare passeggiate e scoprire angolini carini della città. Non cerco chissà che—mi andrebbe anche solo di avere qualcuno con cui condividere due chiacchiere ogni tanto.\n\nSe qualcuno è nella stessa situazione o ha voglia di parlare/conoscersi, mi farebbe super piacere.\n\nGrazie in anticipo !!",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1l8mn8t/tornata_a_torino_dopo_erasmus_consigli_per_nuove/"
    },
    {
        "id": "1l8rtz0",
        "author": "Gioordan",
        "title": "ITS AR/VR and Game Developer – qualcuno l’ha frequentato? Ne vale la pena?",
        "content": "Ciao a tutti,  \nsono un 3D artist di 27 anni. Dopo aver completato un corso per VFX, sono riuscito a fare una prima esperienza di un anno in uno studio. È stata una bella esperienza, ma il contratto è scaduto e, guardando il mercato (che mi sembra in crisi ormai da qualche anno), mi sto chiedendo se abbia senso continuare su questa strada o se sia il momento di studiare qualcosa di diverso.\n\nIl lavoro mi piace, quindi vorrei evitare di cambiare completamente settore. Cercando alternative, mi sono imbattuto nell’ITS *AR/VR and Game Developer* a Torino.  \nQualcuno di voi l’ha frequentato? O ha sentito qualche feedback in merito?\n\nSo che non ha il valore di una laurea, ma mi sembra comunque più strutturato rispetto a un semplice corso o diploma, e soprattutto mi permetterebbe di continuare a lavorare con il 3D, aggiungendo anche un po’ di programmazione, cosa che non mi dispiacerebbe approfondire.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l8rtz0/its_arvr_and_game_developer_qualcuno_lha/"
    },
    {
        "id": "1l8xsw5",
        "author": "giuseppe_tevez",
        "title": "CERCASI AMANTI DEL CALCIO",
        "content": "amanti del calcio che organizzano tornei con i videomaker per fare qualcosa di carino a torino?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l8xsw5/cercasi_amanti_del_calcio/"
    },
    {
        "id": "1l7tn63",
        "author": "SafeZookeepergame573",
        "title": "Piscine aperte a Torino e dintorni?",
        "content": "Conoscete qualche piscina all'aperto a Torino o dintorni? Com'è in quanto affollamento e prezzi? \nOvviamente mi riferisco a piscine con lettini ecc, piscine per il chill insomma.\n\nO comunaue in alternativa un posto dove andare  a chillare con possibilità di farsi anche un bagno (fiumi ecc) Grazie milleee",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1l7tn63/piscine_aperte_a_torino_e_dintorni/"
    },
    {
        "id": "1l814q5",
        "author": "Proof-Neck-8159",
        "title": "Multa mancato biglietto parcheggio",
        "content": "Ciao a tutti,\nVolevo chiedervi se ad oggi a Torino in caso di mancanza ticket parcheggio lasciano ancora una ricevuta sulla macchina o se prendono solo la targa e notificano tutto a casa.\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l814q5/multa_mancato_biglietto_parcheggio/"
    },
    {
        "id": "1l7z99l",
        "author": "shibarama",
        "title": "Best place to buy chocolates/souvenirs?",
        "content": "Ciao a tutti!\n\nI've been in Turin for the past month and I'm going back home at the end of this month. I want to bring some chocolates and souvenirs from Turin to my country, but I haven't been able to locate a good shop that could sell them. Any recommendations? Since I'm on a budget, I would love a place with low-cost prizes. If you have a place, please let me know!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l7z99l/best_place_to_buy_chocolatessouvenirs/"
    },
    {
        "id": "1l83oez",
        "author": "knwr",
        "title": "Motorcycle Rental?",
        "content": "Ciao! I'm visiting from Canada and was hoping to rent a motorcycle... But I haven't had much luck. Does anyone know a spot nearby?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l83oez/motorcycle_rental/"
    },
    {
        "id": "1l7y4jq",
        "author": "Specific-Living3836",
        "title": "HELP trovare una stanza.",
        "content": "Ciao a tutti, sono iscritto al politecnico di torino, corso design. Dovrò frequentare le lezioni nella Cittadella Politecnica del Design, tra Mirafiori nord e Mirafiori sud. Vorrei capire, da chi vive a Torino, quali sono le zone più comode per vivere pur rimanendo a distanza limitata dall'uni. Io sto cercando attualmente nei pressi della sede, ma mi rendo conto che probabilmente sto ignorando un sacco di zone che, per quanto più distanti, rimangono comode grazie alla rete di trasporti pubblici. Qualsiasi consiglio o suggerimento è ben apprezzato, visto che navigo in alto mare. Aggiungo che è la prima volta che cerco una stanza in totale autonomia e suggerimenti generali sulla ricerca potrebbero tornarmi molto comodi. Grazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l7y4jq/help_trovare_una_stanza/"
    },
    {
        "id": "1l7zc8c",
        "author": "Fabulous-Cry-9328",
        "title": "Allargare cerchi sociali Torino",
        "content": "Da 10 anni che vivo a Torino sono sposato recentemente abbiamo aperto la coppia e sto cercando allargare i miei cerchi sociali tra conoscenze amicizie e volendo anche altro come posso fare c'è qualcuno interessato? Ho  40 anni ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l7zc8c/allargare_cerchi_sociali_torino/"
    },
    {
        "id": "1l8cx6y",
        "author": "krasnyj",
        "title": "Piccolo sfogo sui post di incontri",
        "content": "Scusate la pesantezza. Sarò breve. E prometto di non offendermi qualora i mod trovassero questo post fuori luogo o al limite dell'incel e decidessero di toglierlo.\n\nL'epifania mi è venuta perché sto tornando da un giro in bici e, passando da davanti lo stadio del Torino, mi è capitato come di sovente di sospirare davanti al solito assiepamento di maranza tatuati palestrati al bar lì di fronte. Diciamo che questi rappresentano la stragrande maggioranza dei ragazzi della nostra età (io sono 27M ma ho conoscenze anche più giovani, e alla loro età non ho fatto esperienze: uno per colpa della pestilenza; due perché sono uno sfigato - call it projecting) e sono quelli che fanno le esperienze più intense e che si vivono meglio la città.\n\nEcco: facendo un post \"cerco amici\" qua sopra non troverei MAI una simile intensità o \"veracità\", ma al massimo uno con un livello di testosterone da far ridere pure la bonanima di Farinelli. Io non dico di essere migliore o diverso, e non dico che tutti debbano aderire al canone di cui sopra, ma credo che fare amicizia qua sopra non sia classificabile come \"fare amicizia con un torinese\". È statisticamente falso, e ci ghettizza in una realtà parallela, stantia, aliena alla frivolezza in questa città già di suo così allergica alla leggerezza.\n\nE non si può nemmeno fare come direbbe mio nonno, \"vai da quelli lì e dici ciao mi chiamo Pinco Pallino vuoi giocare con me\" perché appunto il bogianen medio (come l'italiano medio) smette di farsi nuovi amici all'inizio della pubertà e dopo è quasi impossibile penetrare le bolle e le compagnie senza sembrare uno stalker.\n\nCome possiamo fare per rompere questo meccanismo? Qualcuno ha avuto successo scrivendo \"cerco amici\" qua sopra e può confutare la mia tesi? Grazie in anticipo per le risposte.",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1l8cx6y/piccolo_sfogo_sui_post_di_incontri/"
    },
    {
        "id": "1l7w0bb",
        "author": "InevitableTip9005",
        "title": "Affidabilità Megaride Group",
        "content": "Avete mai sentito parlare di Megaride Group? \nStavo guardando delle opportunità di lavoro su Indeed e mi è uscita questa azienda.. mi hanno chiamato chiedendo di fare un colloquio e ho detto di sì.\nNon ho trovato tante informazioni online e vorrei sapere se è affidabile ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l7w0bb/affidabilità_megaride_group/"
    }
]