[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hvfhbu",
        "author": "Corey0619",
        "title": "Korean Show from 2020 name?",
        "content": "I’m trying to find a super interesting show I saw a few years ago. It was a Korean show (I believe) about a guy that would meet with the most dangerous people in the world and chat with them over some food. \n\nOne episode he went to a really dangerous place and ended up attending a dinner with all the mafia leaders of the area\nIt was called something like “Super soup time” or something silly\n\nBonus tidbit. Gus from the rooster teeth podcast mentioned it once around 2020. \n\nPlease help me find this amazing show again Reddit 🥲",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvfhbu/korean_show_from_2020_name/"
    },
    {
        "id": "1humnmr",
        "author": "Safe-Adhesiveness713",
        "title": "How do I turn my language to English? It randomly turned to this language and I don’t know how to switch it",
        "content": "",
        "upvotes": 261,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1humnmr/how_do_i_turn_my_language_to_english_it_randomly/"
    },
    {
        "id": "1hvcie6",
        "author": "mycatiseverywhere",
        "title": "looking for more series with 40+ minute episodes",
        "content": "i’ve already watched sex education, heartbreak high, asoue, anne with an e, gilmore girls, bridgerton, the decameron, and i just finished outlander.  i’m looking for more historical shows but i’m also open to most suggestions (not the crown or ginny and georgia. also not interested in medical dramas.) also, i usually watch tv while eating dinner and/or before bed, so nothing more violent than outlander :)",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvcie6/looking_for_more_series_with_40_minute_episodes/"
    },
    {
        "id": "1hv2v1n",
        "author": "xxchar_xoxo",
        "title": "Need new netflix obsession show recommendations ",
        "content": "I was wondering if anybody had recommendations for shows similar to heartstopper, Anne with an e and Bridgerton. Preferably on netflix, but could be prime or Disney plus too or even BBC iPlayer. Just any recommendations please!",
        "upvotes": 9,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hv2v1n/need_new_netflix_obsession_show_recommendations/"
    },
    {
        "id": "1hvatid",
        "author": "Huge_Industry3755",
        "title": "Horror movie suggestions",
        "content": "I have been trying to find a good, actually scary horror movie but I just can’t seem to find anything. If anyone has one or many suggestions I’d be super greatfull. I want a movie that will actually make me get goosebumps you know? An actual scary horror movie. In Netflix only of course",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hvatid/horror_movie_suggestions/"
    },
    {
        "id": "1huy2wc",
        "author": "Whobitmyname",
        "title": "The Sequel to Jean-Claude Van Damme's Revenge Thriller Is Topping Netflix Charts",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huy2wc/the_sequel_to_jeanclaude_van_dammes_revenge/"
    },
    {
        "id": "1hve1nd",
        "author": "whyamihea_",
        "title": "playback speed ",
        "content": "I watch my show on 1.5x speed and the subtitles can never keep up. It’s so annoying how Netflix not only doesn’t offer playback on TV but they can’t even sync their subs up properly with the speeds. This is extra annoying when the show is in another language so I really don’t know what they’re saying without subtitles. How can such a big corporation not do something so seemingly simple? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hve1nd/playback_speed/"
    },
    {
        "id": "1hvda8u",
        "author": "Alias72018",
        "title": "Anyone else having issues with changing their password?",
        "content": "I forgot my password, so I changed it. Then when I use my new password, Netflix says it doesn’t work. Tried changing it again and that doesn’t work either. Any advice?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvda8u/anyone_else_having_issues_with_changing_their/"
    },
    {
        "id": "1hv3y81",
        "author": "stroh_1002",
        "title": "How Feathers McGraw Became Cinema’s Most Terrifying Villain",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hv3y81/how_feathers_mcgraw_became_cinemas_most/"
    },
    {
        "id": "1hvc6sy",
        "author": "indiewire",
        "title": "The 24 Scariest Movies on Netflix: Pearl, Fear Street, Scream &amp; More",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hvc6sy/the_24_scariest_movies_on_netflix_pearl_fear/"
    },
    {
        "id": "1huuwpc",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix took home 6 Golden Globe awards 2 for Baby Reindeer and 4 for Emilia Pérez",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huuwpc/netflix_took_home_6_golden_globe_awards_2_for/"
    },
    {
        "id": "1hv8eyh",
        "author": "ice_T33z",
        "title": "How come shows are only showing as HD but not 4k?\n",
        "content": "https://preview.redd.it/uw4mb2byjfbe1.png?width=682&amp;format=png&amp;auto=webp&amp;s=e1e47c25d90a0bdd7147233ec14e0410c75a9b9c\n\nhttps://preview.redd.it/dqfw16syjfbe1.png?width=567&amp;format=png&amp;auto=webp&amp;s=f34782751d8a568fd474c6371e5a240fd60ded2f\n\nLike for example in those shows breaking bad and life in color which should be 4k right? I also have the 4k subscription and am watching from the Netflix app with a 4k monitor.\n\n\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hv8eyh/how_come_shows_are_only_showing_as_hd_but_not_4k/"
    },
    {
        "id": "1hvc6es",
        "author": "indiewire",
        "title": "The Best Indie Movies on Netflix: 29 Films Streaming",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hvc6es/the_best_indie_movies_on_netflix_29_films/"
    },
    {
        "id": "1hv54ki",
        "author": "AmberAnk2000",
        "title": "Roku TV app issues",
        "content": "I restarted my subscription today and signed into Netflix app on the Roku TV. And after signing in the app froze, but not everything else. Got it fixed by restarting the app itself. So, once it fix. I was able to do things in the app, but after a little while. It decided to have issues and eventually Black screen on me. I have no clue why this is happening because app working just fine on my PS5, my phone, and my Laptop. So, finding it weird that it only having issues on the Roku TV.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hv54ki/roku_tv_app_issues/"
    },
    {
        "id": "1hv4zij",
        "author": "DAGStudio",
        "title": "Is there any way I can check which TV shows and movies Netflix had in previous years?",
        "content": "There's an anime movie I've been trying to find but I don't know it's name but I do remember it was on Netflix several years ago. I can also remember the description it had on Netflix and I'm almost sure it was classsified TV-MA (It was before Netflix changed their classification system).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv4zij/is_there_any_way_i_can_check_which_tv_shows_and/"
    },
    {
        "id": "1huoykl",
        "author": "PowerDubs",
        "title": "Since it's launch on Netflix games Oct 8th... Atari's RollerCoaster Tycoon has over 100,000 downloads on Google Play",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huoykl/since_its_launch_on_netflix_games_oct_8th_ataris/"
    },
    {
        "id": "1hvf64c",
        "author": "CockroachLatte",
        "title": "Unnecessary stretched Squid Games 2 ",
        "content": "I started to watch Squid Game 2 and even though episodes are same length as season 1, I feel almost all of the episodes are stretched with unnecessary dialogue, talking, doing nothing and scenes that doesn’t add anything to the plot. Almost all of entire season could be wrapped in 4 episodes. Why netflix has to ruin good show like this. Same they did to last stranger things, although it was good, it was unnecessary stretched. ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hvf64c/unnecessary_stretched_squid_games_2/"
    },
    {
        "id": "1huuxgk",
        "author": "moderngamer327",
        "title": "Opening Netflix in any browser causes screen to glitch",
        "content": "Having an issue where after opening Netflix without even opening a video causes the whole screen to be glitchy. Everything looks like it’s vibrating slightly and at the top of the screen there is thin stripes of rainbow glitches. This occurs in any browser with or without hardware acceleration. Even after closing Netflix the entire screen will remain glitchy until the monitor is turned off and on again. Disabling widevine prevents this from happening but obviously that’s not a solution as it prevents me from watching video.\n\nI had thought this may have been because of Nvidia Overlay but the issue persisted even after disabling it. I also tried to update drives and have the same issue",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huuxgk/opening_netflix_in_any_browser_causes_screen_to/"
    },
    {
        "id": "1hvbv4e",
        "author": "Materidan",
        "title": "“Extra Member” added for no reason?",
        "content": "I barely use Netflix. It’s one of those things I have just in case. A week or so ago I logged in while family was over and had a pop up about “paying for an extra member you’re not using” asking me to designate someone. I ignored it, thinking it was like Prime telling me about Prime features I’m allowed but don’t use.\n\nThen I noticed my bill has been higher by nearly $10 since November, went digging, and realize I’ve been paying for an extra member since then.\n\nCustomer service had no issue refunding me, but I’m really curious how this got added to my account especially since I barely use it and the feature has never been used?\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hvbv4e/extra_member_added_for_no_reason/"
    },
    {
        "id": "1hv08pp",
        "author": "SigmaProtocal",
        "title": "Show idea",
        "content": "Netflix has been doing immersive experiences in select cities for new shows like strangers things l. \n\nI was thinking it would be such a good idea to do a cooking competition show like culinary class wars, where patrons could pay to go into a screening of say 3 episodes, and be served a handful of dishes from the show as you watch them make it. I could easily see this being an incredible experience and seeing tickets go for hundreds of dollars. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv08pp/show_idea/"
    },
    {
        "id": "1huntic",
        "author": "lgh0614",
        "title": "will it not allow people at home to use my netflix account if i say i'm traveling?",
        "content": "i've (18) used my step moms netflix account for YEARS, which hasn't been a problem when i'm not at her place as long as i'm watching stuff on my laptop instead of my tv (i'm guessing because i bring my laptop with me when i go to her and my dads house). recently i've bought a bigger tv and theres this movie on netflix i've been wanting to watch, but i'd rather watch it on the tv instead. my step mom wouldn't mind me saying i'm traveling and giving me the code, i'm just wondering if that would mess up the ability for her to watch netflix at her house.",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1huntic/will_it_not_allow_people_at_home_to_use_my/"
    },
    {
        "id": "1hv2u4r",
        "author": "umimmissingtopspots",
        "title": "Netflix Series",
        "content": "Happy New Year everyone!\n\nI had some downtime these past few days and decided to binge a couple of Netflix series. One to see what the fuss was all about and an older one just because I like the actor who is in it.\n\nThe first series I watched was The Gentlemen. The first four episodes were okay but I told my wife I don't understand what the fuss is about. This isn't even close to being as good as Breaking Bad, Sopranos or Sons of Anarchy or even The Walking Dead (only because of the first four absolutely amazing seasons). It's not even as good as Yellowstone and I am not all that fond of it either. But at least it has moments of greatness. I told her unless it picks up I really don't know why people like it. \n\nI watched the next episode and was quickly eating my words. It really picked up and by the end of it I was like damn that was good. I would rank it better than Yellowstone but I still don't think it's as good as these other four shows. I hope season 2 ramps things up a notch too. I'm optimistic it will.\n\nThe other series I watched was Clickbait. I actually enjoyed this way more than I did The Gentlemen because it was engaging from the first episode until the last. I really thought I figured out by episode two who did it. I told my daughter it's quite commonly a pheriperal character and the character I suspected lined up with that notion. During episode 7 I was screaming \"Touchdown\" (as I was walking on my treadmill) because I thought my prediction was confirmed. Episode 8 proved me wrong and I am okay with that. It was a unique twist that I am sure very few would have suspected. \n\nAll in all they were both good series and I would recommend them to anyone who hasn't seen them.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hv2u4r/netflix_series/"
    },
    {
        "id": "1husfm3",
        "author": "GullibleRanger2616",
        "title": "Shows disappearing from continue watching ",
        "content": "Afew days ago the shows I’ve been watching disappeared from my continue watching and I tried to search them up and they weren’t on Netflix, I went onto a different profile and the shows were there still, does anybody experiencing the same issues and have a fix for this",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1husfm3/shows_disappearing_from_continue_watching/"
    },
    {
        "id": "1huwlyn",
        "author": "littlemoosehead",
        "title": "My profile isn't even appearing",
        "content": "My Netflix account has five profiles, and I use the fifth profile (not too sure if that matters but I figure any information could be helpful). When I use Netflix on a television, my profile appears and I can use it with no issues. However, on both my iPad and my PC browser, my profile doesn't even show up. I know it wasn't deleted because I can still use it, but then I'm forced to use my television. I've tried logging out and logging back in, I've tried uninstalling and reinstalling the app. I'm truly stumped and would appreciate some assistance.\n\nThanks in advance :)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1huwlyn/my_profile_isnt_even_appearing/"
    },
    {
        "id": "1huw3jl",
        "author": "Important_Use6452",
        "title": "Have you seen the shameless Brita advertising on recent Netflix shows?",
        "content": "I've seen Brita being plugged in the last 3 shows I've watched and I think I'm getting pissed lmao:\n\n\\- Black Doves: very prominent scene where the Brita and the product packaging is placed in the very center of a scene, and discussed and mentioned by name several times.\n\n\\- Man on The Inside: The main character wants a Brita as his birthday gift and two characters go out to buy one.\n\n\\- Love Is Blind: One of the main contestants says he can't do much except fill a Brita up with water (could be just a coincidence not necessarily a plug)\n\nHave they been plugging it on other shows?",
        "upvotes": 0,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1huw3jl/have_you_seen_the_shameless_brita_advertising_on/"
    },
    {
        "id": "1huva7u",
        "author": "kingseyb",
        "title": "New on Netflix in January 2025",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huva7u/new_on_netflix_in_january_2025/"
    },
    {
        "id": "1hvb4t8",
        "author": "FeanorOnMyThighs",
        "title": "I AM going to be one of those ones who cancels my netflix. ",
        "content": "Been with you since the days of getting BSG on DVD sent to my mailbox.  Old school binger.\n\n  \nWhat is up with the nazi level shit you have where I cant even flip to a new tab when your commercials come up?  Even cable lets you flip to the weather channel.  I can not be made to stare at a BK commercial when watching your same old shit again.  I'll just flip through the others before circling back to see whats new after im done binging on the other streaming services in turn. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hvb4t8/i_am_going_to_be_one_of_those_ones_who_cancels_my/"
    },
    {
        "id": "1huv61m",
        "author": "Naiivee",
        "title": "Netflix HDR not working ",
        "content": "Anyone now how to fix this? HDR content on Netflix is doing this. I don’t even know how to describe this issue so I figured I’d ask here.",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5n8z42m1dcbe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1huv61m/netflix_hdr_not_working/"
    },
    {
        "id": "1hv1d4r",
        "author": "DarkKnight1799",
        "title": "Help me find this English web series",
        "content": "[ToMT][Netflix] A Netflix series where a couple adopt a puppy\n\nIn the opening scene of this web series, a couple went to adopt a puppy. \nThe adoption center caretaker show the wife a picture of her husband with another girl and refused the puppy. \nThis revelation led to an argument between the couple. \n\nAll I can remember is this much. \nAfter this, I could not continue it for some reason. \nAnd I can't find this series in my continue watching list. \n\nPlease help me find it. \nThanks. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hv1d4r/help_me_find_this_english_web_series/"
    },
    {
        "id": "1huv432",
        "author": "Negative-Radio9713",
        "title": "Why do netflix thumbnails look so bad??",
        "content": "Most of the time, the thumbnails for shows and movies (specifically on Netflix) have seemingly altered thumbnails that look like random screenshots from the show/movie it represents.\n\nThis really feels like it takes away from the contents of the show/movie and often just leaves me skipping stuff to find better things to watch bc everything (for whatever reason) looks like a sitcom.\n\nI cannot be the only person to think this is a problem cuz we all pay for netflix but get shown half-baked thumbnails, making me wanna just use something else or cancel my subscription entirely since i just cant seem to find a ton of content that screams ate anymore.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huv432/why_do_netflix_thumbnails_look_so_bad/"
    }
]