[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lqoho3",
        "author": "Intelligent-Deal-759",
        "title": "Personale riflessione sul concerto dei Tamango del 28/06",
        "content": "Non sono solito scrivere recensioni di concerti e, a dirla tutta, non credo nemmeno di esserne capace. Tuttavia, al concerto dei Tamango dello scorso 28 giugno ho avuto occasione di respirare un’energia particolare, e vorrei ascoltare altri punti di vista.  \n  \n**Smosso** dal fatto che su instagram e tiktok ho trovato solo recensioni entusiaste, prive della minima sfumatura critica. Questo mi ha lasciato un dubbio: sono io che non capisco nulla o siamo sempre più immersi in una bulimia produttiva, musicale e artistica, dominata dall’ego, dall’autoreferenzialità e dall’ostentazione culturale?\n\n  \nL’evento, è graficamente bellissimo. Sito originale. Indicazioni per raggiungere il luogo precise e chiare. La comunicazione, soprattutto sui social, originale e con un tocco teatrale che in Italia raramente si vede. Una ventata di creatività e stile che aveva alimentato le aspettative.  \n  \nIl concerto si è svolto a Pino Torinese, in un campo da calcio dilettantistico. Scelta simpatica, che strizzava l’occhio al “sogno stadio”, pur restando con i piedi ben piantati nella dimensione del gruppo.\n\nSi parte intorno alle 21:40, con un’introduzione poetica e originale che, ahimè, ha già messo in luce il primo grande problema della serata: il **sound**. Il volume della voce era mal calibrato, spesso impastato nella base musicale (questo vale quasi per tutto il concerto). Nei momenti di silenzio o transizione tra un brano e l’altro si percepiva un fastidioso rumore di fondo.   \nLa qualità del suono degli strumenti soprattutto nelle prime file, lasciava a desiderare, rendendo faticoso seguire le canzoni.\n\nDurante il concerto presentano prevalentemente brani nuovi, alternati a momenti più teatrali. A ogni canzone corrispondeva un cambio d’abito del frontman, che sembrava più interessato a ostentare la propria poliedricità (o presunta tale) che a cantare.  \nEsempio: “Guardate, indosso la gonna, sono anticonformista!”, o “Ecco il taglio alla Taxi Drive, sono un cazzo di ribelle!”\n\nPeccato che il canto non arrivasse al pubblico.\n\nIl concerto è durato circa tre ore. TRE ORE. TRE. ORE.  \nTre ore confuse, sfilacciate, senza un reale filo conduttore. Tranne in due sporadiche canzoni, il gruppo non è mai riuscito a creare un vero legame col pubblico. Quando finalmente sembrava che il feeling stesse per nascere, il cantante si è messo a fare il buffone, spezzando la magia e riportando il tutto a un livello amatoriale, se non proprio dilettantesco.\n\n Più che un concerto, è sembrata la classica recita di fine anno di quinta elementare, condita da qualche loro canzone famosa che giustifica l’incasso del biglietto e la sottrazione di oltre quattro ore di vita ai presenti.\n\nE a proposito di organizzazione: 600 persone (o forse 800 o forse 1000 non so) e solo due banconi per la birra. Le code oscillavano tra i 20 e i 40 minuti (DURANTE IL CONCERTO), per poi ricevere una birra già sgasata, preparata a slot, che somigliava al mio piscio.\n\nUn concerto che ha lasciato più interrogativi che emozioni. Un accumulo o, per meglio dire, un cumulo di messaggi, canzoni, oggetti, outfit, suoni e presunzione, difficile da digerire.\n\n \n\nCi tengo a precisare che la critica riguarda esclusivamente l'evento in sé e riflette un punto di vista personale. Rimane fuori discussione che il gruppo torinese abbia un potenziale altissimo e continui a dimostrarsi un ottimo creatore di canzoni.",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lqoho3/personale_riflessione_sul_concerto_dei_tamango/"
    },
    {
        "id": "1lqmf93",
        "author": "Confident-Art-8800",
        "title": "Ristoranti a Torino dove portare la propria ragazza",
        "content": "Ciao a tutti torinesi,\nSto cercando un posto a Torino dove mangiare qualcosa di buono ma che abbia anche un’atmosfera super carina per portare la propria ragazza. Magari qualche cortile interno con le lucine appese o simili.\n\nVi viene niente in mente?",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1lqmf93/ristoranti_a_torino_dove_portare_la_propria/"
    },
    {
        "id": "1lqm99n",
        "author": "Open-Tumbleweed-5110",
        "title": "Kabu kabu Torino",
        "content": "Ciao a tutti! Qualcuno ha qualche contatto di kabu kabu da passarmi?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lqm99n/kabu_kabu_torino/"
    },
    {
        "id": "1lqkosn",
        "author": "Fast_Page_4240",
        "title": "Politecnico Di Torino",
        "content": "I just graduated highschool and I want to do Architecture in Politecnico di Torino.\n\nIs it worth it?\nI might have more questions.\n\n(I studied A levels)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lqkosn/politecnico_di_torino/"
    },
    {
        "id": "1lq5rsh",
        "author": "Worried_Childhood_67",
        "title": "Miglior supermercato qualità prezzo",
        "content": "Qual è secondo voi la miglior catena di supermercati (e magari anche un punto vendita specifico) a Torino come qualità prezzo? Guardando soprattutto i discount, non mi interessa che le cose siano di marca. \n\nFino ad ora ho sempre fatto la spesa da MD (corso regina) e mi sono trovato discretamente, ma visto che mi trovo ad attraversare quasi tutta la città per andare a lavoro sto valutando di cambiare supermercato di fiducia, magari per trovarne uno più grande e con più scelta. \nIn particolare sto pensando ad Aldi, Lidl o Eurospin, ma sono aperto a qualsiasi suggerimento.\n\n\nQual è secondo le vostre esperienze il migliore come prezzi, qualità e quantità di prodotti offerti? ",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1lq5rsh/miglior_supermercato_qualità_prezzo/"
    },
    {
        "id": "1lqavgc",
        "author": "remybt01",
        "title": "Dove si può trovare l'acqua distillata?",
        "content": "Mi sono trasferito qui non molto tempo fa e ho avuto difficoltà a trovare una fonte vicina di acqua distillata. Ho bisogno di acqua \"distillata\" perché uso una macchina CPAP. Non posso usare né acqua purificata né demineralizzata. Ne ho trovata un po' da DM Italia al Lingotto, ma non è molto comodo per me andare e tornare perché non ho la macchina. Abito a Crocetta, tra il Politecnico e l'Ospedale Mauriziano Umberto I. Ho provato in una farmacia normale, ma vendono solo acqua purificata, e supermercati come Carrefour e Pam vendono solo acqua demineralizzata per la pulizia. Fatemi sapere se servono chiarimenti, dato che ho scritto con Google Translate, come potrebbe essere evidente, visto che non conosco ancora l'italiano.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1lqavgc/dove_si_può_trovare_lacqua_distillata/"
    },
    {
        "id": "1lq99q2",
        "author": "anonima2447",
        "title": "Studenti (di medicina in particolare) fuori sede a Torino: come vi trovate?",
        "content": "Ciaoo ho 17 anni e stavo pensando di fare medicina più avanti; e pensavo proprio di andare a Torino. Quindi se magari avete qualche informazione su come si vive, l’università, ecc… e volete condividerla mi farebbe molto piacere!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lq99q2/studenti_di_medicina_in_particolare_fuori_sede_a/"
    },
    {
        "id": "1lq6qw3",
        "author": "InThron",
        "title": "Torneo di Videogiochi Gratis || Venerdi 11 Luglio",
        "content": "Ciao ragazzi, organizzo tornei di videogiochi in diversi paesi da un po piu di un anno, fino adesso ne ho fatto 6 in paesi diversi (thailandia, philippine, vietnam, etc.). Adesso che sono di ritorno a Torino volevo farne uno pure qui! \n\nIl torneo e completamente gratuito e il vincitore si fa 20 Euro. Io non guadagno niente e lo faccio solo per passione! \n\nSe vi sembra interessante e volete fare qualche chiaccherate giocando a dei giochi venite pure! \n\nInscrivetevi qui: [linktr.ee/114Events](http://linktr.ee/114Events)",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t8hy9yldviaf1.png?auto=webp&amp;s=60be2937ffe47824baef340798c95fef22858bf9"
        },
        "permalink": "/r/torino/comments/1lq6qw3/torneo_di_videogiochi_gratis_venerdi_11_luglio/"
    },
    {
        "id": "1lq3bt5",
        "author": "ContabileUbriaco",
        "title": "Condizionatore a Torino, prezzi folli",
        "content": "In questo periodo sto cercando di istallare un semplicissimo monosplit, e sto ricevendo dei preventivi con dei prezzi folli, comprendo tutto ma 1800 euro per un monosplit è un prezzo completamente folle.\n\nQualcuno ha consigli su ditte in Torino? Ci sono rischi ad istallarlo da soli?",
        "upvotes": 3,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1lq3bt5/condizionatore_a_torino_prezzi_folli/"
    },
    {
        "id": "1lpwfzw",
        "author": "Training_Medicine_49",
        "title": "Arrivare dall’aeroporto al centro",
        "content": "Ciao a tutti \nC’è qualcuno che può chiarire una cosa per me. Prima volta a Torino, arriverò all’aeroporto ma c’è un treno che va a porta susa senza un cambio ? Ho visto online informazione che suggerisce che c’è un treno diretto ma anche vedo sul sito di Trenitalia che c’è un cambio. Volevo prendere il treno o autobus ma evitare cambi e soste ecc. quanto costa di solito? ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lpwfzw/arrivare_dallaeroporto_al_centro/"
    },
    {
        "id": "1lq4qym",
        "author": "_pigreco_",
        "title": "free camping",
        "content": "ciao, io e i miei amici vorremmo organizzare 1/2 notte di free camping in montagna, possibilmente raggiungibile con mezzi pubblici. se avete qualcosa da consigliarci è ben accetto (anche consigli sul free camping essendo la nostra prima esperienza)",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lq4qym/free_camping/"
    },
    {
        "id": "1lq3dow",
        "author": "RandomNerdGuy95",
        "title": "Buon personal trainer e nutrizionista",
        "content": "Salve, per caso qualcuno sa consigliarmi una soluzione che coniughi nutrizionista e personal trainer a Torino? Ovviamente non cerco una persona che faccia ambo le cose, ma magari uno studio/azienda che offra un pacchetto che includa entrambi i servizi. Se qualcuno ha qualche esperienza da raccontare, meglio.\n\nIl mio obiettivo è aumentare un po' il peso, mettendo su qualche muscolo. Sono il classico \"ragazzo\" secco (viaggio verso i 30 oramai..). \n\nNon ho grandi pretese, vorrei solo sembrare meno ossuto (😅) ma da solo purtroppo non riesco.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lq3dow/buon_personal_trainer_e_nutrizionista/"
    },
    {
        "id": "1lpy257",
        "author": "ImpressedGuy95",
        "title": "Pizza romana",
        "content": "Ciao a tutti! Ci sono posti (oltre a Crocca) dove trovare una buona pizza bassa e croccante in stile romano? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lpy257/pizza_romana/"
    },
    {
        "id": "1lpvjif",
        "author": "ImpressedGuy95",
        "title": "Corsi di argilla e lab sharing",
        "content": "Ciao! Sto imparando a lavorare l'argilla. Ho visto che a Torino ci sono vari corsi, ne consigliate qualcuno in particolare? Esistono per caso associazioni/collettivi e simili con offerte più economiche o servizi di lab sharing (per tornio e forno)? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lpvjif/corsi_di_argilla_e_lab_sharing/"
    },
    {
        "id": "1lpb88l",
        "author": "tommisab",
        "title": "Ennesimo post sula GTT",
        "content": "Buonasera a tutti. Questa sera siamo qua riuniti per commentare l'ennesima masterclass della GTT.\nIn quanto utente frequentatore quotidiano del servizio da 10 lunghi, lunghissimi anni, sono ormai immune a qualsiasi tipo di evento a me avverso a causa della mia poco amata e tanto odiata GTT. Eppure, eccomi qua a fare questo post, per riassumere quelli che sono stati i 3 anni passati della mia adorata linea 15.\n\nEbbene, posso dire con sicurezza marmorea che questa linea è stata deviata per almeno 2 anni.\n\nInizia tutto con i lavori di rifacimento della strada (o delle rotaie, non l'ho mai capito) al capolinea di Sassi. Questi lavori costringeranno la direzione del nostro servizio pubblico a spostare il capolinea in corso Tortona, al posto della linea 3. Questo dura almeno 9 mesi. Pensavo fosse per permettere la sostituzione dei tram più vecchi con i modelli nuovi HITACHI, o almeno così avevo capito dai cartelli affissi sulle transenne. Nulla di tutto questo si è verificato, ma potrebbe essere solamente una mia ingenua interpretazione.\n\nTornando a noi, in seguito, altri (almeno) 3 mesi di deviazione a causa di lavori in via Vanchiglia, i quali costringono la tratta a virare su corso Regina Margherita, per poi tornare su piazza Castello dai giardini reali.\nDopodiché i lavori di via Po', i quali durano, anche in questo caso, almeno 3 mesi. A questo giro, il 15 sarà costretto a percorrere corso Vittorio, abbandonando al proprio destino tutta la zona del centro.\n\nPoi, per motivi oscuri che al momento non occorrono alla mia giovane mente, la deviazione che non farà più passare il 15 da corso Re Umberto, ma da corso Vinzaglio e poi corso Duca degli Abruzzi.\nPotrei portare altri esempi, ma torniamo al presente. Oggi, dopo aver visto tornare il tram sul suo percorso originale per quasi 2 mesi, scendo dal 10 al Politecnico e mi accingo alla fermata del 15. Fedele e tranquillo come pochi al mondo, mi siedo ed attendo. Attendo e attendo, ignaro che, ancora una volta, il 15 è stato deviato dal 30 giugno fino a nuovo ordine.\n\nPer quanto tutte queste vicende nel 90% dei casi mi abbiano solo portato agevolazioni negli spostamenti, diminuzioni del tempo totale di percorrenza della tratta, e per quanto sia felice che le infrastrutture vengano rinnovate, non posso che pensare una cosa. Come si fa a fornire un servizio del genere, quando in tutto questo lasso di tempo non c'è stata una sola volta (a parte nel primo esempio) che sia stato inserito un pullman sostitutivo lungo i percorsi scoperti?\n\nPago 350 euro all'anno per avere un servizio funzionante, e tutto ciò che ottengo è un incremento del 500% di controllori arroganti, deviazioni indesiderate e scioperi interminabili.\n\nSemplicemente GTT, da quando ho memoria.",
        "upvotes": 33,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1lpb88l/ennesimo_post_sula_gtt/"
    },
    {
        "id": "1lpqicv",
        "author": "Worried_Technician38",
        "title": "Info su Cenisia / Info about Cenisia",
        "content": "Ciao a Tutti, (english below)\n\nMi sto trasferendo in un appartamento a Cenisia settimana prossima e vorrei sapere di più sulla zona.  Sono un Americano - ma già diventato un cittadino un paio di mese fa - sarà mia prima volta vivere a Torino e non conosco nessuno (ancora) quindi alcune informazione o consigli sarebbe molto apprezzato.  Chiunque vivi nella zona, o parli inglese - o aspiri da fare - fammi sapere se volete prendere un aperitivo o qualcosa.     \n\nI'm moving to Cenisia next week and would love to know more about the area.  I'm an American, but also just became a citizen a couple months ago, this is my first time living in Torino and don't really know anyone (yet), so any info or recommendations would be greatly appreciated.  Whoever lives in the area, or any english speakers - or aspiring English speakers - let me know if you'd like to grab an aperitivo.\n\n",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1lpqicv/info_su_cenisia_info_about_cenisia/"
    },
    {
        "id": "1lpqek5",
        "author": "One_Owl_8715",
        "title": "Facoltà di medicina Veterinaria e Agraria",
        "content": "Non frequento questa facoltà, ma abito nelle sue vicinanze, mi chiedevo se fosse un posto carino dove andare a studiare anche senza essere uno studente di una delle facoltà che hanno la sede lì.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lpqek5/facoltà_di_medicina_veterinaria_e_agraria/"
    },
    {
        "id": "1lptc2q",
        "author": "Classic-Moment71",
        "title": "Any Indian students studying in university of turin?",
        "content": "Hey, im from new delhi, looking for seniors in the Unito for guidance. I would love to connect, please DM or comment. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lptc2q/any_indian_students_studying_in_university_of/"
    },
    {
        "id": "1lp467a",
        "author": "nXgNarsil",
        "title": "Cose da fare nei dintorni di Torino con questo caldo",
        "content": "Farò un weekend lungo in Piemonte, con base vicino Asti. Ho già visitato il centro di Torino in passato e con queste temperature eviterei di ripetere l'esperienza. \n\n\nSono in auto quindi liberissimo di muovermi. \n\n\nOltre a farmi rubare la Nintendo Switch ad Asti (cit.), cosa mi suggerite di fare? Anche zone limitrofe a 1h o più di auto, se ne vale la pena. \n\n\nAl momento ho trovato un tour ad Alba sotterranea ma le recensioni sembrano contrastanti, a quanto pare si visitano soltanto le fondamenta di alcune strutture. \n\nNon sono un grandissimo bevitore e vorrei evitare tour di cantine. ",
        "upvotes": 14,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1lp467a/cose_da_fare_nei_dintorni_di_torino_con_questo/"
    },
    {
        "id": "1lp2a36",
        "author": "lemon-strain",
        "title": "nuovo blackout oggi di un ora zona sud torino",
        "content": "mi son rotto il topocazzo. io lavoro, e non riesco. anche se avessi un ups così tanto tempo non posso stare senza corrente. che porco santo succede in sta città del cazzo?\n\nson super incazzato. ",
        "upvotes": 16,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lp2a36/nuovo_blackout_oggi_di_un_ora_zona_sud_torino/"
    },
    {
        "id": "1lp9gkq",
        "author": "moboforro",
        "title": "raccomandazione per uno sgombero di appartamento che non costi eccessivamente?",
        "content": "Buonasera cari miei. Sto vendendo casa e mi chiedono di sgomberare via tutto in tempi non troppo lunghi. Secondo voi contando che la casa è mezza vuota e che però c'è di mezzo il mese di Agosto,  ce la faccio a sgomberare entro il 15 Settembre? Consigli su ditte oneste che non chiedano un rene? Grazie",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lp9gkq/raccomandazione_per_uno_sgombero_di_appartamento/"
    },
    {
        "id": "1lpaq31",
        "author": "AcousticBassGuitar",
        "title": "Blackout zona Piazza Rivoli",
        "content": "Blackout di una decina di minuti in zona cenisia/cit-turin (sto all’angolo di corso vittorio con piazza rivoli).\nPenso prima volta che me ne rendo conto in questa zona di giorno, forse ce ne sono stati altri di notte ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lpaq31/blackout_zona_piazza_rivoli/"
    },
    {
        "id": "1loyk1s",
        "author": "TheFakeAccaunt",
        "title": "Tecnico Informatico Torino",
        "content": "Buongiorno a tutti,\n\nsiamo una piccola azienda di Torino (circa 7-8 persone in ufficio) e ci stiamo trasferendo nella nuova sede a Beinasco (TO). Abbiamo bisogno di installare un server, un impianto di videosorveglianza e un sistema antifurto nei nuovi uffici.\n\nCerchiamo una persona competente che possa aiutarci con l’installazione e la configurazione dell’intero sistema. Abbiamo già richiesto diversi preventivi a ditte specializzate, ma ci sono sembrati davvero esagerati (solo per l’antifurto ci hanno chiesto 7.500 €, senza considerare le telecamere e il server). Secondo queste proposte, il costo totale arriverebbe intorno ai 20.000 €, cifra per noi insostenibile.\n\nPer questo motivo, stiamo cercando un professionista onesto e con buon senso che possa proporci una soluzione più economica ma comunque affidabile, ed eventualmente occuparsi anche dell’installazione.\n\nGrazie a chi vorrà rispondere!  \nScrivetemi in privato per maggiori dettagli.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1loyk1s/tecnico_informatico_torino/"
    },
    {
        "id": "1lp3gkd",
        "author": "MonPorridge",
        "title": "Aperitivo tranquillo zona Piazza Statuto?",
        "content": "Come da titolo, avete posti da consigliare dove fare aperitivo semplice ma carino in zona Piazza Statuto?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lp3gkd/aperitivo_tranquillo_zona_piazza_statuto/"
    },
    {
        "id": "1lo5730",
        "author": "Mental_Plane6451",
        "title": "Parcheggiatori a porta nuova",
        "content": "Mentre aspettavo il treno non ho potuto fare a meno di notare sul lato di via nizza questi due curiosi individui, che senza vergogna e con ampi gesti delle mani dirigono il traffico. In dieci minuti almeno tre macchine di fila si sono sottomesse ai due vigili improvvisati.\n\nHo provato a chiamare i carabinieri per avvisare, e mi hanno risposto prenderanno nota, e si come no. .\n\nCom'è possibile che nel 2025 la gente ancora sta a dare da mangiare a sti ... (*removed by Reddit). Stiamo diventando come napoli?",
        "upvotes": 104,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4quushu9w1af1.png?auto=webp&amp;s=e2f3b729bbf5a03900ccf0305a0ad0605933e3a3"
        },
        "permalink": "/r/torino/comments/1lo5730/parcheggiatori_a_porta_nuova/"
    },
    {
        "id": "1lozkum",
        "author": "-The_Dud3-",
        "title": "suggerimenti produttori di formaggio locali biologici/biodinamici",
        "content": "sono alla ricerca di aziende che vendano a torino e dintorni (collegno idealmente) prodotti caseari biologici e biodinamici con latte provenienti da piccole aziende locali, no grossi allevamenti. \n\nVanno bene sia negozi fissi che stand nei mercati ovviamente.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lozkum/suggerimenti_produttori_di_formaggio_locali/"
    },
    {
        "id": "1low7as",
        "author": "CartographerNo9685",
        "title": "Do shops in Torino have tax free shopping?",
        "content": "Hi! I am staying an hour away from Torino in a small town, and I wanted to do some tax free shopping with the VAT refund at the airport (I'm American), but I wanted to know if stores participate in it since it is a big city, but maybe with less tourists? Just wanted to ask before I make the trek.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1low7as/do_shops_in_torino_have_tax_free_shopping/"
    },
    {
        "id": "1lo4pn4",
        "author": "andrea_25",
        "title": "Torino is Traumatic",
        "content": "Capisco che la città sia rimasta traumatizzata dalla tragedia di Piazza San Carlo, e che da allora giustamente ci sia molta più attenzione sulla sicurezza degli eventi in piazza, bene così.\n\nIn occasione dell'evento Torino is Fantastic però mi ha lasciato molto perplesso lo spazio enorme dedicato alle vie di fuga. Il dubbio non riguarda la loro presenza, ma il fatto che Piazza Vittorio è una piazza porticata e gli ingressi per ognuna delle vie laterali son due ma molto stretti, con un doppio passaggio tra due colonne (si vede ad esempio nella foto che ho postato in alto a sinistra). Infatti è stato lampante che a fine concerto, con la folla tranquilla che voleva andare via dalla piazza, si siano subito creati degli \"imbottigliamenti\" e la gente accalcata davanti a queste uscite defluiva con molta difficoltà (per non parlare della calca sotto i portici stessi). In caso di emergenza, queste vie molto larghe sarebbero utili comunque per disperdere la gente?",
        "upvotes": 36,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wsvh4mp1r1af1.jpeg?auto=webp&amp;s=3a90579923b465411449107798802198fd56622e"
        },
        "permalink": "/r/torino/comments/1lo4pn4/torino_is_traumatic/"
    },
    {
        "id": "1loinab",
        "author": "piantal4",
        "title": "concerti da soli",
        "content": "ciao :) cerco qualcuno che vada domani al concerto di Brunori Sas, visto che ci vado da sola, così da passare il tempo insieme :/ ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1loinab/concerti_da_soli/"
    },
    {
        "id": "1lolaik",
        "author": "ImprovementGold6580",
        "title": "Via Salle",
        "content": "Ciao a tutti, sono uno studente che dovrebbe iscriversi in magistrale a Torino, sto cercando casa e sto parlando con una ragazza per un trilocale in via Salle. Volevo chiedervi come fosse come zona, ho già visto un paio di commenti, ma volevo comunque avere un parere in prima persona. Grazie :)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lolaik/via_salle/"
    }
]