[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 200,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 49,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h3owte",
        "author": "indiewire",
        "title": "Cannes: 17 Unsimulated Sex Scenes in the Festival's History",
        "content": "",
        "upvotes": 1172,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/klhSSzn9TFAttOFbgAdQifduNyaRMdsHu6zBIsqyXy4.jpg?auto=webp&amp;s=a68a320fc8faeb2986a0f53760b14a04c8901ebf"
        },
        "permalink": "/r/movies/comments/1h3owte/cannes_17_unsimulated_sex_scenes_in_the_festivals/"
    },
    {
        "id": "1h3fv4e",
        "author": "LosIsosceles",
        "title": "\"Hundreds of Beavers\" review: This bizarre movie about beavers is a clarion call for human creativity in the age of AI",
        "content": "Reposting with movie title in the header. ",
        "upvotes": 2784,
        "comments": 199,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZSMVMENVMcY80gwE889Ogj75YPogDrbzeCVt8I5WJNA.jpg?auto=webp&amp;s=06ed4251d6c7d6ed2938f3b80e59b9ad9aa66146"
        },
        "permalink": "/r/movies/comments/1h3fv4e/hundreds_of_beavers_review_this_bizarre_movie/"
    },
    {
        "id": "1h3j1gv",
        "author": "HeyAriAxyss",
        "title": "What did you think of Big Trouble in Little China (1986)?",
        "content": "I just finished watching Big Trouble in Little China for the first time! I hit 'Play' and went into it pretty much completely blind with no context - and what a ride LOL!\n\nWas a fun watch - had some good laughs and funny WTF moments. It had a fun amount of absurd and cheesy moments as well 😆 I really respect the amount of creativity that went into the writing and set design, and fun characters too!\n\nWhat were your thoughts on the movie when first seeing it? 🙂 Keen to hear, and thanks for reading!\n\nUpdate: WOAH, over 100+ comments in just over an hour! Love it and thanks again for sharing the enthusiasm guys lol! 😆😄👌\n\n  \nUpdate: Wow, almost 250 comments! Let's go!! 😆 haha",
        "upvotes": 336,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1h3j1gv/what_did_you_think_of_big_trouble_in_little_china/"
    },
    {
        "id": "1h3phtg",
        "author": "dvsinla",
        "title": "Saw Moonraker last night first time and in a theater. What a ridiculous fun movie. Anyone else a fan?",
        "content": "Saw it last night at  midnight screening in a really great palace theater in LA called the Vista owned by Tarantino so it was an original 35mm print. He only screens movies on film. A bit faded and a few cuts but I love that stuff. \n\nA few things I know of the Roger Moore bond movies is that they were a little sillier and they had the best songs... and I tend to like them a lot.  \n\n* Moonraker was the only one I never saw and wow it's so crazy like one silly crazy set piece after another with nothing much in between. \n* The jaws guy was hilarious. \n* Bond hits on women so fast in this one it's a little odd even for him.\n* Holly Goodhead... great name.\n* The space station stuff so great with the laser blasts totally going for a star wars thing. \n* The villain keeps trying to kill bond in the most ridiculous elaborate ways instead of just shooting him in the head. \n* Feels like Austin Powers got a ton of their gags from this movie.\n\nLoved it.  Though I suspect people who like a more serious bond are not fans? ",
        "upvotes": 122,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1h3phtg/saw_moonraker_last_night_first_time_and_in_a/"
    },
    {
        "id": "1h3m2s4",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy 'Heavier Trip' - Metal band Impaled Rektum breaks out of prison to perform at a major festival and save their guitarist's home, facing obstacles from police and a record exec.",
        "content": "",
        "upvotes": 187,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ld4xtmdq34e1.jpeg?auto=webp&amp;s=62297253a741ce1351e0d77c6dbdabc0c1b33e1f"
        },
        "permalink": "/r/movies/comments/1h3m2s4/first_poster_for_comedy_heavier_trip_metal_band/"
    },
    {
        "id": "1h3f28t",
        "author": "Odd_Advance_6438",
        "title": "I loved the little things in the Substance that makes Dennis Quaid’s character extra gross.",
        "content": "Specifically the way he ate the shrimp and the fact that he never washes his hands.\n\nPretty great performance relative to how little screentime he has. He plays an incredibly sleazy, misogynistic, douchey tv show executive. However, I like the less crazy things about him that add to what a creep he is. The way he eats the shrimp was pretty gross, which is impressive in a movie that’s full of so many disgusting moments. I didn’t even notice the bathroom thing until someone pointed it out, but it really emphasizes how dirty he is both figuratively and literally",
        "upvotes": 438,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1h3f28t/i_loved_the_little_things_in_the_substance_that/"
    },
    {
        "id": "1h3dn4i",
        "author": "Rebel_bass",
        "title": "I had no idea that Kevin Smith and Scott Mosier produced Good Will Hunting ",
        "content": "Digging deep this weekend for good movies that I haven't seen for a while, saw their names pop up in the opening credits. No wonder Affleck and Damon are still showing up for Smith all these decades later. \n\nAny other Hollywood connections like this you guys can think of, where relations spanning so many years have shaped the face of cinema?",
        "upvotes": 482,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1h3dn4i/i_had_no_idea_that_kevin_smith_and_scott_mosier/"
    },
    {
        "id": "1h3nwpo",
        "author": "KillerCroc1234567",
        "title": "Jeff Nichols Reveals He Is Writing New Original Script Alongside Cormac McCarthy Adaptations",
        "content": "",
        "upvotes": 111,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rklGyTd6sjkMN1--kXzDd0rz3Cy_Z3zhi_E8UeBOTJE.jpg?auto=webp&amp;s=13c0282ba9739ec6ba459444ed9f3c87f7ef0ecb"
        },
        "permalink": "/r/movies/comments/1h3nwpo/jeff_nichols_reveals_he_is_writing_new_original/"
    },
    {
        "id": "1h3bchy",
        "author": "aucunautrefeu",
        "title": "Which movie influenced you to make a decision in your life after watching it",
        "content": "Is there a movie you’ve seen that moved you so profoundly that it actually impacted your personal life and influenced you to make a change or decision? If so, what aspect about the film influenced it?\n\nFor me it was the being buried alive monologue in I Saw the TV Glow. I went back to the theaters three days in a row and sobbed in the theater each time. I have never felt more seen or exposed by a film in my life. After that; I started unmasking more around people in my life.\n\n",
        "upvotes": 545,
        "comments": 782,
        "media": null,
        "permalink": "/r/movies/comments/1h3bchy/which_movie_influenced_you_to_make_a_decision_in/"
    },
    {
        "id": "1h3l4ct",
        "author": "kanna172014",
        "title": "Movies during the 70s-80s weren't very optimistic for the future",
        "content": "You have all kinds of movies like Logan's Run, Soylent Green, Blade Runner, Escape from New York, The Running Man and Robocop, all set in dystopian hell-holes. New York City especially got it bad. It was so bad that movies back then thought it would eventually become little more than a prison city as shown in Escape From New York. I wonder what the writers and producers/directors would think if they got a glimpse of what cities like New York are like now?",
        "upvotes": 117,
        "comments": 135,
        "media": null,
        "permalink": "/r/movies/comments/1h3l4ct/movies_during_the_70s80s_werent_very_optimistic/"
    },
    {
        "id": "1h330ci",
        "author": "Bennett1984",
        "title": "Robert Downey Jr., Mickey Rourke, Demi Moore and the Great Hollywood Comeback Performances",
        "content": "",
        "upvotes": 2430,
        "comments": 193,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOIjNJkceH1NAhXSkox7ROcsoFkUubMOXaglACGcva8.jpg?auto=webp&amp;s=4f955233d1c910bffa01f48ead81e8f8843f6281"
        },
        "permalink": "/r/movies/comments/1h330ci/robert_downey_jr_mickey_rourke_demi_moore_and_the/"
    },
    {
        "id": "1h3mly2",
        "author": "dave_tk421",
        "title": "Remember when Michael Paré was the “it” actor?",
        "content": "\nEddie and The Cruisers - A television newswoman picks up the story of a 1960s rock band whose long-lost leader Eddie Wilson may still be alive, while searching for the missing tapes of the band's never-released album.\n\nStreets of Fire - A mercenary is hired to rescue his ex-girlfriend, a singer who has been kidnapped by a motorcycle gang.\n\nThe Philadelphia Experiment - A United States Navy destroyer escort participates in a Navy \"invisibility\" experiment that inadvertently sends two sailors forty years into the future.\n\nHe had a pretty good run for a flash of an eye",
        "upvotes": 81,
        "comments": 131,
        "media": null,
        "permalink": "/r/movies/comments/1h3mly2/remember_when_michael_paré_was_the_it_actor/"
    },
    {
        "id": "1h3awx1",
        "author": "Strawb3rryflowers",
        "title": " Which role(s) do you think Leonardo Dicaprio should have gotten an Oscar for instead of The Revenant? ",
        "content": "I've never seen The Revenant (edit not saying he didn't deserve that win since i've obviously haven't seen it, i'm simply asking those of you who did see it) anyway, in my opinion Leo should have definitely gotten an Oscar for his roles in What's Eating Gilbert Grape and Django Unchained. I've recently watched Django Unchained again and he was really briliant in it.\n\nHe was obviously also great in The Departed, Catch Me If You Can, Revolutionary Road, etc but those are his stand-out performances in my personal opinion\n\nedit: not sure why some people want to argue with me and are downvoting this? I can still think he deserved Oscar wins for his other roles, especially because him not winning an Oscar for so long became a meme for the longest, his smirk when he finally won for The Revenant at the Oscars said everything. ",
        "upvotes": 442,
        "comments": 522,
        "media": null,
        "permalink": "/r/movies/comments/1h3awx1/which_roles_do_you_think_leonardo_dicaprio_should/"
    },
    {
        "id": "1h3jgz1",
        "author": "McNasty420",
        "title": "They just made Ghost World free on youtube",
        "content": "This movie is fantastic.  It stars Thora Birch, Scarlett Johansson and Steve Buscemi.  They play two girls who just graduated from high school and have no plans for the future.  They befrend Steve Buscemi's character.  I recommend giving it a watch, it's so great!\n\n[https://www.youtube.com/watch?v=pmW61ytcI18](https://www.youtube.com/watch?v=pmW61ytcI18)",
        "upvotes": 96,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/42F7Qe_zAH40Qd8bV3ErdXMbzIs6eg0dBoUiDC0TSVA.jpg?auto=webp&amp;s=e45898297eeb73d0eb9046556f16d996a34cd786"
        },
        "permalink": "/r/movies/comments/1h3jgz1/they_just_made_ghost_world_free_on_youtube/"
    },
    {
        "id": "1h32fqx",
        "author": "fungobat",
        "title": "The Professional - 30 Year Anniversary 4K Restoration - Official Trailer",
        "content": "",
        "upvotes": 1657,
        "comments": 408,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vZkkjiDs9z03gYQ2AtphhwTAXSvkxJjub_lZS1desB8.jpg?auto=webp&amp;s=2a81674d42a9e932a498c76bd435cce7127ad597"
        },
        "permalink": "/r/movies/comments/1h32fqx/the_professional_30_year_anniversary_4k/"
    },
    {
        "id": "1h2n6jj",
        "author": "herewego199209",
        "title": "The death of R rated comedies or even comedies in general that get wide releases never made sense to me. In the 2000s those comedies were made relatively cheaply, IE Superbad was made for 20 million and made well over $170 million. You'd think studios would love this.",
        "content": "I don't get why we don't have more rated R comedies or even romantic or sex comedies anymore. The one romantic comedy that they marketed really well recently and made a shit ton of money was Anyone but you and that movie was made for $25 and made $225 million. I don't get the excuse that comedies don't  make a lot of money overseas or that blu-rays don't sell anymore. ",
        "upvotes": 14031,
        "comments": 2150,
        "media": null,
        "permalink": "/r/movies/comments/1h2n6jj/the_death_of_r_rated_comedies_or_even_comedies_in/"
    },
    {
        "id": "1h3i52x",
        "author": "BunyipPouch",
        "title": "1974's Classic Slasher 'Black Christmas' Getting 50th Anniversary 4K Theatrical Re-release Starting December 7th",
        "content": "",
        "upvotes": 62,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/scqYhDm44Ugrb_w2KCQOynkcyrFIjVu24ZJzODfNWHQ.jpg?auto=webp&amp;s=a46c3e36f6db01b4a527d7e469a371f9d57087ef"
        },
        "permalink": "/r/movies/comments/1h3i52x/1974s_classic_slasher_black_christmas_getting/"
    },
    {
        "id": "1h3hzqi",
        "author": "nofuture09",
        "title": "The Girl Next Door (2004) deserves more love!",
        "content": "Just finished rewatching The Girl Next Door and had to share why it’s so great:\n\nElisha Cuthbert absolutely shines in this role. Her charcater Danielle isnt just eye candy...she’s confident but also vulnerable. Elisha makes you care about her journey and choices. She is the heart of the movie. \n\nTimothy Olyphant (Kelly).....Easily one of the coolest villains in any teen movie. He is both funny and intimidating. Every scene with him is a highlight.\n\nAlso have to call out Elis best friend \"Matthew\"... he is hilarious and chaotic. He brings so much energy to every scene, whether its his wild schemes or over-the-top reactions. Definitely one of the funniest parts of the movie.... especially when he gets interviewed in front of the college after his success \"SHUT THE FUCK UP ... Next\" at the end\n\nthe movie balances humor with some surprisingly emotional moments so well and it captures the early 2000s vibes in the best way possible. The soundtrack, the style, the overall feel. it really is a time capsule in the best way.\n\n\nRemember... the juice is worth the squeeze.",
        "upvotes": 59,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1h3hzqi/the_girl_next_door_2004_deserves_more_love/"
    },
    {
        "id": "1h3cike",
        "author": "Business_Ad_6816",
        "title": "Paul Bettany. Seriously",
        "content": "I just finished watching Journey's End, a lesser known WW1 drama. Truly a masterpiece, and Paul Bettany is just so good in it. I was left in awe by Sam Claflin and Paul Bettanys acting, but especially Bettany. \n\nI always knew Bettany was good, but damn. He blew me away in Journey's End. If you haven't seen it, I highly recommend it. ",
        "upvotes": 127,
        "comments": 103,
        "media": null,
        "permalink": "/r/movies/comments/1h3cike/paul_bettany_seriously/"
    },
    {
        "id": "1h3hwey",
        "author": "indiewire",
        "title": "‘Blitz’ Star Saoirse Ronan Shares What Makes Steve McQueen and Adam Stockhausen the Perfect Collaborators",
        "content": "",
        "upvotes": 56,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VAT9Dt54vNH8BQCEUjOVLVi-mWpF8pomvoonRvRNw-Y.jpg?auto=webp&amp;s=785f6b8c156587820029a7a349f1493ce1adbdee"
        },
        "permalink": "/r/movies/comments/1h3hwey/blitz_star_saoirse_ronan_shares_what_makes_steve/"
    },
    {
        "id": "1h3nl0p",
        "author": "nbaisbest4",
        "title": "Found out Steve Buscemi tried to make Queer in the early 2000s, it's in the last question of the article. ",
        "content": "",
        "upvotes": 17,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T7qvzeDuCgok1oHbqfhoWrui2xBjiX-BtsUBwnF02c4.jpg?auto=webp&amp;s=e55124fa6c6eaea423959850eed3b4782edb70df"
        },
        "permalink": "/r/movies/comments/1h3nl0p/found_out_steve_buscemi_tried_to_make_queer_in/"
    },
    {
        "id": "1h2u90n",
        "author": "Scherzoh",
        "title": "Why are some directors put into \"movie jail\" when a movie bombs, but others are allowed to have multiple failures over the course of their careers?",
        "content": "Jonathan Frakes was placed into 'movie jail' following the failure of Clockstoppers. Meanwhile a filmmaker like Ridley Scott has a few movies that have failed to make money at the box office but is still allowed projects with massive budgets.\n\nThis is not a dig at Ridley specifically, I am simply curious.\n\nEdit: Yes, I know these are two wildly different directors, both in fame and talent.  Frakes was my example because he's the first person I heard use the term 'movie jail.' It could be any director who has had a failure, but also some success.",
        "upvotes": 1864,
        "comments": 527,
        "media": null,
        "permalink": "/r/movies/comments/1h2u90n/why_are_some_directors_put_into_movie_jail_when_a/"
    },
    {
        "id": "1h3je45",
        "author": "80severything",
        "title": "The Pest 1997",
        "content": "This film will either be one of the most annoying movies you have watched or you may find it funny.  Someone thought John Leguizamo may be the next Jim Carrey and this was written as a vehicle for him, John wrote the story while someone else wrote the full screenplay.  It's a hyperactive live action cartoon,  I'll admit to watching it a lot as a teenager.\n\nThe movie sees the main star playing a character named Pestario \"Pest\" Vargas who owes a large amount of money to the Scottish mafia.  A rich hunter who enjoys hunting humans offers Pest $50,000 dollars to let him hunt him for a couple of days and if he survives he gets the money.\n\nIt's a ridiculous way over the top film. I haven't watched the full film it in quite a long time but I still get a laugh when I watch the scene on youtube where he is in a full Japanese disguise and has to sing the theme song to bonanza during karaoke while trying to hide from the people hunting him while he does a bad impersonation of a singing Japanese man.",
        "upvotes": 25,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1h3je45/the_pest_1997/"
    },
    {
        "id": "1h2lv4j",
        "author": "onlyididntsayfudge",
        "title": "After rewatching Inception my opinion on the ending has now changed forever",
        "content": "I always believed that Leo was actually awake at the end. Nolan just showed us the spinning top as it was about to topple over before cutting to black and ending the movie. \n\nAfter rewatching the movie for who knows how many times I fully believe now that Leo is still dreaming. \n\n1. Nolan never showed us the top falling over which I understand was to keep the audiences guessing but…\n\n2. Every time Leo sees his kids in his mind in his dreams throughout the movie, they are wearing the exact same clothes. Which means he is remembering a memory of them. At the end of the movie when he comes back to his kids, they are wearing the same. fucking. clothes. And they haven’t aged at all. \n\nAnyway that’s where I’m leaning now - he’s still dreaming. \n\nEdit: I’m loving the discussions! After reading all your comments I appear to be wrong - Leo’s kids in the end were not wearing the exact same clothes. Check out the [Differences in clothing](https://images.app.goo.gl/EJ4dezvGqa6Uxgf8A) that I found by googling it. I seemed to have gotten ahead of myself on this one. \n\nI’ve also heard about the wedding ring being a totem, which I can totally agree with. \n\nI will say this - after reading the discussions, I started thinking about the wife died in the movie. She died by falling off a ledge. Gravity took her down. Gravity was also a big component/the kick to wake the team up at the end. So now I’m even more curious! Is Leo dreaming because he still has not experienced his gravity drop in “the real world.” Hmmm 🤔 ",
        "upvotes": 5475,
        "comments": 743,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mQ-PoKhA8Aer8be5I7KbShk4ZC3ftZtJCfP925zrNB0.jpg?auto=webp&amp;s=0054626cbbc684d5e96696a9ab15ce38dc239f6b"
        },
        "permalink": "/r/movies/comments/1h2lv4j/after_rewatching_inception_my_opinion_on_the/"
    },
    {
        "id": "1h32ppc",
        "author": "MakeItSo978",
        "title": "What’s one film you still can’t decide if it’s good or not? ",
        "content": "For me it’s Watchmen, I’ve watched this movie like 10 times. Every time I watch it my opinion changes on it. I just watched it tonight, and I think it’s not very good. There is a lot of things I like about it you could even say love. But I just notice something new that bothers me. Just curious about your opinion? ",
        "upvotes": 437,
        "comments": 982,
        "media": null,
        "permalink": "/r/movies/comments/1h32ppc/whats_one_film_you_still_cant_decide_if_its_good/"
    },
    {
        "id": "1h3ltsb",
        "author": "herequeerandgreat",
        "title": "cujo from cujo is a tragic villain.",
        "content": "in my opinion, one of the most tragic fictional villains of all time is cujo from the novel and movie cujo.\n\nfor starters, both works make it abundantly clear throughout that cujo is a very loving and good dog, like most saint bernards. but then, he gets bitten by a rabid bat and gets rabbies himself. and this prompts him to go crazy and start attacking people. if you think about it, the rampage and deaths aren't really cujo's fault and are a by product of a horrible degenerative disorder.\n\nthings get even sadder if you read the book. there are portions of the novel that take place from cujo's perspective. after he gets bitten, he's worried that his owners will be mad at him for getting bitten. but, as the story goes on and his psyche begins to crack, he starts to irrationally believe that his owners made him sick. not to mention that these portions make it extremely clear that cujo is in pain. not to mention, there's the final paragraph which is one of the saddest things i've ever read in any book. \"it would perhaps not be amiss to point out that he had always been a good dog. he had tried to do all the things his man and his woman and most of all his boy has asked or expected of him. he would have died for them if that had been required. he had never wanted to kill anybody. he had been struck by something. possibly destiny or fate or only a degenerative nerve disease called rabies. free will was not a factor.\"\n\nthere's also a part of the movie that adds to the tragedy. it happens after cujo has become rabid. he encounters the son of his owner brett. knowing that he's about to succumb to rabids, cujo uses the last bit of sanity that he has left to get away from brett before he can hurt him. my heart!\n\neven though cujo dies at the end of the story, there's a strong possibility that his suffering still hasn't ended. in king's 1991 novel needful things, the character of polly enters an abandoned house but is chased out by a malevolent ghost dog. a popular fan theory is that the house is the camber residence and the ghost dog is cujo's restless spirit. god damn it stephen king! stop being mean to cujo!",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1h3ltsb/cujo_from_cujo_is_a_tragic_villain/"
    },
    {
        "id": "1h34ecp",
        "author": "keepfighting90",
        "title": "Rebel Ridge is a damn good thriller - reminiscent of a modern-day 'Rambo'",
        "content": "Just caught Jeremy Saulnier's newest flick, Rebel Ridge, on Netflix. I'm a big fan of his, and consider Blue Ruin and Green Room to be 2 of the best thrillers in the last 10-15 years. Hold the Dark was just ok but I was still excited to check this one, since I love the first Rambo and this seemed to be in the mold of that classic \"stoic badass strolls into small town and gets into it with corrupt lawmen\" narrative. \n\nThis is a much more restrained, and lower-key movie than the trailers make it seem. It's really more of a slow burn thriller as opposed to an action movie, and it does an amazing job of slowly building the suspense and elevating the stakes so that whenever the rare action scenes do pop up, they feel like they have impact and meaning. \n\nThe film is carried hard by Aaron Pierre, and his performance is honestly enough to justify watching it. I've never seen him in anything before but after this, I'm definitely going to be keeping an eye on any future projects (I know he's going to John Stewart in the Lanterns show, which I'm pretty hyped about). He has movie star levels of presence and charisma and most importantly, he is built like a fucking *tank* and completely sells the badass ex-Marine character who can kick anyone's ass around him. \n\nWhat I loved about how the movie approached the narrative is that Terry is constantly trying to defuse the situation. This isn't some Dwayne Johnson action blockbuster or John Wick power fantasy where the hero just demolishes everyone without any effort. Terry consciously goes out of his way to avoid violence - loved the little touches where he unloads guns in tense situations. It's just too bad that these fools keep asking for it, so when he has  no choice but to put a beatdown of these corrupt asshole cops, it's immensely satisfying. The action scenes are really well done, keeping the fight choreography grounded and realistic, showing how Terry uses his technique and size to quickly put guys down.\n\nThe story felt pretty timely too, dealing with asset forfeiture laws, and Don Johnson and Emory Cohen are both great as the primary antagonists. Nice supporting turns from AnnaSophia Robb and David Denman as well.\n\nThis is the kind of thriller I feel like we don't get much of anymore, one that feels refreshingly adult, grounded and keeping the stakes personal and intimate. Highly recommend.",
        "upvotes": 305,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1h34ecp/rebel_ridge_is_a_damn_good_thriller_reminiscent/"
    },
    {
        "id": "1h3r7mt",
        "author": "Local-Debate-5565",
        "title": "The Polar Express ",
        "content": "Am I the only one who wants to know more? The back stories, the future, each character breakdown. It's so fascinating to me. I refuse to believe all the kids stop hearing the bell.\n\nIt's so dark and mysterious for a kids movie, but I love it honestly. Apparently there's a second one in the works, I wonder if it'll be the same characters? \n\nAlso, idk why as a kid I shipped the boy and girl lol. It'd be so cool seeing them all meet up again and have a long friendship through the years. \n\nAnd yes, I cry watching this and don't care haha. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1h3r7mt/the_polar_express/"
    },
    {
        "id": "1h3pajp",
        "author": "ivanisevic1991",
        "title": "Unnoticed great performances in great movies",
        "content": "\nI never heard anything praising enough the work of  Courtney Love in ‘The people vs Larry Flynt’ (Milos Forman, 1996). I think she’s just incredibly good and at times steals the show even from Woody Harrelson? \n\nWhat do you guys think?\n\nAnd other performances that weren’t praised enough in your opinion?",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1h3pajp/unnoticed_great_performances_in_great_movies/"
    },
    {
        "id": "1h3eqe9",
        "author": "herequeerandgreat",
        "title": "movies of 2025 that you may not be aware are being made",
        "content": "night of the zoopocalypse\n\nclive barker and animation aren't two things that you would usually associate with each other. nevertheless, such a combination has come to pass with the end result being night of the zoopocalypse. executive produced by barker and based on a concept by him, the film takes place at a zoo that is hit by a meteor. eventually, a virus emerges from the meteor, turning most of the animal inhabitants into zombie like mutants. it's up to a small group of non infected animals to combat this threat. david harbour and gabbi kosmidis lead a cast that also includes kids in the hall alumni scott thompson and mandalorian alumni paul sun hyung lee. the film is set to release on march 7th.\n\ngrendel\n\njohn gardner's 1971 novel grendel tells the story of the titular monster before his confrontation with beowulf, the novel was acclaimed and is often considered to be one of the best novels of the 70s. and it seems that the jim henson company agrees as they will be producing a feature film adaptation. the film will be live action and will be directed by robert D krzykowski, who is most famous for the man who killed hitler and then bigfoot. academy award winner jeff bridges will voice the titular monster, dave bautista will play beowulf, and bryan cranson will play king hrothgar. given the involvement of the jim henson company, it's also highly likely that most, if not all, of the effects in the movie will be done practical and the monsters will be portrayed by puppets.\n\nhigh and low\n\nwhen it comes to remakes, spike lee doesn't have the best luck, if his remake of oldboy is anything to go off of. however, maybe he'll have better luck with his upcoming remake of akira kuroasawa's high and low. often considered to be one of kuroasawa's best movies, high and low tells the story of a businessman who is given a few hours to pay the ransom of his chauffeur's son's kidnapper. it seems like lee thinks that the movie is in need of a modern update since he has said that this remake will be his next project. lee will team up with denzel washington for the sixth time. the rest of the cast will include iifenesh hadera, jeffrey wright, ice spice, ASAP rocky, dean winters, michael potts, and john douglas thompson. while no concrete release date has been given, it is expected to arrive in the spring of 2025 and will be released theaterically before going onto apple tv+.\n\nthe long walk\n\nin addition to being one of the most famous authors ever, stephen king is often the most frequently adapted. his work has been adapted into movies, tv, and other forms. however, one novel of his that has yet to be adapted is the long walk. set in a dystopian america, the long walk focuses on an annual walking contest. however, as should be expected from a king penned story, things quickly go badly. the film adaptation will be directed by francis lawrence, who you may know from constantine, i am legend, and the hunger games sequels. cooper hoffman will lead a cast that includes the likes of charlie plummer, mark hamill, and judy greer. filming began in july of 2024 and ended in september. no offical release date has been given yet but, if post production goes smoothly, we could probably expect it at some point next year.\n\nthe lost bus\n\n\"A bus driver has to navigate a bus carrying children and their teacher to safety through the 2018 camp fire, which became the deadliest fire in California history.\" this is the wikipedia plot synopsis for paul greengrass's upcoming movie the lost bus. while a movie about a bus may not seem very interesting, a good storyteller can make any story interesting. matthew mcconaughey will star as kevin mccay, the driver of the titular bus. best supporting actress nominee america ferrera will also play a supporting role as mary ludwig, a schoolteacher. the film will be produced by both jason blum of blumhouse and jamie lee curtis. here's hoping that this movie stays in the right lane. \n\neddington\n\nari aster is one of the most unique directors currently working. despite only having 3 feature films to his name at the moment, he is quickly establishing himself as a creative force to be reckoned with. and it seems that, in his newest film eddington, aster plans to take audiences to the wild west. directed, written, and co produced by aster, eddington will tell the story of a small town sheriff with high aspirations. after starring in aster's previous movie beau is afraid, academy award winner joaquin phoenix will reunite with the director. the supporting cast is nothing to sneer at as the film will star the likes of pedro pascal, emma stone, austin butler, luke grimes, deirdre o connell(an actress who is no stranger to bizzare movies), micheal ward, and clifton collins jr. the film is described as a black comedy.\n\nthe battle of baktan cross\n\nwhen it comes to paul thomas anderson, you never know what to expect. one minute, he's directing grand historical epics. the next, he's directing coming of age comedy dramas. and it seems that he's entering the crime genre with his newest film the battle of baktan cross. while there is no plot synopsis at the moment, the film is described as a crime drama thriller. leonardo dicaprio will lead a cast that includes regina hall, sean penn, alana haim, and benicio del toro. the film will also be anderson's first film to be released in IMAX. the battle of baktan cross will release on august 8th.\n\nwildwoods\n\nwildwoods will be laika studio's first film since 2019's missing link as well as the studio's first film of the 2020s. and while missing link was a pretty major departure from the studio's usual fare, wildwoods seems like it will be a return to form. described as a stop motion animated dark horror fantasy adventure film, wildwoods will tell the story two best friends who enter a magical forest after the girl's baby brother is kidnapped by cows. the film will star peyton elizabeth lee and jacob tremblay as the two leads. the supporting cast will consist of carey mulligan, mahershala ali, awkwafina, angela bassett, jake johnson, charlie day, jemaine clement, tom waits, and richard E grant. and that's just the talent in the cast. kubo and the two strings director travis knight will serve as director, reuniting with two strings composer dario marianelli. oscar nominated cinematographer caleb deschanel will make his animation debut as the film's cinematographer.\n\nthe phoenician scheme\n\nleave it to wes anderson to make espionage funny. his upcoming film the phoenician scheme is an espionage comedy drama that was written by anderson and roman coppola. though the plot is unknown at the moment, the film's cast is known and, par for the course for an anderson film, the cast is full of famous actors. benicio del toro, michael cera, bill murray, riz ahmed, tom hanks, benedict cumberbatch, scarlett johansson, rupert friend, willem dafoe, and bryan cranston. production began in march and ended in june.\n\nwake up dead man a knives out mystery\n\nknives out and glass onion were both very well recieved murder mystery stories and fans have been eager to see what benoit blanc would get up to next. well, next year, we may have our answer. the next film in the beniot blanc film series is entitled wake up dead man a knives out mystery. rian johnson will once again serve as writer and director with daniel craig once again playing everyone's favorite southern detective. and like the other films in the series, there is a stacked supporting cast. josh o connor, glenn close, josh brolin, mila kunis, jeremy renner, kerry washington, andrew scott, cailee spaeny, daryl mccormick, and thomas haden church. while the plot is unknown at the moment, if the previous two movies are anything to go by, it will be a compelling mystery that will inherently need to be rewatched.",
        "upvotes": 29,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1h3eqe9/movies_of_2025_that_you_may_not_be_aware_are/"
    }
]