[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pnk58r",
        "author": "koksinel",
        "title": "Turin air quality is like India",
        "content": "How is this possible? In Europe? North of Italy?\n\nWhy is no one doing anything to change this horrible situation?\n\nIt’s literally dangerous to walk outside, eyes are burning, throat is irritated and swollen, this is insufferable.",
        "upvotes": 80,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/260kmc3mvf7g1.jpeg?auto=webp&amp;s=6f99a2eb2b16389ae18a409cd3683219a76cc547"
        },
        "permalink": "/r/torino/comments/1pnk58r/turin_air_quality_is_like_india/"
    },
    {
        "id": "1pnuujp",
        "author": "Plus-Masterpiece936",
        "title": "Multa incrocio corso potenza - via val della torre. Violazione linea continua trasporto pubblico.",
        "content": " Nei primi di novembre, per due giorni quasi consecutivi, ho preso una multa nell'incrocio tra corso Potenza e via val della torre, percorrendo corso Potenza verso sud (Campidoglio). La multa è per violazione linea continua del tpl.\n\n Andando sul sito del comune la foto segnaletica appare completamente nera eccetto la targa che viene mostrata. \n\n La cosa che mi insospettisce tantissimo è che è vero che uso la corsia di sorpasso, ma SOLO se la linea è tratteggiata, sono molto scrupoloso in questo. Ritengo pertanto sospetto che mi si segnali violazione della linea continua laddove la foto segnaletica sia praticamente inutile.\n\n Avete delle esperienze in merito? Come posso fare almeno per avere le immagini della mia violazione e capire per cosa vengo multato?\n\nGrazie a chi mi risponderà.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pnuujp/multa_incrocio_corso_potenza_via_val_della_torre/"
    },
    {
        "id": "1pnojps",
        "author": "Zestyclose-Cost3491",
        "title": "Qual'è il modo migliore per raggiungere l'aereoporto di Caselle da Torino senza auto?",
        "content": "In treno, autobus, o c'è una navetta apposita? è difficile capire la migliore opzione online, grazie",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pnojps/qualè_il_modo_migliore_per_raggiungere/"
    },
    {
        "id": "1pno6os",
        "author": "NoiseNew6219",
        "title": "3D model of a street in Turin (Torino)",
        "content": "Hi everyone,  \nI’m an architecture student and we’re looking for a fairly accurate 3D model of a street in Turin (Torino), ideally including façade articulation (rustication / bossage, not just simple extrusions).\n\nDo you know if such models already exist (open data, university projects, research, CityGML, LiDAR-based models, etc.) or where to find official datasets from the city or region?\n\nWe’re happy to process GIS/CityGML data ourselves if needed.  \nThanks a lot!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pno6os/3d_model_of_a_street_in_turin_torino/"
    },
    {
        "id": "1pndsmp",
        "author": "Ok_Conflict6394",
        "title": "Ristorante per laurea",
        "content": "Salve, a dicembre mi laureo e vorrei qualche consiglio su dei buoni ristoranti per pranzare una cosa molto intima giusto 4 persone, possibilmente vicino a corso unione sovietica ma va bene dovunque. Grazie in anticipo a chiunque risponda!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pndsmp/ristorante_per_laurea/"
    },
    {
        "id": "1pnc2vv",
        "author": "RainDesigner",
        "title": "Torrefazione Vanchiglietta/Vanchiglia/Aurora?",
        "content": "qualsiasi raccomandazione?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pnc2vv/torrefazione_vanchigliettavanchigliaaurora/"
    },
    {
        "id": "1pn1e6t",
        "author": "_GanGer_",
        "title": "Cosa fare a Torino da soli il giorno di Natale?",
        "content": "Quest'anno per la prima volta non potrò scendere nella mia regione di origine per le feste di Natale. I miei amici scendono, oppure passano il giorno di natale con la propria famiglia. Avete consigli da darmi su attività da fare per non passare la giornata in casa in solitudine? Ho 26 anni",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pn1e6t/cosa_fare_a_torino_da_soli_il_giorno_di_natale/"
    },
    {
        "id": "1pnfmxw",
        "author": "DraftApprehensive439",
        "title": "Going to Torino for Erasmus",
        "content": "Hello!\n\nI'm student from Czechia, currently on Italian studies, and from February to July I'll be on Erasmus in Torino. I'll apply my studies to the Humanities on Università di Torino, but I have just foggy information about that. Deadline of sending learning agreement to Torino was on 30th November, I sent it few days before, but still I don't know literally anything about my program. They even didn't send me confirmation of being admitted there... And it's already time for booking some accomodations, especially when it'll be crowded because of Winter Olympics Games, and to buy flight.\n\nWhen the second semester on Humanities starts? From different sources I obtained three dates...\n\nIs it better to pay for dorm or to live in airbnb? I'd like to make new friends and fully experience student life, is dormitory still available or is it now too late? Also I'd like to make friends from Torino before going there so it won't be so unknown for me, it'll also help me to practice Italian (for now kinda low especially in vocabulary).\n\nThanks for replies!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pnfmxw/going_to_torino_for_erasmus/"
    },
    {
        "id": "1pn8fz2",
        "author": "Effect-Imaginary",
        "title": "Avete uno studio fotografico di fiducia? Professionale o amatoriale",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pn8fz2/avete_uno_studio_fotografico_di_fiducia/"
    },
    {
        "id": "1pn5rhb",
        "author": "lbranco93",
        "title": "Programmi a Torino per capodanno",
        "content": "Ciao a tutti, io e mia moglie (32) saremo a Torino per capodanno. Per la prima volta saremo soli dato che i nostri amici saranno tutti via e non abbiamo programmi.\n\nMi chiedevo cosa c'è da fare a Torino a capodanno, io e lei siamo abbastanza aperti e ci piacerebbe conoscere nuove persone.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pn5rhb/programmi_a_torino_per_capodanno/"
    },
    {
        "id": "1pm8w9g",
        "author": "chack1172_temp",
        "title": "Maledetto fuochi d'artificio",
        "content": "Stanotte fuochi d'artificio a non finire, a mezzanotte, all'1 e alle 2. Oggi mi son dovuto svegliare alle 6 per prendere il treno, ho dormito solo 3 ore... Situazione assurda",
        "upvotes": 39,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1pm8w9g/maledetto_fuochi_dartificio/"
    },
    {
        "id": "1pmq6wl",
        "author": "yotama9",
        "title": "Cerco per il libro \"Frankenstein\" in ingelse per mia figlia",
        "content": "Ciao tutti.\n\nMia figlia ha un esame sul questo libro in venerdì. Lei ha letto il libro online (project Guttenberg), má solo oggi mi ha detto che forse c'è bisogno d'avere questo libro fisicamente durante l'esame. Forse qualcuno posso aiutare a noi? O forse conosci un negozio a Torino dove possiamo comprarlo? \n\n(Dispiace se ho l'errore nel mio messaggio, non sono Italiano)",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1pmq6wl/cerco_per_il_libro_frankenstein_in_ingelse_per/"
    },
    {
        "id": "1pmio3m",
        "author": "Agitated-Standard627",
        "title": "UPDATE: The proximity project",
        "content": "Ciao a tutti,\n\nvolevo aggiornarvi sul \"the proximity project\", di cui avevo parlato qui nel sub qualche tempo fa.\n\n&gt;Si tratta di uno strumento che mostra, tramite isocrone (o meglio aree con colori sempre più scuri), le zone più vicine a una stazione ferroviaria, metropolitana, fermata di tram o filobus. Questo perché, secondo la mia esperienza personale (almeno a Roma :-) ), questo tipo di trasporto pubblico è decisamente più affidabile degli autobus, che sono più soggetti al traffico.\n\nOk, forse tram e filobus non sono sempre al 100% affidabili, ma mi piaceva pensarla così.\n\nhttps://i.redd.it/uzp6u32k877g1.gif\n\nA chi può servire? A chi cerca un modo semplice per individuare zone ben collegate dove soggiornare, quindi turisti, studenti o chi cerca casa in affitto o acquisto. Oppure a chi, come me, si diverte con rappresentazioni di dati sulle mappe :-D\n\nLe novità principali sono:\n\n* aggiunta dei filobus, ai treni e tram giá presenti\n* mappe più fluide grazie all’uso di Azure Maps invece di OpenStreetMap\n* ho sistemato alcuni problemi che si presentavano su mobile\n* ora si può filtrare anche per tipo di stazione o fermata, che vengono mostrate con colori diversi\n\nIn via sperimentale ho aggiunto anche il supporto per un paio di aree metropolitane francesi (Parigi e Lione).\n\nQui [https://proximity.duckiesfarm.com/italy](https://proximity.duckiesfarm.com/italy) trovate tutte le aree italiane disponibili (si può anche accedere direttamente con deep link, per esempio [https://proximity.duckiesfarm.com/italy/milan](https://proximity.duckiesfarm.com/italy/milan)), mentre qui [https://proximity.duckiesfarm.com/france](https://proximity.duckiesfarm.com/france) ci sono le due aree francesi.\n\nIl progetto è open source, lo faccio per passione, per creare qualcosa di utile anche ad altri e per avere una scusa per imparare cose nuove. Qualsiasi feedback, purché gentile :-), è ben accetto - [https://github.com/nicolgit/proximity](https://github.com/nicolgit/proximity)\n\nFatemi sapere cosa ne pensate, cosa posso migliorare, cambiare o aggiungere, e condividete o salvate il link se vi sembra davvero utile!",
        "upvotes": 5,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IVnaQXBoIB9cXJlp6v5HLxa9Y-tI_Q5wZ2JVan61wG0.gif?format=png8&amp;s=0f472e0abe76118536fbe95457d7daae28d864b7"
        },
        "permalink": "/r/torino/comments/1pmio3m/update_the_proximity_project/"
    },
    {
        "id": "1pmo675",
        "author": "DenverMa",
        "title": "Wins school",
        "content": "Hi! I’m looking for feedback for WINS school - can anyway please help me? Primary and middle school for my kids ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pmo675/wins_school/"
    },
    {
        "id": "1pmdunq",
        "author": "Conscious-Trouble430",
        "title": "SMAT Water Distribution Point Questions",
        "content": "In our town are a couple of SMAT water distribution point, like kiosks.  The still water is free and the fizzy water costs little with the card according to someone we met at the kiosk.  But, a couple of questions for the group....  Is the still water the same water (hard and full of minerals) that arrives from the tap in the house, or is is different?  If so, what's the point of dragging empty bottles to the kiosk, filling them up, and taking them back home?  Second, I don't see a way to get the SMAT card for the fizzy water unless one already has a separate SMAT account for the apartment.  We pay our water bill via the condominium and don't have a separate account.  Thanks in advance for your helpful feedback on both of these things.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pmdunq/smat_water_distribution_point_questions/"
    },
    {
        "id": "1pmmivk",
        "author": "No_Spinach2802",
        "title": "Lezioni di piscina private",
        "content": "Qualcuno sa suggerirmi una piscina aperta di domenica con cui posso fare lezioni priva per imparare a nuotare ? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pmmivk/lezioni_di_piscina_private/"
    },
    {
        "id": "1pmdpay",
        "author": "Fabulous-Owl3389",
        "title": "Suggerimenti palestra per arrampicata?",
        "content": "Ciao!\nSapreste suggerire una palestra per arrampicata indoor a Torino?\nPossibilmente una dove si possa accedere senza iscrizione/abbonamento/certificato medico,giusto per andare ogni tanto portando qualche amico a provare.\nGrazie mille!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pmdpay/suggerimenti_palestra_per_arrampicata/"
    },
    {
        "id": "1pmcd6j",
        "author": "Thestonksman599xx",
        "title": "Parcheggio in corso settembrini",
        "content": "A breve dovrò iniziare a prendere il 4 per lavorare in centro e mi sembrava sensato lasciare l'auto al fondo di Corso Settembrini, vicino alla fermata del 4. È una zona sicura per parcheggiare? Posso lasciare l'auto anche la notte?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pmcd6j/parcheggio_in_corso_settembrini/"
    },
    {
        "id": "1pmdy68",
        "author": "Engineering_Age7151",
        "title": "New in Turin",
        "content": "Ciao, I just wanted to know what places in turin are must to visit? and how can I learn italian efficiently!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pmdy68/new_in_turin/"
    },
    {
        "id": "1pm51rj",
        "author": "Kernel_907",
        "title": "Santa Rita è davvero cosi tagliata fuori?",
        "content": "Ciao a tutti, \nSembrerà ridicolo ma questa Cosa mi sta divorando l'anima! Devo decidere se puntare su un appartamento in zona pellerina oppure in zona Santa Rita. \nPro pellerina, sicuram è meglio servita , quello l'ho già appurato.. ma l'appartamento sarebbe da rifare perchè cosi è un po' spoglio/desolante.\nSanta Rita è piú lontana.. ma è già a posto dentro, da una sensazione di casa accogliente. \nNota: normalmente risistemare casa mi piace, dipingere pareti, decorare , solo che vengo da un periodo lungo di burn out. \nInsomma, se Santa Rita fosse non proprio cpsi scomoda Forse andrebbe meglio per sentirmi in un posto piú tranquillo.. e dunque, quanto è tagliata fuori secondo voi? \nEventi / iniziative / cose artistiche Sono tutte nelle zone piú in alto mi sembra di capire. \nCon la metro è facile, ma per arrivare alla metro da dove sarebbe la casa (v.buenos Aires) è agevole insomma? \nVoi cosa fareste?",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1pm51rj/santa_rita_è_davvero_cosi_tagliata_fuori/"
    },
    {
        "id": "1pmqclc",
        "author": "Bruno_Barbiere",
        "title": "Unpopular opinion: colpa delle ciclabili",
        "content": "",
        "upvotes": 0,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f2ndp0ges87g1.jpeg?auto=webp&amp;s=9945b52ba44371a037b73b00063b9f0faf585fb0"
        },
        "permalink": "/r/torino/comments/1pmqclc/unpopular_opinion_colpa_delle_ciclabili/"
    },
    {
        "id": "1plzb1t",
        "author": "ClubHouseRC",
        "title": "Lezioni d’Inglese a Torino",
        "content": "Ciao a tutti,\nsto seriamente pensando, avendo un po’ di tempo libero da dedicarci, di fare un corso intensivo d’inglese per migliorare la comprensione.\n\nQualche corso, scuola valida da consigliarmi in città?\n\nGrazie!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1plzb1t/lezioni_dinglese_a_torino/"
    },
    {
        "id": "1plxo9n",
        "author": "Erleyx",
        "title": "Breakfast Spot",
        "content": "Hi guys, just wanted to ask if anyone here knew a nice spot for breakfast, i’m taking my girl out on a morning date and wanted to know beforehand, somewhere near Porta Susa or Porta Nuova would be nice, thanks in advance!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1plxo9n/breakfast_spot/"
    },
    {
        "id": "1pm0czg",
        "author": "Embarrassed_Spell799",
        "title": "Sapete dirmi a quali aziende si affida Amazon per i corrieri in Piemonte?",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pm0czg/sapete_dirmi_a_quali_aziende_si_affida_amazon_per/"
    },
    {
        "id": "1pldu75",
        "author": "Amazing_Constant_405",
        "title": "ma è possibile che ci siano fuochi d’artificio alle 3 del mattino?",
        "content": "questa cosa è inaccettabile. zona porta susa, sono io che me lo sono sognato o l’ha sentito qualcuno?",
        "upvotes": 29,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1pldu75/ma_è_possibile_che_ci_siano_fuochi_dartificio/"
    },
    {
        "id": "1plnb36",
        "author": "MeowLesty1",
        "title": "Qualcuno va al Xmas comics domani?",
        "content": "Hai, primo post che faccio su Reddit. Sarei dovuto andare al Xmas Comics con duei miei amici, ma mi hanno dato buca di brutto per tutti e due i giorni.\n\nQualcuno che ha già i biglietti ha bisogno di un +1 per la giornata? (Sono addirittura in Cosplay, wow!), non ho sbatti di andarci da solo per due giorni di fila :(",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1plnb36/qualcuno_va_al_xmas_comics_domani/"
    },
    {
        "id": "1pljmfd",
        "author": "fsuran",
        "title": "Negozi per regali originali a Torino",
        "content": "Ciao a tutti, oggi mi rechero in centro alla ricerca di regali da fare per natale. Tutti i regali più banali e scontato li ho già comprati, mi mancano un paio di chicche per le persone più care. Sono uno studente e sono a Torino da un paio di mesi, quindi potrei prendere anche qualcosa di tipico.\n\nOltre a questo accetto anche consigli per locali/cose da vedere in centro nel pomeriggio.\n\nGrazie a tutti!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pljmfd/negozi_per_regali_originali_a_torino/"
    },
    {
        "id": "1plqthn",
        "author": "EducationalTicket458",
        "title": "Nuove amicizie",
        "content": "Salve reddit sono un fuorisede M21 di recente arrivato a Torino per studio realmente interessato a fare nuove conoscenze e/o amicizie, non esitate a scrivermi in privato ( dove possiamo parlare meglio ) o qui sotto per organizzare uscite o simili.\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1plqthn/nuove_amicizie/"
    }
]