[
    {
        "id": "1on8se3",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 27,
        "comments": 5540,
        "media": null,
        "permalink": "/r/realmadrid/comments/1on8se3/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1osoz4q",
        "author": "soccer-stats",
        "title": "Post Match Thread: Rayo Vallecano vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1osoz4q)",
        "upvotes": 170,
        "comments": 795,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osoz4q/post_match_thread_rayo_vallecano_vs_real_madrid/"
    },
    {
        "id": "1ospu9r",
        "author": "AbuElKess",
        "title": "Every run Kylian Mbappé made into the box against Rayo Vallecano",
        "content": "",
        "upvotes": 637,
        "comments": 181,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/po56po78s90g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ospu9r/every_run_kylian_mbappé_made_into_the_box_against/"
    },
    {
        "id": "1ospsqs",
        "author": "SaniaXazel",
        "title": "Brilliant tackle by Asencio to stop a Rayo Counterattack",
        "content": "",
        "upvotes": 419,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lpnikppyr90g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ospsqs/brilliant_tackle_by_asencio_to_stop_a_rayo/"
    },
    {
        "id": "1ot777z",
        "author": "chunchunmaru1129",
        "title": "Our Player Ratings against Rayo Vallecano by Fotmob, what was the main problem",
        "content": "",
        "upvotes": 27,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zeb7zr4kpd0g1.png?auto=webp&amp;s=4686047e661a3d23511f3553cced68a3242c9d77"
        },
        "permalink": "/r/realmadrid/comments/1ot777z/our_player_ratings_against_rayo_vallecano_by/"
    },
    {
        "id": "1oshrzt",
        "author": "TheFeatherDiaries",
        "title": "Thierry Henry doesnt agree with Vinicius' decision making against Liverpool",
        "content": "",
        "upvotes": 728,
        "comments": 159,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4zt9y0sk280g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oshrzt/thierry_henry_doesnt_agree_with_vinicius_decision/"
    },
    {
        "id": "1ot71ay",
        "author": "chunchunmaru1129",
        "title": "You guy's will hate me for this but I think Güler should play as our 10 and Jude should play as our 8",
        "content": "When Güler was playing as our attacking playmaker Mbappe was also performing really well.It seemed they have this deep connection or understanding of each other.Its like Güler and Mbappe are soul mates in the footballing pitch who are made for each other.Güler is a unselfish player who will provide scoring opportunities for Mbappe even when he himself can score.Güler is possibly our best playmaker and also passer on our team with the best vision. \n\nJude is a amazing box crasher but he sometimes is at positions which should be Mbappe's to stay at.\n\nJude is a physical beast and having him play as our 8 would help us tremendously in our defensive aspect of our playstyle.\n\nYeah Güler is doing fine in the DLP role but I still think he is at his best playing as the Attacking Midfielder. \n\nHim playing up allows Mbappe to be at his best which also helps us perform way better. ",
        "upvotes": 23,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot71ay/you_guys_will_hate_me_for_this_but_i_think_güler/"
    },
    {
        "id": "1oszlkn",
        "author": "blueXwho",
        "title": "Where did the common sense go?",
        "content": "How can so many people hinestly believe Mbappé is not good for Real Madrid? This has to be the only fan base in the world that thinks having the European Golden Boot is a bad thing.\n\nFirst, they were laughing at supportive fans because they predicted Mbappé wouldn't get along with the rest of the team and he wouldn't score as many goals as in the French league.\n\nNow that he became the European top scorer, they say he is \"padding stats\" and \"not helping the team\", they say we need a 9, not him. But what do they want the new 9 to do? Isn't score goals? Or the idea is to replace Mbappé (which is what people are saying) with a 9 that assists? Isn't obvious that having the top scorer is a good thing.\n\nI get that Xabi should think about using a striker that dominates the aerial game, but that cannot be to replace Kylian, but to complement him.\n\nI honestly don't understand how so many people share this opinion. It's insane thinking being the top European scorer is somehow a bad thing.",
        "upvotes": 46,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oszlkn/where_did_the_common_sense_go/"
    },
    {
        "id": "1osk19u",
        "author": "TheFeatherDiaries",
        "title": "Starting XI vs Rayo Vallecano",
        "content": "",
        "upvotes": 270,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/esfn5ep4m80g1.jpeg?auto=webp&amp;s=cea8e860f506246c97d308da54513a7ae8f2a243"
        },
        "permalink": "/r/realmadrid/comments/1osk19u/starting_xi_vs_rayo_vallecano/"
    },
    {
        "id": "1osw3w0",
        "author": "Mastermind_737",
        "title": "Why an aerial threat striker is needed",
        "content": "Rewatch our goals from 23/24 when scored 87 goals in la liga which was the most since 2018 when Ronaldo left. And focus on Jude and Joselu, the space they create for others and each other. The game winning or opening goals, they both are almost always present. And pay attention to the space at the top of the box allowing nice shots without the defense suffocating the players there. Here is the short Madrid Official channel video of the goals: https://youtu.be/T_YjyTNAJ5M",
        "upvotes": 47,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/es-jjfxi3jEGRrMKDgJRvXSfs1RUuhyV7NBM6sZGPyA.jpeg?auto=webp&amp;s=ad2e9fc8f916320a365c295c56d59f2da9b4b8af"
        },
        "permalink": "/r/realmadrid/comments/1osw3w0/why_an_aerial_threat_striker_is_needed/"
    },
    {
        "id": "1ost0b2",
        "author": "andrewthenikka1",
        "title": "Will we ever see the 352 again?",
        "content": "I think most of us are already dumbfounded about how xabi has managed this team since after the CWC. It’s understandable somewhat because we had a good start of the season until now but recent performances cannot go unnoticed. \n\nTalking about today’s game, holy shit was there even a game plan? And what were those subs? Not only were they so late but he brought on two players we absolutely didn’t need for that game. We have Endrick and Franco who can play RW but he does Brahim and Rodrygo 💀 why did he even start. And wtf is the point of Trent coming on in the 85th minute? He should’ve started let alone barely get anything. Bro was signed to watch from the sidelines. Valverde was holding his hamstring for like 10 minutes too. Mbappe must have Xabi hostage for being on that field for the full 90\n\nOnto the main point which is the 352. Most of our players had their best games in that formation. Trent as RWB, Valverde as RCM (we do NOT want to see him in the pivot again 🙏🙏), Tchoua as the CB/CDM hybrid role. Guler and Bellingham also played really well tg too, now they both just want to be 10s. After Endrick goes on loan we won’t have a competent RW. And we actually had players inside of the box and aerial threat. Why has Xabi completely ditched this formation? It worked out so well and the players that we have are best fit for it, Xabi was seriously genius for setting it up like that. I don’t know what goes on in his mind every time he plays 433 it just doesn’t work with our team as it NEEDS creativity which we DON’T HAVE! Does he watch the same games we are watching or is he in another universe?? I hope when he finally starts Trent (if he even does) he’ll feel compelled to use it, maybe after the break when tchoua is also back. \n\nI want to iterate that I am not overreacting but just pointing out the flaws. I still trust in Xabi and know we will get better as the season goes on I just hope he has full control of the team and it’s not Perez putting a gun to his head, or maybe should hope for that so we know it’s not him lol and Perez gives him the freedom. A draw is a draw and we move on. Hala Madrid!",
        "upvotes": 61,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ost0b2/will_we_ever_see_the_352_again/"
    },
    {
        "id": "1oskga3",
        "author": "scoreboard-app",
        "title": "Match Thread: Rayo Vallecano vs Real Madrid Live Score | LaLiga 25/26 | Nov 9, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1oskga3)",
        "upvotes": 137,
        "comments": 3841,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oskga3/match_thread_rayo_vallecano_vs_real_madrid_live/"
    },
    {
        "id": "1os7otj",
        "author": "SaniaXazel",
        "title": "On this day last year, Raúl Asencio debuted for Real Madrid and provided an assist just 12 minutes after coming off the bench",
        "content": "",
        "upvotes": 1076,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5cjadcfg750g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1os7otj/on_this_day_last_year_raúl_asencio_debuted_for/"
    },
    {
        "id": "1ot8f4k",
        "author": "PlantComprehensive77",
        "title": "Why did we bring in Trent?",
        "content": "What was the purpose of bringing in Trent? If Xabi refuses to ever play a traditional 9, while Vini and Mbappe play patty cake at the edge of the box, what is Trent offering to this team? It’s definitely not defending, so what’s the deal? \n\nHe came on against Liverpool, puts a ball into the box, and other than Jude, nobody there. Comes on today, gets the ball, looks up, and sees fuck all movement up top. We acquired one of the most creative fullbacks in world football without a clear target man. \n\nThe only time our attackers do make runs into the box is on the counter. Problem is 99% of the teams in this league play ultra low block, so that’s pretty much useless. Might as well send Trent back to Liverpool. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot8f4k/why_did_we_bring_in_trent/"
    },
    {
        "id": "1ot852s",
        "author": "sebisebo",
        "title": "We need someone like Lewandowski upfront",
        "content": "Look at the 2nd and 3rd goal from Lewa this weekend and tell me this is not exactly what we are missing. I want to see us scoring from crosses, from corners. I want to see us being capable of creating danger even if the opposing team is in a low block. And the only way we can do this is by having an experienced no.9 - sorry but Mbappe is a LW player for me. Also we need a proper RW. And then we should be good to go. All that Arda/Bellingham talk is not of any issue to me.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot852s/we_need_someone_like_lewandowski_upfront/"
    },
    {
        "id": "1os0u8a",
        "author": "Mysterious-Prune3309",
        "title": "I’m back with my fan made Real Madrid manga/comic Chapter II: 92:48",
        "content": "Hey friends, I’m back with the Chapter II of my RM manga. I can’t seem to say this enough, but I appreciate the support from you on the first chapter!\n\nThe making of these manga are very time consuming, from sketching, colouring, arranging to coming up with texts. Everything took longer than expected, but your support kept me motivated and pushed me through this process🫡\n\nI really do hope y’all like this one too, and I look forward to reading your feedback, post your criticism here too, I don’t mind as they’d help me improve. \n\nLike you see here, I’m receiving 0 financial support or generating any revenue off of my work. They are for your entertainment and made with my passion. \n\nI’ve never received any formal art training and is still learning and improving each page or panel. You can see the art style is inconsistent and changes here and there, so please bear with me. \n\nHappy to share here and appreciate everyone who read the first one! \n\n\n\n",
        "upvotes": 992,
        "comments": 114,
        "media": null,
        "permalink": "/r/realmadrid/comments/1os0u8a/im_back_with_my_fan_made_real_madrid_mangacomic/"
    },
    {
        "id": "1ot7l3c",
        "author": "Fit_Wrap_9580",
        "title": "To me Xabi is not the only one to blame,",
        "content": "I think we are almost 75% complete in rebuilding, but our main issue is with low block, and high pressing. Anyways xabi was making team play well with 3-4-3, but after CWC he changed to 433 or 442, we are very good defensively, exclude Liverpool and Athleti match, that may be due to inexperience in defensive line, but I am happy with overall defence, but during low block we need to play a proper striker.\n\nI guess board doesn't make him allow Playing 3-4-3, or maybe because of Mbappe's arrival.\n\nIn my opinion(this is purely my opinion): Vini has been dropping stinger on the left, its like he doesn't have a single braincell for decision making, dude has immense talent but his decision making is some times shit, taking on 3 players at once instead of passing and moving forward. I think instead of making Vini competing with Rodrygo, they should make Vini compete with Mbappe on Lw, and in striker Gonzalo or Endrick, or play Endrick in Right wing until Eminem comes back.\n\nYesterday we were just passing and passing and passing nothing in final 3rd, we were playing like headless chicken.\n\nI saw a post saying Perez supports Vini than Xabi, he didn't like the Vini Substitution, that's why we didn't see Vini get substituted. Xabi should be allowed to do whatever he wants, he is senor, and coach.\n\nOur team is good, but to be greatest only few more tweaks and that's it.",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot7l3c/to_me_xabi_is_not_the_only_one_to_blame/"
    },
    {
        "id": "1os6ccs",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 0-1 Liverpool",
        "content": "",
        "upvotes": 104,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2tjta4zov40g1.png?auto=webp&amp;s=232a8832130b74b4c6a8f7adf4df6d63c4c8474a"
        },
        "permalink": "/r/realmadrid/comments/1os6ccs/postmatch_survey_results_real_madrid_01_liverpool/"
    },
    {
        "id": "1osiosb",
        "author": "Known_Appeal7699",
        "title": "Santiago bernabeu stadium premium tour vs normal",
        "content": "Hi, \nIm going to madrid tomorrow staying for a week and wanted to go and see the stadium, because of the international break there is no game at that time. \nCan some1 tell me how the tour actually looks (is all available like pitch entry etc.) and is it worth to buy premium guided tour, or classic one ? \n\n",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osiosb/santiago_bernabeu_stadium_premium_tour_vs_normal/"
    },
    {
        "id": "1osx067",
        "author": "kasam-se",
        "title": "Rayo Vallecano 0 - 0 Real Madrid - Engish Dub Post-Match Press Conference La Liga Xabi Alonso 25/26",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dKFuZPodzE6lGDqw_nHZcF6Uxsw3oKuDtOWPCKeJnlU.jpeg?auto=webp&amp;s=c95240b202bcbc4c7a4844ea5b057916ea07803a"
        },
        "permalink": "/r/realmadrid/comments/1osx067/rayo_vallecano_0_0_real_madrid_engish_dub/"
    },
    {
        "id": "1os7tm2",
        "author": "Ughhhhhhhhhhu",
        "title": "Possible lineup for tmmrws matchc any thoughts?",
        "content": "P.S. G.Garcia isnt on the app im using thats why fran is there. Only reason im suggesting this lineup is cause we cant keep mbappe as striker if we expect to suceed in the long run. I know mbappe is good but he just doesnt do what we need from a striker. I think G.Garcia should start so we can see more from him especially since this next game should be an easy win. I put mbappe on the rw cause he's clearly capable of playing there, not to sure of the midfield tho just wanted to see what you guys thought. Just tried to have a civil convo about my criticisms for madrid with a fellow fan on tiktok and he decided to be delusional and just respond with a pic of previous matches where we won against barca as if that's all this club should care about. He seemed to think that just cause we beat barca, we could beat anyone and win the ucl(even though it's very very obvious that id we keep playing the way we play against big teams, we are definitely not winning the ucl) Please feel free to share your thiughts WITHOUT being rude",
        "upvotes": 35,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1os7tm2/possible_lineup_for_tmmrws_matchc_any_thoughts/"
    },
    {
        "id": "1osmzfe",
        "author": "Gleis7",
        "title": "Authentic vs Normal Size Guide?",
        "content": "I typically wear a size L in the standard replica jerseys, and I appreciate that they offer a slightly loose and comfortable fit.\nMy main question concerns the authentic version of the jersey, specifically the sizing. Since Adidas is having a great sale on last year's stock, this is the perfect opportunity to upgrade. If I purchase the authentic version also in size L, will it simply fit a bit tighter and more tailored than the replica L, or will the difference be significant enough to warrant sizing up?\nI am strongly leaning toward the authentic jersey because, to my eye, they simply look 100 times better than the standard, normal ones. The quality of the materials, the heat-pressed crests, and the overall slimmer cut make them a much more premium item that I'd love to add to my collection while the sale lasts. I need to be sure about the fit before I commit to the purchase.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osmzfe/authentic_vs_normal_size_guide/"
    },
    {
        "id": "1orjhd1",
        "author": "SaniaXazel",
        "title": "Sudanese Children Fleeing War Zones Find Joy Supporting Real Madrid",
        "content": "",
        "upvotes": 692,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/23khcbv1mzzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1orjhd1/sudanese_children_fleeing_war_zones_find_joy/"
    },
    {
        "id": "1orwuiw",
        "author": "kundu123",
        "title": "Alonso: Trent 'ready' for Real Madrid start vs. Rayo",
        "content": "",
        "upvotes": 77,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E5eBWBypKkLFv1O8u9MBjwZWkE3iVsTy61-pnk0nWNE.jpeg?auto=webp&amp;s=8706029965273f6c27dc5cf1f5f37b9582862b07"
        },
        "permalink": "/r/realmadrid/comments/1orwuiw/alonso_trent_ready_for_real_madrid_start_vs_rayo/"
    },
    {
        "id": "1ormy2i",
        "author": "Gaengsa",
        "title": "Arda Guler speaks as Real Madrid Player of the Month for October",
        "content": "",
        "upvotes": 271,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sm3up41oo00g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ormy2i/arda_guler_speaks_as_real_madrid_player_of_the/"
    },
    {
        "id": "1oryws3",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 5 - 0 Alhama | O.G. 30', Silvia 50', Keukelaar 54', Iris 90', Linda 94' | Win at home with some rotations, before an important week with CL against Paris FC and El Clásico away in league.",
        "content": "",
        "upvotes": 50,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yoo7sabm930g1.jpeg?auto=webp&amp;s=3d783b2d30cc4cc281954469ffc4c6de7b1c6145"
        },
        "permalink": "/r/realmadrid/comments/1oryws3/fem_real_madrid_5_0_alhama_og_30_silvia_50/"
    },
    {
        "id": "1osgk7y",
        "author": "IcefoxX5",
        "title": "[Match Thread] Mérida AD - Real Madrid Castilla | Primera Federación, Matchday 11",
        "content": "#FT: MÉRIDA 3:0 CASTILLA \n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Luis Pareja 43'\n\n2:0 Luis Pareja 45'+4\n\n3:0 Víctor Valdepeñas (OG) 73' \n\nRed card: David Jiménez (Castilla) 90'+5\n\nRed card: Manuel Ángel (Castilla) 90'+5 \n\nRed card: César Palacios (Castilla) 90'+8\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n8' - huge chance for Yáñez, who finally needs to make more of his chances this season - Pitarch advances nicely on the left side and dribbles against two opponents in the box - he plays a pass with the tip of his foot right in the lane between them, and Yáñez arrives open in the box, but his shot goes just wide of the left post \n\n25' - next huge chance, Aguado advances on the counter on the left side, and squares it into the box - the ball gets deflected to Pitarch at the edge of the box, and he manages to create space for a shot nicely, but the ball rolls ever so slightly wide of the far post, after the goalkeeper was already beat \n\n38' - the Mérida coach asks for a review on a potential red card for Palacios after he swung his arm against an opponent who held on to him away from the ball, but the decision remains a yellow card, correctly so\n\n⚽ 43' - and Mérida score with their very first chance and shot on target, the ball gets headed on after a long throw, then redirected again to the far post, where Pareja clashes against Jiménez and manages to poke the ball into the net in the process \n\n45'+1 - the goal is challenged by Arbeloa, Pareja clearly hits Jiménez before hitting the ball, but the referee lets the goal stand\n\n⚽ 45'+4 - and center back Luis Pareja, who has not scored a single goal before today for Mérida, scores again, completely destroying Valdepeñas with a chop in the box, and then finishing it high into the net from a short distance. The goal looked like offside to me, and it came off a free kick that was never a foul and even a yellow for Yáñez - the end of this first half could not have been more frustrating\n\nHT - an incredibly unjust result after a first half that has seen Castilla create, but miss a number of chances, as lapses of concentration in the defense by Castilla allow Mérida score with their only two opportunities, in the shape of a center back that has now doubled his total career tally with this match. A big reaction needed to forget these disappointing minutes by the team\n\n46' - second half underway \n\n🔄 57' - Loren Zúñiga off for Bruno Iglesias \n\n70' - phenomenal save by Fran from a short distance after Mérida's Chiqui runs all by himself into our box on the counter \n\n⚽ 73' - absolutely no words, Valdepeñas wants to play the ball back to Fran, but completely mishits it and lobs it over him into our own goal. Schoolboy error to even play the ball straight at goal, and a grave technical mistake on top. A match to quickly erase from the memory for Castilla\n\n🔄 74' - Dani Yáñez off for Leiva\n\n🔄 86' - Joan and Palacios off for Manu Serrano and Mesonero \n\n🟥 90'+5 - disgusting and disgraceful challenge by David Jiménez, who kicks the Mérida player into the knee on purpose. This should be a lengthy ban for him, which is especially painful in the absence of Fortea, leaving the team without a right back \n\n🟥 90'+5 - a big fight breaks out, with even the police on the pitch, Manuel Ángel gets a red card\n\n🟥 90'+8 - for some reason, Arbeloa asks for a review despite the clarity of the red card, escalating the situation further. Palacios said something to the referee, and he also gets a red\n\nFT - a disgraceful, unprecedented end to this match and to Castilla's winning streak. With potentially multiple game bans coming for Jiménez and Manuel Ángel, and likely a single match ban for Palacios, this match might just ruin the next stretch of matches as well. Arbeloa needs to keep his team in check, this cannot ever happen again. The fact he challenged the red card at the end, letting things escalate even further should make him question himself in the process too. \n\n&amp;#x200B;\n\n**Kickoff:** 12:00 CET\n\n**Venue:** Estadio Romano José Fouto, Mérida \n\n**Referee**: Rubén Ruipérez Marín\n\n**Competition:** Primera Federación, Grupo 1, Matchday 11\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas, Joan Martínez (86' Manu Serrano), David Jiménez - Jorge Cestero, Thiago Pitarch, Manuel Ángel - César Palacios (86' Dani Mesonero), Loren Zúñiga (57' Bruno Iglesias), Dani Yáñez (74' Álvaro Leiva) \n\nBench: Guille Súnico (GK), Mario Rivas, Lamini Fati, Cristian David, Pol Fortuny.\n\nUnavailable: Sergio Mestre (first team call-up), Jesús Fortea (injury), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WWWDW\n\n**1ª RFEF stats:** 4th | 18pt | 6-0-4 | 13:10\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osgk7y/match_thread_mérida_ad_real_madrid_castilla/"
    },
    {
        "id": "1orviyj",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: Rayo Vallecano vs Real Madrid, La Liga Game 12",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1orviyj)",
        "upvotes": 65,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1orviyj/pre_match_thread_rayo_vallecano_vs_real_madrid_la/"
    },
    {
        "id": "1osxhbw",
        "author": "More-Judgment-9253",
        "title": "Stop blaming Mbappe for Vini's decrease in ability.",
        "content": "I keep seeing people say that mbappe's the reason why vini isn't performing as well as he used to, are we serious? When mbappe was in the worst form of his life last season, vini was still playing insanely well, and as a matter of fact that was probably his best start to a season (idk for sure, I don't feel like checking). My point is, vini was carrying this team at the beginning of last season but then after he got injured around november/ December, he's been nowhere near that level. Even in the CWC when he had Gonzalo next to him he was even worse than he is right now. His decision making has dropped significantly along with his passing, which is tragic but it's the truth. So blaming mbappe for that is just cope. Vini still has his good games every once in a while but in general he's been average for a whole year now, I hope he can bounce back but that might not happen.",
        "upvotes": 0,
        "comments": 75,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osxhbw/stop_blaming_mbappe_for_vinis_decrease_in_ability/"
    },
    {
        "id": "1osyfdm",
        "author": "Pechorin12",
        "title": "It is time to speak up for the Truth",
        "content": "\nIt is coming to a point that whether Xabi has the balls to challenge the high price-tagged aristocracy of Real Madrid and make the necessary arrangements in favour of the youngsters like Arda, Gonzalo and Endrick…\n\nAs I argued this previous months too, Bellingham, although is a very good player, a midfield trusted on his creative and organizational abilities will not be more than mediocre as it was seen the entire last year…however, he has this star presence to dictate himself anywhere on the pitch and if you check the stats, you will realize that the more he is located near to the other box, the less we will score; however, this is not because he is not good enough, it is because this move comes up at the expense of Arda’s losing positional connection with the forward…why perhaps our strongest midfield stays far from the region where the physical stamina needed most, but our most creative assister who happens to be only 69 kg is the bodyguard of the Disco Real Madrid!? Why!? Perhaps that position is not right under the desirable spots of fame; if this is not about skills and fairness, then here should be called Circus Real Madrid…\n\nAfter everything, all I see here is still Mbappe should be there, Vini should be here or Bell should do this, Rodrigo needs more time bla bla…how much more time guys? these guys, believe me, are given everything possible; materially and spiritually…they can dribble, shoot or simply walk…without consequences…I dont mean they are not great players but we obviously need to change the organization and traditional balance of the team even if it may hurt some players and some of fanboys…\n\nAs it was said at the beginning, it is coming to a point of making bold decisions and creating a system based on merit and factual data, not on aristocratic bullshit or on sleazy dreams of a bunch of man-worshipping fans…",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osyfdm/it_is_time_to_speak_up_for_the_truth/"
    }
]