[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcakae",
        "author": "businessinsider",
        "title": "Netflix show developer to stand trial for $11 million spending spree, including 5 Rolls-Royces, $638,000 in mattresses",
        "content": "",
        "upvotes": 38,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pcakae/netflix_show_developer_to_stand_trial_for_11/"
    },
    {
        "id": "1pbnpt4",
        "author": "RiskAndReason",
        "title": "What do you think is the most overrated thing on Netflix?",
        "content": "Curious what everyone’s pick is for the most overrated Netflix show or movie.\n\nWhich title do you think gets way more hype than it deserves, and why? \n\nI’m not looking for hate, just honest opinions and maybe a few hot takes. 🫡",
        "upvotes": 189,
        "comments": 623,
        "media": null,
        "permalink": "/r/netflix/comments/1pbnpt4/what_do_you_think_is_the_most_overrated_thing_on/"
    },
    {
        "id": "1pbdb97",
        "author": "Ha8lpo321",
        "title": "Netflix quietly killed casting from phones to newer Chromecasts and Google TV Streamer",
        "content": "",
        "upvotes": 285,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdb97/netflix_quietly_killed_casting_from_phones_to/"
    },
    {
        "id": "1pcbv4a",
        "author": "Anxious_Maize_1823",
        "title": "Red Dead Redemption now available to download on App Store",
        "content": "Version 1.50.60293175 is now available to download and the size is 3.08 GB before any in-app downloads. The requirements however is iOS or iPadOS 18.0 or later.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv4a/red_dead_redemption_now_available_to_download_on/"
    },
    {
        "id": "1pcbv0t",
        "author": "HereW1thoutDorinda",
        "title": "Netflix Home Screen",
        "content": "PSA to parents:  when I opened Netflix today, the first preview clip is the Matt Rife Christmas special and immediately talks about how Santa is really your parents. I tried to contact Netflix to have this updated but hopefully others will message them too. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv0t/netflix_home_screen/"
    },
    {
        "id": "1pbgp78",
        "author": "Such_Environment5893",
        "title": "What is the justification of increasing subscription prices when Netflix continues to cancel shows after 2 seasons?",
        "content": "It doesn't make any sense to me.\n\nWhy get me hooked on shows if they are not going to be finished?\n\nWhat is the justification of this cycle of killing shows after 2 seasons only to start new shows?\n\nIs the price difference THAT MUCH between a renewal vs a new show?\n\nOr is it this overwhelming desire to find the next \"Walking Dead\" or \"Game of Thrones\" mega hit? Is it a case of \"unless it goes viral, its a failure?\"\n\nThe economy of streaming services is pissing me off. These price increases don't seem justified in the slightest.\n\nThis is why I've more often switched to watching YouTube, as at least I can rely on those content creators to keep giving me content I want to watch instead of \"well, my last video didnt get 1 million views, so I guess I'm calling it quits!\".",
        "upvotes": 125,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1pbgp78/what_is_the_justification_of_increasing/"
    },
    {
        "id": "1pc1ufz",
        "author": "TimesandSundayTimes",
        "title": "Gary Lineker nets multimillion Netflix World Cup podcast deal",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pc1ufz/gary_lineker_nets_multimillion_netflix_world_cup/"
    },
    {
        "id": "1pc2rjw",
        "author": "Hot-Slide-7305",
        "title": "Christmas movies",
        "content": "I've recently got netflix got put on my Television, at this time of year there will no doubt be plenty of Christmas TV shows/movies on it, can any of you recommend any of good ones you think I may enjoy?\n",
        "upvotes": 4,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pc2rjw/christmas_movies/"
    },
    {
        "id": "1pc4v3m",
        "author": "SuperhumanVikingr",
        "title": "Am I supposed to have a second Netflix account for my holiday home???",
        "content": "\nI have a holiday home, and previously I’ve always been able to use Netflix there with no issues. \nNow, however, I can’t log into my account and I don’t even get a traveling option for a temporary code. It just asks me to update my household. \n\nDoes anyone have any insight on how to resolve this?\nAm I supposed to have a second account for a holiday home?\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pc4v3m/am_i_supposed_to_have_a_second_netflix_account/"
    },
    {
        "id": "1pbpjhd",
        "author": "pirategonzo",
        "title": "Watching Breaking Bad, Went to Lunch, Came Back and it is GONE??? Is it Just Me?",
        "content": "I feel like I am losing my mind. My \"continue watching\" is gone, and if I search for Breaking Bad I can't find it. I was just watching it less than two hours ago.",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pbpjhd/watching_breaking_bad_went_to_lunch_came_back_and/"
    },
    {
        "id": "1pburn8",
        "author": "funkymoonbeam",
        "title": "Does anyone have the Avatar code for the Kuromi icons?",
        "content": "I cannot find the codes anywhere, was hoping a kind person would be able to share the pouting Kuromi avatar code.\n\n  \nI'm referring to [this](https://pbs.twimg.com/media/GwnZKnWXkAA9jAq?format=jpg&amp;name=large) set of icons they released for the '*My Melody &amp; Kormi*' show. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pburn8/does_anyone_have_the_avatar_code_for_the_kuromi/"
    },
    {
        "id": "1patdun",
        "author": "f41ryb0n3s777",
        "title": "Removed a movie while i was watching it",
        "content": "Honestly just sharing it cus it’s funny but a little annoyed by it too. I was watching “Now You See Me 2” and i paused it for like 5 minutes to take a pee break. I come back and turn on the movie and it says title not available. I just brush it off as a typical Netflix glitch and refresh the page to see THAT THEY REMOVED THE MOVIE OFF THE WEBSITE 😭😭😭 REALLY NETFLIX\n",
        "upvotes": 417,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1patdun/removed_a_movie_while_i_was_watching_it/"
    },
    {
        "id": "1pbdvk9",
        "author": "TheMirrorUS",
        "title": "Linda Carman was 'warned' not to go on boat trip with son before death",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdvk9/linda_carman_was_warned_not_to_go_on_boat_trip/"
    },
    {
        "id": "1pbzep4",
        "author": "GoddessRayne",
        "title": "Shows all look faded",
        "content": "Wondering if others are seeing this. We’ve checked on our tv Netflix as well as our Roku where we usually stream from. Everything seems washed out. Other streaming platforms are fine. It’s just a Netflix thing. I guess it’s better than too dark 😆 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbzep4/shows_all_look_faded/"
    },
    {
        "id": "1pc5q86",
        "author": "Youhan9",
        "title": "I want your opinion. Is it worth watching?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pc5q86/i_want_your_opinion_is_it_worth_watching/"
    },
    {
        "id": "1pbixrc",
        "author": "notjordansime",
        "title": "Cast feature missing - needed for accessibility",
        "content": "Hi, I help a few local seniors with various tech issues in my spare time. Recently, the cast feature has stopped working and a few people that I help heavily rely on that for accessibility. The TV App interface is simply too confusing for them, they cannot use it. \n\nThey rely on the cast feature to be able to navigate the UI, to select a show that they want to watch. It’s a phenomenal solution that makes browsing Netflix possible for them. The feature still works on all other streaming services, including YouTube. They can cast their home screen and browse the Netflix catalogue while casting, but as soon as they try to put on a show it all falls apart. This isn’t a matter of convenience, it’s the only way they’re able to navigate the UI. I have tried to show them how to do it normally, and I usually get responses like “that’s too much for me, it’s not worth the hassle”. \n\nAny solutions, or should I contact Netflix support?",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pbixrc/cast_feature_missing_needed_for_accessibility/"
    },
    {
        "id": "1pc7c81",
        "author": "Yuunelk",
        "title": "Stranger Things 5 - The real glaring issue that's holding it back.",
        "content": "Stranger Things. A TV show that, despite often years between each season, has managed to reclaim its prominent position amongst the zeitgeist of modern day pop culture again, &amp; again, &amp; again, &amp; again. It's coming up to a decade since it was first released, which I'd argue makes its status that much more impressive. Yet, there was always one thing that was inevitably going to be the thing that either makes or break the show. So far, its been the reason why so many people have fallen in love with the series, &amp; continued watching even after all this time. However, its now become the opposite, preventing this new season from reaching its fullest potential. What is that issue exactly? It's the acting.\n\n\n\nWhen you hire child actors in a show that was inspired by 80's cult classic like the Goonies, that a decision that makes sense. After all, bunch of ragtag kids embarking on adventures, &amp; getting in way over their heads but despite it all they somehow make it out alive, is a formula that no doubt works. Especially when you take these kids &amp; throw them into a world where there is an alternate hellscape of a small mid western town they call home, that is home to carnivorous supernatural beings. But often these kids aren't natural born actors. They're kids playing the role of kids, something I'm sure they know how to do quite well. The question then is if your a child actor, whose thrust into an environment where your role goes from playing a kid to suddenly playing a psychologically damaged kid who has to navigate grief, demonic possession, a nefarious government operating on a series of super children, all the while finding enough courage to stare death in the face &amp; save the day... how do you go about progressing &amp; developing your craft as an actor, with only 2-3 years to prepare, enough to be able to sell that to the audience? It's a really hard hting to do. Especially because with a show like this there is a constant expectation from fans to up the ante every time a new season rolls around. That doesn't just come from budget &amp; writing a grittier plot. After all, it's all well &amp; good to write a really convincing story, but if you haven't got the right actors to be able to deliver said story convincingly, it doesn't matter how good the script is, if you don't believe the actors then you certainly aren't going to believe what they're saying or what story they're trying to deliver.\n\n\n\nI don't think when these kids were hired they were the best actors. But they didn't have to be. But after knowing these characters for a almost decade, we know how much more complex their situation has become, &amp; I think it's then fair to say we almost expect that as actors they are able to give us the type of performances that reflect this drastic &amp; dramatic change in circumstances. The problem is I'm not sure if a few of them can. Take Noah Schnapp for example. He always had what I think was the hardest job out of any the kids. His role was extremely physically demanding, &amp; credit where credit is due, I think early on he absolutely did a great job. Although in season 2, 3 &amp; 4, whilst his physical performance abilities remained relatively consistent, his work during some of the more intimate emotional scenes is where his strengths as an actor were brought into question somewhat. &amp; in season 5 this has never been more prominent. I think the same goes for quite a few members of the cast, &amp; with how big this show has gotten you need to as an actor **need** to match that energy, which is so hard to do if you really don't have the skills to do so.\n\n\n\nI want to add that I myself am an actor. I am not here to tear down any of the cast, because none of them are bad actors. They have all showcased some incredible performances over the years, &amp; have each had individual moments that have really impressed me. Even in this new season, I think some cast members Like Joe Keery, Sadie Sink, Gaten Matarazzo, Winona Ryder &amp; David Harbour (no suprises there), have managed to continuously deliver time &amp; time again, finding a way to grow &amp; progress their characters in a really complex way, yet still managing to maintain that same season 1 (or 2 in Sadie's case) charm that made us all fall in love with them in the first place. Even people like Charlie Heaton who despite playing a character who I think sadly never really got a chance to fully develop, has still managed to deliver some really great performances. But I think as the shows gone on, even the Duffer Brothers have recognised that not everyone has grown at the same rate. Hence why I think there is a reason Mike in season 4 had a less prominent role than in the other seasons. He's a great actor who works best amongst other actors in a supporting role. But as a solo actor, I think he does lack the skills to really carry &amp; drive a scene forward. As a kid I thought he always really stood out, but as he's gotten older &amp; more has been demanded of him as an actor, I don't think he progressed enough to be able to carry &amp; drive a scene without the help of a more confident &amp; stronger actor beside him. It always feels like he's still that same immature kid yelling at Will in the rain to grow up. Every time he talks it still feels like he has this childlike wonder &amp; naivety about him, almost as if he somehow still believes that maybe everything will still work out in the end despite multiple people literally being slaughtered in front of him &amp; loosing his girlfriend in a physic stand off to a demogorgon/gate countless times. I first noticed this in episode 2 of season 5 in the hospital. Natalie Dyer's expressions during the hosptial cut me like a knife. I could just see in her eyes each emotion she was going through &amp; trying to process. Then I look to my right and I see Finn Wolfhard simply looking pissed off &amp; unaffected, &amp; it just completely took me out of it. Which is something I have found to be consistent amongst some of the weaker actors in the cast. They really seem to struggle with staying in a scene, being present so to speak. They tend to act a lot of their scenes with the heads &amp; arms. You can tell where they put emphasis on certain phrases or words because they might exaggeratedly jut or shake their heads when they're angry or recounting a horrific memory, for example. Or even a lip quiver, why is it always a fucking lip quiver. Winona Ryder started doing it in season 1, &amp; it's like it's own bloody hivemind because nearly everyones adopted it at this point. Again, this is something you find with a lot of beginner actors. Believe it or not, acting takes a lot of self discovery &amp; training. In order to learn how to say, convey an emotion such as grief, you have to work out how it affects us not just mentally, but how it affects the body, what parts become tense, where is your breathing, is it shallow, is it deep, slow &amp; controlled etc. That takes time, certainly more time than the 2-3 year break between seasons where I'm sure that these actors probably didn't exactly have the chance to exclusively develop their craft. They were probably, you know, doing kid things like finishing school.\n\n\n\nAll this to say that I think Stranger Things was a really rare show that somehow has manage to hold out attention for a decade. That is no small feat. Especially when you consider just how much the show has grown. For god sake this new season is estimated to cost half a billion dollars. But this show at it's core is **built** on group dynamics. It's what made the show so loveable. You have all of this extremely dense science fiction-esk world building, but we as the clueless audience have the joy of discover what all of this means alongside an equally clueless group of wacky, fun, cooky DND playing nerds. Each season brought new foes, tougher challenges to face, &amp; higher stakes. The higher the stakes grow, the harder the cast's job as actors became. Trying to deliver a convincing realistic performance within such an unrealistic world is a hard thing to do. But when your a group of kids we automatically believe everything you do &amp; say becuase your kids. The older you get, the harder you have to work to get us to believe, &amp; to do that you need to have enough skills as an actor to rise to that challenge. Which is why I think that the acting is the real glaring issue that that's holding this new season back. There are still so many highlights, Gaten Matarazzo especially for me has been just such a joy to watch. But there are always going to be those weaker links, &amp; with how complicated &amp; large scale this show has become, you need a strong cast to be able to support those ideas. In the beginning, the cast's chemistry was the most important thing, the acting was always secondary. But in season 5, with all of the actors growing up, you need that acting to keep us engaged in the story, &amp; I just don't think that for a few of these actors, they have developed enough over the years to rise to that challenge.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pc7c81/stranger_things_5_the_real_glaring_issue_thats/"
    },
    {
        "id": "1pbkmzc",
        "author": "Own-Relative-850",
        "title": "Stranger Things 5 Dolby Vision problem",
        "content": "When watching season 5 of ST I noticed that epsiode 2 and E2 only doesn't detect Dolby Vision on my TV (LG Oled c3). Episodes 1, 3 and 4, as well as previous seasons don't have this problem. Is there something I can do about it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbkmzc/stranger_things_5_dolby_vision_problem/"
    },
    {
        "id": "1pbfvc1",
        "author": "gronbek",
        "title": "Beast in me grain filter",
        "content": "Started watching the beast in me and noticed directly that the image is very grainy. Like there is a filter with lots of small dots everywhere. \nIs this normal?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfvc1/beast_in_me_grain_filter/"
    },
    {
        "id": "1pbl2tn",
        "author": "HauntingFold6451",
        "title": "Please help me find this cartoon on Netflix from  around 2016-2018 era",
        "content": "I used to watch this show where there were these characters who fought monster like enemies and were trying to survive. It had CGI animation, and a distinct animation style. The characters kinda reminded me of castle crashers. I watched it on my wii with my sister when I was younger. I only remember one part distinctively. There is a scene where they are visiting a theater, (outside). One or two of the characters are looking through a box of props. and a knuckles like character (sonic) picked up a skull and referenced Shakespeare. \"to be or not to be, that is the problem\" He then got corrected because he said it wrong. I am 100% sure that scene exists because we had a skull decor and my sister, who was very young, picked it up and recited the same thing (wrong)\n\nAny help would be valued, and any further questions I will try to answer\n\nEdit: solved its mutant busters",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbl2tn/please_help_me_find_this_cartoon_on_netflix_from/"
    },
    {
        "id": "1pbp8ud",
        "author": "ThunderRoad22",
        "title": "ISO email address (or another option) for customer service feedback",
        "content": "I recently had an incredibly frustrating and disappointing experience with Netflix's customer service (via both phone and chat) that I don't need to get into here. At the end of the chat, the representative gave me two different email addresses I could use to give feedback on my experience. I wrote out a nice long email detailing my experience, and...it bounced back. From both addresses. I just called phone support and was told that the addresses I was given were for outbound emails only, and that they didn't have a customer service feedback email address. When I asked how I could give feedback on my experience, I was told that the only way is by mailing a physical letter to their headquarters in Los Gatos, CA. (Oh, the irony). \n\nBlindly mailing a letter off makes me think I'll never know if it was received or seen, and I certainly wouldn't expect to ever hear back from anyone. So now I'm looking for a way to give feedback on my experience (and hopefully find a solution to what prompted my call in the first place) either online or via email. Does anyone know of anyway that I can do so? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pbp8ud/iso_email_address_or_another_option_for_customer/"
    },
    {
        "id": "1pb93gz",
        "author": "Boredpoquito31",
        "title": "Recommend me some animals documentary",
        "content": "Can you recommend me some of the best animals documentary on Netflix right now? I want something that will be so interesting to watch , even of it's a series of a full movie. Thank you!",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pb93gz/recommend_me_some_animals_documentary/"
    },
    {
        "id": "1pc16g9",
        "author": "HehroMaraFara",
        "title": "Stranger Things Season 5",
        "content": "I cooled on the series after 3 so waited a bit longer to start the last season. \n\nThis is probably the single best example of why a show focused so heavily on children should probably end after 3 seasons or else face the inevitable completely lost vibe and charm and crash landing of an ending. \n\nIt’s just fucking weird bro. Being adults sucks that forgiving effect of being a cute kid even if you’re a mid at best actor. Now it’s just, this mfer has no business being on anything ever and now it’s obvious. \n\nThey even had to cast other people in their late 20s to play high schoolers because if they actually cast literal teenagers, it would be jarring af. \n\nGlad it’s over. Shoulda been a long time ago. ",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pc16g9/stranger_things_season_5/"
    },
    {
        "id": "1pbeb7g",
        "author": "Apprehensive-Care690",
        "title": "Series recommendation",
        "content": "Please please give me a good recommendation series or movies that is SciFi or movies with zombies plot. My netflix is getting cobwebs. Just not Godzilla.",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pbeb7g/series_recommendation/"
    },
    {
        "id": "1pbjcbv",
        "author": "Fit-Supermarket-6726",
        "title": "My netflix keeps having issues on pc",
        "content": "Every time i use it. Whatever i watch. After every 5 - 10 maybe 15 min. Its random. My netflix gets a error and it restarts. I have to chose a profile again and select the show i am watching. Any fixes?\nWindows btw",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbjcbv/my_netflix_keeps_having_issues_on_pc/"
    },
    {
        "id": "1patbpk",
        "author": "StunningComment6064",
        "title": "True crime",
        "content": "Which is the best Netflix TV show based on true crimes? Which one do you recommend, or which one has stayed in your memory even today after you watched it?",
        "upvotes": 44,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1patbpk/true_crime/"
    },
    {
        "id": "1pbfiay",
        "author": "Wooden-Butterfly7339",
        "title": "Cool Screen shot filter",
        "content": "When you turn on Netflix, you get a carousel of screen shots of available shows. Many of those shots have a subtle filter that I really like! \nSpartacus is a good example. Does anyone know what it's called or how it's done?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfiay/cool_screen_shot_filter/"
    },
    {
        "id": "1pbedne",
        "author": "RingRevolutionary552",
        "title": "Where is sesoan 1 of Gilmore Girls ?",
        "content": "I started watching Gilmore Girls and I am on sesoan 1 and now I see that they removed only sesoan 1. I can watch other sesoans but not 1, why ? How do I fix this ?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pbedne/where_is_sesoan_1_of_gilmore_girls/"
    },
    {
        "id": "1pbpjdn",
        "author": "Healthy_Birthday_135",
        "title": "Just wondering",
        "content": "Posting this here because my Karma is too low for r/strangerthings.\n\nWhat main character has done the least in terms of helping the group, screentime or just not been doing much in general.\n\nIm just wondering because peoples favorite characters are very split among fans. But who has done the least for the group/party.\n\nFor me its. (Some of yall are gonna dissagree)\n\nWill. I find it hard to think about something that will has actually done. I know that he can feel the monsters thay may help but in terms of helping the group or doing plans he really has not done much. I also always think that he conplains a lot.\n\nJonathan. I liked him from s1-s2 but after that he is basically just there to compete with Steve and does not do much else.\n\nMax. YES i like Max very much as a character. The only thing i can think of that she did that was helpfull was to lead the group to Vecna but other than that she has not done that much except for being cocky and dumping Lucas for no reason.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbpjdn/just_wondering/"
    }
]