[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 477,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 119,
        "comments": 5781,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gyhqsm",
        "author": "waseijin",
        "title": "They killed a Goat in a japanese reality show",
        "content": "There is a reality show in Japan called \"Ai no Sato\".\nIn Season 2, they brought a miniature goat into an old, rotting house with no vet or specialist.\nAfter a month outside on a cold winter night, with little or no food, the miniature goat died.\nIt's unbelievable, absurd, and unrealistic.\nJapanese production company are terrible, but for Netflix to approve this and release the show is crazy.\nI contacted support and cancelled my subscription.\nI can't believe they would kill animals like this.\nI'm so angry rn...",
        "upvotes": 292,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1gyhqsm/they_killed_a_goat_in_a_japanese_reality_show/"
    },
    {
        "id": "1gz46v1",
        "author": "Original2021",
        "title": "Kudos to the cast of The Piano Lesson",
        "content": "I wasn't familiar with the play but decided to watch the movie anyway. The cast was fantastic. The woman who plays Beatrice and the lead actor both deserve Oscar nods along with best cast ensemble.  Samuel Jackson is always reliable but the whole cast was really memorable. The plot was a little slow moving in the beginning but the cast really carried the film well. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gz46v1/kudos_to_the_cast_of_the_piano_lesson/"
    },
    {
        "id": "1gyklsn",
        "author": "philomatic",
        "title": "A man on the inside",
        "content": "Show by Michael Schur starring Ted Danson\n\nJust finished it and it was great. I was expecting it to be 80% comedy, but I’d say it’s more 50% comedy and 50% feeling with a mystery built in. I’d say similar to the final couple seasons of The Good Place.\n\nI was not expecting to like it as much as I did. ",
        "upvotes": 40,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gyklsn/a_man_on_the_inside/"
    },
    {
        "id": "1gz5yuh",
        "author": "HipsLikeHunie",
        "title": "Error Code",
        "content": "I’m getting an error code every time I try to boot on my Vizio smart tv but I can’t find that error code anywhere even in the Netflix website. tvq-st-132 it’s working fine on multiple phones but the tv keeps giving this error code along with “Something went wrong. Please try again later”",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5yuh/error_code/"
    },
    {
        "id": "1gz5nep",
        "author": "cloudiestmind",
        "title": "Cannot Airplay Netflix and other streaming services",
        "content": "Hello! I just bought a projector that works with Airplay but when i try to stream from Netflix, Prime Video, Mubi and others it doesn’t work. Youtube and other random videos do. Is there any way to fix it? If not, can I still stream on it by connecting my laptop with an hdmi cable? Thanks for your answers ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5nep/cannot_airplay_netflix_and_other_streaming/"
    },
    {
        "id": "1gz4vpx",
        "author": "BigCheetah6345",
        "title": "Video doesn't run in hd ",
        "content": "So i just got netflix subscription and it doesn't run videos on 1080p even though my phone is capable of it it just runs on 480p it is very annoying does anyone have a solution.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gz4vpx/video_doesnt_run_in_hd/"
    },
    {
        "id": "1gybd2g",
        "author": "ChirrBirry",
        "title": "Arcane is EXCEPTIONAL ",
        "content": "I don’t just want more seasons of Arcane…I *need* it. This show fills a content gap I didn’t know could be satisfied. \n\nNormally I hate character development and over the top attempts to connect the viewer with characters, but Arcane makes the endeavor a pleasure. The animation style fills me with joy, it’s like when the first season of Avatar: The Last Airbender came out and we all had our jaws drop to the floor.\n\nI’ve never played a single second of LoL but now I’m fully immersed in a world that I’m pissed might come to an end as I finish the last episode of season 2. More please.",
        "upvotes": 90,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1gybd2g/arcane_is_exceptional/"
    },
    {
        "id": "1gz2v9c",
        "author": "ScifiCanadian",
        "title": "RECCOMEND MOVIES OR TVSHOWS ",
        "content": "I'm on a desperate watch to find another film to binge. Can you guys help me recdomended some shows or movies to watch? I don't have a specific preference however I did like shows such as The Good Place, cobra kai, and remember me. Maybe that can u help u guys with suggestions ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gz2v9c/reccomend_movies_or_tvshows/"
    },
    {
        "id": "1gyj58r",
        "author": "Proof_Cable_310",
        "title": "Any feel good stuff out there that's not Hallmark cheesy?",
        "content": "I feel enough toxicity, drama, and bad influence in the world as is. I'd like to escape that with some feel good tv. Ideally, no cake wars, nor anything \"off script\", nor reality. Any recommendations?",
        "upvotes": 21,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1gyj58r/any_feel_good_stuff_out_there_thats_not_hallmark/"
    },
    {
        "id": "1gz0v0z",
        "author": "Icy-Cartographer3314",
        "title": "Can’t do anything during the end of the show",
        "content": "This is a weirdly specific thing, and I have no clue why it happens. I have Netflix downloaded on my Xbox, and after I finish an episode of a show/movie when it reaches the end credits I can’t do anything. This is purely a Netflix issue because on all of my other apps like Hulu this isn’t a problem, and I can still exit out of Netflix through my Xbox, but while in Netflix I can’t back out, fast forward, rewind. Before it reaches the credits I can do all of these things with no issues, but as soon as it starts playing the ending theme for a show I’m locked. This makes it hard to watch things with my gf, and is a general hassle to deal with. Has anyone else had this issue and if so do you know how to fix it? Thank you!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gz0v0z/cant_do_anything_during_the_end_of_the_show/"
    },
    {
        "id": "1gz5qry",
        "author": "VINIJRFAN",
        "title": "Netflix keeps telling there are two many devices signed in ",
        "content": "Our house has the platinum subscription where they allow 4 devices to sign in, its used to be 4 devices until my mother signed in with her new ipad, now me and father keep going back and forth, since i would sign in with my device my father’s device would be signed out for some reason, and my father would sign in again with his device and my device will get signed out, i even entered one of the other devices signed into Netflix and clicked sign out and the problem would still occur, at this point there’s now way there is too many devices signed in but thats what Netflix tells me, unless I maybe didn’t do it right? please help y’all ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5qry/netflix_keeps_telling_there_are_two_many_devices/"
    },
    {
        "id": "1gyfyis",
        "author": "Senturos",
        "title": "Arcane... A fucking masterpeace!",
        "content": "Man, what to write about this show. Because well, I love it. I mean I've never played or will ever play League of Legends. But the characters, the story, it was all fucking perfect. I'm a 30-year-old man, and this shit brought me to tears. Every emotion I was meant to feel, I did.  \nAs a man, I'm not meant to, you know, feel these feelings out there, but with shows like this, I can. I remember swallowing nothing when a character was betrayed. I felt that same anger in my pit.\n\n  \nI know deep down there is more to this, and I can't wait to see where the story goes from here and what characters come out from it. But to the writing team and all those that made this show, hold your head up high because you guys did a top fucking job! The animation, the characters, the story was fucking on point all the time. Can't wait to see more from this team.",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gyfyis/arcane_a_fucking_masterpeace/"
    },
    {
        "id": "1gyy47w",
        "author": "itisnottherealme",
        "title": "Decent parental controls",
        "content": "There is a lot of good content on Netflix, and a lot of trash - all of which has a maturity rating.\n\nSurely it is not beyond the wit of Netflix to give decent granular parental controls, where I can allow or block content by category (e.g. Teen high school drama, nature documentary, spooky etc ...) as well as age rating. This type of web filter has been around for 20 years, so why not Netflix. I don't want to manually type in 1,000 titles to remove them from my children's profile.\n\nA 12 is rated purely for sex, violence and nudity - but the topic is often not appropriate for a 12 year old to watch.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyy47w/decent_parental_controls/"
    },
    {
        "id": "1gyvpa4",
        "author": "Offer_Euphoric",
        "title": "Hdr option not available ",
        "content": "My phone, an Oppo Reno 6 Pro, supports HDR, but the HDR option isn't available in my Netflix app, even though I'm subscribed to the highest plan. According to Netflix's website, phones like the Oppo Reno 5 do support HDR. Could this be a bug, or does anyone know any work around??",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyvpa4/hdr_option_not_available/"
    },
    {
        "id": "1gyunrb",
        "author": "TheMonoMew",
        "title": "Smart downloads never update on iOS",
        "content": "Title mostly, I enabled it so that I’d always have something to watch. It worked the first time and downloaded and filled up the storage limit I set, but now I’ve watched all of that and it won’t delete or download anything else! I increased the storage limit to 3 GB and it’s not even using 2 GB. I searched around for a bit but I didn’t find anyone else who had this issue. Manual downloads work fine, and there is almost 100 GB left on my phone so that should be no issue. I know iOS is pretty aggressive with background apps so I have background app refresh enabled for it as well. I have another app with the feature and I don’t think that one is working either. Does anyone have any advice? Thanks!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyunrb/smart_downloads_never_update_on_ios/"
    },
    {
        "id": "1gysix5",
        "author": "EiffelPower76",
        "title": "BSOD in Windows 11 with NetFlix on Google Chrome and nVIDIA GPU",
        "content": "Seems well known BSOD with Google Chrome and Netflix hasn't been solved, happened just last hour\n\nI know that disabling OpenGL hardware acceleration fixes the problem, but it is strange that this bug hasn't been fixed yet ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gysix5/bsod_in_windows_11_with_netflix_on_google_chrome/"
    },
    {
        "id": "1gyrajp",
        "author": "whitehawk295",
        "title": "Arcane Season 2 Preview Spoiler",
        "content": "I'm not sure if anyone knows how to suggest things to Netflix but I couldn't believe how big of a spoiler they put for the season 2 preview when you hover over Arcane. It's with Jinx and Vi when they are in those tunnels, so disappointing.\n\nPlease do not watch this preview it has massive spoilers!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyrajp/arcane_season_2_preview_spoiler/"
    },
    {
        "id": "1gymnp9",
        "author": "Playosaurus",
        "title": "Anyone Else Experiencing \"We are experiencing technical difficulties\" logging in?",
        "content": "Ive been been having login issues for the past 3 days. Every time I try to login using password or sign in code I get various technical difficulty messages. I called Netflix twice and they said they were having issues with browser login and devs were already trying to fix it. They said the Netflix app from the MS store should work but that doesnt either. They insisted TV were not having any issues, so I logged out of both TVs and my iphone and now they cant login either. \n\nI find it difficult to believe Netflix would be having this kind of issue for this long as:\n\na) Netflix availability page says that all services are up.\n\nb) I cant find any threads about this currently. You would think if browser, iphone, and TV logins were failing this would be talked about after a full day.\n\nI have to wonder since Ziply did a major upgrade in my area 2-3 days ago and I received a new IP address (on a whole new class A), am I somehow there is a routing error or Im being geoblocked or something.\n\nEvery other streaming service works fine. Im not having any issues at all other than Netflix. Ive cleared cookies, cache and rebooted. \n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gymnp9/anyone_else_experiencing_we_are_experiencing/"
    },
    {
        "id": "1gyn1s6",
        "author": "Mean_Ice8261",
        "title": "Searching for a Watch Buddy!",
        "content": "Hi.\nLooking for a watch buddy! \nIf you're into action movies, documentaries, or even MMA and boxing, let's team up for some great viewing sessions. \nHit me up if you're interested!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyn1s6/searching_for_a_watch_buddy/"
    },
    {
        "id": "1gz0pbs",
        "author": "Confused_Sean_",
        "title": "Opinion of Arcane",
        "content": "I really wanted to enjoy Arcane, i really did...\n\n(6 Episodes in)  \nI just started watching this show with my girlfriend. Even with being a gamer, I have zero experience with LOL. I see this show as a Animated Action Drama and do not care about the lore of the extended universe.\n\nThe Animation: absolutely stunning, and there is nothing like it. This may be the only reason I finish the show.\n\nOh my god.... who do you actually like in this show? Vander is so clearly a means to an end from the first time you see him. He IS the motivation, not a character. It is ridiculous how many overblown tropes are used in this show. Vi is pretty alright, but she is laser driven on one thing always and the plot is whatever is in her way. This show is murphys law in action as anything and everything goes wrong for these characters. Highs and Lows, breaks from tension.... that is what makes a show.\n\nHextech is the most refreshing part of the story because while the unlimited power thing is kind of an overdone trope, its well written. (Good job guys)\n\nYou know exactly what the characters are going to do before they even know it. Jinx is not a character, she is a plot device and magguffin. No.... actually, I really like the parts where Jinx goes nuts and snubs any chance of the story progressing...\n\nThe characters are always talking about the same damn thing throughout the whole season and don't learn a single thing. Maybe we could get the people from the underground actually doing something to help their people for once...\n\nAnd between these boring exchanges..... ACTION SCENE. I am willing to admit that unearned action scenes just simply don't do it for me. Some people do like that stuff, and its the least of my concerns.\n\nI feel like the show is holding me back from enjoying it at all times on purpose. This is a wild comparison, but it makes me feel like I'm watching Yellowstone at times. Lots of immature, irresponsible, and annoying characters.\n\nI don't mean to put people down for liking this show alot, but I just feel like it could be the best if done well.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gz0pbs/opinion_of_arcane/"
    },
    {
        "id": "1gyif7v",
        "author": "Pincg",
        "title": "Weird static when people talk in Dexter?",
        "content": "I’ve been watching Dexter and whenever people are having a somewhat quiet conversation, there’s a weird almost windy/static noise during speech. I’m assuming it’s increased volume to make the voices louder, but it sounds like the microphones fuzziness was also made even louder than the voices. What’s going on?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gyif7v/weird_static_when_people_talk_in_dexter/"
    },
    {
        "id": "1gy9z8l",
        "author": "PericardiumGold",
        "title": "Why the single or 3 episode releases? I miss when they would release a whole season so I could binge. Also years between seasons leaves me forgetting shows and what occurred.. ",
        "content": "Genuinely curious is it from a marketing standpoint or sales, to do these slow releases? Keeping people subscribed for longer if they are only present to view the show then cancel? \n\nI get that’s how it’s being done now (Amazon as well) ",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gy9z8l/why_the_single_or_3_episode_releases_i_miss_when/"
    },
    {
        "id": "1gxwsqf",
        "author": "Automatic-Attorney96",
        "title": "Movies and tv shows I love because of how bad they are ",
        "content": "",
        "upvotes": 37,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1gxwsqf/movies_and_tv_shows_i_love_because_of_how_bad/"
    },
    {
        "id": "1gyttta",
        "author": "johnruby",
        "title": "Season 2 of Arcane is visually stunning, but both the worldbuilding and storytelling are disappointing.",
        "content": "\\*Unpopular opinion warning\\*\n\nCurrently Arcane is the second most popular TV series on both Netflix and IMDB, with a dazzling IMDB score of 9/10, and I'm struggling to find negative reviews on mainstream forums - which really surprises me as Season 2 feels quite underwhelming to me.\n\nThe visual design and animation are still absolutely jaw-droppingly gorgeous. Some of them are even more breathtaking than the best frames in Season 1, which is an incredible achievement since Season 1 is already one of the most each-frame-a-paint shows I've ever watched.\n\nHowever, the disparity between the stunning art and the unconvincing worldbuilding, combined with the poor storytelling (especially in respect of Season 2) is equally staggering.\n\nBelow I'd like to elaborate (in a spoiler-free manner) on the major shortcomings preventing me from enjoying the show, despite its incredible visual achievement:\n\n**1. Mediocre worldbuilding**\n\nArcane's world is a mixture of steampunk and magic. However, the rules governing how this world operates - i.e., when magic comes into play and when normal physics prevail - are extremely unclear. The audience struggles to deduce, based on previous events in the show, whether a character will be severely harmed by an explosion or remain completely unscathed.\n\nAlso, the show fails to adequately depict the scale and operations of the various organizations and political entities that significantly impact the plot. The scheming and conflicts between these groups often feel either meaningless or ludicrous because the audience lacks a reliable way to determine each group's advantages, disadvantages, or the true extent of their capabilities.\n\nThis lack of clear underlying rules often obscures the stakes, making the plot or action scenes far less engaging. The audience cannot confidently assess whether legitimate danger or consequences are at hand, which renders character's survival, death or other development undeserved or unearned.\n\nIf this show were intended solely for a younger audience, then a somewhat disorganized fantacy world might be less of an issue. But it's apparent that the show takes itself very seriously, with ambitions to tackle adult themes and nuanced topics. From an adult's perspective, the most critical aspect of convincing worldbuilding is the presence of clear \"stake\", which must be grounded in a set of explicit or implied rules. Without consistent rules, all the consequences and developments become dubious and unengaging.\n\n**2. Horrendous storytelling**\n\nThere are far too many artificial dramas and tensions. Characters frequently argue with one aother for various nonsensical reasons, refusing to listen to even a single word of explanation from their counterparts. Their communication skills are unrealistically underdeveloped, making any tensions derived from such poor communication initially laughable, but later tiring and infuriating.\n\nIf these dramas were merely filler, they might be more tolerable. Unfortunately, these conflicts - whether infuratingly juvenile or jaw-droppingly asinine - often have a significant impact and major consequences on the plot, making any subsequent story and character developments stemming from these events unconvincing and eye-roll-inducing.\n\nAlso, its quite obvious that the director often priortizes creating visually stunning scenes over crafting a plausible story. Many incredibly well-drawn frames are the direct result of unbelievably foolish decisions or physically impossible manuveur. I frequently find myself quesitoning the integrity of Arcane's story and characters, wondering whether such developments make any sense or if they are simply director's attempt to create yet another wallpaper-worth piece of art.\n\n\\---\n\nWithout spoilers, the overall scale of the major conflict escalates significantly in the later episodes, particularly in the second half of Season 2. Sadly, even at the grand finale of Season 2, I found myself completely unable to care about any of the characters' fate. The issue is that, whenever I try to care, I immediately start questioning all the nonsensical decisions these characters have made to reach the current plot point. Eventually I just stopped caring altogether. Without engaging with the story, those beautiful frames feel meaningless and at times even exhausting.\n\nOverall, my score for this season is 5/10, a far cry from the general sentiment currently shared by most viewers, it seems. I would only recommend this show to those who love League of Legend's universe and are genuinely interested in exploring its lore further, or to those who can be entertained by a show solely for its visual design. The writing of Season 2 should be taught as a cautionary lesson in storytelling classes.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gyttta/season_2_of_arcane_is_visually_stunning_but_both/"
    },
    {
        "id": "1gyjxpe",
        "author": "FeistyBat3571",
        "title": "1 account, 2 profiles, watch different shows simultaneously ?",
        "content": "hi, im new to Netflix in general.\n\njust need some clarification around the sharing rules.\n\ni currently have the Premium plan and im trying to share this with my family.\n\ni have 1 account and 2 profiles for this.\n\nis it possible to stream 2 different shows simultaneously on those 2 profiles (different devices and same household obviously) without affecting each other?\n\nor does it limit it to the same show even for both profiles*?\n\nthanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyjxpe/1_account_2_profiles_watch_different_shows/"
    },
    {
        "id": "1gyjubt",
        "author": "Proof_Cable_310",
        "title": "Fatherhood",
        "content": "Just started episode 1, and only a few minutes into it. But, I have to commend the show for the tasteful sound appeal. A woman's delivery of her baby (one of the most horrid sounds to hear) was simply a few soft spoken words, and when the baby started to cry, soft music faded in over the cries. They made this scene literally music to my ears, instead of an anxiety enducing experience that's hard to listen to or watch. I wish more shows were like this.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyjubt/fatherhood/"
    },
    {
        "id": "1gyj7sm",
        "author": "Afraid-Profession395",
        "title": "Penelope: the ending ",
        "content": "I powered through the episodes hoping I would get more out of each one, and really thought it was going somewhere in the last episode, but I felt it was a completely empty ending.\n\nWhat do you think happened after End Scene?\n- did she go back to surviving on her own\n- did she go back home after one of her parents died\n- did she stick around in that little random town to be unknown but helpful for what she had learned\n- or something completely different?\n\nI would like to hope if she went back into the woods she at least reached out to her family to let them know and stop being so selfish about not letting them know. But I really don’t know what to think\n\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyj7sm/penelope_the_ending/"
    },
    {
        "id": "1gy338w",
        "author": "Fishersalt",
        "title": "Any way to save frames?",
        "content": "Maybe a stupid question, but there’s a specific scene in the series Arcane that I desperately want as my wallpaper on my phone and PC, but I have no idea how to save said frame. I obviously can’t screenshot it, so how do I go about it? I’ve tried searching for the frame online but to no avail. ",
        "upvotes": 10,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gy338w/any_way_to_save_frames/"
    },
    {
        "id": "1gyqazf",
        "author": "marcikaa78",
        "title": "Weird black cover",
        "content": "What are these blank Netflix cover placeholders?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gyqazf/weird_black_cover/"
    },
    {
        "id": "1gy8yxd",
        "author": "Desperate_Carry_8422",
        "title": "Account issue advice ",
        "content": "Hi all, really weird one here. \n\nBusy day done and wanted to relax and Netflix. I then find that I've been signed out, password is wrong so I reset. \n\nI log back in and it says continue sign-up. \n\nBut...\n\nI've had an account for years, never missed a payment, last Payment left my account 7 days ago as usual. \n\nBut I follow the prompts and it's asking for payment again. \n\nI've had a really bad day today and this is a frustrating mess. \n\nThanks all.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gy8yxd/account_issue_advice/"
    }
]