[
    {
        "id": "1quu150",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A’ - Olympique de Marseille U19 | UEFA Youth League, Round of 32",
        "content": "#FT: JUVENIL A 5:2 OM\n\n&amp;#x200B;\n\n#UEFA YOUTH LEAGUE \n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n1:0 Thiago Pitarch 17'\n\n1:1 Mohamed Baradji 25'\n\n2:1 Anis Doubal (own goal) 27'\n\n2:2 Tadjidine Mmadi (penalty) 42'\n\n3:2 Dani Yáñez (penalty) 53'\n\n4:2 Diego Martínez 'Beto' 80'\n\n5:2 Adri Pérez 90'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 17' - GOLLLLLL DEL JUVENIL A - Arnu steals the ball from their defensive midfielder, and quickly plays it to Thiago at the edge of the box. He takes a few quick touches to create space, and then cuts his shot across, low into the far corner\n\n⚽ 25' - goal for OM - Illia punches away a free kick poorly, then their player takes a shot and it hits the post - the ball bounces to Baradji, who takes a little touch, and Joan Martínez can't clear it off the line in time (and even then it would've bounced back into the net again), what a crazy and unfortunate goal\n\n⚽ 27' - GOLLLLLL DEL JUVENIL A - and right in the next attack, Fortea advances on the right wing - his powerful and low cross gets deflected into the near corner by Marseille's Doubal! \n\n42' - penalty for OM after a foul by Rivas \n\n⚽ 42' - Mmadi converts\n\nHT - half time in a very open match where most dangerous situations ended up being goals on both ends - the goals we conceded were entirely avoidable, and the team needs to pay special attention to defending set-pieces better or preventing them from happening in the first place\n\n46' - 2nd half underway \n\n51' - penalty for Juvenil A after Yáñez gets tripped in the box! \n\n⚽ 53' - GOLLLLLL DEL JUVENIL A - Yáñez takes it himself and converts! \n\n🔄 59' - Rivas and Cestero off for Valde and Beto \n\n🔄 71' - Yáñez off for Gabri Valero\n\n⚽ 80' - GOLLLLLL DEL JUVENIL A - golazo de Beto! free kick from around 20 metres out, and Diego Martínez strikes it right into the top corner on the goalkeeper's side of the goal! \n\n🔄 83' - last subs, Ciria and Arnu off for Adri Pérez and Jacobo\n\n⚽ 90' - GOLLLLL DEL JUVENIL A - and the cherry on top, after a dribble by Gabri Valero, he crosses the ball low into the box - it gets deflected towards the far post by the defender, where Adri appears to head it into the net\n\nFT - a calm and controlled second half by the team makes the match end with a comfortable scoreline - they had OM under control defensively much more than in the first half and pounced in the decisive moments in attack. We will get to know the opponents in the Round of 16 and the possible path through the rest of the tournament on Friday\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee:** Sam Barrott (ENG) \n\n**Competition:** UEFA Youth League, Round of 32\n\n**Viewing options:** [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-3-3):** Illia Voloshyn - Diego Aguado, Mario Rivas (59' Victor Valdepeñas 'Valde'), Joan Martínez, Jesús Fortea - Jorge Cestero (Diego Martínez 'Beto'), Carlos Díez, Thiago Pitarch - Alexis Ciria (83' Adri Pérez), Adrián Arnuncio ‘Arnu’ (83'' Jacobo Ortega), Dani Yáñez (71' Gabri Valero)\n\nBench: Álvaro González (GK), Melvin Ukpeigbe, Álvaro Lezcano, Pol Durán. \n\nCoach: Álvaro López\n",
        "upvotes": 8,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wUOMl6hwPl_tsdwHAtAtno0xMvZE8h1UdSt0wFAsSbg.jpeg?auto=webp&amp;s=da678670992586a213164525827e56adb279d53a"
        },
        "permalink": "/r/realmadrid/comments/1quu150/match_thread_real_madrid_juvenil_a_olympique_de/"
    },
    {
        "id": "1qts1ud",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 11,
        "comments": 1474,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qts1ud/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qxxowi",
        "author": "nogokeo",
        "title": "Raúl #7 𝐸𝑙 𝐴́𝑛𝑔𝑒𝑙 𝑑𝑒 𝑀𝑎𝑑𝑟𝑖𝑑 2002 Centenary Season",
        "content": "",
        "upvotes": 39,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxxowi/raúl_7_𝐸𝑙_𝐴𝑛𝑔𝑒𝑙_𝑑𝑒_𝑀𝑎𝑑𝑟𝑖𝑑_2002_centenary_season/"
    },
    {
        "id": "1qxc4qx",
        "author": "laman-78",
        "title": "1% of Vini Jrs Stats",
        "content": "",
        "upvotes": 534,
        "comments": 204,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxc4qx/1_of_vini_jrs_stats/"
    },
    {
        "id": "1qxyuex",
        "author": "Galego_ACB",
        "title": "ACB paid tribute to Walter Szczerbiak on the 50th anniversary of his scoring record of 65 points in the Spanish league with Real Madrid (and in an era with no threes)",
        "content": "",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxyuex/acb_paid_tribute_to_walter_szczerbiak_on_the_50th/"
    },
    {
        "id": "1qxm9z7",
        "author": "Constant-Gas8234",
        "title": "Where can i find a hi-res photo of this",
        "content": "Yooh hi i was asking where i could get a high quality photo of this screenshot i took while watching the real madrid documentary of the champions league final where u can see vini walking out and the cameraman gets the shot from behind i have been looking for it for ages now but i cant seem to find it online.thanks",
        "upvotes": 61,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vxxtfr23iwhg1.jpeg?auto=webp&amp;s=867fa423aec8b85017dbf8fcd4f6303b5f29c3f1"
        },
        "permalink": "/r/realmadrid/comments/1qxm9z7/where_can_i_find_a_hires_photo_of_this/"
    },
    {
        "id": "1qxfue1",
        "author": "johnmason125",
        "title": "The contradiction between transfers and the reality of football",
        "content": "Football is a very short lived sport. Managers nowadays barely last more than two seasons, after two losses in a row it´s crisis, what happened the season before doesn´t really count, what could potentially happen in two years after also doesn\\`t.  Real Madrid is probably the pinnacle of that.\n\nOn the other side more and more big clubs are signing project players. Players who obviously have talent, but who are still raw and who still need a bit of time. So Real Madrid signed the likes of Vinicius, Rodrygo, Reinier, Endrick, Mastantuono, Camavinga, Hujisen. Man City signed the likes of Khusanov, Victor Reis, Doku, Savinho. Chelsea signed so many like talented 20 year olds, they are basically hoarding talent.\n\nNow this works as long as there is an experienced core of players around kind of leading them. So Real Madrid were fine when the likes of Kroos, Modric, a fit version of Carvajal, Benzema...were still around. It actually looked like they got the transition spot on. Man City were fine when they still had De Bruyne, Walker, the peak versions of Ruben Dias and Rodri leading the team. \n\nProblems start when the experienced core of players is starting to fail. In Real Madrid´s case the current experienced core of players age wise (apart from Courtois) is Carvajal, Alaba, Rüdiger, Mendy, maybe Ceballos. 4 players who have had massive injury issues and one player who has never really been more than a squad player. After that you have the likes of Militao and Trent, who have also had big injury problems this season. The oldest outfield player who is actually playing is Valverde at 27. \n\n3 of Real Madrid´s back four currently are Carreras, Hujisen and Asencio. I´m happy all three of them are at the club, I think they could all have good careers at the club but they probably shouldn´t be starting together at this point in their career. \n\nCompare that to the Champions League winning sides of Real Madrid in the last 15 years. The youngest starting 11 in a final was the la decima starting eleven and the average age was 26.7 years and it would have been older if Xabi Alonso hadn´t been suspended and Pepe had been fit to start. \n\n",
        "upvotes": 35,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxfue1/the_contradiction_between_transfers_and_the/"
    },
    {
        "id": "1qx7jd8",
        "author": "Moreplatesmoregains",
        "title": "Franco mastantono is not good to be starting games ahead of anyone.",
        "content": "I have been focusing on Franco lately and everytime i notice more and more that he is an average player at best, he has potential to be very good but i can’t see anything special about him.. his touches on the ball sometimes are very bad .. decision making is horrendous.. he has given us sometimes glimpses and nice passes but we all know this nothing so special.. we have made a mistake with sending endrick on loan and leaving him , it should have been the opposite. I personally think endrick will do a better job than him on rw or even arda is more dangerous on rw.. he may has the pressing thing better than others and that’s why arbeloa and even xabi likes to start him. But i think this transfer window we should have bought someone a bit better and a natural rw .. i maybe wrong in the future i hope im wrong and he will succeed and be our next Di maria.",
        "upvotes": 134,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qx7jd8/franco_mastantono_is_not_good_to_be_starting/"
    },
    {
        "id": "1qwoj73",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler; Real Madrid’s best in Pintus’ fitness test. Finished FIRST in the demanding physical assessments on Wednesday. He even increases intensity after halftime: +8% sprints and +6% sprint distance compared to first half showing elite recovery, explosiveness, and energy management.",
        "content": "",
        "upvotes": 921,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O2SZFVPZv0GoxxlnSBynhh8-z99C7J-FoEATLEFJ5cs.jpeg?auto=webp&amp;s=7eecb3e76694426aff94b802d999bc231be74e5c"
        },
        "permalink": "/r/realmadrid/comments/1qwoj73/arda_güler_real_madrids_best_in_pintus_fitness/"
    },
    {
        "id": "1qwvmlg",
        "author": "Majestic-Nobody-3178",
        "title": "Casemiro is the only Top-7 League Midfielder with more interceptions than Chema Andres this season. Seems like this guy is a bigger talent than we thought.",
        "content": "",
        "upvotes": 308,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/23570t1tdqhg1.jpeg?auto=webp&amp;s=134a9387870c394adecd6506ea1c6e5a5fb82b9a"
        },
        "permalink": "/r/realmadrid/comments/1qwvmlg/casemiro_is_the_only_top7_league_midfielder_with/"
    },
    {
        "id": "1qwu0bc",
        "author": "ceaguila84",
        "title": "Real Madrid’s Rodrygo to miss Champions League play-off games due to two-match ban",
        "content": "",
        "upvotes": 219,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LrwqQuLFm9mfTHL6Wj8IEDwxy9fRwlASKWfxRmLb3eA.jpeg?auto=webp&amp;s=a765f0dd4e6c4ceed30fb9815941ccf60838e8d0"
        },
        "permalink": "/r/realmadrid/comments/1qwu0bc/real_madrids_rodrygo_to_miss_champions_league/"
    },
    {
        "id": "1qwrcrw",
        "author": "InspectorExact3836",
        "title": "Real Madrid has uploaded all 451 Goals scored by Ronaldo for club on its youtube channel on his 41st birthday",
        "content": "",
        "upvotes": 277,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j0S-q1A6cMxg7OgB-f8LPojvvDV5Jig9iGfaJP5jpt0.jpeg?auto=webp&amp;s=474066fe5f0a73690646195ed1e5bf5be893c5eb"
        },
        "permalink": "/r/realmadrid/comments/1qwrcrw/real_madrid_has_uploaded_all_451_goals_scored_by/"
    },
    {
        "id": "1qx1lc2",
        "author": "redsox490",
        "title": "Real Madrid Femenino lost 4-0 today to Barcelona in the Copa de la Reina quarterfinals.",
        "content": "[https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026](https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026)\n\nI feel like I'm one of the only ones on this reddit page to actually care about them. I saw no mention that it was even happening to I thought I would share the news with you all about the loss today.\n\nReal Madrid Femenino have not won a trophy yet. The 2020–21 season was their first season. This was the 22nd meeting of the women's Clásico and Real Madrid has only won once. The matches are very rarely close. Real Madrid has scored 10 goals and given up 77. So as a fan who watches the matches, they are pretty painful to watch to be honest.",
        "upvotes": 72,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yc6jWBIjobAAXLF_Yql6gsiOM9FvKsdZ8_NTxhB642g.jpeg?auto=webp&amp;s=fd65298b33c5f21ae660c6822ff956476c847634"
        },
        "permalink": "/r/realmadrid/comments/1qx1lc2/real_madrid_femenino_lost_40_today_to_barcelona/"
    },
    {
        "id": "1qwo77y",
        "author": "AlekhineAl",
        "title": "Still in awe of this goal. Every player showcasing his best trait.",
        "content": "",
        "upvotes": 294,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6s5u6b052phg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwo77y/still_in_awe_of_this_goal_every_player_showcasing/"
    },
    {
        "id": "1qwybni",
        "author": "Unique_Sentence_7983",
        "title": "Real Madrid locker room after benfica loss🤣🤣",
        "content": "",
        "upvotes": 66,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5s1oy8pruqhg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwybni/real_madrid_locker_room_after_benfica_loss/"
    },
    {
        "id": "1qwpejw",
        "author": "asensia-kopfschmerz",
        "title": "[Cadena SER] \"The club believes Xabi Alonso's legacy was a disaster in physical aspect\" Los blancos is betting everything on physical fitness.",
        "content": "",
        "upvotes": 156,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vzydaF2Ft1rm6VXQ7c_jkVpcVFwz9qZeF7E-7ZZmwBc.jpeg?auto=webp&amp;s=ac0816abe35379e3eb7dc0f57a576d31a5677c1d"
        },
        "permalink": "/r/realmadrid/comments/1qwpejw/cadena_ser_the_club_believes_xabi_alonsos_legacy/"
    },
    {
        "id": "1qx1nix",
        "author": "Galego_ACB",
        "title": "Real Madrid lost against Dubai (93-85) in an away game in round 27 of the Euroleague's regular season",
        "content": "",
        "upvotes": 32,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qx1nix/real_madrid_lost_against_dubai_9385_in_an_away/"
    },
    {
        "id": "1qw1adt",
        "author": "soldier101br",
        "title": "Endrick Goal against Laval on Coup de France",
        "content": "",
        "upvotes": 4449,
        "comments": 249,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r30yq9nznjhg1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw1adt/endrick_goal_against_laval_on_coup_de_france/"
    },
    {
        "id": "1qwafcg",
        "author": "soldier101br",
        "title": "Alternative angle of Endrick's Golazo on Coup de France",
        "content": "",
        "upvotes": 1137,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t3zspxjsjlhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwafcg/alternative_angle_of_endricks_golazo_on_coup_de/"
    },
    {
        "id": "1qw2xtb",
        "author": "Modo97",
        "title": "Just a reminder: we signed Reinier for €30 million, and he didn’t play a single minute with the first team.",
        "content": "It’s insane how forgotten this transfer is. When people talk about Real Madrid’s worst signings, they mention Hazard, Jovic, Illarramendi, Woodgate, Danilo, Kaka, James, etc — but never Reinier. Not out of ignorance, but because the player is forgotten to that extent.\n\n€30 million for a player who never played a single minute for the first team is embarrassing and almost comical. Easily a top-five worst signing in the club’s history.\n\nAnyways.. he’s still only 24. I hope he manages to find himself again. Maybe he’ll get another chance to play in Europe.",
        "upvotes": 1030,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tby0jtyyjhg1.jpeg?auto=webp&amp;s=1702ce80c7ba02024ad30a7b200cc9f312ed94f9"
        },
        "permalink": "/r/realmadrid/comments/1qw2xtb/just_a_reminder_we_signed_reinier_for_30_million/"
    },
    {
        "id": "1qw9qgw",
        "author": "Maravilla_23",
        "title": "And this exactly why we need the Special One back at the Bernabeu!",
        "content": "",
        "upvotes": 287,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/umwhqzw2elhg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw9qgw/and_this_exactly_why_we_need_the_special_one_back/"
    },
    {
        "id": "1qvyuys",
        "author": "Resident-Stretch9723",
        "title": "Happy 41st Birthday!!",
        "content": "",
        "upvotes": 985,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dt010ecu7jhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qvyuys/happy_41st_birthday/"
    },
    {
        "id": "1qw1d1k",
        "author": "Goat23231",
        "title": "Mbappe watching Endrick",
        "content": "",
        "upvotes": 597,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xjbdbp1hojhg1.jpeg?auto=webp&amp;s=588e6c9ee881fdf72ccbffbf44440bc57feb218e"
        },
        "permalink": "/r/realmadrid/comments/1qw1d1k/mbappe_watching_endrick/"
    },
    {
        "id": "1qwdw1d",
        "author": "asensia-kopfschmerz",
        "title": "\"The club doesn't approve of players changing positions so much.\" \"The other day, with two left-backs, Camavinga played...\" \"Florentino blocked Fran García's departure\"",
        "content": "",
        "upvotes": 86,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwdw1d/the_club_doesnt_approve_of_players_changing/"
    },
    {
        "id": "1qw46b8",
        "author": "More-Judgment-9253",
        "title": "Thiago Pitarch vs Marseille (Man of the Match)",
        "content": "",
        "upvotes": 170,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6j6puwne7khg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw46b8/thiago_pitarch_vs_marseille_man_of_the_match/"
    },
    {
        "id": "1qxnzf9",
        "author": "Actual_Box7731",
        "title": "i see a lot of people under the comments in RM social media are mad and complaining about Madrid not making CR7 a birthday post, what do you think about this?",
        "content": "For example Juventus and ManU both made a birthday post but Madrid didnt this year, and now the comments under the social media of RM is full of people just being mad/complaining even cursing RM because of that? Is it really that deep or like just overreaction by the fans? Or should i say \"fans\" which are just CR7 fans.",
        "upvotes": 0,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxnzf9/i_see_a_lot_of_people_under_the_comments_in_rm/"
    },
    {
        "id": "1qwcpv5",
        "author": "Upper_Coyote312",
        "title": "Board is  so clueless",
        "content": "Still can’t believe we spent all that money on Franco and did not bother getting a central midfielder after the season we had with ancelotti last season. Is like Perez does not even watch our games or understand anything. And now Franco is even struggling . Zubimendi was there for the taking but we let him leave arsenal and look how he is flourishing.",
        "upvotes": 48,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwcpv5/board_is_so_clueless/"
    },
    {
        "id": "1qvvtz5",
        "author": "asensia-kopfschmerz",
        "title": "[Cadena SER] Arbeloa SHOCKED the group by not playing Ceballos against Benfica and they told Arbeloa about it. The press conference against Rayo was delayed due to DISAGREEMENTS with the coach. \"They live as if they were being coached by an interim manager\"",
        "content": "",
        "upvotes": 382,
        "comments": 107,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvvtz5/cadena_ser_arbeloa_shocked_the_group_by_not/"
    },
    {
        "id": "1qwa1gg",
        "author": "Short_Mousse_6812",
        "title": "What can we do with the CAM position?",
        "content": "I think it is obvious we have too many similar profiles, but this area is just overwhelmed. Bellingham, Brahim, Mastantuono, Guler and soon Nico Paz. We have too many players who thrive the best at that position. And the other problem is that they perform horribly if put at a different position. Bellingham hasn’t been the same since he was given defensive responsibility and was dropped deeper. Guler has amazing vision, but has little impact when playing deep in the midfield. Brahim and Mastantuono are bench players, but who are not quite good at wingers to constantly play there. Brahim will probably be sold and Mastantuono may get loaned out. And most importantly, Guler and Bellingham can’t work together which will definitely be hard to deal with.",
        "upvotes": 18,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwa1gg/what_can_we_do_with_the_cam_position/"
    },
    {
        "id": "1qvm92c",
        "author": "Agreeable-Stage-6896",
        "title": "How Simone Inzaghi would be an underrated alternative for Real Madrid",
        "content": "I think Simone Inzaghi should be a serious contender for a future Real Madrid manager, if Arbeloa leaves this summer. And if not then, further ahead in the future.\n\nUnlike Tuchel, Emery, and Klopp, who are the most common names circulating, his system does not revolve around a high press, which we realistically will never get with our current squad.\n\nInstead of high pressing, he focuses on defensive shape and structure, similar to how Ancelotti would ask our CB’s and Mendy to stay back while allowing our front three more freedom. His system is filled with quick vertical football and counters, which would suit our pace and speed offensively. Most Real Madrid fans probably thought of him as a manager while watching the Inter Milan vs Barcelona matchup in the Champions League. Last but not least, his system does not revolve around possession, which helps hide the fact that we clearly lack a tempo setter and have more of a physical than technical midfield.\n\nHe is extremely pragmatic in the way he sets his teams up and truly a big game manager. Having taken an aging Inter Milan side to two Champions League finals in four years, drawn against us with Al Hilal, and even beaten Manchester City with them. His personality is calm and collected and likely would not cause the same friction as managers like Conte or Tuchel.\n\nLooking at the managerial market for next summer, he is probably the top level coach least dependent on high pressing football and heavy possession, aside from Ancelotti after the Brazil job. For those reasons, I think these factors make him a realistic fit for Real Madrid.\n\nThoughts?\n\nEDIT:\n\nIt seems many people claim that he has underachieved in the league, and while I understand that argument, Serie A is far less predictable than La Liga. Even Carlo Ancelotti, who had an amazing European career with AC Milan, did not dominate Serie A in the same way.\n\nAs for comparisons with managers such as Tuchel and Klopp, the intention of this post was to highlight tactical compatibility with our current squad. I believe Inzaghi could start winning with only minor additions, whereas the others would likely require a full rebuild for heavy pressing system like gegenpressing. I personally cannot see Klopp returning to management anytime soon, and I do not believe Tuchel would be willing to work here given his previous tensions with mbappe at PSG and potentially with Bellingham in England (depending on how the World Cup goes and whether he starts regularly).",
        "upvotes": 186,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvm92c/how_simone_inzaghi_would_be_an_underrated/"
    }
]