[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 84,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m2rxhc",
        "author": "Ok_Cobbler4575",
        "title": "Trainwreck Balloon Boy “Hoax”",
        "content": "The minute they said they were on Wife Swipe, their whole performance made sense. It's wild what people will do for attention. Guess it's working, they're getting even more of it now. 🤷🏻‍♀️",
        "upvotes": 65,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1m2rxhc/trainwreck_balloon_boy_hoax/"
    },
    {
        "id": "1m2k0j6",
        "author": "hdsd_",
        "title": "Thoughts on the new Netflix layout? I think it sucks.",
        "content": "Now I can only see like 1-3 titles at a time. The best part is when you're scrolling with friends to pick a movie in the old layout, someone will something in the corner of the screen and they go pick that one! Now, we literally have to look at one movie at a time, takes MUCH longer to find something. Not a fan, at all.",
        "upvotes": 49,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2k0j6/thoughts_on_the_new_netflix_layout_i_think_it/"
    },
    {
        "id": "1m2oaix",
        "author": "ToonAdventure",
        "title": "‘Captain Planet’ Live-Action Series In Works At Netflix From Berlanti Productions &amp; Appian Way",
        "content": "",
        "upvotes": 24,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m2oaix/captain_planet_liveaction_series_in_works_at/"
    },
    {
        "id": "1m2a2tc",
        "author": "shmu_",
        "title": "Assassin's Creed confirmed for live-action Netflix adaptation",
        "content": "",
        "upvotes": 60,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1m2a2tc/assassins_creed_confirmed_for_liveaction_netflix/"
    },
    {
        "id": "1m2tvlh",
        "author": "deneester",
        "title": "Building the Band!!! Ep: 1-7",
        "content": "Surprisingly, I'm actually really liking Building the Band because it's a little more authentic than I expected, with the ability for the kids to pick their own groups (minus the fact that they only have 6 groups so timing matters....hope they change that in the future and then cut off how ever many that they need to with the first round of group performances. )\n\nIf 3Quency does not stay together, I'll be ticked because their voices blend so well in harmony. Their only other job is to get along, which they appear to be doing so far.\n\nWhatever group Alison is in, I think we all feel like the other two girls joined because it was Band #6 and there weren't other choices. She can sing but she's pretty much insufferable. \n\nSZN4 - not a huge fan of the band name but they are my faves for sure! That unique mixture of people....the beatiful strong voices of all of them (especially Cam but they all sound great,) Donzel's positive energy...so many more things that I can say about these kids but I love it.\n\nThe only other band that I really like (after SZN4 and 3Quency) is Soulidified. They have more work to do but all of them are so precious and so far have won my heart. 🤎\n\nIn the chaotic boy band (Million Miles to Wherever the Heck They are Going) I really like the mop haired Aussie. His personality is so cool and they can all sing. I do agree with people who have said that the tatted guy and his narcissistic Alison mean girl fling might be actors. Hope not but they are capturing some horrific moments so maybe it's for film.\n\nLastly, now I realize why Nicole left The Masked Singer. Smart move, girl. I've heard Netflix pays well and if this turns out to be a hit, you will be the superstar of the show and the money will keep on multiplying. Same with Queen Kelly leaving The Voice AUS. Wish I had their managers lol",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m2tvlh/building_the_band_ep_17/"
    },
    {
        "id": "1m2xbpq",
        "author": "Flowerofthesouth88",
        "title": "Are there any Netflix Trainwreck documentary episodes that you hope they will make in The future?",
        "content": "I would like to see them making The infamous Glasgow Willy Wonka chocolate factory scam, where they Interview The three actors who play Willy Wonka, The depressing Oompa Loompas, and The unknown, As well as The public who went to The event, and  The police will got calls from The public and get them interviewed too as they reaction on The calls? 😂",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2xbpq/are_there_any_netflix_trainwreck_documentary/"
    },
    {
        "id": "1m2t049",
        "author": "tinylittlepixel334",
        "title": "Generative AI makes its debut on Netflix with Argentine TV series The Eternaut",
        "content": "\"The specific sequence, confirmed by Netflix co-CEO Ted Sarandos, features a dramatic building collapse in Buenos Aires. Sarandos explained that generative AI allowed the show’s production team to complete this complex visual effect ten times faster than traditional methods, making it financially feasible for the project’s budget.\"\n\nVia: [https://techissuestoday.com/generative-ai-makes-its-debut-on-netflix-with-argentine-tv-series-the-eternaut/](https://techissuestoday.com/generative-ai-makes-its-debut-on-netflix-with-argentine-tv-series-the-eternaut/)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m2t049/generative_ai_makes_its_debut_on_netflix_with/"
    },
    {
        "id": "1m2p6xp",
        "author": "Stabbyunicorny42",
        "title": "Trainwreck: Balloon Boy",
        "content": "This is way out of left field buuuut…\n\nDoes anyone by chance know the type of chess board the Heene’s lawyer David Lane is playing with about halfway through?  TIA Reddit warriors ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2p6xp/trainwreck_balloon_boy/"
    },
    {
        "id": "1m2w5vt",
        "author": "_GrumpySam",
        "title": "Standard with Ads with extra member?",
        "content": "Im looking to decrease my monthly subscription. \n\nI want to go down to standard with ads. \n\nI have an extra member on my account. \n\nIs this going to affect that?\n\nThanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2w5vt/standard_with_ads_with_extra_member/"
    },
    {
        "id": "1m2vil8",
        "author": "Atlast_2091",
        "title": "Wall to Wall | Now Playing | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2vil8/wall_to_wall_now_playing_netflix_eng_sub/"
    },
    {
        "id": "1m2ksk6",
        "author": "Maximum-Wear4068",
        "title": "This needs to be release in theatres K-POP DEMON HUNTERS",
        "content": "Guys we should literally file a petition to release this movie in world wide theatres!!! Netflix I really love this movie and I am able to get over all song and I know u too Soo plsss release this in theatres!!!",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ksk6/this_needs_to_be_release_in_theatres_kpop_demon/"
    },
    {
        "id": "1m2uuod",
        "author": "BoyMold",
        "title": "is it just me??",
        "content": "anyone else have a problem with setting a household? i’m logged in on two tvs, one of them is apparently not in the household and when i try to fix it, i don’t get any sort of link like i used to. i used to get them by text and/or email and now i get nothing, no matter how many times i click to receive the link. \ni checked multiple times that both my phone number and my email are verified, and nothing seems to work. i’m now starting to wonder if this is a just-me problem or if that’s been an ongoing issue with netflix ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2uuod/is_it_just_me/"
    },
    {
        "id": "1m2ddql",
        "author": "PM_0891",
        "title": "'Owning Manhattan' Season 2 drops Dec. 5!",
        "content": "Ryan Serhant just announced that Season 2 of 'Owning Manhattan' is coming Dec. 5!  \n  \nHere's an incredible profile I read about him that talks about his rise from broke actor to real estate mogul, how he built his media machine, and the psychology that drives him. It might give you a whole new perspective on who he really is.\n\n[https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile](https://www.readtheprofile.com/p/ryan-serhant-owning-manhattan-profile)",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ddql/owning_manhattan_season_2_drops_dec_5/"
    },
    {
        "id": "1m1bshr",
        "author": "Longjumping_Land_977",
        "title": "Netflix releases series about baffling case of woman who disappeared on a cruise ship",
        "content": "",
        "upvotes": 1377,
        "comments": 494,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bshr/netflix_releases_series_about_baffling_case_of/"
    },
    {
        "id": "1m2dl7d",
        "author": "cardsrealm",
        "title": "Analysis of Ángela (Netflix) and how the series portrays the violence women face",
        "content": "Released in July 2024 in Spain and arriving on Netflix in Brazil and Mexico in mid-2025, Ángela is a suspense miniseries directed by Tito López-Amado and starring Verónica Sánchez.\n\nThe series, adapted from the British thriller Angela Black (2021), was written by Sara Cano and Paula Fabra and is composed of six episodes.\n\nSet in typical Spanish daily life, Ángela follows a woman leading what appears to be a perfect life (a stable marriage, two daughters, financial comfort) while hiding a severe history of emotional and physical abuse inflicted by her husband.\n\nThe turning point comes with the arrival of Edu (Jaime Zataráin), a childhood friend who appears to offer a possible way out. However, things do not unfold as you might expect.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2dl7d/analysis_of_ángela_netflix_and_how_the_series/"
    },
    {
        "id": "1m2vv8l",
        "author": "expat-turtle32",
        "title": "Black Summer is still good",
        "content": "I don't understand the hate - probably from fans of TWD who never appreciate a Z plot that doesn't have 9 year olds backflipping off of roof tops and akimbo'ing 6 zombies in the process. \n\nFor me, it was realistic for what a Z apocalypse could be like: brutal. \n\nFor those that hated it: sorry, maybe John Cena can be in the next one. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m2vv8l/black_summer_is_still_good/"
    },
    {
        "id": "1m288sz",
        "author": "PaperFennKhat",
        "title": "Papercraft Sussy Bird from KPop Demon Hunters",
        "content": "To go with my previous Derpy Tiger!",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m288sz/papercraft_sussy_bird_from_kpop_demon_hunters/"
    },
    {
        "id": "1m2me98",
        "author": "Historical-Echo316",
        "title": "Best new crime docs ?",
        "content": "So having watched ...\n\n•Trainwreck : balloonboy \n•Amy Bradley is missing \n•A Deadly American marriage \n\nIt got me thinking what are some other new releases similar to these ? \n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2me98/best_new_crime_docs/"
    },
    {
        "id": "1m2qy95",
        "author": "Any_Bench_5798",
        "title": "Where is Unxplained season 7?",
        "content": "They decided to remove season 7 for some reason. It was there a week ago. Is there anywhere else I can watch it? \n\nWords so I can get past the character limit:\nBlah blah blah blah blah blah blah blah blah\nblah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m2qy95/where_is_unxplained_season_7/"
    },
    {
        "id": "1m2qwlj",
        "author": "GeneralAd6197",
        "title": "Problem with playing Netflix in 4K on PC",
        "content": "Hi there, After installing the HEVC extension from the Microsoft Store, it used to play Netflix in 4K without any problems. However, it suddenly stopped playing in 4K, even though my subscription plan has not changed. I have tried uninstalling and reinstalling the HEVC extension multiple times to no avail.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2qwlj/problem_with_playing_netflix_in_4k_on_pc/"
    },
    {
        "id": "1m24oui",
        "author": "No-Comfort6053",
        "title": "Looking for new shows to watch",
        "content": "Ive already seen shameless, breaking bad, better call saul, avatar (and tlok), lucifer, archer, umbrella academy, black mirror, cobra kai, stranger things, Wednesday, jojos bizarre adventure and the resident. \nIm stuck on what to watch next and wanted some recommendations. Anything is welcome.",
        "upvotes": 12,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1m24oui/looking_for_new_shows_to_watch/"
    },
    {
        "id": "1m2nwpo",
        "author": "blueninja9511",
        "title": "Got Error Code D7361-1253",
        "content": "I was watching Supernatural, and out of nowhere it froze and played a glitchy noise, then my main monitor when dark green for a second then went black followed my second monitor going black, then showing white with a weird squarish shaped black spot in the center before both monitors booted back up. And my main monitor has “Pardon the interruption” and “Error Code D7361-1253.\n\nWhat happened?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2nwpo/got_error_code_d73611253/"
    },
    {
        "id": "1m2np5i",
        "author": "denydelaydepose",
        "title": "División Palermo Season 2 has lost it",
        "content": "Absolutely boring, rushed story lines to start new story arcs, hated how they ended the Korean drug drama in an instant, the change in story from believable characters enemies to now over the top cartoony antagonist. The humor is weaker now, basically non existent. There is much more violence now, when violence did happen in season 1 it was shocking, now it’s used as a cheap gimmick, and too frequently. Literally went from one of the best shows I’ve seen on Netflix to another show I’d rather forget. Season 1 will still live in my heart. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2np5i/división_palermo_season_2_has_lost_it/"
    },
    {
        "id": "1m2mme8",
        "author": "Arne003",
        "title": "FUBAR S2: Only 3 power plants shut down?",
        "content": "I'm currently watching episode 7 (out of 8) of FUBAR season 2. Back in episode 2 or 3, they mention that four power plants need to be shut down in order to trigger a nationwide blackout.\n\nBut unless I missed something or just forgot, I can only recall three being taken out:\n\n1. The first one is the satellite attack, where Greta blows up the plant from the inside after Luke's team manages to push the satellite away.\n\n\n2. The second is the cyberattack with the virus and submarine.\n\n\n3. The third is in episode 7 — the one with the underwater foam, where they end up shutting down the plant themselves to trigger the blackout.\n\n\n\nSo if I'm right, only three plants were actually shut down... but they said four were required to cause the blackout.\n\nDid I miss one? Or is this just a plot hole? 😅",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2mme8/fubar_s2_only_3_power_plants_shut_down/"
    },
    {
        "id": "1m2d6fb",
        "author": "Top-Three-USA",
        "title": "Netflix Orders Live-Action ‘Assassin’s Creed’ Series with New Showrunners at the Helm",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2d6fb/netflix_orders_liveaction_assassins_creed_series/"
    },
    {
        "id": "1m25eal",
        "author": "annabananas97",
        "title": "Is squid game season 3 worth watching?",
        "content": "I watched the first 2 episodes of season 3 already and I'm really doubting if I want to keep watching. I loved season 1 and was kind of disappointed  by season 2 until the last episode when things were picking up and we were getting somewhere but now at the start of season 3 we're almost back to where we were before the season 2 finale. \nAfter season 1 I thought it was supposed to be a criticism of capitalism and billionaires, but now that whole aspect is so much in the background and most of is just watching people die and being horrible. I get why people might enjoy that, but it's just not my type of show especially if it's mostly the same as season 1 and they just have different games. \nSo I guess I just wanted to ask if season 3 is similar to season 2 in that it mostly keeps focusing on the games itself? Or is it worth watching for people who don't just like it for the violence? ",
        "upvotes": 8,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1m25eal/is_squid_game_season_3_worth_watching/"
    },
    {
        "id": "1m2kzk1",
        "author": "MadOblivion",
        "title": "Alice In Borderlands Genius Writers",
        "content": "With upcoming season 3 i am excited. No one factored in the Joker cards or the Ace. Anyone that is tired of bland plots without intelligent thought will find this show comes as a pleasant surprise. The Squid games is straight up boring when compared to Alice in Borderlands. ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m2kzk1/alice_in_borderlands_genius_writers/"
    },
    {
        "id": "1m29wxb",
        "author": "Atlast_2091",
        "title": "Night Always Comes | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m29wxb/night_always_comes_official_trailer_netflix/"
    },
    {
        "id": "1m1wjfo",
        "author": "Dreamdays_0909",
        "title": "Building the Band - strange",
        "content": "I’m almost positive that the conversations the contestants are having with AJ when he tells them the amount of likes they have are completely fake lol. His responses are unnatural and scripted, and none of the cast ever say “hi AJ!”. The conversations don’t flow and the editing is peculiar lol. I think AJ is staring straight into a teleprompter and the screen they appear on is CGI. 🤦🏼‍♀️🤦🏼‍♀️",
        "upvotes": 22,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m1wjfo/building_the_band_strange/"
    },
    {
        "id": "1m2apms",
        "author": "FlowerRoutine9174",
        "title": "anyone got any shows similar to breaking bad, dexter, prison break, umbrella academy.",
        "content": "I love these shows so i need more because I have none to watch and Im so bored. I’m still very mad that dexter and prison break were removed and I don’t have the motivation to rewatch breaking bad.",
        "upvotes": 3,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1m2apms/anyone_got_any_shows_similar_to_breaking_bad/"
    }
]