[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lcqjo6",
        "author": "blunathan",
        "title": "La situazione blackout a Torino sta rasentando l'illegalità?",
        "content": "Può una amministrazione permettere che una città così grande e importante abbia una rete elettrica così scadente? La responsabilità ricade sul comune o sul gestore della griglia? E' possibile essere così assuefatti da un disservizio degno del 1950, che non si faccia nulla per cambiarlo? I danni ai lavoratori, alle aziende e ai cittadini possono essere rimborsati in qualche modo?  \nNe parleremo oggi in studio con.... nessuno. Perché in Italia siamo tutti eccellenti fotografi delle situazioni ma figurarsi se si è in gradi di individuare un responsabile che doveva provvedere per tempo e non l'ha fatto. Sembra si sia tutti prestati ai nostri mestieri, è' tutto un fatalismo salvifico, un 'è così che ci vuoi fare?', un passarla liscia collettivo costante.   \nBuona giornata e, se anche oggi non potrete fare smart working, o tenere il negozio aperto o prendere l'ascensore senza rimanere bloccati, ricordatevi che colpa dei vostri condizionatori e ventilatori che osano chiedere di funzionare ad una griglia elettrica ereditata dal Burkinafaso  \n",
        "upvotes": 37,
        "comments": 62,
        "media": null,
        "permalink": "/r/torino/comments/1lcqjo6/la_situazione_blackout_a_torino_sta_rasentando/"
    },
    {
        "id": "1lcuj3i",
        "author": "gabryGone",
        "title": "ennesimo post per l'ennesimo blackout",
        "content": "Come molti in questi giorni, eccomi qui a scrivere dei blackout elettrici.\n\nMi sono appena trasferito a **Torino Sud** e nella prima settimana di soggiorno sto avendo davvero troppi problemi con l'elettricità. Nel quartiere salta di continuo: a volte 10 minuti, a volte ore intere. Sabato pomeriggio è saltata e poi di nuovo dalle 22 a mezzanotte (se ricordo bene). Ieri stranamente è stata stabile tutto il giorno, oggi invece due interruzioni nel giro di poco tempo.\n\nCapisco che con i condizionatori la rete sia sotto stress, ma fino a un certo punto. Siamo nel 2025 e presumo che una rete elettrica stabile dovrebbe almeno garantire il funzionamento di questi apparecchi (anche se a vedere in giro mi sa tanto che l'infrastruttura sia degli anni '60 e mai aggiornata).\n\n#  Il problema è che lavoro da casa e ho server domestici. Sì, ho degli UPS, ma sabato anche le batterie sono finite dopo così tanto tempo senza corrente. Questo mi crea diversi disagi lavorativi.\n\n# Le mie domande quindi...\n\n* Questa situazione è **normale** per Torino in estate o è qualcosa di nuovo?\n* Qualcuno di voi nella zona sud ha lo stesso problema?\n* Esistono soluzioni pratiche o è solo questione di aspettare?\n\nQualsiasi consiglio o esperienza è ben accetta!",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1lcuj3i/ennesimo_post_per_lennesimo_blackout/"
    },
    {
        "id": "1lcczz2",
        "author": "mo_one",
        "title": "Il blackout in centro è finito proprio dopo la fine del concerto in piazza castello, ma che coincidenza",
        "content": "Allora, è ovvio che la rete elettrica è già debole per il caldo, quindi non è tutta colpa del concerto. Ma &gt;!porcoddio!&lt; la luce che torna subito dopo la fine del concerto in piazza castello non è una fottuta coincidenza. Ma il comune ha seriamente deciso ti prioritizzare un fottuto concerto, che le necessità fondamentali dei loro residenti??? Ma che cazzo di logica è &gt;!Madonna puttana!&lt;? Se si vede già che la rete elettrica cede, perché cazzo hanno deciso di fare il concerto comunque. Un intero quartiere (ed anche di più) non può sacrificare la corrente elettrica per un concerto, sarebbe dovuto essere l'opposto. Il concerto andava annullato se significava che metà città andava senza luce, è seriamente ridicolo. I semafori non funzionavano, i negozi e bar a via garibadi quasi tutti chiusi, ed i residenti al buio e caldo. Mentre sto cazzo di concerto succhia tutta l'energia per se. Ma le necessità fondamentali vanno prioritizzate al posto dello svago in situazioni del genere, ma che michia di genio ha permesso sta merda?? Manco fossimo in Corea del nord, o un villaggio africano, ceh, ma andare mezza giornata senza nessuna forma di elettricità vi pare normale?? La gente muore di caldo, non vede un cazzo in casa propria, mentre c'è la gente che va a cantare. O migliorate la rete elettrica, o non fate roba che la mette in difficoltà ancor di più!",
        "upvotes": 38,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1lcczz2/il_blackout_in_centro_è_finito_proprio_dopo_la/"
    },
    {
        "id": "1lcpqze",
        "author": "Careful_Molasses_496",
        "title": "Fake Agenzie, sono davvero fake?",
        "content": "Sto cercando casa da un po’ e mi trovo costantemente agenzie che non sono tali, ma che offrono servizi di consulenza e ti seguono dall’inizio (appuntamento con il proprietario dell’immobile) fino alla consegna delle chiavi, per 260€.\n\nSu Facebook e anche qui sembrano essere costantemente catalogate come truffa, ma è possibile che il loro lavoro consista nel farsi pagare la consulenza e poi non offrirti nessun tipo di aiuto. Da quello che leggo, si limitano a dire: “La casa che ti interessava non è più disponibile, ma ti terremo aggiornato appena escono altre soluzioni”.\n\nCioè, mi sembra assurdo. Hanno anche sedi legali (o uffici fuffa, perché la P.IVA non spunta da nessuna parte nei loro siti web). \n\nQualcuno sa di “consulenze” andate a buon fine?",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1lcpqze/fake_agenzie_sono_davvero_fake/"
    },
    {
        "id": "1lcof05",
        "author": "gutofoletto",
        "title": "Corso breve di italiano?",
        "content": "Hello friends!\n\nI am from Brazil and I speak only basic Italian, so it's been a bit hard to find friends and talk to people at bars and caffès. I'll be staying in Torino until September. Do you recommend any Italian courses that accept students for only 2-3 months group classes and does not break the bank?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lcof05/corso_breve_di_italiano/"
    },
    {
        "id": "1lbxqbt",
        "author": "Reasonable_Recipe631",
        "title": "Blackout",
        "content": "Lo so che questo è l'ennesimo post in questo sub dove ci si lamenta dei blackout e sarà lapalissiano, ma stanotte giuro che volevo morire. in zona Vanchiglietta ce n'è stato uno che mi sembra essere durato ore (probabilmente meno di una, ma ero in dormiveglia e tra caldo e pressione bassa mi sembrava di essere in un film di Nolan); cani che abbaiavano, antifurti, il ventilatore si è fermato e ho iniziato a soffocare, vi giuro che non ce la faccio più. Scusate per lo sfogo ma ho il sonno leggero. Sto considerando di comprare tappi per le orecchie. ",
        "upvotes": 41,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1lbxqbt/blackout/"
    },
    {
        "id": "1lc6zr9",
        "author": "Esp3t0",
        "title": "International student asking for advice",
        "content": "I am a Brazilian student and Im moving to Torino to study. I would like some advices.\n\nI would like to know about good neighborhood or which ones to avoid. I saw about avoid Barriera de Milano and places near Porta Palazzo and Porta Nuova. Is that correct any more places to avoid?\n\nAnd about local places to eat with good prices. Would love some tips.\n\nAnd places to buy food like a central market or popular fruit and vegetables fair.\n\nAbout security what would you recommend? I am originally from Rio de Janeiro and the criminality rates there are very high. Actually I live in an area with a criminality rate a little above Torino (according to Numbeo) and for me compared with Rio de Janeiro, here is almost the paradise. So I imagine that Torino is a very calm place.\n\nAny other tip will be very much appreciated. Thanks.",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1lc6zr9/international_student_asking_for_advice/"
    },
    {
        "id": "1lc9faa",
        "author": "rafasofizadeh",
        "title": "Dove posso acquistare un anello di promessa in zirconio/moissanite + oro?",
        "content": "Conoscete una zona a Torino piena di gioiellerie, dove posso cercare un anello da promessa (zirconi o moissanite, non diamanti)? Vorrei evitar di girare mille negozi singoli.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lc9faa/dove_posso_acquistare_un_anello_di_promessa_in/"
    },
    {
        "id": "1lbekvy",
        "author": "Proper-Prune-6806",
        "title": "CALDO TORRIDO a inizio giugno, ma vent'anni fa com'era? Qualche dato...",
        "content": "[temperatura \\(e non solo\\) registrata nel periodo 01 - 15 giugno del 2005 a Torino. ](https://preview.redd.it/1b53x00tfx6f1.jpg?width=823&amp;format=pjpg&amp;auto=webp&amp;s=60f0dc126549d036e489fd193d3cc73a740c8620)\n\nNumero complessivo di giorni in cui Torino ha registrato massimi \"molto caldi\" (&gt;30°C) nella prima metà del mese di giugno nel 2005: \n\n0. \n\ntemperatura media massima nel periodo 01 - 15 giugno a Torino nel 2005: \n\n25.8°.\n\n[temperatura \\(e non solo\\) registrata nel periodo 01 - 15 giugno del 2005 a Torino](https://preview.redd.it/u4fcnwv9hx6f1.jpg?width=823&amp;format=pjpg&amp;auto=webp&amp;s=928445abbc16d1e2a391b269455df535a7eb8150)\n\n\\- (il 14 e il 15 non sono ancora registrati ma non c'è dubbio che temperature massime di almeno 30 gradi verranno riportate; stima sui 32-34° ) -\n\nNumero complessivo di giorni in cui Torino ha registrato massimi \"molto caldi\" (&gt;30°C) nella prima metà del mese di giugno nel 2025: \n\n6. (40% dei giorni totali).\n\nTemperatura media massima nel periodo 01 - 15 giugno a Torino nel 2025: \n\n29.1°.\n\n\n\nRIASSUNTO:\n\n1- giorni con piu di 30 gradi nel 2005: 0 / 15\n\n1- giorni con piu di 30 gradi nel 2025: 6 / 15 (+6 giorni di \"caldo intenso\" rispetto 20 anni fa)\n\n\n\n2- temperatura media massima nel 2005: 25.8°\n\n2- temperatura media massima nel 2025: 29.1° (+3.3° rispetto 20 anni fa)\n\n\n\nFONTE: [Osservatorio Meteorologico dell'Università di Torino](https://www.meteo.dfg.unito.it/mese-6-2025)\n\n\n\n",
        "upvotes": 172,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1lbekvy/caldo_torrido_a_inizio_giugno_ma_ventanni_fa/"
    },
    {
        "id": "1lbuwsv",
        "author": "Sempronia19",
        "title": "Consigli per trovare lavoro a Torino dopo la laurea?",
        "content": "Ciao a tutti!  \nSto per laurearmi in una facoltà umanistica (ambito giuridico) e sto iniziando a pensare al mio futuro post-universitario. Per motivi personali vorrei trasferirmi a Torino dopo la laurea, città che conosco già abbastanza bene e a cui tengo molto.\n\nMi sto chiedendo come muovermi per cercare lavoro una volta lì.  \nVorrei evitare di trasferirmi “al buio” senza alcun piano, quindi sto valutando se cercare prima lavoro da remoto e poi spostarmi, oppure se abbia senso cercare direttamente sul posto.\n\nQualcuno ha esperienze simili?  \nConoscete portali, aziende, o realtà torinesi (anche del terzo settore o pubblica amministrazione) a cui fare attenzione?  \nOgni consiglio su come organizzarsi al meglio (anche per cercare una casa con un minimo di sicurezza economica) è ben accetto. \n\nGrazie mille a chi risponderà :)",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lbuwsv/consigli_per_trovare_lavoro_a_torino_dopo_la/"
    },
    {
        "id": "1lbx0ue",
        "author": "CoggedOphanim",
        "title": "Brant Bjork al BlahBlah",
        "content": "Qualcuno in questo gruppo è interessato o andrà al concerto di Brant Bjork Trio + Mos Generator al BlahBlah? Dato che sarò da solo, sto cercando persone con cui fare due chiacchiere e condividere il momento ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lbx0ue/brant_bjork_al_blahblah/"
    },
    {
        "id": "1lbwcap",
        "author": "DatEmperor",
        "title": "Siete riusciti a prendere il biglietto per il concertone del patrono?",
        "content": "Io attualmente bloccato alla pagina con il messaggio che il sito non è disponibile",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lbwcap/siete_riusciti_a_prendere_il_biglietto_per_il/"
    },
    {
        "id": "1lby9k9",
        "author": "North_Childhood8659",
        "title": "Frutteria/Fruit bar",
        "content": "Ci sono chioschi che vendono fette di angurie / frutta al taglio in generale?\nCon tavoli etc. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lby9k9/frutteriafruit_bar/"
    },
    {
        "id": "1lbtx6z",
        "author": "juulu",
        "title": "Upholstery fabric/tessuto",
        "content": "Sto cercando un posto dove acquistare tessuti per rinnovare una poltrona. Qualcuno ha consigli?\n\nHi all, I’m searching for somewhere to buy heavyweight materials for upholstery to renovate an old armchair. Does anyone have any recommendations?\n\nGrazie.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lbtx6z/upholstery_fabrictessuto/"
    },
    {
        "id": "1lbglbv",
        "author": "julix2212",
        "title": "Blackout in zona",
        "content": "Buonasera a tutti, è la prima volta che scrivo, abito in zona Borgo Vittoria (Torino Nord) verso Corso Grosseto. È un po' di giorni che nella via dove abito si presentano vari blackout, alcuni di qualche minuto, altri durano anche diverse ore; subito prima che salti la corrente si sente provenire dalla strada un boato simile ad uno scoppio. \nPer caso c'è qualcun altro che abita nella stessa zona, o anche altre, a cui sta succedendo la stessa cosa? Per caso si sa se c'è qualche problema con i servizi di corrente o con le centraline? Ho visto che ci sono alcune notizie che parlano di un blackout in tutta Torino, quindi ero curiosa di sapere in quanti lo stanno sperimentando.",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1lbglbv/blackout_in_zona/"
    },
    {
        "id": "1lbkk79",
        "author": "OkExercise6946",
        "title": "Power outage in torino around porta nuova?",
        "content": "It looks like there are at least a few blocks with no electricity at the moment anyone else experience this?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lbkk79/power_outage_in_torino_around_porta_nuova/"
    },
    {
        "id": "1lb5tck",
        "author": "_reasonabledictator_",
        "title": "come mannaggia si trova un lavoro a torino",
        "content": "Io personalmente non abito più a Torino da un paio d'anni, ma ho una cara amica molto giovane (23 anni) che abita lì da diverso tempo. Per varie ragioni personali sta pensando di lasciare l'università e cercare lavoro, ma nonostante mille cv mandati (anche al mc, non ha tante pretese, le andrebbe benissimo fare la cameriera), nessuno la chiama. Quando abitavo a Torino ho notato anche io una situazione disperata a livello lavorativo, ora che sono in Veneto non ho di questi problemi e ho avuto decine di colloqui in pochissimo tempo e ampia possibilità di scelta. Come consigliereste di muoversi in una città come Torino a una ragazza in questa situazione? Preciso che non ha esperienza, qualche lavoro saltuario da cameriera e volontaria coi bambini.\n",
        "upvotes": 34,
        "comments": 67,
        "media": null,
        "permalink": "/r/torino/comments/1lb5tck/come_mannaggia_si_trova_un_lavoro_a_torino/"
    },
    {
        "id": "1lb77i7",
        "author": "initial_chris",
        "title": "Regolamenti comunali accensione aria condizionata",
        "content": "\nCiao a tutti,sto cercando di capire se qualcuno sia a conoscenza di eventuali regolamenti comunali a Torino che limitino l’uso dell’aria condizionata nelle stanze riservate agli studenti.\n\nSono in una residenza universitaria privata (che ospita anche un hotel) e, a differenza delle camere destinate a chi soggiorna ai piani riservati per l hotel, l’aria condizionata per gli studenti è attiva solo dalle 11 alle 18. La direzione sostiene che sono obbligati a fare così a causa delle norme del comune che impediscono loro di tenerla accesa in altri orari, e che anzi l’hanno già accesa “in anticipo”, dato che secondo loro la legge imporrebbe di attivarla solo dal 15 giugno.\n\nIo però ho una stanza esposta completamente al sole, con pareti vetrate e tende nere. Stanotte sembrava di essere in un forno crematorio con zero ricircolo dell'aria (tenessero almeno la ventola attiva), e diventa praticamente impossibile dormire.\n\nHo confrontato la situazione con un’altra residenza privata (seppur in parte convenzionata da Edisu), e lì l’aria condizionata è attiva H24, con attivazione automatica tramite badge e un setpoint regolato tra 23 e 24 gradi. Quindi inizio a dubitare fortemente dell’esistenza di “regole comunali”.\n\nQualcuno ha info più precise? Davvero a Torino esistono normative che limitano l’uso dell’aria condizionata solo per le stanze studenti e non per quelle alberghiere, all’interno della stessa struttura?\nÈ possibile muoversi in qualche modo per costringerli ad accendere l'aria condizionata allo stesso modo di come è accesa nel resto della struttura?\n",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lb77i7/regolamenti_comunali_accensione_aria_condizionata/"
    },
    {
        "id": "1lbh8ic",
        "author": "Outrageous_Corgi6611",
        "title": "Anche voi senza acqua?",
        "content": "Anche voi siete senza acqua corrente in casa? Nel mio palazzo (in Cit Turin) manca da un po', ho chiamato il numero verde e una voce registrata dice che se chiamo dal comune di Torino per mancanza di acqua sono già al corrente del problema (con Iren) e stanno cercando di sistemare",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lbh8ic/anche_voi_senza_acqua/"
    },
    {
        "id": "1lb73fi",
        "author": "Ok-Eye4820",
        "title": "Biblioteche con aria condizionata",
        "content": "Esattamente come da titolo, ma non solo a Torino, anche in provincia. Dove andate abitualmente per non cuocere tutto il giorno?",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lb73fi/biblioteche_con_aria_condizionata/"
    },
    {
        "id": "1laqvow",
        "author": "_L_-",
        "title": "Madonna che caldo",
        "content": "Chi non ha un climatizzatore è spacciato ",
        "upvotes": 115,
        "comments": 57,
        "media": null,
        "permalink": "/r/torino/comments/1laqvow/madonna_che_caldo/"
    },
    {
        "id": "1lb2nj5",
        "author": "esme87_",
        "title": "La curiosità mi attanaglia",
        "content": "Ciao a tutti, ieri, come anche altre sere, sono andata a Venaria. Ho parcheggiato all’inizio del viale che porta all’ingresso del parco La Mandria (ingresso Ponte Verde, non Tre Cancelli).\nEd è proprio nello spiazzale dei parcheggi all’ingresso che vedo sempre un via vai continuo di auto, luci che si accendono e si spengono, auto che percorrono il viale e si fermano lì in mezzo con le luci accese.\nInquietante, anche perché non si sentono rumori se non le rane che gracidano.\nHo pensato possa trattarsi di coppie che cercano un posto per appartarsi, ma la quantità di auto mi sembra eccessiva.\nPunto per scambisti? Guardoni? Sesso in generale?",
        "upvotes": 15,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1lb2nj5/la_curiosità_mi_attanaglia/"
    },
    {
        "id": "1lbja32",
        "author": "No-Calligrapher-4884",
        "title": "motociclisti sui 20 anni?",
        "content": "sono a torino da poco piú di un anno e mi diletto con una piccola moto 125 e cerco compagnia per fare qualche giro ogni tanto con qualche birra e qualche chiacchierata (sono di collegno)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lbja32/motociclisti_sui_20_anni/"
    },
    {
        "id": "1lbafy9",
        "author": "Few_Willingness_5198",
        "title": "c'è una ditta edile di Torino un minimo affidabile?",
        "content": "avevo idea di creare un bagno e cucinotta aggiuntivi  dal momento che i miei sono sempre occupati da moglie e figli, quindi non è un lavorone enorme. qualcuno conosce qualcuno che non faccia disastri e sia un minimo affidabile?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lbafy9/cè_una_ditta_edile_di_torino_un_minimo_affidabile/"
    },
    {
        "id": "1lb766f",
        "author": "silviuzX2",
        "title": "Elettricità stamattina",
        "content": "Preciso la zona: Parella. Tra stanotte (4-5) e stamattina fino a due orette fa é saltata la corrente in gran parte della zona (tantissimi antifurti che suonavano ecc) almeno 4 volte, per circa 20 minuti ciascuna all’incirca (ma anche una settimana fa é successo). Io penserei anche che il motivo sono i 3000 condizionatori accesi contemporaneamente date le temperature di questi giorni, ma è possibile che la rete sia così vecchia e scarsa ? É successo anche in altri quartieri ? Mannaggia ad Iren",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1lb766f/elettricità_stamattina/"
    },
    {
        "id": "1lbcp6a",
        "author": "Short_Chocolate_6815",
        "title": "Vostra esperienza a Torino",
        "content": "Solo io trovo difficilissimo rimorchiare qualche ragazzo a Torino? Mi sembra che non sia proprio fattibile fare una bella chiacchierata o qualcosa di più con qualcuno. Perché? Sbaglio io o non si vuole più sc**are? ",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1lbcp6a/vostra_esperienza_a_torino/"
    },
    {
        "id": "1lazb2y",
        "author": "Libertymobile",
        "title": "Come posso trovare stanza?",
        "content": "Sono brasiliano, 34 anni con passaporto europeo, come posso trovare monolocale o stanza? Ho provato alcuni gruppi su Facebook ma nessuno risponde, non so se è perché sono brasiliano. Qualcuno conosce una stanza e potrebbe consigliarla? Sono una persona molto pulita e tranquilla, passo più tempo nella mia stanza a lavorare.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lazb2y/come_posso_trovare_stanza/"
    },
    {
        "id": "1lb8usq",
        "author": "TroubleForward4985",
        "title": "Ciao qualcuno con cui uscire a torino stasera",
        "content": "Sono vicino Porta Susa con un amico, cerchiamo compagnia questo ultimo giorno in quanto domani dovrò ripartire per Milano. \nFateci sapere! nel caso vi parleremo meglio di noi 2 ‼️‼️🤣🤣 yogurt ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lb8usq/ciao_qualcuno_con_cui_uscire_a_torino_stasera/"
    },
    {
        "id": "1lb8rll",
        "author": "SpeechHaunting8877",
        "title": "Parcheggi vicino Parco Leopardi?",
        "content": "Bella raga, sapete dove posso trovare un posto comodo per la macchina in zona Parco Giacomo Leopardi? Ce ne sono\nCome orari andrò domenica prossima al mattino  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lb8rll/parcheggi_vicino_parco_leopardi/"
    },
    {
        "id": "1lb8dvx",
        "author": "glorious-ahole",
        "title": "compleanno presto",
        "content": "Sono nuovo a Torino, è il mio primo mese per essere precisi. Tra poco festeggerò il mio compleanno e vorrei regalare qualcosa ai miei colleghi (niente di troppo costoso). Stavo pensando a dei cioccolatini. È una buona idea?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lb8dvx/compleanno_presto/"
    }
]