[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qk7097",
        "author": "cheno103",
        "title": "Netflix bosses feel 'blindsided and horrified' after Queer Eye Karamo Brown claims he was 'bullied' on set",
        "content": "",
        "upvotes": 404,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7097/netflix_bosses_feel_blindsided_and_horrified/"
    },
    {
        "id": "1qkut4t",
        "author": "Fun_Molasses5215",
        "title": "Karamo Brown previously admitted he and Antoni had ‘extreme conflict’ during season one of Queer Eye and refused to talk to each other",
        "content": "",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qkut4t/karamo_brown_previously_admitted_he_and_antoni/"
    },
    {
        "id": "1qkgya1",
        "author": "Sudden_Pop_2279",
        "title": "Alice in Borderland was not \"cancelled\"",
        "content": "So recently, there's been a massive misconception being spread. Netflix released a post saying how season 3 was the \"final\" season of Alice in Borderland. Somehow, people saw this and immediately started spreading online \"the show's been cancelled\" or whatever.\n\nSeason 3 was ALWAYS marketed as the final season. Its not the show being cancelled, it reached its natural conclusion. Hell, season 2 alone was a perfect ending and even though season 3 was flawed and unecessary, I still thought the ending itself was good. This is one of the better places to \"cancel\" a show if anything.\n\n\"But there was the teaser at the end\" yeah, which at MOST was hinting towards a US spin-off or at the least, that the games were continuing across the world as the Watchman warned Arisu. Season 3 made MORE views than season 1, its foolish to assume the mixed reception got the series \"cancelled\".",
        "upvotes": 53,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qkgya1/alice_in_borderland_was_not_cancelled/"
    },
    {
        "id": "1qkc5fd",
        "author": "Bobby_Brooklyn5",
        "title": "11.22.63",
        "content": "New to Netflix and surprisingly good.  Time-travel story with a pretty good James Franco and a terrific supporting cast.  Not usually in to this genre or Stephen King but this is a very trippy, engaging story.  Kind of like an episode of The Twilight Zone on steroids.",
        "upvotes": 67,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1qkc5fd/112263/"
    },
    {
        "id": "1qk0x2s",
        "author": "salutefanaccount",
        "title": "Harlan Coben",
        "content": "i can’t be the only one who can’t stand Harlan Coben series’. His stories are just written so bad and feel like a parody of well written shows. Idk why netflix continues to follow his ideas. Does anyone else feel this way?",
        "upvotes": 169,
        "comments": 133,
        "media": null,
        "permalink": "/r/netflix/comments/1qk0x2s/harlan_coben/"
    },
    {
        "id": "1qkuzw3",
        "author": "Kaskelontti",
        "title": "The original Good Doctor",
        "content": "I started watching Good Doctor, and after a couple of fairly standard and predictable American hospital soap opera episodes, I realized that it was based on a Korean series. And lo and behold! The original series is also available on Netflix! Yet another Korean series that I immediately got hooked on.  The American remake was typically bland and dull compared to the original. Why do Americans manage to ruin all good series by making them predictable and squeezing them into the same boring mold?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qkuzw3/the_original_good_doctor/"
    },
    {
        "id": "1qkv165",
        "author": "plaatopuss",
        "title": "Something similar to never have i ever and sex ed.",
        "content": "I loved never have i ever so much, sex ed was also pretty decent. tried watching the summer i turned pretty but i didnt like it very much and dropped it after the second season i think? it was cute until the first season and after that it was just stupid ( OBJECTIVE OPINION PLS DONT SEND HATE ). but yes, idk what appealed to me in the two shows, yes i love romance shows and even movies work. i think the fact that they were my age also appealed to me but yeah idk. are there any series and/or movies like those? any recommendations are appreciated. thank you \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qkv165/something_similar_to_never_have_i_ever_and_sex_ed/"
    },
    {
        "id": "1qkb1ed",
        "author": "Used-Can-6979",
        "title": "Skyscraper Live.",
        "content": "Is there really a chance this guy can fall and die in front of everyone? I have a feeling this is gunna end up being kinda boring. It’s tomorrow. I’m just curious who’s gunna watch it.",
        "upvotes": 17,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qkb1ed/skyscraper_live/"
    },
    {
        "id": "1qkkbu6",
        "author": "Emmiesship",
        "title": "Parental controls - Post for parents of young children.",
        "content": "I recently contacted Netflix to ask why there are quite a few titles I cannot block on parental controls. I spoke to a Netflix customer service person who asked me to do a lot of resets extra on all my devices.I kept explaining that many of the titles did in fact block without problem and the issue was not my end, but rather Netflix’s. Still, I spent almost an hour doing resets, etc. In the end, he told me to just tell my kid he couldn’t watch specific titles (clearly not a parent himself!) He said he’d referred the issue, so I asked for a reference to our call so I could check on the progress. He said that’s not something they do. He said to just keep checking if the title had been added to the remove list. I have done this - still nothing. I really don’t want to waste another hour of my life to a rude Netflix customer service dude, so do any of you have any idea how to chase this? There are many titles that can’t be blocked under parental controls - shows that are within the age limits. I’m an early years educator, so maybe I’m taking this issue more seriously than I need to, but some of the shows they’ve added on there for young children are absolute cesspools for developing brains. Not nearly as bad as Amazon kids, but still not great. So the powers to block these titles is pretty important I feel. I promise I’m not normally this neurotic, but I can’t face another fight with my six year old, after a long day of working with other people’s kids, over why he can’t watch Catch! Teenieping. Help a mother out! ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qkkbu6/parental_controls_post_for_parents_of_young/"
    },
    {
        "id": "1qkfos1",
        "author": "joesen_one",
        "title": "Netflix Oscar Nominations 2026 - Frankenstein, Train Dreams, The Perfect Neighbor, All the Empty Rooms, The Singers",
        "content": "* Best Picture - Frankenstein, Train Dreams\n* Best Supporting Actor - Jacob Elordi for Frankenstein\n* Best Adapted Screenplay - Frankenstein, Train Dreams\n* Best Costume Design - Frankenstein\n* Best Production Design - Frankenstein\n* Best Makeup &amp; Hair - Frankenstein\n* Best Score - Alexandre Desplat for Frankenstein\n* Best Sound - Frankenstein\n* Best Original Song - \"Train Dreams\" by Nick Cave and Bryce Dessner for Train Dreams\n* Best Cinematography - Frankenstein, Train Dreams\n* Best Documentary Feature - The Perfect Neighbor\n* Best Documentary Short - All the Empty Rooms\n* Best Live Action Short - The Singers",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qkfos1/netflix_oscar_nominations_2026_frankenstein_train/"
    },
    {
        "id": "1qkrezv",
        "author": "jsofredorl",
        "title": "Terrible bitrate (below 1 Mbps) on Netflix, what now?",
        "content": "For several days now, the bitrate on Netflix here has been terrible. Series like Stranger Things and One Piece have bitrates below 1 Mbps, as well as some movies. My internet speed test shows above 200 Mbps, but other streaming services are all in 4K. What should I do?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qkrezv/terrible_bitrate_below_1_mbps_on_netflix_what_now/"
    },
    {
        "id": "1qk7jfk",
        "author": "kimnabi7",
        "title": "The woman in cabin 10",
        "content": "Attention: spoilers ahead.\n\nAm I the only one who found this movie completely unrealistic? I honestly have no idea how they managed to convince keira knightley to sign on to this story.\n\nFrom the very moment the woman expressed her desire for giving away all her money for charity, it was obvious her husband was going to kill her. Beyond that predictability, the entire plot felt absurdly implausible.\n\nEven if we assume a billionaire could somehow use facial recognition to find a woman who looks exactly like his wife, the execution still makes no sense. Maybe he could have staged a distant public appearance to deceive people but having her pass as his wife up close, in broad daylight, on a boat, surrounded by her friends? Completely unbelievable. Let alone that she just shaved her hair and put on some make-up by herself instead of having a professional MUA do it. And how is a poor Polish woman suddenly able to speak flawless British English and perfectly imitate another person’s voice? That alone defies logic.\n\nThen there’s the ridiculous idea of having her impersonate the wife to sign a contract. A contract involving an inheritance of that magnitude would absolutely require handwriting verification something that’s standard practice. The whole plot feels like it was written by a teenager with no understanding of how the real world works.\n\nExtra minus points for the way women are portrayed as hysterical and foolish in situations like this. An award-winning journalist, in particular, would not react so irrationally upon realizing something deeply suspicious is happening, nor would she make herself such an obvious target.",
        "upvotes": 17,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7jfk/the_woman_in_cabin_10/"
    },
    {
        "id": "1qkhimk",
        "author": "PhillyPhenom93",
        "title": "How do I remove this",
        "content": "Can someone with more than 2 brain cells tell me how I get this off my screen? This pops up every time I use Netflix on browser, this is from a live NFL game LAST YEAR &amp; it’s still “reminding” me about it. It’s not saved in my list nor do I have the reminder icon selected on it. How do I get rid of this shit???? Just realizes I can’t post a pic on this sub (why tho) so I’ll explain it in further detail. It’s a pop up of a live NFL game from last year, last year i did have Netflix “remind me” when this goes live, the event is over &amp; yet i still get the “reminder” pop up every time I use Netflix. HELP ME!!!! ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qkhimk/how_do_i_remove_this/"
    },
    {
        "id": "1qk86rd",
        "author": "serv0_o",
        "title": "Is there a way to block a show from being advertised to me?",
        "content": "I can’t stand opening the app and seeing Bert Kreischer’s face and naked body. I don’t want to see this Free Bert show plastered on the main page. Is there a way to block it?",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qk86rd/is_there_a_way_to_block_a_show_from_being/"
    },
    {
        "id": "1qk7o86",
        "author": "Marceline1995",
        "title": "Any adult animation recommendations?",
        "content": "I have enjoyed watching Haunted Hotel, Chicago Party Aunt, F is for Family, Paradise PD, Carol &amp; the End of the World and Inside Job. I am looking for something in the likes of these shows. Open to any recommendations. Thank you!",
        "upvotes": 8,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7o86/any_adult_animation_recommendations/"
    },
    {
        "id": "1qk9uop",
        "author": "ponyo_007",
        "title": "adolescence - jamie’s parents",
        "content": "i loved the moment where jamie’s parents are in the car with jamie’s sister explaining their love story.\n\nwhat really struck out was the fact that lisa looked as if she had never heard about the fact that her own dad looked ridiculous at a school dance, with bowling shoes and a crazy wig and then got made fun of during the rest of his school. yet, her mother still decided to date him and then get married. \n\ni believe that this scene is so important when\n\ncompared to episode 3 where jamie has this rather harsh image of his dad - a loving one, yes, but with a certain edge to him.\n\ntheir stories at school can be seen as similar, and yet jamie is convinced that women will never be interested because of certain things he has been told/seen on the internet. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk9uop/adolescence_jamies_parents/"
    },
    {
        "id": "1qjk95z",
        "author": "Party-Command-9296",
        "title": "Everyone should watch CLICK once.",
        "content": "I was going crazy thinking about how behind I am in life, and then I randomly watched Click (Adam Sandler) and it genuinely shifted my perspective.\n\nIt looks like a silly comedy, but the message hits way deeper. Made me slow down and rethink what I’m rushing for.",
        "upvotes": 155,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qjk95z/everyone_should_watch_click_once/"
    },
    {
        "id": "1qju8au",
        "author": "Ok-Evidence8770",
        "title": "Liza Frankenstein(2024) is the best Frankenstein movie I have ever seen in my life",
        "content": "I am happy to see Ted Wheeler from Stranger Things is in it too. It is a combo of 80's and Gothic and I am blown away by the story. Genius work.\n\nMuch better than Frankenstein 2025 ",
        "upvotes": 20,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1qju8au/liza_frankenstein2024_is_the_best_frankenstein/"
    },
    {
        "id": "1qkhmet",
        "author": "LilNello1",
        "title": "Canelo Documentary Coming To Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qkhmet/canelo_documentary_coming_to_netflix/"
    },
    {
        "id": "1qkshrp",
        "author": "PersonalityDry97",
        "title": "Can I pay someone else's Netflix without making another account?",
        "content": "I just want to pay for my Dad's account without making another account nor giving him money. \n\nI already made my research, it says extra member is needed. My dad and I live far from each other, and I don't want to give him any card information.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qkshrp/can_i_pay_someone_elses_netflix_without_making/"
    },
    {
        "id": "1qjm0tg",
        "author": "BradyPhoenix",
        "title": "Thoughts on the Elizabeth Smart film?",
        "content": "I’ve read and watched so much about this case over the years that nothing in this was really new information to me, but I still thought it was well made and worth the watch. It’s always nice to hear directly from Elizabeth and her family.",
        "upvotes": 57,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1qjm0tg/thoughts_on_the_elizabeth_smart_film/"
    },
    {
        "id": "1qkm3tz",
        "author": "Delicious_Caramel141",
        "title": "Top Movies on Netflix",
        "content": "Can someone share top 10 comedy, suspense movies, web series on Netflix in 2026, or any upcoming, language should be hindi , my choice are like Panchayat, ashram from prime\n\n  \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qkm3tz/top_movies_on_netflix/"
    },
    {
        "id": "1qkpjlg",
        "author": "Adventurous_Bus_3783",
        "title": "Oscar Isaac might be the biggest Best Actor snub this year (IMO)",
        "content": "The first thing that really impressed me after watching Guillermo del Toro’s *Frankenstein* was Oscar Isaac’s performance. He’s had a very strong run overall, and as someone who’s not a fan of Marvel or *Star Wars*, I’ve never really seen him as a commercially pushed leading man — but absolutely as a serious actor dedicated to his craft.\n\nSince *Inside Llewyn Davis*, *Ex Machina*, *Dune*, and now this year, I honestly think the snub was huge.\n\nI didn’t like *Sinners* at all. To me it felt like a copycat film, full of agendas and with pretty weak performances overall. Seeing Michael B. Jordan nominated was genuinely confusing.\n\nI love Leo, but his role in *OBAA* just wasn’t his best. He did what he always does — solid, professional, even funny at times — but **leading actor**? The film focused far more on his wife, Sean Penn, and his daughter for like two-thirds of the runtime.\n\nAnd Teyana Taylor being nominated as well? Seriously? At this point, why not nominate Junglepussy too. Benicio getting nominated for what felt like 7 minutes of screen time in a very minimalistic role also made me raise an eyebrow. I can definitely see where that $140 million budget went.\n\nSo yeah — that’s pretty much it. The Academy had **partial merit** this year, in my opinion, but Oscar Isaac being left out really didn’t sit right with me.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qkpjlg/oscar_isaac_might_be_the_biggest_best_actor_snub/"
    },
    {
        "id": "1qj4ic6",
        "author": "-deetjay-",
        "title": "Red Dead Redemption passes 3.3m Netflix downloads while paid game struggles past 10k",
        "content": "",
        "upvotes": 309,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qj4ic6/red_dead_redemption_passes_33m_netflix_downloads/"
    },
    {
        "id": "1qjl21m",
        "author": "HighOnLove26",
        "title": "His &amp; Hers - question in the description - spoilers.",
        "content": "&gt;!Why in the world was Lexy mad at Anna so much as to try to kill her? It wasn't clear that Anna tried to lure Lexy into the woods, and even if she did, she was the one who saved her! So it's obvious that Anna's intentions for luring Lexy into the woods (assuming she did that) were just to party and nothing else. Furthermore, Lexy suffers only a brief attempt at rape, but Anna is the one who suffers all of it, that too because she tried to save Lexy and was successful at it! How can you be mad at someone who suffers themselves while trying to save you?!&lt;",
        "upvotes": 25,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qjl21m/his_hers_question_in_the_description_spoilers/"
    },
    {
        "id": "1qk7jpl",
        "author": "mikep998",
        "title": "‘Star Search’ Star Ratings",
        "content": "I’ve watched both episodes so far and really enjoy it! Huge props to the contestants I’m so nervous for them. The only part I find confusing is how they calculate them down to 1 decimal place. For example: Chrissy 5, Jelly Roll 5, Sarah 4, World 3.7 for a final of 4.2 stars. Huh? Next one is Chrissy 5, Jelly Roll 5, Sarah 4, World 4 for a final of 4.3 stars.\n\nI’m not good math but this makes no sense to me mathematically.. anyone else get it? 🙄",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qk7jpl/star_search_star_ratings/"
    },
    {
        "id": "1qk6wqn",
        "author": "Mr_Perfectly_UnFine",
        "title": "Undercover Miss Hong or No Tell to Tell?",
        "content": "Is Undercover Miss Hong any good? I love Park Shin-Hye and Go kyung-pyo so I was wondering if it is a good series to start?  Or should I go watch No Tail to Tell first? \n\nIt’s hard cause I am busy at work and can only afford to watch one ongoing series and wait weekly for new episodes and I would probably watch the other eventually",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qk6wqn/undercover_miss_hong_or_no_tell_to_tell/"
    },
    {
        "id": "1qjlnc3",
        "author": "Competitive_Gene_898",
        "title": "Netflix Cancels The Abandons and The Vince Staples Show After One and Two Seasons",
        "content": "",
        "upvotes": 16,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qjlnc3/netflix_cancels_the_abandons_and_the_vince/"
    }
]