[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1odbsqb",
        "author": "Warm-Barracuda3302",
        "title": "‘I’ve been in tears’: Ajike Owens’ cousin opens up after ‘reliving’ her death in Netflix doc",
        "content": "",
        "upvotes": 334,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1odbsqb/ive_been_in_tears_ajike_owens_cousin_opens_up/"
    },
    {
        "id": "1odk4j9",
        "author": "Lateralus46N2",
        "title": "The Perfect Neighbor Unseen Bodycam Not Shown in Doc",
        "content": "Like many of you, I'd fallen down the Susan Lorincz rabbit hole since watching the documentary. I had thought I'd seen most key pieces by now and had moved on to other things when this video popped up in my suggestions. It begins with Bodycam footage not included in the movie or the trial. It shows the neighborhood and police discussions in the immediate aftermath, as well as other footage from that night woven throughout that I haven't seen elsewhere. I thought some of you may find it interesting.  https://youtu.be/lYXD9SMCa-w?si=k3Zi0efuzmhFAxjh\n\nFor those just starting down the rabbit hole: \n\nHere are the full interrogation videos post shooting \n\nInterview 1 \nhttps://youtu.be/puQmH_d8yVw?si=YxWmWv-fCoGlTBax\n\nInterview 2\n\nhttps://youtu.be/lZ74O5qxI0w?si=3IurVUXKQjU0f2vr\n\nFor those who haven't seen the trial, I will post those links as well. There was some pretty important evidence that I wish had been included in trial. She is actually am even bigger monster than what we saw in the movie. Note: Trial videos are about half as long as advertised as there is a lot of dead space to fast forward through such as when the court breaks for recesses \n\nDay 1\nhttps://www.youtube.com/live/ygm__xISYAM?si=xT2Di6bgMw_Gxe4L\n\nDay 2 (State Rests)\nhttps://www.youtube.com/live/kJKQqjVfvnE?si=_nApwK5qtP2nafJt\n\nDay 3\nhttps://www.youtube.com/live/SN8lCIq7ivM?si=EbRML6cWwHN1xTdk\n\nDay 4 (closing arguments)\nhttps://www.youtube.com/live/EA_K8tmog4o?si=5jDc92HXULnin0W4\n\nSentencing \nhttps://youtu.be/9dHWMI2HEyw?si=GoiRNU2VUwymxzs1\n\n",
        "upvotes": 20,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1odk4j9/the_perfect_neighbor_unseen_bodycam_not_shown_in/"
    },
    {
        "id": "1oda16w",
        "author": "Bubbly-Comparison-29",
        "title": "Boots is SO GOOD.",
        "content": "i just finished watching the last episode after binging it all in a couple of days. its AMAZINGGG it has great acting, great balance between comedy and seriousness and really makes you care about each character. guys give it a shot pleasee \n\n  \nalso on a side note max parker's eyes are absolutely gorgeous ",
        "upvotes": 42,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oda16w/boots_is_so_good/"
    },
    {
        "id": "1od007p",
        "author": "pandasoondubu",
        "title": "The Perfect Neighbor",
        "content": "Did Sue plan out how to get away with the murder?\n\nIt was briefly mentioned in the interrogation that she researched “stand you ground” laws before this all happened. Not sure if anyone has seen anything about this, but if that’s true it feels more calculated than a moment of anger.\n",
        "upvotes": 157,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1od007p/the_perfect_neighbor/"
    },
    {
        "id": "1odk8bj",
        "author": "GoldDerby",
        "title": "‘KPop Demon Hunters’ takes the lead at Golden Globes as new toys and games are announced:",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odk8bj/kpop_demon_hunters_takes_the_lead_at_golden/"
    },
    {
        "id": "1ocvyvf",
        "author": "Legit_Train_Hopper",
        "title": "“Tell them You Love Me” documentary..",
        "content": "I seriously cannot express how angry, sad and generally appalled I feel after watching this, this is one of the most disturbing fucking documentaries I have *ever* seen. \n\nAnna stubble field is *the* true definition of the devil. \n\nShe left scars on DMan’s body. She, an able bodied woman, raped a disabled man. I’m so sick and angry after watching this.\n\nDaisy (DMan’s mom) said he now masturbates. She said he would’ve never had known about anything sexual if it weren’t for Anna showing it to him. \n\nAND THE WORST PART ABOUT ANY OF THIS is at the end she STILL doesn’t think she’s wrong for this oh.. my god…\n\nThis documentary I felt in my *soul*. ",
        "upvotes": 131,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ocvyvf/tell_them_you_love_me_documentary/"
    },
    {
        "id": "1odhcy7",
        "author": "ToonAdventure",
        "title": "Mitchells vs Machines 2 in Works at Sony Animation, Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odhcy7/mitchells_vs_machines_2_in_works_at_sony/"
    },
    {
        "id": "1oddfor",
        "author": "idlaughless",
        "title": "'Outer Banks' Director Jonas Pate Accused Of Grabbing and Shaking Production Assistant",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oddfor/outer_banks_director_jonas_pate_accused_of/"
    },
    {
        "id": "1odftcn",
        "author": "SOLO_OBSERVER",
        "title": "New Documentary Idea",
        "content": "Can they just do documentaries on like the wildness of late night Tv like Skinamax or like the rise and fall of Girls Gone Wild, that be pretty damn interesting.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odftcn/new_documentary_idea/"
    },
    {
        "id": "1od0r1z",
        "author": "MeanderFlanders",
        "title": "The Perfect Neighbor: Where was the tablet found?",
        "content": "Something that has been nagging me, was the location of the tablet, the cause of the last confrontation. I watched a bit of the trial when it occurred but didn’t catch that it was addressed. Wondering it was in her house, on her porch, etc. ",
        "upvotes": 41,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1od0r1z/the_perfect_neighbor_where_was_the_tablet_found/"
    },
    {
        "id": "1odqs4u",
        "author": "michelob81",
        "title": "I am a killer",
        "content": "Just watched this delightful little show. It's basically Netflix interviewers going into prisons and letting scumbag murderers run their mouths. I think we're supposed to question if these evil cretins are somehow the victims in their horrific acts. I've an idea for the next season. Don't go anywhere near the prisons and let these people rot.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odqs4u/i_am_a_killer/"
    },
    {
        "id": "1odqb4b",
        "author": "dudepersson",
        "title": "is there any way to bypass the singular household thing",
        "content": "i'm 17 and i live with my parents, they're divorced so i often switch houses. up until now my netflix account has worked fine at either house. just tonight on my mac, it said that i was not in the correct household for my account. is there anything i can do about this? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odqb4b/is_there_any_way_to_bypass_the_singular_household/"
    },
    {
        "id": "1odm13m",
        "author": "Sudden_Pop_2279",
        "title": "Wednesday Season 2 OTT Verdict (Week 11): Jenna Ortega’s Hit Cracks Netflix’s All-Time Top 5 Most-Watched Shows",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1odm13m/wednesday_season_2_ott_verdict_week_11_jenna/"
    },
    {
        "id": "1odf7gn",
        "author": "DirectMushroom8724",
        "title": "Train Dreams",
        "content": "Is there somewhere I can see the cities/theaters playing Train Dreams starting Nov 7? Hoping to catch it before the Netflix debut on Nov 21. Thank you!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1odf7gn/train_dreams/"
    },
    {
        "id": "1odh1xe",
        "author": "Stressy_messy_me",
        "title": "Can't access all programs??",
        "content": "Since when have you not been able to access all netflix programs on the standard plan?? I've never been blocked from watching a program before because of the plan i'm on!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1odh1xe/cant_access_all_programs/"
    },
    {
        "id": "1ocs7zs",
        "author": "DefiantRanger9",
        "title": "When rates of violence, shootings, and depression are high in this country, do we really need shows glamorizing serial killers?",
        "content": "When does gruesome and terrible become fantastical, to be viewed and enjoyed by others?\n\nAt what point do we say enough is enough. There are enough crazy people out there as it is. No need to bring attention to them (like putting someone’s name and mugshot in the news after they committed a crime). ",
        "upvotes": 37,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ocs7zs/when_rates_of_violence_shootings_and_depression/"
    },
    {
        "id": "1odmacs",
        "author": "Safe-Repair-4116",
        "title": "Remove email from account",
        "content": "Is it possible to get an email off a terminated account? My dad had an account and cancelled and we are trying to invite him to ours but it says the email is already in use. He’s elderly and only has one email. I really don’t want to complicate things for him and create another. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1odmacs/remove_email_from_account/"
    },
    {
        "id": "1obzuh4",
        "author": "snowbugolaf",
        "title": "The Perfect Neighbor - innocent kids",
        "content": "It’s the way the children don’t speak the swear words when they’re quoting Susan 😥 They’re just literally so, so strikingly innocent, playing kid games in the vacant lot as kids do.",
        "upvotes": 1641,
        "comments": 731,
        "media": null,
        "permalink": "/r/netflix/comments/1obzuh4/the_perfect_neighbor_innocent_kids/"
    },
    {
        "id": "1od8kup",
        "author": "Hackedbytotalripoff",
        "title": "immersive  show  for Vision Pro on Netflix",
        "content": "After enjoying the immersive F1 trailer on my Apple Vision Pro, I'm ready to pay extra for Netflix shows produced for immersive films. When are they coming?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1od8kup/immersive_show_for_vision_pro_on_netflix/"
    },
    {
        "id": "1ode9zz",
        "author": "jamlapena",
        "title": "If Alice in Borderland games were based on modern-day jobs, what kind of challenges would each profession face?",
        "content": "I'll go first - surviving endless meetings that could have been an email, keeping my camera on, and trying not to make a bored face while pretending to pay attention. Bonus points if you manage to actually follow what anyone’s saying while your cat sits on your keyboard.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ode9zz/if_alice_in_borderland_games_were_based_on/"
    },
    {
        "id": "1ocuekz",
        "author": "DrMantisToboggan45",
        "title": "Anyone else getting an error “ui-801-ps4000” on their PS5?",
        "content": "Turned on my ps5 after work and it said Netflix had an error and needed to be reinstalled. I did it and this error keeps popping up as soon as I click the app. Reinstalled again, re did the wifi and restarted the console. It’s working fine on my phone, anyone else experiencing this? ",
        "upvotes": 19,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1ocuekz/anyone_else_getting_an_error_ui801ps4000_on_their/"
    },
    {
        "id": "1odc0yv",
        "author": "Affectionate-Pie8480",
        "title": "One Day",
        "content": "Just here to say I've just finished watching One Day and I'm unwell. This series will definitely be on the list of \"never watching it again\". \nDexter was definitely not the best guy ever, he fucked up multiple times and I wanted to punch him in the face so badly because of the way he treated Emma at the restaurant, but they were soulmates and they've been robbed of their future together. \nThis show has a moral: don't waste time confessing your feelings to the one you love, you might think you have all the time in the world but life is unpredictable and unfair.\n\nFuuuuck me, I'll never watch this show ever again.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1odc0yv/one_day/"
    },
    {
        "id": "1od2fla",
        "author": "ISRI999",
        "title": "Switching payment country",
        "content": "I moved from NL to Hungary recently and I want to switch my billing to a Hungarian card with the Hungarian cost of netflix. I currently pay the NL cost in my Hungarian card which is not cheap. What is the easiest way to do this without losing recommendations and accounts.\n\nI currently have the premium membership and I would be saving at least 5 euros a month with this change. My monthly payment is Oct 30. \n\nAny help is appreciated!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1od2fla/switching_payment_country/"
    },
    {
        "id": "1obzpbu",
        "author": "Serious_Article1750",
        "title": "The one moment in The Perfect Neighbor when we witness the true Susan Lorincz:",
        "content": "“WAIT A MINUTE!!!”\n\nIt’s bone-chilling. She sounds like a monster. In this moment, she likely thought it was one of the neighbours knocking, not a police officer. She doesn’t have time to put on her “I’m just a sweet old lady” voice with her various sob stories.\n\nThis is the real Susan.",
        "upvotes": 744,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1obzpbu/the_one_moment_in_the_perfect_neighbor_when_we/"
    },
    {
        "id": "1oct97g",
        "author": "Dmlandis59",
        "title": "how realistic is Boots?",
        "content": "is Boot camp really like that? Perhaps someone who was in the Marines in the 1990s could comment.  I do like how the use early 1990s technology / no cellphones but plenty of push button phones. And soundtrack is good /) ",
        "upvotes": 12,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1oct97g/how_realistic_is_boots/"
    },
    {
        "id": "1ocf3ez",
        "author": "dslryan",
        "title": "The Perfect Neighbor",
        "content": "This is INTENSE. It's such a fantastic documentary in the sense that it was all straight bodycam footage and no excess commentary. Heartbreaking story, especially when the officer asks the son \"Are you hurt?\" and he replies with \"No but my heart is broken.\"\n\nIncredibly well done documentary. I highly recommend watching it because of how it tells this story. Very sad, very gripping.",
        "upvotes": 53,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ocf3ez/the_perfect_neighbor/"
    },
    {
        "id": "1ocj398",
        "author": "Professional_Fig6820",
        "title": "What on earth happened to Season 3 of The Diplomat?",
        "content": "Is it just me or did Season 3 of *The Diplomat* suddenly forget how to be a good show? Zero tension, clumsy writing, and characters acting like parodies of themselves. Wild downgrade from the first two seasons?   \n",
        "upvotes": 31,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1ocj398/what_on_earth_happened_to_season_3_of_the_diplomat/"
    },
    {
        "id": "1odnthr",
        "author": "Lower-Bug5563",
        "title": "Wayward",
        "content": "So the good guys are bunch of drug addicts they/them and good guys are rehabilitation employees? Like how the audience is supposed to hate the characters who are actively trying their best to help teenage drug addicts? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1odnthr/wayward/"
    }
]