[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1obzuh4",
        "author": "snowbugolaf",
        "title": "The Perfect Neighbor - innocent kids",
        "content": "It’s the way the children don’t speak the swear words when they’re quoting Susan 😥 They’re just literally so, so strikingly innocent, playing kid games in the vacant lot as kids do.",
        "upvotes": 930,
        "comments": 516,
        "media": null,
        "permalink": "/r/netflix/comments/1obzuh4/the_perfect_neighbor_innocent_kids/"
    },
    {
        "id": "1obzpbu",
        "author": "Serious_Article1750",
        "title": "The one moment in The Perfect Neighbor when we witness the true Susan Lorincz:",
        "content": "“WAIT A MINUTE!!!”\n\nIt’s bone-chilling. She sounds like a monster. In this moment, she likely thought it was one of the neighbours knocking, not a police officer. She doesn’t have time to put on her “I’m just a sweet old lady” voice with her various sob stories.\n\nThis is the real Susan.",
        "upvotes": 380,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1obzpbu/the_one_moment_in_the_perfect_neighbor_when_we/"
    },
    {
        "id": "1oc11yy",
        "author": "misterDubzz",
        "title": "The Perfect Neighbor",
        "content": "This was an insanely emotional watch.  After them breaking the news about the mothers death, I found myself realizing. This is not something I feel comfortable having access to. What we saw was real unfiltered grief and pain in a very real situation. I don’t think I’ve seen something like that before.  The story is important and wow. What an impactful way to tell it. I feel like I don’t want to watch anything like this ever again. \n\nDid you enjoy it or did you feel it was too much? ",
        "upvotes": 83,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1oc11yy/the_perfect_neighbor/"
    },
    {
        "id": "1ocf3ez",
        "author": "dslryan",
        "title": "The Perfect Neighbor",
        "content": "This is INTENSE. It's such a fantastic documentary in the sense that it was all straight bodycam footage and no excess commentary. Heartbreaking story, especially when the officer asks the son \"Are you hurt?\" and he replies with \"No but my heart is broken.\"\n\nIncredibly well done documentary. I highly recommend watching it because of how it tells this story. Very sad, very gripping.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ocf3ez/the_perfect_neighbor/"
    },
    {
        "id": "1obq3x1",
        "author": "Friendly-Room-3272",
        "title": "Please tell me Netflix is renewing Boots",
        "content": "No spoilers here, but I’ve got to say, Boots has easily been one of my favorite Netflix shows of 2025 (honestly, maybe my favorite overall). They definitely left us on a cliffhanger, and I’m curious if anyone else thinks Netflix will renew it for another season?\n\nI really hope they do. There’s still so much to explore with the characters, and I’d love to see more of Cam’s journey as a gay man in the Marines. His character development has been one of the most interesting parts of the show. That said, Netflix can be unpredictable when it comes to renewals (I’m still not over Mindhunter, The Society, and 1899 being canceled). Plus, with the Pentagon’s criticism of the show, I worry Netflix might shy away from continuing it.\n\nStill, Boots was genuinely excellent and absolutely deserves a season 2. What do you all think?",
        "upvotes": 93,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1obq3x1/please_tell_me_netflix_is_renewing_boots/"
    },
    {
        "id": "1ocbvyf",
        "author": "SeargentDoaky",
        "title": "Beauty in Black S2",
        "content": "Never had a series speak to me like this show today. Great binge.\n\nI was watching the series earlier with my mum. Even she enjoyed the show. \nSadly she passed 3 months ago. \n\nNow I watch the new season alone. She passed due to cancer too. Not the easiest to get over mentally. \n\nI’m grateful for the lovely friends and family that supported me throughout this journey. \n\nTime to get that law degree 🥳 :) ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ocbvyf/beauty_in_black_s2/"
    },
    {
        "id": "1obhnyh",
        "author": "Longjumping_Land_977",
        "title": "The Perfect Neighbor: Susan Lorincz details her shocking crime in new interview from prison",
        "content": "",
        "upvotes": 260,
        "comments": 241,
        "media": null,
        "permalink": "/r/netflix/comments/1obhnyh/the_perfect_neighbor_susan_lorincz_details_her/"
    },
    {
        "id": "1obrord",
        "author": "AnotherDarnDay",
        "title": "The Perfect Neighbor... um, what?",
        "content": "Holy Crap. What the heck was this all about? \n\nMy sister and I watched this this afternoon and she said it was better than anything we've watched in the last 3 weeks. \n\nAll over kids, being kids, playing on property that is for the housing... technically a park as it wasn't her property. \n\nWas this because their skin was a different color, or was this just grumpy old lady syndrome? She really had it out for her neighbor. \n\nAnd jeez, 2 years the cops had been going out there to deal with her complaints about kids playing and yelling?\n\nAnd the end, jeez she really didn't want to get up out of that chair did she. She really thought she was going to get off. \n\nAnd that letter, 4 sentences that were me, me, me. I feared for my life, I thought she was going to hurt me. No remorse... God. This was delulu. \n\nI seriously do not understand this. Didn't she rent her house?",
        "upvotes": 58,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1obrord/the_perfect_neighbor_um_what/"
    },
    {
        "id": "1occvg8",
        "author": "Advanced_Bluebird925",
        "title": "Wayward, late to the party…",
        "content": "Just finished Wayward. 7/10. Immediately Googled “Wayward copied Midsommar” and found lots of discussion. Agree Wayward has “whiffs” of Midsommar as I saw it put in one post but what irked me the most was the inconsistency in talent/character development and the made-for-TV Hallmark Christmas  special feel that was so pervasive. Toni Collette is one of my fav actors (interesting she also starred in Hereditary, another Ari Aster film). \n\nThis was my introduction to Mae Martin and I fell a little in love with them! I read they not only directed the film but it’s based on both personal experience and a young friendship with someone sent to one of these “troubled teen” institutions. \n\nI would love to see a film length version as the series format felt watered down. More emphasis on Alex and Evelyn’s past could add more depth. Sydney Topliffe was really good but it didn’t feel like she had much to work with. I found Abbie’s story more interesting than Leila’s and if it were further developed, would have added depth to the character. Or maybe, just more character development in general would have made all of the roles more compelling if fleshed out. \n\nI guess it says something about the story itself that my main complaint is that I wanted more! Just felt thin to me which feels inexcusable for an 8 episode series, each around 45 min duration. \n\nHope not too harsh! I really did enjoy it and this is the first review I’ve ever contributed. Curious about similar (or not!) thoughts.  \n\n ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1occvg8/wayward_late_to_the_party/"
    },
    {
        "id": "1ocgiz7",
        "author": "No-Distribution-8320",
        "title": "Update your Household - EVERY TIME???",
        "content": "A few days ago I change my credit card, that I use for Netflix Payment. Ever since that, Netflix askes me to \"update my household\" on every TV that I use in the house - and every time I turn on Netflix. I must have updatet like 20 times now. Every TV is connected over an Apple TV, last and newest gen. This has not changed. It happens regardless if I use wifi or ethernet. Neighter one or the other has had any changes in the last months. Everything is at it has been for a long time. All Apple TV have been updated after the problem started - no change.  \nIts driving me nuts.... What can I do to make it stop?\n\nThx",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ocgiz7/update_your_household_every_time/"
    },
    {
        "id": "1ocghnv",
        "author": "WeirdWeirdo1984",
        "title": "Household workaround for Apple TV?",
        "content": "I’m getting the household error when trying to use Netflix on my Apple TV. I can still hear videos running in the background so the block seems to be similar to the blocks on a web browser. I’m wondering if there are any workarounds similar to web browsers also.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ocghnv/household_workaround_for_apple_tv/"
    },
    {
        "id": "1oc8huv",
        "author": "Last-Maize7926",
        "title": "The movie based on the 1970 Japan Airlines Flight 351 hijacking (Yodogo incident)",
        "content": "I wanna share my opinion about this movie which was released on Netflix and I have watched it very recently, there are so many incident happened where you actually will think that how this can even be possible and how the authority are actually doing such kind of things, my take on this movie.\n\nbased on my research this is the only incident happened in the history where a ministry has traded himself in exchange of released of the hostages, now you can say his duty or leadership but what he did was absolutely heroic.\n\nif anyone have watched the movie please share me your thought.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oc8huv/the_movie_based_on_the_1970_japan_airlines_flight/"
    },
    {
        "id": "1ocf8az",
        "author": "Apprehensive-Tip3266",
        "title": "Autoplay for downloads",
        "content": "I have a toddler, and we commute to see his grandad every weekend. I usually download a few of his favourite netflix shows to keep him happy on the drive. However, for some reason, despite me downloading enough to get him through the journey, they won't autoplay, so after a 20 minute episode I have an unhappy child distracting me with a healthy amount of roaring. I have enabled auto play in the settings, but I suspect this doesn't work for downloads. Anybody have a work around?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ocf8az/autoplay_for_downloads/"
    },
    {
        "id": "1ocf2g1",
        "author": "Far-Possibility8183",
        "title": "Kurt Cobain's documentary",
        "content": "Is there going to be a documentary for Kurt Cobain? I heard about a new documentary that would air in 2025 but I havent seen it yet. Is it going to air to Greek netflix? I've heard that netflix had the doc. Montage of a heck but I can't find it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ocf2g1/kurt_cobains_documentary/"
    },
    {
        "id": "1oc9iqb",
        "author": "Visual-Bass7966",
        "title": "does anyone remember this show",
        "content": "I remember in mid 2019/2020 there was that show that used to be on and it’s a lot like MTV cribs but 2010s rappers showing they’re house and I remember fetty wap was on there and had arcade machines and I remember another episode where trippie redd ate some spicy hot wings and couldn’t take the spice and got some cheesecake (I think) \n\nif anybody finds what the name , is it still available on streaming services ?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oc9iqb/does_anyone_remember_this_show/"
    },
    {
        "id": "1obvhwu",
        "author": "GoodGur9276",
        "title": "Taken in plain sight— {heavy sigh}",
        "content": "I am watching taken in plain sight, and while I know it’s a thriller, if the woman who is the main character breathes heavily and ragged one more time, I might have to stop watching before, knowing how it ends! I’m not sure there’s really a discussion here. I just couldn’t help but complain about how much this takes away from the story line.",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1obvhwu/taken_in_plain_sight_heavy_sigh/"
    },
    {
        "id": "1oca3kh",
        "author": "-Super_Scorpio-",
        "title": "Shows/Episodes/Ideas Netflix Needs to Run With…",
        "content": "Perhaps some of you have seen Neill Blomkamp’s brilliant experimental “TV Show” called “Oats Studios,” airing in 2021. As I suspected, Oats Studios was real and started in 2017 as a way to put together these 15 min long “pitch-videos” to see if they had actually had something. I watched the episodes the day they premiered on Netflix almost 5 years ago and still, to this day, I cannot stop wondering “what could’ve been.” \n\nA perfect example is Ep. 1, starring Sigourney Weaver, titled “Rakka.” Immediately, Bloomkamp bludgeons the audience over the head with an appropriately dark introduction to a world overrun by (Bloomkamp-esque) disgusting, sadistic, and barbaric race of alien creatures who can control human’s minds, are (in the intro) turning the Earth’s atmosphere into their home planet. Which is this disgustingly toxic shit - for lack of a better word - through the use of these enormous biospheres that literally poke through the earth’s stratosphere. In one line: we’re fucked. And Bloomkamp portrays all of this so profoundly well, it really makes you wonder if this wasn’t an actual premonition he himself had once, head deep in a night terror because it is just that. Terrifying. \n\nBut, there’s hope. Through human sacrifice, grit, determination, etc., and - what appears to be an omnipotent life-form wholly different from our current oppressors - they’ve come to our rescue, along with the help of a twisted machine of a man who‘s vile torture involuntarily transformed him into a precognitive, and potentially their best weapon to use to fight these monsters who’ve all but wiped out our entire species. \n\nAnd BOOM. Roll credits… huh?? \n\nAn even more intriguing “episode” imo was “Firebase.” Its Platoon meets Hellraiser. And it hits hard. The pace of 17 min film alone is enough to make you want to fight in a war. A seasoned vet in Vietnam is brought to a reclusive military base and is told a story by a CIA opp. (don’t know the actor’s name but wow, he’s phenomenal as the “straight” man telling the story) who’s high on the pay grade. \n\nThe story is about a man whose myth has taken on a God-like (Devil-like) identity. In fact his colloquial name is only known as “River God.” A normal Vietnamese farmer who’s met with such cruelty that his angst, rage, and hatred literally transforms him into something that only war could actually create. It’s an incredible take on the horrors of war and you start to cheer on the River God in a war due to the atrocities he’s faced in his previous life, brought on by the American troops. \n\nAnyway, “Firebase” has stayed with me forever. So I’m wondering if anybody else has MISSED a show they loved that was canceled (cough cough, The OA), or something like this where you wonder to yourself over and over again, “why the hell wouldn’t they bring this to fruition??”\n\nThose are just two of mine. I’d love to hear yours…\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oca3kh/showsepisodesideas_netflix_needs_to_run_with/"
    },
    {
        "id": "1obpkq3",
        "author": "cnn",
        "title": "Netflix announces new Kennedy family series starring Michael Fassbender",
        "content": "",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1obpkq3/netflix_announces_new_kennedy_family_series/"
    },
    {
        "id": "1oc3x7p",
        "author": "Kai_Kitterz",
        "title": "Netflix freezing whenever I pause/rewind on Roku",
        "content": "Idk if it's just my roku or if it's Netflix itself, but anytime I have whatever I'm watching paused for a couple minutes and I go to unpause, either nothing happens or the subtitles keep going as if it's playing, but there's no sound and the picture is frozen. Also when I try to rewind something it either does nothing, freezes, or the loading symbol pops up and stays at 0% and the only way to fix the issue is to completely leave the app which often causes the screen to glitch out a little then go to the home screen of my Roku, anyone else having the same or a similar problem with either Netflix or Roku?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oc3x7p/netflix_freezing_whenever_i_pauserewind_on_roku/"
    },
    {
        "id": "1ob7ipu",
        "author": "typetiming",
        "title": "something weird abt the perfect neighbor",
        "content": "Susan never talks about any of the other kids in the documentary. Out of all the kids that i could see maybe about 7 of them were black meanwhile there was an entire community of kids that were a mix of races from hispanic to white. \n\nI was honestly surprised the detectives didn’t bring up the fact that she only ever had issues with the black children and not the other children considering the parents of the other children, like that mom, would yell at Susan as well. I think them bringing this up might’ve strengthened their case about her obvious racism as well",
        "upvotes": 277,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7ipu/something_weird_abt_the_perfect_neighbor/"
    },
    {
        "id": "1oc7cza",
        "author": "Wonderful_Highway629",
        "title": "Boots love story is touching",
        "content": "The love story in Boots between Sullivan and Wilkinson is so touching.  I keep replaying their scenes and it makes me want to cry.\n\nI don’t even know why I feel this way as I am a straight woman but this forbidden love story is just so captivating.  Hats off to the actors, they really captured the emotional aspect well and draw the audience in.\n\nI haven’t been this captivated by unrequited love since The English Patient and Legends of the Fall. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oc7cza/boots_love_story_is_touching/"
    },
    {
        "id": "1oblh6n",
        "author": "ShadowPaws200",
        "title": "Netflix is probably the best thing that's ever happened to me",
        "content": "I don't really have friends to hang out with and I'm currently unemployed and looking for a job. In the meantime I have Netflix and can binge hours and hours of shows to watch. A lot of them seem to be really good and can kill some time while I'm not working lol. Sure am gonna miss binging Netflix when I get a job  again. Right now I'm watching Breaking Bad and loving it ",
        "upvotes": 23,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oblh6n/netflix_is_probably_the_best_thing_thats_ever/"
    },
    {
        "id": "1oc2k2m",
        "author": "DrMonocular",
        "title": "Found a Giant Stinker",
        "content": "If anyone wants to behold maybe the worst movie ever made, this one called Pets United has got to be on the podium. I feel like it must have been translated a few times before it got to English. Has the netflix logo so they paid to have this masterpiece foisted upon us. Worth a watch if you like to see bad movies for fun.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oc2k2m/found_a_giant_stinker/"
    },
    {
        "id": "1oaximx",
        "author": "SaltPomegranate4",
        "title": "The Perfect Neighbour is one of the most incredible documentaries I’ve ever seen.",
        "content": "Absolutely powerful. No narration. Just body cam footage acting as a first person account. Incredibly painful to watch. I cried a lot. \n\nThe anger that they didn’t arrest her. That they said “thank you” after she finally stood up to be taken to be charged. America has a big racism problem and it’s not just Susan Lorincz. \n\nIt’s an indictment on the US justice system that I had predicted she’d get away with it or given just a few years in prison. The absolute RELIEF when she got sent down. I hope she’s miserable for the rest of her days. \n\nWhat a beautiful community. I hope the boys and all the neighbours affected are supported through their pain. ",
        "upvotes": 796,
        "comments": 189,
        "media": null,
        "permalink": "/r/netflix/comments/1oaximx/the_perfect_neighbour_is_one_of_the_most/"
    },
    {
        "id": "1oc5nmf",
        "author": "Winter_Pangolin356",
        "title": "Looking for movies",
        "content": "So I tried looking for recommendations on other posts, but no one seems to think very similar. Looking for comedy/action/thriller movies. Some examples of my favorites\nPineapple express\nPaul\nEuphoria, I think it was(with Sam from transformers)\nAmerican pie\nSo I guess more comedy, but I loveeee me a good action movie too",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oc5nmf/looking_for_movies/"
    },
    {
        "id": "1oc59ky",
        "author": "Signal-Kween-7602",
        "title": "Dr. Susan Lorincz",
        "content": "Just for anyone that was looking for this info on Susan.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oc59ky/dr_susan_lorincz/"
    },
    {
        "id": "1obji7q",
        "author": "cass715",
        "title": "Netflix is just not truck driver friendly.",
        "content": "Me and my husband our long haul team truck drivers, we both stay on our truck for a month at a time and when we go “home” we stay with his parents one month and mine the next. We live in our truck. The update that requires you to be in the  “same household” completely stewed up our Netflix and I suppose we are just cancelling it at this point. We had been getting by without an issue until we took hometime and logged into it at my husbands parents, they have their own Netflix account and don’t use ours but now it’s saying we aren’t in the household when we are in the road.\n\nNetflix making this change is just really not traveler friendly, I understand why they made the change (although I think their corporate greed is disgusting). But it just doesn’t work for anyone who has a nomad lifestyle. It’s just a waste of money.",
        "upvotes": 23,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1obji7q/netflix_is_just_not_truck_driver_friendly/"
    },
    {
        "id": "1oc4izi",
        "author": "Wolfie9871",
        "title": "Does anyone remember there being a show called Video Game Friends",
        "content": "I can't really remember what it was about, but I think it was about a four friends that ended up getting detention and then they ended up having to clean an old video game room. They find a game within this old video game room and end up playing it together. Eventually they find out that there is a video game tortument and practiced for it. The group of friends end up winning the tortument. \n\nThe school thought about becoming a video game school. \n\nThe school had it to where you had to earn so many points to stay in school. Every month there was video game tortuments. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oc4izi/does_anyone_remember_there_being_a_show_called/"
    }
]