[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pr6ly8",
        "author": "TheMirrorUS",
        "title": "Anthony Joshua slammed as Netflix viewers claim Jake Paul fight was 'rigged'",
        "content": "# Anthony Joshua secured a sixth-round victory over Jake Paul, but fans claimed that the fight was rigged after barely any punches landed in the opening three rounds. Thoughts? ",
        "upvotes": 1165,
        "comments": 439,
        "media": null,
        "permalink": "/r/netflix/comments/1pr6ly8/anthony_joshua_slammed_as_netflix_viewers_claim/"
    },
    {
        "id": "1prc2ys",
        "author": "Notoriously_So",
        "title": "Netflix Has Stopped Allowing Streaming From Phone to TV: How to Watch Now",
        "content": "",
        "upvotes": 66,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1prc2ys/netflix_has_stopped_allowing_streaming_from_phone/"
    },
    {
        "id": "1pr08s8",
        "author": "Southern-Brother5693",
        "title": "James Bond Films To Air On Netflix As Part Of Shock Deal With Amazon",
        "content": "",
        "upvotes": 268,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pr08s8/james_bond_films_to_air_on_netflix_as_part_of/"
    },
    {
        "id": "1prfu83",
        "author": "PearBlaze",
        "title": "Shows like Teenage Bounty Hunters?",
        "content": "I watched this show and absolutely loved it but of course it got cancelled after a season, probably because of that stupid sounding title 😭. I need a show with the same vibes, similar setting, and similar chemistry between the leads. Thank you in advance.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prfu83/shows_like_teenage_bounty_hunters/"
    },
    {
        "id": "1pr9cpj",
        "author": "angryrobot5",
        "title": "What are the best Korean films and movies to watch?",
        "content": "I'm going to be doing a computer science internship in Seoul in the upcoming summer, so I wanted to ask if anyone here had any good recommendations for Korean media on Netflix so I can get an idea of how Korea is before the summer!",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pr9cpj/what_are_the_best_korean_films_and_movies_to_watch/"
    },
    {
        "id": "1prgqeb",
        "author": "ErSugo",
        "title": "netflix microlags worsen quality to 600p",
        "content": "Hello, I have been experiencing for a while now problems with netflix quality and I think it's not a netflix problem. I tried both chrome and edge(also netflix \"web app\" from w store) but after a minute of watching, a micro-lag worsen quality and audio is out sync until I go 10sec back to syncronize them back. It does these microlags again and again until 600p quality, even if it's set to max quality in netflix settings.\n\nI tried to deactivate all extensions, contact netflix about it, restart, activate and deactivate hardware acceleration, tried firefox, updated everything but it seems like I can't solve this problem. I have a surface pro x elite and internet connection is not the problem\n\nHas this ever happened to some of you guys? It's so annoying",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prgqeb/netflix_microlags_worsen_quality_to_600p/"
    },
    {
        "id": "1pqpo4u",
        "author": "ConversationHairy606",
        "title": "Looking for Netflix recommendations around crime, cybercrime, or privacy",
        "content": "I have been on a bit of a kick watching shows and documentaries about crime, cybercrime, hacking, data leaks, and privacy related topics.\n\nI have already seen a lot of the obvious ones, so I am hoping to find things that might be a bit less mainstream. Could be documentaries, docuseries, or even fictional shows that feel grounded in reality. Anything that explores how data is abused, how scams work, or how technology intersects with crime would be great.\n\nWhat are some good Netflix titles that fit that space",
        "upvotes": 70,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pqpo4u/looking_for_netflix_recommendations_around_crime/"
    },
    {
        "id": "1prgn3t",
        "author": "ImJstHrBcMyBrowser",
        "title": "Yakamoz S-245 a sequel i wasn't expecting",
        "content": "So i was watching \"Yakamoz S-245\" on Netflix, wich was pretty new. and i was well a little enjoying it, its not perfect but its got its flare. and at the end of the season i saw something genius... i saw the ending playing into the ending of \"Into the Night\". a Series wich i freaking enjoyed the hell off, mostly cause it gave me those SCP-001 vibes and cause the direction was awesome. Netflix gave me my unofficial sequel to one of my favorite Netflix originals. thx for that, too bad i couldn't enjoy more since that was the last episode, but holy cow what a rollercoster of emotions. #ThanksNetflixKeepItUp",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prgn3t/yakamoz_s245_a_sequel_i_wasnt_expecting/"
    },
    {
        "id": "1prg9u8",
        "author": "No-Syrup-3746",
        "title": "Volume drops after a loud scene",
        "content": "So many shows do the thing where there's a big action scene and then it cuts to a quiet dialogue scene. The dialogue is so low it's inaudible, and over the course of 30 seconds or so it fades back up to normal. I feel like this must a normalization issue, but maybe it's a buffering thing? I have fiber internet and no issues. This ONLY happens on Netflix so I assume the issue is not with my TV or setup.\n\nI have an old Samsung Smart TV, stereo setup. I have Netflix set to 2.0 audio out. I cannot change audio settings on my TV when using external speaker output. \n\nHas anyone else experienced this? Any ideas?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1prg9u8/volume_drops_after_a_loud_scene/"
    },
    {
        "id": "1prg2i8",
        "author": "haichauBK",
        "title": "I kept getting fooled by Netflix trailers...",
        "content": "...so I made this IMDb score checker\n\nHey everyone,\n\nI watch Netflix a lot, and honestly, trailers get me all the time 😂 I start a movie thinking it’ll be great, then halfway through I’m like… why am I still watching this. I’m sure a lot of you have the same problem, so I usually **check IMDb scores before committing**.\n\nChecking IMDb works, but it can get messy with too much info. So over the past few months, I built this small web app myself. It loads super fast - **just copy &amp; paste a Netflix movie link into the search box and it’ll show you everything: IMDb score, Rotten Tomatoes, movie summary, and user reviews all in one place**.\n\nAnd if you finish the movie and still feel confused, there’s also a direct link to **Reddit** so you can look up **plot discussions** right away.\n\nThe app is already available on the Apple App Store, and there’s also a web version if you prefer. I’m a self-taught dev, so I’d really appreciate it if you could try it out and leave some feedback. The app also supports multiple languages (French, Spanish...) for anyone who needs it 😃\n\nThanks a lot to the admin for approving my post!\n\nOn Apple Store: apps.\\[ \\]apple\\[ \\].com/us/app/movies-rating/id675623927  \nOn Web: netfliximdbscore\\[ \\].com\n\n(Remove the \\[ \\]) or view **the comment below 👇**\n\n**Sorry in advance, mods, I know sharing links isn’t usually allowed, but I genuinely believe this app can be useful for the community, so I hope you’ll consider making an exception. Thanks for understanding 🙏**",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1prg2i8/i_kept_getting_fooled_by_netflix_trailers/"
    },
    {
        "id": "1prea4b",
        "author": "ChapterScared3240",
        "title": "AJ vs Paul Replay?",
        "content": "On the replay it does not show the main event. Is my Netflix broken or are they not releasing that?\n\nI am trying to watch from the UK.\nI am pretty sure they have uploaded the Harvey vs Cervantes fight twice. \n\nAnyone experiencing the same thing? \nNetflix explicitly states that you can watch the replay on their service. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1prea4b/aj_vs_paul_replay/"
    },
    {
        "id": "1pqx2tt",
        "author": "ala_lala",
        "title": "Murder in Monaco: HELP",
        "content": "Just watched murder in monaco and there was no evidence presented. It was all people's personal opinions. Huge documentary watcher and typically we get evidence and facts but the only thing that was played was recorded calls with the nurse. Shout if you disagree but this was super subjective and I even tried to research after to no avail. Reddit pls do your thing and enlighten me 😭😭🙏🙏 (also tell me if you disagree, here for opposing viewpoints) ",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pqx2tt/murder_in_monaco_help/"
    },
    {
        "id": "1pr0tbp",
        "author": "L0v3_1s_War",
        "title": "STEEL BALL RUN JoJo’s Bizarre Adventure | Official Trailer | Netflix | Premieres March 19, 2026",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pr0tbp/steel_ball_run_jojos_bizarre_adventure_official/"
    },
    {
        "id": "1pqb7hx",
        "author": "Notoriously_So",
        "title": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 209,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pqb7hx/last_samurai_standing_renewed_for_season_2_at/"
    },
    {
        "id": "1pri7cj",
        "author": "scoutishbeauty",
        "title": "Netflix UX is the worst for neurodivergent folks",
        "content": "It feels like the neurodivergent community has been completely left out of any/all UX research focus groups and with every change they make it just gets worse and more frustrating.\n\nDoes anyone else feel this way? \n\nIt seems like they’re prioritizing form over function. \n\nI won’t list all of the things that bother me, but some of the newest changes that are particularly frustrating are: \n\nWith these large photo arrays you are now unable to see if you’ve rated any of them. I have ADHD (and am likely AuDhd) so my memory is complete garbage. I am very ritualistic about rating each thing so that I’m aware if I’ve seen it already. So, not only can I not see if I’ve rated (watched) but now when you click on said pictures it just goes straight into playing it. Now I’m wasting a bunch of time on just figuring this out and that’s really frustrating.\n\nTied into the above, the recommendations are now showing A LOT of things I’ve already seen which makes zero sense to me especially considering that I rate them so it’s pretty clear I’ve seen it from a data standpoint. \n\nFellow neurodivergent folks - what bothers you?\n\nNetflix UX really needs to do specific focus groups to help us with accessibility. I’m at max annoyance and I’m sure I’m not alone. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pri7cj/netflix_ux_is_the_worst_for_neurodivergent_folks/"
    },
    {
        "id": "1pr2b9t",
        "author": "hi5orfistbump",
        "title": "Harvey vs Cervantes",
        "content": "Why does it look like Cervantes shouldn't be in the same ring as Harvey? He looks timid, he spends more time tanking Harvey, not responding. Throwing swings after Harvey has moved out of his strike zone. I haven't followed combat sports for years, so I have no clue who either one is. But whoever put Cervantes in that ring should be fired. Harvey literally walked all over him.",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pr2b9t/harvey_vs_cervantes/"
    },
    {
        "id": "1pqsryt",
        "author": "starmaxeros",
        "title": "Netflix acquires gaming avatar maker Ready Player Me | TechCrunch",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqsryt/netflix_acquires_gaming_avatar_maker_ready_player/"
    },
    {
        "id": "1ppykae",
        "author": "Alternative-Gear3945",
        "title": "Mindhunter",
        "content": "I genuinely feel Mindhunter is such a well put show with the right story and the right pace. I don’t understand why the show was cancelled. If there is anyone from Netflix reading this please get the show back!!!!",
        "upvotes": 260,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ppykae/mindhunter/"
    },
    {
        "id": "1pqzkvb",
        "author": "Chuckyfan666",
        "title": "Favorite episode and why?",
        "content": "what's your Favorite episode of Stranger Things and why? Just curious as we approach the 2nd volume of the highly anticipated Season 5 which contains EPISODES 5 6 and 7. Also what's your predictions and theories for the Series finale? Would love to hear your thoughts on it anytime. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqzkvb/favorite_episode_and_why/"
    },
    {
        "id": "1pqzhpr",
        "author": "Best-Farmer6505",
        "title": "What your opinion on the Roblox games",
        "content": "I don't know if people know about them but there where (still are) Roblox games based on different popular Netflix stuff for an example Netflix nextworlds basically a crossover slop also rebel moon and one piece and a newer one squid game one that kinda sucks idk if people know of them the games mostly sucked",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqzhpr/what_your_opinion_on_the_roblox_games/"
    },
    {
        "id": "1pqytov",
        "author": "KennethBlockwalk",
        "title": "61st Street - Why the Dislike?",
        "content": "Based on critics aggregation (which, IMO, doesn’t mean all that much) and audience reviews. \n\nRealized its creator made Criminal Justice, the British show that became The Night Of—which I (and seemingly most) loved. That tracked for me; this show gave me similar vibes. \n\nThere’s no accounting for taste. I’m just curious what people don’t like about it. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqytov/61st_street_why_the_dislike/"
    },
    {
        "id": "1pqydwb",
        "author": "Boring_Potato2858",
        "title": "Netflix on PS3 freezes at the end of every episode/movie",
        "content": "It has happened to us a couple times now. We've been using Netflix on our Playstation 3 with no issues for a very long time (we've even watched the first part of Stranger Things season 5!), but now we're getting freezes for every movie we watch, and it always happens at the 10 last minutes of the movie or so.\n\nIs anyone else having the same issue?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pqydwb/netflix_on_ps3_freezes_at_the_end_of_every/"
    },
    {
        "id": "1pra4ix",
        "author": "Remarkable-Yard4860",
        "title": "Stranger Things Vol.1 felt Underwhelming.",
        "content": "I just finished Volume 1 of Stranger Things and wanted to share my thoughts.\n\n One of the main themes that made Stranger Things so great was the mystery and the constant feeling of not knowing what was going on, even though things were clearly happening. That uncertainty created real suspense. However, by Season 5, this theme feels largely lost. We already know about the Upside Down, Vecna, and the Mind Flayer, their origins, motives, and how everything connects, so the tension that came from the unknown is no longer there.\n\nAnother small nitpick is how the Upside Down is treated now. In the earlier seasons, it was shown as literal hell, with characters needing hazmat suits to even go in there. The narrative made it clear that you couldn’t stay for long, with deadly air and demogorgons everywhere. But now everyone is just roaming around the Upside Down, chilling, telling each other stories, and taking their time without a worry, which honestly feels ridiculous. \n\nAnyways just wanted to share my thoughts here have a good day.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pra4ix/stranger_things_vol1_felt_underwhelming/"
    },
    {
        "id": "1pq9o2x",
        "author": "CalebOnPoint",
        "title": "Netflix running ads on Reddit that spoil 2025 movies in a montage?",
        "content": "Has anybody seen the new ads on Reddit (might be other places too) where Netflix spoils all the movies from 2025? It's like a one minute spoil montage that's I guess trying to be funny or cool? What's your opinion on that? IMO seems kind of disrespectful but might just be me.",
        "upvotes": 30,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pq9o2x/netflix_running_ads_on_reddit_that_spoil_2025/"
    },
    {
        "id": "1pqwdab",
        "author": "JoeDerus",
        "title": "Has anyone been able to get their old account info/watch history back?",
        "content": "So haven't had Netflix in a while and was thinking about signing up again but was just wondering if there's any possible way to get your old info (watch history, etc) back? From what I've read they delete it after 10 months (one person said 2 years?) of inactivity. Just didn't know if was any tips or tricks or anything that can be done. Really bummed about losing all that stuff and figured couldn't hurt to ask. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqwdab/has_anyone_been_able_to_get_their_old_account/"
    },
    {
        "id": "1pq00zv",
        "author": "IntelligentYinzer",
        "title": "First Look at Sarah Paulson as Serial Killer Aileen Wuornos in 'Monster' Season 4",
        "content": "",
        "upvotes": 105,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pq00zv/first_look_at_sarah_paulson_as_serial_killer/"
    },
    {
        "id": "1prb37h",
        "author": "porche05",
        "title": "I am surprised by Netflix boxing coverage",
        "content": "First, I think it's great Netflix is getting into sports and I I love they are doing boxing events. With that said, are they stupid or something? Nobody wants to watch hours of some lame ass undercard. At 9pm the main event should start. If they did that everyone would be happier and more casuals would tune it. Why doesn't Netflix do this? ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1prb37h/i_am_surprised_by_netflix_boxing_coverage/"
    },
    {
        "id": "1pq7tkg",
        "author": "GlumBodybuilder4395",
        "title": "Why Did They Stop Doing Production For Nailed It??",
        "content": "Nailed it is one of my favorite comfort shows of all time what the hell happened?? Like why did they stop making new seasons was it a budget issue? I watched other baking shows but none of them hit the same like nailed it did.",
        "upvotes": 26,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pq7tkg/why_did_they_stop_doing_production_for_nailed_it/"
    }
]