[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ou98ka",
        "author": "bookbookitaita5",
        "title": "Ci sono altri posti in città come \"200 lire\" dove puoi giocare arcade games o giochi da tavolo mentre si fa aperitivo?",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ou98ka/ci_sono_altri_posti_in_città_come_200_lire_dove/"
    },
    {
        "id": "1ou9our",
        "author": "Virtual-Marzipan9664",
        "title": "gruppi/collettivi a Torino?",
        "content": "Ciaoo!   \nHo 21 anni, studio Psicologia e mi sono da poco trasferita a Torino.  \nMi piacerebbe iniziare a fare un po’ di volontariato o entrare in qualche associazione/collettivo per conoscere persone nuove, dare una mano e sentirmi un po’ più parte di questa città.  \nSono una persona piuttosto timida, quindi mi piacerebbe trovare un ambiente aperto e accogliente 🌿  \nMi interessano soprattutto i progetti legati al sociale, all’educazione o al benessere psicologico, ma sono curiosa anche di scoprire altri ambiti!  \nSe avete consigli o conoscete realtà attive in città, ve ne sarei super grata :-):-)",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ou9our/gruppicollettivi_a_torino/"
    },
    {
        "id": "1oua4tp",
        "author": "Kalifla88",
        "title": "Trovare lavoro ima Torino",
        "content": "Salve, ho 30 anni e cerco lavoro a Torino, ho \"provato\" agenzie per trovare lavoro ma sembra più serva a loro che a me(anzi è così lol). Sapete se negozi in centro cerchino tramite curriculum a mano? O per favore consigliatemi altri modi, grazie.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oua4tp/trovare_lavoro_ima_torino/"
    },
    {
        "id": "1ouex9a",
        "author": "sammysammy98",
        "title": "Quakcuno ha esperienza con l'autoscuola matricardi?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ouex9a/quakcuno_ha_esperienza_con_lautoscuola_matricardi/"
    },
    {
        "id": "1ou3es3",
        "author": "xBlenderman",
        "title": "my passport was stolen",
        "content": "Is there anything to do at all? I have a police report, but the police were extremely unhelpful... there were cameras pointing directly at the car but I was told I can't look at them only police can.\n\nI am US Citizen and if there's no hope I have to travel all the way down to Rome for an emergency passport...\n\nWould love any thoughts anyone has...\nIt was in a bag with my laptop, which, I know should har been with me, but I wasn't thinking for some reason.\n\nThanks",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ou3es3/my_passport_was_stolen/"
    },
    {
        "id": "1ott7y2",
        "author": "Travelwanderlust5",
        "title": "La miglior gelateria in città è la Romana e provate a farmi cambiare idea!!!",
        "content": "",
        "upvotes": 33,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/winwrtfwhi0g1.jpeg?auto=webp&amp;s=a10d57409dca9aba4ad8d688b913fb33eb0b831b"
        },
        "permalink": "/r/torino/comments/1ott7y2/la_miglior_gelateria_in_città_è_la_romana_e/"
    },
    {
        "id": "1oueqdt",
        "author": "CowEnvironmental3401",
        "title": "Migliori Panettoni",
        "content": "Migliori panettoni artigianali e quindi pasticcerie dove prenderli ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oueqdt/migliori_panettoni/"
    },
    {
        "id": "1oudvvb",
        "author": "Individual_Living_54",
        "title": "Casa in corso Giulio Cesare, è pericoloso?",
        "content": "Ciao a tutti.  Mi sto per trasferire a Torino per la magistrale e ho trovato una stanza molto graziosa in via Giulio Cesare, intorno al civico 50, quartiere Aurora. Qualcuno mi ha sconsigliato questa zona definendola molto pericolosa, mentre altri non sono d'accordo e invece la considerano semplicemente più popolare, ma non davvero pericolosa. Cosa ne pensate? Dovrei preferire questa casa, che come dicevo mi piace molto, o altrimenti, a parità di prezzo, una casa meno bella ma in una zona considerata più sicura? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oudvvb/casa_in_corso_giulio_cesare_è_pericoloso/"
    },
    {
        "id": "1ou9198",
        "author": "oscartistol",
        "title": "ATP Finals 2025 - N°2 biglietti 13/11/2025 - Tribuna Nord - sessione pomeridiana",
        "content": "IN VENDITA 2 BIGLIETTI EVENTO NITTO ATP FINALS 2025\n\nLUOGO: Torino, Inalpi Arena\n\nDATA: Giovedì 13 Novembre 2025 - Sessione pomeridiana (inizio ore 11:30 - un incontro di doppio + un incontro di singolare)\n\nTribuna NORD 201, Fila 9, posti 12 e 13\n\nOttima visibilità, senza ostacoli.\n\nN.B. l'ingresso alla Tribuna Nord dà anche l'accesso al campo di allenamento.\n\nBiglietti in formato PDF, da stampare su foglio A4 o da caricare su dispositivo mobile (telefono cellulare) per essere mostrati ai varchi d'ingresso.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8sifvbudnm0g1.jpeg?auto=webp&amp;s=c2f062edadbc7ebf3f924ab1025a2e3ed3191adf"
        },
        "permalink": "/r/torino/comments/1ou9198/atp_finals_2025_n2_biglietti_13112025_tribuna/"
    },
    {
        "id": "1ou2ovg",
        "author": "epico73",
        "title": "Problema con la scelta della tariffa sull'app della GTT",
        "content": "Ciao, sa qualche giorno sto avendo problemi con l'app della GTT con la scelta della tariffa dei biglietti; non mi fa visualizzare le scelte di acquisto, mi compare \"ops, qualcosa è andato storto\" su una banda rossa. Qualcuno ha riscontrato questo problema? Come posso risolvere? Ho provato a disinstallare ed reinstallare l'app più volte oppure togliere la connessione e i dati di navigazione internet, ma niente da fare.\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ou2ovg/problema_con_la_scelta_della_tariffa_sullapp/"
    },
    {
        "id": "1ou4cmm",
        "author": "FriendlyRaisin3789",
        "title": "Posto auto in Corso Dante o limitrofe?",
        "content": "Ciao a tutti,\n\nMi trasferirò a breve a Torino e sto cercando, senza sorte per ora, un posto auto in zona Corso Dante (verso il Ponte Balbis) ma anche limitrofe, tipo Corso Bramante.\n\nL'idea iniziale era quella di lasciare l'auto per strada, ma la cosa mi spaventa un po'.\n\nHo provato su Immobiliare ma nulla, quindi mi rivolgo a Reddit come ultima spiaggia.\n\nDove cercare posto auto in affitto a Torino oltre a Immobiliare.it?\n\nGrazie mille",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ou4cmm/posto_auto_in_corso_dante_o_limitrofe/"
    },
    {
        "id": "1otdj0w",
        "author": "Top-Analysis-887",
        "title": "“È stato l'appuntamento più folle e romantico di sempre”: sospesi nel vuoto a 85 metri di altezza in cima alla Mole Antonelliana!",
        "content": "Kasia Smutniak e Domenico Procacci sospesi a 85 metri d'altezza, lo scatto sulla Mole Antonelliana! La fotografia inaugura la mostra “Piano sequenza. La Mole”, dal 12 novembre 2025 al 1 marzo 2026 alle Gallerie d’Italia di Torino, in occasione dei 25 anni del Museo Nazionale del Cinema. Voi ci andrete?",
        "upvotes": 32,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g9acd4l5kf0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1otdj0w/è_stato_lappuntamento_più_folle_e_romantico_di/"
    },
    {
        "id": "1ots0j1",
        "author": "Outrageous_Lab_7106",
        "title": "Consigli techno torino",
        "content": "Non ho la più pallida idea di dove andare per una serata techno decente, qualcuno consiglia posti o anche serate questo weekend ?? ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ots0j1/consigli_techno_torino/"
    },
    {
        "id": "1ot88qf",
        "author": "Kernel_907",
        "title": "Se ci sei batti un colpo",
        "content": "Ciao a tutti, Torinesi e/o Torinesi adottati. Sono arrivata da poco e miei amici storici sono sparsi per il mondo... Comincio a sentire un po' la solitudine, c'e qualcuno nella mia stessa imbarazzante condizione che avrebbe voglia di un caffè random e qualche chiacchiera, oppure participare insieme a eventi/giochi, escursioni, random boh? Sembra ci sia molta gente qua che lamenta la stessa cosa, magari ci si puó dare una mano a vicenda! \nA bit of info about me: \nF37 , adoro natura ed aria aperta, sport, yoga, gochi da tavolo, parlare a vanvera di filosofia, psicologia, misteri criminali irrisolti, ridere molto, enigmi, escape room, sto andando a caso ora mi viene in mente questo. \nE non ho il dono della sintesi, come è facile capire da questo post.\nQuindi.. non abbiate paura dite amico ed entrate (cit) 🪷",
        "upvotes": 37,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1ot88qf/se_ci_sei_batti_un_colpo/"
    },
    {
        "id": "1otlyxz",
        "author": "TapDeep4522",
        "title": "Visiting Dec 8-10th (Couple from Sweden)",
        "content": "Hey everyone! 👋\nWe’re a couple, both 30, visiting Torino for 3 days. We love history, traveling, and exploring new places by day, and we party hard and enjoy good vibes at night.\n\nIf you’re around and would like to grab a beer, coffee, or just wander around the city together — hit us up! We’d love to meet fellow fun-loving travelers or locals who enjoy good conversation, music, and spontaneous adventures.\n\nCheers 🥂",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1otlyxz/visiting_dec_810th_couple_from_sweden/"
    },
    {
        "id": "1otqmys",
        "author": "herby162",
        "title": "Tartofu Pesto",
        "content": "Hello everyone,\n\nI am a tourist in town and am looking for a place where I can buy some fine truffle pesto.\n\nDoes anyone know where I can get some outside of the big supermarkets?\n\nMany thanks and regards :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1otqmys/tartofu_pesto/"
    },
    {
        "id": "1otj57x",
        "author": "Kaponidis",
        "title": "Parrucchiere capelli medio lunghi uomo",
        "content": "Ciao, qualcuno conosce un buon parrucchiere a Torino per uomo, che sappia gestire bene i capelli di media lunghezza?\nMi piacerebbe trovare qualcuno capace non solo di tagliare bene, ma anche di dare consigli su un look o un taglio adatto alla forma del viso.\n\n\nGrazie in anticipo :)\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1otj57x/parrucchiere_capelli_medio_lunghi_uomo/"
    },
    {
        "id": "1otcb6c",
        "author": "Bennyjoys",
        "title": "Posti buoni dove mangiare la Polenta a Torino?",
        "content": "Oggi è il mio ultimo giorno qui, sono venuta a trovare un’amica e vorrei mangiare la polenta. Dove posso mangiarla buona? Preferirei in zona San Salvario ma mi sposto un po’ se necessario",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1otcb6c/posti_buoni_dove_mangiare_la_polenta_a_torino/"
    },
    {
        "id": "1otilzh",
        "author": "Standard-Half-1685",
        "title": "Lavorare per AccessiWay a Torino",
        "content": "Ciao r/torino ,\n\nho un colloquio nei prossimi giorni con **AccessiWay** a Torino e vorrei raccogliere feedback **reali** da chi ci lavora o ci ha lavorato (o da chi ha contatti diretti là dentro). Il ruolo sarebbe nell’area **Marketing / Graphic Design**.\n\nHo letto alcune recensioni su Glassdoor: sono poche e negative, quindi mi piacerebbe avere un quadro più completo dalla community :)\n\nIn particolare, mi interessano:\n\n* **Organizzazione interna**: come sono strutturati i team (marketing/brand/content vs product/sales), chi decide le priorità, com’è il rapporto con stakeholder non-design.\n* **Processi e strumenti**: briefing, tempi medi, librerie/template, stack (Figma/Adobe, CMS), revisioni e handoff.\n* **Carico e ritmo**: carico di lavoro, gestione urgenze, equilibrio lavoro/vita.\n* **Crescita e onboarding**: coaching, feedback, percorsi di sviluppo, autonomia.\n* **Cultura e leadership**: comunicazione interna, trasparenza, clima tra le persone.\n\nSe preferite, va benissimo anche in **DM**.\n\nGrazie mille a chi condividerà la propria esperienza (anche anonima) 🙏",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1otilzh/lavorare_per_accessiway_a_torino/"
    },
    {
        "id": "1oteq1x",
        "author": "Ok_Swordfish_5870",
        "title": "matrimonio con rito civile - tempistiche?",
        "content": "Ciao a tutt\\*!   \nIo e la mia fidanzata stiamo organizzando il nostro matrimonio per il prossimo autunno con rito civile in comune. \n\nSul sito del comune dicono che fino alle pubblicazioni (180 giorni prima, quindi per noi a Marzo) non è possibile sapere se la data per la celebrazione del matrimonio è disponibile oppure no. \n\nNoi abbiamo però già fissato la location del ricevimento e vorremmo fare tutto lo stesso giorno: è possibile che non possiamo avere la sicurezza della data fino a marzo?\n\nQualcuno che ha già fatto questa procedura può aiutarmi a capire? Come avete fatto ad organizzarvi? \n\nGrazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oteq1x/matrimonio_con_rito_civile_tempistiche/"
    },
    {
        "id": "1ossliv",
        "author": "nebbiainbluejeans",
        "title": "Rugby Italia vs Sudafrica Allianz",
        "content": "Ciao, per stare in mezzo ai tifosi italiani all'Allianz per Italia vs Sudafrica quali sono le zone? (i posti ancora disponibili sono in foto)  \nSapete se faranno delle navette e da dove? Ci sono siti/pagine per restare aggiornati?\n\n  \nGrazie.",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/azl6agfsaa0g1.png?auto=webp&amp;s=768599f4b105902243187bf0716dd23943dbccf0"
        },
        "permalink": "/r/torino/comments/1ossliv/rugby_italia_vs_sudafrica_allianz/"
    },
    {
        "id": "1ot281n",
        "author": "sturmfrey",
        "title": "Activities or sports?",
        "content": "Ciao a tutti. Sono uno studente di polito e ho davvero bisogno di uscire di casa oltre ad andare a fare poli e studiare.\nAmo lo sport. Badminton, tennis tavolo, arti marziali, nuoto, atletica, ho fatto tutto ma all'improvviso sono arrivato qui e tutto si è fermato.\nIl fatto è che è costoso prendere lezioni o entrare in squadra e non ho amici con cui giocare né posti/attrezzature per giocare.\n\nQuali attività o sport posso fare? Gratis o a buon mercato?!\n\nSono molto interessato a imparare il tennis e ad entrare nel tennis, ma di nuovo è troppo costoso seguire un corso o persino affittare un campo.\nVolevo provare a nuotare, ma i costi sono di nuovo.\nVolevo provare a andare in bici ma ho fatto un'idea.\n\nSono solo perso e ho davvero bisogno di una guida. Grazie mille!! \n\n\n\nENG:\n\nCiaoo tutti. I'm a student at polito and I reallyy need to get out of the house apart from going to poli and study. \nI love sports. Badminton, table tennis, martial arts, swimming, athletics, I did it all but suddenly I came here and everything stopped. \nThe thing is it is expensive to take lessons or get in teams and I dont have friends to play with nor places/equipment to play.\n\nSo what activities or sports can I do? For free or cheap?!\n\nI am really interested in learning tennis and getting into it but again it's soo expensive to take a course or even rent a court.\nI wanted to try swimming but the costs again.\nI wanted to try biking but idk.\n\nI am just lost and really need guidance. Thank you so much!!\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ot281n/activities_or_sports/"
    },
    {
        "id": "1oskyx9",
        "author": "SafeZookeepergame573",
        "title": "Ciclofficine che si occupano di bici vintage?",
        "content": "Ciao a tutti, conoscete una ciclofficina che si occupa di bici vintage, che ne capisca e che sia appassionato di queste bici?\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oskyx9/ciclofficine_che_si_occupano_di_bici_vintage/"
    },
    {
        "id": "1osys0b",
        "author": "ExpensiveCarrot7026",
        "title": "Can anyone give reviews on WINS international school",
        "content": "Hey yall, I may be going to this school in future, and they have turned off their reviews, so has anyone gone there and can give their opinions on the school. Im an english speaker btw but learning italian",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1osys0b/can_anyone_give_reviews_on_wins_international/"
    },
    {
        "id": "1oshrsm",
        "author": "Zero3993",
        "title": "Scoppio o esplosione zona piazza Bernini CIT Turin?",
        "content": "Stanotte ho sentito uno scoppio zona piazza Bernini, CIT Turin . Sapete o avete sentito niente ?",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oshrsm/scoppio_o_esplosione_zona_piazza_bernini_cit_turin/"
    },
    {
        "id": "1oshycy",
        "author": "Interesting_Disk_926",
        "title": "Study space recommendations in Turin (coffee shops/libraries)",
        "content": "Hi, I am a student at Campus Enaudi and I am looking for study space recommendations in Turin (better if its near Campus Enaudi or Center).\n\nIt would be great if the place is a library or a cafe with a cozy atmosphere, plug points and food.\n\nI am so thankful if you can help me, I am far behind in my studies. Thank you",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oshycy/study_space_recommendations_in_turin_coffee/"
    },
    {
        "id": "1osoow4",
        "author": "Potential_Pick3644",
        "title": "lavatrice rotta rip",
        "content": "conoscete qualche tecnico di lavatrici che non prende un rene? Per fortuna la mia funziona ancora ma non gira il cestello (ho cercato tutorial online ma ho paura di peggiorare la situa)\ngrazie anime pie ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1osoow4/lavatrice_rotta_rip/"
    },
    {
        "id": "1oso3xr",
        "author": "Witty_Raisin9289",
        "title": "Inquiry about computer science master's program .",
        "content": "Hello, I am interested in pursuing a Master’s in Computer Science and would like to know if the University of Turin offers this program in English , because after doing some researches i found out that its only in italian .\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oso3xr/inquiry_about_computer_science_masters_program/"
    }
]