[
    {
        "id": "1jo4p54",
        "author": "ParvulosAMA",
        "title": "Hi, /r/movies! I am Isaac Ezban, director of PÁRVULOS: CHILDREN OF THE APOCALYPSE, an upcoming post-apocalyptic horror film. It's out in theaters this weekend. Ask me anything!",
        "content": "",
        "upvotes": 16,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vvnhx7eqd1se1.png?auto=webp&amp;s=1387fb720a15ced26a6a4b6745e610569c610215"
        },
        "permalink": "/r/movies/comments/1jo4p54/hi_rmovies_i_am_isaac_ezban_director_of_párvulos/"
    },
    {
        "id": "1joeht9",
        "author": "SanderSo47",
        "title": "March 28-30 Box Office Recap: Jason Statham's 'A Working Man' over-performs and tops the box office, while 'Snow White' collapses a horrible 66% on its second weekend. 'The Chosen' and 'The Woman in the Yard' had decent debuts, but 'Death of a Unicorn' flopped with just $5.7 million.",
        "content": "https://preview.redd.it/1vs90px2d3se1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b2ebc5ef1c093da9fe4611c8661655c971899f16\n\nA $270 million movie couldn't win against Jason Statham.\n\n***A Working Man*** over-performed projections and managed to steal the #1 spot, marking another win for Jason Statham. That was at the cost of ***Snow White***'s second weekend, which had a horrible drop amidst negative buzz and word of mouth. The rest of the newcomers was a mixed bag; ***The Chosen*** had a fantastic debut, ***The Woman in the Yard*** did okay, while ***Death of a Unicorn*** flopped.\n\nThe Top 10 earned a combined $68.4 million this weekend. That's off a poor 47.3% from last year, when ***Godzilla x Kong: The New Empire*** opened with $80 million.\n\nDebuting #1, Amazon MGM's ***A Working Man*** earned $15.5 million in 3,262 theaters. This debut is almost on par with Statham and Ayer's previous film, ***The Beekeeper*** ($16.5 million).\n\nAll in all, this is a great start, and it's a sign that Statham can still attract audiences to theaters after more than 20 years in the business. The premise and the trailers were basically what you come to expect from Statham: an \"ordinary man\" with a job, who is actually a badass guy who kills bad guys. That's not different from other Statham titles but remember: if it ain't broke, don't fix it. Which might be why Statham is still having a lucrative career, and is also one of the very few actors who only make theatrical films and zero TV shows. No amount of mixed reviews (52% on RT) will change the audience's mind here; with Statham, you know what you're getting.\n\nAccording to Amazon MGM, 60% of the audience was male and 37% of the audience was in the 18-34 demographic. It was a \"dad movie\"; 42% of the audience was 45 and over. They gave it a middling \"B\" on CinemaScore, below ***Beekeeper*** (B+). It's unlikely it can hold as well as ***Beekeeper*** due to the amount fo competition, but it should still finish with over $45 million domestically. Statham already has another film, ***Mutiny***, ready for January 2026 and it should also perform well.\n\nOh, ***Snow White***.\n\nYou know, we're not gonna act like there was hope here. The opening weekend fell way below expectations and the film posted some mediocre weekdays, indicating that the film would not have legs. Yet we weren't prepared for the second weekend drop.\n\n***Snow White*** earned $14.3 million this weekend. That's a brutal 66% drop, which is worse than any of the Disney live-action remakes. It's similar to the second weekend drop of ***Dumbo*** (60.4%), but that film had ***Shazam!*** ($53.5 million) and ***Pet Sematary*** ($24.5 million) as competition, while ***Snow White*** has almost nothing. This drop is a testament of negative buzz and word of mouth that has plagued the film.\n\nThrough 10 days, ***Snow White*** has earned a terrible $66.9 million so far. With ***Minecraft*** coming to take away its PLF screens, it will continue falling. One thing is clear from this: the film is gonna miss $100 million domestically, which is simply unbelievable. \n\nIn third place, ***The Chosen: Last Supper — Part 1*** surpassed expectations. Playing in 2,478 theaters, the film earned a pretty great $11.7 million this weekend. By far the best debut in the ***Chosen*** franchise. The second and third parts will be released on April 4 and April 11, respectively.\n\nUniversal/Blumhouse's ***The Woman in the Yard*** debuted with $9.3 million in 2,842 theaters. That debut is not far off from Blumhouse's ***Wolf Man***, which disappointed with just $10.8 million back in January.\n\nConsidering the very low buzz and anemic pre-sales, this is a very solid numbers. And it's a testament to Blumhouse's strength that they can get a nothing film like this to debut to almost $10 million. Especially considering the weak reviews (43% on RT). Perhaps with very few horror choices, ***The Woman in the Yard*** managed to attract an audience that really wanted to go to the movies.\n\nAccording to Universal, 55% of the audience was female, with its biggest demo women over 25 (31%). While it surpassed expectations, don't expect this to have a long life in theaters. It got a terrible \"C–\" on CinemaScore, which is the exact same grade as ***Wolf Man***. With competition on the way, it's unlikely ***The Woman in the Yard*** can make more than $25 million domestically.\n\nIn fifth place, A24's ***Death of a Unicorn*** flopped with just $5.7 million in 3,050 theaters. That's one of the worst debuts for a film playing in over 3,000 theaters, and it's another A24 misfire after the performance of ***Opus*** two weeks ago.\n\nComedy horrors can be a tough sell; A24's ***Y2K*** was another one of those which flopped back in December. Even with big names like Paul Rudd and Jenna Ortega attached, they have not found much success outside franchises. And despite the A24 name usually signaling quality, the reviews for the film were very middling following its SXSW debut (55% on RT).\n\nAccording to A24, 51% of the audience was male and its biggest demo was women over 25 (29%). They gave it a poor \"B–\", which is quite bad for a comedy. With so many options on the way, ***Death of a Unicorn*** will probably finish below $15 million domestically. That'd be disappointing.\n\nGKids re-released ***Princess Mononoke*** in 330 IMAX theaters this weekend, where it earned a pretty great $3.8 million. That took its lifetime total to $14.7 million.\n\n***Captain America: Brave New World*** eased 27%, adding $2.9 million this weekend. The film's domestic total stands at $196.6 million.\n\n***Black Bag*** went from second place to eighth place, dropping 48% and adding $2.1 million this weekend. The film has earned $18.7 million, and it's gonna finish with around $22 million domestically.\n\n***Mickey 17*** is nearing the end of its run. It dropped 47%, grossing $1.9 million. The film's domestic total stands at $43.6 million, and it's going to finish with around $47 million.\n\nRounding up the Top 10 was Paramount's ***Novocaine***, which continues its collapse. This time, it had a steep 60%, earning just $1.4 million this weekend. The film has amassed just $18.8 million, and it will make just $21 million at most. Practically the same amount as ***Companion***.\n\n***The Alto Knights*** didn't save face on its second weekend. It collapsed 65%, earning just $1.1 million this weekend. Through 10 days, the film has earned an anemic $5.5 million, and it's gonna gonna close with less than $7 million domestically. Pathetic.\n\nThe documentary ***The Encampments*** (which follows the 2024 Palestine solidarity campus encampments at Columbia University and other pro-Palestinian protests on university campuses during the Gaza war) broke records despite playing in just one theater (the Angelika Film Center in New York). It earned $76,419 this weekend, which is the biggest per-theater average for a documentary. It will continue expanding in a few weeks.\n\n#**OVERSEAS**\n\n***Snow White*** was still the biggest Hollywood entry, but it added just $22.1 million overseas. And that took its worldwide total to just $142.7 million after two weeks. The best markets are the UK ($8.7M), Mexico ($6.9M), Italy ($6.6M), France ($5.5M) and Brazil ($4.5M). Very brutal all around. With the way it's dropping, the film won't much further than $200 million worldwide. Hell, if ***Minecraft*** surprises, it could go sub $200 million. At a $270 million budget, that's a flop for the ages.\n\n***A Working Man*** debuted with $16.6 million overseas, for a pretty good $32.1 million worldwide debut. The best debuts were in China ($2.9M), Germany ($1.4M), Australia ($1.1M), Mexico ($1.1M), and the UK ($867K). With so many markets still left, this should get to $100 million worldwide easily.\n\n***Mickey 17*** added $5.2 million overseas, taking its worldwide total to $120.9 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Sonic the Hedgehog 3* | Dec/20 | Paramount | $60,102,146 | $236,115,100 | $491,115,100 | $122M\n\n- ***Sonic the Hedehog 3*** has closed with a fantastic $491 million worldwide. While it was later surpassed by ***Mufasa*** in daillies, the film is not a loser in the slightest. It's hard to be disappointed at a franchise where each film makes more than the one prior. Paramount already found their next big franchise, to the point that they already scheduled a fourth film for March 2027. That one should definitely hit $500 million.\n\n#**THIS WEEKEND**\n\nAfter years stuck in development hell, ***A Minecraft Movie*** is finally hitting theaters. The film stars Jason Momoa, Jack Black, Danielle Brooks, Emma Myers, and Sebastian Hansen, and follows four misfits who are pulled through a portal into a cubic world that thrives on imagination, having no choice but to master the world while embarking on a quest with an expert crafter named Steve. The trailers have been... quite terrible, to say the least. But despite that, the popularity of ***Minecraft*** is just too big that families will probably still watch it. Let's just hope the final film is less painful than its trailers.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 113,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_BHNyBFYKJY3B_DfV-mmZb2gqXgEpcCvm3ryS-kAv3s.png?auto=webp&amp;s=c19c70aa6dd8b00d9dd1f3083ba7860df28b9492"
        },
        "permalink": "/r/movies/comments/1joeht9/march_2830_box_office_recap_jason_stathams_a/"
    },
    {
        "id": "1jo48wo",
        "author": "MarvelsGrantMan136",
        "title": "‘Coyote vs. Acme’ Lives: Ketchup Entertainment to Release Shelved WB Film",
        "content": "",
        "upvotes": 17136,
        "comments": 932,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qGWE-9r6bYF_74CiGcIx3vqKhYEFeQ91OdDEF0sMmmQ.jpg?auto=webp&amp;s=3e62cc36193ae76f2f6951127068b76eaad24944"
        },
        "permalink": "/r/movies/comments/1jo48wo/coyote_vs_acme_lives_ketchup_entertainment_to/"
    },
    {
        "id": "1jo2ybl",
        "author": "ze11ez",
        "title": "Who’s a TERRIBLE actor/actress that improved exponentially with time?",
        "content": "Like the title, someone that sucked but has become 100000% better.  Maybe they were just starting out and couldn’t act.   Did some terrible movies, and over time they improved themselves into greatness.\n\nUsually someone starts out terrible and stays terrible.  Or they were great and are now not even trying",
        "upvotes": 3679,
        "comments": 3663,
        "media": null,
        "permalink": "/r/movies/comments/1jo2ybl/whos_a_terrible_actoractress_that_improved/"
    },
    {
        "id": "1jojmcc",
        "author": "Level-Lecture9178",
        "title": "Sydney Sweeney Circling Legendary’s ‘Gundam’",
        "content": "",
        "upvotes": 317,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4cj_hT1nsudklwyfqB7qbfxvY0V00y0c8CLMi_wT-M8.jpg?auto=webp&amp;s=a550449db939dd7e955ad8ed2fadf3ff32a9e9e9"
        },
        "permalink": "/r/movies/comments/1jojmcc/sydney_sweeney_circling_legendarys_gundam/"
    },
    {
        "id": "1joacr3",
        "author": "MarvelsGrantMan136",
        "title": "Kendrick Lamar, Trey Parker &amp; Matt Stone Movie From Paramount Delayed to March 2026",
        "content": "",
        "upvotes": 1062,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PN1rWJm2U1lPOEI9ER8L8VEQ3o9KoofEfd_v7-CsBL0.jpg?auto=webp&amp;s=b3f9c1de3520731f212404e7f992b403eac3b1f0"
        },
        "permalink": "/r/movies/comments/1joacr3/kendrick_lamar_trey_parker_matt_stone_movie_from/"
    },
    {
        "id": "1jo2ma4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24's 'Bring Her Back', Directed by Danny and Michael Philippou",
        "content": "",
        "upvotes": 1559,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oug438vpw0se1.jpeg?auto=webp&amp;s=c052d4e001263dd02025389f8a52f72ee625f85c"
        },
        "permalink": "/r/movies/comments/1jo2ma4/official_poster_for_a24s_bring_her_back_directed/"
    },
    {
        "id": "1jo3ckv",
        "author": "bawlhie62a2",
        "title": "I took an edible before Mulholland Drive, thinking it was going to be a lesbian romance. Holy. Shit.",
        "content": "My partner suggested we watch it and based on his description of it, I thought I was settling in for a chill lesbian love story with a bit of mystery. 30 minutes in I’m rolling with it. 60 minutes in there’s some unsettling moments (the espresso scene, the diner alleyway scene, the dead body in “Diane’s” apartment) where we’re like, “Did I understand what just happened?” and had to rewind. \n\nBy the end I felt like my emotions and trust were violated by David Lynch. The edible peaked right as Rita opened the blue box, and my soul left my body. The last 15-20 minutes was the craziest mindfuck I’ve ever experienced in a movie. I don’t know who I am anymore. Is Mulholland Drive even real? Are we real?? I had to stop thinking of Betty and Rita as real people for the longest time. It’s officially one of my favorite movies ever made, hands down. \n\nI don’t know if this makes sense but I just need to get this out there.",
        "upvotes": 992,
        "comments": 193,
        "media": null,
        "permalink": "/r/movies/comments/1jo3ckv/i_took_an_edible_before_mulholland_drive_thinking/"
    },
    {
        "id": "1jo0qzw",
        "author": "Amaruq93",
        "title": "It's Tough to Be a God: Dreamworks' \"The Road to El Dorado\" at 25",
        "content": "",
        "upvotes": 1262,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JrAC0cL9BiNJbReS2wWO2QgEkj83uS6O3WK1EzWkxBc.jpg?auto=webp&amp;s=789543abc1d50159d891d066e3fcd5d5ea02b087"
        },
        "permalink": "/r/movies/comments/1jo0qzw/its_tough_to_be_a_god_dreamworks_the_road_to_el/"
    },
    {
        "id": "1jo3nv7",
        "author": "Warm_Prompt_6911",
        "title": "Inglourious Basterds Ending",
        "content": "Just finished watching and I’ve seen a lot of people say Hans’ betrayal didn’t make sense but to me this ending was practically perfect.\n\nIn the first scene Hans harps on the importance of perception. The difference in treatment between rodents (rats and squirrels), and he also revels in the nickname awarded to him by the french (the jew hunter).\n\nHe also describes his ability to think like two different beasts, the hawk and the rat, which make him perfect for his role. For most of the film, he is positioned as a hawk as it’s beneficial but by the end we see his ability to align his identity with that of the rat to carve his name on the right side of history.\n\nI also noticed the constant readjustment of his badges throughout the film which I attributed to his receptivity to public opinion and general desire for respect. It makes why he’d prefer to be seen as a double agent rather than a soldier turned halfway through the war.\n",
        "upvotes": 775,
        "comments": 142,
        "media": null,
        "permalink": "/r/movies/comments/1jo3nv7/inglourious_basterds_ending/"
    },
    {
        "id": "1joaboz",
        "author": "Luv2006",
        "title": "What’s a really good film that was popular at the time but is rarely mentioned anymore?",
        "content": "What are some good films that used to be talked about a lot when they came out but you never really see them mentioned anymore? \n\nIt could be a film that came out years ago or one that’s more recent. Either way, what ones do you think deserve the recognition they had when they first came out? Hopefully I’ll find some hidden gems! ",
        "upvotes": 316,
        "comments": 1040,
        "media": null,
        "permalink": "/r/movies/comments/1joaboz/whats_a_really_good_film_that_was_popular_at_the/"
    },
    {
        "id": "1jo8jsp",
        "author": "JonasKahnwald11",
        "title": "New Posters for 'Karate Kid: Legends' - Starring Jackie Chan, Ben Wang and Ralph Macchio",
        "content": "",
        "upvotes": 358,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5hxh1xwf62se1.jpeg?auto=webp&amp;s=2a450acb490def3a5ead7ae428e49b8f4bf5d61c"
        },
        "permalink": "/r/movies/comments/1jo8jsp/new_posters_for_karate_kid_legends_starring/"
    },
    {
        "id": "1jo5as0",
        "author": "NoCulture3505",
        "title": "‘Star Wars' and ‘Ghostbusters' props among top-selling items at entertainment auction; Chewbacca's Bowcaster was top selling item ($768,000)",
        "content": "",
        "upvotes": 272,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bt-NOPgDX3B7CVxM_oPJkeZT7umLcana7Xtvq5VB64s.jpg?auto=webp&amp;s=6240c628313b1263b67feec3c804aa4b988259f8"
        },
        "permalink": "/r/movies/comments/1jo5as0/star_wars_and_ghostbusters_props_among_topselling/"
    },
    {
        "id": "1jo09uu",
        "author": "CNNsWorstEnemy",
        "title": "I was NOT expecting Pan’s Labyrinth to end like that",
        "content": "This movie has been on my watchlist for a long time and I finally got around to seeing it tonight.\n\nI thought the special effects were rly well done, especially the CGI given the time this\ncame out.\n\nI also loved the way this is more of a war period piece than a straight up fantasy, and how it blends aspects of fantasy into its very ground story!\n\nI was honestly expecting for it to be like a Tim Burton-esque “Labyrinth [circa 1986]” where after she first goes into the labyrinth it takes her on a magical journey, but I was pleasantly surprised how much of the storyline is just between the drama of fascists and the resistance. The moments of fantasy act as a nice addition to how Ofelia sees the world as a coping mechanism to the trauma around her (war, her mother’s sickness, etc.)\n\nI am so curious as to what was real and what was just in Ofelia’s head, because Vidal physically picked up the baby Groot fetus thing and threw it into the fire… but then the Pale Man wasn’t there from Vidal’s perspective when he chased her through the labyrinth, so can only she see these spiritual entities or..?\n\nI also just.. I was not expecting for her to die at the end let alone getting shot point blank like that. I haven’t been this shocked watching a movie in a long time, I was lying down and when that happened I shot my head up and sat up in pure disbelief, mouth agape, eyes watering. The ending made me cry fr seeing her in the afterlife reunited with her family and having the “prophecy” fulfilled for the “princess to return to the land of spirits/leave the land of mortals” wrapped up the fantasy aspects of the movie in such a way that made me rethink the meaning of everything fantasy-related that I just watched. \n\nWhat i didn’t like about the movie was that there are a few little blunders with the audio syncing  and also seeing someone who’s dead breathe for a slit second mildly takes me out of the movie for a sec, but other than that I give nothing but praise for this film. Praise for the costume designers who adorned the rich environments that brought colorful life into each scene, esp. the fantasy set pieces! Praise for the adult acting and the NOT god-awful child acting muchísimas gracias a Ivana Baquero por darnos un gran performance fr. Praise to how Del Toro worked his craft and made such a unique, eerie, curious, intense work of art that pushes boundaries and major took risks with its characters. Mad respect to u for that Sr. del Toro. What a wonderfully melancholic movie, I can’t wait to see it again with actual subtitles this time when i buy the blu-ray\n ",
        "upvotes": 545,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1jo09uu/i_was_not_expecting_pans_labyrinth_to_end_like/"
    },
    {
        "id": "1jnzn2e",
        "author": "KillerCroc1234567",
        "title": "Michael Mann Gives Update on ‘Heat 2’",
        "content": "",
        "upvotes": 618,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbU6rBEaP3EU2QeCcFU-4egsdguG9n4frVjuHMv32R8.jpg?auto=webp&amp;s=18bc4d9e1fd3e296e6e67b689760a0c29308f8b7"
        },
        "permalink": "/r/movies/comments/1jnzn2e/michael_mann_gives_update_on_heat_2/"
    },
    {
        "id": "1joeycz",
        "author": "jdcmopwjdmw",
        "title": "‘Bring Her Back’ Preview – The Directors of ‘Talk to Me’ Aren’t Missing a Beat",
        "content": "",
        "upvotes": 50,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T7DSJuSN9s13O8-wkBVGcKo3-HUWBn5IvStlIfVNqGs.jpg?auto=webp&amp;s=b617dba0d182617bd7b956b29ac8576e85479856"
        },
        "permalink": "/r/movies/comments/1joeycz/bring_her_back_preview_the_directors_of_talk_to/"
    },
    {
        "id": "1jogg6z",
        "author": "Spongemage",
        "title": "What is your favorite Alien movie?",
        "content": "I don’t mean the “Alien” film series (though it could be your answer). I mean YOUR personal favorite movie involving aliens. Maybe not the best alien movie ever made, but the one that you personally love and could watch over and over and over again. For me, personally, it’s War of the Worlds (2005). I think it’s a perfect mix of cinematography, acting, thrills, terror, action, and overall fun. But I’m very curious about how all of y’all would answer this question as I’m always looking for more alien movies. ",
        "upvotes": 36,
        "comments": 251,
        "media": null,
        "permalink": "/r/movies/comments/1jogg6z/what_is_your_favorite_alien_movie/"
    },
    {
        "id": "1joas5n",
        "author": "ChiefLeef22",
        "title": "50 Cent Horror Movie ‘Skillhouse’ From Director Josh Stolberg (Saw X, Jigsaw) Sets July 11 Release Via Fathom Entertainment",
        "content": "",
        "upvotes": 59,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dgPEGBPv6BRKz5U1uf7KTPjxqTzuXNKM9U6SGviuTHY.jpg?auto=webp&amp;s=1cb996d6e1e9ddf53935559998fed3eeefc26603"
        },
        "permalink": "/r/movies/comments/1joas5n/50_cent_horror_movie_skillhouse_from_director/"
    },
    {
        "id": "1jo2vys",
        "author": "KillerCroc1234567",
        "title": "AMC, Dolby Ink Deal to Fuel Expansion of Dolby Cinema at AMC Locations",
        "content": "",
        "upvotes": 150,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XDh3myJPV3dDzPZgWICgsYXrRFbmCypmid_CdqvBrok.jpg?auto=webp&amp;s=05271c0f1b925439cd02385066a35400ce0713e6"
        },
        "permalink": "/r/movies/comments/1jo2vys/amc_dolby_ink_deal_to_fuel_expansion_of_dolby/"
    },
    {
        "id": "1joesic",
        "author": "miss_spooky27",
        "title": "What deeply gut wrenching movie did you watch that you would recommend?",
        "content": "As the title reads, I need a good ugly cry. An outlet that will have me sobbing. I'm tired of feeling numb and need an emotional or soul touching kind of suggestion/s. If you could give me a few of your favourites you could lay your life on. I've seen a wide variety so hoping I come across something I haven't yet discovered. Godspeed my friends  🍀💞\n",
        "upvotes": 30,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1joesic/what_deeply_gut_wrenching_movie_did_you_watch/"
    },
    {
        "id": "1jnasrw",
        "author": "MarvelsGrantMan136",
        "title": "YouTube Turns Off Ad Revenue For Fake Movie Trailer Channels After Deadline Investigation",
        "content": "",
        "upvotes": 20020,
        "comments": 760,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fyOYJ48U4ZwZWFfi2tSW9BvW03M9so4B4zgM9lVmk70.jpg?auto=webp&amp;s=f90277025adb5c696c3d7c47d638a8583ee33a9a"
        },
        "permalink": "/r/movies/comments/1jnasrw/youtube_turns_off_ad_revenue_for_fake_movie/"
    },
    {
        "id": "1jojob5",
        "author": "saymeow",
        "title": "I’m having a really bad night, can you guys suggest a movie?",
        "content": "Been having a really rough time with my partner. Big fight and I’ve been bawling my eyes out since. \n\nI need something to watch. Distracting. Not a comedy. \n\nI don’t know what. \n\nI have Netflix, Amazon, Hulu, paramount+, hbo, peacock, appletv. Don’t mind paying a few bucks to rent one. \n\nThanks in advance: ",
        "upvotes": 11,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1jojob5/im_having_a_really_bad_night_can_you_guys_suggest/"
    },
    {
        "id": "1jo7p4e",
        "author": "Emeraldsinger",
        "title": "What original plans for a movie have you heard about that made you say to yourself \"thank God they didn't do that!\"",
        "content": "I watched a YouTube video where they talked about the original plans the writers had thought up for Back to the Future 2, and man it just sounds weird and very derivative of the first. Could've very much ended up being one of those bad 80's sequels to a beloved classic that everyone chooses to ignore today. But luckily, we got the brilliant sequel that part 2 is.\n\nWhat are your picks?",
        "upvotes": 47,
        "comments": 201,
        "media": null,
        "permalink": "/r/movies/comments/1jo7p4e/what_original_plans_for_a_movie_have_you_heard/"
    },
    {
        "id": "1jo448b",
        "author": "1whoisconcerned",
        "title": "My movie rewatch: The Town",
        "content": "I cannot speak highly enough about this movie. The movie posters make it look like a generic crime thriller but I can assure you it is anything but.\n\nThe acting, particularly from Renner and Affleck, is sublime, the script packs a surprisingly big emotional punch and the direction is artful without becoming corny.\n\nAbsolutely riveting from start to finish and - in a rare instance for me - every bit as good as the first time I watched it. 10/10 go watch if you haven't already",
        "upvotes": 76,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1jo448b/my_movie_rewatch_the_town/"
    },
    {
        "id": "1jnod5c",
        "author": "Bynairee",
        "title": "Blade Runner (1982) | Tears In Rain Monologue",
        "content": "",
        "upvotes": 1206,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/46H2o7ZybCKDQ-PGBf5wGfY8OFHb_ginUnzHVCgaL-I.jpg?auto=webp&amp;s=d3f181dd142c96c57a8f097bfb99d273db7eebcc"
        },
        "permalink": "/r/movies/comments/1jnod5c/blade_runner_1982_tears_in_rain_monologue/"
    },
    {
        "id": "1jok2b4",
        "author": "Wonder-Lad-2Mad",
        "title": "I watched Superman II: The Donner Cut (2006). I couldn't wipe the smile off my face. Beautiful practical effects, charming acting from everyone and all the Superman goodness I could ask for",
        "content": "I watched the original 78 Superman a year or two ago, I hadn't seen Superman 2, I had some time to give it a watch and decided to go with the Richard Donner cut to keep the consistancy. Omg I love, love, loved this movie. \n\n\nIt's so easy to love Christopher Reeves as Superman, but omg the extanded cast is great too. Margort Kidder is so adorable as Lois Lane, Gene Hackman (r.i.p.) is the perfect amount of comedic relief as Lex Luthor and Terrance Stamp has insane presence as Zod. What a voice, holy shit.\n\n\n\nThe practical effects in this movie blew my mind. I mean that genuinely and scinerely. I kept doubting the movie to manage and depict the powers of the Kryptonians at every turn, and I was constantly proven wrong. This movie makes you believe that a man can tear down a building with his hands.\n\n\nI can praise this movie up and down, the Kryptonian trio are a great addition to this movie over the first one. Zod and Ursa are so captivating.\n\n\nGod how did they manage to capture so much charm and imagination decades before the comic book movie was even a thing.\n\n\nThere are stakes in this movie, and yet it's so lightheared, it's an action story, but I enjoyed the romance of it, it's a silly cartoon and yet the drama is sincere and earnest etc.\n\n\nGod, I'm already craving a rewatch.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jok2b4/i_watched_superman_ii_the_donner_cut_2006_i/"
    },
    {
        "id": "1jok3i3",
        "author": "BathrobeMagus",
        "title": "Where to start with Bollywood?",
        "content": "I'm a 40 something year old American white dude who knows nothing about Bollywood movies except for some of the short clips of insane action scenes I've seen on Reddit. Where do I start? What movies exemplify different genres?\n\nI'm not really into rom-coms or dramas (there are exceptions). Horror, action, and comedies are more my thing.",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1jok3i3/where_to_start_with_bollywood/"
    },
    {
        "id": "1jnnkcs",
        "author": "KillerCroc1234567",
        "title": "David Zaslav Meeting With Candidates to Replace Mike De Luca and Pam Abdy as Warner Bros. Heads (Report)",
        "content": "",
        "upvotes": 902,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jjbtDijXTPZBW1YeeSgH-kFTA9sJGhZMOSz4ckNj7xQ.jpg?auto=webp&amp;s=11e29e18edb7fd6cb16f5f470f88041f5bfaeefc"
        },
        "permalink": "/r/movies/comments/1jnnkcs/david_zaslav_meeting_with_candidates_to_replace/"
    },
    {
        "id": "1jnnjkq",
        "author": "WorldsWeirdestidiot",
        "title": "Ever seen a movie that's had such a good premise. Such a good idea but was executed so poorly?",
        "content": "Ever seen a movie that you were really interested in? You really like the idea. Let's say it's a cool idea for a super hero movie. But everything that could go wrong. Went wrong. It wasn't a necessarily \"BAD\" Idea. You actually REALLY liked it. But the execution was just done so badly. All the characters were written badly, and plot made little to zero sense. BUT if it was executed differently... And written differently the idea could be a masterpiece, it was just a victum of bad writers who have zero idea of what thier doing.",
        "upvotes": 752,
        "comments": 1694,
        "media": null,
        "permalink": "/r/movies/comments/1jnnjkq/ever_seen_a_movie_thats_had_such_a_good_premise/"
    },
    {
        "id": "1joby4u",
        "author": "bbqsauceboi",
        "title": "High-Stakes Executive Drama Descends on CinemaCon: Who’s In, Who’s Out?",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FITyZ-lITumFxebOOO__gA_9O8IlayfKT-kKy5aEswA.jpg?auto=webp&amp;s=859f1d041dfe932516cca3bb822e63b279655e44"
        },
        "permalink": "/r/movies/comments/1joby4u/highstakes_executive_drama_descends_on_cinemacon/"
    },
    {
        "id": "1jo42mi",
        "author": "Ok_Response_6886",
        "title": "Dystopian sci-fi recommendations",
        "content": "I am into futuristic dystopian universes like blade runner, ghost in the shell, matrix etc. My criteria is it should have a main character in existential crisis and/or the main character should be kinda lost. Any movie recommendations? Series or books are also acceptable.\n\n(I dont know why I am specifically into this stuff)",
        "upvotes": 34,
        "comments": 136,
        "media": null,
        "permalink": "/r/movies/comments/1jo42mi/dystopian_scifi_recommendations/"
    },
    {
        "id": "1jojoz7",
        "author": "Business_Coffee_9421",
        "title": "If you like suspiria, or bright colorful movies like that….",
        "content": "Then check out the legend of hell house 1973. Really gorgeous looking movie, bright vivid colors which is the stuff I really really dig on movies. Not a bad little haunted house movie. I'm in the middle of reading the book now but it's gotten a bit boring tbh so I figured I'd check out the movie first. I'll still finish the book and see if there's differences but this one is a forgotten gem imo",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jojoz7/if_you_like_suspiria_or_bright_colorful_movies/"
    }
]