[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1q2d56w",
        "author": "TraffyLawOP",
        "title": "Dove si trova lavoro da studente straniero a Torino?",
        "content": "Sto cercando di aiutare un amico appena arrivato dall'Iran pochi mesi fa, si è iscritto all'università ma non puo iniziare perchè era troppo tardi, quindi ha perso l'anno scolastico. In ogni caso mi chiedevo come fa uno straniero a trovare un lavoro qui a Torino. Lui ha 27 anni e non parla italiano per niente, solo alcune parole importanti. Ha già un appuntamento per ritirare il permesso di soggiorno, ma la sua situazione è un po complicata perchè ha i soldi giusti per pagarsi l'affitto per un po' di mesi, però lui mi diceva che preferisce alla fine trovare qualsiasi tipo di lavoro e lascire gli studi per almeno potersi permettere di comprare cose di cui ha bisogno oltre a gli essenziali. \n\nGrazie in anticipo.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q2d56w/dove_si_trova_lavoro_da_studente_straniero_a/"
    },
    {
        "id": "1q2d630",
        "author": "OldEcho7229",
        "title": "Looking for help with VISA application",
        "content": "English:\n\nI am a PhD student under a joint supervision agreement between Morocco and Italy, recently signed, which requires me to spend 4 months per year in Italy. I am already enrolled at the Italian university, have paid the fees, completed the Universitaly registration, and the letter has been sent to the Italian Embassy. However, I am unable to book a visa appointment due to the lack of available slots, despite having a complete file. I am therefore considering hiring an immigration lawyer in Turin to contact the consulate or help unblock the situation, and I would appreciate any shared experiences, reliable lawyer contacts in Turin, and information on approximate costs and timelines.\n\nItalian:\n\nSono uno studente di dottorato in cotutela tra Marocco e Italia, con un accordo recentemente firmato che prevede una permanenza di 4 mesi all’anno in Italia. Sono regolarmente iscritto all’università italiana, ho pagato le tasse, completato la registrazione su Universitaly e la lettera di autorizzazione è già stata inviata all’Ambasciata italiana. Tuttavia, non riesco a prenotare un appuntamento per il visto a causa della mancanza di disponibilità, nonostante la documentazione sia completa. Sto quindi valutando di rivolgermi a un avvocato specializzato in immigrazione a Torino per contattare il consolato o sbloccare la situazione e sarei grato per eventuali esperienze condivise, contatti affidabili e indicazioni su costi e tempi.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q2d630/looking_for_help_with_visa_application/"
    },
    {
        "id": "1q22cx2",
        "author": "Much_Ordinary2728",
        "title": "Exchange year",
        "content": "I am doing an exchange year next year and I have an option to go to University of Torino. But I’ve heard that it might not be the best choice as most courses aren’t even in english. And my Italian is not good enough to do a whole semester in Italian. Normally I would just choose another city/university but Torino is my favorite because I am a Juve fan and I often travel to Torino for matches and now I would be able to go to every game and that plays a huge part for me. So I am wondering is it really that bad for exchange students? Thanks!!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q22cx2/exchange_year/"
    },
    {
        "id": "1q1t2wc",
        "author": "borisbanana77",
        "title": "Dove andare per neve con in bimbo",
        "content": "Ciao e Buon Anno!\nCerco un posto dove andare in macchina con mio figlio di 2 anni per giocare sulla neve, e se c'è spazio per usare la slitta, sarebbe un vantaggio.\nPreferibilmente vicino a Torino. Conosco Bardonecchia, ma è un po' lontana.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q1t2wc/dove_andare_per_neve_con_in_bimbo/"
    },
    {
        "id": "1q1cfzx",
        "author": "Select-Possession183",
        "title": "Ô amiki torinesi",
        "content": "Ciao amici,\nDal 12 al 15 sarò a Torino per una vacanza-svago. Premetto che conosco bene Torino, nel senso che è una città che ho visitato molte volte, motivo per cui vi chiedo: mi consigliate qualche posto del cuore, che sia ristorante (meglio se low-cost), musei, angolini, negozi, qualsiasi cosa?\n\nIo F29, amo la cultura underground, la musica indie, britpop e simili, l'arte, la letteratura, perdermi nei mercatini, i pub genuini... Insomma, cosine così.\nIn caso fosse utile: soggiornerò in zona San Salvario!\n\nInutile dire che se ci fossero persone coi miei stessi interessi e che in quei giorni abbia voglia di farsi un giro, scrivetemi pure.\n\nGrazie!!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q1cfzx/ô_amiki_torinesi/"
    },
    {
        "id": "1q1btte",
        "author": "speakisy",
        "title": "Sto costruendo un'app per fare amicizie vere da adulti (e vorrei il vostro feedback)",
        "content": "",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1q1btte/sto_costruendo_unapp_per_fare_amicizie_vere_da/"
    },
    {
        "id": "1q176je",
        "author": "Gejost_by_pierre",
        "title": "Road to sacra di san michele: do you need snow chains ?",
        "content": "Is it necessary to have snow chains if you want to go to sacra di san michele ? ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1q176je/road_to_sacra_di_san_michele_do_you_need_snow/"
    },
    {
        "id": "1q0kc25",
        "author": "Tetrapodus",
        "title": "Botti vietati a Torino che scoppiano lo stesso e cardiopatici che si sentono male come i cani e i gatti casalinghi. Che fare?",
        "content": "Chiedo agli amministratori comunali, alla polizia urbana e a tutti coloro che dovrebbero proteggere le persone e animali a rischio botti se hanno pensato ad azioni sul territorio di Torino per ridurre o debellare il fenomeno (completamente senza scopo a mio avviso).\nAbito vicino ad un giardinetto dove anche negli anni precedenti i botti impazzavano.  Sono appena stato operato al cuore oltre ad essere un disabile grave e una bomba Maradona non la sopporterei.\n\nVorrei sapere se qualche pubblico ufficiale che mi legge può rispondere alla mia domanda \"Che fare?\". Come intendete arginare il problema?",
        "upvotes": 48,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1q0kc25/botti_vietati_a_torino_che_scoppiano_lo_stesso_e/"
    },
    {
        "id": "1q0qg2c",
        "author": "Other-Experience9141",
        "title": "A un anno che muore",
        "content": "Auguri, se di auguri si può parlare, per l'inganno di un anno che sperate migliore del precedente.\n\nSembro tragico ma volevo essere poetico. Auguri comunque.",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q0qg2c/a_un_anno_che_muore/"
    },
    {
        "id": "1q0kffc",
        "author": "Exotic_Board2355",
        "title": "Disperato per capodanno ahah",
        "content": "Ho 21 anni ho la patente da 4 anni.\n\nPer capodanno gli amici si sono già organizzati con altri molti sono via, volevo andare in posto a Torino da solo, per andare a bere divertirmi e conoscere nuova gente, un posto chill se si può ahah",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1q0kffc/disperato_per_capodanno_ahah/"
    },
    {
        "id": "1q08vsh",
        "author": "Wise_Temperature9142",
        "title": "What’s happening in NYE?",
        "content": "Hi everyone! I’m spending New Years in Torino with my partner taking care of our friends’ house and pets. We’ve had a wonderful time here so far, but I’m wondering how people spend New Year’s Eve in Torino and what’s going on. \n\nAre there any public events or public gatherings anywhere worth going to or checking out? \n\nWe’re simple people and we don’t have anything specific in mind, we just don’t want to spend it doing nothing. Any tips would be appreciated. \n\nThank you, and happy new year to all! \n\n",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1q08vsh/whats_happening_in_nye/"
    },
    {
        "id": "1pzodjq",
        "author": "[deleted]",
        "title": "Guidare a Torino mi ha scioccato",
        "content": "Vivo spesso in giro e negli ultimi mesi ho guidato parecchio tra Firenze, Bologna e altre città: traffico, ZTL, caos “italiano”… ok. Però onestamente mi sono divertito a guidare lì: c’è confusione ma in qualche modo “funziona”\n\nPoi sono arrivato a Torino in auto e mi è sembrato di entrare in un altro mondo: strade che sembrano trascurate, segnaletica poco chiara in alcuni punti, doppie file, gente che taglia le corsie all’ultimo, frecce opzionali e in generale la sensazione è che al volante regni l’anarchia\n\nGuidare a Torino mi ha dato davvero l'impressione del “terzo mondo” in termini di organizzazione e ordine del traffico. La velocità delle auto è pazzesca, alcune persone guidano per 70 km all'INTERNO della città e tutti pensano: “Perché no?”\n\n  \nE poi vedo che la cronaca di Torino sta trovando il modo di controllare i monopatici, ed è veramente pazzesco",
        "upvotes": 134,
        "comments": 108,
        "media": null,
        "permalink": "/r/torino/comments/1pzodjq/guidare_a_torino_mi_ha_scioccato/"
    },
    {
        "id": "1q0blhu",
        "author": "InterviewOk2232",
        "title": "Ideas/plans for new year's even",
        "content": "Hi there I'm looking for interesting plans to do for today. I heard something about fireworks at piazza Castello...",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q0blhu/ideasplans_for_new_years_even/"
    },
    {
        "id": "1pzf2sx",
        "author": "_jorjoVhanni",
        "title": "Torino",
        "content": "Per cause di forza maggiore molto probabilmente mi toccherà passare il capodanno a torino lontano da amici e famiglia. Non che avessimo chissà che piani se non quello di passare il tempo insieme a divertirci fra giochi da tavolo ecc. Qualcuno che a cui l'ultimo dell' anno serve un +1 per qualche gioco? 🫠\nHo 30 anni e sono una persona tranquilla anche se a volte bestemmio senza rendermene conto 😅",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pzf2sx/torino/"
    },
    {
        "id": "1pzhv75",
        "author": "IndependenceEven6685",
        "title": "Serata underground a capodanno (31)",
        "content": "Ciao regaz,\nSono un ragazzo di 28 anni che gira intorno alla musica underground da anni, techouse, drum n base e simili.\nSto lavorando a un progetto indipendente tra musica, eventi e community e mi chiedevo, c’è qualcuno qui che per Capodanno ha voglia di fare qualcosa di diverso, non la solita serata commerciale? Non vendo nulla, non prometto miracoli. 🤣\nCerco persone allineate, che cercano situazioni con musica figa per rilassarsi e iniziare questo nuovo anno con stile.\nSe vi va di parlarne, scrivetemi in DM.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pzhv75/serata_underground_a_capodanno_31/"
    },
    {
        "id": "1pzfub4",
        "author": "Nice_Project9383",
        "title": "Tricologo Nicosia (o altri)",
        "content": "Sto cercando un buon tricologo dato che ultimamente ho notato un leggero diradamento dei capelli. Cercando online l'unico consigliato è Mario Nicosia. Qualcuno mi sa dire qualcosa? O se avete qualche altro tricologo da consigliare mi sarebbe di aiuto. Se preferite potete scrivermi in privato. Grazie mille :)",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pzfub4/tricologo_nicosia_o_altri/"
    },
    {
        "id": "1pzez01",
        "author": "Smart-Drawing-5266",
        "title": "renting prices/avaibility in turin",
        "content": "Hi, hope you're doing well, i want to apply to a masters in politecnico di turino but im tight on budget , so i want to know how much does it cost to rent there , like a room in a shared apartment , and is it hard/easy to find a place to live there (in case i didnt get a place in dorm)\n\nthanksss",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pzez01/renting_pricesavaibility_in_turin/"
    },
    {
        "id": "1pypmn5",
        "author": "Medium_Woodpecker887",
        "title": "Ma solo io ne ho le p... Piene dei cosiddetti Maranza??",
        "content": "Non mi interessa se sono pericolosi o no,sono comunque  disadattate per la maggior parte,,non voglio avere nulla a che fare,fanno venire la depressione,abbasso i Maranza,hanno rovinato i Torino.Datemi pure della persona che fa pregiudizi ma sembranot utti uguali,col loro ciuffo da bambino,la tuta tech o quella cavolata, TikTok,fisico da scaricatore di porto,zero personalità,arabi,le ragazze tutte da loro vanno almeno quelle adolescenti.Ben vengano i movimenti anti maranza.",
        "upvotes": 25,
        "comments": 80,
        "media": null,
        "permalink": "/r/torino/comments/1pypmn5/ma_solo_io_ne_ho_le_p_piene_dei_cosiddetti_maranza/"
    },
    {
        "id": "1pz07r8",
        "author": "Adventurous_Ice9047",
        "title": "Com’è vivere in zona Via Albenga / ex Villaggio Olimpico a Torino? Sicurezza e qualità della vita",
        "content": "Ciao a tutti,\n\nsto valutando l’acquisto (o affitto) di una casa in Via Albenga, zona Filadelfia / Lingotto, non lontano dall’ex Villaggio Olimpico.\n\nVorrei un parere da chi vive o ha vissuto in zona, in particolare su:\n\n•\tsicurezza (di giorno e soprattutto la sera/notte)\n\n•\teventuali problemi di microcriminalità o degrado\n\n•\tcom’è la qualità della vita quotidiana (rumore, gente che gira, servizi, mezzi)\n\n•\tse ci sono vie o isolati da evitare o differenze significative anche a pochi metri\n\nSo che a Torino spesso cambia molto da strada a strada, quindi ogni esperienza diretta è ben accetta.\n\nGrazie mille a chi risponderà 🙏",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pz07r8/comè_vivere_in_zona_via_albenga_ex_villaggio/"
    },
    {
        "id": "1pykez2",
        "author": "Long-Cat1830",
        "title": "Amicizie millenial, metal, dark humor, montagna e dintorni",
        "content": "Ciao a tutti, so che ci sono già molti post cerca amicizie ma sentivo il bisogno di inserire qualche specifica in più. \nHo 31 anni, donna, molto introversa ma ammetto che vorrei qualche conoscenza in più anche banalmente per scriversi e a volte vedersi. Interessi che mi piacerebbe condividere: artigianato, montagna, campeggio, musical alternativa, estetica gothic, argomenti scientifici, psicologici, linguistici, antropologici, DnD, dark humor, hobby silenziosi, natura, minimalismo, ambientalismo.\nLavoro come sarta ma ho studiato linguistica e mi interesso di pensiero scientifico. Autistica (ma non troppo XD) e misofonica, quindi a parte qualche birra (rigorosamente da Skjuma) o museo devo escludere posti affollato, cibi croccanti, incontri con più di 3/4 persone... Mi piacerebbe incontrare gente per visitare mostre, fare escursioni in montagna, giochi da tavolo/tè/puzzle in casa ecc. Una frequenza gestibile per me è una volta al mese più o meno, per il resto mi piacerebbe avere amici con cui scriversi.\nNo drammi, no gossip, no falsità o gesti di convenienza. Mi piacciono le persone curiose e riflessive, mi piace imparare da chi ne sa di più.\nSono a Torino nord.\nSaluti :)",
        "upvotes": 29,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1pykez2/amicizie_millenial_metal_dark_humor_montagna_e/"
    },
    {
        "id": "1pyqijk",
        "author": "Competitive_Pool7136",
        "title": "🥍 Vuoi provare uno sport nuovo a Torino? Giochi (o hai giocato) a lacrosse? Sei in Erasmus?",
        "content": "Ciao! Siamo la **sezione Lacrosse del CUS Torino** e stiamo **reclutando nuovi giocatori e giocatrici** per le nostre squadre!  \n👉 **Nessuna esperienza richiesta**: ti insegniamo tutto noi.\n\n💥 **Cerchiamo**:\n\n* Ragazzi e ragazze **in Erasmus a Torino** che vogliono continuare a fare sport\n* Studenti/lavoratori torinesi che vogliono **provare uno sport di squadra diverso dal solito**\n* Ex giocatori o semplici curiosi (sì, anche se non hai mai visto una partita!)\n\n📍 Allenamenti a Torino (Corso Enrico Tazzoli, 78 - 10137 Torino)  \n🤝 Ambiente super internazionale e inclusivo  \n🔥 Sport veloce, fisico e divertente\n\n📲 Scrivici in DM su Instagram @**torinolacrosse**  \n📧 Oppure via mail: [**lacrosse@custorino.it**]()\n\nSe hai domande, **commenta pure sotto** o contattaci direttamente.  \n**Ti aspettiamo in campo!** 🥍💪\n\nhttps://preview.redd.it/okufzm8656ag1.png?width=1620&amp;format=png&amp;auto=webp&amp;s=dd8daa490d4e9fcabd36a1e2a5b2bc51c8e5ab86\n\nhttps://preview.redd.it/fwmsfruq46ag1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=6cd32249dc6f566f3f720fe19c59957552864dfd\n\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyqijk/vuoi_provare_uno_sport_nuovo_a_torino_giochi_o/"
    },
    {
        "id": "1pyl398",
        "author": "SkyOk1181",
        "title": "Aiuto: esperto per rimozione muffa",
        "content": "Ciao a tutti!  Qualcuno conosce un bravo specialista per rimuovere la muffa, possibilmente con prezzi onesti? Sto cercando qualcuno affidabile nella mia zona e ogni consiglio è ben accetto. Grazie mille in anticipo!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pyl398/aiuto_esperto_per_rimozione_muffa/"
    },
    {
        "id": "1pyrr1r",
        "author": "ConstructionAny6977",
        "title": "Posto al barbillar",
        "content": "Ciao ragazzi, stasera io e 3/4 amici vorremmo andare al Barbillar e nessuno di noi c’è mai stato, ho provato a chiamare ma non risponde nessuno. Che voi sappiate si può/deve prenotare?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pyrr1r/posto_al_barbillar/"
    },
    {
        "id": "1py4ooo",
        "author": "AlternativeTea2226",
        "title": "Accompagnatrici A Torino Per Donne .",
        "content": "Ciao, spero di non essere fraintesa, sono una ragazza di 24 anni lesbica, dopo una lunga serie di inculate e tragedie nelle relazioni e dopo aver trovato tanta gente di merda ho preso una pausa dalla vita sentimentale e ho deciso di concentrarmi su me stessa e sul guarire anche da tutto questo . Peró, avvolte sento il bisogno di una presenza femminile, e mi sento sola, mi piacerebbe passare delle serate o delle occasioni o giornate con qualcuna (non sto cercando rapporti sessuali di nessun tipo, solo compagnia, massimo massimo coccole), possibilmente non eccessivamente piú grande di me, ma sui siti di incontri la situazione rischia di farsi seria, e io non voglio ritrovarmi coinvolta sentimentalmente ne coinvolgere qualcuno che magari si fa delle speranze, dopo tanti mesi di ricerche mi sono un po arresa e vorrei optare per un'accompagnatrice, ma non voglio una escort, voglio qualcuno che faccia l'accompagnatrice solo ed esclusivamente per donne, e che magari sia lei stessa lesbica, vorrei che la cosa fosse piacevole per entrambe e non una costrizione per l'altra persona, o sarei io la prima a sentirmi a disagio e a rifiutare . Sarebbe bello magari trovare qualcuno che cera la mia stessa cosa e lo farebbe gratis . Aiuti ? Di accompagnatrici per uomini c'è ne sono tante, neanche mezza per donne peró . Sto cercando su Torino massimo massimo Piemonte . Potete aiutare una povera lesbica col cuoricino spezzato che vuole compagnia ? Grazie in anticipo 😂 .",
        "upvotes": 24,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1py4ooo/accompagnatrici_a_torino_per_donne/"
    },
    {
        "id": "1py0rp2",
        "author": "Conan5678",
        "title": "A Torino da qualche anno, cerco nuove amicizie tranquille 🌿",
        "content": "Ciao!\nVivo a Torino da circa tre anni e mi piacerebbe conoscere nuove persone con cui far nascere un’amicizia genuina senza pretese.\n\nMi piacciono le cose semplici e rilassate: passeggiate, aperitivi, chiacchiere senza stress, musei, curiosare per la città e lasciarsi ispirare dal mondo intorno.\nHo anche un forte interesse per la natura, il folclore e l’esoterismo.\n\nPer me è fondamentale un clima aperto, rispettoso e sereno: cerco persone LGBT-friendly, tranquille e lontane da atteggiamenti omofobi o giudicanti.\n\nSe ti va di fare due passi, bere qualcosa o semplicemente scambiare due parole e vedere se nasce una bella amicizia, scrivimi pure 🌙",
        "upvotes": 22,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1py0rp2/a_torino_da_qualche_anno_cerco_nuove_amicizie/"
    },
    {
        "id": "1pyjvf7",
        "author": "ccrriissttian",
        "title": "localini soft",
        "content": "buondì a tutti, sono un terrone trasferito a Torino per lavorare da poco più di un mese.\nQuando non lavoro esco con un collega con l’identica situazione, ma dopo un po’ subentra la noia essendo sempre solo noi, volevo farmi consigliare qualche locale di “movida” (o semplicemente gente che beve due birre o qualche calice di vino) dove ci siano persone predisposte nel conoscere nuova gente. Nella mia città son pieno di amici ed uscivo tutti i giorni, forse è per questo che casa lavoro mi stia pesando. Ringrazio in anticipo, accetto ogni consiglio 🙏🏻",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pyjvf7/localini_soft/"
    },
    {
        "id": "1pyiy3b",
        "author": "republicflags",
        "title": "Prova Orange Palestre",
        "content": "Qualcuno ha un codice invito per la prova gratuita di una settimana delle palestre Orange ? Grazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyiy3b/prova_orange_palestre/"
    },
    {
        "id": "1pyh3ym",
        "author": "Foreign_Network1009",
        "title": "Traveling from Spain to Turin next february and looking to buy tickets for the family to see Juventus Lazio",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyh3ym/traveling_from_spain_to_turin_next_february_and/"
    }
]