[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 705,
        "comments": 5189,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nybuog",
        "author": "TheCruelHand",
        "title": "What the hell did they do to the Ed Gein story?",
        "content": "I get taking some creative liberties, but holy shit did they do everything they could make stuff up. \n\nIt will take any common person two seconds of research to learn that this isn’t how his life really was. \n\nIt is a major known fact that after his mother died, he boarded up her room and left it the way it was the day she died. And that he never dug his mother up. \n\nBut somehow here that’s exactly what’s happened?\n\nIt’s known he made furniture, bowls and a skin suit out of the people he dug up. \n\nI’m only on episode 4 and it’s like pulling teeth trying to watch this show at this point. \n\nAlso what with parallel story about Alfred Hitchcock that wasn’t shown at all in the trailers?\n\nRyan Murphy should not be allowed to make shows anymore.  \n\n\nUpdate - I’ve been corrected, he turned one of his victims into his “mother” and put his mother’s clothes on her. That is my mistake \n",
        "upvotes": 456,
        "comments": 291,
        "media": null,
        "permalink": "/r/netflix/comments/1nybuog/what_the_hell_did_they_do_to_the_ed_gein_story/"
    },
    {
        "id": "1ny08z4",
        "author": "Last-Upstairs1387",
        "title": "Netflix Has Gone Downhill",
        "content": "I’m bracing for downvotes, but hear me out: Netflix has gone down. Not crash-and-burn down, but a steady slide from must-have to “I’ll resub when there’s a buzzy release.” I get that plenty of people still love it, but what used to feel like discovery now feels like searching, and that shift matters.\n\nThe biggest crack is trust. Too many promising shows get axed after a season or two, so viewers stop investing. It’s hard to recommend something when you might be setting a friend up for a cliffhanger that never gets resolved. Netflix still lands hits, but fewer cut through the noise, and the middle tier—the quirky, mid-budget series that built the brand—has thinned out. What’s left is an awkward mix of glossy tentpoles and disposable reality.\n\nPricing and policies haven’t helped. Between tier reshuffles, an ad-supported option, and the password-sharing crackdown, Netflix asks for more while delivering less certainty. If I’m paying premium, I want premium clarity: finished stories, a strong middle class of originals, and an interface that helps me find them. Instead, the algorithm cycles the same tiles, autoplay shouts at me, and the Top 10 often reads like a marketing strip rather than a reliable compass.\n\nThe binge model, once Netflix’s superpower, is showing its limits. A full-season drop creates a weekend of hype and a Monday of amnesia. Competitors that pace releases weekly keep conversation alive longer, which builds community and anticipation. Netflix’s experiments with split seasons feel more like damage control than a coherent strategy for keeping shows in the zeitgeist.\n\nI know the counterpoint: scale demands broad bets. Serving the whole world means optimizing for averages, and averages don’t produce many cult classics. There are still gems—especially international series—but they’re buried under repetition and generic thumbnails. Personalization should feel like a path that widens as you walk it, not a carousel that loops you back to the same five options.\n\nWhat would winning look like? Start with a renewed commitment to finishing stories—greenlight responsibly and communicate clearly about endpoints. Reinvest in the mid-tier that keeps people engaged between megahits. Rethink curation beyond raw engagement: elevate human-programmed shelves, surface more staff picks, and rotate true discovery rows weekly. On product, make autoplay opt-in, expand “because you watched” with smarter, transparent explanations, and let users pin interests so the home screen adapts to them, not the other way around.\n\nAnd if you disagree, that’s fine. I expect pushback, maybe even a pile-on. But the criticism comes from a place of former love. Netflix made streaming exciting because it felt bold and curious. Lately, it feels cautious and crowded. The audience is still here, willing to be surprised. The question is whether Netflix wants to be surprising again.\n\nIf you’re still all-in on Netflix, tell me what I’m missing and what’s genuinely great right now. I’d love to be convinced to stay subscribed year-round instead of hopping in and out for the next shiny release.\n\n",
        "upvotes": 512,
        "comments": 179,
        "media": null,
        "permalink": "/r/netflix/comments/1ny08z4/netflix_has_gone_downhill/"
    },
    {
        "id": "1nyr4rt",
        "author": "Round-Refrigerator99",
        "title": "Spoilers for episode 9 of Haunted Hotel: How do you think Nathan did it?",
        "content": "I think he hung himself because when Nathan said how he thought he choked on grapes, Kathrine said \"Not exactly\" implying that he did choke himself in some way",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyr4rt/spoilers_for_episode_9_of_haunted_hotel_how_do/"
    },
    {
        "id": "1nyrqn0",
        "author": "G_R_2006",
        "title": "Do you Guys think Adaline was real in the Ed Gein story or his imagination",
        "content": "IMO\n\nAdeline Watkins was in his mind; she wasn’t real. It was his imagination that created her.\n\nMy arguments:\n\t•\tHe had schizophrenia, so he imagined many things that weren’t there or forgot things.\n\t•\tWhen Adeline came into his house and said she was going to clean up, she started doing that. But when the police arrived, you could see how filthy the place really was and that nothing had been cleaned.\n\t•\tThe psychologist in the series even said that he hears other voices encouraging him, when in reality, it’s his own thoughts. You can also hear Adeline saying, “Have sex with a corpse,” to Ed Gein. That was what he was thinking at the moment, but he thought she was the one saying it.\n\t•\tIn the last episode, it’s mentioned that the asylum has to make budget cuts, so it’s possible he wasn’t getting his full medication anymore. His schizophrenia might have partially come back, which is why Adeline Watkins appeared in his mind again.\n\t•\tIn the last episode, we see that she’s the same age as when Ed was arrested, so in his mind, she never aged.\n\t•\tBefore anyone argues that she had separate scenes without Ed Gein — like when she went to New York — Ilse Koch, the Nazi, also had scenes where Ed wasn’t present. He just wanted to make it seem real in his mind.\n\nI think they wanted to show us by him saying. Don’t kill people to her. He grew as a person and was saying to himself. I’m not going to kill people again. Because it is wrong \n\nI know she really existed; she said she had a relationship with him, but later she took it back.\n\nI think Ryan Murphy wants us to decide whether it was real or not since many people believe she actually had a relationship with him, while others say she was a liar.\n\nJust like in The Menendez Brothers, you also see the parents’ side — that they’re proud of their kids. Ryan Murphy does this to make us decide which side is real. That’s exactly what happens in this series — he wants us to decide whether she was real or not.\n\nLet me know if you disagree — I’m curious to hear your opinion on my theory.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyrqn0/do_you_guys_think_adaline_was_real_in_the_ed_gein/"
    },
    {
        "id": "1ny0evj",
        "author": "bbrennann",
        "title": "Charlie Hunnam as Ed Gein is bad casting and this seasons first episode strikes a weird tone",
        "content": "The tone of this show is weird\n\nOnly on episode one but here's some thoughts.\n\nHunnam is a strange choice. He's too hot and can't do an american accent and accounting for the strangest voice choice of all time, it just comes off silly and \"simple jack-y\".\n\n  \nAnd the TONE??? The show so far plays less like an upclose look at a monster like dahmer and has been this hypersexual tease of teenage girls talking about bras, flashes of nazi BDSM imagery and concentration camps cut together in an exciting way. he gets the images from a girl who looks so sweet she's bound to be his first victim. \n\nGein is portrayed as a hot and muscular horny weirdo with a terrible voice, who fails to bring life to a character with the same kind of tv-watchability as Evan Peters's  cold, scary, planning, broken, psychopathic predator \n\nI'm writing this after watching the ridiculous scene at the Nazi BDSM party where Jewish prisoners are sexually humiliated against their will. And again- it's just the tone. It was off. And this show so fare seems kinda sexploitation-y and bad acting and bad casting and idk if i can keep going. \n\nThoughts?",
        "upvotes": 88,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1ny0evj/charlie_hunnam_as_ed_gein_is_bad_casting_and_this/"
    },
    {
        "id": "1nym88m",
        "author": "BeefyIsTheBeans",
        "title": "Déjà vu, or absolutely messing with the general public? Monster: The Ed Gein story",
        "content": "I can’t be the only person who is absolutely adamant I have seen this exact series before. To a point of being able to describe an entire episode to my partner before he watches it. I feel like I saw it a few years ago and it’s really messing with me 😂 ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nym88m/déjà_vu_or_absolutely_messing_with_the_general/"
    },
    {
        "id": "1ny4p3l",
        "author": "PokeHunterLasVegas",
        "title": "Monster: Ed Gein thoughts ?",
        "content": "Why do they have him talking like Derek Zoolander? Seriously, whenever he talks I just hear \"I think Ive got the black lung...all I ever wanted was to make you proud pop\"\n\nIdk, watched the first 4 episodes and aside from thinking the blonde gf is a complete smoke show, idk, show kinda sucks",
        "upvotes": 34,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1ny4p3l/monster_ed_gein_thoughts/"
    },
    {
        "id": "1nyqw5a",
        "author": "mucid01",
        "title": "Some anime got English dub in the trailer but not in actual episodes",
        "content": "When I click on the anime like one punch man or overlord, it has eng dub in trailer, but when I try to watch the actual episode, it only has japanese audio. How to fix that",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyqw5a/some_anime_got_english_dub_in_the_trailer_but_not/"
    },
    {
        "id": "1nxvtl8",
        "author": "peoplemagazine",
        "title": "Charlie Hunnam Says He Lost 30 Pounds to Transform Into Infamous Murderer Ed Gein for Netflix’s Monster — and Opens Up About How Else He Prepared for the Role",
        "content": "",
        "upvotes": 82,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1nxvtl8/charlie_hunnam_says_he_lost_30_pounds_to/"
    },
    {
        "id": "1nybz54",
        "author": "GlassPudding",
        "title": "another wayward review",
        "content": "the concept for the show was fun and interesting, but i felt like it could have been twice as long with more interesting character/plot development or half as long with less plot holes. \n\nhowever - i am so sorry to say i think mae martins performance in this show is some of the worst acting i’ve ever seen. idk if its a botox thing, but i truly did not see a single expression cross their face besides (eyes wide, mouth slightly open) for basically the whole series. kudos for them for writing something interesting but maybe staying on the writing side is better",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nybz54/another_wayward_review/"
    },
    {
        "id": "1nynish",
        "author": "Visible_Judgment8942",
        "title": "Series like You",
        "content": "I wasn't a thriller guy but i gave a shot to \"You\" and i absolutely loved the serie ! Penn Badgley is so good in his role it's awesome, i watched it all and now i need new series like that to watch.\n\nAny thriller recommendation ?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nynish/series_like_you/"
    },
    {
        "id": "1nync9x",
        "author": "uninterested-cigaret",
        "title": "How to fix black stuttering while streaming on Mac book",
        "content": "I'm trying to stream a film and I keep getting this black stuttering affect, like blinking on my screen. \n\nI have tried restarting my laptop but it's still persisting. What other things could I try to stop this from happening?\n\nMy Internet speed is very fast so that's not a problem.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nync9x/how_to_fix_black_stuttering_while_streaming_on/"
    },
    {
        "id": "1nxx769",
        "author": "schi__zoid",
        "title": "Monsters: Ed Gein - there's something off about the show",
        "content": "I don't know how to describe it. I'm halfway through, and it feels like there's an exaggeratedly slow pace, with too many details and distractions meant to... increase the disgust? IDK - as if the story itself isn't  enough.\n\nAnyone else felt this way?\n",
        "upvotes": 45,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1nxx769/monsters_ed_gein_theres_something_off_about_the/"
    },
    {
        "id": "1nydm35",
        "author": "Cailleach27",
        "title": "Steve movie",
        "content": "Bravo Netflix.  Just Bravo.\n\nThe world needs more movies like this right now.  Thank you for shedding a light on what it means to be a “throw away kid” and the true meaning of courage\n\nI’m blown away",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nydm35/steve_movie/"
    },
    {
        "id": "1nych2n",
        "author": "PhotographOdd7120",
        "title": "Monster:Ed Gein",
        "content": "I just finished Monster: Ed Gein and while I do think that the story itself is sad not that I condone what he did but it was hard to stay with the story line. One minute you see Ed then you see the scenes jumping back and forth the movies Psycho, Texas Chainsaw Massacre, a scene from Silence with the lambs. With Dahmer and The Mendez brothers it’s straight to the point but with this one it’s hard to stay with the story line. The Adeline character doesn’t help any and she kinda bugged me but I don’t know why. ",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nych2n/monstered_gein/"
    },
    {
        "id": "1nxldkf",
        "author": "millzbill",
        "title": "Netflix loses $20 billion in value as stock drops in its worst week since April.",
        "content": "",
        "upvotes": 267,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1nxldkf/netflix_loses_20_billion_in_value_as_stock_drops/"
    },
    {
        "id": "1ny340o",
        "author": "Sweaty-Toe-6211",
        "title": "Halo TV Show Hits Netflix, Quickly Becomes One Of The Most Popular Shows On The Platform",
        "content": "",
        "upvotes": 19,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ny340o/halo_tv_show_hits_netflix_quickly_becomes_one_of/"
    },
    {
        "id": "1nyljva",
        "author": "Fluid_Ad_6159",
        "title": "Can anyone help me understand this?",
        "content": "So I was on Netflix and I noticed Dexter was on it. And I was like \"oh, cool, Dexter\" so I watch it on my phone, go to sleep, wake up, put Netflix on the tv and it wasn't there. It's on my phone but it isn't on my tv. Why is that?",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nyljva/can_anyone_help_me_understand_this/"
    },
    {
        "id": "1nykipx",
        "author": "Far-Requirement121",
        "title": "Custom Netflix intros in their original shows",
        "content": "I was rewatching both Stranger Things and Squid Game's first seasons, and I was surprised when I saw a custom intro of the logo in both of these shows. \nI didn't remind seeing this when I watched them back in their days. Do they do the custom intros always with their originals or do they only do it if they become a hit?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nykipx/custom_netflix_intros_in_their_original_shows/"
    },
    {
        "id": "1nykhv2",
        "author": "HoneymoonAstronaut",
        "title": "Help me find a Netflix comedy series I watched before 2020",
        "content": "Hi everyone! I'm trying to find a Netflix comedy series I watched around 2019, but I can't remember the name. Here's what I remember:\n\nIt's a comedy with a young female protagonist.\n\nShe has two friends (I think).\n\nThe vibe is very much like a typical Netflix teen/young adult show, similar to Bonding or Never Have I Ever.\n\nI only remember one scene from the finale: the protagonist decides to uninstall Twitter. She hesitates because she doesn't want to lose her draft tweets, but one of her friends says, \"If they were good, they wouldn't be in the drafts.\"\n\nThe series had only one season and was released before 2020.\n\n\nAny help would be amazing! Thank you!\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nykhv2/help_me_find_a_netflix_comedy_series_i_watched/"
    },
    {
        "id": "1nykbho",
        "author": "Specialist_Muffin695",
        "title": "Billionaire bunker",
        "content": "Okay hear me out is it just me or is this show completely made with AI?? It’s so clearly obvious it’s not even funny. During episode 6 while Mimi is being assessed by the AI system you can hear random discord noises throughout the scene. \n\nHands are disfigured in multiple scenes\n\nAnyone else get this vibe or I am just trippin?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nykbho/billionaire_bunker/"
    },
    {
        "id": "1nyedot",
        "author": "LongRefrigerator2756",
        "title": "Ed Gein",
        "content": "What do you think the purpose of the character Adeline in the show ? Is she a delusion to show the depth of his schizophrenia ?  A manifestation of his id ? Random fluff ? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyedot/ed_gein/"
    },
    {
        "id": "1nyjfj3",
        "author": "Outside_Sherbert6301",
        "title": "Laughed",
        "content": "Ok. So I watched ed grin last night,  I must admit I was a bit stoned when I turned in, so I’m not sure was this in parts very funny?  I think I laughed so hard at parts then I’m like oh hold on this is serious.  So can someone tell me was I\nJust really stoned or was it funny?    Please be kind I take it for pain and insomnia, but it’s still fun sometimes. I’m old!! lol 😂 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyjfj3/laughed/"
    },
    {
        "id": "1nyjbin",
        "author": "Cute-Network-7837",
        "title": "Ed Gein - Episode 4 - Did Bernice really have venereal disease or was it just a hallucination? SPOILERS!",
        "content": "I'm in the middle of episode 4, and I think if Eddie wasn't mentally ill, Bernice could have been his saviour. She was accepting of his strangeness. Letting him be himself and wearing her underwear, I'm so sad about her end 😢 \nShe wasn't well herself, but she was finally feeling like she was loved, and I think Eddie actually liked her as well. She was an older woman, so the mother figure he needed along with the comfort of being a female companion.\n\nIt's such a shame he went back and spoke to 'mother' and then did what he did to Bernice. \n\nBut I can't seem to figure out if she actually did have venereal disease or not.. was it just a hallucination after the years of his mother talking him into a crazed state? \n\nEDIT - After watching the rest of the episode, my question is still unanswered, but Adeline is just as crazy as Eddie... she's super twisted. \nShe's the reason why Eddie is as crazy as he is, but does anyone think if she hadn't shown him the photos in episode 1, he would have still become the crazed killer he was? In episode 4, she took a photo of Bernice after being hung and mutilated and didn't even flinch, I mean most people would see photos and be like 'woah' but seeing in real life, would have reacted abit more freaked than she was... is she hoping to shape up to be the next 'Weegee'? Where he's fictional or not?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyjbin/ed_gein_episode_4_did_bernice_really_have/"
    },
    {
        "id": "1nyfl15",
        "author": "SpaceHairy",
        "title": "Blindspot touched me in a way no show ever has.",
        "content": "I know what you’re thinking. It’s crazy that I’m saying this about an NBC show, and I don’t know if anyone will read this or care but I gotta get the words out. This show was beyond amazing. Say what you want about the filler, the repetitiveness, whatever. But Blindspot has arguably the most impressive full circle story, beginning to end, staying true to its core in ways that I feel like you don’t see in a lot of shows anymore. I couldn’t help but feel so deeply connected to the characters and their lives, and getting to see familiar faces through flashbacks/hallucinations was so comforting. Yes, the show is wildly farcical in literally every episode, but what’s the difference between accepting the realities of a sci-fi show and embracing strange realities in a show that takes place in “real life?” This show was extremely clear from the first 5 minutes that nothing it presented was going to be normal, and by god it wasn’t. But dammit I LOVE that about it. The creators and the cast cared so much about the depth of the plot and it really shows, and I am genuinely really sad that I have run out of episodes to watch and that the ending was so damn bittersweet. I really hope that any past or current watchers who saw it all the way through - because quitting at any point before the 100th episode is robbing yourself of the beautifully closed loop, complex and heartbreaking character arcs, and also knowing the truth that the story really does continue, but maybe not in the way you want - feel as touched as I do by the story, it’s amazing characters, and what it all meant in the end. It’s an isolated, hidden gem, that other amazing shows (like Lost - despite it’s brilliance) just cannot replicate in the same way. Or if they have, I haven’t seen them. \n\nThe craziest part of all this for me is that this show had been recommended to me by netflix for MONTHS, and I skipped over it because the poster looked too NBC and my assumptions got the better of me. What a fool I am. Never judge a show by it’s poster, you may be missing out on a truly touching experience. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyfl15/blindspot_touched_me_in_a_way_no_show_ever_has/"
    },
    {
        "id": "1nyitq7",
        "author": "Fair_Anywhere_788",
        "title": "Black Rabbit 🐇 Betrayal",
        "content": "It is almost 3 am and I stayed up to finish watching this masterpiece. I laughed,  I cried but I'm also mad that nothing happened to the friends that were ready to betray Jake in a heartbeat. Yeah,  we know what happened to one,  but what about the rest? The chef and the investor's??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyitq7/black_rabbit_betrayal/"
    },
    {
        "id": "1nxhwz4",
        "author": "Organic_Caramel_8354",
        "title": "Wayward SUCKS",
        "content": "0/10. Weird. Uncomfortable. Good acting but terribly unpredictable script. I am so disappointed. I wasted 8 hours of my life for this. Unless there is a follow up season, I don’t see any rectification for this. \n\n",
        "upvotes": 263,
        "comments": 254,
        "media": null,
        "permalink": "/r/netflix/comments/1nxhwz4/wayward_sucks/"
    },
    {
        "id": "1nxjqgd",
        "author": "conzojay1",
        "title": "Ed gein story nonsense.",
        "content": "So he hits his brother over the head with a massive log (which didn’t actually happen in real life.) but somehow, the coroner misses the huge massive head wound the body would have and just blindly accepts asphyxiation as the cause of death without even checking the lungs either. Stupid logic, totally broke my immersion. ",
        "upvotes": 145,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1nxjqgd/ed_gein_story_nonsense/"
    }
]