[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h8hvro",
        "author": "here0is0me",
        "title": "Anyone know anything about this Pantone mug set?",
        "content": "Found this mug set thrift shopping today. Snagged it because Pantone mugs are great but tried to do some research on it and found shockingly little. Other than maybe Netflix gives them as gifts to certain stars or directors of exclusives? Any additional info would be appreciated! ",
        "upvotes": 36,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h8hvro/anyone_know_anything_about_this_pantone_mug_set/"
    },
    {
        "id": "1h8bsa0",
        "author": "Alone-Acanthisitta66",
        "title": "Black Doves: A Thrilling Spy Thriller Starring Keira Knightley",
        "content": "",
        "upvotes": 57,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1h8bsa0/black_doves_a_thrilling_spy_thriller_starring/"
    },
    {
        "id": "1h8lqan",
        "author": "Blitzo-with-silent-O",
        "title": "Jentry Chau vs The Underworld is a fantastic show and everyone should check it out.  It needs as many eyes on it as possible.",
        "content": "I'm loving this show.  Fantastic animation style and the story is great as well. Feels like even though it is a animated show it still has adult stakes and something even adults can enjoy as well as kids.  If anyone is looking for something to watch please give this show a watch.  It definitely a show that needs to be renewed.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h8lqan/jentry_chau_vs_the_underworld_is_a_fantastic_show/"
    },
    {
        "id": "1h8k148",
        "author": "Thisisyourcaptain1",
        "title": "The Decameron ",
        "content": "Can we just talk about this show? I'm on episode 8 and holy fuck. This show went from hilarious to more hilarious, but dark and disturbing, in the best way possible. \n\nI don't know If I should laugh or cry. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h8k148/the_decameron/"
    },
    {
        "id": "1h8mfn6",
        "author": "professor1512",
        "title": "Looking for romantic drama movies with happy endings! Recommendations, please? 🌟",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h8mfn6/looking_for_romantic_drama_movies_with_happy/"
    },
    {
        "id": "1h7w7em",
        "author": "drmfranz",
        "title": "Netflix Hidden Gems: What’s a Lesser-Known Show or Movie You Loved?",
        "content": "I feel like I’ve scrolled through the same trending titles a million times, but I know Netflix has some hidden gems that don’t get enough attention. I’m talking about those lesser-known shows or movies that blew you away but no one seems to talk about.\n\nFor me, it was *The Endless*—a mind-bending sci-fi film I stumbled upon late at night. It’s low-budget but insanely creative.\n\nWhat’s your favorite under-the-radar pick on Netflix? I’d love some recommendations to shake up my watchlist!",
        "upvotes": 118,
        "comments": 342,
        "media": null,
        "permalink": "/r/netflix/comments/1h7w7em/netflix_hidden_gems_whats_a_lesserknown_show_or/"
    },
    {
        "id": "1h8o3r8",
        "author": "Potty-",
        "title": "Your Views &amp; Opinions On That Christmas",
        "content": "In my opinion, That Christmas is too similar to Bluey in 'The Sign'. No matter how Christmassy it tries to get, it just ends in chaos and loud, brash antics that are just too similar to that bumper length Bluey episode.\n\nSo, what are your views and opinions on this film? I'd love to know.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h8o3r8/your_views_opinions_on_that_christmas/"
    },
    {
        "id": "1h8l95g",
        "author": "ExcellentPotato7411",
        "title": "Mystery interesting abit scary not too scary series?",
        "content": "Sorry if this doesn’t fit this subreddit can immediately take down 😊, however I’m looking for something kinda like stranger things, i was never into series however because of my wife I’ve been into a few, ill name them for anyone who wants to compare and give me suggestions please\n\nStranger things \nSuperstore \nThe simpsons \nSheldon \nMaid \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h8l95g/mystery_interesting_abit_scary_not_too_scary/"
    },
    {
        "id": "1h8hyoz",
        "author": "TheOriginalRobinism",
        "title": "Voice description/accessibilities ",
        "content": "I love that Netflix has some nice accessibility options I wish they would update the voice. Or sounds like a 1999 8bit wave voice \n It's really hard to understand it's saying.\n\nAnyone else notice this?\n\nIf you if the wrong place you post this please let me know\n\n\nThank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h8hyoz/voice_descriptionaccessibilities/"
    },
    {
        "id": "1h8454v",
        "author": "localprincessjaaeli",
        "title": "The Maddness (series review)",
        "content": "It's a suspense thriller series, starts off well with a death and story revolves around same, a wrong person gets trapped in the murder investigation.\n\nIt's a bit slow ,some parts have too much talking, but it keeps you interested how the race to find the real connection to killers unfolds\n\nThe main character has a strong presence throughout, a little slow but not a waste of time. Something to watch.\nHow did you guys like it ,any comments ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h8454v/the_maddness_series_review/"
    },
    {
        "id": "1h8ecos",
        "author": "EndiXIV",
        "title": "Netflix Bitrate Stuck at Blurry 540p",
        "content": "For some reason when I try and watch Netflix on Edge, Chrome, the Windows app, etc, every movie and show is stuck at 540p, as shown when I do the ctrl+shift+alt+d command where it says \"Playing bitrate (a/v): 192 / 1289 (960x540)\"\n\nI have a 1440p monitor, newest drivers and latest versions for everything, 1Gbp/s ethernet, and have tried all the different extensions that are made to fix this. For some reason, it does just fine streaming at 4k on my tv, it's just my PC that's stuck at such a low resolution. Anyone have some solution I have yet to uncover? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h8ecos/netflix_bitrate_stuck_at_blurry_540p/"
    },
    {
        "id": "1h7q0zc",
        "author": "Playful_Disaster3227",
        "title": "netflix account scams",
        "content": "Keep an eye on your netflix account.  I just recently noticed a netflix monthly charge had gone from basic service at approx $8 to $43.\n\nWent in account and discovered scammers had upgraded my account to premium and added two members at $8 each with bogus email addresses.  This had actually been happening for the last 5 months and cuz payments are auto deduct I really didn't notice until recently.\n\nI contacted Netflix and was told they could only refund the last month of overcharges.  My response to that was to cancel the account.",
        "upvotes": 45,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1h7q0zc/netflix_account_scams/"
    },
    {
        "id": "1h8cfwd",
        "author": "socrdad2",
        "title": "Missing Profiles",
        "content": "Today, I logged into Netflix, and two of my profiles had been deleted.  I did not delete them, so this must be a Netflix glitch.  I have seen other posts online, describing something similar.  \n\nSo, I have two questions.  Has anyone else experienced this?  And does anyone know how to restore a profile that has gone missing - along with the history data?  \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h8cfwd/missing_profiles/"
    },
    {
        "id": "1h8jk3u",
        "author": "Alone-Acanthisitta66",
        "title": "The Angelina Jolie-starring film Maria will premiere on Netflix in the U.S. on December 11.",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h8jk3u/the_angelina_joliestarring_film_maria_will/"
    },
    {
        "id": "1h7epxx",
        "author": "Lost_Distribution546",
        "title": "EXCLUSIVE: Official Episode Runtimes Revealed for Squid Game Season 2",
        "content": "",
        "upvotes": 38,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1h7epxx/exclusive_official_episode_runtimes_revealed_for/"
    },
    {
        "id": "1h7z5wy",
        "author": "ExcellentPotato7411",
        "title": "Anymore series like Stranger things or Superstore?",
        "content": "Hey amazing community, I don’t watch much series however after watching more and more series and movies on Netflix with my wife, we both really really enjoyed superstore it was so funny exciting amazing joyful and sometimes sad but overall 10/10 however it’s all finished any suggestions along that way, and we also finally watched stranger things and we both also really enjoyed that too any more series that’s kinda like that too, so any suggestions for superstore and stranger things \n\n\n\nThanks everyone 😊🙏",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1h7z5wy/anymore_series_like_stranger_things_or_superstore/"
    },
    {
        "id": "1h794tn",
        "author": "hospitalsinwinter",
        "title": "Spielberg and critics are fans of Mo, and season 2 is finally coming in January",
        "content": "",
        "upvotes": 46,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h794tn/spielberg_and_critics_are_fans_of_mo_and_season_2/"
    },
    {
        "id": "1h729mg",
        "author": "Longjumping_Pen_2405",
        "title": "Looking for netflix series that are COMPLETED already with multiple seasons (not limited series). Im sick to death of them cancelling every second good fkn show",
        "content": "Just finished KAOS. Thought it was unique, creative, and incredibly well done. Its obviously been cancelled. As was archive 81, lockwood &amp; co, Mindhunter, CAOS (sabrina), midnight club, the society, 1899..... all this suspenseful and engaging shows that I've LOVED. \n\nSuggestions for series with at least 2 seasons and that have a proper conclusion/ending?",
        "upvotes": 152,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1h729mg/looking_for_netflix_series_that_are_completed/"
    },
    {
        "id": "1h7ws0v",
        "author": "DannyAgama",
        "title": "Am I crazy or has Woman of the Hour suddenly been removed?",
        "content": "I recall watching part of the movie and adding it to my list. I see no mention of it being removed anywhere and now it's not on my list. It's been taken off search results but I was able to find the title's page [here](https://www.netflix.com/title/81728818) \\- it allowws me to set a reminder for when the title is available again. Anyone know why it's been taken down so soon?\n\nI am in the U.S. by the way.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h7ws0v/am_i_crazy_or_has_woman_of_the_hour_suddenly_been/"
    },
    {
        "id": "1h86w7h",
        "author": "Gix_GamingMC",
        "title": "Scott Pilgrim Takes Off Is NOT RETURNING.",
        "content": "I know I'm late but I wanted to do a video on this.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h86w7h/scott_pilgrim_takes_off_is_not_returning/"
    },
    {
        "id": "1h7guoe",
        "author": "LetterheadFun3697",
        "title": "American Primeval | Official Trailer | Netflix",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h7guoe/american_primeval_official_trailer_netflix/"
    },
    {
        "id": "1h81vq4",
        "author": "Narcan9",
        "title": "Bodkin episode 1 looks terrible",
        "content": "I'm talking about the general look of the show. It's very flat, lacking contrast. I actually checked my tv settings because I thought it must have switched to the wrong picture settings.\n\nNope.  I assume they're intentionally doing this to try and make the whole atmosphere look gloomy and depressing. Instead it just looks like something filmed by a low budget amateur. \n\nThey even do it in scenes where there is clearly sunlight casting shadows, which wouldn't create a low contrast picture. The whole look is off and distracting.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h81vq4/bodkin_episode_1_looks_terrible/"
    },
    {
        "id": "1h7sj6k",
        "author": "anti_procrastinator",
        "title": "Tomorrow and I",
        "content": "This might be the one of the most fucked shows ever.\n\nSince Thailand as a country has fed the foundation of the world for decades, it makes sense that artists there get to explore some of the darker shades of grey more unabashedly.\n\nIt’s like LDR on steroids. Highly recommend, some parts might be really disturbing ngl.\n\nCurious to hear what others think.\n\nEDIT: not LDR on steroids, maybe LDR if it was a bit more tangible.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1h7sj6k/tomorrow_and_i/"
    },
    {
        "id": "1h77fvm",
        "author": "Whobitmyname",
        "title": "'One Piece' Season 2 Aiming for Christmas 2025 Release According to Actor",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h77fvm/one_piece_season_2_aiming_for_christmas_2025/"
    },
    {
        "id": "1h7r5vx",
        "author": "Loud_Opinion230",
        "title": "Netflix Black Screen",
        "content": "Hi, I've been experiencing problems when trying to watch anything on Netflix. It's just a black screen with the video audio. I use a MacBook and watch on Google Chrome. I've tried using Safari but it's the same thing. help please!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h7r5vx/netflix_black_screen/"
    },
    {
        "id": "1h7b6qm",
        "author": "indiewire",
        "title": "The 27 Scariest Movies on Netflix: Pearl, Psycho, Jaws &amp; More",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h7b6qm/the_27_scariest_movies_on_netflix_pearl_psycho/"
    },
    {
        "id": "1h7sl4c",
        "author": "Crafty_DIY",
        "title": "Help me fix crummy streaming quality issue with Apple TV",
        "content": "I'm watching Griselda on Netflix on my Apple TV and the quality is grainy and terrible.\n\nMy internet connection may not be the best. There's not much to be done there.\n\nHowever, I'd rather just like wait for the show to load and watch it in high quality than watch it now so grainy I can't hardly make out facial expressions.\n\nHow would I force Netflix or my Apple TV to buffer, wait, and let me watch it full quality?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h7sl4c/help_me_fix_crummy_streaming_quality_issue_with/"
    },
    {
        "id": "1h7o1yy",
        "author": "Tydli",
        "title": "4K playback not working",
        "content": "Hello, i cant get my netflix to play 4K.\n\n1) Dell G3223Q 4K HDR + Displayport 1.4, HDCP 2.2 support (both cable and monitor)  \n2) i5-14600KF + RTX 3080   \n3) Win 11 + HEVC support installed  \n4) obviously Netflix premium plan  \n5) 2700 mbps symetric internet line (effectively limited to 2500mbps by motherboard, 500mbps symetric DEDICATED TO ME,  rest shared) -&gt;&gt; no doubt about speed  \n6) tried using edge or netflix app, still getting 1080p   \n7) in-app settings are set to highest possible  \n8) HDR enabled/disabled tried both  \n9) refreshrate 144/120/60 Hz tried   \n10) secondary 1080p screen disconnected\n\nIs there anything else i can do? Still cant figure out why am i not playing 4K....",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h7o1yy/4k_playback_not_working/"
    },
    {
        "id": "1h73dzr",
        "author": "upikaroh",
        "title": "Netflix's horror code is 8710 and 8711.",
        "content": "Hie fellow redditors. \n\nJust type 8710 (for Dark movies) and 8711 (for the horror movies) in the search bar and it will bring up all things horror (and one or two weirdly not) .\n\nThese are all the horror themed films and shows without an algorithm applied.\n\nEnjoy and happy spooky season",
        "upvotes": 18,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h73dzr/netflixs_horror_code_is_8710_and_8711/"
    },
    {
        "id": "1h75rok",
        "author": "Fit_Argument3087",
        "title": "What's Your Perception of English Dubbing?",
        "content": "Hi everyone! I’m currently working on my master’s thesis and I’m exploring English dubbing - its quality, cultural impact, how it’s perceived by audiences. I’d love to hear your thoughts! \n\n\\- What do you think of English dubbing in general? (e.g., films, TV shows, anime, etc.)\n\n\\- Are there any specific examples (good or bad) that stand out to you?\n\n\\- Have you watched \"Dark\" or \" Money Heist \" in English? Did you like it?\n\n\\- Do you think it is useful to watch English dubbed movies to learn English (if you are not a native English speaker)?\n\nPlease also let me know, if possible, where you're from (or, at least, if you are a native English speaker or not). Your input would be invaluable to my research, and I’m truly grateful for any insights you can share. Feel free to be as detailed or brief as you’d like!\n\nThank you so much for helping out, and I’m looking forward to reading your opinions.",
        "upvotes": 11,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1h75rok/whats_your_perception_of_english_dubbing/"
    }
]