[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1it96ui",
        "author": "TheMirrorUS",
        "title": "Brian Laundrie’s parents shunned by Florida community over Gabby Petito’s murder following Netflix docuseries",
        "content": "",
        "upvotes": 1496,
        "comments": 338,
        "media": null,
        "permalink": "/r/netflix/comments/1it96ui/brian_laundries_parents_shunned_by_florida/"
    },
    {
        "id": "1itgt0k",
        "author": "ellissabain",
        "title": "In full: The chilling ‘burn after reading’ letter Brian Laundrie’s mum wrote to him",
        "content": "",
        "upvotes": 54,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1itgt0k/in_full_the_chilling_burn_after_reading_letter/"
    },
    {
        "id": "1iswm3v",
        "author": "lovethats",
        "title": "Gabby Petito Doc",
        "content": "Watching Brian’s parents “search” for Brian made my blood boil. A quote from the FBI said “they did not emote.” Of course they didn’t. They knew where to pretend to look the entire time. \n\nYou’re telling me he was within a mile of the car the entire time and his parents show up to look one day and they find his remains the same day. \n\nThen Brian says in his suicide note that Gabby “begged for an ending to her pain” and he thought it was “merciful.” \n\nI have never felt a level of anger at a family in my life. I hope the entire Laundrie family pays for what they did.\n\nThis is so sickening. ",
        "upvotes": 562,
        "comments": 235,
        "media": null,
        "permalink": "/r/netflix/comments/1iswm3v/gabby_petito_doc/"
    },
    {
        "id": "1itkikl",
        "author": "dreadoverlord",
        "title": "Is there any way to disable the Netflix Games banner/preview? I just want normal TV/movie banners back",
        "content": "I have Steam and GOG. I don't need to play Civ 6 on Netflix. What I also don't need is a giant auto-playing banner on the Netflix home page telling me to try Cozy Grove.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itkikl/is_there_any_way_to_disable_the_netflix_games/"
    },
    {
        "id": "1ithgyd",
        "author": "Vance617",
        "title": "We need a season 3 of The OA",
        "content": "This show was hard for me to get into, at least the first couple episodes. By the time season 2 started I couldn’t stop watching. I heard there are no plans for season 3, how can that be changed",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ithgyd/we_need_a_season_3_of_the_oa/"
    },
    {
        "id": "1isz6fc",
        "author": "Jumpy_Whereas181",
        "title": "How will Netflix recover from most of its flagship series ending?! (2026 and beyond)",
        "content": "I don’t think Netflix will be able to ever capture the success of Stranger Things or Squid games or any of its other bigger  series ending. So what’s next for Netflix? Can they ever reach this peak again? ",
        "upvotes": 67,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1isz6fc/how_will_netflix_recover_from_most_of_its/"
    },
    {
        "id": "1itj0o6",
        "author": "MadJackTheThird",
        "title": "Cassandra (2025) series - Does anyone know what software did they use to synthesise Cassandra's face?",
        "content": "It kinda reminds me of some very old softwares used to simulate face expressions, and they really nailed the uncanny valley effect the old softwares gave!\nI'm interested in the technical details of the methods they used in order to recreate the face. Did they use the same old implementations? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itj0o6/cassandra_2025_series_does_anyone_know_what/"
    },
    {
        "id": "1itg314",
        "author": "Piggybumm",
        "title": "Gabby Petito documentary ~ Roberta Laundrie’s letter",
        "content": "Well, I guess any one that’s seen this documentary is seething, just like me. Brian’s parents are disgusting and how they were not charged with perverting the course of justice knowing their son had killed Gabby, I don’t know 🤬\n\nAnyway, I wanted to ask a question in relation to Roberta Laundrie’s ‘burn after reading’ letter to her son and this statement in particular: \n\n“If you need to dispose of a body I will show up with a shovel and garbage bags”\n\nIf your child called you to say they’d just killed someone and then came back to the family home would you: \n\na) protect your child from law enforcement questioning?\nand \nb) show up with a shovel and garbage bags to assist with the disposal of the body?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itg314/gabby_petito_documentary_roberta_laundries_letter/"
    },
    {
        "id": "1ita1n3",
        "author": "MysteriousDelay6266",
        "title": "The Residence | Official Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ita1n3/the_residence_official_trailer_netflix/"
    },
    {
        "id": "1isxyug",
        "author": "crazycrazybeanz",
        "title": "Gabby Petito Documentary",
        "content": "Did anyone think it was odd how, in the 3rd episode of the documentary, the Petito family spread Gabby’s ashes at the place where she was found dead? It caught me off guard since I feel like most people who are murdered wouldn’t want their ashes to be spread in the park where they were killed.",
        "upvotes": 49,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1isxyug/gabby_petito_documentary/"
    },
    {
        "id": "1ith9ca",
        "author": "realdonreset",
        "title": "GHOSTS T3 y T4",
        "content": "Amigos, Netflix solo compró la T1 y T2, saben de alguna página donde poder ver la 3 y 4? Ojalá que no sea de pago. Sé que paramount las tiene pero no quiero pagar. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ith9ca/ghosts_t3_y_t4/"
    },
    {
        "id": "1isewv3",
        "author": "MassiveDexterFanGirl",
        "title": "The Laundrie Family are THE worst!",
        "content": "The way they just batted off the police and gave no cooperation at all, nothing to ease the minds of the Petito Family, it's disgusting! \nThey should be charged with perverting the course of justice! ",
        "upvotes": 334,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1isewv3/the_laundrie_family_are_the_worst/"
    },
    {
        "id": "1isha22",
        "author": "tekavi23",
        "title": "Just Finished : Gabby Petito and I have so many questions",
        "content": "\n- POS killed her &amp; then stole her money to drive home\n\nLegally speaking : \n\n- when she went missing &amp; Brian had her van in Florida, couldn’t cops pressure him to answer questions since he had a van he didn’t own ?! \n\n- after the body was found &amp; there was a FBI wanted for Brian, couldn’t by law the parents be forced to speak ?\n- after Brian went “misssing” &amp; FBI searched the entire area …. The parents went and “found him” within the hour.\n- couldn’t the parents be criminally charged for aiding a murder?!\n ",
        "upvotes": 250,
        "comments": 247,
        "media": null,
        "permalink": "/r/netflix/comments/1isha22/just_finished_gabby_petito_and_i_have_so_many/"
    },
    {
        "id": "1itm5xe",
        "author": "lovethats",
        "title": "Another thought about the Gabby Petito doc-",
        "content": "Does anyone else think Brian and his mom had a very weird relationship? Very mush so enmeshed. Like in her letter to Brian BEFORE he and Gabby even left on their trip she said- “I just want you to remember I will always Love you and I know you will always Love me. You are my boy. Nothing can make me stop loving you, nothing will or could ever divide us. No matter what we do, or where we go or what we say- we will always Love each other,” and “If you say you hate my guts, I’ll get new guts.”\n\nMaybe some sort of abuse there? This isn’t normal behavior from a mother. It’s giving that crazy “boy mom” vibe.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itm5xe/another_thought_about_the_gabby_petito_doc/"
    },
    {
        "id": "1ite652",
        "author": "Kashmiri_apple_09",
        "title": "Netflix account in another region",
        "content": "Hey, I am using my account from USA 🇺🇸 but I want to share my account with someone in Bangladesh 🇧🇩 but we have tried logging in its not working there. Basically I have a phone carrier which covers my Netflix payment I don’t need to pay additionally so that could be a reason. Please help me out, thanks 😊 ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ite652/netflix_account_in_another_region/"
    },
    {
        "id": "1it876a",
        "author": "Paranoir89",
        "title": "American Murder: Gabby Petito- “Brian and Gabby’s Friend”",
        "content": "I watched the documentary in full and there’s so much to say, but I’ve honestly found other posts on it as well. \n\nOne thing I can’t seem to find is about their “friend” with the black hair.\n\nSomething about her feels off to me? I understand maybe nerves, and obviously she had known them prior to this happening.\n\nBut I don’t know, the energy she gives me is that she actually had feelings for Brian but was embarrassed about it, so she pushed it away, and wasn’t actually friends with Gabby, or was jealous of her. There’s times where she seems normal talking about them, like the engagement, but then other times not so much.\n\nIt doesn’t sit right with me that she’s in this documentary about him killing Gabby, and she’s yapping about Brian saying the friend thing or being the love of his life, and the bluebird text. She smiles a lot when talking about him, and then when she talks about him playing guitar for Gabby and “how could I be so blind?” Gives me the feeling he didn’t tell her about Gabby until they found out and she thought he was her lover boy-regardless if they were dating or not.\n\nShe isn’t actually crying at the end.\n\nIdk. I always think I’m reading too much into something and then something comes out and I’m like “I KNEW IT”, lol.\n\nI’m not even sure what this means, I guess I wonder if she knows more than she’s letting on? Gabby had reached out to her ex, and if I know anything about abusive bf’s, they’ll come back around to old “loves” to get an ego boost. Makes me wonder if he ever reached out to her when he and Gabby were fighting, or after Gabby’s death. She seems like she had that relationship with him. \n\nDid anyone else get this vibe from her or am I nuts?",
        "upvotes": 2,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1it876a/american_murder_gabby_petito_brian_and_gabbys/"
    },
    {
        "id": "1itdbh3",
        "author": "scott_dj",
        "title": "Question about plans.",
        "content": "Can someone describe the new plan structure?  I currently have premium but they've jacked the prices up yet again and I may jump down to the mid-tier. I know it goes from 4K to 1080p and you lose a lot of screens (which are useless now with the password rules)... but my question is the AUDIO.  \n\n From what I can tell it appears other than the premium plan your option is 50-year-old stereo only.  Is it true 5.1/atmos is only available in the ridiculously expensive upper tier plan?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itdbh3/question_about_plans/"
    },
    {
        "id": "1itaz96",
        "author": "Manjawarrior",
        "title": "Ntflix bugging on Firestick",
        "content": "I have tried to look for an answer but nothing I really tried on here worked. \n\nI have a firestick connected to my TV and whenever I try to watch Netflix on it there seems to be 2 layers of it? There is the full size of the TV, as expected but then a smaller version of inside that playing on top. It causes a lot of the text on screen to bug out, and the characters to appear glitchy and weird.\n\n  \nI have tried force stopping, clearing the cache and data, uninstalling and re-installing, unplugging the firestick from the power and re-connecting it. \n\n  \nI don't think it is a firestick to TV connection issue as the plex I use on there works perfectly fine without any issues. \n\n  \nAll help is appreciated and if there are any more questions feel free to ask, thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itaz96/ntflix_bugging_on_firestick/"
    },
    {
        "id": "1itaxmb",
        "author": "youvegotpride",
        "title": "Apple Cider Vinegar: could Belle Gibson sue the media?",
        "content": "Hi, it's just a little question but google didn't help me. Netflix states that some characters were fictionalized, they however use Belle Gibson real name. I was wondering if, in the event of being unhappy with the series portrayal of aspects of her life, she could have grounds to sue. \n\nAs found online \n\n&gt;Belle Gibson, is inspired by a woman with the same name — an Australian influencer who claimed to have cured her terminal brain cancer through alternative therapies and nutrition  \n  \n**The real-life Gibson was not involved in the production of the series.** Rather, *Apple Cider Vinegar* is a fictionalized drama series inspired by Donelly and Toscano’s book, “The Woman Who Fooled the World”.  \n\nso she's not benefiting from the series money wise even though they use her identity. \n\n  \nI'm not arguing anything, if it's good or bad, I'm just surprised. I can also add for context that suing in not in my culture, I'm not American (and maybe it's not as easy in Australia as it is in the USA). ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1itaxmb/apple_cider_vinegar_could_belle_gibson_sue_the/"
    },
    {
        "id": "1iswkri",
        "author": "CoconutEast3651",
        "title": "how come peninsula got taken down?",
        "content": "A couple months back, I noticed that Peninsula (sequel to train to Busan) was on the list of movies that was going to be released on February 11, 2025 but I noticed that it's no longer on the list and is not anywhere on Netflix. Why did they not release it? I was kind of excited to watch it tbh.. ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iswkri/how_come_peninsula_got_taken_down/"
    },
    {
        "id": "1it9dqu",
        "author": "infinityofpearls",
        "title": "Black Warrant TV vs Book! What are the key differences?",
        "content": "I know that the pacing in the book is much faster since it is only 178 pages. But what other significant changes have been made in the series's portrayal of Tihar?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it9dqu/black_warrant_tv_vs_book_what_are_the_key/"
    },
    {
        "id": "1it8r5t",
        "author": "Powerful-Gain-2641",
        "title": "Looking for Recent Psychological Thrillers/Mysteries",
        "content": "I’m looking for some good psychological thriller or mystery movies/limited series from the last 10 years. I enjoy stories that:\n\n* Have a dark, suspenseful atmosphere\n* Keep me hooked from the very beginning\n* Feature twisted plots with mind games, secrets, or hidden motives\n* Have a serious, realistic tone (no supernatural, sci-fi, or comedy)\n\nSome thrillers I really liked are *Gone Girl*, *Fractured*, *Orphan*, *Copycat*, *Don't Breathe*, *Behind Her Eyes*, and *Hush*. I’d love to find more recent ones with the same kind of tension and mystery.\n\nWould appreciate any recommendations. Thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1it8r5t/looking_for_recent_psychological/"
    },
    {
        "id": "1itm298",
        "author": "Yuck_Few",
        "title": "American Primeval is boring",
        "content": "I was expecting it to be awesome because of how much it's so hyped up but I called it quits three episodes in.\nAll the characters are like NPCs in a video game and there's literally no plot.\nIt has good actors but other than that, it's a nothing Burger\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1itm298/american_primeval_is_boring/"
    },
    {
        "id": "1isw9hf",
        "author": "Squid1996",
        "title": "How I made this retro Netflix animation!",
        "content": "",
        "upvotes": 6,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pneygrd8q0ke1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isw9hf/how_i_made_this_retro_netflix_animation/"
    },
    {
        "id": "1itd9bp",
        "author": "Competitive_Yard1539",
        "title": "Suggest me my next show",
        "content": "I'm looking for a show that's fun and cozy, that gives warm feelings. \n\nShow I liked : the good place, brooklyn nine nine.\n\nI don't want any violence, gore, blood... ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1itd9bp/suggest_me_my_next_show/"
    },
    {
        "id": "1ithh7u",
        "author": "that_theater_guy21",
        "title": "WHAT IS WITH NETFLIX RUINING THEIR ORIGINAL SERIES",
        "content": "So I just finished the first season of Sex Education and it was pretty good and then I watched the first episode of season. IT WAS HORRIBLE it butchered all the characters that I loved in season 1!! And that made me remember how many other shows I've watched and then have completely abandoned after watching the first episode of season 2. Let us name a few,\n\nBojack horseman \n13 reasons why (they made up for it with season 3 though) \nHeartbreak high\nGood girls \nGinny and Georgia \nEct ect \n\nBut really good shows that need a 2nd or 3rd second like inside job or end of the fucking world DONT GET ONE!!! AHHHB",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ithh7u/what_is_with_netflix_ruining_their_original_series/"
    },
    {
        "id": "1itedxx",
        "author": "stalepopcornpod",
        "title": "My Problem with Apple Cider Vinegar...",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itedxx/my_problem_with_apple_cider_vinegar/"
    },
    {
        "id": "1it5do6",
        "author": "spring_illust",
        "title": "Reagan FanArt",
        "content": "Netflix, give me the third season of Inside Job. \n\nJust wanted to do some anatomy studies and the reference came with the scythe, so maybe Reagan can threaten Netflix with this.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it5do6/reagan_fanart/"
    },
    {
        "id": "1iso5az",
        "author": "Apprehensive_Sign_93",
        "title": "Is one piece USA leaving?",
        "content": "I just noticed that one piece in the earlier seasons is leaving Netflix. I have acreenshots, they are in dutch but you should be able to understand them. It says final day is february 19th, Ig I can't complete the series now.",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iso5az/is_one_piece_usa_leaving/"
    },
    {
        "id": "1it2qke",
        "author": "JalapenoMan999",
        "title": "I have a 175hz monitor, should I turn it down to 120hz?",
        "content": "All the content I watch on netflix on PC (I use chrome) is mastered in 24 fps, should I turn my monitor down from 180hz to 120hz when I go to watch stuff? \n\nI feel like I can feel a difference in frame pacing, but I honestly have no idea. Sometimes at 175hz, though, I feel like something is wrong with what I'm watching. Like it's different to my TV downstairs somehow. \n\nDoes changing my monitors refresh rate do anything? \n\nThanks",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1it2qke/i_have_a_175hz_monitor_should_i_turn_it_down_to/"
    }
]