[
    {
        "id": "1kf7u97",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 885,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf7u97/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kemywn",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - Marbella FC | Primera Federación, Matchday 35",
        "content": "#FT: CASTILLA 3:2 MARBELLA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 David Jiménez 2'\n\n2:0 Gonzalo García 56'\n\n2:1 José Callejón 58'\n\n3:1 Loren Zúñiga 65'\n\n3:2 Alberto Soto 90'+2 \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 2' - GOLLLLLL DEL CASTILLA - first attack of the match, Pol Fortuny attempts a through ball through the middle, but it gets deflected out wide to Yusi - Yusi puts in the cross to Loren, but it gets cleared to the edge of the box - David Jiménez picks the ball up and curls it into the top right corner with his weak foot! \n\n12' - almost the 2-0, amazing through pass on the turn by Pol Fortuny, but the goalkeeper reaches it in the last second before Yusi can finish \n\n27' - misunderstanding by Yusi and Edgar that leaves Marbellas winger open in the box, but Yusi with a great recovery to force the corner \n\n32' - Chema pulls down his opponent with excessive force, then falls on top of his leg on the way down - yellow card for Chema and it looks like a very bad injury for Marbella's Awudu\n\n39' - promising counter attack that kind of fizzles out, until Yusi makes a great cross onto the head of David Jiménez, but his header is right at the keeper \n\nHT - eventful first half in which both teams played high paced football, skipping the midfield mostly - while this style of match suits Castilla, Marbella were also pretty dangerous throughout with some great, quick plays. Overall, the lead is deserved however \n\n46' - 2nd half underway \n\n⚽ 56' - GOLLLL DEL CASTILLA - fast attack with lots of space for Pol Fortuny - Gonzalo makes the run into the box and Pol puts an easy pass into his run, Gonzalo's first touch is perfect, and he finishes softly with the inside of his boot against the far post and into the net! \n\n⚽ 58' - goal for Marbella right after the kick off - and it's our former player José Callejón who scores, just like in the first match. He initiates the attack himself, dribbling past our midfield and playing it out wide - his teammate lays it off to him in the box with the back of his heel, and he comes running at the ball full speed to finish it past Fran \n\n60' - massive chance to immediately restore the 2-goal lead, another top cross from Yusi from the left to the far post, where Pol Fortuny broke free of his marker but sadly has to finish on the volley with this weak foot, and he puts it just wide of the far post \n\n⚽ 65' - GOLLLLLL DEL CASTILLA - Marbella take risks and leave lots of space for us to counter - Ribes recovers the ball at the edge of our box, plays it to Chema, who launches a perfect long ball to Victor Muñoz - who once again escapes his opponents, and squares it perfecrly to Loren Zúñiga, he pokes it past the keeper with the tip of his boot for the 3-1! \n\n70' - Gonzalo hits the post, what a play by him! - he is through on the left side in a 2v3 counter, he takes on the fullback and turns past him with a quick change of direction, then he leaves another opponent behind in the same manner, his finish is almost perfect, but it hits the post, runs across the goal line and goes out for a goal kick on the other side \n\n🔄 74' - triple sub, Yusi, Chema and Zúñiga off for Valde, Antonio David and Campos\n\n80' - big chance for Víctor to seal the match, Pol Fortuny releases a through ball for him to chase, and once again he launches like a rocket and outruns the defender by a bit margin, but he fails to put his finish on target with only the keeper to bear\n\n🔄 81' - César Palacios is back from his ACL tear after 9 months! He comes on for Pol Fortuny. \n\n🔄 90' - last sub, Borja for Víctor \n\n⚽ 90'+2 - goal for Marbella, golazo by Soto - a bit out of nowhere, he cuts inside from the right wing and blasts an absolute missile out with his left foot, it hits the net in the top left corner \n\n90'+4 - good chance for Marbella for the late equaliser, Ribes fails to clear a ball in our box and the Marbella player fires the rebound over the bar \n\nFT - victory that became unnecessarily tight in the end, with Castilla wasting chances on the counter and Marbella getting a lifeline in added time with a great goal. The team keeps the possibilities of reaching the playoffs alive with this win, but it will still be very difficult, 4 points behind the last playoff spots with only 3 matches to go \n\n&amp;#x200B;\n\n**Kickoff:** 18:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Álvaro Cánovas García-Villarrubia\n\n**Competition:** Primera Federación, Grupo 2, Matchday 35\n\n**Viewing options:** \n[FEF TV](https://feftv.com) (subscription - 12.99€/month)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Fran González - Youssef Enríquez ‘Yusi’ (74' Víctor Valdepeñas 'Valde'), Edgar Pujol, Mario Rivas, Quique Ribes, David Jiménez - José Maria Andrés ‘Chema’ (74' Antonio David), Pol Fortuny (81' César Palacios) - Gonzalo García, Loren Zúñiga (74' Andrés Campos), Víctor Muñoz (90' Borja Alonso) \n\nBench: Mario de Luis (GK), Diego Piñeiro (GK), Lorenzo Aguado, David Ruiz, Babacar Diocou. \n\nUnavailable: Raúl Asencio (first team call-up), Jacobo Ramón (first team call-up), David Cuenca (pubalgia), Manuel Ángel (?), Jeremy de León (shoulder injury). \n\nCoach: Raúl\n\n&amp;#x200B;\n\n**Castilla last five matches:** DDDWL\n\n**1ª RFEF stats:** 10th | 46pt | 10-16-8 | 51:34\n",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kemywn/match_thread_real_madrid_castilla_marbella_fc/"
    },
    {
        "id": "1kg6cjt",
        "author": "minivatreni",
        "title": "Real Betis instagram account posts photo comparing Antony’s stats to Vini’s",
        "content": "",
        "upvotes": 522,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/16vrj7qnc6ze1.jpeg?auto=webp&amp;s=d430c88a82aa9e2f785ec43370507be3f416eb5a"
        },
        "permalink": "/r/realmadrid/comments/1kg6cjt/real_betis_instagram_account_posts_photo/"
    },
    {
        "id": "1kg3a9v",
        "author": "Optimal_Lie7824",
        "title": "Rigged ball... it was a rigged football, Perez bought remote controlled footballs! LOL",
        "content": "It's a meme as the flair says lol",
        "upvotes": 748,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ctq04wbxn5ze1.jpeg?auto=webp&amp;s=29cf7a9439419d1a16987c0a199977339d878b57"
        },
        "permalink": "/r/realmadrid/comments/1kg3a9v/rigged_ball_it_was_a_rigged_football_perez_bought/"
    },
    {
        "id": "1kg3uk7",
        "author": "Affectionate_lab02",
        "title": "Basically Bellingham to trent",
        "content": "Credits: @yourmadridista IG\n\nPS: Title isn't comparing the players but rather how both players got recruited",
        "upvotes": 497,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s4jpwy1dt5ze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kg3uk7/basically_bellingham_to_trent/"
    },
    {
        "id": "1kg5lxv",
        "author": "dakdakdakp",
        "title": "Florian Wirtz is not interested in joining Real Madrid",
        "content": "Source: BILD\n\nWirtz wants to join Bayern and isn't interested in moving ahead with Manchester City or Real Madrid. It's a fair decision in my opinion as he's German. This will give Arda the chance to take over his role at Madrid under Xabi!",
        "upvotes": 202,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/c-5egh4qI2hTD1x4KtztWKy9drNJMqzQ-1mVN_T1lrU.jpg?auto=webp&amp;s=a9f1553a507b9c5a2bf2423ed6d6d16ade22da36"
        },
        "permalink": "/r/realmadrid/comments/1kg5lxv/florian_wirtz_is_not_interested_in_joining_real/"
    },
    {
        "id": "1kg0gk5",
        "author": "intelligence3",
        "title": "This is what happens when you are friends with Rudiger😂",
        "content": "",
        "upvotes": 218,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hoo51neku4ze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kg0gk5/this_is_what_happens_when_you_are_friends_with/"
    },
    {
        "id": "1kfxo25",
        "author": "cyrusmancub",
        "title": "What player(s) do you think benefit the most if Xabi Alonso manages Real Madrid?",
        "content": "For me, I think the biggest beneficiary would be Arda Guler. I think he would occupy a role in Xabi’s system similar to Wirtz’s role at Leverkusen. Another player I could see doing quite well would be Camavinga, whose direct play and ability to cover the wings would excel under Xabi. \n\nI think plenty of players will play well under Xabi’s coaching (Valverde, Bellingham, Trent), but I think the players that will take the biggest leaps will be Guler and Cama. ",
        "upvotes": 152,
        "comments": 108,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfxo25/what_players_do_you_think_benefit_the_most_if/"
    },
    {
        "id": "1kffvgz",
        "author": "DemonVenreable3011",
        "title": "Whoever this guy was we are grateful 😂",
        "content": "",
        "upvotes": 951,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w4hwj532pzye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kffvgz/whoever_this_guy_was_we_are_grateful/"
    },
    {
        "id": "1kf9q3h",
        "author": "ArmageddonJundy",
        "title": "I genuinely feel sorry for Liverpool fans",
        "content": "",
        "upvotes": 1689,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l1qvj0wmcyye1.png?auto=webp&amp;s=80402e08bf7fb579eb87755fa6233e4a0c3bccae"
        },
        "permalink": "/r/realmadrid/comments/1kf9q3h/i_genuinely_feel_sorry_for_liverpool_fans/"
    },
    {
        "id": "1kg0lzf",
        "author": "Mastermind_737",
        "title": "Florentino Perez and the Unify League (previously known as the European Super League). Is there a reason behind his frugality on Madrid's transfer policy?",
        "content": "The Unify League is set to start in September of 2026. It will have a huge impact on the footballing world with every match free to watch through high-paying advertisers and with the UEFA middleman out of the equation.\n\nNow the proposal features strict financial sustainability rules (FSR) which will have an effect on many teams who want to participate. \"European club competitions should be governed by the clubs as they are domestically, not by third parties who benefit without taking any risk. The governance structure must be fully compliant with EU law. To improve sustainability, spending should be based only on resources generated, not from competition-distorting capital injections. Financial Sustainability rules should allow clubs to only spend a fixed percentage of their annual football-related revenue on player salaries and net transfers with appropriate provisions for smaller clubs and transition rules.\"(https://a22sports.com/en/about-a22/)\n\nHaaland's 10-year contract could possibly be in preparation for the Unify League. Many players who want to play at the top league (Star League) of the Unify League will present transfer opportunities that Madrid can take advantage of. But the general idea is that there is uncertainty about what will happen, and with Florentino being a key figure in the league, his frugality means he knows something besides the stadium renovation payments. \n\nI believe this summer and the following are going to explode with transfers with the competition starting in the following year. I'm interested to see what will happen, and there really is no reason for the competition to be delayed anymore due to the CJEU ruling giving the green light. ",
        "upvotes": 17,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kg0lzf/florentino_perez_and_the_unify_league_previously/"
    },
    {
        "id": "1kf9z9q",
        "author": "Kbs2069",
        "title": "Perez when it comes to free transfers",
        "content": "",
        "upvotes": 954,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g063a0i2fyye1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kf9z9q/perez_when_it_comes_to_free_transfers/"
    },
    {
        "id": "1kfb5yh",
        "author": "EffectiveTie3144",
        "title": "Florentino Perez when he hears Liverpool are interested in Dean Huijsen",
        "content": "",
        "upvotes": 748,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/it93926rpyye1.jpeg?auto=webp&amp;s=74f071e77428d84a346d63c565be92e947654449"
        },
        "permalink": "/r/realmadrid/comments/1kfb5yh/florentino_perez_when_he_hears_liverpool_are/"
    },
    {
        "id": "1kfc6yy",
        "author": "fomdj",
        "title": "\"Trent crosses and it's Bellingham with the header!\" Then they drop this banger celebration 🥶👇",
        "content": "Is Bellingham ready for the pinpoint crosses? ARE YOU READY FOR TRENT ALEXANDER ARNOLD⁉️\n\nTchouameni, Rudiger, Bellingham waiting for the next corner to score🥶",
        "upvotes": 643,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zez92yg5yyye1.jpeg?auto=webp&amp;s=bf5c09374ddf5d118abff394f96c2bf8d3194950"
        },
        "permalink": "/r/realmadrid/comments/1kfc6yy/trent_crosses_and_its_bellingham_with_the_header/"
    },
    {
        "id": "1kfgxb6",
        "author": "Timely-Cranberry-767",
        "title": "Pls stop with these jinx posts 😭",
        "content": "",
        "upvotes": 334,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sub9tu57wzye1.png?auto=webp&amp;s=e849af493345f37b94b5b506a7ca36f9618d7066"
        },
        "permalink": "/r/realmadrid/comments/1kfgxb6/pls_stop_with_these_jinx_posts/"
    },
    {
        "id": "1kf72ol",
        "author": "One-Persimmon8413",
        "title": "Trent Alexander-Arnold to Real Madrid, here we go!",
        "content": "",
        "upvotes": 1274,
        "comments": 204,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FrfEZWE81_jHiXonhWY2nZoxbexdtYblJ7hg5sV8RBU.jpg?auto=webp&amp;s=153adb1c28e921a4dff2c0c16d47761214ec852e"
        },
        "permalink": "/r/realmadrid/comments/1kf72ol/trent_alexanderarnold_to_real_madrid_here_we_go/"
    },
    {
        "id": "1kf87aj",
        "author": "One-Persimmon8413",
        "title": "Real Madrid 4 – 0 Liverpool",
        "content": "",
        "upvotes": 871,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iWovGOKOPG6grgrhEI7IYbPyac6XUuM6S4LqtVOrx90.jpeg?auto=webp&amp;s=d8f4cc366f3aa4278cf30b540d41534b9f26bd17"
        },
        "permalink": "/r/realmadrid/comments/1kf87aj/real_madrid_4_0_liverpool/"
    },
    {
        "id": "1kfe49c",
        "author": "WhySoWeirdUsername",
        "title": "Carlo Ancelotti and Real Madrid have reached an agreement over the terms of his departure",
        "content": "",
        "upvotes": 278,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KyzfK_Ch4OO8pdXQG4SB2rFqRP7nyyBD37AdNp3b6ik.jpg?auto=webp&amp;s=a89efe405f7823f061754b54333148709473c87d"
        },
        "permalink": "/r/realmadrid/comments/1kfe49c/carlo_ancelotti_and_real_madrid_have_reached_an/"
    },
    {
        "id": "1kfm97y",
        "author": "ace-s",
        "title": "Xabi will provide a unique perceptive. He was coached by Del Bosque, Mou, Carlo and Pep",
        "content": "Interesting enough, when he decided to join Bayern Munich. I remember reading an article by Sid Lowe predicting that Xabi is making a strategic move to study football under Pep. This made him a student of 4-5 incredibly gifted manager with 4 of them being regarded as legends of the game.\n\nThis might be [the article](https://www.reddit.com/r/soccernerd/comments/2ezv1r/sid_lowe_xabi_alonso_to_bayern_munich_leaves_real/)\n\nForgot to mention but Benitiz too. Despite having a very bad time at Real Madrid but he was been known to be one of the biggest football nerds out there.\n\nI am soo excited to see what Xabi can do with this roster. He clearly seems to be on the right direction. \n\n  \n",
        "upvotes": 106,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfm97y/xabi_will_provide_a_unique_perceptive_he_was/"
    },
    {
        "id": "1kf6nrm",
        "author": "Ecstatic-Light-3699",
        "title": "Kylian Mbappé becomes the first player to reach 40 goal contributions in his debut season for Real Madrid since Cristiano Ronaldo in 2009.",
        "content": "",
        "upvotes": 915,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/faz20ldmdxye1.jpeg?auto=webp&amp;s=d72610f5e5d0428d1a07b75c3c75523bb7224f88"
        },
        "permalink": "/r/realmadrid/comments/1kf6nrm/kylian_mbappé_becomes_the_first_player_to_reach/"
    },
    {
        "id": "1kf8lv8",
        "author": "muaazmuaaz123",
        "title": "15 years ago, on this day Cristi scored his first ever la Liga hatrick",
        "content": "Suiii❤️",
        "upvotes": 546,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ny7d1v7b1yye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kf8lv8/15_years_ago_on_this_day_cristi_scored_his_first/"
    },
    {
        "id": "1kfwmqu",
        "author": "Thomas7Shelby",
        "title": "Looking for Real Madrid-focused YouTube &amp; Instagram pages (in English) for match analysis, transfer news, and club updates",
        "content": "I already follow Managing Madrid and really enjoy their content. I'm looking for other quality YouTube , Instagram pages or blogs (in English) that are dedicated to Real Madrid — including match analysis, transfer rumors, tactical breakdowns, and general club news.\n\nWould appreciate any recommendations!\n",
        "upvotes": 16,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfwmqu/looking_for_real_madridfocused_youtube_instagram/"
    },
    {
        "id": "1kfjs11",
        "author": "Messmers",
        "title": "[GolazoRO] Inter Milan eyeing Ceballos and Arda guler as a package deal for next season",
        "content": "",
        "upvotes": 103,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OaHBLK-M2LU6HSwEsgy9Z4MUTXlaUSf4HR_cjz1PRZ8.jpeg?auto=webp&amp;s=6b6617d9ef89de694b710d70000295a321626937"
        },
        "permalink": "/r/realmadrid/comments/1kfjs11/golazoro_inter_milan_eyeing_ceballos_and_arda/"
    },
    {
        "id": "1kfd6v0",
        "author": "Bilbo_Shaggins_2687",
        "title": "Trent's defending..is it really that bad?",
        "content": "I know no docs have been signed yet and it's not 100 percent confirmed (even though Fabrizio dropped the HWG), but I've been seeing a ton of comments about his defending being No Bueno. I haven't seen enough Liverpool games to have any real gauge of his defensive abilities. For those who have..hit me with the truth.",
        "upvotes": 161,
        "comments": 232,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfd6v0/trents_defendingis_it_really_that_bad/"
    },
    {
        "id": "1kfip4h",
        "author": "RecognitionPatient96",
        "title": "Who will wear no10 after Modric retirement?",
        "content": "With Luka Modrić nearing the end of his legendary spell at Real Madrid, the question arises: who will inherit the iconic number 10 shirt? This is not just about a number; it represents creativity, leadership, and elegance on the pitch — all qualities that Modrić embodied for more than a decade. The next wearer of the 10 shirt will carry not only tactical responsibility but also the symbolic weight of replacing a club legend. Real Madrid has not always had special players wearing this number like diarra robinho and james rodriguez, i think for 20 years just modric deserved that number. Now the eyes of fans around the world are turning to the current and incoming squad members to see who could be next in line. \n\nArda?  (Mypick)\n\nMbappe?\n\nRodrygo?\n\nWirtz?\n\nEndrick?",
        "upvotes": 76,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfip4h/who_will_wear_no10_after_modric_retirement/"
    },
    {
        "id": "1kf8fhg",
        "author": "aakash_shaji",
        "title": "Pérez pickpockets another freebie.",
        "content": "The absolute chaos on X over TAA departure from Liverpool is insane.  You’d think he has committed high treason by leaving Anfield for Madrid. The way people are roasting him for walking out for free is hilarious. Prem fans from every corner of the globe are uniting to cook him like he’s the main course. Some of the tweets are so brutal that I feel like he might not make it to Madrid in one piece. One post called him Judas with a better crossing stat😂😂😂😂😂😂. Honestly, it’s hilarious watching the entire football world lose their minds over this.Trent’s probably regretting ever dreaming of the Bernabeu right now but let's give a massive shoutout to Pérez even though hes done dog shit this season, for pulling off this heist of the century snagging Trent for zero euros!!!! His strategy is pure genius he'll targets world class players like Trent in their contract's final year, letting clubs sweat then jumping in for free or low cost deals, saving millions for us while building an empire. Leaving for free has turned Trent from one of the most loved footballers into football's public enemy number one.\r\n",
        "upvotes": 225,
        "comments": 107,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf8fhg/pérez_pickpockets_another_freebie/"
    },
    {
        "id": "1kfpqi0",
        "author": "Ordo1256",
        "title": "Reasons for optimism",
        "content": "It is may now and the season is coming to a close. The only thing we have left to play for is la liga and that will be decided this coming weekend. We’ve had what most would consider a disappointing season. We didn’t beat a single top team in any competition (other than man city), champions league ended in embarrassment, and we lost the CDR final in humiliating way. But there are a few takeaways to for next season that should give us real hope.\n\n1. Injury returns- Having lost Carvajal AND Militao to early season injuries was damning. We played without a quality right back all season and it showed. No balance, and no real athleticism in the right side of defense (militao helped with this as well). Having these two back will make our defense look completely different next season. People call out the midfield for being dysfunctional but they’re used to playing with Carvajal who can usually be found streaking up and down the right side assisting wherever needed. Midfield, attack, defense- it doesn’t matter, because Carvajal is essential to all of it. Militao with his closing speed will certainly be a difference in defense when compared to the likes of Rudiger and alaba, who appears to be declining very rapidly in particular. \n\n2. Trent Alexander-Arnold- This point kind of goes hand in hand with the one above, but it deserves it’s own point because I think this transfer is massive for Real Madrid. While I believe TAA will probably find himself at CB a few times next season, when he’s on the right side this team will be straight up unplayable. Valverde, rodrygo/guler on the right side with Trent racing behind, creates a dual threat from left to right which has not been seen since the Ronaldo/bale days. When the right side becomes dangerous, we will see mbappe shine- trust me.\n\n3. Arda guler- Arda Guler is Real Madrids next midfield maestro, and it’s only just begun. Passing, dribbling, shooting, hold-up play. He’s got it all. He passes all the eyeball tests, and he has stats to prove it. We’ve needed someone with his subtlety all season in midfield and we’ve been starved. This is one of my main gripes with ancelotti is that he only switches the system when it’s too late or things are getting dire. Irregardless, we can anticipate him to get more playing time and I predict that midfield is his and his alone by the end of next season\n\n4. We already have fantastic players- Yes, the team wasn’t the best this season. And yes, some of our BEST players has some dreadful games this season. That doesn’t change the fact that this is the best team on paper in the whole world. One bad season doesn’t change the fact that we have truly WORLD CLASS players all over the pitch. I will never be convinced that a team that contains, courtois, militao, valverde, Tchouameni, mbappe, vini, etc. is more than a transfer window or two away from a treble.\n\n5. We beat man city- This is one is more of a feel-good reason. Yes, they’re not at their best this season but it felt REALLY good to beat them the way we did. \n\nWe did not have the best season, and I’m more than frustrated that Barcelona is going to considered better than us, but I think they’re just dealing with some growing pains at the moment. Hala Madrid \n\nPardon the spelling.",
        "upvotes": 19,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfpqi0/reasons_for_optimism/"
    },
    {
        "id": "1kg5cca",
        "author": "Top_Peanut_3715",
        "title": "Top Football Players Out of Contract This Summer 2025 Free Agents!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S-k4qKDcJFCTkw-7BE1GVDDP3wAiFK_hXApHnO4UNe0.jpg?auto=webp&amp;s=a3ebf15ba72c50dc4c77b22a371349a753139a56"
        },
        "permalink": "/r/realmadrid/comments/1kg5cca/top_football_players_out_of_contract_this_summer/"
    },
    {
        "id": "1kf3cfx",
        "author": "Total_Escape_9778",
        "title": "Kylian Mbappe just needs 9 goals to overtake Rodrygo's Total La Liga Talley",
        "content": "**Rodrygo's La Liga Stats:** 32 Goals in 172 Games\n\n2019-20 =&gt; 2 Goals in 19 Games\n\n2020-21 =&gt; 1 Goal in 22 Games\n\n2021-22 =&gt; 4 Goals in 33 Games\n\n2022-23 =&gt; 9 Goals in 34 Games\n\n2023-24 =&gt; 10 Goals in 34 Games\n\n2024-25 =&gt; 6 Goals in 30 Games\n\n**Mbappe's La Liga Stats:** 24 Goals in 30 Games\n\n2024-25 =&gt; 24 Goals in 30 Games\n\n  \nI want to hear your opinion on this... I know they both play in different positions and mbappe also takes penalties but its still a shocking stats because rodrygo has played 5 more seasons than mbappe.\n\nPlus there are no excuses for the last season because rodrygo was freely allowed to play forward without much defensive duties yet he was not able to cross sergio ramos's highest goal talley in a la liga season of 11 goals. It's just very shocking to me\n\n",
        "upvotes": 339,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kf3cfx/kylian_mbappe_just_needs_9_goals_to_overtake/"
    },
    {
        "id": "1kf7xom",
        "author": "One-Persimmon8413",
        "title": "Trent Alexander-Arnold vs. Toni Kroos: Passing Stats That Could Fit Real Madrid’s Future",
        "content": "",
        "upvotes": 106,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/egvo7zkqtxye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kf7xom/trent_alexanderarnold_vs_toni_kroos_passing_stats/"
    },
    {
        "id": "1kfh55o",
        "author": "abrar_tanbir",
        "title": "Transfer Plan Before the 25/26 Season Starts",
        "content": "Currently, we have 22 players in the first-team squad. That number will drop to 19 after this season, as the contracts of Modric, Vallejo, and Vázquez will expire. Generally, the management like to have a 23-man squad, so they will add at least four players to the first team—through contract renewals, transfers, or promotions.\n\nThey will promote Asencio and add Trent to the squad, which means they will bring in two more players.\n\nNow the question is: what will the club do?\n\n**My Prediction:**\n\n* They’ll talk with Xavi and discuss Modric’s situation.\n* They’ll also talk about which position they want to strengthen.\n* Lastly, they’ll look at potential outgoings. Most likely, they’ll try to sell Alaba and Mendy to free up space.\n\nBut I don’t think either of them will actually leave. I also think they’ll renew Modric, bringing the squad up to 22. So in the end, they might just sign either a left-back or a center-back.\n\nHopefully after the Club World Cup, we sign both a left-back and a center-back, bringing the squad total to 24.\n\n**What I Want:**\n\n* I do want to see Alaba and Mendy leave and Modric to renew one last time. \n* I also want Endrick to go out on loan.\n* Ideally, I’d like us to sign:\n   * A left-back\n   * A center-back\n   * A playmaker like Kroos\n   * A forward like Joselu.\n\nso with Endrick on loan and adding 4 players we will have 25 players squad. The management need to do this as we are injury prone. also if any player outside Mandy and Alaba leaves like Lunin we should replace them accordingly.    \nWhat do you think the club will do? And what do *you* want to see happen?",
        "upvotes": 23,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kfh55o/transfer_plan_before_the_2526_season_starts/"
    },
    {
        "id": "1kelxr2",
        "author": "Pebbledthoughts",
        "title": "UNBELIEVABLE!!!!!! Speechless Performance",
        "content": "",
        "upvotes": 2937,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2b72398u5sye1.jpeg?auto=webp&amp;s=207495de47de8e28a0dc881b21afb30fbd79938c"
        },
        "permalink": "/r/realmadrid/comments/1kelxr2/unbelievable_speechless_performance/"
    }
]