[
    {
        "id": "1mn8vcf",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 196,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mn8vcf/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mn916e",
        "author": "fifaddict-barna",
        "title": "didn't you just love this hidden inside our third kit?! 😍🥹🤍",
        "content": "",
        "upvotes": 622,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c8phbehn7dif1.png?auto=webp&amp;s=e0f917161c28ad9d685ab82ac0cf7e9a7be719bd"
        },
        "permalink": "/r/realmadrid/comments/1mn916e/didnt_you_just_love_this_hidden_inside_our_third/"
    },
    {
        "id": "1mnbras",
        "author": "KjOnReddit1010",
        "title": "🚨🔵 Manchester City are considering move for Rodrygo after imminent exits.\n\nGrealish gone, McAtee and Savinho can leave… and #MCFC see Rodrygo as dream target, Guardiola big fan.\n\nReal Madrid will let him leave if player wants - asking around €100m.",
        "content": "[https://youtu.be/SPD4es\\_7iRE](https://youtu.be/SPD4es_7iRE)",
        "upvotes": 388,
        "comments": 126,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mnbras/manchester_city_are_considering_move_for_rodrygo/"
    },
    {
        "id": "1mne7vi",
        "author": "DiamondNo3132",
        "title": "BBC never played a full 90 minutes together under Zidane",
        "content": "This isn’t a myth. Data and match records confirm it — the last time Bale, Benzema, and Cristiano completed a full match together was back in December 2015, before Zidane even became Real Madrid’s coach in January 2016. After that, whether due to injuries, tactical changes, or Zidane’s substitution strategy, the trio was never on the pitch from the first to the final whistle in a competitive match.",
        "upvotes": 169,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mne7vi/bbc_never_played_a_full_90_minutes_together_under/"
    },
    {
        "id": "1mmmnzw",
        "author": "o6ohunter",
        "title": "Throwback to when Mbappé immediately noticed the double touch",
        "content": "",
        "upvotes": 2153,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1qqu5z6xv7if1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mmmnzw/throwback_to_when_mbappé_immediately_noticed_the/"
    },
    {
        "id": "1mn9b70",
        "author": "Gutihaz_14",
        "title": "What is your opinion on Luis Figo?",
        "content": "I have been watching back some RM matches of the past, and I have been wondering about the reputation of Figo. As a child, I was never drawn to him, and now watching him again, I just dont feel the spark. I know he had some great moments, but what is the general consensus about his time at Real? Is he in your all time TOP 25 players for RM? Does anyone have him as his favourite? Strictly footballing-wise, not as a polticial, galactico statement.",
        "upvotes": 34,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mn9b70/what_is_your_opinion_on_luis_figo/"
    },
    {
        "id": "1mni4hw",
        "author": "Novel_Exchange_356",
        "title": "Couldn't get that magical season out of my mind, had to make this. HALA MADRID!",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bnexccxs5fif1.jpeg?auto=webp&amp;s=ec6648b5a417874eb31ad0369ca9c628511cd777"
        },
        "permalink": "/r/realmadrid/comments/1mni4hw/couldnt_get_that_magical_season_out_of_my_mind/"
    },
    {
        "id": "1mni1kh",
        "author": "Sysyphus8",
        "title": "Why doesn’t Xabi rate Rodrygo?",
        "content": "NGL, The latest Man City news has hurt me quite a bit. It’s baffling how Xabi Alonso doesn’t seem to rate Rodrygo. He gave him barely any minutes at the Club World Cup, no assuring statements from him during pressers ever, and not once has he hinted that Rodrygo is part of his long term vision. What’s even more confusing is that Rodrygo is pretty much Xabi’s type of player. Low on unnecessary flair and extravagant shehnanigans, high on work rate, pressing discipline, and tactical side. He’s not flashy like some, but as lethal , technical and clinical as they come. I really thought Xabi would be high on Rodrygo but have never got the vibe that Rodrygo is someone he’d pick or build around. Sure, Vini and Mbappé are undisputed starters but that doesn’t justify the brutal sidelining of a player of Rodrygo’s calibre imo.",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mni1kh/why_doesnt_xabi_rate_rodrygo/"
    },
    {
        "id": "1mmig9k",
        "author": "soldier101br",
        "title": "Our current number 9, Endrick with our galático number 9,Ronaldo",
        "content": "",
        "upvotes": 723,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gi9opa8v07if1.jpeg?auto=webp&amp;s=12bc9d0d8785d9cf465a665ca692981b635bd67d"
        },
        "permalink": "/r/realmadrid/comments/1mmig9k/our_current_number_9_endrick_with_our_galático/"
    },
    {
        "id": "1mmud6y",
        "author": "Americaparasiempreee",
        "title": "Throwback: On this day in 2022, Real Madrid won their 5th UEFA Super Cup",
        "content": "",
        "upvotes": 153,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bdffb039d9if1.jpeg?auto=webp&amp;s=d6f17b256e6826e769cf46b68099ad9bc27543bf"
        },
        "permalink": "/r/realmadrid/comments/1mmud6y/throwback_on_this_day_in_2022_real_madrid_won/"
    },
    {
        "id": "1mmps2s",
        "author": "Ready_Ad_1353",
        "title": "Eduardo Camavinga has been diagnosed with a sprain in his right ankle.",
        "content": "",
        "upvotes": 205,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1mmps2s/eduardo_camavinga_has_been_diagnosed_with_a/"
    },
    {
        "id": "1mmmsrj",
        "author": "soulhunterrai",
        "title": "How do Real Madrid fans feel when their Basketball club is the biggest one in European history and has the same heritage as their Football club? (Having 2 biggest clubs in Europe among the 2 most popular sports in Europe is crazy to me).",
        "content": "Football club has big European history as the biggest trophy UCL (15) Basketball club has the most out of any in Europe with 11 Euroleagues. And a lot of domestic trophies too, basically a club like real Madrid has 2 biggest clubs in a continent where football and basketball are the 2 most popular Sports among population. ",
        "upvotes": 199,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c4y1u72yw7if1.png?auto=webp&amp;s=2e97e40878403b4fd77a550c871399069d76591d"
        },
        "permalink": "/r/realmadrid/comments/1mmmsrj/how_do_real_madrid_fans_feel_when_their/"
    },
    {
        "id": "1mnhhn8",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid W 3 - 1 Madrid CFF | Goals by Feller, Eva Navarro and Weir | Friendly match",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mnhhn8/fem_real_madrid_w_3_1_madrid_cff_goals_by_feller/"
    },
    {
        "id": "1mmkha8",
        "author": "ace-s",
        "title": "Camavinga injured his ankle, he will be out for 10 days.",
        "content": "Idk guys, he seems to never be fit. he missed a large portian of last season.\n\nThis is our main issue, we have like 6-7 players in our main roster that are always facing injury issues.",
        "upvotes": 177,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mmkha8/camavinga_injured_his_ankle_he_will_be_out_for_10/"
    },
    {
        "id": "1mnepm6",
        "author": "marcosabruna",
        "title": "Third Kit Color - Authentic vs Replica",
        "content": "Hey all,\n\nHopefully someone can help me with this. I haven't bought a Real Madrid jersey since the Decima and this new kit color is making me buy one, absolute beauty but.... i am confused. I am seeing the authentic vs the other version and the color looks way different.   \n  \nDo they look way different in person? The one the players are modeling is the authentic or replica verion? Because that is the one i want, long sleeve too. Authentic is about $300 for me vs replica $200 so want to be sure. And i don't play, and will barely use it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mnepm6/third_kit_color_authentic_vs_replica/"
    },
    {
        "id": "1mmnhud",
        "author": "No_Fill_6005",
        "title": "⚽ Just made a Real Madrid motor cover for my 3D printer!",
        "content": "https://preview.redd.it/m3mkup3v18if1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=54cfefb9e8c5e0636e8826b73dca3abfd1e7006d\n\nBrought a bit of Hala Madrid to my workspace with this custom motor cover I 3D printed for my machine.\n\nThe crest is fully raised, so it’s easy to paint or print in multiple colors — mine’s AMS printed, but it would look great hand-painted too.\n\nThinking of making more Real Madrid–themed printer upgrades.\n\nWhat would you like to see next?\n\n**Free to download if you want to print one yourself** ⬇️  \n🔗 [https://makerworld.com/en/models/1687952-real-madrid-motor-cover-a1-ams-paint-ready#profileId-1788950](https://makerworld.com/en/models/1687952-real-madrid-motor-cover-a1-ams-paint-ready#profileId-1788950)",
        "upvotes": 28,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mmnhud/just_made_a_real_madrid_motor_cover_for_my_3d/"
    },
    {
        "id": "1mlk4c6",
        "author": "you_matter_",
        "title": "My personal fav all time RM team",
        "content": "Going with 4-3-3 Attack formation\n\nGK: Fede Valverde\n\nRB: Fede Valverde\n\nCB: Fede Valverde (c)\n\nCB: Fede Valverde\n\nLB: Fede Valverde\n\nCM: Fede Valverde\n\nCM: Fede Valverde\n\nCAM/CF: Fede Valverde\n\nLW: Fede Valverde\n\nST: Fede Valverde\n\nRW: Fede Valverde\n\nI honestly think it wouldn't be fair play to the other teams.\n\nThreepeating the threepeat 👏🏻👏🏻👏🏻",
        "upvotes": 1797,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mlk4c6/my_personal_fav_all_time_rm_team/"
    },
    {
        "id": "1mm8blz",
        "author": "Ecstatic_Store_719",
        "title": "First Bernabéu trip next month, and exploring Madrid for the first time!",
        "content": "it's actually happening! I'm visiting the Santiago Bernabéu for the very first time next month, and also getting to explore Madrid itself. Feeling pretty buzzed about it.\n\nJust throwing it out there: for anyone who knows Madrid well or is visiting soon, what are your top recommendations for things to see or do beyond the stadium? \n\nAlways looking for local insights!",
        "upvotes": 30,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mm8blz/first_bernabéu_trip_next_month_and_exploring/"
    },
    {
        "id": "1mliwbj",
        "author": "EffectiveTie3144",
        "title": "OTD August 9 2018, Thibaut Courtois was presented as a new Real Madrid player.",
        "content": "",
        "upvotes": 846,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mliwbj/otd_august_9_2018_thibaut_courtois_was_presented/"
    },
    {
        "id": "1mlp1if",
        "author": "Ready_Ad_1353",
        "title": "Saudi Arabia considers Alaba and Ceballos",
        "content": "",
        "upvotes": 168,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pU2CX62Yp_fJR4vA42KcAJZbIyRZo6BVf9ip82GZOxw.jpeg?auto=webp&amp;s=530a3c56e838945b178e6c90e8b06d7986ce1896"
        },
        "permalink": "/r/realmadrid/comments/1mlp1if/saudi_arabia_considers_alaba_and_ceballos/"
    },
    {
        "id": "1mlnft4",
        "author": "Novel_Exchange_356",
        "title": "Was busy today because of a festival but realised that it has been 7 years of this legend's greatness gracing us. So had to make this. HALA MADRID!",
        "content": "",
        "upvotes": 195,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2ysu4mtnezhf1.jpeg?auto=webp&amp;s=44cc1c127e5f520747fb0156a363d2d647c4f6e5"
        },
        "permalink": "/r/realmadrid/comments/1mlnft4/was_busy_today_because_of_a_festival_but_realised/"
    },
    {
        "id": "1mlpqhu",
        "author": "ExotiquePlayboy",
        "title": "Who are the 5 greatest Real Madrid players in history?",
        "content": "In baseball, the New York Yankees have something called “Monument Park”\n\nWhere despite hundreds of great players having played for the Yankees, only 5 players in their history have been awarded with a statue in the stadium.\n\nWhich 5 players would this be for Real Madrid? \n\nIt’s kind of like a Mount Rushmore. ",
        "upvotes": 121,
        "comments": 129,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mlpqhu/who_are_the_5_greatest_real_madrid_players_in/"
    },
    {
        "id": "1mlsvtr",
        "author": "Zdml22",
        "title": "I had a revelation. (Weird ass dream)",
        "content": "Fuck it, two strikers up on top. Endrick and Gonzalo. Both supporting each other, getting a hat-trick each, winning the game 6-0 versus Osasuna. Güler with two assists, and Ceballos with two himself. We had the usual starters rest for this game, and our bench warmers all give a world-class performance. Life is good as a Madridista again. ",
        "upvotes": 54,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mlsvtr/i_had_a_revelation_weird_ass_dream/"
    },
    {
        "id": "1ml7z4m",
        "author": "ItIsOnlyDavid",
        "title": "This goal saved my life (read the description)",
        "content": "First off sorry for the quality of this video, couldn't get it downloaded in a better quality.\n\nI felt like sharing a piece of my story and the relationship I have with this goal. In early 2024 I had one of my worst if not the worst periods in my life. I felt like a piece of garbage back then, still not over my ex, not confident in myself. I was seriously considering ending it all, feeling like I couldn't be loved and that nothing could ever bring me joy. In those difficult moments, I couldn't find happiness in anything besides football, more specifically: Real Madrid.\n\nI've been a supporter for almost 11 years at that time. The 23/24 season was going great, almost like Los Blancos wanted me to keep going. Only one loss, great La Liga campaign, and promising UCL performances made waiting for thier games a nightmare. In January I was at my lowest, crying myself to sleep almost every night, feeling disturbed and upset all the time. But as always up to that point in the season I had time to watch Real in the evening. Supercopa might not sound like that much but at that moment every match they played was like a sweet relief for me, a break from cruel reality. And that's what brings me here, to this match and this goal.\n\nReal Madrid vs Atletico Madrid in the supercopa semifinal was a rolercoaster of emotions, going behind early to taking the lead through Ferland Mendy, to Kepa's mistakes that, for a while looked, to be the final blow for us as Atletico went 3-2 up. At that point I didn't really think of it that much, but from the perspective of time, this scoreline could've be my end as another bigger break from Real Madrid matches, the only thing that made me happy, was a giant blow for my already bad attitude.\n\nThen Carvajal scored... just take a look at the video (and yes the polish commentary is also quite sentimental for me). I was overjoyed. Goal scored by team, goal scored by determination. It's poetic for me.\n\nOf course we went on to win this match (through Carvajals cross may I add) and secured the title later that week. It was the first happy moment in weeks for me.\n\nNow over a year and a half later, I'm happy again, I love my life, I love my family and my friends. It's incredible that a spanish right-back putting the ball in the back of the net may have kept me going. Thank you Carvajal, thank you Real Madrid. \n\nPlease check on your friends, family members, mutuals and most importantly yourself. Speak to professionals if you need help. I was lucky enough for a well disposed team to save my life, but it might not be enough for others. Take care and Hala Madrid!",
        "upvotes": 955,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1nnc3o6i1vhf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ml7z4m/this_goal_saved_my_life_read_the_description/"
    },
    {
        "id": "1ml6xzl",
        "author": "Worldly_Pitch_2990",
        "title": "Endrick is the new Number 9",
        "content": "It’s official — Endrick will be our new number 9. I’m fully behind this decision. Endrick is a prodigy with huge potential, and even though Ancelotti wasn’t bold enough to start him ahead of some underperforming players last season, he still made a big impact in his limited minutes — even finishing as our top scorer in the Copa del Rey (5 goals). Him and García could form an incredible partnership for years to come.",
        "upvotes": 921,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ml6xzl/endrick_is_the_new_number_9/"
    },
    {
        "id": "1ml6rya",
        "author": "hlrdavid",
        "title": "Militão's goal from beyond the halfway line vs Leganés today",
        "content": "",
        "upvotes": 764,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xomb8fzqzuhf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ml6rya/militãos_goal_from_beyond_the_halfway_line_vs/"
    },
    {
        "id": "1mkws2o",
        "author": "cyrusmancub",
        "title": "Zizou rocks the third kit",
        "content": "",
        "upvotes": 2181,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2v4vghnb3thf1.jpeg?auto=webp&amp;s=9bc80134d5e7ac3ba99bc9bc6f6347ea75086a1e"
        },
        "permalink": "/r/realmadrid/comments/1mkws2o/zizou_rocks_the_third_kit/"
    },
    {
        "id": "1ml7uqs",
        "author": "Ruben12ES",
        "title": "Gonzalo is the new number 16",
        "content": "",
        "upvotes": 486,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p732pd0i7vhf1.jpeg?auto=webp&amp;s=4467866deee64f71acfc3e84c8926cbac2a4b6a6"
        },
        "permalink": "/r/realmadrid/comments/1ml7uqs/gonzalo_is_the_new_number_16/"
    },
    {
        "id": "1mllwj4",
        "author": "chunchunmaru1129",
        "title": "Okay let's see what we have for the upcoming season",
        "content": "Bellingham is out for some time I don't know about camavinga.\n\nTchoumeni will 100% play a cb/cdm libero role.\n\nValverde will push higher up when attacking and will do the most amount of physical defensive work in the midfield.\n\nGuler will be used like a free roaming playmaker 8/6 hybrid.\n\nBrahim or Franco might play in Bellingham's role.\n\nVini and Mbappe are the 2 most important pieces of the puzzle in the coming season and the million dollar question is will these 2 press together alongside the team.\n\nGonzalo will come of the bench.\n\nTrent will be playing wing back alongside carrares.\n\nHuijsen will be extremely important in the back line.\n\nRudiger and Asensio need to get their shit together.\n\nMilitao needs to be fit.\n\nRodrygo I don't know man what you will do.\n\nAlada and Mendy please just leave.",
        "upvotes": 39,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mllwj4/okay_lets_see_what_we_have_for_the_upcoming_season/"
    },
    {
        "id": "1mmvm4i",
        "author": "ReplacementUnited740",
        "title": "No one noticed this important detail but we have no images of the goals during the friendly match (Except the goal from our area)",
        "content": "And that's fucking good news.\nThis is just proof for the few people who doubted it that tactically the team is going to be incredible this season. \nThe only thing I find weird is the attack trio.( Mbappe on the left, Garcia in the center and Vini on the right) \nThe fact that Vinicius is on the right is strange because he is by far the player who is capable of making the most difference on the left. But maybe that also means that Vinicius will be less creative and more decisive. \nI hope Mbappe really improves his long-distance shooting this season, otherwise he's not going to get back to his prime anytime soon. \nAnd it's cool that we trust Garcia, we really needed a REAL number 9\nWe're going to have a great year of football",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mmvm4i/no_one_noticed_this_important_detail_but_we_have/"
    },
    {
        "id": "1ml6wvu",
        "author": "ace-s",
        "title": "the choice of jersey number at Real Madrid is based on seniority. Ahead of Gonzalo, the entire squad had priority to choose the number 9. When Endrick chose the 9, there was no option for Gonzalo to pick it.",
        "content": "",
        "upvotes": 295,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ml6wvu/the_choice_of_jersey_number_at_real_madrid_is/"
    }
]