[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 47,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qm64ef",
        "author": "steal_your_thread",
        "title": "Skyscraper Live is all wrong",
        "content": "Netflix have gotten this wildly wrong, they don't seem to remotely understand what we wanted from this. I straight up couldnt care less about this random commentator having a crack at a part of the climb, or a prerecorded clip of Alex talking about not wanting to die. \n\nWE WANT TO WATCH THE CLIMB.\n\nShut up, keep the climb on the large screen and put all your stupid nonsense filler in that mini screen, if on at all, and STOP TALKING OVER ALEX. They are adding absolutely nothing to this, no commentary at all would be significantly better than these terrible commentators saying how 'scary and dangerous' for the 100th time.",
        "upvotes": 2163,
        "comments": 464,
        "media": null,
        "permalink": "/r/netflix/comments/1qm64ef/skyscraper_live_is_all_wrong/"
    },
    {
        "id": "1qm5w0n",
        "author": "bh4v1_",
        "title": "Netflix, you should have done better on skyscraper live",
        "content": "People inside the buildings coming up and waving, the constant commentary over Alex speaking, the unnecessary conversations with him while he’s over a building and getting the crowd to shout at him whilst he’s up there. Having his wife appear from inside - it’s like they’re doing everything they can to throw him off his game. This is incredibly anxiety inducing as it is, and it’s like the production team have instructed certain behaviours to make it borderline unbearable. It just feels so performative which is not what his climbs are usually about. \n\nI get it’s fun for the show, and looks cool, but the guy is climbing a skyscraper ffs. \nHe’s doing enough to get you your views, please just let us watch him climb and PLEASE LET US HEAR HIM. I’m so sick of the constant yapping from the panellists; it’s like they’ve been told not to come up for air. Stop doing weird commentary and playing these videos when he’s talking, we want to hear his thoughts, his process, his funny quips. \n\nFeels really irresponsible of Netflix to allow this tbh; like the marvellousness of a free solo climb is just being made a mockery of tbh and this is a real person up there. A huge disservice to climbing, and to Alex. Props to him for absolutely giving the crowd what they’re after though. Couldn’t be me! \n",
        "upvotes": 459,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5w0n/netflix_you_should_have_done_better_on_skyscraper/"
    },
    {
        "id": "1qm5a5m",
        "author": "LosJones",
        "title": "The commentary on this live stream is annoying",
        "content": "Can they shut up for twenty seconds? He's talking and they're just speaking right over him. It makes it almost unbearable to watch. \n\nI hope they learn from this if they ever do anything like this again",
        "upvotes": 412,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5a5m/the_commentary_on_this_live_stream_is_annoying/"
    },
    {
        "id": "1qm7cvv",
        "author": "SavedMist36005",
        "title": "Commentary during the climb genuinely upset me",
        "content": "I know a lot of us are annoyed about the commentary but did anyone else get super irritated when Alex tried to lock back in and keep climbing and the commentator literally stopped him, and asked if he could hear the crowd?\n\nI thought that was so rude and unprofessional, he’s literally trying to focus and you’re interrupting ",
        "upvotes": 158,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qm7cvv/commentary_during_the_climb_genuinely_upset_me/"
    },
    {
        "id": "1qm38tl",
        "author": "Explosive_Doggo",
        "title": "Is \"skyscraper live\" really a live?",
        "content": "just sounds like a horrible idea to do a super life threatening challenge on live, and would be a giant detriment to Netflix's reputation if some accident happened, it just makes sense that they would record it before going \"live\" to make sure there's no complications ",
        "upvotes": 90,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1qm38tl/is_skyscraper_live_really_a_live/"
    },
    {
        "id": "1qmoicz",
        "author": "Jay20173804",
        "title": "Netflix over commercialized Tapei 101, they will ruin all sports they host",
        "content": "What is the point of these Nature and Nature-esque Adventure Docs? For the viewer to be immersed, explore, and understand without overexplained talking points. Free Solo was an extension of that. When you are high up, you are looking for peace and to leave the heck of it all below you. What we got yesterday was the antithesis of peace. Elle Duncan, Mark Rober, etc., were named, but they were not needed; they don't understand the point of being Free. Sure, you hire these people, but nobody wants them. There is a reason Elle Duncan never worked out on ESPN. If Netflix wanted more respect, they could have gotten Will Smith, Jimmy Chin, Zac Efron, etc. to host. People who actually understand what Alex is doing, people who want to live in the moment and not make it this is my 9/11. This was unacceptable and a masterclass of complete disaster.",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qmoicz/netflix_over_commercialized_tapei_101_they_will/"
    },
    {
        "id": "1qmdty6",
        "author": "Crafterandchef1993",
        "title": "A Ballad of Songbirds and Snakes is really good",
        "content": "I'm going to try and keep this spoiler free. I actually never read the book, but now it's being added to my reading list. The first third of the movie hits like an action romance, the second sort of goes from that, slowly morphing into its final form, when it's a psychological thriller. The soundtrack and camerawork do a great job making the ending absolutely terrifying and anxiety inducing. Definitely give it a watch if you like the Hunger Games series.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qmdty6/a_ballad_of_songbirds_and_snakes_is_really_good/"
    },
    {
        "id": "1qmnnpx",
        "author": "odienz",
        "title": "Awful Video Quality, How to Check Real Time Stream Info (Android)?",
        "content": "I have Premium plan (4K+HDR) and enough internet speed. My device playback specs are L1, Full HD, etc, and setting on High for download and cell data usage. \n\nOn my TV I can stream 4K no problem, on my PC I can get decent quality too. Yet, when I'm watching on my phone it's awful.\n\nAnyway I can check the real-time stream info on Android Netflix app? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qmnnpx/awful_video_quality_how_to_check_real_time_stream/"
    },
    {
        "id": "1qmn2nm",
        "author": "Guenz_x",
        "title": "Spoilers",
        "content": "Netflix has to STOP giving me spoilers when I want to click a show I’m watching. Like for example, I’ve been watching She-Ra these days and everytime I went and clicked the title to continue (you know the preview?) I got like a snippet of the show, and you might be thinking: “well, that’s normal, it’s like the trailer” but no, it showed me spoilers,\\*SPOILERS FOR SHE-RA INCOMING\\* like glimmer becoming queen for some reason (does that mean her mother is dead?) and the sword that is broken and stop doing that! I don’t want to know what happens before it happens! Like I understand if I saw that in another platform but why are you doing that right here on Netflix? You could just show me things I already watched or the trailer for the show.\n\nBtw sorry for my grammar I’m not a native English person.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qmn2nm/spoilers/"
    },
    {
        "id": "1qm9bng",
        "author": "Thejoe923",
        "title": "Looking for new comedy suggestions, Am I missing any must-watch comedies out there?",
        "content": "Here are comedies I’ve watched and how much I liked them (rough ratings):\n\n• The Office (US &amp; UK) — 10/10\n• BoJack Horseman — 9/10\n• Family Guy — 9/10\n• Derry Girls — 8.7/10\n• Parks &amp; Rec — 8.5/10\n• I Think You Should Leave — 8.5/10\n• Big Mouth — 8/10\n• Tires — 8/10\n• Derek — 8/10\n• Brooklyn Nine-Nine — 7.5/10\n• Arrested Development — 7.5/10\n• Man on the Inside (season 1) — 7.5/10\n• Superstore — 7/10\n• Schitt’s Creek — 6.5/10\n\nAm I missing any must-watch comedies out there? \nOpen to anything with smart humor, absurd comedy or dark ",
        "upvotes": 5,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qm9bng/looking_for_new_comedy_suggestions_am_i_missing/"
    },
    {
        "id": "1qmh9h1",
        "author": "TeamHoppingKanga",
        "title": "The Crown but for the Roman Empire",
        "content": "I have no clue how to get this idea out there but Netflix CEO’s or creative directors if you’re reading, this concept is yours for the taking, free of charge from me. \n\nThe Crown but for the Roman Empire. Historically accurate, dramatic recreation from the conception of the Roman Empire to its eventual downfall. \n\nThis is a cash cow, sure thing money maker! \n\nThank me later, no check needed. You’re welcome!",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qmh9h1/the_crown_but_for_the_roman_empire/"
    },
    {
        "id": "1ql4deb",
        "author": "Large-Cardiologist54",
        "title": "Does anyone else spend more time choosing than actually watching?",
        "content": "I don’t know how many times I open up Netflix, sit down with snacks ready… and some how 20 minutes later I am still scrolling lol.. \n\nI mean it’s not that there’s “nothing” to watch. It’s that everything feeling like a commitment nowadays…\n\nIt’s either too long, too heavy, or not the right mood. \n\nHalf the time I just give up and rewatch something I’ve already seen. \n\nIs this just me, or does choosing feel harder than watching 😩?\n\nWhat do you usually end up doing when this happens? ",
        "upvotes": 1071,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4deb/does_anyone_else_spend_more_time_choosing_than/"
    },
    {
        "id": "1qlg076",
        "author": "ashbat1994",
        "title": "Why can't I watch end credits on TV anymore?",
        "content": "I like to sit with the end credits for a while to absorb and contemplate what I've experienced. I've disabled autoplay but after finishing any movie or show I get a giant ad on what to watch next with the end credits being in a tiny box. \n\nEarlier I could go and choose to watch credits but now any any navigation remote button I press just completely stops it. It's been happening since the past week or so, completely frustrating and dampens the experience.",
        "upvotes": 191,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qlg076/why_cant_i_watch_end_credits_on_tv_anymore/"
    },
    {
        "id": "1qmkz97",
        "author": "Zarguthian",
        "title": "Any way to watch Netflix on unsupported bowsers?",
        "content": "I really like watching Netflix but much prefer Maxthon as my web browser. The app is actually just a Microsoft Edge add-on. Whenever I try to watch on Maxthon I get:\n\n&gt;Sorry, we're having trouble with your request.  \nError Code UI3012",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qmkz97/any_way_to_watch_netflix_on_unsupported_bowsers/"
    },
    {
        "id": "1qmdtid",
        "author": "LetsRollPve",
        "title": "The ranch s4 e3",
        "content": "So it dawns on me...\n\n  \nNot just 2 episode prior they talked to neighbor Peterson about buying his ranch, and said \"sure we can work it out\"\n\n\n\nthen they received an offer from the gas distributor to put piping on their land...\n\n\n\nWhy would take they just say yes and buy the Peterson place?\n\n\n\nseems.. like a loophole writers forgot to plug. But this is my first playthrough so maybe they do.. or maybe not​",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qmdtid/the_ranch_s4_e3/"
    },
    {
        "id": "1qm7lwm",
        "author": "Ashwasherexo",
        "title": "Book Adaptations",
        "content": "I just got done reading Kill For Me Kill For You By Steven Cavanagh. I could totally see this being made into a thriller movie!! \n\nThis book was an incredible ride. There were so many twists and turns that will leave you a bit breathless.   I often thought, as I was reading it, I could predict what would happen next.  I was wrong.  At every turn.   When I thought it would go left, it went right.  If I thought right, it would take a U-turn, then turn right and then head up into space.  I couldn’t predict it at any point.  And that felt AMAZING.  An incredible thriller from start to finish.  Oh and an ending that was oddly refreshing.  Unforgettable.  \n\nAre there any books you can see being made into a movie made by netflix? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qm7lwm/book_adaptations/"
    },
    {
        "id": "1qmbmxw",
        "author": "Alive-gamer",
        "title": "Date-night movie help — looking for a cozy, slow-burn romantic film on Netflix (which should I pick?)",
        "content": "Hey everyone — planning a cozy date-night with my girlfriend tonight and want something that sets the mood: quiet/slow-burn or warm &amp; flirty (nothing too violent or depressing). Prefer Netflix picks so we can start right away. Short descrs below — which one would you pick for cuddles, kisses, and good vibes?\n",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qmbmxw/datenight_movie_help_looking_for_a_cozy_slowburn/"
    },
    {
        "id": "1qm989x",
        "author": "gyubi_06",
        "title": "The A list rant",
        "content": "I just finished binge watching s2 and this whole setup is genuinely so bad it pisses me off. Nothing is ever explained properly and we’re expected to take whatever we see and roll with it. It’s unfortunate because the plot could’ve been more refined.\n\nWhat’s with the tooth tree and the opening in the ground Alex and Petal found? And the growling sounds? Never explained. How did Amber fall off a cliff and reappear so close to the party site after Mia ran to get help (I thought it was going to be a clone thing). Never explained.\n\nLuke wasn’t a character we needed, Mia is not the hero we all want and I’ll be assuming the relationship Dev and Mia had before Amber messed with them was the reason they got together even though they never explicitly told us if Dev and the others got their memories back. (Given that Midge had to make Mia remember and none of them remembered the funeral)\n\nLuka and Mia did NOT need to kiss, stupid plot point. The doll house also had almost no significance. She went to “face her past” and did nothing but get tricked. That could’ve happened anywhere. They also didn’t explain why Jenna and Luka had those not seemingly random headaches after they got injected with the drug?\n\nHarry’s disappearance was never properly explained. I thought only dead people appeared as those black figures and I thought he was dead all along. Why do Sam and Midge have physical forms? Why did the ghosts mark Luka?\n\nAmber was the only interesting thing about this whole fiesta and her existence isn’t even properly explained, I kept going thinking the ending would at least be satisfying but it wasn’t. I wish Amber disappeared, I wish the ending didn’t try to infer Midge was living as Mia. I would’ve taken that. Blood sisters my arse.\n\nThere might be more but these are the ones that really stuck with me, I went from curious to pissed off really fast.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qm989x/the_a_list_rant/"
    },
    {
        "id": "1qluo6u",
        "author": "seldom_r",
        "title": "Suggested shows starting at the last season instead of the first",
        "content": "Netflix keeps doing this. Displaying recommendations for a show and you click thru to watch it. After a while you realize you are missing something, some part of the story. You check and see they started you on Season 2 or 6 or whatever the last season was instead of the first.\n\nThis has been happening to me for years and it makes no sense that they can't figure this out already. It is their business.. how can they be so careless?\n\nThe UI is so stripped down that it is impossible to get show information without finessing it. A sentence or two description which usually isn't helpful and no ratings or reviews. \n\nThey want you to just click on thru from their suggested row without knowing anything and the one thing they have to do is start from the beginning. It really bothers me that such a huge company with ever increasing fees refuses to update the UI or fix major bugs. \n\nOther streamers have figured it out, why not Netflix? Am I missing something or am I the only one with this problem.\n\nI'm a browser user, not app or tv app, just the web browser. It can't be this hard.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qluo6u/suggested_shows_starting_at_the_last_season/"
    },
    {
        "id": "1qlviyi",
        "author": "PainterStrong651",
        "title": "We need another season of the circle please",
        "content": "I have been watching all of the seasons do #thecircleUS and where is the 8th SEASON? Why aren’t we getting anymore info!!!! Please tell us something at least. I love this show more than anything else on Netflix ! ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlviyi/we_need_another_season_of_the_circle_please/"
    },
    {
        "id": "1qlv3c0",
        "author": "ankoch1119",
        "title": "No Titles Currently Streaming in 4K?",
        "content": "I have the Premium plan, and I used to be able to see what titles were 4K or HD. However, I no longer see those icons indicating video quality. I assumed it was just an issue with the UI of my 4K Smart TV's Netflix app. However, I've seen a couple other people complaining about something similar, and when I go into my desktop app, every title is showing HD as opposed to 4K. I've triple checked my plan to confirm that I do have Premium with 4K streaming capability.\n\nPlus, when I go onto Letterboxd, no Netflix titles are listed as being available in 4K. This includes brand new Netflix originals and movies that were absolutely in 4K recently. \n\n  \nAny idea what's happening?",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qlv3c0/no_titles_currently_streaming_in_4k/"
    },
    {
        "id": "1qlc7e3",
        "author": "worrynelly",
        "title": "Unpopular opinion (maybe?): Season 5 of Emily in Paris just didn’t hit the same 😬",
        "content": "&amp;#x200B;\n\nOkay, I went into Emily in Paris Season 5 ready for the cute outfits, chaotic love triangles, dreamy Europe vibes.. the usual comfort-watch formula.\n\nBut somehow? It felt a little flat.\n\nThe fashion was still fun, and Paris/Rome remain unreal, but the storylines felt recycled. Same relationship drama, same misunderstandings, same Emily making questionable decisions but somehow winning anyway. I kept waiting for a moment, a twist, growth, something,  and it never really came.\n\nAlso, does anyone else feel like the characters are kind of stuck? Like five seasons in and we’re still running in circles emotionally? I miss when the show felt light, surprising, and effortlessly charming instead of predictable.\n\nThat said, I didn’t hate it. It’s still an easy, colorful watch. Just not the binge obsession it used to be.\n\nCurious if it’s just me though 👀\n\nDid you love Season 5, or are you feeling the Emily-in-Paris fatigue too?",
        "upvotes": 40,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qlc7e3/unpopular_opinion_maybe_season_5_of_emily_in/"
    },
    {
        "id": "1qlqlst",
        "author": "Imaginary-Shock4917",
        "title": "Social media has ruined this genre",
        "content": "My favourite movies are the ones with a crazy twist at the end, mainly because I’m really bad at guessing what’s about to happen so I suppose it’s a natural shock to me. Also, I absolutely hate spoilers so if I accidentally tly read a spoiler about a film or movie I was intending on watching , I don’t watch (eg Shutter Island 😤) Anyway, I was looking forward to watching the short series His and Hers, as I’d read that it was that type of film, but because I read one comment about how much of a crazy twist this series had, before I’d gotten around to watch it, I started to see other comments of a similar nature (social media feed for you). Although this isn’t a direct spoiler, I managed to guess what would happen early on and I suppose it ruined it slightly. Bear in mind , I’m usually crap at guessing stuff. Hey ho, maybe it was that type of film where it was easy to guess I suppose. ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qlqlst/social_media_has_ruined_this_genre/"
    },
    {
        "id": "1ql9nus",
        "author": "Top-Three-USA",
        "title": "Netflix Hits Pause on Alex Honnold’s Daring Taipei 101 Climb as Rain Forces Live Event Delay",
        "content": "",
        "upvotes": 48,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ql9nus/netflix_hits_pause_on_alex_honnolds_daring_taipei/"
    },
    {
        "id": "1qlmp7e",
        "author": "interseba5",
        "title": "Just finished Run Away, one question about a big plot hole",
        "content": "Just finished Run Away, a terrible series in every aspect. \n\nBut the single big thing that I cannot understand is how and why Cornelius finds the knife used by Ingrid to kill Aaron. Ingrid has planned the whole thing and cleaned up the crime scene. Why did she leave the damn murder weapon here?!?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qlmp7e/just_finished_run_away_one_question_about_a_big/"
    },
    {
        "id": "1qlvfdd",
        "author": "rjmclkne",
        "title": "\"The Society\" my opinion",
        "content": "Just watched this show, because people said it's insanely good.\n\nHonestly? It's not all that\n\nThe idea of teens being stuck in a parallel universe with no one else is cool and I love how the show demonstrates political conflicts between characters.\n\nIt's just that it's insanely boring to watch. The poster for the show with the flames in the back and the red coloring looks epic, but none of the scenes in the show actually look like that. It's just realistic scenery and outfits/hairstyles don't represent anything about the characters.\n\nThe show obviously is about the character and their relationships with each other and not about what is the parallel universe and it's mythology, but it's too much to the point where after months of being in New Ham, Kelly mentions the bus driver in the final episode and doesn't even address the fact that there are more of them and they're the ones who dropped them off in New Ham.\n\nIt just makes the characters really stupid. Also I hated all of the sex scenes, none of the ships/couples actually mattered to me.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qlvfdd/the_society_my_opinion/"
    },
    {
        "id": "1qmfp9g",
        "author": "BioGuyverBlack",
        "title": "Netflix removed cast, no more money from me.",
        "content": "What an absolute backward step. It's got to be some sort of money grab but it's made me decide to quit Netflix altogether.\n\nI am visiting family abroad and don't want to sign their tv etc into my account so I can watch my own stuff. I can cast all my other apps so Netflix has now gone from my setup. Plenty of other ways to watch their content that don't cause this much drama so I will just do that in the future. Sad Times.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qmfp9g/netflix_removed_cast_no_more_money_from_me/"
    },
    {
        "id": "1ql7ttn",
        "author": "yuzusorbet",
        "title": "Is \"Skyscraper Live\" today (Friday) or tomorrow (Saturday)?",
        "content": "UPDATE: Netflix confirmed that it'll be postponed by a day due to the weather.  \n\"*Skyscraper Live was originally scheduled to air on January 23. Due to weather conditions, the live event is postponed, and will now stream on Saturday, January 24 at 8 PM ET / 5 PM PT.\"*\n\n\\--\n\nEDIT to add:\n\nThe weather forecast in Taipei for today is 15 - 20c, 80% chance of rain. Maybe this is why the date is shown as one day later. But I haven't seen any official announcements that they're postponing it.  \n\\---\n\nOriginal post:\n\nI'm in the West coast and it's 4:19pm PT, Jan 23 Friday.\n\nI thought it starts Friday 5pm PT, but why does my Netflix says Skyscraper Live is t**omorrow 5pm PT**?\n\nI can't paste a screenshot but wonder if others see the same?",
        "upvotes": 59,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1ql7ttn/is_skyscraper_live_today_friday_or_tomorrow/"
    }
]