[
    {
        "id": "1rcehkp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 783,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rcehkp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1refn1v",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A’ - Chelsea FC U19 | UEFA Youth League, Round of 16",
        "content": "#FT: JUVENIL A 1:0 CHELSEA\n\n&amp;#x200B;\n\n#UEFA YOUTH LEAGUE \n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n1:0 Dani Yáñez 9'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n4' - Alexis Ciria taps the ball in after a series of deflections in the box after a corner, but he was offside\n\n⚽ 9' - GOLLLLL DEL JUVENIL A - corner taken short on the left side, the ball reaches Dani Yáñez who shoots with his weak foot powerfully, it deflects off one of the various Chelsea players in the box, sending the keeper the wrong way! \n\n26' - spectacular miss by Alexis Ciria, Roberto Martín plays him completely open with a great backheel, and he misses the goal entirely from around 5 metres. Juvenil A are dominating hard and creating lots of chances in this first half an hour of the game \n\n39' - great move by Yáñez who turns well off the ball and receives a pass inside the box, but his volley is saved well by the keeper \n\nHT - very good first half by Juvenil A who were very close to scoring again after their early lead. The pace at which they circulate the ball is too fast to follow for Chelsea\n\n46' - 2nd half underway \n\n🔄 62' - first sub, Beto comes off for Gascón \n\n🔄 72' - more subs: Viega and Jacobo Ortega on for Roberto Martín and Arnu\n\n90' - Carlos Díez plays in Jacobo on the counter, and his shot hits the post! 5 minutes of added time, the match should not be this close \n\nFT - \n\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee:** Igor Stojchevski (MKD) \n\n**Competition:** UEFA Youth League, Round of 16\n\n**Viewing options:** [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-3-3):** Illia Voloshyn - Álvaro Lezcano, Diego Aguado, Mario Rivas, Jesús Fortea - Diego Martínez ‘Beto’ (62' Ignacio Gascón), Roberto Martín (72' Marcos Viega), Carlos Díez - Alexis Ciria, Adrián Arnuncio ‘Arnu’ (72' Jacobo Ortega), Dani Yáñez\n\nBench: Álvaro González (GK), Melvin Ukpeigbe, Liberto Navascués, Ariel Nkoghe, Gabri Valero, Adrián Pérez. \n\nCoach: Álvaro López\n",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wUOMl6hwPl_tsdwHAtAtno0xMvZE8h1UdSt0wFAsSbg.jpeg?auto=webp&amp;s=da678670992586a213164525827e56adb279d53a"
        },
        "permalink": "/r/realmadrid/comments/1refn1v/match_thread_real_madrid_juvenil_a_chelsea_fc_u19/"
    },
    {
        "id": "1reeio3",
        "author": "TheFeatherDiaries",
        "title": "Happy Birthday, Arda Güler !",
        "content": "",
        "upvotes": 346,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/34ypn9xngnlg1.jpeg?auto=webp&amp;s=c524ef13f604a46728b7d8c8ae7878da94f3d50a"
        },
        "permalink": "/r/realmadrid/comments/1reeio3/happy_birthday_arda_güler/"
    },
    {
        "id": "1regkyn",
        "author": "Specialist_Doctor_34",
        "title": "Jude Bellingham was present watching UEFA Youth League Round of 16 Juvenil A (U19) vs Chelsea. Source - RMPlay",
        "content": "",
        "upvotes": 89,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/77mso1vkunlg1.jpeg?auto=webp&amp;s=427bb1eafd03a57c9c8a650140c3d316f2919658"
        },
        "permalink": "/r/realmadrid/comments/1regkyn/jude_bellingham_was_present_watching_uefa_youth/"
    },
    {
        "id": "1reao2r",
        "author": "cyrusmancub",
        "title": "Squad list v. Benfica. Kylian Mbappé is out",
        "content": "",
        "upvotes": 141,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1reao2r/squad_list_v_benfica_kylian_mbappé_is_out/"
    },
    {
        "id": "1reievr",
        "author": "o6ohunter",
        "title": "Has he been forcing himself or has he been being forced to play?",
        "content": "",
        "upvotes": 27,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lfiezvmd6olg1.jpeg?auto=webp&amp;s=2a9c17e1f617ad2c7fb83d3259f9e2f2fd06ba20"
        },
        "permalink": "/r/realmadrid/comments/1reievr/has_he_been_forcing_himself_or_has_he_been_being/"
    },
    {
        "id": "1refyc4",
        "author": "IcefoxX5",
        "title": "Real Madrid Juvenil A [1]-0 Chelsea FC U19 - Dani Yáñez 9' | UEFA Youth League Round of 16",
        "content": "",
        "upvotes": 31,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ofh7ejreqnlg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1refyc4/real_madrid_juvenil_a_10_chelsea_fc_u19_dani/"
    },
    {
        "id": "1reh1np",
        "author": "ReplacementUnited740",
        "title": "All the criticism of Mbappe stems from frustration",
        "content": "Mbappe on the field is loved solely for his goals, nothing else ,and that's normal, he's a striker, a number 9.\nFrom an objective point of view, if you don't specifically watch Real Madrid matches, it's impossible to say that Real Madrid is not\n lucky to have someone who scores so many goals.And many Real Madrid fans are just happy to have him because he scores a lot of goals.\n\nBut for some people who watch the matches, it just creates a lot of frustration. \nThese people also like him for his goals and nothing else, but every time he's not in the area where he could have scored, he creates this frustration. \nThis situation happens very often; these people don't hate Mbappe, they're just extremely frustrated by what he doesn't do and what they think he could easily do. \nWhen they see Mbappe dribbling in midfield like Anelka, even though they only admire him for his goals,  or, seeing him far from a position where he could score, when they only like him for his goals, creates a lot of frustration. \n\nThose people don't really hate Mbappe, they're just very frustrated, and frustration can breed hatred. \n\nBeing number 9 is surely the position where it's hardest to be liked when you want to do something different \nFor other positions, it's easier to be liked; for example, if a winger makes a difference and makes good passes, he'll be liked, if a defender recovers a lot of balls, he'll be liked,And it's much harder to score than to make good passes, dribble, or make defensive plays.Because goals are much rarer than dribbles, good passes, or other things, but also because in modern football, it's a defensive advantage; It's easier to defend than to score.\n\nIn my opinion, I think Mbappe is the kind of person who was born with an aptitude for difficult things but struggles with simple things.\nOr maybe he really doesn't know how to play as a number 9, because basically 90% of the goals he's scored this season he could have scored if he played as a winger. (Don't imagine he'll play winger; if he wanted to play winger, he'd play winger for the national team) \nI'm frustrated too because he has everything but is stuck at 50% of what he could do. \nHe has a much better ball-handling technique than most number 9s, but when he plays as a number 10 or a false 9, his technique is very average compared to the false 9 and the number 10.\nHe easily scores 50 goals in a season with few tap in, whereas for most number 9s, tap in account for almost 50% of their goals. \nHe's not good with his head, even though he's not short. \nHe's not good with his back to goal, he's not a good target man, he doesn't have good positioning as a number 9... This player is too frustrating. \nIn my opinion, if he had good positioning as a number 9 and put in a lot of tap in, he could potentially surpass Messi's goalscoring record. There are like 20 more matches than before, and in a World Cup or European Cup year, it's not impossible \n\n\nI forgot to mention the year he made the world believe he was going to come on a free transfer and then extended his contract with PSG, but I think for most people, that's forgotten/forgiven. \nOtherwise, for those who are obsessed with Mbappe, I'm only talking about football.Mbappe seems like a nice guy off the pitch, and having a charity that helps sick children is a great thing. \n\nWe just have to hope for more tap in for Mbappe.",
        "upvotes": 14,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1reh1np/all_the_criticism_of_mbappe_stems_from_frustration/"
    },
    {
        "id": "1rdfitm",
        "author": "Bijay12356",
        "title": "OTD 8 years ago, Cristiano captained Real Madrid for the last time.He wore the armband 101 times for us.We never lost a single game in those matches.",
        "content": "",
        "upvotes": 1386,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/flox1tuuwflg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rdfitm/otd_8_years_ago_cristiano_captained_real_madrid/"
    },
    {
        "id": "1reiry8",
        "author": "IcefoxX5",
        "title": "[@lafabricacrm] Real Madrid Juvenil A have reached the quarter-finals of UEFA Youth League where they will face Sporting CP, after defeating Chelsea's U19s 1-0",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1reiry8/lafabricacrm_real_madrid_juvenil_a_have_reached/"
    },
    {
        "id": "1rdhnmk",
        "author": "No-Independent2522",
        "title": "Kroos responding to the interview of Ancelotti recalling Kroos being mad when he subbed him.",
        "content": "Valdano: \"Has anything like what happened with Xabi and Vinícius ever happened to you?\"\n\nCarlo Ancelotti: \"Once I took Kroos out and he got mad. The next day I didn't talk to him. We ran into each other before going out onto the field. I asked him if we needed to talk and he told me it was over.\"…….",
        "upvotes": 766,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/018ms1cxcglg1.jpeg?auto=webp&amp;s=45db41d7a6259cf82dab3a43d36421f2fb53c196"
        },
        "permalink": "/r/realmadrid/comments/1rdhnmk/kroos_responding_to_the_interview_of_ancelotti/"
    },
    {
        "id": "1rdp064",
        "author": "cyrusmancub",
        "title": "Mbappé is a serious doubt for tomorrow’s match against Benfica. He has significant pain in his knee and ended today’s training early.",
        "content": "",
        "upvotes": 260,
        "comments": 104,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdp064/mbappé_is_a_serious_doubt_for_tomorrows_match/"
    },
    {
        "id": "1rdd6q8",
        "author": "twogk",
        "title": "What do you mean make a run? Attack the box? What is that?",
        "content": "I guess we'll find him dragging the defenders to his nearest ball holding teammate instead of making runs and creating chances, effectively limiting his options to do anything.\n\nOr worse, like this case, complain about a perfect chance not being turned into a back pass for him to dribble into a defender and lose the ball \n\nI repeat he may be a great goal scorer but thats all he has to offer and it's simply not enough, he isn't fit for this team Ancelotti knew it and that's why he asked for a true 9 in Kane. \n\nI mean, why does he offer that we didn't have before? Goals? We had Joselu ona fraction of everything Mbappe has and still delivered those regularly. \n\nCreating chances? Lol, lmfao even. \nBut anyway, we had Vini and Rodrygo handing those out like hot cakes. \n\nHis first touch is mediocre, his deibbling atrocious, his passing mediocre, his off the ball movement? Non-existent.\n\nMaybe Benzema raised the bar too high, but I expect the 9 that palys for Real Madrid to be perfect in all the above mentioned aspects. \n\nTwerked for 5 years  befor joining just to drag down the entire team's chemistry  and to do what? Bring 40 goals a season? I'd rather have Joselu and his 20+ goals (mind you, as a sub) and team's perfectly balanced than whatever this is.  Either he improves or hopefully gets sold. \n\nMind you I'm not saying he's the only culprit, but the other get plenty of criticism already, this dude got away for so long with his bs. First season was \"not judge to hastily\"  now for the most part, up until like 3 games ago  the scapegoat was Vinicius.  When will it be enough? \n\nDude ghost the entire game, we play in 10 v 11 for 80 min, the he scores a random goal (possibly a pen earned by someone else hard work, probably the aforementioned Vinicius) and almost everyone forgets he made Casper look like and amateur for the entirety of the match. ",
        "upvotes": 604,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eti22j3zbflg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rdd6q8/what_do_you_mean_make_a_run_attack_the_box_what/"
    },
    {
        "id": "1reiwar",
        "author": "Specialist_Doctor_34",
        "title": "Real Madrid’s Juvenil A (U19) defeated Chelsea 1-0 at the Alfredo Di Stéfano Stadium and will face Sporting CP in the quarterfinals of the UEFA Youth Leaegue",
        "content": "https://preview.redd.it/9tssmrnc9olg1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=c58c56b2311fd932a96404174814d74d45634044\n\n  \n  \nReal Madrid were on top in the first half, although their level dropped as the game went on. Álvaro López’s side created plenty of chances and could easily have gone into the break with more than a 1–0 lead.  \n  \nThe second half was more balanced and competitive. Chelsea looked slightly more dangerous, especially in the opening fifteen minutes after the break, but Juvenil A defended well, managed the game properly and held on to their lead to secure the win.  \n  \n𝐕𝐀𝐌𝐎𝐎𝐎𝐎𝐎𝐒!! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1reiwar/real_madrids_juvenil_a_u19_defeated_chelsea_10_at/"
    },
    {
        "id": "1rdpjnv",
        "author": "ic_giovani",
        "title": "Some interesting quotes from Ancelotti’s book “The Dream: Breaking Champions League Records”",
        "content": "Let me begin by saying I don’t necessarily agree or disagree with the quotes; I just found them interesting to highlight given the current state of the team.\n\nAbout Joselu and strikers:\n\n&gt;What happened next was something that can happen to even the best goalkeepers in such high-pressure games. Vinícius had been giving Kimmich a hard time all game but had nothing to show for it. Now he tried a hopeful shot from just outside the area, which pitched just in front of Manuel Neuer. Unbelievably, one of the best goalkeepers in the world, who had already made several saves, allowed the ball to bounce off his chest straight into the path of Joselu, who was following up as all strikers are meant to.\n\nAbout the 2023/24 squad (I found this very interesting because of all the problems we are currently having, and because Don Carlo talks about all his Champions Leagues in the book, so he could’ve said this about any of the teams he was a part of; yet he chose define this specific squad as it follows):\n\n&gt;What I loved about this squad was the lack of big egos. They were a humble group who were easy to manage, no matter how much money they were paid or how many trophies they’d won. Or how old or young they were. And they worked hard. Both of these qualities are, for me, non-negotiable.\n\nDavide explaining his father’s way of coaching (from the final against Dortmund):\n\n&gt;On the touchline we had decided that there had to be change because Dortmund had been the better team. The manager doesn’t necessarily impose a solution. I think it was more like a sort of a question that he posed to the group, like, ‘What if we switch a little bit, like it's because I think we have this problem, but do you agree — do you agree with this idea?’ He thought the problem was that we were overloaded in midfield, so we needed to change the system and go with three midfielders, to switch to a 4-3-3, Bellingham, Kroos, Camavinga. So, he \\[Bellingham\\] would hold on to that left side of the midfield and Vinicius to hold wide on the left with Valverde on the right and Rodrygo as a nine. This would give us stability.  \nThat was the conversation at half-time. It was from a discussion around the manager’s thoughts and with the input of the key players, the captain \\[Nacho\\], also the senior players, like Carvajal and Kroos. Their view was that we needed one more player in midfield. Kroos said that we couldn’t press them, which meant that we had to wait a little bit back. This feedback made the manager adjust his idea a little bit. As a result of the initial discussion, he built on the idea and made slight adjustments and then represented the idea so that it came from the group, and he asked the group if they agreed, and they agreed.\n\nBellingham about Carlo (and maybe Xabi?):\n\n&gt;He will never waste time on the basic things you should already know. He doesn’t waste any time with that. It’s really concise. It’s like exactly what you need, and that for me, is key. Keep it simple. For example, tactically, it ultimately comes down to simplicity for Carlo — get the defensive structure right, I have a team where we’ll score goals. If you keep a zero, we’ll win the game — simple as that.  \nI feel like some modern coaches come with so many instructions because they feel like they’ve got to do more than other coaches. They almost want to be puppet masters.\n\nSome bits and pieces about 2024/25 (Kroos, Modric, Mbappé, Asencio and injuries):\n\n&gt;There was excitement at the arrival of one of the world’s best players, Kylian Mbappé, but there was also the disappointment of losing the quality, experience and leadership provided by Toni Kroos and Nacho. We would also have to closely monitor the playing time of Luka Modric, although at times he did not seem to need a rest. It was particularly difficult to lose Kroos. At 34 he was still in his prime and was the controller of the team’s rhythm.\n\n&gt;But as the reigning champions and with the high expectations of the fans, the media and pretty much everybody else, it was thought that by adding Mbappé to an already Champion team, things could only get better. I still thought that with a little luck we had the quality to carry on where we had left off and fulfil the expectations being heaped upon us. But it turned out that we weren’t that lucky. Very quickly, Dani Carvajal and Éder Militão joined Alaba as long-term absentees, although on the plus side, it did enable us to call up Raúl Asencio, a 21-year-old academy graduate, proved himself as a genuine first-choice option alongside Rüdiger.\n\n&gt;We worked hard to rebalance the team that had become unbalanced by the injury absences of Carvajal, Alaba and Militão in particular. Players such as Lucas Vázquez, Tchoua-méni, Bellingham and the ever-dependable Valverde all had to play in unfamiliar roles to help the team. To their credit they all knuckled down without complaint.\n\nWhat do those say about the current team? I don’t know. Maybe everything, maybe nothing. Agree or disagree, it’s at least interesting to see an inside (albeit biased, for sure) perspective of things.\n\nEdit: formatting",
        "upvotes": 83,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdpjnv/some_interesting_quotes_from_ancelottis_book_the/"
    },
    {
        "id": "1re78h8",
        "author": "keyurckp",
        "title": "How can we improve our midfield next season?",
        "content": "What do you guys think about adding one or two players from the likes of Elliott Anderson, Wharton or Stiller for camavinga and ceballos? How do you guys think we can improve our midfield? Let's discuss all the practical solutions because solution like Vitinha is not going to happen atleast not next season.",
        "upvotes": 5,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1re78h8/how_can_we_improve_our_midfield_next_season/"
    },
    {
        "id": "1rdkhdj",
        "author": "Outrageous-Brain-395",
        "title": "Thinking about all the bench players during the Galácticos 2.0 era, which ones would be starters today?",
        "content": "I feel like Isco, James, Kovacic and Asensio would all be starters. Potentially even Morata. It’s kinda crazy how when you look back at it, so many good players were on the bench at the time simply because KCM and BBC were too good, and it seemed impossible to dislodge them. Bale was only dislodged by Isco because he couldn’t stay healthy but when all conditions were equalized, Bale was always usually starting.",
        "upvotes": 54,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdkhdj/thinking_about_all_the_bench_players_during_the/"
    },
    {
        "id": "1rdj2su",
        "author": "Willing-Neck-7417",
        "title": "La Undécima! 2016 - Real Madrid vs Atletico Madrid 1-1 (pen 5-3)",
        "content": "",
        "upvotes": 23,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uLxGXA3ffnNUgZp1LQH_Byw-fDqfWxsb5Ylv-wwOPh0.jpeg?auto=webp&amp;s=351700cd21fc1dce15e3ed74b938f57e1766c9e6"
        },
        "permalink": "/r/realmadrid/comments/1rdj2su/la_undécima_2016_real_madrid_vs_atletico_madrid/"
    },
    {
        "id": "1rdaxpv",
        "author": "cyrusmancub",
        "title": "Huijsen underwent new tests yesterday. The centre-back is showing positive signs but it's difficult he will be ready for the Benfica game.",
        "content": "",
        "upvotes": 47,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rdaxpv/huijsen_underwent_new_tests_yesterday_the/"
    },
    {
        "id": "1rco75j",
        "author": "Aggressive_Gate_1046",
        "title": "GOAT IS BACK ! ....🚨 BREAKING: Jude Bellingham is back training on the ball.",
        "content": "",
        "upvotes": 713,
        "comments": 141,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hqus36nu6alg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rco75j/goat_is_back_breaking_jude_bellingham_is_back/"
    },
    {
        "id": "1rd0xh1",
        "author": "FergieBall_FC",
        "title": "Martin Samuel – The Times: It's not just Jose Mourinho — abuse of Vinicius Jr has been enabled at every level | Real Madrid star has been subjected to racism on several occasions in Spain — Mourinho's reaction to his allegations against Gianluca Prestianni is not the first of its kind",
        "content": "Full Writeup: **Martin Samuel – The Times: It's not just Jose Mourinho — abuse of Vinicius Jr has been enabled at every level | Real Madrid star has been subjected to racism on several occasions in Spain — Mourinho's reaction to his allegations against Gianluca Prestianni is not the first of its kind** \n\nWhy did José Mourinho feel entitled to speak that way about Vinícius Jr? He was enabled, as others have been before him. Enabled by Uefa, by the Spanish league, by tame local media, by all the figures in authority who, across many years, could have ended this, but did not. It’s not just about Mourinho, it’s about Javier Tebas; it’s not just about Benfica, it’s about Porto, too. What Vinícius claimed occurred last week at the Estádio da Luz has been going on for years; because those with power have allowed it to happen. \n\nIt would be easier to list the grounds in Spain where Vinícius hasn’t been racially abused, but here are a few where he has: Barcelona, Atletico Madrid, Valencia, Albacete, Real Mallorca, Real Valladolid, Real Sociedad, Getafe, Osasuna, Real Betis and Sevilla. Since 2021, La Liga has logged 26 different racist incidents involving Vinícius at 11 distinct stadiums. Sometimes the trouble is brought to his home. In January 2023, a dummy dressed as the player was found hanging from a bridge near Real Madrid’s training ground. Four Atletico fans received suspended prison sentences for this affront, more than two years later. \n\nYet the year Vinícius was hung in effigy was also the year Tebas, the La Liga president, was forced to apologise for his reaction to the player’s threat to leave the field at the Mestalla, after being subjected to monkey chants by Valencia fans. When Vinícius said it was a problem he was encountering across Spain, Tebas went on the defensive. “Before you criticise and insult La Liga, you need to inform yourself well, Vini Jr. Don’t let yourself be manipulated,” he posted on social media, his instinct being to protect the brand. “I think that the message, and the intention I had, was not understood by a significant number,” he later clarified. “If I hurt someone, if they thought I was racist, it’s far from reality.” \n\nWhat is reality, however, is that Mourinho’s reaction, in which he sought to blame Vinícius’s goal celebration for what may have been a ­racist tirade from one of his Benfica players — Kylian Mbappé alleges that he heard Gianluca Prestianni use the word “monkey” towards Vinícius five times — is not the first of its kind. In 2022, Pedro Bravo, the president of Spain’s association of football agents, went even further. “You have to respect your rivals,” he told the television show *El Chiringuito*. “If you want to dance samba, go to a sambodromo in Brazil. Here you have to respect your colleagues, and stop acting like a monkey.” Not a fool, not a clown; a monkey. You know what Freud would say about that dismal serving of word association? Naturally, a clarification followed. “It always ends with an apology and ‘I was misinterpreted,’ ” Vinícius commented, ruefully. \n\nYet this isn’t his problem alone. While Vinícius attracts a disproportionate number of racist incidents compared to other black players, he is not the first to struggle to get his case heard. In March 2024, the Spanish third-tier team Rayo Majadahonda walked off during a game with Sestao River, in protest that their goalkeeper was being racially abused. The Spanish federation punished the accusers, not the abusers, with a 3-0 defeat, a three-point deduction and a €3,000 fine. Later that year, Christantus Uche, a Nigerian playing for Getafe at the time, gave an interview complaining about racism. “He doesn’t understand, he can’t say that,” the Getafe president, Ángel Torres, said. “When he has been here for one or two years and understands Spanish, he can say whatever he wants.” Uche decided not to test this and signed for Crystal Palace. \n\nWind back to 2011-12, the season Manchester City made their first appearance in the modern Champions League. Knocked out at the group stage and dropped to the Europa League, they drew Porto. City were new to this. During the match, their executives thought they heard an ugly sound. It seemed to erupt every time Mario Balotelli or Yaya Touré were on the ball. Fearing inexperience in the European game, and not wishing to offend their hosts, they first checked with the travelling press pack that the noise was what they thought it was. The press, then Balotelli, confirmed it. City complained to Uefa, whose match representatives were uninterested, and their hosts were indeed offended. Porto’s executives behaved as if City were just troublemaking newcomers unused to the big stage. Ultimately, Porto were fined a paltry £16,000 by Uefa. In the next round, City were a minute late back onto the pitch against Sporting Lisbon and fined £24,000. \n\nEuropean football is littered with instances like that. Messengers shot, complainants ridiculed. It was always the English press who were accused of stirring controversy by asking awkward questions after matches. It happened in Bulgaria in 2019. A local cameraman told the England manager Gareth Southgate to f\\*\\*\\* off as he left the room, having fielded questions about racist chanting during a European Championship qualifier. Bulgarian journalists laughed when the subject was raised. Thankfully, there is now a Uefa protocol around racist incidents and at least it was applied last week in Lisbon. But Vinícius may have to line up against Prestianni again on Wednesday because Uefa investigations move about as fast as law enforcement officers investigating brutalised protesters on the streets of Minneapolis. \n\nAnd media are culpable, too. It was May 2023 when Vinícius confronted fans at Valencia, accusing them of calling him a monkey. A case went to court in October that year and Vinícius gave evidence. After misreporting of his words, Valencia insisted he apologised. The local newspaper, Superdeporte, produced a front page with his picture and a long, superimposed, nose. “PINOCHIUS”, read the headline. Soon after the trial, Vinícius again excelled in a Champions League match against Sporting Braga, all sparkle and step-overs. “It’s not racism, he deserves a slap for being a clown,” Miquel Camps, a Barcelona board member, posted on social media. \n\nNobody should think tackling racism is easy. Liam Rosenior, Chelsea’s head coach, was asked about the Vinícius incident and its fallout, and said that any coach or player found guilty of racism “shouldn’t be in the game”. This was interpreted as a call for a life ban on Prestianni if the accusations were proven. Yet proven to what level? In football, a balance of probabilities is often enough to get a guilty verdict. But can, or should, a career be ended on that? John Terry was found guilty of racially abusing Anton Ferdinand this way, but the same case in Westminster magistrates’ court ended in acquittal. Might that happen to Prestianni with need for a greater burden of proof? He covered his mouth with his shirt so couldn’t be lip-read, and Benfica claim Mbappé was too far away to have heard what was said. Uefa may be able to rule given the balance of probability but, if the penalty was a life ban, would surely need to meet more exacting standards. Any hearing could then just deteriorate into he said, she said, with no verdict at the end. The higher the penalty, the more concrete the proof required. \n\nWhat is undeniable, however, is that Vinícius and others like him have been poorly served. Mourinho spoke as he did because he knew he could; because others had done so before him and got away with it. We may never know what Prestianni uttered beneath the protection of his collar. We can presume, however, that it may hardly be worse than what is often permitted to occur around Vinícius, very much in plain sight. ",
        "upvotes": 118,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rd0xh1/martin_samuel_the_times_its_not_just_jose/"
    },
    {
        "id": "1rct356",
        "author": "7dek",
        "title": "OFFICIAL:UEFA inform Benfica that their complaint about Fede Valverde and Samuel Dahl situation has been dismissed. Valverde will be available for Real Madrid vs benfica on Wednesday",
        "content": "",
        "upvotes": 292,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rct356/officialuefa_inform_benfica_that_their_complaint/"
    },
    {
        "id": "1rcg9ub",
        "author": "Messmers",
        "title": "Mbappe mad at Guler taking corner instead of passing to him",
        "content": "",
        "upvotes": 712,
        "comments": 158,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f5anbbj6o8lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rcg9ub/mbappe_mad_at_guler_taking_corner_instead_of/"
    },
    {
        "id": "1rciiia",
        "author": "o6ohunter",
        "title": "This video critiquing Mbappè’s positioning vs Osasuna",
        "content": "",
        "upvotes": 502,
        "comments": 139,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u6x9029j59lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rciiia/this_video_critiquing_mbappès_positioning_vs/"
    },
    {
        "id": "1rd0mqe",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] Real Madrid vs Benfica, UCL Loser's round up",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1rd0mqe)",
        "upvotes": 52,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rd0mqe/prematch_thread_real_madrid_vs_benfica_ucl_losers/"
    },
    {
        "id": "1rcixlw",
        "author": "IWantAnOreoShake",
        "title": "Prestianni Provisionally Suspended by UEFA",
        "content": "Statement by UEFA:\n\n**Provisional suspension of SL Benfica player Gianluca Prestianni**\n\nFollowing the appointment of a UEFA Ethics and Disciplinary Inspector (EDI) to investigate allegations of discriminatory behaviour during the UEFA Champions League 2025/2026 Knock-out Play-off match between SL Benfica and Real Madrid CF on 17 February 2026, and upon request of the EDI with an interim report, the UEFA Control, Ethics and Disciplinary Body (CEDB) today decided to provisionally suspend Mr. Gianluca Prestianni for the next (1) UEFA club competition match for which he would otherwise be eligible for the prima facie violation of Article 14 of the UEFA Disciplinary Regulations (DR) related to a discriminatory behaviour.\n\nThis is without prejudice to any ruling that the UEFA disciplinary bodies may subsequently make following the conclusion of the ongoing investigation and its respective submission to the UEFA disciplinary bodies.\n\nFurther information about this matter will be made available in due course.\n\nLink - [https://disciplinary.uefa.com/02a2-1ffea06e0006-61224c1efc56-1000/](https://disciplinary.uefa.com/02a2-1ffea06e0006-61224c1efc56-1000/)",
        "upvotes": 326,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/isO-Ibr-yBworPuviSUpNqpV0r7b4qz3iN_RWY0P5W8.jpeg?auto=webp&amp;s=eb358dee38ac8ed1327c1d3c7cb782be9c0ce23d"
        },
        "permalink": "/r/realmadrid/comments/1rcixlw/prestianni_provisionally_suspended_by_uefa/"
    },
    {
        "id": "1rcybz6",
        "author": "Small_Citron_6506",
        "title": "Folks - Score Prediction for Tomorrow?",
        "content": "Honeslty - I am a bit nervous. I have this feeling that we might face an upset of sorts and can be dumped out of the Champions league. Highly unlikely but I don't why, I have this dreadful feeling.\n\nI hope we give Benfica a thrashing and make them pay for all that abusive racism that Vini faced in the last leg.",
        "upvotes": 26,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rcybz6/folks_score_prediction_for_tomorrow/"
    },
    {
        "id": "1rcfwv5",
        "author": "7dek",
        "title": "Define obsession: Here you go 🤮",
        "content": "",
        "upvotes": 193,
        "comments": 45,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/717src1xk8lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rcfwv5/define_obsession_here_you_go/"
    },
    {
        "id": "1re6ez7",
        "author": "Background_Speed4736",
        "title": "Am I the only one who hates the beef between us and Barca fans?",
        "content": "Barca and Real are rivals. But I have problems with both fanbases because in almost every social media that ever existed, both fanbases start beefing to defend their team by posting about the past when a random post related to either of them is uploaded. And tbh, I find this disrespectful cuz it is making others feel uncomfortable which should never happen to people like Vini with Prestianni and Benfica fans.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1re6ez7/am_i_the_only_one_who_hates_the_beef_between_us/"
    },
    {
        "id": "1re2oq2",
        "author": "Upper_Coyote312",
        "title": "Klopp will be perfect for us",
        "content": "When I look at Klopp’s Liverpool I think he will be perfect for us only problem is mbappe and vini . With klopp we don’t need a controller . Klopp does not need those type of midfielders because his rock and roll football is just back and forth no need for trying to be patient and hold on to possession for long . Reason why Henderson,Fabinho ,Milner and wijnaldum all worked for him. Most of his creativity at Liverpool came from his fullbacks and guess what we have Trent already and Carreras has the ability to also create . Bellingham and valverde will enjoy klopp more than any manager . He loves his midfielders being all action back and forth in games . As I said the only problem is vini and mbappe pressing . Klopp will look at them and immediately reject us because these guys will not be willing to press . Just look at how Salah,Mane and firmino thrived while being pressing machines . Klopp is both a manager and coach together . He is friends to the players he coached and also tactically good. Yes our players will be tired by the 80th minute but if we play like that we will be mostly leading 3-0 before then.",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1re2oq2/klopp_will_be_perfect_for_us/"
    }
]