[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ri9u0n",
        "author": "Inside-Discipline359",
        "title": "Piazza Bengasi",
        "content": "Come mai ci sono tante case in vendita vicino piazza Bengasi? Costano anche di meno rispetto ad altre zone.",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ri9u0n/piazza_bengasi/"
    },
    {
        "id": "1rhyoja",
        "author": "giggi1276",
        "title": "Auto in sosta su strisce pedonali: è normale a Torino?",
        "content": "Ciao, sono arrivato da qualche giorno a Torino dove mi sono trasferito per lavoro. Non ho potuto non notare la quantità mostruosa di auto in sosta sulle strisce pedonali: come mai è percepito come normale in questa città? ",
        "upvotes": 17,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1rhyoja/auto_in_sosta_su_strisce_pedonali_è_normale_a/"
    },
    {
        "id": "1ri6bl0",
        "author": "Hot-Community-8827",
        "title": "Torino Sticker",
        "content": "I visited Torino a few weeks back, beautiful place, then walking around my hometown in Cardiff saw this sticker, does anyone hear know the sticker?",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7o3n07l2ihmg1.jpeg?auto=webp&amp;s=6b3ee07094e301c0788aa30a4be7d0e86add10e5"
        },
        "permalink": "/r/torino/comments/1ri6bl0/torino_sticker/"
    },
    {
        "id": "1ri2ncn",
        "author": "Pollofifo03",
        "title": "Consigli palestre torino sud",
        "content": "Ciao, sapete consigliarmi palestre a prezzi umani in zona bengasi/corso traiano/via onorato vigliani? Ho un lavoro e ne sto cercando un secondo quindi i miei orari sarebbero la mattina prestissimo o al contrario verso le 9/10 (altra domanda da neofita, quali sono in genere le ore di punta delle palestre?)",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ri2ncn/consigli_palestre_torino_sud/"
    },
    {
        "id": "1rherjz",
        "author": "Physical-Box-7215",
        "title": "Caso Comala: non è un episodio isolato. Vi racconto cosa è successo alla mia associazione",
        "content": "Come molti di voi sapranno, il Comala ha perso il rinnovo per i locali dopo 15 anni di attività fondamentale per gli studenti del Poli e per il quartiere. Ma c'è un \"dietro le quinte\" che va oltre la semplice burocrazia.\n\nVolevo condividere un'analogia basata su un'esperienza vissuta nel 2025 con un'altra associazione (che resterà anonima). Gestivamo circa 500mq di spazi della Circoscrizione da 6 anni, ospitando oltre 30 realtà diverse.\n\nEcco come sono andate le cose:\n\n* A fine mandato, l'ufficio patrimonio della Circoscrizione  ci convoca.\n* Per oltre 5 anni prima della \"nuova direzione patrimonio del \\[inserire partito\\]\" il bando è sempre stato riproposto regolarmente come annuale, eravamo l'unica cordata che si presentava al bando visto che le altre associazioni semplicemente si aggregavano (mai rigettato un progetto o un'associazione). \n* Ci dicono chiaramente che il bando non verrà rinnovato e che dobbiamo chiudere.\n* Il motivo? La linea politica è cambiata: i locali non vengono più dati a chi non è \"allineato\" o non garantisce un ritorno in termini di voti.\n* **Il ricatto:** per restare, dovevamo sciogliere il direttivo e indire nuove elezioni prima dell'assegnazione, cercando di favorire l'ingresso di una nuova cordata. \n\nDurante questo processo, spuntano fuori nuovi candidati, tutti tesserati \\[inserire partito\\]e pronti a correre per le prossime comunali. I gruppi candidati alla fine sono due; il vecchio direttivo e il nuovo direttivo tesserato \\[inserire partito\\]. \n\nFortunatamente il piano è fallito: i soci hanno rieletto il vecchio direttivo e la responsabile del patrimonio se n'è andata a metà scrutinio, stizzita dall'esito.\n\nHanno cercato di fondare una nuova cordata parallela per \"soffiarci\" il posto e presentarsi come secondi candidati ma non sono riusciti a candidarsi in tempo. \n\nHanno cercato di \"sabotarci\" offrendoci supporto e riferimenti per le procedure burocratiche ma ci stavano solo facendo perdere tempo per non riuscire a presentare tutti i moduli in fretta (registrazione statuti etc). Abbiamo risolto affidandoci ad un consulente che ha fatto tutto in 1 settimana mentre le persone consigliate dal \\[inserire partito\\] dopo 3 settimane non avevano ancora espletato nessun adempimento.\n\nScrivo questo perché quello che accade al Comala ha un fine politico enorme. Se non porti voti, per certi politici non esisti, a prescindere dal valore sociale che crei. È successo a noi con un partito politico che non nomino, ma temo sia una pratica trasversale.\n\nVoi cosa ne pensate? Avete testimonianze simili in altre zone?",
        "upvotes": 98,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1rherjz/caso_comala_non_è_un_episodio_isolato_vi_racconto/"
    },
    {
        "id": "1ri1gi0",
        "author": "asilorepublic95",
        "title": "Carta d identità elettronica",
        "content": "devo fare la carta d identità elettronia entro agosto perché quelle cartacee non saranno più valide.\n\nsolo che santo iddio non c'è posto mai da nessuna parte come cristo si fa? ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ri1gi0/carta_d_identità_elettronica/"
    },
    {
        "id": "1ri47ev",
        "author": "nimon7",
        "title": "Advices for a Torino trip",
        "content": "**Hello!**\n\nIn one month, my girlfriend and I will be visiting your beautiful city for 10 days. I’ve already been there before, so I know some of the main attractions like the Mole, Superga, Museo Egizio, and the Fiat Museum.\n\nBut I truly love the city and would like to discover more, so I’d really appreciate it if you could share your favorite hidden gems!\n\nWe love history, food, wine, cheese, and walking. In particular, I’m looking for:\n\n* A wine and cheese tasting\n* An escape room for two\n* Ideas for a one-day trip to the mountains using buses or trains\n* A fancy restaurant for a date night (it’ll be her birthday!)\n* Any of your favorite places to eat or drink (pizza, pasta, bars)\n\nAnd is Torino+Piemonte Card worth it if we plan at least 1 museum/castle/palace visit per day?\n\nThank you in advance! 😊",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ri47ev/advices_for_a_torino_trip/"
    },
    {
        "id": "1rhucr3",
        "author": "Sekrotus",
        "title": "Mobile data",
        "content": "Ciao, sono uno studente Erasmus che soggiornerà 4 mesi nella splendida città di Torino. Volevo chiederti quale SIM e piano tariffario dovrei scegliere. Sto cercando la soluzione più economica con GB illimitati, chiamate e SMS non sono importanti.\n\nDevo anche dire che ho una carta ISIC.\n\nGrazie per le risposte!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1rhucr3/mobile_data/"
    },
    {
        "id": "1ri215s",
        "author": "ClaudiaKincaid_",
        "title": "Palestre Torino zona Parella/Campidoglio",
        "content": "ciau a tutti, avete raccomandazioni su palestre in questa zona? \n\nvorrei un giusto compromesso tra palestra non troppo grande (vorrei evitare catene tipo macfit ecc), \"\"economica\"\" perché oltre all'iscrizione in palestra vorrei pagare anche un personal trainer perché da sola non sono capace :)))\n\nscatenatevi ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ri215s/palestre_torino_zona_parellacampidoglio/"
    },
    {
        "id": "1rhtvts",
        "author": "Portus-Studios",
        "title": "Portus Studios: Seeking in Torino, a Digital Environment Artist for an upcoming Video Game title",
        "content": "Italiano:\n\nCiao a tutti!\n\nSiamo Portus Studios, una startup indie  impegnata nello sviluppo del nostro titolo di debutto. Al momento siamo un piccolo team dedicato alla ricerca di un talentuoso Environment Artist 2D digitale per completare il nostro core team.\n\nStiamo sviluppando un CRPG narrativo ambientato nell'Italia meridionale contemporanea (2026). Il gioco fonde il genere investigativo con l'horror folk soprannaturale, traendo grande ispirazione da miti, leggende ed eventi storici italiani \"strani ma veri\".\n\n* Stile Artistico: Telecamera isometrica con grafica pre-renderizzata.\n* Ambientazione: Città immaginaria situata in Puglia, nella regione del Salento.\n\nPer massima trasparenza, essendo sviluppatori alle prime armi che lavorano con un budget limitato, si tratta attualmente di un ruolo non retribuito, basato sulla passione. Tuttavia, siamo completamente aperti a discutere la roadmap del progetto, i futuri obiettivi di finanziamento e i piani di evoluzione dello studio.\n\nAl momento ci troviamo a Torino. Se vi capita di essere in zona, ci farebbe piacere incontrarvi per un caffè! In caso contrario, siamo assolutamente disponibili a collaborare da remoto.\n\nSiete interessati? Se avete un portfolio con i vostri lavori sulle ambientazioni o se volete semplicemente fare due chiacchiere, mandateci un messaggio in DM. Mi piacerebbe molto condividere di più sul gioco e sui nostri progressi finora!\n\n\n\nEnglish:\n\nHi everyone!\n\nWe are Portus Studios, an indie startup building our debut title. We are currently a small, dedicated team looking for a talented 2D digital Environment Artist to finalize our core team.\n\nWe are developing a narrative-driven CRPG set in contemporary (2026) Southern Italy. The game blends detective fiction with supernatural folk horror, drawing heavy inspiration from Italian myths, legends, and \"strange but true\" historical events.\n\n* Art Style: Isometric camera with pre-rendered graphics.\n* Setting: Fictional city set in Puglia, region of Salento\n\nFull transparency as we are first-time developers working with a limited budget, this is currently an unpaid, passion-driven role. However, we are completely open to discussing the project's roadmap, future funding goals, and how the studio plans to evolve. \n\nWe’re currently in Turin. If you happen to be in the area, we’d love to meet up for a coffee! If not, we are perfectly happy collaborating remotely.\n\nInterested? If you have a portfolio featuring your environment work or you’d like to simply have a chat, please shoot me a DM. I’d love to share more about the game and our progress so far!\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5b3grj6gtemg1.png?auto=webp&amp;s=ba0c12468d45ad8e4f17bc1432100e9c0930847a"
        },
        "permalink": "/r/torino/comments/1rhtvts/portus_studios_seeking_in_torino_a_digital/"
    },
    {
        "id": "1rhvbv9",
        "author": "asilorepublic95",
        "title": "Curare denti in ospedale.",
        "content": "ma a Torino è possibile curare denti in ospedale o solo quelli che non hanno reddito possono?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1rhvbv9/curare_denti_in_ospedale/"
    },
    {
        "id": "1ri7w1c",
        "author": "peroniperore",
        "title": "Ma si spaccia solo la sera a Torino?",
        "content": "Per capire, se domattina voglio trovare del fumo in zona San Salvario trovo qualcosa o si spaccia solo la sera qua a Torino? Perché finora ho trovato solo la sera al Valentino ma al momento non riesco a raggiungerlo.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1ri7w1c/ma_si_spaccia_solo_la_sera_a_torino/"
    },
    {
        "id": "1rhbyco",
        "author": "logperf",
        "title": "La ferrovia sotto l'attuale corso Venezia è stata interrata quasi 20 anni fa. Ma la cicatrice sulla viabilità di Torino è ancora presente.",
        "content": "Ci sono poche strade che attraversano corso Venezia (via Cervino, via Valprato, via Lauro Rossi... poi non c'è più nulla fino a corso Grosseto). La maggior parte sono sensi unici inconsistenti tra i due lati.\n\nSembra quasi che Borgo Vittoria e Barriera di Milano siano due città diverse.\n\nAnche la vecchia ferrovia dell'aeroporto sotto via Stradella è difficile da attraversare.",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1rhbyco/la_ferrovia_sotto_lattuale_corso_venezia_è_stata/"
    },
    {
        "id": "1rhucn9",
        "author": "ElkBitter8263",
        "title": "Tame Impala Torino Ticket",
        "content": "Hello! I am selling one single ticket for the Tame Impala concert in Torino, 12 april 2026. \n\nSettore 205 , Fila 14, Posto 5\n\nDm me if u are interested!!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rhucn9/tame_impala_torino_ticket/"
    },
    {
        "id": "1rht7ah",
        "author": "minchiatosta",
        "title": "Ma Locali per scambisti e singoli a Torino ce ne sono?",
        "content": "Ciao, sono un ragazzo trasferitosi da poco, e visto che non conosco nessuno e non ho molta voglia di andare ad escort, mi stavo chiedendo se la community potesse consigliarmi qualche posto, ho visto l'hollywood club, e altri che fanno spettacoli, ma onestamente ero interessato a qualche locale tranquillo dove poter fare qualche conoscenza",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1rht7ah/ma_locali_per_scambisti_e_singoli_a_torino_ce_ne/"
    },
    {
        "id": "1rhp24d",
        "author": "Tiny-Cream-6241",
        "title": "Portoghesi a Torino",
        "content": "Sono un ragazzo portoghese a Torino e ho 20'anni. Da quando sono qui non ho conosciuto nessun portoghese che avessi più o meno la mia età. Ci sono effettivamente o mi è solo un miraggio?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rhp24d/portoghesi_a_torino/"
    },
    {
        "id": "1rhb1mm",
        "author": "VecchioDiM3rd1955",
        "title": "Comala, i vincitori del bando tendono la mano ai gestori storici: \"Basta scontri, lavoriamo insieme\"",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/twJkPwrpJicczYBnOKCqi4bLRJGZqgyl6aKlhy--xTY.jpeg?auto=webp&amp;s=5e9c1a8ed869eceb50aad08c4405a38b440bfe05"
        },
        "permalink": "/r/torino/comments/1rhb1mm/comala_i_vincitori_del_bando_tendono_la_mano_ai/"
    },
    {
        "id": "1rgk4hb",
        "author": "XYW98",
        "title": "Com'è questa zona di Torino?",
        "content": "",
        "upvotes": 146,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/96jbf0i7z3mg1.jpeg?auto=webp&amp;s=f88b28b09566c7357a77e5d4d3e2bc94fa4e7d22"
        },
        "permalink": "/r/torino/comments/1rgk4hb/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rge4ye",
        "author": "Miss_Giorgia",
        "title": "Com'è questa zona di Torino ?",
        "content": "Vorrei sapere se dal centro si riesce ad arrivare abbastanza veloce con i mezzi. ",
        "upvotes": 274,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o4cfsbkyu2mg1.jpeg?auto=webp&amp;s=3264ae2d0adf530e5cbd183298c736dcfc3258de"
        },
        "permalink": "/r/torino/comments/1rge4ye/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rh1iz6",
        "author": "enoughtodo67",
        "title": "Abbigliamento di buona qualità",
        "content": "Ciao popolo torinese.\nSpero che sotto questo post ci possano essere scambi costruttivi e non critiche.\nHo bisogno di fare acquisti relativi ad abbigliamento.\nSono sempre stata abituata a girare i negozi che si trovano nei centri commerciali, con un prezzo \"relativamente\" basso, ma sono molto delusa.\nVeramente tessuti orribili.\nVi chiedo dove possa trovare abbigliamento di buona qualità ad un prezzo decente.\nAnche mercatini vanno bene☺️.\nGrazie.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1rh1iz6/abbigliamento_di_buona_qualità/"
    },
    {
        "id": "1rgkxyc",
        "author": "Purple_CEO",
        "title": "Avete rotto il cazzo con ste zone di Torino.",
        "content": "",
        "upvotes": 121,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1rgkxyc/avete_rotto_il_cazzo_con_ste_zone_di_torino/"
    },
    {
        "id": "1rg3vd3",
        "author": "NonPinoz",
        "title": "Com'è questa zona di Torino?",
        "content": "",
        "upvotes": 715,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8p4g3pufs0mg1.jpeg?auto=webp&amp;s=6b3f6edf7207b479d1a6d91f73a6670e4dc834f3"
        },
        "permalink": "/r/torino/comments/1rg3vd3/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rg5pup",
        "author": "FedeTardi",
        "title": "Com'è questa zona di Torino?",
        "content": "",
        "upvotes": 321,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mlrpqscp91mg1.jpeg?auto=webp&amp;s=0d89ef9e89e115e134aff4830352d06232215c75"
        },
        "permalink": "/r/torino/comments/1rg5pup/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rgj5ra",
        "author": "MoonlightCapital",
        "title": "Com'è questa zona di Torino?",
        "content": "",
        "upvotes": 49,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ja1b2aijs3mg1.jpeg?auto=webp&amp;s=958435a8bd24a592545b6d26b4439073b96ba0c7"
        },
        "permalink": "/r/torino/comments/1rgj5ra/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rg5gz2",
        "author": "garoglio",
        "title": "Com'è questa zona di Torino?",
        "content": "",
        "upvotes": 143,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vlbmj6dj71mg1.jpeg?auto=webp&amp;s=a7808311f1de80ec8b3e06250e6760e0fbfb19d4"
        },
        "permalink": "/r/torino/comments/1rg5gz2/comè_questa_zona_di_torino/"
    },
    {
        "id": "1rgjzal",
        "author": "PhirlolandCol",
        "title": "Com'è questa zona di...",
        "content": "https://preview.redd.it/aefqifm7y3mg1.png?width=860&amp;format=png&amp;auto=webp&amp;s=5069ddd5a81e4a29d024b177002ce6098a0682b0\n\n",
        "upvotes": 26,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rgjzal/comè_questa_zona_di/"
    },
    {
        "id": "1rgklcc",
        "author": "Corelivan",
        "title": "Com’è questa zona del Torino?",
        "content": "",
        "upvotes": 19,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oivfqd5f24mg1.jpeg?auto=webp&amp;s=13b46a14d49617a09e1d4710c22ab130a89cc430"
        },
        "permalink": "/r/torino/comments/1rgklcc/comè_questa_zona_del_torino/"
    },
    {
        "id": "1rha6lr",
        "author": "AnalysisOk7862",
        "title": "San Salvat",
        "content": "Cosa ne pensate di San Salvario? Com’è viverci d stare in giro la sera?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rha6lr/san_salvat/"
    }
]