[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pecmsn",
        "author": "LollipopChainsawZz",
        "title": "Netflix is leading bidder for Warner Bros. Discovery: Sources",
        "content": "",
        "upvotes": 31,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pecmsn/netflix_is_leading_bidder_for_warner_bros/"
    },
    {
        "id": "1pe6pfe",
        "author": "StunningComment6064",
        "title": "Which movie (on netflix) is the saddest one you ever watch?",
        "content": "Hey guys,\ncould you recommend a Netflix movie that made you cry? Or a movie that left you with strong (sad) emotions after watching it? I’m currently in the mood for something like that.\nThank you!\n",
        "upvotes": 27,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1pe6pfe/which_movie_on_netflix_is_the_saddest_one_you/"
    },
    {
        "id": "1pdnga8",
        "author": "GuineaPKilledMe",
        "title": "Sean Combs: The Reckoning - The jurors that agreed to sit down for documentary are disgusting.",
        "content": "If every juror in Diddy's case truly felt the same way as those two they interviewed for the doc, no wonder Diddy only got away with 50 months.\n\nBoth of them seemed extremely biased. The male juror basically put all the blame on Cassie and showed absolutely no sympathy for her. He immediately gave me the creeps. Seems like he really didn't value women at all.\n\nThe woman was even worse. She couldn't even hide her delusional love for Diddy. You can tell she was jumping with joy every time how she explained how Diddy would make eye contact with the jurors. She's so delusional I wouldn't doubt if she thought he was making eye contact with only her.\n\nThose two were absolutely vile in their reasoning for only counting him with two charges.\n\nEdit: Sorry about the grammar error in the title. It was suppose to say \\*The documentary",
        "upvotes": 442,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnga8/sean_combs_the_reckoning_the_jurors_that_agreed/"
    },
    {
        "id": "1pe4fit",
        "author": "GEMHidden",
        "title": "Director recognition for Sean Combs: The Reckoning",
        "content": "Alexandria Stapleton use of arrest photos, live footage, and decades of escalating violence paints the picture of a monster built by silence and complicity. The reckoning isn’t just for Diddy but for everyone who enabled him! \n\nI’m sure 50 cent offered her a pretty penny for the series, as Diddy likely passed on it either because he believed he would receive a not guilty verdict or did not have the funds to pay for the footage. What do you all think? \n",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pe4fit/director_recognition_for_sean_combs_the_reckoning/"
    },
    {
        "id": "1pe7279",
        "author": "hevy_smoker",
        "title": "The UK top 10",
        "content": "Just looking at the top ten films in the UK and it seems no-one in the country has any desire to watch anything that isn't total and utter garbage. Same with the top ten series, utter utter garbage.",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pe7279/the_uk_top_10/"
    },
    {
        "id": "1pdkhjy",
        "author": "Wayman52",
        "title": "Netflix is removing Lost, Supernatural and The 100 all in one month.",
        "content": "This is ridiculous, there's so much slop on this site now, maybe 1 in 10 shows (and that's being generous) is actually watchable, and they continually get rid of beloved movies and shows. They cancel good Netflix originals or just quietly never giving them a second season, why does anyone keep their subscription? ",
        "upvotes": 257,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkhjy/netflix_is_removing_lost_supernatural_and_the_100/"
    },
    {
        "id": "1pdosrd",
        "author": "leangreenmonkey",
        "title": "Thirty minutes into Wolf of Wall Street and now it’s unavailable to watch",
        "content": "Actually so unbelievable, I was thirty minutes into The Wolf of Wall Street on Netflix, left the app for a few minutes, came back - and now the movie is no longer available on Netflix and has the “remind me” alarm button. What the actual hell, this is never happened to me in the middle of watching a movie. Anybody else?",
        "upvotes": 54,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1pdosrd/thirty_minutes_into_wolf_of_wall_street_and_now/"
    },
    {
        "id": "1pegj3k",
        "author": "TheStickySpot",
        "title": "I just got Netflix for my first time so I can watch Vol 2 of ST with everyone else are there any show or movie recommendations as I have technically already seen Vol 1 but I’m rewatching it.",
        "content": "The only other platforms I have had were I believe Paramount and HBO Max. I never really jumped on this platform as I thought that ai would only use it for one thing but today I decided to take a gamble on it and now I am a bit overwhelmed.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pegj3k/i_just_got_netflix_for_my_first_time_so_i_can/"
    },
    {
        "id": "1pedddo",
        "author": "ScorpioBear1996",
        "title": "Help",
        "content": "I need help guys. I can't log in on my computer without it saying 'technical difficulties' but I can log in on my phone website and app. I dunno what's going because it doesn't make sense. I even got downloaded the app on my laptop but it's still not working",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pedddo/help/"
    },
    {
        "id": "1pe5t2w",
        "author": "ShawnyMcKnight",
        "title": "Getting Lego party game to work?",
        "content": "So we have a Roku that's about 4 years old and my kids wanted to play the Lego Party game. From my understanding you can play that through the netflix app, or is an android/IOS game? I thought my kids would have a lot of fun with it but I can't figure out how to find it.\n\nPeople are saying that there is a \"games\" section of Netflix app, but I don't see that section. Would it work on Rokus or is it for Apple TVs or Android loaded devices?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pe5t2w/getting_lego_party_game_to_work/"
    },
    {
        "id": "1pdx4pq",
        "author": "Infinite-Albatross44",
        "title": "Love &amp; Death",
        "content": "Who has finished this? Binged watched in like 2 days😂 it literally has everything.  Period based show which i absolutely adored being from the 80s. Sex, mystery and murder. I know it came on max a while back so some of you watched but I thought it was a great TRUE story/crime!",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pdx4pq/love_death/"
    },
    {
        "id": "1peah8l",
        "author": "ThatTenguWeirdo",
        "title": "Question about ad-supported: do illegible titles still show up?",
        "content": "Occasionally use netflix to watch anime and such through a family member; they recently downgraded to the ad-supported plan which means some shows I can no longer watch.\n\nWhat I want to know is if these shows wil still show up when I search through Netflix, and if they'll still show up in my list. I prefer to at least know if the show's on the platform even if I can't watch it currently.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1peah8l/question_about_adsupported_do_illegible_titles/"
    },
    {
        "id": "1pdrsu1",
        "author": "undeadbirdo",
        "title": "Wolf of Wall Street Removed and Censored",
        "content": "Hi guys. I've seen a couple people post about how they were watching the Wolf of Wall Street and it suddenly refused to play with a \"title not available to watch instantly\" error. This happened to me too, so I used the chat feature to ask about it. I cant post the screenshots, but the agent said: \n\n\"About your concern regarding the title. I checked and confirmed that this title is not available in your location.\"\n\n\"Currently we do not have issue but can you send us a report regarding this title\"\n\n\"As I checked the title lists based in the US, this title is not seen meaning it's not available.\"\n\nI live in Texas, so im wondering if there's local laws that banned the movie or something like that. There are articles online from like 5 days ago saying it was coming back on the 1st of December, so i know im not crazy!\nAlso, what I was able to watch was censored in weird spots, and I know for a fact it wasn't like this a couple years ago. Does anyone else find this fishy??\n\nEDIT: The movie is back on Netflix, uncensored. False alarm everybody lmao",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pdrsu1/wolf_of_wall_street_removed_and_censored/"
    },
    {
        "id": "1pe70sa",
        "author": "Sensitive-Artist4845",
        "title": "I have 14 days left for watching shows on Netflix.",
        "content": "Hi all! New here\n\nI wanted to watch a show on Netflix and I've got the notification that I'm not in the same house with the owner. I was shocked because I'm the owner of the account. \n\nMy mother and my sister are using my account as well but they are in my home town and I'm away from them.\n\nI've watched Stranger Things last week and I didn't had any problems. \n\nWhat should I do?\n\nThank you!",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pe70sa/i_have_14_days_left_for_watching_shows_on_netflix/"
    },
    {
        "id": "1pdupz6",
        "author": "NikkoMai",
        "title": "Netflix Facebook page",
        "content": "Am I the only one who gets this, when I click on the Facebook page for Netflix it takes me back in time to 2019 with the cover being The Crown and the last post also being from 2019? ",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pdupz6/netflix_facebook_page/"
    },
    {
        "id": "1pe5de4",
        "author": "freaky33",
        "title": "4K/Dolby Vision picture quality The Beast in Me bad?",
        "content": "Why is the picture quality of The Beast in Me so bad? The quality should be 4K and Dolby Vision, but on my 4K TV, the picture is very grainy and the colors aren't great. Why is that? I often experience this with 4K/Dolby Vision series. I'm using the Apple TV Netflix app.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pe5de4/4kdolby_vision_picture_quality_the_beast_in_me_bad/"
    },
    {
        "id": "1pden8k",
        "author": "brysonboompaul",
        "title": "Kalenna Harper Claims Diddy Was Awake 14 Days On Cocaine In Netflix Doc",
        "content": "",
        "upvotes": 41,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pden8k/kalenna_harper_claims_diddy_was_awake_14_days_on/"
    },
    {
        "id": "1pd5cy5",
        "author": "ohsoyouhunnii",
        "title": "The Beast in Me",
        "content": "I'm sitting here watching episode 6 &amp; I have been so annoyed at this show since the beginning &amp; am finally feeling the urge to tell someone. \n\nWhy am I annoyed might you ask? 1. because its such a slow burner &amp; 2. Aggie DOES NOT KNOW HOW TO SAY NO TO NILE. Its annoying as hell. Then the faces she makes, the stuttering every time she speaks to him—I'm aware that its acting but she is so bad &amp; needs to tell his weird ass NO. \n\n😆 I just needed to rant!",
        "upvotes": 87,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5cy5/the_beast_in_me/"
    },
    {
        "id": "1pdclni",
        "author": "dailymail",
        "title": "Love Is Blind's Alexa and Brennon Lemieux announce they are divorcing after four years of marriage and just one year after welcoming their daughter",
        "content": "",
        "upvotes": 35,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pdclni/love_is_blinds_alexa_and_brennon_lemieux_announce/"
    },
    {
        "id": "1pdkqco",
        "author": "lifesyndrom",
        "title": "Am I the only one who can’t stand Shelley in The beast in me (mini-series)",
        "content": "So far I’m halfway through the show \n\n\n\nLike I get her frustration but she’s doing too much (and I’m not saying Aggie is perfect or anything) \n\n\n\nLike the way she’s judging Aggie about that guy who killed their son (forgot his name) how tf does she expect Aggie to move on ON TOP of the guy not getting any prison time????? I wouldn’t rest if someone recklessly killed my child via drunk driving and didn’t get any type of punishment. and he had the audacity to come to his grave…..I would’ve lost it \n\n\n\nAnd then she tries to blame Aggie for his “death” is beyond wild. I understand she moved on  but expecting Aggie to move on as easily as she did is crazy \n\n\nAnd when she got offered the gallery opportunity, I didn’t recall her calling Aggie to thank her…but when she lost it, she was so quick to call her and blame her. It’s like she’s only focusing on the bad things.\n\n\n\nOnce again I get her frustration in general but she’s doing too much in my opinion ",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkqco/am_i_the_only_one_who_cant_stand_shelley_in_the/"
    },
    {
        "id": "1pdeo6y",
        "author": "brysonboompaul",
        "title": "Gigolo Recalls Diddy Beating Up Cassie During Sex In New Netflix Doc",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdeo6y/gigolo_recalls_diddy_beating_up_cassie_during_sex/"
    },
    {
        "id": "1pe0dm4",
        "author": "forumforum123",
        "title": "Looking for the actor / German voice ac",
        "content": "Hey everyone,\n\nI’m stuck on a tiny detective mission and could really use your expertise.\nIn “Home for Christmas” (Netflix), Season 2, Episode 2 – around the 18:10 mark, there’s an actor whose German voice actor sounds super familiar… but I just can’t figure out who it is.\n\nDoes anyone know who’s doing the German voice at that moment?\nIt’s driving me nuts — the voice sounds like someone you’ve heard a hundred times.\n\nThanks for any help!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pe0dm4/looking_for_the_actor_german_voice_ac/"
    },
    {
        "id": "1pd6pbo",
        "author": "JelliBabySkyyy",
        "title": "Sean Combs: The Jury",
        "content": "In my country, we don't use the jury system. Watching the interviews with the jury members really shocked me. They seemed so chuffed in their interviews. I was losing my mind!\nIs this normal? For people in jury system countries, are you guys comfortable putting your life in the hands of randos that didn't go to law school and are exposed to uneducated tik tok opinions?",
        "upvotes": 57,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6pbo/sean_combs_the_jury/"
    },
    {
        "id": "1peax86",
        "author": "Economy-Specialist38",
        "title": "NetFlix gave hime a few bucks",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1peax86/netflix_gave_hime_a_few_bucks/"
    },
    {
        "id": "1pec2kx",
        "author": "Sel1803",
        "title": "Netflix idea",
        "content": "You know what Netflix needs? A comment section where you can see what others thought of movies and shows!! Wouldn't that be absolutely amazing? Not sure if this fits in here  but wanted to share my thoughts ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pec2kx/netflix_idea/"
    },
    {
        "id": "1pebuqb",
        "author": "Impressive_Gain_3385",
        "title": "Anyone else think adolescence is not that good?",
        "content": "I am three episodes down/completed and I just dont like it. The show has terrific reviews and a lot of praise on reddit. I started watching it last night three episodes and it just isnt that good. Kind of painful to watch",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pebuqb/anyone_else_think_adolescence_is_not_that_good/"
    },
    {
        "id": "1ped48n",
        "author": "CentoSauro3K",
        "title": "Friends tv show leaving Netflix at the end of the year. After, you must buy it on Amazon",
        "content": "Whilst for a while Friends has been available by streaming just on Prime, for a long time, later was become available on Prime and Netflix but I’ve now discovered that on Netflix is leaving at the end of December, while on Prime the only option is to buy the single episode or the individual season, one by one. Merry Xmas to all.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ped48n/friends_tv_show_leaving_netflix_at_the_end_of_the/"
    },
    {
        "id": "1pctv6n",
        "author": "Glad-Ad-6240",
        "title": "sean combs the reckoning",
        "content": "This doc was put together so well. What really gets me is how he got so huge without much talent, just by attaching himself to other people’s success. Diddy has harmed a lot of people, but the part that blew my mind was the evidence pointing toward his involvement with Pac’s death. I honestly think he had something to do with both Biggie and Pac’s death and was jealous of both him and Biggie, like he created this whole “beef” to get rid of them. A 50-month sentence isn’t long enough.\n",
        "upvotes": 247,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1pctv6n/sean_combs_the_reckoning/"
    }
]