[
    {
        "id": "1pqpfyk",
        "author": "ClarkGreggAMA",
        "title": "Hi /r/movies! I'm Clark Gregg. You might know me from Agents of SHIELD, Iron Man, Thelma, 500 Days of Summer, The Avengers, State and Main, The West Wing, The Shield, and more. Ask me anything!",
        "content": "Hi r/movies! I'm Clark Gregg. You might know me from things like **Agents of SHIELD**, **Iron Man**, **Thelma**, **500 Days of Summer**, **The Avengers**, **Magnolia**, **State and Main**, **Much Ado About Nothing**, **Being the Ricardos**, **Snowpiercer**, **The West Wing**, **The New Adventures of Old Christine**, **The Shield**, and more. Maybe you've also seen me on Broadway in A Few Good Men or Good Night, and Good Luck. Full list of credits [here](https://www.imdb.com/name/nm0163988/).\n\nI also star in **The Artist**, a new murder-mystery series which is streaming exclusively on [TheNetwork.Stream](http://TheNetwork.Stream)\n\nI'm here to answer your questions.\n\nMore information about my newest project:\n\n**The Artist** \\- In the twilight of the Gilded Age, murder strikes the estate of an eccentric and failing tycoon. As he hosts the era's biggest celebrities including Thomas Edison, Edgar Degas and Evelyn Nesbit, lies, mystery and ambition collide as the truth is shockingly revealed.\n\n*Trailer*: [http://youtube.com/watch?v=xoA7msjfqkA](http://youtube.com/watch?v=xoA7msjfqkA)\n\nStarring Mandy Patinkin, Janet McTeer, Danny Huston, Hank Azaria, Patti Lupone, Katherine McPhee, Clark Gregg, Ever Anderson, and Zachary Quinto. Streaming exclusively on The Network.\n\nPart 1 premiered on Thanksgiving, and Part 2 will be premiering on Christmas day.\n\nAsk me anything! Back at 3:30 PM today (Friday 12/19) to answer your questions.",
        "upvotes": 3141,
        "comments": 711,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f6kw5v5jt68g1.jpeg?auto=webp&amp;s=f719cc49435ab34b2b61ff80a61d0f750eb38dcd"
        },
        "permalink": "/r/movies/comments/1pqpfyk/hi_rmovies_im_clark_gregg_you_might_know_me_from/"
    },
    {
        "id": "1pqbjno",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Avatar: Fire and Ash / The Housemaid / The SpongeBob Movie: Search for SquarePants)",
        "content": "**New In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwbacks this week as we try to align the weeks so we can continue next year. Next batch of movies were Christmas day releases so we will post them with the Christmas day '26 releases.**\n\n**Still In Theaters**:\n\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 35,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pqbjno/official_discussion_megathread_avatar_fire_and/"
    },
    {
        "id": "1ps6krb",
        "author": "tylerthe-theatre",
        "title": "James Cameron denies claims that Matt Damon missed out on huge 'Avatar' payday",
        "content": "",
        "upvotes": 669,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9IwdV0GAXYoY79XRixORnJWW0HrXBsLC5lv75yufMIE.jpeg?auto=webp&amp;s=9474d6f0bcb73f00e4ea19d1d6c9bdb69e10cb0e"
        },
        "permalink": "/r/movies/comments/1ps6krb/james_cameron_denies_claims_that_matt_damon/"
    },
    {
        "id": "1ps4l9e",
        "author": "RobustPolygon",
        "title": "TENET Blew Me Away.",
        "content": "I finally watched TENET, and I'm blown away how one of my favorite directors could make such a poor film.\n\n  \nWhen TENET first came out, I missed in in theaters, but tried to watch it at home. I lasted maybe 30 minutes, but was so confused and bored, I stopped watching it.\n\n  \nI finally decided to watch it in full, properly, thinking maybe I just wasn't in the right headspace at the time.\n\n  \nI watched in on 4K Bluray, on an UB820 and LG G4 with a Q990 11.1.4 Surround System.\n\n  \nAnd after 2.5 hours, I think it's the worst film Nolan has ever made, a director who's films I've generally loved.\n\n  \nInterstellar is one of my favorite films of all time, and I've loved his other films like Memento, Dunkirk, Inception, Batman Trilogy, Oppenheimer, etc... Almost without fail, his films have been complex spectacle with fantastic writing and an emotional core that carried the films.\n\n  \nTENET was none of those things, IMO.\n\n  \nTENET is far too complex for it's own good, and even after fully understanding the different flows of time the characters are going through, it's just a bad story. It's complexity for the sake of complexity, without serving the actual story.\n\nThere are precisely 0 characters you care about, there is no emotional core to the film, at all. The final \"idea\" of the film that Neil and the Protag had this great friendship in two different directions was cool, but it was never earned.\n\nI thought John David Washington's performance was pretty awful, he has the charisma of a wet paper bag, and the writing of the film does him no favors. I've liked him in other roles, so I would put more of this on the writing than him to some degree. The writing in general for all the dialog was AWFUL. People talk like CHAT GPT robots, in unnatural ways.\n\n  \nI at least thought the action spectacle would be worth the price of admission, but I thought it was pretty disjointed and unemployable to watch. The fights where people going forward through time were fighting people going backwards just looked disjointed, and unappealing to watch.\n\n  \nSome of the music was kind of cool, but it felt more like soundscapes than a true OST.\n\n  \nOverall, the entire film felt more like an \"idea\" than an actual film, it was insanely disappointing.",
        "upvotes": 667,
        "comments": 882,
        "media": null,
        "permalink": "/r/movies/comments/1ps4l9e/tenet_blew_me_away/"
    },
    {
        "id": "1prlvb9",
        "author": "HasSomeSelfEsteem",
        "title": "How did Taylor Sheridan go from writing heartbreaking, thoughtful, and poignant films to writing disposable, propagandistic, soap operas?",
        "content": "My first exposure to Taylor Sheridan was 2015's \\*Sicario\\*. Directed by Denis Villeneuve, \\*Sicario\\* is a bleak story about the ultimate collapse of jurisdiction, legality, and morality around the War on Drugs as national elements and interests slowly degrade into pure power politics. It has been called the \\*Apocalypse Now\\* of the War on Drugs, and while I don't think \\*Sicario\\* is quite a film of that caliber I do think the comparison stands as legitimate.\n\nThe year after \\*Sicario\\* was released, 2016, saw the release of a crime tragedy set in West Texas titled \\*Hell or High Water\\*, directed by David Mackenzie. \\*Hell or High Water\\* is a great films, as all of the performances, settings, and dialogue create a sincere and disturbing look at rural poverty in America. The film, ostensibly a heist film, features characters fully formed from the land which reared them. The cars they drive, the way they talk, and clothes they wear all appear to the audience as sincere to the setting and theme.  The climactic refrain of the film is poignant, \"I've been poor my whole life, like a disease passing from generation to generation. But not my boys, not anymore.\"\n\nAnd the year after that we have 2017's \\*Wind River\\*, directed by Sheridan himself. I have mixed feelings about this film. It tackles the topic, that of the murder of Indigenous women on western reservations, with the appropriate weight and despair. At times it \\*almost\\* rises to the level of Cormac McCarthy and Larry McMurtry in terms of the grandiosity and profound sorrow in the western cannon. It is a film which is so tense at times it almost feels like your back is about to shatter from the strain. The climactic standoff absolutely deserves it's place in film history. And it features an incredible, but brief, performance by Gil Birmingham as a father who almost seems to be transforming into a being of pure grief. However, \\*Wind River\\* also features Jeremy Renner as a white guy who seems to really believe that he is just as native as the Native Americans he lives with, and while Elizabeth Olsen turns in a good performance as the representative of an uncaring federal government, she plays a far more central role in the plot that the great Graham Greene, whose portrayal of an indigenous police chief is commanding of respect.\n\nBy 2018 Sheridan had three critically acclaimed films under his belt, with one as director and one being nominated for Best Picture. Then he writes the superfluous sequel to \\*Sicario\\* titled \\*Sicario: Day of the Soldado\\*, which failed to make any real impact at all. Importantly, however, \\*Sicario 2\\* reduces the immorality and cynicism from the CIA characters and seemingly is more approving of the institutions he criticized in his own previous screenplay. All in all, a strange and disappointing follow up.\n\nAnd then \\*Yellowstone\\* happens, which launches Sheridan into the stratosphere in terms of fame and income. I hate \\*Yellowstone\\*. I hate how its understanding of the west is seemingly entirely based in the Texan hatred of public land and land conservation. I hate how the show's understanding of the rural working class and ranching is almost entirely seen as violent, confrontational, and libertarian. I hate the militarism of the show . But I think what I hate most is how a man who once wrote a heartbreaking film about rural poverty wasted the opportunity to offer any meaningful examination of life in the rapidly gentrifying American West, and instead became the primary advertiser for that gentrification.\n\nAnd then the rest is history. He's now writing disposable show after disposable show about the virtues of the American military establishment, as well as about the virtues of the oil industry decimating the rural farmland he was once such a mourner of. In \\*Wind River\\* oil rig workers were the racist, murdering, rapists, in \\*Landman\\* they're heroes holding up the American way of life.\n\nBut I know the answer already. It's money. Soap Operas aimed at suburban conservatives sell very well, and \\*Yellowstone\\* is the apotheosis of that genre.",
        "upvotes": 7414,
        "comments": 1222,
        "media": null,
        "permalink": "/r/movies/comments/1prlvb9/how_did_taylor_sheridan_go_from_writing/"
    },
    {
        "id": "1ps09uo",
        "author": "flash69696969",
        "title": "Is Raiders of the Lost Ark the best opening of all time",
        "content": "It’s an incredible opening scene that does everything:\n\nIntroducing the main character, tells us what he does &amp; how he works, gets us excited about these comic book scenarios that seems ridiculous but he survives, introduces the whip, we understand he hates snakes, the score &amp; the Indy theme is stunning, the shots &amp; shadows create incredible visuals, the authentic props are everything. \n\nAnd we meet his arch nemesis Beloch! All within the first 13 minutes!\n\nCan I suggest it’s the greatest opening scene of all time?",
        "upvotes": 532,
        "comments": 306,
        "media": null,
        "permalink": "/r/movies/comments/1ps09uo/is_raiders_of_the_lost_ark_the_best_opening_of/"
    },
    {
        "id": "1ps1kmn",
        "author": "Task_Force-191",
        "title": "Official Teaser for Live Action Film “Look Back” — [Releasing in 2026] directed by Hirokazu Kore-eda",
        "content": "",
        "upvotes": 349,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j706bXMj3zM6AySgs8ptauVdbBx_N2GUiSpbnu-8R3M.jpeg?auto=webp&amp;s=bb486a4ab3aa95d520a70a301f59d7aa171f536f"
        },
        "permalink": "/r/movies/comments/1ps1kmn/official_teaser_for_live_action_film_look_back/"
    },
    {
        "id": "1pruj0i",
        "author": "chunga_95",
        "title": "What is the most realistic, and unrealistic, depiction of a mundane task in movies?",
        "content": "I'll start: starting a gas powered chainsaw.\n\nUnrealistic: in National Lampoon's Christmas Vacation, when Clark has gone nuts and cuts the knob off the newel post - he starts the chainsaw in one pull. Fake!\n\n  \nRealistic: Mad Max Beyond Thunderdome, Max is running around Thunderdome trying to pull-start the chainsaw, but his life literally depends on it, he keeps pulling and pulling, and it won't catch. When it does, the chainsaw runs for a few seconds and dies. This is my experience with starting chainsaws. ",
        "upvotes": 849,
        "comments": 287,
        "media": null,
        "permalink": "/r/movies/comments/1pruj0i/what_is_the_most_realistic_and_unrealistic/"
    },
    {
        "id": "1prie4m",
        "author": "MarvelsGrantMan136",
        "title": "James Gunn Finds His Brainiac For ‘Man Of Tomorrow’ In Lars Eidinger",
        "content": "",
        "upvotes": 4712,
        "comments": 448,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DJ0-lOCHbNg4UKu65W1vwtCDE88bOW8m3knI0THh-p4.jpeg?auto=webp&amp;s=4282ec2f08c5ca799e7c3dadc2d11e58e759d829"
        },
        "permalink": "/r/movies/comments/1prie4m/james_gunn_finds_his_brainiac_for_man_of_tomorrow/"
    },
    {
        "id": "1prww0x",
        "author": "raxliana",
        "title": "the wild robot is a beautiful movie",
        "content": "i don’t know if i’m just high but this movie is so SO beautiful. so many scenes of beautiful moral story telling. i feel like anyone at any age can feel every emotion to this movie. it shows realistic things about nature to children without obviously doing too much and also not trying to censor the circle of life. and it’s SO FUNNY. i love this movie and it deserves a five star rating from EVERYONE",
        "upvotes": 528,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1prww0x/the_wild_robot_is_a_beautiful_movie/"
    },
    {
        "id": "1prqkdt",
        "author": "Amaruq93",
        "title": "\"The pellet with the poison's in the vessel with the pestle, the chalice from the palace has the brew that is true!\" - from \"The Court Jester\" (1956, directed by Norman Panama &amp; Melvin Frank)",
        "content": "",
        "upvotes": 1033,
        "comments": 97,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x2oaz1pgqf8g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1prqkdt/the_pellet_with_the_poisons_in_the_vessel_with/"
    },
    {
        "id": "1prb18d",
        "author": "Automaticalee",
        "title": "Transformers: Age of Extinction (2014) - The Romeo &amp; Juliet law scene, in which a 20 year old man describes how he can legally date Mark Wahlberg's 17 year old daughter by showing the law printed on a laminated card he keeps in his wallet.",
        "content": "",
        "upvotes": 10472,
        "comments": 1089,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/m9fwr2vu1c8g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1prb18d/transformers_age_of_extinction_2014_the_romeo/"
    },
    {
        "id": "1prre47",
        "author": "CinefiloAmador",
        "title": "How come \"Over the Hedge\" (2006) never got a sequel or is rarely talked about?",
        "content": "It got good reviews, made a lot of money, had a terrific cast, I adored the soundtrack, and yet, the film was completely forgotten. It didn't get a spin-off series or a sequel or anything. It was as if it didn't exist and the voice work was outstanding: Bruce Willis, Garry Shandling, Steve Carell, Wanda Sykes, Catherine O'Hara, William Shatner, Allison Janney...etc. \n\n\nI got to see it at my local theater back in the day, 3 times, and I enjoyed it a lot. Perfect for kids while not corny enough to put off adults.",
        "upvotes": 752,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1prre47/how_come_over_the_hedge_2006_never_got_a_sequel/"
    },
    {
        "id": "1ps3oa9",
        "author": "IshMEL274",
        "title": "Remakes that aren’t remakes",
        "content": "We recently held an “outsiders band together to save the village from bandits” bingefest:\n\nSeven Samurai → Magnificent Seven → Battle Beyond the Stars → A Bug’s Life\n\nWhich had me wondering, what other films are basically remakes without being remakes?\n\nOther examples I could think of:\n\nHigh Noon → Outland\n\nRosencranz and Guildenstern Are Dead → Lion King 1 ½\n\nCasablanca → Barb Wire (I didn’t say they had to be *good*)\n\nAll About Eve → Showgirls (see previous parenthetical)\n\nSo, what are some others?",
        "upvotes": 89,
        "comments": 226,
        "media": null,
        "permalink": "/r/movies/comments/1ps3oa9/remakes_that_arent_remakes/"
    },
    {
        "id": "1ps6rz4",
        "author": "Useful_Psychology_81",
        "title": "Can anyone recommend any films about life or something that could give me some sort of hope",
        "content": "hi I’m 17f and I am so fricking tired of my mum. she’s always yelling and raising her voice at me and I hate it. I really want to leave home. one of the things she dislikes about me is how much I watch movies. so does anyone know of any movies I could watch that might motivate me to make a move or at least remind me that things will get better? that life isn’t always so crappy? something like that? movies are a big escapism for me so I’d love to indulge in some",
        "upvotes": 48,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1ps6rz4/can_anyone_recommend_any_films_about_life_or/"
    },
    {
        "id": "1prhkb1",
        "author": "MarvelsGrantMan136",
        "title": "Joseph Kosinski Doesn’t See ‘Tron: Ares’ As A Sequel To ‘Tron: Legacy’",
        "content": "",
        "upvotes": 2540,
        "comments": 348,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L1GHF9pISUPGXcKa4tyQiYuEoTytlFki6NI82KrwtHM.jpeg?auto=webp&amp;s=51ee01a1c14b32196139ae3a34032551a3bb5380"
        },
        "permalink": "/r/movies/comments/1prhkb1/joseph_kosinski_doesnt_see_tron_ares_as_a_sequel/"
    },
    {
        "id": "1prxsew",
        "author": "Cr1zyh1ppy",
        "title": "What's a film you can practically quote from start to finish and not get bored of?",
        "content": "Mines death becomes her.\n\n\"Ernest! You pushed me down the stairrsssssss!\"\n\n\"My ass! I can see.. my ass!\"\n\n\"I would like to talk about... Madeline Ashton\" 😡\n\n\"And she was a baaad actress\"\n\n\"Now a warning\" \"NOW A WARNING?!\"\n\n\"When you lost your index finger\"              \"I didn't lose it it broke off\".                 \"that's cause you cracked your knuckles all the tiiiime\"! \"ARGHHHH Help me my legs aren't working\"!                                                             \"AHH\"! 📶🤸🤸🎆\n\n\"En garde, bitch!\"\n\n\"She's dead!\".                                                      \"She is? These are the moments that make life worth living\"\n\nedit: it's really making me smile seeing all the films and quotes people love, I'm saving all I haven't seen to watch soon 🙂",
        "upvotes": 218,
        "comments": 575,
        "media": null,
        "permalink": "/r/movies/comments/1prxsew/whats_a_film_you_can_practically_quote_from_start/"
    },
    {
        "id": "1prvo5c",
        "author": "BunyipPouch",
        "title": "First Poster for Pedro Almodóvar's 'Bitter Christmas' - A woman is being abandoned by her partner during Christmas time.",
        "content": "",
        "upvotes": 190,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h08o24ixzg8g1.jpeg?auto=webp&amp;s=73b4eaaaf0781ce28de5fb8cbf89d3f2be7d207e"
        },
        "permalink": "/r/movies/comments/1prvo5c/first_poster_for_pedro_almodóvars_bitter/"
    },
    {
        "id": "1psa6bv",
        "author": "BARGOBLEN",
        "title": "Lethal Weapon, a Christmas Classic",
        "content": "Over the years there's been so much discourse about Die Hard as a Christmas movie, that Richard Donner's X-Mas action movie, Lethal Weapon, has gone unrecognized. We see Die Hard on numerous best Christmas movie lists, and rightfully so. We see so many ardent defenders of Die Hard but in doing so we've neglected this 1987 classic. Make no mistake, Lethal Weapon absolutely qualifies as a Christmas Movie. Not only does it feature the decor of the season heavily, the film opens with \"Jingle Bell Rock\", it has an introductory action set piece in a tree lot, and the movie follows the depressive seasonal slump of a recently widowered cop challenged by the themes of family and redemption, until he's offered a new family and a path to redemption. Despite being set in LA, the filmmakers work in a little \"snow\" into the plot. I think it's time we started defending Lethal Weapon's status as a Christmas movie.",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1psa6bv/lethal_weapon_a_christmas_classic/"
    },
    {
        "id": "1psa2uk",
        "author": "No_Poetry_9986",
        "title": "biggest surprise movie of the year and biggest let down?",
        "content": "I was at the cinema yesterday watching Avatar, and I actually really enjoyed it (minus the 3D — that always gives me a headache). It got me thinking, so here’s my yearly post to this community. Also to get some more movie inspiration for the upcoming days.\n\nAs the title says: what movie that came out this year surprised you? Something you expected to be bad or mediocre, but ended up really enjoying.\n\nOn the flip side, what movie disappointed you? One you had high expectations for, but that just couldn’t live up to the hype?",
        "upvotes": 22,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1psa2uk/biggest_surprise_movie_of_the_year_and_biggest/"
    },
    {
        "id": "1ps8kf9",
        "author": "Bikewer",
        "title": "F1",
        "content": "I’m an old Formula One fan, I got involved in sim-racing with the old “Grand Prix Legends” game.   \n\nI’ve felt that the best racing films were “Grand Prix” with James Garner and “Les Mans” with Steve McQueen.   There have been a couple of decent ones since… “Ford vs. Ferrari” was not bad.\n\nSo I put off watching this one for some time.   But I was very pleasantly surprised.   The fact that they included essentially the entire Formula One roster in the film didn’t hurt, and it was produced by Louis Hamilton. \n\nThe racing sequences are top-notch… I found myself gripping the arms of my easy chair at several points.    \n\nThe plot is pretty familiar…. Jaded old veteran steering the cocky rookie towards a burgeoning career… But well-done. ",
        "upvotes": 15,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1ps8kf9/f1/"
    },
    {
        "id": "1prjbpq",
        "author": "Alternative-Cake-833",
        "title": "Have you ever accidentally watched the wrong movie before?",
        "content": "For some reason many years back. my mother put on The Santa Clause on TV (indeed, I was young at the time). I heard good things about the first one and surprisingly never watched them at all so I decided to sit down and watch it. We usually watch Christmas movies every year as we go through most of them on our list.\n\nSomewhere during the movie, I was getting confused what was happening during the movie (Charlie is a teenager spraying graffiti and the robot taking over control). I felt like that was weird for a Christmas film since it was my first time watching the movie.\n\nIt actually turns out that I was watching the second Santa Clause, not the first one and that how Tim Allen's character becomes Santa Claus was actually in the first movie when I finally got around to it sometime later. I mean, I was a bit shocked when I found that I watched the sequel, not the original later on (though it does happen sometimes).\n\nI have since watched all three of the movies in order and they are good movies to enjoy during the holiday season. But oh my gosh, I was very confused when I watched Santa Clause 2, thinking that it was the first movie and not the sequel.",
        "upvotes": 718,
        "comments": 1461,
        "media": null,
        "permalink": "/r/movies/comments/1prjbpq/have_you_ever_accidentally_watched_the_wrong/"
    },
    {
        "id": "1prnhmw",
        "author": "GoldDerby",
        "title": "‘Scrooged’ sings! Alfre Woodard reveals how she led the closing credits sing-along with Bill Murray:",
        "content": "",
        "upvotes": 411,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/atxCZUYp8OAWD_zpES3KW4nAQJe732Hw1E4Kp7x-Mbw.jpeg?auto=webp&amp;s=ba8cd55f6f6bcf19f98f6d7c5934444789225c9a"
        },
        "permalink": "/r/movies/comments/1prnhmw/scrooged_sings_alfre_woodard_reveals_how_she_led/"
    },
    {
        "id": "1prmns9",
        "author": "superdouradas",
        "title": "Today I watched Bad Boys from 1995 and the movie honestly feels like it could have been filmed in 2025",
        "content": "I’ve always found it interesting that in a lot of michael bay’s films they somehow feel “modern”, even decades later. am i the only one who notices this?\n\nI keep wondering if it’s mainly the lighting, the cinematography, or the way the camera moves that gives his movies that clean, look compared to most other films from the 90s. I get the same feeling with The Rock and Armageddon. I know a lot of people don’t consider him a great director, but honestly his movies seem to age surprisingly well.",
        "upvotes": 393,
        "comments": 180,
        "media": null,
        "permalink": "/r/movies/comments/1prmns9/today_i_watched_bad_boys_from_1995_and_the_movie/"
    },
    {
        "id": "1prhxvf",
        "author": "BunyipPouch",
        "title": "'Poker Face' Star Natasha Lyonne To Write, Direct and Produce 80s-Set Boxing Movie 'Bambo' - It follows a boxing-promoter father as he tries &amp; fails to become the next Don King, and takes his daughter along for the hurly ride of tax evasion, cocaine, race cars, lost dreams and heartbreak.",
        "content": "",
        "upvotes": 492,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eJNXxchhADYK8T11TGkJvjdwnMZsakXTed_jCkWQFYI.jpeg?auto=webp&amp;s=a5e990b1bcbaed53b460bcfa0b01d4616a0181eb"
        },
        "permalink": "/r/movies/comments/1prhxvf/poker_face_star_natasha_lyonne_to_write_direct/"
    },
    {
        "id": "1ps7nf8",
        "author": "HeStoleMyBalloons",
        "title": "Park Chan-wook Breaks Down His Favorite Shots From Oldboy, The Handmaiden, and More | My Best Shots",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jj6IVO1TFt7L2-3SV1JPjET_iJlDdeQ4AcWRKOb8Tf0.jpeg?auto=webp&amp;s=4dd598a6a51d8a381968c85a38c61b1b66234c4d"
        },
        "permalink": "/r/movies/comments/1ps7nf8/park_chanwook_breaks_down_his_favorite_shots_from/"
    },
    {
        "id": "1pqztf1",
        "author": "MarvelsGrantMan136",
        "title": "'James Bond' Films To Stream On Netflix As Part Of Shock Deal With Amazon",
        "content": "",
        "upvotes": 6351,
        "comments": 239,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GLPN_Z1pTZs-8gVzdZ1l0yvIGsHysqkfC7uleQlBRxU.jpeg?auto=webp&amp;s=01201882c2ad20fe6d5b403df88a1bdcfa195e92"
        },
        "permalink": "/r/movies/comments/1pqztf1/james_bond_films_to_stream_on_netflix_as_part_of/"
    },
    {
        "id": "1prhz7u",
        "author": "BunyipPouch",
        "title": "Louis Theroux Set to Screen New Documentary ‘The Settlers’ at Copenhagen Doc Film Festival - Fourteen years after his first visit and 2011 film 'The Ultra Zionists', Louis Theroux meets some of the growing community of religious-nationalist Israelis who have settled in the West Bank.",
        "content": "",
        "upvotes": 271,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FVunPYojtx8LhCWQHNFMUrkRMlLLdREpRAUmmbMbKcw.jpeg?auto=webp&amp;s=9c0a1e39cfbe2fad769d41b8d09eb58f32a3a40e"
        },
        "permalink": "/r/movies/comments/1prhz7u/louis_theroux_set_to_screen_new_documentary_the/"
    },
    {
        "id": "1psa4b0",
        "author": "NakedCardboard",
        "title": "Examples of disappointing films that could have been great with better casting.",
        "content": "I think about *Valerian And The City Of 1,000 Planets*. I feel like there was a good story there, made dull by a couple of lead actors who didn't click with each other and/or the production itself. I don't think Dane or Cara were necessarily \"bad\" in the film, but they just didn't fit. I often wonder what it might have been like with different casting.\n\nWhat are other good examples of this?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1psa4b0/examples_of_disappointing_films_that_could_have/"
    },
    {
        "id": "1prrb6r",
        "author": "cutetiferous",
        "title": "Mulholland Drive question: is it best understood as a dream structure, or as multiple perspectives of the same self?",
        "content": "After rewatching, I’m torn between reading the film as a clean dream/reality split or as a psychological portrait, more like Steppenwolf’s “many selves,” where different versions of the same person take turns narrating guilt, desire, fantasy, and collapse. Curious how others frame it, seems like it has a million interpretations.",
        "upvotes": 53,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1prrb6r/mulholland_drive_question_is_it_best_understood/"
    }
]