[
    {
        "id": "1lcwoxq",
        "author": "SonyPictures",
        "title": "Danny Boyle Here: Ask Me Anything.",
        "content": "Hello Reddit! Director Danny Boyle here. \n\nI'm back, and I’m excited to answer your questions about my new film 28 Years Later. It's starring Aaron Taylor-Johnson, Jodie Comer and Ralph Fiennes and is out in UK cinemas on June 19th and US movie theatres on June 20th. \n\nI'll be online from 5pm BST on Tuesday June 17th - drop your questions below and I hope to answer as many as I can. Speak soon!\n\nhttps://preview.redd.it/ro4j9kivca7f1.jpg?width=788&amp;format=pjpg&amp;auto=webp&amp;s=391f46c6bc5fb615d471e7a15d601d977e765eb9\n\n",
        "upvotes": 115,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1lcwoxq/danny_boyle_here_ask_me_anything/"
    },
    {
        "id": "1lc2owa",
        "author": "BarronsCoveAMA",
        "title": "Hey r/movies! We're Evan Ari Kelman (director), Raúl Castillo (actor), and Christian Convery (actor) of BARRON'S COVE, a new indie thriller that also stars Garrett Hedlund, Brittany Snow, Hamish Linklater, Tramell Tillman, and Stephen Lang. Now in theaters and on VOD! Ask us anything!",
        "content": "Hi! I’m Evan Ari Kelman, a filmmaker and writer. Barron’s Cove is my feature debut, a new indie crime thriller starring Garrett Hedlund, Brittany Snow, Christian Convery, Raúl Castillo, Hamish Linklater, Tramell Tillman, and Stephen Lang. It’s now in theaters and on VOD. \n\nFun fact: I first posted the script on r/Screenwriting , and the encouragement I got there helped push me to keep going and get it made. Barron’s Cove is about the bond between fathers and sons, how it endures across time, and what it means to test that bond to its limits. At its heart, it’s about confronting the limiting beliefs we place on ourselves, and discovering the strength to become something more, through love and legacy. I’m here with Christian and Raúl to talk about the film, the process, and anything else you’re curious about. Ask us anything!\n\nYou might also recognize Raúl from films and series like Smile 2, Army of the Dead, Looking, Hustle, Knives Out, We the Animals, Little Fish, Cha Cha Real Smooth, Wrath of Man, Unsane, and lots more.\n\nChristian has been in films/series like The Monkey, Sweet Tooth, Cocaine Bear, Mom, Invincible, One Piece, and more. \n\n**Here's the trailer:**\n\n[https://youtu.be/\\_CJ-f5GW9Xs?si=e4ySMtHxIM7v5b70](https://youtu.be/_CJ-f5GW9Xs?si=e4ySMtHxIM7v5b70)\n\n**Synopsis:**\n\nA man with a violent past kidnaps the boy he holds responsible for his son's death. As he grows closer to uncovering the truth, he's left to wonder whether his pursuers are really seeking to protect the boy, or merely the secrets he keeps.\n\n**Press &amp; Interviews &amp; Reviews:**\n\n[Indirewire](https://www.indiewire.com/features/interviews/barrons-cove-director-advice-feature-debut-1235127696/?utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter)\n\n[Screenrant](https://screenrant.com/barrons-cove-movie-gnarly-beautiful-stephen-lang-garrett-hedlund-interview/)\n\n  \n**Clips:**\n\n[Clip 1: I'm The Reason - Hedlund &amp; Lang (ComingSoon Exclusive) ](https://www.youtube.com/watch?v=mrTjnIgV_zY)\n\n[Clip 2: Tool Shed - Hedlund &amp; Tillman (Collider Exclusive)](https://collider.com/barrons-cove-sneak-peek-garrett-hedlund-tramell-tillman/)\n\n[Clip 3: Where's Barron? - Hedlund &amp; Snow (ScreenRant Exclusive) ](https://screenrant.com/video/barrons-cove-movie-garrett-hedlund-brittany-snow-missing-child-clip/)\n\n[Clip 4: Interrogation - Hedlund &amp; Snow (Hollywood Reporter Exclusive) ](https://www.instagram.com/reel/DKuehcfR3XV/?igsh=MWptZ3R1ZGQybW82YQ==)\n\n**Original Reddit Discussion:**\n\n[https://www.reddit.com/r/Screenwriting/comments/awy4oi/first\\_15\\_of\\_a\\_new\\_thriller/](https://www.reddit.com/r/Screenwriting/comments/awy4oi/first_15_of_a_new_thriller/)\n\nAsk us anything! We'll be back tomorrow (Monday 6/16) to 11:30 AM ET to answer any questions.\n\n\n\n\n\n",
        "upvotes": 60,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oho02ij9w37f1.png?auto=webp&amp;s=d1a196cef95fce1caf56cbba07247f73d6b73d41"
        },
        "permalink": "/r/movies/comments/1lc2owa/hey_rmovies_were_evan_ari_kelman_director_raúl/"
    },
    {
        "id": "1lcs81p",
        "author": "MarvelsGrantMan136",
        "title": "The Naked Gun | Official Trailer",
        "content": "",
        "upvotes": 6181,
        "comments": 864,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eg7lNqurnPN2pVFaMiuyKkshyonWytsEzEy3W8SedvU.jpeg?auto=webp&amp;s=f7b7280d5619dff610dbf30945cd72ed9524847e"
        },
        "permalink": "/r/movies/comments/1lcs81p/the_naked_gun_official_trailer/"
    },
    {
        "id": "1lcs8kq",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Ari Aster's 'Eddington'",
        "content": "",
        "upvotes": 1396,
        "comments": 226,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6ybry65cfa7f1.jpeg?auto=webp&amp;s=a3d48284a7b7c1c551e5eefe7fc4f16bfb78f061"
        },
        "permalink": "/r/movies/comments/1lcs8kq/new_poster_for_ari_asters_eddington/"
    },
    {
        "id": "1lcm75u",
        "author": "Warmwombie",
        "title": "My crush is coming over… I need a movie that says “I have great taste” but also “I won’t mind if we end up making out halfway through”",
        "content": "Hey r/movies, I need some help.\n\nMy crush is coming over for a movie night and I want something that hits the sweet spot — interesting enough to show I have great taste, but chill enough that it won’t be awkward if we get distracted halfway through. Nothing too intense or super emotional. Think cool, vibey, maybe a little flirty.\n\nSomething that says “I’m fun and effortlessly hot” without me having to say it.\n\nDrop your best recommendations — I’m relying on you all to save this night!",
        "upvotes": 2160,
        "comments": 2015,
        "media": null,
        "permalink": "/r/movies/comments/1lcm75u/my_crush_is_coming_over_i_need_a_movie_that_says/"
    },
    {
        "id": "1lc3qgs",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson &amp; Pamela Anderson",
        "content": "",
        "upvotes": 46707,
        "comments": 1946,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nuz4on7y547f1.jpeg?auto=webp&amp;s=113208f6df2d979633b6b51c2ca3269a3674643e"
        },
        "permalink": "/r/movies/comments/1lc3qgs/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lcs6l6",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'A Big Bold Beautiful Journey' Starring Margot Robbie and Colin Farrell",
        "content": "",
        "upvotes": 239,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z38qg8pxea7f1.jpeg?auto=webp&amp;s=37137751f93ae0717b58420d7b5b91939f4c5ef6"
        },
        "permalink": "/r/movies/comments/1lcs6l6/official_poster_for_a_big_bold_beautiful_journey/"
    },
    {
        "id": "1lce00i",
        "author": "RejectingBoredom",
        "title": "What’s your favourite “bad guy realises it’s over” moment?",
        "content": "Particular actors who really nail the facial expression of defeat in a movie. \n\nOne of my favourites is when Nichols sees Kimble walk into the conference at the end of The Fugitive, another is Charnier seeing the police cars at the end of The French Connection (even though the ending doesn’t actually pan out as you’d think). Mola Ram’s terror when Indy starts cutting the rope is another great one. \n\nJust those looks of abject “shit, I’m not supposed to go down like this” moments on a villain’s face that makes the ending so much more satisfying. \n\nI find in action movies there’s something really actually quite deflating and underwhelming about just killing the bad guy. It’s better when he knows he’s lost. ",
        "upvotes": 2642,
        "comments": 1916,
        "media": null,
        "permalink": "/r/movies/comments/1lce00i/whats_your_favourite_bad_guy_realises_its_over/"
    },
    {
        "id": "1lcv7yq",
        "author": "hamburglin",
        "title": "The build up to, and the practical werewolf suit of Underworld Evolution at 1:21 is legitimately impressive to this day",
        "content": "I go back to this scene every once in a while. It still gets me pumped. The werewolf's suit and presence is intense. The practical effect is still well beyond CGI in 2025. It feels real, strong and gritty.\n\nSadly, they didn't show him performing many power attacks. He's typically sitting there or running away. When he gets a one on one with the hybrid, he gets his head ripped off almost immediately in one of the most pathetic ways possible. I don't think most people were actually rooting for the hybrid there. He's just not interesting.",
        "upvotes": 147,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1lcv7yq/the_build_up_to_and_the_practical_werewolf_suit/"
    },
    {
        "id": "1lccmfg",
        "author": "Chewie83",
        "title": "Dialogue patterns that are common in movies but not real life",
        "content": "The single word without context that then gets clarified is one of the worst offenders.\n\n\"Geraniums.\"\n\"What?\"\n\"Those were her favorite flowers, geraniums.\"\n\n\"Slowly.\"\n\"What?\"\n\"When we kill him, we will kill him slowly.\"\n\nAnother trope is \n\"Not yet, child. Not yet.\"\n\n\"That'll do, pig. That'll do.\" (I like Babe though)\n",
        "upvotes": 2056,
        "comments": 752,
        "media": null,
        "permalink": "/r/movies/comments/1lccmfg/dialogue_patterns_that_are_common_in_movies_but/"
    },
    {
        "id": "1lcpd5p",
        "author": "FilmWaffle-FilmForum",
        "title": "Which two actors do you always mistake for each other?",
        "content": "Mine is Kurt Russell and Jeff Bridges. I can tell them apart if they’re both in front of me but every single time I see either of them in a movie, I have to search up the cast just to confirm I’m not confusing one with the other.\n\nIt doesn’t help that both of them are relatively similar in terms of what movies they star in, especially over the past 20 years. ",
        "upvotes": 141,
        "comments": 436,
        "media": null,
        "permalink": "/r/movies/comments/1lcpd5p/which_two_actors_do_you_always_mistake_for_each/"
    },
    {
        "id": "1lc5fxz",
        "author": "SigmarsChef",
        "title": "An in-universe dark web page for ‘28 YEARS LATER’ has been set up. Includes images and reports of what is happening in the UK after world governments have kept information about survivor communities &amp; the Infected classified including that the Rage Virus was pushed back out of Europe.",
        "content": "",
        "upvotes": 2530,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1lc5fxz/an_inuniverse_dark_web_page_for_28_years_later/"
    },
    {
        "id": "1lbzcrc",
        "author": "SiTheHandsomeGuy",
        "title": "What’s a great movie that completely bombed in theaters but found a cult following later?",
        "content": "I’m always fascinated by films that totally flopped at the box office but ended up becoming beloved classics or cult hits. Movies that maybe were ahead of their time, mismarketed, or just misunderstood.\n\nFor example, Children of Men didn’t do that great financially when it dropped, but now it’s constantly praised for its direction, themes, and cinematography. Same with Blade Runner, which got mixed reviews back in the day and now it's legendary. What are your favorite box office bombs that aged like fine wine? ",
        "upvotes": 5833,
        "comments": 4359,
        "media": null,
        "permalink": "/r/movies/comments/1lbzcrc/whats_a_great_movie_that_completely_bombed_in/"
    },
    {
        "id": "1lchbdt",
        "author": "Due_Flow7805",
        "title": "Requiem for a Dream (2000) is so good that I don’t want to watch it again anytime soon",
        "content": "I just watched this movie for the first time today. This movie is incredible. It walks a really fine line—on one hand, it’s one of the best films I’ve ever seen, but on the other, it’s so deeply disturbing that I probably won’t rewatch it anytime soon. It had me completely locked in from start to finish, and even after the credits rolled, I couldn’t stop thinking about it.\n\nIt’s not a horror film, but it’s terrifying in its own way—intense, unsettling, and filled with powerful scenes that stay with you. I highly recommend it, but only if you’re okay with emotionally heavy and confronting content.",
        "upvotes": 308,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1lchbdt/requiem_for_a_dream_2000_is_so_good_that_i_dont/"
    },
    {
        "id": "1lcsfjj",
        "author": "NoCulture3505",
        "title": "Glenn Close &amp; Billy Porter Join Cast Of Lionsgate’s ‘The Hunger Games: Sunrise On The Reaping’",
        "content": "",
        "upvotes": 36,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/auJ_kuPxgxu8pjUXCvkXzh7B9KAA8SGxuygLIQTUaR4.jpeg?auto=webp&amp;s=0f0c6a0ac62625ec2ab02cdf990d2e5e52391362"
        },
        "permalink": "/r/movies/comments/1lcsfjj/glenn_close_billy_porter_join_cast_of_lionsgates/"
    },
    {
        "id": "1lcfvox",
        "author": "Specific-Peanut-8867",
        "title": "What is the best example of a song in a movie that introduced an older song to a new generation?",
        "content": "I’m just trying to think of songs that have been in a movie soundtrack that were hits with a younger generation of people that were also popular when their parents were growing up\n\nI was inspired by the person bringing up best movie soundtracks I’m just curious… it can be for any generation, but I’m thinking specifically for people who are 30 years old now and younger\n\n",
        "upvotes": 340,
        "comments": 596,
        "media": null,
        "permalink": "/r/movies/comments/1lcfvox/what_is_the_best_example_of_a_song_in_a_movie/"
    },
    {
        "id": "1lcp6ko",
        "author": "Old_Marsupial_7080",
        "title": "What movie do you put on when you want to just smile and be entertained?",
        "content": "One of mine has to be Space Jam. As a nineties kid that movie never fails to make me forget about the world for awhile so I can relax. The same thing with The Mummy with Brendon Frasier. To me that is the perfect summer action movie. It had everything I loved as a kid Both those movies are a huge part of my life.",
        "upvotes": 50,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1lcp6ko/what_movie_do_you_put_on_when_you_want_to_just/"
    },
    {
        "id": "1lc8szh",
        "author": "MarvelsGrantMan136",
        "title": "Nicholas Galitzine Reveals First Photo as He-Man in Travis Knight's 'Masters of the Universe'",
        "content": "",
        "upvotes": 764,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RI3yuoSv3Cno1XhVrcQQymcYJcfRxOmzsqSigci8Mqk.jpeg?auto=webp&amp;s=225bbc06b174d2920787feb83edaac5045c3f1eb"
        },
        "permalink": "/r/movies/comments/1lc8szh/nicholas_galitzine_reveals_first_photo_as_heman/"
    },
    {
        "id": "1lcw2z5",
        "author": "Cage8k",
        "title": "What film coincidences have you noticed?",
        "content": "In 2005 and 2006 there were 4 mainstream movies that prominently featured penguins; March of the Penguins, Madagascar, Happy Feet and Surf's Up\n\nWhat other movie coincidences have you noticed that stood out to you? Do you believe they were just a simple coincidence? Or perhaps Hollywood was wanting us all to fall in love with penguins to distract us from something sinister??? \n\nCurious to know what you all think ",
        "upvotes": 18,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1lcw2z5/what_film_coincidences_have_you_noticed/"
    },
    {
        "id": "1lcqw7z",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Reminder - Raul Castillo, actor from Smile 2, Army of the Dead, Hustle, Looking, Knives Out, We the Animals, Wrath of Man, Unsane, Cha Cha Real Smooth, is doing an AMA/Q&amp;A in /r/movies today. It's live now, and he'll be back for answers at 11:30 AM ET.",
        "content": "",
        "upvotes": 28,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1us470uk3a7f1.jpeg?auto=webp&amp;s=139700686762246540a99848191634d7bf6e0471"
        },
        "permalink": "/r/movies/comments/1lcqw7z/amaqa_reminder_raul_castillo_actor_from_smile_2/"
    },
    {
        "id": "1lct0o6",
        "author": "aphaits",
        "title": "What movie do you wish for a sequel, even though its just a faraway dream?",
        "content": "For me its [Osmosis Jones](https://www.imdb.com/title/tt0181739/). So many elements that makes this movie great and feels like it should have sequels. So much fun ideas rolled into innuendos and both visual and word puns, you know, fun for kids, fun for parents.\n\n**Potential 1:** Returning cast, same actor and actresses as before, or same voice actors, either in the same \"body/city\" of Frank, or maybe a transfer to another body. Maybe a new city/person with different problems, new cast of characters, but combined with familiar characters. Love to see Bill Murray making a comeback or maybe a cameo, Chris Rock's fun voicing, and so many other iconic voice actors.\n\n**Potential 2:** The world-building has been established, time to push some more buttons. Maybe a weird flu thing is going on, everyone is kinda coughing, oh god what year is this? Basically if you already introduce the world's rules, time to change or break them in the sequels.\n\n**Potential 3:** Modern animation is experiencing a renaissance of stylized beauty and finding uniqueness, not just like every other realistic disney 3d movie. Time for some experimental looks that combine 2D and 3D like in the original movie, but ramping the style up and doing more style and fun than just realism.\n\nBut in general I wish that more interesting things in animation styles and fun weird movies like [Innerspace ](https://www.imdb.com/title/tt0093260/)to make a comeback. Half for nostalgia and half curious to see how old cool ideas splashed with modern visuals can be.\n\nAnyway, that's my wish for a sequel that will never be made other than in my head. What's yours?\n\nEdit: You guys are great, love reading the movie suggestions and comments.",
        "upvotes": 19,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RWPWy_roYXjMFCp50p4iA6nGlBrLb30fLCGSCPkjrQc.jpeg?auto=webp&amp;s=2b5f0d2c9bdebd84e2e3d3ad5867ede5f952dc76"
        },
        "permalink": "/r/movies/comments/1lct0o6/what_movie_do_you_wish_for_a_sequel_even_though/"
    },
    {
        "id": "1lcgpld",
        "author": "FreshmenMan",
        "title": "Are you glad Netflix is reviving Guillermo Del Toro's projects?",
        "content": "Question, Are you glad Netflix is reviving Guillermo Del Toro's projects\n\nYou know I just realized something after watching Del Toro's Frankenstein teaser (Which I am anticipating). This is the second time Netflix has revived a Del Toro project that most people thought he wasn't going to make.\n\nLet me explain, the first time Netflix has revived a Del Toro Project was Pinocchio. Since, 2008 Del Toro had been trying to get his Pinocchio project off the ground and originally, The Jim Henson Company &amp; Pathe were helping him produce the film and at one point, Daniel Radcliffe, Tom Waits, and Christopher Walken were considered for roles. However the film went into development hell and in November of 2017, Del Toro stated that the film was dead and no studio wanted to finance it until in 2018, Netflix revived the project.\n\nNow, Frankenstein is the next film that Netflix has revived. I somewhat did a post on this but In 2014, Del Toro mentioned that making Frankenstein was one of his dream projects and that he was trying to get this made for at least a decade. Well in the 2010s, Del Toro almost got to made Frankenstein with the backing of Universal Pictures. From what I read, Del Toro wanted to make his Frankenstein a 2 part film due to the complexity of the novel. However, the film was cancelled in large part due to Universal decided to go with the Dark Universe route. Now, The film has now been revived at Netflix in large part due to Pinocchio's success.\n\nI find it interesting and exciting that Netflix has revived 2 projects that Del Toro has tried to make but failed with other studios. With Del Toro I have an analogy of throw spaghetti at the wall and see what sticks as with him he has multiples projects he wants to do but they never stick with studios so he goes to the one that sticks with the studio.\n\nUltimately, I am glad that Del Toro is doing these projects that we wanted to make for so long and I hope he &amp; Netflix revived further projects (Like At The Mountain Of Madness or The Left Hand Of Darkness or any other project Del Toro wanted to make).\n\nAll in All, Are you glad Netflix is reviving Guillermo Del Toro's projects",
        "upvotes": 159,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1lcgpld/are_you_glad_netflix_is_reviving_guillermo_del/"
    },
    {
        "id": "1lcvltm",
        "author": "verissimoallan",
        "title": "The Brazilian Academy of Cinema has announced the nominees for the 2025 Grande Otelo Awards (the Brazilian Oscars). \"I'm Still Here\" leads with 15 nominations.",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vl3zRXHbtWeoRwUJf1TeKm1ALKe0DoUekewjdSHZVnU.jpeg?auto=webp&amp;s=fb66557dfd43c957c588f662f6f652f7fac9e1fd"
        },
        "permalink": "/r/movies/comments/1lcvltm/the_brazilian_academy_of_cinema_has_announced_the/"
    },
    {
        "id": "1lc61wp",
        "author": "TitShark",
        "title": "Secret life of Walter Mitty is so good",
        "content": "I know it’s a beloved film, but it seems like way too good of a movie for the lack of discussion around it. The blend of adventure, heart-warming humanity, humor, incredible cast and locations make for a truly immersive viewing experience. \n\nA fun aside is the amount of actors you now see in Severance that were in Mitty",
        "upvotes": 698,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1lc61wp/secret_life_of_walter_mitty_is_so_good/"
    },
    {
        "id": "1lcbzrt",
        "author": "Etiennebrownlee",
        "title": "Explain one of your favorite movies in just 3 words, and then let's guess the movie!",
        "content": "So this is kind of a movie recommendation but let's add some twist.. I'll try my best to guess them, and hope you guys can help out too. I happen to remember that 4 pics one word game, so why not 3 words one movie game? To be honest, I just have nothing left to do and Im kinda bored and this seems kind of fun way to check some great movies I could watch. 😅  ",
        "upvotes": 314,
        "comments": 2730,
        "media": null,
        "permalink": "/r/movies/comments/1lcbzrt/explain_one_of_your_favorite_movies_in_just_3/"
    },
    {
        "id": "1lchquz",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Danny Boyle - Tuesday 6/17 at 12:00 PM ET - Oscar-winning filmmaker of 'Trainspotting', 'Slumdog Millionaire', '28 Days Later, '127 Hours, '28 Years Later', 'Sunshine', 'Steve Jobs', 'Shallow Grave', 'Yesterday', 'T2 Trainspotting', and more.",
        "content": "",
        "upvotes": 131,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7srhp7ova77f1.png?auto=webp&amp;s=b58eb9beddb1881c45665c6841f4f525a318edf3"
        },
        "permalink": "/r/movies/comments/1lchquz/amaqa_announcement_danny_boyle_tuesday_617_at/"
    },
    {
        "id": "1lc65pq",
        "author": "mayukhdas1999",
        "title": "First Poster for Anders Thomas Jensen's 'THE LAST VIKING' starring Mads Mikkelsen - Anker is released after 15 years in prison. He teams up with his brother Manfred, who has memory loss, to find the buried money from their last heist",
        "content": "",
        "upvotes": 592,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ecplvz6xm47f1.jpeg?auto=webp&amp;s=2e0b587d4dc2443ed6ef23071e08550d9611abc7"
        },
        "permalink": "/r/movies/comments/1lc65pq/first_poster_for_anders_thomas_jensens_the_last/"
    },
    {
        "id": "1lcvqoz",
        "author": "Charming-Jicama764",
        "title": "Just finished watching City of Angels (1998)",
        "content": "As a person who deeply loves romantic comedy films, this was a huge shift to what I normally watch. The tragedy leads to the MLs self discovery is the best ending I could ever ask for. And the way he looks at Maggie, I am in awe! The film was not rushed, it's just the right amount of everything. Although Maggie was quite a red flag, I think she's only lookin for something genuine and sincere, especially the fact that he's in the medical field where emotions were disregarded. Overall, it gave me a good cry that I really need at the moment. Also, I cannot hear Iris by Goo Goo Dolls the same way again.\n\nThis is my first time posting here, but I really just can't contain the emotions that I currently have lol. (Also, I am quite aware Seth was kinda a creep during the first library scene haha)",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1lcvqoz/just_finished_watching_city_of_angels_1998/"
    },
    {
        "id": "1lcj1iv",
        "author": "entench0123",
        "title": "Monkey Man - incredible movie",
        "content": "I just watched it this weekend. Holy wow. Why has this movie not got as much praise? Sure it’s brutal, but the blending of sectarian violence, politics, the struggle for the poor, transgender rights, and over all struggle for power. Dear god, it’s so good. \nHas anyone felt this movie deserves more praise or something? ",
        "upvotes": 71,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1lcj1iv/monkey_man_incredible_movie/"
    },
    {
        "id": "1lcfo7e",
        "author": "BunyipPouch",
        "title": "First Poster for Australian Folk-Horror 'The Banished' - After her brother mysteriously goes missing, Grace ventures into the dangerous wilderness to find him. As she uncovers the horrific truth of his disappearance, she is faced with a darkness which threatens to claim her as well.",
        "content": "",
        "upvotes": 130,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6bbd472hr67f1.jpeg?auto=webp&amp;s=896fa2f4f9f534e5e9defec2f7c8dbdac2f9edad"
        },
        "permalink": "/r/movies/comments/1lcfo7e/first_poster_for_australian_folkhorror_the/"
    },
    {
        "id": "1lcw8az",
        "author": "icrackracquets2",
        "title": "Shadow of a Doubt (1943)",
        "content": "I am a big movie buff but have had a bit a blind spot regarding Hitchcock.  I have seen the big ones of course (Psycho, Rear Window, Vertigo, The Birds), but the bulk of his filmography I have been largely ignorant of.  I've started to rectify that by watching his movies from start to finish.\n\nI'm up to Lifeboat which I'm watching now.  What confuses me is Shadow of a Doubt.  One of the best critically and commercially.  Not to mention considered his best film by Hitchcock himself.\n\nMAJOR SPOILERS\n\nHere is my opinion of the movie.  It felt to me that uncle charlie tipped his hand and basically came right out and said that he was the murderer very early in the movie.  Therefore there was very little suspense for 3/4 or 2/3 of the movie because we already know that he's the bad guy.  Considering the name of the film I would have expected some actual doubt.  And then the last third of the movie he is straight up just trying to kill female Charlie.\n\nCan anyone explain this to me?  Am I just an ignorant millennial who didn't understand the nuance?\n\nEDIT: Also, was it just me, or were there some seriously weird sexual undertones to the charlies' banter in the first act?\n\nAnd then there's the 35 year old male detective proposing marriage to the 17/18 year old high school student after 2 days of knowing her. Although that's no fault against Hitchcock, that's simply endemic of movies of this time",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lcw8az/shadow_of_a_doubt_1943/"
    },
    {
        "id": "1lc819b",
        "author": "HallPsychological538",
        "title": "Longest opening credits— Is it The Fugitive?",
        "content": "The Fugitive opening credits start immediately and go to about 14 minutes 50 seconds into the movie with a big gap between the DP and co-producer credits.\n\nAnything longer?\n\nLooking for actual opening credits. So Tarantino waiting until the end credits to put directed by wouldn’t count.\n\nAlso not interested in movies that wait to start the credits, like James Bond movies.",
        "upvotes": 258,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1lc819b/longest_opening_credits_is_it_the_fugitive/"
    }
]