[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hdxppq",
        "author": "MechanicalKiller",
        "title": "I think Carry On was amazing",
        "content": "They somehow made a movie about a TSA agent pretty entertaining. I thought it was similar to The Guilty starring Jake Gylenhall. \n\nJason Bateman is… Jason Bateman who basically plays himself a lot in these drama’s, similar to his role in Ozark.\n\nThe Car Action scene was so cool and well choreographed (camera work and fight)\n\nIf your looking for something entertaining tonight or over the weekend, I’d give it a shot.\n\n\n\n",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hdxppq/i_think_carry_on_was_amazing/"
    },
    {
        "id": "1hcrn8m",
        "author": "AccurateInflation167",
        "title": "Netflix ‘walking back’ one-year parental leave after too many workers take year off",
        "content": "",
        "upvotes": 5329,
        "comments": 531,
        "media": null,
        "permalink": "/r/netflix/comments/1hcrn8m/netflix_walking_back_oneyear_parental_leave_after/"
    },
    {
        "id": "1hdz4b0",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix recently removed the \"Coming Soon\" label from the 'You' homepage leading to rumors that the season is delayed ",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdz4b0/netflix_recently_removed_the_coming_soon_label/"
    },
    {
        "id": "1hduaf5",
        "author": "Rainbow_Vortexx",
        "title": "Cartoon Show Cars",
        "content": "i’m looking for a not toddler but younger cartoon show where the plot of the story is about people that control toy cars and this show was previously removed off of netflix.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hduaf5/cartoon_show_cars/"
    },
    {
        "id": "1hduasi",
        "author": "fyrefl1es",
        "title": "Netflix blocking: what does it look like?",
        "content": "Netflix mysteriously stopped working at my local gym. Its saying I'm not connected to a wifi but I am.  Fast, speedofme, etc shows 60down, 50up.  Youtube still works.  \n\nSo the questions ate: what does netflix do when a network blocks that app or parts of that app that allow streaming?  What does it look like when public wifi somehow triggers Netflix's safety measures?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hduasi/netflix_blocking_what_does_it_look_like/"
    },
    {
        "id": "1hdk455",
        "author": "mari_xoxo",
        "title": "Jentry Chau vs the Underworld | Official Trailer | Netflix",
        "content": "i just finished “jentry chau vs the underworld” it’s new to netflix , it’s sooo good if your looking for something new (and animated) to watch then watch jentry chau , \n\nit’s about a 16 year old chinese-american girl who lives in happily in seoul until she has to go back to her hometown where she once lived as a child , a small town in Texas because she is being hunted by demons. Now she has to balance highschool life , relationships , friendships while trying to stop the demon’s that’s coming after her “ all while having fire powers” i really recommend it! ",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hdk455/jentry_chau_vs_the_underworld_official_trailer/"
    },
    {
        "id": "1hd4w9g",
        "author": "IamVBull",
        "title": "Is Lost worth a watch if you are going in completely blind?",
        "content": "I know absolutely nothing about the show, aside from the fact it's considered to have one of the worst endings in Television history. Knowing this, is Lost still worth a watch?",
        "upvotes": 134,
        "comments": 206,
        "media": null,
        "permalink": "/r/netflix/comments/1hd4w9g/is_lost_worth_a_watch_if_you_are_going_in/"
    },
    {
        "id": "1hdvris",
        "author": "Ordinary_Set6499",
        "title": "Carry On",
        "content": "If the Hallmark Channel made an action movie, this would be it. I feel that I should get at least a one month membership discount for the 1 hr 45 min it took from my life 😆",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hdvris/carry_on/"
    },
    {
        "id": "1hdf7co",
        "author": "XOXITOX",
        "title": "A New King is Born",
        "content": "\nThe Kings of Tupelo was entertaining from beginning to end. Not since the Tiger King has a Netflix docu-series been so.. bizarre. \n\nBut unlike Tiger King, this is a true crime. A campy, real life, Elvis true crime story. \n\nI can’t explain what happened, just tell you it’s one of the great American odd ones. This tall tale from Tupelo really made my day. I laughed my ass off. Justice did prevail. And I think you’ll get a kick out of it. An Elvis high kick. He-yuah!\n\nMost importantly, these Elvis impersonators reminded me that the King lives. And for that I love them. ",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdf7co/a_new_king_is_born/"
    },
    {
        "id": "1hdvbyc",
        "author": "LittleShinyRaven",
        "title": "Thumb ratings missing",
        "content": "Did a search and didn't see any other posts. I rate shows mostly to remember that I've watched some of them already. I noticed some of the holidays movies/shows I watched last year that I know I rated are missing my ratings. Is this a system error or on purpose? Anyone else have this issue?\n\nI still see them and can rate again so the thumbs themselves aren't missing to clarify.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdvbyc/thumb_ratings_missing/"
    },
    {
        "id": "1hdtocf",
        "author": "NestingBun",
        "title": "Netflix and Safari Issue on MacBook Pro",
        "content": "I've noticed that when I use Safari to watch Netflix, the red \"watched\" bar is not showing after watching episodes of shows. I only see a \"watched\" bar on the first episode of each season, but not on any other episode. \n\nI don't have this problem with Chrome. But I've been trying to get away from using Chrome and am hopeful for a solution to watch Netflix on Safari. \n\nAny suggestions are appreciated!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdtocf/netflix_and_safari_issue_on_macbook_pro/"
    },
    {
        "id": "1hdtcgp",
        "author": "Avault-Vorce",
        "title": "The Best Series",
        "content": "I recently found a Netflix show called If My Wife Became an Elementary Student. It’s a live-action version of the anime, and I kind of regret watching it because every episode made me cry. The show was a bit awkward at times, but I couldn’t stop myself from getting emotional. It’s so sad that it only has 10 episodes. I can’t stop thinking about it, and I really hope they make a continuation.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdtcgp/the_best_series/"
    },
    {
        "id": "1hdsugp",
        "author": "Sudden_Pop_2279",
        "title": "THE AMAZING DIGITAL CIRCUS - Ep 4: Fast Food Masquerade, is out on YouTube and Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdsugp/the_amazing_digital_circus_ep_4_fast_food/"
    },
    {
        "id": "1hdqwyb",
        "author": "BattyBr00ke",
        "title": "How can I fix this? ",
        "content": "A new movie came to Netflix today and it was nowhere in my suggested watching or newly added until I searched for it. I feel like I'm missing a lot of things I would watch because they don't show up in these categories on my homepage, but what does show up on my homepage are things I would never watch, particularly foreign films where I have to read subtitles. Don't get me wrong, there are wonderful foreign films, but I have to read a computer screen all day for work, so it's really not what I'd like to do in my spare time, not even to enjoy a film that may be worth watching. How can I change the algorithm, I guess you would call it, for Netflix to better suit me?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdqwyb/how_can_i_fix_this/"
    },
    {
        "id": "1hdc1rv",
        "author": "Pogrebnik",
        "title": "Netflix's Colombian Series Spurs Economy",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hdc1rv/netflixs_colombian_series_spurs_economy/"
    },
    {
        "id": "1hdgu48",
        "author": "Rabbidraccoon18",
        "title": "Just finished watching Girl Haunts Boy and it was surprisingly good! ",
        "content": "The movie definitely made me feel something. I thoroughly enjoyed watching it. It was pretty short and simple but I guess that made it even more effective. The ending was really bittersweet but I like it because it felt like it was something different if that makes sense. What do y'all think? Did y'all like it?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdgu48/just_finished_watching_girl_haunts_boy_and_it_was/"
    },
    {
        "id": "1hcyzwt",
        "author": "RainH2828",
        "title": "Will someone watch a movie with me?",
        "content": "   I’m feeling lonely tonight and I just want to be able to feel like I have some companionship tonight. Would anyone be willing to watch the same movie at the same time with me? Or if someone knows of a watch party thing we can do? We could do a tv show like Ultimatum or something that, too, so we can gossip about it over reddit PMs while we watch. I genuinely have no friends in person to invite over and my health has been iffy so if I had friends to come over, I’d feel awkward and just don’t want to deal with the social anxiety attached. Anyone? ❤️",
        "upvotes": 67,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hcyzwt/will_someone_watch_a_movie_with_me/"
    },
    {
        "id": "1hdbnt9",
        "author": "balloontrap",
        "title": "Thoughts on “One Hundred years of Solitude”",
        "content": "\n \nI’ve recently come across screen adaptation of Gabriel García Márquez’s masterpiece One Hundred Years of Solitude, and I can’t stop wondering how this incredible novel will translate to the screen. it’s a dense, multi-generational saga filled with magical realism, complex characters, and deeply rooted cultural nuances.\n\nFrom what I’ve read, Márquez’s family is involved in the production, and it seems Netflix is taking the helm. This gives me hope that they’ll preserve the integrity of the novel. Still, I’m left with so many questions about how they’ll approach this:\n\n\t•\tis it be a faithful adaptation or a more modern reinterpretation?\n\t•\tHow will they tackle the intricacies of the Buendía family tree without overwhelming viewers?\n\t•\tCan the magical realism elements—like the rain of yellow flowers or Remedios the Beauty’s ascension—be done justice on screen without losing their surreal, poetic essence?\n\t\n\nFor those of you have read it,  what do you think. Are there particular scenes or themes you’re especially excited about. I’m curious to hear everyone’s thoughts—especially from those who hold this book as dearly as I do. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdbnt9/thoughts_on_one_hundred_years_of_solitude/"
    },
    {
        "id": "1hdb6rs",
        "author": "korucraftstudios",
        "title": "Does anyone know what this means?",
        "content": "https://preview.redd.it/f2vjmqhp0m6e1.jpg?width=1405&amp;format=pjpg&amp;auto=webp&amp;s=aa991debbb1165471bd27d57e3954a526d7831b9\n\nThere’s a show coming soon on Netflix (new season), and there‘s some kind of countdown with a bell close to it (that is wrong and goes the other way around, every second the timer increases). Does anyone know what it means?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdb6rs/does_anyone_know_what_this_means/"
    },
    {
        "id": "1hdc8fv",
        "author": "TimesandSundayTimes",
        "title": "Netflix’s Black Doves — the truth about female spies. Television is catching up with the reality of women in espionage, says intelligence expert Gordon Corera",
        "content": "",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdc8fv/netflixs_black_doves_the_truth_about_female_spies/"
    },
    {
        "id": "1hdbnf9",
        "author": "eyehateredd1t2",
        "title": "Would House of Ninjas have had its second season announced by now if it was going to be? Or is it likely to have been cancelled because it hasn't?",
        "content": "I thought it was ok, good, not bad, but a little bit meh on the first watch through with some great points throughout it. But on a second watch I see finer detail and how it's just a perfect masterpiece of mavenry. It's well acted, directed, and it subverts expectation just the right amount. It doesn'st just follow a formulaic stereotypical form, it choose art. The creative choices are immaculately chosen and it's all so cleverly pulled together\n\nThe way they could have had a basic main character family ninjas working against just basic non-ninja criminals who posed no real threat back to them but they chose a rival and powerful ninja clan was a stroke of genius, it's so much more suspenseful, for them to have an equal footed enemy, rather than some easy target non-ninjas who they could basically have no fear or pushback from.\n\nSPOILER\n\nThe brainwashed, working for the enemy, returned from the dead brother also a great plot choice. What's so great about it, is that ninjas are mythically renowned for mind control... and in this show *they actually do it*! It's just so great. Again it's a complex and sophisticated plot point which you wouldn't expect and enriches the series so much because it makes your eyes go wide with amazement that the plot could be so out of the ordinary hum drum typical show\n\nThe enemy leader of the Fuma, the 19th... man, just one of the coolest most amazing, breathtakingly cool characters I've ever seen in any kind of tv show or film. On the surface he may seem dull or uninteresting. His composure is inconceivably strong. But never once does he raise his voice in anger, or show the slightest hint of fear, worry, panic, he emanates so much intelligence due to how calculated and prepared he is for every single situation and scene. He is too smart and too clever to ever be caught out or unprepared for anything. He's the most perfect villain I've ever seen. He lets the good guy go free, he gives him the flower, he doesn't even care, he's too confident and it's so unexpected\n\nThe cat Hanzo is amazingly adorable and they didn't overdo it with excessive focus on it, so tastefully allotted in its screen time. Small doses but just enough\n\nI could go on but I have things to do",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdbnf9/would_house_of_ninjas_have_had_its_second_season/"
    },
    {
        "id": "1hclqqm",
        "author": "techfinpro",
        "title": "Christina Applegate Experienced “First Sign Of MS” While Filming ‘Dead to Me’ Pilot",
        "content": "",
        "upvotes": 109,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hclqqm/christina_applegate_experienced_first_sign_of_ms/"
    },
    {
        "id": "1hd2ruo",
        "author": "whatabouterysupreme",
        "title": "The Diplomat season finale!!",
        "content": "Just saw the The Diplomat S2 finale and what an ending. Won't give out any spoilers unless there's discussion, but Hal's just wild man. There's so many things he could have done wrong, but this was crazy!",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hd2ruo/the_diplomat_season_finale/"
    },
    {
        "id": "1hd59xq",
        "author": "Complex-Fly-9782",
        "title": "Can you Suggest me some best horror psychological thriller/survival movies on Netflix? Need some best movies or series. Kindly suggest me. ",
        "content": "Hey guys.i hope you are doing well. I'm looking for some best horror psychological thriller / survival movies. I'm feeling bored and need some best movies or series. Please suggest me. Take care :) ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hd59xq/can_you_suggest_me_some_best_horror_psychological/"
    },
    {
        "id": "1hdbfmg",
        "author": "Gorillamonday",
        "title": "Did Netflix change their payment policy with gift cards?",
        "content": "I was taking a break from Netflix for a few months and now I am back. I usually do a gift card for a fixed amount and just let it run out if I don't plan to renew. In the past, Netflix would tell me when my membership expires, with a date. This time I see a dollar amount balance instead of a date.\n\nIt seems like they are trying to deduct the monthly fee and it would leave a remaining balance eventually. Would that force me to either buy another gift card or enter a credit card number to pay the difference? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdbfmg/did_netflix_change_their_payment_policy_with_gift/"
    },
    {
        "id": "1hcll1p",
        "author": "peoplemagazine",
        "title": "Netflix Star José de la Torre Dies at 37, Months After He Was Reportedly Diagnosed with a 'Serious Illness’",
        "content": "",
        "upvotes": 57,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hcll1p/netflix_star_josé_de_la_torre_dies_at_37_months/"
    },
    {
        "id": "1hcpigq",
        "author": "Simpleton_5654",
        "title": "Kings of Tupelo? ",
        "content": "Anyone else watch this and spend the entire time becoming increasingly frustrated with how frustrating these people are? I don't know, what did you guys think? ",
        "upvotes": 32,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1hcpigq/kings_of_tupelo/"
    },
    {
        "id": "1hd0f2l",
        "author": "Jelly_Jess_NW",
        "title": "The Blue Drum? Short? ",
        "content": "I am so frustrated that that was on the recommendation row as a stand alone show. \n\nI really Hope the direction we are going is not all 15-20 minute shorts. That one barely even had a story in it. \n\nDid anyone watch this, and I over reacting? It just want good and felt like a waste of time. ",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hd0f2l/the_blue_drum_short/"
    },
    {
        "id": "1hd9o3i",
        "author": "Choki2222222",
        "title": "2 Profiles, Same TV, Different Content",
        "content": "Hi! \nSomething weird happened. \nWe use Netflix on our TV at home and we have two profiles within one account. \nToday I noticed that the series I am watching in my profile disappeared (and the whole “Continue watching” section too) but they are still available when I switch to the second profile?!\nHow is this possible and how can it be fixed? \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hd9o3i/2_profiles_same_tv_different_content/"
    },
    {
        "id": "1hdkmzx",
        "author": "TheMirrorUS",
        "title": "Netflix drops 50-year adaptation of 'one of the best books ever written'",
        "content": "",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1hdkmzx/netflix_drops_50year_adaptation_of_one_of_the/"
    }
]