[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 77,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lvsll9",
        "author": "grasskisser",
        "title": "Netflix cancels The Residence",
        "content": "I just read this and I am so upset! I really enjoyed this show, so did everyone else I know who watched it. It was about a murder in the White House, and it really kept me guessing the whole time. Cordelia  Cupp, a modern day Columbo, and bird watcher was riveting!  I am so sad because Netflix, in my opinion, does this with so many shows. I wish they would at least commit and do less shows for production. They have so much junk on the platform that is no good, but this was, it really was! Tell me what you ladies and gentleman think below. Am I the only one? I would love to hear your thoughts. ",
        "upvotes": 208,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1lvsll9/netflix_cancels_the_residence/"
    },
    {
        "id": "1lvzgbo",
        "author": "MaxwellSmart07",
        "title": "Nominations for the worst series currently playing on Netflix?",
        "content": "I’ve seen a lot of losers, well actually I’m mostly on Reddit while my wife watches. Currently she is watching Blindspot, a ridiculous the world’s going to blow up every day FBI drams (um, farce). That’s my nomination. Any others anyone wants to warn me about. Thanks.",
        "upvotes": 30,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzgbo/nominations_for_the_worst_series_currently/"
    },
    {
        "id": "1lvg8bt",
        "author": "Darkstar_111",
        "title": "The Sandman season 2 is... Actually really good!",
        "content": "Hate to say it, considering the allegations against the creator is harsh and serious. But the second season is better than the first. It feels carefully crafted, the actors are giving us a nuanced rendition of impossible characters and every episode flows by... Like a dream...\n\nSorry, had to go there. 🤭",
        "upvotes": 124,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1lvg8bt/the_sandman_season_2_is_actually_really_good/"
    },
    {
        "id": "1lw6nfm",
        "author": "No_Gold_4554",
        "title": "Building The Band",
        "content": "The first four episodes were great television. It was the singers voting for each other (that's what they want us to think anyway) and they were forming groups of their own fill. But watching the trailer, it would inevitably devolve into an x-factor style show where it's all about the judges and the judges making up non-sensical advice for the drama. \n\nI wish there were more english talent shows that are not centered around the celebrity judges.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw6nfm/building_the_band/"
    },
    {
        "id": "1lw1o24",
        "author": "ArtisticCod9367",
        "title": "Is the performance order on Building the Band (Netflix) unfair to later contestants?",
        "content": "I’ve been watching Building the Band on Netflix, still on EPISODE ONE LOL and I noticed something that feels a little off. Each contestant performs one by one in to the group of 50, and people are eliminated as the performances go on.\n\nSo here’s my question: doesn’t this give an unfair advantage to contestants who perform later?\n\nFor example, if contestant #3 performs, they’re being judged while all 50 people are still technically in the running. But by the time contestant #40 goes up, a bunch of contestants have already been eliminated, so there are fewer people to compete with or be compared to. That feels like an uneven playing field.\n\nHas anyone else noticed this? Is there something I’m missing in how the voting or eliminations work that makes it fair? Curious what others think.\n\nOr should I just wait and it will seems clearer later?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lw1o24/is_the_performance_order_on_building_the_band/"
    },
    {
        "id": "1lw3x3t",
        "author": "LightZapper",
        "title": "Building The Band Thoughts",
        "content": "I am currently on Episode 4 right now, and wanted to hear everyones opinion on the current bands formed. \n\nBand 4: Mason, Conor, Shane, and Zach I feel has a lot of potential for the standard pop band. Alone I felt Conor was the strongest so far, maybe the first performance song just fit his voice best but when they came in together the harmonies were out of this world. It almost reminded me of one direction when they came together they blended amazingly together for their first performance. Id love to hear others thoughts on the current bands. \n\nBand 2: Landon, Shade, Malik, and Bradley could be an amazing soul/R&amp;B group and I see the potential, loved their auditions and could definitely see them going far!! \n\nBand 1: Donzell, Aaliyah, Cameron, and Katie I dont have too many thoughts on this first group but they had have a lot of powerful voices here and im interested in seeing what direction this group heads in\n\nBand 3: Nori, Wennley, and Brianna \nI think this group needs a fourth, but were quick to rush and form a three piece. It feels like something is missing or out of place to blend all their voices together\n\nOne more band is currently forming but Id love to hear everyones opinions so far! ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lw3x3t/building_the_band_thoughts/"
    },
    {
        "id": "1lw5a7a",
        "author": "Confident-Dinner8409",
        "title": "The society",
        "content": "I just finished watching the society and I am absolutely devastated that there is no season 2. I am so fussy with shows and this one captivated me. \n\nIs there anyway fans can somehow show Netflix we want another season? \n\nI am so sad, I NEED to know what happens. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5a7a/the_society/"
    },
    {
        "id": "1lw7hy6",
        "author": "Fun_Molasses5215",
        "title": "Netflix announces that season 10 of Queer Eye will be the final one",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw7hy6/netflix_announces_that_season_10_of_queer_eye/"
    },
    {
        "id": "1lw7cuu",
        "author": "Indoril-Nerevar337",
        "title": "Daniel Craig Returns in New Sneak Peek at “Wake Up Dead Man,” the Next Knives Out Mystery",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw7cuu/daniel_craig_returns_in_new_sneak_peek_at_wake_up/"
    },
    {
        "id": "1lvl51z",
        "author": "buildingthebandnews",
        "title": "Building The Band premiered on Netflix tonight!",
        "content": "What was everyones thoughts? would love to know your favourite performances, who you loved, who you hated, best/worst bands formed?! my only disappointment was no Liam Payne in the first drop of episodes. I did love the tribute they did tho &lt;3",
        "upvotes": 23,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1lvl51z/building_the_band_premiered_on_netflix_tonight/"
    },
    {
        "id": "1lw6nzo",
        "author": "UhmMrSmthIg",
        "title": "Is there some way or a place to watch all seasons of Squid Games without Netflix?",
        "content": "I want to watch seasons 1-3 of Squid Games, but don't have Netflix, is there some website (like Dailymotion) that lets you watch it for free? A Discord server that provides Netflix content, such as Squid Games?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lw6nzo/is_there_some_way_or_a_place_to_watch_all_seasons/"
    },
    {
        "id": "1lw5ujn",
        "author": "S4v1r1enCh0r4k",
        "title": "Global Webtoon Sensation Heads to Netflix as Live-Action Series",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5ujn/global_webtoon_sensation_heads_to_netflix_as/"
    },
    {
        "id": "1lv8tec",
        "author": "ironfalafel",
        "title": "I'm Convinced Old Guard 2 story was created and mostly written by AI, and that's why it sucked.",
        "content": "Title says it all. To wait five years for a sequel to such an original story sucked as it is, but to then receive what we got as the final product was just a slap in the face to the audience. \n\nThe entire premise seemed like it was generated using AI along with the script. Everything was just so choppy and the movie felt like it had absolutely zero substance to it. \n\nI'd almost rather pretend we never got a sequel at all. ",
        "upvotes": 143,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1lv8tec/im_convinced_old_guard_2_story_was_created_and/"
    },
    {
        "id": "1lw32zc",
        "author": "proactive-mind",
        "title": "Zero Day — A Masterpiece on Truth, Fear, and Power (And Why It Deserves More Credit)",
        "content": "\n\nJust finished *Zero Day* and I’m honestly blown away. Before anything else, I want to highlight the minds behind it:\n\n* **Noah Oppenheim** – former president of NBC News and Oscar-nominated screenwriter (*Jackie*)\n* **Michael S. Schmidt** – Pulitzer Prize-winning journalist from The New York Times\n* **Eric Newman** – producer of *Narcos* and *Children of Men*\n* **Lesli Linka Glatter** – directed all 6 episodes (she’s known for *Homeland*)\n\nThese are not just Hollywood names. These are people who’ve worked inside media, politics, and truth itself. And it *shows*.\n\n*Zero Day* isn’t just a political thriller. It’s a reflection of our time: how fragile the truth has become, how fear spreads faster than facts, and how power is often invisible. Whether “Proteus” is real or not is almost beside the point—what matters is *what people believe*, and what happens when everyone has their own version of reality.\n\nI get why some viewers (like my girlfriend 😅) found it slow or hard to connect with—it’s not action-packed, and it doesn’t hold your hand. But for those who pay attention to current events, politics, or media—it’s almost *too real*.\n\nThis show hit me hard. It made me question not just the plot, but how much of what I see every day is filtered, manipulated, or designed to confuse. And that’s powerful storytelling.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw32zc/zero_day_a_masterpiece_on_truth_fear_and_power/"
    },
    {
        "id": "1lviehl",
        "author": "gamerz0111",
        "title": "(Squid Game S3 spoilers) Anyone else disappointed with these two plot threads?",
        "content": "[I really thought Seong Gi-hun’s commando subplot was building up to something big — like a major action set piece once they reached the island. But instead, they got mowed down like fish in a barrel, and we were left with two guys who barely contributed to anything.](https://squid-game.fandom.com/wiki/Seong_Gi-hun#articleComments)\n\nThen there was the former North Korean soldier subplot, which felt like it belonged in an entirely different show. It barely intersected with the main characters or the core storyline. After all that gunfire, are we really supposed to believe the Front Man didn’t notice a thing?",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lviehl/squid_game_s3_spoilers_anyone_else_disappointed/"
    },
    {
        "id": "1lvgc71",
        "author": "ToonAdventure",
        "title": "Wednesday: Season 2 | Official Trailer | Netflix [July 9 at 5:58 AM PT]",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lvgc71/wednesday_season_2_official_trailer_netflix_july/"
    },
    {
        "id": "1lw5m4o",
        "author": "iDawn18",
        "title": "Netflix on iOS 12 not working",
        "content": "I use my old iPad to watch Netflix and I couldn't watch anything because it gave me a connection error, I restarted and it didn't work so I deleted the app and downloaded it again and now I can't even log in, any solution?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5m4o/netflix_on_ios_12_not_working/"
    },
    {
        "id": "1lvzwvm",
        "author": "at1991",
        "title": "Mr. Robot, captions done match and music doesn't at times.",
        "content": "Kinda annoyed they changed some of the music. I watch with captions and they changed a OutKast song.....changed the word r.kelly (which was a more appropriate reference) to \"more but than an ashtray\" I understand copyrights but still it's part of the art. End of rant. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzwvm/mr_robot_captions_done_match_and_music_doesnt_at/"
    },
    {
        "id": "1lvzvsp",
        "author": "SWSenthusiast",
        "title": "Can't watch Squid Game???",
        "content": "I keep getting an error that says \"This title is not available to watch instantly. Please try another title.\" whenever I try to open an episode of Squid Game.\n\nI'm able watch The Sandman, The Double, Castlevania, and everything else on my list. Is anyone else having this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzvsp/cant_watch_squid_game/"
    },
    {
        "id": "1lvztcg",
        "author": "Dangerous_Phase_299",
        "title": "show recommendations",
        "content": "My little sister (11f) is going to a soccer camp tomorrow and needs some show recommendations. She has been obsessed with Stranger Things, but that's not the best option because she's going to be away from home and sharing a room with another kid, so we don't want to worry abt nightmares for either of them. Do you have any show or movie recommendations? preferably PG, but PG-13 is okay. Thanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvztcg/show_recommendations/"
    },
    {
        "id": "1lv80xo",
        "author": "greenhierogliphics",
        "title": "Animal kingdom no stopping",
        "content": "This series started kind of slow to me, but once it got rolling there’s just no stopping. I need to get to bed, but I NEED to see what’s going to happen next! On season 2 beginning episode 6. ",
        "upvotes": 50,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lv80xo/animal_kingdom_no_stopping/"
    },
    {
        "id": "1lvi53t",
        "author": "S4v1r1enCh0r4k",
        "title": "Jenna Ortega Is Back and Darker Than Ever in 'Wednesday' Season 2 Trailer",
        "content": "",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lvi53t/jenna_ortega_is_back_and_darker_than_ever_in/"
    },
    {
        "id": "1lvw01k",
        "author": "Desperate-Pin9777",
        "title": "Recommendations",
        "content": "I’ve watched many series so far I loved loved squid game, money heist, all of us are dead. So you people know my taste then. Can you guys recommend me any similar series? 🎀",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvw01k/recommendations/"
    },
    {
        "id": "1lvmonh",
        "author": "M_M_2",
        "title": "Is Mr robot on Netflix ?",
        "content": "I live in Lebanon, I've been waiting for Mr robot to come back on Netflix and I've been seeing people finding the series on Netflix, it says on the internet that it comes back on July 3 and i still don't have it.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lvmonh/is_mr_robot_on_netflix/"
    },
    {
        "id": "1lvveq0",
        "author": "mebcbb",
        "title": "Resolution decreasIle? mobile?",
        "content": "It's seems that Netflix is decreasing video resolution when viewing on mobile. Sometimes I like to watch higher resolution but it forces me to watch lower quality.  Has anyone else noticed this? Do you know what they are doing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvveq0/resolution_decreasile_mobile/"
    },
    {
        "id": "1lw2cs9",
        "author": "PaintComprehensive58",
        "title": "UNPOPULAR OPINION: I don't like Rumi and Jinu (also the ship)/Other opinions",
        "content": "Introduction: I originally had a very high expectations for this movie but it turned out just to be kinda boring like what I have thought. These are just my opinions not rage bait. You guys can tell me yours in the comments section.\n\n\nRumi: I originally thought that Rumi would be a level-headed leader. But sadly, after I have rewatched the movie over and over again, Rumi became kinda lovesick after meeting Jinu? At first, she hated Jinu like she hates all demons including herself. She wanted to kill him multiple times, e.g the fight in the bathhouse, the first meeting on the rooftop. But I don't know why she immediately felt so sympathetic towards Jinu. Because Jinu is working for Gwi-Ma and we don't know if he's tricking her or being truthful. \n\nAnother reason that I don't really like Rumi is because of how she treats her friends. I know she has her reasons of not telling her friends about her demon marks. However, I honestly think that Mira and Zoey won't even think it's a big deal. Because during the conversation, Rumi couldn't explain herself and Mira said \"You were hiding this from us? The whole time?\" According to this sentence, I think she was just disappointed and hurt because as we all know Mira wants honesty from her friends because of her insecurities. And when Rumi revealed that she was working with Jinu, Zoey said \"Jinu? You're working with him?\". I think this is just normal reaction as everyone will react this way when they find out their close friend is literally hanging out with their enemy.\n\nThe writers didn't include how the girls met and how they were selected to be demon hunters. And we also don't know anything about their dynamic. So it's really hard for me to sympathize with Rumi as if Mira and Zoey are friends with Rumj for years, I don't think they would mind.\n\nJinu: I know many people will defend him maybe because of his good looks. But in reality, he's the BIGGEST Red Flag in all animation. First, he abandoned his own family to escape his miserable life. And after watching the Korean Comic video, it's even more stupid. Jinu knew he doesn't have the talent of performing music. Then, why would he do so? And his face is literally his biggest advantage and I think he could use this to lure rich women to marry him. I know this is quite evil but I think this is more reasonable. \n\nSecond, he tricked Rumi and lied to her. He used Rumi's fear to his advantage and exposed her secret to her friends and humiliated her in front of her fans. And the saddest thing is how Rumi still thought what they had was real and Jinu told her all that was a lie and just to gain her trust. \n\nSo that's why I am the only one who didn't cry when Jinu sacrificed himself for Rumi as I think it's the bare minimum to fix all his mistakes. And I think logically, Rumi wouldn't still love him. But after I see a lot of reels of this ship, I became hopeless.\n\nMira and Zoey: These two girls are my absolutely favorite besides from Bobby. They have interesting backstories, like Mira was born into a wealthy family but couldn't fit in, Zoey is a people pleaser and thinks she's too much. I think these two girls are more relatable so I enjoy them being on screen, even though they are there for a few minutes.\n\nBobby: Bobby is a absolute sweetheart and very kind to three of the girls. And it's interesting to go deeper of why he became the manager of Huntrix and why he was so insecure of failing the expectations of fans.\n\nSuggestions for a possible sequel: I know millions of fans still want Saja Boys and want Jinu to come back. But I personally think that this will ruin the possible development for all the characters. We need to go deeper to find different clues from characters like how they acted that way and the relationships between each other, not just focusing on a forced \"enemies to lovers\" romance. And I think this can be more interesting and maybe bring some good morals to inspire others.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw2cs9/unpopular_opinion_i_dont_like_rumi_and_jinu_also/"
    },
    {
        "id": "1lvtdxo",
        "author": "Academic-Ganache702",
        "title": "The sandman serie is deep",
        "content": "I am watching the sandman rn (being stoned) on netflix. And this movie is probably the best way to experiende how shrooms feel😅\n\nThe way how it puts you to think about life, death and certain things in live. You trip a bit and than stuff becomes clear.\n\nJust wow",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvtdxo/the_sandman_serie_is_deep/"
    },
    {
        "id": "1lvt4kr",
        "author": "Blademir1708",
        "title": "The story of kpop demon hunters was really weird (SPOILERS)",
        "content": "KPop Demon Hunters is an extremely fun movie, with banger songs, amazing vocal performances, and godly animation (sony is so good at this style). Yes, i loved the movie, but the story just left me confused at the end.\n\nWhile watching the movie, I thought that the movie was about how no one is truly evil, and everyone deserves a second chance. The evidence of this being the girls not wanting to use a diss track to make the golden honmoon because they didn't want to do it with hate, and also Jinu's whole backstory. Yes Jinu did leave his child but Rumi said in the movie that that's not all he is, which led me to believe that this would serve as a signal that demons can also be good. Also, Gwi Ma was the one who used the demons fears to take control over them, so they couldn't be completely at fault.\n\nDespite all this, Gwi Ma dies (which is expected), but every demon dies as well. Are we to believe that all of them deserved that death? Because that's not the message the movie was hinting at earlier. Jinu dies, and yes it could be argued that he paid the price for his sins, but I'd argue that 400 years of tormenting voices of his family was enough torture for the character. I feel like it would've been more interesting if they'd explored the idea of Gwi Ma being evil, and demons the humans who made mistakes and are now paying the price.\n\nThe plot point of Rumi being a half demon was interesting, and led to the actual message of the movie, of not being ashamed of you are, but it could've been explored more. The same applies to her relationship with Celine, which was just served to us through flashbacks.\n\nAlso, not a real criticism, but just a side note, what happened to the missing persons cases, cause their souls are just gone? Was the identity of Gwi Ma and Saja being demons now known to everyone? Did everyone just accept that fact?\n\nTLDR; fucking amazing animation, songs, voice acting (glad they didn't do chris pratt as jinu), and an extremely fun movie, but the plot left more to be desired\n\n  \n(Also, the sort of romance between jinu and rumi was weird, it's literally the 1000 year old anime girl that looks like she's 9 years old, but a little better)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvt4kr/the_story_of_kpop_demon_hunters_was_really_weird/"
    },
    {
        "id": "1lv6cgu",
        "author": "Comprehensive-Way482",
        "title": "'Monster' Season 4 in the Works at Netflix, Focused on Lizzie Borden",
        "content": "",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lv6cgu/monster_season_4_in_the_works_at_netflix_focused/"
    },
    {
        "id": "1lvs9o5",
        "author": "kleverrboy",
        "title": "Liam Payne’s Posthumous Appearance On New Netflix Competition Show Has Fans In Their Feels",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvs9o5/liam_paynes_posthumous_appearance_on_new_netflix/"
    }
]