[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pon4j2",
        "author": "Glittering-Foot-3031",
        "title": "Commento di un milanese su Torino",
        "content": "",
        "upvotes": 122,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szk3pmhywo7g1.jpeg?auto=webp&amp;s=47171fda91e2ae0e2195cfbdd523ccd0745e73c9"
        },
        "permalink": "/r/torino/comments/1pon4j2/commento_di_un_milanese_su_torino/"
    },
    {
        "id": "1ppa9kq",
        "author": "corbhu",
        "title": "New Year's Eve in Torino",
        "content": "Hi everyone!\nWe’re a group of 5 people in our mid-20s, originally from Romania. Only my wife and I have been living near Cuneo area for about 3 years, and this year we’d really like to do something more spectacular for New Year’s Eve.\n\nWe’ll be in Torino on December 31st and are looking for recommendations for:\n\nfun clubs or lively pubs\n\na young, energetic crowd\n\ngood music and a great party atmosphere until late\n\nAny tips on the best areas, clubs, or special NYE events in Torino?\nDo we need to book tickets in advance?\n\nThanks a lot — we really appreciate any suggestions! \nAnd also Buon Natale e un felice Anno Nuovo pieno di gioia! 🍻",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ppa9kq/new_years_eve_in_torino/"
    },
    {
        "id": "1pp3f3x",
        "author": "TurbulentDragon",
        "title": "Dove conoscere persone alt",
        "content": "Sostanzialmente il titolo. Vorrei conoscere nuova gente, siccome anch'io sono alt preferirei altre persone alternative, visto che verosimilmente  mi troverei meglio a livello di pensieri/idee e quindi ci sarebbe più probabilità di stringere amicizia.\n\n\n\nSo che c'é il baloon ogni sabato mattina, ci sono altri eventi/cose del genere dove si solito si trova gente alt? Mi rendo conto che forse è una domanda stupida hahaha, però tentar non nuoce ",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1pp3f3x/dove_conoscere_persone_alt/"
    },
    {
        "id": "1pothkx",
        "author": "jobolix2",
        "title": "Band metal",
        "content": "Basta mi sono rotto i coglioni.\nChi suona uno strumento mi scriva in privato che facciamo una band metal",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pothkx/band_metal/"
    },
    {
        "id": "1podj9z",
        "author": "Rude_Calligrapher712",
        "title": "Sì, ancora questi maledetti fottuti botti",
        "content": "Sono appena tornata dalla passeggiata serale col cane. E iniziano i botti. Ma perché non ve li ficcate nel culo? Ammazzano animali e persone, fanno male all'ambiente, non avete un motivo che sia uno per farli. Non un fottuto motivo.\n Manco a capodanno, figuriamoci ogni santa maledetta sera. \nTrovate un hobby e spendere i soldi senza rompere le ovaie alle altre persone. Sfigati\n\n",
        "upvotes": 73,
        "comments": 78,
        "media": null,
        "permalink": "/r/torino/comments/1podj9z/sì_ancora_questi_maledetti_fottuti_botti/"
    },
    {
        "id": "1poy1sh",
        "author": "ravrav69",
        "title": "Trip to Turin",
        "content": "I will be visiting Turin in March of 2026 and I would like some help with my trip. \n\nFirst of all, how many days would you recommend spending for Turin on its own? Is 2 days enough or will it be too stressful? \n\nAfter spending time in the city of Turin I plan on going to some places near Turin as day-trips\nI want to go to Sacra di San Michele. The best way to get there is by hiking for 2 hours, right? Is it worth it? Is it any dangerous? \nOther than that, I dont know which place to visit. The ones I have in mind are:\n- Aosta and Forte di Bard: I like the aosta city, the alps scenery of the Forte\n- Asti, Alba, Bra : I have heard that those cities are known for their food and wine, but architecture as well. Asti is bigger, Alba and Bra are similar. I have heard that it's a bit difficult to combine all of them in one day though.\n- Savigliano, Saluzzo, Cuneo : I like the architecture of this group of cities (Saluzzo is medieval, Cuneo is more elegant and offers variety to the trip) more than the Asti, Alba, Bra.\n- lake Orta (Orta san Giulio, the island), Vogogna and Domodossola : I like a lot the vibe of the Orta Island but I cant decide if its better to go there or to lake Como.\n\nDo you have any recommendations? Any feedback for my plan? How many days would you say are sufficient for exploring the city of Turin? Is it better to do 3 days in Turin and 2 day trips or 2 days in Turin and 3 day trips? \n\nThanks! 🇮🇹🇮🇹\n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1poy1sh/trip_to_turin/"
    },
    {
        "id": "1pp21yv",
        "author": "Charming_Egg_5299",
        "title": "Consigli posto per apericena laurea",
        "content": "Salve a tutti. Vorrei chiedere consiglio su posti in Torino e dintorni dove celebrare una festa di laurea con un apericena. Ogni consiglio è ben accetto, grazie in anticipo.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pp21yv/consigli_posto_per_apericena_laurea/"
    },
    {
        "id": "1po4sa3",
        "author": "Top-Analysis-887",
        "title": "Sta meraviglia da vedere (e spero anche da mangiare) ne vale o no i 15 euro che chiedono!?!?",
        "content": "La \"Mole Croissant\" è una specialità di Tari Cake Lab a Torino, un croissant a forma di Mole Antonelliana, farcito con crema al bicerin (caffè, cacao, panna).",
        "upvotes": 58,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tmzkie3s3l7g1.png?auto=webp&amp;s=bab426cbe9b2a371aff609ef76d13d7545b1e346"
        },
        "permalink": "/r/torino/comments/1po4sa3/sta_meraviglia_da_vedere_e_spero_anche_da/"
    },
    {
        "id": "1poc0jk",
        "author": "Kind-Calendar793",
        "title": "Oggi incidente linea 8 GTT su via Cernaia dopo via Pietro Micca",
        "content": "Articolo qua  \n[https://www.torinotoday.it/cronaca/incidente-stradale/autobus-cernaia-solferino-16-dicembre-2025.html](https://www.torinotoday.it/cronaca/incidente-stradale/autobus-cernaia-solferino-16-dicembre-2025.html)",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2tni6jf0hm7g1.jpeg?auto=webp&amp;s=080d0bf332601488bcad0b7b1061ec8db3877d43"
        },
        "permalink": "/r/torino/comments/1poc0jk/oggi_incidente_linea_8_gtt_su_via_cernaia_dopo/"
    },
    {
        "id": "1pnk58r",
        "author": "koksinel",
        "title": "Turin air quality is like India",
        "content": "How is this possible? In Europe? North of Italy?\n\nWhy is no one doing anything to change this horrible situation?\n\nIt’s literally dangerous to walk outside, eyes are burning, throat is irritated and swollen, this is insufferable.",
        "upvotes": 216,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/260kmc3mvf7g1.jpeg?auto=webp&amp;s=6f99a2eb2b16389ae18a409cd3683219a76cc547"
        },
        "permalink": "/r/torino/comments/1pnk58r/turin_air_quality_is_like_india/"
    },
    {
        "id": "1po51eh",
        "author": "melmists_Karamel",
        "title": "Via Oropa",
        "content": "Io e il mio ragazzo (25 e 32 anni) stiamo pensando di trasferirci in Via Oropa, ma non siamo originari di Torino e ci chiedevamo come fosse la zona, considerando che attualmente stiamo in Corso Vercelli. ",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1po51eh/via_oropa/"
    },
    {
        "id": "1poaslc",
        "author": "Fickle-Fondant-2641",
        "title": "Foreign student &amp; guitarist looking to meet people (Turin)",
        "content": "Hey everyone,\n\nI’m a 27-year-old male foreign student and I’ve been living here for a bit over a month now. I play electric guitar and music is a big part of my life, so I thought I’d give this a shot.\n\nI’m mainly looking to meet other musicians (any level, any instrument), but I’m also down to just make friends — grab a beer, hang out, talk music, go to gigs, jam, or whatever.\n\nIf you’re into music or just feel like meeting new people, feel free to comment or DM me.\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1poaslc/foreign_student_guitarist_looking_to_meet_people/"
    },
    {
        "id": "1poh9d8",
        "author": "Effect-Imaginary",
        "title": "Probabilmente avrò necessità di lasciare le cose di casa mia in un box in affitto per dei mesi, conoscete qualcuno di affidabile?",
        "content": "Dove potrei trovare da affittare? classici Facebook e indeed?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1poh9d8/probabilmente_avrò_necessità_di_lasciare_le_cose/"
    },
    {
        "id": "1pofv6f",
        "author": "Few-Cheetah8476",
        "title": "Devo scegliere una scuola materna",
        "content": "Ci avviciniamo al fatidico momento dell'anno in cui si iscrivono i figli alla scuola per l'anno prossimo. Il mio deve andare alla materna (scuola dell'infanzia). Cerchiamo una scuola che sia in zone aurora/valdocco/centro, e che abbia il giardino o un ottimo cortile. Consigli?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pofv6f/devo_scegliere_una_scuola_materna/"
    },
    {
        "id": "1podq42",
        "author": "dartho19",
        "title": "Dove acquistare abbonamento per parcheggio sotterraneo?",
        "content": "Vorrei lasciare l'auto per un mese nel parcheggio sotterraneo Palagiustizia, ma non riesco a capire dove o come acquistare l'abbonamento!   \n  \nSul sito GTT non c'è scritto nulla ([link](https://www.gtt.to.it/cms/parcheggi/31-barriera/rotazione/424-palagiust)), è solo riportato il tariffario (85€ al mese). Nell'e-commerce, dopo essermi autenticato, posso solo acquistare gli abbonamenti sosta per le strisce blu, nessuna indicazione presente riguardo ai parcheggi interrati.\n\nQualcuno ha idea di come si faccia?",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cGyreSbtmkpVu3g-jo1qiPP8xxnaZxxnGmoUSMSZP78.png?auto=webp&amp;s=9b67f158fe25141ff39651183f52b75ffd29765a"
        },
        "permalink": "/r/torino/comments/1podq42/dove_acquistare_abbonamento_per_parcheggio/"
    },
    {
        "id": "1pnojps",
        "author": "Zestyclose-Cost3491",
        "title": "Qual'è il modo migliore per raggiungere l'aereoporto di Caselle da Torino senza auto?",
        "content": "In treno, autobus, o c'è una navetta apposita? è difficile capire la migliore opzione online, grazie",
        "upvotes": 7,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1pnojps/qualè_il_modo_migliore_per_raggiungere/"
    },
    {
        "id": "1pnuujp",
        "author": "Plus-Masterpiece936",
        "title": "Multa incrocio corso potenza - via val della torre. Violazione linea continua trasporto pubblico.",
        "content": " Nei primi di novembre, per due giorni quasi consecutivi, ho preso una multa nell'incrocio tra corso Potenza e via val della torre, percorrendo corso Potenza verso sud (Campidoglio). La multa è per violazione linea continua del tpl.\n\n Andando sul sito del comune la foto segnaletica appare completamente nera eccetto la targa che viene mostrata. \n\n La cosa che mi insospettisce tantissimo è che è vero che uso la corsia di sorpasso, ma SOLO se la linea è tratteggiata, sono molto scrupoloso in questo. Ritengo pertanto sospetto che mi si segnali violazione della linea continua laddove la foto segnaletica sia praticamente inutile.\n\n Avete delle esperienze in merito? Come posso fare almeno per avere le immagini della mia violazione e capire per cosa vengo multato?\n\nGrazie a chi mi risponderà.",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pnuujp/multa_incrocio_corso_potenza_via_val_della_torre/"
    },
    {
        "id": "1pno6os",
        "author": "NoiseNew6219",
        "title": "3D model of a street in Turin (Torino)",
        "content": "Hi everyone,  \nI’m an architecture student and we’re looking for a fairly accurate 3D model of a street in Turin (Torino), ideally including façade articulation (rustication / bossage, not just simple extrusions).\n\nDo you know if such models already exist (open data, university projects, research, CityGML, LiDAR-based models, etc.) or where to find official datasets from the city or region?\n\nWe’re happy to process GIS/CityGML data ourselves if needed.  \nThanks a lot!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pno6os/3d_model_of_a_street_in_turin_torino/"
    },
    {
        "id": "1pnfmxw",
        "author": "DraftApprehensive439",
        "title": "Going to Torino for Erasmus",
        "content": "Hello!\n\nI'm student from Czechia, currently on Italian studies, and from February to July I'll be on Erasmus in Torino. I'll apply my studies to the Humanities on Università di Torino, but I have just foggy information about that. Deadline of sending learning agreement to Torino was on 30th November, I sent it few days before, but still I don't know literally anything about my program. They even didn't send me confirmation of being admitted there... And it's already time for booking some accomodations, especially when it'll be crowded because of Winter Olympics Games, and to buy flight.\n\nWhen the second semester on Humanities starts? From different sources I obtained three dates...\n\nIs it better to pay for dorm or to live in airbnb? I'd like to make new friends and fully experience student life, is dormitory still available or is it now too late? Also I'd like to make friends from Torino before going there so it won't be so unknown for me, it'll also help me to practice Italian (for now kinda low especially in vocabulary).\n\nThanks for replies!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pnfmxw/going_to_torino_for_erasmus/"
    },
    {
        "id": "1pn1e6t",
        "author": "_GanGer_",
        "title": "Cosa fare a Torino da soli il giorno di Natale?",
        "content": "Quest'anno per la prima volta non potrò scendere nella mia regione di origine per le feste di Natale. I miei amici scendono, oppure passano il giorno di natale con la propria famiglia. Avete consigli da darmi su attività da fare per non passare la giornata in casa in solitudine? Ho 26 anni",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1pn1e6t/cosa_fare_a_torino_da_soli_il_giorno_di_natale/"
    },
    {
        "id": "1pndsmp",
        "author": "Ok_Conflict6394",
        "title": "Ristorante per laurea",
        "content": "Salve, a dicembre mi laureo e vorrei qualche consiglio su dei buoni ristoranti per pranzare una cosa molto intima giusto 4 persone, possibilmente vicino a corso unione sovietica ma va bene dovunque. Grazie in anticipo a chiunque risponda!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pndsmp/ristorante_per_laurea/"
    },
    {
        "id": "1pnc2vv",
        "author": "RainDesigner",
        "title": "Torrefazione Vanchiglietta/Vanchiglia/Aurora?",
        "content": "qualsiasi raccomandazione?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pnc2vv/torrefazione_vanchigliettavanchigliaaurora/"
    },
    {
        "id": "1pn8fz2",
        "author": "Effect-Imaginary",
        "title": "Avete uno studio fotografico di fiducia? Professionale o amatoriale",
        "content": "",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pn8fz2/avete_uno_studio_fotografico_di_fiducia/"
    },
    {
        "id": "1pn5rhb",
        "author": "lbranco93",
        "title": "Programmi a Torino per capodanno",
        "content": "Ciao a tutti, io e mia moglie (32) saremo a Torino per capodanno. Per la prima volta saremo soli dato che i nostri amici saranno tutti via e non abbiamo programmi.\n\nMi chiedevo cosa c'è da fare a Torino a capodanno, io e lei siamo abbastanza aperti e ci piacerebbe conoscere nuove persone.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pn5rhb/programmi_a_torino_per_capodanno/"
    },
    {
        "id": "1pm8w9g",
        "author": "chack1172_temp",
        "title": "Maledetto fuochi d'artificio",
        "content": "Stanotte fuochi d'artificio a non finire, a mezzanotte, all'1 e alle 2. Oggi mi son dovuto svegliare alle 6 per prendere il treno, ho dormito solo 3 ore... Situazione assurda",
        "upvotes": 40,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1pm8w9g/maledetto_fuochi_dartificio/"
    },
    {
        "id": "1pmq6wl",
        "author": "yotama9",
        "title": "Cerco per il libro \"Frankenstein\" in ingelse per mia figlia",
        "content": "Ciao tutti.\n\nMia figlia ha un esame sul questo libro in venerdì. Lei ha letto il libro online (project Guttenberg), má solo oggi mi ha detto che forse c'è bisogno d'avere questo libro fisicamente durante l'esame. Forse qualcuno posso aiutare a noi? O forse conosci un negozio a Torino dove possiamo comprarlo? \n\n(Dispiace se ho l'errore nel mio messaggio, non sono Italiano)",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1pmq6wl/cerco_per_il_libro_frankenstein_in_ingelse_per/"
    },
    {
        "id": "1pmio3m",
        "author": "Agitated-Standard627",
        "title": "UPDATE: The proximity project",
        "content": "Ciao a tutti,\n\nvolevo aggiornarvi sul \"the proximity project\", di cui avevo parlato qui nel sub qualche tempo fa.\n\n&gt;Si tratta di uno strumento che mostra, tramite isocrone (o meglio aree con colori sempre più scuri), le zone più vicine a una stazione ferroviaria, metropolitana, fermata di tram o filobus. Questo perché, secondo la mia esperienza personale (almeno a Roma :-) ), questo tipo di trasporto pubblico è decisamente più affidabile degli autobus, che sono più soggetti al traffico.\n\nOk, forse tram e filobus non sono sempre al 100% affidabili, ma mi piaceva pensarla così.\n\nhttps://i.redd.it/uzp6u32k877g1.gif\n\nA chi può servire? A chi cerca un modo semplice per individuare zone ben collegate dove soggiornare, quindi turisti, studenti o chi cerca casa in affitto o acquisto. Oppure a chi, come me, si diverte con rappresentazioni di dati sulle mappe :-D\n\nLe novità principali sono:\n\n* aggiunta dei filobus, ai treni e tram giá presenti\n* mappe più fluide grazie all’uso di Azure Maps invece di OpenStreetMap\n* ho sistemato alcuni problemi che si presentavano su mobile\n* ora si può filtrare anche per tipo di stazione o fermata, che vengono mostrate con colori diversi\n\nIn via sperimentale ho aggiunto anche il supporto per un paio di aree metropolitane francesi (Parigi e Lione).\n\nQui [https://proximity.duckiesfarm.com/italy](https://proximity.duckiesfarm.com/italy) trovate tutte le aree italiane disponibili (si può anche accedere direttamente con deep link, per esempio [https://proximity.duckiesfarm.com/italy/milan](https://proximity.duckiesfarm.com/italy/milan)), mentre qui [https://proximity.duckiesfarm.com/france](https://proximity.duckiesfarm.com/france) ci sono le due aree francesi.\n\nIl progetto è open source, lo faccio per passione, per creare qualcosa di utile anche ad altri e per avere una scusa per imparare cose nuove. Qualsiasi feedback, purché gentile :-), è ben accetto - [https://github.com/nicolgit/proximity](https://github.com/nicolgit/proximity)\n\nFatemi sapere cosa ne pensate, cosa posso migliorare, cambiare o aggiungere, e condividete o salvate il link se vi sembra davvero utile!",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IVnaQXBoIB9cXJlp6v5HLxa9Y-tI_Q5wZ2JVan61wG0.gif?format=png8&amp;s=0f472e0abe76118536fbe95457d7daae28d864b7"
        },
        "permalink": "/r/torino/comments/1pmio3m/update_the_proximity_project/"
    },
    {
        "id": "1pmo675",
        "author": "DenverMa",
        "title": "Wins school",
        "content": "Hi! I’m looking for feedback for WINS school - can anyway please help me? Primary and middle school for my kids ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pmo675/wins_school/"
    }
]