[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 90,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m5ghm8",
        "author": "Longjumping_Land_977",
        "title": "What do you guys think of the ‘photos’ of Amy Bradley found in 2005?",
        "content": "Could they be her? I personally think they are, which must be truly awful for her family. It’s so sad the FBI couldn’t look into this more and that it’s been dropped. ",
        "upvotes": 297,
        "comments": 558,
        "media": null,
        "permalink": "/r/netflix/comments/1m5ghm8/what_do_you_guys_think_of_the_photos_of_amy/"
    },
    {
        "id": "1m5dw1j",
        "author": "waynejohnson1985",
        "title": "A Netflix original that completely exceeded your expectations?",
        "content": "I just finished watching *The Platform* and honestly went in without expecting much. Maybe just another dystopian thriller. But wow, it completely blew me away. The concept was so unique, and the social commentary was intense without feeling forced. I didn’t think it would stick with me the way it did, but days later I’m still thinking about it.\n\nHave any of you had a similar experience with a Netflix original that really surprised you (in a good way)? Would love to hear your picks.\n\n",
        "upvotes": 413,
        "comments": 371,
        "media": null,
        "permalink": "/r/netflix/comments/1m5dw1j/a_netflix_original_that_completely_exceeded_your/"
    },
    {
        "id": "1m65h0s",
        "author": "hygge6",
        "title": "Not the horse 😭😭(Untamed)",
        "content": "The saddest part was Shane shooting Kyle’s horse 😭😭😭😭 but for real, animal deaths in tv/film always get me no matter how inconsequential they seem. Anyone else?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m65h0s/not_the_horse_untamed/"
    },
    {
        "id": "1m65uzc",
        "author": "Plazmashock",
        "title": "PLEASE recommend me show or a movie that has epic metal soundtracks and songs",
        "content": "Hi all\n\nJust bought Netflix subscription and I'm really enjoying it so far. Devil may cry was one of the first shows i watched and the soundtrack for intro or battles were amazing and i loved it.\n\nPlease recommend shows where there are epic battles while heavy metal music is playing in the background.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m65uzc/please_recommend_me_show_or_a_movie_that_has_epic/"
    },
    {
        "id": "1m67qt6",
        "author": "photoshop_2023",
        "title": "Now allowed to download",
        "content": "I wanted to download one of episodes from Seinfeld and i got an error message saying i'm not allowed to download this for the rest of the year. Does anyone know whats going on?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m67qt6/now_allowed_to_download/"
    },
    {
        "id": "1m5fu0v",
        "author": "HoneyBootyCakes",
        "title": "“Untamed” either I’m missing something here or it’s just that terrible.",
        "content": "Okay so the show is predictable at best but there are some strange dead ends that I’m just not understanding if someone could explain please. Okay, so what happened to the female cop’s husband/child’s father? There was some strange back story where he needed her to lie for him, he was stalking her. I felt like there was this big build up that ultimately just was him going to jail with no resolution really. Also, in the beginning when the woman falls off the cliff, the police were back and forth about if she was already dead before she fell or not but we could clearly see she was dead. She also had some animal tear up her knee after she had been shot. When they finally showed the chain of events, it showed her getting shot, but no animals attacking her. It only showed her “jump” off the cliff. So, she wasn’t dead? She committed suicide? Another thing, they made it seem like the man that was showing up to see the girl was this creepy ominous guy who she trusted. The way they showed him opening her bedroom window made it seem like he was going to hurt her. Idk, this show felt like the audience was being lead in different directions with no real “ah ha moment” or pay off. oh and, the whole drug ring side plot was incredibly unnecessary in my opinion too. ",
        "upvotes": 75,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1m5fu0v/untamed_either_im_missing_something_here_or_its/"
    },
    {
        "id": "1m630jl",
        "author": "Choice-Macaron-276",
        "title": "i love netflix CCs!",
        "content": "i just think it's so great how when characters are speaking important dialogue in another language (other than the selected language for CCs) you don't actually bother to translate the dialogue to the selected CC language and transcribe it, but instead, just add a lovely \"[speaking &lt;language&gt;]\" caption. it's both wonderfully helpful as a viewer to know that the characters from [foreign country] are speaking [foreign language], and really leaves a lot to the imagination!! ❤️❤️❤️❤️❤️❤️\nalso, i'm sure your primary shareholders must love the extra points on your stock price gained by not wasting any resources on translating stuff and transcribing it for the CCs.\ni sure hope that netflix will be around for many, many years to come, and will never be replaced by some other newer/better streaming service (e.g. the way myspace was replaced by facebook).\nexcellent work! three cheers for netflix! yayayay! 🥳🎉🎈🎊😃",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m630jl/i_love_netflix_ccs/"
    },
    {
        "id": "1m624wl",
        "author": "PuzzleheadedKiwi7107",
        "title": "I have some questions when Netflix still mailed discs",
        "content": "When Netflix used to mail discs, specifically from 2015-2023, were the discs just of the show/movie or were they like actual discs with bonus features and everything?\n\nThis is a weirder question and if no one knows, that's perfectly okay. How specifically did you order these discs? Was it a separate site? Were there any hoops you had to jump through?\n\nDid any one of you rent The Adventures of Puss in Boots (2015)? If so, did it have the bonus features in the image? If any of you still have the discs (DVD or blu ray), would you be willing to sell them to me?\n\nhttps://preview.redd.it/i7mqedqy4cef1.jpg?width=6141&amp;format=pjpg&amp;auto=webp&amp;s=3202c55dd884d5d3bb8ff2adbc2791de9129aa3d\n\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m624wl/i_have_some_questions_when_netflix_still_mailed/"
    },
    {
        "id": "1m60s0f",
        "author": "Visible_Star_7783",
        "title": "Anyone watched wall to wall yet?!",
        "content": "What a movie! It’s Korean film about a guy who invests everything into an apartment that has noisy neighbours but all the neighbours are complaining about the same noise blaming each other. It gets really good and if you have been in a real situation like I have with noisy neighbours the movie hits different. Very good film! Recommend ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m60s0f/anyone_watched_wall_to_wall_yet/"
    },
    {
        "id": "1m5b559",
        "author": "mschiie",
        "title": "Just started Peaky Blinders… why didn’t anyone shake me sooner?!",
        "content": "As in… wow. I feel robbed for not watching this sooner.\nPeaky Blinders is everything I want in a show sharp, intense, stylish, and full of bite.\nEvery scene feels cinematic, the pacing is tight, and the characters? Complex AF.\n\nIt’s not just a gangster show it’s about trauma, ambition, and power plays wrapped in designer suits and razor hats.\nCillian Murphy eats every scene. The soundtrack? Chef’s kiss.\n\nIf you’re into smart, gritty crime dramas like Breaking Bad, Boardwalk Empire, or Narcos this is your next obsession.\n10/10. No notes.\n",
        "upvotes": 98,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b559/just_started_peaky_blinders_why_didnt_anyone/"
    },
    {
        "id": "1m60av0",
        "author": "SativaStrong",
        "title": "Why Doesn’t Netflix Auto-Show Subtitles for Non-English Dialogue?",
        "content": "I'm watching Mr. Robot, and I’ve noticed that whenever characters speak a foreign language like Mandarin, the subtitles don’t automatically appear. I have to manually turn subtitles on, which is pretty inconvenient. Shouldn’t the show automatically display subtitles for non-English dialogue? Is there a way to fix this without constantly turning subtitles on and off?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m60av0/why_doesnt_netflix_autoshow_subtitles_for/"
    },
    {
        "id": "1m66f2u",
        "author": "Naive-Gas9553",
        "title": "Can’t watch Netflix in portrait mode on iphone?",
        "content": "I really want to watch Netflix in bed on my phone but it automatically goes to landscape mode. I find it difficult to hold my phone sideways while laying down. Is there really no hack to get it into portrait mode? I tried everything. Even looked for apps that can do this for me. Even restarted phone. And yes, rotate lock is off lol\n\nSeems ridiculous of them not to allow it ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m66f2u/cant_watch_netflix_in_portrait_mode_on_iphone/"
    },
    {
        "id": "1m650gb",
        "author": "RavenThePerson",
        "title": "Shows randomly skip forward and audio cuts out",
        "content": "Over the last couple weeks shows will randomly skip forward 20-50 seconds and all audio cuts out for 15 ish seconds or until I skip, has anyone been getting this and maybe know a fix? It’s happened on my rogers cable box and on my sisters smart tv (not sure of the brand)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m650gb/shows_randomly_skip_forward_and_audio_cuts_out/"
    },
    {
        "id": "1m4pyf9",
        "author": "AustinBaze",
        "title": "Stop Asking Me \"Who's Watching?\" Dammit.",
        "content": "[Please Stop Asking](https://preview.redd.it/vdi33l6te1ef1.jpg?width=890&amp;format=pjpg&amp;auto=webp&amp;s=efe046b37cc706f4349d0958c889462ec978c8f4)\n\nSingle, no kids.  There is only one Netflix profile.  There is only one subscriber. There has only ever been ONE profile and one subscriber. Ever.   \nThere has only been answer ever to this question for the 10 years or so you have been asking it.  I'm bored with it, are you Netflix?   \n",
        "upvotes": 1162,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1m4pyf9/stop_asking_me_whos_watching_dammit/"
    },
    {
        "id": "1m63p8m",
        "author": "Scmomof4",
        "title": "Netflix buffering issue across devices?",
        "content": "In the last few weeks we have been seeing this issue increase and it’s getting super annoying - we’ll be watching a show and randomly the loading/buffering symbol and 0% pops up and nothing happens. It just sits there on 0% until we back out to the menu and reopen the show. This happens on our LG tv, our Samsung tv, and two different Xbox series X consoles. We’ve tried deleting the app and reinstalling it on our main LG tv and one Xbox, and are still having repetitive issues. The only thing that has changed was that I downgraded from premium to standard without ads, but I haven’t seen any reported issues regarding that. Also, my internet wifi is a steady 400mbps+ and Netflix is the only app that does this, so it’s not an internet problem. Anyone have any advice or tips to try to solve this problem?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m63p8m/netflix_buffering_issue_across_devices/"
    },
    {
        "id": "1m5vvt4",
        "author": "Total_Maybe_4945",
        "title": "Squatch",
        "content": "I'm looking for this Movie that was on Netflix about a man who sets out to walk the Great divide solo after losing his wife to cancer also encounters possible Sasquatch noises.\n\"NOT starring Robert Redford\" \n\n\nI can't seem to find it but it had been on Netflix late last year or early this year.... Thanks",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m5vvt4/squatch/"
    },
    {
        "id": "1m5mx82",
        "author": "Intelligent-Quit9226",
        "title": "I highly recommend the Red Riding Trilogy (1974, 1980 and 1983). Anyone else a fan?",
        "content": "I’ve watched them a couple of times a year since they were first on TV. Top notch cast, fantastic production design and cinematography. Part 2 (1980) is probably my favourite as I love a bit of Paddy Considine.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m5mx82/i_highly_recommend_the_red_riding_trilogy_1974/"
    },
    {
        "id": "1m5wlla",
        "author": "leigh_098",
        "title": "Confused about Vis a Vis (Locked up) Season 2 Ep 1 Did I miss something?",
        "content": "I just finished watching Locked Up (Vis a Vis) Season 1 and I'm a bit confused jumping into Season 2. From what I know, Season 1 has 11 episodes. The last scene I watched was Zulema trying to escape by setting herself on fire, the Egyptian getting caught by Macarena's dad, and then her dad having a heart attack. Macarena’s brother was going to the house like the dad told him.\n\nBut when I started Season 2 Episode 1, it suddenly shows Zulema escaping with Macarena, like they’re working together now?? It feels like I missed something in between. Was there a special episode or recap I skipped? Can anyone explain the jump or what I should know before continuing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5wlla/confused_about_vis_a_vis_locked_up_season_2_ep_1/"
    },
    {
        "id": "1m5vop5",
        "author": "Sippi66",
        "title": "Our Oceans",
        "content": "I hadn’t watched this series yet and decided to try it today. Much to my surprise I heard a familiar voice from the past, when things weren’t so chaotic, and thought of just how great of a President we had back then. #BarackObama #Respect\n\nhttps://youtube.com/shorts/XZD6w_YXF-w?si=D_jNLCSpmQna0osm\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5vop5/our_oceans/"
    },
    {
        "id": "1m5otrh",
        "author": "ZackaryAsAlways",
        "title": "Happy Gilmore meal with exclusive cup at Subway",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5otrh/happy_gilmore_meal_with_exclusive_cup_at_subway/"
    },
    {
        "id": "1m609eo",
        "author": "Wooden_Cupcake384",
        "title": "do netflix profiles use an algorithm?",
        "content": "i want to change my netflix profile picture to a funny profile i saw on my sister’s account, but i can’t find it anywhere on mine😩. i’ve gone through all the profile icons on my account, but the one i saw on hers isn’t on mine. does netflix have some kind of algorithm or setting that controls this? is there a way to fix it?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m609eo/do_netflix_profiles_use_an_algorithm/"
    },
    {
        "id": "1m57ych",
        "author": "Tiger_Eagle06",
        "title": "Untamed - Question about the ending….(Spoilers)",
        "content": "I really enjoyed this show but one thing just seemed off. Close to the end, the Ranger finds the cell phone? Has this phone just been sitting in his living room for days and he just never checked her bag?  Or did I miss something?\n\nSeems like a HUGE writing mistake for him to just forgot to search the bag. ",
        "upvotes": 17,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m57ych/untamed_question_about_the_endingspoilers/"
    },
    {
        "id": "1m5hf7f",
        "author": "AppleJack5767",
        "title": "Shows or movies set in Europe",
        "content": "I recently returned to Canada from a trip to Europe and I’m feeling inspired, as I do each time. \n\nCan you recommend shows or movies that are set in Europe and depict the local culture?\n\nI’ve seen Emily in Paris, L’Agence Parisienne, and Call My Agent. As well as period shows like Bridgerton. \n\n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m5hf7f/shows_or_movies_set_in_europe/"
    },
    {
        "id": "1m5goaw",
        "author": "Myriad10",
        "title": "Netflix restart membership issue",
        "content": "Last week Netflix already auto charged my membership every month per usual but today I lost my premium plan and ask me to restart membership. My brother's account which is his own and not shared with mine but we live in the same house have same problem as me too. Anyone else have this issue as well? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m5goaw/netflix_restart_membership_issue/"
    },
    {
        "id": "1m5cz3g",
        "author": "Strong_Badger6249",
        "title": "Building the band pitch correction/autotune",
        "content": "I just wanted anyone else’s input on how much they are altering these people’s voices to make it sound better than it actually was , they are great singers but in certain moments I feel like you can hear where they clearly messed up , and they have just edited the audio to make it less noticeable … like in harmonies they will just make someone else’s voice more noticeable or they use obvious pitch correction .. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5cz3g/building_the_band_pitch_correctionautotune/"
    },
    {
        "id": "1m5y4ea",
        "author": "Prestigious-Thing774",
        "title": "Job offer email from Netflix",
        "content": "https://preview.redd.it/0lu1923n7bef1.png?width=1589&amp;format=png&amp;auto=webp&amp;s=a3e243a91f31bbb27552ba021f68587edcf65a67\n\nReceived this email today, didn't apply to work at netflix. seems to be a scam imo, I mean would netflix really send something like this? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m5y4ea/job_offer_email_from_netflix/"
    },
    {
        "id": "1m5i8w0",
        "author": "definitelynot_fifii",
        "title": "Learn a new language with Netflix",
        "content": "Hi✌🏼 Which movies or series on Netflix are best for learning a new language by watching them in that language? Which genres or themes are ideal for this?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m5i8w0/learn_a_new_language_with_netflix/"
    },
    {
        "id": "1m5b8xz",
        "author": "pandadimsum",
        "title": "Experience with Netflix Shop?",
        "content": "Wanted to buy some Kpop Demon Hunter merch from the website because I really like the shirts, but just wanted to ask how true to size the pajama pants are and if anyone has had any good/bad experiences with buying from their website? (I know there’s always some risk with buying online, just wanted to ask though for other buyers experiences)\n\nThank you :) ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b8xz/experience_with_netflix_shop/"
    },
    {
        "id": "1m5b5w2",
        "author": "Deep_Fly_4773",
        "title": "Enola Holmes 2: Eudora and Edith",
        "content": "I just have one question while I was rewatching enola holmes 2. Why didn't Eudora and Edith go with enola after the fight scene? Is it because the mystery was just focused to enola and Sherlock to solve? Haha maybe that was the answer but I just could help thinking for them to have more screentime, especially as a one family. Even Sherlock did not see his own mother in that movie. Maybe in Enola holmes 3. And even Mycroft! Knowing the actor struggled in schedule that is why he is not in the movie.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b5w2/enola_holmes_2_eudora_and_edith/"
    },
    {
        "id": "1m4mze7",
        "author": "Due-Needleworker-218",
        "title": "How to stop them recommending me shows I’ve already watched..",
        "content": "I watch quite a lot of shows and movies on Netflix and they still suggest/recommend stuff to me that I previously watched like a week ago. Is there a way to stop this or maybe hide certain titles after u watched them? ",
        "upvotes": 85,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1m4mze7/how_to_stop_them_recommending_me_shows_ive/"
    }
]