[
    {
        "id": "1lx8haf",
        "author": "InventionAMA",
        "title": "Hey r/movies! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional, experimental feature film INVENTION, that's now streaming on Mubi. You might also know Callie from La La Land, Alien: Covenant, Blair Witch, Under the Silver Lake, The Endless. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional feature INVENTION which riffs on real circumstances to explore the relationship between fantasy and grief -- both in personal life and how it reflects externally in America today. The film deals with weird medicine, losing dads and the emotional logic of conspiracy theory against the bucolic, literary backdrop of the Berkshires in the fall.\n\nSynopsis: In the aftermath of a conspiracy-minded father’s unexpected death, his daughter receives his patent for an experimental healing device. Featuring archive from actress Callie Hernandez's actual late father, INVENTION explores the process of grieving a complicated parent, and the filmmaking itself becomes a part of the process.\n\nTrailer: [https://www.youtube.com/watch?v=TFtolT9DE6M](https://www.youtube.com/watch?v=TFtolT9DE6M)\n\nWatch on MUBI: [https://mubi.com/en/us/films/invention-2024](https://mubi.com/en/us/films/invention-2024)\n\nAsk us anything! Back at 3 PM ET to answer questions.\n\nBios:\n\nCourtney Stephens is a writer/director of four features and numerous short films. Terra Femme, composed of amateur travel footage shot by women in the early 20th century, was a New York Times critic’s pick and has toured widely as a live performance. The American Sector (with Pacho Velez) follows slabs of the Berlin Wall installed around the US. John Lilly and the Earth Coincidence Control Office (with Michael Almereyda) explores the life of psychedelics pioneer John C. Lilly. Her films have been exhibited at MoMA, The National Gallery of Art, The Barbican, Walker Art Center, and film festivals including the Berlinale, Locarno, Rotterdam, Viennale, New Directors/New Films, Visions Du Réel, Thessaloniki, IDFA, BAFICI, True/False, Hong Kong, and the New York Film Festival. She is the recipient of a Guggenheim Fellowship, a Fulbright Scholarship, and grants from the Sloan Foundation and the Foundation for Contemporary Art.\n\nCallie Hernandez is an actress, writer and filmmaker. Her first film was Terrence Malick’s Song to Song followed by a decade of work as an actress. She is known for Ridley Scott's Alien: Covenant, Damien Chazelle's La La Land, A24’s Under the Silver Lake, HBO Max's The Flight Attendant, and Pete Ohs’ JETHICA. Upcoming work includes: Rachel Sennott’s Untitled Comedy Series, Albert Birney’s OBEX and James N. Kienitz Wilkins’ The Misconceived. In 2023, she founded an in-house film studio which yiel",
        "upvotes": 40,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4102icaa9cf1.png?auto=webp&amp;s=8014786121eba690da8caeb2eac2d9c1bf0223b7"
        },
        "permalink": "/r/movies/comments/1lx8haf/hey_rmovies_were_courtney_stephens_and_callie/"
    },
    {
        "id": "1lwuvsq",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Superman) plus Throwback Discussions!",
        "content": "**New In Theaters**:\n\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Scary Movie](https://old.reddit.com/r/movies/comments/1lwutxk/official_throwback_discussion_scary_movie_spoilers/?)\n* [Disney's The Kid](https://old.reddit.com/r/movies/comments/1lwutyi/official_throwback_discussion_disneys_the_kid/?)\n* [But I'm a Cheerleader](https://old.reddit.com/r/movies/comments/1lwutzo/official_throwback_discussion_but_im_a/?)\n\n**Still In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 70,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lwuvsq/official_discussion_megathread_superman_plus/"
    },
    {
        "id": "1lxxilb",
        "author": "MarvelsGrantMan136",
        "title": "Sean Astin To Run For SAG-AFTRA President",
        "content": "",
        "upvotes": 21172,
        "comments": 610,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmrkcFw5TRizVeSRtdI1PBcPGtlKMR6LA5irFvxPW88.jpeg?auto=webp&amp;s=ddbf15755cb20d87cc88cc409a034fbd654fcb9e"
        },
        "permalink": "/r/movies/comments/1lxxilb/sean_astin_to_run_for_sagaftra_president/"
    },
    {
        "id": "1ly1lod",
        "author": "Scarcecrows",
        "title": "Watching Logan (2017)— has there ever been any other trilogy that started off awful and ended on such a high note?",
        "content": "X-Men: Origins had a different director than James Mangold granted, but hotdog water level writing and questionable FX made it borderline unwatchable. Then Mangold takes the reigns in The Wolverine, which while an improvement also suffers from a generic to downright bad third act that feels slapdash and rushed compared to the rest of the film (the director’s cut helps this somewhat). Then we get Logan, which IMO, is the best genre film aside from The Dark Knight (and Nolan’s trilogy had its own stumble with the enjoyable but flawed Rises). \n\nIs there any other trilogy that was so miles ahead of the first film? Or is Logan the only exception to this rule? \n\nEdit: I should preface, as rightly pointed out (thank you folks) that the trilogy could be defined loosely in this sense — but these were the three stand alone outings as Jackman’s Wolverine so, to that end, that was my metric for defining them as such and also because they do acknowledge events from the film. I believe they even tried to get Lieve back as Sabretooth and modeled X-24 after his look from Origins. So to that end, I don’t discount it. ",
        "upvotes": 1388,
        "comments": 479,
        "media": null,
        "permalink": "/r/movies/comments/1ly1lod/watching_logan_2017_has_there_ever_been_any_other/"
    },
    {
        "id": "1ly62e8",
        "author": "ratatouille211",
        "title": "Mad Max Fury Road ( 2015 ) is the greatest action movie ever!",
        "content": "I'm hammered and on my Nth watch of this masterpiece. This movie is what actions movies, and in general movies, should be. Not a single frame is wasted.\n\nIt's quite remarkable how this movie is going this way till interval, and then going back post interval and packs so much story in between its never ending action. \n\nHardy &amp; Theron nail their part but Nicholas Hoult character win the movie for me. \n\nBefore this movie, I never expected a movie to be all action. You expect movies to set a plot, to set up characters, to set up story, MMFR does everything without slowing down, and that's art for me.\n\nIt's like a video game where you follow the main character. It's like a heavy metal song you love. It's like the best TV series payoff you wait to happen for years. It's legit perfect. \n\nFrom the ridiculous guitarist belting riffs Iron Maiden would be proud of to the pole swinging assassins, it's just a feast for all senses. \n\nAnd, dare I say, if you little high, there not exists a better adrenaline inducing movie.\n\nCheers. ",
        "upvotes": 672,
        "comments": 243,
        "media": null,
        "permalink": "/r/movies/comments/1ly62e8/mad_max_fury_road_2015_is_the_greatest_action/"
    },
    {
        "id": "1ly56mk",
        "author": "Neo2199",
        "title": "From ‘The Big Lebowski’ to ‘Smurfs,’ John Goodman Reflects Candidly on His Life in Comedy",
        "content": "",
        "upvotes": 603,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dqRLvQ_j8cZxFwKA84OM2AY6FE8KwUtZvHNn7GEsFzw.jpeg?auto=webp&amp;s=d38a5481bc3f8336a670e6e1d3a52641b464221c"
        },
        "permalink": "/r/movies/comments/1ly56mk/from_the_big_lebowski_to_smurfs_john_goodman/"
    },
    {
        "id": "1ly6be5",
        "author": "KillerCroc1234567",
        "title": "Evan Rachel Wood Says She Isn’t Returning for ‘Practical Magic 2’",
        "content": "",
        "upvotes": 488,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wvZ7DzMbMftWf6jjd0hK9N3x_vDV_OBUogS-QbcGIHU.jpeg?auto=webp&amp;s=364296eb3db14e54c68067058e4b6aa98a1df591"
        },
        "permalink": "/r/movies/comments/1ly6be5/evan_rachel_wood_says_she_isnt_returning_for/"
    },
    {
        "id": "1lxx0p8",
        "author": "JonasKahnwald11",
        "title": "First images of Nicolas Cage, J. K. Simmons and Giancarlo Esposito from 'The Prince' - A politically-charged drama exploring the life of a troubled son within a powerful American dynasty.",
        "content": "",
        "upvotes": 1388,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ule0u4kt4fcf1.jpeg?auto=webp&amp;s=5b1e46fdc8bc53f1c946905b0883b1b83506d909"
        },
        "permalink": "/r/movies/comments/1lxx0p8/first_images_of_nicolas_cage_j_k_simmons_and/"
    },
    {
        "id": "1ly6v21",
        "author": "movie5short",
        "title": "New Poster for Freakier Friday (2025)",
        "content": "",
        "upvotes": 301,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zyxml5zhghcf1.jpeg?auto=webp&amp;s=dbbe47c946cebf994a30b09b782805cc88aa3c6b"
        },
        "permalink": "/r/movies/comments/1ly6v21/new_poster_for_freakier_friday_2025/"
    },
    {
        "id": "1lyap6m",
        "author": "BunyipPouch",
        "title": "New Poster for Crime-Thriller 'Sovereign' - Starring Nick Offerman, Jacob Tremblay, Thomas Mann, and Dennis Quaid - A father and son who identify as Sovereign Citizens, a group of anti-government extremists, find themselves in a standoff with a chief of police that sets off a manhunt.",
        "content": "",
        "upvotes": 158,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cqc2ze9r9icf1.jpeg?auto=webp&amp;s=f1b427edcc1f31f7048268f1340192045af3d784"
        },
        "permalink": "/r/movies/comments/1lyap6m/new_poster_for_crimethriller_sovereign_starring/"
    },
    {
        "id": "1lxk6jj",
        "author": "MarvelsGrantMan136",
        "title": "Bryan Cranston Addresses ‘Lone Wolf’ Troubles, Vows Not To Film Or Promote Movie Until Every Cast And Crew Member Is Paid Back In Full",
        "content": "",
        "upvotes": 8510,
        "comments": 229,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n9XgMhGqDDl7Fp6XSMyvs-OeHqwiYUAGhak_iZm92CI.jpeg?auto=webp&amp;s=a0fbc8223daa852206e06336e4cb5cfc7f37c4af"
        },
        "permalink": "/r/movies/comments/1lxk6jj/bryan_cranston_addresses_lone_wolf_troubles_vows/"
    },
    {
        "id": "1ly00mg",
        "author": "retired-tweeter",
        "title": "What dialogue in a movie that always bothered you?",
        "content": "I’m sure “don’t laugh, this ain’t reality TV” will get a lot of replies. That line is unintentionally hilarious. I may have laughed more if someone said that in real life.\n\nI am legend when Will Smith ask Anna if she knew who Bob Marley was and she said “Damian”? \n\nAlso that cheese wiz line in Endgame. Just kinda killed the entire vibe of the seriousness of that scene.",
        "upvotes": 300,
        "comments": 658,
        "media": null,
        "permalink": "/r/movies/comments/1ly00mg/what_dialogue_in_a_movie_that_always_bothered_you/"
    },
    {
        "id": "1lygcnk",
        "author": "dancingbanana123",
        "title": "All in all, what movie do you think you've watched the most? That's including movies from when you were a kid.",
        "content": "There are a few movies that I first saw as an adult that I've seen several times now, like Good Will Hunting and Evil Dead. Idk if I've watched those more than Shark Boy and Lava Girl, though. I loved that movie as a kid and saw it so many times. My poor mother let me watch that movie three times in theaters.  She had to sit through it every time. Then it became one of those movies that you just see on TV and start watching again. Then I would rewatch it as an adult as just an amazing bad movie to laugh at. All in all, I've certainly seen it more than a dozen times. There were also all the movies we had on VHS and DVD, like the first Pokemon movie and Over the Hedge that I'm also sure I've seen a dozen times. If I had to guess though, I think Shark Boy and Lava Girl takes the crown, even though it's obviously not my favorite movie of all time today.",
        "upvotes": 33,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1lygcnk/all_in_all_what_movie_do_you_think_youve_watched/"
    },
    {
        "id": "1ly10io",
        "author": "Neo2199",
        "title": "50 Years Later, Fascist Satire ‘A Boy and His Dog’ Goes Great with Deep Panic — and Summer Malaise",
        "content": "",
        "upvotes": 228,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V8uAmu-xAA66JrPQVR9mScTjScq4cJ5eAlYtNvoEemE.jpeg?auto=webp&amp;s=4ba320663891689bb900b257ee46083de602c287"
        },
        "permalink": "/r/movies/comments/1ly10io/50_years_later_fascist_satire_a_boy_and_his_dog/"
    },
    {
        "id": "1lx94qe",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson",
        "content": "",
        "upvotes": 33824,
        "comments": 1205,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucgxqrj4f9cf1.jpeg?auto=webp&amp;s=e70feeea4ff4c5da7daca9bc2fa77edadc14e29e"
        },
        "permalink": "/r/movies/comments/1lx94qe/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lxxrjc",
        "author": "Bojanglez789",
        "title": "Marlon Brando in Apocalypse Now",
        "content": "I recently saw Hearts of Darkness: A filmmakers apocalypse, which was incredible (and also quite really crazy).\n\nFrom what is shown &amp; how I interpreted that, it seems like he was only there for a paycheck. He was paid $1 million per week, refused to accept shooting schedule changes, promised to be in shape and then clearly wasn't, didn't learn his lines, hadn't read Heart of Darkness (obviously not required but it seemed like he had no clue on set based on the footage). I've also read other things (not sure if they are true or not so won't bother sharing)\n\nI know this is a divisive topic and I still think Brando was very impressive in Apocalypse now. but why was he was so difficult to work with?!? I have seen lots of talk online but never an explanation for this",
        "upvotes": 255,
        "comments": 116,
        "media": null,
        "permalink": "/r/movies/comments/1lxxrjc/marlon_brando_in_apocalypse_now/"
    },
    {
        "id": "1ly12t6",
        "author": "keepfighting90",
        "title": "Before Sunset might be the most perfect sequel ever, and just an incredible movie overall",
        "content": "I decided to jump into Richard Linklater's well-regarded Before trilogy as I recently finished the Normal People series and have been in the mood for melancholy romantic stories. Before Sunrise was really, really good - charming, romantic and captured that exuberance of doe-eyed youthful passion so well.\n\nBut Before Sunset, man, it's just on another level. Maybe it's because I'm the same age as the characters now, in my 30s and married and with some life experience but it felt so resonant. Jesse and Celine have grown and changed over the past decade - they're more jaded and cynical, and not the hopeless romantics they used to be. But this growth is what lends so much more depth and complexity in both personalities and the current state of their relationship, and how much that one night steered the course of their lives in the ensuing years.\n\nAs with Sunrise, the dialogue is really the star here and it's even better than before. Whereas in Sunrise, Jesse and Celine's conversations leaned more towards more fun and youthful and often idealistic, sometimes pseudo-intellectual (makes sense given their age), here they're tinged with a melancholy and occasional bitterness that can only be brought on by experiencing more of life. In Vienna, Jesse and Celine talked about art and love and literature and all these grand, human-condition concepts. Here, they talk about global warming, crime and broken romances. It's actually crazy just how well the script captures just how I've myself been feeling in my 30s.\n\nEthan Hawke and Julie Delpy's chemistry is as amazing as ever, and really sell the whole concept and premise.\n\nAnd that ending? Absolutely perfect. Jesse knows he's going to stay. He's probably known it all along.\n\nCan't wait to finish off the trilogy with Midnight",
        "upvotes": 144,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1ly12t6/before_sunset_might_be_the_most_perfect_sequel/"
    },
    {
        "id": "1lxnwk9",
        "author": "ExistingMarzipan2422",
        "title": "What is the most “bro” movie of all time?",
        "content": "I am going on a bachelor party soon (something chill like cabin in the woods kind of vibe) and the group wants to have a movie night. Someone suggested ‘Gladiator’ stating “that’s just a bro movie”; this inspired me to ask the question….\n\nWhat is the most “bro” movie of all time? \n\nFor me, I was thinking maybe Saving Private Ryan but would love to hear what the community thinks.\n\nCheers!\n\n",
        "upvotes": 1175,
        "comments": 2158,
        "media": null,
        "permalink": "/r/movies/comments/1lxnwk9/what_is_the_most_bro_movie_of_all_time/"
    },
    {
        "id": "1lyh2l2",
        "author": "BunyipPouch",
        "title": "First Poster for Sci-Fi Adventure 'The Man Who Shrinks' - Starring Jean Dujardin ('The Artist') - A shipbuilder inexplicably shrinks &amp; gets trapped in a basement. He must fight for survival in now-hostile ordinary household environment.",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ng7pkydyrjcf1.jpeg?auto=webp&amp;s=746dcad7f8667e2634c814aeb8cd1cb0ad965fcb"
        },
        "permalink": "/r/movies/comments/1lyh2l2/first_poster_for_scifi_adventure_the_man_who/"
    },
    {
        "id": "1lyghs1",
        "author": "Deep_Yoghurt8813",
        "title": "I wanna talk about Kids 1995",
        "content": "I really really, really liked it. It's a super raw and unflinching take on the aids epidemic in the nineties, but also about underage sex. It makes you really feel each of the characters, and I respect it for that, even if it did make for a uncomfortable watch. I already know that not everyone likes it, but I truly think everyone should try this movie at least once in their life. Also the soundtrack is dope lmao. Also for fans of harmony korine and Larry Clark, do y'all think gummo is a good watch",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1lyghs1/i_wanna_talk_about_kids_1995/"
    },
    {
        "id": "1lxcgsm",
        "author": "BunyipPouch",
        "title": "Leonardo DiCaprio’s ‘We Are Guardians’ Documentary Raises $1 Million for Rainforest Preservation Ahead of Theatrical Run - The films is touring nationally and spotlights efforts by Indigenous leaders to protect the Brazilian Amazon amid invasion and deforestation.",
        "content": "",
        "upvotes": 2306,
        "comments": 366,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ayrBSbiKAo7_yRufXmofGeeuTqzztYgt6GKdk1x1Xoc.jpeg?auto=webp&amp;s=e908adec79eae5992239dbba02c54759fb23ac55"
        },
        "permalink": "/r/movies/comments/1lxcgsm/leonardo_dicaprios_we_are_guardians_documentary/"
    },
    {
        "id": "1ly5xd3",
        "author": "KidOrpheus",
        "title": "From François Truffaut, One of the Greatest Film Series in History Gets a 4K Upgrade from Criterion",
        "content": "",
        "upvotes": 20,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eBnnWlm6DvGwLUUiXbtcDzPRhikuu4bJigQGdUyqLtA.jpeg?auto=webp&amp;s=e1076ba60d5e3ccc9e16e558e8f4f71b5d302037"
        },
        "permalink": "/r/movies/comments/1ly5xd3/from_françois_truffaut_one_of_the_greatest_film/"
    },
    {
        "id": "1lxk0aw",
        "author": "CresidentBob",
        "title": "What random joke in a movie makes you crack up every single time you watch it?",
        "content": "For me it’s this scene in Blazing Saddles\n\nhttps://youtu.be/SkKVLGO9Wjc?si=_GUTFCVsLZD8TwK3\n\nIt’s so damn funny. The whole town is getting destroyed and all this guy is worried about is his suit getting muddy. The more I think about it the funnier it is. Classic Mel Brooks joke but for some reason I laugh so hard every time. ",
        "upvotes": 684,
        "comments": 1421,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KyNJtRdufEHpXmwHUqzUmac2EyQOs2ax-qUn--8gptY.jpeg?auto=webp&amp;s=706f5944018a6923ab9a58d9ab595a8b9fe021cc"
        },
        "permalink": "/r/movies/comments/1lxk0aw/what_random_joke_in_a_movie_makes_you_crack_up/"
    },
    {
        "id": "1ly306y",
        "author": "EvadingDoom",
        "title": "Trope: Boss asking if anyone else knows about the crooked cops or spies",
        "content": "A trope that I encountered the other night that I realized I really hate: Main character (spy or cop) discovers someone in their org is crooked. They meet discreetly with someone who's in charge (who they think is not crooked) and tell them what they found. And that person in charge says \"Does anyone else know about this?\"  It drives me nuts. It's a question that translates directly to \"Do I need to kill anyone besides you to keep this from getting out?\" Their motive is extremely obvious, especially if it's the first thing they ask. And the MC always says \"Nope! Just me!\" ",
        "upvotes": 33,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1ly306y/trope_boss_asking_if_anyone_else_knows_about_the/"
    },
    {
        "id": "1lygm4k",
        "author": "dancingbanana123",
        "title": "What age were you when you saw your first rated R movie, and how old do you think your kid would have to be before you'd let them watch one?",
        "content": "I think the first rated R movie I ever saw was when I was 5. My dad let me watch The Shining with him as long as I promised to not wake him if I had a nightmare about it. I remember telling my friends at school the next day how awesome the movie was and how a guy got hit with an axe. From then, my dad would always let me watch any R-rated movie, and then would just cover my eyes if there was any nudity in a scene. If there was a sex scene, he'd send me out of the room and tell me come back later (these were always movies playing on tv, so he had already seen them and knew when those scenes were coming up). The only movies I wasn't allowed to watch were slasher horror movies, mainly because they just knew that'd give me a nightmare. Once I was in like 6th grade or so, they were fine with me watching those.\n\nWhen I talk to others about that though, that apparently wasn't the norm with everyone. I personally liked it and thought I'd be fine with doing the same with a kid, but I'm curious what y'all's experiences were.",
        "upvotes": 4,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1lygm4k/what_age_were_you_when_you_saw_your_first_rated_r/"
    },
    {
        "id": "1lyeix0",
        "author": "Here_we_go_3893",
        "title": "Can you name a movie where all three acts feel like completely different movies?",
        "content": "I can’t seem to think of an example of any.\nI can think of movies where the first act is completely different from the second two. And I can think of movies where the final act is completely different from the first two. But I just can’t think of all three being different.\n\nI’m just curious if there are any examples of this, if so, what are they?",
        "upvotes": 8,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1lyeix0/can_you_name_a_movie_where_all_three_acts_feel/"
    },
    {
        "id": "1lxkdj5",
        "author": "MiserableSnow",
        "title": "California’s Expanded Tax Credit Now Covers Animation",
        "content": "",
        "upvotes": 462,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/puAm1GASoXbXAO1tHU6M43-VDwgTw1prLNOXwgegQao.jpeg?auto=webp&amp;s=19dc9195a23a38af31f65f25880d91f7fdee688f"
        },
        "permalink": "/r/movies/comments/1lxkdj5/californias_expanded_tax_credit_now_covers/"
    },
    {
        "id": "1lxhuin",
        "author": "MarvelsGrantMan136",
        "title": "Legendary Is Mulling Acquisition of Lionsgate Studios",
        "content": "",
        "upvotes": 637,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8fZoEDywEHURXmsEsEG8ngfqGijqtkolKQIC1Y4rP00.jpeg?auto=webp&amp;s=1cc82c4c60454c22dc813bcadb6d223cce0ff14d"
        },
        "permalink": "/r/movies/comments/1lxhuin/legendary_is_mulling_acquisition_of_lionsgate/"
    },
    {
        "id": "1ly8wej",
        "author": "dumbBunny9",
        "title": "Weird Double Feature: \"Videodrome\" &amp; \"Welcome to the Dollhouse\"",
        "content": "My old hometown has a great video rental shop, with thousands of old and hard to find movies. I was there searching for things I can't seem to find on streaming services, and I picked two: \"Videodrome\" and \"Welcome to the Dollhouse\".\n\nI had never seen either, which is why I rented them, but I realized as I was leaving, this is possibly the oddest double feature I have ever seen. I can't imagine that anyone has ever picked these two films to watch together.  \n\nAny really odd double-features you have watched?",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1ly8wej/weird_double_feature_videodrome_welcome_to_the/"
    },
    {
        "id": "1lyfr0p",
        "author": "lockerbiestreet",
        "title": "Choose Your Personal Best Picture Win",
        "content": "I had the pleasure of seeing Mad Max: Fury Road on the big screen and it just convinced me once again that it should've won Best Picture. I think the Oscars would be more culturally relevant if they injected some populism. I think there's some films like \"The Matrix\" or \"Moulin Rouge\" have immense influence in their respective genres and warrant Best Picture recognition. Would love to see your thoughts. If I didn't list something it's because I am not familiar enough with the films to have an opinion. Also I'm a big Fellini fan, which probably swayed me. \n\n* 1934 - It Happened One Night\n* 1935\n* 1936 \n* 1937\n* 1938 - \n* 1939 - Gone with the Wind\n* 1940 - Rebecca\n* 1941 - Citizen Kane\n* 1942 -\n* 1943 - Casablanca\n* 1944 - \n* 1945 - \n* 1946 - It’s a Wonderful Life\n* 1947 - Miracle on 34th Street\n* 1948 - The Red Shoes\n* 1949 - All the King’s Men\n* 1950 - \n* 1951 - All About Eve\n* 1952 - A Streetcar Named Desire\n* 1953 - I Vitelloni\n* 1954 - Rear Window \n* 1955 - Marty\n* 1956 - La Strada\n* 1957 - Nights of Cabiria\n* 1958 - Vertigo\n* 1959 - Ben-Hur\n* 1960 - The Apartment \n* 1961 - West Side Story\n* 1962 - To Kill a Mockingbird \n* 1963 - 8 1/2\n* 1964 - Mary Poppins\n* 1965 - The Sound of Music\n* 1966 - Who’s Afraid of Virginia Woolf?\n* 1967 - The Graduate\n* 1968 - 2001: A Space Odyssey\n* 1969 - Midnight Cowboy\n* 1970 - M*A*S*H\n* 1971 - The French Connection\n* 1972 - Cabaret\n* 1973 - The Exorcist\n* 1974 - The Godfather Part II\n* 1975 - One Flew Over...\n* 1976 - Network\n* 1977 - Annie Hall\n* 1978 - The Deer Hunter\n* 1979 - Kramer vs. Kramer\n* 1980 - Empire Strikes Back\n* 1981 - Raiders of the Lost Ark\n* 1982 - E.T. the Extra-Terrestrial\n* 1983 - Terms of Endearment \n* 1984 - Amadeus\n* 1985 - Back to the Future\n* 1986 - Aliens\n* 1987 - Moonstruck\n* 1988 - Who Framed Roger Rabbit?\n* 1989 - Do The Right Thing \n* 1990 - Goodfellas \n* 1991 - The Silence of the Lambs\n* 1992 - Unforgiven\n* 1993 - Schindler’s List\n* 1994 - Pulp Fiction\n* 1995 - Apollo 13\n* 1996 - Fargo\n* 1997 - Titanic\n* 1998 - Saving Private Ryan\n* 1999 - The Matrix \n* 2000 - Gladiator\n* 2001 - Moulin Rouge!\n* 2002 - Spirited Away\n* 2003 - Return of the King\n* 2004 - Million Dollar Baby\n* 2005 - Brokeback Mountain \n* 2006 - The Departed\n* 2007 - There Will Be Blood\n* 2008 - The Dark Knight\n* 2009 - Inglorious Basterds\n* 2010 - The Social Network\n* 2011 - A Separation\n* 2012 - The Master\n* 2013 - 12 Years a Slave\n* 2014 - The Grand Budapest Hotel\n* 2015 - Mad Max: Fury Road\n* 2016 - Arrival\n* 2017 - Three Billboards...\n* 2018 - Into the Spiderverse\n* 2019 - Once Upon a Time in Hollywood\n* 2020 - Sound of Metal\n* 2021 - Drive My Car \n* 2022 - Tár\n* 2023 - Oppenheimer \n* 2024 - Kinds of Kindness ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1lyfr0p/choose_your_personal_best_picture_win/"
    },
    {
        "id": "1lxvn6t",
        "author": "Entronico",
        "title": "How Many 80s Movie Have This Plot?",
        "content": "An  evil corporate boss is talking over the pizza place/arcade/car wash (wherever the kids hang out) and a ragtag bunch of kids rally to save the beloved hangout.\n\nThey do this in various ways. A breakdancing competition; bikini car wash, skateboarding demo, bake sale or throwing a party.\n\nFor some reason this was an extremely common plot line in the 80s.",
        "upvotes": 28,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1lxvn6t/how_many_80s_movie_have_this_plot/"
    },
    {
        "id": "1lyh38j",
        "author": "Andrewcoo",
        "title": "Is Halloween the only film franchise with at least one major release in six consecutive decades?",
        "content": "Halloween (1978)\n\nHalloween II (1981)\n\nHalloween III: Season of the Witch (1982)\n\nHalloween 4: The Return of Michael Myers (1988)\n\nHalloween 5: The Revenge of Michael Myers (1989)\n\nHalloween: The Curse of Michael Myers (1995)\n\nHalloween H20: 20 Years Later (1998)\n\nHalloween: Resurrection (2002)\n\nHalloween (2007)\n\nHalloween II (2009)\n\nHalloween (2018)\n\nHalloween Kills (2021)\n\nHalloween Ends (2022)\n",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1lyh38j/is_halloween_the_only_film_franchise_with_at/"
    }
]