[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jl0za5",
        "author": "Adventurous_Train897",
        "title": "Torino, pareri sinceri: vita quotidiana tra qualità dell'aria e costi reali",
        "content": "Ciao a tutti! Ho letto tantissimi post di questo sub, ma vorrei delle opinioni oneste e aggiornate al 2025.\n\nSto seriamente valutando di trasferirmi a Torino con la mia famiglia (abbiamo un bambino piccolo) e vorrei conoscere le vostre esperienze dirette su alcuni punti cruciali:\n\n**INQUINAMENTO REALE:** **Quanto pesa davvero lo smog nella vita quotidiana?**\n\n* Chi vive a est del Po (Borgo Po, Cavoretto, Madonna del Pilone) nota differenze tangibili?\n* La collina è una valida alternativa o troppo isolata?\n\n**PRO &amp; CONTRO VARI**\n\n* Quali sono i difetti di Torino che nessuno vi aveva detto prima di trasferirvi?\n* Pro e contro in generale?\n\n**COSTO DELLA VITA**\n\n* Quanto spendete in media per lo svago personale (aperitivi, teatro, eventi culturali, palestra/corsi sportivi)? So che è soggettivo, ma in generale per avere una bella vita sociale e culturale, quanto bisogna mettere in conto a Torino?\n\n**ZONE CONSIGLIATE -** **Se doveste scegliere oggi, dove andreste a vivere in città considerando:**\n\n* Qualità dell'aria\n* Collegamenti con il centro\n* Servizi e vita di quartiere\n\n  \nLavoriamo da remoto, quindi non dovremo affrontare la questione lavoro, ci interessa la qualità di vita (e il relativo costo).  \n\nGrazie mille anticipatamente a chi vorrà condividere la propria esperienza!",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jl0za5/torino_pareri_sinceri_vita_quotidiana_tra_qualità/"
    },
    {
        "id": "1jl638m",
        "author": "BarberIllustrious985",
        "title": "Ripetizioni a Torino",
        "content": "Ciao! Sono uno studente fuorisede del poli e sto cercando di arrotondare qualcosa facendo ripetizioni, ma sembra impossibile trovare qualcuno qui. Ho già provato Letuelezioni, super prof, bakeka, gruppi Facebook e altri siti simili. Qualcuno sa come funziona a Torino? (Ho visto anche per part time nel weekend/domenica ma non so né come funzionano e non ne ho trovati) Grazie in anticipo! :( ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jl638m/ripetizioni_a_torino/"
    },
    {
        "id": "1jkzhba",
        "author": "Sirio_3451",
        "title": "Trasferito a Torino da meno di un anno, cerco nuove amicizie",
        "content": "Ciao a tutti, (30m) mi sono trasferito per lavoro a Torino nell'estate dell'anno scorso, in questo periodo ho fatto qualche amicizia sporadica con il fatto che vado in palestra e pratico un arte marziale ma mi piacerebbe conoscere gente nuova, mi piacciono film, serie TV (fantascienza in particolare), anime e manga, quando posso gioco al PC, se qualcuno ha piacere di fare una chiacchierata, un caffè, una passeggiata mi scriva! ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jkzhba/trasferito_a_torino_da_meno_di_un_anno_cerco/"
    },
    {
        "id": "1jl0u6u",
        "author": "Geralt_of_Bals",
        "title": "Bar o pub per guardare le partite?",
        "content": "Salve Torino, vengo a visitare la città nel weekend però sabato sero vorrei guardarmi Lecce - Roma in un bar/pub, qualche consiglio magari vicino al centro? Se di solito non troppo affollato ancora meglio.\n\nGrazie mille!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jl0u6u/bar_o_pub_per_guardare_le_partite/"
    },
    {
        "id": "1jko01r",
        "author": "Snoo-67870",
        "title": "Posti dove mangiare sotto i 10 euro",
        "content": "Nato e cresciuto a Torino, universitario, vorrei censire un po' di posti dove si possa mangiare sotto i dieci euro che non siano né kebabbari né ristoranti cinesi AHAHAHAHAH (scherzo, i ristoranti cinesi vanno bene).\nL'idea era fare una sorta di lista google, magari collaborativa, che coprisse un po' tutta la città!\n\n\nEcco alcuni ottimi (pessimi) esempi di roba:\nhttps://maps.app.goo.gl/2XJ8opzeDKDABkha7?g_st=ac\nhttps://maps.app.goo.gl/eDMK3waFUDgxbovR6?g_st=ac\nhttps://maps.app.goo.gl/7En4b3R91vDs4Yg67?g_st=ac\n\n\nOppure che so (questo è una hit):\nhttps://maps.app.goo.gl/TL8gRb4gtJcD5nZv8?g_st=ac\n\n\nEDIT: purtroppo siamo arrivati a circa 15 posti, domani mi sa che condivido una lista modificabile da tutti!",
        "upvotes": 19,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sZXOC3nbJnrkBZg_QbCbGauWO1GYLe1vufh5zCuhY0.jpg?auto=webp&amp;s=1bd5b19e6c9a601ebf26b14c0905aa39e5496386"
        },
        "permalink": "/r/torino/comments/1jko01r/posti_dove_mangiare_sotto_i_10_euro/"
    },
    {
        "id": "1jkedn2",
        "author": "RandomRemember",
        "title": "Perchè piove a Torino se sull’app dice che c’è il sole??",
        "content": "É la fine del mondo.",
        "upvotes": 43,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1jkedn2/perchè_piove_a_torino_se_sullapp_dice_che_cè_il/"
    },
    {
        "id": "1jkp1aj",
        "author": "Repulsive-Yak-126",
        "title": "Parts of the city",
        "content": "Cia tutti, my landlord is giving me 3 options, apartment near the milano barieri, lingotto and  Porto nuovo, but the one in Porto nova is kinda shit. What can u tell about lingotto and this place",
        "upvotes": 2,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a8zt4ago44re1.jpeg?auto=webp&amp;s=da5a96f5c4217296ac8a8882260def09439007b3"
        },
        "permalink": "/r/torino/comments/1jkp1aj/parts_of_the_city/"
    },
    {
        "id": "1jka9d3",
        "author": "Andrea-Franeschi",
        "title": "Giro delle Fiandre",
        "content": "Ciao a tutti, sto cercando compagni di viaggio per andare a vedere il Fiandre partendo in bici da Torino. \n\nL’idea sarebbe fare Flixbus (o treno) fino a Parigi e poi, passando per Roubaix, proseguire verso uno dei muri classici per vedere la gara e lunedì tornare a Parigi e prendere il treno per Torino.\n\nSarà tutto un po’ low budget, sto valutando se portarmi la tenda o appoggiarmi a degli ostelli economici\n\nSono molto flessibile con i piani, è un’improvvisata, una piccola avventura, nessuna tabella di marcia precisa.\n\nAccetto anche consigli su dove mettersi per vedere la gara!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jka9d3/giro_delle_fiandre/"
    },
    {
        "id": "1jkmpux",
        "author": "therapeutic_Grizzly",
        "title": "Apertivo/pasto laurea Politecnico",
        "content": "Buonasera a tutti! \nAd aprile dovrei festeggiare una laurea zona politecnico, non sapendo ancora a che ora sarà, stavo valutando luoghi sia per un aperitivo o un pranzo/cena. Qualcuno di voi ha qualche consiglio per un locale in questa zona? \nConosco già Aldo's bakery ma stavo valutando anche altri luoghi. Vi ringrazio ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jkmpux/apertivopasto_laurea_politecnico/"
    },
    {
        "id": "1jk8wwn",
        "author": "Mv3tt",
        "title": "Migliori pizzerie napoletane",
        "content": "Buondì, leggendo i vari post su questo subreddit, ho notato che spesso la discussione degenera su pizzerie molto buone ma non napoletane.\n\nVorrei che questo post fosse un hub esclusivamente incentrato sulla pizza napoletana e su quali pizzerie a Torino siano più abili nel rispettarne la tradizione. \n\nVi ringrazio in anticipo per i consigli!",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1jk8wwn/migliori_pizzerie_napoletane/"
    },
    {
        "id": "1jkbhsn",
        "author": "AxelRowley",
        "title": "Riparazioni pc",
        "content": "Ciao a tutti, qualcuno saprebbe consigliarmi un buon centro assistenza per riparazioni pc con prezzi quantomeno onesti? Ho un pc fisso che ha deciso di abbandonarmi e vorrei almeno provare a ripararlo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jkbhsn/riparazioni_pc/"
    },
    {
        "id": "1jjpekw",
        "author": "Ultraviolet_law",
        "title": "A Torino da poco, vorrei davvero evitare di chiudermi in casa dopo il lavoro",
        "content": "Salve a tutti, come da titolo sono da poco a Torino per questioni lavorative. Non ho contatti qui, e se ho capito l’andazzo finirò molto probabilmente a diventare un totale asociale entro le prossime due settimane, cosa che vorrei evitare. Sono un ragazzo di 26 anni, pratico la palestra, il teatro, e apprezzo i manga e i videogiochi, nonché sfornare dolci.\nQuindi se qualcuno fosse nella mia stessa situazione e volesse uscire a bere qualcosa mi farebbe molto piacere, mi piacerebbe farmi nuovi amici già dall’inizio (non gente troppo più piccola di me pls) ",
        "upvotes": 29,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1jjpekw/a_torino_da_poco_vorrei_davvero_evitare_di/"
    },
    {
        "id": "1jkeaev",
        "author": "peter_plays",
        "title": "Petizione",
        "content": "Petizione per riempire di piscio e sborra la buca davanti all incrocio dell Lidl e del giropizza se volete partecipare lasciate un commento di conferma ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jkeaev/petizione/"
    },
    {
        "id": "1jk8uzb",
        "author": "Alux_11",
        "title": "Amicizie a Cenisia/San Paolo",
        "content": "Ciao a tutti!\n\nSono un fuorisede di 22 anni che si è trasferito da qualche mese a Torino per frequentare la magistrale in Computer Science al poli.\n\nSono abbastanza nerd e appassionato della fantascienza, amante della natura e LGBT friendly🏳️‍🌈\n\nSe qualcuno ha voglia di uscire per fare due chiacchiere e bere qualcosa contattatemi ;)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jk8uzb/amicizie_a_cenisiasan_paolo/"
    },
    {
        "id": "1jjgua1",
        "author": "ItaSecretaccount",
        "title": "Escort e centri massaggi consigliati a Torino",
        "content": "Salve, mi sono arreso all'idea che una relazione romantica non sia possibile e sto cercando escort o centri massaggi per cui valga la pena spendere i soldi che risparmierò non uscendo più con nessuno.\nGrazie in anticipo per le risposte ",
        "upvotes": 16,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1jjgua1/escort_e_centri_massaggi_consigliati_a_torino/"
    },
    {
        "id": "1jjkd17",
        "author": "sturmfrey",
        "title": "Ammenda ingiusta gtt",
        "content": "Ciao. Sono uno studente che vive a Torino e ho ricevuto una tessera annuale GTT a gennaio. La settimana scorsa, l'assegno gtt è arrivato sul tram in cui mi trovavo e dopo averlo visto, mi sono reso conto di aver lasciato il portafoglio a casa. Immediatamente tocco il mio telefono per pagare a bordo e vengo multato perché ho pagato quando l'ho visto (avrei pagato se avessi saputo che non avevo la mia carta con me all'inizio del viaggio. Ho pagato 1 fermata dopo) \nMi ha detto di presentare il mio passaporto e di pagare 17 €, ma non portavo con me il mio passaporto. Così mi ha detto di pagare 39 € ed entro 7 giorni, di portare il mio passaporto e la mia carta GTT alla stazione GTT per ottenere un rimborso di 20 € perché se ho un abbonamento, devo pagare solo 17 €. \nIeri sono andato alla stazione porta nuova e la signora non parla inglese. Alla fine hanno trovato qualcuno da tradurre e mi hanno detto che non possono rimborsarmi 20€. Dice che sarei dovuta venire a pagare la multa di 17 € alla stazione. ma dato che ho già pagato la multa di 37 € sul tram, non possono restituirmi 20 €. \nOra mi chiedo, com'è possibile? Il loro stesso impiegato mi ha incaricato di farlo e mi ha fatto pagare la multa. Perché devo pagare 20 € in più quando dice chiaramente nelle regole GTT che se hai un abbonamento valido e vai alla stazione prima di 7 giorni dalla multa, paghi solo 17 €. Non sono responsabile per l'errore di comunicazione tra i dipendenti, ma sono solo uno studente per il quale 20 € sono un sacco. in particolare quando ho pagato 255 € per una carta intera. \n\nLa signora alla stazione mi ha detto di scrivere una e-mail e forse tra due mesi, potrebbero rispondere e vedere il caso. Com'è possibile? È certo che otterrò il rimborso? Non lo so \n\nSono molto deluso e confuso su come affrontare la questione. Mi dispiace, sto anche usando un traduttore  \n",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jjkd17/ammenda_ingiusta_gtt/"
    },
    {
        "id": "1jjo030",
        "author": "SkyMilesEnthusiast",
        "title": "Question about renting with Prohouse",
        "content": "Hello, I am looking for places on idealista and have been talking to Prohouse about a short-term rental in Torino. \n\nThey want one month of rent to reserve the apartment, and then two months of rent as a security deposit for the registrazione del contratto. Does this sound like a scam, or is it normal for Turin/Italy? Thank you in advance :)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jjo030/question_about_renting_with_prohouse/"
    },
    {
        "id": "1jjm2z5",
        "author": "Intelligent-Deal-759",
        "title": "Cercasi: partite di pallavolo o beach volley",
        "content": "Ciao a tutti! \n\nSapreste dirmi se esitono app o gruppi facebook / telegram dove posso trovare persone interessate ad organizzare partite di pallavolo o di beach volley.\n\nLo cerco per divertimento e non perché sia forte.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jjm2z5/cercasi_partite_di_pallavolo_o_beach_volley/"
    },
    {
        "id": "1jjdqf3",
        "author": "Alchimista95",
        "title": "Parlare inglese con qualcuno",
        "content": "Cerco un posto in cui - possibilmente il weekend - si possa parlare con gente inglese per imparare la lingua, ovviamente gratis.\nAvete idee? ",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jjdqf3/parlare_inglese_con_qualcuno/"
    },
    {
        "id": "1jj7hpb",
        "author": "Original_Draw_9492",
        "title": "Pista sul tetto di Lingotto",
        "content": "È un po' imbarazzante da chiedere ma...🙈 \nEsattamente come si arriva sulla pista sul tetto del centro commerciale lingotto? Ci si può accedere liberamente e gratuitamente in qualsiasi momento o solo durante eventi particolari? Non sono di Torino come si può evincere ma ci vivo da poco 😁",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1jj7hpb/pista_sul_tetto_di_lingotto/"
    },
    {
        "id": "1jjln3j",
        "author": "Pablitos1989",
        "title": "Serata per fare nuove conoscenze",
        "content": "Sei pronto per un’esperienza unica che unisce il mistero dei tarocchi alla magia dei cocktail hawaiani? Allora non puoi perderti TIKI &amp; TAROCCHI, la serata speciale che si terrà giovedì 27 al Manatiki a partire dalle 20:00!\nLa serata sarà animata da giochi coinvolgenti e attività di socializzazione, perfetti per rompere il ghiaccio e trascorrere momenti indimenticabili con vecchi e nuovi amici.\nIngresso gratuito ma prevista una consumazione \nSul food ci sarà lo sconto del 30% sul menù alla carta inoltre calice di prosecco di benvenuto per tutti i partecipanti.\n\n✨ PERCHÉ NON PUOI MANCARE? ✨\n✔ Scopri il tuo futuro con la lettura dei tarocchi 🃏\n✔ Prova i fantastici cocktail hawaiani 🍍\n✔ Partecipa a giochi e attività di gruppo 🤩\n✔ Vivi un’esperienza unica in una location suggestiva 🌴\n\n📍 DOVE &amp; QUANDO? 📌 Manatiki 📅 Giovedì 27 ⏰ Dalle ore 20:00\n\nlink di iscrizione:\nhttps://ciboetrash.it/evento-a-torino-tiki-e-tarocchi/",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gnAnbtqmpF607rbF-NQF4rWfUNjZ9dE9vTz0T0EE_MY.jpg?auto=webp&amp;s=a4bee211b530dcc86f2a139006b2cd7289e4a74d"
        },
        "permalink": "/r/torino/comments/1jjln3j/serata_per_fare_nuove_conoscenze/"
    },
    {
        "id": "1jjjktw",
        "author": "DPPenjoyer18",
        "title": "Trasferimento a Torino per lavoro, affitti e a cosa prestare attenzione?",
        "content": "Salve a tutti. Volevo chiedere quali sono i canali migliori per trovare affitto a Torino e se c’è qualcosa in particolare a cui “prestare attenzione” negli annunci. Per ora stavo guardando sui classici gruppi Facebook ma ogni consiglio è ben accetto ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jjjktw/trasferimento_a_torino_per_lavoro_affitti_e_a/"
    },
    {
        "id": "1jjhhjn",
        "author": "ManhattanChristmas25",
        "title": "Things to do in Torino in under 24h",
        "content": "Ciao tutti, I this weekend I’m going to be in Torino for just under 24h (arriving at around noon and leaving around noon the next day). What would you recommend I do to get the most out of the city during that time? Like things to see, do and eat! Thanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jjhhjn/things_to_do_in_torino_in_under_24h/"
    },
    {
        "id": "1jj4vjc",
        "author": "Davidriel-78",
        "title": "Langhe con bambini",
        "content": "Ho cercato prima altri sub, ma non mi pare di aver trovato molto, quindi scrivo qui. \n\nÈ nostra intenzione passare il periodo fra pasqua e il 25 Aprile nelle Langhe, siamo 2 famiglie con bambini medio piccoli, 8 in tutto.\n\nPasseremo probabilmente dal parco Zoom poi vorremmo scendere e passare qualche giorno nelle Langhe con obiettivo cibo/vino.\n\nL’ideale sarebbe una o più cantine/agriturismo che abbiano anche ristorante e camere. \n\nMagari avete qualche consiglio.\n\nAlba sarebbe comunque una buona base nel caso ?\n\nCosa non perdere oltre alle panchine giganti ?\n\nGrazie",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jj4vjc/langhe_con_bambini/"
    },
    {
        "id": "1jj31lk",
        "author": "travelergigi",
        "title": "Can you recommend nice places/ideas to celebrate birthday with girls/friends? I am gonna be 28☺️",
        "content": "",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jj31lk/can_you_recommend_nice_placesideas_to_celebrate/"
    },
    {
        "id": "1jiw1z4",
        "author": "RiddleyThomas",
        "title": "Costituzione gruppo Bob Dylan",
        "content": "Sono un perduto amante del Dylan acustico, ma proprio perso. Cerco altri in modo da creare un gruppo (della serie The more The merrier) tutti con chitarra per fare un coro delle più belle canzoni di Dylan. C'è ad esempio Piazza Botticelli adiacente alla Coop che si presterebbe bene. Una cosa da finire su La Stampa, tanto per capirci. Io non giovanissimo, ahimè, ma cantare e suonare insieme non avrebbe prezzo. Ci va un 'capobanda', insomma uno un po' esperto rispetto a tanti beginners che faccia da catalizzatore. Solo amanti del Dylan acustico.",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hlqbfjhq7oqe1.jpeg?auto=webp&amp;s=ea6406ba578cc775221957798cca6f1c1fc25630"
        },
        "permalink": "/r/torino/comments/1jiw1z4/costituzione_gruppo_bob_dylan/"
    },
    {
        "id": "1jjasv7",
        "author": "Platform_Crocs",
        "title": "Having second thoughts about moving to Torino",
        "content": "Hey Guys, \n\n  \nSo I *should* be moving to Torino in around August. I got accepted into UniTo, however I also got accepted into Sapienza and it's making me have second thoughts going to Torino .\n\nTo preface, I lived in Rome for a year between 2023-2024 (I also lived in Venezia but that's neither here nor there). \n\n  \nI loved living in Rome, however my financial situation was different then. I was living in a large flat with close friends in the center of Rome and spending an absurd amount of money without needing to work. This time around my rent budget is much lower and I definitely will have to work and overall spend less money. I don't want to feel like im \"settling\" for Torino since it's overall a cheaper city, but I don't want to feel like I'm chasing the past either. \n\n  \nI stayed in Torino for roughly a month in San Salvario and have a decent amount of friends there, but a month wasn't/isn't enough time to gauge how good life is there. \n\nMy Pros for Torino are:\n\n\\-Cheaper\n\n\\-Better Organized\n\n\\-Better transportation\n\n\\-BIKE FRIENDLY!!!!!!\n\n\\-Have *some* friends there\n\n\\-Can rent a flat near the city center \n\n\\-LE MONTAGNEEEE (I'm from NYC to being so close to the alps and having hiked them when I stayed there is so mind-blowing) \n\nCons:\n\n\\-IDK what the day-to-day is really like, since I was essentially a tourist for a month.\n\n\\-Less friends than Rome\n\n\\-Much smaller city than Rome and my home City (NYC)\n\n  \nMy Pros for Rome are:\n\n\\-It's familiar, I can navigate the city blindfolded if I needed to\n\n\\-The majority of my friends are there\n\n\\-Huge city that I can explore something new about everyday/continuously meet new people\n\n\\-It's absolutely beautiful, and I'm super nostalgic of it  \n\n\\-Have family in the Lazio region, however I'm not super close with them (2nd/3rd cousins) \n\nCons:\n\n\\-SOOOOO UNORGANIZED -&gt; Since I'll most likely have to work and attend school the thought of having to commute around the city makes me want to blow my brains out\n\n\\-My friends that go to Sapienza do not speak highly of it, it seems as disorganized and chaotic as the city itself \n\n\\-I definitely won't be living in the city center and will have to live a little bit outside the inner ring or near one of the train stations\n\n\\-Feeling like i'll be chasing the past/already lived in Rome so maybe it's time to experience something new? \n\n\\-Piggybacking off the last con, it may just overall be unhealthy for me lol \n\n\\-So many tourists it's almost unbearable in the summer\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n  \nFor those living in Torino and the Torinesi , how is day-to-day life there? I have Italian citizenship, so working and studying won’t be an issue visa-wise. I speak decent Italian and currently work as an English teacher in NYC during the school year teach at university classes in the summer. I’ve also worked as a newspaper editor.\n\nI have enough savings to cover rent for 2-3 years if it averages around €600/month, and I’m familiar with job prospects in Rome. There’s a large Anglo-\"Expat\" (I hate that word) community in Rome, but staying in that bubble can be super depressing.\n\nWould love to hear your guy's thoughts. ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1jjasv7/having_second_thoughts_about_moving_to_torino/"
    },
    {
        "id": "1jjfn66",
        "author": "Plane-Promise-9927",
        "title": "Dove posso trovare cioccolata di Dubai?",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jjfn66/dove_posso_trovare_cioccolata_di_dubai/"
    },
    {
        "id": "1jj3q3c",
        "author": "mandrake_55",
        "title": "Corsi di inglese validi ed al giusto prezzo a Torino?",
        "content": "Avreste dei corsi di inglese da consigliare, adatti ad un ragazzo di 26 anni, da fare a TO in presenza?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jj3q3c/corsi_di_inglese_validi_ed_al_giusto_prezzo_a/"
    },
    {
        "id": "1jirs92",
        "author": "Ana_1113",
        "title": "affordable nail technician",
        "content": "girlsssss I need an affordable nail tech to do gel nails, I really need some nails in my life I feel naked without them since I came here :((( location is irrelevant just not too pricey ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jirs92/affordable_nail_technician/"
    }
]