[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oyfyts",
        "author": "cheeseymom",
        "title": "Is anyone else who really enjoyed stranger things just completely lose interest with how long they took?",
        "content": "I don't even know if I'll bother to watch the 5th season. I remember liking and enjoying all the others but it's been so long I forgot most of it and now I just don't even care. It's a shame they couldn't have just ended it in a timely manner.",
        "upvotes": 572,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfyts/is_anyone_else_who_really_enjoyed_stranger_things/"
    },
    {
        "id": "1oy8xt1",
        "author": "nettspendfannn",
        "title": "This household update is terrible",
        "content": "I can't use Netflix anymore because my sister went to college and has Netflix set up there. So now its giving me this bs about not being part of the house hold. FIX THIS NETFLIX",
        "upvotes": 116,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8xt1/this_household_update_is_terrible/"
    },
    {
        "id": "1oyd7tp",
        "author": "Not_Serial_Murdering",
        "title": "What is a movie/show on Netflix that most people haven’t seen, but you’d insist they should watch?",
        "content": "Just like the title says, what movies and shows did you love that most people probably haven’t seen? Sometimes it feels like I’ve seen everything that’s worth watching on Netflix. So what would you guys recommend that most people probably haven’t watched? ",
        "upvotes": 35,
        "comments": 202,
        "media": null,
        "permalink": "/r/netflix/comments/1oyd7tp/what_is_a_movieshow_on_netflix_that_most_people/"
    },
    {
        "id": "1oybrum",
        "author": "Overall-Path-4686",
        "title": "Claire Danes’ Lip Quiver in The Beast In Me",
        "content": "Pretty good show, and Claire Danes is great in it but her lower lip quivers in every single emotionally intense scene and it’s so distracting. \n\nWould have loved if she picked a single other way to communicate emotion in her face besides a lip quiver.\n\nDid anyone else notice this?",
        "upvotes": 42,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1oybrum/claire_danes_lip_quiver_in_the_beast_in_me/"
    },
    {
        "id": "1oyog59",
        "author": "creepy-bastard",
        "title": "I paid but I can’t watch",
        "content": "Hi everyone,\n\nI’m having a weird issue with my Netflix account. On the homepage, it says I can **reactivate my subscription**, but somewhere else it also says **“successfully cancelled.”** I didn’t cancel anything.\n\nWhen I check my account billing, the payment was deducted a few days ago for the next 4 weeks. So my subscription is clearly active, but I **cannot watch anything**.\n\nI contacted Netflix via email, and they replied telling me to use the **support chat or phone**. The problem is, **both chat and phone are broken** for me – I always get an error like “something went wrong, please try again later.” I also tried **different browsers**, but nothing worked.\n\nI live in **Germany**, if that matters.\n\nIf I reply to the email explaining that the chat and phone don’t work, they just send the **same answer again**, telling me to use chat or phone.\n\nSo I’m stuck in a loop: I **paid**, I **can’t watch**, and the **support channels are broken**. It seems like my account might actually be broken.\n\nHas anyone else experienced this? Any ideas on how to fix it when Netflix support is unreachable?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oyog59/i_paid_but_i_cant_watch/"
    },
    {
        "id": "1oy8ryq",
        "author": "baggagefree2day",
        "title": "Beast in Me",
        "content": "SPOILERS)What does everybody think about this? I’m on the second or third episode and seriously there are so many inconsistencies. Niles has the most top notch security system in the world on his mansion, but an FBI agent can sneak in through a window that doesn’t trigger any alarms?. He has no cameras in his office?. He’s not notified when somebody tries to access his files?\nAnd I didn’t even think it was possible for anybody to just knock out a Belgian malinois. And what makes them not even consider the fact that the bodyguard is tapping her phone.",
        "upvotes": 23,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8ryq/beast_in_me/"
    },
    {
        "id": "1oykc6y",
        "author": "Skyropop",
        "title": "Netflix acts as if I cancelled my membership",
        "content": "So I’m a long time subscriber of Netflix. Few days ago all of a sudden Netflix is acting as if I cancelled my membership, gives me error E111 on mobile, asks me to send me a link to my phone via SMS when I try to watch on TV. There is a timer that shows for how long the link is valid, counting down 5 minutes, but always after 5 seconds the tv will just skip to the screen where I can select which plan I want to buy. When I try to select a plan I get an error. When I try signing in on web, I get an error telling me to try again later and that they are having tech issues. Support chat is not available for some reason, calling them doesn’t work as well. No VPNs, no multiple households. Just all of a sudden stopped working. I see that my last billing was a few days ago and actually left my banking acc. What can I do?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oykc6y/netflix_acts_as_if_i_cancelled_my_membership/"
    },
    {
        "id": "1oyp7dm",
        "author": "JJZ4130",
        "title": "Netflix at work",
        "content": "I've been using my Netflix account at work for years. Yesterday I got a message that I could only sign in temporarily because it wasn't my home wifi. I already pay for 2 households and 4K. Couldn't find a number to call or anything on the help page. Anyone else having this issue? Thinking I'll just cancel.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyp7dm/netflix_at_work/"
    },
    {
        "id": "1oyo7ch",
        "author": "daboytommy420",
        "title": "Downloads not loading properly",
        "content": "When I download a movie or episode on my iPhone and go into airplane mode, the first few minutes play fine — but then it starts acting up. If I fast forward, it just loads forever. If I let it play naturally, it works for a bit, but as soon as I leave the app and come back, it gets stuck loading again.\n\nI’ve already tried reinstalling the app, redownloading the titles, and restarting my phone — no luck.\n\nHas anyone else experienced this or found a fix?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyo7ch/downloads_not_loading_properly/"
    },
    {
        "id": "1oyo2v8",
        "author": "scayrux",
        "title": "Descriptie audio automatically turns on, i cant turn it off",
        "content": "So like a couple of months ago every time we start netflix on our tv it has descriptive audio as default (as in reading everything that is on the tv out loud, profile names, series names, how much time is left in the episode, etc)\n\nI already tried to go in my tv accessibility settings and turn thay off but it shows that it is already off, this exclusively happens on netflix and i cant find any option to turn that off, the only way that seems to work for a couple days is pluging the tv off and on but as i said it just comes back after a while, how can i solve this problem permanently?\n\nSorry for my bad english",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyo2v8/descriptie_audio_automatically_turns_on_i_cant/"
    },
    {
        "id": "1oynoik",
        "author": "UnWishedJack",
        "title": "I'm having an issue where I cannot get up the list of episodes",
        "content": "I'm using Netflix on Fire TV stick, it says continue watching my show, I click on it and it plays my current episode fine. But there's no option to go back to a previous episode. Usually when I press the back button I see a list of all the seasons but now it just takes me back to the home screen. The episode selection screen is gone for me. I've tried reinstalling, same issue \n\n*Update* I found it, there a new button at bottom screen when episode is paused called episode and details have to go there now ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oynoik/im_having_an_issue_where_i_cannot_get_up_the_list/"
    },
    {
        "id": "1oymqeo",
        "author": "AmiMist90",
        "title": "Can I check if a gift card has been used without using it?",
        "content": "If I enter the code without creating an account, can i just see if it is valid witbout using it, and not proceed, or will the code be ruined? \n\nAll I want is to see if it is still valid. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oymqeo/can_i_check_if_a_gift_card_has_been_used_without/"
    },
    {
        "id": "1oyidcw",
        "author": "Agreeable-Bike-3782",
        "title": "Netflix version no. removing chromecast option ( android)?",
        "content": "Does anyone know? Updated by mistake and will roll back.....thanks. Either that or will the  android cast screen option work on a tablet?  Now im just using up the minimum character limit for posting... ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyidcw/netflix_version_no_removing_chromecast_option/"
    },
    {
        "id": "1oyfpga",
        "author": "lillie_connolly",
        "title": "Frog - some questions",
        "content": "I just watched the show Frog, it's pretty good with a great vibe and an interesting story, it's just that character behaviors are absurd. Can someone explain the following:\n\n1. Why can't the protagonist report her to the cops over what she is doing to him (ignoring the kid)? \nI genuinely don't understand why the fact that he cleaned up after her makes him her hostage. She doesn't want the cops to know that she killed the kid, ok. But what does she actually have on him at all, there is no clear proof that he knew she did it when he cleaned up, and nothing stopping him from just reporting her now for harassment and trespassing - what will she do, say \"btw I also killed a kid last year and he might have realized it but didn't report me?\" There's really nothing keeping him from reporting her over what she is doing then. \n\n2. Why does he act like he can't report her for killing the kid due to lack of evidence? If he was going to report her for killing the kid, he wouldn't even need all that, since presumably the child and her personal life can be investigated and people would have noticed her child missing in real life. I do understand why he doesn't want to report it at first, I just think that acting like later he can't do it because she stole a recorded confession and a video of her leaving alone doesn't really make much difference if he wanted to talk about it\n\n\n3. Why does everyone in the show act like its impossible to arrest a person for anything unless I guess you catch them in the act? On one hand this guy thinks he will get in trouble for simply not reporting a murder no one can even prove he really knew of, and yet this woman literally slams into his car in front of the police station, walks around like a maniac , ultimately assaults (to the point where its an attempted murder) that guy and the protagonist's daughter, and yet she walks because the case isn't solid enough? I mean what more do you need aside from the two victims saying she did it to them. It's just ridiculous that on one hand you can stab and attack people but the cops can't do anything , but a guy will live like a hostage over fear of what an allegation (from the murderer) about him covering up a crime would do to him?\n\n4. Why wouldn't the father of the child report his son missing? Again, if he was in her custody and disappeared, you don't exactly need to have a footage of her killing the kid to build a case.\n\n5. Why doesn't the protagonist consult anyone, ever? Even if he was so scared of the cops, it makes no sense not to warn his daughter about the psycho who is harassing him and threatening her life. He has friends, connections, but just stays silent as if her throwing an allegation on him for supposed cover up (which can only harm her) is a figurative gun pointed at his head. Why would most people who know him even care or believe her? \n\n6. Why does the protagonist at no point change the locks?\n\nI almost burst out laughing when the genius cop (who literally did nothing to solve the case and seems to share the view raised in my point 3.) told him that he acted like any person would in his situation.\n\nFinally, this is just something I noticed in several Korean crime shows I recently watched (I still really like them), there seems to be a trend of functioning adults being ridiculously gullible and just taking everyone for their word even when it's totally absurd. Like if you just make a convoluted and dumb threat or if a totally untrustworthy person makes a promise, characters treat it like the most solid logic they can't possibly argue against.\n\n\nOverall the concept was good and I love this type of a thriller, I just think more solid rationale should have been given behind some actions. \n\nFinal comment - the psycho woman was so convincingly grating, I rarely genuinely detested a character so much, even though the protagonist himself was frustrating in his choices. I'm not even talking about the fact that she is clearly a maniac, but even her gestures, laughter, mannerisms, all made me feel this unusual aggression. I wanted to see her get punched, and it seems the show was very self aware that she'd evoke this reaction because she does get punched a lot and it's always really satisfying.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfpga/frog_some_questions/"
    },
    {
        "id": "1oykhvy",
        "author": "Janawham_Blamiston",
        "title": "If I remove something from my watch history, will it autoplay episodes again?",
        "content": "There are certain shows my son watches (Blippi's Job Show and Teletubbies, namely) that he likes to watch repeatedly. However, when starting back at episode 1 of these shows, instead of just autoplaying the next episode, it goes to the \"If you liked this...\" screen, and then when manually going to the next episode, it automatically starts at the credits.\n\nThese are the only two shows I've run into that does this, but it makes it a pain. But yeah, if I remove them from my watch history, will Netflix forget that I watched them and play them right?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oykhvy/if_i_remove_something_from_my_watch_history_will/"
    },
    {
        "id": "1oy9qdc",
        "author": "TheBrokeBroker",
        "title": "Fake IMDB reviews for Netflix shows",
        "content": "I’ve noticed over the years that many Netflix shows get review-bombed on their premiere day. The latest example is the Japanese series *Last Samurai Standing*. On the day it premiered, it suddenly had around 2,000 six-star reviews on IMDb, and almost none of them included any kind of in-depth written review.\n\nAt the same time, the show sits at 100% and 95% on Rotten Tomatoes.\n\nIMDb is owned by Amazon, which is a direct competitor to Netflix through Prime Video. I can’t help but wonder whether Amazon benefits when new Netflix titles are flooded with early low ratings, especially since user scores are one of the first things people check before deciding what to watch. What are your thoughts about this?",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oy9qdc/fake_imdb_reviews_for_netflix_shows/"
    },
    {
        "id": "1oyjwbq",
        "author": "Proper_Caterpillar22",
        "title": "Xbox app and Kids",
        "content": "Just wanted to give a little PSA to parents who have children. If you have Netflix installed on your console, *anyone* can launch the app without a Xbox account signed in. If you have logged into Netflix with a Netflix account then *anyone* can watch whatever content they want, what ever rating they want. \n \nI am a parent of 3 kids and have taken what I thought to be reasonable steps to ensure that screen time was strictly enforced via Xbox app and family settings with screen time limits and password protected accounts. Every app on the Xbox requires an account to be signed in, every one but Netflix. \n \nToday I happen to be downstairs at 5am(I am usually at work by this time but called in sick and was grabbing some cough syrup) when I heard my son moving upstairs and decided to blend into the shadows and see what he was up to(he’s supposed to be grounded for bad grades). Well sure enough he came downstairs, turned on the Xbox, and I watched him go from the log in screen on the Xbox to the apps list and pull up Netflix, and the app immediately went straight to the profile screen. Now luckily ( or maybe he had a feeling) he clicked on kids profile and started watching “lost in space” BUT my wife’s profile is still signed in so if he wanted to he could have just as easily started watching Castlevania or the Witcher or worse. \n \nIt just sucks that companies keep dropping the ball with parental controls. If my son was on his account and tried to open Netflix, the Xbox won’t let him because it’s blacklisted from his account. If you try and open Disney+ without first signing into an Xbox account you get the error “please sign into with an Xbox account first” just like every other app or game on the console. Netflix is the only one that lets you bypass the Xbox account login. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyjwbq/xbox_app_and_kids/"
    },
    {
        "id": "1oxr666",
        "author": "Kendikay1966",
        "title": "Dept. Q",
        "content": "Anyone else watching??  The first episode I was ready to call in the chips.  Then the second…getting warmer.   I’m into the 7th episode…WOW!  It’s got me hooked!   The acting’s excellent and the story line keeps you guessing.   So good.   Highly recommend.   ",
        "upvotes": 64,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr666/dept_q/"
    },
    {
        "id": "1oyboo6",
        "author": "DavidinCincinnati",
        "title": "Netflix Removed the ability to cast",
        "content": "They have REMOVED the cast icon and feature, I did a chat with their help and they confirmed, now I can no longer cast to my Chromecast to watch on the TV, I threatened to cancel if they don't restore.",
        "upvotes": 5,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1oyboo6/netflix_removed_the_ability_to_cast/"
    },
    {
        "id": "1oyd3n8",
        "author": "Mountain_Meringue_80",
        "title": "Newly Rich, Newly poor",
        "content": "Has any one seen the series newly rich , newly poor, andres ferriera is so freaking hot, and it has over 120 eps , I'm addicted to the show, The show is very cheesy, and hooks us to watch it, just for light hearted entertainment, but it has more than 120 eps, im excited to how they could have possible stretched thoese many eps lol,",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oyd3n8/newly_rich_newly_poor/"
    },
    {
        "id": "1oycsir",
        "author": "Green-Profile-8400",
        "title": "Everything i watch on Netflix is Grainy",
        "content": "I have a S95C, and use a amazon ultra firestick. I have original match frame rate on. I have the auto picture quality on as well. Yet when I play movies or TV shows on Netflix I can see a graininess on the picture. How do I fix this?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oycsir/everything_i_watch_on_netflix_is_grainy/"
    },
    {
        "id": "1oy3ff6",
        "author": "frostybookworm",
        "title": "Shows like Squid Games and Alice in Borderland?",
        "content": "Looking for similar shows to watch. Or if you enjoyed these shows, what other shows would you recommend? I like survival games and win or die kind of shows. The hunger games is also a favourite of mine. Any ideas? Thanks ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oy3ff6/shows_like_squid_games_and_alice_in_borderland/"
    },
    {
        "id": "1oxirji",
        "author": "Short_Pin_6243",
        "title": "The Beast and Me is one of the best drama shows Netflix has put out in awhile *no spoilers*",
        "content": "*****The Beast In Me******* is the title\n\nNot going to get into specifics because it’s brand new and don’t want to ruin it for anyone else. \n\nBut there was a time when Netflix put out pretty good tv dramas yearly. That time has been replaced as of recent by some pretty big misses.\n\nEven the shows I can think of from this year like Untamed, Wayward, Waterfront, Hunting Wives, Black Rabbit etc are all lacking a lot. It feels like the only shows Netflix sometimes hit on are British dramas. \n\nSo if you are reluctant to check it out, don’t be. (In my opinion of course) ",
        "upvotes": 96,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1oxirji/the_beast_and_me_is_one_of_the_best_drama_shows/"
    },
    {
        "id": "1oxyx1x",
        "author": "rdv100",
        "title": "Physical Asia is one of my favorite shows now",
        "content": "The show is about six people representing six countries (I think there are six countries):\n\n* Australia\n* Korea\n* Japan\n* Australia\n* Mongolia\n* Thailand\n* Turkey\n\nThey fight with each other to show which country has the strongest people.\n\nIn this show, although it starts slow, there are so many neck-and-neck matches between different teams representing different countries in Asia. It's absolutely fascinating and amazing, and there were some that were truly mind-blowing to see the intensity and also some of the games where these underdogs beat these obvious leaders or at least who look like obvious leaders. \n\n  \nAnyway, I'm personally enjoying it. I encourage you to also check it out. Definitely, I think episodes 2 and 3 onwards it becomes very intense, so if things feel a little slow in the first episode, don't give up. I highly recommend it. \n\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxyx1x/physical_asia_is_one_of_my_favorite_shows_now/"
    },
    {
        "id": "1oybf24",
        "author": "Mountain-Bid4317",
        "title": "How much Netflix do you watch per day?",
        "content": "I know Netflix is massively popular, but how much time per day do you spend on the platform? Me personally, I subscribe to several cheaper services that are discounted, but looks like Netflix has a lot of variety. I tried posting this on r/tv, but deleted it...not sure that sub's big on Netflix lol. ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1oybf24/how_much_netflix_do_you_watch_per_day/"
    },
    {
        "id": "1oxz7p2",
        "author": "dcthegeek",
        "title": "The new TV interface is horrible",
        "content": "Can the updated interface on the Android/TV app be fixed...it is horrible.  I get the idea of conforming to most other streaming apps, but displaying all content in a single line to scroll through just doesn't work.  Some of us have many titles in our watchlists, and scrolling through them on a single line is annoying.  It would be much more usable to display them in a grid to make finding the wanted title faster and simpler.  Also, PLEASE add an option to sort the list (by title, date added, etc.).  This also makes the interface more user friendly.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxz7p2/the_new_tv_interface_is_horrible/"
    },
    {
        "id": "1oy69kg",
        "author": "AcanthocephalaOk8931",
        "title": "Please tell me some shows to watch?",
        "content": "I just finished money heist and that was PEAK it was so addictive that show I need something like that to watch. I tried watching peaky blinders but to be honest it isn’t that good.",
        "upvotes": 2,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1oy69kg/please_tell_me_some_shows_to_watch/"
    },
    {
        "id": "1oxo1j0",
        "author": "TakesOneToKnowOne1",
        "title": "The Beast in Me — final scene",
        "content": "What is the final scene in the last ep of The Beast in Me meant to indicate? The one with Nina and the baby? Are we saying the baby is like Nile? Find that ridiculous because it’s literally just a baby.",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oxo1j0/the_beast_in_me_final_scene/"
    }
]