[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 506,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k5drti",
        "author": "Blue-Sea2255",
        "title": "Name a show that never should’ve been cancelled. For me, it’s Messiah.",
        "content": "It had everything to go on for at least five seasons. They could’ve explored so many conspiracies and layers of beliefs. I don’t get why people get offended by fictional stories.",
        "upvotes": 264,
        "comments": 501,
        "media": null,
        "permalink": "/r/netflix/comments/1k5drti/name_a_show_that_never_shouldve_been_cancelled/"
    },
    {
        "id": "1k5jlmz",
        "author": "Horustheweebmaster",
        "title": "What are some things that seem really popular but you just don't seem into?",
        "content": "For me it's Adolescence. Everybody is raving abt it, but I just don't see the hype because it doesn't look great to me. Same with baby reindeer a while back.",
        "upvotes": 104,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1k5jlmz/what_are_some_things_that_seem_really_popular_but/"
    },
    {
        "id": "1k5tkc5",
        "author": "Single_Alternative78",
        "title": "WHAT SHOULD I DO ???",
        "content": "",
        "upvotes": 4,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zmtlliz4ijwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k5tkc5/what_should_i_do/"
    },
    {
        "id": "1k5ncae",
        "author": "Fragrant_Peanut_9661",
        "title": "Spaceman",
        "content": "\"Spaceman\"\n\nWell shit. Color me surprised. Yep I'm a little late to this party, but wow. I'm literally bawling my eyes out over this one. I'm normally not much of an Adam Sandler fan, but this movie completely turned me around. I really really thought it would end up being dumb? But jfc. My emotions are all over the place now. Beautifully done sir. ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k5ncae/spaceman/"
    },
    {
        "id": "1k535g0",
        "author": "ScottishDailyRecord",
        "title": "Netflix's Tiger King Joe marries behind bars as he ties knot with fellow inmate",
        "content": "",
        "upvotes": 59,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k535g0/netflixs_tiger_king_joe_marries_behind_bars_as_he/"
    },
    {
        "id": "1k4mfwh",
        "author": "TheMirrorUS",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle",
        "content": "",
        "upvotes": 546,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1k4mfwh/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1k53xrl",
        "author": "Somethingman_121224",
        "title": "Acclaimed Hit Series 'Heartstopper' Will End with a Movie, Netflix Confirms",
        "content": "",
        "upvotes": 17,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k53xrl/acclaimed_hit_series_heartstopper_will_end_with_a/"
    },
    {
        "id": "1k5ob88",
        "author": "peenutonfire123",
        "title": "Not available in your area",
        "content": "Downloaded Superstore and some anime 2 days ago, wanted to watch today but this error occured when clicking. Many of my shows disappeared too from my list including Black Mirror, is this bug? how do i fix it, thanks.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k5ob88/not_available_in_your_area/"
    },
    {
        "id": "1k5no1j",
        "author": "jordybout",
        "title": "Help me find this show",
        "content": "Several years ago I watched a maybe Korean or Japanese horror series on Netflix. Each episode was a different story with different characters. I’ve been trying to find it but think they may have taken it off and can’t seem to find it on google. \n\nOne episode I can remember was of a family. The dad had passed away and was haunting his son and wife but only the son could see him. One scene in particular is the dad ghost crawling up the stairs with the creepiest smile imaginable and the little boy running under his bed where the dad then slithers in and finds him. There was also something with the mom wearing a locket with his picture in it?\n\nI know this is not a lot to go off of but that episode has stayed with me this whole time and literally sent shivers up my spine. I was recently telling my friend about it and she wanted to check out the show but I’m drawing a complete blank. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k5no1j/help_me_find_this_show/"
    },
    {
        "id": "1k5f39y",
        "author": "Upper_List3176",
        "title": "Multiple subtitles \"Different Tongues. One Heartbeat. Shared Moments.\"",
        "content": "Lets get right to it .   \nThe ability to add (multiple) subtitle languages at once ! \n\nTurning Netflix to a massive machine for language learning for both adults and children.  \n\n\nI think multiple subtitles will create an Environment where people that speak different languages gather around feeling more safe and included . no matter what movie no matter how many languages people speak. \n\na camp fire a Projector a good movie, different races and beautiful people enjoying a movie all together.  \n\n  \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k5f39y/multiple_subtitles_different_tongues_one/"
    },
    {
        "id": "1k5jwtp",
        "author": "saulocf",
        "title": "Bullet Train Explosion",
        "content": "Bullet Train Explosion is both a modern remake and a follow-up to the 1975 Japanese film The Bullet Train, which also inspired the Hollywood thriller Speed. The story brings back the high-stakes idea of a vehicle that can’t slow down without risking an explosion. This time, it’s the Hayabusa 60 Shinkansen—a sleek, high-speed train racing toward Tokyo. A ransom must be paid before the train reaches its destination, or the result won’t just be the death of those onboard—it could mean disaster for millions in the city.\n\nWe meet the characters, understand the stakes, and in many ways follow the now-established beats—like the government refusing to negotiate with terrorists and efforts to discreetly evacuate passengers. Much of the first half plays out confidently and effectively. The bullet train setting is a treat on its own (as someone who recently traveled to Japan, seeing those stations in the film gave me mild PTSD). But what sets this version apart is that the bomber reveal happens midway through the film—and they’re onboard. From that point on, the focus shifts to the dynamics inside the train, and that’s where the movie starts to lose steam.\n\nRead my full review at https://reviewsonreels.ca/2025/04/18/bullet-train-explosion/",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k5jwtp/bullet_train_explosion/"
    },
    {
        "id": "1k58ykp",
        "author": "daylorer",
        "title": "My continue watching does not show up for certain shows?",
        "content": "It annoys me to no end when I’m binging a show and it wont show which episode I’m on, how long I played it or even if I watched it in general unless I click on/remember the correct episode. However, this only happens to certain shows. Is there a specific reason why Netflix does this? I watch one episode of black mirror or 10 minutes of a random Netflix original and it shows up but then for young royals or gossip girl it doesn’t? Is it a copyrights thing or hiding sensitive topics to protect the viewer or just a netflix issue? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k58ykp/my_continue_watching_does_not_show_up_for_certain/"
    },
    {
        "id": "1k5glqd",
        "author": "FunniMonkilol",
        "title": "Any new english movies on netflix?",
        "content": "I am a non-american who lives in america and my parents dont like watching english movies that much. Are there any good movies out there that are tv-14 or under that has little to no sexual content? I am 14 and it cannot be tv shows, only movies",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k5glqd/any_new_english_movies_on_netflix/"
    },
    {
        "id": "1k5fa2w",
        "author": "RelationshipAdept101",
        "title": "Can someone help me remenber the name of this show",
        "content": "There was a show I used to watch on Netflix, but I can’t for the life of me remenber the name, can you help me.\n\nIt was a 2d animation show.\n\nThe protagonist didn’t have a father, each character had a kind of monster they conjured with a talisman, and there were episodes were they went after thor’s hammer, the flutist of hemlin, in the end of season 1, the girlfriend of the protagonist loses her special monster and in the end of the second season, I think a monster named quetzalcoatl appears\n\nCan you please try and see what show this was?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k5fa2w/can_someone_help_me_remenber_the_name_of_this_show/"
    },
    {
        "id": "1k5eb86",
        "author": "ggemusic",
        "title": "PG on the Beat - Blue Mountain [Trap]",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k5eb86/pg_on_the_beat_blue_mountain_trap/"
    },
    {
        "id": "1k56ou7",
        "author": "S4v1r1enCh0r4k",
        "title": "Karol G Documentary ‘Tomorrow Was Beautiful’ Gets Trailer and Release Date on Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k56ou7/karol_g_documentary_tomorrow_was_beautiful_gets/"
    },
    {
        "id": "1k4t3gn",
        "author": "Routine-Agile",
        "title": "Raw - cannot rewind? bug",
        "content": "Hello\n\n  \nI normally watch Raw, but always get there late.  This week, the feature to rewind seems to have gone. Is this a bug or a new feature. Please don't be a feature as I really need the option to rewind. \n\n  \nalso i guess i need a post to have enough words or it gets deleted. weird.",
        "upvotes": 21,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1k4t3gn/raw_cannot_rewind_bug/"
    },
    {
        "id": "1k4iwr3",
        "author": "gotanygrapes88",
        "title": "Binge worthy netflix shows?",
        "content": "Need recommendations. Loved Wentworth, Shamless, Inventing Anna, 13 reasons and Greys.\n\n I liked all these at first but then i got bored and stopped watching  Ozark, walking dead, animal kingdom, the resident, good doctor, manifest, dexter, peaky blinders, this is us, lucifer, breaking bad, orange is the new black, lost, probably more i can't think of. \n\nAny binge worthy suggestions?",
        "upvotes": 77,
        "comments": 196,
        "media": null,
        "permalink": "/r/netflix/comments/1k4iwr3/binge_worthy_netflix_shows/"
    },
    {
        "id": "1k59vl0",
        "author": "Anxious_Attempt8656",
        "title": "Just watched season 7 of The Dragon Prince and honestly wtf was that??",
        "content": "The season just left me so confused, like what do you mean King Harrow was a bird all this time. Also I really dislike the romantic scenes between Rayla and Callum, I get that they are a couple but I don't need to see them kiss in every episode, it made me roll my eyes so much. I honestly hated that the last episode gave me nothing but more questions.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k59vl0/just_watched_season_7_of_the_dragon_prince_and/"
    },
    {
        "id": "1k5obsu",
        "author": "HehroMaraFara",
        "title": "Black Mirror: Hotel Reverie",
        "content": "This season is meh, not as bad as 6 but definitely nowhere near the top. \n\nThis episode though stands out as dumb from the jump though. So the big idea to revitalize a failing movie studio is: Remake an old black and white movie as an interracial lesbian film. \n\nI’m a progressive liberal and even I know that’s a losing proposition. Yes, it may have the potential for awards as an arthouse style flick, but make money? Not a chance. \n\nNext, if this “Redream” is supposedly a fledgling business, that in and of itself would be  unbelievable. This technology would be worth billions in the private or government market, with endless usages. This would be even more appealing than space travel. \n\nI’m going to ignore the middle bulk nonsense since I didn’t really get invested at ALL due to the other stuff. \n\nAll things being equal, it was maybe equivalent to an average Star Trek “holo deck comes alive and everyone is stuck” premise, which got old quick….25 years ago ",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1k5obsu/black_mirror_hotel_reverie/"
    },
    {
        "id": "1k58h29",
        "author": "NoMacaroon5847",
        "title": "i hostage",
        "content": "Whats with the i hostage situation in this new netflix film? I mean theres only 1 perpetrator, and cameras are everywhere, clearly can see him and everything he does... so whats with the setup? Hahha. Is this how asterdam thinks terrorists setup their plan? Come on.. the police could have take him out easily... ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k58h29/i_hostage/"
    },
    {
        "id": "1k58np5",
        "author": "OkOption2381",
        "title": "looking for what country has my show",
        "content": "Hello, i am trying to find out what country is streaming a specific drama called Accidentally in Love, which is a C-drama. as it no longer is on the American streaming.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k58np5/looking_for_what_country_has_my_show/"
    },
    {
        "id": "1k4azqt",
        "author": "no_wiz_hat_ho3",
        "title": "Bad Influence: The Dark Side of Kidfluencing",
        "content": "I have just got finished with watching this series. I am horrified. I’m only 18 myself and I feel sick just thinking about what these kids have had to endure. The manipulation. The lies. The cunning demeanour of Tiffany Smith. It’s all outrageous. How has a scandal of such great size been shoved down teen’s throats. \n\nInitially I had directed all my frustration towards Tiffany (the mother) but now I beginning to realise how sick household is.\n\nPiper Rockelle is most definitely a victim of pretty much anything you can think of. How child services have not stepped in is beyond me. \n\nI can see the pressure leading into her 18th birthday and we all know what turn folds. When she becomes of age, the exploitation will only skyrocket from there on out. \n\nMESSAGE TO PARENTS: GUIDE YOUR CHILDREN THROUGH HONEST AND MEANINGFUL CAREERS.",
        "upvotes": 76,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1k4azqt/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1k5bl1g",
        "author": "loadingglife",
        "title": "Netflix Is Proving To Be Embedded In Our Lives - Q1 stats",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k5bl1g/netflix_is_proving_to_be_embedded_in_our_lives_q1/"
    },
    {
        "id": "1k4v0jy",
        "author": "NoWhereNorth-II",
        "title": "Netflix MTV",
        "content": "\nWho would be in favour of having high quality music videos with high res audio on Netflix? Maybe produced by Netflix. \nThink of it as super charged MTV (genX would relate).\n",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1k4v0jy/netflix_mtv/"
    },
    {
        "id": "1k55z6z",
        "author": "Awkward-Egg-411",
        "title": "I cant seem to find shows that should've existed on Netflix",
        "content": "So I recently tried to rewatch Orb: On The Movements Of The Earth on Netflix for my free time. I tried to search it, but I cant seem to find it (mind you that Orb is available just a few days ago as far as I remember), and it reccomended me some random Animes that are totally different from what it usually reccomends. I tried to type Re:Zero to see if this is just Orb getting removed, but it still didnt show up. I even searched Tensura just to make sure, but same results and all. Does anyone know why this happened, and how to fix it? I dont think its a licensing problem",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k55z6z/i_cant_seem_to_find_shows_that_shouldve_existed/"
    },
    {
        "id": "1k4uqrp",
        "author": "smv18",
        "title": "Why is this happening? Signing out and making another profile did not work.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4uqrp/why_is_this_happening_signing_out_and_making/"
    },
    {
        "id": "1k4gtad",
        "author": "MysteriousDelay6266",
        "title": "Bet | Official Trailer | Netflix | MAY 15",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k4gtad/bet_official_trailer_netflix_may_15/"
    },
    {
        "id": "1k4zg0c",
        "author": "Sassyed",
        "title": "Idk if this is a new idea or not?",
        "content": "What if Netflix content supported haptics on mobile phone, just like controller haptics on a PlayStation game?\n\nJust imagine feeling car rumbles, gunshots, and so much!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4zg0c/idk_if_this_is_a_new_idea_or_not/"
    },
    {
        "id": "1k4skdb",
        "author": "Mirades96",
        "title": "Netflix brightens (maybe it dimms it for others with the same issue) the video when in fullscreen",
        "content": "So I'm on a Desktop PC and watch Netflix through the Edge browser.  \nMy monitor is an OLED (PG27AQDP).  \nWhen ever I enter fullscreen in Netflix, after the UI (playback bar and the age info) disappears the screen gets brighter after a few seconds.  \nIf I move my mouse (to bring back the UI) or if I go to window mode the brightness goes back to normal.  \nAfter the UI disappears again, it will get bright again after a few seconds.  \nIn window mode it stays normal.  \nThe black borders are not affected by the brightness change.  \nThe higher brightness is a huge quality loss, it is like a white/grey filter on top of the video and a lot of detail goes missing.\n\nOnly happens on my OLED monitor, doesn't happen on my older LCD monitor.  \nOnly happens with Hardware Acceleration on. (But that is needed for the DRM/HDCP shizzle, so Netflix allows to play higher quality than 1080p)  \nOnly happens on Netflix (tested Disney+ and YouTube).  \nHappens with and without a second monitor connected. (which pretty much means it happens with and without HDCP 2.2)  \nHappens with HDR on and off.  \nHappens with monitor brightness 0 to 100.  \nHappens with monitor setting \"Uniform Brightness\" on and off.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k4skdb/netflix_brightens_maybe_it_dimms_it_for_others/"
    }
]