[
    {
        "id": "1hvi79t",
        "author": "BunyipPouch",
        "title": "Join us Thursday 1/9 at 6:00 PM ET for a live AMA/Q&amp;A with Robbie Williams, pop star and subject of the upcoming biopic 'Better Man' from director Michael Gracey ('The Greatest Showman')",
        "content": "",
        "upvotes": 3,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cusska3cqhbe1.jpeg?auto=webp&amp;s=d79b07545da75bb2a16d55b43e075c7416b7bbe3"
        },
        "permalink": "/r/movies/comments/1hvi79t/join_us_thursday_19_at_600_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1hsvqaz",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wallace &amp; Gromit: Vengeance Most Fowl / Nightbitch / Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 40,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hsvqaz/official_discussion_megathread_wallace_gromit/"
    },
    {
        "id": "1hvgqt0",
        "author": "MarvelsGrantMan136",
        "title": "Sony Announces 'Helldivers 2' Movie",
        "content": "",
        "upvotes": 6074,
        "comments": 1009,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r2VZuAkpW6fAdzhVjrdZDVJwiHy03HHLiBGobdwK5w0.jpg?auto=webp&amp;s=75166529fc718873603bc145ce3013b25d1fc41b"
        },
        "permalink": "/r/movies/comments/1hvgqt0/sony_announces_helldivers_2_movie/"
    },
    {
        "id": "1hvuj2t",
        "author": "BunyipPouch",
        "title": "Julian Assange Documentary 'The Six Billion Dollar Man' Pulled from Sundance Film Festival at the Last Minute - The WikiLeaks founder Assange faced up to 175 years in prison for exposing highly confidential US documents, the doc has been pulled due to “unexpected developments\".",
        "content": "",
        "upvotes": 285,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BrSt9ToWO6EyYUUQ8Bm1860op_bhb95grQfIyKsKnl4.jpg?auto=webp&amp;s=1972de53f8273c81009b2356af5b60c934d5d6e3"
        },
        "permalink": "/r/movies/comments/1hvuj2t/julian_assange_documentary_the_six_billion_dollar/"
    },
    {
        "id": "1hvgj6x",
        "author": "MarvelsGrantMan136",
        "title": "Columbia Pictures and Sony PlayStation Developing ‘Horizon Zero Dawn’ Movie",
        "content": "",
        "upvotes": 1144,
        "comments": 287,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/obmIXqlTP_XFThqWSaTrAwk35nnyhV5uCneIcOH7GH8.jpg?auto=webp&amp;s=3316ad1af4d1d572568764be223bccc6b51ae91a"
        },
        "permalink": "/r/movies/comments/1hvgj6x/columbia_pictures_and_sony_playstation_developing/"
    },
    {
        "id": "1hv56b3",
        "author": "Both_Sherbert3394",
        "title": "Rewatching 'Seven' yesterday really made me realize how weak 'Longlegs' was",
        "content": "They did a re-release of Seven in IMAX this past weekend, and even though it's not the most obvious contender for the format, I was able to go with my subscription, having only seen it on TV previously, and goddamn did it hold up.\n\nThe sound design, especially the music used in the opening titles, felt so grimy and real. The way the story unfolds as it slowly creeps towards an inevitable conclusion, even going so far as to have Somerset say \"you know this isn't gonna have a happy ending.\"\n\nThere were a lot of details I picked up with seeing it at that scale; one moment that stood out to me is when they have dinner together, the moment Somerset sees Tracy, there's this momentary darting-of-the-eyes that almost looks like a brief moment of recognition of what's to come, or at least a grizzled detective who's seen enough to know that a young detective with a beautiful wife investigating a vicious serial killer isn't going to end well, and that there's a reason the people who end up in that field for so long generally don't have anyone that immediately close to them.\n\nCompared to last year's *Longlegs*, which like many of you I was excited for based on the marketing - visually, it seemed creepy, the weird symbols, the grainy crime scene photos, the billboard with the phone number, it was all a brilliant way to get millions of people to watch something with a paper-thin story.\n\nThe biggest issue with the film is that it seems more intent on capturing the \"ambience\" and \"vibe\" of the genre, which it admittedly does well, but once you actually realize how thin the story is and how little there are to any of these characters, it begins to resemble the turkey from *Christmas Vacation* turning into dust.\n\nThere's a scene in *Seven* of the two detectives on the couch pouring over evidence; Mills says he's getting a second beer, and asks if Somerset wants one as well. Somerset says he'd prefer wine. Right away, this tells us not only did Mills start drinking first (which feels very in character), but that Somerset would prefer something slower, so as to not get too drunk while working. Mills proceeds to pour an absurd amount of wine into a tall, regular drinking glass, and only a minute later does Somerset pick up the glass, notice how full it is, and briefly look at it in befuddlement. Almost all of this exchange occurs visually.\n\nThere's more characterization in this scene than literally the entirely of *Longlegs*.\n\nA phrase I've heard used in comedy (but that I also think applies to many forms of storytelling) is, \"don't put a hat on a hat.\" Aka, the context I first heard it was in relation to writing a sketch for SNL that had Natalie Portman in it, where the initial setup was going to be something about a tutor teaching a student, and then halfway through they said \"wait what if she's also her character from Star Wars\", and then the whole thing fell apart. This kept ringing true the more *Longlegs* continued its descent into silly contrivances, with four separate plot elements that all feel as though they could've independently been the vessel for a story; the mother being forced to make a pact with the killer (which in itself is already absurd; the idea that maybe she would've turned a blind eye towards *one* as a way to save her daughter would've been interesting and slightly believable, but the idea that she ends up taking this gig for twenty years is laughably dumb).\n\nWe then proceed to learn the full extent of it, that the plan was for Longlegs to get the mother to delivery dolls to these families that had metal orbs in their heads that caused the families to go crazy and kill each other. It's like reheated Mike Flanagan gumbo. I was shocked at how not 'cool', smart or interesting this reveal felt in comparison to how sleek and Fincher-y the first hour of it felt. It's a cinematic Krabby Land.\n\nAnyways, I don't mean for this to just be another \"muh old is better\" as much as it is a hunger for more films with real characters that act and behave like real people, who do things unrelated to the plot while they're waiting for something, who occasionally sit down and talk about their lives, and who don't just feel like sterile vessels for the delivery of plot devices. Something as simple as the wine exchange is all it takes to turn a basic scene of exposition into something more flavorful and 'complete'.\n\nEDIT: A lot of people seem to be misunderstanding what I'm going for with this; I'm not simply saying \"X is better than Y\". Asking any film to live up to *Seven* would be impossible, I'm saying \"X feels lacking in a way that Y does not, here's one example of how Y does this correctly\".\n\nThe point of this was not to shit on *Longlegs* but to demonstrate how much a few very minor changes can turn what would be a boring exposition scene into something that gives us an entertaining insight into the differences between the two, which gives the experience a lot more meaning beyond just \"atmosphere\".",
        "upvotes": 3681,
        "comments": 777,
        "media": null,
        "permalink": "/r/movies/comments/1hv56b3/rewatching_seven_yesterday_really_made_me_realize/"
    },
    {
        "id": "1hvig4d",
        "author": "seattleslow",
        "title": "Disney Inks Deal to Merge Hulu Live TV With Fubo",
        "content": "",
        "upvotes": 328,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p_6SAwOWkB97vtU7-60SdNvT_R4KwZldeHj5LVPK0As.jpg?auto=webp&amp;s=196abfc6705762e1b7d8fccfafd93cc61082a53e"
        },
        "permalink": "/r/movies/comments/1hvig4d/disney_inks_deal_to_merge_hulu_live_tv_with_fubo/"
    },
    {
        "id": "1hvsfwu",
        "author": "Davis_Crawfish",
        "title": "\"The Legend of Billie Jean\" and \"Supergirl\": Helen Slater was the It Girl of the 1980s.",
        "content": "These two films are not necessarily great films, Supergirl is more of a campy bad movie, but Helen Slater is the best thing about these two movies. I don't think we'll ever get another Supergirl as Helen Slater. Slater didn't just look like Supergirl, she was strong and likable. You rooted for her, evenm if she had some woeful lines. \n\nAnd in \"The Legend of Billie Jean\", the teen feminist film about a teen girl who becomes an inspiration for the youth after she and her brother accidentally shoot the sleazy dad of a bully who tried to rape her and they run from the cops. When Slater cuts her hair in honor of Joan of Arc, you can see why she'd have people follow her. \n\nI still think she should have had better offers. She was pretty popular for a few years, with movies like Ruthless People, City Slickers and The Secret of My Success making bank, but I don't think she ever got that big breakout part in a hit movie. She'll always be remembered as either Billie Jean or Kara/Linda Lee.",
        "upvotes": 31,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1hvsfwu/the_legend_of_billie_jean_and_supergirl_helen/"
    },
    {
        "id": "1hv82jw",
        "author": "SmallTownIowa",
        "title": "My favorite special effect from Pirates of the Caribbean (Curse of the black pearl)",
        "content": "Is actually a lack of special effects in the climax. Will drops the medallion in the chest and visibly nothing happens. The pirates seem to be caught unawares that they’re mortal again til they start noticing one by one they’re no longer skeletons. \n\nIf this movie was made today (or god forbid when we get an inevitable remake/reboot) there would be a beam of light shooting up from the chest, maybe some lightning bolts flying around zapping the pirates as they begin levitating. “How else is the audience going to know the curse is lifting?!?”",
        "upvotes": 877,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1hv82jw/my_favorite_special_effect_from_pirates_of_the/"
    },
    {
        "id": "1hvcqlg",
        "author": "mafternoonshyamalan",
        "title": "The Reggie payoff in Bad Boys: Ride or Die is quite possibly the best use of a side character in a lega-sequel I've ever seen. Are there any other examples of this?",
        "content": "For context, Reggie was in one scene in Bad Boys II from 2002. He's a 15-year-old taking Martin Lawrence's daughter on a date. Literally one scene where Smith and Lawrence lay into him. He has no bearing on the plot, no arc, nothing. He's just a joke. They could've cut the scene and it wouldn't have taken much from the movie beyond a bit of length (it's 2.5 hours.) Bringing him back in Bad Boys For Life to marry Lawrence's daughter was a fun nod back to II given that 18 years had passed. It's a simple, easy callback, and I was happy they got that actor to come back for one scene. \n\nThen in Ride or Die, he gets a full on action scene that is one of the most fun, well-choreographed John Wick-esque sequences in the movie. But that's it. He doesn't join them in the final showdown, he's not brought into any other action. It's literally just an action showcase, and an epic payoff for anyone who's watched the franchise over the years. To add to that, I can only assume that it wouldn't have the same impact for anyone who doesn't have the nostalgia of watching that scene in Bad Boys II 22 years ago. ",
        "upvotes": 423,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1hvcqlg/the_reggie_payoff_in_bad_boys_ride_or_die_is/"
    },
    {
        "id": "1hvtz92",
        "author": "indiewire",
        "title": "The 10 Best Aardman Animated Movies, Ranked",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ItjqDopq-1pfuDdUTn24-zJLqOjHNMcFQhOPWDxF9l0.jpg?auto=webp&amp;s=9ebfa2e29cee7a80860e47b73ceedd61095eb696"
        },
        "permalink": "/r/movies/comments/1hvtz92/the_10_best_aardman_animated_movies_ranked/"
    },
    {
        "id": "1hvhx7m",
        "author": "joesen_one",
        "title": "Viola Davis Accepts the Cecil B. DeMille Award | 82nd Annual Golden Globes",
        "content": "",
        "upvotes": 171,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YN5EEHSVTzfeh3bPdAvgsO1b3gIMYOjAkZFKjTtEFF4.jpg?auto=webp&amp;s=12c6b01bc51dcafbeb0882d1c5e19f8958695519"
        },
        "permalink": "/r/movies/comments/1hvhx7m/viola_davis_accepts_the_cecil_b_demille_award/"
    },
    {
        "id": "1hvmflz",
        "author": "SuitNo1243",
        "title": "Lawrence of Arabia ",
        "content": "I just watched Lawrence of Arabia and I am in awe. I don't know where to break it down from but i am genuinely slightly jarred by Ali and Lawrence's relationship. I've never been so moved by an on screen relationship like this, idk if anyone else felt like this but I can't place my finger on what it is either. I read somewhere Lean mentioned the relationship was romantic but more generally it was just the simple infatuation about their dynamic. I don't know what it is about them but the feeling after their final scene I can't put it out of my mind. \n",
        "upvotes": 76,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1hvmflz/lawrence_of_arabia/"
    },
    {
        "id": "1hvs1iv",
        "author": "Comic_Book_Reader",
        "title": "HEART EYES - Official Trailer (HD)",
        "content": "",
        "upvotes": 20,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GTbt8Hg7NyENcYw0v9BX7syrw3ZwHQW6HxM1_pb0kB4.jpg?auto=webp&amp;s=ccdbb54746cf1dd5248c8f86401c3ed01f9c6c96"
        },
        "permalink": "/r/movies/comments/1hvs1iv/heart_eyes_official_trailer_hd/"
    },
    {
        "id": "1hv31bc",
        "author": "BunyipPouch",
        "title": "First Poster for Action-Thriller 'Fight or Flight' - Starring Josh Hartnett - A mercenary takes on the job of tracking down a target on a plane but must protect her when they're surrounded by people trying to kill both of them.",
        "content": "",
        "upvotes": 900,
        "comments": 163,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nerhburehebe1.jpeg?auto=webp&amp;s=8b0bfab1370fd434e73b808adddde3d220192e84"
        },
        "permalink": "/r/movies/comments/1hv31bc/first_poster_for_actionthriller_fight_or_flight/"
    },
    {
        "id": "1huq35b",
        "author": "YoureASkyscraper",
        "title": "Demi Moore wins her-ever first major acting award at the Golden Globes for 'The Substance'",
        "content": "",
        "upvotes": 10114,
        "comments": 543,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rRzVxTgBPoVQDcvSD_R9AW7aod85JfIcYp12P79E2vA.jpg?auto=webp&amp;s=14819ee14692a375a2fe0f86075f42eff977743a"
        },
        "permalink": "/r/movies/comments/1huq35b/demi_moore_wins_herever_first_major_acting_award/"
    },
    {
        "id": "1hv9hup",
        "author": "KillerCroc1234567",
        "title": "‘Grimm’ Movie in Development at Peacock",
        "content": "",
        "upvotes": 304,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eM_qkOq6dpIlPiU0e9Njz24VYvX_nRYkrglk8cgIeZk.jpg?auto=webp&amp;s=ac93fa225bdf25e4c26df78b465174ec88f46ae5"
        },
        "permalink": "/r/movies/comments/1hv9hup/grimm_movie_in_development_at_peacock/"
    },
    {
        "id": "1hv8n5a",
        "author": "GenButter",
        "title": "Emilio Echevarría Dead: ‘Amores Perros,’ ‘Die Another Day’ Actor Was 80",
        "content": "",
        "upvotes": 319,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eBmIR4iuWgr98L8A1SBe38baUiFvN_vFDr0XsJnfb9U.jpg?auto=webp&amp;s=84de323f59ca824626dadbdc2e3ea82d6cf5664c"
        },
        "permalink": "/r/movies/comments/1hv8n5a/emilio_echevarría_dead_amores_perros_die_another/"
    },
    {
        "id": "1hvsfh6",
        "author": "Ehrre",
        "title": "Chumscrubber (2005)",
        "content": "I found this movie in a discount bin at a random video store in the middle of nowhere during a family trip.  \n\nI was feeling unwell one day and stayed behind while they went out and decided to watch Chumscrubber.  \n\nIt was so weird, but the soundtrack was amazing and the characters were interesting. It ended striking me deeply as a depressed teenager that was dealing with some of the things presented in the movie.  \n\nThe 2nd drop of Sleep Song by Rooney was pretty intense.  \n\nDid anyone else see this movie? What did you think?  \n\nhttps://m.imdb.com/title/tt0406650/",
        "upvotes": 12,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aWfp8UM7H4IcxPlHIetuGCrd594j5AcDo2s2_B0R3a0.jpg?auto=webp&amp;s=f188929e2620b8635d7fbcbf16cc246e20979657"
        },
        "permalink": "/r/movies/comments/1hvsfh6/chumscrubber_2005/"
    },
    {
        "id": "1hvw2cw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Paul W. S. Anderson's 'In The Lost Lands' Starring Milla Jovovich &amp; Dave Bautista ",
        "content": "",
        "upvotes": 15,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/78248tjzrlbe1.jpeg?auto=webp&amp;s=8a436f0ab5a30b127cdfd89dff786ffa6066953d"
        },
        "permalink": "/r/movies/comments/1hvw2cw/official_poster_for_paul_w_s_andersons_in_the/"
    },
    {
        "id": "1huw09g",
        "author": "ConcernedHumanDroid",
        "title": "Actors doing biopics overwhelmingly get praise and awards. What were the times they didn't? ",
        "content": "Posting this after seeing Timothee Chalamet getting praise for his Bob Dylan performance. But in general I've noticed time after time actors making easy dunks by doing biopics. Why is that? \n\nWhy do they get it so easy? \n\nA lot of times, they're not even mimicking the person they're impersonating. I can think of Jesse Eisenberg as Mark Zuckerberg. Mark definitely never speaks that fast. \n\nI have enjoyed many of these biopic performances though. Notable ones for me are:\n\nMeryl Streep as Margaret Thatcher\nForest Whitaker as Idi Amin\nChristian Bale as Bob Dylan \n\nBut I am interested in knowing what biopics had actors who did a terrible job? \n\nFor me the worst one is Ashton Kutcher as Steve Jobs. One of the worst things I've ever seen. \nWhat are our worst top 5 biopic performances? \n\n",
        "upvotes": 1509,
        "comments": 1018,
        "media": null,
        "permalink": "/r/movies/comments/1huw09g/actors_doing_biopics_overwhelmingly_get_praise/"
    },
    {
        "id": "1hv5el0",
        "author": "crypticsage",
        "title": "Disney should make another Fantasia, keep it animated, and stop with the remakes of animations into live action remakes.",
        "content": "The two Fantasia movies were unique and that they both used different stories and songs in the animations. Only The Sorcerer's Apprentice was featured in both. \n\nIt's been about 25 years now since the last one. If they do an entirely new entry with new animations and different songs, then maybe it will spur new creativity in media creation. \n\n  \nMy children all loved the movies and to have more of these would be amazing. What does everyone think about this?",
        "upvotes": 356,
        "comments": 179,
        "media": null,
        "permalink": "/r/movies/comments/1hv5el0/disney_should_make_another_fantasia_keep_it/"
    },
    {
        "id": "1hupv13",
        "author": "YoureASkyscraper",
        "title": "Trent Reznor and Atticus Ross win Best Original Score at Golden Globes 2025 for Challengers",
        "content": "",
        "upvotes": 3412,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8q0k7neozicciQsCsph8eQ2pHk0aiDBq6LDd9oK67Mo.jpg?auto=webp&amp;s=42c27fe2fc204191e09d695955cdd2d5fd734522"
        },
        "permalink": "/r/movies/comments/1hupv13/trent_reznor_and_atticus_ross_win_best_original/"
    },
    {
        "id": "1hvbnod",
        "author": "VankTar",
        "title": "The movie FLOW is wonderful. Does anyone have theories about what the hell is going on?",
        "content": "The incredible movie Flow, out now, follows the journey of a cat who must bond with unlikely allies to escape a terrifyingly destructive flood.\n\nAll of the animals in the movie act almost completely as real animals would in the various situations they find themselves; there’s very little anthropomorphism, beyond the use of some simple tools. And even that doesn’t come close to some of the wild feats of intelligence I’ve seen untrained animals perform on YouTube. \n\nVery quickly, the movie reveals itself to take place in a fantasy world, the lore and rules of which are never explained. We see massive sculptures and bizarre land formations unlike anything on earth, but conspicuous by their absence is humanity. All around the animal characters, the residual pieces of some kind of magical society Are left empty to sink beneath the ever rising tide.\n\nEventually, we see an actual wild sequence of supernatural magic, and what appears to be one of the animal characters very literally ascending into heaven? Shortly thereafter, the water begins to lower; the two incidences seem connected but the correlation isn’t clear. \n\nThe boat we see in the tree at the beginning let us know that the waters have risen before. But how and why any of this is happening appears totally opaque on first viewing. \n\nDoes anyone have any theories or ideas about how the world of flow came to be abandoned, what the rising tides mean, or what happened to the bird? ",
        "upvotes": 104,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1hvbnod/the_movie_flow_is_wonderful_does_anyone_have/"
    },
    {
        "id": "1hvgdtk",
        "author": "Sonia341",
        "title": "‘The Monkey’ Rated “R” for Strong Bloody Violent Content and Gore",
        "content": "",
        "upvotes": 43,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/96vBTu__N-cRU3e0ofF5IUPYsS0_4wxo7fQD_hgtpKI.jpg?auto=webp&amp;s=00de415cf193203d294c07bcb50a00080407c1e9"
        },
        "permalink": "/r/movies/comments/1hvgdtk/the_monkey_rated_r_for_strong_bloody_violent/"
    },
    {
        "id": "1hvez5c",
        "author": "uncre8tv",
        "title": "Leap Of Faith (1992) is criminally slept on",
        "content": "Steve Martin, Debra Winger, Liam Neeson, PSH, Meatloaf!!!\n\nTimeless classic. Steve Martin is at the peak of his powers. Debra Winger playing a smart, capable woman. Big budget 90's Hollywood production values, no effects, nothing fancy, just a really well made movie.\n\nI've lived in a tiny town of 800 people for the last decade too, so it probably hits different for me now. I remember really liking this when I was a teen growing up in the city. Re-watching now and it's changed / I've changed, but movie still stands up.",
        "upvotes": 54,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1hvez5c/leap_of_faith_1992_is_criminally_slept_on/"
    },
    {
        "id": "1hvuwgv",
        "author": "Mathy16",
        "title": "Favourite recent Romcoms? ",
        "content": "Hi! My friends and I do frequent movie nights and to spice things up I proposed we pull out a time period and a genre out of 2 bowls and then we had to watch a movie that fits those criteria. \n\nWell I pulled romcoms between 2020 and now. Not really a genre I'm super familiar with. In my opinion, the genre had its hayday in the 2010s so I'm kinda coming up blank. \n\nAny and all suggestions of super recent romcoms would be appreciated! \n\nThe movie can also be other genres, as long as romantic comedy is one of them. \n\nThanks! ",
        "upvotes": 3,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1hvuwgv/favourite_recent_romcoms/"
    },
    {
        "id": "1hura3z",
        "author": "PrimeTimeJobber",
        "title": "Fernanda Torres Wins Golden Globe 25 Years After Her Mom Was Nominated in Same Category",
        "content": "",
        "upvotes": 1997,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cfUDBrdvvKQUR7xSagezz0XddX8sWXDSDDxxOEZ8pV0.jpg?auto=webp&amp;s=27fb3722d11397016487d3aebf4e73f82f1ff96f"
        },
        "permalink": "/r/movies/comments/1hura3z/fernanda_torres_wins_golden_globe_25_years_after/"
    },
    {
        "id": "1hv15la",
        "author": "BunyipPouch",
        "title": "Cinemark to Offers BYOB (Bring Your Own Popcorn Bucket) to Celebrate National Cinema Day on Sunday January 19 - For $5, guests will be allowed to bring their own containers to fill up on popcorn (up to 3.5 gallons).",
        "content": "",
        "upvotes": 239,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/768hxr41VaBgr3HH9lm0UMf7C1ZZ4_T0-p7j0TCUnQc.jpg?auto=webp&amp;s=4f223f2b63596e61c29018001367f5591641d491"
        },
        "permalink": "/r/movies/comments/1hv15la/cinemark_to_offers_byob_bring_your_own_popcorn/"
    },
    {
        "id": "1hv41am",
        "author": "Old_Session5449",
        "title": "Best examples of the retired badass coming back into the game?",
        "content": "I think the best example I've seen so far is the first John Wick. There was something special about the movie, wherein all the major bad guys (except for the brat kid) well and truly knew how fucked they were once they heard the name John Wick. There was no question that he was capable of single handedly bringing down their empire, which was alluded to be extremely powerful. The mob boss started grieving for his son before his death, that's how inevitable he felt it was. It also helps that the action was absolutely world class, the mechanisms of the underworld were just alluded to, rather than being explicitly spelt out, and John's past was a mystery to us.",
        "upvotes": 158,
        "comments": 354,
        "media": null,
        "permalink": "/r/movies/comments/1hv41am/best_examples_of_the_retired_badass_coming_back/"
    },
    {
        "id": "1hvvni9",
        "author": "TechnicianOk3133",
        "title": "5 years since 2019! One of the biggest years for films commercially &amp; critically.",
        "content": "It has now been 5 years since 2019 ended with an explosive run of excellent films that resonated with critics and audiences in the awards season &amp; set multiple box office records. \nTo highlight:\n- 2019 had 9 movies grossing over $1 billion worldwide, the highest amount compared to any other year.\n- Avengers Endgame became the highest-grossing film of all time at the time, beating Avatar’s 10 year box office record (before re-releases secured the top spot back)\n- Parasite became the first non-English film &amp; first South Korean film to win the Oscar for Best Picture.\n\nWhat was your favorite of 2019? \nHow long do you think it will be before we see another year like this?\n\nCredits:\nhttps://bestcasereviews.com/2019-top-ten-films/\n\nhttps://en.m.wikipedia.org/wiki/2019_in_film\n\nhttps://en.m.wikipedia.org/wiki/92nd_Academy_Awards",
        "upvotes": 3,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R2odPZAbipX5LSCk2NjqiERT_SnjHbY20X2FseGY1AU.jpg?auto=webp&amp;s=77a46560ce9d4d0f7ac33e2d725bc3af019c838b"
        },
        "permalink": "/r/movies/comments/1hvvni9/5_years_since_2019_one_of_the_biggest_years_for/"
    },
    {
        "id": "1hv3i95",
        "author": "KillerCroc1234567",
        "title": "Oscar-Nominated Cinematographer Roger Pratt (“The End of the Affair”) Dies at 77",
        "content": "",
        "upvotes": 148,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vM-c7fgOAE2V1oQ6hdco0mbRZqbi9OVmzn6U0uEgx-U.jpg?auto=webp&amp;s=71d075373681715717249be3c0338369670bdd74"
        },
        "permalink": "/r/movies/comments/1hv3i95/oscarnominated_cinematographer_roger_pratt_the/"
    }
]