[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ldrjv1",
        "author": "Sea_Cookie2373",
        "title": "Too long ago",
        "content": "Does anyone else ever just start a whole show over because they forgot what happened, because it was so long since they made the last episode? Sometimes it's been what feels like a year...",
        "upvotes": 82,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrjv1/too_long_ago/"
    },
    {
        "id": "1ldssxz",
        "author": "Swordfish353535",
        "title": "Having a lazy day at home, any good Netflix docu-series things of recent years to watch?",
        "content": "Haven't watched one in a while but have seen a lot of the old ones so wondering if there's any good ones released in the last 2 years or so?\n\nI'm seeing this Osama Bin Laden one although seeing mixed reviews. Ideally something that'll keep me gripped.",
        "upvotes": 47,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ldssxz/having_a_lazy_day_at_home_any_good_netflix/"
    },
    {
        "id": "1ldt8wy",
        "author": "RepairmanJack2025",
        "title": "I need a tv series to watch on Netflix.",
        "content": "Comedy or drama fine, but not too dark.  \n\nSave me from boredom, especially with a show that is maybe not the water cooler talk.  If you have a moment, tell us why we should watch. [US]",
        "upvotes": 13,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1ldt8wy/i_need_a_tv_series_to_watch_on_netflix/"
    },
    {
        "id": "1le1jqs",
        "author": "Friendly-Chest6467",
        "title": "Those who watched Forever (2025) please tell me what happens.",
        "content": "My coworker wants me to watch this show because she wants to talk to someone about it but I really don’t want to as it sounds really sad. I will watch it but I’d really appreciate it if someone tells me what happens each episode so nothing surprises me. Google only shows the ending. You can dm me so it’s not spoiled for the rest of the community. \n\nThanks again. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1le1jqs/those_who_watched_forever_2025_please_tell_me/"
    },
    {
        "id": "1le4tof",
        "author": "Wild-Resolution-6703",
        "title": "Need Feel Good Netflix Recs",
        "content": "I’m having surgery soon and I’ll be off work for about a week while I recover. I’m looking for some good rom-coms or anything light and funny on Netflix. Just stuff that’ll make me laugh or feel good. Nothing too serious.\n\nWould love your recs. Thanks!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1le4tof/need_feel_good_netflix_recs/"
    },
    {
        "id": "1ldmz2h",
        "author": "cheese-balls28",
        "title": "astroworld documentary",
        "content": "no words my heart aches so hard i just can’t make this shit up what the fuck was astroworld 2021? why didn’t it stop earlier? 10 people DIED. it’s so insane to me. i feel so overwhelmed. #stoptheshow",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ldmz2h/astroworld_documentary/"
    },
    {
        "id": "1ldm4r8",
        "author": "moon-1992",
        "title": "Do you know similar psychological thriller shows like “the sinner” or “broadchurch”?",
        "content": "I love these kind of shows. The vibe of both is irreplaceable. I love the detectives, they are broken but not the depressive fallen kind like in “river” and the whole trauma mystery vibe. “The fall” is also a show I really loved!",
        "upvotes": 22,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ldm4r8/do_you_know_similar_psychological_thriller_shows/"
    },
    {
        "id": "1ldnc65",
        "author": "Pep_Baldiola",
        "title": "The Sandman: Season 2 | Official Trailer | Netflix ( Vol. 1 - July 3 | Vol. 2 - July 24)",
        "content": "",
        "upvotes": 17,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ldnc65/the_sandman_season_2_official_trailer_netflix_vol/"
    },
    {
        "id": "1le1ix1",
        "author": "watchman28",
        "title": "Netflix stops playing the moment credits start, and watch credits option is gone",
        "content": "For a while now rather than minimising the credits in a little window in the top left and either playing a preview or counting down to the next episode, it's been stopping playback altogether, meaning I can't watch the credits. The 'watch credits' option doesn't appear, and if I go back to the window on the top right it doesn't resume from the start of the credits, it starts the episode/movie over again. This is a pain in the bum for a number of reasons, not least that I've been watching Love, Death and Robots and I've no idea who's been doing the voices in each episode as I can't watch the credits. \n\nI've tried everything I can think of - refreshing the app, updating the TV software, turning off auto play previews and next episode, and nothing seems to work. \n\nIt appears to only be happening on my TV (through the Sky Netflix app) - it doesn't happen if I watch on the iPad or through the PS5. Anyone got any ideas? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1le1ix1/netflix_stops_playing_the_moment_credits_start/"
    },
    {
        "id": "1le54ss",
        "author": "xergame",
        "title": "UI changes",
        "content": "I remember the home UI being like huge, rounded, and really sleek a few days ago, didn't really care since the overall watching was pretty much the same, but now I opened up Netflix today and found the UI back to what it was originally before the rounded UI, but the UI while watching changed, you can no longer change the dub below the progress bar, you would have to go to the Audio and Subtitles button now? Don't know if it's just me or anything. Wtf is Netflix doing? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1le54ss/ui_changes/"
    },
    {
        "id": "1le525o",
        "author": "Ionazano",
        "title": "Is there anything new in \"Titan: the Oceangate Submersible Disaster\"?",
        "content": "So a new addition on Netflix that I noticed is \"Titan: the Oceangate Submersible Disaster\". It's currently in the top 10 most watched. On the one hand as someone with an engineering background I'm very interested in engineering cautionary tales. On the other hand I've already read about everything that happened leading up to the Titan submersible disaster in great detail.\n\nSo my main queston in deciding whether it's worth watching for me is the following: does this documentary contain any new information or perspective?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1le525o/is_there_anything_new_in_titan_the_oceangate/"
    },
    {
        "id": "1ldrz5n",
        "author": "S4v1r1enCh0r4k",
        "title": "Carla Gugino Teams Up with Brad Pitt for David Fincher’s Netflix Thriller",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrz5n/carla_gugino_teams_up_with_brad_pitt_for_david/"
    },
    {
        "id": "1le3zgk",
        "author": "dicedtomatoes55",
        "title": "'Deep Cover's Comedic Trio Is Funnier Than It Has Any Right To Be",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1le3zgk/deep_covers_comedic_trio_is_funnier_than_it_has/"
    },
    {
        "id": "1le38m7",
        "author": "Blue_Steve945",
        "title": "Why Does Netflix Always Skip the Second Movie?",
        "content": "Anyone else notice Netflix has the first, third, and even fourth movies in a series—but never the second? Like with Kung Fu Panda, it’s so frustrating!\n\nI get there are rights issues, but why tease us with an incomplete series? If they can’t have the whole thing, maybe don’t show any of it.\n\nAnyone know why the second movie always disappears? Would love to hear other examples!",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1le38m7/why_does_netflix_always_skip_the_second_movie/"
    },
    {
        "id": "1ldxszh",
        "author": "Flyaway_5",
        "title": "Movies about a person who lost their mother at birth?",
        "content": "I'm looking for any movies or series about a person, it can be a child or an adult, who lost their mother at birth. And they are trying to cope or something like that. Are there any movies about something like this? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ldxszh/movies_about_a_person_who_lost_their_mother_at/"
    },
    {
        "id": "1lda1uo",
        "author": "clist186",
        "title": "Anyone else in Canada notice the Naked Gun trilogy on Netflix got removed after a day?",
        "content": "It's been advertised for weeks as releasing Sunday June 15th, and I even started watching the second movie yesterday. I logged in today to continue watching and all three movies have been removed completely. Not even a \"coming soon\".\n\nEDIT (06/17): It does now say \"Coming Saturday\" (June 21), but only if you search 'Naked Gun Netflix' in Google and click the Netflix link. It's not searchable from within Netflix and doesn't show up in Netflix \"Coming Soon\".",
        "upvotes": 51,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1lda1uo/anyone_else_in_canada_notice_the_naked_gun/"
    },
    {
        "id": "1ldxnmw",
        "author": "ItsGeekFN",
        "title": "not saving place/episode when I switch from mobile to tv",
        "content": "I'm currently on episode seven of Death Note, and I'm watching it on my phone, when I went to go and watch it on my tv, it went back to episode one, so I went and hit play on the first episode to skip back to the current episode I'm on, then a bit later when I go back to my phone to watch it, it defaults to a certain point in episode 7 with that and the first episode being \"the only ones viewed/watched\", so I'm just asking if there's a netflix genius who could help me out.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldxnmw/not_saving_placeepisode_when_i_switch_from_mobile/"
    },
    {
        "id": "1lclhx2",
        "author": "moistwound",
        "title": "Netflix is punishing me for traveling",
        "content": "So I’m on vacation in the Caribbean with my girlfriend — we live together in CO, and like most people these days, we pay for the cheapest version of Netflix (with ads) because streaming’s gotten outta control. Between all the different platforms, we keep it low tier just so we can still have access to most stuff.\n\nAnyway, we’re chilling on vacation, decide to throw on a movie, and go straight to Netflix — our usual go-to. And what do we get? A notification saying:\n“Your subscription tier is not available in this region.”\nSo… basically, we can’t use Netflix at all.\n\nAnd THEN — get this — it hits us with:\n“You can change your subscription [here]” with a link to upgrade.\nLike that’s gonna make me go “oh yeah sure, let me give Netflix more money just so I can use it on my vacation.” Bro, be serious.\n\nI’ve been paying for Netflix for years. I’m not asking for a free ride — just some common sense. Would it really kill them to say:\n“This tier isn’t available in your current region. You have 7 days of access while traveling — enjoy your vacation!”\nGive me a little grace period. A little respect. I’m not a new user. I’m just out of town for a minute.\n\nSo what now? Am I supposed to pause or cancel my Netflix sub every time I leave the country? Is it even worth paying anymore if I’m gone for part of the month? It shouldn’t be that complicated.\n\nAnd this is why people are done with streaming services. They nickel-and-dime loyal users, and act surprised when people jump ship. It’s like they want to lose us.\n\nNetflix — if you’re listening — stop punishing your paying customers for traveling. It’s not a good look. Especially when all we wanted to do was watch a damn movie on vacation.",
        "upvotes": 600,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1lclhx2/netflix_is_punishing_me_for_traveling/"
    },
    {
        "id": "1ldi0qk",
        "author": "Dry_Emphasis306",
        "title": "Show has disappeared from laptop but not TV login...",
        "content": "I'm having an issue the past couple days where Mad Men has suddenly disappeared from Netflix on my laptop at work, but when checking at home on my TV, it's still there. I'm located in the UK, and when logged into the work network with my laptop, I check [fast.com](http://fast.com) and it shows my location as UK... so not sure why that one show would suddenly be missing. Anyone experienced this before?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldi0qk/show_has_disappeared_from_laptop_but_not_tv_login/"
    },
    {
        "id": "1ldqmv6",
        "author": "TheRealDeweyCox2000",
        "title": "Netflix screen is making my screen look broken.",
        "content": "My TV looks fine when going through the menu but does this crazy thing when I start playing a video.  Does anyone know what could be causing this?  It seems to also happen on HBO but I also have YouTube tv and don’t have any issues on that.   It’s so weird!",
        "upvotes": 0,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1slq0nhpdi7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ldqmv6/netflix_screen_is_making_my_screen_look_broken/"
    },
    {
        "id": "1ldf9r8",
        "author": "muffinpie90",
        "title": "Priscylla reveals what life is like after Dancing For The Devil: The Tiktok 7M Cult (and escaping the cult after 23 years)",
        "content": "She seems to be doing so much better now, but her story is wild. I hope they'll do a season 2, I really need to know what happens to Robert Shinn and Shekinah... And Miranda! ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldf9r8/priscylla_reveals_what_life_is_like_after_dancing/"
    },
    {
        "id": "1ldyquv",
        "author": "Human-Hospital6696",
        "title": "Pulse",
        "content": "So, Dani &amp; Xander were in a relationship, she feels like he didn’t wanna report to HR until he got offered a job &amp; now wants to cover his ass; they break up because of it, her sister tells her he SA’d a bunch of women at his last hospital, she believes it for whatever reason &amp; then encourages her to file a sexual harassment claim?  Like this can’t be it, I refuse to believe they wrote a female character in this climate that would ruin a man’s career because she doesn’t know how to regulate her emotions.\n\nHer sister also accused a family of neglecting &amp;/or abusing their child; wouldn’t listen when told to leave them alone &amp; as a result Dani almost lost her job for getting into a fight.  So the moral of the story is, Dani’s sister is a horrible person ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldyquv/pulse/"
    },
    {
        "id": "1le0s0h",
        "author": "GapDweller",
        "title": "Trainwreck: Mayor of Mayhem",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wrgbz3a1ck7f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1le0s0h/trainwreck_mayor_of_mayhem/"
    },
    {
        "id": "1ldoh40",
        "author": "Credit_Born",
        "title": "Japanese comedy series that i cant remember the name of.",
        "content": "Title says it all, i remember watching a Japanese comedy series airing from around 2016 - 17 or something like that.\n It was about a family of around 4 or something like that (a mother a father and two sons i believe) \nIn one episode the mother follows what she thinks is her husband to a strip club only to then find out that it was her son wearing her husbands jacket.\n I also remember a episode where the son hides in a closet for several days unaware that the parents knows that he is in there, they then try to make him feel terrible for hiding in there by throwing a party and getting him gifts and says stuff like \"oh its a shame that he isnt here  e.ct, \n\ni remember a bit of one episode, where the mother goes out on a balcony and starts singing, and all of the other residents flick their lights on and off in rythm to her song. Im not sure what it was called or if it even was Japanese or was on Netflix... If anyone has any idea please help me find out :-) thank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldoh40/japanese_comedy_series_that_i_cant_remember_the/"
    },
    {
        "id": "1ldc0c5",
        "author": "Low-Instance7728",
        "title": "Need binge worthy action shows for my grandma",
        "content": "Hi guys, as the title says I'm looking for a couple series of action shows on Netflix for my grandma. She's home a lot and really enjoys binge watching movies and TV shows. She loves action stuff and enjoys if there's a little romance too. She's watched all of the police and firefighter shows and suits, just so you get an idea of what she's into. She has also watched all of Star Gate SG1 and Hallmark movies as well as antique road show on repeat for like a month. She has varied tastes. But her favorite is action. \n\nIf anyone has suggestions for some shows that I can recommend her I'd greatly appreciate it! We have a plethora of other streaming services but Netflix is her favorite!\n\nTyia",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ldc0c5/need_binge_worthy_action_shows_for_my_grandma/"
    },
    {
        "id": "1lcpi0b",
        "author": "LowBudgetVillain",
        "title": "What’s a lesser-known show or movie that completely consumed your brain?",
        "content": "Hey Reddit, I’m on summer break and bored out of my mind.  \nI’m looking for series or movies to watch. Preferably something good enough to make me forget what day it is.\n\nStuff I enjoy:  \n• Psychological  \n• Horror  \n• Mystery or thrillers  \n• A good slow-burn with depth  \n• Soapy comfort shows like Gilmore Girls are fine too if they’re written well\n\nStuff I don’t enjoy:  \n• Anything overhyped that everyone’s watching right now  \n• Predictable plots or weak character arcs\n\nPlease give me your personal underrated faves. The kind of stuff you wish more people knew about. Bonus points if it has killer cinematography or sharp writing.\n\nThanks in advance ✨",
        "upvotes": 80,
        "comments": 278,
        "media": null,
        "permalink": "/r/netflix/comments/1lcpi0b/whats_a_lesserknown_show_or_movie_that_completely/"
    },
    {
        "id": "1ld5tu7",
        "author": "Brief-Buy9191",
        "title": "Mercy for None",
        "content": "Mercy for None is a violent South Korean action series that delivers. It follows a former gang enforcer who tried to walk away but is dragged back into a brutal underworld (John Wick vibes).\n\nThe story is solid, but the real star is the action. This show has some of the best martial arts scenes ever:  fast, intense, and packed with emotion. Every fight feels like it matters, and the stakes are real.\n\nShot in Seoul, the show is moody, stylish, and totally immersive. If you’re into dark, emotional stories with incredible fight choreography, Mercy for None is a must-watch.  Enjoy!",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ld5tu7/mercy_for_none/"
    },
    {
        "id": "1ld5py2",
        "author": "FoxyMiira",
        "title": "All Of Us Are Dead is the most unintentionally funniest show I've seen",
        "content": "I'm aware this finished ages ago but just decided to binge-watch this with a friend in one day. I would say this is the epitome of so bad it's good.\n\n* the detective character who is initially shown as a very serious character when introduced, but quickly turns into a goofy ass character who goes on random side quests because the plot demands he does random shit until the final episode.\n* that bully who is the main antagonist. Pretty much a Looney Tunes character\n* a girl that seemed like she would turn into a second antagonist and play a bigger role but hides in a storage room for 3 episodes (the same classroom the other kids are stuck in as well and no one even thinks to open the storage for supplies or something) and then dies unceremoniously\n* every episode there is **at least** 2 or 3 things that happens in the plot or the characters' actions that will absolutely blow your mind on how every character is a glue sniffer. It's a mystery how any of these characters even survived past childhood without getting run over in traffic or something. There's a scene where the students try to [sneak behind a zombie facing the window](https://youtu.be/EJzu9sCR-Ys?t=250). Of course one character decides to hold onto a pink steel flask when he's literally wearing a bag pack.\n* unintentionally funny scenes like the last episode when the half-zombie girl decides to jump off the building like some superhero. Or when the main character jumps out the window and you see a zoomed out shot of the character doing an inhuman acrobatic movie via cgi.\n* Pointless sideplots, pointless deaths, pointless characters that seemed like the show is setting up something but nothing happens.\n* Least on the nose political themes with the assembly woman character\n\nrecommend watching this while high. I'm also interested in what mind state the writers and showrunners were in while they produced this",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ld5py2/all_of_us_are_dead_is_the_most_unintentionally/"
    },
    {
        "id": "1ldxwtp",
        "author": "MiiisterKaniiister",
        "title": "AHH come on, get LOST!",
        "content": "I'm looking for something new to watch, and I've read often that LOST is a good series to watch (at least until some... ?... season?)\n\nAnyways, watched #1 yesterday and I couldn't even finish it...\n\nWhat a bullcrap! As soon as I realized they're on an island because their plane broke mid flight, I was, yeah, sure lol...\n\nThen the ... whatever eats people on that island. I don't even know and don't care.\n\nAnd the acting is also cringe.\n\nI thought, maybe it's just a sign of the times, and 20 years ago I would have liked it... It's an old series.\n\nHad the same experience with \"24\", first time I saw it I was so hooked! Then wasn't able to rewatch past episode 2 some 15-20 years later, it was the most stupid thing I've ever seen :-/\n\nHm",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ldxwtp/ahh_come_on_get_lost/"
    },
    {
        "id": "1ldcdnx",
        "author": "ThrowRA_cheggkitten",
        "title": "You - Available w/ Ad Free Plan?",
        "content": "Is You (season 5) available to watch with the ad free plan? I don't know if there is any way to check without a subscription but if anyone can help me find out since I am planning to subscribe just for this show. Ty! ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ldcdnx/you_available_w_ad_free_plan/"
    }
]