[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 352,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1lyi1um",
        "author": "Beastmaster122810",
        "title": "It has no right to be as good as it is",
        "content": "",
        "upvotes": 43,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p0n96mk91kcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lyi1um/it_has_no_right_to_be_as_good_as_it_is/"
    },
    {
        "id": "1lysljv",
        "author": "Thin_Smile2722",
        "title": "Need recommendations to watch",
        "content": "I am currently having free time with no pending work or anything and thinking to start a new series/movie. \n\nPs: recommend series other than squid games ",
        "upvotes": 3,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1lysljv/need_recommendations_to_watch/"
    },
    {
        "id": "1lyujg2",
        "author": "Quirky_Appearance539",
        "title": "Netflix account hacked! Need help desperately!",
        "content": "I need some help. My Netflix account is hacked &amp; I have lost access to everything. My payment goes through a UPI mandate which I don't have anymore but my bank account is linked so debits will likely happen. I've been logged out of my devices. Please can you help me regarding this? I want to contact them &amp; get my details changed so please can there anything be done?\n\nEdit: I called customer care &amp; they checked my details &amp; sorted out the issue immediately! Thanks everybody here for helping me! 🫡",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lyujg2/netflix_account_hacked_need_help_desperately/"
    },
    {
        "id": "1lyvgdm",
        "author": "desperate_shrimp",
        "title": "cannot log into netflix on multiple devices",
        "content": "me and my bf are from germany, currently in denmark, and suddenly none of our devices can log into our netflix account, nor request a login code. he is still logged in with his phone, but when i try with my phone, my ipad or my laptop it won't let me in. we double checked the password, it's correct - i tried logging in on the browser on my phone via mobile data and it worked there, but then i went over to the app as you can't watch netflix on the browser on mobile devices, and the app just refuses to log me in. i cleared all caches, reinstalled the app for the phone and tablet, restarted all devices, used my mobile hotspot from my phone for my laptop and tablet, we waited a day to see if this problem would resolve itself - nothing works. only thing left we have not tried is resetting the password on the one device we're still logged in with, but we're a little wary we will be kicked out of the account on his phone as well. very frustrating as we only subscribed to watch during our vacation. does anyone have any more ideas? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lyvgdm/cannot_log_into_netflix_on_multiple_devices/"
    },
    {
        "id": "1lyvc9p",
        "author": "Wonderful-Wafer-5874",
        "title": "Subtitles for English dialogue on foreign shows",
        "content": "So I'm watching squid game in the original Korean language of course but when it comes to the vips who are speaking English there are no subtitles which is annoying because i need subs for everything! Is there an option to add this on? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyvc9p/subtitles_for_english_dialogue_on_foreign_shows/"
    },
    {
        "id": "1ly50vd",
        "author": "STARRIMS",
        "title": "LUPIN is my most favorite series ever.",
        "content": "I have tried so many series in Netflix, and I don't even last one episode; from Money Heist to House of Cards to Dark. Whereas I was so Intrigued to Lupin in 2023, I login Netflix just to Re-Watch LUPIN again and again.\n\nI even stared reading Arsene Lupin and love my time in it. Eagerly waiting for Lupin part 4.\n\n  \nI am just asking who explore Netflix a lot, is there anything alike LUPIN?",
        "upvotes": 57,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ly50vd/lupin_is_my_most_favorite_series_ever/"
    },
    {
        "id": "1lysy1r",
        "author": "Ill-Particular-9138",
        "title": "Sequel Kpop Demon Hunters",
        "content": "Don't keep your fans waiting any longer and order the sequel to your hit as soon as possible. After all, you and Sony Pictures Animation see how crazy the world is about your hit. Please order this sequel and let the creators of K-Pop Demon Hunters do their thing.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lysy1r/sequel_kpop_demon_hunters/"
    },
    {
        "id": "1lysdp3",
        "author": "mmeeeerrkkaatt",
        "title": "Sandman Episode 1 - Oof",
        "content": "Ugh. After quite a while going without, I got Netflix again for a month just to finish Sandman, now that the second and final season is out this month. \n\nI knew it would feel different this time, after the appalling allegations that have come out about its author. But there's no escaping that the comics meant a lot to me at one time, and I enjoyed a lot of Season 1, despite its flaws. So I wanted to see it through. \n\nI'm only on episode 1, but so far it's really not working for me. Chiefly, I think, it's the script. It feels even more \"pseudo olden times speech\" than usual, if that makes sense - like, almost what a middle school kid thinks Shakespeare or medieval fantasy talk should sound like. As if all they did was  write a modern after school drama script, and then find and replace phrases like \"Don't you?\" with \"Do you not?\", and then called it a day. The actors do their best (I mean, I've seen Tom Sturridge do actual Shakespeare, and he is absolutely world class.) But it's hard to convey substance with such empty lines. \n\nIt also feels like the writers are going for some weird comic punchlines - as seen in the moments during the family reunion scene, where several times the dramatic music suddenly cuts out just in time for someone to make an irreverent quip. To me it just feels like a lack of trust in the material to be played sincerely, so they feel the need to add a bit of ironic \"haha we don't take ourselves to seriously\" snark into it just in case. \n\nAnd lastly, the whole Nada thing. It's been 10,000 years (as they tell us many times), and yet all it takes is one chat with his sister to suddenly make him obsessed with \"righting a wrong\"? What changed in that 5 minute conversation? Are you telling me he just never considered it that way before? With how much this guy broods over abso-fucking-lutely everything, he just never happened upon the possibility that this incredibly un-nuanced moral un-dilemma might have been problematic on his part? Baffling take.\n\nAnyway. Yeah. Let me know your experiences with this if you want.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lysdp3/sandman_episode_1_oof/"
    },
    {
        "id": "1ly3h6v",
        "author": "BackgroundEscape9250",
        "title": "Wtf should I watch",
        "content": "I have been trying to find a good series on Netflix (located in EU) but after the first episode I can’t focus because it’s so boring. \n\nWhat i like to watch: \n\n- Brooklyn 99\n- Ghosts  \n- Tires \n- The residence \n- Arrested development \n- A shop for killers \n- Sirens \n\nSomething like the above, please. Yesterday I ate my whole burrito just surfing Netflix trying to find something. My food gets cold. Pls help. ",
        "upvotes": 44,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1ly3h6v/wtf_should_i_watch/"
    },
    {
        "id": "1lypqht",
        "author": "ThomasOGC",
        "title": "Wake Up Dead Man to Open BFI London Film Festival | CGO",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lypqht/wake_up_dead_man_to_open_bfi_london_film_festival/"
    },
    {
        "id": "1lyp3qn",
        "author": "jamiebucknole",
        "title": "Fast forward question",
        "content": "I watch WWE on my sky a box on the Netflix app and when I used to fast forward I could see what’s happening in a small box but recently I can’t see when fast forwarding and wanted to know is there a way to get it back? Any help much appreciated ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp3qn/fast_forward_question/"
    },
    {
        "id": "1lyp2sp",
        "author": "sparklesandroses",
        "title": "Can you use Netflix on the same device, at different locations?",
        "content": "I watch Netflix on my laptop, typically at home, if I take my laptop to another address regularly, will I still be able to use it? It’s just so that I can watch it whilst I’m working at my unit and at home.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp2sp/can_you_use_netflix_on_the_same_device_at/"
    },
    {
        "id": "1lyoljz",
        "author": "howiehue",
        "title": "The messy implications of K-pop demon hunters’ ending",
        "content": "Okay so let me get the positives out of the way first. The animation is great. The music, while not my style, I can appreciate as well crafted bops. Love how unhinged the girls can be.Overall it’s a fun movie.\n\nBut then I started to that thing where I think about the themes of a kids movie like a dumb nerd and I found that it doesn’t really hold up that well. \n\nSo one of the main conflicts in the movie is Rumi wanting to hide the fact that she is half demon. She sees herself as a mistake for most of the movie which makes for great irony considering the lyrics of golden. So far so good. She starts talking to Jinu which shows her that there is humanity in the demons. Okay great. \n\nSo for me this is all pointing the narrative to one obvious conclusion. There is nothing wrong with the demons, it’s just the bad guy Gwi-Ma that’s the problem. Get rid of him and there would be no need for the Honmoon, humans and demons can live together in peace and Rumi can be proud as a mixed race person of both Korean and demon decent, thus finally accepting herself.\n\nExcept that’s not what happened. The demons, with the exception of Jinu are all evil and so they have the big showdown and beat the demons and restore the Honmoon. Uuum… ok.\n\nSo what does this mean for Rumi? Can she truly accepted herself as a half demon while still sealing them off from the human world? Like was Celine right for rejecting Rumi’s demon heritage if they are basically all evil except for the one love interest? Is Rumi fine with being half demon so long as she’s ’one of the good ones.’ I’ll admit that what I proposed was cliche, but at least it’s still a positive message. There are real mixed race people who do have an extreme dislike for half of their heritage and the answer that K-pop demon hunters has is that you can accept yourself, but so long as you close off that part of your heritage and try to forget that it’s a part of you. Idk that’s really sad to me. \n\nAnywho, y’all let me know if I missed something that can makes the ending by make sense. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lyoljz/the_messy_implications_of_kpop_demon_hunters/"
    },
    {
        "id": "1lyml7v",
        "author": "choco_covered_mango",
        "title": "ESLs how are the English subtitles for shows in your primary language?",
        "content": "I enjoy a lot of the Korean variety shows on Netflix. I am fluent in Korean but for my wife, Korean is her third language so she likes to have English subs on. I grew up watching a lot of foreign tv with subtitles and when it comes to Korean, I can both hear and passively read every word. I am baffled by some of the subtitles. it's not just bad, they straight up make up entire sentences that were not said. like someone will say \"hmm\" and the subtitle will say something like \"oh that's terrible\" I understand not translating puns or expressions or culturally specific things. but sometimes they add unnecessary fillers that change the context. sometimes it feels like someone who barely understands Korean is using google translated english and making up fillers here and there.\n\nhow are the English subs are for other languages? I'm mostly asking about variety tv shows, not dramas or movies. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyml7v/esls_how_are_the_english_subtitles_for_shows_in/"
    },
    {
        "id": "1lyp7cu",
        "author": "International_Bed582",
        "title": "How do I get profile icons that Netflix has deleted?",
        "content": "I've followed all of the old tutorials that pop up on google when I search this question, but it seems they're all outdated and have been patched. I really want the Ariana Grande one that is no longer available. My friend has it and it makes me mad lol. Is there any working way of doing this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyp7cu/how_do_i_get_profile_icons_that_netflix_has/"
    },
    {
        "id": "1lyjgk6",
        "author": "Fangirl365",
        "title": "Having trouble searching for games",
        "content": "Hi, my friend wants to play Cozy Grove, but for whatever reason, it's not showing up for him in the game section. I'm not sure if it's a search issue on Netflix's end, but it seems like the game isn't even being shown because the algorithm doesn't think it's his interest. Has anyone else found a way around this and been able to download a game they aren't easily presented with?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyjgk6/having_trouble_searching_for_games/"
    },
    {
        "id": "1lxmun8",
        "author": "Few_Substance_705",
        "title": "\"Too much\" is just \"Girls\" repackaged and its cringe and out of touch.",
        "content": "HOT TAKE!! I am yet to meet the Lena Dunham/ Girls Stans. \n\nFor the life of me I couldn't understand who resonated with \"Girls\" the entire premise was a selfish, spoiled jewish chick who made terrible decisions and then became the victim of her own sabotage. Fast forward to I was on a 9 hour flight last night and downloaded \"too much\" on Netflix, within the first few mins it felt familiar. And then when I saw Lena Dunham in the second episode It hit me. The main character is Lena Dunham in \"Girls\" and this entire show is \"Girls\" repackaged and set in London. EVEN her love interest looks and acts like exactly Adam!! \n\nThe worst part is in an interview Lena Dunham said this show was meant to resonate with Gen Z. How???!! I am a millennial who works in marketing and even I know Its so out of touch! ",
        "upvotes": 155,
        "comments": 422,
        "media": null,
        "permalink": "/r/netflix/comments/1lxmun8/too_much_is_just_girls_repackaged_and_its_cringe/"
    },
    {
        "id": "1lyr7b8",
        "author": "B-Hydra",
        "title": "Does Netflix Use Motion Sensing?",
        "content": "There have been a couple of times that it seems Netflix has managed to pause my playback based specific actions I do. The first example is if I am watching Netflix and then I leave the room, the playback is paused. This only happened after about 10 minutes of watching, so the time component wouldn't make sense. After I pressed play and left the room it paused again but after the third time there was no automatic pause. \n\nThe second instance is when I put on netflix while in bed. If I happen to rollover, the playback is paused, and then after a second it pauses again but after the third time there is no automatic pause. \n\nAm I just being paranoid or does Netflix how some way of tracking used movements to pause playback at specific times, either when users are not in the room or perhaps may not be paying attention. I know that after a certain amount of time Netflix will check if a user is still watching. Just in case this has any bearing, the devices I watch Netflix on are a Samsung phone and a Samsung smart monitor. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lyr7b8/does_netflix_use_motion_sensing/"
    },
    {
        "id": "1lxv5kx",
        "author": "S4v1r1enCh0r4k",
        "title": "Squid Game Creator Keeps Door Open for Season 4: \"Never Say Never\"",
        "content": "",
        "upvotes": 35,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1lxv5kx/squid_game_creator_keeps_door_open_for_season_4/"
    },
    {
        "id": "1ly62op",
        "author": "Second-Fickle",
        "title": "Too much on Netflix",
        "content": "What a beautiful series !!! \nLove every scene every episode \nFlashbacks of past lives , memories , emotions and the characters \nWhat are your fav scenes \n",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ly62op/too_much_on_netflix/"
    },
    {
        "id": "1lyrubw",
        "author": "WhyareIstillhere",
        "title": "Something weird is going on with my Netflix payment",
        "content": "Up until about a week ago, everything was going okay until I got this message. We've had Netflix for about two years now and we've never got this message once. My mother is the one paying for Netflix but I handle all the passwords and stuff. We've been trying to pay for it but \"we got an error processing your payment\" keeps on coming up.\n\nAt first I thought it might've been something to do with my mother's email because one day it just broke (no easy way to explain it. It just logged her out of her email and stopped working.) Then I thought it might've been because Netflix raised their prices so I tried to get a new Netflix account and the same message popped up!\n\nI'm in Ireland if that matters in any way. It's just really annoying because me and my mother had begun to watch a series and she was really enjoying it!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lyrubw/something_weird_is_going_on_with_my_netflix/"
    },
    {
        "id": "1lydsbh",
        "author": "bailsjay19",
        "title": "Algorithm",
        "content": "Surely there is a way of making the algorithm realise that I have watched certain shows and to stop them coming up again and again, \nthe only section this should be in is watch again but so many shows will show up in every category of the algorithm even though I have completed the series years ago….\nI feel it’s hard to even concentrate on finding a new show to watch as all the subscription services seem to have made such a mess of there algorithms \nAgree or disagree? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lydsbh/algorithm/"
    },
    {
        "id": "1lyi8lm",
        "author": "smetwz2112",
        "title": "Subtitles appearance",
        "content": "Hii, hope I did the right flair!\n\nSo I just signed up today after two years of not using Netflix at all (now is my own account, not shared) and I have come across an inconvenience: I can't change the subtitles appearance.\n\nI have tried changing them like 10 times now from my browser and it shows the same one on the app regardless.\nIt's a bit annoying since I remember in the past I could just change it on the browser, refresh and it would show the new one now selected. And it's a problem for me since I watch a lot of foreign content with english subtitles (I'm learning) and the one font it has now it's hard for me to read haha\n\nI'm on my phone. iPhone device. Is there something I'm doing wrong?\n\nSorry for any mistakes ;)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyi8lm/subtitles_appearance/"
    },
    {
        "id": "1lyglk0",
        "author": "ladybug188",
        "title": "Cant log in",
        "content": "I have my Netflix account opened on me and siblings mobile but when im trying to open on my pc it keep leading me to making new account/membership \nLike asking card details and saying start membership \nI just wanna log in into my existing account ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyglk0/cant_log_in/"
    },
    {
        "id": "1ly6ka4",
        "author": "Makuta_Servaela",
        "title": "Suggestions for Drama Shows like House that are good for Listening",
        "content": "I need something to listen to while I work, that I don't have to watch directly. I've watched through House and The Resident so far, the former being perfect for what I needed (The Resident's romancy side-plots were a bit boring for me). The things that made House perfect was:\n\n- Serious overall show with some comedy/wittiness. (No Sitcoms or pure comedies or whatnot. I like a good plot).\n\n- Each hour episode has its own story. The season has an overall storyline, but each episode itself has its own story that is concluded by the end of the episode. (So, no Audiobooks or Podcasts)\n\n- The mystery element, where the protagonists are spending the episode trying to figure something out, and the something is satisfyingly figured out by the end of the episode.\n\n- Most importantly: The protagonists describe what's going on. In House, the characters would describe down to the detail each symptom they were seeing, the ways the diseases affected the patient, etc. \n\n- Also, I know there's one or two that are basically \"House, but it's about Psychiatry\". None of that. I am in the field of Psychology, I would be too offput by the inaccuracies.\n\nAny suggestions?\n\nI might try out one of those lawyer detective ones, like Law and Order or whatnot, but I don't know which ones of those would be a good fit. But open to other suggestions as well.\n\nThank you!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ly6ka4/suggestions_for_drama_shows_like_house_that_are/"
    },
    {
        "id": "1lyg5lv",
        "author": "Eastern-Rabbit-3696",
        "title": "Brick (2025)?",
        "content": "I swear to god this movie has been on Netflix's \"worth the wait\" list for what has been like 4 years now and they put out a trailer only a week or so ago.\n\nThey gave some sort of vibe that it was going to be a chamber piece w/ a couple stuck in an apartment with a brick wall but it just turns out to be some kind of Temu Cube mess. I wonder what happened?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lyg5lv/brick_2025/"
    },
    {
        "id": "1ly2uid",
        "author": "DependentWise9303",
        "title": "The real Project X",
        "content": "Spoiler alert! So many things to say here. \n\nFirst of all are these grown as* men so proud of themselves so many years later. Also this POOR girl whose birthday has now been forever connected with the death of two innocent women. \n\nWhen she said the line at some point my dad was called and told two girls died and hee facial expressions from knowing shes filmed to wanting to break down to trying to numb herself man I felt this in my core. \n\nMy cousin died on my birthday 10 years ago - she was sick her entire life and I still have nightmares about it. \n\nBut one thing that impressed me is how the Dutch no thanks to the useless major and cops cleaned up their own town the day after. This is something I see in Netherlands/ Sweden that I really feel we can learn from. \n\nResponsibility and community. \n\nAnyway overall i enjoyed the entire series one by one and the ones i didn’t know about even more than Astro world which I already knew about. \n\nPoop cruise ie prob still number one but its a good series albeit filled with what not to do. Unfortunately we know humans and history has a way if repeating itself. ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ly2uid/the_real_project_x/"
    },
    {
        "id": "1lym7iq",
        "author": "Classic_Mix_3126",
        "title": "Building a band",
        "content": "I love the show, and even more cause Aj McLean is the host. However the fact that some of the contestants keep bringing up being like NSYNC, growing to be like them or like them. DONT DESERVE TO MOVE FORWARD. Cause they already wanna fail in life. NSYNC failed. And they’re in the presence of a Boy Band legend AJ from Backstreet Boys. A band that’s thriving through the decades. Like NSYNC has one okay song and you wanna be a one hit song breakable dumb band? Already talking like failures ngl. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lym7iq/building_a_band/"
    },
    {
        "id": "1lxyv51",
        "author": "Horror_Low_6881",
        "title": "Want some suggestions being new on netflix",
        "content": "what are some shows and movies would you recommend I also like animes. I have not used netflix before so I was wondering what is worth watching I already know popular names like money heist, demon slayer, squid game etc.. Still curious recommend me your favs and some underrated and niche titles as well",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lxyv51/want_some_suggestions_being_new_on_netflix/"
    }
]