[
    {
        "id": "1n6hto7",
        "author": "ObsessionAMA",
        "title": "Hey /r/movies! I'm filmmaker Curry Barker (MILK &amp; SERIAL). My new film, OBSESSION, is premiering this Friday 9/5 at the Toronto International Film Festival as a Midnight Madness selection. Ask me anything!",
        "content": "Hey reddit, I'm filmmaker Curry Barker, and my new film, OBSESSION, is heading to TIFF this week! You might know my directorial feature debut, MILK &amp; SERIAL (2024). \n\nOBSESSION will have its World Premiere at the Toronto International Film Festival this Friday, September 5, as part of the Midnight Madness program. The film stars Michael Johnston, Inde Navarrette, Cooper Tomlinson, and Megan Lawless.\n\nAsk me anything!\n\n**Synopsis:** \n\nObsession plunges into a fever dream of longing, delusion, and the chilling cost of getting exactly what you desire. Bear, a hopeless romantic, gets pulled into a spiral where passion and terror become inseparable.\n\nFrom Curry Barker (Milk &amp; Serial), this visceral, atmospheric thriller fuses psychological horror with a haunting supernatural edge. Starring Inde Navarrette (Superman &amp; Lois), Michael Johnston (Teen Wolf), Cooper Tomlinson (Milk &amp; Serial), and Megan Lawless (The Death That Awaits), Obsession is a twistedlove story that dares to ask: How far would you go to be loved back?\n\n\\-----------------------------------------------------------------------------------------\n\n**TIFF's write-up of the film:**\n\nWoe is Bear (Michael Johnston), who has long carried a torch for his childhood friend Nikki (Inde Navarrette). When another attempted profession of love fizzles, Bear wistfully wishes for romantic reciprocation, unfortunately doing so while in possession of a trinket with supernatural properties of The Monkey’s Paw variety.\n\nSuddenly, Nikki is all over Bear, and he is quick to indulge in this long-desired turnabout while ignoring the ramifications of her intensifying fixation. Before long, Bear’s fantasy turns to nightmare as Nikki’s personality begins to twitch with a disturbing dysphoria that sinisterly suggests her autonomy has been usurped by a malignant entity that wants them both, body and soul.\n\n“Be careful what you wish for” may be a staple in the horror genre, but writer-director Curry Barker enlivens this well-worn premise by lacing its inherent irony with a wickedly wry tone and an anxious tension that’ll plummet the stomach of even hardened Midnighters. Having honed high-concept absurdism and creeping dread from his online productions, Barker deftly demonstrates a savvy command of tone and terror reminiscent of fellow sketch comedian Zach Cregger’s Barbarian.\n\nAs with that auspicious debut, Barker’s first feature preserves an uncomfortable relatability in its hyperbolic scenario. Though literally featuring a customer service call from (and possibly to) Hell, Obsession cuts to the quick as it lays bare the innate violence in romantic objectification with an unforgiving candidness. That's made all the more disarming, thanks to exceptionally nuanced performances, particularly from Navarrette whose “Freaky Nikki” oscillates between doe-eyed desire and devastating torment that will chill you to the bone.\n\n\\----------------------------------------------------------------------------------------------------\n\n**My bio:**\n\nCurry Barker is a writer-director with a bold, visceral style. His work blends raw emotion with psychological horror and dark comedy. He co-created That’s a Bad Idea, his sketch comedy channel, and directed Milk and Serial, both known for their brutal honesty and striking, cinematic visuals.\n\nAsk me anything! Back at 5 PM ET today (Tuesday 9/2) to answer any questions.",
        "upvotes": 49,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qcio23ghiqmf1.png?auto=webp&amp;s=9c6f7be58a60078897704b6190383d562023ba1b"
        },
        "permalink": "/r/movies/comments/1n6hto7/hey_rmovies_im_filmmaker_curry_barker_milk_serial/"
    },
    {
        "id": "1n6mf61",
        "author": "TheCutAMA",
        "title": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. It premiered at TIFF 2024. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!",
        "content": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!\n\nThe film had its World Premiere at the Toronto International Film Festival last year. Here to answer your questions.\n\nRepublic Pictures will release THE CUT In Select Theaters September 5th!\n\nCheck out the Trailer: [https://paramnt.us/TheCutTrailer](https://paramnt.us/TheCutTrailer)\n\nSYNOPSIS: After a career-ending defeat, a former champion trains for redemption – but as obsession takes hold and reality unravels, he may be spiraling into something far more terrifying.\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1193346/](https://www.imdb.com/name/nm1193346/)\n\nAsk me anything! I'll be back at 11:00 AM ET tomorrow (Wednesday 9/3) to answer your questions!",
        "upvotes": 33,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wdz0f96wqrmf1.jpeg?auto=webp&amp;s=d5685cf32f3353080b4a130229ceb6f076d98877"
        },
        "permalink": "/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/"
    },
    {
        "id": "1n6it91",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Wake Up Dead Man: A Knives Out Mystery'",
        "content": "",
        "upvotes": 32226,
        "comments": 1337,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tc6byqsy1rmf1.jpeg?auto=webp&amp;s=1c5483d0b00452f1b01a72a42d2c177d7b909146"
        },
        "permalink": "/r/movies/comments/1n6it91/official_poster_for_wake_up_dead_man_a_knives_out/"
    },
    {
        "id": "1n6vp8r",
        "author": "dottiedanger",
        "title": "I expected Edge of Tomorrow to be forgettable… but it blew me away. What’s your surprise favorite?",
        "content": "When Edge of Tomorrow released, I assumed it was just another Tom Cruise action movie. I skipped it in theaters because the marketing didn’t grab me. Months later, I finally gave it a shot, and it completely flipped my expectations. The part that hooked me was when Cruise’s character keeps dying during training with Rita. It’s darkly funny watching him try to get it right and failing in ridiculous ways, yet slowly improving. \n\nThat experience made me realize how many films I might dismiss too quickly based on trailers or hype. So now I’m curious. What’s a movie you thought would be “meh,” but ended up loving?",
        "upvotes": 2932,
        "comments": 1020,
        "media": null,
        "permalink": "/r/movies/comments/1n6vp8r/i_expected_edge_of_tomorrow_to_be_forgettable_but/"
    },
    {
        "id": "1n77xge",
        "author": "MarvelsGrantMan136",
        "title": "28 Years Later: The Bone Temple | Official Trailer",
        "content": "",
        "upvotes": 347,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GXBV8vTLwxKQ0_qmVJoX2xBdf2tHHbBEBC7lM_Xgid0.jpeg?auto=webp&amp;s=7466492a76c5e1c8e1e6bfa2a2ba29d622397b84"
        },
        "permalink": "/r/movies/comments/1n77xge/28_years_later_the_bone_temple_official_trailer/"
    },
    {
        "id": "1n77uvd",
        "author": "Used-Video8052",
        "title": "12 Years of My Life in Movie Tickets",
        "content": "12 Years of My Life in Movie Tickets \n\nHi everyone, I’m a movie lover from the Philippines, and for the past 12 years I’ve been keeping every single movie ticket I could. It’s my little time capsule of cinema — from After Earth in 2013 for ₱135 to Weapons in 2025 for ₱320.\n\nWish I’d started sooner so I’d have every ticket I’ve ever bought.",
        "upvotes": 297,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bwpmh9nzdwmf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n77uvd/12_years_of_my_life_in_movie_tickets/"
    },
    {
        "id": "1n6i0m0",
        "author": "MarvelsGrantMan136",
        "title": "First Images from,'28 Years Later: The Bone Temple'",
        "content": "",
        "upvotes": 5393,
        "comments": 907,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/71ynspkevqmf1.jpeg?auto=webp&amp;s=6f07486d57c2bb30c822fb7ed8df410240de5baa"
        },
        "permalink": "/r/movies/comments/1n6i0m0/first_images_from28_years_later_the_bone_temple/"
    },
    {
        "id": "1n77xz3",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for '28 Years Later: The Bone Temple'",
        "content": "",
        "upvotes": 164,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q1tjzpbyewmf1.jpeg?auto=webp&amp;s=14a7ea8db08077fc3c3dadb218edc8fb19f7cd15"
        },
        "permalink": "/r/movies/comments/1n77xz3/official_poster_for_28_years_later_the_bone_temple/"
    },
    {
        "id": "1n6oa3w",
        "author": "ChiefLeef22",
        "title": "Christopher Nolan's 'TENET' Turns 5: How Nolan's Most Divisive Film has also Garnered a Dedicated Fanbase Preaching its Gospel",
        "content": "",
        "upvotes": 1763,
        "comments": 839,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K61-nXFySYXxSzdqAtTi_niinj_kUvkZ531ytaXkNSU.jpeg?auto=webp&amp;s=f9c9ce2b1573e0fe322f052c9de8888505b772d5"
        },
        "permalink": "/r/movies/comments/1n6oa3w/christopher_nolans_tenet_turns_5_how_nolans_most/"
    },
    {
        "id": "1n6n286",
        "author": "ChiefLeef22",
        "title": "'The Long Walk' - Review Thread",
        "content": "*Teens participate in a grueling high-stakes contest where they must continuously walk or be shot by a member of their military escort.*\n\nDirector: Francis Lawrence (The Hunger Games: Catching Fire, Mockingjay - Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes)\n\nCast: Cooper Hoffman, Ben Wang, Mark Hamill, David Jonsson, Garrett Wareing, Tut Nyuot, Charlie Plummer\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/the_long_walk_2025)\n\n**Metacritic:** [80/100](https://www.metacritic.com/movie/the-long-walk-2025/)\n\nSome Reviews:\n\n[Total Film - Lauren Milici](https://www.gamesradar.com/entertainment/horror-movies/the-long-walk-review/)\n\n&gt;The Long Walk is not for the faint of heart, but it is one of the best Stephen King adaptations ever made, and one of the best dystopian sci-fi movies to hit the big screen in a really long time.\n\n[Next Best Picture](https://www.rottentomatoes.com/critics/source/3046) \\- [Giovanni Lago](https://www.rottentomatoes.com/critics/giovanni-lago) \\- 7 / 10\n\n&gt;It can exhilarating as Frances Lawrence and JT Mollner bring a bit of edge to this beloved Stephen King adaptation. Cooper Hoffman and David Jonsson are both excellent, delivering riveting performances that emotionally reel in the audience. It can also feel repetitious at times, trying to replicate the highs of some of the more exciting set pieces, building towards an expected ending.\n\n[Slashfilm - BJ Colangelo](https://www.slashfilm.com/1953442/the-long-walk-review/) \\- 9 / 10\n\n&gt;\"The Long Walk\" is an emotionally obliterating all-time great Stephen King adaptation, and undoubtedly one of the best films of 2025. The camaraderie shown by the group is not unlike the foxhole friendships developed between soldiers during wartime, but given the hopelessness of their situation, it starts to feel like we're watching the American version of \"All Quiet on the Western Front.\" Wang provides a majority of the much-needed levity with his sharp tongue and fearless delivery, while Baker's warm, gentle optimism represents the best of humanity.",
        "upvotes": 1555,
        "comments": 333,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GFdHr3rQgXTOQkgn45q5bCIZoGDOn6HCUqHRbJssKHE.jpeg?auto=webp&amp;s=924d574f5b21e1fadcc6b32e7cb88b6d19d7f2aa"
        },
        "permalink": "/r/movies/comments/1n6n286/the_long_walk_review_thread/"
    },
    {
        "id": "1n72yiy",
        "author": "Cheesecake1901yum",
        "title": "What's your feel good movie? A movie that makes you feel at ease and that you've seen a billion times.",
        "content": " For me funny enough, it's the first fast and the furious lol . I watched it religiously when I was younger with my uncle, I remember wanting my own skyline and i would quote the movie all the time. Like I would tell my pal they forgot something and they'll ask what and I'll say \"dont forget that Hector is going to be running three Honda civics with spoon engines, and on top of that, he just went into Harry’s and bought three t66 turbos with nos, and a motec exhaust system\" lol as an example.\n\n Now me being much older and hav seen soo many movies, from ones that make me sad or cinema masterpieces like The Pianist, yet everytime the movie comes on I just feel at ease, a feeling i dont get with any other movie, if that makes sense, I enjoy it everytime and despite how you feel about the series now, the first one is a absolute classic and I never get tired of it. This movie has a special place in my heart and its my feel good movie.",
        "upvotes": 209,
        "comments": 673,
        "media": null,
        "permalink": "/r/movies/comments/1n72yiy/whats_your_feel_good_movie_a_movie_that_makes_you/"
    },
    {
        "id": "1n6yqqw",
        "author": "NativeSonSF",
        "title": "Which film realistically depicts your experience in high school?",
        "content": "Breakfast Club, Clueless, Fast Times and Ridgemont High, The Perks of Being a Wallflower, Lady Bird and Rushmore are fantasies. Which film accurately depicts the high school experience? \n\nDoes a film exists that is as banal as real high school but still manages to be interesting? As grim as Elephant (2003) is in topic, I thought the tone hauntingly captured the feeling of being in high school. Is there something better out there?",
        "upvotes": 353,
        "comments": 786,
        "media": null,
        "permalink": "/r/movies/comments/1n6yqqw/which_film_realistically_depicts_your_experience/"
    },
    {
        "id": "1n6xgo1",
        "author": "Immediate-River-874",
        "title": "Patrick Stewart in Hamlet (2009 film) - “Oh, my offence is rank…”",
        "content": "",
        "upvotes": 254,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w1o6j0q0ttmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n6xgo1/patrick_stewart_in_hamlet_2009_film_oh_my_offence/"
    },
    {
        "id": "1n6hjrj",
        "author": "MarvelsGrantMan136",
        "title": "Official IMAX Poster for 'HIM'",
        "content": "",
        "upvotes": 1654,
        "comments": 278,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6rh1b3oarqmf1.jpeg?auto=webp&amp;s=2c63c9146927726daec7be8e0eb76d22fb9a11fa"
        },
        "permalink": "/r/movies/comments/1n6hjrj/official_imax_poster_for_him/"
    },
    {
        "id": "1n6txcj",
        "author": "NoCulture3505",
        "title": "‘Rocketman’ Filmmaker Dexter Fletcher to Direct ‘The League of Gentlemen’ Remake for Paramount",
        "content": "",
        "upvotes": 372,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hclMzaTxBhphHiuHwPSN8LaRKF7ZgjqJzCfHJzzQ_zI.jpeg?auto=webp&amp;s=e2fe8fdaeb882a07a756fad38b50c5f9e870d57e"
        },
        "permalink": "/r/movies/comments/1n6txcj/rocketman_filmmaker_dexter_fletcher_to_direct_the/"
    },
    {
        "id": "1n6mthn",
        "author": "bjkman",
        "title": "David Keighley, Imax Chief Quality Officer, Dies at 77",
        "content": "",
        "upvotes": 798,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EvJgqln7l7JI4LvjQAvT8QF_MSSV22PCvziG7en6TWA.jpeg?auto=webp&amp;s=018a5ce7be0bf89c8088ed6bd4611dddefdafd33"
        },
        "permalink": "/r/movies/comments/1n6mthn/david_keighley_imax_chief_quality_officer_dies_at/"
    },
    {
        "id": "1n6p16v",
        "author": "ChiefLeef22",
        "title": "Kathryn Bigelow's 'A House of Dynamite' - Review Thread",
        "content": "*When a single, unattributed missile is launched at the United States, a race begins to determine who is responsible and how to respond.*\n\nCast: Idris Elba, Rebecca Ferguson, Gabriel Basso, Jared Harris, Tracy Letts, Anthony Ramos, Moses Ingram, Greta Lee, Jonah Hauer-King, Jason Clarke, Willa Fitzgerald\n\n**Rotten Tomatoes:** [92%](https://www.rottentomatoes.com/m/a_house_of_dynamite)\n\n**Metacritic:** [88/100](https://www.metacritic.com/movie/a-house-of-dynamite/)\n\nSome Reviews:\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/09/a-house-of-dynamite-review-kathryn-bigelows-urgent-warning-1236503258/)\n\n&gt;To say this is an important film for our time is an understatement. Hopefully the current world leaders who have our fate in their hands are listening. “There is *still* time brother” indeed.\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/a-house-of-dynamite-review-idris-elba-kathryn-bigelow-1236359097/)\n\n&gt;Eight years since her last feature, Kathryn Bigelow returns with an unrelenting chokehold thriller so controlled, kinetic and unsettlingly immersive that you stagger out at the end of it wondering if the world will still be intact. Though it’s less a war film than a drama about the aggressive threat of war, *A House of Dynamite* is very much of a piece with the director’s later-career gut punches, *The Hurt Locker* and *Zero Dark Thirty*.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/sep/02/a-house-of-dynamite-review-kathryn-bigelow-nuclear-endgame-idris-elba-rebecca-ferguson) \\- 5 / 5\n\n&gt;There are times when A House of Dynamite might seem melodramatic or stagey and yet maybe that is how it may well feel in the highest reaches of power – with everyone looking and feeling like actors in elaborate costumes whose roles had only one purpose: to deter aggression, a purpose which is now obsolete. It is a big chill.\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/a-house-of-dynamite-review-1235148629/) \\- 'A-'\n\n&gt;Hardly mere agitprop due to the stylistic intensity of its filmmaking, this gun-to-your-head engrossing movie — with its eardrum-piercing and death-rattling sound design and a score by Volker Bertelmann so oppressive it could swallow you whole — also wants to shake you out of your slumber\n\n[The Playlist - Marshall Shaffer](https://theplaylist.net/a-house-of-dynamite-review-kathryn-bigelow-returns-with-another-explosive-political-thriller-venice-20250902/) \\- 'A-'\n\n&gt;The world is not governed by machines, as “A House of Dynamite” painstakingly showcases across all its frenzied operations. It’s run by humans. Bigelow’s film pinpoints a terrifying tragedy lurking unspoken in today’s world order: whether citizens place their trust in people or procedures, neither can be counted on to prevent mass destruction.\n\n[BBC - Nicholas Barber](https://www.bbc.com/culture/article/20250902-a-house-of-dynamite-review) \\- 4 / 5\n\n&gt;A House of Dynamite is directed by Kathryn Bigelow, who made the Oscar-winning The Hurt Locker (2008) and Zero Dark Thirty (2012), and once again she balances her knack for building excruciating tension with her devotion to deeply researched, no-nonsense military and political authenticity. The resulting drama, which premiered at the Venice Film Festival on Tuesday will be released on Netflix in October, is more riveting than most thrillers, and more terrifying than most horror films.\n\n[The Independent - Geoffrey Macnab](https://www.independent.co.uk/arts-entertainment/films/reviews/a-house-of-dynamite-review-netflix-b2818601.html) \\- 4 / 5\n\n&gt;*A House of Dynamite* stands as a grim and timely warning about the renewed dangers of nuclear proliferation. Another way of looking at it, though, is as the most entertaining Hollywood movie on the subject of potential mass destruction since Stanley Kubrick’s *Dr Strangelove*. Unlike Kubrick, Bigelow doesn’t offer much humour – satirical or otherwise – but this is a white knuckle ride of a movie in which the tension is ratcheted up to near breaking point early on, and then simply keeps on rising. German composer Volker Bertelmann’s ominous score, heavy on the strident strings, puts viewers on edge even more.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/a-house-of-dynamite-review-idris-elba-kathryn-bigelow-1236504169/)\n\n&gt;“A House of Dynamite,” a countdown-to-nuclear-disaster thriller directed by Kathryn Bigelow, is jacked up with so many familiar MOR tropes that even though it’s trying to be realistic about what it shows you (spoiler alert: It doesn’t really succeed), it still has the feel of a self-consciously jittery high-end cautionary potboiler. Don’t try this at home! Or in the White House Situation Room!\n\n[RogerEbert](https://www.rogerebert.com/reviews/a-house-of-dynamite-movie-review) \\- 4 / 4\n\n&gt;Bigelow's ability to take a series of hypotheticals and render them into narrative actuality has never been more pinpoint accurate or merciless.",
        "upvotes": 546,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hcqT9vq_HnjRAUmK6d_dVF8TQfyCGSzSFiIRXOH1h8A.png?auto=webp&amp;s=5d3998c96e32b611aec2283d500a3aae4cbb7269"
        },
        "permalink": "/r/movies/comments/1n6p16v/kathryn_bigelows_a_house_of_dynamite_review_thread/"
    },
    {
        "id": "1n624uu",
        "author": "MarvelsGrantMan136",
        "title": "Graham Greene Dies: Oscar-Nominated ‘Dances With Wolves’ Actor Was 73",
        "content": "",
        "upvotes": 20434,
        "comments": 762,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8cYASp5XTcIQZtBY8nc84vHVVDs5UiDn3XXMAytUTw.jpeg?auto=webp&amp;s=da843a510bb240a5f13297fc653db68339376348"
        },
        "permalink": "/r/movies/comments/1n624uu/graham_greene_dies_oscarnominated_dances_with/"
    },
    {
        "id": "1n7351j",
        "author": "ubcstaffer123",
        "title": "Nanjing Massacre Drama 'Dead to Rights' Sets North America Release",
        "content": "",
        "upvotes": 61,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EqRxOe5c8ASDrZYk0IkXklwmDkTggYug1Ocgzgz-MSA.jpeg?auto=webp&amp;s=2382327e21737dbed0d6bf827562abb1cc13b131"
        },
        "permalink": "/r/movies/comments/1n7351j/nanjing_massacre_drama_dead_to_rights_sets_north/"
    },
    {
        "id": "1n6t916",
        "author": "TheGoodApolloIV",
        "title": "Megalopolis is coming to VOD on Thursday",
        "content": "https://preview.redd.it/y2nui9k30tmf1.png?width=1620&amp;format=png&amp;auto=webp&amp;s=c0a143730660e99da3cffd75f086f497a419e9be\n\nSource: [https://tv.apple.com/us/movie/megalopolis/umc.cmc.4a4dlwi05nu8x5f4fanucc5nv](https://tv.apple.com/us/movie/megalopolis/umc.cmc.4a4dlwi05nu8x5f4fanucc5nv)\n\nLooks like many of us finally get to experience this...experience for the first time soon. I'm gonna watch it with some burnt popcorn, in a very humid room, and on a torn couch.",
        "upvotes": 185,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DeZpTtaVEabUOicusMYdNI4cRTM8q0bcSF8elmOfAeM.jpeg?auto=webp&amp;s=dd7d59bfaa307a3a99b50357504648e860ba349b"
        },
        "permalink": "/r/movies/comments/1n6t916/megalopolis_is_coming_to_vod_on_thursday/"
    },
    {
        "id": "1n6iybx",
        "author": "LurkerBigBangFan",
        "title": "Which movie was written off at release but actually aged really well?",
        "content": "One that comes to mind for me is Last Action Hero. When it came out, people wanted a straight Arnold action flick and wrote it off. I also loved it and enjoyed it for what it was trying to do. But rewatching it recently really makes it feel like a movie out of time. It was doing the whole meta, self-aware thing long before it caught on. Movies like Cabin in the Woods, Tropic Thunder and Deadpool later got praised for that same kind of storytelling, but Last Action Hero was already playing with those ideas in the early 90s.\n\nIt’s fun to revisit it now and see how much it holds up, especially knowing how common that style has become.\n\nCurious what other movies people think were misunderstood at release but actually aged really well.",
        "upvotes": 606,
        "comments": 494,
        "media": null,
        "permalink": "/r/movies/comments/1n6iybx/which_movie_was_written_off_at_release_but/"
    },
    {
        "id": "1n6cjmy",
        "author": "tiddertnuocca519",
        "title": "Watching ‘The Mighty Ducks’ (1992) in 2025 makes me long for a different decade",
        "content": "It’s 2AM, I can’t sleep and I need some fodder on the screen to put me to bed. Picking ‘The Mighty Ducks’ was the wrong movie but in watching it, it has really made me realize how much the world has changed since 1992.\n\nGranted, it’s a work of exaggerated fiction. Even in 1992, no law firm is giving a pee wee hockey team $15k to buy equipment, there weren’t publicly broadcast televised pee wee tournaments with commentators, analysts and a full stadium audience, coaches aren’t telling 10 year olds that if they don’t make the game winning shot, not only are they letting their coach down but they are letting their team and their dead dad down and finally, the dialogue is way too clever and quippy for a bunch of 10 year old kids.\n\nGreat, we got that out of the way. But the movie unintentionally captures a vibe in the 90s that has since disappeared. They shot it earnestly and now it’s a time capsule for that time. The kids are out hanging out with each other, the cities are lively, people communicate in the wild. The kids have this sense of adventure that I recall in my childhood but don’t see in kids today. They are generally just out in the world without parental supervision, and that’s *okay*. Shit, the notion of a grown man trying to teach kids hockey didn’t come with the default assumption of grooming and pedophilia. \n\nIt’s just wild how different things are today. I was a teenager in the 90s and again, yes the film exaggerates but the details they showcase in how we freely communicated back then and how people didn’t jump to the worst conclusions of each other, is just wildly different.\n\nFinally, this is a little off topic, but this movie was rated PG yet it gets away with so much stuff and definitely isn’t just a kids movie, as we know them today. The kids are looking at dirty magazines, they make light hearted race jokes like calling the 2 black kids and one white kid “Oreos”, Gordon Bombay verbally rips the kids apart and straight up tells them they “suck”. I just can’t imagine a PG movie today having any of these vibes.\n\nI really encourage giving the film a shot. I haven’t seen it since I was probably 10 years old myself. No it is not high art and it won’t blow your socks off. But if you recognize that the days we live in today are just…so…bland, I think you’ll have a good time with this unintentional time capsule of a film.",
        "upvotes": 1656,
        "comments": 326,
        "media": null,
        "permalink": "/r/movies/comments/1n6cjmy/watching_the_mighty_ducks_1992_in_2025_makes_me/"
    },
    {
        "id": "1n6itzb",
        "author": "KillerCroc1234567",
        "title": "‘Wake Up Dead Man: A Knives Out Mystery’ Sets Two-Week Theatrical Release (Nov 26) Before Netflix Rollout (Dec 12)",
        "content": "",
        "upvotes": 514,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VUL7nNZImqQX_h-0GthyuJA7t6u2i0AVoAB88vkJQ38.jpeg?auto=webp&amp;s=772c99d37153dbe66d158a5b96be1a675b434b11"
        },
        "permalink": "/r/movies/comments/1n6itzb/wake_up_dead_man_a_knives_out_mystery_sets/"
    },
    {
        "id": "1n7568i",
        "author": "HolyAppleseed",
        "title": "Best Ed Harris performance?",
        "content": "He randomly popped into my head today and I started thinking how I’ve loved every single role I’ve ever seen him in. He’s definitely under talked about imo. Crazy screen presence.\n\nBut I’ve only seen a few of his movies. I want to be sure I’m not missing anything mind blowing.\n\nHarris movies I’ve seen:\n- The Truman Show\n- Top Gun: Maverick\n- Snowpiercer\n- A Beautiful Mind\n- Apollo 13\n- The Firm\n- National Treasure 2\n- Enemy at the Gate\n- Absolute Power\n- Radio\n\nWhat am I missing that needs to be added to this watched list asap?! Appreciate the guidance!",
        "upvotes": 34,
        "comments": 115,
        "media": null,
        "permalink": "/r/movies/comments/1n7568i/best_ed_harris_performance/"
    },
    {
        "id": "1n6zpg5",
        "author": "Expensive_Tie206",
        "title": "What is a deleted scene you wish they would have kept in the movie?",
        "content": "I was just rewatching BTTF trilogy with the deleted scenes.  The scene that shows Biff disappearing on the ground in 2015 really should have been kept in the movie.  Instead, all we get is Biff getting out of the DeLorean, looking sick or injured, and wondering off screen.  As a kid, that confused me to no end.  With the deleted scene, it makes more sense.\n\nObviously there’s a ton in LOTR as well. \n\nAny other deleted scenes that you feel should have made its way to the final version of the movie?",
        "upvotes": 68,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1n6zpg5/what_is_a_deleted_scene_you_wish_they_would_have/"
    },
    {
        "id": "1n6naqd",
        "author": "Task_Force-191",
        "title": "MEGADOC | Official Trailer | Utopia",
        "content": "",
        "upvotes": 272,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3-ynUF_NNoR2uWl1TmIkHMZgoEPOB9MwA1RW3Gbvnwg.jpeg?auto=webp&amp;s=8956a6e99eec89da754f2e3790877ecab86922c2"
        },
        "permalink": "/r/movies/comments/1n6naqd/megadoc_official_trailer_utopia/"
    },
    {
        "id": "1n70chi",
        "author": "GenButter",
        "title": "Matt Dillon’s Closet Picks",
        "content": "",
        "upvotes": 49,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0u808U_7cG8ffSiIqclW8yRin_5KHlXvxNIz5frAGeY.jpeg?auto=webp&amp;s=01c6ddfac4a20ccda5e32c87271e7e73d64a0877"
        },
        "permalink": "/r/movies/comments/1n70chi/matt_dillons_closet_picks/"
    },
    {
        "id": "1n6uegx",
        "author": "cmaia1503",
        "title": "Jason Segel Joins Angelina Jolie &amp; Aimee Lou Wood In ‘Anxious People’ As Cameras Roll",
        "content": "",
        "upvotes": 69,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uDvdvrdYahObQwq96YmGHMvfsWv75H00r7Q_FaY9sZ8.jpeg?auto=webp&amp;s=1f0b8aa9227c857c16c8012efe757251e473ce0a"
        },
        "permalink": "/r/movies/comments/1n6uegx/jason_segel_joins_angelina_jolie_aimee_lou_wood/"
    },
    {
        "id": "1n6qj62",
        "author": "KillerCroc1234567",
        "title": "Walton Goggins &amp; Lewis Pullman Join Jessica Biel As Leads In ‘Batso’ About Trailblazing Climbers Who Took On El Capitan Peak",
        "content": "",
        "upvotes": 70,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SIJuuwhvEdz7-aEtpnyGTsleVeaN-v7ZlAUEWFS16zI.jpeg?auto=webp&amp;s=3287e06db71d599507777c51853de10867c245b1"
        },
        "permalink": "/r/movies/comments/1n6qj62/walton_goggins_lewis_pullman_join_jessica_biel_as/"
    },
    {
        "id": "1n6lunj",
        "author": "MarvelsGrantMan136",
        "title": "Paramount &amp; Activision Team For ‘Call Of Duty’ Movie",
        "content": "",
        "upvotes": 119,
        "comments": 281,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aznvAIKAzdVjgGJcnZZv6PmoecrYFgWsZbbRznO2hGk.jpeg?auto=webp&amp;s=03b1248af378e96958a9c8e655ad6377aebb74e2"
        },
        "permalink": "/r/movies/comments/1n6lunj/paramount_activision_team_for_call_of_duty_movie/"
    },
    {
        "id": "1n7865p",
        "author": "ElectricalPeace3439",
        "title": "I'll be honest about Spike Lee",
        "content": "I'll definitely get flak for this but in my opinion, I don't think *all* of his movies are masterpieces and he's perhaps not the most consistent filmmaker out there (Oldboy doesn't count since that was effectively taken outta his hands). \n\nAll that being said, when he gets it right, he gets it right. Do The Right Thing, Malcolm X, Inside Man, BlackKklansman, most filmmakers don't have those in their résumé. ",
        "upvotes": 5,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1n7865p/ill_be_honest_about_spike_lee/"
    },
    {
        "id": "1n70lmm",
        "author": "dood0906",
        "title": "What’s the craziest thing thats happened while you were at the movies?",
        "content": "Went to the movies today to watch “Caught Stealing” &amp; mid movie the power went out in the theater 😭 the timing was crazy because when the screen shut off at first I thought it was part of the movie then the backup lights turned on for a bit before going out again &amp; everyone was confused. They had us all go in the lobby &amp; it was dark af, felt like those practice evacuations we had during school days haha. Anyway, whats the craziest thing thats happened to you guys while watching a movie? Thanks!",
        "upvotes": 18,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1n70lmm/whats_the_craziest_thing_thats_happened_while_you/"
    }
]