[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p79ilm",
        "author": "intelerks",
        "title": "Linda Hamilton refuses to chase youth in 'Stranger Things': \"I do not spend a moment trying to look younger\"",
        "content": "",
        "upvotes": 127,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1p79ilm/linda_hamilton_refuses_to_chase_youth_in_stranger/"
    },
    {
        "id": "1p6x7e9",
        "author": "ChiefCrazybull",
        "title": "Could Guillermo Del Toro's new Frankenstein movie be a Santa Clause origin story?",
        "content": "Obviously there are spoilers, so if you haven't seen the movie then stop reading.\n\nI just finished watching the 2025 Frankenstein, and the first thing that occurs to me is that it sets the Creature up perfectly to be the origin story for Santa Claus. Here are some of the reasons:\n\n* The movie ends with the Creature walking towards the north pole, which is always thought of as the remote home of Santa Claus.the Creature\n* The Creature has a good heart and just wants to help people (he cares for the family, helps the old man, and frees the ship from the ice at the end)\n* The Creature is immortal, just like Santa.\n* Furthermore, his immortality implies some sort of magic being involved (surviving an exploding stick of dynamite goes beyond scientific explanation), which could explain some of the magical aspects of Santa.\n* The Creature begins to look like Santa at the end of the movie (with a long heavy coat like Santa's). Since he doesn't want to scare people, a big hat and beard would also make sense.\n* One of the first scenes after he escapes the lab is him befriending reindeer, foreshadowing his future as Santa.\n* After that, the Creature hid during the day and only came out at night, where he would leave seemingly magical gifts for people (much like Santa leaves gifts while everyone is sleeping). The family would also leave food or other things for him (like leaving cookies for Santa).\n* Elizabeth, who shares a mutual love with the Creature, looks shockingly similar to Jessica from the 1970 movie Santa Clause is Coming to Town (both are pale with long red hair parted in the middle). This movie is a Santa Claus origin story, so it would be a clear Mrs. Claus Easter Egg if Guillermo Del Toro intentionally styled Elizabeth like Jessica.\n* Furthermore, all the Creature ever wants is someone like him to live with. Assuming he is able to eventually create such a person (maybe using the notes he found outside the lab), then this person would also be immortal and would fit perfectly as Mrs. Claus (it would also make sense that he might make this person look like his love Elizabeth).\n* Perhaps the elves are also immortal, good creatures created by the Creature (but since he always says he wants just one other person like him, maybe he made them better suited to creating toys as craftsmen).\n* The movie takes place in 1857, which is still before Santa Claus becomes a mainstream part of Christmas.\n\nEdit: changed Frankenstein to the Creature, and changed Santa Clause to Santa Claus",
        "upvotes": 201,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1p6x7e9/could_guillermo_del_toros_new_frankenstein_movie/"
    },
    {
        "id": "1p6ztg8",
        "author": "AffectionateAge1448",
        "title": "Dont Worry Darling",
        "content": "This movie is super creepy. It made me think about how women in the early 1900s used to be treated. It made me think that this is probably  how the first women who started to see through their social conditioning felt. Or any women that went agaisnt  their husbands.   It was common for women to be labeled mentally unwell, and recieve lobotomies if they did things like show anger, go agaisnt  their husbands  wishes, or step out of line with the social norms. Much like in this movie.  In the movie when the women step out of line they are labeled mentally ill, and then their brains are \"restarted\".  Women were expected to be exactly as the women in this movie are. \n\nImagine the first women in the 1940s that started to question  \"why are we house wives, why do we all dress the same, why are we servants to men, why cant we have jobs, why cant we drive , why cant we vote what is going on,  why are we given lobotomies if we show emotion or disobey our husbands\"? And then she slowly started to realize women were  being brainwashed and that women are fully capable of doing things outside of their house duties. I imagine it was much like this movie, like seeing through the simulation like social conditioning, and then being condemned by society for speaking out, and sometimes being forced to have lobotomies to make women  fall back in line with the social norms. ",
        "upvotes": 59,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ztg8/dont_worry_darling/"
    },
    {
        "id": "1p6tnrd",
        "author": "Far_Pen3186",
        "title": "Matthew Macfadyen Gives An Incredible Performance As James Garfield’s Assassin in ‘Death By Lightning’",
        "content": "This character is infuriating, a pest, delusional, annoying as FK, pathetic, a loser, etc. The actor did a great job in making the viewer disgusted with this character! Even his voice is grating.",
        "upvotes": 134,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tnrd/matthew_macfadyen_gives_an_incredible_performance/"
    },
    {
        "id": "1p7ae7i",
        "author": "amelix34",
        "title": "You just found out that one of the main characters in your favourite TV series is not a good person in real life. Do you keep watching?",
        "content": "There is a comedy show that I absolutely love (most of its seasons) and I rewatch it from time to time. Some time ago I read that one of the main characters was recently accused of sexual assault in real life, and as I read it was not the first time. I also saw some discussions on Reddit about them and it seems that it's established fact that a lot of people have zero respect for this person.\n\nI'll be honest it breaks my heart because I truly love the show and their character, and now when I'm rewatching the show it just feels different, everytime I see scene with them my brain reminds me who they are in real life and it's difficult to enjoy the show like I always did. I regret reading about this stuff\n\nI wonder what's your take on this.",
        "upvotes": 2,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ae7i/you_just_found_out_that_one_of_the_main/"
    },
    {
        "id": "1p75mit",
        "author": "huffpostuk",
        "title": "Netflix Announces New Diddy Documentary Sean Combs: The Reckoning",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p75mit/netflix_announces_new_diddy_documentary_sean/"
    },
    {
        "id": "1p6rstq",
        "author": "57829",
        "title": "Eva Green Joining ‘Wednesday’ Season 3 As Aunt Ophelia",
        "content": "",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p6rstq/eva_green_joining_wednesday_season_3_as_aunt/"
    },
    {
        "id": "1p7bk0j",
        "author": "cocoquinnxo",
        "title": "What should I watch",
        "content": "Hey, I’ve been looking for series to watch but can’t find any that suit my taste. I’m currently in Germany and mostly like comedy. I’m open to other genres, but I’m out on romance, horror, sad stuff, or superhero/comic things. In a few weeks I’ll be back home in Cali, but until then I need something to watch. Would love some ideas, thanks!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p7bk0j/what_should_i_watch/"
    },
    {
        "id": "1p6yqwo",
        "author": "GuineaPKilledMe",
        "title": "Thoughts on Acting My Age by Kevin Hart?",
        "content": "His last two stand up specials just do not hold the same level of humor for me anymore. I'm halfway through this one and I honestly haven't given more than a chuckle so far. It also seems he just blatantly makes up fake scenarios just to get his joke across. Is anyone enjoying  it or am I being too harsh?",
        "upvotes": 7,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p6yqwo/thoughts_on_acting_my_age_by_kevin_hart/"
    },
    {
        "id": "1p77a51",
        "author": "SmartPEG",
        "title": "Landscape fullscreen dead for Netflix on my iPad",
        "content": "I watch movies on my iPad exclusively. Landscape fullscreen works perfectly on Prime Video, AppleTV+, Fandango, Roku, Mubi, Shudder, Criterion, HBO Max, Hulu, Peacock, and Paramount Plus. Three days ago, Netflix became incompatible with landscape fullscreen. It's stuck in portrait orientation, so the landscape image is very small, in the middle of the screen. What is wrong with Netflix on the iPad app?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p77a51/landscape_fullscreen_dead_for_netflix_on_my_ipad/"
    },
    {
        "id": "1p774y6",
        "author": "EfficientlyElite",
        "title": "Kevin Hart’s Acting My Age artfully displays movement issues plaguing our adults.",
        "content": "I wasn’t expecting much from Kevin Hart’s Acting My Age. You all know the rich person comedian effect, I thought he might have had a little too much time on the golden throne to make me laugh.\n\nI didn’t expect just how artfully he would illustrate how our current adult generations (and all previous generations in recent history) struggle with movement. Our current fitness education is failing our adult generations.\n\nThis critique of fitness begins in the context of a road race. Specificially, Kevin describes his challenge to and eventual 40-yard-dash against friend Stevan Ridley (former NFL player).\n\nDuring this race, Kevin tears both adductors in one leg, leaving him wheelchair bound.\n\nWhile it sounds like a silly situation typical of an eccentric character, it points to a larger issue: we want to be able to move as we get into adulthood. Humans are meant to move.\n\nHowever, we tend to disregard movement, thinking we can pick up from where we left as a child, until, of course, we try moving and injure ourselves.\n\nKevin goes on to describe the delicate nature of the human form. He talks about his sensitivity to injuring himself during basketball, and humorously identifies the sense of fear and common injury from missing a few steps and slamming your heel down the stairs.\n\nThis type of identification, characterization, and normalization of our weak adult forms highlights just how little we do to develop fitness knowledge that’s accessible for our adults. Most adults stop moving around, leaving them susceptible to injury.\n\nIf we do not improve how we teach fitness to adults, our adults will continue to be fragile bodies waiting to land improperly.\n\nThanks Kevin, you hit a great point.",
        "upvotes": 1,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1p774y6/kevin_harts_acting_my_age_artfully_displays/"
    },
    {
        "id": "1p63sl8",
        "author": "AstralKatOfficial",
        "title": "How do I get netflix to realize I dont give two shits about wrestling?",
        "content": "So for some stupid reason, Netflix has been pushing wrestling HARD on my account for the past few months, not only have I never engaged with anything that'd suggest I want to watch wrestling content, but I've even gone into the info tabs and put \"Not for me\" on all the available ones and *still* whenever some new wrestling thing comes out, it shoves the ENTIRE CATEGORY right back onto my home page... I literally only use Netflix for its originals or shows like The Good Place, please tell me how to get this shit off my home screen for good",
        "upvotes": 295,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1p63sl8/how_do_i_get_netflix_to_realize_i_dont_give_two/"
    },
    {
        "id": "1p6wr45",
        "author": "Katiebirds",
        "title": "Missing dead or alive: Lawyers?",
        "content": "I’m watching season 2 of missing dead or alive and wondering why none of the people they are interviewing ever have a lawyer with them? \nI feel like a lawyer would have advised them to act differently than they did in the interview. \nIf you can’t afford one, do you not get one?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6wr45/missing_dead_or_alive_lawyers/"
    },
    {
        "id": "1p6bph0",
        "author": "Curious-Monitor497",
        "title": "The beast in me - why Aggie why???",
        "content": "Why was Aggie Wiggs texting and sending a voice mail everytime she had an important information? I feel like the entire last episode could have been avoided if she just waited for a reply from Brian Abbott. Only thing that make sense is that she probably was terrified of the whole situation and acted irrationally. Also, Brian Abott had no phone lock in his burner phone. Come on, an FBI agent being that careless.",
        "upvotes": 37,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p6bph0/the_beast_in_me_why_aggie_why/"
    },
    {
        "id": "1p6qmay",
        "author": "Typical_Effort_5283",
        "title": "What Piper Rockelle’s Netflix doc missed and this ytber exposed",
        "content": "\n\nMscaseclosed on YouTube again and breaks down the shocking allegations against Tiffany Rockelle, from allowing a convicted sex offender around Piper (he was her bf). She dated a convicted sex offender knowing he was one.. Mscaseclosed managed to track and gaslight the sugar daddy tiffany had for the family using piper’s existence to make him a pay pig for an interview. She had a sugar daddy for her daughter when she wasn’t even double digits yet.The video also reviews accusations about other questionable people she’s been linked to. mscaseclosed is a hardworking creator and the dedicated owner of the server, and she hasn’t given up on Piper’s case for a moment. She edits every video completely on her own and continues to push forward even now, working solo as everyone knows else is busy with their own lives.\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6qmay/what_piper_rockelles_netflix_doc_missed_and_this/"
    },
    {
        "id": "1p70z5y",
        "author": "toenailwithketchup",
        "title": "50 Cent's Diddy Documentary Unveils Title, Sets Netflix Release Date",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p70z5y/50_cents_diddy_documentary_unveils_title_sets/"
    },
    {
        "id": "1p70yf5",
        "author": "Kitchen-Regret-759",
        "title": "AIO for wanting to move out over a Netflix account?",
        "content": "I (17pnts) live with my stepfather (37m) and my biological mom(36) for almost 3 years now. \n\nNow for some context my biological parents are divorced and the custody battle was messy and I lived in a bad environment when I lived with my mom before. (I moved with my dad when I was around 11). I had to move out of my dad’s house because he’s an alcoholic and didn’t treat us right, he would yell and call us names for dumb stuff. And to also note (this will become relevant) I lived with my dad with two of my other siblings, my sister “Katie” (currently 11) and my brother (currently 16)\n\nSo I have my own Netflix account that I pay for that only I use. My family all uses the same Netflix that my family pays for. The reason o have my own is because the one they use isn’t always paid on time. And there are a lot of people in my family so I would often get kicked off of it cause there were too many people. I’m not gonna ask him to pay it so I just got my own. So the other night (it was a Saturday) my stepdad called me into his room and asked if he could use my Netflix account. I said no, I don’t want to do that. I don’t believe I was rude or anything. He didn’t say anything so I just walked away and continued what I was doing. He calls me back again and is immediately super mad. He raises his voice (not yelling but still) and calls me selfish and says I’m turning into a selfish person. I start laughing (I do this when I’m uncomfortable). I genuinely didn’t understand what he was so mad about. He asked a question and I answered it? He was comparing me to my cousin (I don’t want to speak ill of her but I’m nothing like her). Then he started talking about how he feeds me and shelters me and stuff like that. Note in this argument I was upset and I did raise my voice. He just really upset me because he was yelling just like my dad, and saying I’m this just like my dad. I then said that’s literally your job. To feed and clothe me. You chose to be a parent. Then he actually screamed this part. That when we go to the store he doesn’t have to buy me anything. I reply with: yea and that YOUR choice. I’m choosing not to share this with you I’m allowed to have something’s to myself. At this point I’m sobbing (and I haven’t cried in front of any of my family sing I was like 10). He immediately backtracks seeing my and says he’s sorry and that he didn’t mean to upset me or lose his temper. He then comes towards me with his arms out. I say no and run into the bathroom. The only reason I didn’t run to my bedroom is because the bathroom door has a lock. I then proceed to have a panic attack in the bathroom and wait 30 minutes for me to calm down and stop crying. I walk out and head straight to my room. My family has this thing where if something happens it is probably never gonna be talked about again. Like something bad or not necessarily bad, I don’t know how to explain it. When I’m in my room I text my friend about it and she offers for me to spend the night at her place. she knew I was having a rough time (with something u related to this) because I was crying at school on Friday. I text my step dad and ask to stay the night at her place and he says yeah. He then asks if we’re good and apologizes like three times. \n\nI stay the night at my friend and get home around 6pm on Sunday. As soon as I walk in the door he tells me to sit down on the couch and that he needs to talk. So I sit down with the rest of my siblings and he starts saying that I opened his eyes yesterday. And I was right, stuff like that. He then says that he chooses to give us our technology and he is now choosing to take them away. He then (specifically to me and my siblings that lived with my dad) talks about how we make him feel like he isn’t loved, because he isn’t our “real dad”. And to be fair my sister Katie has told him he isn’t her dad. But me and my brother haven’t. He basically goes on for about 45 minutes and my mother pitches in too. She is clearly very upset about and is saying over and over how ungrateful we are. I tell them that I am and have been grateful ever since I moved in with them. That I chose to be there I could have stayed with my dad but I chose to move there. (Btw they used my dad as a talking point to prove they cared more basically cause they were here and he wasn’t). I then said I don’t understand. And another thing is that I have a “chore” kind of to do the dishes. When I say kind of I mean my mom mostly does them but they said I should just know when to do them. I don’t really know what that’s supposed to mean. Like every time the dishes are in the sink? If so I’d be doing them every time I enter the kitchen. Or something else? I don’t do them for these reasons. First off idk why but doing things without being told makes me over think like crazy, like idk it just makes me anxious, it’s super weird. Second if I were to do them I already know somebody would have something to say about it “oh you’re cleaning”. Or something dumb like that. And my parents would say stuff like that too, not just my siblings. I know I shouldn’t care but I would be thinking about that the whole time. 3rd I actually hate doing the dishes so much, I would much rather scrub the toilet than do them. Something about touching wet food and where other peoples mouths have been really like freaks me out. 4th (this is the last one I swear) I’m just a kid and I’m  exaughsted  after being at school and basketball after, the lady thing I want to do when I get home is dishes. Ok so when I said I don’t understand he said: you don’t know when to put the dishes away. I didn’t say anything because he was right and because I didn’t know how to explain why I was actually confused because I was so upset. He takes away just me and my younger sisters and brothers stuff not the other 4 kids who were sitting on the couch as well. I went to my room and just cried myself to sleep. \n\nSo am I overreacting? \nWhat should I do? I’m just confused because if I was in trouble for the Netflix thing why were my other two siblings punished as well? And if it was about chores why didn’t he punish all my siblings? (All my siblings don’t do their chores not just me). ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p70yf5/aio_for_wanting_to_move_out_over_a_netflix_account/"
    },
    {
        "id": "1p6gqj3",
        "author": "Majestic-Day-5024",
        "title": "Vanilla Sky Ending (M34)",
        "content": "i've seen lots of sad movie scenes/endings, titanic, gladiator, saving private ryan - but this film just hits me different, I can't quite put my finger on it but I cry my eyes out as soon as \"sigur ros\" starts playing\n\nI think it's the fact all of us always have that thought; \"what if\" what if my life tired out differently &amp; we found total happiness &amp; falling in love with someone \n\nplus maybe the look penelope cruz gives tom as he's just about to jump, when she kind of smiles at him with her eyes &amp; gives him a wave but looks a bit defeated herself \n\n\"i'll find you again... when we are both cats\" \n\nmovie magic \n\n\n",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gqj3/vanilla_sky_ending_m34/"
    },
    {
        "id": "1p6ywea",
        "author": "floppy_panoos",
        "title": "Homeland Season 2: WTF",
        "content": "Started getting into Homeland (never seen it before) and I think episode 2 or 3 there’s a scene where Brodie and the Vice President are chatting before they walk into some sort of function.  VP tells Brodie that an Israeli air strike being partially successful and they need a Bunker Buster.\n\nThis aired in 2012!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ywea/homeland_season_2_wtf/"
    },
    {
        "id": "1p6ci4g",
        "author": "tipputappi",
        "title": "Just watched Death by lightning and man I feel so sorry for Charles' sister.",
        "content": "Poor woman tried so hard to bring her brother on the right track but he kept breaking her heart again and again. Allowed him to stay rent free,  turned a blind eye to his crackpot ideas, tried to get him a real job but he kept scaming her.  Love truly does Blind you.",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ci4g/just_watched_death_by_lightning_and_man_i_feel_so/"
    },
    {
        "id": "1p6tcgv",
        "author": "shaselai",
        "title": "Netflix subtitle keep changing to one language when I set it back many times.",
        "content": "So one time we had subtitle changed to Chinese on one of the shows for someone and now it is always Chinese whenever it loads.\n\nI tried:\n\n1. Setting language and subtitle to english...as a matter of fact, my profile setting has always been English- i had to change subtitles back from Chinese to english.\n\n2. Reload or refresh or quit netflix after setting english...still the same.\n\n3. My netflix app does the same thing.\n\n4. It naturally defaults to english subtitles when there isn't a Chinese subtitle option... \n\n  \nI dont know what else to do ... any suggestions?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tcgv/netflix_subtitle_keep_changing_to_one_language/"
    },
    {
        "id": "1p6sbmr",
        "author": "mmmadness",
        "title": "'Left-Handed Girl' Review: Shih-Ching Tsou's Kaleidoscopic Solo Debut Sharply Satirizes Taipei's Cross-Generational Family Structures",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6sbmr/lefthanded_girl_review_shihching_tsous/"
    },
    {
        "id": "1p6wdqk",
        "author": "chick08",
        "title": "Question about streaming",
        "content": "While viewing Netflix on my phone today I noticed that the FX show Archer was in my list which I thought was weird because I know Archer was removed from Netflix earlier this month on the 12th. When I got home I went to turn it on my home tv but was confused to see it did not show up anywhere and when I searched it, the show was not there. My partner checked his phone and even more confusingly, it was not available for viewing on his phone despite all of our devices being on the same account. After checking all of our other tvs we were able to determine that it was only the Netflix on my phone that was showing this show as available despite them all being the same Netflix account. I also notice that several other shows that I do not think are currently available on Netflix are showing up, only on my phone, such as weeds, the office and superstore. All of them work and include all of the released seasons of these shows. Can anyone explain this to me? How am I seeing shows that are not available on Netflix through Netflix??",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6wdqk/question_about_streaming/"
    },
    {
        "id": "1p6gstx",
        "author": "agile-coder",
        "title": "Rewind once the credits roll?",
        "content": "Anyone else got the issue where you can’t rewind during the credits?\n\nWatching using LG TV App\n\nMaybe i miss the end of a show and get the watch credits or play next episode message. \n\nI hit watch credits and then hit rewind. \n\nBut instead of rewinding it just crashes and takes me back to the start of the episode and even more annoyingly marks the episode as not watched so it gets confusing as to which one i was watching and now need to forward all the way through to watch the last couple of minutes again!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gstx/rewind_once_the_credits_roll/"
    },
    {
        "id": "1p6ctft",
        "author": "Luciif3R_2O",
        "title": "Help needed",
        "content": "I’ve tried everything I can. Why is Netflix still not streaming in **HD** (1080p/2K) on my phone? Even when I download content, it only saves in around 480p. I’m on a **4K Plan **so this makes absolutely no sense. It’s been over a month now, and this is getting ridiculous. I prefer watching my content in HD.",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ctft/help_needed/"
    },
    {
        "id": "1p6novv",
        "author": "InnerAssociation7893",
        "title": "Movies and TV shows and their seasons are always very late in Croatia",
        "content": "Can anybody tell me why is that? I mean for example Rookie, here we are about 2 seasons behind (I lost count) and US and most parts of Europe I have friends in all have the entire show. 2nd example would be Snowpiercer to which I'm hooked btw but while the rest of the world has we don't have the entire show. That was just Netlix but there are countless more examples on HBO and Prime\n\nI tried p!rate sites but I can't watch a movie with corn poppping up every 5 minutes mid screen. So can anybody tell me why this is? Why can't Netflix/HBO/Prime Video just give us the full shows? \nPlease be understanding, I don't have much knowledge about this",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p6novv/movies_and_tv_shows_and_their_seasons_are_always/"
    },
    {
        "id": "1p6ltly",
        "author": "Reasonable-Cook-4728",
        "title": "WWE Raw",
        "content": "I've been a pro wrestling fan for many years. Wasn't home last night to watch WWE Raw live, so I decided to watch the replay this morning. There were 25 3-minute Ad breaks during a 2 hour replay. You used to be able to fast forward through the ads on a replay, but that no longer works. 3 hours and 15 minutes to watch the show. WTF Netflix?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ltly/wwe_raw/"
    },
    {
        "id": "1p6kn9m",
        "author": "Apprehensive_Cup3942",
        "title": "Suggest a life changing series",
        "content": "I’m looking for life-changing shows like, the kind that just blow your mind every episode and leave you shook. I’m super into teen romance and basically all the American drama vibes, the kind that just *amazes me*.\n\nHere’s what I’ve loved so far:\n\n* 13 Reasons Why\n* The End of the F\\*\\*\\*ing World\n* To All the Boys I’ve Loved Before\n\nBUT I need something with spice, like 13 Reasons, with maybe mystery, drama, or plot twists. Something that leaves me thinking about it for days, you know? Like, literally every moment has to hit \n\n",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p6kn9m/suggest_a_life_changing_series/"
    }
]