[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mqro6e",
        "author": "blunathan",
        "title": "Ma davvero, ancora?",
        "content": "",
        "upvotes": 448,
        "comments": 355,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4e9d3go885jf1.png?auto=webp&amp;s=197e99912b0a425f41913053a7ebe226f6669073"
        },
        "permalink": "/r/torino/comments/1mqro6e/ma_davvero_ancora/"
    },
    {
        "id": "1mr7to9",
        "author": "umudyy",
        "title": "Public transport sucks",
        "content": "Turin is one of the worst cities I’ve seen when it comes to public transportation. Of course, I’m not comparing it to cities like Vienna or Istanbul, but in those cities, even islands have metro access. At the very least, places like Parco la Mandria should have metro or tram connections. Or there should be a metro to a location close to the Alps. Buses, on the other hand, arrive purely by chance and get stuck in traffic at some point, you’d actually get somewhere faster by walking at a steady pace than waiting for a bus. How can there be no metro to Moncalieri or Nichelino? If you don’t have a car in this city, you’re stuck in a very small area, basically the city center. Sure, Piazza Castello and all are nice, but after two months, you don’t want to keep staring at the same place. Even if you want to see new areas, it takes 1 hour by car but 3.5 hours by public transport. What a shame…\n",
        "upvotes": 34,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sjjnix8bj8jf1.jpeg?auto=webp&amp;s=840fb88c75218b88a0d2b2e2b17b8f90a10bcfa4"
        },
        "permalink": "/r/torino/comments/1mr7to9/public_transport_sucks/"
    },
    {
        "id": "1mqx87n",
        "author": "Murky_Giraffe8700",
        "title": "Dopo una settimana a Bruxelles, apprezzo molto di più Torino",
        "content": "Sono appena tornato da una settimana a Bruxelles e… wow. Pensavo che Torino avesse i suoi difetti, ma dopo questo viaggio mi sembra un paradiso.\n\nBruxelles mi è sembrata disordinata, caotica e, in molte zone, davvero trasandata. Sacchi di immondizia ovunque, strade che puzzano come un posacenere bagnato, cantieri a caso che ti obbligano a fare lo slalom sui marciapiedi. Il centro storico si salva per una foto o due, ma appena esci dalla zona turistica è grigio, rumoroso e poco accogliente. Trasporti pubblici poco affidabili, atmosfera tesa e zero calore umano.\n\nTorino magari non è perfetta, ma è più pulita, più vivibile, con un ritmo di vita decisamente migliore. Il cibo, le piazze, la qualità della vita: non c’è paragone. Anche il peggior caffè qui batte “l’espresso” che mi hanno servito a Bruxelles.\n\nA volte bisogna andare via per capire cosa si ha già. Torino &gt; Bruxelles, senza discussione.",
        "upvotes": 54,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1mqx87n/dopo_una_settimana_a_bruxelles_apprezzo_molto_di/"
    },
    {
        "id": "1mrb0s6",
        "author": "amicidilazzaro",
        "title": "Dormitori a Torino. Un elenco utile",
        "content": "Qui un elenco dei dormitori a Torino.  \nquasi per tutti bisogna passare tramite Via Sacchi 47 al Servizio Homeless Torino.\n\n[https://www.amicidilazzaro.it/it/solidarieta/dormitori-a-torino-servizi-per-chi-e-in-difficolta/](https://www.amicidilazzaro.it/it/solidarieta/dormitori-a-torino-servizi-per-chi-e-in-difficolta/)",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mrb0s6/dormitori_a_torino_un_elenco_utile/"
    },
    {
        "id": "1mqq898",
        "author": "blunathan",
        "title": "Buon Ferragosto alle poche persone come me ancora a Torino (deserta)!",
        "content": "Buon Ferragosto alle 17 persone ancora qui come me!",
        "upvotes": 52,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mqq898/buon_ferragosto_alle_poche_persone_come_me_ancora/"
    },
    {
        "id": "1mrec2h",
        "author": "Usual_Ad8650",
        "title": "Io sono un ragazzo di Torino nessun da conoscere",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mrec2h/io_sono_un_ragazzo_di_torino_nessun_da_conoscere/"
    },
    {
        "id": "1mqvv82",
        "author": "Lupo_1982",
        "title": "Qualcuno vuole provare un larp (gioco di ruolo dal vivo) a tema \"Game of Thrones\"? Gratis durante TO Play",
        "content": "Il 13-14 settembre, come ogni anno c'è TO Play, una grande manifestazione ludica completamente gratuita (per chi non la conoscesse, non è il solito \"supermercato della paccottiglia per nerd\" che sono di solito le fiere, è una vera convention dove si gioca).\n\nAll'interno della manifestazione ci sarà un gioco di ruolo dal vivo a tema Game of Thrones, intitolato \"[La locanda di Harrenhal](https://grv.it/harrenhal/)\". E' tutto gratis, ti prestano anche il costume, e si può giocare solo un'oretta o tutto il giorno, come uno vuole.\n\nMolto adatto a chi ha sempre avuto curiosità per il larp ma non ha mai avuto l'occasione di provare...\n\nIl sito è questo [https://grv.it/harrenhal/](https://grv.it/harrenhal/)\n\nhttps://preview.redd.it/7vmtbixqb6jf1.png?width=1190&amp;format=png&amp;auto=webp&amp;s=fca9aa426bf3f95c016466a1ed3da3a3dcf35083\n\n",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mqvv82/qualcuno_vuole_provare_un_larp_gioco_di_ruolo_dal/"
    },
    {
        "id": "1mrab6f",
        "author": "MauroIcardi_",
        "title": "Camplus Palestro",
        "content": "Is it good?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mrab6f/camplus_palestro/"
    },
    {
        "id": "1mqqmt8",
        "author": "RiddleyThomas",
        "title": "Cerco un elettricista",
        "content": "Ciao a tutti e buon ferragosto. M32 e F32. Dopo anni all'estero (Australia , Nuova Zelanda, California, Messico) abbiamo deciso di ritornare a casa e abbiamo da poco avviato una piccola attività agricola a 15km da Canelli e che Dio ce la mandi buona. Il lavoro in campagna è enorme, non immaginavo, ma teniamo duro. Il focus del post. Devo rifare impianto elettrico in cascina e mi sono accorto che i prezzi, per le mie tasche, sono insostenibili, purtroppo. Comprendo la professionalità che c'è dietro un lavoro del genere ma purtroppo, come giovanissima startup, non ho accesso al creduto, cioè non mi finanziano neanche di 5 centesimi. Tante parole ma al momento giusto solo NO, mi spiace torni tra qualche anno. Ora chiedo. C'è qualcuno esperto che ovviamente pagando possa darmi una mano a stendere il progetto e fornirmi tutti gli elementi necessari per fare un impianto a norma, ovviamente senza certificazioni perché il lavoro lo farebbe il papà della mia ragazza che ha esperienza negli allacci ma che so non essere esperto nel disegno complessivo? Le tracce da fare, come dislocare i dispositivi, che tipo di dispositivi acquistare, ecc. So che la richiesta è un po' 'strana' ma non me la sento di partire da zero. Se qualcuno,vripeto, pagando giustamente per la sua esperienza, volesse darmi una mano. In più frutta e verdura gratis. Grazie ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mqqmt8/cerco_un_elettricista/"
    },
    {
        "id": "1mqqhi9",
        "author": "Caid2",
        "title": "Qualcuno sa se MondoJuve (la ristorazione ) è aperto oggi ?",
        "content": "Il sito sembra irraggiungibile. Oggi sono in viaggio e avrò bisogno di fermarmi a Nichelino o zone limitrofe . Grazie ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mqqhi9/qualcuno_sa_se_mondojuve_la_ristorazione_è_aperto/"
    },
    {
        "id": "1mqp8ry",
        "author": "Floofs-In-Space",
        "title": "best place to find an affordable bicycle?",
        "content": "Hi, I'm moving to Turin on Sunday. I'm looking for an affordable mountain bike (around 500 euros). The used market on Facebook Marketplace doesn't have too much.\n\nDecathlon also has a few new options. \n\nWhere else should I look?\n\nI searched this subreddit and didn't find much. Thanks!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mqp8ry/best_place_to_find_an_affordable_bicycle/"
    },
    {
        "id": "1mq5w97",
        "author": "_pigreco_",
        "title": "parco del tribunale: che finaccia",
        "content": "rant su come il parco del tribunale, aka pala aka gratta ma ufficialmente Giardino Nicola Grosa, abbia fatto una pessima fine. Chiunque lo abbia bazzicato appena aperto vs ora si sarà accorto de degrado che ha raggiunto. E' un peccato dato che era una bella area, anni fa durante le stagioni calde era affollatissimo da chi stendeva un telo e stava li a rilassarsi. Ora sembra la Death Valley",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mq5w97/parco_del_tribunale_che_finaccia/"
    },
    {
        "id": "1mpur19",
        "author": "esme87_",
        "title": "Invasione di libellule?",
        "content": "Stamattina mi sono svegliata e, guardando il cielo, mi sono apparse numerosissime libellule. All’inizio pensavo di essere pazza, invece ce n’erano davvero un centinaio, se non migliaia. La foto non è ottimamente rappresentativa, ma il cielo ne era pieno. A cosa può essere dovuto? Forse alla temperatura?",
        "upvotes": 17,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0w4fce2n3yif1.jpeg?auto=webp&amp;s=82474c41f8a123aa44df03cd39b9e1eb27b64264"
        },
        "permalink": "/r/torino/comments/1mpur19/invasione_di_libellule/"
    },
    {
        "id": "1mq1fm4",
        "author": "editLxo",
        "title": "Serate estive",
        "content": "Ciao! Sono in visita oggi a Torino e mi chiedevo se questa sera ci fossero eventi estivi in giro, magari con un po’ di musica dal vivo o dj set. Qualche consiglio? \n\nSiamo in 2 ragazzi sui 25 anni\n\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mq1fm4/serate_estive/"
    },
    {
        "id": "1mpgf7q",
        "author": "ocluf",
        "title": "Oggetto rubato con AirTag – ricompensa di €1000",
        "content": "Ciao a tutti,\n\nDi recente ero in vacanza a Torino e, purtroppo, mi è stato rubato un oggetto molto costoso. Avevo nascosto un AirTag all’interno e ho passato diversi giorni della mia vacanza cercando di rintracciarlo, senza successo. L’AirTag mi ha portato a un luogo a cui non potevo accedere e alla fine ho dovuto lasciare la città.\n\nL’AirTag continua ancora oggi a trasmettere un segnale, quindi spero che il ladro non lo abbia trovato. Tuttavia, non essendo più a Torino, non posso fare altro da solo. Per questo sto riponendo la mia ultima speranza in questo post su Reddit.\n\nPosso condividere la posizione in tempo reale dell’AirTag con altre persone. Ecco la mia proposta: se vuoi aiutarmi, ti invierò la sua posizione. Se noti che si muove nei prossimi giorni e riesci a recuperarlo, offro una ricompensa di €1000 a chi lo riporta indietro.\n\nSe sei interessato, mandami un messaggio privato. Posso anche darti più dettagli sull’oggetto rubato. C’è la possibilità che venga messo in vendita su siti come Subito o Facebook Marketplace. Il tuo aiuto significherebbe moltissimo per me.\n\nORIGINAL ENGLISH TEXT\n\nHey everyone,\n\nI was recently on vacation in Torino, and unfortunately, a very expensive item was stolen from me. I had placed an AirTag inside it and spent several days of my trip trying to track it down without success. The AirTag led me to a location I couldn’t access, and I eventually had to leave the city.\n\nThe AirTag is still sending a signal, so I have hope the thief hasn’t discovered it. However, since I’m no longer in Torino, I can’t take further action myself. That’s why I’m putting my last hope in this Reddit post.\n\nI can share the AirTag’s live location with others. Here’s my proposal: if you’re willing to help, I’ll share its location with you. If you notice it moving in the coming days and you’re able to retrieve it, I’m offering a €1000 reward to whoever recovers it.\n\nIf you’re interested, please DM me. I can also share more details about the stolen item. There’s a chance it could appear for sale on platforms like Subito or Facebook Marketplace. Your help would mean the world to me.",
        "upvotes": 65,
        "comments": 56,
        "media": null,
        "permalink": "/r/torino/comments/1mpgf7q/oggetto_rubato_con_airtag_ricompensa_di_1000/"
    },
    {
        "id": "1mpvusr",
        "author": "yotama9",
        "title": "Two questions about the BIP cards.",
        "content": "Hi all, \n\nI'm new in the area (and in Italy in general). I made yesterday the BIP cards for me and my family, and I discoverred that the GTT app is paired with a card and I can use it to load rides on the app, but not on the cards. So I have three questions: \n1. Do I need to take both my phone and my card with me, assuming I load the rides on the phone?   \n2. Is there any way for me to load the rides on my kids' card. Or do I have to go to some service centre (i.e. a tobacco shop)?   \n3. We live outside of Torino (formula 5). If we buy a weekly path, does it hold also for the metro/bus in Torino, or do I need to buy another path for that?  \n\nThanks for any help you can give me.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mpvusr/two_questions_about_the_bip_cards/"
    },
    {
        "id": "1mq3pqh",
        "author": "Floofs-In-Space",
        "title": "MTB, road bike, or gravel bike: if you're only going to have one bike in Turin...",
        "content": "Hi, I'm moving to Turin on Sunday. I'll be there for just a few months. I'll be living close to Torino Porta Nuova. \n\nI like all types of riding. Given the choice, I prefer dirt. I won't have a car, so I'll have to ride to whereever I'm going ot ride.   \n  \nRecommendations on what type of bike I should get? ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mq3pqh/mtb_road_bike_or_gravel_bike_if_youre_only_going/"
    },
    {
        "id": "1mq06rl",
        "author": "mrczf",
        "title": "Addio al celibato/nubilato a Torino",
        "content": "L’anno scorso sono stato a Torino per l’addio al celibato di un mio amico, e abbiamo organizzato tra le varie attività della giornata una partita in una escape room del marchio Cronos (ci hanno anche aiutato a organizzare qualche scherzo allo sposo durante la partita). Io avevo già giocato una loro ambientazione (ma a Verona, con la mia fidanzata), quindi ero abbastanza fiducioso che mi sarebbe piaciuto, ma gli altri miei amici non erano mai stati in una escape room. Un paio di loro non erano convinti di questa attività, pensavano che fosse troppo noioso per un addio al celibato.\n\nPEr fortuna avevo ragione io, ci siamo divertiti (abbiamo giocato l'ambientazione Tomba di Tutankhamon) e, ancora più importante, il futuro sposo ha detto che non vede l’ora di giocarci ancora nelle altre ambientazioni (quindi direi che gli è piaciuto, del resto è un nerd come me e me lo aspettavo). \n\nCoincidenza: prossimamente anche la mia ragazza dovrà organizzare un addio al nubilato sempre a Torino (siamo nella fascia 30-40, c’è almeno un matrimonio all’anno nel nostro giro!) e sta compilando una lista di attività che potrebbero fare. Ha pensato di proporre l'escape room tra le cose da far fare alla sposa, dato le nostre due esperienze positive con Cronos. Alla fine, dopo mille discussioni (mi ha fatto vedere la chat dell’organizzazione, un delirio) l’idea è passata, anche perché, confrontando i preventivi, conviene rispetto ad altre attività più \"tradizionali\" e costose tipo degustazione di vini, giornata in spa, ecc.\n\nVoi che esperienze avete in merito agli addii al celibato/nubilato a Torino? Ne avete mai fatti in escape room? Oppure di altro tipo? Quanto avete speso? Come vi sono sembrati?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mq06rl/addio_al_celibatonubilato_a_torino/"
    },
    {
        "id": "1mpnrlz",
        "author": "PublicPractical2358",
        "title": "Gym",
        "content": "Ciao io sono un ragazzo di monca che vorrebbe iniziare palestra mensilmente perche' me la devo pagare io, sono di moncalieri, qualche palestra che non costi troppo? sono disposto anche ad andare lontano.\n\ngrazie per l'aiuto",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mpnrlz/gym/"
    },
    {
        "id": "1mpu150",
        "author": "Dangerous_Bite_7601",
        "title": "Opinioni sul lago di Sirio?",
        "content": "Vorremmo fare una gitarella da Torino in qualche zona eventualmente balneabile (ma non è strettamente necessario che lo sia). Ci hanno parlato bene del lago di Sirio qualcuno che c'è stato ha consigli/pareri?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mpu150/opinioni_sul_lago_di_sirio/"
    },
    {
        "id": "1mp2eua",
        "author": "OkPin6450",
        "title": "BORSA EDISU",
        "content": "✅✅ BORSA EDISU ✅✅\nciao a tutti! \n\nSono una studentessa internazionale, \nSto preparando la documentazione per borsa e vorrei un chiarimento.\nI miei genitori sono divorziati e vivo solo con mia madre.\nPer la documentazione economica, devo fornire solo il reddito di mia madre e il certificato di divorzio oppure devo includere anche il reddito e i documenti di mio padre? \nGrazie in anticipo. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mp2eua/borsa_edisu/"
    },
    {
        "id": "1mpbw2w",
        "author": "Slight_Chemistry6585",
        "title": "Raccomandazione per la pizzeria",
        "content": "Nel fine settimana andrò a Torino con la mia ragazza per festeggiare il suo compleanno. Sto cercando una pizzeria che non sia affollata di turisti.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mpbw2w/raccomandazione_per_la_pizzeria/"
    },
    {
        "id": "1mp8u5a",
        "author": "GalacticMaraja",
        "title": "Matricole UniTo (qualcuno sa qualcosa?)",
        "content": "Ciao a tutt*!\nSono un futuro studente di filosofia presso l'Università di Torino. Qualcuno di voi sa se esiste già un gruppo Facebook/Whatsapp/Telegram con le future matricole, non solo di filosofia, ma in generale di UniTo o addirittura della città?\nGrazie.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mp8u5a/matricole_unito_qualcuno_sa_qualcosa/"
    },
    {
        "id": "1mp88va",
        "author": "Murky_Giraffe8700",
        "title": "Treno per Aeroporto",
        "content": "Sto guardando gli orari per andare all'aeroporto da Porta Susa e il tempo di arrivo previsto è di un'ora\n\nVa bene? Ricordo che l'ultima volta ci ho messo molto meno\n\nInoltre, c'è un treno alle 5 del mattino che impiega 15 minuti per arrivare\n\nÈ sicuro prenderlo?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mp88va/treno_per_aeroporto/"
    },
    {
        "id": "1mpl51p",
        "author": "Fit_Variety_3523",
        "title": "Può essere peggio?",
        "content": "Chiesto così per noia a ChatGPT",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9b2hb2rmmvif1.png?auto=webp&amp;s=63c8f737c11f59ec63bd018fc9ed6cab936bfc57"
        },
        "permalink": "/r/torino/comments/1mpl51p/può_essere_peggio/"
    },
    {
        "id": "1moseid",
        "author": "Esp3t0",
        "title": "Looking for Affordable Farmers’ Markets and Grocery Stores",
        "content": "Hello!\nI'm moving to Turin with my wife and will stay for at least 9 months.\n\nI'm looking for tips of good places to shop for fresh produce and groceries at reasonable prices. I’d really appreciate your recommendations for:\n\n- Farmers’ markets with fresh fruits and vegetables\n\n- Grocery stores or supermarkets with good deals\n\n- Any hidden gems for affordable food shopping\n\nAlso, could anyone share an estimate of the average monthly grocery costs for two people in this area? It would help me a lot with budgeting. \n\nThanks in advance!",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1moseid/looking_for_affordable_farmers_markets_and/"
    },
    {
        "id": "1mohw6f",
        "author": "scemo_chi_legge123",
        "title": "dove poter bivaccare",
        "content": "Ciao!\nIo e degli amici vorremmo fare una notte in tenda quindi dovremmo trovare una zona in cui poter bivaccare con la possibilità di accendere un fuoco se possibile. Noi siamo di Torino e potremmo spostarci in prossimità della provincia. Preferiremmo un posto un po' in alto ma non troppo (non siamo alpinisti professionisti hahahah) (per vedere le stelle!!)\nGrazie mille per chiunque risponderà!!\n(punti bonus se il posto ha vicino o sulla strada specchi d'acqua dove poter fare il bagno!!q)\n",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mohw6f/dove_poter_bivaccare/"
    },
    {
        "id": "1mo6ipf",
        "author": "toiletclogger2671",
        "title": "Oulx - Bardonecchia è possibile in bici?",
        "content": "Ciao a tutti, scusate per l'italiano, sono novice ma ho troppo ego per usare un traduttore.\n\n  \nHo un opportunita di vacanza d'ultimo minuto a Briancon la prossima settimana (3g) e voglio andare in bicicletta questo itinerario: montgenevre -&gt; oulx -&gt; bardonecchia -&gt; colle delle scale \n\n  \nC'è un ciclisto o qualcuno che vive nella valle qui?\n\n  \nSto cercando di trovare se è possibile:\n\n\\-So che il colle de montgenevre è molto utilizzato - è meglio la mattina presto (\\~7:00)? Ci sono lavoratori fra frontieri?\n\n\\-Vedo che la strada unica fra Oulx e Bardonecchia è una strada statale ma c'è l'autostrada parallelo ad esso. Significa chè 90% delle auto usa l'autostrada? \n\n\\-Non ho andato mai (ancora) in italia ma tutti qui dicono che gli conduttore vengono dall'inferno. Sto per morrire o è vero solo in roma e sud?\n\n\\-Nella riscerca ho visto che Bardonnechia aveva un grande landslide a luglio ma non trovo niente piu nuovo . Qualcuno è stato recentemente o sa?\n\n  \nGrazie ",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mo6ipf/oulx_bardonecchia_è_possibile_in_bici/"
    },
    {
        "id": "1mo7euh",
        "author": "Apoworld",
        "title": "Dune Uprising/Bloodlines",
        "content": "Ciao :)\n\nSiamo un gruppo di 4/5 amici che si ritrovano spesso a giocare al gioco da tavola Dune Uprising - o Insurrezione in italiano (fra poco ci arriverà l’espansione Bloodlines - o Lignaggi in italiano).\n\nC’è qualche altro giocatore a Torino che nel caso vorrebbe unirsi ogni tanto?",
        "upvotes": 3,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cwwk7kcj1lif1.jpeg?auto=webp&amp;s=abdabc5b0425c08ab50ee2c74e5c8ba03c869d5d"
        },
        "permalink": "/r/torino/comments/1mo7euh/dune_uprisingbloodlines/"
    },
    {
        "id": "1mo9c4s",
        "author": "mozambique_best_gun",
        "title": "Personalizzazione maglie da calcio",
        "content": "Domenica ho acquistato due magliette dell'arsenal, purtroppo però nello store adidas non era a disposizione il servizio di personalizzazione. \nSapreste consigliarmi un negozio/sito che possa personalizzare le magliette con il font  della woman's super league? (WSL) \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mo9c4s/personalizzazione_maglie_da_calcio/"
    }
]