[
    {
        "id": "1j2g6vh",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 15,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j2g6vh/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1j2fyuo",
        "author": "Optimal_Lie7824",
        "title": "Vini Jr has a 100%-win rate as Real Madrid captain! Unbelievable stat.",
        "content": "",
        "upvotes": 253,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8zrgsj24fgme1.jpeg?auto=webp&amp;s=33f9f86c577cd05b05535837a6ad92f507c3062c"
        },
        "permalink": "/r/realmadrid/comments/1j2fyuo/vini_jr_has_a_100win_rate_as_real_madrid_captain/"
    },
    {
        "id": "1j2i0gz",
        "author": "dilfgirl",
        "title": "⚪️🇹🇷 Arda Sketches [OC]",
        "content": "",
        "upvotes": 159,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5lmrwjqyxgme1.jpeg?auto=webp&amp;s=c6ae9fa19f6cf2ae698fdca50bae515dc3d3b4df"
        },
        "permalink": "/r/realmadrid/comments/1j2i0gz/arda_sketches_oc/"
    },
    {
        "id": "1j27e79",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to Antonio Rudiger 🇩🇪",
        "content": "",
        "upvotes": 984,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j27e79/happy_birthday_to_antonio_rudiger/"
    },
    {
        "id": "1j2jqrz",
        "author": "SubjectTumbleweed216",
        "title": "[FootyHeadlines] Real Madrid 25/26 pre-match shirt",
        "content": "",
        "upvotes": 65,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ug2ju07uhhme1.jpeg?auto=webp&amp;s=3d2fc1d29c0b48270f039b395c1e629577c09750"
        },
        "permalink": "/r/realmadrid/comments/1j2jqrz/footyheadlines_real_madrid_2526_prematch_shirt/"
    },
    {
        "id": "1j1sc12",
        "author": "Total_Escape_9778",
        "title": "Winning the champions league is seriously easier for us than copa 😭",
        "content": "",
        "upvotes": 1393,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oy0wh0sbgame1.png?auto=webp&amp;s=349fc82afb2c775c4f937d10de0500ee154adc36"
        },
        "permalink": "/r/realmadrid/comments/1j1sc12/winning_the_champions_league_is_seriously_easier/"
    },
    {
        "id": "1j23vbo",
        "author": "ColdAd3682",
        "title": "Fede Valverde set to be part of the squad against Atletico.",
        "content": "",
        "upvotes": 152,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xc_cD5Xmr5OemSzUeYM8AQqWuPMjUxNbJTwG3bocHqw.jpg?auto=webp&amp;s=499d01255a05145106da9c58362b0dfaf67c8b98"
        },
        "permalink": "/r/realmadrid/comments/1j23vbo/fede_valverde_set_to_be_part_of_the_squad_against/"
    },
    {
        "id": "1j1sasc",
        "author": "FlyingWaterMen",
        "title": "Fede Valverde has a 100% win record as a Real Madrid captain.",
        "content": "",
        "upvotes": 475,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b8tjitv1game1.png?auto=webp&amp;s=d0499596aabd8b2ba7bbc733ecb35ba15414693e"
        },
        "permalink": "/r/realmadrid/comments/1j1sasc/fede_valverde_has_a_100_win_record_as_a_real/"
    },
    {
        "id": "1j1mcwl",
        "author": "PenguinFootballClub",
        "title": "🚨Real Madrid's starting LB gets his first La Liga goal contribution after 868 days. Aura.",
        "content": "",
        "upvotes": 1237,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m26ieomhm8me1.jpeg?auto=webp&amp;s=34dc96d9a862f01d0d07aa929690ae13aadf1f51"
        },
        "permalink": "/r/realmadrid/comments/1j1mcwl/real_madrids_starting_lb_gets_his_first_la_liga/"
    },
    {
        "id": "1j21k4l",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid 1-2 Real Betis",
        "content": "",
        "upvotes": 115,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j21k4l/post_match_survey_results_real_madrid_12_real/"
    },
    {
        "id": "1j1zzyv",
        "author": "ubebebebe",
        "title": "I’m going to my first Real Madrid game next Sunday 🙏🏼🤍🥹",
        "content": "I’ve been a fan since 2010… and this is my first time to watch them play live at the Bernabeu (my first time in Madrid too). So I’m really excited!!! I actually think I’m gonna cry when I get there. A bit dramatic, but that’s a real possibility hahaha.\n\nGot my silver VIP ticket already. But I’m watching ALONE since my friend isn’t a fan and would rather explore the city than watch the game with me hahaha. so any tips for a female fan who will be watching the game alone? ☺️\n\nAlso, the weather forecast isn’t looking good for next Sunday. Do they allow foldable umbrellas inside the stadium? \n\nThanks. ",
        "upvotes": 109,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j1zzyv/im_going_to_my_first_real_madrid_game_next_sunday/"
    },
    {
        "id": "1j1pisl",
        "author": "Available-Ad3881",
        "title": "Valverde is still training separate from the group. Tomorrow it will be decided if he can train with the group. He has missed 3 games so far and has been out for 11 days. Against City he played bandaged up.",
        "content": "",
        "upvotes": 432,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/__RUyufsR_P7FkHac0mJCF7PsWJAcHidezeBG1LXI4E.jpg?auto=webp&amp;s=857538108178c0ce83ce4a16fe6d28ad811f3f00"
        },
        "permalink": "/r/realmadrid/comments/1j1pisl/valverde_is_still_training_separate_from_the/"
    },
    {
        "id": "1j21xko",
        "author": "Onegoofylad",
        "title": "Could this jersey be legit?",
        "content": "I got some money for my birthday and would love to buy another Real Madrid kit. I’ve wanted to buy the Mbappé kit for a while now, but I recently came across this 2016/2017 Cardiff final kit with Ronaldo on the back. For me this kit would have absolute priority over Mbappé’s kit, as much as I love him. \n\nI was wondering if anyone based on these few pictures the seller gave could determine whether the kit is the real deal or just a very good replica? \n\nThank you in advance! ",
        "upvotes": 69,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j21xko/could_this_jersey_be_legit/"
    },
    {
        "id": "1j1yhuy",
        "author": "ykpierre_",
        "title": "We need to discuss about Vini",
        "content": "Before people rush to the comments and such, I DO NOT think we should or need to sell Vini. \n\nThis might seem reactionary, but we need to talk about Vini man. These past like 4 months he's regressed so much with his decision making and just overall product. He had such a good start to the season aswell, and its so disappointing  to see where he is now. He's mentally been out of the game since the year started. I wanted to compare this to last season where for the first half of the season he was just not it, but then 2nd half he was on fire. Honestly, Vinis changed in how he plays. When he finally started shining, he looked unstoppable. He was genuinely a threat everytime he was on the ball as you could just feel something was gonna happen either a goal or a chance created. Now, it just feels like he's trying to prove something in the wrong way. I don't feel that hype whenever I see him on the ball nowadays because it's almost always resulting in a throw in. I've seen people say its because of the 7 shirt, because of the ballon dor, because of the refs, etc. I just don't know whats gotten into him now, and then mix that with the referee  issues and it gets way worse. I pray this is something that will blow past, but someone needs to talk to him because its really unacceptable, specially for his standards.",
        "upvotes": 102,
        "comments": 124,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j1yhuy/we_need_to_discuss_about_vini/"
    },
    {
        "id": "1j1egzu",
        "author": "aprilhyped",
        "title": "thank you don carlo🤦🏽‍♂️",
        "content": "",
        "upvotes": 2897,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cty1axu0b6me1.jpeg?auto=webp&amp;s=6a80bb7f9619b11e99a5ef0d6c98ada10ba3d1d5"
        },
        "permalink": "/r/realmadrid/comments/1j1egzu/thank_you_don_carlo/"
    },
    {
        "id": "1j2m8g2",
        "author": "CapsianMoney",
        "title": "Will Arda ever make it in Madrid?",
        "content": "It is an open question. The boy has quality, but he lacks physicality to be either a winger or a playmaker. Do you think that he will grow into it or is he going to be just another would-be star that will fade away? \n\nI almost feel sorry for him when I see him running for his life during some games. Some of you will tell me, Modric was the same way. But I don't see it, Modric wasn't having these many issues with stamina. Is Carletto too demanding in terms of defensive duties or is Arda just not fit for high pace football?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j2m8g2/will_arda_ever_make_it_in_madrid/"
    },
    {
        "id": "1j1o0kq",
        "author": "sarahhhayy",
        "title": "The biggest takeaway from yesterday's game was that Jude, Fede, Asencio, and Ceballos are our key players.",
        "content": "Yesterday's game made me realize once again that Federico Valverde, Jude, Dani Ceballos, and Asencio cannot be benched or rested if we want to win the league and the Champions League. Sadly, this is true, although I know Ceballos is injured. Ceballos has become an important player as a starter, as he has solved our ball progression issues and facilitated buildup from midfield, which we clearly lacked yesterday. There was no connectivity between our attack and midfield, and no one on the pitch knew how to create something out of nothing. Plus, yeah our attackers were equally unimpressive and ass through out the game as if they were forced to play the game.\n\nAnd and, I just hope Carlo must have learned his lesson by now... benching Asensio for Rudiger, Alaba, or Militao would be a disaster. Two of them have just returned from long injuries, and rushing them back into the team at this critical point in the season won't do us any good. Asencio is in the form of his life, so do not disrupt his rhythm. Resting him at this point.. doesn't make any sense plus it looks more ridiculous when rudiger was clearly struggling yet carlo didn't seem to care at all. Lol.. I don't know, what was that. \n\nAnd Lastly, I wanna admit one thing, I never thought Ceballos would become this important for our team, but here we are. His injury couldn't have come at a worse time, and now we can only hope that Valverde and Jude stay fit... otherwise, we're doomed. These three, along with Asensio, don't give up until the last moment(didn't mean, others don't have this fighting spirit, but these 4 possess some next level kinda madridismo) and this kind of passion was missing from our team yesterday.",
        "upvotes": 183,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j1o0kq/the_biggest_takeaway_from_yesterdays_game_was/"
    },
    {
        "id": "1j1qcng",
        "author": "ManuMora98",
        "title": "Athletic Club W 1 - 2 Real Madrid W | Nahikari 10'; Lakrar 40', Olga 80' | Win in our first visit to San Mamés, with a comeback after Athletic took the advantage with a (dubious) penalty. We upgrade our advantage above the 3rd to 17 points (15 if Atlético wins their game).",
        "content": "",
        "upvotes": 71,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/frjdkzxjy9me1.jpeg?auto=webp&amp;s=12a8b0d303583384b4315e6d9b99057088a97dd0"
        },
        "permalink": "/r/realmadrid/comments/1j1qcng/athletic_club_w_1_2_real_madrid_w_nahikari_10/"
    },
    {
        "id": "1j1o1pz",
        "author": "Llaauuddrrupp",
        "title": "My thoughts from the match last night:",
        "content": "\n1) Alaba ain't that guy anymore. I believe everyone agrees that Raul Asencio should have started and the game wouldn't have gotten that bad. Despite Betis' great performance, the goals conceded were relatively easily avoidable. The equalizing header was from point blank, no one was marking the goalscorer. In contrast, look how they defended our set piece completely blocking off Rudiger or any other player from having a decent header. Then there was the stupid penalty Rudiger conceded which wouldn't have happened if he had Raul with him in that position. Our center backs got outran all game. Primarily I believe this was what made us lose the upper hand in this game. We couldn't defend properly leading to a vicious cycle of weathering attack after attack without much opportunities to answer back. Of course it didn't help that Betis have players that are good on the ball under pressure. If Carlo didn't play Raul Asencio because of what happened previously and he is trying to protect him, then I understand, though I think it was unneeded. \n\n2) Brahim was great for like the first 20 minutes then immediately shut down afterwards. He was just getting unnecessarily dispossessed and misplacing easy passes. I don't know what went over him. Does anyone know what went wrong? He was having an at least 9/10 performance then started dropping stinkers all of a sudden. At that point I would rather have had Rodrygo or Arda (though still not decided about him) in the midfield. \n\n3) Vini wasn't that bad. He was dangerous the few times he was on the ball. But there were times I sensed some hastiness in his game. Same with Rodrygo, and Mbappe as well. They let the pressure get to them too much. But our defense is to blame because it didn't give the team the breathing room it was supposed to give. We were just getting cooked in the flanks and our center backs were struggling badly. The useless and unnecessary long balls from Tchoumeni and Courtois didn't help much either. I get Cortouis can't play short but he should always try to play the ball in middle of two or three Madrid shirts where they have a higher chance of winning the second ball, not to the opponent's center backs. I was just exasperated everytime he did that. Other than that, he saved us from a worse scorline. \n\n4) Camavinga is a bad passer and a bad playmaker. He has decent technique but he hasn't improved in three years in terms of decision making and awareness. Just tackle, dribble, long pass (or cross) and inshallah. He is overrated. Hope he improves, if not he should be sold for a proper midfielder.  \n\n5) Tchoumeni wasn't that bad and I don't want to scapegoat him. That said, he has a lot of things to improve upon. Like his challenges, could have conceded a penalty. He was also misplacing some easy passes that killed our attack. \n\n6) Carlo should have shut down the long ball tactics against Betis. Especially when we were having success between the lines. They weren't playing a high line and we didn't have numerical advantages to win the second ball. Only one time something meaningful came from this tactic was when Modric won a second ball which lead to a chance though it was fumbled by Vinicius afterward. Other than that the long balls were useless. \n\n\n\n--\n\n\n\n\nTL;DR: Though our midfield and attacking performance was poor overall, the starting center back pairing and poor defense overall made this game more difficult than it would have been, because there would have been less pressure and hastiness on former's side, especially the front three . \n\nOverall the season is still undecided so there's no need to be pessimistic though it definitely isn't looking too good right now.",
        "upvotes": 98,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j1o1pz/my_thoughts_from_the_match_last_night/"
    },
    {
        "id": "1j1pv47",
        "author": "IcefoxX5",
        "title": "CF Intercity 1-[2] Real Madrid Castilla - Dani Yáñez 70'",
        "content": "",
        "upvotes": 59,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/akh21f1kt9me1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1j1pv47/cf_intercity_12_real_madrid_castilla_dani_yáñez_70/"
    },
    {
        "id": "1j1eial",
        "author": "shlokbhargava",
        "title": "+2 years of Contract Renew",
        "content": "Now thats a genuine reason to start Mendy, renew his contract and double his salary🔥",
        "upvotes": 504,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iwfncegbb6me1.jpeg?auto=webp&amp;s=b15913f308a35d5a9f8fd732522caae0d0a03ee0"
        },
        "permalink": "/r/realmadrid/comments/1j1eial/2_years_of_contract_renew/"
    },
    {
        "id": "1j1ddt1",
        "author": "Ok-Fold6928",
        "title": "La Liga Table last 5 matches",
        "content": "",
        "upvotes": 482,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z4vl30qg16me1.jpeg?auto=webp&amp;s=e650dc8ecadcb4fc6571935cffc60c4b2ae7f916"
        },
        "permalink": "/r/realmadrid/comments/1j1ddt1/la_liga_table_last_5_matches/"
    },
    {
        "id": "1j1540y",
        "author": "dark4403",
        "title": "BRAHIM SCORESSS LETS GOOOO",
        "content": "",
        "upvotes": 1248,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zqehrpwv74me1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1j1540y/brahim_scoresss_lets_goooo/"
    },
    {
        "id": "1j15gac",
        "author": "dark4403",
        "title": "🚨🎥 Luka Modric with Isco. ♥️",
        "content": "",
        "upvotes": 1063,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c6ac20hha4me1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1j15gac/luka_modric_with_isco/"
    },
    {
        "id": "1j1d6ls",
        "author": "Hibban1234",
        "title": "Fun Fact! Real Madrid Has The Most Defeats In Championships League History",
        "content": "",
        "upvotes": 304,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w20juavqz5me1.jpeg?auto=webp&amp;s=e1e82ddc9c07a7667a84d5a478af0bc05347fe7f"
        },
        "permalink": "/r/realmadrid/comments/1j1d6ls/fun_fact_real_madrid_has_the_most_defeats_in/"
    },
    {
        "id": "1j1p3h9",
        "author": "IcefoxX5",
        "title": "CF Intercity 1-[1] Real Madrid Castilla - David Jiménez 40'",
        "content": "",
        "upvotes": 36,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qxj66qexk9me1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1j1p3h9/cf_intercity_11_real_madrid_castilla_david/"
    },
    {
        "id": "1j1602m",
        "author": "dark4403",
        "title": "🚨🎥 What a save and reaction from Thibaut Courtois",
        "content": "",
        "upvotes": 691,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vcyt2yjke4me1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1j1602m/what_a_save_and_reaction_from_thibaut_courtois/"
    },
    {
        "id": "1j1aqoo",
        "author": "Objective-Cost-1255",
        "title": "Stats in the first 40 games for Real Madrid.",
        "content": "",
        "upvotes": 298,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xo5hcyfof5me1.png?auto=webp&amp;s=4449e081538029302e74d5734af929180c247e65"
        },
        "permalink": "/r/realmadrid/comments/1j1aqoo/stats_in_the_first_40_games_for_real_madrid/"
    },
    {
        "id": "1j1ngq5",
        "author": "ManuMora98",
        "title": "[FEM] Our Starting XI against Athletic Club (at San Mamés) | Liga F Match Day 20",
        "content": "",
        "upvotes": 28,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/chivsjay09me1.jpeg?auto=webp&amp;s=0c8e283c33fee603f46fb9494fc85231ed47479e"
        },
        "permalink": "/r/realmadrid/comments/1j1ngq5/fem_our_starting_xi_against_athletic_club_at_san/"
    },
    {
        "id": "1j0ygrh",
        "author": "Constant_Aspect_6632",
        "title": "Real Betis's poster for today's fixture.",
        "content": "",
        "upvotes": 1099,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/88asjz2fo2me1.jpeg?auto=webp&amp;s=55328185468bd6a62de7770ca56bf31a4e159c4b"
        },
        "permalink": "/r/realmadrid/comments/1j0ygrh/real_betiss_poster_for_todays_fixture/"
    },
    {
        "id": "1j1ofhm",
        "author": "IcefoxX5",
        "title": "[Match Thread] CF Intercity - Real Madrid Castilla | Primera Federación, Matchday 26",
        "content": "#FT: INTERCITY 2:2 CASTILLA \n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Anthony Modeste 23'\n\n1:1 David Jiménez 40'\n\n1:2 Dani Yáñez 70'\n\n2:2 Nacho González 90'+5\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n5' - weird matchup today against club-construct CF Intercity, who are dead last but have a strike force of former top level players Emiliano Nsue and Anthony Modeste, with Jürgen Locadia on the bench\n\n⚽ 23' - Goal for Intercity, Anthony Modeste scores a bicycle kick, of course - that's what he apparently does nowadays in the 3rd division in Spain \n\n25' - Swift reply by Castilla, the ball falls for Gonzalo after a cross and he heads it over the keeper, but the referee whistles for a previous offside by Jacobo, who didn't touch the ball...\n\n33' - something happened in the stands, but the game is underway again\n\n⚽ 40' - GOLLLLL DEL CASTILLA - Manuel Ángel gets an easy run in the box, he looks up and squares it to the far post, where David Jiménez makes the run from right wing back to slide it past the keeper for the equaliser! \n\nHT - Castilla were the better team and clearly have the better and more ambitious players against last-placed Intercity here, the only thing keeping it level is the still-apparent quality of former top-class striker Anthony Modeste, who scored an incredible bicycle goal \n\n46' - 2nd half underway \n\n54' - two saves by de Luis to deny Modeste and Nsue, such a good keeper\n\n🔄 66' - Borja off for Yáñez \n\n⚽ 70' - GOLLLL DEL CASTILLA - beautiful through ball with the outside of the boot by David Jiménez, and Gonzalo somehow pushes past the defender and the keeper to reach the ball first. He gets brought down by the keeper, but the referee gives the advantage, and Yáñez taps it into the empty net for the lead! \n\n79' - Free kick from a great position taken by David Jiménez who curls it over the wall, but the keeper can make a great save to deny it \n\n🔄 83' - Loren Aguado and Antonio David for David Jiménez and Chema. MOTM performance by David, who's had a great season so far, inexplicable why he doesn't get some minutes in the first team over Lucas or even Lorenzo \n\n⚽ 90'+5 - goal for Intercity in the last play... Cross from the left, then there was a clear push on Jacobo... The ball bounces off of Modeste, and in the end Nacho González pushes it over the line... So incredibly undeserved\n\nFT - Castilla drop two points in the last seconds against last-placed Intercity in the chase for the playoff spots - the team showed another good performance and deserved the win here, but it wasn't meant to be. They climb up to 5th position for the moment, and stay undefeated in 2025 with 5 wins and 3 draws \n\n&amp;#x200B;\n\n**Kickoff:** 12:00 CET\n\n**Venue:** Poliesportiu Sant Joan D’Alacant, Alicante \n\n**Referee**: \n\n**Competition:** Primera Federación, Grupo 2, Matchday 26\n\n**Viewing options:** \n[FEF TV](https://feftv.com) (subscription - 12.99€/month)\n\n&amp;#x200B;\n\n**Castilla XI** (4-2-3-1): Mario de, Luis - Youssef Enríquez ‘Yusi’, Edgar Pujol, Jacobo Ramón, Mario Rivas, David Jiménez (83' Lorenzo Aguado) - José Maria Andrés ‘Chema’ (83' Antonio David), Manuel Ángel - Borja Alonso (66' Dani Yáñez), Gonzalo García, Víctor Muñoz \n\nBench: Diego Piiñeiro (GK), Víctor Valdepeñas ‘Valde’, David Ruiz, Andrés Campos, Jeremy de León, Loren Zúñiga \n\nUnavailable: Fran González (first team call-up), Raúl Asencio (first team call-up), Quique Ribes (suspension), David Cuenca (pubalgia), Jacobo Ramón (first team call-up), César Palacios (ACL tear). \n\nCoach: Raúl\n\n&amp;#x200B;\n\n**Castilla last five matches:** DWWDW\n\n**1ª RFEF stats:** 7th | 36pt | 9-9-7 | 42:27",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1j1ofhm/match_thread_cf_intercity_real_madrid_castilla/"
    }
]