[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 51,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l3ujxm",
        "author": "Curious_Natural_1111",
        "title": "Dept Q should be renewed for season 2",
        "content": "They need to wrap up who was the Leith park shooter!!!\nJust finished watching it I need to see Morck working on more cases \n\nStarted off slow but was engrossing in afterwards episodes with barely any fillers.\nThe chemistry between actors were great, loved Akram and Martin.\n",
        "upvotes": 73,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ujxm/dept_q_should_be_renewed_for_season_2/"
    },
    {
        "id": "1l3nfpt",
        "author": "SketchyFella_",
        "title": "I HATE the new layout...",
        "content": "I have been saying for YEARS that Netflix has the best layout of any streaming service and have been annoyed that other streaming services have an inferior layout. Now, Netflix seems to be copying other services rather than the other way around. Why? Does anyone here actually like seeing fewer options on the screen? When you go to your list, rather than seeing multiple rows of all the things you like to watch, not you have to scroll endlessly to make it through what used to be a single screen's worth of content info. I hate this.\n\nSeriously though, does anyone know why? Are there metrics that make this make sense?",
        "upvotes": 139,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1l3nfpt/i_hate_the_new_layout/"
    },
    {
        "id": "1l3z95u",
        "author": "bubbley_bear",
        "title": "Netflix says I’m nit a part of my own household?",
        "content": "This is why I hate the new same household rule. I’m in my home, on the same phone I made my account on and use all the time to watch Netflix on. I go to open it today and it says I’m not in my household and need to get a temporary access code to use my own account?? I haven’t shared the info with anybody and I’m not signed in on any other devices. It’s letting me use it now but is there anything I can do to make sure this doesn’t happen again?",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l3z95u/netflix_says_im_nit_a_part_of_my_own_household/"
    },
    {
        "id": "1l3vqux",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game creator says he lost 2 more teeth making the final season: 'I haven't put them back in yet'",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vqux/squid_game_creator_says_he_lost_2_more_teeth/"
    },
    {
        "id": "1l3ywvc",
        "author": "willi7lol",
        "title": "Error Code UI 3012",
        "content": "I am currently encountering this issue where if my laptop is connected to my Home Internet Provider, it won't allow me to watch the shows, I am able to access Netflix, but can't play the shows. I tried using different browsers like Chrome and Edge, as well as using the Netflix Desktop App, none of them works. However if I use the Hotspot connection from my data provider, I am able to play the shows, but here is the tricky part, using my phone, when connected to my home Internet provider, it works as well, it just doesn't work when  im trying to watch on my laptop.\n\nHave anyone encountered this issue before ?? It was working fine earlier all of a sudden it just stopped working on my laptop. Does anyone know any solutions? I've tried everything like clearing caches, restarting my router and Internet etc.\n\nEdit: the Internet works just fine, I am able to access Twitter, YouTube etc. I am just unable to play shows on Netflix in Chrome, Edge or the desktop app.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ywvc/error_code_ui_3012/"
    },
    {
        "id": "1l3vnox",
        "author": "OkStyle965",
        "title": "What to watch after Medusa?",
        "content": "I’ve finished watching Medusa and loved it. While waiting for season two, any idea or recommendations of the similar series to watch next? Weekend is coming:) thanks!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vnox/what_to_watch_after_medusa/"
    },
    {
        "id": "1l4304a",
        "author": "Sea-Blueberry9232",
        "title": "Stupid question: but where do you get to live the real life Outer Banks experience?",
        "content": "So plenty of people from the actual Outer Banks said that the Show is nothing like the actual Outer Banks they live in. So my question is: is there someplace in the world we dont know about, where it is like in the OBX (season 1-2)? Of course WITHOUT all the police chases and the treasure hunt for the Royal Merchant and the dramatized unrealistic stuff. I mean more if there is a coastal or beach town , fisher town or something similar, with a bunch of good looking Teenagers and Young Adults, that all apart from knowing how to drive a car they all know how to drive boats and they all surf and dive and are having their bonfire parties. Does something like that exist? Like a town with strong outer banks vibes? \n\nI know the gossip girl experience actually does exist, its called le rosey, a swiss boarding school. Prerequisite is that ur parents have to be loaded. Pretty much any expensive swiss boarding school.\n\nI know the emily in paris experience actually also does exist. Prerequisite is that 1. You speak french 2. You get a fashion job in paris that does get you invited to all these fashion shows and u live in the 6th and 7th Arrondissement and wear designer and earn good money. Or you can be an influencer or a nepo Baby like all the daughters from François Henri pinault. But the emily in paris experience does def exist in real life. \n\nBut I cant really Wrap my head around, if the Outer Banks experience is purely fictional or there is a town like that sonewhere in the world with such an environment. \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4304a/stupid_question_but_where_do_you_get_to_live_the/"
    },
    {
        "id": "1l42bs5",
        "author": "rei_ayanami_n1_fan",
        "title": "what is happening with my Netflix?",
        "content": "I have a pin code on my profile, but even if I have the correct pin it says that it's incorrect. I've tried the same thing on my phone but it works perfectly fine. I used the same code. Somehow it just doesn't let me into my profile even tho the code is correct... why is this happening?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l42bs5/what_is_happening_with_my_netflix/"
    },
    {
        "id": "1l41s7b",
        "author": "RecordingUnlikely530",
        "title": "Dept. Q is giving me Oldboy vibes!",
        "content": "Dept. Q is giving me serious Oldboy vibes. Anyone else catch the parallels? The grim atmosphere, twisted motives, even using captivity as penance. Not as cringed as Oldboy though.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l41s7b/dept_q_is_giving_me_oldboy_vibes/"
    },
    {
        "id": "1l41p81",
        "author": "Effective_Ad8019",
        "title": "Account sharing fees in UK.",
        "content": "This may already been discussed in other posts but I can’t find them. I’m sorry. \n\n If you share Netflix account does Netflix automatically deduct more money out of your card. Or is they a warning first. I’m only asking cos a family member is travelling for a couple months so won’t be in the household. And we don’t wanna pay extra.  ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l41p81/account_sharing_fees_in_uk/"
    },
    {
        "id": "1l3zruu",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has 3 originals in Top 10 Streaming for the week of April 28-May 4",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3zruu/netflix_has_3_originals_in_top_10_streaming_for/"
    },
    {
        "id": "1l3y5hs",
        "author": "Sad_Confusion_4225",
        "title": "Volume on Netflix",
        "content": "I have an issue with not being able to hear the conversations on Netflix shows/ movies. I have had to revert to using subtitles. \n\nWhile on regular channels, I am able to hear everything well, it’s only on Netflix that the volume is very low no matter how high I turn it up. \n\nIs there a way that I can increase the volume on Netflix? Thank you in advance for any advice! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l3y5hs/volume_on_netflix/"
    },
    {
        "id": "1l306ge",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 162,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1l306ge/adolescence_beats_stranger_things_4_to_become/"
    },
    {
        "id": "1l35moc",
        "author": "RIP_Golden_Boy",
        "title": "New interface introduced on Roku yesterday - hands down the WORST of all other streaming services I have",
        "content": "As described in the title, I opened Netflix on Roku yesterday to an announcement of the new UI and how wonderful it would be, etc., etc.\n\nDamn, is it ever bad. Of course, the \"worst\" label is 100% subjective and just one person's opinion. But, for me, it is objectively less usable than before. Its cramped design actually gives me a slight sense of clostrophobia to the point where I actively dislike being in the app. I find it very unwelcoming. \n\nWhen I open Netflix, most of the time I'm not going to in to watch anything in particular. I like browsing and hunting for something that, based on the title and/or image, I think might interest me. I've heard a lot of people complain about the quality on Netflix but there are still quite a few gems that I would often stumble on. The Residence and The Gentlemen are perfect examples of this - shows that I liked that I came across while scrolling through the app and hadn't previously heard of. \n\nThe new interface makes this process much more difficult. It's much easier to visually scan a screen with a lot of items and scroll when necessary. When you see something you might like you can choose to explore further and then look at the details.   \n\nNow, you are hit in the face with details of a single show taking up a large part of the screen that, odds are, you don't care anything about with a handful of other shows around the edges. \n\nGiven my typical use of Netflix, it will now take me much longer to find something than it did before. And given how being in the app makes me feel like I'm in a box, I can see my usage dropping significantly. Cancelation is likely right around the corner. \n\nFirst world problem, I know, but I only have so much money to go around. It doesn't make sense to spend it on something that will likely now sit idle most of the time. \n\nOk, rant over. On with my day. \n\nEDIT: I really am curious to hear from people who do like the new UI and what specifically they find better about it. While it's always fun to vent, I would like to hear others' perspectives just in case I'm missing something. ",
        "upvotes": 55,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1l35moc/new_interface_introduced_on_roku_yesterday_hands/"
    },
    {
        "id": "1l3w4ua",
        "author": "Pure_Smoke833",
        "title": "What are you looking forward to from Squid Game - The Final Games Begin ?",
        "content": "From the trailer, I don't quite understand if player number 456 will be the face of the game ? What's that about? A little byte for another season? It's interesting to know how predictable the finale will be because the middle of last season was already boring.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3w4ua/what_are_you_looking_forward_to_from_squid_game/"
    },
    {
        "id": "1l3vbvs",
        "author": "Scared_Cow9483",
        "title": "Chanelle McAuliffe - something’s not right ….",
        "content": "So I’ve watched a few interviews involving her, and I don’t believe her reasons for revealing/outing Belle are at all altruistic. \n\nI could be wrong but there is something about Chanelle that has always felt off, in every interview her body language just seems to …. It’s just, I don’t know - I think there is more there, I feel like something else or some other events happened that ended with her revealing Belle. \n\nI dunno, could be completely wrong, but my behavioural background is shooting up flags and I can’t put my finger on it…. But she certainly comes across completely insincere. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vbvs/chanelle_mcauliffe_somethings_not_right/"
    },
    {
        "id": "1l3uw2y",
        "author": "Comprehensive-Way482",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3uw2y/adolescence_beats_stranger_things_4_to_become/"
    },
    {
        "id": "1l3u3bt",
        "author": "AlexML23",
        "title": "60 FPS on PC",
        "content": "Im trying to stream WWE on 60FPS but no longer works, my PC and internet connection is more than capable to run it \n\nI have a Ryzen 7 5700X3D and a RTX 3070\n\nIt only worked once and never worked ever again, has anyone got any luck with it? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3u3bt/60_fps_on_pc/"
    },
    {
        "id": "1l3tjj6",
        "author": "NoobAtFaith",
        "title": "Is there a way to force a higher bitrate/resolution on the Windows 11 Netflix app?",
        "content": "I have already set my playback settings to \"high\" (highest quality available), but certain movies are only streaming at 960x540 resolution. All other devices on the same wi-fi network are able to play all movies at full 1080p resolution. Is there a setting or keyboard shortcut that will let you manually select a bitrate/resolution?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3tjj6/is_there_a_way_to_force_a_higher/"
    },
    {
        "id": "1l3ophs",
        "author": "BeingCynical",
        "title": "Shows like Secrets We Keep",
        "content": "And no, not the Harlan Coben ones, watching Missing You and its gone from bad to worse the last couple years. \n\nLanguage- any , as long as there’s english audio or worse case, english subtitles. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ophs/shows_like_secrets_we_keep/"
    },
    {
        "id": "1l3ymoc",
        "author": "SelfAmbitious",
        "title": "My Wwe Money In The Bank 2025 Predictions",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ymoc/my_wwe_money_in_the_bank_2025_predictions/"
    },
    {
        "id": "1l3onuk",
        "author": "TerrytheMerry",
        "title": "Anyone else having random things pop up in their continue watching? No unauthorized access in device history.",
        "content": "The Bee Movie of all things just appeared at the front of my continue watching. I have not watched it in years, the only other person on my account has not even seen the movie before and would not watch it. Looking back through I also found Us between two recent watches. Again I watched it at some point but I have not seen it recently and the other person hates horror movies. I checked my device history and it’s only my stuff, no outside devices. Anyone else experiencing this?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l3onuk/anyone_else_having_random_things_pop_up_in_their/"
    },
    {
        "id": "1l38eg0",
        "author": "Educational_Still_51",
        "title": "Covid-19 show cancelations",
        "content": "Shows like “The Society”, “I Am Not Okay With This” , “GLOW” and more were cancelled a while (years) back due to the COVID pandemic and have yet to be renewed.  I feel like Netflix should consider renewing these shows again as they were originally renewed but the decision was reverted due to the pandemic.  Would love to know the community’s thoughts about this and if Netflix should revive these shows that were originally renewed for at least 1 more season.  One major flaw about this i can think of is casting back the same casts for these shows because they might have projects currently so filming would be difficult to plan and also different looking casts (with them looking older than what their characters are suppose to be, though Stranger Things managed to make that work).  ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l38eg0/covid19_show_cancelations/"
    },
    {
        "id": "1l3gewg",
        "author": "JanDaNinja14",
        "title": "Lost in Starlight english soundtrack",
        "content": "I watched, and fell in love with the movie Lost in starlight. (Watched it in english dub) And imedietly after finishing the movie, I checked for the soundtrack on YT and Spotify. I can't seem to find an english version of the songs tho??? All the music was dubbed in english on Netflix, but in the soundtrack it's in Korean.\n\n  \nDoes anyone know where I can find the songs in english? Im specifically looking for Bovoyage, it's the song I loved the most in the movie. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3gewg/lost_in_starlight_english_soundtrack/"
    },
    {
        "id": "1l39n2x",
        "author": "HehroMaraFara",
        "title": "Power Moves with Shaquille O’Neal",
        "content": "A mile wide and centimeter deep. \n\nDon’t watch it, I’ll summarize it:\n\nOne big commercial for a busted shoe brand with less than 1% market share in the ONLY market they are in. \n\nWatch it if you want to hear about the up and coming lifetime G Leaguers, or at best 5 years on the bench guys. If I were SGA, I’d sue them for pretending they even had a chance at signing him. \n\nIf you subtract the bad rap tracks, useless placating of Shaqs ego and nobody’s bragging in themselves. It’s 15 minute episodes. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l39n2x/power_moves_with_shaquille_oneal/"
    },
    {
        "id": "1l3ib24",
        "author": "SoStarVa",
        "title": "Dept Q glaring questions",
        "content": "I have not found these discussed anywhere and I can’t get them out of my head. Do here goes\n\n1. Merritt is implied to have been kidnapped by Lyle from the ferry (they frustratingly never clear this up explicitly) because she trusts him as being Sam. But in one of the scenes in the last/penultimate episodes she is surprised to see him. I think it’s the scene where Lyle is revealed to be Merritt’s “Sam”. Is this is a loophole or did I miss something?\n\n2. And this one is just a curious choice by the writers - why did Lyle need to kill Sam? He was not about to find out or anything of Lyle having stolen his identity? I don’t understand the character’s motivations here. Anybody care to explain?",
        "upvotes": 2,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ib24/dept_q_glaring_questions/"
    },
    {
        "id": "1l340xw",
        "author": "Aromatic_Location",
        "title": "New UI",
        "content": "Is the New and Upcoming category still in the new UI somewhere? Every week I go through what will be released in the next week, and add it to my list if it's interesting. But I couldn't find it last night when I tried using the new UI for the first time. Their recommendations and categories that they show are broken. For example they really want me to watch Korean dramas. I've never shown any interest in any foreign language show, so I don't know why it would be a suggested category. That's why I just use my watchlist. But I can't find anything with the new UI. I need the new and upcoming so I can bookmark shows I want to see.",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l340xw/new_ui/"
    },
    {
        "id": "1l3furw",
        "author": "truescotsman",
        "title": "Has anyone tried Games on TV?",
        "content": "Thinking of playing games with my wife using my Chromecast dongle and our phones.  We've played jackbox games before but it felt tedious to setup.\n\nHas anyone tried any of the games on TV?  Any recommendations?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l3furw/has_anyone_tried_games_on_tv/"
    },
    {
        "id": "1l36nuk",
        "author": "theipaper",
        "title": "Ginny and Georgia season 3 release date, cast and episode guide",
        "content": "",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l36nuk/ginny_and_georgia_season_3_release_date_cast_and/"
    },
    {
        "id": "1l2tlqw",
        "author": "Northeast4life",
        "title": "Animal Kingdom.. how is this the first time I’m seeing or hearing about this show.",
        "content": "Maybe it’s the lack of decent shows on Netflix recently but after 4 episodes I’m hooked. And how is this the first time I’ve heard of this show. It’s amazing!",
        "upvotes": 53,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1l2tlqw/animal_kingdom_how_is_this_the_first_time_im/"
    }
]