[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1is0q3j",
        "author": "bluntprincess99",
        "title": "TW (Spoilers) How angry are you after seeing the American Murder: Gabby Petito ?",
        "content": "True crime documentaries usually anger us, but this angered me like no other. \n\nSpoilers\n\n\n\n\n\n\nThe man lied in his suicide letter. \nThe parents helped him cover up a murder. \n\nI mean how can people be this cruel and sociopathic. ",
        "upvotes": 232,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1is0q3j/tw_spoilers_how_angry_are_you_after_seeing_the/"
    },
    {
        "id": "1isewv3",
        "author": "MassiveDexterFanGirl",
        "title": "The Laundrie Family are THE worst!",
        "content": "The way they just batted off the police and gave no cooperation at all, nothing to ease the minds of the Petito Family, it's disgusting! \nThey should be charged with perverting the course of justice! ",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1isewv3/the_laundrie_family_are_the_worst/"
    },
    {
        "id": "1iryv1b",
        "author": "Turtleballoon123",
        "title": "Started Baby Reindeer. It's brtutal and depressing yet compelling.",
        "content": "I don't know what to make of the show. It's brilliant, yet also brutal and depressing. Episode 4 is heart-wrenching. I've seen discussions from survivors who say the show can be triggering or who had to switch it off. I really feel for the series creator who based this off a story. It's so fucked up.",
        "upvotes": 109,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1iryv1b/started_baby_reindeer_its_brtutal_and_depressing/"
    },
    {
        "id": "1irzxha",
        "author": "yercoolmarple",
        "title": "The character Rose in The Night Agent is insufferable at this point.",
        "content": "I just have to get this off my chest, even at the risk of getting massively downvoted, this character is so poorly written. She changes her mind ten times in a single episode and is excessively annoying. The story itself is dull and weak overall with no character developments, but I could live with that if it weren’t for ***this*** one character being forcefully inserted into every situation. It made sense in Season 1 since the story revolved around her, but in Season 2? Even FBI agents are unaware of Night Action, yet somehow, this civilian is deeply involved in everything??seriously? If the writers were so intent on keeping her relevant, why not just hire her as a tech? Instead, they throw a civilian into the field like it’s nothing. To top it all off, the actor really cannot act. It was really difficult to finish season 2. I am not even getting to the other issues like poor writting, countlessly irritating character arcs.. S1 was not the greatest but it felt like this had some promise going forward and boy, oh boy, was I wrong.",
        "upvotes": 64,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1irzxha/the_character_rose_in_the_night_agent_is/"
    },
    {
        "id": "1is9ql4",
        "author": "doofuzzle",
        "title": "Which Netflix animated series is surprisingly good?",
        "content": "For me, BoJack Horseman is the standout. I started watching it because I thought it would just be a silly animated show, but it turned out to be deep, emotional, and incredibly well-written, tackling tough topics like depression, addiction, and self-worth with humor and heart.",
        "upvotes": 9,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1is9ql4/which_netflix_animated_series_is_surprisingly_good/"
    },
    {
        "id": "1iscj20",
        "author": "dailystar_news",
        "title": "Netflix details how Gabby Petito trip of lifetime turned into double death hell",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iscj20/netflix_details_how_gabby_petito_trip_of_lifetime/"
    },
    {
        "id": "1isbbfo",
        "author": "Josomie",
        "title": "Animated Squid Game Gi-hun in stop motion",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jlc94w513wje1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isbbfo/animated_squid_game_gihun_in_stop_motion/"
    },
    {
        "id": "1iruqoh",
        "author": "BlissfulEmilia",
        "title": "What's your all-time favorite Netflix original series?",
        "content": "I’ve been on the hunt for new Netflix originals to binge, and I wanted to know: what’s your all-time favorite Netflix original series? Whether it’s a drama, comedy, or documentary, I’m looking for recommendations that are must-watches. Bonus points if it’s something that really flew under the radar but ended up being amazing.",
        "upvotes": 84,
        "comments": 355,
        "media": null,
        "permalink": "/r/netflix/comments/1iruqoh/whats_your_alltime_favorite_netflix_original/"
    },
    {
        "id": "1is9dyf",
        "author": "Sweaty-Toe-6211",
        "title": "“All the Manga People Will Know”: ‘One Piece’ Star Katey Sagal Teases Crocodile’s Role for Season 2 and 3",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is9dyf/all_the_manga_people_will_know_one_piece_star/"
    },
    {
        "id": "1is72r0",
        "author": "techfinpro",
        "title": "‘Stranger Things’ Jamie Campbell Bower Talked To Therapist About Not Wanting To Play Villains For A While: ‘F—s Me Up’",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is72r0/stranger_things_jamie_campbell_bower_talked_to/"
    },
    {
        "id": "1irh528",
        "author": "mmprobablymakingitup",
        "title": "What’s a show you randomly started watching on Netflix and ended up loving?",
        "content": "I started Blacklist on a whim, not expecting much, but it completely pulled me in. Whether it was the story, characters, or just the overall vibe, I ended up binge-watching the whole thing.\n\n",
        "upvotes": 265,
        "comments": 742,
        "media": null,
        "permalink": "/r/netflix/comments/1irh528/whats_a_show_you_randomly_started_watching_on/"
    },
    {
        "id": "1isc2ag",
        "author": "Moonlightbeaming",
        "title": "American Murder: Gabby Petito + The Family Next Door",
        "content": "After watching both of these documentaries it's so eerieing the similarities of these two cases.\n\nTo start off: Both Gabby and Shannan had the same similarities of posting the \"happy life\" to social media. \n\nThe families are also similar as well.\nWith Chris Watts his family was the same narcissistic way as their son. Especially the mother. Blaming Shannan for everything. With Gabby, Brian’s mom is also narcissistic. In the same aspect as Brian. Both sons were narcissistic same as their mothers. \n\nThe body cams/story. In both body cams both Brian and Chris have that same smiley expression. They also both blamed the other party on wrong doing. Brian convinced the cops that Gabby was also being the aggressor. With Chris during the start he blamed Shannan stating they were fighting and she could of left with the kids. Also made the story convincing by her \"leaving the ring behind.\" During the interrogation Chris also claimed Shannan was choking one of the daughters and that's what \"made him\" kill Shannan.\n\nI just wanted to state this information because I started noticing the similarities when I saw the Brian body cam happened on August 12 2021. Chris murdered his family August 13 2018. \n\nIf there is anything else that is worth sharing please comment below! I'm sure there is a lot more similarities than my findings! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1isc2ag/american_murder_gabby_petito_the_family_next_door/"
    },
    {
        "id": "1isgav3",
        "author": "dont_frek_out",
        "title": "Downside to cancelling and restarting",
        "content": "I have a standard ad-free plan which I've had for a very long time. Due to less interesting content and price increases I want to cancel my account and restart it within 10 months to save money (but preserve watch history . I spoke to a friend and he said my plan has additional benefits grandfathered (old rules are extended) in and to not cancel. From what I can tell nothing is grandfathered  for standard plans and my friend is wrong.\n\nCan someone confirm?\n\nAlso do memberships still immediately restart if one logins it? Or do you need to explicitly enable restarting? It could be useful to check watching history, etc. during the cancelled time.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isgav3/downside_to_cancelling_and_restarting/"
    },
    {
        "id": "1isg8k4",
        "author": "Sweet-Solid4614",
        "title": "Another price increase? 😭",
        "content": "I finally did it after being a Netflix member since 2006. I closed my account. When I closed my account I noticed it was charging me for an extra person because I have two TV's and Netflix on my phone. The basic plan only allows for two devices. Going to get Apple TV and Peacock for about the same price as my cancelled Netflix account. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isg8k4/another_price_increase/"
    },
    {
        "id": "1irgsx6",
        "author": "Worldpeacee007",
        "title": "Official Discussion - American Murder: Gabby Petito",
        "content": "Crazy to think we are now in the era of tik Tok murder docs. Seeing victims document much of their lives in 4k adds a whole other heartbreaking element to these kinds of series and stories. I am only one episode in, but I thought this would be an interesting place to discuss the series.\n\nEdit: I have finished the series and I can say I went through pretty much every emotion while watching this-mostly anger and sadness. Gabby was such a beautiful soul. Feels like we all know someone like her.\n\n It's truly a shame so many people find themselves stuck in relationships with manipulative abusers. It was like Gabby couldn't wrap her mind around leaving him. Even in her final text message, she tells her mom that they aren't breaking up. It's almost like some people feel like if they break up with their partner, they consider *themselves* a failure. Just a really sad and devastating story. Watching the vlog outtakes of them made me so uncomfortable. It makes you think about how the internet is truly a facade.",
        "upvotes": 239,
        "comments": 864,
        "media": null,
        "permalink": "/r/netflix/comments/1irgsx6/official_discussion_american_murder_gabby_petito/"
    },
    {
        "id": "1isg50e",
        "author": "sidderr",
        "title": "Netflix randomly starts a Chinese show",
        "content": "Yesterday I’ve booted up the Netflix app on my TV and it completely skipped the profile selection part and instantly played a Chinese show without any subtitles.. When I went back I only saw a black screen, I had to force restart the app to make it work. I live in The Netherlands FYI. \n\nThis is the second time this happened, can anybody tell me what’s going on? 🙃",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isg50e/netflix_randomly_starts_a_chinese_show/"
    },
    {
        "id": "1isfi0v",
        "author": "MicroglialAndTheGut",
        "title": "iPhone 11 download quality suddenly poor",
        "content": "I recently noticed my downloads for everything on my iPhone 11 is low quality and looking at the size of the files it is very small (before it use to be around 600MB+ for an hour-ish long episode). My settings seem to be correct as well and downloads were completely fine before. When I stream episodes the quality seems much better and likely HD. Does anyone else have this issue now? Are there any solutions?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isfi0v/iphone_11_download_quality_suddenly_poor/"
    },
    {
        "id": "1is8qxa",
        "author": "S4v1r1enCh0r4k",
        "title": "K-Drama 'Boyfriend on Demand' Moves to Netflix, Starring BLACKPINK’s Jisoo &amp; Seo In Guk, releasing in 2026",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is8qxa/kdrama_boyfriend_on_demand_moves_to_netflix/"
    },
    {
        "id": "1is2fik",
        "author": "ThinkBlink3",
        "title": "Cassandra: so much potential, so little substance",
        "content": "Well obviously spoilers ahead so read at your own risk.\n\nCassandra as a show promises so much with its premise. The movie and TV space has produced some excellent work with the whole \"AI gone rogue\" as a topic (read: Ex Machina) but Cassandra is one of those that doesn't live up to the hype it creates and can definitely be skipped.\n\nFirst of all, it features some of the dumbest side characters (Samira's family) who genuinely made my blood boil as I was watching this. I get that you need to push the story ahead but definitely not at the cost of making your characters 50 IQ. Juno doesn't tell anyone Cassandra told her where the gun is despite it almost getting her expelled. Fynn doesn't mention what his boyfriend said to him about Cassandra till it's too late and David is honestly so unlikeable and dumb, that already makes this a difficult watch.\n\nThe story starts okay, peaks around episode 4 and doesn't make any coherent sense from that point. The plot twist is not only there for the sake of it but is somehow still extremely predictable. The ending far too rushed, even for a 6 episode series. The whole plot with Samira's sister feels so badly forced in, that I had to skip past most of it in the later episodes to get to the end.\n\nSpent my weekend watching this and retrospectively I could have spent it staring at a painting and come out more content.\n\n1.5/5\n",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1is2fik/cassandra_so_much_potential_so_little_substance/"
    },
    {
        "id": "1irmoed",
        "author": "quietdepths",
        "title": "American Murder : Gabby Petito Netflix",
        "content": "I just finished watching the Netflix series about this and omg how sad and shocking. These documentaries really put me off relationships these days and make me so skeptical about how people truly are and just what we see online. \n\nIt’s very true that sometimes the people that seem the happiest online are often the saddest sometimes and with the most skeletons. I personally know many couples who would constantly post how in love they are and suddenly the very next day decide to divorce. And others who never post about one another but live a very happy and quiet life.\n\nAnyway this whole case was so sad and she seemed like such a bright and bubbly girl. One thing though, I need the caveat before I say it is that I’m not blaming her parents but just I know if it were me in that situation and I had said those things to my parents about him they absolutely would expect me to come back to them and would not be happy about me continuing. I know everyone has different parenting styles but me coming from an Asian family - they wouldn’t be ok with some of the things the parents already knew.\n\nThat guy seemed really creepy but it’s the kind of creepy that isn’t obvious which makes it more scary and I do wonder just how involved their parents were. None of this matters anymore I guess, sadly she’s dead and I just hope everyone (men and women) are all careful of the kind of people they get involved with. It’s a scary world out there and relationships don’t seem to be what they were. Not saying everyone is a killer, just that…. I think it’s really hard these days ",
        "upvotes": 58,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1irmoed/american_murder_gabby_petito_netflix/"
    },
    {
        "id": "1is3pde",
        "author": "Jazzlike_Custard_242",
        "title": "Mo season 2 autism representation",
        "content": "I have no words.\n\nIt’s been a very long time since I watched a show and been this emotional.\n\nI have a cousin with autism and this show just represents it so good. I was brought to tears by Sameer’s first therapy session in the new season of Mo. The actors the script everything was done amazingly. Hearing Sameer’s dialogue was truly touching.\n\nSeason 2 is so much better done than first season, as it explores the other characters more rather than focusing in on Mo alone. Really good job to everyone involved in it, I would totally recommend other people to watch it.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is3pde/mo_season_2_autism_representation/"
    },
    {
        "id": "1irnhth",
        "author": "TheTabOfficial",
        "title": "What's a Netflix show that you're glad you stuck with?",
        "content": "Sometimes you've really got to trust the process to understand why everyone is raving about a show, because the first episode or two might not hook you straight away. Which show or shows surprised you?",
        "upvotes": 35,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1irnhth/whats_a_netflix_show_that_youre_glad_you_stuck/"
    },
    {
        "id": "1isa8jh",
        "author": "catwang897",
        "title": "Any good conspiracy thriller series to recommend?",
        "content": "I've been enjoying netflix series like the Punisher, shooter and night agent but I can't seem to find any other series which are as good as the ones I've mentioned. Would be great if anyone can give me some good recommendations.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1isa8jh/any_good_conspiracy_thriller_series_to_recommend/"
    },
    {
        "id": "1is9z56",
        "author": "alienstagesua",
        "title": "Blue eye samurai, Vinland Saga and the theme of revenge",
        "content": "- spoilers for vinland saga btw \n\nI mean Blue Eye Samurai is centred around revenge and if you’ve seen Vinland Saga you know that at first it is displayed as a revenge kind of story.However after the first season &amp; first few books of Vinland Saga, you would know that it teaches that revenge is essentially a never ending cycle kind of making revenge seem pointless aswell the show putting great emphasis on topics such as pacifism.\n\nIdk if it’s just me but does anyone have a feeling that the same thing will happen in blue eye samurai like if Mizu confronts her father she won’t actually kill him? or she wouldn’t be able to like in Vinland Saga.Basically having the same lesson as Vinland Saga- that fighting gets you nowhere.\n\n(off topic) Or like when Mizu confronts her father it’s not who she expects it to be at all.Like idk maybe her mother was the parent that was white so she may not want to kill her because in her eyes it was always a man and with the way men and women are portrayed in the show, it would show even more reason for her to hate men in general than women? As the show does highlight a lot of struggles women go through in that time period so she may empathise with her mother.\n\nidk if this was talked about before if you’ve said any of this sorry!!! 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is9z56/blue_eye_samurai_vinland_saga_and_the_theme_of/"
    },
    {
        "id": "1irmst1",
        "author": "AnActualWizardIRL",
        "title": "Can I turn off the game nonsense?",
        "content": "This is becoming a useability issue. The first page is all ads for daft mobile games I 100% have no interest in. There must be a way to say \"No thanks Netflix, just show me the shows?\". How would I achieve this? I just dont have the patience for this nonsense and its getting harder to work out what new content is available. ",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irmst1/can_i_turn_off_the_game_nonsense/"
    },
    {
        "id": "1is8qfb",
        "author": "OkNeighborhood5839",
        "title": "Did you ever buy a chill set from ign store ?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1is8qfb/did_you_ever_buy_a_chill_set_from_ign_store/"
    },
    {
        "id": "1is89tb",
        "author": "creature04",
        "title": "Back in action",
        "content": "Enjoyed the Jamie/Cameron team up, but my God did the song choice for the first two fights just ruin it for me. Im more invested in the fight scenes in action movies more then anything and when they are bad or the music they choose is horrid it just kills the movie for me. I was real excited for Cameron Diaz and Jamie fox team up, but the movie is very basic.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is89tb/back_in_action/"
    },
    {
        "id": "1is1deq",
        "author": "user74839267583",
        "title": "Binge watch",
        "content": "Shows to binge watch? I can’t seem to find one I like. Here are my favorites:\nOne tree hill \nDesperate housewives \nFriday night lights \nDead to me \nThe fosters ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1is1deq/binge_watch/"
    },
    {
        "id": "1is33nu",
        "author": "frawtlopp",
        "title": "Netflix flicker ONLY in fullscreen and ONLY when HDR is turned OFF",
        "content": "TV is TCL Roku Smart TV, no HDR setting available on it.\nPC is custom AMD/Nvidia build running Windows 11/\n\nThis is EXCLUSIVE to Netflix. It does not happen with YouTube, it does not happen with VLC, Disney, Plex etc.\n\n- If I exit full screen with HDR OFF, the flickering stops entirely.\n- If I enter full screen with HDR OFF, the flickering starts.\n- If I enable HDR via Windows Settings, the flickering stops completely in Netflix in fullscreen.\n\nThe issue is that HDR is bright as hell for me even with my TV set to the darkest setting.\n\nI have tried disabling Chrome hardware acceleration, it didnt work. \n\nThis is not a hardware issue and it is not related to software.\n\nThis is a Netflix issue because it doesnt happen ANYWHERE ELSE.\n\nAny advice? PLEASE. This is driving me insane.\n\nEdit: Some adjustments",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is33nu/netflix_flicker_only_in_fullscreen_and_only_when/"
    },
    {
        "id": "1is65jt",
        "author": "DullCourt5937",
        "title": "Help",
        "content": "I was trying to play Netflix dead cells and then an error pop up and idk how to fix it can someone help me fix it the error code is.    NPGStatusCode -1000 MSL_FAILED_TO_CREATE_CLIENT_ON_APPBOOT",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is65jt/help/"
    }
]