[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1if4333",
        "author": "EthanWilliams_TG",
        "title": "The Duffer Brothers Are Working on Two New Series for Netflix After 'Stranger Things'",
        "content": "",
        "upvotes": 110,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1if4333/the_duffer_brothers_are_working_on_two_new_series/"
    },
    {
        "id": "1iep9ta",
        "author": "johnppd",
        "title": "‘The Sandman’ Canceled at Netflix, Will End With Season 2",
        "content": "",
        "upvotes": 652,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1iep9ta/the_sandman_canceled_at_netflix_will_end_with/"
    },
    {
        "id": "1if8iz7",
        "author": "EthanWilliams_TG",
        "title": "Casting Is Officially Underway for Greta Gerwig's Netflix 'Narnia' Movie Series",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1if8iz7/casting_is_officially_underway_for_greta_gerwigs/"
    },
    {
        "id": "1iew5w6",
        "author": "Solokid87",
        "title": "The ending of American Primeval did an amazing job. What do you think?",
        "content": "(SPOILERS AHEAD)\n\nThe way American Primeval wrapped up was straight-up poetic. The Mormons taking over Utah showed just how ruthless power grabs were back then . Ironically the same kind of evil that was forced onto them when their religion first started. Jim Bridger giving up his fortress really drove home the idea that every man has a price. Sometimes even the strongest can be swayed. The Natives gave up their right to peace with the whites just to keep Abish safe, only for Jacob to be the one who killed her. That was brutal. And Isaac’s last act, getting Devin and Sarah to safety was a heartbreaking parallel to what he couldn’t do for his own wife and son. The worst part? That’s exactly what got him killed. Every story came full circle in a way that felt raw, tragic, and strangely perfect. I give it a 9.6",
        "upvotes": 49,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1iew5w6/the_ending_of_american_primeval_did_an_amazing/"
    },
    {
        "id": "1ieubgn",
        "author": "Forsaken_Yoghurt_136",
        "title": "I’m tired. WHERE IS ALL OF US ARE DEAD?",
        "content": "3 grueling YEARS waiting for an update!!! WHERE/ WHO TF DID HAM-RA JUMP TO?!?! IS CHEONG-SAN ALIVE?? IS THERE GOING TO BE ANOTHER OUTBREk?!?! I NEED ANSWERS NETFLIX!!!!!",
        "upvotes": 48,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ieubgn/im_tired_where_is_all_of_us_are_dead/"
    },
    {
        "id": "1if90r7",
        "author": "JoshyKuroiRaion",
        "title": "'Kaos' question",
        "content": "Was there any news/leaks or literally anything on what the script was for S2. I've just binged the whole series in one go and found out it's been cancelled. \n\nIt's unlikely but I know before scripts/notes for cancelled projects has been released before, Really really hoping I get just a small taste of what S2 would've given us!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1if90r7/kaos_question/"
    },
    {
        "id": "1if7ru3",
        "author": "peoplemagazine",
        "title": "A Major West Wing Reunion Is Coming to The Diplomat — See First Look Photos",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1if7ru3/a_major_west_wing_reunion_is_coming_to_the/"
    },
    {
        "id": "1iefc2y",
        "author": "Robemilak",
        "title": "'Squid Game' Reigns Supreme with Another Week with 4+ Billion Minutes Streamed",
        "content": "",
        "upvotes": 268,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1iefc2y/squid_game_reigns_supreme_with_another_week_with/"
    },
    {
        "id": "1ieuui1",
        "author": "molecular_gerbil",
        "title": "Spaceman (Adam Sandler)",
        "content": "What are your thoughts on Spaceman starring Adam Sandler. I found myself getting deep into the movie. I think Adam did a great job portraying Jakub and the story itself was great. ",
        "upvotes": 28,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ieuui1/spaceman_adam_sandler/"
    },
    {
        "id": "1ieel7a",
        "author": "Legitimate_Ad3625",
        "title": "\"Anime Is Not Prepared\": 'Devil May Cry' Is Ready to Become Netflix's Next Castlevania",
        "content": "",
        "upvotes": 189,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ieel7a/anime_is_not_prepared_devil_may_cry_is_ready_to/"
    },
    {
        "id": "1if284h",
        "author": "MrWolfy25",
        "title": "Is lucifer gone off Netflix in Australia?",
        "content": "Is lucifer gone off Netflix in Australia? now that it is February the 1st it doesn't show up when I search for it and I had my profile as lucifer but that was set to the default pfp. I looked online and everywhere says it's still on there but there out of date so I'm asking you guys",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1if284h/is_lucifer_gone_off_netflix_in_australia/"
    },
    {
        "id": "1if6zfs",
        "author": "abhilash512",
        "title": "WWE 2K Mobile Launching on Netflix Games in Fall 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1if6zfs/wwe_2k_mobile_launching_on_netflix_games_in_fall/"
    },
    {
        "id": "1if2ivq",
        "author": "winter_breezee",
        "title": "Screen black but still laying sound and subtitles",
        "content": "Hello all, \n\nI am logged into Netflix on Chrome on my Mac.\n\nI switched windows to take a screenshot of something, and when I returned to Netflix the screen was black, but still playing audio and subtitles. I understand that Netflix turns black when you try to take a screenshot, however it is stuck and I can't get it back to normal. \n\nI've tried refreshing, restarting, logging out and back in, logging into a new chrome user and clearing cache. \n\nAny suggestions would be greatly appreciated, I'm really invested in completing the last season of Bojack Horseman. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1if2ivq/screen_black_but_still_laying_sound_and_subtitles/"
    },
    {
        "id": "1iesvdw",
        "author": "Basis-Resident",
        "title": "Mo S2 Landed Beautifully",
        "content": "Mo’s second season was absolutely beautiful. What did everyone think? They had to do a whole lot with just one season and I think they fit a lot in perfectly but I just want more! I so wish we had more time with these characters and stories. I would have loved more time with Mo’s brother Sameer delving deeper into his autism diagnosis and I also would have loved more depth on Mo’s sister and her relationship with her mother. The trip to Palestine episode was heartbreaking and I could have done a whole season there as well. I really just love this cast and love the writing. Does anyone know how viewership is faring? Does anyone think there’s any chance the show could be extended for a third season? Curious as to what rationale went into renewing for a second and final season from Netflix (unless this decision came from Mo)! ",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iesvdw/mo_s2_landed_beautifully/"
    },
    {
        "id": "1if50fh",
        "author": "SpyFxx",
        "title": "Netflix not sending mobile number code",
        "content": "Lately I've been trying to verify my phone number on Netflix, but whenever I put the number in, Netflix just doesn't send the code even when I try resending it... I live in Czechia, is there a SMS traffic problem or something? Has anyone got a solution for this? Thanks a lot",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1if50fh/netflix_not_sending_mobile_number_code/"
    },
    {
        "id": "1ie72ob",
        "author": "DawgBloo",
        "title": "First look at ‘DEATH BY LIGHTNING’, starring Michael Shannon as President James Garfield and Matthew Macfadyen as the man who would kill him.",
        "content": "Also starring Nick Offerman as Chester Arthur and Betty Gilpin as Lucretia Garfield. \n\nCreated by Mike Makowsky and Executive Produced by David Benioff, D.B. Weiss, and Bernie Caulfield.",
        "upvotes": 217,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ie72ob/first_look_at_death_by_lightning_starring_michael/"
    },
    {
        "id": "1if34df",
        "author": "pippoken",
        "title": "The Signal makes no sense",
        "content": "I just watched it and I honestly can't understand any of the characters' actions and motivations (except maybe the government). \n\nWarning: lots of spoilers from here on. \n\nThe two astronauts on the ISS, got a strange message on the radio and immediately jump to the conclusion that it's 100% aliens. Zero doubts, zero questions asked. \n\nThe mother's goal could have been achieved 100% by doing absolutely nothing. Shut your mouth, get home sit on your ass and wait! Don't tell the guy that has been been working behind your back for months, don't inform the powerful billionaire that bankrolled the whole mission that you know she had betrayed you. \nWhy did she have to go through all that mess? Just to get her husband and daughter to be there when it happens? \n\nWhat is the billionaire aiming to achieve? Have it all for herself? Fine, disappear the 2 astronauts, but did she really have no other option that to kill 178 people?! Why have the husband and girl killed? Or, why not kill the assistant instead, that's one hell of a loose end. \n\nAnd also, you spent hundreds of millions for the mission but get your astronauts fly economy??!! No private jet? Not even business class?! \n\nI'm so upset I wasted 4 hours on this pile of garbage. \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1if34df/the_signal_makes_no_sense/"
    },
    {
        "id": "1if5tb4",
        "author": "Mka955",
        "title": "Netflix household explanation",
        "content": "Me and my sister are living in different houses.\nIf one watches through the TV and the second through a media box I assume there will be a problem.\nIf my sister bring the box once in a month in my home in order to connect it to the wifi is it OK?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1if5tb4/netflix_household_explanation/"
    },
    {
        "id": "1ieov6z",
        "author": "aeryghal",
        "title": "The Recruit - Season 2",
        "content": "I don't want to get into details in order to avoid spoilers, but I absolutely loved it.  I was wary after what a disappointment S2 of Night Agent was, but S2 of The Recruit delivered.  It got a bit ridiculous at the end, but it was fun. Definitely worth a watch if you enjoyed S1.",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ieov6z/the_recruit_season_2/"
    },
    {
        "id": "1ieze8k",
        "author": "Mundane_Inspector195",
        "title": "Does anyone remember watching sexy short films on Netflix? They were old and short sorry don’t have more info.",
        "content": "I remember there was a series or collection of sexy short films on Netflix a long time ago. The videos looked old. I remember one was about a couple going to the sea and having sex on the shore. There were a few other short films in that collection. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieze8k/does_anyone_remember_watching_sexy_short_films_on/"
    },
    {
        "id": "1ieqcoy",
        "author": "RRexzi",
        "title": "Scariest movie you watched?",
        "content": "Hi! Last time i started watching a lot of scary movies. I watched: \"Ritual\" \"Apostole\" \"Creep 2\" \"Incantation\" and few others. I really recommend Ritual it was suspenseful and scary. I want to watch more movies but i dont know what to watch.  So can u comment some scary movies? I will appreciate it. ",
        "upvotes": 4,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ieqcoy/scariest_movie_you_watched/"
    },
    {
        "id": "1ieu79e",
        "author": "pupsandqueers",
        "title": "Dumbest/Funniest Movies on Netflix in the US",
        "content": "Trying to have a movie night with a friend and we wanna watch something dumb, but the kind of dumb you can make fun of. We’ve had plans to watch Hot Frosty, but it’s well after Christmas now (still not opposed to it, though). Are there any others in that same vein that aren’t Christmas movies?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ieu79e/dumbestfunniest_movies_on_netflix_in_the_us/"
    },
    {
        "id": "1ie3d9h",
        "author": "darkestdepeths",
        "title": "Stranger Things 5 creators liken final season to '8 blockbuster movies,' tease franchise future",
        "content": "",
        "upvotes": 113,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1ie3d9h/stranger_things_5_creators_liken_final_season_to/"
    },
    {
        "id": "1iedgkh",
        "author": "reenzy",
        "title": "What’s your thoughts on Mo season 2?? (without spoiling)",
        "content": "I love it, I binge watched 5 episodes today lol. I found the plot lines/plot twists more wild than the ones in S1 which was a big part of why I got hooked. \n\nI really enjoy watching the show overall since it gets pretty deep, is hella funny, and v relatable since I’m Palestinian American. ",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iedgkh/whats_your_thoughts_on_mo_season_2_without/"
    },
    {
        "id": "1iewgq3",
        "author": "MonkeyAfroX",
        "title": "The Daily Life of the Immortal King: Does anyone know where to find or is able to send me the original version of season 1 episode 10? The 28m version one.",
        "content": "It's the version before it got replaced with the current one listed everywhere. It used to be listed as episode 16 iirc. Even in the episode when they do the little rewind you can see clips from the original version with the villains back story and such. It should be around 28 minutes long if the information I read was correct. I can't seem to find a site that has it so if anyone can point me to one or just send me a chat to a link or something that would be very much appreciated, thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iewgq3/the_daily_life_of_the_immortal_king_does_anyone/"
    },
    {
        "id": "1ievpji",
        "author": "WinterGiraffe1984",
        "title": "Netflix App on Mac",
        "content": "Why is the only streaming service with an app on mac Prime Video? It’s annoying that I’m essentially restricted to what prime has to offer if I want to watch anything on a bigger screen during a flight. Does anyone know if Netflix, or any service for that matter, has any plans of introducing a mac app? Or does anyone know a way to still download Netflix movies for offline on a mac?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ievpji/netflix_app_on_mac/"
    },
    {
        "id": "1iepupr",
        "author": "ImpactOtherwise6723",
        "title": "Yellowstone",
        "content": "I’m in the UK and Yellowstone seasons 1-4 released yesterday. How likely is it that season 5 will be available to watch on Netflix sometime in the future? I’m not for paying another subscription to watch the last season. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iepupr/yellowstone/"
    },
    {
        "id": "1if0j0h",
        "author": "mrzayev",
        "title": "Cancellation",
        "content": "hello, i cancelled my membership 1 day late. but the money could not be charged from my card as i did not have enough money in it. will i still be charged in future days if i put money in my card? the mail that i was sent said that i can still use the account till 28 february.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1if0j0h/cancellation/"
    },
    {
        "id": "1ieu4tz",
        "author": "SoundFunny",
        "title": "Video Playback issues",
        "content": "Anyone else recently having issues with video playback on netflix. All of a sudden it will just freeze on a frame and no amount of restarting my tv fixes it. And then all of a sudden it works again. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieu4tz/video_playback_issues/"
    },
    {
        "id": "1if70ga",
        "author": "AnalWarfare",
        "title": "How can I search Netflix and not be spammed by Korean stuff and anime.",
        "content": "I mean, it's getting ridiculous. I watch Squid Game once and all I see is Korean shows and weeby anime.\n\nI don't like them, they are not good, please f'ing stop.\n\nIf I want to read subtitles, I'll read a book.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1if70ga/how_can_i_search_netflix_and_not_be_spammed_by/"
    }
]