[
    {
        "id": "1od94ht",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A’ - Juventus U19 | UEFA Youth League, League Phase, Matchday 3",
        "content": "#FT: JUVENIL A 1:0 JUVENTUS U19\n\n&amp;#x200B;\n\n#UEFA YOUTH LEAGUE \n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n1:0 Liberto Navascués 13'\n\nRed card: Antonio Merola (Juventus) 86'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n9' - mediocre shot by Izan from the edge of the box, it gets blocked and lands right in front of Yáñez in the box, who needs to score from a good position, but his shot is weak and the keeper can parry it away \n\n⚽ 13' - GOLLL DEL JUVENIL A - Corner from the left, the ball bounces off of a Juve player and lands in front of Liberto, who acts quickly and pokes it past the keeper for an early lead! \n\n24' - simple play by Juvenil A, Barroso gets the ball with his back turned to goal and plays through Fortea - he is through on goal all by himself, but doesn't have the pace to pull through and the defender catches up on him before he can shoot \n\n36' - corner taken short, Yáñez puts in the cross onto Rivas' head, and his header hits the bar! Then, the ball comes to Izan at the edge of the box, who curls a shot nicely to the top left corner, but the keeper anticipates well and catches it \n\n40' - incredible clearance on the line by Izan - nice cross towards the far post, where the Juve player is ready to tap it over the line, but Izan, while falling, somehow manages to put his foot between the ball and the goal and blocks it for a corner\n\n45'+1 - huge chance for Carlos Díez after a failed offside trap by Juve, but he falls over as he shoots and the ball rolls harmlessly wide \n\nHT - very dominant first half by our U19s, who had Juventus pinned to their box throughout the majority of the half. The first goal came rather quickly compared to what we are used to in UYL, but since then the team had a significant number of opportunities to increase the lead that they sadly didn't take. Apart from a single short phase around minute 40, Juventus were not able to maintain some possession in our half\n\n46' - 2nd half underway \n\n59' - Juvenil A now dominating even harder, but not able to find the second goal so far. After a great team play, Liberto's cross finds the head of Barroso, but his header goes just over the bar, the keeper would've been left without a chance\n\n🔄 60' - first sub, Adri Pérez on for Yáñez\n\n🔄 66' - Beto comes on for Pol Durán \n\n🔄 67' - and Gabri Valero comes on for Liberto, who can't continue with a shoulder injury after a dirty and unnecessary shoulder barge by a Juve player\n\n🔄 81' - Jacobo and Gascón come on for Barroso and Carlos Díez \n\n85' - Juve's U19s are a really dirty team, wow... All they do is foul in this match \n\n🟥 87' - red card for Juve's Merola for hitting Fortea in the face on the ground. Disgraceful team with disgraceful players \n\nFT - an end to a game in which the team should've put this match to bed way earlier, wasting countless long phases of possession and counter attacks at the end without finally scoring the 2-0. Still, the 1-0 was enough because Juve failed to create a single chance in the second half, being more focused on kicking and punching the shit out of our players, which sadly led to an injury to Liberto Navascués, who has his shoulder wrapped and immobilised with what could be a dislocation. Julian López de Lerma's team is still flawless in UYL with 3/3 wins and also in all competitions with 8/8 wins this season, they are well on track to qualifying for the knockout rounds, currently sitting 5th in the table\n\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee:** Łukasz Kuźma (POL) \n\n**Competition:** UEFA Youth League, League Phase, Matchday 3\n\n**Viewing options:** [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-4-3):** Javi Navarro - Álvaro Lezcano, Ariel Nkoghe, Mario Rivas, Jesús Fortea - Izan Regueira, Carlos Díez (81' Ignacio Gascón), Pol Durán (66' Diego Martínez 'Beto') - Liberto Navascués (67' Gabri Valero), Jaime Barroso (81' Jacobo Ortega), Dani Yáñez (60' Adri Pérez)\n\nBench: Álvaro González (GK), Javi Bailón, Joan Martínez, Bruno Galassi. \n\nCoach: Julián López de Lerma\n",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wUOMl6hwPl_tsdwHAtAtno0xMvZE8h1UdSt0wFAsSbg.jpeg?auto=webp&amp;s=da678670992586a213164525827e56adb279d53a"
        },
        "permalink": "/r/realmadrid/comments/1od94ht/match_thread_real_madrid_juvenil_a_juventus_u19/"
    },
    {
        "id": "1oc23pv",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 1169,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc23pv/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1od3hgx",
        "author": "No-Independent2522",
        "title": "Santiago Bernabéu Stadium to honor Lucas Vázquez with a tifo (vs Juventus) that reminds of the player when he was a child in the stands.  The tifo is inspired by a photo of Lucas as a child watching a team match.",
        "content": "",
        "upvotes": 1043,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ttl7q1nsmwf1.jpeg?auto=webp&amp;s=1c5f7632f7c22b4061b4da2d02946fc8874fcc77"
        },
        "permalink": "/r/realmadrid/comments/1od3hgx/santiago_bernabéu_stadium_to_honor_lucas_vázquez/"
    },
    {
        "id": "1od2vwy",
        "author": "vil727",
        "title": "Kylian Mbappé has scored in EVERY game SINCE SEPTEMBER.",
        "content": "",
        "upvotes": 290,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od2vwy/kylian_mbappé_has_scored_in_every_game_since/"
    },
    {
        "id": "1od6k6h",
        "author": "No-Independent2522",
        "title": "[TheAthletic] Real Madrid’s mentality worries put extra pressure on Xabi Alonso",
        "content": "After Real Madrid’s 5-2 defeat by Atletico Madrid back in September, stern words were shared among the first-team group.\n\nSources who witnessed this, speaking anonymously to protect their position like others consulted for this article, say there was a frank exchange between players, with particular criticism aimed at junior members of the squad over their attitude and application in the build-up.\n\nIt was the first major test of this new squad, and they badly failed it.\n\nSince then, Madrid have managed to get things back on track. They are two points clear of Barcelona in La Liga. They have registered two wins from two in the Champions League so far. But, in truth, they haven’t been significantly tested.\n\nFor that reason there is concern that, as Xabi Alonso’s side enters a difficult run that includes games against Juventus, Barcelona and Liverpool over the next two weeks, issues over leadership and the team’s mentality may surface again, with another mis-step likely to add significant pressure on the manager.\n\nOne club source likened the situation around Alonso right now to a player in danger of receiving a yellow card, with the match only just having started.\n\nTo understand why Madrid have these concerns, we need to look back a little.\n\nBetween 2014 and 2024, Madrid celebrated six Champions League titles, an unprecedented number that leaves their total number of European Cup wins at 15. The closest team to them, Milan, have won it seven times.\n\nMadrid’s squad did not stay the same over that decade, far from it. Key players came and went, managers were hired and fired. But there was still a strong sense of continuity: Toni Kroos and Lucas Vazquez won five of those six titles. Luka Modric, Dani Carvajal and Nacho were there for each one.\n\nCarvajal, 33, is the only of that group still at Madrid today. He is the club’s current longest-serving player, and therefore its captain (as is policy at the Santiago Bernabeu). Thibaut Courtois is the same age but he has not been at Madrid as long — Federico Valverde, 27, is vice-captain.\n\nAfter that Champions League title in 2024, three influential senior players left. Kroos retired. Nacho joined Al Qadsiah in Saudi Arabia. Joselu — who was only at Madrid a year but was still a big voice in the dressing room — left for Al Gharafa in Qatar.\n\nLast summer, two more departed: Modric is now at Milan and Vazquez is with Bayer Leverkusen in Germany.\n\nThe presence of senior players was always an important factor for Carlo Ancelotti during his second spell at the club from 2021 to 2025, a period in which they won the Champions League twice, as well as two La Liga titles and the Spanish Cup.\n\nAt Madrid, there is an unwritten rule that players over the age of 30 are only offered one-season contract extensions, with these proposals often only coming close to the end of the campaign.\n\nWhenever the club asked Ancelotti for his opinion on these renewals, the Italian was always in favour of keeping the veterans. It was a footballing issue first and foremost, but also an environmental one.\n\nTowards the end of the 2023-2024 season, a source involved in the day-to-day running of Real Madrid considered it “essential” that at least one of Modric (who ended up renewing) and Kroos (who decided to retire) stayed. This year, the situation was described in the same way when there were doubts about the continuity of Modric again and it looked like Vazquez might depart.\n\n“If they both leave this is going to be very difficult,” the source said. “It’s not a technical issue, but rather one of atmosphere. If Carvajal is left alone, he’ll explode within a month.”\n\nNeither Modric nor Vazquez were renewed, despite concerns developing over the dressing room atmosphere last term, and that apparent worry over Carvajal.\n\nOver 2024-25, Madrid went from having (according to staff sources at the time) “the best dressing room” in the previous season to one with more ego and friction. The fact the campaign ended without a trophy did not help.\n\nIt got to the point that one first-team player told The Athletic in May: “Let’s see if Xabi dares to enter this madhouse.”\n\nHe did indeed. Alonso’s arrival was seen by Madrid not only as a way to improve the team’s play and results, but also to improve the day-to-day functioning of the dressing room.\n\nSources familiar with the situation say that Alonso found “a dressing room with many bad habits”. The Basque coach has been working on creating a new culture, asking for key elements such as punctuality, and high intensity in training sessions.\n\n“They’ve gone from having a coach who was hardly involved in training sessions (Ancelotti) to one who seems like just another player,” a person close to a first-team player said.\n\nMadrid’s squad still has its senior figures, but there is definitely a sense that they do not possess as many leaders as they once did.\n\nThis summer, along with new manager Alonso came five reinforcements. Academy striker Gonzalo Garcia was promoted to the first team, Dean Huijsen joined from Bournemouth, Trent Alexander-Arnold from Liverpool, Franco Mastantuono from River Plate and Alvaro Carreras from Benfica. The average age of these signings was under 22.\n\nHuijsen, although he started positively, has made several much-commented mistakes in recent weeks. Sources say he has been specifically asked to improve his concentration in order to develop his great potential.\n\nMeanwhile, even though Alexander-Arnold was, at 27, the most experienced of those summer arrivals, he is described around the club as someone who will need more time to adapt, as he still seems shy.\n\nThis term, Kylian Mbappe is one of the players who has stepped up, although he is described more as a leader in matches than on a day-to-day basis, where he does not reach the level of Cristiano Ronaldo’s well-documented ego and hunger.\n\nDespite the noise that has surrounded Valverde in recent weeks, the Uruguayan is noted as a leader through the daily example of his work ethic, while Aurelien Tchouameni, signed in 2022, is also seen as heading in the right direction.\n\nHowever, there are others who need to fill the void left by the departed veterans, such as Jude Bellingham.\n\nAlonso and his staff feel that now is the best time to pull together, to reap the rewards of all their hard work and changes. They point out that they have only made one mistake, against Atletico, but that it caused such a stir that it brought back memories of the heavy defeat by Paris Saint-Germain in the Club World Cup semi-final in July (which Madrid lost 4-0).\n\nAnother mis-step in the big games ahead would call into question the credibility of the project, complicate the run-up to Christmas, and leave Madrid with real pressure to win the Spanish Super Cup in January, where they face Atletico in the semi-finals with Athletic Club and Barcelona to contest the other.\n\nFirst up it’s Juve in the Champions League, followed by the small matter of El Clasico on Sunday.",
        "upvotes": 114,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9kaf07rtvxszAspyx6itip10NDK823Mf6iyHxrziPeE.jpeg?auto=webp&amp;s=b989f23ef2208130aae79a7c810735e2734148b9"
        },
        "permalink": "/r/realmadrid/comments/1od6k6h/theathletic_real_madrids_mentality_worries_put/"
    },
    {
        "id": "1od3sis",
        "author": "Plane_Outside5646",
        "title": "Xabi please....Find our strongest 11 ASAP.",
        "content": "Rotations are good. We should do it in league matches. But just find out best 11 ASAP. We have a lot of games coming up.\nIf trent and huijson are fit, I believe this is our best 11. \nAnd just the win elclassico, psg game and atletico game are understandable but we need to trash barca this time after what they did to us last year.",
        "upvotes": 107,
        "comments": 94,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od3sis/xabi_pleasefind_our_strongest_11_asap/"
    },
    {
        "id": "1od8psb",
        "author": "FrrancondonaEra",
        "title": "Chema Andrés 1.90 tall age 20, right footed CDM/CM DLP.",
        "content": "intelligent, solid decision making, good passing range, decent first touche, good game  reading and vision, tough psychically, skilled, positioning, can also play DLP. ",
        "upvotes": 40,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yld9uef61owf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1od8psb/chema_andrés_190_tall_age_20_right_footed_cdmcm/"
    },
    {
        "id": "1ocfxbw",
        "author": "Nyghl",
        "title": "Mbappé's been eating good with Arda",
        "content": "",
        "upvotes": 2180,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mjz9m880ghwf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ocfxbw/mbappés_been_eating_good_with_arda/"
    },
    {
        "id": "1od58q0",
        "author": "Foreign_Key_9550",
        "title": "I hope we show our level",
        "content": "We should defeat Juventus today; there is no excuse. The squad must elevate its performance and compete with greater consistency. While they are not at the level of PSG or Arsenal, but it might get us some confidence back if we win like 3-0.\n\nit would be disappointing if the match remains 1–1 until the 80th minute then scoring a shity goal.",
        "upvotes": 36,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od58q0/i_hope_we_show_our_level/"
    },
    {
        "id": "1od5yrj",
        "author": "Sl_PROXY",
        "title": "Our squad for the Juventus match",
        "content": "",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od5yrj/our_squad_for_the_juventus_match/"
    },
    {
        "id": "1ocndh4",
        "author": "No-Independent2522",
        "title": "The Villarreal-Barca Miami match has been cancelled",
        "content": "",
        "upvotes": 424,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OUM1_aEd0b4ptvhTjssBZOFWc6an3ho_hm3kM0SidYQ.jpeg?auto=webp&amp;s=71f0eec4f058faabb9a672364e3e393c8d905d2d"
        },
        "permalink": "/r/realmadrid/comments/1ocndh4/the_villarrealbarca_miami_match_has_been_cancelled/"
    },
    {
        "id": "1od9l3e",
        "author": "IcefoxX5",
        "title": "Real Madrid Juvenil A [1]-0 Juventus U19 - Liberto Navascués 13' | UEFA Youth League",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/moibx6bm9owf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1od9l3e/real_madrid_juvenil_a_10_juventus_u19_liberto/"
    },
    {
        "id": "1oct7cd",
        "author": "EndouShuuya",
        "title": "Arda Training, this guy is the best",
        "content": "",
        "upvotes": 165,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ddm6u0hszjwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oct7cd/arda_training_this_guy_is_the_best/"
    },
    {
        "id": "1och3xl",
        "author": "No-Independent2522",
        "title": "Dani Carvajal On Tebas",
        "content": "",
        "upvotes": 484,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hvpdc49dohwf1.jpeg?auto=webp&amp;s=b1822e2c127948bfb0b4e3206fc636ccf2c68f41"
        },
        "permalink": "/r/realmadrid/comments/1och3xl/dani_carvajal_on_tebas/"
    },
    {
        "id": "1occhya",
        "author": "No-Independent2522",
        "title": "Xabi on Arda: ”He’s a mix between Ozil and Guti. Guti had that quality to play in the build-up and for the final pass. Mesut too. I really enjoyed playing with Ozil. The more we find Arda, the better we get. We have to keep pushing him. We’re very happy with him”",
        "content": "",
        "upvotes": 730,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5mlBlRsTdMSWjUTwXB3lqX9UuojXRRJ56yvSshZmlp0.jpeg?auto=webp&amp;s=61c1066a29f14b28d9ae4b95ffd60e09ca6241d1"
        },
        "permalink": "/r/realmadrid/comments/1occhya/xabi_on_arda_hes_a_mix_between_ozil_and_guti_guti/"
    },
    {
        "id": "1odcinn",
        "author": "Gamu_03",
        "title": "Mi primara vez en el Bernabéu en noche magica de champions",
        "content": "Que tal amigos madridistas voy a ir esta noche al Bernabéu por primera vez. Espero que me puedan dar consejos de que no llevar y donde se vive el mejor ambiente antes del partido. Y si hay alguna quedada de la grada de animación o peña. Mi acceso es en la puerta 57. Así que algo cerca de allí seria excelente. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odcinn/mi_primara_vez_en_el_bernabéu_en_noche_magica_de/"
    },
    {
        "id": "1odcwgg",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 1-0 Getafe",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vzfkhbhlvowf1.png?auto=webp&amp;s=fc6d077dfb752b3db463bb69da72f7d03a5933dc"
        },
        "permalink": "/r/realmadrid/comments/1odcwgg/postmatch_survey_results_real_madrid_10_getafe/"
    },
    {
        "id": "1ocslia",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: Real Madrid vs Juventus, UCL Match 3",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ocslia)",
        "upvotes": 70,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ocslia/pre_match_thread_real_madrid_vs_juventus_ucl/"
    },
    {
        "id": "1ocghrk",
        "author": "OnlyAMuggle",
        "title": "Tomorrow Courtois will be playing his 300th match for us.",
        "content": "Time goes fast but hearing that Courtois will play his 300th game for us made me realize that we should embrace and enjoy every game and every second of that game.\n\nI don't think I'm the only one to say that Courtois is arguably the best goalkeeper in the clubs history.\n\nDon't get me wrong, I love Iker but Courtois is just a bit ahead.\n\nWhen I say we should enjoy every second of that game, I really mean that we should actually enjoy every second our team plays every game actually.\n\nI'm about to hit 54 and realize too well what time means.\n\nMy fellow Madridistas... Enjoy our team... Enjoy the moment... It will never come back.\n\nHala Madrid!",
        "upvotes": 257,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ocghrk/tomorrow_courtois_will_be_playing_his_300th_match/"
    },
    {
        "id": "1och7mv",
        "author": "No-Independent2522",
        "title": "Courtois on Tebas : Hiding the protests and trying to change the narrative is censorship and manipulation, I’m not surprised. [ Tebas] behaves like no other sports executive I’ve ever seen. His actions on social media and in public speak volumes.",
        "content": "",
        "upvotes": 232,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NrIDN9jmxTZFL8PSVAxv_W56q6ZZZrT2L5KWZjpt9KY.jpeg?auto=webp&amp;s=231dc5352c6e8e6e60008b9769d047dbb22aac80"
        },
        "permalink": "/r/realmadrid/comments/1och7mv/courtois_on_tebas_hiding_the_protests_and_trying/"
    },
    {
        "id": "1od6zm6",
        "author": "deez-nuts-are_nuts",
        "title": "Any ideas on which version I should get for this kit ?",
        "content": "",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od6zm6/any_ideas_on_which_version_i_should_get_for_this/"
    },
    {
        "id": "1ocanc8",
        "author": "Deezwend",
        "title": "Dreaming of this since UCL draws done",
        "content": "",
        "upvotes": 432,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1g85qsmcgwf1.jpeg?auto=webp&amp;s=982e21f7b50cfaab6bd1f9718c694af0c39edd93"
        },
        "permalink": "/r/realmadrid/comments/1ocanc8/dreaming_of_this_since_ucl_draws_done/"
    },
    {
        "id": "1oc7ayd",
        "author": "No-Independent2522",
        "title": "[Romano] Endrick, expected to leave Real Madrid on loan in January with talks already taking place.  The Brazilian wants to play more also ahead of World Cup 2026 and Real Madrid are understood to be open to a loan move for Endrick",
        "content": "",
        "upvotes": 458,
        "comments": 104,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc7ayd/romano_endrick_expected_to_leave_real_madrid_on/"
    },
    {
        "id": "1ocacp0",
        "author": "No-Independent2522",
        "title": "Alaba out for 7 to 10 days, will miss Clasico",
        "content": "",
        "upvotes": 175,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ocacp0/alaba_out_for_7_to_10_days_will_miss_clasico/"
    },
    {
        "id": "1ochspm",
        "author": "o6ohunter",
        "title": "What is everyone’s thoughts about Valverde as a captain?",
        "content": "We all of course love him as a candidate because of his work ethic, honor, and clear passion for the club, but some people feel as though he is too timid on the pitch. When conflicts arise such as Sunday vs Getafe, some say they want a captain who will get down and gritty to defend or speak up for his teammates. Say like a Ramos archetype. On that same topic, some might want the opposite out of a captain. Someone who sets the example of focusing purely on football and not drama. How do you guys feel?",
        "upvotes": 35,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ochspm/what_is_everyones_thoughts_about_valverde_as_a/"
    },
    {
        "id": "1oco9df",
        "author": "kasam-se",
        "title": "Real Marid vs Juventus - English Dub UCL Pre-Match Press Conference Xabi Alonso 2025",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BSM5CgNswCzChgZQFaKBg0WVFZHmzM-Sh-eqfWXiWGA.jpeg?auto=webp&amp;s=83b4268f3e56c090ac474136d2113a07c8f02238"
        },
        "permalink": "/r/realmadrid/comments/1oco9df/real_marid_vs_juventus_english_dub_ucl_prematch/"
    },
    {
        "id": "1ochf5h",
        "author": "Dental_wonder",
        "title": "About El clasico this week",
        "content": "Hi fellow Madridistas!\n\nI’ve booked a couple of nights in Madrid to celebrate my 30th birthday by watching El Clásico — hopefully with a Real Madrid victory at the Santiago Bernabéu as the perfect birthday gift! 🎉\n\nUnfortunately, I haven’t been able to secure a ticket yet, even after trying through the official website with my Madridista Premium membership.\n\nI’d be truly grateful for any advice or help in finding a ticket.\n(P.S. The Viagogo prices are sadly beyond my budget — are there any safer or more affordable alternatives?)\n\nThank you so much, and Hala Madrid!",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ochf5h/about_el_clasico_this_week/"
    },
    {
        "id": "1oc1dmv",
        "author": "FergieBall_FC",
        "title": "@statmusefc: Most chances created this season in Top 5 leagues: 25 – Nico Paz | 24 – Kylian Mbappé | 23 – Arda Güler | Two Madrid players and their future teammate.",
        "content": "Nico Paz = 4 goals and 4 assists in Serie A \n\nKylian Mbappé = 10 goals and 2 assists in La Liga \n\nArda Güler = 3 goals and 4 assists in La Liga ",
        "upvotes": 115,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc1dmv/statmusefc_most_chances_created_this_season_in/"
    },
    {
        "id": "1obwenh",
        "author": "EndouShuuya",
        "title": "INSIDE TRAINING⚔️VAMOOOOOOOSSSSSS!",
        "content": "",
        "upvotes": 198,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fn9qu5jvdcwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1obwenh/inside_trainingvamooooooossssss/"
    },
    {
        "id": "1obrdf8",
        "author": "No-Independent2522",
        "title": "Since joining Real Madrid (2018/19 season), no goalkeeper in the Top 5 European Leagues has surpassed Courtois's +52.2 prevented goals across all competitions (288 goals conceded, without own goals, when 340.2 were expected)",
        "content": "",
        "upvotes": 202,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1obrdf8/since_joining_real_madrid_201819_season_no/"
    }
]