[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 40,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q63mfd",
        "author": "Extension-Fall-4286",
        "title": "A House of Dynamite",
        "content": "WTF is up with the ending?!!! Who the hell writes a screenplay that shows the same story through several characters point of view and builds to the climax for each viewpoint and then just says “ Fuck it, roll credits….?!!!!” No answers, no decision being made…..nothing!! I understand the concept of leaving an ending open for interpretation by the audience, and as much as I hated the way The Sopranos ended, it was obvious that they were leaving their options open for sequels or whatever, but to just build, build, build to an ending from every point of view with absolutely zero closure or at the very least, a final decision by the President whether or not to even respond to an imminent nuclear bombing of Chicago???? DISAPPOINTING!!!!\n\nSorry, just finished the movie and screamed at the screen and needed to vent to the masses of Reddit. I should get my emotions in check 😂😂😂\n\nHope you all just chose to watch some stand up comedy tonight and go to bed with humor on your brain!! 💯 ",
        "upvotes": 25,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1q63mfd/a_house_of_dynamite/"
    },
    {
        "id": "1q5j88c",
        "author": "FarScheme4636",
        "title": "Run Away - Harlan Coban - TERRIBLE",
        "content": "DONT READ UNTIL YOUVE FINISHED IT\n\nSorry but I keep searching for people’s opinion’s on this show and it’s always mostly positive - I’m so confused!! This was one of this worst series. First of all, why was the daughter not a suspect for the police as she was the last person who saw him dead? There was also NO chemistry between the detectives and that sex storyline was so unnecessary?! Also why would they drag out the whole storyline just to say the daughter killed Aaron?   And then reveal it was the mum? Cornelius said that a few episodes ago too! Also the music.. the acting.. it was TERRIBLE. I don’t understand how people thought this was good? 60K for a dealer to tell james nesbitt that his daughter was seen on the bus… WHY did the detectives not find out that info from the missing persons report?!? Did they even bother looking for her?!? Honestly I’m raging. The whole show was STUPID!!! Plus why does everyone have a gun in the UK!!!!!!! The percentage of gun violence in the UK is 5%.. FIVE PERCENT\n\nAND ANOTHER THING WHY DID THE PARENTS GO TO THE DRUG DEN AND THE MUM GET HERSELF SHOT IF SHE KNEW WHERE THE DAUGHTER WAS AND WHO KILLED AARON… it makes NO SENSE!!!!!!!",
        "upvotes": 132,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1q5j88c/run_away_harlan_coban_terrible/"
    },
    {
        "id": "1q5ze9x",
        "author": "BlundeRuss",
        "title": "Spoiler: Run Away - why does Paige’s mum take her husband to the estate looking for Paige?!",
        "content": "She knows who killed Aaron and she knows where Paige is. Seems ridiculous to end up in a drug dealer’s basement getting shot for no reason. Have I missed something? ",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q5ze9x/spoiler_run_away_why_does_paiges_mum_take_her/"
    },
    {
        "id": "1q5z88u",
        "author": "jordanthebard",
        "title": "Weird wording in the new Seven Dials Trailer description on Youtube",
        "content": "I just watched the new Seven Dials trailer on YouTube. In the description, it begins with \"In this timeless mystery by the re-invented Queen of Crime.\" Now, I could understand if it said something like \"A re-invention of the Queen of Crime's classic mystery.\" But, a re-invention of the queen of crime? Like, do they think there was some Christie 2.0 running around, writing mysteries? Or is it more likely Netflix has pushed its copywriters to use AI to generate descriptions, and this is the result?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5z88u/weird_wording_in_the_new_seven_dials_trailer/"
    },
    {
        "id": "1q5x97p",
        "author": "TheyCallMeBullet",
        "title": "In the Harlan Corbin series, Run Away, in episode 7 in the log cabin",
        "content": "“What’s Miss Marple here told him” that scene was filmed at the edge of Marple, is this an  unintentional Easter egg or coincidence? What are the odds they reference a detective while also filming in Marple/Marple Bridge",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5x97p/in_the_harlan_corbin_series_run_away_in_episode_7/"
    },
    {
        "id": "1q695aq",
        "author": "Brilliant_Salad2377",
        "title": "I can't watch Pokemon Horizons T2 in Latin Spanish, it just shows Spanish from Spain",
        "content": "So, I'm trying to watch Pokemon Horizons T2 on Netflix and I'm trying to watch it on Latin Spanish (I'm from Argentina) but on the audio settings there's no \"Spanish\" just \"Spanish (Spain)\" I remember not long ago watching it on Netflix and being on Latin Spanish, and the problem only shows on pokemon Horizons T2, because I'm also watching death note and is showing on Latin Spanish with no problems, but not pokemon, does someone know how to fix it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q695aq/i_cant_watch_pokemon_horizons_t2_in_latin_spanish/"
    },
    {
        "id": "1q612n3",
        "author": "Timewilltell755",
        "title": "I just couldn’t with the first episode of Run Away. Is it worth it?",
        "content": "\nFirst let’s talk about stupid decisions.  They have a daughter at home and a son in college but decide to go right to the crime scene and down to some hidden tunnel to meet a drug dealer to ask about there drug addicted daughter and risk getting killed?   In most cases you just don’t go visit a drug dealer and let them know you know he is a drug dealer and not get shot.    \n\nAnd on a shallow note all the flashback clips are annoying.  ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q612n3/i_just_couldnt_with_the_first_episode_of_run_away/"
    },
    {
        "id": "1q64jtn",
        "author": "barenecessities9",
        "title": "Payment problem",
        "content": "Okay so I’ve read a couple of threads and this seems to be a problem that hasn’t been fixed for years but there has be a way around it right? Just last month, Netflix stopped accepting my Visa Credit card payment out of the blue. I’ve called my bank several times to confirm that I have e commerce and international transactions on the card and what do you know? Everything’s on and running smoothly and I have no issues using the card on any other platform. Ive rechecked my details on the card a thousand times and theyre all correct. Ive checked my card’s expiration date blah blah blah and it’s not expired yet. I’ve spoken to at least 10 Netflix agents via Customer support and they keep telling me that it’s a general error and to just try another payment method. The problem is I only use this card and have no other payment options besides Apple Pay, but Netflix has decided to stop accepting Apple Pay payment which leaves me with nothing. I thought canceling my subscription and retrying the card would do the trick but it only left me with the error message of “Sorry we can’t accept blah blah try again another time” over and over. What do I do at this point? I can’t use any other accounts since they cracked down on password sharing. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q64jtn/payment_problem/"
    },
    {
        "id": "1q648ch",
        "author": "Glass-Sea9665",
        "title": "What is the best show on Netflix I should be watching?",
        "content": "I’ve watched some shows on Netflix, the best ones were definitely Breaking Bad, Prison break, Power etc…I saw a couple of episodes of Ozark but didn’t continue. At the moment I got on my list Vikings, Ozark, Peaky Blinders, Bloodline, Dexter, Top boy..\nI don’t know which one to pick, so I would need some recommendations ",
        "upvotes": 0,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1q648ch/what_is_the_best_show_on_netflix_i_should_be/"
    },
    {
        "id": "1q5r5fa",
        "author": "DifferentEditor7200",
        "title": "What show next?",
        "content": "What show should I watch next? To give an idea of what I like; I just finished Stranger Things. I really enjoyed American Horror Story and a show on MGM+ called From. I’m into more thriller-esque shows or horror. I was also a fan of Sweet Tooth and Beef.\n",
        "upvotes": 3,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1q5r5fa/what_show_next/"
    },
    {
        "id": "1q60nrw",
        "author": "Vast-Ad2954",
        "title": "Fim da Era: Grandes Marcas de TV Perdem Suporte ao App da Netflix em 2026",
        "content": "Moiô pra quem tem TVs de 2016 ou mais velhas ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q60nrw/fim_da_era_grandes_marcas_de_tv_perdem_suporte_ao/"
    },
    {
        "id": "1q574ut",
        "author": "Book24_",
        "title": "Did I miss the point of Adolescence?",
        "content": "I believe that Adolescence was a great TV show. However I just think it was too short and that the conclusion was underwhelming. I feel like they should’ve given us the trial at least. I definitely missed the point and I want help better understanding the plot and the message.\n\nEdit: Thank you to everyone who helped me to understand the message. I have a clearer understanding of it now.",
        "upvotes": 47,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1q574ut/did_i_miss_the_point_of_adolescence/"
    },
    {
        "id": "1q63ic9",
        "author": "Accomplished_File860",
        "title": "WHAT IS NETFLIX POSTING ON IG?? (I'm talking about the story of the doors)",
        "content": "Okay I was going through my stories and theres a picture of an open door with the netflix spam account tagged and I'm like a conformitygate hoper for stranger things so I was like oh huh maybe the door from the last episode is being reopened??? but then theres a closed door and now I'm violently confused and would love for someone less brain dead and whos a better critical thinker to tell me I'm just missing something and it's for something completely different. However, if you want to hype me up, I won't complain either.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q63ic9/what_is_netflix_posting_on_ig_im_talking_about/"
    },
    {
        "id": "1q5xsso",
        "author": "chimpingtonKP",
        "title": "In Runaway, why did Sam Greene use Ingrid’s phone to transfer £8,000?",
        "content": "Overall really enjoyed this series, it’s just this one detail that is sticking out to me. I could’ve easily missed something, but I can’t seem to piece together what that scene was all about?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q5xsso/in_runaway_why_did_sam_greene_use_ingrids_phone/"
    },
    {
        "id": "1q5e120",
        "author": "denbrough",
        "title": "Just finished Harlan Coben’s Run Away and have one serious question (spoiler alert!)",
        "content": "Where is the goddamn Henry?\nI think I watched it very carefully, but twist after twist after twist - and still no Henry till the very end. Poor guy and his father!",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q5e120/just_finished_harlan_cobens_run_away_and_have_one/"
    },
    {
        "id": "1q5wfpb",
        "author": "Jonny96A",
        "title": "Query",
        "content": "So I currently upgraded to a bigger 4k TV and was wondering if upgrading to Netflix premium would be worth it or if I should stick with my current plan of standard without ads. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q5wfpb/query/"
    },
    {
        "id": "1q5cwsu",
        "author": "foo337",
        "title": "Netflix Kingdoms",
        "content": "Is the singular best zombie media I have ever consumed and I’ve consumed everything I can get my grubby paws on that has zombies. It did so many things that I’ve been wanting from any zombie show for decades when it comes to the pacing and showing instead of telling of the plague outbreak and spread. I could write several thousands of characters but I’ll keep it short and just say the show absolutely slaps and does everything I wanted correctly if not better ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q5cwsu/netflix_kingdoms/"
    },
    {
        "id": "1q4zly0",
        "author": "forevony_0904",
        "title": "Run away ~Harlen Coban",
        "content": "I have a question about this show. So im up to the last 3 eps but im so confused about Anya. Paige's sister. Why is it that sometimes shes in a wheelchair and other times shes not. Like she legit ran up to their dad and hugged him ine night. Then the next day shes riding in her wheelchair again. Her legs looked fine to loke skip up n jump in her dads arms. Like. Did I miss something. What's the story there. \n\nLoving this show so far. Just super confused is all",
        "upvotes": 54,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1q4zly0/run_away_harlen_coban/"
    },
    {
        "id": "1q54qbf",
        "author": "Interesting_Rush570",
        "title": "RIPLEY",
        "content": "  Netflix’s *Ripley* is a great thriller that leans hard into mood, restraint, and slow-burn suspense. The story unfolds patiently, trusting atmosphere over exposition, and it pays off. Every frame feels deliberate. The black-and-white photography is stunning, turning light, shadow, and negative space into tools of tension. Italy isn’t presented as a postcard; it’s cool, distant, and quietly menacing, perfectly matching Tom Ripley’s inner life.\n\nAndrew Scott’s performance is controlled and unsettling, never asking for sympathy yet constantly holding your attention. The suspense doesn’t come from action but from watching small lies calcify into something dangerous. Long silences, lingering shots, and precise editing create unease without ever announcing it.\n\nThe setting, from cramped interiors to vast coastal spaces, reinforces the feeling of isolation and moral drift. *Ripley* is elegant, cold, and hypnotic—a series that rewards patience and leaves a chill long after the final scene fades to black, with quiet confidence and precision",
        "upvotes": 27,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1q54qbf/ripley/"
    },
    {
        "id": "1q5r26m",
        "author": "LilNello1",
        "title": "Ben Affleck Interview On New Movie, The Rip, on Jimmy Kimmel Live!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5r26m/ben_affleck_interview_on_new_movie_the_rip_on/"
    },
    {
        "id": "1q69dje",
        "author": "better_med_than_dead",
        "title": "Netflix forcing me to ¯\\_(ツ)_/¯",
        "content": "I've finally had enough of their invasive \"security\", preventing me from accessing my account endlessly. \n\nTheir desperate and insanely annoying attempts to prevent unauthorized views just resulted in this paying customer canceling their account, to download their programs via other means.\n\nThe irony is beautiful, and let's face it - 98% of their programming is trash anyway.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q69dje/netflix_forcing_me_to_ツ/"
    },
    {
        "id": "1q52zxf",
        "author": "thepurplethorn",
        "title": "Members Only: Palm Beach .. the F class of Palm Beach society",
        "content": "But what a blast that was, my guilty pleasure. You will downvote me to death but I actually liked this show. I was never a fan of Real Housewives or those types if reality shows, so cringe, but this one I actually enjoyed a bit. Maybe because I live in South FL and could relate to a lot of the scenery.\n\nWigs, tacky dresses, cellulite, fake boobs, saggy skin and bickering aside some of these characters were actually entertaining and funny. \n\nMaria , although annoyingly emotional narcissist, was hilarious. \n\nThe self proclaimed Grande Damme Gale was hilarious too, and I could see that she must’ve been a very beautiful woman when she was young.\n\nRosalyn was also an interesting character, she must’ve worked very hard to be the prim and proper soft spoken princess, but I can see from a mile away she just wanna party and dance on tables ",
        "upvotes": 24,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1q52zxf/members_only_palm_beach_the_f_class_of_palm_beach/"
    },
    {
        "id": "1q5oyis",
        "author": "Nanaof8girls",
        "title": "Connection trouble",
        "content": "I’m wondering if anyone has connection problem with Netflix and knows what to do!? I used to have Spectrum and then changed to Verizon. Nothing is any better. I have other streaming channels and have zero problems, only with Netflix. I will be watching a show and will get kicked off back to Home Screen, when starting a show and even during it, it will stop and start spinning - so frustrating. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5oyis/connection_trouble/"
    },
    {
        "id": "1q4ykfd",
        "author": "Orangeandjasmine777",
        "title": "Harlan Coben new series Run Away",
        "content": "Pleasantly surprised and really enjoyed Run Away. It was gripping. From the first episode, all the way. \nJames Nesbitt is truly fab! So is Minnie Driver but unfortunately she's not in it much. \nWhat are your thoughts? \n",
        "upvotes": 39,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1q4ykfd/harlan_coben_new_series_run_away/"
    },
    {
        "id": "1q66x9c",
        "author": "CalebOnPoint",
        "title": "Can we all agree that streaming movies with limited theatrical release?",
        "content": "... sucks ass? I mean I get that some people on Reddit say they like watching movies at home because it's \"convenient\" b/c they have to get up to pee so much, and they say they can't afford a box of popcorn (which honestly sounds stupid IMO). 😂😂😂 Not trying to be that guy but common ... why are we even having this debate anymore? Movies belong in THEATERS first, streaming second. Streaming is TV. Always has been always will be. That's not to say TV isn't good, but it's bad when it's the only option we have. And actors and directors will say the same thing if you asked them\n\nSorry if that hurts but the reality is that's a fact. Movies are better in theaters than television. Teddy Saranwrap should just throw in the towel and admit that's what the people want 😂😂😂😂 Maybe not the best place to say this but I'm sure many of you agree with me",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1q66x9c/can_we_all_agree_that_streaming_movies_with/"
    },
    {
        "id": "1q62rs4",
        "author": "DiscoStuTalkin2You",
        "title": "WWE on Netflix is unwatchable on mobile data",
        "content": "I have the data setting turned on “maximum data” and it still looks like crap. But if I turn to a 20+min TV series, or even a 2hr movie then it’s fine.\n\nFigure it out soon. WWE is already borderline unwatchable these years and now you’re having all these issues still not worked out since the beginning. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q62rs4/wwe_on_netflix_is_unwatchable_on_mobile_data/"
    },
    {
        "id": "1q5cg1f",
        "author": "Loud-Effort958",
        "title": "Shows like man on inside",
        "content": "Are there any that are similar or others that you liked \n\nI couldn’t get into the good place but liked nobody wants this\n\nI guess I like comedy light hearted heartfelt family type ",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q5cg1f/shows_like_man_on_inside/"
    },
    {
        "id": "1q56ns2",
        "author": "Global_Research_9335",
        "title": "Netflix ad tier disables Picture in Picture on iPhone Air",
        "content": "Posting this so others don’t waste time troubleshooting. On iPhone with Dynamic Island and iOS Picture in Picture enabled, the Netflix ad supported tier does not allow Picture in Picture, background playback, or Dynamic Island playback.\n\nAs soon as you swipe up to leave the app, playback pauses immediately and then fully stops. No PiP window appears. It feels like a bug, but *Netflix support confirmed this is intentional on the ad tier so ads remain full screen*.\n\nThis restriction is not clearly disclosed in the app. If Picture in Picture matters to you on iPhone, the Netflix ad tier is not worth it.",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q56ns2/netflix_ad_tier_disables_picture_in_picture_on/"
    }
]