[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1otdj0w",
        "author": "Top-Analysis-887",
        "title": "“È stato l'appuntamento più folle e romantico di sempre”: sospesi nel vuoto a 85 metri di altezza in cima alla Mole Antonelliana!",
        "content": "Kasia Smutniak e Domenico Procacci sospesi a 85 metri d'altezza, lo scatto sulla Mole Antonelliana! La fotografia inaugura la mostra “Piano sequenza. La Mole”, dal 12 novembre 2025 al 1 marzo 2026 alle Gallerie d’Italia di Torino, in occasione dei 25 anni del Museo Nazionale del Cinema. Voi ci andrete?",
        "upvotes": 10,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g9acd4l5kf0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1otdj0w/è_stato_lappuntamento_più_folle_e_romantico_di/"
    },
    {
        "id": "1ot88qf",
        "author": "Kernel_907",
        "title": "Se ci sei batti un colpo",
        "content": "Ciao a tutti, Torinesi e/o Torinesi adottati. Sono arrivata da poco e miei amici storici sono sparsi per il mondo... Comincio a sentire un po' la solitudine, c'e qualcuno nella mia stessa imbarazzante condizione che avrebbe voglia di un caffè random e qualche chiacchiera, oppure participare insieme a eventi/giochi, escursioni, random boh? Sembra ci sia molta gente qua che lamenta la stessa cosa, magari ci si puó dare una mano a vicenda! \nA bit of info about me: \nF37 , adoro natura ed aria aperta, sport, yoga, gochi da tavolo, parlare a vanvera di filosofia, psicologia, misteri criminali irrisolti, ridere molto, enigmi, escape room, sto andando a caso ora mi viene in mente questo. \nE non ho il dono della sintesi, come è facile capire da questo post.\nQuindi.. non abbiate paura dite amico ed entrate (cit) 🪷",
        "upvotes": 28,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1ot88qf/se_ci_sei_batti_un_colpo/"
    },
    {
        "id": "1otcb6c",
        "author": "Bennyjoys",
        "title": "Posti buoni dove mangiare la Polenta a Torino?",
        "content": "Oggi è il mio ultimo giorno qui, sono venuta a trovare un’amica e vorrei mangiare la polenta. Dove posso mangiarla buona? Preferirei in zona San Salvario ma mi sposto un po’ se necessario",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1otcb6c/posti_buoni_dove_mangiare_la_polenta_a_torino/"
    },
    {
        "id": "1oteq1x",
        "author": "Ok_Swordfish_5870",
        "title": "matrimonio con rito civile - tempistiche?",
        "content": "Ciao a tutt\\*!   \nIo e la mia fidanzata stiamo organizzando il nostro matrimonio per il prossimo autunno con rito civile in comune. \n\nSul sito del comune dicono che fino alle pubblicazioni (180 giorni prima, quindi per noi a Marzo) non è possibile sapere se la data per la celebrazione del matrimonio è disponibile oppure no. \n\nNoi abbiamo però già fissato la location del ricevimento e vorremmo fare tutto lo stesso giorno: è possibile che non possiamo avere la sicurezza della data fino a marzo?\n\nQualcuno che ha già fatto questa procedura può aiutarmi a capire? Come avete fatto ad organizzarvi? \n\nGrazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oteq1x/matrimonio_con_rito_civile_tempistiche/"
    },
    {
        "id": "1ossliv",
        "author": "nebbiainbluejeans",
        "title": "Rugby Italia vs Sudafrica Allianz",
        "content": "Ciao, per stare in mezzo ai tifosi italiani all'Allianz per Italia vs Sudafrica quali sono le zone? (i posti ancora disponibili sono in foto)  \nSapete se faranno delle navette e da dove? Ci sono siti/pagine per restare aggiornati?\n\n  \nGrazie.",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/azl6agfsaa0g1.png?auto=webp&amp;s=768599f4b105902243187bf0716dd23943dbccf0"
        },
        "permalink": "/r/torino/comments/1ossliv/rugby_italia_vs_sudafrica_allianz/"
    },
    {
        "id": "1ot281n",
        "author": "sturmfrey",
        "title": "Activities or sports?",
        "content": "Ciao a tutti. Sono uno studente di polito e ho davvero bisogno di uscire di casa oltre ad andare a fare poli e studiare.\nAmo lo sport. Badminton, tennis tavolo, arti marziali, nuoto, atletica, ho fatto tutto ma all'improvviso sono arrivato qui e tutto si è fermato.\nIl fatto è che è costoso prendere lezioni o entrare in squadra e non ho amici con cui giocare né posti/attrezzature per giocare.\n\nQuali attività o sport posso fare? Gratis o a buon mercato?!\n\nSono molto interessato a imparare il tennis e ad entrare nel tennis, ma di nuovo è troppo costoso seguire un corso o persino affittare un campo.\nVolevo provare a nuotare, ma i costi sono di nuovo.\nVolevo provare a andare in bici ma ho fatto un'idea.\n\nSono solo perso e ho davvero bisogno di una guida. Grazie mille!! \n\n\n\nENG:\n\nCiaoo tutti. I'm a student at polito and I reallyy need to get out of the house apart from going to poli and study. \nI love sports. Badminton, table tennis, martial arts, swimming, athletics, I did it all but suddenly I came here and everything stopped. \nThe thing is it is expensive to take lessons or get in teams and I dont have friends to play with nor places/equipment to play.\n\nSo what activities or sports can I do? For free or cheap?!\n\nI am really interested in learning tennis and getting into it but again it's soo expensive to take a course or even rent a court.\nI wanted to try swimming but the costs again.\nI wanted to try biking but idk.\n\nI am just lost and really need guidance. Thank you so much!!\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ot281n/activities_or_sports/"
    },
    {
        "id": "1oskyx9",
        "author": "SafeZookeepergame573",
        "title": "Ciclofficine che si occupano di bici vintage?",
        "content": "Ciao a tutti, conoscete una ciclofficina che si occupa di bici vintage, che ne capisca e che sia appassionato di queste bici?\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oskyx9/ciclofficine_che_si_occupano_di_bici_vintage/"
    },
    {
        "id": "1osys0b",
        "author": "ExpensiveCarrot7026",
        "title": "Can anyone give reviews on WINS international school",
        "content": "Hey yall, I may be going to this school in future, and they have turned off their reviews, so has anyone gone there and can give their opinions on the school. Im an english speaker btw but learning italian",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1osys0b/can_anyone_give_reviews_on_wins_international/"
    },
    {
        "id": "1oshrsm",
        "author": "Zero3993",
        "title": "Scoppio o esplosione zona piazza Bernini CIT Turin?",
        "content": "Stanotte ho sentito uno scoppio zona piazza Bernini, CIT Turin . Sapete o avete sentito niente ?",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oshrsm/scoppio_o_esplosione_zona_piazza_bernini_cit_turin/"
    },
    {
        "id": "1oshycy",
        "author": "Interesting_Disk_926",
        "title": "Study space recommendations in Turin (coffee shops/libraries)",
        "content": "Hi, I am a student at Campus Enaudi and I am looking for study space recommendations in Turin (better if its near Campus Enaudi or Center).\n\nIt would be great if the place is a library or a cafe with a cozy atmosphere, plug points and food.\n\nI am so thankful if you can help me, I am far behind in my studies. Thank you",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oshycy/study_space_recommendations_in_turin_coffee/"
    },
    {
        "id": "1osoow4",
        "author": "Potential_Pick3644",
        "title": "lavatrice rotta rip",
        "content": "conoscete qualche tecnico di lavatrici che non prende un rene? Per fortuna la mia funziona ancora ma non gira il cestello (ho cercato tutorial online ma ho paura di peggiorare la situa)\ngrazie anime pie ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1osoow4/lavatrice_rotta_rip/"
    },
    {
        "id": "1oso3xr",
        "author": "Witty_Raisin9289",
        "title": "Inquiry about computer science master's program .",
        "content": "Hello, I am interested in pursuing a Master’s in Computer Science and would like to know if the University of Turin offers this program in English , because after doing some researches i found out that its only in italian .\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oso3xr/inquiry_about_computer_science_masters_program/"
    },
    {
        "id": "1osj0rg",
        "author": "quelarion",
        "title": "Pasticceria che serva torronata a San Salvario?",
        "content": "Anni fa ho passato un paio di settimane a Torino e ricordo di aver mangiato un'ottima torronata in una pasticceria a San Salvario, probabilmente lungo via Nizza. Mi piacerebbe ritrovarla, o trovare una valida alternativa. Qualcuno ha suggerimenti?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1osj0rg/pasticceria_che_serva_torronata_a_san_salvario/"
    },
    {
        "id": "1orx6be",
        "author": "Adventurous_Camp9970",
        "title": "Vaccino immunoterapia a Torino per cancro cane",
        "content": "Spero vada bene come post da mettere qui.\n\nHo pensato di postarlo qua perché l'oncologa veterinaria mi ha parlato di questo vaccino che viene fatto solo a Torino e sarebbe un'immunoterapia ancora in fase sperimentale ma che é giá stata utilizzata con successo in molti casi e sembra funzionare. Il mio  cane ha un melanoma orale.\n\n Ma ancora non mi ha dato molte informazioni perché aspetto il risultato della tac per capire poi cosa fare. Comunque per ora non sembra ci siano metastasi.\n\n\n\nImmagino che padroni di animali che vivono a Torino hanno sicuramente più  esperienze in prima persona perciò ho pensato di chiedere qui e chissà, qualcuno che legge magari ci é passato o conosce qualcuno che ci é passato, o semplicemente sa dirmi qualcosa.\n\nMi é stato consigliato di fare prima la chirurgia per togliere parte di mandibola (sempre se i risultati tac lo consentono)  e poi questo vaccino. E in caso pure chemio. Io bho sono un po' restia sulla chirurgia. Chiederò anche all'oncologa alla prossima visita se avrebbe senso fare questo vaccino e basta. E quindi spostarmi a Torino ogni volta necessario.\n\n\n\nRipeto spero sia corretto come post da inserire qui altrimenti lo tolgo. ringrazio in anticipo",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1orx6be/vaccino_immunoterapia_a_torino_per_cancro_cane/"
    },
    {
        "id": "1orssyr",
        "author": "Hamad_01",
        "title": "i need to find a house",
        "content": "bro im arriving on the 27th nov and I NEED HELP ive been calling a hundred numbers from idealista immobiliare and soloaffiti and theyre all saying its rented and the other listings are either scams or above 800 euros with a lot of other fees like the condominium which i have to pay by the month and a deposit of 1k euros💀 i dont know why the listings r still there and then say its rented like wtf remove it ",
        "upvotes": 8,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1orssyr/i_need_to_find_a_house/"
    },
    {
        "id": "1orqxqt",
        "author": "DiscountPrincess26",
        "title": "conoscenze a torino",
        "content": "Ciao a tutti!\nMi sono trasferita da poco a Torino per l’università e sto ancora cercando di ambientarmi. La città mi piace un sacco, però sto facendo un po’ fatica a conoscere gente nuova. Ho provato a essere socievole (in uni, a qualche evento ecc.), ma per ora non è scattata nessuna vera amicizia. A volte mi sento un po’ sola e mi piacerebbe trovare persone con cui uscire o anche solo fare due chiacchiere. Avete qualche consiglio su come conoscere gente qui a Torino? O gruppi/attività per studenti che consigliate?\nGrazie in anticipo",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1orqxqt/conoscenze_a_torino/"
    },
    {
        "id": "1orvofn",
        "author": "_L_-",
        "title": "Se oggi vince il Toro dove si festeggia?",
        "content": "",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1orvofn/se_oggi_vince_il_toro_dove_si_festeggia/"
    },
    {
        "id": "1orlvi5",
        "author": "WonderfulTitle958",
        "title": "Birrerie a Torino",
        "content": "Ciao, mi sapreste consigliare delle buone birrerie a Torino? Grazie!",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1orlvi5/birrerie_a_torino/"
    },
    {
        "id": "1ork20h",
        "author": "Embarrassed-East-408",
        "title": "Pallavolo amateur?",
        "content": "Ciao, sono una ragazza (27anni) e sono appena arrivata a Torino, vorrei trovare un gruppo amatoriale di pallavolo... giocavo da adolescente e ora qualche anno fa non più.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ork20h/pallavolo_amateur/"
    },
    {
        "id": "1orinox",
        "author": "Huathuathuat888",
        "title": "Fined on Tram 11",
        "content": "Hi there, need some advice. I was on board the busy tram 4 and paid via the Tap and Go but the system did not capture the payment and I was issued a ticket, with my ID details taken down by a lady who said she's the inspector. She wanted me to pay 37 Euros on the spot which I didn't trust. What will happen if I leave Italy without paying the fine? I am a tourist by the way. First day here and had the unpleasant experience with the stressful crowd and system.\n\nUpdate: I just found out that the \"machine\" which I tapped into was a \"ticket reader\" instead of the \"Tap and Go\". \n\nAny possibility of appeal against this genuine error? I was issued with \"sprovvisto di titolo di viaggio\"\n",
        "upvotes": 5,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1orinox/fined_on_tram_11/"
    },
    {
        "id": "1ormeco",
        "author": "Crux001",
        "title": "Info teatro concordia concerto DJ Premier",
        "content": "Sarò al concerto di Dj Premier e Alchemist al teatro concordia il 7 dicembre.\n\nConsigli su che cosa fare dopo il concerto? A Venaria Reale ci sono locali oppure bisogna per forza andare in centro a Torino?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ormeco/info_teatro_concordia_concerto_dj_premier/"
    },
    {
        "id": "1or5kot",
        "author": "DirectInteraction825",
        "title": "Posti/associazioni per tornare a suonare",
        "content": "Buonasera a tutti, \n\nmi sono trasferito a Torino qualche mese fa, e ora che mi sono stabilito vorrei tornare a suonare il sassofono, come facevo nella città in cui ero prima. \n\nNon posso farlo a casa perché ho le pareti di carta, per cui mi rivolgo a voi per qualche consiglio su eventuali associazioni di natura bandistica in cui andare a suonare. \n\nPer esempio nella città dove vivevo, avevo una prova a settimana, e un paio di volte all’anno il concerto.\n\nVi ringrazio!",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1or5kot/postiassociazioni_per_tornare_a_suonare/"
    },
    {
        "id": "1or3ecb",
        "author": "SkytechMC",
        "title": "Quanto è sicuro prendere il 4 ad Emilia di sera?",
        "content": "Nei prossimi giorni dovrò finire le lezioni poco prima delle 19, e dovrò prendere i mezzi pubblici per andare fino a Porta Nuova.\nIl punto più vicino alla mia scuola per prendere un mezzo pubblico è Emilia, dove passa il 4.\nQuella fermata lì, in quegli orari, è sicura? O rischio di avere brutte esperienze? \nIn caso rispondeste di sì, quali altre alternative ci sarebbero per andare a P.N.? ",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1or3ecb/quanto_è_sicuro_prendere_il_4_ad_emilia_di_sera/"
    },
    {
        "id": "1or50y1",
        "author": "jinkxiepop",
        "title": "AAA all you can eat CERCASI",
        "content": "sono nuova a torino, potreste consigliarmi un buon sushi ayce?\n\nsono già andata a un paio ma mi sono sembrati mediocri. sono consapevole che la qualità all'ayce sia sicuramente inferiore rispetto al sushi alla carta, ma magari ci sono alcuni ristoranti con una qualità e una varietà leggermente superiore.\n\n",
        "upvotes": 4,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1or50y1/aaa_all_you_can_eat_cercasi/"
    },
    {
        "id": "1or5nfn",
        "author": "Severe-Concern5185",
        "title": "Recommendations for restaurants and cafés in Turin",
        "content": "Hey everyone!\nI’m visiting Turin for the second time — mainly to watch the Juventus - Torino game but also to enjoy the city a bit.\nI’d love some recommendations for good local restaurants (not too touristy) and nice cafés to relax in.\nPreferably around the city center or near the stadium.\n\nThanks in advance for any tips!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1or5nfn/recommendations_for_restaurants_and_cafés_in_turin/"
    },
    {
        "id": "1oqv4tw",
        "author": "DistributinOfWealth",
        "title": "Com'è la vita in questa zona?",
        "content": "https://preview.redd.it/udajfsdkcuzf1.png?width=730&amp;format=png&amp;auto=webp&amp;s=80757b05ca6de89982da7ab738cfcbe0ce1e997f\n\nAvviamo trovato una casa con la mia moglie ma è vuota e in questa area, Via Goffredo; come sarà?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1oqv4tw/comè_la_vita_in_questa_zona/"
    },
    {
        "id": "1oqs430",
        "author": "Tornadoms",
        "title": "Esistono Kaiten sushi a Torino?",
        "content": "Sushi sul rullo trasportatore  ",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1oqs430/esistono_kaiten_sushi_a_torino/"
    },
    {
        "id": "1oquxe4",
        "author": "Lorenzo_Cion",
        "title": "Collaborazione per Film e Video Games",
        "content": "Ciao a tutti!\n\n🎶Sono un Musicista, Compositore e Sound Designer di Torino. 🎓Ho la Laurea in Chitarra Classica ed ho studiato due anni presso la Scuola Internazionale Comics (corso di \"Composizione e Produzione Musicale per TV, Film e Videogames\"). \n\nCerco collaborazioni con realtà presenti sia sul territorio che fuori (come Registi o Game Developers), facciamo rete!😄\n\n(Partita IVA)\n\n\n\n🇬🇧Hi everyone!\n\n🎶 I'm a Musician, Composer and Sound Designer from Turin, Italy. 🎓I graduated in classical guitar at the “G. Verdi” Conservatory of Turin, then I completed a course of “Music Composition for Film, TV and Videogame” at the Comics International School. \n\nI'm looking for collaboration with Film Makers or Game Developers, let's build a Team!😄\n\n(Freelance)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oquxe4/collaborazione_per_film_e_video_games/"
    }
]