[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qrdfop",
        "author": "phillygirllovesbagel",
        "title": "Catherine O'Hara Dead at 71",
        "content": "",
        "upvotes": 1388,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1qrdfop/catherine_ohara_dead_at_71/"
    },
    {
        "id": "1qrip4p",
        "author": "Pawssabillitysawait",
        "title": "The end of the F***ing world.",
        "content": "I think this is one of my absolute all time netflix favs, and the second season is actually arguably better than the first, which is rare for television shows in my opinion. I never hear anyone talk about it, but i highly recommend it to everyone. It is amazing if you like coming of age/teen shows, that have a more serious theme.",
        "upvotes": 72,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qrip4p/the_end_of_the_fing_world/"
    },
    {
        "id": "1qs2cec",
        "author": "7856356",
        "title": "I don’t think I can continue Tell Me Lies after season 2",
        "content": "I just binge watched Tell Me Lies seasons 1 and 2 over the last two days, and I honestly don’t know how to process what I’m feeling right now.\nBy the end of season 2, I felt physically sick. Like genuinely nauseous, sweating, head pounding, stomach turning. I’ve never had a show affect me like this before. It wasn’t just “wow that was intense”, it felt disgusting, suffocating, and overwhelming in a way I can’t even properly describe.\nI hate Stephen. I don’t think I’ve ever hated a fictional character this much. He’s manipulative, toxic, emotionally abusive, and watching him operate felt draining and disturbing. But what hurts even more is Lucy. Watching her repeatedly abandon her self respect, excuse his behavior, and spiral deeper just made me angry and sad at the same time. It’s frustrating in a way that feels personal.\nHonestly, I can’t even name many “good” characters in this show. The only one who felt remotely decent to me was Wrigley. He’s messed up too, sure, but compared to everyone else, he didn’t actively destroy people the way the others did.\nThe worst part is the show is captivating. The writing, the tension, the way it pulls you in… it works. That’s why it’s so hard. I went in planning to watch all three seasons eventually, but after finishing season 2, I’m done. I can’t continue. I don’t care how good the plot is.\nMy mental health feels wrecked right now. I’ve got a headache, my chest feels tight, I can’t breathe properly, and I don’t think I’ll be able to eat for at least a day. I know it’s “just a show,” but the emotional weight of it hit way harder than I expected.\nI just needed to get this out somewhere because this reaction scared me.\nHas anyone else felt this messed up after watching it? Or am I alone in this?",
        "upvotes": 4,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1qs2cec/i_dont_think_i_can_continue_tell_me_lies_after/"
    },
    {
        "id": "1qrf5r4",
        "author": "Less_Manufacturer218",
        "title": "Elizabeth Smart documentary, what a powerful family. Must watch",
        "content": "Just wanted to say how impressive the entire Smart family is. From Mary Katherine remembering and cracking the case, to her parents and uncles never giving up. And of course Elizabeth, a true survivor with incredible strength.\n\nWill make you cry. ",
        "upvotes": 83,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qrf5r4/elizabeth_smart_documentary_what_a_powerful/"
    },
    {
        "id": "1qrkwrd",
        "author": "bradleyistheman",
        "title": "Ted Danson",
        "content": "Ted Danson stars in both \"A Man On The Inside\" and \"The Good Place.\" I just watched an episode of \"A Man On The Inside\" where one of the characters mentions that Charles (Danson's character) looks like a handsome devil. I wonder if that's an inside reference to his character on \"The Good Place.\"",
        "upvotes": 26,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qrkwrd/ted_danson/"
    },
    {
        "id": "1qs6pwl",
        "author": "zoebnj",
        "title": "Is buffering caused by several people using the account at the same time?",
        "content": "Basically the title--I just discovered that you can look at your viewing history, and I saw that someone is watching the kind of shows that I don't watch--reality and chef shows.  I'm sure that it's a family member, I don't care if they are watching, but I've been having buffering problems and wonder if it's because someone else is in my account at the same time.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qs6pwl/is_buffering_caused_by_several_people_using_the/"
    },
    {
        "id": "1qqm8bc",
        "author": "MattTheKing23",
        "title": "Netflix Had a Plan If Alex Honnold Died During Live Skyscraper Climb",
        "content": "",
        "upvotes": 1101,
        "comments": 178,
        "media": null,
        "permalink": "/r/netflix/comments/1qqm8bc/netflix_had_a_plan_if_alex_honnold_died_during/"
    },
    {
        "id": "1qrged5",
        "author": "superfecta37",
        "title": "When life gives you tangerines is a masterpiece",
        "content": "I never watch kdramas, but decided to give this one a go, and I finished all 16 episodes in 2 days.\n\nWhat a masterpiece. Easily one of the best shows I've ever watched. Has anyone watched this?",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qrged5/when_life_gives_you_tangerines_is_a_masterpiece/"
    },
    {
        "id": "1qry7oi",
        "author": "MrFizzbin761",
        "title": "Anybody else experiencing issues with netflix commercials skipping last 15 minutes of episodes ?",
        "content": "I'm having an issue watching shows on netflix where the last commercial before the last 15 minutes of an episode on any show I watch causes netflix player to jump to the next episode skipping the last 15 minutes of the episode.  I have to stop the player, go back to the series header, reselect the episode to have it pick up.   Sometimes that doesn't work and I have close the browser and restart netflix.  ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qry7oi/anybody_else_experiencing_issues_with_netflix/"
    },
    {
        "id": "1qrwaht",
        "author": "DragonsLoveBoxes",
        "title": "Why won’t it connect?",
        "content": "So I just signed up for Netflix. But it’s been about five minutes of it trying to log in with a blank screen and a blue waiting bar. I took video but I can’t post it. The money has come out of my account. \n\nWhat can I do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qrwaht/why_wont_it_connect/"
    },
    {
        "id": "1qqnyn5",
        "author": "Jumpy_Wing_7884",
        "title": "Anyone else feel sad when they outgrow a show? (me: Bridgerton)",
        "content": "I used to LOVE *Bridgerton*, but Season 4 just isn’t hitting for me anymore. Same thing happened with *You*. It’s not bad, I’m just… not as into it.\n\nKind of makes me sad because these used to be such comfort shows for me. 😅\n\nAnyone else go through this with shows they used to love?",
        "upvotes": 397,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1qqnyn5/anyone_else_feel_sad_when_they_outgrow_a_show_me/"
    },
    {
        "id": "1qrv77j",
        "author": "Revolverocelot1998",
        "title": "Audio issue on Netflix.",
        "content": "I am watching the James Bond movie You Only Live Twice and there seems to be an issue with the audio as it sounds very low quality and not very high quality compared to other versions. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrv77j/audio_issue_on_netflix/"
    },
    {
        "id": "1qrlzai",
        "author": "Delicious_Mess7976",
        "title": "Problem with loading a series episode",
        "content": "I have already tried the common fixes online and none are working.\n\nI have finished Season 3, (Poldark) episode three, but instead of moving to episode four, it skips all the way to Season 4....\n\nI have tried a bunch of fixes (settings, turning off and on, disconnecting. etc.)\n\nI am in an AirBnb, and I watch on my laptop. Not having problems with any other shows.\n\nAny other suggestions?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrlzai/problem_with_loading_a_series_episode/"
    },
    {
        "id": "1qrqhr5",
        "author": "Civil-Heron-9124",
        "title": "Netflix Error Code 100",
        "content": "When trying to mirror screen Netflix from my Ipad to Samsung TV I always get Error Code 100. I use it with different apps and there are no issues. Has anyone else encountered this error problem? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrqhr5/netflix_error_code_100/"
    },
    {
        "id": "1qrxfsx",
        "author": "NatuRal_Pro",
        "title": "Is Colour grading changed in Dhurandar OTT release ?",
        "content": "I didn't watch dhurandar in ghe theatre and now I'm seeing people talking about the OTT release and some are saying that the theatre had better colour grading than the OTT also that many dialogues are muted. I'm confused now can please someone clarify these things",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qrxfsx/is_colour_grading_changed_in_dhurandar_ott_release/"
    },
    {
        "id": "1qrntjg",
        "author": "b33b0",
        "title": "Just a Dash / Emilia Fart",
        "content": "I just watched season 3 of Just a Dash having seen none of this guy's other videos or anything. I thought it was funny but not sure if he did the cooking in random places thing before? It gave me Emilia Fart vibes so hard, especially the plane episode. \n\nI miss her, she could've had an amazing Netflix show. Just wondering if anyone else out there happened to also watch this and have this thought. I might be the only one, but there's gotta be at least one other person out there right? \n\nThey're both Canadian, I have to wonder if he's ever seen her videos. Shes pretty iconic in the YouTube world which I think this guy Matty was also part of. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrntjg/just_a_dash_emilia_fart/"
    },
    {
        "id": "1qqwy8g",
        "author": "NavinRJohnson121479",
        "title": "Podcasts",
        "content": "Am I the only one who feels weird ***watching*** podcasts?  I’ve always thought of a podcast as something you ***listen*** to.\n\nI’m finding it hard to bring myself to watch any of them. ",
        "upvotes": 29,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qqwy8g/podcasts/"
    },
    {
        "id": "1qrm4dz",
        "author": "FrequentAd1540",
        "title": "For those of you who can not watch netflix in 4k on edge or the app",
        "content": "The troubleshooting steps you can find in other subreddits.\n\n  \nExcept this one: Once in a while it will stop working, all you need to do to fix is delete the browser data in edge and restart, and you are good to go.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrm4dz/for_those_of_you_who_can_not_watch_netflix_in_4k/"
    },
    {
        "id": "1qrm2rh",
        "author": "Tnynfox",
        "title": "How many of you download content in-app, and why?",
        "content": "On mobile you can temporarily save shows offline.  Personally I don't do so since it's more convenient to actually stream if I have the option.\n\nOne use case I could understand is if you have the ad tier: saving and watching an Amazon Prime show offline excluded ads, so in theory it should also work here too.  Don't ban me mods, I'm just discussing an official Netflix app feature with nothing third-party going on.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qrm2rh/how_many_of_you_download_content_inapp_and_why/"
    },
    {
        "id": "1qrk92t",
        "author": "freespiritrgi",
        "title": "Netflix audio - low troubleshoot",
        "content": "Hello,\n\nI recently noticed that Netflix volume is really low on my Sony TV, both through the TV speakers and my soundbar.\n\nI unpaired and repaired the devices, cleared caches, and uninstalled and reinstalled everything, but the issue is still there.\n\nAt full volume, it feels like it’s only about 50% of what it used to be, and it’s noticeably lower than other apps.\n\nAny idea why this might be happening? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrk92t/netflix_audio_low_troubleshoot/"
    },
    {
        "id": "1qrij6p",
        "author": "CandyFalls",
        "title": "Another question about the Run Away",
        "content": "Can somebody explain to me the timeline around when Paige went to visit Sam at uni?\n\nIn my head it goes like this \n\nDay 1) Simon sees Paige playing guitar and is filmed beating up Aron\n\nDay 2) Aaron is killed \n\nAnd we know Paige must have gone to Sam after this as as he ended up with her guitar \n\nBUT in the final episode when she’s explaining where she was, she said she found Aaron the day after he was killed and the she went to the caravan, then to rehab.\n\nSo when did she visit Sam?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qrij6p/another_question_about_the_run_away/"
    },
    {
        "id": "1qr1e9q",
        "author": "CrazyCatLady483",
        "title": "Sorry but we had trouble logging you in",
        "content": "Hello, I am getting the above message and I do not know what more to do.  I have done a hard reset on my Apple TV. I deleted the app and reinstalled it.  Software on my Apple TV is up to date.  Speedtest shows wifi is working fine at over 50mbps (standard speeds here in Australia where the internet infrastructure is 20 years behind the times).  Netflix worked fine earlier today and still works fine on other devices but it’s not great for my whole family to try to crowd around an iPad or iPhone to watch a show.  Can anyone help me fix this?",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qr1e9q/sorry_but_we_had_trouble_logging_you_in/"
    },
    {
        "id": "1qram76",
        "author": "Sufficient-Curve2951",
        "title": "Bridgerton S4",
        "content": "Here's Justin Kamps talking about the music used in S4 Part 1\n\nAbsolutely loved the use of Taylor Swift's 'Enchanted' in Episode 2. This feels like Benophie song and the show delivered. Predictions/wishes about the pop covers we could get in Part 2?\n\n  \n[https://www.soapcentral.com/shows/bridgerton-season-4-part-1-soundtrack-guide-a-complete-list-music-netflix-drama-s-latest-chapter](https://www.soapcentral.com/shows/bridgerton-season-4-part-1-soundtrack-guide-a-complete-list-music-netflix-drama-s-latest-chapter)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qram76/bridgerton_s4/"
    },
    {
        "id": "1qqjrtn",
        "author": "Hefty_Shoe_7081",
        "title": "The Perfect Neighbor",
        "content": "I know this show has been talked about alot on this sub but I have some things I’d like to discussed that I don’t think have been discussed. \n1. Even if this lady was bothered by these kids (which believe me kids can be annoying especially in large groups) why did NO OTHER FAMILY had anything bad to say about these kids? These kids were playing, being kids, imagine what a miserable piece of garbage you have to be to be so bothered by children playing. \n2. Does anybody feel for her in the sense that mental health is something ignored in their country or was she just an awful person? (Was she schizophrenic, etc…) \n3. Why did it take somebody dying for something to happen? These cops had been here what, over 10 times? And nothing happened? \n",
        "upvotes": 82,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1qqjrtn/the_perfect_neighbor/"
    },
    {
        "id": "1qqoe1g",
        "author": "SugaryFlump",
        "title": "Sense8",
        "content": "Why was Sense8 never renewed for a third season? Just rewatched it all for a second time and I forgot just how brilliant it is! Wish they’d bring it back, I’d love to see them all these years later with a new storyline. ",
        "upvotes": 39,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qqoe1g/sense8/"
    },
    {
        "id": "1qqqbmh",
        "author": "OrangeSpark16",
        "title": "Who is the most successful actor/actress to come from Netflix?",
        "content": "Reworded, who is the most successful actor/actress that got their break on Netflix? I saw a post about a new Noah Centineo movie and it got me thinking about this question. My first thought was Jacob Elordi coming from Kissing Booth. He's nominated for an Oscar this year, coincidentally because of his performance in a Netflix movie! I would also consider Millie Bobby Brown. While she's only been on Netflix shows/movies, it's undeniably given her a lot of fame. Do y'all agree/disagree?",
        "upvotes": 33,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqbmh/who_is_the_most_successful_actoractress_to_come/"
    },
    {
        "id": "1qrt0l5",
        "author": "Flaky-Information-34",
        "title": "Netflix pisses me off so much by getting rid of long shows for multiple short story shows.",
        "content": "There are so many Netflix series/shows that they sum up in 2-3 seasons, that would be so fucking amazing as an entire 10-15 season show. There’s so much potential and depth in them (ex. Glitch, Dead to me, The end of the fucking world, playing Gracie darling, ratched, you get the point) that would put them as high as like vampire diaries and supernatural. Netflix doesn’t really have a Long series, like AMC and Hulu. Unless they mark Stranger things as one if it continues that long. It’s just so sad, these writers have potential and deserve their whole story to produced. \n\nI just don’t understand why Netflix is taking such AMAZING ideas and just cutting it short. Multiple short stories doesn’t equal out to the long insanely amazing shows, and if it’s for money? That would be stupid right? Cos they would make so much more money, continuing these fascinating series. \n\nI feel Netflix has gone down hill after Stranger things, and 13 reasons why, those were their star shows. I would include Arcane, but that has just recently become a thing. They could have so many good long ass shows. But they just don’t and it doesn’t make sense to as why :(",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qrt0l5/netflix_pisses_me_off_so_much_by_getting_rid_of/"
    },
    {
        "id": "1qqxyex",
        "author": "IcyAssistance5535",
        "title": "WORST ROMMATE EVER DOC.",
        "content": "First off I just want to say these people are insane as fuck but what really made me want to come type on here was the last 2 episodes where they spoke on fucking Jamison Bachman, a serial squatter, he would find roommates to live with (eventually created a fake name Jed) and after a while stop helping with the rent. He was also very educated when it came to law stuff, so every time they wanted to have a protection order against him and things like that, he ALWAYS ALWAYS ALWAYS found a way to flip it on them, to the point where a couple of them would lose their own apartment to him!! Eventually he met his match and a girl had him sent to jail a couple times, his fucking brother bailed him out each time and I never knew why! Next thing you know, he kills his brother !! I think he had some sort of grudge or anger towards his brother, I’m not sure what it is I just know that his older brother became more successful then him. But he gets locked up for his murder, then fucking kills hangs him self before he really even got sentenced in 2017. He put these people through wayyyy too much to to sit there and cop out on life, he was evil as fuck . I usually don’t care too much when people kill themselves while waiting for their sentencing the way he did, but he was the lastttttt person to sit and have the opportunity to cop out on life the way he did. He was a smart psycho",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqxyex/worst_rommate_ever_doc/"
    }
]