[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qcqwi7",
        "author": "Tricky-Anywhere5727",
        "title": "Why the hell can't we just see subtitles in all languages?",
        "content": "The \"select language\" section has no effect at all, that's no secret. Even after LITERALLY REMOVING GERMAN ENTIRELY from netflix, setting my phone to English and removing German from my phones keyboard, they still only give me German subtitles or none. I don't know what to do anymore, what even is the reason why they don't show us all the languages? Most movies don't have that many dubs and subs anyways, it can't be that hard to display ~20 languages. That's the least I expect from a multimillion dollar company that I am paying a rising fortune every year.\n\n\nGet your app in order, for fucks sake ",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qcqwi7/why_the_hell_cant_we_just_see_subtitles_in_all/"
    },
    {
        "id": "1qcnko1",
        "author": "Ordinary_Mango9815",
        "title": "Why do I do this to myself??",
        "content": "I started Mindhunter again because it’s one of my favorite shows to have ever been released on Netflix. I’m frustrated that it will never have the proper ending it deserves 😩😭😭😭\n\nJust wanted to rant about this!! Unsure why I am torturing myself by watching this over again but it’s a great show, with great acting and provides such an amazing depiction of the early days of criminal profiling. ",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qcnko1/why_do_i_do_this_to_myself/"
    },
    {
        "id": "1qcliu6",
        "author": "Sweaty_Parfait8251",
        "title": "Dead To Me",
        "content": "I started watching Dead To Me on Netflix this week, and it wasn’t until episode two that I found myself saying, Okay, now we have a story… IYKYK. Still wondering though, is it worth continuing, or should I find a better show to binge?",
        "upvotes": 10,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1qcliu6/dead_to_me/"
    },
    {
        "id": "1qbyn8g",
        "author": "rwaggoner",
        "title": "Can't watch Netflix at work on planning period since \"not in household\"",
        "content": "Well, I have never experienced this. I was aware of the household requirement in place for years, but I will watch shows at work for background noise during my planning/conference period at school using an Apple TV, which I use to share my computer screen to the projector. It now mandates I update my household to this location, which I won't do since it's not my home. It doesn't let me watch anything.\n\nThis is nuts. I get their concern with sharing, but there are better ways to verify identity, maybe using facial recognition or something similar. The concept that you can only ever use one IP address is ridiculous.\n\nAre there any workarounds? No option for a temporary code...\n\nI have done this for 5 years and never had a problem. No other apps have this issue.\n\nJust Netflix.\n\nIt's enough to make me consider cancellation.",
        "upvotes": 275,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1qbyn8g/cant_watch_netflix_at_work_on_planning_period/"
    },
    {
        "id": "1qckcol",
        "author": "DuxxieDings",
        "title": "i hope netflix has more adult animation shows like arcane, wolf king and blue eye samurai in 2026",
        "content": "any news on 2026 shows or future shows like arcane, wolf king and blue eye samurai. i know theres s2 of blue eye, but i want more shit like wolf king, blue eye and arcane to look forward too. \n\nArcane and Wolf King finished up in 2 seasons. it seems like adult cartoons get 2 seasons at least. Blue Eye is a masterpiece and i cant wait for s2 but i hope its not the last because i like it and its the last good adult animation on netflix thats currently airing.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qckcol/i_hope_netflix_has_more_adult_animation_shows/"
    },
    {
        "id": "1qc6dm7",
        "author": "Few_Pipe_9933",
        "title": "Any recommendations I enjoyed His&amp;Hers looking for similar movie/shows",
        "content": "Anything helps! I like movies/shows with plot twist or elements that make you feel like there’s something your missing. Also like suspense/thriller! Any recommendations?",
        "upvotes": 22,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qc6dm7/any_recommendations_i_enjoyed_hishers_looking_for/"
    },
    {
        "id": "1qbbq72",
        "author": "Secretly_Wealthy90",
        "title": "11.22.63 IS SOOOO Good!!! highly recommended",
        "content": "how did i not know about this until now, 10 years later after it came out. Hulu did not do a good job at promoting it, Netflix put this at the top. \n\nall other streaming services should just shut down and license their content to Netflix IMO.\n\n\n\n",
        "upvotes": 1473,
        "comments": 382,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbq72/112263_is_soooo_good_highly_recommended/"
    },
    {
        "id": "1qcpwxz",
        "author": "MissMystery11",
        "title": "The third season of Girl From Nowhere might have apparently yet sadly been canceled already. There is an unexpected reboot with a new actress instead.",
        "content": "8 years of our hopes is officially crushed. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcpwxz/the_third_season_of_girl_from_nowhere_might_have/"
    },
    {
        "id": "1qcp5d9",
        "author": "Puzzled-Process7433",
        "title": "Samsung TV -UE55U8072FUXXH",
        "content": "I've been trving to fix this for 3 hours and can't find a solution. Here's the problem: the TV works fine. but when I ao to Netflix or YouTube. some videos work and others don't. What I mean is, the video starts glitching, and only the video is the problem; the YouTube/Netflix interface works.\nHere's what I've tried so far\n• Unplugged the TV for over 3 minutes, then plugged it back in.\n• Held the power off button (to do a TV reset) • Modified connection DNS \n• Tried all the settings/variations from the image tab \n. Removed every single energy efficiency setting \n• Reinstalled the programs/cleared the cache \n• Tried turning off HDR from Netflix.\n• Updated the operating svstem from their website to the latest version using a USB\nNone of this worked. I iust bought it on December 23rd and don't know what to do next. Anyone can help?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qcp5d9/samsung_tv_ue55u8072fuxxh/"
    },
    {
        "id": "1qcd3jj",
        "author": "Competitive_War2235",
        "title": "Weird sound",
        "content": "So I’m watching a show and all of a sudden the sound goes to like this voice mod… kinda like you hear when someone is trying to disguise their voice like on a cop show. Did I accidentally slow it down or hit some option …..? Just rewatched the scene and now it’s Normal like wtf ? Anyone had this happen ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcd3jj/weird_sound/"
    },
    {
        "id": "1qcktlq",
        "author": "chlorinatedseacow",
        "title": "How good are the captions on Netflix usually?",
        "content": "Hello! \nI don't really watch a lot of shows on Netflix but I've been watching Stranger Things 5 and I've noticed the captions are off quite a bit. It's never anything super necessary being dropped, but it's still noticable when a word or a character's name is missing. They are always clearly pronounced too, so I guess I'm confused how that could have happened? \nI'm wondering if this is common among Netflix shows? Should I send a message somewhere? \nThank you! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcktlq/how_good_are_the_captions_on_netflix_usually/"
    },
    {
        "id": "1qbfm14",
        "author": "happymagtv",
        "title": "Shane Gillis inks major Netflix deal as ‘Tires’ season 3 enters production",
        "content": "Just saw that Shane Gillis and John McKeever, the creators behind *Tires*, have landed a big overall deal with Netflix. This is happening as they start filming Season 3.\n\nThe deal means they'll be developing new movies, shows, and unscripted stuff for Netflix, plus Gillis gets two more stand-up specials. Pretty huge vote of confidence in their specific brand of chaotic, blue-collar comedy after the show's success.\n\nThe quote from their statement is classic: \"thankfully, it's too late for them to back out.\"",
        "upvotes": 310,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qbfm14/shane_gillis_inks_major_netflix_deal_as_tires/"
    },
    {
        "id": "1qbpwam",
        "author": "godguided",
        "title": "Jodie Comer is absolute Badass and obsession",
        "content": "I just started Killing Eve, though it lost its plot and intensity after first season for me, but i am continuing it throughout just to see more of Jodie. Seriously no dull moment of her in the series for a second. I didn’t see her in anything before so this was my first time watching her and man the range she brings on table in one single show is not just incredible but so damn shockingly delightful. I mean no one be it male or female could have done job so amazingly well. I am surprised how i didn’t see her in anything else, is she underrated? How she has done in other shows or movie?",
        "upvotes": 47,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qbpwam/jodie_comer_is_absolute_badass_and_obsession/"
    },
    {
        "id": "1qchtaf",
        "author": "zeitlosx3m",
        "title": "Netflix has not the same languages in series and films on my fire tv stick than on my pc.",
        "content": "Hi,\n\nSo i am from germany and i use netflix on pc in chrome browser and in my bedroom on an fire tv stick.\n\nSince yesterday my fire tv stick netflix suddenly just has englisch (original) and Portuguese for as  options. And yes i know that my series is available in german its young sheldon and i watched it yesterday in german.\n\nSo wtf is going on. Is netflix thinking my tv is in portugal???",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qchtaf/netflix_has_not_the_same_languages_in_series_and/"
    },
    {
        "id": "1qch8k5",
        "author": "BluumDK",
        "title": "Subtitles distorts image",
        "content": "So whenever I Watch shows of streaming services on the browser or the windows application. The same frame the subtitles appeared the image gets distorted.\n\nWhen it happens, if I roll back 10 sec, and watch the same scene again, It doesn’t so it.\n\nI have a slowmo video of it, but can’t link it",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qch8k5/subtitles_distorts_image/"
    },
    {
        "id": "1qbyw6j",
        "author": "CM-Edge",
        "title": "No \"HD\" or \"4K\" logos on any content anymore to see what quality the movies or series run in?",
        "content": "When did they remove that? And why? Why does every company these days tries to make their product more inconvenient than before? \n\n[https://b.l3n.co/FsZg6b.png](https://b.l3n.co/FsZg6b.png)\n\n",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qbyw6j/no_hd_or_4k_logos_on_any_content_anymore_to_see/"
    },
    {
        "id": "1qc8g27",
        "author": "Odd_Credit_8558",
        "title": "Anything similar to stranger things",
        "content": "so recently i finished every season of stranger things and i want to watch a new show that is similar to stranger things or at least like a stranger things vibe any suggestions?",
        "upvotes": 2,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1qc8g27/anything_similar_to_stranger_things/"
    },
    {
        "id": "1qc2a80",
        "author": "Fair_Ad7252",
        "title": "HDR content pause menu overlays and subtitle brightness",
        "content": "I am still baffled netflix didn't address this issue yet. Why does menu overlays and subtitles take full peak brightness and burn my retinas?  It can't be that difficult for the app to load half brightness menus overlays and subs for HDR and Dolby Vision content right?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qc2a80/hdr_content_pause_menu_overlays_and_subtitle/"
    },
    {
        "id": "1qbx4pd",
        "author": "prayerforce1",
        "title": "Had y’all heard of “Netflix House?”",
        "content": "I feel like nobody’s talking about this. It looks like a giant arcade with games based on Netflix Originals. There’s a Stranger Things course where you run through parts of Hawkins and a Squid Game course where you do the challenges from the show. This looks dope! Not gonna lie",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qbx4pd/had_yall_heard_of_netflix_house/"
    },
    {
        "id": "1qc66ef",
        "author": "baejinvr",
        "title": "can i use the same netflix account in a different country?",
        "content": "i'm from brazil and i'm moving to germany next month. My family has a netflix account with premium subscription and I use the same account as them, can I use this account in germany at the same time they're using it here?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qc66ef/can_i_use_the_same_netflix_account_in_a_different/"
    },
    {
        "id": "1qcei3m",
        "author": "Coach006",
        "title": "11.22.63 Thoughts?",
        "content": "Just about finished with sode 2. Worth it? It's 'ok' for me right now, prolly watch more. Just curious as to whether or not I am going to waste my time or not.",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1qcei3m/112263_thoughts/"
    },
    {
        "id": "1qbtz9j",
        "author": "Limp-Strawberry-5830",
        "title": "Without giving away any spoilers, did you like the ending of killing Eve?",
        "content": "Now that it’s on Netflix, I think that’s an applicable question for this sub Reddit. I might rewatch the series as I thoroughly enjoyed it and one of the few reasons I had AMC was to watch it\n\nBut I’m wondering what you’re feelings are on how it ended",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qbtz9j/without_giving_away_any_spoilers_did_you_like_the/"
    },
    {
        "id": "1qc2kma",
        "author": "taha-berkk",
        "title": "Hold for 1.5x",
        "content": "I used to be able to hold down the screen to view in 1.5x but for like 2 days ago that feature just stopped working. I was using it for short periods when the show I was watching got very boring. Now I can just toggle the to 1.5x and that's very unconfortable to do for short periods. Any way to fix this?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qc2kma/hold_for_15x/"
    },
    {
        "id": "1qc293z",
        "author": "TechnicalWarning8688",
        "title": "Netflix ain't working at all",
        "content": "Hi. So, I was trying to sign in and resubscribe today. If I get into the netflix app on phone, the screen gets dark and they aren't even letting me pay. What's the issue and how to fix it? I tried on both laptop and phone but nothing's working. They don't even let me pay. It shows \"sorry, we're unable to complete this action now. Please try again later.\" Thanks. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qc293z/netflix_aint_working_at_all/"
    },
    {
        "id": "1qbzwia",
        "author": "Eclipse8301",
        "title": "WWE RAW commercials?",
        "content": "So now waiting the next day to watch you are forced to watch through commercials? WTH Netflix…. Watching live is beyond annoying with the ammount of commercials, that was the benefit of next day viewing. Really hate Raw on Netflix!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbzwia/wwe_raw_commercials/"
    },
    {
        "id": "1qcjf6d",
        "author": "Dry-Guitar1306",
        "title": "Is it normal for my boyfriend to watch Emily in Paris? (LDR)",
        "content": "My boyfriend and I are in a long-distance relationship. He recently sent me a screenshot of his Netflix history, and I was surprised to see Emily in Paris there.\n\nAlong with that, he watches shows like Murder in Monaco, The One, and Paparazzi King. His favorite movies are Home Alone 1 &amp; 2.\n\nWhat surprised me is that his usual interests are very different—he normally watches true crime (like the Menendez brothers), spy shows, and comedy like Mr. Bean, which don’t really align with Emily in Paris.\n\nWe’ve been together for 3 years, and I never knew he watched Emily in Paris. When I asked him about it, he just said he thinks it’s cute.\n\nAm I overthinking this, or is it normal for a guy to watch Emily in Paris?",
        "upvotes": 0,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1qcjf6d/is_it_normal_for_my_boyfriend_to_watch_emily_in/"
    },
    {
        "id": "1qb2v87",
        "author": "Mr-Vanderhill",
        "title": "His &amp; Hers… thoughts",
        "content": "Was this series.. supposed to be good?\n\nI thought it was bafflingly bad. A terrible story/plot, with horrible dialogue all around and some pretty awful acting. \n\nThe plot.. some high school girls coerce others into the woods in which they get paid to watch girls get abused? One of the girls changes her name and looks and also becomes an anchorwoman at the same place as the main character? She kills her own sister and turns into some sinister person.. Yawn. Lazy, horrible writing. I can go into much more but it’s truly not worth it. \n\nJon Bernthal is great and gives it his best but even he can’t really escape the again, horrible dialogue and plot. \n\nTessa Thompson is objectively horrible. Prior to this she was fine in other things. Not spectacular, not bad. She also is not given help with an awful plot and dialogue but god she was incredibly bad. So many scenes that were laughable and clearly a set of a show with soap opera type acting. \n\nTessa was not the actress to use in this show and well it shows. Nobody could’ve done the story justice sure but she made it a lot worse. \n\nThe climax.. her mom with “dementia” ends up being the killer.. yawn yawn yawn. That whole final act was such a drag and so lame. So many obvious and dumb red herrings all the way across the series. \n\nI typically won’t comment on something that I think is this bad but I’m seeing so much love that I can’t even wrap my head around. Hate to be the bearer of bad news but if you enjoyed this series, you are easy to please. ",
        "upvotes": 62,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1qb2v87/his_hers_thoughts/"
    },
    {
        "id": "1qbksc2",
        "author": "BlackestMask",
        "title": "Subtitles Always Include Audio Descriptions?!",
        "content": "I got Netflix and I'm ready to finally watch the anime Frieren. I'm watching it in the original Japanese with English subtitles, and the Audio Descriptions cannot be turned off.\n\nNothing I did could change this. **&lt;wind whistles&gt; &lt;soft music swells&gt;** and such interrupted the dialogue nonstop.\n\nWas on the phone with Netflix for 40 minutes doing everything from switching profiles to rebooting my entire system before the poor fellow I've been talking to puts me on hold to talk to his supervisor.\n\nHe returns to tell me that the Audio Descriptions cannot be turned off for Frieren.  And it looks like this is true for at least some other subtitled shows as well.\n\nCan this be true?  Seems straight up unacceptable.",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qbksc2/subtitles_always_include_audio_descriptions/"
    }
]