[
    {
        "id": "1k9rtun",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 5445,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9rtun/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kefjms",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs RC Celta de Vigo Live Score | LaLiga 24/25 | May 4, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1kefjms)",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kefjms/match_thread_real_madrid_vs_rc_celta_de_vigo_live/"
    },
    {
        "id": "1kebhan",
        "author": "Modo97",
        "title": "I will leave this one here.",
        "content": "Real Madrid this season in one picture.",
        "upvotes": 491,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ofizhyr70pye1.jpeg?auto=webp&amp;s=4dbcaad083bee0f2c9f224fd2f580eb2eb81b5fe"
        },
        "permalink": "/r/realmadrid/comments/1kebhan/i_will_leave_this_one_here/"
    },
    {
        "id": "1kedw0b",
        "author": "amungus45",
        "title": "Toni Kroos: “What separates Arda Güler from other young players is that he always wants to learn. He looks what we do, also before and after training. You don’t see this often in todays football. I noticed that he wants to improve and of course he has an INSANE left foot.(Continuation in comment)",
        "content": "",
        "upvotes": 245,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ft5q236zspye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kedw0b/toni_kroos_what_separates_arda_güler_from_other/"
    },
    {
        "id": "1kee19i",
        "author": "WhySoWeirdUsername",
        "title": "OTD 3 years ago : The night of Real Resurrection",
        "content": "",
        "upvotes": 171,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kee19i/otd_3_years_ago_the_night_of_real_resurrection/"
    },
    {
        "id": "1kdzhnd",
        "author": "AstroFlayer",
        "title": "Imagine how bad a team has to be to have him and still lose.",
        "content": "",
        "upvotes": 802,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/79ksha3tzlye1.jpeg?auto=webp&amp;s=41e306cdb44c6800f5d7faeaab9bc07b5bc9702d"
        },
        "permalink": "/r/realmadrid/comments/1kdzhnd/imagine_how_bad_a_team_has_to_be_to_have_him_and/"
    },
    {
        "id": "1ke07c4",
        "author": "Better-Turnip-226",
        "title": "Very familiar looking face",
        "content": "",
        "upvotes": 504,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6b1lrqzb5mye1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ke07c4/very_familiar_looking_face/"
    },
    {
        "id": "1ke2gk6",
        "author": "TLakes",
        "title": "Real Madrid’s plan to sign Trent Alexander-Arnold before the Club World Cup",
        "content": "",
        "upvotes": 142,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2_TvlnMSVd0dbLiS6ecqUGE6jvMyha44dmZMpV3podg.jpg?auto=webp&amp;s=9d307643d156cd16e4df969697af6f03ce7fc5be"
        },
        "permalink": "/r/realmadrid/comments/1ke2gk6/real_madrids_plan_to_sign_trent_alexanderarnold/"
    },
    {
        "id": "1kdspph",
        "author": "PenguinFootballClub",
        "title": "How the mighty have fallen...",
        "content": "There was also a time with Carvajal, Ramos, Varane, Marcelo as our starters and Arbeloa, Nacho, Pepe &amp; Coentrao as back-ups.",
        "upvotes": 493,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ybro8ts7hkye1.png?auto=webp&amp;s=9a443cee17e94efd1a3ab95d8af08a6cb4b8cd3e"
        },
        "permalink": "/r/realmadrid/comments/1kdspph/how_the_mighty_have_fallen/"
    },
    {
        "id": "1kdtkp2",
        "author": "ExotiquePlayboy",
        "title": "Florentino Perez Inter fan confirmed",
        "content": "",
        "upvotes": 435,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yhc7hxkvokye1.png?auto=webp&amp;s=2df58ac80dd9ac0ff3c28c0e7572c36ab1135e2b"
        },
        "permalink": "/r/realmadrid/comments/1kdtkp2/florentino_perez_inter_fan_confirmed/"
    },
    {
        "id": "1ke6t48",
        "author": "Any_Resist_5932",
        "title": "Pre Ronaldo Era Fans",
        "content": "Hi all, \n\nFor those of you that remember Real Madrid (2003, 2010) or what I call the dark days (I became a fan in 2001), what is something you think the club has done different to bring the success we have had from 2013 and on?\n\nAlso, do you think we will ever go back to those days of being eliminated in the round of 16 6 years in a row?\n\n",
        "upvotes": 53,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ke6t48/pre_ronaldo_era_fans/"
    },
    {
        "id": "1kds43h",
        "author": "Total_Escape_9778",
        "title": "Somebody tell Kroos to come back and get that 100th assist 😭",
        "content": "",
        "upvotes": 340,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9z32pq0ybkye1.png?auto=webp&amp;s=c930d84be843b83488ebf6b5fd9f4155233ec257"
        },
        "permalink": "/r/realmadrid/comments/1kds43h/somebody_tell_kroos_to_come_back_and_get_that/"
    },
    {
        "id": "1kdxfgq",
        "author": "Pebbledthoughts",
        "title": "Who was the most difficult opponent you felt like watching?",
        "content": "\n\nFor me , it was Xavi 2009-2012. He would slow the game down to a level that almost felt uncomfortable. Was completely unpressable.  Players would pass to him even in the most difficult situations because they knew he wouldn’t lose it. His stamina never ended.His vision was unreal. He felt tactically so ahead of all other players.\n\nHonorable mentions : Leo Messi, Iniesta and 2014-15 Neymar.",
        "upvotes": 158,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kdxfgq/who_was_the_most_difficult_opponent_you_felt_like/"
    },
    {
        "id": "1kdzhob",
        "author": "muaazmuaaz123",
        "title": "Day 6: GK, most upvoted goalkeeper will be selected",
        "content": "",
        "upvotes": 92,
        "comments": 74,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kdzhob/day_6_gk_most_upvoted_goalkeeper_will_be_selected/"
    },
    {
        "id": "1kdu8ph",
        "author": "WhySoWeirdUsername",
        "title": "Real Madrid could make a move to bring back Kepa if Andriy Lunin leaves this summer",
        "content": "&gt; Lunin can leave Real Madrid this summer. The 26-year-old Ukrainian goal has a contract with the white team until 2030, but he has a secondary role and everything indicates that he will remain the same with the renewal of Courtois for two more seasons.\n\n&gt; Faced with this situation, Lunin is rethinking his future at Real Madrid. He has offers to leave the Bernabéu and has made them known to the white leaders. Some offers that will surely increase as the opening of the summer transfer market approaches.\n &gt; Lunin has lived some somewhat special seasons at Real Madrid. The previous one, took the white team to the final in London, but he did not play it, but the goalkeeper of the final was Courtois. The same has happened in the current one with the Copa del Rey. Lunin has played the entire tournament, but the Sevilla final was played by Courtois. Some situations that have caused Lunin to be thinking about leaving the white club.\n\n&gt; Coincidence or not, names of goalkeepers have already begun to emerge to reach Real Madrid next summer. Kepa can return to the Bernabéu if Lunin leaves, while Joan García's name begins to sound very strong in Valdebebas.",
        "upvotes": 140,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2pd8z7fsxdIc15I4VBIGfrY0Up84BkLqQfUs9laCcTo.jpg?auto=webp&amp;s=77d14d303cafcfa07661ae2379d463d7afdb59f5"
        },
        "permalink": "/r/realmadrid/comments/1kdu8ph/real_madrid_could_make_a_move_to_bring_back_kepa/"
    },
    {
        "id": "1kdb6rz",
        "author": "Emergency-Hornet-594",
        "title": "Source trust me bro..",
        "content": "",
        "upvotes": 1340,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6baucgacjfye1.jpeg?auto=webp&amp;s=592fb7fcf82308765c7cbf799176ad16b68eaab2"
        },
        "permalink": "/r/realmadrid/comments/1kdb6rz/source_trust_me_bro/"
    },
    {
        "id": "1ke0htu",
        "author": "Miserable-Subject-87",
        "title": "Thoughts on the Club World Cup and Madrid’s Current Transfer Rumors?",
        "content": "This season is almost over, and honestly, it’s been one of the worst in a long time. We still have a small chance of winning La Liga, but the biggest issue is that all our starting defenders are injured. On top of that, most of the rumors we’re hearing are about the club only targeting free agents, aside from Álvaro Carreras.\n\nAs a Spanish-speaking Madridista, I follow a lot of Spanish sources and YouTubers like Ramón Álvarez de Mon, Iñaki Angulo, Siro López, Rubén Martín, etc. From what I’m hearing, Madrid doesn’t want to pay that much money for Dean Huijsen, and Chelsea is reportedly close to signing him. Madrid also isn’t planning to make any signings before the Club World Cup, aside from possibly TAA, if an agreement with Liverpool can be reached. Some sources even say that the only potential signing before the tournament is Franco Mastantuono.\n\nThis Club World Cup is complicating transfer moves because I guess we’ll need to offload players to sign new ones? And a few of them will likely be sold after the tournament ends, which makes it difficult for us to make signings before the Club World Cup. (Correct me if I’m wrong)\n\nPersonally, I hope none of the rumors about us not making any signings before the tournament are true. But with how this club has been operating in recent seasons, it wouldn’t be surprising. Personally and like many of us, I’d like to see us go for Dean Huijsen and Álvaro Carreras. If it’s not possible before the tournament, at least after it ends once we’ve offloaded some players. I’d also prefer bringing back Nico Paz and giving Arda Güler more minutes for the upcoming tournament and season, but attackers are the last thing we need right now. What we really need is defenders.\n\nI know a lot of us have mixed feelings about this Club World Cup. We’re risking burning out our players for a money-hungry FIFA tournament that feels unnecessary. And if the rumors are true that we’ll be going into it with an interim manager like Solari, that doesn’t exactly raise expectations either. The best thing we could get from this is the prize money, if we win it, and the chance to be the first and only club to lift that trophy.\n\nWhat’s y’all take on all this? And how do you feel about the tournament? Curious to hear what you all think.",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ke0htu/thoughts_on_the_club_world_cup_and_madrids/"
    },
    {
        "id": "1kdfx44",
        "author": "DigitalisFX",
        "title": "Kroos “The Quiet Genius”",
        "content": "",
        "upvotes": 489,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jkizauqrlgye1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kdfx44/kroos_the_quiet_genius/"
    },
    {
        "id": "1kd9n7p",
        "author": "Wavy_Rondo",
        "title": "Ronaldo was something else..",
        "content": "",
        "upvotes": 1047,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w6luzcrn7fye1.jpeg?auto=webp&amp;s=4c6d7951aabb4a9e462c20f8e251b9ea038e8a55"
        },
        "permalink": "/r/realmadrid/comments/1kd9n7p/ronaldo_was_something_else/"
    },
    {
        "id": "1kdp3r7",
        "author": "123kallem",
        "title": "Real Madrid is pursuing Miguel Gutiérrez",
        "content": "",
        "upvotes": 71,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5pTAK_-UPuoIRdlgxJcwFGLsCyOpLIKV4b_DMZilwiQ.jpg?auto=webp&amp;s=55f5b19134c626e79f96e51d43313a02ec0e5b63"
        },
        "permalink": "/r/realmadrid/comments/1kdp3r7/real_madrid_is_pursuing_miguel_gutiérrez/"
    },
    {
        "id": "1kdsucb",
        "author": "Total_Escape_9778",
        "title": "Top 10 Real Madrid Players of All Time",
        "content": "So I was having a discussion with my friend and we both were wondering who we wuld consider in the list of top 10 real madrid players of all time. So many legends have played for our club and given their all so it wuld be hard to come up with just 10 players but I still tried my best trying to include all the factors like trophies and performance.\n\n**1) Cristiano Ronaldo:** Madafaqa scored 450 goals and 120 assists in just 438 games for us so Ig that's enough to put him at the first place. He also gave us 4 ballon d'or worthy season in just the 9 seasons he spent at our club and is also our top scorer and third highester assist provider.\n\n**2) Alfredo Di Stefano:** He was the main man (alongside puskas) in our 5-peat in the european cup and defined our 1950s era and global identity. Without him the club would no be close to what it is right now.\n\n**3) Raul Gonzalez:** He is our third all time top scorer and has won 3x champions league and 6x la liga. He spent 16 years of his career playing for Real Madrid, becoming the holder for most appearances with the club (741). He has always been a madridsta in his heart and a lifelong leader\n\n**4) Sergio Ramos:** He is without doubt a top 10 player but I am not sure how much the rest of you wuld agree with his position being this high. For me tho he definitely deserves this spot. One of the much clutch players in our history (Scoring that 92:48 equalizer vs atletico or the only goal in 1-1 win after a penalty shootout in the ucl final 2016). Even without his defensive skills, he scored 101 goals for us while being a freaking defender. More that enough to be at the 4th spot for me.\n\n**5) Kareem Benzema:** 2nd Highest Scorer and 2nd Highest Assist provider, benzema was one of the most selfless player who despite being a striker wuld try to provide chances for ronaldo. However, our longtime unsung hero finally turned into a leader and Ballon d’Or winner (2022).\n\n**6) Zinedine Zidane:** As a player you could argue zidane doesn't deserve to be this high but when you couple his managerial career he is undoubtedly one of the greatest football maestros to have worked under this club. 3 UCLs and 2 La Ligas in just 4 seasons including a historic three-peat xD plus that iconic ucl final goal.\n\n**7)** **Luka Modric**: A faithful servant of the club who won 6 champions league with us and is till going strong at 39\n\n**8) Ferenc Puskás:** He was a goalscoring machine who scored 242 goals in 262 games winning 3x european cup and 5x la liga titles. He had immense influence alongside di stefano\n\n**9) Roberto Carlos:** He scored 69 Goals and 116 Assists in 527 Apperances for us as a left back. He revolutionized the full back role\n\n**10) Marcelo:** He came to fill the role of roberto carlos and oh boy he did it perfectly. Over 100 Assists for us including so many legendary crosses like bale's goal in the ucl final. In the ucl 2017-18 campaign he also scored 3 goals in the knockout stages plus 2 assists in the final. 5x La Liga and 6x Champions League, he definitely deserves this spot for me\n\nSome Honourable Mentions: Paco Gento, Iker Casillas, Toni Kroos, Casemiro, Keylor Navas etc\n\nI would love to see some of our new players like bellingham, valverde, mbappe and vini to crack this list too by the end of their career but they would have to achieve a lot",
        "upvotes": 32,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kdsucb/top_10_real_madrid_players_of_all_time/"
    },
    {
        "id": "1kd9e3a",
        "author": "Nyghl",
        "title": "Lack of Playtime Makes You Forget How Clinical This Boy Is",
        "content": "Video by [MadridistaTV2](https://www.youtube.com/watch?v=Dz0mtg8imUU) , one of the best highlights video I've seen.",
        "upvotes": 782,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/a0sbvk184fye1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kd9e3a/lack_of_playtime_makes_you_forget_how_clinical/"
    },
    {
        "id": "1kd3s4r",
        "author": "WhySoWeirdUsername",
        "title": "8 years ago today UCL semi finals",
        "content": "Siuuuuuuu",
        "upvotes": 1458,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c3qobff20eye1.jpeg?auto=webp&amp;s=d04d88b32bc1937d514f74e1b925a070b6181482"
        },
        "permalink": "/r/realmadrid/comments/1kd3s4r/8_years_ago_today_ucl_semi_finals/"
    },
    {
        "id": "1kdni2s",
        "author": "Timely-Cranberry-767",
        "title": "Rodrygo 24/25 v Rodrygo 23/24 [LEFT-RIGHT respectively] season stats for goals and assists La Liga. Are we being too critical on him when the obvious offender for the disappointing season is a failure in defense, namely a lack of proper healthy CBs and a competent natural RB?",
        "content": "",
        "upvotes": 63,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kdni2s/rodrygo_2425_v_rodrygo_2324_leftright/"
    },
    {
        "id": "1kdsimx",
        "author": "DonuandDeca",
        "title": "Squad List for the Celta Vigo game on Sunday",
        "content": "Glad to see Jacobo, he'll probably get minutes in the absence of Rüdiger and Alaba. Rodrygo is not on the list, maybe he has a slight injury?",
        "upvotes": 22,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DgpqR8it9m1uxu8vsk3brILBBELxr5vEWiwIKp5iGrg.jpg?auto=webp&amp;s=9c152292efcc6a8e0d7cbe22fb79f0c633fae0af"
        },
        "permalink": "/r/realmadrid/comments/1kdsimx/squad_list_for_the_celta_vigo_game_on_sunday/"
    },
    {
        "id": "1kdmwet",
        "author": "Timely-Cranberry-767",
        "title": "Rodrygo[LEFT] v Vini Jr.[RIGHT] stats for the 2024/25 season taken from FootyStats in La Liga",
        "content": "Since there's talks about the club making moves to sell Rodrygo this summer, I felt it was apt to share their stats this year with the madridistas. It is to be noted that Rodrygo has a total of **1937 mins** in appearance for the club and Vini Jr has **2046 mins**. Both have the same number of games started, 22 games.\n\nI'll link the source here for [Vini Jr](https://footystats.org/players/brazil/vinicius-junior) and [Rodrygo](https://footystats.org/players/brazil/rodrygo).   \n  \nWould it make sense to give Rodrygo one more season under a new manager, even if a strong offer comes in this summer? Considering he'll be competing for the wide or forward roles with both Vini Jr. and Mbappé, isn’t there a risk that his potential could go to waste if he’s not a guaranteed starter? Especially if the team continues with a narrow 4-4-2 formation? Let's be real the 4-3-3 system with all three forwards starting wasn't a success in any sense as we'd thought it'd be before the season started.",
        "upvotes": 46,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kdmwet/rodrygoleft_v_vini_jrright_stats_for_the_202425/"
    },
    {
        "id": "1kd0bw1",
        "author": "dark4403",
        "title": "Real Madrid will not renew Lucas Vázquez's contract, ending his time with Real Madrid after a lifetime in white.",
        "content": "",
        "upvotes": 1107,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LP-7Mz_Ody1istVpyJfFK7LKt04_8mcn3eaAH-SWhXY.jpg?auto=webp&amp;s=d20ef93137ffc0f626f1319f85677c1fff20bab2"
        },
        "permalink": "/r/realmadrid/comments/1kd0bw1/real_madrid_will_not_renew_lucas_vázquezs/"
    },
    {
        "id": "1kd92ur",
        "author": "CriticismPlayful4113",
        "title": "Raúl Asencio from La Fábrica",
        "content": "Asencio has been a great find this season. Hope more youth players get chance in the first team. Video credits - FZ Football\n\n",
        "upvotes": 269,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ies0ezs63fye1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kd92ur/raúl_asencio_from_la_fábrica/"
    },
    {
        "id": "1kd5g77",
        "author": "Miserable-Subject-87",
        "title": "Florentino is out there looking for free agents when we actually need reinforcements right now.",
        "content": "The two center-backs Real Madrid wants are Saliba (contract ends in 2027) and Konaté (contract ends in 2026). Both are very difficult to sign this summer.\n\nPersonal opinion: I think it’s unavoidable that they must sign a center-back this summer, even if it’s not one of these two. -Ramón Álvarez de Mon\nSource: X @Ramon_AlvarezMM",
        "upvotes": 188,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eBcrkMjM1AssPYwS0Ipb8i083s1oCIqCeCG_75jSstU.jpg?auto=webp&amp;s=de89839c9204770258bd7782b8aa222da613bc9a"
        },
        "permalink": "/r/realmadrid/comments/1kd5g77/florentino_is_out_there_looking_for_free_agents/"
    },
    {
        "id": "1kdc1ib",
        "author": "CuteAction1698",
        "title": "Alexander-Arnold: luz verde para el Mundial... con condiciones",
        "content": "# [AS] Liverpool are open to accepting Real Madrid’s request for Trent Alexander-Arnold to join earlier &amp; play in the Club World Cup, on these conditions: He would have to waive his last month’s salary and Madrid would have to pay a fee - it would be under €1M.",
        "upvotes": 70,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/znaP1725b_uvRsBfBU-cwZQdXgYBn44kIet-PEEd2Fk.jpg?auto=webp&amp;s=b1be09aa28051d15f0e003a433ba1614dfe2298c"
        },
        "permalink": "/r/realmadrid/comments/1kdc1ib/alexanderarnold_luz_verde_para_el_mundial_con/"
    },
    {
        "id": "1kd6u9d",
        "author": "martino732",
        "title": "Stadium Debt? Concert Fiasco? Here’s the Truth About Real Madrid’s Finances",
        "content": "",
        "upvotes": 138,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2C7JifWMOGc3WS0hDDZgbtqGFrj0nK-Tk9o586aAiIY.jpg?auto=webp&amp;s=f32fe3e601b7e5e464bf8e28560d067db4802a0a"
        },
        "permalink": "/r/realmadrid/comments/1kd6u9d/stadium_debt_concert_fiasco_heres_the_truth_about/"
    },
    {
        "id": "1kcrh1z",
        "author": "AjVine",
        "title": "Yamal hype is real but Mbappe did it first and faster",
        "content": "To those saying we’ve never seen anything like Lamine Yamal before, let’s slow down and look at the facts. Yes, he’s incredibly talented and mature for his age, but Mbappe at 17 was already breaking through with Monaco, not a varca. He scored 28 goals and made 16 assists in just 46 games. That’s nearly double Yamal’s goals in less than half the matches. And this wasn’t in a team built around youth development and possession,this was Ligue 1 football. So while Yamal is special, acting like he’s the first of his kind ignores just how elite Mbappe already was back then.",
        "upvotes": 842,
        "comments": 502,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x7wy7sn4gaye1.jpeg?auto=webp&amp;s=7e90d40d9d286f6e45183d1c08f4c6dbc6f8f940"
        },
        "permalink": "/r/realmadrid/comments/1kcrh1z/yamal_hype_is_real_but_mbappe_did_it_first_and/"
    }
]