[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 501,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jjjsmn",
        "author": "Somethingman_121224",
        "title": "'Adolescence' Becomes First-Ever Streaming Show to Top British T.V. Ratings",
        "content": "",
        "upvotes": 71,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjsmn/adolescence_becomes_firstever_streaming_show_to/"
    },
    {
        "id": "1jjmiub",
        "author": "BackgroundShallot5",
        "title": "Does anybody else get the 14 day not in your house bs? While in their home.",
        "content": "While using (literally) the only device in my home that uses netflix i am getting asked to make a temporary 14 day pass. Anybody else getting this bs?\n\nFor full context netflix is seldom used and honestly if it wasn't for this I would likely continue to be subscribed to a service which is quite frankly not worth the cost. \n\nThe next time this happens I will be immediately cancelling the subscription but I was wondering if anybody else was suffering at the hands of this incompetence (uk based)",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjmiub/does_anybody_else_get_the_14_day_not_in_your/"
    },
    {
        "id": "1jjcqqx",
        "author": "hd-report",
        "title": "Netflix adds HDR10+, promises the spec for all HDR titles by end of 2025",
        "content": "Netflix has added HDR10+ to streaming and promises the spec for all HDR titles by end of 2025. Source: Netflix Tech Blog [https://netflixtechblog.com/hdr10-now-streaming-on-netflix-c9ab1f4bd72b](https://netflixtechblog.com/hdr10-now-streaming-on-netflix-c9ab1f4bd72b)",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jjcqqx/netflix_adds_hdr10_promises_the_spec_for_all_hdr/"
    },
    {
        "id": "1jjncfn",
        "author": "x7007",
        "title": "Netflix Windows 11 Dolby Atmos on PC",
        "content": "Once before Netflix worked with DTSx Headphones and Atmos for headphones, for a long time it doesn't. when DTSx is enabled it shows 2.0 on ALT + SHIFT + D and says Spatial Sound logo.\n\nWhen using Atmos it shows 5.1 Atmos sound decoder and Dolby Atmos logo.\n\nWhy is that? shouldn't DTSx and Dolby be the same? am I missing something in windows 11 to play both of them or netflix changed something a long time ago?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjncfn/netflix_windows_11_dolby_atmos_on_pc/"
    },
    {
        "id": "1jjn4f3",
        "author": "scarletwitchmoon",
        "title": "The Residence. I enjoyed it for the most part.",
        "content": "I guessed the killer by episode 2. Don't worry; I won't spoil or even hint. I just wasn't shocked at all. I have thoughts of who it could have been instead or the kind of motive I'd have preferred, but I won't share that either.\n\nMy only criticism is that the episodes should have been shorter. There were scenes that were longwinded and convoluted due to the length. It could have been 10-12 quick episodes instead of 8 super long ones. A minor nitpick I had is that the piano music they played sometimes was too similar to Only Murders in the Building. The piano music made sense because the characters in OMITB lived in an apartment where they used the elevator. \n\nOn a positive note, I thought the performances were all phenomenal. I absolutely loved Cordelia Cupp as a detective. I do wish the show had been set up for future seasons. She was very compelling as a lead. \n\n**What other murder mystery shows/movies have you seen?** \n\n I've Watched:\n\n* Psych\n* Monk\n* CLUE\n* How To Get Away With Murder\n* Only Murders in the Building\n* Murder Mystery &amp; Murder Mystery 2\n* Knives Out\n* Murder on the Orient Express\n* Sherlock Holmes (the movies and the show) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjn4f3/the_residence_i_enjoyed_it_for_the_most_part/"
    },
    {
        "id": "1jjo6k9",
        "author": "x7007",
        "title": "Netflix App Windows 11 keep freezing exactly after Next Episode",
        "content": "Hi, every time the next episode bar shows and finished and supposed to start the next episode, Netflix APP Freeze the whole COMPUTER!  and needed to RESTART the whole system!!!\n\nWith EDGE it Works PERFECT.\n\nI can't believe HOW AN MOVIE APP CAN CAUSE THAT. that's unthinkable. I uninstalled the shyyyti Netflix APP and I'll use EDGE ONLY, it's exactly the same . if that stop working I'll just cancel subscription, can't deal with that really, ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjo6k9/netflix_app_windows_11_keep_freezing_exactly/"
    },
    {
        "id": "1jj0oj9",
        "author": "Kalliaschnikow",
        "title": "what's the big deal about adolescence? or do i just not get it",
        "content": "when i saw the trailer, it didn't quite convince me. i only started watching the series because there was so much written about it here. I mean yes of course the acting is good, the story is well designed and focuses on other characters than just the killer. But I just don't get the huge hype about it. what did I miss? (this is not meant to be a rant but a serious question)\n\nEdit: I think the social issues that are highlighted there are portrayed much better and in more detail in other series, so I'm surprised that even though the subject matter doesn't get as in-depth here, it still has a bigger impact on people than series/movies that have previously focused more heavily on issues like incels, misogyny, social media and its effects on young people etc ",
        "upvotes": 39,
        "comments": 190,
        "media": null,
        "permalink": "/r/netflix/comments/1jj0oj9/whats_the_big_deal_about_adolescence_or_do_i_just/"
    },
    {
        "id": "1jjlpn5",
        "author": "Damienisok",
        "title": "Good anime or animated shows to watch (preferably anime or something in a style similar to anime because it gives me a bright tingly feeling and I really need that rn)",
        "content": "Also I just wanna say that I watched adolescence and didn't think much of it after that but was absolutely shocked by how many people were discussing it here, anyways like the title says.\n\nPost I made in another community listing what anime I watch ↓\n\nI have watched a lot like hxh, erased, blue exorcist, devilman crybaby, forget what it's called but the one where their dead friend appears and they hang out with her, death note, promised Neverland, black butler, Ouran highschool host club, romantic killer + more, I'd prefer an anime with no romance because I've just gone through a breakup",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jjlpn5/good_anime_or_animated_shows_to_watch_preferably/"
    },
    {
        "id": "1jjlmvs",
        "author": "AMoistLemon",
        "title": "Zero Day - Poor Color Grading, Top Dark!",
        "content": "After trying it on four devices, and turning on all sorts of TV options.. it's still so crushed, dark, devoid of light.\n\nWhy are show editors continually making the final edits so difficult to enjoy if you're not in a pitch black room? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjlmvs/zero_day_poor_color_grading_top_dark/"
    },
    {
        "id": "1jiu30i",
        "author": "sashakoltsov",
        "title": "Would you watch Adolescence with your teenage kid?",
        "content": "I’m a father of almost 15 and 10-year-old boys living in the UK. I watched the show in one go yesterday and can’t stop thinking about it. It’s hard to describe this mix of moments from the show, memories from my childhood, memories of my kids, and the ambient worry I have in my head now. My wife doesn’t watch intense shows, but I feel that we need to experience it together and speak about it. I was wondering if we could watch it with our older kid as well. I’ve discussed the premise with him, and he seems interested (hard not to). \n\nI feel that watching/reading things together could be a great conversation starter for some topics. Kids and I still read books together before bed, and we had some great chats while reading ’The Body’ and ‘Girl Who Loved Tom Gordon’; and we’re currently watching ‘Atypical’ together, which they really like and very keen to share their thoughts on.\n\nI’m sure his perspective on Adolescence will be completely different from mine (as mine will be different from my wife’s) and I’m both interested and scared. The show doesn’t give you any answers; it seems that everyone sees different things in it and relates to the characters in a different way. What will a teenage boy see in the story, what will their reaction be like, and what conclusions will he get to? How will he talk about it with his friends? Is it too intense?\n\nI know it very much depends on a kid and their sensitivity but what are your thoughts? Has anyone watched the show with their teenage kids?",
        "upvotes": 64,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1jiu30i/would_you_watch_adolescence_with_your_teenage_kid/"
    },
    {
        "id": "1jjjvnw",
        "author": "BackgroundAvocado224",
        "title": "Con Mum",
        "content": "Dare I say the only person I feel sorry for is Peng and the other couple. Why on earth would you spend £300K on a mum who hasn’t been in your life for 45 years abandoning your partner and child for her. \n\nDare I also say Dionne is actually a successful business woman - she sure knows how to run a scam. ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjvnw/con_mum/"
    },
    {
        "id": "1jj53ud",
        "author": "okbunz",
        "title": "The Residence Ending",
        "content": "Hey everyone, I just finished watching The Residence and something's been bugging me about the ending.\n\nAt the very end of the final episode, Cordelia Cupp makes a point of stopping by to visit Nan Cox (played by Jane Curtin) on her way to the airport. I couldn’t help but feel like this moment had some deeper significance, but I’m not sure I fully understood it.\n\nWas there something more to this visit that I missed? Was it meant to be symbolic of something? Would love to hear your take on it!",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jj53ud/the_residence_ending/"
    },
    {
        "id": "1jj0srv",
        "author": "MamaMia1325",
        "title": "What are your top 3 Netflix comfort watch shows?",
        "content": "I recently finished watching Younger, I loved it and it’s now my top comfort watch show.\n\nSanta Clarita Diet\n\nDexter \n\nSchitt’s Creek was my favorite when it was on Netflix.\n",
        "upvotes": 19,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jj0srv/what_are_your_top_3_netflix_comfort_watch_shows/"
    },
    {
        "id": "1jikozu",
        "author": "sidroy81",
        "title": "‘Did you say India?’: Stephen Graham shocked by Adolescence blowing up in India, says the show came to him in a flash",
        "content": "",
        "upvotes": 163,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1jikozu/did_you_say_india_stephen_graham_shocked_by/"
    },
    {
        "id": "1jijpqx",
        "author": "DifficultVirus5751",
        "title": "Adolescence Jamie Katie online bullying",
        "content": "I know there’s a lot of discussion on whether Katie was bullying Jamie, or was he calling him out on his behaviour and attitudes towards women. That’s a whole other convo and one I’ve had with a few people over the last few days but something that seems to have been overlooked a lot..\n\nIn the first episode when Jamie is being questioned by the cops, they show screenshots of the Instagram profile with the model and in the cop’s own words, Jamie had left “aggressive” comments on her photos. He’d also reposted her photos on to his own insta account, meaning his classmates would’ve seen it. \n\ntake away all the other factors (Katie having her n*des shared, Jamie’s blatant terrible  attitudes towards women, him trying to ‘get’ Katie at her weakest) wouldn’t just her seeing his aggressive comments be “justification” enough for leaving the emojis on his photos? \n\nWould it be a mature way to handle the situation? No. But she’s 13. And comments/ messaging on social media is their language. But I can’t help but think if a kid had made openly racist or homophobic comments on someone’s photos which was seen my a classmate, then said classmate posted some emojis reflecting this…. It wouldn’t be “bullying” it would be calling a spade a spade. ",
        "upvotes": 192,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1jijpqx/adolescence_jamie_katie_online_bullying/"
    },
    {
        "id": "1jj7wt3",
        "author": "GoompyBoopy",
        "title": "Australians, how is Kaitlyn Dever’s Accent in Apple Cider Vinegar?",
        "content": "I would love to hear how authentic Aussies think of her accent? As an American, I think it sounds pretty authentic, but then again, when I was a kid I thought Duck Van Dyke sounded real in Mary Poppins…",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jj7wt3/australians_how_is_kaitlyn_devers_accent_in_apple/"
    },
    {
        "id": "1jjdk22",
        "author": "PlantedinCA",
        "title": "I’m sucked into “Until You Burn.”",
        "content": "After watching Queen of Flow, Netflix shows me an ever rotating cast of telenovelas. Not all of them satisfy my cravings for popcorn television.  \n\nBut 4 episodes into Until You Burn, I am sucked in.  \n\nThe story here is a typical brother is seeking to avenge the death of his brother. It looks like he was murdered by someone a wealthy family or connected to them.  \n\nA few things of note in this telenovela compared to others I have scanned or skipped:\n- class theme are pretty typical, but this one is also layering in race on top of the class\n- since there is a race theme here, there are visible Black people and even supporting characters that get screen time and dialogue \n- I don’t speak Spanish so I am watching with English subtitles. I know some words here and there but so some translations look a little funny\n- this show is set in the beach, at sea - really pretty visuals \n- the sounds track is great and seems to be covering a good selection of Colombian music \n- this doesn’t seem to have any cartel angles which is such a common stereotype of Colombian shows, this seems to be a more basic poor guy gets revenge on rich people story - not unlike the show Revenge which I also really enjoyed. \n\nIf you like revenge dramas where the character is playing the long game to infiltrate, you’ll probably enjoy this one, based on the first few episodes. \n\nIt also seemed to be super popular in Colombia - getting like 35-40% prime time viewers so that bodes well for an engaging 60 episodes. And it just finished its run in February so it made it to Netflix quick. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjdk22/im_sucked_into_until_you_burn/"
    },
    {
        "id": "1jj890g",
        "author": "DarkLink287",
        "title": "Add member",
        "content": "So I've changed my account membership to where is basic without ads and I purchased an extra member so my gf can watch at her place. I keep going to send the email invite and it says that email is already in use. Idk what to do. She previously had her own Netflix but not anymore. Idk what to do. We even had her make a new email address and I sent an invite to that. She hasn't received it. And now whenever I try to send it again Netflix just keeps saying 'please try again later '. I don't even know. Just....can someone help on any way? Thank you",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jj890g/add_member/"
    },
    {
        "id": "1jjbgmf",
        "author": "IntelligentSide5485",
        "title": "World War Documentaries or series",
        "content": "I'm on a quest for compelling series or documentaries about World War I or II. Looking for insightful narratives, historical accuracy, and engaging storytelling. Any recommendations beyond the usual suspects? Share your favorites, whether they're well-known classics or hidden gems. Bonus points for those focusing on lesser-known perspectives or events! #WorldWar #Documentary #Series #History #Recommendations",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jjbgmf/world_war_documentaries_or_series/"
    },
    {
        "id": "1jifv56",
        "author": "Significant-Fun-4235",
        "title": "What's a Netflix show you loved but it got cancelled?",
        "content": "https://preview.redd.it/et700prrejqe1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=0d9b7be79f5979d79f4cbaea8efafdc7c19defe0\n\nNow i know there are literally hundred of shows that are canceled, but Netflix has had a bad reputation when it comes to canceling shows that get love from fans. For me, it will always be Archieve 81! \n\nIt was creepy, mysterious, amazing, and literally had what it takes to become a Stranger Things-level show, if not bigger. ",
        "upvotes": 133,
        "comments": 704,
        "media": null,
        "permalink": "/r/netflix/comments/1jifv56/whats_a_netflix_show_you_loved_but_it_got/"
    },
    {
        "id": "1jj6nq3",
        "author": "Khabib155KimurA",
        "title": "Buried Truth- The Sheena Bora case- My thoughts....",
        "content": "My jaw dropped with every Episode.\n\nI would have rather they did this in their native tongue instead of English. \n\nIndrani -the murderer, is literally the director of EPS 3 and 4 \n\nI just can't believe people like Indrani exist in RL. I knew things were fishy when the guy in white originally found the body, but the police never made an official report. Ganesh the guy who reported the body the first time\\] must have been so freaked out when the police came a second time. I think the old police chief Dattatraya and the following one, Rakesh were paid off by Peter. \n\nShe never loved Sheena. Or Mikhail. They were thorns in her side. In the 15 years that she abandoned them, she never sent any of them gifts of presents. NEVER sent them letters to show that she was thinking of them. And I guess when she was like 18 and away. I get that she was happy to be away from her abusive dad and just wanted to be a Teenager, I get that, \n\nShe is a victim. \n\nBut as she got older and met Sanjeev she completely completely abandoned both of those kids and forgot that they ever existed. Her parents were on the brink of poverty. And forced her to take responsibility. She must have been horrified when they took the plane over. \n\nI do notice that Indarani was completely happy to dump her first two  kids, but was adamant she was taking Vidhie. Because she was the only child that she actually loved. \n\nImagine, faking your own son's drug habit and putting him in a mental institution????????\n\nThey had so much dirt on her and Indarni knew that they would have a hold on her and her purse strings forever. I definately think that she killed Sheena. It's like she never wanted the older ones to exist, and I believe Mikhail when he accuses her of trying to kill him too. \n\nIndrani is a TERRIBLE liar. Clearly it's Peter's money that has kept her out of prison.\n\nPeter is also a piece of shit, Bc you are lying to your son on behalf of your wife, and covering up the murder of your son's fiance and lying to him on the phone? It's all sooooo sick!\n\nSo Rahul and Sheena were step-siblings by marriage?\n\nEven after she killed Sheena Indrani is still so angry at her. Taking over her emails and phone. Indrani as sheena sends a rude email to Vidhie, and ends it with Rahul. \n\nI wonder did Rahul and Peter refuse an interview, and what is their relationship like now? When Rahul and Sheena started dating, I think that was the beginning of the end for poor Sheena. \n\nHow can Vidhie say that she was never really part of Peter's family when Peter raised you as his own. Not to mention, you bad mouthed your mother to keep Peter's family cheques coming in. I just get user vibes from Vidhie and Indrani.\n\nIts just funny that as soon as Indrani got the bulk of Peters money in the divorce. Suddenly, Vidhie's a mommy girl now?\n\nIt's just very weird Sheena goes missing and Mikhail \\[her sibling\\] and Vidhie who treated Sheena like a sister didn't look for her? Why not? Vidhie makes them sound so close. Sheena goes missing and there are no questions?  \n\nReally?\n\nJust because Mikhail could be a \"bum\" or lazy. It still doesn't change the fact that you killed sheena, Indrani. Constantly trying to make your oldest children as villians is NEVER going to make you look good. \n\nThe show does a **terrible** job concerning the verdict, you're just kind of left hanging as to what the judge decided and if the bail was temporary or what?\n\nHow does her lawyer Rajeesh, sleep at night after her defended her in court. \n\nAs Indrani talks about Sheena she can't even force ONE tear or pretend to be upset. \n\nThis show just made Indrani looked psychopathic. \n\n  \nIt's a shame that no-one else wanted to come on, bc I really wanted to hear Peter Sanjeev and Rahul's side of the story. But I understand why. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jj6nq3/buried_truth_the_sheena_bora_case_my_thoughts/"
    },
    {
        "id": "1jiaf2l",
        "author": "Glass-Relative-9849",
        "title": "I Think adolescence is genuinely one of the most eye opening pieces of media made recently.",
        "content": "From the desensitised nature of the children in the school only asking for videos of the murder to the cheering and filming in the school fight as well has his friend casually lending him a knife to \"scare\" Katie. The pupils not listening to teachers who are emotionally and physically absent towards all of the children plus the children's refusals to take part/ care about the lessons or authority at all. This is even shown after Jamies  dad confronts the teens who vandalised his car laughing at his genuine struggle and emotion. Jamies behaviour towards women such as the psychologist and his mum and his immediate switches in attitude towards any male figures. The obsessive lying such as about pickles, marshmallows and his small ways of putting the psychologist down like calling her old or being rude about her sandwich as well as his mum where he says shes good at nothing but cooking roast. the obsession with media shown through his isolation into his bedroom after receiving a gaming set up. its not explicitly said he was watch the red pill andrew tate type media however its inferred. the detective who cannot connect with his son in the slightest due to his isolation and even the detective (I believe) viewing him as less than (due to his former popularity and the son not being popular). the way real society has received this media as well many people denying Jamie did it after CCTV showed explicitly what happened or justifying it due to Katies \"bullying\" which was just calling Jamie out on his genuine misogynistic views towards katie and girls in general. Believing he's better than other men as he didn't SA katie even thought he \"had the chance\" and after his guilt was discovered he less regularly said \"i didn't do it\" but switches to \"i didn't do anything wrong\" showing his rationalisation of his actions due to his veiws on women. This show is amazing i've never seen anything so real and so accurate of our society ever. I could write an essay about this show and these are just SOME of the tiny details in the show that i missed at first but its crazly well written and has a scarily accurate depiction of the disheartening youth culture currently so well. \n",
        "upvotes": 265,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1jiaf2l/i_think_adolescence_is_genuinely_one_of_the_most/"
    },
    {
        "id": "1jj1wdf",
        "author": "PrettyGirthy",
        "title": "Netflix Preview Club Focus Group",
        "content": "Hello all,\n\nMy wife and I are part of the Preview Club and have been for over a year. We were finally accepted to the focus group for a recent film. I was excited because I wanted to be part of focus groups for every film and show we’ve watched. This is where I ran into problems.\n\nThe account is under my wife’s name and email and when I joined the Zoom I was told I couldn’t participate because I wasn’t my wife. I’ve since changed the email on the account to mine but I’m unable to change the main user from her. \n\nHas anyone else experienced this and have any solutions? I’m also curious whether I’ve screwed myself out of the Preview club by changing my information.\n\nThanks for any response.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jj1wdf/netflix_preview_club_focus_group/"
    },
    {
        "id": "1jjhco4",
        "author": "Mountain-Serve826",
        "title": "Ihr Gerät gehört nicht zum Netflix-Haushalt für dieses Konto",
        "content": "Meine Eltern sind seit ein paar Jahren getrennt aber ich hatte bis letztens immernoch Zugriff aufs Netflix Konto. Jetzt sagt Netflix, dass mein Gerät nicht mehr zum Haushalt gehört. Wisst ihr was ich tun muss?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjhco4/ihr_gerät_gehört_nicht_zum_netflixhaushalt_für/"
    },
    {
        "id": "1jj8vwk",
        "author": "katiebxby",
        "title": "audio continuously cutting out",
        "content": "hi, i’m currently watching netflix on my xbox, and the sound is coming out of my TV, but the audio is periodically cutting out for like 1 second at a time every 2 seconds and it’s rather frustrating. Anyone here know what the issue is? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jj8vwk/audio_continuously_cutting_out/"
    },
    {
        "id": "1jj4e2k",
        "author": "majdegta266",
        "title": "Wouldn't it be great if there was more \"my list\" options?",
        "content": "...like a list of things I've seen and liked and maybe wanna see again, and another list of things I haven't seen yet. Or like amazon where I can see a list of series and a list of movies I have saved.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jj4e2k/wouldnt_it_be_great_if_there_was_more_my_list/"
    },
    {
        "id": "1jirfax",
        "author": "Fit-Object5402",
        "title": "The Residence Ending Question",
        "content": "Did anyone understand why they had the Detective go back to the White House and talk to the presidents mother in law on the way to the airport? I don't get it.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jirfax/the_residence_ending_question/"
    },
    {
        "id": "1jjg7b8",
        "author": "FirTrader",
        "title": "Adolescence was boring",
        "content": "I read some people here ranting and raving about “Adolescense”, so I thought, “Great! A good show to watch!”  I watched all four episodes and was bored the whole time, but I kept with it.  I was hoping the end would be really good or something.  Nope.  It has a few interesting moments, some nice camera work, and it captures grief and sadness pretty well; but that’s about it.",
        "upvotes": 0,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1jjg7b8/adolescence_was_boring/"
    },
    {
        "id": "1jiwsbp",
        "author": "pinkvelvetcake",
        "title": "Question about sharing",
        "content": "So I have a Netflix account, and until today I was sharing it with a friend who lives in an entirely different state. Two profiles, one account, different places, no problem. Today we tried adding her roommate as a separate profile, and it had me \"update the household\" but when I did it changed the home wifi to theirs and is now gatekeeping \\*me\\* from using the account.\n\nIf I change the home wifi back to mine and remove the third profile, will it go back to how it was? Or, if I buy an extra member slot, will it let us use all three profiles?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jiwsbp/question_about_sharing/"
    },
    {
        "id": "1jiwjzs",
        "author": "Old_Salad_7692",
        "title": "Captain fall season 2",
        "content": "I can’t say how much I loved season 1 of captain fall a lot of people say they never liked it but I really did, \n\nA adult style animation that doesn’t use the same family guy character design , plot or jokes I hate how it ended with a cliff hanger \n\nI done some research and season 2 was voiced written etc but never animated is there any lost episodes of them?\n\nAnd also is there any other shows similar like that that I can watch ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jiwjzs/captain_fall_season_2/"
    }
]