[
    {
        "id": "1o5fl5p",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 924,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o5fl5p/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1o7he6h",
        "author": "Nyghl",
        "title": "\"I have full confidence in Xabi Alonso. If one day he tells me to play goalkeeper, I’LL BUY GLOVES!\" - Arda Güler to L'Equipe in a recent interview.",
        "content": "(Put Meme flair due to the image edit I've done :D)",
        "upvotes": 820,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/337rb8vz7bvf1.png?auto=webp&amp;s=a08de6329a8a58a84517b874da99dad41fea41b5"
        },
        "permalink": "/r/realmadrid/comments/1o7he6h/i_have_full_confidence_in_xabi_alonso_if_one_day/"
    },
    {
        "id": "1o79utx",
        "author": "ViniciusFastAF",
        "title": "If both Kaká and Özil were at the absolute peak of their powers and completely free of injuries, who would you start in your Real Madrid midfield ?",
        "content": "",
        "upvotes": 952,
        "comments": 194,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/13njxzwct9vf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o79utx/if_both_kaká_and_özil_were_at_the_absolute_peak/"
    },
    {
        "id": "1o7skvx",
        "author": "rcfith",
        "title": "Miss him so much. He was an absolute gem of a footballer.. The German sniper",
        "content": "",
        "upvotes": 83,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/begua2fegdvf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o7skvx/miss_him_so_much_he_was_an_absolute_gem_of_a/"
    },
    {
        "id": "1o7gs2y",
        "author": "TheFeatherDiaries",
        "title": "Arda Guler : ''When I wasn't playing, it was difficult, but it fueled my ambition. I was biding my time.''",
        "content": "Arda Güler on joining Real Madrid from Fenerbahçe  : I knew I was joining the biggest club in the world. But from my very first training session, I realized I had the quality to play here. I never doubted that I would eventually succeed  \n  \nArda Güler on lack of playing time in the last two seasons : Juni Calafat had explained the plan to me. He told me the first season would be difficult, and that it was logical for a player who had only experienced football in Turkey. He also told me that I was coming in for the post-Modrić and Kroos era. Everything was clear and honest  and that’s how it should be.  \n  \nArda Güler on Carlo Ancelotti: “Carlo Ancelotti is one of the greatest coaches in history. We mustn’t forget that he told the press that I would become one of the best midfielders in the world one day. Davide Ancelotti also always tried to help me. I’m grateful. When I wasn't playing, it was difficult, but it fueled my ambition: I was biding my time.''\n\nArda Güler on winning UCL 2023/24 : “UCL 2023/24? I never won it. It wasn’t mine. We have to go and win a new one.\"\n\nArda Güler on his chemistry with Mbappe:  “Mbappé’s qualities and mine are made for each other. We understand each other really well, it’s fluid. Sometimes, we talk a little before matches - *''Today, we should do this, that.* \" There are also nights when a glance is enough.”\n\nArda Güler on Mbappe leaving his CF spot : “Mbappé criticized for dropping too deep sometimes? I think we have to let him play where he wants. He must benefit from the freedom his talent gives him the right for. If he drops into the middle, if he drops back a little, it’s not for nothing. He has the knowledge to do it, he understands what the game demands. When he does that, it’s up to me to go and occupy his place.”\n\n Arda Güler on comparison with Özil : “Me &amp; Mbappé compared with Özil &amp; Cristiano? It’s cool, it’s nice. They’ve done great things. But it’s always the team that goes after the big achievements, never two players.”\n\nArda Güler on Juni Calafat : “Juni Calafat helped me a lot last year, he explained to me that I need to have patience because of the legends at the club, I understood that, I was a kid coming from Turkey.”\n\nArda Güler on his relationship with Xabi : “I have full confidence in Xabi Alonso’s plans. If one day he tells me to play goalkeeper, I’ll buy gloves!”\n\nArda Güler on expectations from him: ''The noise around me — I’ve never seen it as pressure. It’s something that actually helps me push further. It’s like I need that.''\n\nArda Güler on the Xabi Alonso era : I’m convinced we’re moving in the right direction. I don’t know exactly how long it will take, but we’ll be ready when the time really comes.",
        "upvotes": 254,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/reG0lu5WLSaMyqObwWpwVMMPNbnvEoV9ds7Q8L-sO0k.jpeg?auto=webp&amp;s=f610b3f6e0384c0e68ad2f32b85bc1395e0e4cc9"
        },
        "permalink": "/r/realmadrid/comments/1o7gs2y/arda_guler_when_i_wasnt_playing_it_was_difficult/"
    },
    {
        "id": "1o7q4gf",
        "author": "FrrancondonaEra",
        "title": "cant wait for trent to come back and piss the scouser even more.",
        "content": "",
        "upvotes": 67,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/em5u0dlewcvf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o7q4gf/cant_wait_for_trent_to_come_back_and_piss_the/"
    },
    {
        "id": "1o77o50",
        "author": "Bosphore9",
        "title": "Today is Mesut Özil’s birthday, here’s his last match for Real Madrid",
        "content": "Joined in 2010 and left in late 2013. The former and retired Real Madrid player is now 37 years old. Here’s his last match of one of the best playmakers that ever existed for the club. The match took place on 26 August 2013, the second journey of LaLiga BBVA in which he was substituted after an hour. Benched in the next game he left the club the day after.",
        "upvotes": 474,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zwml0ahn99vf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o77o50/today_is_mesut_özils_birthday_heres_his_last/"
    },
    {
        "id": "1o7ju2i",
        "author": "Humble-Ad3419",
        "title": "DECLARACIONES SOBRE CORRUPCIÓN EN EL FC BARCELONA",
        "content": "LLUIS CANUT (PERIODISTA TV3):\n\n\n\n\"A mí me contó una persona vinculada con el estamento arbitral que la primera vez que conoció a Núñez como presidente del Barça, Núñez le expresó su deseo oculto de querer comprar algún día a un árbitro. Hasta que se encontraron con un árbitro con problemas económicos para pagar las letras de su piso\", \"El Barça, a través de la empresa de Núñez y Navarro, negoció con el banco del árbitro las letras que se tenían que descontar del piso y se las iba pagando poco a poco en función de los partidos que dirigía al FC Barcelona\". \n\n\\-------------------------------------------------------------------------\n\nPACO ROIG (EX PRESIDENTE DEL VALENCIA):\n\n\n\nUn exárbitro me conto que un representante del Barça le dijo en un Barcelona-Elche, 'oye me puedes hacer un favor, yo quiero entrar a conocer al colegiado del partido'. Decía que llevaba un millón de pesetas. Y decía: si gana el Barcelona, el millón de pelotas se lo daba al árbitro. Si pierde el Barcelona, lo devuelvo. Y si empata, me quedo la mitad. Esas cosas pasaban a lo largo de muchos años\".\n\n\\---------------------------------------------------------------------\n\nLLUIS BASAT (EX CANDIDATO A LA PRESIDENCIA DEL BARÇA):\n\n\n\n“En 2003 una persona muy importante del club me dijo que que no podría ser presidente porque \"no sabía cómo comprar un árbitro\".\n\n\\---------------------------------------------------------------------------\n\nSIQUE RODRÍGUEZ (PERIODISTA CULE DE SER CATALUÑA QUE DESTAPO EL CASO NEGREIRA): \n\n\n\n\"A principios de febrero, ya lo tenemos para sacarlo. Ahí, hablamos con la gente del Barça y le decimos qué es lo que tenemos, con el club como principal implicado, para que respondan en el programa o preparen una respuesta, porque es un tema muy grave\".\n\n\"Ahí es cuando en el Barça nos piden si podemos aguantar el tema un par de semanas para preparar la respuesta a nivel interno, público... De hecho, la frase textual es: 'Somos un condenado a muerte que os pide el último deseo'\".\n\n“Tuve una reunión con 2 personas, nos dijeron dónde estuvo Negreira años atrás jugando al póker… sí, quedaba en bares con los árbitros… y que había maletines… pero quienes lo decían no querían aparecer públicamente“.\n\n\\-------------------------------------------------------------------\n\nMILLA (EX JUGADOR DEL BARCELONA Y REAL MADRID):\n\n\n\nEl jugador del Real Madrid Luis Milla aseguró ayer en el programa El Largero, de la cadena Ser, que en las vísperas del último partido de Liga de la temporada pasada, que su equipo disputó contra el Tenerife, recibió una llamada de un compañero de profesión, quien le ofreció dinero por dejarse ganar. En aquel partido el Madrid, al ser derrotado por 3-2, perdió la Liga...\n\n\\-------------------------------------------------------------------\n\n GODALL (VICEPRESIDENTE DEL BARÇA):\n\n\n\n (2012) \"Tenemos que estar al lado de las entidades en las que se ejerce el poder y no darles la espalda. Recuerdo que en su día Laporta lo tuvo clarísimo. ¿A qué presidente apoya Florentino? A Gerardo González. Entonces al Barça le conviene apoyar a Villar y tener una buena relación con la federación, donde se cuecen los comités de árbitros, la competición y la Liga\"... \n\nY luego conectó su buena relación con la federación con lo que él denominó un \"saldo arbitral favorable\".\n\n\\----------------------------------------------------------------------\n\nJOSE MARIA ENRIQUEZ NEGREIRA (HIJO DE NEGREIRA):\n\n\n\n\"El Barça mintió en Hacienda para desligarse de mi padre y me usó como pretexto\", \"Los 7,5 millones no fueron por los informes, yo cobré 60.000 €\".\n\n\\---------------------------------------------------------------------\n\nANASTASIO MAYORAL CEDENILLA (ÁRBITRO):\n\n\n\nEn 1985, el árbitro de Primera División Anastasio Mayoral Cedenilla denunció que le ofrecieron 1,5 millones de pesetas para favorecer al Barça ante el Lleida en Copa del Rey.\n\n\\--------------------------------------------------------------------\n\nJOSE VICENTE HERNAEZ (PERIODISTA): \n\n\n\n(1994) Año siguiente de entrar Enríquez Negreira en el CTA.\n\nArtículos de Joe Vicente Hernáez después de un partido Barcelona - Osasuna y Barcelona - Atlético:\n\n\"Al Barça naturalmente, no le hace falta recusar a un arbitro. Basta con que un día cualquiera de partido se le insinúe algo a Enríquez Negreira (miembro del Comité de Designación) en el palco presidencial del Camp Nou, al que suele ir con relativa frecuencia. O en cualquier partido de su hijo con uno de los equipos inferiores del Barça. En esta Loto futbolística le vuelve a tocar el primer premio al mismo. Que casualidad. Al equipo  azul-grana le han regalado ya varios puntos en esta Liga. Curiosamente, desde que el ex colegiado catalán Enríquez Negreira esta en el Comité, el Barcelona es el único club para el que no existe el problema arbitral\".\n\nJosé Vicente Hernáez ya lo denunciaba ya en sus artículos. Al igual que también lo hicieron, los presidentes Mendoza y Jesús Gil.\n\n\n\n\n\n\n\n\n\n",
        "upvotes": 50,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o7ju2i/declaraciones_sobre_corrupción_en_el_fc_barcelona/"
    },
    {
        "id": "1o7hxoy",
        "author": "911Maestro",
        "title": "Which player you adored from a different club and wanted in?",
        "content": "For me it was a dream to see Kevin De Bruyne alongside Cristiano and then link up with Benz-Vini.\nI believe he would donned it and would have even surpassed the legacy of Ozil at Real. \nEspecially after Kroos, he would have been there to thread the passes to Kylian and Vini.\nWhat Bellingham does in attach + What Kroos did for assists + What Ozil did , it would have all been in 1 person in that 17 number Real jersey.",
        "upvotes": 43,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o7hxoy/which_player_you_adored_from_a_different_club_and/"
    },
    {
        "id": "1o7ml5x",
        "author": "ManuMora98",
        "title": "[Basket] First win of the week as we defeat Partizan Belgrade 93-86. This Friday, we visit Belgrade to face Red Star",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sgzh2kj7cvf1.jpeg?auto=webp&amp;s=5a5a3c2f7caa561eaebb9b88c06806f097ab4adf"
        },
        "permalink": "/r/realmadrid/comments/1o7ml5x/basket_first_win_of_the_week_as_we_defeat/"
    },
    {
        "id": "1o6wg3y",
        "author": "EndouShuuya",
        "title": "SIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIUUUUUUU! CRISTIANO!",
        "content": "",
        "upvotes": 551,
        "comments": 211,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hb9fx2cm46vf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o6wg3y/siiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiuuuuuuu/"
    },
    {
        "id": "1o7byhf",
        "author": "kevraul",
        "title": "Fernando Carlos Redondo Neri",
        "content": "[https://www.youtube.com/watch?v=snxkSZuTQdQ](https://www.youtube.com/watch?v=snxkSZuTQdQ)\n\n\n\nthere are a great many defensive midfielders in Real Madrid, Redondo will always be the first in my team sheet. Always.",
        "upvotes": 44,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bnDLt0k6Xo8rjHyrtHVBxe6d1wYSNz0X_pURrpplLTo.jpeg?auto=webp&amp;s=f9b8a20f623fd73dbc9eb489108ccebec5dd6c9d"
        },
        "permalink": "/r/realmadrid/comments/1o7byhf/fernando_carlos_redondo_neri/"
    },
    {
        "id": "1o6xsyx",
        "author": "EndouShuuya",
        "title": "Guler X Mbappé DUO!🤩",
        "content": "",
        "upvotes": 303,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/st9kgc3og6vf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o6xsyx/guler_x_mbappé_duo/"
    },
    {
        "id": "1o67yq5",
        "author": "No-Independent2522",
        "title": "Courtois runs into Morata during the international break",
        "content": "",
        "upvotes": 2727,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o67yq5/courtois_runs_into_morata_during_the/"
    },
    {
        "id": "1o6ee57",
        "author": "No-Independent2522",
        "title": "Kroos just out here doing Kroos things on IG 😂 Ronaldo who? Benz who?",
        "content": "",
        "upvotes": 773,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o6ee57/kroos_just_out_here_doing_kroos_things_on_ig/"
    },
    {
        "id": "1o6txsj",
        "author": "xGsGt",
        "title": "Going to El clasico as barca fan",
        "content": "My friend and I are going to the clásico in Madrid I'm a big Madrid fan but my friend is a Barca fan, I'm going with my jersey obviously but we are wondering if my friend can use his Barca jersey? \n\nWhat is the etiquette? This is my first Real Madrid game in Spain, we are going to be sitting in a lower section, it's an vip section, would it be a problem? ",
        "upvotes": 93,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o6txsj/going_to_el_clasico_as_barca_fan/"
    },
    {
        "id": "1o6ifcw",
        "author": "OddTraffic3317",
        "title": "Réal Madrid Squad most valuable in the world",
        "content": "Our squad is once again at the top, based on transfermarket valuation.\n\nIt’s impressive to see the continued dominance of Premier League, while their footballing results didn’t significantly change in UCL over the last 15 years, as many, me included, had predicted.\n\nFrom our Club perspective, it’s interesting to compare the squad value to the amount we paid to build it. Even adding the signing bonuses of the free agents, we spent about 900M€ to build this squad, so creating a 50% value. \n\nThis is significantly better than Manchester City or Arsenal, who complete the podium, that struggle to barely keep the value of the squad they assembled\n",
        "upvotes": 336,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g2424pybh3vf1.jpeg?auto=webp&amp;s=3630d9b66b0cd21a73aa723032072922cb415153"
        },
        "permalink": "/r/realmadrid/comments/1o6ifcw/réal_madrid_squad_most_valuable_in_the_world/"
    },
    {
        "id": "1o6dfu6",
        "author": "Lionel_Kratos_Messi",
        "title": "Amazing Trio of Madrid",
        "content": "G/A this season for club &amp; country:\n\n🇫🇷 Kylian Mbappé - 21 G/A\n+ 9 Goals and 2 Assists at 8 Matches in LaLiga\n+ 5 Goals at 2 Matches in Champions League\n+ 3 Goals and 2 Assists at 3 Matches in World Cup Qualification\n\n🇧🇷 Viní Jr - 12 G/A\n+ 5 Goals and 4 Assists at 8 Matches in Champions League\n+ 1 Goal and 1 Assist at 1 Matches for Brazil\n\n🇹🇷 Arda Güler - 11 G/A\n+ 3 Goals and 3 Assists at 8 Matches in LaLiga\n+ 1 Assists at 2 Matches in Champions League\n+ 1 Goal and 3 Assists at 3 Matches in World Cup Qualification",
        "upvotes": 594,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/881anm3lg2vf1.jpeg?auto=webp&amp;s=01066779714ef45305c0d4fdfad07ffd7d401854"
        },
        "permalink": "/r/realmadrid/comments/1o6dfu6/amazing_trio_of_madrid/"
    },
    {
        "id": "1o6ed4w",
        "author": "Aggressive-Row-4489",
        "title": "Rodrygo goesssssssss",
        "content": "The rodrygo we have this season is a beast fr. Watching the game japan and brazil  even tho brazil lost,, he was amazing. Carrying the ball, switching the sides, dropping deep linking up etc. Madridistas, we are so blessed to have a  player of that quality, accepting to fight his spot in the royal whites . He would be a starter for every team in the world but chooses to fight for his position and is also giving a proper competition to vinicius in the left wing. One of our own and we fans love you  so muchhh, rodrygo ♥️",
        "upvotes": 112,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o6ed4w/rodrygo_goesssssssss/"
    },
    {
        "id": "1o624ry",
        "author": "More-Judgment-9253",
        "title": "Tchouameni at Madrid vs France",
        "content": "I was just rewatching his performance against ukraine last month and the difference in his playstyle there vs for the club is kinda crazy. Look at how progressive he is and he's actually taking risks and also moving around more. Of course they're completely different systems but I think this version of tchou is better",
        "upvotes": 448,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/conri70c9zuf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o624ry/tchouameni_at_madrid_vs_france/"
    },
    {
        "id": "1o5nl84",
        "author": "Downtown_Guidance_75",
        "title": "Not the Real Madrid Academy, BUT the Toni Kroos Academy IN Madrid.",
        "content": "Toni Kroos, who boasts six Champions League titles and a World Cup trophy, still brings incredible passion to coaching at the Real Madrid Academy 🔥\n\nKroos is out here teaching 14-year-olds how to control tempo better than half the Prem midfielders\n\nThose kids better not misplace a pass man’s vision still sees everything 👀",
        "upvotes": 1746,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o6ekkq6iiwuf1.jpeg?auto=webp&amp;s=01473585337692d5204daa0c4cb831858e069288"
        },
        "permalink": "/r/realmadrid/comments/1o5nl84/not_the_real_madrid_academy_but_the_toni_kroos/"
    },
    {
        "id": "1o5us9z",
        "author": "mishhka1",
        "title": "Rate my Ronaldo wallpaper",
        "content": "Added with a very cool nostalgic edit i found. Ronaldo and Marcelo always had that close friendship i always admired. I though it would be cool to make it a live wallpapers, especially with the nee iOS26 update which cane out recently. Rate it away guys.\n\nIf anyone will need a tutorial, hit me up I will be glad to teach you :)",
        "upvotes": 157,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u71ae9rasxuf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o5us9z/rate_my_ronaldo_wallpaper/"
    },
    {
        "id": "1o5ijgp",
        "author": "UpgradedSiera6666",
        "title": "Mbappe after the Derbi defeat: \"We didn't have the intensity we needed. They won every duel, were dangerous on every cross... Obviously, it's complicated to win this kind of match. We lost our rhythm and control.",
        "content": "",
        "upvotes": 410,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hto2l56djvuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o5ijgp/mbappe_after_the_derbi_defeat_we_didnt_have_the/"
    },
    {
        "id": "1o51tx6",
        "author": "Waves_Rondo",
        "title": "This stat is insane..",
        "content": "",
        "upvotes": 2368,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2kgd0fr4ruf1.jpeg?auto=webp&amp;s=7cf6c199019254bb006bd6be5804c0b24745732d"
        },
        "permalink": "/r/realmadrid/comments/1o51tx6/this_stat_is_insane/"
    },
    {
        "id": "1o5a6l1",
        "author": "AffectionateGift3560",
        "title": "England and Real Madrid star Jude Bellingham has opened up about the pressures of social media and the importance of mental health support in elite sport",
        "content": "This didn't go viral I don't know why .\nI would say people always say his arrogant even till this day but all we've seen for the past 2 years is a humble man with great upbringing.\n\nArda fans like to hate on him and act like he is the all of Arda problems and they just want to see him start but in actually Arda worst problems should be the opposing team we face and how they under estimate him not his teammates . I can bet Jude isn't mad that Guler took his position and is performing well.",
        "upvotes": 402,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/od5u95sv3tuf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o5a6l1/england_and_real_madrid_star_jude_bellingham_has/"
    },
    {
        "id": "1o4y8s8",
        "author": "FrrancondonaEra",
        "title": "hugo fernández martinez a 12 age one of the biggest talent in real madrid academy",
        "content": "sry for the music in the background!   he is already on jorje mendez radar hope he dont sign him to his agency i dont want that rat near real madrid. ",
        "upvotes": 728,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ybn8y3erequf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o4y8s8/hugo_fernández_martinez_a_12_age_one_of_the/"
    },
    {
        "id": "1o4m80n",
        "author": "yuukiro",
        "title": "Don Arda with a manager's coat",
        "content": "",
        "upvotes": 1541,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o4m80n/don_arda_with_a_managers_coat/"
    },
    {
        "id": "1o4nkzi",
        "author": "supplementarytables",
        "title": "Kylian Mbappé: “Cristiano Ronaldo has always been my role model, an example for me”.\n\n“I’m lucky to talk to him, he gives me advice, he helps me… he’s number one”.\n\n“He’s the reference of Real Madrid. People still dream and talk of Cristiano now”, told Movistar.",
        "content": "",
        "upvotes": 1069,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1o4nkzi/kylian_mbappé_cristiano_ronaldo_has_always_been/"
    },
    {
        "id": "1o4leok",
        "author": "soldier101br",
        "title": "Alternative Angle of Vini Jr. Goal against South Korea",
        "content": "",
        "upvotes": 848,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6xw2jmlvonuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o4leok/alternative_angle_of_vini_jr_goal_against_south/"
    },
    {
        "id": "1o4tj9e",
        "author": "soldier101br",
        "title": "Our boys arrived at Japan for National Duty",
        "content": "",
        "upvotes": 262,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j21prshgjpuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1o4tj9e/our_boys_arrived_at_japan_for_national_duty/"
    }
]