[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 992,
        "comments": 295,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pvqg9x",
        "author": "ChuckieDabs",
        "title": "Netflix “Spoilers Commercial” 2025",
        "content": "Netflix just released a commercial for themselves during this 2025 Christmas NFL game that contained legitimate spoilers for the newest seasons of their TV shows. I do not get what marketing executive thought it was a good idea to run that. It was genuinely annoying and the message was some generic corporate American pandering.",
        "upvotes": 482,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqg9x/netflix_spoilers_commercial_2025/"
    },
    {
        "id": "1pvqf6c",
        "author": "cancerman1120",
        "title": "What was with that commercial?",
        "content": "Watching football and Netflix runs a commercial on its own service spoiling a bunch of shows? Maybe it was a gag since I covered my eyes since I did not want anything spoiled for me. Anyone watch it? Were there spoilers?",
        "upvotes": 140,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqf6c/what_was_with_that_commercial/"
    },
    {
        "id": "1pvk4u5",
        "author": "TheMirrorUS",
        "title": "Netflix viewers furious over streaming issues during NFL Christmas coverage",
        "content": "",
        "upvotes": 271,
        "comments": 289,
        "media": null,
        "permalink": "/r/netflix/comments/1pvk4u5/netflix_viewers_furious_over_streaming_issues/"
    },
    {
        "id": "1pvokbm",
        "author": "bogeynick28",
        "title": "The amount of ads on the NFL stream is insane",
        "content": "is it just me? I don't usually watch live broadcasts on Netflix but dang the number of ads are insane... tbh I don't remember which plan I have but it's about 25$ a month. I don't even know why I'm getting ads. Really want to cancel after this month..",
        "upvotes": 127,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1pvokbm/the_amount_of_ads_on_the_nfl_stream_is_insane/"
    },
    {
        "id": "1pvrbvh",
        "author": "smooothaseggs",
        "title": "NFL/sport coverage is abhorrent",
        "content": "Holy smokes…what a terrible product.  The commentary, the (type of) ads, the lack of “watch live” option, the poor stream rate/resolution, the netflix branding of a raw tomahawk steak (“that looks pretty good”, NOT!!)…all just terrible.  I’m pretty sure they’re begging me to end my subscription and stream illegally.  I wasn’t the biggest fan of Amazon prime NFL games, but at least they figured it out.  I should have known after being a sucker and watching some of the “fights” they’ve promoted over the last couple years.  I digress…if you enjoyed it, then kudos!  Just needed to vent, and I won’t be back here.  Drew Brees is a real one, tho, always.",
        "upvotes": 73,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pvrbvh/nflsport_coverage_is_abhorrent/"
    },
    {
        "id": "1pvlzwd",
        "author": "Careless_Worry_7542",
        "title": "Spoilers Monster the Ed Gein Story is the worst show Ive ever watched, ever.",
        "content": "I'd never seen one of these series, maybe watched half an episode on the Menedezes. I gave this a chance because I like Charlie Hunnam and heard the Dahmer and Menedez ones were decent. First episode or two Hunnam and Metcalf do a fine job getting into character and the production value was good. Hell I even was on board when they added Psycho as a sort of meta analysis he had on popular culture to add some filler to an otherwise short story. Then it kept going and going and going. It ends with a parody of Mindhunter, Richard Speck's man tits, and Gein catching Ted Bundy, Gein dying, seeing his mother in heaven, what felt like 95 ending scenes later some kids desecrate his grave and are chased off by the movie monsters he inspired, then finally ends on a flashback with his mom again.   More endings than The Return of The King. Absolute trash. ",
        "upvotes": 147,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlzwd/spoilers_monster_the_ed_gein_story_is_the_worst/"
    },
    {
        "id": "1pvlptr",
        "author": "mrstevegibbs",
        "title": "Your very very long interviews in the middle of football r annoying",
        "content": "Interview celebrities before or after the game, not during. If during, please shorten them by 80%. Too many uncalled plays are taking place. Maybe I’m the only one.  ",
        "upvotes": 112,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlptr/your_very_very_long_interviews_in_the_middle_of/"
    },
    {
        "id": "1pvvbtb",
        "author": "Baapofmovies_123",
        "title": "Stranger Things Season 5 Volume 2 Review (2025): Strong Moments, Weak Payoff Before the Finale",
        "content": "It continued  Netflix’s flagship sci-fi saga and is carrying the weight of an ending that fans have waited years to see. However, with so much expectations, Volume 2 falls flat, as it ultimately feels like an extended bridge to the finale rather than a satisfying chapter on its own. ",
        "upvotes": 18,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1pvvbtb/stranger_things_season_5_volume_2_review_2025/"
    },
    {
        "id": "1pvq9y7",
        "author": "Cannabaee",
        "title": "Terrible Netflix NFL Graphics",
        "content": "The graphics and informations displayed on the nfl games on Netflix were clearly created by someone that doesn’t watch football.\n\nThe teams don’t have their record displayed, don’t have distance for field goals, passes, runs, etc. \n\nThere’s basically no metrics or graphics on screen in general. Sucks especially when watching during a busy holiday w lots of noisy family in the room. ",
        "upvotes": 33,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pvq9y7/terrible_netflix_nfl_graphics/"
    },
    {
        "id": "1pw1ifz",
        "author": "Baapofmovies_123",
        "title": "Cashero Series Review (2025): Netflix’s Promising Korean Superhero Drama Undone by Messy Writing",
        "content": "This eight-episode series, which is led by Lee Jun-ho, introduces a refreshingly odd power system that is rooted in money and morality. But is it worth watching? Unfortunately, despite its compelling premise and capable cast, Cashero ends up being a below-average series.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pw1ifz/cashero_series_review_2025_netflixs_promising/"
    },
    {
        "id": "1pvo5du",
        "author": "i_dodge_leg_day",
        "title": "For those having issues with NFL stream quality…this fixed it immediately for me",
        "content": "Login to the Netflix website, click your profile in the upper right, select “account,” select “edit settings,” select “playback settings” and change it to “High”\n\nI have fiber internet but couldn’t even make out jersey numbers, after this change and restarting my TV it’s crystal clear. ",
        "upvotes": 24,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pvo5du/for_those_having_issues_with_nfl_stream/"
    },
    {
        "id": "1pw61ak",
        "author": "EdgeKey5631",
        "title": "Minimized/ dual screen feature?",
        "content": "I have the minimum plan with ads, I noticed I can’t open a different app and Netflix minimizes itself into a corner so you can watch while you’re in a different app. Is this a phone issue or can you only get his feature with a plan upgrade?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pw61ak/minimized_dual_screen_feature/"
    },
    {
        "id": "1pvug2o",
        "author": "toska64",
        "title": "NFL games already gone",
        "content": "7pm on the west coast and they’ve already taken down today’s games. Had a family event during the Lions game. Came back home and it’s nowhere to be found. Pretty stupid. ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pvug2o/nfl_games_already_gone/"
    },
    {
        "id": "1pvixtv",
        "author": "anotherfilmkid",
        "title": "Poor NFL Stream Quality",
        "content": "Is anyone else only getting a max of like 480p when watching the NFL game? I know I don't have the most advanced PC and my wifi is just ok so it might just be me.",
        "upvotes": 46,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1pvixtv/poor_nfl_stream_quality/"
    },
    {
        "id": "1pvunnn",
        "author": "DiesIrae7",
        "title": "What actually makes you press Play on something new on Netflix that you haven’t watched before?",
        "content": "Even with personalized Netflix recommendations, when I’m deciding whether to start a new movie or show, I usually hesitate for a bit, like I’m not totally sure it’s worth my time.\n\nWhat finally makes you go for it? And do you ever still feel unsure even after you start?",
        "upvotes": 8,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pvunnn/what_actually_makes_you_press_play_on_something/"
    },
    {
        "id": "1pvpc28",
        "author": "rcol2152",
        "title": "In-Game Interviews",
        "content": "Each game today had a lengthy interview while the game was being played. With hours of pregame programming, why is it necessary to do interviews while the games are underway? Bad show, Netflix.",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pvpc28/ingame_interviews/"
    },
    {
        "id": "1pw2rk6",
        "author": "kaehl",
        "title": "AI-generated dubs has got to stop!!!",
        "content": "My nephews and I got excited that there's a Filipino dub of \"Mark Rober's Crunchlabs\". Few minutes in, we're hearing gibberish and sentences that doesn't make any sense!! Even the intonations are making me cringe. It became very apparent that this is AI. This is ridiculous and simply an insult to our language!!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pw2rk6/aigenerated_dubs_has_got_to_stop/"
    },
    {
        "id": "1pvmoot",
        "author": "RiskAndReason",
        "title": "How do you feel about Netflix SPLITTING SEASONS into multiple parts?",
        "content": "With shows like Stranger Things releasing a season in parts (Part 2 today, then a separate finale later), I’m curious how people actually feel about this approach.\n\nDo you enjoy the anticipation and extended hype, or would you rather wait and binge the full season at once?",
        "upvotes": 15,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1pvmoot/how_do_you_feel_about_netflix_splitting_seasons/"
    },
    {
        "id": "1pvocf0",
        "author": "mopbucketbrigade",
        "title": "Christmas Day football sound production",
        "content": "I feel like the sound product is is pretty lame. \n\nWatching the Lion-Vikings game rn, and you can’t hear the players (QB audible, for example) and the crowd is very muted. \n\nThe crowd was cheering a Viking touchdown just now, and you could actually hear the crowd noise get “turned down” during the roar. \n\nThe overall sound seems like there are two dudes sitting in my living room talking about football, and the actual game is on a TV across the room but turned way down. \n\nAnyone else have thoughts on the sound mixing?",
        "upvotes": 9,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pvocf0/christmas_day_football_sound_production/"
    },
    {
        "id": "1pw0wex",
        "author": "Mischievous_Panda420",
        "title": "Can someone remotely upgrade my plan if they are logged in with my account?",
        "content": "I was on the basic plan and my colleague who asked me to share my code so that he could connect it on his television which I did. I just got a notificiation that my plan was upgraded. He says he didn't do it but I think he did.Anyways I have downgraded it to the orginal basic plan. It shows my next billing date is 28th. Will i be charged the extra amount now with what he has done?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pw0wex/can_someone_remotely_upgrade_my_plan_if_they_are/"
    },
    {
        "id": "1pvrpee",
        "author": "DanetteGirl",
        "title": "Stranger Things",
        "content": "Where are the episodes??? They were meant to drop 7pm CT. It is now past and still no episodes. Anyone seeing anything different? All I want is for Stranger things day to start! \n\nUPDATE:  I had to restart the TV and change users but they are on!!  HAPPY STRANGER THINGS. MAY STEVE LIVE. ",
        "upvotes": 4,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pvrpee/stranger_things/"
    },
    {
        "id": "1pvrjyk",
        "author": "Halfpint-1973",
        "title": "New Update is Frustrating",
        "content": "Anybody else frustrated with the new update? I don’t like how I’m now “forced” to start watching a program in which I’m only interested to find out what it’s about. I can’t go to straight to info. I can’t watch trailers anymore. Is there a fix?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pvrjyk/new_update_is_frustrating/"
    },
    {
        "id": "1pv1y5j",
        "author": "DiesIrae7",
        "title": "Anyone else open Netflix and immediately feel… stuck?",
        "content": "This happens to me more than I’d like to admit. I’ll open Netflix with time to watch something, scroll around for a bit, and then nothing really feels right. \n\nEven when Netflix is recommending stuff that seems like it should be up my alley, I still sometimes end up scrolling and not feeling great about any choice. \n\nI’m sure I’m not alone in this and depending on my mood at the time, end up feeling frustrated, overwhelmed, or even at times indifferent. Curious to know what usually goes through your head in that moment?",
        "upvotes": 362,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1pv1y5j/anyone_else_open_netflix_and_immediately_feel/"
    },
    {
        "id": "1pw357d",
        "author": "Hot_Shower_8280",
        "title": "How about a chrome extension that will collect all your double thumb-ups in a playlist ?",
        "content": "I was wondering about a chrome extension that will collect all your double thumb-ups in a playlist ? I never find the stuff that I watched and market as double thumb us in a place. Do you guys think that if I build a free chrome extension it would be useful ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pw357d/how_about_a_chrome_extension_that_will_collect/"
    },
    {
        "id": "1pvkd4t",
        "author": "Sudden_Pop_2279",
        "title": "Better Watch Out (2016) was just added",
        "content": "This is a nice Christmas Horror movie that I'd recommend watching. I still remember when I first saw the trailer for the movie and went in thinking \"Oh this looks like a nice Home Alone Rated R parody movie\". Holy Hell did it subvert my expectations. Go watch this film.",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pvkd4t/better_watch_out_2016_was_just_added/"
    },
    {
        "id": "1pvnm7i",
        "author": "kunneak_",
        "title": "netflix shows/movies going black/green",
        "content": "Has anyone else experienced their shows or movies abruptly going black while watching? This happened with the Great Flood and The Elixir. I’m not sure why it’s happening, but I can’t watch anything on the app. haven’t tried checking other shows but this is all that’s happening. ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pvnm7i/netflix_showsmovies_going_blackgreen/"
    },
    {
        "id": "1pvyq3r",
        "author": "Ancient-Zombie-8352",
        "title": "Found this on Genius, wondering if anyone knows anything about it",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pvyq3r/found_this_on_genius_wondering_if_anyone_knows/"
    }
]