[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jo3ie2",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Releases New Teaser for ‘The Eternaut’",
        "content": "",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jo3ie2/netflix_releases_new_teaser_for_the_eternaut/"
    },
    {
        "id": "1jns3i1",
        "author": "lydocia",
        "title": "Any series on Netflix that just leave you feeling really bad?",
        "content": "Looking for recommendations for series that just leave you feeling awful, like truly gut-wrenching, depressing, based-on-true-events kind of shows. The kind that aren’t just sad but actually make you sit in silence for a while after an episode ends, just processing everything.\n\nI’m talking about shows that cover real-world tragedies, injustices, or historical events in a way that really sticks with you. Stories that aren’t just entertainment but actually make you think about how messed up the world can be. I know *Dopesick* and *Apple Cider Vinegar* fall into this category, but I’m sure there are plenty of others out there.\n\nIdeally, I’d like something available on Netflix, but if there’s something really good on another platform, I’d still be interested in hearing about it. I just want something that’s powerful, disturbing, and leaves an impact.\n\nAny recommendations? Would love to hear what shows have left you completely drained after watching.",
        "upvotes": 93,
        "comments": 400,
        "media": null,
        "permalink": "/r/netflix/comments/1jns3i1/any_series_on_netflix_that_just_leave_you_feeling/"
    },
    {
        "id": "1jo5pen",
        "author": "womanmuchmissed",
        "title": "Survival of the thickest",
        "content": "Older millennial stylist trying to live her fashion dreams in New York. She and her two best friends are in periods of growth in their personal and professional lives. This is a coming of age story but for seasoned adults. The characters are in their 30s, mature and talented but still trying to find their footing. \n\nIf you liked Sex in the City, Girlfriends, Gossip Girl, Entourage, The Game, RHONY, RHOBH, Friends, How I Met Your Mother or any other show about adult friends in the big city, then this show is for you!!!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5pen/survival_of_the_thickest/"
    },
    {
        "id": "1jo7gh8",
        "author": "Pogrebnik",
        "title": "Meryl Streep Is in Talks to Join Greta Gerwig's 'Narnia' Series in Central Role",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo7gh8/meryl_streep_is_in_talks_to_join_greta_gerwigs/"
    },
    {
        "id": "1jo252r",
        "author": "Alan_Stamm",
        "title": "'Gone Girls:' Three Things We Learned From Netflix’s New Long Island Serial Killer Doc",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo252r/gone_girls_three_things_we_learned_from_netflixs/"
    },
    {
        "id": "1jo24hn",
        "author": "Alan_Stamm",
        "title": "The Story Behind 'Gone Girls: The Long Island Serial Killer'",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo24hn/the_story_behind_gone_girls_the_long_island/"
    },
    {
        "id": "1jo4nxc",
        "author": "MysteriousDelay6266",
        "title": "The Eternaut | Official Trailer | Netflix | APRIL 30",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo4nxc/the_eternaut_official_trailer_netflix_april_30/"
    },
    {
        "id": "1jo5dnk",
        "author": "LushCharm91",
        "title": "'Black Mirror' Season 7 Trailer: Six New Episode Titles Revealed",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5dnk/black_mirror_season_7_trailer_six_new_episode/"
    },
    {
        "id": "1jo5cvo",
        "author": "Somethingman_121224",
        "title": "Britt Lower, Milo Ventimiglia, Logan Browning and Erin Richards Have Joined the Cast of Netflix's New Harlan Coben Series",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5cvo/britt_lower_milo_ventimiglia_logan_browning_and/"
    },
    {
        "id": "1jnsatm",
        "author": "OppositeOctopi",
        "title": "The Walking Dead",
        "content": "Okay I know I'm very late to this party. But. I've been binge watching and I'm at season 3, episode 10. I DONT WANNA DO ANYTHING ELSE! So salty I have to go to work tomorrow so I have to make myself turn this off. ",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jnsatm/the_walking_dead/"
    },
    {
        "id": "1jo364r",
        "author": "alicemerowypt24",
        "title": "ok so this is strange. uk netflix.",
        "content": "I recently watched the live action  monster high 2 film on my tablet and I want to watch monster high live action the first film on my tablet but I can't find it on my tablet and I can find it on my phone , both of them.\n\nI am in the uk.\n\nI have updated both apps on my phone and tablet.\n\nmy tablet is a amazon kindle thats  really old , 2017. so yeah.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo364r/ok_so_this_is_strange_uk_netflix/"
    },
    {
        "id": "1jo23hr",
        "author": "Alan_Stamm",
        "title": "'Gone Girls: The Long Island Serial Killer' [Review]",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo23hr/gone_girls_the_long_island_serial_killer_review/"
    },
    {
        "id": "1jnbnsh",
        "author": "South_East_Gun_Safes",
        "title": "Why is every documentary a 3-parter now? This new format of choice seems to stretch out ~1.5hrs of genuine content with repetition and filler.",
        "content": "I’ve watched so many 3 part Netflix docs now that I know the format and they’re far to drawn out to be enjoyable, so avoid them. But now it’s seemingly EVERY new doc!\n",
        "upvotes": 71,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1jnbnsh/why_is_every_documentary_a_3parter_now_this_new/"
    },
    {
        "id": "1jnwcni",
        "author": "manyiak90",
        "title": "Home page only showing me the game banners for the last few months",
        "content": "Netflix has been promoting only games to me for the last few months. I don't get it, I don't play games and have never shown any interest in Netflix games. But even then, why show me netflix game banners for months at a stretch. I have not seen a single new show/movie being promoted on my home page. I keep having to scroll down or go to the new/popular tab or search for stuff I might want to watch, which is terrible user experience. \n\nIs there a way to remove the banner or make sure I get shown relevant banners on home page?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnwcni/home_page_only_showing_me_the_game_banners_for/"
    },
    {
        "id": "1jnz3ux",
        "author": "Idealemailer",
        "title": "Screen intermittently darkens",
        "content": "I've experienced an odd effect like the screen momentarily darkening then coming up to normal brightness while using the Netflix app on android, almost as if I were blinking. Anyone experiencing the same? Is it a bug? Early April fools day joke?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jnz3ux/screen_intermittently_darkens/"
    },
    {
        "id": "1jo5b8t",
        "author": "AdSufficient2471",
        "title": "Adolescents",
        "content": "Just finished Adolescence and was blown away. This series will stay with me for a while. I have two questions for you guys:\n\n1)why do you think Jamie decided to change his plea? What made him finally decide? Did he realize he was revealed by the psychiatrist? \n2) other than some of his statements/admissions with the psychiatrist, was \nthere any other proof that he was in fact an incel and part of that community?  Not sure if I missed something about his computer search history or something. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5b8t/adolescents/"
    },
    {
        "id": "1jn5mnw",
        "author": "Baby_0il04",
        "title": "Adolescence, detective did what more parents should do.",
        "content": "The detective saw what was going on with Jamie, the incel and red pill stuff. Saw that his son knew about that stuff even though he’s younger than Jamie. We learn that his son has been distant from him. So the detective makes an effort to be closer to his son and be the role model he needs.\n\nHaven’t seen anyone talking about this, so I had to say something ",
        "upvotes": 98,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jn5mnw/adolescence_detective_did_what_more_parents/"
    },
    {
        "id": "1jn0ega",
        "author": "deuxfleurs04",
        "title": "Adolescence",
        "content": "Obviously, I know I’m not the only one who’s really loved ‘Adolescence’, but I had to post here because wow. I cannot think of anything I’ve ever watched where the dialogue was both written and delivered by the actors in a way that felt so natural and hyper-realistic. Incredible work by the camera crew as well to get each episode in a single shot. Also I’m a social worker, and I cannot get over the scene with Jamie and the psychologist. It felt like a masterclass in appropriate/effective methods in evaluation and talk therapy. I am blown away by this show. I hope it gets many accolades come the next awards season.",
        "upvotes": 208,
        "comments": 140,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0ega/adolescence/"
    },
    {
        "id": "1jnnmxm",
        "author": "Unprotectedtxt",
        "title": "Million dollar Secret",
        "content": "What happens if someone guesses the millionaire on say episode 2. (I just finished 1) does the person(s) who guesses the millionaire get any money for that? \n\nAlso wouldn’t it have been more engaging if we all (the audience at home) also had to guess and wonder throughout the season? Kinda like how engaging the White Lotus is because we are all guessing right up until the seas final. It keeps to so much more invested. \n\nWe could even all be discussing who we suspect right now. But we don’t cause we know who has the money. \n\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jnnmxm/million_dollar_secret/"
    },
    {
        "id": "1jo2bs6",
        "author": "Antique-Big7574",
        "title": "Good series to watch?",
        "content": "Dont even start with the walking dead, lost, prison break or breaking bad, I dont want half of the episodes to be someone complaining about someone else. For reference, I liked \"the rookie\" and \"the orville\" (even though it is a kinda weird show) I watched all of them, so any recommendations?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jo2bs6/good_series_to_watch/"
    },
    {
        "id": "1jnu5y6",
        "author": "holdTheDoorzz",
        "title": "Question about policy",
        "content": "So back when they made it so people outside your house can't use the same account, I canceled because I don't live with my kids and they used it most of the time so when I went to use it, I couldn't get access.. is it still the same? I do like the app I just can't afford 2 subscriptions.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnu5y6/question_about_policy/"
    },
    {
        "id": "1jnge7i",
        "author": "indiewire",
        "title": "The 7 Best New Shows on Netflix in April",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jnge7i/the_7_best_new_shows_on_netflix_in_april/"
    },
    {
        "id": "1jnvkp1",
        "author": "Maleficent_Ad7987",
        "title": "Million Dollar Secret animal use",
        "content": "I was surprised to see they used animals in season two. I’m not a peta freak. I grew up hunting in the Midwest. I was genuinely more surprised than outraged or even concerned. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jnvkp1/million_dollar_secret_animal_use/"
    },
    {
        "id": "1jnrhc8",
        "author": "Exkelsier",
        "title": "Wolf king",
        "content": "Why does it look stop motion using clay models? Its apparently all purely animated, however, the frames skip just like they would in a stop motion animation",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnrhc8/wolf_king/"
    },
    {
        "id": "1jo5l62",
        "author": "MarinerAtSea",
        "title": "Is it me, or is the Incel culture / “the manosphere” aspect of Adolescent being massively over stated? It did touch on those issues, but it was more about a young lad with extreme anger issues wasn’t it?",
        "content": "From what I remember, they incidentally asked the boy and his friends whether they paid much attention to Incel forums and “the manosphere” and they said they didn’t. The guy wanted a girlfriend, but couldn’t get one, but that’s nothing unusual for a 13 year old boy. The guy was teased about being an Incel, but the bigger issue there was the bullying towards the boy wasn’t it?\n",
        "upvotes": 0,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5l62/is_it_me_or_is_the_incel_culture_the_manosphere/"
    },
    {
        "id": "1jmwlgn",
        "author": "Visual_Hyena7258",
        "title": "Con mum, is nobody else annoyed with the filmmakers?",
        "content": "I thought it was a good documentary for the most part. But what kind of lazy filmmakers make a documentary about a subject. And do zero research to find the truth? They could have tried to find out where this lady is actually from. Find other victims of hers throughout the years. It could have been multiple episodes about how vile this woman was. It seems to me that they found out about grahams story online somehow. And just found ppl that were scammed at the same time as he was. I just felt they could have done more work to show us who this horrible lady really was. I mean it seems like grahams wife did more research on her than the filmmakers. \n\nIs this just me and my weird self? Or does anybody else feel like this?",
        "upvotes": 118,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jmwlgn/con_mum_is_nobody_else_annoyed_with_the_filmmakers/"
    },
    {
        "id": "1jni0oe",
        "author": "Intelligent_Layer219",
        "title": "Downloads not fully downloading?",
        "content": "Title. Episodes say they are fully downloaded (little check on the right of them), but only show 7mb or 12mb of entire show downloaded? It’s not just a visual glitch, viewing them offline only lets me watch like a minute of the show. Fix?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jni0oe/downloads_not_fully_downloading/"
    },
    {
        "id": "1jnv41x",
        "author": "mwachs",
        "title": "This is what the creators of Adolescence should make next but call it Residence.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jnv41x/this_is_what_the_creators_of_adolescence_should/"
    },
    {
        "id": "1jnlq81",
        "author": "Alexander_Crowe",
        "title": "How do the downloads work?",
        "content": "I'm trying to download the first season of the office which is six episodes. The app told me I have too much other stuff downloaded so I deleted three movies, the entire death note anime (32? Episodes) and a few episodes of other shows i downloaded. Right now i have about 30 Episodes total of a few shows and no movies downloaded\n\nBut the app still tells me that i cant download a single episode more. This isnt the first time this happened.\n\nI can delete like 30gb of content and a 60mb episode is suddenly too much to bare\n\nI dont know what to google or what to even call this problem. Im confused ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jnlq81/how_do_the_downloads_work/"
    },
    {
        "id": "1jnxkco",
        "author": "Nervous-Cry1817",
        "title": "Adolescence question potential spoiler",
        "content": "In the show when the dad is buying paint, the sales assistant says to the dad - ‘we know he didn’t do it , it’s not atomically possible’ for the stabbing. What did he mean buy this? ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jnxkco/adolescence_question_potential_spoiler/"
    }
]