[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 54,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l8pzf4",
        "author": "S4v1r1enCh0r4k",
        "title": "David Harbour Says Goodbye to Stranger Things: \"After 10 Years, It’s Time to Move On\"",
        "content": "",
        "upvotes": 816,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1l8pzf4/david_harbour_says_goodbye_to_stranger_things/"
    },
    {
        "id": "1l9b53o",
        "author": "Meko26",
        "title": "I cannot handle the new Netflix update",
        "content": "I can’t handle it, it only allows me to look really at one show at a time and it drives me insane…..\nI find myself going to other streaming services because I dislike it so much?\n\n\nAnyone else agree?????",
        "upvotes": 42,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1l9b53o/i_cannot_handle_the_new_netflix_update/"
    },
    {
        "id": "1l98jsy",
        "author": "KarmaDeliveryMan",
        "title": "Why change the UI?",
        "content": "Between attempting to force me to have WWE on My List and not allowing me to remove it and now this new UI, I’m about fed up with this company. The UI was fine. I never had complaints but they felt the need to change it for what reason? They’ll probably charge us more for it too.",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l98jsy/why_change_the_ui/"
    },
    {
        "id": "1l9fr38",
        "author": "Illustrious-Royal162",
        "title": "Shows like Mercy For None",
        "content": "I recently watched Mercy For None and loved how action-packed and fast-paced it was. Do you have any recommendations with a similar vibe?\nI enjoy crime, thriller and revenge action. Movies or series will do. Thank you.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9fr38/shows_like_mercy_for_none/"
    },
    {
        "id": "1l8uxy5",
        "author": "CuntHuntingBull",
        "title": "How famous Mindhunter among this group?",
        "content": "I have been watching Mindhunter again like 7th time now. I just wonder how famous this  really since I heard it didn't get attention as it needed to be. Also it is costly interms of production.  \n\nI would say it is one of the gold in Netflix and definitely the following seasons would be more catchy. Anyone else thinks the same?",
        "upvotes": 33,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1l8uxy5/how_famous_mindhunter_among_this_group/"
    },
    {
        "id": "1l95sum",
        "author": "Steerpike58",
        "title": "Department Q - question about Lyle - SPOILERS",
        "content": "I just finished Dept. Q and loved it!  I loved the writing/dialog, the characters, and the acting.   At first I thought Matthew Goode (Mr nice guy in Downton Abbey) was too 'soft' for this role as Carl, but he turned out great.  And of course, Rose and Ackram nailed it.   I do have a question, which came up already in a response to another thread, but I want to post it here as a new question so it gets more eyeballs. \n\nThe question relates to Lyle (Harry's brother, Ailsa's son), and Sam Haig. I THINK I've got it mostly figured out now, so most of this is how I think it happened, but there are still some questions. \n\nMerritt as a teenager was 'dating' Harry.  She didn't see much of Lyle (Harry's brother) - he just came over occasionally and 'interrupted' them. So I guess there's no reason to think she was that familiar with Lyle.  Meritt, Willliam, Lyle and Harry all live on the remote island of \"Mohr\" - an island that is now in decline due to the demise of the oil industry. \n\nHarry robbed Merritt's household, and during that event, Harry first struck William, but then we later discover that it was Lyle who severely beat William.   The local policeman pursued the event, but mistakenly thought Harry was the culprit and chased him to his death on the ferry.   Merritt came back to Mohr to attend Harry's funeral (and presumably met Lyle again there). \n\nMany years later (10, 15 years?) ('current time'), Lyle is obsessed with Merritt (as a romantic target? Sexual? - not clear).  \n\nLyle has spent a lot of time in an institution, and while there, encountered 'Sam Haig', another inmate.  Sam was smart, and taught Lyle the art of deception / investigation / etc.  Now, Sam and Lyle are both out of captivity and working.  Sam was now an investigative journalist, doing well, driving a Porsche.  Lyle was struggling, working as a grunt on the local ferry. \n\nLyle decides he wants to get closer to Merritt. He knows she is a prosecutor (she's been on TV a few times so 'well known') and decides to impersonate Sam Haig, claiming to want to share information about corruption, etc with Merritt. Merritt finally meets him in a cafe, and 'warms' to him. She has no idea that it is Lyle and she's never met Sam Haig before so has no reason to doubt who he is.  So this is 'issue/question 1' - is it feasible that Merritt would not recognize Lyle 15 years later?  Lyle (as Sam) sleeps with Merritt.  'question 2' - is the real Sam Haig still alive at this point? \n\nIn addition to meeting with Merritt at the hotel on a regular basis for sex, Lyle is spying on her at her home - he's seen by William through the window one night.  So that explains how Lyle knows Merritt's movements. \n\nMerritt loses the case she's working on, and on the spare of the moment, decides to leave, with William, for Mohr on the ferry. \n\nLyle has followed Merritt onto the ferry (since he's been following her in general, this makes sense) and kidnaps her.  But - also on the ferry is Ailsa - Lyle's mum - who assists with the kidnapping.  How could Ailsa be on the ferry that day, given that it was a spare of the moment decision by Merritt to go that day?  Plot Hole? \n\nHaving kidnapped Merritt, Lyle then goes to kill the real Sam Haig at the 'cliff face' to tie up any loose ends, since he's been impersonating him.  Is this the correct timeline for Sam's death - AFTER the kidnap of Merritt? \n\nI don't normally pay this much attention to a show but there was something about the 'style' of this show that really connected with me, so I got really invested.  Now we have to wait to see if there's a second season! \n\nI thought the first 8 episodes were fantastic; I though E9 was a bit 'happy ever after', with the therapist showing up at Carl's house, soft music, etc but it was still great, and did set up for a second season - with the team well-funded and now respected.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l95sum/department_q_question_about_lyle_spoilers/"
    },
    {
        "id": "1l8nuv1",
        "author": "ApolloApex",
        "title": "“Why ‘OceanGate: The Avoidable Disaster’ would be a more accurate title than ‘tragedy’”",
        "content": "The Netflix documentary frames this as a tragedy, but the reality is that many safety concerns were ignored, and it was a high-risk luxury expedition. The story highlights how ego and money can cloud judgment, leading to preventable disasters. I’m annoyed that they advertise it as a tragedy.",
        "upvotes": 77,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1l8nuv1/why_oceangate_the_avoidable_disaster_would_be_a/"
    },
    {
        "id": "1l9ahdi",
        "author": "Ok-Permit4484",
        "title": "What series or movie should I start with?",
        "content": "Whenever I hang out with friends someone always starts talking about movies or series, and I’ve never been one to watch many of them because I prefer to be outside. If I wanna be able to at least understand what they’re talking about 😂, which series should I start with? Or movies? What would you say are the most popular ones. Thanks ",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l9ahdi/what_series_or_movie_should_i_start_with/"
    },
    {
        "id": "1l9gc96",
        "author": "S4v1r1enCh0r4k",
        "title": "Here’s What’s Coming to Netflix in July 2025",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l9gc96/heres_whats_coming_to_netflix_in_july_2025/"
    },
    {
        "id": "1l9bvmx",
        "author": "Single_Pressure9715",
        "title": "Behind Her Eyes",
        "content": "I finally gave in last Friday, after it kept popping up in my “Top Picks for You.”\n\nThrew on while I was on the stairmaster, just to pass time. But what the hell?! Talk about mind bending\n\nDid anyone else feel really bad for Adam?\nLosing his mom— not physically, of course. But the person she became? He clearly knew she wasn’t the same anymore.\n\nRob is crazy and the whole time I’m thinking Adele was the problem! I can’t imagine wanting someone that badly.\n\nDefinitely a great binge.\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9bvmx/behind_her_eyes/"
    },
    {
        "id": "1l9gq15",
        "author": "macaroniguess",
        "title": "Limited time show aren’t limited basically",
        "content": "idk why but there are show from 2019 That NETFLIX CLAIMS ARE LIMITED BUT HAVE BEEN ON THE PLATFORM FOR 6 YEARS! SIX YEARS NETFLIX. FIX IT NETFLIX. ITS JUST STUPID!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l9gq15/limited_time_show_arent_limited_basically/"
    },
    {
        "id": "1l8zh5t",
        "author": "PatienceNo417",
        "title": "Just Finished Anne with an E…",
        "content": "…and I’m so upset it’s OVER. CANCELLED. DONE WITH. I know. I’m late on the bandwagon, but this is truly such a lovely show. It’s just what I needed to watch with all that is going on in this world. \n\nI’m so upset this show was cancelled. Can someone contact Amybeth McNulty to get a movie going? 🥲 I have to see the story of Anne and Gilbert unfold! I want to see Diana grow older! And what about Ka’kwet? Matthew’s chest pain? C’mon Netflix. Let’s partner with whatever Canada wants and make it happen. I’ll be part of the production team if you need help. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l8zh5t/just_finished_anne_with_an_e/"
    },
    {
        "id": "1l98a2q",
        "author": "ToonAdventure",
        "title": "My Melody &amp; Kuromi | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l98a2q/my_melody_kuromi_official_trailer_netflix/"
    },
    {
        "id": "1l8xw8b",
        "author": "eduison",
        "title": "Can we please talk about Havoc??",
        "content": "Im fairly new to Reddit, so I don’t know if this has already been discussed. But can we please talk about Havoc? I watched it yesterday and after taking a bit of time to think about the movie, I now ask myself what it was even about. In hindsight it just seems like someone wanted to make a movie about people killing each other and then decided to wrap this motive into a little bit of story. And many have done this before, like in John Wick. But in Havoc.. well I feel like they messed it up. During every major fighting scene I had the same questions: How is she still alive? How did they get here? Where has he been? And the same goes for the scenes afterwards. The fights take do long that I forget what the story is even about and after it ends I’m left wondering what just happened, what is the situation and who’s friend with who now? \n\nIn conclusion, I am not necessarily saying that it was a bad movie. I even think the choreography was quite alright. But it just seemed like it got a bit.. out of hand, I guess.. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8xw8b/can_we_please_talk_about_havoc/"
    },
    {
        "id": "1l9a7f1",
        "author": "NothingIsACoolHand",
        "title": "Emily Arlook On The Mystery Of Rebecca In ‘Nobody Wants This’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l9a7f1/emily_arlook_on_the_mystery_of_rebecca_in_nobody/"
    },
    {
        "id": "1l8zagg",
        "author": "_Diogenes_Hosidius_",
        "title": "device is not part of netflix household",
        "content": "This message appeared today while i was watching a movie. This is the first time it happened. I don't live with my family cause i go to university in a different city, but that's never been an issue before. For the record the account is created using my email and i'm paying for it so Netflix locking me out is freakin crazy. Any way to fix this? ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l8zagg/device_is_not_part_of_netflix_household/"
    },
    {
        "id": "1l8saed",
        "author": "MasterAroma",
        "title": "Anyone here that have watched/watching Tastefully Yours?",
        "content": "I have recently started to watch korean series on Netflix and I have watched the last episode of Tastefully Yours! Have anyone here watched it and what did you think about it? I would give it a 8/10. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l8saed/anyone_here_that_have_watchedwatching_tastefully/"
    },
    {
        "id": "1l93fqn",
        "author": "Tianjin936",
        "title": "Prison Princesses - Korean Drama",
        "content": "Surprising heartwarming and happy a women in prison comedy.\nThe story builds slowly but the interactions between the women inmates blossoms to a fun and intimate introspection of Korean women in prison.\nI assume that there is a big license between IRL reality and made for TV presentations of actual life in prison for as this offering is presented..\nNon-the-less, this 10 episode story brings a fun and enlightened experience between disparate women who meld into one spirit.\nExceptionally fun and well worth your time to watch a happy story.\nI actually was surprised that it was so much fun to watch.\nThis is my insignificant take on it.\nHope you also enjoy it.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l93fqn/prison_princesses_korean_drama/"
    },
    {
        "id": "1l92r8y",
        "author": "Knotknighm",
        "title": "Did MASHLE just vanish for anyone else?",
        "content": "I noticed that Netflix had dropped the Season 2 with dub and I started watching it. After 2 episodes it put me on the trailer for Dept. Q and I thought alright it must only have 2 episodes so far. Then I tried to find the series page and it had completely vanished. All I could do was set a reminder for it.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l92r8y/did_mashle_just_vanish_for_anyone_else/"
    },
    {
        "id": "1l8aw7o",
        "author": "PlasticViolinist4041",
        "title": "I want the old UI interface back!",
        "content": "It's awful . can't find anything and you see 4 times less info than before\n\nAnd the \"game\" thing is totally irrelevant to me. I have a Playstation for that\n\nBring the old UI back!\n\nOr at least offer the choice to users to select one or the other",
        "upvotes": 62,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1l8aw7o/i_want_the_old_ui_interface_back/"
    },
    {
        "id": "1l90f0e",
        "author": "Ben__Harlan",
        "title": "Netflix's 10th anniversary celebration in Madrid was an absurd cult of the famous, ignoring the people: all for the people, but without the people.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l90f0e/netflixs_10th_anniversary_celebration_in_madrid/"
    },
    {
        "id": "1l99zmr",
        "author": "mjmilian",
        "title": "User uproar on UI Update featured in the UK's most popular newspaper:.",
        "content": "[https://metro.co.uk/2025/06/11/netflix-fans-threaten-cancel-subscriptions-worst-update-possible-23384679/](https://metro.co.uk/2025/06/11/netflix-fans-threaten-cancel-subscriptions-worst-update-possible-23384679/)\n\nAlso here: [https://www.ladbible.com/entertainment/netflix/netflix-users-cancel-subscriptions-new-changes-352850-20240705](https://www.ladbible.com/entertainment/netflix/netflix-users-cancel-subscriptions-new-changes-352850-20240705)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l99zmr/user_uproar_on_ui_update_featured_in_the_uks_most/"
    },
    {
        "id": "1l8gk41",
        "author": "timcaviness",
        "title": "Another Post about the new Horrible UI change ... with suggestions",
        "content": "What follows is an email I attempted to send Netflix ... I logged in and chatted with them and the employee gave me a bad \"support\" email ... so I'm posting here for all to enjoy.\n\n\\-----------------------\n\nHi, I'm not just a long-time customer (under my wife's email), I'm a computer programmer and UI specialist who's been programming on the web since 1995. The new UI changes you've made have some major problems.\n\n1. I have lots of items in the \"My List\" queue ... more than 50+. When I want to find something to watch now, I have no choice but to cycle through them ONE AT A TIME. In the past, the My List screen would show items 5-6 on a line, and I could hit the down arrow to quickly find what I wanted.\n   1. Now? There's no way I have the patience to find the end of the list by scrolling one-by-one to the right.\n   2. And once I do get there and decide what I'm in the mood for is at the beginning? I have to scroll one-by-one back through all the titles to the left? Sorry, but are you kidding me? Horrible design. You've made my user experience 10x worse.\n   3. The purpose of a new UI is to make the user's experience better/quicker with the ability to get the same (or new) job done with less clicks ... not a hundred more. You've backslid.\n2. I see what you were going with by splitting the My List screen into different rows, but I don't care about what I've already watched and what I've given thumbs up to. I've already seen those. I'm not 10 years old. I don't want to re-watch the same show/movie over and over. I want something new!!! **That's the entire reason for the My List queue.**\n   1. I usually choose what I want to watch by how much time I have and what mood I'm in ... so ... please make rows for the following:\n      1. \"My List TV Shows\"\n      2. \"My List Limited Series\"\n      3. \"My List Movies\"\n      4. \"My List Documentaries\"\n      5. etc.\n3. Also, when I'm scrolling down through shows, sometimes I just want to shut the tv up without reaching for a different remote. In the past, I'd skip down a row and slide to the left (to open the left menu) ... and that would \"pause\" all the constant trailers you bombard users with. Now ... I have no way to make the TV quiet with the remote I have in my hand ... and have to reach for another remote and find the button for Mute. Again, you've made my UI experience worse instead of better.\n\nThank you and please consider changes to the new UI. It's different and pretty and you have bigger boxes now for previews ... but it doesn't make me the User happier or help me get to my goal easier or quicker.  \n  \nInstead, it makes me impatient and not want to use the system. We're already subscribing, why would you want to make our experience worse?  \n  \nThank you for your time,  \nTim",
        "upvotes": 21,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l8gk41/another_post_about_the_new_horrible_ui_change/"
    },
    {
        "id": "1l8ymxz",
        "author": "Glum-Work-6998",
        "title": "help about the video disappear",
        "content": "guys help me... The video I downloaded a long time ago disappeared inexplicably, and the customer service has not replied. Will you have this situation? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8ymxz/help_about_the_video_disappear/"
    },
    {
        "id": "1l8rq5n",
        "author": "A_nokneemoose",
        "title": "NEED SOME RECOMMENDATION",
        "content": "I am recently hooked about \"The book of Enoch\" and currently hoping and looking for any documentaries or movies or tv shows that is based on it. Can you recommend any that I can find on Netflix?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l8rq5n/need_some_recommendation/"
    },
    {
        "id": "1l91rk1",
        "author": "DCB062973",
        "title": "Netflix Developing Pro Wrestling Drama",
        "content": "According to PWInsider.com, Netflix is developing a Pro Wrestling Drama Series called “Tuesday Night Titans”.\n\nOne has to wonder why they would start fresh when there’s already a wrestling property that fans want Netflix to continue that was produced on Starz called “Heels” starring Stephen Amell and was cut short when it was cancelled.  Netflix added the first two seasons to the service and was seemingly popular with the fans.  I’d rather see Netflix produce a third and possibly fourth season of the series we already love and want instead of starting over from scratch.\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l91rk1/netflix_developing_pro_wrestling_drama/"
    },
    {
        "id": "1l8hox9",
        "author": "Ace-0987",
        "title": "Netflix glitching?",
        "content": "Anyone else having issues where Netflix keeps glitching? Never had this before - its not a buffering or connection issue - the screen just keeps glitching. \n\n",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l8hox9/netflix_glitching/"
    },
    {
        "id": "1l8sdph",
        "author": "Sea-Guest-1299",
        "title": "Goo Goo Muck vs Bloody Mary – Wednesday Dance Scene Just Hits Different with the Original",
        "content": "Okay so I know Bloody Mary by Gaga has basically taken over every Wednesday dance edit on the internet. I get it—it’s catchy, moody, and fits Jenna Ortega’s moves really well. And I’ll admit, I’ve vibed to those edits more times than I can count.\n\nBUT.\n\nLet’s not forget that the actual song used in the show is Goo Goo Muck by The Cramps. That offbeat, punky, slightly weird 80s vibe? It matches Wednesday’s oddball, vintage aesthetic perfectly. It’s quirky in the exact way her character is. And the fact that Jenna choreographed the dance herself to that track just makes it feel more raw and authentic.\n\nI honestly like Goo Goo Muck more than the sped-up Bloody Mary remix. Not saying the Gaga version isn’t fire, but there’s something about the original song choice that feels way more unique and true to the tone of the show. It has that creepy-cool energy that makes the scene unforgettable.\n\nAnyone else feel like Goo Goo Muck deserves more credit for how iconic that scene became? Or are y’all team Bloody Mary all the way?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l8sdph/goo_goo_muck_vs_bloody_mary_wednesday_dance_scene/"
    },
    {
        "id": "1l8xqck",
        "author": "ha485",
        "title": "Would you watch a Netflix miniseries about President Grover Cleveland...",
        "content": "...the man who crushed striking workers with military force, and then rebranded the global Labor Day to make  Americans forget the bloodshed and the basic human rights they fought for?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l8xqck/would_you_watch_a_netflix_miniseries_about/"
    },
    {
        "id": "1l965si",
        "author": "Own_Original_1770",
        "title": "How much Netflix paid to the former OceanGate’s employees for appearing in the Titan documentary?",
        "content": "Just wondering how much the former OceanGate’s employees were paid to appear in the Titan documentary. Netflix will make money out of it, so they must be paying people interviewed in the documentary. \nAlso, open them to unnecessary legal challenges for no benefits.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l965si/how_much_netflix_paid_to_the_former_oceangates/"
    }
]