[
    {
        "id": "1rfqabp",
        "author": "AutoModerator",
        "title": "Netflix Declines to Raise Offer for Warner Bros.",
        "content": "",
        "upvotes": 297,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1rfqabp/netflix_declines_to_raise_offer_for_warner_bros/"
    },
    {
        "id": "1rhmdys",
        "author": "Available_Branch4664",
        "title": "same movies",
        "content": "im probably wrong but is there something going on where movie plots or ideas are becoming way too similar? like on purpose? are Trap House and The Rip not the same movie? im sure to some degree this has always been true. every story is a classic retelling of old stories/fables/etc with the same structures I guess. am I wrong here, are we already there or are we heading there? thank you. ",
        "upvotes": 19,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1rhmdys/same_movies/"
    },
    {
        "id": "1ri09i8",
        "author": "calthartic",
        "title": "netflix age restricting show below my age limit?",
        "content": "not sure if this is the right place to post this, but i recently started watching a show on netflix, got to episode 16 (the episode id been specifically waiting for BY THE WAY), and then suddenly netflix started saying that it exceeded my age restrictions??\n\nspecifically the show is rated 12+ (although if i look elsewhere its listed as just PG) and my account limit is set to 13. why is it doing this please help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ri09i8/netflix_age_restricting_show_below_my_age_limit/"
    },
    {
        "id": "1rhydmq",
        "author": "Dear_Kick6613",
        "title": "Paranormal Movie Recommendations?",
        "content": "I am in need of some movie reccomendations specifically paranormal movies that consists of like a monster hunting families, vampires,witches etc your recommendations are much appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhydmq/paranormal_movie_recommendations/"
    },
    {
        "id": "1rhrexm",
        "author": "CodDefiant2710",
        "title": "ONE PIECE Into the Grand Line Fan Event Video Highlights | Netflix",
        "content": "Check out this video featuring highlights from the fan event held in L.A. for Netflix's hit TV series “ONE PIECE,” edited from footage shot by our teammate Anont.\n\n[https://cinemadailyus.com/pick-up/one-piece-into-the-grand-line-fan-event-highlights-netflix/](https://cinemadailyus.com/pick-up/one-piece-into-the-grand-line-fan-event-highlights-netflix/)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhrexm/one_piece_into_the_grand_line_fan_event_video/"
    },
    {
        "id": "1rhxeoo",
        "author": "LoLlmAlex",
        "title": "Will Dexter stay on Netflix after the 30th march?",
        "content": "I am asking because Netflix told me that Dexter will stay Till the 30. March, wil the Dexter directors pay the license so it will stay on Netflix? Because i am not completely done watching it",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rhxeoo/will_dexter_stay_on_netflix_after_the_30th_march/"
    },
    {
        "id": "1rht569",
        "author": "mulder00",
        "title": "Netflix's Algorithm.",
        "content": "I've been on a Kdrama and Cdrama binge for the last 2 ish yrs or so and now that's all I see when I open Netflix.  I like those shows but I also want to watch other stuff.\n\n  I know Netflix has category codes for everything but is it really necessary to hide most content?  I don't have the same problem with Prime or when I had Disney+.\n\n  I feel myself being forced to watch something other than Kdramas or Cdramas so Netflix will once again show me Hollywood or British shows.\n\n  Is there anyway to get around this?  Or do I have to make sure I don't watch to much of 1 Country's content?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1rht569/netflixs_algorithm/"
    },
    {
        "id": "1rhgidh",
        "author": "Old_Preparation315",
        "title": "Good Horror Movies?",
        "content": "I recently watched Abigail on Netflix and really enjoyed it. Are there any other movies you've seen like it? What are your favorite horror movies and what did you like about them?",
        "upvotes": 12,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1rhgidh/good_horror_movies/"
    },
    {
        "id": "1rhjpjq",
        "author": "Top_Report_4895",
        "title": "America's Next Top Model ‘Crime Scene’ Photographer Was ‘Mortified’ Watching the Documentary",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhjpjq/americas_next_top_model_crime_scene_photographer/"
    },
    {
        "id": "1rh9j4o",
        "author": "iminsecure143",
        "title": "The Recruit",
        "content": "I understand that this is probably old news at this point, but the cancelation of season 3 (which i only just found out after binging the 2 seasons) has me frustrated as fuck. One of the best shows netflix has produced and they just up and cancel it? It’s unbelievable what i’d give for another season, just so it can at least have a closed ending instead of ending it without a proper ending like it has now",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1rh9j4o/the_recruit/"
    },
    {
        "id": "1rhr61u",
        "author": "_pinned",
        "title": "Can't start a live stream from the beginning.",
        "content": "If I miss an hour of a live stream (wrestling, boxing, whatever), I can't seem to start the show from the beginning. Is this normal, or could it just be the app that's installed on the TV? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rhr61u/cant_start_a_live_stream_from_the_beginning/"
    },
    {
        "id": "1rhvzur",
        "author": "No-Departure5306",
        "title": "Stranger Things high",
        "content": "I feel like now that the official Stranger Things series is over, I’ve lost interest in it. Like when I was waiting for season five, I was so excited and was watching a bunch of Stranger Things videos talking about Easter eggs I’ve might of missed just because of how excited I was for the new season. And the new animated series just does not interest me, I will not be watching it since the og actors won’t be voicing their characters, it just won’t feel right. I hope that somebody gets what I mean because Stranger Things just doesn’t seem that good these days",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rhvzur/stranger_things_high/"
    },
    {
        "id": "1rhd31e",
        "author": "kanishkavohra",
        "title": "Suggest me best shows similar to Bridgerton",
        "content": "I have just ended up the marvelous season of Bridgerton. The show keeps you knots with every episode. Once, it's finished, you may be flooded with a mix of emotions, such as joy, sorrow, happiness, and more. So, please suggest me binge-worthy shows like Bridgerton.",
        "upvotes": 4,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1rhd31e/suggest_me_best_shows_similar_to_bridgerton/"
    },
    {
        "id": "1rhl82l",
        "author": "richb0199",
        "title": "Invalid proxy error",
        "content": "This just started happening on my TV (Roku) and now it's happening on my Android phone.\n\nI was watching a series and suddenly I got an error saying it looks like I'm using a proxy. And I can't move past it. The catch is that I'm not using a proxy. Now I'm getting the error on my phone.\n\nIronically, I got around it by running a proxy. I don't have a proxy installed on my TV.\n\nAnyone else run into this bug? How did you get it to stop? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rhl82l/invalid_proxy_error/"
    },
    {
        "id": "1rgt85m",
        "author": "Middle-Abalone-3142",
        "title": "Saddest Movie On Netflix…",
        "content": "I’ve been debating what the saddest/ most emotional movie I’ve see on Netflix was, but I want to know what you guys think. For me, the simple movie called Straw was so emotional and I loved the ending. A similar movie that just twisted me the wrong way was “In the Tall Grass”. I don’t know if I’d call it sad as much as I would call in unfortunate or confusing. But what do you guys think, what’s the saddest movie on Netflix??",
        "upvotes": 48,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1rgt85m/saddest_movie_on_netflix/"
    },
    {
        "id": "1rhec6k",
        "author": "DarkMan_",
        "title": "Problems watching \"Drive to survive\"",
        "content": "In the new season like in the ones before I have the following problem. After 1 or 2 minutes the stream on my TV stops, loads up to 99 % and nothing happens anymore. I need to go back to menue and restart. That happens again and again. I can binge watch any other series or watch any movie without ever having a problem. It is only Drive To Survive and every season of it. Anybody knows what could be the reason?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rhec6k/problems_watching_drive_to_survive/"
    },
    {
        "id": "1rhj6gw",
        "author": "hheartstrongg",
        "title": "How do I stop reminder emails?",
        "content": "I swear I have checked in the settings on my mobile app and on a web browser and I am certain I have turned off all email notifications but without fail every time I add something to my watchlist I get an email when it is added to Netflix. How do I stop these emails? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rhj6gw/how_do_i_stop_reminder_emails/"
    },
    {
        "id": "1rhq4mi",
        "author": "Davidtroni14",
        "title": "What android emulator works for Netflix?",
        "content": "I am trying to install Netflix on my laptop and I tried to install it on an android emulator but it does not work, I don't like the Microsoft Store version because it uses the Edge browser and I did the impossible to delete it from my system.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1rhq4mi/what_android_emulator_works_for_netflix/"
    },
    {
        "id": "1rha0tg",
        "author": "to_aniaaa",
        "title": "Netflix search website",
        "content": "Hello, is there any website or idk maybe netflix trick where you can search for shows you want to watch? What I mean is if I can check somehow if there are more seasons of the show in another country or even full shows. Cause, atleast with my logic, if someone is available abroad, there is higher chance that it will come to my country 🙂 Thanks for answering",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rha0tg/netflix_search_website/"
    },
    {
        "id": "1rgtgwe",
        "author": "Obvious-Cucumber1086",
        "title": "Just finished behind her eyes. Anything similar that’s good?",
        "content": "I really liked it especially with the plot twist at the end I had to go through the whole thing to make it make sense after lmao\n\nDo you know any other good movies that are around the same realm as this? I only have Netflix &amp; Amazon prime!",
        "upvotes": 24,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1rgtgwe/just_finished_behind_her_eyes_anything_similar/"
    },
    {
        "id": "1rgsaq6",
        "author": "Middle-Abalone-3142",
        "title": "Emotionally Hooking Shows??",
        "content": "As you guys all probably know, Stranger Things ended just about 2 months ago and looking back at the 4 months I watched it in, those were some of the best days because a show can just leave that impact. Now, it wasn’t just the actual show that made it amazing, getting to watch it with my brothers and cousins, late night watches, and watch parties with some of my favorite people for S5 all contributed to making it my favorite show! Now I know I cannot replicate some of those factors, but an amazing, hooking, emotional show can help start the process of finding a show to cover up the sadness from ST being over. Please recommend a show you think I should watch that will start another stage of happiness and deep thoughts and conversations related to the show. Maybe a show that you just personally loved or even a show where you had a similar experience as I did! Anything, just please give recommendations for shows on Netflix that I will fall in love with. (Show could be on Disney +/Hulu as well)",
        "upvotes": 17,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1rgsaq6/emotionally_hooking_shows/"
    },
    {
        "id": "1rhr3bm",
        "author": "ExtremeMode4764",
        "title": "Erotic",
        "content": "Hey guys, just looking for some suggestions for some quality erotic shows I can watch with my wife please. We are middle aged so would prefer a more mature cast rather than young adults. Without asking for to much we are hoping for something which inc steamy uncut sex inc a decent build up, threesomes and voyeurism is also desirable……. Appreciate any suggestions and apologies if this isn’t the place to post and if not any suggestions where to post would also be appreciated ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1rhr3bm/erotic/"
    },
    {
        "id": "1rhiabl",
        "author": "coyoteyips",
        "title": "10×10",
        "content": "I already hate Kathy because her screaming hurt my ears so bad. They're still hurting and ringing. Has anyone else seen this movie and feels the same way? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1rhiabl/1010/"
    },
    {
        "id": "1rfwr79",
        "author": "CockroachPowerful387",
        "title": "being a college kid who uses netflix is infuriating.",
        "content": "I had a midterm today. and all i wanted to do when I got home was watch the new season of bridgerton. but I open the website only to be met with a message saying 'you're not on your home wifi (BECAUSE OF COURSE IM NOT) and we can send a code to your email for 14 days blah blah blah' and it makes me so so so mad because whenever im watching tv its at night after my mom has gone to sleep, so I cant call her and get the code. So here I am, my day ruined, because all I wanted to do was watch bridgerton. i sound dramatic I know but this is so infuriating",
        "upvotes": 998,
        "comments": 180,
        "media": null,
        "permalink": "/r/netflix/comments/1rfwr79/being_a_college_kid_who_uses_netflix_is/"
    },
    {
        "id": "1rh8vtr",
        "author": "MasterPlatypus2483",
        "title": "Home pod mini stereo pair Netflix going to black screen during ad breaks",
        "content": "Having an issue where when my Netflix screen goes to black with no sound at every ad break during their shows. I have to constantly pause and fast forward multiple times to get to the ads. This only happened after I bought HomePod minis as my sound device for my Samsung tv. Any suggestions?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rh8vtr/home_pod_mini_stereo_pair_netflix_going_to_black/"
    },
    {
        "id": "1rhh69q",
        "author": "Important_Many540",
        "title": "Idk if is retaled but I need help to find my childhood cartoon",
        "content": "we're talking about like between 2016-2019, more or less the same period when the first season of the series Larva came out. I don't remember much about the series but I remember that the main character looked like a blue fuggler or something and in an episode there was like an anthropomorphic panda (that if I don't remember wrong was like a punk/aggressive one).\n\nAs already said, I don't remember much. some other things I remember is that  in a single perspective (the pov never moved, it was always pointed in front of the scene as sort of like TV) and I remember that in a ep the main character bought/made a robot vacuum cleaner that later became aggressive.\n\nI don't remember anything else except this. if you have any idea in mind of what cartoon could be, feel free to comment below ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rhh69q/idk_if_is_retaled_but_i_need_help_to_find_my/"
    },
    {
        "id": "1rh3fxz",
        "author": "missy0950843",
        "title": "Force Install Netflix Tv",
        "content": "Hi everyone, i know this is absurb but is there a way to force install netflix tv to android phone? i feel like my phone only plays 1080p on netflix since i have a UHD subscription in Netflix, but the Netflix forces me to play it on 1080p, even though i can play 4k in other platform, i feel like if i install the Netflix tv the quality will be 4k just like on my android tv, is it possible?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rh3fxz/force_install_netflix_tv/"
    },
    {
        "id": "1rgvctq",
        "author": "Ori_barttlet",
        "title": "Oigan, ¿alguien me explica el final de \"No vayas a casa\"?",
        "content": "El final me dejo loca, estaba al principio pensando que eran dos lineas temporales diferentes pero que Min y Varee fueran la misma me destrozo cualquier teoría anterior que tuviera.  \nTengo como 3 teorías, la primera es que sigue la linea sanguínea continua, y de alguna forma en este universo puede ser prácticamente idéntica a sí misma. Pero no cuadra ya que tienen el mismo ADN, así que en algún momento de otra L.T. (Linea temporal) antes de la muerte de la hija de Panida, se esfumo por las primeras rupturas temporales que experimento Panida, y la Varee de 2024 (En la L.T de la serie) la adopto, y en esa L.T. se quedo en búcle a razón de las rupturas temporales.\n\nPor el momento esa me convence, de ser otra resulta en un final incestuoso que continua con la nieta, bisnieta, tataranieta, etc. De Panida.  \nAunque el padre no sea el coronel, ya que el mismo lo admite, la panza de Varee-Min sigue ahí por lo tanto el incesto sigue presente. Okey, ya me volví a contradecir. Ya que Varee-Min tiene una panza de embarazada a menos que no sea, supongo que mi anterior teoría tiene sentido.\n\nEntonces.. que tal que haya tenido relaciones consigo misma con una Varee del 91 (pero hombre) que por las rupturas temporales (y lineales) vino a otra linea en el mismo tiempo y tuvo una hija con la Varee- Esto está muy revoltoso. (por no decir turbio)\n\nBueno.. ¿alguien tiene otra teoría o queda como paradoja o inconsistencia?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rgvctq/oigan_alguien_me_explica_el_final_de_no_vayas_a/"
    },
    {
        "id": "1rh5dtq",
        "author": "FlynnYagami",
        "title": "Stream 4K on 2K display?",
        "content": "Netflix and other streaming services will default to 1080p if you have anything less a 4K display. This is stupid and unfair, because I have a 2K display, and I have a subscription plan that includes 4K video. I should have the option to maximise my video quality, because 1080p is less than my display resolution.\n\nIs there anything whatsoever that I can do to bump up my streaming resolution? A change in settings, a software, a loophole?\n\nThanks\n\nPS- please refrain from saying that 1080p scales better on a 2K screen than 4K. You let me worry about that. And no, that's not how it works.\n\nEDIT- Since clarification is apparently still required, the 2K display I'm referring to is 2560x1440 pixels in resolution. Some also call this QHD. People usually refer to 1080p as FHD. These are minor details, the problem at hand stands either way.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rh5dtq/stream_4k_on_2k_display/"
    },
    {
        "id": "1rg9m4a",
        "author": "Similar_Designer_251",
        "title": "K-drama The Art of Sarah proves that, in Korea, luxury goods are ‘like an ID card’",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rg9m4a/kdrama_the_art_of_sarah_proves_that_in_korea/"
    }
]