[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ifxqvy",
        "author": "dailystar_news",
        "title": "Squid Game star Lee Joo Sil dies in hospital after cancer battle as tributes paid to actress",
        "content": "https://www.dailystar.co.uk/showbiz/breaking-squid-game-star-dies-34599173",
        "upvotes": 255,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ifxqvy/squid_game_star_lee_joo_sil_dies_in_hospital/"
    },
    {
        "id": "1ifkjbm",
        "author": "Thin-Plantain4721",
        "title": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows",
        "content": "Netflix has seriously harmed it's reputation with how often it is now cancelling shows. What used to be seen as the go-to service for saving cancelled shows, has now become the very thing it swore to destroy {Hello There Obi-Wan Kenobi reference). Netflix likes to repeat it's standard line that they have never cancelled a successful show, but they conveniently never tell us how they measure success, because this doesn't ring true with their shows like Lockwood &amp; Co and Shadow &amp; Bone, that got to both Number 1 and Number 2 respectively in Netflix's own published streaming charts, and that still wasn't enough to save those shows from cancellation. Also Netflix clearly has favourites in terms of marketing, for example I enjoyed the show Everything Now, but you've probably never heard of it, and I searched Facebook - Netflix did one post about it when they dropped the trailer 3 weeks before it's worldwide release, and that was it; but other shows like Bridgerton, you can't fail to know it's there because they post daily about it on their socials for weeks up to and including release and for weeks after too. You even have actors in a new show saying they have to search their show to find it so they can watch and it's not even advertised on Netflix's own home screen, let alone anywhere else, so no wonder these shows get cancelled as they are never given a fair shot to succeed.\n\nIt seems unless you go viral or break Netflix's own streaming records, like Stranger Things or Wednesday, then even getting the number one or number two spot is not good enough to save a program from cancellation. Netflix needs to remember that not all releases are an overwhelming overnight success - even some of the best and most popular shows took a while to find their audience, like Breaking Bad, Game of Thrones, The West Wing, The Sopranos, but then when they did find their audience they became what everyone was talking about, and people who had never seen the show, still knew about them from it's impact on the cultural audience. Somebody else said, and I truly believe it, that if Netflix had made Breaking Bad today, they would have cancelled it after two seasons, and then think what great storytelling we would have missed out on, all because the show wasn't a record hit in it's opening week.\n\nAnd now Netflix finds itself in a self-fullfilling loop where they have now trained their audience to not try new shows and get attached as they'll likely be cancelled. Think about it, how many new shows can you think of on Netflix that got renewed last year. It only seems to be people will tune in for shows like Bridgerton, Emily in Paris, Outer Banks, as they have had time to grow with the characters, so now Netflix has got themselves in to a model where customers don't try a new show, like KAOS or Everything Now, and they'll wait and see if it's renewed, and when after only a month since it's release, it does indeed get cancelled, the consumer hasn't wasted time getting invested in a show &amp; characters that get cut short, especially nowadays when there is so much to watch across traditional TV and now streaming services too, that just because the audience doesn't come running to watch as soon as it drops, doesn't mean it's not there or interested.\n\n2025 see's the return of some of Netflix's biggest shows like Squid Game, Wednesday and Stranger Things, but 2 out of those 3 also end this year too and then what shows will be left that are associated with the Netflix brand - they had Stranger Things, House of Cards, Orange Is The New Black when Netflix first got going, it'll be hard to say by the end of this year what big shows Netflix will have left to draw customers in\n\nUnless Netflix, and the wider industry, change their perception to not only see massive, viral numbers as success and that shows with strong-moderate success are allowed to grow and widen their audience, then there will eventually reach a tipping point where they will cancel one show too many that either customers leave their service, or creatives will decide that Netflix isn't a good partner to work with where you put years of work in writing, filming, producing, editing a project just for it to be cancelled a month after it's release, so if you have a story that needs more than one film or a one and done series to tell it in, then Netflix probably isn't your best bet any longer.\n",
        "upvotes": 1517,
        "comments": 305,
        "media": null,
        "permalink": "/r/netflix/comments/1ifkjbm/netflix_has_seriously_harmed_its_reputation_with/"
    },
    {
        "id": "1ig8pzm",
        "author": "Nastia_dream",
        "title": "Is Ginny&amp; Georgia worth watching ?",
        "content": "I haven't heard anything about this show before and since next season is coming out in June, is this show worth the watch ? As I understand it's a teen drama and I'm not really into teen shows these days. Would you still recommend it as a one time watch on the weekend for example ? ",
        "upvotes": 10,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ig8pzm/is_ginny_georgia_worth_watching/"
    },
    {
        "id": "1igav1s",
        "author": "Myboymetaknight",
        "title": "Forgotten tom and jerry like show",
        "content": "There was this show on netflix it was like Tom and Jerry, there was no talking but their sound effects and growls and other like emotion sound effects, it followed a young magician and his Rabbit in a blue and yellow stripped shirt and black shorts, the first episode was him audiencing to get into a magic's school in which he trys to pull his rabbit out of his hat but it doesnt want too so he still his carrot and blends it to a juice pissing him off and then its tom and jerry for the rest of the episode until he finally does but him and his rabbit get in, one episode their this new little cat girl that the others try to sway her to date them but she becomes really punk with a whip when she sneezes, if anyone knows what this show is please tell me i would love to watch it again",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1igav1s/forgotten_tom_and_jerry_like_show/"
    },
    {
        "id": "1ig3rfr",
        "author": "amazingspineman",
        "title": "The Recruit vs Night Agent",
        "content": "For once, Netflix is cooking and gave us two shows with tremendous potential to grow. But given that these shows have always released their seasons close to each other, it hard not to compare them. Especially that they are both spy/political shows. Which do you prefer? \n\nThe Recruit or Night Agent. \n\nI am leaning more toward The Recruit but I am not done with Night Agent season 2 yet so jury still out.",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ig3rfr/the_recruit_vs_night_agent/"
    },
    {
        "id": "1ig4vyw",
        "author": "indiewire",
        "title": "Best New Netflix Shows in February 2025",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ig4vyw/best_new_netflix_shows_in_february_2025/"
    },
    {
        "id": "1igb538",
        "author": "BingoFarmhouse",
        "title": "Progress bar shared between profiles?",
        "content": "If someone on my account watches a show on their own profile, it shows the progress bar on my profile and every profile on my account. It sucks because I have someone in my house who binges *everything*, so almost every show I go to watch is already watched so it's hard to track my place.\n\nIs this a standard feature to share the progress bar between every profile, or is this a bug?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1igb538/progress_bar_shared_between_profiles/"
    },
    {
        "id": "1ifjv14",
        "author": "Alternative_Bid_360",
        "title": "What makes international shows such as Money Heist, Élite and Squid Game so popular?",
        "content": "I’ve been researching the production of a teen drama TV show in the style of *Élite*. While it is a Spanish series, it has gained a massive international following, proving that language isn't necessarily a barrier to global success.\n\nFor those of you who enjoy non-English films and TV shows, what makes you hit *play*? Is it the storytelling, cinematography, cultural uniqueness, or something else entirely?\n\nAnd in particular, I'd like to know what, in your opinion, makes the shows mentioned in the title so popular?",
        "upvotes": 37,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ifjv14/what_makes_international_shows_such_as_money/"
    },
    {
        "id": "1ifrfop",
        "author": "Dependent_Big4782",
        "title": "Kristen Bell's Nobody Wants This co-star lays bare major details about season 2",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ifrfop/kristen_bells_nobody_wants_this_costar_lays_bare/"
    },
    {
        "id": "1ifvj5c",
        "author": "wendigooner69",
        "title": "Any good survival movies or shows?",
        "content": "I just really want something that isn't a competitive situation, like I'd rather someone unintentionally being in the woods and having to survive rather than willingly going for a prize and to compete. Any suggestions let me know asap!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ifvj5c/any_good_survival_movies_or_shows/"
    },
    {
        "id": "1if4333",
        "author": "EthanWilliams_TG",
        "title": "The Duffer Brothers Are Working on Two New Series for Netflix After 'Stranger Things'",
        "content": "",
        "upvotes": 220,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1if4333/the_duffer_brothers_are_working_on_two_new_series/"
    },
    {
        "id": "1ifux8u",
        "author": "ReadJohnny",
        "title": "Change primary profile for Premium plan",
        "content": "I'm using the primary profile for a Premium plan account that I share with others. I would like to choose another profile to be the primary one, so my profile could be removed. Is this possible to do?  \nA last resort would be to ask another person to rename and use my profile instead, and remove theirs. But that means their watch history would be lost. Thanks!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ifux8u/change_primary_profile_for_premium_plan/"
    },
    {
        "id": "1if8iz7",
        "author": "EthanWilliams_TG",
        "title": "Casting Is Officially Underway for Greta Gerwig's Netflix 'Narnia' Movie Series",
        "content": "",
        "upvotes": 65,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1if8iz7/casting_is_officially_underway_for_greta_gerwigs/"
    },
    {
        "id": "1ifl8z6",
        "author": "Rare-Negotiation-151",
        "title": "What shows do you recommend? Need something to watch",
        "content": "I liked better call saul, breaking bad, peaky blinders, band of brothers, queen’s gambit, narcos, etc etc. Couldn’t watch the witcher, not really interested in Squid Game (or most of the new shows) I hate shows with too much drama.. What other great shows can be found in netflix? In desperate need of something to watch",
        "upvotes": 10,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ifl8z6/what_shows_do_you_recommend_need_something_to/"
    },
    {
        "id": "1iflqh2",
        "author": "Eraos_MSM",
        "title": "Why do Netflix subtitles exclude things?",
        "content": "Like I was watching Dexter, a character says \"Yeah you can give me a fucking analysis on the blood spatter on these killings\" but the subtitles read \"Yeah you can give me a fucking analysis on the blood spatter\" \n\nI've seen this countless times on Nettlix and it seems like a pretty bad decision, like if someone was deaf they would miss things.",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1iflqh2/why_do_netflix_subtitles_exclude_things/"
    },
    {
        "id": "1ig8u7u",
        "author": "AC_Sport",
        "title": "WWE on NETFLIX missing episodes / content",
        "content": "WWE and NETFLIX has dropped the ball big time. There are thousands of past Raw, Smackdown and NXT episodes missing from their vault/archive.\n\nMany WWE fans were watching past episodes on the WWE Network. But now they have closed the WWE Network and moved to Netflix. We have lost like 90% of the archival content and are unable to watch past episodes.\n\nEVERYONE PLEASE EMAIL WWE AT THIS ADDRESS\n\n[support@wwe.com](mailto:support@wwe.com)\n\nTo let them know they are failing with their service. More voices and maybe they will act and supply the fans with the content that should have been available day one.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ig8u7u/wwe_on_netflix_missing_episodes_content/"
    },
    {
        "id": "1ifp05d",
        "author": "Southern-Brother5693",
        "title": "The Netflix TV User Interface Homepage",
        "content": "I watch Netflix through my Sony Bravia TV. Does anyone notice that the Netflix user homepage seems to have slightly changed.\n\nUsually, they put the pic of new and popular movies/show up large in front. But now they put our \"List\" and \"Still Watching\" in front instead. Which is convenient i guess, but i thought the old format was more aesthetically pleasing.\n\nAre the rest of you seeing the same thing?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ifp05d/the_netflix_tv_user_interface_homepage/"
    },
    {
        "id": "1ifr9pm",
        "author": "forevony_0904",
        "title": "Show list ideas",
        "content": "\n\n\n\nHi all so I've got more shows on my list to watch now I finished watching heartbreak high (I do know it has a season 3 coming out) and i just finished watching Atypical.  But there are shows on my list that I'm not sure if they are complete such as\n\nEverything sucks,\nTrinkets,\nFakes,\nEverything now,\nMaid,\nPaper dolls,\nMiseducation,\nBeauty in black,\nI am not okay with this,\nControl Z,\nGrand army ,\nClass,\nRaising voices,\nUnbelievable,\nSex Education,\nOne day\n\n\n\nSo yea I just wanna know if those  shows I just mentioned above are they completed or do I have to wait for more seasons after I watch the show. Thanks in advanced all",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ifr9pm/show_list_ideas/"
    },
    {
        "id": "1iep9ta",
        "author": "johnppd",
        "title": "‘The Sandman’ Canceled at Netflix, Will End With Season 2",
        "content": "",
        "upvotes": 780,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1iep9ta/the_sandman_canceled_at_netflix_will_end_with/"
    },
    {
        "id": "1iflfxf",
        "author": "Atlast_2091",
        "title": "Demon City | Official Trailer - Killing isn't enough when there's hell to pay. \nSakata, the \"Immortal Hit Man,\" revives from the depths of hell and unleashes his inner demon to avenge his wife and daughter.",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iflfxf/demon_city_official_trailer_killing_isnt_enough/"
    },
    {
        "id": "1ifp93t",
        "author": "Humble_Crisis78",
        "title": "Make secondary member the primary member.",
        "content": "I’m sharing my Netflix with my mom but I never watch it. A while ago she said that she would pay for it if I put her in as a secondary member. Now she wants the whole account because she is paying for it and since I never watch it I don’t really care to argue about it. How can I remove myself completely and make her the primary on the account?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ifp93t/make_secondary_member_the_primary_member/"
    },
    {
        "id": "1ig2kla",
        "author": "BillDifficult9534",
        "title": "Stop taking away my comfort shows!",
        "content": "Whyyyyyyy!!! Brooklyn 99 and The Mindy Project aren’t hurting anyone! Leave my shows alone! And stop raising prices if my shows are going to continue to disappear. Wtf. I’m annoyed. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ig2kla/stop_taking_away_my_comfort_shows/"
    },
    {
        "id": "1ig65no",
        "author": "omgroflgamer",
        "title": "Supposedly I to have no ads... then what is this?",
        "content": "",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ig65no/supposedly_i_to_have_no_ads_then_what_is_this/"
    },
    {
        "id": "1if90r7",
        "author": "JoshyKuroiRaion",
        "title": "'Kaos' question",
        "content": "Was there any news/leaks or literally anything on what the script was for S2. I've just binged the whole series in one go and found out it's been cancelled. \n\nIt's unlikely but I know before scripts/notes for cancelled projects has been released before, Really really hoping I get just a small taste of what S2 would've given us!",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1if90r7/kaos_question/"
    },
    {
        "id": "1ig2hsq",
        "author": "KyluAce",
        "title": "Am I the only one who thinks that Netflix anime are overrated?",
        "content": "I really enjoy watching anime. Over the past few years, Netflix has started producing its own anime series. I’ve watched a few of them because they had high ratings on popular platforms like IMDb, but honestly, they turned out to be pretty average.\n\nWhen I see an anime with ratings similar to my top-tier favorites (*Attack on Titan, Fullmetal Alchemist: Brotherhood, Erased, Demon Slayer, Solo Leveling, Jujutsu Kaisen, The Promised Neverland*), I expect it to be on the same level. However, when I think about Netflix anime, the ones that come to mind are *DanDaDan* and *Cyberpunk: Edgerunners*, and in comparison, they feel mid at best.\n\nI have a theory that maybe these shows get such high ratings because a lot of people watching them haven’t actually seen truly great anime (except for what's available on Netflix). What do you think?\n\n**P.S.** I intentionally didn’t mention series like *Naruto, Bleach,* or *One Piece*. I think they’re great, but they also have their flaws—like inconsistent animation quality (sometimes downright awful) and unnecessarily dragged-out storylines.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ig2hsq/am_i_the_only_one_who_thinks_that_netflix_anime/"
    },
    {
        "id": "1ifqbbd",
        "author": "BinojBI",
        "title": "Screen glitches and flickering on fullscreen netflix app on windows pc",
        "content": "Hi, I have faced this wired flickering some times when playing netflix app on my windows pc. This only happen on playing netlix app on fullscreen. Does anyone have idea whats going on????",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/v6egwj87xnge1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ifqbbd/screen_glitches_and_flickering_on_fullscreen/"
    },
    {
        "id": "1if7ru3",
        "author": "peoplemagazine",
        "title": "A Major West Wing Reunion Is Coming to The Diplomat — See First Look Photos",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1if7ru3/a_major_west_wing_reunion_is_coming_to_the/"
    },
    {
        "id": "1ifetst",
        "author": "mypookiesdookie",
        "title": "Will there be a 3rd season of Rise of Empires: Ottoman?",
        "content": "I just got wind of this show and am positively obsessed with both the show and the main lead who plays Fetih Mehmed. If there are any similar projects of his that yall could recommend, I'd gladly watch em in the meantime.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ifetst/will_there_be_a_3rd_season_of_rise_of_empires/"
    },
    {
        "id": "1iflk6n",
        "author": "highfructose78",
        "title": "Looking for a sci Fi show",
        "content": "I don't remember the name of the show.  I remember it had a female astronaut who was in love with a woman.  They couldn't make their relationship public.  The astronaut goes off to space and her ship is lost.  Her girlfriend was a space flight director.  They encountered an alien presence that was using her girlfriend's image to lure her in.  Does it sound familiar?  I know the song space oddity was used alot.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iflk6n/looking_for_a_sci_fi_show/"
    },
    {
        "id": "1iew5w6",
        "author": "Solokid87",
        "title": "The ending of American Primeval did an amazing job. What do you think?",
        "content": "(SPOILERS AHEAD)\n\nThe way American Primeval wrapped up was straight-up poetic. The Mormons taking over Utah showed just how ruthless power grabs were back then . Ironically the same kind of evil that was forced onto them when their religion first started. Jim Bridger giving up his fortress really drove home the idea that every man has a price. Sometimes even the strongest can be swayed. The Natives gave up their right to peace with the whites just to keep Abish safe, only for Jacob to be the one who killed her. That was brutal. And Isaac’s last act, getting Devin and Sarah to safety was a heartbreaking parallel to what he couldn’t do for his own wife and son. The worst part? That’s exactly what got him killed. Every story came full circle in a way that felt raw, tragic, and strangely perfect. I give it a 9.6",
        "upvotes": 60,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1iew5w6/the_ending_of_american_primeval_did_an_amazing/"
    }
]