[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j15v5s",
        "author": "ellissabain",
        "title": "Gabby Petito’s parents have revealed what happened to the van",
        "content": "",
        "upvotes": 1124,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1j15v5s/gabby_petitos_parents_have_revealed_what_happened/"
    },
    {
        "id": "1j26df8",
        "author": "MOJOBWA",
        "title": "Lip sync issues",
        "content": "I know this isn’t new but numerous shows and movies have this lip sync issue, but why hasn’t Netflix fixed this issue? I’m thinking certain shows have been redubbed to English I’m guessing. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j26df8/lip_sync_issues/"
    },
    {
        "id": "1j27a3d",
        "author": "SnooTomatoes7723",
        "title": "Is it worth to watch 1899 even tho it got cancelled? | Or similar shows like From and Lost?",
        "content": "Hey, I finished the show \"From\" which is a horror mystery, and I heard that 1899 should have a similar vibe. But people said it is not worth starting the show because it ends on a cliffhänger and the second season got cancelled, so I would be just mad after watching it. Do you think it is still worth it, and more importantly, do you have recommendations for shows like From or Lost?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j27a3d/is_it_worth_to_watch_1899_even_tho_it_got/"
    },
    {
        "id": "1j1ykpe",
        "author": "Lola_ry08",
        "title": "Good comedies/sitcoms",
        "content": "I love sitcoms so I’m looking for more similar shows! \nSome I’ve watched so far: \nFriday night dinner \nKim’s convenience \nThe office \nSuperstore \n\nAny similar shows would be great! ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ykpe/good_comediessitcoms/"
    },
    {
        "id": "1j1eisa",
        "author": "bvmdavidson",
        "title": "Every show I like gets cancelled",
        "content": "Title. It’s seriously unbelievable how many shows get cancelled after their first season. For me, the first big hit was Marco Polo. So good. It got cancelled on a cliff hanger. Its high production cost was cited. Fine, I guess. \n\n1899- had me hooked in the first few minutes. Cancelled. \n\nArchive 81- 8 episodes. The first one was slow to get through, granted, but by the end it was easily one of my favorite horror/suspense shows. CANCELLED. And it’s certainly not the production costs since very little special effects were used. \n\nThere were more shows that got canceled, obviously, but these were the three that really got to me. Seriously considering cancelling\n Netflix now since all they seem to care about is producing trash. \n\n\n“New on netflix” flair because it’s ironically relevant.",
        "upvotes": 103,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1j1eisa/every_show_i_like_gets_cancelled/"
    },
    {
        "id": "1j1wsdy",
        "author": "Klownicle",
        "title": "Account Sharing for Kids, still works without Extra Member?",
        "content": "I understand with Netflix you have to add an \"extra member\" to share your account these days but a curious situation has had me doing some research on those details.  A friend of mine ex's has \"shared\" whether it be unofficial or officially their account (it sounds unofficially).  Everything was fine up until recently where the \"adult\" standard profile now states extra member mumbo jumbo where \"not in this family\" / \"are you in vacation\" etc.  I assume with the extra member stuff, you actually get your own account and you're just attached to theirs.  So by this logic the account wasn't an extra member as they are/we're using it under their ex's email.\n\nSo enough background, the question is, this account even tho it preaches about unknown location, the \"Kids\" profile still works without issue for their kids.\n\nIs this something normal where Netflix doesn't restrict Kids profiles the same or is this more of a fluke?\n\nThanks!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1wsdy/account_sharing_for_kids_still_works_without/"
    },
    {
        "id": "1j1upda",
        "author": "CharmingPie9424",
        "title": "Question about the trust fund set-up in The Perfect Couple",
        "content": "In The Perfect Couple, the trust fund is set up so that none of the children receive their trusts until the youngest child turns 18. I've never heard of this structure before, so I'm just wondering, is this really a thing? Is it common? Would the trust have really automatically reset because of Merritt's child or could they have legally changed it?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j1upda/question_about_the_trust_fund_setup_in_the/"
    },
    {
        "id": "1j1szlf",
        "author": "EthanWilliams_TG",
        "title": "'Suits' Breaks Streaming Records and Earns Big Money for Streaming Services",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j1szlf/suits_breaks_streaming_records_and_earns_big/"
    },
    {
        "id": "1j1ctgk",
        "author": "HowNow101",
        "title": "I Hate Netflix's new visual update",
        "content": "Just switched on Netflix and theres a new visual update in the UK anyway, and I hate it. When scrolling through on TV the images are just too big, I want to be able to see more options on the screen without scrolling right. Is there a way to change back to before this crappy update?",
        "upvotes": 30,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ctgk/i_hate_netflixs_new_visual_update/"
    },
    {
        "id": "1j1aw7p",
        "author": "Simple_Beat6344",
        "title": "Don’t Look Up on Netflix",
        "content": "I watched this movie when it was first released and watched again today. I couldve sworn the last dinner scene was gory and showed everyone dying in slow motion. \n\nWas the movie edited or am I getting it confused with something else? ",
        "upvotes": 24,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j1aw7p/dont_look_up_on_netflix/"
    },
    {
        "id": "1j11xwq",
        "author": "StorthTheElder",
        "title": "Help! Adult content showing on kids profile",
        "content": "How do I fix this? The kids icon is displaying in the bottom-right and the correct profile icon showing, so I'm on the right profile. You can see configuration settings appear to be correct on the second screen. Please help!",
        "upvotes": 76,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1j11xwq/help_adult_content_showing_on_kids_profile/"
    },
    {
        "id": "1j1sefn",
        "author": "Atlast_2091",
        "title": "Devil May Cry (2025) - Preview",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1sefn/devil_may_cry_2025_preview/"
    },
    {
        "id": "1j1foz7",
        "author": "fuxandfriends",
        "title": "Is there a way to increase font size?",
        "content": "so I have newly terrible vision and watch netflix through samsung smart tvs. is there a hidden accessibility setting menu to make descriptions and menus a larger font? \n\ni’m so sick of having to look through my phone camera or my phone app to figure out what episode I’m on or even titles of shows. \n\n(this is not a netflix only issue i’m having so any insight is helpful at this point)",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1foz7/is_there_a_way_to_increase_font_size/"
    },
    {
        "id": "1j1pr1g",
        "author": "KitchenBeneficial302",
        "title": "5 Films from Netflix Animation in 2025",
        "content": "# Five Films from Netflix Animation in 2025\n* In Your Dreams - April 4, 2025\n* The Twits - June 13, 2025\n* Untitled Robert Marianetti, Robert Smigel and David Wachtenheim film - August 22, 2025\n* Untitled Charlie Bean, Paul Briggs and John Ripa film - October 17, 2025\n* Untitled Don Bluth, Gary Goldman and Dexter Fletcher film - December 5, 2025",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1pr1g/5_films_from_netflix_animation_in_2025/"
    },
    {
        "id": "1j1osz7",
        "author": "Fando92",
        "title": "No HDR on Windows PC?",
        "content": "Hi guys. Around a week ago I upgraded my Netflix plan to Premium with the idea to watch HDR content on my new OLED monitor. The thing is, whatever I do, there is no HDR on my PC with Windows 11 Pro. It is only working on my TV.\n\nI have already contacted Netflix support 3 times with no luck, no one was even close to help. Believe me I have already tried what I could. I installed the HEVC video extensions from the Microsoft store, I have tried with several browsers like Edge, Opera, Firefox and of course Chrome. The weird thing is that it was working on Chrome then it stopped there too and I can't make it work again. There's just no HDR indicator anywhere.\n\nI have disabled and enabled the GPU hardware acceliration several times with no luck. I have enabled forced HDR in Edge and it is still not working. I have Auto HDR enabled on Windows and still doesn't make a difference. I am using HDMI 2.1 cable if that matters with a RX 7900 XT if that matters. I have even tried with DP and it is still not working.\n\nI am using HDR in games and Youtube content all the time so I know it is working, it is not wokring only on Netflix. I have installed the Desktop App too and it is not workinig there too. I have set the playback settings quality to \"High - Best video and audo quality etc\". \n\nSo I was just wondering if there is anything else I could try before downgrading my plan. Any advice would be of help, thanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1osz7/no_hdr_on_windows_pc/"
    },
    {
        "id": "1j1qhyt",
        "author": "Recdave98",
        "title": "Why do some 4k titles stream in 4k but others don’t?",
        "content": "On my 4k Apple TV I can see what it’s playing in by pressing the down button and some 4k available titles always say HD no matter what but when I check another 4k title it says 4k. For example Love is Blind is always in HD but Stranger things 4k. I do have crappy WiFi (I’m getting 22mbps wired due to my area) but still it’s able to handle some titles in 4k but this one show never ? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1qhyt/why_do_some_4k_titles_stream_in_4k_but_others_dont/"
    },
    {
        "id": "1j19elo",
        "author": "backrollerpapertowel",
        "title": "\"Your device isn’t part of the Netflix Household for this account\" while sitting in my house?",
        "content": "I've suddenly started getting the above message when logging in on my PC to Netflix. The thing is, I am part of the household, I'm in my house on the same wifi and everything. it won't allow phones, PCs, nothing to log in without a code now all while in the same house/wifi. everything except the smart tv makes us put in the code every 14 days.  \n\n  \nhow do we fix this? ",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j19elo/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1j1fmba",
        "author": "leffy5",
        "title": "Any recommendation for government coverups or conspiracy shows?",
        "content": "I love stranger things but after watching it 7 or 8 times i want to watch something else. I’m very into government coverup shows so I’m wondering if there are any recccomendations you all have since i can’t seem to find any.",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j1fmba/any_recommendation_for_government_coverups_or/"
    },
    {
        "id": "1j0u8jy",
        "author": "Unfair_Future_9726",
        "title": "Netflix intro by Hans Zimmer",
        "content": "This was so satisfying to hear😭😭😭 I wish this was the intro of every original movies and TV shows on Netflix.",
        "upvotes": 37,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/va9ar9yz71me1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j0u8jy/netflix_intro_by_hans_zimmer/"
    },
    {
        "id": "1j1lvqy",
        "author": "Visual_Conference144",
        "title": "Is the devtool netflix pfp hack fixed?",
        "content": "Hey so i lost my account and created a new one. But unfortunatly my preccious demogorgon pfp is now gone..i tried to bring it back with devtool but there is no tab where i can edit is. Was it fixxed? Is there another way?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1lvqy/is_the_devtool_netflix_pfp_hack_fixed/"
    },
    {
        "id": "1j1w5pq",
        "author": "Megaminisima",
        "title": "So Alpha Males was a great existing show and the Dutch just remade it almost scene for scene?!",
        "content": "Dear sweet colonisers. Alpha Males is just barely out of the womb. Already subtitled and dubbed (if needed). How unoriginal can the Dutch be? Who paid for this? ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j1w5pq/so_alpha_males_was_a_great_existing_show_and_the/"
    },
    {
        "id": "1j1cex5",
        "author": "Present_Flatworm_288",
        "title": "Why does Netflix on my TV still have the profile lock even after i removed it? The Pin that I had before doesn't work when i put it in either",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j1cex5/why_does_netflix_on_my_tv_still_have_the_profile/"
    },
    {
        "id": "1j11lda",
        "author": "StillWaitingForDad",
        "title": "somethings wrong with my Netflix profile?",
        "content": "on my netflix account there are 4 users and this issue is for my profile only and it happens on all platforms. UK netflix\n\nwhen i load up netflix on any platform my profile icon is just a red smiley face rather than what i picked for it. i dont know why. and if i go onto my profile i have limited access to shows.  and that most of the continue watching catagory is empty with only a few on these. i know this because i was going to try to watch halo but its not there? but if i go onto another profile, everything is there and available to watch? why is this only happening to my profile? its the same on pc, xbox, mobile, smart tv, everything. i just want to watch some netflix",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j11lda/somethings_wrong_with_my_netflix_profile/"
    },
    {
        "id": "1j18rg0",
        "author": "dailystar_news",
        "title": "WWE Elimination Chamber LIVE on Netflix as John Cena and Trish Stratus return while Rock wants a 'soul'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j18rg0/wwe_elimination_chamber_live_on_netflix_as_john/"
    },
    {
        "id": "1j1hs3u",
        "author": "Fuwaboi",
        "title": "What is an English speaking show on Netflix with either alot of cultural subtext or specific lingo in its dialogue?",
        "content": "Hi, I'm a university student studying the English language course and I had to do a writing. So I wanna find a show with the above criteria to do a writing on (specifically compare the official subtitle of a different language to the source), but I dont really know where to find one. I hope someone here can have a suggestion for me. Any kind of show is find, but comedy would be preferable. I'm not sure if this is the appropriate place to ask, but I dont know where else to find a suggestion.\n\nThe wrd limit is really annoying, so I'm just gonna spam stuff til it hit the minimum requirement. Hope y'all dont mind.\n\nSi, si, si, so, so, si, si, si, si, so, si, si, si, si, si, si,nsi, si, si, so, si, si, si, so, sk, si, siz si,nsi, si, si, si, si, si, siz si, si @*, sis, si, si, si, si, si, si, zis ,isn, sisi, si, si, si, si, si,nsi, si, si, si,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,is ,isnzi, si, sj, si",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs3u/what_is_an_english_speaking_show_on_netflix_with/"
    },
    {
        "id": "1j1hs09",
        "author": "Zealousideal_Low_321",
        "title": "Recommend Cheating Wife/Girlfriend shows/movies",
        "content": "Recommend some Shows/Movies where the Wife/Girlfriend is cheating on their Partner with some other dude.\n\nIn modern times there are tons of movies/shows revolving around this plot which makes the plot insanely Dramatic &amp; I am sure Netflix has got many amazing shows/movies where The Wife/Girlfriend cheats on their Partner with some other man.. recommend some of these Shows/Movies guys 👍🏻",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs09/recommend_cheating_wifegirlfriend_showsmovies/"
    },
    {
        "id": "1j1hs7t",
        "author": "dailystar_news",
        "title": "WWE Elimination Chamber 2025 on Netflix results in full as John Cena shocks the world",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1hs7t/wwe_elimination_chamber_2025_on_netflix_results/"
    },
    {
        "id": "1j0lkx6",
        "author": "MBlaizze",
        "title": "The new user interface is so bad that I am thinking about canceling Netflix",
        "content": "This has to be the dumbest “upgrade” I have ever seen. I can barely see any of the content, and it feels like I am looking at the world through a tiny hole. If anything, they should have made the thumbnails even smaller so they could add more per screen. I hate it so much.",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1j0lkx6/the_new_user_interface_is_so_bad_that_i_am/"
    },
    {
        "id": "1j11nga",
        "author": "hooshi_t",
        "title": "Netflix Profile Pic on TV",
        "content": "I've been watching netflix on my smart tv, today i was looking trough the profile pictures and couldn't find any i liked. Is there a way to get more pfps or customize to different ones in the Tv? Thankyou!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j11nga/netflix_profile_pic_on_tv/"
    },
    {
        "id": "1j1b546",
        "author": "Dremcis",
        "title": "little personal outburst",
        "content": "imagine paying a monthly subscription only to have the series you're watching get completely deleted from netlix, not to mention the few still sensible series that get deleted because the budget for the creation of the series has to be invested in worse films",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1b546/little_personal_outburst/"
    }
]