[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oh4o8i",
        "author": "mother_earth_13",
        "title": "Susan in “The Perfect Neighbor” premeditated the shooting, not Just a “fed-Up” old lady.",
        "content": "This started as a reply to a comment, but after seeing so many threads blaming the “permissive” parents or portraying Susan as a harassed senior defending her turf, I had to make it a post. The doc shows Susan’s actions were calculated, not reactive self-defense. \n\nI get the parental angle, I’d be extra vigilant too and would keep my kids away from someone like Susan with her cursing, petty aggressions and escalating beef. You never know what people are capable of so you should trust your instincts, but blaming the parents overlooks Susan’s premeditation.\n\nSusan told AJ’s kid to fetch his mom (knowing it’d bring AJ over), called 911 then shot AJ unarmed in under two minutes. Florida’s Stand Your Ground might cover perceived threats on your property, but why not wait for cops? Lock the door? Retreat inside? Aim non-lethally? The body cams, timelines and forensics scream intent, not fear.\n\nShe escalated from verbal abuse to physical by throwing skates and swinging umbrellas at AJ’s kid to provoke AJ. That’s baiting, not being “fed up.” Any parent would confront that. The trespassing and door-banging excuses ignore how Susan orchestrated it betting on the law to shield her.\n\nParents could’ve chosen differently in hindsight, but Susan had clear alternatives to killing. Someone that determined would’ve found a way regardless. \n\nAccountability’s on her.",
        "upvotes": 184,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1oh4o8i/susan_in_the_perfect_neighbor_premeditated_the/"
    },
    {
        "id": "1ohezqh",
        "author": "Virtual_Ad3412",
        "title": "A “House Of Dynamite “ has to be the worst produced film ever",
        "content": "If there is ever to be an award for worst film ever , look no further . Would never imagine such being released as a ‘film’ . There is no story , just anticipation from different points of view and movie accomplishes nothing, tells story of nothing , exposes nothing, results in nothing , accomplishes nothing . \n\nThe whole movie is literally is like 15mins of a war room on repeat for couple of hours . ",
        "upvotes": 28,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1ohezqh/a_house_of_dynamite_has_to_be_the_worst_produced/"
    },
    {
        "id": "1ohhtte",
        "author": "ArtIsDead77_",
        "title": "House of Dynamite",
        "content": "I know there are handful of people on this sub who did not enjoy this film. \n\nI, however very much liked it. I loved the score, I loved the tension, and I loved the acting. \n\nI loved that the film was told through different characters point of view… It definitely was not a chronological narrative so to say which is fine because it’s a different style of story telling… (Babel). \n\nI know some people didn’t enjoy the ending (cliffhanger) but it’s up for interpretation. I think the Bomb went off and I think the audience not been informed of who launched the bomb also worked quite nicely. \n\nI think it’s okay if you don’t like it, and it’s okay if you do like it. So let’s stop shitting on other people’s opinions and quit trying to change their mind(s). \n\nI think the way how we watch media has changed. The rise of technology and acquiring information so quickly, has sort of shifted how we view movies. We want conclusions, we want information, we want the plot to be easy to follow, we want to know what exactly what happens. So it makes sense If there are a lot of people who are not really a fan of cliffhangers, which is OK. It’s just a different way of absorbing media.\n\n",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhtte/house_of_dynamite/"
    },
    {
        "id": "1ogz75a",
        "author": "Boring_Sand_206",
        "title": "Hidden gems please",
        "content": "I have been unemployed since forever (not for lack of trying!) so I have watched A LOT of Netflix. I think I've watched pretty much everything worth watching on there. Anyone have some hidden gem recommendations for me??",
        "upvotes": 157,
        "comments": 429,
        "media": null,
        "permalink": "/r/netflix/comments/1ogz75a/hidden_gems_please/"
    },
    {
        "id": "1ogo0q8",
        "author": "Newfie3",
        "title": "House of Dynamite - wholly unsatisfying (spoiler)",
        "content": "I should have known by the horrible deliberate camera-shaking that the movie was going to suck. There is no good reason for deliberate camera-shaking. Then the plot repeated itself from three or four perspectives. Then the movie just ended with zero resolution whatsoever. Sorry Netflix, this movie was a bomb, but not in a good way.",
        "upvotes": 246,
        "comments": 294,
        "media": null,
        "permalink": "/r/netflix/comments/1ogo0q8/house_of_dynamite_wholly_unsatisfying_spoiler/"
    },
    {
        "id": "1ohhaze",
        "author": "peoplemagazine",
        "title": "Joe Keery Officiates Friends' Wedding Dressed as His Stranger Things Character Steve Harrington",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhaze/joe_keery_officiates_friends_wedding_dressed_as/"
    },
    {
        "id": "1ohg8ll",
        "author": "namelessfdr",
        "title": "Just upgraded to an LG OLED - best movies and shows to watch in 4K?",
        "content": "Saw \"House of Dynamite\" last night and am looking forward to \"Frankenstein\". Will probably rewatch Fincher's movies. Any other good choices for movies and shows to watch in 4k?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ohg8ll/just_upgraded_to_an_lg_oled_best_movies_and_shows/"
    },
    {
        "id": "1ohjgwq",
        "author": "Fvckyourdreams",
        "title": "Watch Day Shift (2022)!!! :0",
        "content": "Jaime Foxx plays a Vampire Hunter who doubles as a pool boy with Dave Franco as his inexperienced buddy. Snoop has a BIG role. 10/10. So fun. Really impressed me with this one. :0",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ohjgwq/watch_day_shift_2022_0/"
    },
    {
        "id": "1ohj2ul",
        "author": "Minute-Car8845",
        "title": "How exactly do subscriptions and different accounts work?",
        "content": "Sorry if this comes off as technologically incompetent, but for quite a while my household have been account sharing with my aunt who has her own and offered to pay for 3 others for the rest of the family. We occasionally have trouble accessing Netflix with a message along the lines of 'we have updated the terms and services and you must sign in again', but just now as we caved and payed for our own subscription, we logged back into the account which we thought was blocked and now works. Did we waste our money? Why does Netflix occasionally allow the account and then blocks it? Hope we aren't doing anything wrong and thanks for any information.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohj2ul/how_exactly_do_subscriptions_and_different/"
    },
    {
        "id": "1ohi2ul",
        "author": "alyxarthurs",
        "title": "Psychological thriller/ghostly horror SHOWS!",
        "content": "My favorite shows on Netflix: \n-Dirty John (season 1)\n-The haunting of Hill House\n-The Watcher\n-The Stranger\n-The fall of the house of Usher\n-You\n-Behind her eyes\n\nI feel like I’m missing something but whatever, you get the vibe. \nI need another show, or shows, that kinda fit with these.  \nAdd on: I despise shows that follow high school schoolers as the main characters. Just not my thing.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohi2ul/psychological_thrillerghostly_horror_shows/"
    },
    {
        "id": "1ogee04",
        "author": "Western_Quit_4966",
        "title": "Netflix doesn’t care about good writing anymore",
        "content": "The platform is full of shows with huge production value but terrible scripts. It’s all visuals and marketing, zero substance. People only praise it because it’s on Netflix. Who’s tired of this?",
        "upvotes": 330,
        "comments": 193,
        "media": null,
        "permalink": "/r/netflix/comments/1ogee04/netflix_doesnt_care_about_good_writing_anymore/"
    },
    {
        "id": "1ohfj09",
        "author": "dea80",
        "title": "Blind Spot",
        "content": "Thoughts from anyone else who watched this? \n\nI’m not sure what hell I just sat through, but a combination of the script, acting, plot, and effects, I’m in shock that this ever got made! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ohfj09/blind_spot/"
    },
    {
        "id": "1oh9w8t",
        "author": "No_Budget3360",
        "title": "Should i stop watching Marco Polo (2014) ?",
        "content": "I’ve already watched up to Episode 7 - Season 1 of *Marco Polo (1Ep/Day)*, and just today I found out that the series was cancelled after Season 2. Before I continue watching, I want to know — does Season 2 have any real conclusion, or does it end on a cliffhanger with everything left unresolved? Basically, should I stop here or still go ahead and finish the series?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oh9w8t/should_i_stop_watching_marco_polo_2014/"
    },
    {
        "id": "1oh7opm",
        "author": "bohemiangels",
        "title": "The Monster of Florence question [SPOILER]",
        "content": "So the show really seemed to suggest that Salvatore Vinci was tge monster. He had no alibis for any of the murders, one of 11 guns like the one used in the murders sold in his region belonged to his family member and was unaccounted for, his first wife died suspiciously… What I’m wondering is how much of his story that the series put forth was actually true/proven? Is there any public knowledge of his family/early life? Was he gay? Did he have a relationship with his first wife’s brother? Did he have a relationship with Stafano? Did he tell Stafano he killed his first wife and did Stefano make a statement to police about that eventually? And then recant that at Salvatore’s trial? Was he really married to someone who left him twice, each time lining up with a murder?\nThere seems to be a strong commentary about the homophobic, machismo, sexist culture at that place and time having fostered the misogyny of this psychopath. Almost like he learned from his father but also everything around him that he must dominate the women around him in order to be able to have relationships with men. As though women were such a threat to him that he hated them, murdered them and literally excised what made them female. The fact that his victims were  heterosexual couples having sex (except the one where they say one of the men was probably mistaken for a woman), further suggests that his motivation was borne of distain for a culture that accepted hetero sex and rejected gay sex. \nIt felt like a really strong assertion of that narrative to me but I wonder how much of it is actually true.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh7opm/the_monster_of_florence_question_spoiler/"
    },
    {
        "id": "1ogep7t",
        "author": "YeetMyM3at",
        "title": "Anyone else spend more time scrolling than actually watching?",
        "content": "I open Netflix planning to watch something, then end up scrolling for 30 minutes trying to pick a show.  \nBy the time I finally choose, I’m not even in the mood anymore.\n\nDoes anyone else do this, or is it just me?",
        "upvotes": 133,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1ogep7t/anyone_else_spend_more_time_scrolling_than/"
    },
    {
        "id": "1oh853p",
        "author": "bahama_llamas",
        "title": "Login refreshes blank",
        "content": "Hi I have a ASUS Rog Zephyrus G14 and every time I try to login into Netflix the screen just refreshes and I’m back at a blank login. No error code or anything. I’m on the same wifi as my other devices and they all login perfectly fine. \n\nI’ve cleared cookies, tried difference browsers, uninstalled resintalled the app and nothing is working. All my drivers and laptop are up to date. Has anyone else experienced this and know what to do? Please help!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh853p/login_refreshes_blank/"
    },
    {
        "id": "1oh7xql",
        "author": "443610",
        "title": "Last Samurai Standing - Official Trailer",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oh7xql/last_samurai_standing_official_trailer/"
    },
    {
        "id": "1og8tmv",
        "author": "liveoutdoor",
        "title": "I really hate Netflix at the moment.",
        "content": "As a pet/house sitter I am usually away from my house. I bring my own device to stream, so far tonight I have had to update my household, ener codes etc 5 times. Then the family back at home gets booted it is so ridiculous.\n\nJust a rant. ",
        "upvotes": 176,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1og8tmv/i_really_hate_netflix_at_the_moment/"
    },
    {
        "id": "1ogbg13",
        "author": "Short_Pin_6243",
        "title": "House of Dynamite was so close to being great",
        "content": "*Potential minor spoiler*\n\nJust watched the movie and I don’t think I’ve ever felt this way about a film before. Everything was right there to make a great film but they veered off so unnecessarily. \n\nAll the film needed to do was continue to build off the tension of the first act. It felt plausible yet unbelievable at the same time. It captured the complete panic that would take place. \n\nThen they had to switch perspectives…..twice. It completely took me out of the tense feeling of the first third. It sucks because it was completely unnecessary. ",
        "upvotes": 112,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1ogbg13/house_of_dynamite_was_so_close_to_being_great/"
    },
    {
        "id": "1oh5agz",
        "author": "Ok_Percentage7257",
        "title": "Mo (season 3) (Spoilers about Season 1 and 2 mentioned while speculating season 3)",
        "content": "I am speculating Mo will be back. Season 3 will be on the West Bank or another Palestinian setting. We will likely witness the IDF in action on Mo and his family. Mo's romantic life will be pragmatic. Mo and Maria will want their marriage to be real because of their feelings towards each other. \n\nMo will continue to self-sabotage. The IDF won't be as patient as ICE. I think we will continue to see Mo lying to get out of sticky situations. Mo will lose more in Season 3. I assume there will be more drama. I also think it will be funny. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh5agz/mo_season_3_spoilers_about_season_1_and_2/"
    },
    {
        "id": "1oh00o9",
        "author": "RemarkableLab433",
        "title": "Adhd thriller",
        "content": "I love shows high paced either super creepy or action and mystery but not slow with having adhd I can’t find a show settle in at all Want show u highly suggest will keep me hooked and engaged",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oh00o9/adhd_thriller/"
    },
    {
        "id": "1oh3n9e",
        "author": "crocshock7",
        "title": "How does Yellowjackets s3 compare to 1-2? No spoilers pls.",
        "content": "This show had an interesting concept. I was immediately intrigued from the very first scene. But wasn’t that well done, unfortunately, but it was watchable. Season 2 was a boring chore. I really wish they leaned more into the horror and supernatural elements, but I guess this isn’t that kind of show.\n\nHow does season 3 compare? If it’s as much of a drag as season 2, I’m not going to bother continuing.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oh3n9e/how_does_yellowjackets_s3_compare_to_12_no/"
    },
    {
        "id": "1oh31xh",
        "author": "TicoNasty",
        "title": "House of Dynamite WH Press Secretary",
        "content": "Anybody notice the White House Press Secretary on House of Dynamite looks like an amalgamation of the last 3 press secretaries, Psaki, KJP, and Leavitt.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh31xh/house_of_dynamite_wh_press_secretary/"
    },
    {
        "id": "1ogeycg",
        "author": "Leen88",
        "title": "Just finished a show and now I have that what do I watch next",
        "content": "I just finished my latest binge and now nothing else feels interesting.  \nI scroll for like 20 minutes but can’t commit to a new show.\n\nAnyone else get that empty feeling after finishing a really good series?",
        "upvotes": 23,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeycg/just_finished_a_show_and_now_i_have_that_what_do/"
    },
    {
        "id": "1ogsjli",
        "author": "Halloween-Year-Round",
        "title": "Guillermo Del Toro's \"Frankenstein\" - A Visually Rich Masterpiece [Review]",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogsjli/guillermo_del_toros_frankenstein_a_visually_rich/"
    },
    {
        "id": "1ogomhe",
        "author": "Ok-Lingonberry5621",
        "title": "THE PERFECT NEIGHBOR EXTRA FAMILY INFO THAT MAY CHANGE THINGS??",
        "content": "i just watched the documentary and was hoping the family got proceeds for the kids college or the general recovery of the family\nthey didn’t.\nno money at alllll from netflix.\nthey can only receive donations from their gofundme",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogomhe/the_perfect_neighbor_extra_family_info_that_may/"
    },
    {
        "id": "1ogypbc",
        "author": "chipkeymouse",
        "title": "Netflix only allowing 2 devices to stream at once now?",
        "content": "I could have sworn that they used to let 3 at once but now it stops me when a third person tries to stream. I don't remember this happening in the past. Was this a relatively new change or is there some issue with netflix?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ogypbc/netflix_only_allowing_2_devices_to_stream_at_once/"
    },
    {
        "id": "1oha3to",
        "author": "BoredPandaOfficial",
        "title": "Netflix’s ‘The Perfect Neighbor’ Sparks Gut-Wrenching Reactions Over Its Disturbing True Story",
        "content": "The true-crime documentary, directed by Geeta Gandbhir, dives into the slaying of Ajike “AJ” Owens, a mother of four whose passing shocked a Florida community and ignited widespread conversations about race, fear, and justice.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oha3to/netflixs_the_perfect_neighbor_sparks_gutwrenching/"
    }
]