[
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 273,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1paqc6b",
        "author": "scoreboard-app",
        "title": "Match Thread: Girona FC vs Real Madrid Live Score | LaLiga 25/26 | Nov 30, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1paqc6b)",
        "upvotes": 60,
        "comments": 4915,
        "media": null,
        "permalink": "/r/realmadrid/comments/1paqc6b/match_thread_girona_fc_vs_real_madrid_live_score/"
    },
    {
        "id": "1pbfu9r",
        "author": "Nakul03",
        "title": "Kylian Mbappé has now scored 60 goals in 2025, with five matches still to play. 🇫🇷🔥",
        "content": "",
        "upvotes": 288,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lzno0bmh3m4g1.jpeg?auto=webp&amp;s=b3c6a4649afb0206f32fa614cd25045c36b4ebf5"
        },
        "permalink": "/r/realmadrid/comments/1pbfu9r/kylian_mbappé_has_now_scored_60_goals_in_2025/"
    },
    {
        "id": "1pbek7b",
        "author": "Painting-Best",
        "title": "We have to talk about Federico Valverde...",
        "content": "Straight to the point, this guy has been a shadow of his former self. His perfomances as a middlefielder have been average at best since the cwc. There is not a single thing he contributes to the game. He doesnt create chances, doesnt control the tempo, never takes his space on runs, plays like he's scared to play offensive and the guy doesnt even shoot anymore. He used to be this extremely passionate workhorse but we dont see that nowadays either. He plays like he's tired. Keep in mind this is the captain of real madrid we're talking about here. You wouldnt ever notice that he's the captain if it werent for his armband. This sub is going crazy about Jude and Arda but in reality Fede is the one who's been severly underperforming. Camavinga 100% deserves the starting spot over him. Hope he gets back to his best...",
        "upvotes": 72,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbek7b/we_have_to_talk_about_federico_valverde/"
    },
    {
        "id": "1pb1efn",
        "author": "No-Independent2522",
        "title": "Losing my sanity over this team 😭 [OC]",
        "content": "",
        "upvotes": 550,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rvyv83dzbi4g1.jpeg?auto=webp&amp;s=a6d26c567a66fb2ac27058c64c1cd73cfd259f42"
        },
        "permalink": "/r/realmadrid/comments/1pb1efn/losing_my_sanity_over_this_team_oc/"
    },
    {
        "id": "1pbbg7o",
        "author": "Frostb1",
        "title": "Aint no way y'all doubting Bellingham",
        "content": "People gonna downvote this shit but Bellingham is so much better than arda, everywhere. We lost because we couldnt convert open chances. The blame doesnt go to Bellingham alone. Anyone who says Bellingham is the problem shouldn't watch madrid. He is alone the reason we won against barca, infact our last UCL was won cause he was there. So before y'all talk about my bubblegum like that. Use your brain.",
        "upvotes": 92,
        "comments": 91,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbbg7o/aint_no_way_yall_doubting_bellingham/"
    },
    {
        "id": "1pb8ex1",
        "author": "AffectionateGift3560",
        "title": "Guler's performance against Girona.",
        "content": "What do you think about his performance? \n\n He's playing a bit out of position, but he still played the 10 role at times. People think just because he plays in ten roles we automatically win games. and I don't think he was better than Jude.\n\nI see so many people complaining about Jude's ball hugs, but like, if he didn't, we would just end up backpassing.\n\nI think today's game but Jude and Güler were meant to play CM, but they kept gravitating to their natural position. What do you think?",
        "upvotes": 140,
        "comments": 91,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7spotmiu9k4g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb8ex1/gulers_performance_against_girona/"
    },
    {
        "id": "1pb2q7u",
        "author": "killorbekilled_",
        "title": "KP Boateng: \"Before I joined Barcelona, I said Cristiano Ronaldo is the best player and Real Madrid is the best.\" \"After I joined Barca, they forced me to say Lionel Messi is the best, otherwise you cannot play here.\" \"I LIED because I wanted to play.\" (@unscriptedtheshow youtube)",
        "content": "",
        "upvotes": 376,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/43rebdbani4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb2q7u/kp_boateng_before_i_joined_barcelona_i_said/"
    },
    {
        "id": "1pb4rny",
        "author": "Mean_Teach_6999",
        "title": "In other news... Justin seen wearing a Real Madrid Kit!",
        "content": "I know we're all upset but just saw this and wanted to share !",
        "upvotes": 271,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xvigyc4t5j4g1.png?auto=webp&amp;s=ac01b745875e92c9f9a79ba33b34d4314e23eb33"
        },
        "permalink": "/r/realmadrid/comments/1pb4rny/in_other_news_justin_seen_wearing_a_real_madrid/"
    },
    {
        "id": "1pb9xky",
        "author": "Awkward_Method1552",
        "title": "Madridistas these days",
        "content": "",
        "upvotes": 76,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qi73ytdtqk4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb9xky/madridistas_these_days/"
    },
    {
        "id": "1pay7qs",
        "author": "No-Independent2522",
        "title": "Courtois on Insta after tonights draw",
        "content": "",
        "upvotes": 534,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w8np2oyhlh4g1.jpeg?auto=webp&amp;s=d7de6c06a202aeb5bc1a23c68c0c8b7c76263638"
        },
        "permalink": "/r/realmadrid/comments/1pay7qs/courtois_on_insta_after_tonights_draw/"
    },
    {
        "id": "1pbd6ld",
        "author": "Little_Knowledge6249",
        "title": "This club situation is not Xabi’s fault",
        "content": "I will get attacked for this opinion, but even if Xabi gets sacked we will be the same with the new coach because guys, let’s be real, this squad is tactically built wrong. We don’t have a proper 8 or 6 who will make us have a good midfield that makes us win matches Our 6, who is  Tchouaméni, a 90M worth player, he is not a proper 6. many deserve this place more than him: Caicedo or Elliott Henderson or Wharton or De Jong and many more. And our 8, the English model who doesn’t want to play 8 and makes a mess because he wants to play 10 and park at the front to score tap-ins and celebrate, but to play as a proper 8 and be useful for the team ? No it won’t happen.\n And the big two stars Vini and Kylian who only want their personal benefit, not the team. The poor press they don’t even do it.\nVini , who made the disrespectful action in the classico who loses the ball a million times in every match and become a winger can’t get even agianst any Right back in 1v1 except some matches and we saw it and makes stupid decisions most of the matches this season,man even Bradley put him in his pocket \nAnd Kylian, who wants princess treatment. he won’t press like the rest of the team; he doesn’t want to tire himself every match. He just scores goals and celebrates, that’s all.\n\nXabi obviously have faults but will it be Every time the coach faults? So Carlo was first now Xabi, Every time we will do the same mistake and blame the Coach and forget about the Ridiculous players ?",
        "upvotes": 43,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbd6ld/this_club_situation_is_not_xabis_fault/"
    },
    {
        "id": "1pbg970",
        "author": "Nakul03",
        "title": "Xabi Alonso reaction to Mbappe miss vs Girona 90+4'",
        "content": "",
        "upvotes": 24,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/33kv8un86m4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbg970/xabi_alonso_reaction_to_mbappe_miss_vs_girona_904/"
    },
    {
        "id": "1pbifs9",
        "author": "o6ohunter",
        "title": "Zinedine Zidane playing some pick up. Safe to say he’s still got it",
        "content": "",
        "upvotes": 18,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/53ip59ynkm4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbifs9/zinedine_zidane_playing_some_pick_up_safe_to_say/"
    },
    {
        "id": "1pazzde",
        "author": "cyrusmancub",
        "title": "Rodrygo hasn't scored a goal in his last 30 games for Real Madrid: the longest streak without a goal by any attacker in Real Madrid history.",
        "content": "What is going on with him? ",
        "upvotes": 249,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pazzde/rodrygo_hasnt_scored_a_goal_in_his_last_30_games/"
    },
    {
        "id": "1pb9vy8",
        "author": "Spare_Engineer_5606",
        "title": "Number 10 obsession when two 8s are common in modern football",
        "content": "Why there is a number 10 obsession in this sub. Have people forgotten that there can be two 8s in a team and if you cant play as an 8 then you don't deserve to start for madrid. Last sucessful number 10 at madrid was three peat isco in a stacked madrid team where Benzema, ronaldo, isco, marcelo and carva were playing fluidly to hold the width. This ain't the three peat team. I don't understand why people think your creativity get worse if you are not a 10 on paper.you will always get the ball in right areas no matter what to show your creativity. This ain't fifa. Specially against low blocks,even a fullback can become 10",
        "upvotes": 48,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9vy8/number_10_obsession_when_two_8s_are_common_in/"
    },
    {
        "id": "1pb6z4y",
        "author": "TheSayou",
        "title": "The head-to-head record between Athletic Bilbao and Real Madrid",
        "content": "",
        "upvotes": 56,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yf5t698ctj4g1.jpeg?auto=webp&amp;s=885a63dd8f00f49338ff21f615ada012db706aad"
        },
        "permalink": "/r/realmadrid/comments/1pb6z4y/the_headtohead_record_between_athletic_bilbao_and/"
    },
    {
        "id": "1pau29m",
        "author": "No-Independent2522",
        "title": "Mbappe equalizes with a penalty 1-1 Girona",
        "content": "",
        "upvotes": 339,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t8dp4qqzpg4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pau29m/mbappe_equalizes_with_a_penalty_11_girona/"
    },
    {
        "id": "1pb028t",
        "author": "Bunchdawg",
        "title": "We haven’t look the same since he’s been out.. Franco, our little engine!",
        "content": "Real Madrid has looked noticeably worse ever since Franco Mustantouno went down injured. He was never a perfect player, but his nonstop energy, vertical runs, and aggressive work rate on the right side gave the team a crucial extra dimension. With him, opponents had to respect that flank, stretching defenses and creating space for Vini and Mbappé to exploit. Without him, the entire right wing has gone dead, letting teams overload the left and simply lock onto our two superstars. The attack becomes predictable, the buildup stalls, and Madrid loses the balance and unpredictability that Franco’s presence naturally provided.",
        "upvotes": 150,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d1rga60o0i4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb028t/we_havent_look_the_same_since_hes_been_out_franco/"
    },
    {
        "id": "1pb5xho",
        "author": "Critical-Remove-1878",
        "title": "Our midfield is too unbalanced and lacks technical ability",
        "content": "I've said something similar after the Olympiacos win and every single game the problem becomes more and more evident. We have too many midfielders with the exact same similar weaknesses: creativity from the back, passing and technical ability in general. We have too many \"physical\" midfielders, who aren't that amazing with the ball on their feet.\n\nThe weirdest part is that this team has been so used on playing with the best technical midfielders in the world: Kroos, Modric, Isco and before them, Ozil and Xabi himself. Nowadays apart from Arda, who's also struggling when sharing the pitch with Bellingham and he's getting pushed wider, none of our other (starting) midfielders can distribute the ball well, especially from the back. \n\nAgainst both Olympiacos and Girona we saw the same thing. Tchouameni receives the ball from the defenders, takes 5 touches and... 3 business days to do anything and once he's tighty marked, he does a simple sidepass that leads to more sidepasses, nothing or losing possession. Jude and Fede are nowhere to be found on these situations, so nobody can really collect the ball deep and start an attacking sequence. In the past, Casemiro also wasn't the best ball playing guy ever, but he was surrounded by two of the best passers ever. Now, nobody has these abilities. Camavinga was decent on both halves he played in the recent week defensively, although with the ball on his feet he has the exact same problems.\n\nWe basically need desperately a deep lying playmaker. Can Nico Paz play that role effectively? I'm not sure. Is there anyone else available on the market who is on RM level and won't cost a fortune? Again, not really sure. But until we get someone, even an inconsistent Ceballos might be very useful into balancing out this team. We also have to look into the Fede situation. The guy hasn't had a good performance in a while now.",
        "upvotes": 51,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb5xho/our_midfield_is_too_unbalanced_and_lacks/"
    },
    {
        "id": "1pbaw11",
        "author": "Relevant-Lock8646",
        "title": "Why were we so good at the start of the season?",
        "content": "What has changed in the formation? I know a few injured players came back. Who exactly? And why does Xabi not see what is causing such a big change in how we play now? \n\nOur play style was good at the beginning. But now try to scrape points from teams at the bottom of the laliga table.\n\nWhat are your opinions?\n\n",
        "upvotes": 13,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbaw11/why_were_we_so_good_at_the_start_of_the_season/"
    },
    {
        "id": "1pbg89y",
        "author": "issHR",
        "title": "I just custom made these cards for my personal collection (1900s to present)",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbg89y/i_just_custom_made_these_cards_for_my_personal/"
    },
    {
        "id": "1pazbvb",
        "author": "More-Judgment-9253",
        "title": "This goal we conceded is almost identical to the second goal we conceded against Elche.",
        "content": "Just look at this, ounahi is completely unmarked. Why are arda and fede just watching him??",
        "upvotes": 86,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pof1s5peuh4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pazbvb/this_goal_we_conceded_is_almost_identical_to_the/"
    },
    {
        "id": "1pb8qcw",
        "author": "nijeime1720",
        "title": "After watching yesterday's game it's clear that something's wrong and we can't keep it calm.",
        "content": "I don't really know who to blame here. \n\nWe can't defend, we can't score, we can't compete with other top teams. Currently we are playing like some mid-table team, which is crazy for club like this. \n\nIt really looks that Xabi wants to make an impact and to help but that is not happening. Are the players angry, are they unmotivated? Looks like ego is the big part of some players who think they are untouchable and that they should play no matter how good or bad they are. Every player should learn that he is not bigger than coach or a club. Also, do these players ever watch their games and how they play? Looks like after every game they are like 'it is not what we wanted but we need to stay strong and keep going'  and that's it, somebody clicks restart button and they forget everything tomorrow morning. I see Valverde unmotivated on the pitch second game in a row, and can't understand what happened. Now you will see, next game against Athletic everything will be repeated as it was yesterday. \n\nWe need to go on a market not afraid to spend money. In previous years it looked like we don't have any money cause we always wanted someone free or cheap not willing to make a move for someone big and good. Don't get me wrong, player don't have to be famous, just to be good. \n\nAt the end I want to repeat what someone wrote, we sacked Ancelotti for the same thing that is happening to us now. Problem is much more deeper than we thought. \n",
        "upvotes": 11,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb8qcw/after_watching_yesterdays_game_its_clear_that/"
    },
    {
        "id": "1pb82gm",
        "author": "Different_Craft5237",
        "title": "Are the tactics modern enough yet ?",
        "content": "I can't do nothing else but laugh at our current situation, cause Perez despite being the most successful club president of the modern era sure is stubborn as fuck and loves to repeat the same mistake over and over.\n\nNow i understand, no one is above the club, bla bla, but ffs how can we be so dense when it comes to committing to managers who actually put food on our table. That's twice in the last 10 years we fall into the same bullshit predicament, all because was thinking about his marketing projects over proper team building.\n\n2014 we get a manager who wins us our first CL since 2002, the elusive Decima, because he goes the next season, things go sideways, we sack him. Bring another wannabe tactician, who could not last 6 months. Then Zidane took the reigns, the rest is history. Not 1, not 2, but 3 CLs back-fucking-back. No team has ever defended the title in the modern CL format and Zidane managed to 3 peat. Instead of giving the man a blank cheque and help him build a dynasty with a already winning team, we let him go because Perez always wants to be man in charge. \n\nThe we bring another wanna boring tactician, he gets sacked in 6 months as well, and where come Zidane 2.0 to save Perez' ass again. 2 seasons later, instead of reinforcing the team for him, we send media hit pieces to shit on him all year to the point of him quitting. Then there comes Carlo, again out of love for the club, and lord and behold he wins the CL+League the same year. Does it again two seasons later. Here comes yet another opportunity where we have a serial winner of a manager, we could just build a damn project around his already winning team and the players willing to dies for the him. But no, we leave him out to dry, no defensive reinforcements, or any at all then he gets all the blame in the end.\n\nNow the cycle repeats, we bring yet another wannabe tactician with zero pedigree who already seem to have lost the locker room. Except, this time, neither Zidane nor Carlo will come save Perez' ass. \n\nAll we needed to do after the 23/24 season, is ask Ancelotti what he needed to keep the team winning, he probably would've asked for a true #9, 3-4 defenders and a Kroos-type player. But Perez, marketing first, Mbappe it is even if he was not needed. And then Alonso cause he's the hot new toy. \n\nWe fucking did this to ourselves. All i was hearing last season was how Xabi would revolutionize this team, how the academy players would get chances, how we would play tactical pressing football under modern ideas ... I guess subbing out Trent for Gonzalo is part of those modern ideas.",
        "upvotes": 13,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb82gm/are_the_tactics_modern_enough_yet/"
    },
    {
        "id": "1pazs5r",
        "author": "Salaraaa",
        "title": "The Last Time We Tied 3 Games In A Row Was Back In 2009...",
        "content": "( La Liga Only ) This really says a lot. The problem is that I don't even know who to put at fault here or who to blame because I feel like the entire system is down right now. All we can do is hope and pray for better days to come. Again getting too emotional and harsh on our own players and club wouldn't be doing anyone any favors. Let's stay calm positive and just support our club like we do. Our job is not to look for solutions or to make the club do exactly what we want. \nTrust The Process ",
        "upvotes": 41,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pazs5r/the_last_time_we_tied_3_games_in_a_row_was_back/"
    },
    {
        "id": "1pautex",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Girona vs Real Madrid, match 14",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pautex)",
        "upvotes": 70,
        "comments": 1021,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pautex/postmatch_thread_girona_vs_real_madrid_match_14/"
    },
    {
        "id": "1pat8c3",
        "author": "Heavy-Sympathy5330",
        "title": "Why Do Managers of Barça &amp; Real Madrid Always Look So Worn Out?",
        "content": "A Barça fan coming in peace asking a question for Madrid fans\n\nI was watching the last match vs Alavés and noticed something about Flick. Even after winning, he looked kind of sad or distant on the bench. I’ve also seen similar moments with Xabi Alonso rarely smiling, always looking tense.\n\nMaybe I’m overthinking it, but it really made me realise how insanely difficult it must be to manage clubs like Real Madrid and Barcelona. The pressure is constant. Even Pep left Barça after so much success, and Zidane walked away after the three-peat. There are many other examples too.\n\nSo my question to Madrid fans:\nDo you also feel that managing these clubs drains coaches emotionally, even when the results are good?\nWould love to hear your thoughts.",
        "upvotes": 64,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pat8c3/why_do_managers_of_barça_real_madrid_always_look/"
    },
    {
        "id": "1pb3xc5",
        "author": "BeneficialWasabi8559",
        "title": "Our pressing is the reason for draw",
        "content": "I think we press nicely in home games but not in away game , vini mbappe looks like they are fake pressing and even if they do our left backs doesn't join them, yesterday our midfield was walking behind when girona scored goal , we need a pressing structure, in season start we did great cause we pressed nicely ",
        "upvotes": 15,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb3xc5/our_pressing_is_the_reason_for_draw/"
    },
    {
        "id": "1papssr",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Girona",
        "content": "",
        "upvotes": 79,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1papssr/our_starting_𝗫𝗜_girona/"
    }
]