[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n3uh8u",
        "author": "Banzay_87",
        "title": "On January 6, 1898, the first official friendly football match was held in Italy, in which the football section of the Genoa Athletic and Cricket Club (now Genoa) and FC Torinese (now Torino) took part; the match ended with a score of 0:1 in favor of the latter.",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ejxy37v0o3mf1.jpeg?auto=webp&amp;s=00969454c70218f7f240b38e1385d5f26d9b6d69"
        },
        "permalink": "/r/torino/comments/1n3uh8u/on_january_6_1898_the_first_official_friendly/"
    },
    {
        "id": "1n3wdy1",
        "author": "Weird-Dragonfly-1938",
        "title": "Ciao a tutti! Dove posso trovare filo per amigurumi/uncinetto ad un buon prezzo? E quale marca italiana è buona? Grazie mille",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n3wdy1/ciao_a_tutti_dove_posso_trovare_filo_per/"
    },
    {
        "id": "1n3wdwj",
        "author": "Ok-Stable1562",
        "title": "Liceo linguistico",
        "content": "Yo Ciao tutti, qualcuno sa se ci sono a torino dei licei linguistici serale? Voglio fare meno di 5 anni , a massimo 3 anni. Se avete qualche info sarei felice",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n3wdwj/liceo_linguistico/"
    },
    {
        "id": "1n3bi2p",
        "author": "lospavaldo",
        "title": "cerco un amic*",
        "content": "siamo 3 ragazzi che ci piace trekking in montagna ,fare cicloturismo ,fare arrampicata attivate sportive e riusciamo a trovare tempo anche nella parte nerd esempio guardare film e giocare a giochi da tavoli",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1n3bi2p/cerco_un_amic/"
    },
    {
        "id": "1n342w4",
        "author": "Character-Dance7919",
        "title": "Libri su Torino sulfurea",
        "content": "Ciao, sto approfondendo il tema di Torino come città sulfurea, diabolica e metafisica. \n\nTra i titoli emersi, ***Minuetto all’inferno*** di Elémire Zolla, ***L'ultima notte*** di Furio Jesi, ***La coda della cometa*** di Italo Cremona, ***La notte dell'arciduca*** di Oddone Camerana,  ***Domingo il favoloso*** di Giovanni Arpino e infine ***Le venti giornate di Torino*** di Giorgio De Maria.\n\nA qualcuno sovvengono altro titoli? Grazie.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n342w4/libri_su_torino_sulfurea/"
    },
    {
        "id": "1n3faat",
        "author": "barelyheard",
        "title": "Permesso di soggiorno delay",
        "content": "hey guys, anyone waiting for their student permesso for more than 3 months? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n3faat/permesso_di_soggiorno_delay/"
    },
    {
        "id": "1n3d3mm",
        "author": "MonPorridge",
        "title": "manicure/pedicure uomo Torino?",
        "content": "Come da titolo, c'è qualcuno che va a farsi piedi/mani dall'estetista? Consigliate dei centri in particolare?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n3d3mm/manicurepedicure_uomo_torino/"
    },
    {
        "id": "1n3aslj",
        "author": "Academic-Method-4676",
        "title": "Tempo di elezioni",
        "content": "Abito a Torino da 3 anni e in questo periodo ho visto chiudere due parchi con la promessa di una futura manutenzione (mai avvenuta), buche per strada rattoppate alla bell'e meglio dopo mesi, strade chiuse e il leggendario sottopasso del lingotto. Oggi, magicamente, hanno iniziato a fare dei lavori stradali sotto casa e in giro vedo cantieri e lavori in corso a perdita d'occhio. Il sindaco è in carica dal 2021, quindi ci sta farsi belli per l'anno prossimo\n\nP.s. dai, che con un po' di fortuna riescono a finire pure la metro 1, la 2 serve cristo in terra purtroppo \n\nCiao ",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1n3aslj/tempo_di_elezioni/"
    },
    {
        "id": "1n31n1r",
        "author": "LobsterWise4428",
        "title": "IED TURIN students",
        "content": "Heyo, im enrolled into bachelors in transportation design at IED torino, Im from India and Im tryna make some connections and get acquainted with other students before the start of my course in mid october , if you're interested join the WhatsApp group - Follow this link to join my WhatsApp group: https://chat.whatsapp.com/EJMXRYSCMXCBIwWyu6q8da?mode=ems_share_t",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n31n1r/ied_turin_students/"
    },
    {
        "id": "1n37mp4",
        "author": "norman_petrikov",
        "title": "Ci sono realtà che si occupano di cerchi di parola?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n37mp4/ci_sono_realtà_che_si_occupano_di_cerchi_di_parola/"
    },
    {
        "id": "1n37cvi",
        "author": "jugoss",
        "title": "Calistenichs",
        "content": "Ciao a tutt*\nSono a torino da ormai 3 anni e mi sono interessato ora all'argomento. \nPosso raggiungere in bici il parco del valentino dove c'è dell'attrezzatura per il corpo libero e qui sorge la mia domanda:\nQualcuno conosce magari gruppi in cui insieme ci si allena per fare calistenichs o magari a qualcuno farebbe piacere allenarsi con 1/2 persone per quanto riguarda cali?\nSono inesperto ma ho praticato per tanto tempo allenamenti a corpo libero dovrei solo riprendere l'allenamento \nGrazie mille per l'attenzione!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n37cvi/calistenichs/"
    },
    {
        "id": "1n28511",
        "author": "Ok_Gold_2107",
        "title": "Chi è il genio che pensa di far del bene lasciando della spesa gratis d'agosto per il marciapiede?",
        "content": "Sulla spesa c'è scritto \"cibo gratis\" o qualcosa del genere non si legge bene perchè ha piovuto.\n\nora, normalmente non ho mai preso nulla perchè non ne ho bisogno ma non ho capito proprio ne la spesa ne la tipologia.\n\nProblemi di questa spesa:\n\n1- Metà delle cose devono essere conservate in frigo è li da 1 giorno quindi la probabilità che vada male è altissima\n\n2- Ci sono anche degli avocado, sono costosissimi gli avocado poteva prendere delle mele\n\n3- A chi è rivolta??? perchè non può portarsela a casa o evitare di comprarla?\n\n  \nRispondo a domande che vi verranno in mente:\n\nSono scaduti? No, la scadenza è fra 7 giorni.",
        "upvotes": 64,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jx5mkwe1hqlf1.jpeg?auto=webp&amp;s=f67f57948ba9ade09017725b7ec4757aa9e849ec"
        },
        "permalink": "/r/torino/comments/1n28511/chi_è_il_genio_che_pensa_di_far_del_bene/"
    },
    {
        "id": "1n29euu",
        "author": "sofritto_per_te",
        "title": "Is Turin really getting worse?",
        "content": "Hi!\n\nI'm considering moving to Turin, after visiting a few times and after reading a lot of positive recommendations all over the Internet. That is, all over the Internet except this sub. You’d think locals here would have the best insight, but so many posts focus on the city’s “degradation”, making me a bit sceptical about the project. But I wonder if that scepticism really is warranted, or if it has more to do with the state of world than Turin specifically.\n\nSo I’d love your honest take: is Turin a bad place to live, or is it just going through the same challenges as everywhere else? Are there other (large-ish) cities where you actually see optimism, opportunities, or better quality of life?\n\nI’m Norwegian, in Oslo right now, working remotely (“smart working,” as I’ve learned you for some reason call it), and I’m mainly motivated by the idea of a better quality of life at a more reasonable cost.",
        "upvotes": 47,
        "comments": 99,
        "media": null,
        "permalink": "/r/torino/comments/1n29euu/is_turin_really_getting_worse/"
    },
    {
        "id": "1n2hab4",
        "author": "yotama9",
        "title": "è habituale comprare degli libri scolastichi usati?",
        "content": "Ciao tutti, \n\nSono nuovo nella cità, e in Italia. I miei regazzi hanno ricevuto la lista degli libri per la scuola (della scuola vittoria). Pensavo forse posso trovare i libri second-hand? È possibile qua? Conosci forse dove posso ne trovare?",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1n2hab4/è_habituale_comprare_degli_libri_scolastichi_usati/"
    },
    {
        "id": "1n2n4kj",
        "author": "Flosa_Smusi",
        "title": "Fotografo eventi e concerti",
        "content": "Ciao a tutt\\*, sono un ragazzo di 23 anni che vive da qualche mese a Torino, ho una laurea in design della comunicazione visiva, ma purtroppo non riesco a trovare lavoro come grafico. Pensavo quindi di provare a tirare su qualcosa dalla fotografia, che è uno dei miei hobby. \n\nMi piacerebbe molto fare shooting durante concerti o eventi anche underground, ma non avendo contatti e avendolo sempre fatto solo per passatempo non saprei davvero da dove iniziare. Ho provato a chiedere in qualche locale in cui fanno musica live se avessero bisogno di un fotografo, ma con scarsi risultati.\n\nPensavo che potrebbe essere utile entrare a far parte di qualche collettivo (?)\n\nSe qualcuno conoscesse qualche locale che ha bisogno di fotografi o ha consigli utili gliene sarei grato. Se siete interessati posso passare il mio portfolio in privato 🙏🏻.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n2n4kj/fotografo_eventi_e_concerti/"
    },
    {
        "id": "1n2g1zq",
        "author": "in_flames_666",
        "title": "Cosa rende speciale Torino?",
        "content": "Qual è la cosa che vi piace di più di questa città? E quella che vi piace di meno e cambiereste? Cosa rende speciale Torino rispetto alle altre città? ",
        "upvotes": 8,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1n2g1zq/cosa_rende_speciale_torino/"
    },
    {
        "id": "1n2ie35",
        "author": "Glass-Present-6916",
        "title": "Cosa fare e vedere a Torino e dintorni (3 giorni)",
        "content": "Salve, io e amici saremo a Torino dal 7 sera al 10.\nSiccome ci sono stato anni fa per un po' di ore e ho visto veramente poco, cosa ci consigliate di fare e vedere?\nAffitteremo una macchina.\nGrazie a tutti in anticipo!",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n2ie35/cosa_fare_e_vedere_a_torino_e_dintorni_3_giorni/"
    },
    {
        "id": "1n2p6rs",
        "author": "martajestuparta",
        "title": "Chi ha un abbonamento a Torino Today?",
        "content": "[https://www.torinotoday.it/dossier/ambiente/smog-estate-zone-piu-inquinate-Torino.html](https://www.torinotoday.it/dossier/ambiente/smog-estate-zone-piu-inquinate-Torino.html)\n\nSono curiosa quali sono i posti migliori &amp; peggiori a Torino per l'inquinamento.",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C7dXtInVD68Ppqzfe25IaoRskyhfOP4JzE49brd2B2M.jpeg?auto=webp&amp;s=f62457d3c19e5b663d0161edcc8134fb5391756c"
        },
        "permalink": "/r/torino/comments/1n2p6rs/chi_ha_un_abbonamento_a_torino_today/"
    },
    {
        "id": "1n2np7q",
        "author": "potatoboi_393",
        "title": "Check apartment",
        "content": "My friend and I have found an appartment in Torino and we’re wondering if anyone could go and inspect it for us. Just to take a video and check it’s not a scam as we are currently overseas. Happy to pay €30",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n2np7q/check_apartment/"
    },
    {
        "id": "1n2azva",
        "author": "Guilty_Condition_300",
        "title": "Corso d'Inglese a Torino",
        "content": "Buongiorno a tutti,\n\nmi piacerebbe frequentare un corso di Inglese a Torino che permetta anche di fare serate di conversazione nella lingua. So' che ci sono molti centri, ma non avendone mai provato uno mi servirebbe un consiglio su quali reputate tra i migliori.\n\nSapreste, per cortesia, aiutarmi? Sarebbe molto utile per il mio lavoro.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n2azva/corso_dinglese_a_torino/"
    },
    {
        "id": "1n281go",
        "author": "Lucky-Supermarket106",
        "title": "Cerco testimonianze: studenti fuorisede e il problema delle referenze negli affitti a Torino",
        "content": "Ciao a tutti!  \nSto lavorando a un articolo sulla ricerca di alloggio per studenti fuorisede a Torino.\n\nIn particolare mi interessa capire **come le richieste di referenze o di un garante (spesso con contratto a tempo indeterminato)** stiano influenzando la possibilità per gli studenti di trovare una stanza o un appartamento.\n\nSe sei uno studente e stai vivendo questa situazione — o se hai dovuto rinunciare a un affitto perché non potevi fornire le garanzie richieste — mi piacerebbe raccogliere la tua esperienza (anche in forma anonima, naturalmente).\n\nScrivimi pure in privato: bastano pochi minuti di chiacchierata.\n\nGrazie a chi vorrà condividere la sua storia 🙏",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n281go/cerco_testimonianze_studenti_fuorisede_e_il/"
    },
    {
        "id": "1n1thms",
        "author": "carmelolg",
        "title": "Affittare una sala per feste di compleanno a Torino Nord o Nord-Est",
        "content": "Ciao a tutti,\n\nqualcuno conosce dei posti dove affittano sale abbastanza grandi per poter fare una festa di compleanno?\n\n__Range orario__: 15h00 / 20h00\n\n__Tipologia__: festa per bambini\n\n__Numero di persone__: 40-50\n\n__Zona__: Vanchiglia, Vanchiglietta, Regio Parco, Aurora\n\n\nValuto anche bocciofile o affini che affittano gli spazi senza l’obbligo della consumazione nel ristorante locale.\n\nVi ringrazio molto.\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n1thms/affittare_una_sala_per_feste_di_compleanno_a/"
    },
    {
        "id": "1n1rfd4",
        "author": "One-Detective-4646",
        "title": "Parcheggi Parkito Torino?",
        "content": "Ciao a tutti! Sto cercando posti dove lasciare la macchina a Torino in zona Vanchiglia/Vanchiglietta e ho notato la presenza di molti parcheggi privati gestiti da Parkito. Cercando su internet non si trova molto al di fuori dei risultati relativi al loro sito/app, ma mi sembra di capire che si tratti di parcheggi di privati all’interno di condomini, messi in affitto singolarmente. Qualcuno ha già utilizzato questo tipo di servizio e sa dirmi se è affidabile? Non trovando recensioni e non avendone mai sentito parlare prima sono un po’ diffidente.\nGrazie a chi mi aiuterà! 🤗",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n1rfd4/parcheggi_parkito_torino/"
    },
    {
        "id": "1n1cgf2",
        "author": "glorious-ahole",
        "title": "Learning italian",
        "content": "I've recently shifted to Turin and I want to learn italian. I've heard that some communes teach italian which are free. If anyone knows, can you please let me know where are they offered and how can I enrol",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n1cgf2/learning_italian/"
    },
    {
        "id": "1n1hkg3",
        "author": "Ok_Temperature_6649",
        "title": "i need help with my Til- A scoring",
        "content": "hello! im an EU student and i took the architecture exam at PoliTo and i got 50,50 and the results still have to be published and im really anxious since they postponed it again, does anyone happen to know someone who got into architecture in PoliTo last year and what was their score? or if my score is enough to make it in PoliTo? \n\n\nCiao! Ho fatto il test di ammissione ad Architettura al PoliTo e ho ottenuto 50,50. I risultati devono ancora essere pubblicati e sono davvero in ansia, visto che li hanno rimandati di nuovo. Qualcuno per caso conosce qualcuno che l’anno scorso è entrato ad Architettura al PoliTo e con che punteggio? Oppure se il mio punteggio è sufficiente per entrare al PoliTo?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n1hkg3/i_need_help_with_my_til_a_scoring/"
    },
    {
        "id": "1n1g78v",
        "author": "nicco_lo",
        "title": "Zona Corso Rosselli all'incrocio con Corso Re Umberto",
        "content": "Ciao a tutti, sapete dirmi com'è vivere nella zona di corso rosselli/corso re umberto? È una zona tranquilla? Grazie mille.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n1g78v/zona_corso_rosselli_allincrocio_con_corso_re/"
    },
    {
        "id": "1n1aue8",
        "author": "Ancient_Tourist_4268",
        "title": "Fantacalcio",
        "content": "Ciao a tutti, vorrei fare un fantacalcio.\nFaremo l’asta alla fine del mercato , chi ha piacere di partecipare mi scriva.\nSiamo una lega a 10 partecipanti.\nCosto di iscrizione: 10€ \n\nMontepremi \n1⭐️ 50€ \n2🥈30€\n3🥉20€ \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n1aue8/fantacalcio/"
    },
    {
        "id": "1n12uol",
        "author": "papa_commie",
        "title": "Come funzionano le scuole serali a Torino?",
        "content": "Faccio la terza liceo e probabilmente domani all'esame del debito verrò bocciato e sono stanco del liceo perchè lo vedo come una perdita di tempo considerando quanto effettivamente vale il diploma del linguistico, però voglio comunque andare all'università. In caso di bocciatura volevo quindi vedere di andare ad una scuola serale sia per poter magari lavorare di giorno e costruirmi un minimo di curriculum sia per poter anche magari riuscire a condensare due anni in uno. Sono completamente estraneo a qualunque cosa riguardi le scuole serali pls help😭🙏",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1n12uol/come_funzionano_le_scuole_serali_a_torino/"
    },
    {
        "id": "1n0hqej",
        "author": "yotama9",
        "title": "D&amp;D, in Inglese, a Torino?",
        "content": "Hi all, \n\nSeeing that post of someone looking for a group in Torino, I thought I should post myself as well. Meaning, I'm looking for a group too. \n\nI've been playing for most of my life (I'm M45 BTW). I speak Italian, but no well enough (yet) to play, sadly. I can DM (though I prefer doing so in Dungeon World) or play in pretty much any system that you prefer. \n\nThe problem, though, is that I don't live in Torino, but outside of it. Which means I need to finish playing by, say, 21.30 so I can make it to the bus. \n\nAnyone up for a game?",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1n0hqej/dd_in_inglese_a_torino/"
    },
    {
        "id": "1n0irjq",
        "author": "CDive20",
        "title": "Supermercati più economici a Torino?",
        "content": "Ciao a tutti!\nSto cercando di capire quali siano i supermercati o discount più convenienti a Torino. \nQualcuno di voi ha esperienze dirette o consigli pratici? Ad esempio su dove conviene davvero fare la spesa settimanale, o se ci sono mercati di quartiere particolarmente economici (tipo Porta Palazzo)?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n0irjq/supermercati_più_economici_a_torino/"
    }
]