[
    {
        "id": "1hzx3ha",
        "author": "ThickWorldliness6895",
        "title": "[Post-Match Thread] Real Madrid vs Barcelona | Supercopa De España | Final",
        "content": "",
        "upvotes": 271,
        "comments": 1039,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g936evp6pmce1.jpeg?auto=webp&amp;s=a1468577af8ab4ea3a17ea9285a347d2a9abd619"
        },
        "permalink": "/r/realmadrid/comments/1hzx3ha/postmatch_thread_real_madrid_vs_barcelona/"
    },
    {
        "id": "1huwj4b",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 25,
        "comments": 2929,
        "media": null,
        "permalink": "/r/realmadrid/comments/1huwj4b/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1hzx57e",
        "author": "Disastrous-Basket-71",
        "title": "This was the worst performance in the last 5 years",
        "content": "",
        "upvotes": 1464,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ihn5uknjpmce1.png?auto=webp&amp;s=78a629a79c0cd78a2a945680812a2ce90ed6f455"
        },
        "permalink": "/r/realmadrid/comments/1hzx57e/this_was_the_worst_performance_in_the_last_5_years/"
    },
    {
        "id": "1hzvfqz",
        "author": "VasileFlo",
        "title": "This is so sad......",
        "content": "Why are we losing like this again?",
        "upvotes": 1264,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ay55eybmcmce1.jpeg?auto=webp&amp;s=2c7a18caecd9ab92f9e6c58e7c02531ae007983e"
        },
        "permalink": "/r/realmadrid/comments/1hzvfqz/this_is_so_sad/"
    },
    {
        "id": "1hzu504",
        "author": "ThickWorldliness6895",
        "title": "KYLIAN MBAPPE OPENS THE SCORE",
        "content": "",
        "upvotes": 1040,
        "comments": 130,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g2aijr5y2mce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hzu504/kylian_mbappe_opens_the_score/"
    },
    {
        "id": "1hzxcg4",
        "author": "ktth01",
        "title": "Tonight, Mbappe showed up...on his own!!",
        "content": "Can we all appreciate Mbappe? He's probably the only player playing passionately for Madrid in El Clasico tonight. The only player who actually kept trying to do something while everyone else looked like they were young highschool boys ready for bed. Very unfortunate considering that he is finally NEARLY back to his old self and could have potentially scored more goals, yet no one was there to back him up! This was supposed to be a huge game. How in the hell did we not have a proper plan?? \n\nMidfield and especially our NON-EXISTENT defense line in shambles! Embarrassing.\n\nAncelotti is very stubborn keeping his favourite boys in Starting XI and refusing to sub when we have a very talented stacked bench players waiting the whole game. He should be shown the door and take Lucas, Tchou and Mendy out with him. Useless coach.\n\n\n\n",
        "upvotes": 406,
        "comments": 100,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzxcg4/tonight_mbappe_showed_upon_his_own/"
    },
    {
        "id": "1hzv5f5",
        "author": "Ok_Inspector_7",
        "title": "Vasquez cannot play RB for us every again",
        "content": "Might be early for this but: \n\nI honestly cannot take any more of this. He is abysmal in defence. Everyone's going to exploit him. Can't believe it's 12 days into transfer window and we haven't even thought of a loan for a a natural RB and CB\n\nI get waiting for Trent but if that isn't looking likely then pull the trigger elsewhere before we throwaway more. Even then I don't rate trents defence after his shit show against Tottenham but he would be a massive improvement this season.....",
        "upvotes": 505,
        "comments": 204,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzv5f5/vasquez_cannot_play_rb_for_us_every_again/"
    },
    {
        "id": "1hzw32h",
        "author": "ThickWorldliness6895",
        "title": "Rodrygo scores the Free-kick ",
        "content": "",
        "upvotes": 421,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/abmw6x3ihmce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1hzw32h/rodrygo_scores_the_freekick/"
    },
    {
        "id": "1hzwysk",
        "author": "Damned_chicken",
        "title": "Its over, I can rest now.*fading away from the world*",
        "content": "",
        "upvotes": 369,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x7gjp683omce1.jpeg?auto=webp&amp;s=1f0039a1b657ab1c59497847a380ed4aaa75cc5c"
        },
        "permalink": "/r/realmadrid/comments/1hzwysk/its_over_i_can_rest_nowfading_away_from_the_world/"
    },
    {
        "id": "1hzwq4z",
        "author": "Low_Gap8692",
        "title": "The cycle continues 💔",
        "content": "",
        "upvotes": 352,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r4b5sh6fmmce1.jpeg?auto=webp&amp;s=4570ca787c0a0f5b5c7e72c78361b5e04500d0fb"
        },
        "permalink": "/r/realmadrid/comments/1hzwq4z/the_cycle_continues/"
    },
    {
        "id": "1hzwxsv",
        "author": "IcyWash",
        "title": "No debate, Asencio should always start the games.",
        "content": "Literally what more do you want me to say. Comes on, defends exceptionally well, no more goals conceded. It's mind-boggling he didn't start. Disgraceful to be honest. If we get another manager after this, the season is pretty much over unless it's Zidane which is likely not gonna be the case. All we had to do was sign someone, just a right back. Never needed to play Tchou at defense when we had Asencio. Infuriating man honestly",
        "upvotes": 251,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzwxsv/no_debate_asencio_should_always_start_the_games/"
    },
    {
        "id": "1hzyp5n",
        "author": "94Temimi",
        "title": "This is the result of 4 months of \"we need to improve our defending\" according to our *manager*",
        "content": "",
        "upvotes": 186,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d2na7dlw0nce1.jpeg?auto=webp&amp;s=94cadf93a210c34fb48decea1f62c7aa14fc80f7"
        },
        "permalink": "/r/realmadrid/comments/1hzyp5n/this_is_the_result_of_4_months_of_we_need_to/"
    },
    {
        "id": "1hztf8c",
        "author": "ThickWorldliness6895",
        "title": "[Match Thread] Real Madrid vs Barcelona | Supercopa De España | Final",
        "content": "",
        "upvotes": 349,
        "comments": 8448,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hztf8c/match_thread_real_madrid_vs_barcelona_supercopa/"
    },
    {
        "id": "1hzviyh",
        "author": "minivatreni",
        "title": "Halftime statistics Real Madrid vs. Barcelona ",
        "content": "",
        "upvotes": 166,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4pwp6b69dmce1.jpeg?auto=webp&amp;s=6a4a1c19b3c8f8b520b20d70841b2bebd437d9b1"
        },
        "permalink": "/r/realmadrid/comments/1hzviyh/halftime_statistics_real_madrid_vs_barcelona/"
    },
    {
        "id": "1hzxtt8",
        "author": "ToneEven7327",
        "title": "ancelotti has way too much respect for lucas vázquez ",
        "content": "\none of the worse performances ever, tchoumeni had a shit game too but this dude was so lost , raphina was having nothing but fun on that side . he never had raphina once on lock or even bothered . we need a right back asap and idk why ancelotti realized he was bad till the 5-1 poor decision from him . he can’t be starting anymore . even on the attacks raphina was just walking over him",
        "upvotes": 107,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzxtt8/ancelotti_has_way_too_much_respect_for_lucas/"
    },
    {
        "id": "1hzy7x5",
        "author": "beautifulbibliomind",
        "title": "Don't forget. Hala Madrid.",
        "content": "La camiseta del\n\nReal Madrid es blanca.\n\nSe puede manchar de barro, \n\nsudor y hasta sangre, pero jamas de vergüenza.\n\n\nThe Real Madrid shirt is white.\nYou can cover it in mud, sweat or blood, \n\nbut never shame\n\n\n-Santiago Bernabeu\n\nWe'll come back stronger 🤍\n\nPs: I feel bad for Mbappé, the one time he delivered a masterclass...",
        "upvotes": 97,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hhxmz0tuxmce1.jpeg?auto=webp&amp;s=46af5586e3ce3b3db0fb2ed6a2921275b86e3dbe"
        },
        "permalink": "/r/realmadrid/comments/1hzy7x5/dont_forget_hala_madrid/"
    },
    {
        "id": "1hzyhm5",
        "author": "Total_Escape_9778",
        "title": "Mbappe was probably the only positive in this game...",
        "content": "Before ya'll start getting mad at me, I just feel that mbappe has the potential to be as clutch as ronaldo if his keeps on going on the upwards trajectory he in on the past few months.\n\n3-4 months ago, he was the most shit player on the pitch. Today he was the best! He has had 20 ucl knockout goals in 30 games (6th highest overall and the most at his age) and 8 wc knockout goals in 8 games (Highest wc knockout goals tied with the legendary r9) with 4 coming in the finals. \n\nIt was around this age, when ronaldo started to explode in champions league scoring goals for fun and lots of them in the knockout stages. Can mbappe do the same for us? I mean he has scored 3 goals in 3 finals for us already. He has had his lows for us but to be fair it was a new league and team for his and he clearly needed time adjusting.",
        "upvotes": 79,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzyhm5/mbappe_was_probably_the_only_positive_in_this_game/"
    },
    {
        "id": "1i01qce",
        "author": "dark4403",
        "title": "\"Eventually, we have to lose a final, right?\" – Florentino Pérez to Modric",
        "content": "",
        "upvotes": 42,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/veuyqs6rqnce1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1i01qce/eventually_we_have_to_lose_a_final_right/"
    },
    {
        "id": "1hzqibf",
        "author": "evilskull1111",
        "title": "Our starting XI against Barcelona",
        "content": "",
        "upvotes": 175,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LdRdx5uDNsy6PFDLetlkikzwT2ItNxUVr0kL-ibL4JY.jpg?auto=webp&amp;s=ef25e0ac0f001f56294aa3e0d4d324d551909bc1"
        },
        "permalink": "/r/realmadrid/comments/1hzqibf/our_starting_xi_against_barcelona/"
    },
    {
        "id": "1hzyar1",
        "author": "bsoliman2005",
        "title": "This should be Carlo's last season",
        "content": "Don't care what the diehard fanboys say, his luck has run out and his cycle is coming to an end. He consistently sticks to his favorite starting players, lacks any tactical prowess and repeats the same mistakes every single time. Only reason we are still in contention is because our squad is better than 94% of the other European squads. \n\nI really hope the Xabi agreement is true, I really think he can take this team to the next level. Best of all he will rotate, bring new ideas/formations, and player instructions. ",
        "upvotes": 60,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzyar1/this_should_be_carlos_last_season/"
    },
    {
        "id": "1i0168y",
        "author": "beautifulbibliomind",
        "title": "Through Thick and Thin ⚪️",
        "content": "",
        "upvotes": 27,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oggod5xwlnce1.jpeg?auto=webp&amp;s=7da7a327f4aac99e3f62b3958f02f7b3c03f90e9"
        },
        "permalink": "/r/realmadrid/comments/1i0168y/through_thick_and_thin/"
    },
    {
        "id": "1hzyri9",
        "author": "Soccer_Vader",
        "title": "Ancelotti Slams Real Madrid For ‘Not Playing Soccer’ After FC Barcelona Super Cup Final Thrashing",
        "content": "",
        "upvotes": 36,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5rtDe3j6tzqDI4ZKKmyYJfGM4jEVfJZM7KUN7IAU8dU.jpg?auto=webp&amp;s=001cab7bd78fa45c39f8f5e9746debe54e18c7c5"
        },
        "permalink": "/r/realmadrid/comments/1hzyri9/ancelotti_slams_real_madrid_for_not_playing/"
    },
    {
        "id": "1hzzqv7",
        "author": "Code__Lyoko",
        "title": "What exactly happened after the red card and Rodrygo scoring a goal? ",
        "content": "So, \n\nIt’s 5-2, and minute 60. We know there will be at least 5 minutes of added time. This totals to almost entire half time to score 3 goals against the team that has 1 player less. \n\nWe used to do come back against the prime City and PSG in much less minutes with equal number of players. \n\nTonight, players were lost and desperately needed some tactical plan. Funnily enough, Ancelotti is almost proudly stating that he is making no any plans. \n\nIn addition, players were showing passion no matter what. Tonight, nobody cared apart from few. And that is happening when players have guaranteed spot no matter what. Regardless how they play, they will play the next game, too. \n\nI would understand forcing some yougsters to unlock their potential and make the future for them and club. But Ancelotti is trying hard with Vasquez and Mendy like they are 17. For different reasons, he plays Tchouameni cause they payed him 80millions. He must play even as a goalkeeper, he must play. \n\nLastly, Carlo is not 40, he know he has no future as a coach at Real Madrid anymore. He should just leave and make fans happy. This is ridiculous what he is doing. He should have left last season. He knew we were not playing well since he came, and that we won what we won on individual brilliance and luck\n",
        "upvotes": 30,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzzqv7/what_exactly_happened_after_the_red_card_and/"
    },
    {
        "id": "1hzlsbj",
        "author": "InkHart04",
        "title": "Explain this field image to a new Madrid fan without directly telling them what it is",
        "content": "On the day of El Clasico, I wanna see how creative and innovative this can be😁",
        "upvotes": 203,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/211fn0ug5kce1.jpeg?auto=webp&amp;s=64313f0bdd5ab5db1aa48ea66202b304c08247aa"
        },
        "permalink": "/r/realmadrid/comments/1hzlsbj/explain_this_field_image_to_a_new_madrid_fan/"
    },
    {
        "id": "1hzz5vl",
        "author": "kurdistannn",
        "title": "Playing Valverde as RB isn’t the solution, it’s hurting the players and the squad’s future",
        "content": "This isn't the solution. Playing Valverde as a right back might seem like a quick fix since he's miles ahead of Lucas Vázquez in that role, but we need to stop forcing players to play out of position instead of addressing the need through proper signings.  \n\nWhy settle for being a decent right back when you can be a world class midfielder? Players may be willing to sacrifice for the team, but they're not happy playing out of position, and it affects their mental state.\nMore importantly, it stunts their growth and momentum when they're stuck in an unfamiliar role for too long.  \n\nI'm not here to defend Tchouaméni, he has been underperforming game after game, but I believe he was on the right track before Carlo started using him as a center back. Now that he's played more games as a CB than in his natural position, not only is he ineffective defensively, but he also seems to have lost his edge in midfield.  \n\nFor young players, especially those who have only been at Madrid for a few seasons, it's crucial to develop in their natural positions. These players need time to find their rhythm, build confidence, and fully evolve into their roles. Playing them out of position disrupts that process and risks wasting their potential.  \n\nAnother big issue is that by constantly forcing players to play out of position, we enable Pérez to continue avoiding the squad's actual needs. This approach only gives him confidence to stick with patchwork solutions instead of making the signings we desperately need. It reminds me of how our two recent UCL wins gave him the excuse to overlook the cracks in the squad, leaving alot of issues unaddressed.  \n\nIf we want long-term success, we need proper squad planning and players who are allowed to thrive in their natural roles before desperately playing them out of position without much choice on their part. ",
        "upvotes": 19,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzz5vl/playing_valverde_as_rb_isnt_the_solution_its/"
    },
    {
        "id": "1hzydj9",
        "author": "Fluffy_MrSheep",
        "title": "The way the back line is used in this club is ridiculous ",
        "content": "I cant tell if this is tactics, or if this is just how real madrid play, but the way real madrid simply cannot exert any pressure on the game because the cbs arent used to put pressure high up the pitch is insane, im not asking to play barcelonas high line which causes problems for them against every single team apart from us apparently, but we're at the complete opposite end of the stick, the line completely collapses towards goal under any pressure at all. \n\nNot just against barcelona, but against every team real madrid play against. It's the reason real madrid look so easy to play against, they cannot put pressure on with their defenders. Our attackers also dont put pressure on. Vini and mbappe will lightly jog which im not knocking at all because they have their own job to do which isn't to press so fair, but the back line needs to be involved in the game, footballs evolved way past just attacking and defending which is if you look at it ancelottis philosophy to playing the game. The team attacks and then they drop back into defensive formation. That's simply not gonna work anymore ",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzydj9/the_way_the_back_line_is_used_in_this_club_is/"
    },
    {
        "id": "1hzyz57",
        "author": "saedaguirre9951",
        "title": "It seems Carlo still hasn't figured out how to make this team work",
        "content": "We're over halfway through the season, and it's the same old story. Carlo Ancelotti, with all his experience and accolades, still hasn't managed to get this team to click. It's beyond frustrating to watch.\n\nFirst and foremost, our defense is in a state of absolute shit. Yet Carlo continues to start Vazquez and Tchouameni while benching one of our best defenders in Asencio.\n\nFor the 2nd time in a row, we hardly threatened Flick’s high line. Carlo refuses to build out from the back, resorting to aimless passes that get us nowhere. There’s no creativity, no effective strategy, just a lot of wasted potential.\n\nWe've seen flashes of what this team can do, but just when we think things are starting to click, we get a reality check like this. How can we have such a talented squad and still be struggling like this?",
        "upvotes": 16,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hzyz57/it_seems_carlo_still_hasnt_figured_out_how_to/"
    },
    {
        "id": "1hzsdza",
        "author": "ManuMora98",
        "title": "[Basket] 4 wins in 4 games this week after beating Tenerife 96-86 after a great 3rd quarter. Next, Maccabi in Euroleague at home. ",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6rFqrmCF3zWAiSiMJt5QWPRojS19wZY2GgFw0PmdKhk.jpg?auto=webp&amp;s=46cdb619f8365be70056f1c8c444d68487102d88"
        },
        "permalink": "/r/realmadrid/comments/1hzsdza/basket_4_wins_in_4_games_this_week_after_beating/"
    },
    {
        "id": "1hzwzou",
        "author": "chui77",
        "title": "[Post Match Survey] Real Madrid 2-5 Barcelona",
        "content": "",
        "upvotes": 15,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W6Vz2eyYthWbRLV5L_10JEaJii45oVmUvS8wvsKrctU.jpg?auto=webp&amp;s=5b9c5556b33e4ef604c81366ee1d01beba2d2e4e"
        },
        "permalink": "/r/realmadrid/comments/1hzwzou/post_match_survey_real_madrid_25_barcelona/"
    },
    {
        "id": "1hzftqj",
        "author": "ThickWorldliness6895",
        "title": "[Pre-Match Thread] Real Madrid vs Barcelona| Supercopa De España | Final",
        "content": "",
        "upvotes": 258,
        "comments": 222,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fwppszeq1ice1.jpeg?auto=webp&amp;s=a6d97a115a94362faa63392237ff2840e5d7f46f"
        },
        "permalink": "/r/realmadrid/comments/1hzftqj/prematch_thread_real_madrid_vs_barcelona/"
    },
    {
        "id": "1i0277k",
        "author": "Inevitable_Sky398",
        "title": "Off my chest after the disappointing defeat ",
        "content": "Everyone of us is fucking mad. Losing a Clasico happens, but what, now we are back to conceding 4 and 5 goals in a single game against Barcelona in just 4 months ? What's next until we know we need re-structuring in defense ? Maybe conceding 8 goals in the away game in La Liga will help ? \n\nThe tough tests this season were BVB, Barcelona, Liverpool and Milan.. we won only against BVB, and credits goes to the team but Nuri Sahin poor management and parking the bus early helped a lot. The rest of the teams had good wingers, and they all cooked our fullbacks, Mendy, a once every 2 seasons, top defensive player, and... Lucas Vazquez..\n\nAgain he starts. I get that the goals weren't FULLY on him, as Tchou is no Maldini and today, even Rudiger was out of place, and neither Cama or Valverde covered that CDM spot... but he keeps proving every game against good wingers that he can't defend for his life unless Rodrygo or Valverde helps him... that space in between him and Tchouameni became a popular tourist destination for opposite team forwards... \n\nHe is a fucking backup and him doing good against Pachuca and Getafe and Las Palmas doesn't mean he will do good against wingers like Raphinha... are the Castilla players that bad ? I don't know who is the starting RB there, but if Asencio got promoted, maybe I am missing something and the Castilla RB is not a good fit either ? If not.. are we fucking broke or something ? Can't we loan a RB at least ? a physical RB ? \n\nI defended Tchouameni and Ancelotti's decision.. but he is no Maldini that justifies benching Asencio, who in every minute he plays, he proves he is very elegant and can handle his own, in areal duals and tackling and he is even pretty fast... even his passing and build up is good.. I don't know what Tchouameni did this season to deserve to get ahead. I remember the 'best' game he had against Girona, that's it. \n\nAlso why the fuck Ceballos was benched today ? We have been shit in the midfield despite having all those big names stacked next to each other and HE was the one who fixed the build up, linking our defense and midfield and forwards. He does the easy and chill job of passes forward, with the least dribbling and ball holding. He is no Kroos but he is the closest to filling his place... we improved a lot since he started, but today, for some reason, Ancelotti decided long balls is the answer and he shouldn't start... very questionable.\n\nNow to our starters... something is off even with the player with the monstrous mentality today, Bellingham. He looked like he didn't care at all. He is usually a leader on the pitch, but today, he wasn't good. He was consistent and carried us countless times together with Rudiger. It still hurts that the one bad game they have is in a title final and against Barça... \n\nVinicius needs to fucking focus. Did it get to his head that he is the 'best' player and everything is a conspiracy against him after CR7 told him you're the best ? He let his team down to 10 men after being provoked by Valencia players, almost costing us 3 important points, then the Mallorca game, he gets involved in the fight even though he is in the bench, and today, he was nowhere to be seen.\n\nModric pulled us through in the Valencia game, but today he was very clumsy. worst sub.\n\nWorst game for Bellingham and Rudiger since they were signed too.\n\nPerez, please. Like I said in another post a couple of months ago, he decided that Ancelotti will always find the answer with the 'available' players just because he made it work when Benzema left and use Jude as false 9. Buy us a fucking RB. the La Liga teams that succeeded in beating and drawing against Barcelona also had to deal with Raphinha.. We are making Barcelona look like prime Brazil ! Every fucking time ! We conceded 9 goals in two games ! FUCK OFF Perez and buy some fucking right back ! I won't even be mad if he under performs, at least he is a right back ! ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1i0277k/off_my_chest_after_the_disappointing_defeat/"
    },
    {
        "id": "1hz8wdf",
        "author": "ali_ly",
        "title": "Came across this post",
        "content": "What's your favorite Super Copa moment?",
        "upvotes": 508,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1hz8wdf/came_across_this_post/"
    }
]