[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kr39e2",
        "author": "_tatabox",
        "title": "Ho trovato questo vecchio biglietto della tranvia Sassi Superga",
        "content": "Forse è del 2000-2002 ma non ne sono sicura ",
        "upvotes": 60,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4pjugfq2hx1f1.jpeg?auto=webp&amp;s=01922da50f2e4e3c5c94f48a28447b41a074e8ff"
        },
        "permalink": "/r/torino/comments/1kr39e2/ho_trovato_questo_vecchio_biglietto_della_tranvia/"
    },
    {
        "id": "1krrzae",
        "author": "AdShort2912",
        "title": "qualcuno che insegna italiano?",
        "content": "Sono un ragazzo che è in torino per contratto di lavoro e vorrei qualcuno che può insegnare italiano o gruppi dove imparare altre lingue o se qualcuno vuole imparare lo spagnolo.\nsorry...",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1krrzae/qualcuno_che_insegna_italiano/"
    },
    {
        "id": "1krdrq0",
        "author": "dean_ax",
        "title": "Cercasi gelateria buona zona parella",
        "content": "Buonasera a tutti. Mi sono trasferita con il mio tipo in una nuova zona di Torino. Prima a borgo san Paolo eravamo clienti fissi della gelateria Mosa (se non la conoscete provatela che merita davvero). Io non ho un palato raffinato ma il mio ragazzo si.\n\nSiccome Mosa è molto scomoda da raggiungere da casa nostra coi mezzi, avete consigli su gelaterie in zona parella a parte Gelateria d'Antan? Le sue pippe mentali sulle gelaterie buone riguardano: gelato non a vista ma dentro ai pozzetti, gusti classici e magari qualche variante.\n\nHelp",
        "upvotes": 6,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1krdrq0/cercasi_gelateria_buona_zona_parella/"
    },
    {
        "id": "1krp073",
        "author": "RaveGirl9696",
        "title": "Ciao tutti! Kappa Festival ?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1krp073/ciao_tutti_kappa_festival/"
    },
    {
        "id": "1krdx2j",
        "author": "HeftyHistorian3174",
        "title": "Cerco compagnia per ristorante Condividere giovedì 19 giugno",
        "content": "Ciao, qui M32 super appassionato di alta cucina che oggi dando un'occhiata si è imbattuto in una rarissima disponibilità! Menù Gran Festival senza il minimo dubbio e magari una bottiglia di vino da condividere. Qualche interessat\\* ? ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1krdx2j/cerco_compagnia_per_ristorante_condividere/"
    },
    {
        "id": "1kr30gx",
        "author": "Enea_616",
        "title": "Scusate l'ignoranza. Questa zona è sicura di notte? (Via Assietta - Corso Stati Uniti). So che Crocetta è sicura ma la strada è anche attaccata a Porta Nuova",
        "content": "",
        "upvotes": 17,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggu4eo1iex1f1.jpeg?auto=webp&amp;s=3dcce3b91e65d069e43f6e2052829b135d52e109"
        },
        "permalink": "/r/torino/comments/1kr30gx/scusate_lignoranza_questa_zona_è_sicura_di_notte/"
    },
    {
        "id": "1kqnk1r",
        "author": "Medium_Woodpecker887",
        "title": "Aggredito da dei maranza egiziani ,questa città è pericolosa.",
        "content": "Vicino alla stazione,io camminavo tranquillamente quando passo vicino a un ragazzo che mi chiede ''vuoi fumo?'' io dico no e continuo a camminare,poi noto che il ragazzo e un altro comunque mi seguono,e al lato sinistro della strada arriva uno più alto che mi guarda e fa ''oh vieni'' ma i suoi amici gli fanno ''no no lascialo perdere '' poi si mettono a ridere della mia reazione e noto che era proprio un bel gruppo,persone grandi, classico outfit da maranza,sicuro tutti egiziani,solo che erano divisi ai lati per strada , uno mi tocca il braccio e fa ''no vai via'',mi stava per partire il pugno in faccia ma mi stavo bloccando,poi anche questo ,continuava a scherzare e non me lo tira davvero ma fa il gesto di tirarmi un pugno/schiaffo o qualcosa del genere,la cosa peggiore è che stava facendo finta di mettersi a sedere nelle panchine e mi ha messo le mani da dietro,sicuro sto pezzente voleva rubare qualcosa,poi le ha levate subito poco dopo ridendo ,tutto questo vado avanti e semplicemente continuano a ridere.",
        "upvotes": 82,
        "comments": 88,
        "media": null,
        "permalink": "/r/torino/comments/1kqnk1r/aggredito_da_dei_maranza_egiziani_questa_città_è/"
    },
    {
        "id": "1kqz5qj",
        "author": "AironDoA",
        "title": "Quella meravigliosa Estate",
        "content": "Ciao a tutti, sono nuovo su Reddit e questo è il primo post che ho deciso di scrivere.\n\nVolevo scaricare questa sensazione che ho dentro e, restando anonimo, spero che questo racconto diventi una sorta di panacea per me. In secondo luogo, vorrei che fosse un monito per chi, come me, trasforma la tenacia in ossessione e la forza in dolore.\n\nSono un ragazzo nato nel ’95 e ho sempre abitato in un paesino in provincia di Torino, in Piemonte. Quando iniziai la scuola elementare, i miei genitori mi iscrissero all’oratorio estivo denominato “Oratorio Valdocco”. Passai le estati della mia infanzia in completa spensieratezza, divertendomi tra amici temporanei di quelle estati per fortuna non così calde come quelle di adesso.... Ma ci fu un anno cruciale, un evento che mi segnò profondamente e mi porta ancora oggi a raccontarlo. Durante le vacanze estive della quarta elementare, intorno al 2005, mi iscrissero per la quarta volta consecutiva all’oratorio Valdocco di Torino. I primi giorni trascorsero spensierati come ogni estate ricominciando a farmi degli amici con cui passare le estati di quell'anno, quel periodo ricordo che salvo rari casi ero sempre solo, non che la cosa mi dispiacesse siccome all'oratorio vi erano i cabinati con cui passare il tempo, e ogni tanto qualche chiacchera con qualche altro bimbo. L'oratorio era solito organizzare delle gite, alcune a cadenza regolare come l'ingresso alle cupole lido e altre sporadiche che facevamo nei pressi della città di Torino stessa spesso muovendoci a piedi per le strade di quest'ultima. Un giorno partimmo per questa gita verso un luogo, non ricordo il nome, ma credo sempre legato alla Chiesa o comunque dei Salesiani di Torino.\n\nPREMESSA: molto spesso ci si faceva preparare il pranzo al sacco da casa per due motivi uno per risparmiare soldi e due non era una prassi comune comprarsi il cibo o comunque fare gestire il denaro ai più piccoli, questo comportava una costruzione del mio pranzo abbastanza monotona e basilare ad eccezion fatta per la frutta, mentre le portate principali si riducevano a panini con il prosciutto con la mozzarella, la frutta cambiava ogni tanto e la cosa bella è che mia madre aveva una sorta di cucchiaino per i meloni per preparare delle palline di melone, e quindi quel giorno la mia mamma mi aveva preparato un pranzino con 2 panini e scatolina di melone a palline e il tutto riposto in una borsa frigo a tracolla.\n\n\n\nArrivati sul posto, facemmo un giro nell’atrio d’ingresso dove, ricordi un po' confusi, vi era un chioschetto sulla sinistra. Arrivammo li circa per mezzogiorno, e molti bambini si misero in fila per un ghiacciolo da pochi centesimi, si qualche d'uno riusciva ad imbarcare qualche spicciolo per ghiaccioli. Io per i fatti miei uscii e mi ritrovai di fronte questo cortile rettangolare grande con lo sterrato e con un viale alberato che ne seguiva il perimetro fino a ritornare al punto di partenza. una volta uscito vi erano delle scale da scendere per raggiungere il cortile e davanti ad esse una piccola zona con un paio di gradini, credo un ingresso secondario memoria un po' offuscata. iniziai a prepararmi per mangiare quando diversi bimbi si sedettero nel mio stesso posto, molto probabilmente poiché all'ombra, nel mentre iniziai a mangiare con tutta calma i panini anche perché non avendo amichetti non c'era la foga dell'andare a giocare subito. Finiti i panini quando misi la mano per prendere il contenitore del melone e scoprì che si era rovesciato in tutta la borsa frigo, io fui triste poiché attendevo il gusto del melone che purtroppo si rovesciò e allora preso dallo sconforto e salvato il mangiabile mi sono messo a pulire prima di gustarmi la frutta ed è li esattamente in quell'esatto momento che la mia vita cambiò.\n\n\n\nMentre ripulivo la borsa frigo una bimba molto dolcemente e con immensa gentilezza iniziò ad aiutarmi, senza che io gli avessi chiesto nulla o fatto accenno di sconforto, passando il tempo ad aiutarmi anziché parlare o giocare con la sua amichetta estiva, non ricordo bene le sensazioni che provai in quel momento ma fino ad allora o c'erano sgridate genitoriali o prese in giro da parte di compagni di classe od affini, così che a quel gesto così semplice ma meraviglioso le chiesi se dopo il pranzo le fosse andato di giocare insieme cosa che lei accettò, nel mente ci scambiammo i nomi scoprendo che il suo nome fu Chiara, una bimba di cui purtroppo non ricordo bene i tratti estetici ma ricordo i suoi capelli biondi e i suoi occhi chiari e particolari. Una volta finito il pranzo e ripulito il tutto iniziammo a giocare insieme correndo e rincorrendoci per quel viale alberato di quel cortile, inoltre per giocare con me decise di accantonare la sua amichetta non so bene che relazione di amicizia ci fosse ma magari si erano appena conosciute, giocammo tantissimo insieme fino all'ora di rientro in oratorio e una volta li era ora di andare e quindi ci salutammo.\n\n\n\n\n\nNel resto delle settimane mancanti ci incontravamo sempre in oratorio a parlare e giocare, e io ringrazio ancora per la sua enorme pazienza che mi permise di stare accanto a lei visto che avevamo interessi diversi di giochi ed io ero sempre quello che la trascinava nelle mie. Eventi fondamentali che mi piace molto riportare alla mente ( non è vero sono quelli che ricordo meglio) sono stati:\n\n \n\nIl primo momneto riguardava l'organizzazione in oratorio un pomeriggio danza dove si ballava, all'interno del piccolo anfiteatro posto al centro del cortile, a ritmo delle canzoni da bambini delle elementari o le hit del momento, io ero veramente negato nel ballare ero super impacciato quindi decisi di sedermi sui gradoni e guardare mentre Chiara ballava, nonostante mi avesse proposto molteplici volte di ballare io rifiutai, ma nonostante tutto mi bastava guardarla mentre si divertiva ed era meravigliosa e solare, momento che rimpiangerò tutta la mia vita per non aver accettato i suoi inviti; \n\n\n\nIl secondo momento è stato quando ci siamo messi a chiaccherare sulle altalene dell'oratorio e iniziammo a parlare del più e del meno (scoprendo anche che fosse più piccola di me di un anno), siccome iniziavo a sentire dentro di me il mio enorme interesse per lei, iniziai a farle domande riguardante altri bimbi interessati a lei nella sua classe e lei mi confermò che aveva dei pretendenti, ma ricordo che non era convinta di stare con loro, tutti questi discorsi hanno avuto un loro momento speciale che si è cristalizzato nella mia memoria poiché nel mentre lei aprì un pacchetto di gallette di riso e me ne offrì qualcuna nonostante io a casa non ne mangiassi, ora sono diventate uno tra i miei snack preferiti. (da quanto ricordi Chiara in quegli anni abitava a Torino se non ricordo male)\n\n\n\nIl terzo momento, purtroppo il più oscuro della vicenda, è stato l'ultimo giorno prima della conclusione della penultima settimana, lo sto specificando poichè l'oratorio per l'ultima settimana metteva a disposizione degli spettacoli preparati nel corso delle settimane precedenti tramite i vari laboratori in vista degli eventi giornalieri che seguirono, così passai quell'ultimo giorno meraviglioso con lei. Al momento del ritorno a casa, l'oratorio era solito far entrare i genitori nel momento in cui dovevano venirti prendere, venne sua madre la quale la stava aspettando all'ingresso. Io la seguii per accompagnarla e una volta arrivati di fronte a sua madre lei mi salutò come sempre in modo gentile e in quel momento capiì di non dover mollare, così chiesi a sua madre se Chiara sarebbe venuta la settimana seguente visto che fosse l'ultima e sua madre mi disse un si incerto che capii e così prima che si voltarono per andare via le chiesi prontamente il numero per poter sentire sua figlia in futuro, ma lei mi eclissò via non ricordo cosa mi disse nello specificò ma ricordo che in quel momento avevo capito qualcosa di spiacevole, passata l'ultima settimana al Valdocco non mi divertiì come prima senza di lei.\n\nIniziato l'anno nuovo a scuola nella mia classe, c'era anche una bimba che mi piaceva (tant'è che in prima elementare le regalai un mazzo di fiori si lo so è alquanto imbarazzante ma per il me bimbo ed innocente era un buon modo per far capire il tuo apprezzamento per una persona) che dopo quell'estate non apprezzavo più tanto, iniziai a parlare a tutti i miei amici di questa bambina meravigliosa e di quanto ci fossimo divertiti bene insieme, e sotto sotto di quanto mi fece sentire bene inoltre non calcolai minimamente la mia cotta di classe ma vi dico soltanto che la bambina della mia classe nonostante non si interessasse a me e mi prendeva in giro dai suoi sguardi notai gelosia mentre raccontavo questi accadimenti. \n\nCosì passai l'intero anno scolastico con il pensiero di arrivare all'estate successiva per rivedere Chiara e il momento che attendevo di piu.\n\nRicordate all'inizio di questo racconto quando vi dicevo che i bimbi andavano e venivano e che quindi non c'era la sicurezza che gli incontri dell'anno prima sarebbero rimasti ecco.... l'estate successiva successe che cercai Chiara ovunque all'interno dell'oratorio chiedendo a bimbi incontrati l'anno prima e perfino al Don di quegli anni, che se non sbaglio si chiamava don Giovanni (si lo so sembra una battuta), se avessero visto Chiara o comunque una bimba simile alla descrizione che rilasciavo. Tutta via passai l'estate e il periodo dell'oratorio passò, si felice ma non come quando c'era lei.\n\nGli anni passarono e tra periodi scolastici che si susseguivano, amici e nemici che si incontravano, il mio pensiero su di lei è sempre stato fisso, tant'è che siccome iniziava il periodo delle fidanzatine io ai miei amici raccontai la bugia che lei era la mia fidanzata e che abitando a Torino la vedevo solo una volta settimana. \n\nTuttavia passarono le superiori e il pensiero rimase sempre su di lei o su quel poco che mi rimase impresso, poiché ricordo una volta che mi arrabbiai profondamente con me stesso perché non riuscivo più a ricordare il suo volto e mi feci male sia interiore che fisico. Dopo le superiori iniziai a lavorare presso il Servizio Civile Nazionale al tempo avevo 19 anni o poco più e vi dico che nei tempi morti scrissi email al Valdocco nella possibilità che potessi recuperare il suo nome e cognome, ma chiaramente non si poteva per via della privacy, cercai sui social, che non possedevo, e non possiedo tutt'ora, utilizzando l'account prestato che dovevo seguire al tempo, sempre con l'unico scopo di trovarla e di vedere se fosse ancora rimasta la dolce e gentil bambina con cui passai quell'estate.\n\nTutte le ricerche e i pensieri fissi giungono fino ad oggi in questo momento in cui sto scrivendo questa storia. Come ho menzionato all'inizio questo è in primo luogo per scaricare queste emozioni e devo confessarvi anche i vari problemi che mi sono portato appresso da questa idealizzazione, del quale sono consapevole ma purtroppo nel mondo odierno non ho trovato il buon cuore che Chiara possedeva e quindi sono rimasto a tale idealizzazione di bontà e gentilezza che mi ha creato problemi a relazionarmi con ragazze incontrate successivamente in cui volevo vedere tali qualità, non che non ci abbia provato ma purtroppo non solo ricevevo i due di picche a catinelle ma in più mi prendevano in anche in giro per averci provato con loro, questo comunque succede dalle medie fino ad oggi chiudendomi sempre di più in me stesso con la mia idealizzazione.\n\nCosì sono oramai divenuto un uomo che non ha mai più provato quel piacere di avere una persona così al mio fianco chiudendomi a tal punto, dopo ogni prova, di essere ancora all'oscuro dell'emozione dell'amore e senza aver mai provato quelle sensazioni di brividi, di scariche di dopamina, se vogliamo analizzare la cosa dal punto più scientifico, e di intimità con una persona.\n\nPremettendo che tutto ciò lo raccontato anche a professionisti in molteplici sedute purtroppo ancora oggi non riesco ad eliminare quella parte poiché credo di non volermene separare nonostante sia divenuta, per me, una prassi molto tossica.\n\nDesidero che questa storia sia da monito a tutte quelle persone che soffrono costantemente nella perdita di familiari, i quali sono ben più legati di una mera cotta estiva, nella perdita di amici, compagni e affini per via di litigi o altri motivi piu gravi, e dirvi di, sperando di aver potuto lasciare trasparire questo mio dolore a tutti voi, non fare come ho fatto io cercando di imbrigliare le mie emozioni e aumentare la sofferenza, portando tutto ciò a divenire un essere vuoto\n\nVorrei dirvi anche perché ho deciso di scrivere tutto questo papiro, vedete purtroppo la negatività e difficile da lasciar andare via una volta che si impossessa di te e siccome sto concludendo e chiudendo diversi punti rimasti aperti della mia vita ho deciso di metter nero su bianco queste parole.\n\n\n\nRingrazio a tutti per l'attenzione e vi auguro una splendida giornata",
        "upvotes": 9,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1kqz5qj/quella_meravigliosa_estate/"
    },
    {
        "id": "1krd71w",
        "author": "Academic-Wave-2596",
        "title": "Uova a Toro",
        "content": "Ciao, ho bisogno urgente di un distributore di uova a Torino. Acquisto per maggiori. Qualcuna aiuta?\n\nGrazie",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1krd71w/uova_a_toro/"
    },
    {
        "id": "1kr6khy",
        "author": "kkk3105",
        "title": "Eventi metal (f29)",
        "content": "C'è qualche ragazza qui che ascolta metal e ha voglia di fare due chiacchiere o ha bisigno di compagnia per qualche serata? Sono a Torino da poco e non ho ancora trovato qualche amica con cui uscire 🥲",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kr6khy/eventi_metal_f29/"
    },
    {
        "id": "1kr04fh",
        "author": "Holiday-Scholar",
        "title": "Cerco compari di Skateboard",
        "content": "Ciao ragazzi/e, ho 24anni e ogni tanto mi faccio un giro o lo uso per andare in uni. Però vorrei anche frequentare dei park e sono da troppo tempo riluttante per timore di essere di intralcio. Magari se qualcuno è già avviato e ha anche voglia di insegnarmi qualcosa sarebbe perfetto per rompere il ghiaccio. \nAnche dei consigli vanno bene, grazie &lt;3",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kr04fh/cerco_compari_di_skateboard/"
    },
    {
        "id": "1kqzmsg",
        "author": "Subject_Carpet_6667",
        "title": "Partita Napoli Cagliari",
        "content": "Conoscete un locale per vedere la partita del Napoli in compagnia di altri tifosi a Torino?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kqzmsg/partita_napoli_cagliari/"
    },
    {
        "id": "1kq8n76",
        "author": "raphyy_sanchez",
        "title": "Looking for pen writing store",
        "content": "(Sorry my english) Any recommendations for store where to find a good selection of pen, pencils papers and so on? Grazie ! :) ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kq8n76/looking_for_pen_writing_store/"
    },
    {
        "id": "1kqgjbr",
        "author": "irmakinon",
        "title": "Controllo delle multe",
        "content": "Ciao, vorrei sapere se è stata emessa una multa per la mia auto. Purtroppo non ho una cassetta postale. Come posso verificarlo? Grazie.",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1kqgjbr/controllo_delle_multe/"
    },
    {
        "id": "1kq75ll",
        "author": "nicco_lo",
        "title": "Corso Brescia, Aurora",
        "content": "Ciao a tutti, io e due amici ci trasferiremo a Torino a settembre e stiamo valutando un appartamento in Corso Brescia all’incrocio con Corso Giulio Cesare. Sapete dirmi qualcosa su quella zona? La vicinanza con Barriera di Milano è davvero così disagiante? Grazie mille a chi risponderà",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1kq75ll/corso_brescia_aurora/"
    },
    {
        "id": "1kq6uxf",
        "author": "wherearemyburritos",
        "title": "cerco ginecologa",
        "content": "Ciao a tutte,\n\nsono alla ricerca di una ginecologa (possibilmente donna) che possa aiutarmi. \nFino a poco tempo fa ero seguita da una ginecologa tramite l’ASL, ma con il Servizio Sanitario Nazionale il mio prossimo appuntamento disponibile sarebbe nel 2026!\nOvviamente è troppo tardi per le mie esigenze attuali, quindi sto cercando una professionista affidabile (anche privatamente, se necessario) a Torino.\n\nSe avete consigli o esperienze da condividere, ve ne sarei davvero grata!",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kq6uxf/cerco_ginecologa/"
    },
    {
        "id": "1kq6sif",
        "author": "ExperienceVarious552",
        "title": "In quale zona trasferirsi?",
        "content": "Ciao a tutti, sono un ragazzo di 26 anni vorrei trasferirmi a Torino (abito in un paese della cintura).\nSto facendo diverse valutazioni, secondo voi sono corrette? Avete dei consigli? \nValuto affitti sui 500/600€ o acquistare a meno di 80k per restaurare. \nLe zone che avrei scelto potrebbero essere zona lingotto/inizio di San Salvario (fino a corso Marconi per intenderci) oppure Torino ovest zona piazza massaua \nVantaggi lingotto: metro, lungo Po per correre, più vicina al centro (credo?)\nVantaggi Massaua: metro, leggermente meno cara \n\nCi sono altre cose che dovrei sapere? Quale zona consigliereste?",
        "upvotes": 2,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1kq6sif/in_quale_zona_trasferirsi/"
    },
    {
        "id": "1kq76hc",
        "author": "Key_Sky9883",
        "title": "Concerto stadio Grande Torino",
        "content": "Ciao, devo organizzarmi per il concerto di Vasco a Torino, non essendo pratico del posto e non andando più a concerti da tanto ho bisogno di un paio di consigli.  Ho posti nei distinti numerati (vicino alla curva) quanto in anticipo devo arrivare? la bottiglietta d'acqua senza tappo si può portare? eventualmene con  zaino (il classico zaino che ti lasciano portre anche in aereo va bene?) consigli vari sono bene accetti !  grazie",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kq76hc/concerto_stadio_grande_torino/"
    },
    {
        "id": "1kpx449",
        "author": "flying_stingray",
        "title": "Anyone to exchange apple mint(me) and lemon balm/melissa(you)?",
        "content": "Hi. I'm looking for small lemon balm to exchange with my apple mint which I'm propagating now. Sure, I could just buy one but garden centre's lemon balm was all chipped and beaten, also too big. :s\n\nThe mother plant is living outdoor in full sun and good breeze, happy and healthy. I took whole branch then propagated it on Thursday and it is already rooting from two knuckles so once you pot it she will thrive. Healthy mother plant delivers good result almost every time.\n\nWhen I bought it lower leaves had mint rust(fungal illness) but as soon as I remove infected leaves and repot it in new soil it was fine. It's not showing any sign of rust for more than a month now, just thriving. Probably it was the old soil but be aware of it.\n\nI think new roots will be ready for soil after spending another week in water so this post is uploaded in advance. Please feel free to leave a comment anytime.\n\nI grow mostly herbs and use them for cooking so that I cannot use any pesticide except for neem oil. If your lemon balm suffer from pest and illness I must respectfuly decline.\n\n[After taking this picture the bottom leaves\\(2 red X\\) were removed since it was too close to new roots.](https://preview.redd.it/iib0ncf0hm1f1.png?width=1439&amp;format=png&amp;auto=webp&amp;s=8df00b59cefe52c661135a31901f9c492f2e9b5a)\n\n[Mother plant. It's spreading runners while growing taller at the same time. Those nibbles are from leaf hoppers. They visit my plants sometimes but never move in. No worries. Pest-free guaranteed.](https://preview.redd.it/vm6u3cf0hm1f1.jpg?width=1800&amp;format=pjpg&amp;auto=webp&amp;s=db71114c904ee70de066de3f0f97dcd8fd304898)\n\n[After I pop it in water one of the bottom leaves showed 2 small faded spots but I think it's due to stress. It's doing well in my windowsill.](https://preview.redd.it/it4uhbf0hm1f1.jpg?width=3001&amp;format=pjpg&amp;auto=webp&amp;s=0ba62b8ba707db7d8130b82c4ec12cff7ec0c60e)\n\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kpx449/anyone_to_exchange_apple_mintme_and_lemon/"
    },
    {
        "id": "1kpw2ax",
        "author": "stefano-cookie",
        "title": "Cerco musicisti curiosi",
        "content": "Mi piacerebbe trovare qualcuno di affine per degli inediti che ho scritto. \nLe sonorità: indie rock, fusion jazz, bossanova, funky. \nQualche influenza: kings of convenience, nu genea, Samuele Bersani, primi album dei Coldplay. \nIl mio obiettivo è formare un gruppetto informale per conoscerci e cercare affinità musicale e di amicizia. Poi si vede. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kpw2ax/cerco_musicisti_curiosi/"
    },
    {
        "id": "1kpfv7d",
        "author": "Tymtom",
        "title": "Cerco gruppo per giochi da tavola",
        "content": "Ciao, sono a Torino da poco e mi manca un sacco giocare a giochi da tavola con i miei amici. \n\nNon conoscendo persone qua a Torino, vorrei trovare un gruppo che già gioca regolarmente \n\nHo 26 anni e sono libero prevalentemente la sera ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kpfv7d/cerco_gruppo_per_giochi_da_tavola/"
    },
    {
        "id": "1kppekz",
        "author": "Erleyx",
        "title": "Cerco amici",
        "content": "Hey, I just moved down to Nichelino and I really miss hanging out with friends.\n\nSince I don’t know anyone here yet (and my Italian still kinda sucks), I’m hoping to find some chill people to meet up with. Coffee, walks, gym sessions, whatever sounds fun.\n\nI’m 18 and mostly free in the evenings. If you’re around Nichelino / Torino and down to make a new friend, hit me up!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kppekz/cerco_amici/"
    },
    {
        "id": "1kpi2j0",
        "author": "JeramiDeng",
        "title": "Rent in Torino for 1 month as foreigner",
        "content": "Hey I would like to rent something for 1 month without docs like proof of income\nIs this possible without airbnb etc? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kpi2j0/rent_in_torino_for_1_month_as_foreigner/"
    },
    {
        "id": "1kpqpio",
        "author": "andeee92",
        "title": "Canali Telegram Torink",
        "content": "Fino a 6 mesi fa c'erano un sacco di canali su telegram per avvalersi di fantastici pusher su Torino con meet up. Che fino hanno fatto? Come faccio a trovarli di nuovo?\nHelp please, sono perso senza",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kpqpio/canali_telegram_torink/"
    },
    {
        "id": "1koy6fn",
        "author": "CryingAlwaysCrying",
        "title": "Trasferirsi ad Aosta da Torino: esperienze?",
        "content": "Ciao a tutti,\n\nQualcuno qui vive o ha vissuto ad Aosta? Sto valutando di trasferirmi lì da Torino per un po’, finché le cose non si sistemano.  \n  \nCom’è la vita ad Aosta? Lavoro da remoto quindi cerco un posto tranquillo ma non isolato. Qualche dritta su pro/contro, costi, atmosfera, ecc.?\n\nCome città mi piace un sacco, ma ci vado solo nei weekend, quindi non so come sia la vita lì.\n\nGrazie in anticipo!",
        "upvotes": 15,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1koy6fn/trasferirsi_ad_aosta_da_torino_esperienze/"
    },
    {
        "id": "1kp5p8n",
        "author": "CobblerSuccessful962",
        "title": "About permesso di soggiorno",
        "content": "Hey everyone, I had my fingerprint appointment in the middle of March and its been almost 2 months but I still got no updates from questura. I've been constantly checking the state of my application from the website but it's still not ready to be collected. Last year I got the card in 1 month after the fingerprint appointment but this year I don't understand what's wrong. How is your experience this year? Do you think I'll be waiting even longer? Also is it okay if I don't collect it (or if I collect it some other time than the one they'll be assigning) since I won't be traveling in the Schengen area?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kp5p8n/about_permesso_di_soggiorno/"
    },
    {
        "id": "1kom3gj",
        "author": "CryingAlwaysCrying",
        "title": "GTT è letteralmente impossibile",
        "content": "Giuro, prendo l’autobus tipo due volte all’anno. Ma ogni singola volta che provo ad affidarmi a GTT è una tragedia annunciata. O non passa proprio, o arriva talmente in ritardo che tanto valeva andare a piedi da subito.\n\nCom’è possibile che una città come Torino abbia un sistema di trasporto pubblico così indecente? È quasi comico per quanto fa schifo. Ma la cosa assurda è che non sono nemmeno un utente abituale, eppure ogni volta è un disastro.\n\nIeri mattina mi sono svegliato alle 7:30 per arrivare alle 9. Facile, no? Peccato che il bus delle 8:00 è diventato 8:16, poi ha continuato a slittare come se stessi guardando un countdown verso il nulla. Sono arrivato alle 9:15. Ridicolo.\n\nE il mitico “in tempo reale”? Ma reale cosa? È una presa in giro.\n\nDetto questo, massimo rispetto per chi lavora con questo sistema tutti giorni. Non ce l’ho con voi. Il problema è strutturale, gestionale, ed evidente a chiunque provi ad usare questo servizio\n\nMa seriamente: come può un sistema così esistere nel 2025 in una città come Torino\n\n",
        "upvotes": 104,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1kom3gj/gtt_è_letteralmente_impossibile/"
    },
    {
        "id": "1kp2rss",
        "author": "Bluejay_Bulky",
        "title": "any lgbt+ bar/club recommendation in turin tonight?",
        "content": "in turin for a couple of days",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kp2rss/any_lgbt_barclub_recommendation_in_turin_tonight/"
    },
    {
        "id": "1kongvd",
        "author": "Inevitable-Bad5953",
        "title": "Corsi di cioccolateria a Torino?",
        "content": "Ciao a tutti, come sappiamo Torino e una città conosciuta per il suo cioccolato e volevo sapere se ci sono delle formazioni disponibili nella città per diventare (eventualmente) cioccolatiere. Se non ci sono corsi del genere, come si avanza in quest’ambito invece? Qual’è il passaggio “normale” che si fa per entrare/avanzare?",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kongvd/corsi_di_cioccolateria_a_torino/"
    },
    {
        "id": "1kop9n5",
        "author": "skortica",
        "title": "Bici Gravel/strada giretti?",
        "content": "Ciao ciao, ho da pochissimo preso una bici Gravel e vorrei trovare qualcuno con cui andare. Fatevi avanti…",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kop9n5/bici_gravelstrada_giretti/"
    }
]