[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 504,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jvgcsa",
        "author": "Ester_LoverGirl",
        "title": "Who watched the Kidfluencing documentary ??",
        "content": "This doc was so good but so horrible too.\n\nHow is that girl still doing videos, as if nothing happened ?????????\n\nWe need to protect children at all cost.\n\n\nThis was so sad to watch.",
        "upvotes": 109,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1jvgcsa/who_watched_the_kidfluencing_documentary/"
    },
    {
        "id": "1jv9157",
        "author": "Interesting_Fan_3096",
        "title": "Million Dollar Secret Winner",
        "content": "This is one of the best reality game shows in Netflix. I was hooked from the beginning.\n\nThere were plenty of times I wanted to scream at the contestants, “why don’t you tell them this…” to convince them you’re not the millionaire, but they end up getting emotional, defensive and raising voices. I learnt that getting defensive like your “life” is on the line can be a truth / honestly signal instead of a signal for deceit. It happened every time in the game (eg Chris, Jaimi) \n\nFor example, Jaimi was twice a suspect. One for voting Lydia and telling the truth. (Sam and Sydnee lied so they wouldn’t be targets) No one believed Jaimi. To me, if I was the millionaire (or not), I would lie about voting Lydia because it instantly puts a target on my back because that was the clue. Jaimi admitted to voting Lydia. So it was obvious she was telling the truth! If you were worried of being caught, you would lie.\n\nStill, no one believed Jaimi. When they found out from the clue that she wasn’t the millionaire, Jaimi could have used that as proof to the group for the next time they suspect her.\n\nAgain, when she was the suspected millionaire, everyone thought it’s her because she told Sam to having two sisters (clue) and everyone refused to believe that another person would conceal it or lie about it. They would always target truth tellers (eg Jaimi or Corey in this case) When Jaimi was in the chopping block, again, she just screamed and cried to defend herself which we already know does not change people’s minds.She could have used the last time she was suspected as proof that she was telling the truth (eg Last time you didnt believe me, and you found out I was telling the truth. This is a game of deception, someone is lying. Anyone who has been honest has been an easy target and has been pinned as the millionaire)\n\n Next, I feel terribly bad for Corey in a way. I don’t think he would ever be able to trust anyone after this show. Lol but in a way, he was naive and his intuition was off throughout the show. He always suspected easy targets instead of thinking deeper (if I was the millionaire, how would I act?) this was missing from him throughout so in a way he was easily manipulated by Cara.\n\nFinally, I feel conflicted about Cara winning because she wasn’t that exciting to watch. But by the end of episode 6, I had a feeling she would win or at least play big in the finale. Why? Because she flew under the radar, everyone trusted her, and she actively kept information about herself hidden. She chose not to share. Her intuition was correct almost all of the time too (Sam was asking info about her sisters because she knew she had the clue, Corey and Sam would vote Sydnee out, Sydnee had immunity, Corey took her box etc) She played the game so very well because of her intuition but I so wanted the winners to either be Sydnee or Sam. They just actively played the game and revealed just enough, but because they were threats that put them in everyone’s radars to be voted off either way! \n\nSam was correct most of time but her emotions got in the way in which she trusted Cara. She kept saying she didn’t have it in her to think Cara would even ever be the millionaire because she wouldn’t let herself go there - that Cara is capable of deceit. This was Sam’s downfall and toxic trait lol Had she kept people at bay and not let her emotions cloud her I believe she would have won. Corey was the same but Corey was off throughout lol \n\nI wonder how they are and what they think about how they were all duped as Sydnee would put it.\n\n\n",
        "upvotes": 87,
        "comments": 202,
        "media": null,
        "permalink": "/r/netflix/comments/1jv9157/million_dollar_secret_winner/"
    },
    {
        "id": "1jvq1hu",
        "author": "nomnomsquirrel",
        "title": "Collider:  ’The Old Guard 2’ Director Teases Explosive Action and a Time Jump for the Sequel",
        "content": "I have been following what little news there has been about the sequel since it was (mostly) filmed in summer 2022, but I admit, the only clues I've seen about a time jump is different hairstyles. Still excited! The Old Guard is one of my fave Netflix originals.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvq1hu/collider_the_old_guard_2_director_teases/"
    },
    {
        "id": "1jv4s11",
        "author": "Alan_Stamm",
        "title": "'Bad Influence: The Dark Side of Kidfluencing' review – nothing about this shocking tale feels OK",
        "content": "",
        "upvotes": 96,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1jv4s11/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1jvsptm",
        "author": "vlad_asksandanswers",
        "title": "Have Netflix &amp; Co. changed the rules of the game for Europe?",
        "content": "Over the past 10-15 years, it seems that European productions, both in cinema and television, have been gaining increasing visibility on a global scale. Whereas it once appeared that everything had to go through Hollywood, now a German, Spanish, or Italian series can become an international success.\n\nI believe this is partly due to streaming platforms. Netflix, Prime, Disney+, and others have made the world more “multipolar,” even in cinema. Productions are happening everywhere, not just in Los Angeles, and audiences have become much more open to stories told in other languages.\n\nI think of titles like Dark (Germany), La Casa de Papel (Spain), Lupin (France), Suburra (Italy), 1899, The Rain, etc. But also more recent works like Cassandra from Germany, or Adolescence (UK), which has just been released and is already topping the charts on Netflix. And even though it’s a few years old, Zerocalcare’s Strappare lungo i bordi has had a strong impact, even outside of Italy.\n\nSo, do you think this is just a passing trend, or is European cinema truly experiencing a golden age?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jvsptm/have_netflix_co_changed_the_rules_of_the_game_for/"
    },
    {
        "id": "1jvrexc",
        "author": "AfonsoBucco",
        "title": "Any news about speed control to come back?",
        "content": "Yep, like 1.5x or 2.0x you have in many platforms.\n\nI know artists/creators don't like that. But so... they could stop doing lazy telenovelas. I'm not from TikTok generation I have no problem to watch a 3 hours good movie. But when the movie is just half good I want to do this faster.  \n  \nIt's sad it's not available in a service I pay for. I can do that easily in videos I have the archive downloaded. But I have a worse experience paying for a service.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jvrexc/any_news_about_speed_control_to_come_back/"
    },
    {
        "id": "1jvl85h",
        "author": "rachiepants2017",
        "title": "Does anyone else miss Bobby Berk on Queer Eye?",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jvl85h/does_anyone_else_miss_bobby_berk_on_queer_eye/"
    },
    {
        "id": "1jv7nlj",
        "author": "S4v1r1enCh0r4k",
        "title": "Jack Lowden Tipped for Mr. Darcy Role in Netflix's Upcoming 'Pride and Prejudice' Series",
        "content": "",
        "upvotes": 28,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jv7nlj/jack_lowden_tipped_for_mr_darcy_role_in_netflixs/"
    },
    {
        "id": "1jvss3k",
        "author": "Atlast_2091",
        "title": "Resident Playbook | Official Clip | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvss3k/resident_playbook_official_clip_netflix/"
    },
    {
        "id": "1jvp9of",
        "author": "Sk8er_Infinity",
        "title": "Looking for similar shows!",
        "content": "I recently watched “Elves: Secrets of Elvendale” and “Skull Island” on Netflix. Both are animated shows, and are drawn similarly to “Voltron: Legendary Defender”. Does anyone know any shows with this same animation-style or storylines? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvp9of/looking_for_similar_shows/"
    },
    {
        "id": "1jvra9h",
        "author": "shira21",
        "title": "Playback speed control on app speeds up when fingers are on the screen",
        "content": "My toddler will sometimes watch something on Netflix on my phone. She will be holding the phone and her fingers will trigger the speed control to make the video play at 1.5x speed. Is there anyway to turn off this feature so the video doesn't speed up just by her holding the phone and having a her fingers on the screen? Thanks ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvra9h/playback_speed_control_on_app_speeds_up_when/"
    },
    {
        "id": "1jvr4uj",
        "author": "brownha1rbrowneyes",
        "title": "this part of john mulaney's live show this week????",
        "content": "I can't tell if she was being sarcastic??",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xjie5nec9yte1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jvr4uj/this_part_of_john_mulaneys_live_show_this_week/"
    },
    {
        "id": "1jv3e2e",
        "author": "Turbulent-Humor5424",
        "title": "Winner of Million Dollar Secret Finale",
        "content": "YO WHY DID CARA WIN IT BRUH\n\nOk look man I don’t care what any of y’all say, but I think Sam and Cory deserved it way more, like Cara didn’t even have any struggles or previous problems in the game, she got lucky at the end. \n\nAlthough her under the radar type of play was incredibly effective in the end game as it kept her protected in a sense, just the rest of the game she didn’t get a whole lot of screen time or any agendas or literally anything.\n\nDo y’all agree with this?",
        "upvotes": 13,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jv3e2e/winner_of_million_dollar_secret_finale/"
    },
    {
        "id": "1jvfwqr",
        "author": "indiewire",
        "title": "How a Community — and Netflix — Created an Entire Production Ecosystem in Nunavut for ‘North of North’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvfwqr/how_a_community_and_netflix_created_an_entire/"
    },
    {
        "id": "1jvrmym",
        "author": "Electronic-Try2400",
        "title": "Adolescence",
        "content": "Is each episode is filmed in a single take — meaning no cuts or edits, giving the story a raw and real-time feel?\n\nThat means the boy (Jamie) and all other actors had to memorize the entire script",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jvrmym/adolescence/"
    },
    {
        "id": "1juiwlm",
        "author": "ToonAdventure",
        "title": "LOVE DEATH + ROBOTS VOLUME 4 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 137,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1juiwlm/love_death_robots_volume_4_official_teaser_netflix/"
    },
    {
        "id": "1juwjxv",
        "author": "le_disappointment",
        "title": "Recommendations for sad shows",
        "content": "I just finished watching Violet Evergarden. It was absolutely beautiful and heartbreaking. I want to watch more emotionally charged shows and movies. What other shows/movies would you recommend for me? The more devastating, the better",
        "upvotes": 15,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1juwjxv/recommendations_for_sad_shows/"
    },
    {
        "id": "1jv7dmh",
        "author": "Mechy2001",
        "title": "SPOILERS! Question about the Netflix Japanese TV series Asura",
        "content": "In Episode 6, the youngest sister's boxer husband got badly injured. In the hospital, after hugging her, her father left the room and stood guard outside and even stopped a nurse from entering. The youngest sister stripped off her clothes and lay down beside her comatose husband. What is the meaning of this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jv7dmh/spoilers_question_about_the_netflix_japanese_tv/"
    },
    {
        "id": "1jusp24",
        "author": "dragoono",
        "title": "Why is the Netflix redesign so awful?",
        "content": "I didn't see any posts about this so I guess I will. Why does it look like this? Somebody should petition Netflix to go back to the old design. It looks ugly now. ",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jusp24/why_is_the_netflix_redesign_so_awful/"
    },
    {
        "id": "1jv2mde",
        "author": "New-Strength-6448",
        "title": "When I pause netflix and press play the sound comes on but the video won't come back on??",
        "content": "This keeps happening, pause, leave room and come back in. Press play and sound starts but the video doesn't come back on. When I press back the video is there for a second and it goes back to the menu screen. I have to press play again and try to get it to go on. Its very annoying. Anyone else have issues?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jv2mde/when_i_pause_netflix_and_press_play_the_sound/"
    },
    {
        "id": "1juqrfe",
        "author": "shedoesntknowathing",
        "title": "Thoughts on 'The Life List'",
        "content": "okay, in the beginning, i totally loved Brad. I thought he was such a cutie young lawyer who was sincerely interested in Alex's case and helping her with her inheritance. He seemed like a trusted person who he valued her moms wishes for her. HOWEVER.\n\nNina, his girlfriend, was so wonderful and sweet. And the whole time Brad had to play BFF'S with Alex and get WAY too close to her for no reason. I didn't understand why he was so bent on entertaining Alex so much and becoming too friendly with her. She was his client. And he had a great girlfriend (who he seemed like he loved).\n\nAlso the fact that Alex showed no respect for Nina. And how she showed very little remorse for being the reason that Brad could have cheated.\n\nSo no, I was never rooting for Alex and Brad. Though I get why Alex would like him -- he's wonderful, cute, successful, kind, and somehow intertwined with her mom's passing.\n\nI really saw potential for this plot and film. I thought everything her mother said about Alex was true when the film started. That Alex was not truly living her fullest life for some reason. And I think bringing out 'The List' was a wonderful idea. It was poignant, touching, and sweet everything that her mom articulated about what her daughter may not able to see for herself, or ignoring.\n\nHowever, I think that having it become a thing, of now Alex has to go out and achieve every single goal in order to receive her inheritance and videos of her mom pretty strange, and rigid.\n\nPointing out 'The List' was a great thing to do. But not to make Alex go out and do them for a goal. She has to find it in herself, in her time, to do those things. Not for someone else, like a little checklist. But yes, to give a nice acknowledgement and nudge to Alex- I like. I feel like acknowledging 'The List'  was supposed to be about giving a general outline of things that may bring meaning to Alex's life, who seems lost at the time.\n\nI know this was based off a book, and to be fair it was a cute book idea. But seeing it visually made me realize, that some of these things would not work in real life. just my thoughts. what are your thoughts on the movie?",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1juqrfe/thoughts_on_the_life_list/"
    },
    {
        "id": "1juxgg8",
        "author": "Independent_Sound234",
        "title": "Can I share my account if I don’t have wifi?",
        "content": "My girlfriend and I have unlimited data on our phones so we decided to cut the internet at home. Can I still share my account with her? \nWe live together so it is one household",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1juxgg8/can_i_share_my_account_if_i_dont_have_wifi/"
    },
    {
        "id": "1juz7ak",
        "author": "abhilash512",
        "title": "WWE WrestleMania 41: 5 Shocking Returns That Could Steal the Show",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1juz7ak/wwe_wrestlemania_41_5_shocking_returns_that_could/"
    },
    {
        "id": "1jtzxga",
        "author": "MaybeEddy23",
        "title": "What were your thoughts on Netflix's whodunnit series \"The Residence\" set in The White House?",
        "content": "",
        "upvotes": 262,
        "comments": 178,
        "media": null,
        "permalink": "/r/netflix/comments/1jtzxga/what_were_your_thoughts_on_netflixs_whodunnit/"
    },
    {
        "id": "1jud410",
        "author": "Somethingman_121224",
        "title": "Netflix Acquires 'Monopoly' Reality Game Show",
        "content": "",
        "upvotes": 16,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jud410/netflix_acquires_monopoly_reality_game_show/"
    },
    {
        "id": "1juwp33",
        "author": "Educational-Roof2651",
        "title": "Nothing is updating in “continue watching”",
        "content": "When i watch a show on my phone or iPad it never updates in continue watching to the episode im up to so i have to remember and find my current episode, and when i start a new show/movie it doesn’t show up.\n\nBut if i watch on my tv it’s fine and works as it should.\n\nI’ve updated Netflix multiple times since this started happening but nothing has changed.\n\nI don’t know how to fix it, does anyone know why this is happening or how to help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1juwp33/nothing_is_updating_in_continue_watching/"
    },
    {
        "id": "1juk3gh",
        "author": "HANAquax",
        "title": "Comfort show",
        "content": "Hi everyone,\n\nI want a new comfort show to watch on Netflix.\n\nPreferably the show is: \n\n1- American or British \n2- has mostly women characters \n3- realistic and not too silly or cringe \n4- can handle a bit of a drama but I would love something funny \n5- nothing too politically correct \n\nSomething like derry girls or never had I ever shall do. \n\nNote: please recommend as many shows as possible cause some shows aren’t available in my region. \n\nThanks a lot ❤️",
        "upvotes": 5,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1juk3gh/comfort_show/"
    },
    {
        "id": "1jvbbmf",
        "author": "OkDragonfly4098",
        "title": "The helplessness of teachers on Netflix’s Adolescence",
        "content": "\n\n(My perspective as a former teacher—what did you take from the show?$\n\nI recently watched *Adolescence,* a Netflix drama that has been getting a lot of buzz. \n\nIt’s about a 13 year old boy who lost his way. The people who were supposed to be guiding and shaping him dropped the ball, hard.\n\nEpisode 2, a one-shot progression through a chaotic high school environment, gave me flashbacks of my old workplace. The camerawork makes you feel like you’re really there, and all the unhappiness is pressing in on you.\n\nThe teens are *running* that school.  Their disrespect for authority is  on full display, blindingly bright. \n\nThe only rule the students follow is evacuating the building during a fire alarm. Due to the painfully loud alarm, they wouldn’t want to stay indoors anyway.\n\nThe students don’t respect any authority figures—not the teachers, the principal, nor even the police.\n\nWhen the police and school authorities stand in front of a class to give important information about a murder, the students openly mock them. **No consequence** is enforced for their rudeness.\n\nInstead of fighting through lectures in front of defiant students, the teachers have given up. In every classroom the camera passes by, you can hear the students being ✌️taught✌️by videos. “What am I supposed to do?” asks one teacher, who hardly shows up to his own class.\n\nAs the principal hurriedly walks by some loitering students, she chides them to go back to their classroom. They call her a rude name. **No consequences** again—she keeps walking.\n\nEnter Jade, a student and important witness. She rudely refuses to cooperate in a police interview and makes personal insults at the adults. Again, there are **no consequences.**\n\nWhen Jade assaults another student, she gets pulled aside and isolated in a separate room with a minder. The teacher doesn’t act stern or angry with Jade. Instead, she syrup-sweetly asks about Jade’s mum and how she’s feeling. This “Relationship building”(we’ve all been beaten over the head with this phrase) doesn’t stop the attacker from angrily storming out of the room, going back among the other students. The teacher weakly calls after her, “You have to stay with me. You have to.” Apparently, no, she doesn’t. \n\nThese teens don’t have to do anything they’re told to, because they face **zero consequences** for disobeying.\n\nI came away from this episode thinking how differently these kids would act if they’d been brought up from a young age with corporal punishment in schools. Somehow, it’s become fashionable to think negative reinforcement doesn’t work, but the zero guard rails approach isn’t working either.\n\nI’m sure that suddenly re-introducing corporal punishment on a hoarde of disrespectful, violent teens would result in mutual violence and chaos. These kids are too big, too set in their ways, too numerous, and too aware of their own power to be put back in their place. \n\nBut there’s something primal, to a small child, about the exercise of picking your own switch for a teacher to beat you with. Having to stand in front of your classmates and endure it. Having to participate in your own humiliation, because you know something *worse* will be done to you if you don’t comply.\n\nIt creates a deep knowledge of who controls the classroom: adults. Cultures that inculcated their children with this knowledge didn’t produce such a high percentage of unreachable, unteachable teens.\n\nI know it sounds awful to use pain, fear, and humiliation to control kids. Some authorities take things too far, and use discipline as an excuse for sadism. But unfortunately, we’ve seen the culture kids create when we let them control things. It’s anti-intellectual, slothful, disrespectful, hateful, and rife with bullying. They are too young to know what is good for them. \n\nEven some adults would choose terribly if not for law enforcement. Consequences don’t prevent all crime or all disobedience, but it sure does help.\n\nThere are a few kids who are intellectually curious and self motivated. They will master curriculum independently of any environment they’re placed in. But the average kid will go along with what is easiest. Drop them into a hellscape like the one depicted in this show, and there’s no way they’ll turn out educated or with strong character.\n\nThe main character of this show had a void in his life where the guiding adults should be. His parents left him to his own devices. His school environment made it impossible for teachers to guide him. The void was filled with the toxic influences of delinquent peers, bullies, and online hate groups. \n\nThe whole system needs a serious overhaul. Teachers need to be made into authority figures again. That means support from admin in the face of angry students and parents. That means cooperation between teachers, admin, and government to enforce consequences. Maybe that means corporal punishment? Or at least *something.* Most places don’t even enforce detention anymore, as the parents can’t have their work schedules disrupted by an odd pickup time. ",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jvbbmf/the_helplessness_of_teachers_on_netflixs/"
    },
    {
        "id": "1juqse3",
        "author": "Remote-Lecture2192",
        "title": "What is this movie",
        "content": "I remember my sister showed me this netflix original we watched. It was a horror movie in set in the 90s in Mexico about this girl who had 2 younger siblings in which she always took care of them cause her mom was almost never there. They summoned some demon and i remember at some point the little brother accidentally drew some symbol that brought back the demon. I don't remember the name of this movie but I vividly remember it and I can't find it. If someone knows the name, can you tell me?​​",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1juqse3/what_is_this_movie/"
    },
    {
        "id": "1jtjt44",
        "author": "TheMirrorUS",
        "title": "Florida boy's 'violent murder' of teen girl sparks 'real life' comparisons to Netflix's Adolescence",
        "content": "",
        "upvotes": 505,
        "comments": 187,
        "media": null,
        "permalink": "/r/netflix/comments/1jtjt44/florida_boys_violent_murder_of_teen_girl_sparks/"
    }
]