[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 37,
        "comments": 616,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hnjxjj",
        "author": "Robemilak",
        "title": "Netflix execs tell screenwriters to have characters “announce what they’re doing so that viewers who have a program on in the background can follow along”",
        "content": "",
        "upvotes": 254,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1hnjxjj/netflix_execs_tell_screenwriters_to_have/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 778,
        "comments": 661,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1hnds35",
        "author": "StudioJamesCao",
        "title": "I animated Squid Game action figures in stop motion",
        "content": "",
        "upvotes": 51,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vx403pmrvd9e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hnds35/i_animated_squid_game_action_figures_in_stop/"
    },
    {
        "id": "1hnskbp",
        "author": "Ok_Doctor_2057",
        "title": "Why is the streaming quality of movies so bad on mobile?",
        "content": "Very weird and specific issue but whenever I watch a movie on netflix on my phone the quality is always kinda blurry, looks worse than 720p, doesn't happen when I watch any TV show on the same phone and on the same internet and it doesn't happen whatsoever on my PC.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hnskbp/why_is_the_streaming_quality_of_movies_so_bad_on/"
    },
    {
        "id": "1hnnmde",
        "author": "LeBichour",
        "title": "What happened in regards to the quality of Netflix shows these last years ?",
        "content": "I just finished Squid Game season 2 and I really do not understand what is happening at Netflix.\n\nSince 2023, they produced completely terrible seasons of shows that destroyed every single time the subreddits of each of those shows. I’m thinking of : \n\n- Squid Game season 2\n- Outer Banks season 4\n- You season 4\n- The Witcher season 3\n- The Umbrella Academy season 4\n- Sex Education season 4\n- Disenchantment part 5 \n- Virgin River season 6 \n\nDoes someone have an explanation for all of those messes ? Should we be scared for Stranger Things season 5 ?  ",
        "upvotes": 7,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hnnmde/what_happened_in_regards_to_the_quality_of/"
    },
    {
        "id": "1hnu5bo",
        "author": "LatterPick7252",
        "title": "WWE SmackDown - December 27, 2024 | Live on Netflix in Chile, Brazil &amp; Spain",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnu5bo/wwe_smackdown_december_27_2024_live_on_netflix_in/"
    },
    {
        "id": "1hnt8g9",
        "author": "Natas29A",
        "title": "How can I stream Netflix on my 12-year-old Sharp Aquos TV?",
        "content": "Hi everyone!\n\nI have a 46-inch Sharp Aquos TV that I bought around 2010. I've been trying to figure out how to stream Netflix on it, but I'm not sure what my best options are. The TV has some HDMI ports and a USB port. I have an android tablet and an iPad.\n\nI've considered using Chromecast or some other streaming device, but I'd love to hear your thoughts or suggestions. Has anyone managed to get Netflix working on a similar older TV? \n\nFor those who would be tempted to just tell me to buy a new TV : I just want to give a purpose to my TV that have been sitting lifeless on my fireplace for several years, I've figured out that streaming Netflix would be a good solution.\n\nThanks in advance for your help!",
        "upvotes": 2,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hnt8g9/how_can_i_stream_netflix_on_my_12yearold_sharp/"
    },
    {
        "id": "1hn3b1j",
        "author": "Cheddar18",
        "title": "So La Palma absolutely sucked.. what other natural disaster movies or shows should I try next!? ",
        "content": "Talk about plot armor... damn what a disappointment of a show. \n\n\nBut now I'd love to watch any other natural disaster shows or movies- I've seen Greenland so many times but am not sure what else to watch that's actually good. I'd love any recommendations please!! \n\n\nEdit- thank you everyone for the recs, please keep them coming because I love this genre!! I started The Wave 🕺🏻",
        "upvotes": 84,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1hn3b1j/so_la_palma_absolutely_sucked_what_other_natural/"
    },
    {
        "id": "1hntxkj",
        "author": "Spectacularsquid42",
        "title": "Need a good show to binge!",
        "content": "Hey! Me and wifey are looking for a new TV series to binge on we have watched a lot so I’ll reply to comments if I’ve already watched versus trying to remember all the names and listening them. We are pretty open minded when it comes to shows, we have prime and hbo as well! Thank you ! ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hntxkj/need_a_good_show_to_binge/"
    },
    {
        "id": "1hnlewa",
        "author": "amatamasamo",
        "title": "Home screen permanently / only showing me games ",
        "content": "I have seen a few posts in a similar vein, but nothing addressing this exact issue, which is that every single time I open the browser UI, I am only ever shown the insufferable watermelon game. No new releases, no actual film or television recommendations, just this useless, gaudy game that I have zero interest or intention of ever playing. Is this just a me problem, or are others seeing/dealing with the same thing? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnlewa/home_screen_permanently_only_showing_me_games/"
    },
    {
        "id": "1hnt9p5",
        "author": "ArmadilloWild613",
        "title": "Why are the over dubbed sound mixes so bad?",
        "content": "Netflix has a great collection of non US made movies and series, directly produced by them.   The sound mixes for the original language are always 'professional' and sound good.   the translated over dubs all sound like they were recorded in a empty hallway by middle schoolers, and they lay it over the folly track and music track changing the feel of the work.   Clearly the original vocal tracks are all 'voice overs' or ADR and the foley track and music track are all separate from whatever was mic'd during the shoot.  so why couldn't they do the same mix with the translated voice over track.  the mix should have same 'feel',  but when I switch between them its comically different.   ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnt9p5/why_are_the_over_dubbed_sound_mixes_so_bad/"
    },
    {
        "id": "1hnncr2",
        "author": "randomguy0952",
        "title": "Why does Spy x family not appear on my netflix?",
        "content": "I've been waching spy x family on my home country, That's when I moved to qatar, The problem is I can't find spy x family in netflix it's only the movie. I really wanted to finish the whole season can someone please help?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnncr2/why_does_spy_x_family_not_appear_on_my_netflix/"
    },
    {
        "id": "1hn4upw",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2",
        "content": "",
        "upvotes": 47,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4upw/squid_game_season_1_vs_season_2/"
    },
    {
        "id": "1hnrrs3",
        "author": "No_Entertainment8792",
        "title": "Squid Game Season 2 Shouldn’t be judged",
        "content": "Season 2 of squid games was good imho. I thought it was not as great as season 1 but also season 1 is low key a masterpiece so there is no topping that. I know I just judged this season but I feel like personal I can't fully give my opinion on this season until the next one drops. This is because the season ends on a cliffhanger and it feels like season 2 and 3 are meant to be judged together. That's why when I watch the next season I am going to look at it as if it's season 2 b and then I will be able to formulate a proper opinion on this season.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hnrrs3/squid_game_season_2_shouldnt_be_judged/"
    },
    {
        "id": "1hnr9p8",
        "author": "emofem22",
        "title": "Movie help",
        "content": "Hey guys, I remember watching a hand drawn/painted animated film on UK Netflix a few months ago and I’m having a hard time remembering what it was called and I’m also struggling to remember what it was about, if anyone could help me I would really appreciate it. Thanks :) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnr9p8/movie_help/"
    },
    {
        "id": "1hnqzdo",
        "author": "ainaraaaaa",
        "title": "why is there ALL of SNK on netflix except the last episode ? ",
        "content": "i just watched all of Attack on titans on netflix (france), glad there was all the seasons, i’m going in for the last episode, and find out it’s, in fact, not the last one ? i looked it up and the last episode (that’s on two parts) is missing. \n\nwhy is that ? if everything else is there why not letting us watch the literal conclusion to almost 90 episodes ? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hnqzdo/why_is_there_all_of_snk_on_netflix_except_the/"
    },
    {
        "id": "1hntoou",
        "author": "tiZyfuZ",
        "title": "Why is landscape only a thing?",
        "content": "My main media consumption platform is an ipad mini and i love it. I pretty much exclusively use it in portrait mode. Its easy to hold that way. Also, when  in bed, i like to have it beside me and the portrait mode feels natural to look at. most platforms like yt, prime, disney support this, but some do not. netflix is one of them. i cant be the only one bothered by that. or is this really such a niche thing, that this use case is not supported although technically it should be easy to implement?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hntoou/why_is_landscape_only_a_thing/"
    },
    {
        "id": "1hntl2b",
        "author": "hockeyboi604",
        "title": "Why does Netflix send a \"comeback and resubscribe\" email every 2-3 days?",
        "content": "I know I can unsubscribe.\n\nBut I find it a bit odd that a company would send a resubscribe email every 2-3 days. \n\nMaybe every week or two would be a bit more appropriate.\n\nBeen going on for a couple of months now.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hntl2b/why_does_netflix_send_a_comeback_and_resubscribe/"
    },
    {
        "id": "1hnogtm",
        "author": "Much-Presentation974",
        "title": "Anyone had this issue before?",
        "content": "I can stream multiple series on my phone but not Squid game Season 2. Season 1 works. It works also on TV, but not on mobile. Better call Saul works perfectly fine, so it's not the age restriction. It just says \"loading\" for minutes.\n\nI already tried this:\n\n1. Switchting to mobile data instead of Wi-Fi\n2. Deleting Cache\n3. Turn phone off/on\n3. Reinstalling the App\n\nAnyone had a similar issue or maybe a new solution?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnogtm/anyone_had_this_issue_before/"
    },
    {
        "id": "1hnhvwd",
        "author": "Jason1088S",
        "title": "App long starting/loading time ",
        "content": "Hi,\nI have an Apple TV and it is connected via Ethernet cable. My connection is Like 1000mbits. Im using a unifi-setup.\n\nNetflix is the only App which starts very slow. Every other App is starting normally. \n\nAfter I Open the App all I See is the red „N“ with the loading Circle underneath and then proceed to the accounts. Takes forever to load. \n\nCan someone help me out or knows a solution for this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnhvwd/app_long_startingloading_time/"
    },
    {
        "id": "1hnlh3z",
        "author": "sonofdeepvalue",
        "title": "How to force 4K playback on Apple TV 4K",
        "content": "I generally get 4K playback but sometimes I notice the label during playback is \"HD\" instead of 4K + Dolby Vision on a given title that supports 4K and Dolby Vision e.g. Squid Game. I'm wanting to prefer 4K even if Netflix thinks it will result in buffering for any reason. Note:\n\n1. I generally get 4K playback on this device so I don't believe there is a device, cable, or TV issue\n2. [Fast.com](http://Fast.com) says my speed is 770 Mbps, which should support 4K playback\n3. My setting at \\`https://www.netflix.com/settings/playback\\` for \"Data usage per screen\" is set to \"High\"\n\nTL;DR wanting to avoid these seemingly random scenarios where playback quality drops to HD for any reason. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnlh3z/how_to_force_4k_playback_on_apple_tv_4k/"
    },
    {
        "id": "1hnrn92",
        "author": "Fit-Solid-8023",
        "title": "Squid Game 2: The Voting – A Step Down in Quality",
        "content": "Season 2 could be more aptly named Squid Game 2: The Voting.\n\nIt’s evident that Season 1 was originally intended to stand alone as a well-crafted story. However, the commercial success of the series seems to have driven the decision to prolong it, resulting in a less organic continuation.\n\nThe voting scenes are excessively drawn out, feeling more like filler to extend the runtime than meaningful content. \n\nThe music in Season 2 has also taken a dramatic shift, attempting to inject a sense of comedy into the show. This feels completely out of place, especially when compared to the darker, more atmospheric music of Season 1, which enhanced the tension and served the narrative. Now, the music turns pivotal moments into something childish, undermining the tone that made the original season so compelling.\n\nAdding to the decline, the new actors and actresses often overact, making their performances feel unnatural and unconvincing. This exaggerated acting further detracts from the immersion and realism that Season 1 excelled in delivering. \nOverall, Season 2 feels like a significant step down in quality.\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnrn92/squid_game_2_the_voting_a_step_down_in_quality/"
    },
    {
        "id": "1hn5wuw",
        "author": "SF6-Manon",
        "title": "SPOILER: My thoughts on Squid Game Season 2",
        "content": "I'm not going to go super in-depth or make this spoiler-heavy but I thought I'd give my honest review on season 2 so... let's begin.\n\nFirst off, what would I rate this season? In comparison to the first season, I'm going to be generous and give it a 6/10. The pacing of the show felt slow at first. Starting off with scenes of Seong Gi-Hun then fast forwarding 2 years later. Pretty much emphasizing that Gi-Hun's on the hunt for the front man/the one in charge of the games to begin with. Puts up money and sends grunts to go on a wild goose chase to find the recruiter he came across in the subway back in season 1. After a long 2 years, they finally spot the recruiter then secretly follows him but things don't go as planned. Stuff happens, Gi-Hun then formulates a plan which failed and now we end up with end getting back into the game. Pretty much the \"I will find you, and I will kill you\" cliche except he doesn't plan on killing the head??... so... yeah. I'll leave it at that.\n\nNow that that's out of the way, let's fast forward. The failed plan that became an even bigger fail since there was a snake amongst him as he planned on going in and infiltrate the island with a group of people. This was realized during the first game that his backup no longer had a trace on him so his backup is... well... back on another goose chase. But instead of finding the recruiter, they're trying to find the island. And that's pretty much all we got out of them. Again, I'm not trying to spoil much.\n\nDuring the first game, Gi-Hun insists on helping everyone make it out in one piece. A lot more survived this time around compared to season one. Cool. After this, we now have a better look at the new players, a lot of which, are either just wimpy or plain annoying/obnoxious. Season 1 had its annoying characters too but they were done in a way where it felt just right and not over the top. A ton of \"high school bully\" type of characters. The new player(s) that were written well enough was the mom &amp; son duo. That's all I can say about the characters.\n\nNow, onto the primary reason people are watching season 2, the games. We're first introduced with red light green light since it's a staple of the show. The games that followed after that were different which was quite nice. But that's where it kind of stops being nice. The game now introduced a new thing where players could vote to either stay or leave after EACH game. If I'm going to be honest, I feel like this took away what made season 1 so good. The weight/burden of choice. In season one, players had only ONE opportunity to vote, it made scenarios a lot more impactful and gave the players an option of joining. With that, players bared the weight of \"the point of no return\". Once you were in, you're staying until the end. In this season, with players given the option to vote after every round, it eliminated that impact and made it more of a \"Don't join them, join me\" ordeal. Pair that with the high school bullying, you're left with kinda of an \"meh\" feeling. There isn't much fear since players can just stay for the money or they'll just pair with Gi-hun since he's played the game before. Follow the leader. \n\nOnce the games began, the pace suddenly sped up, leaving less room for you to have any sort of attachment to some characters. The games felt rushed/sped up making them not as fun and suspenseful to watch. With that, we're then back to scenes with Gi-Hun's muscle for hire are still looking for a way in and very little clue as to what's up with Triangle 11. The ending, being Gi-Hun's final plan which ALSO fails. Lots of gun fire, players are \"offed\", aaaaand we're left with a cliffhanger. \n\n  \nHonestly, I would have preferred they made an additional 2-3 episodes to flesh it out a bit more and conclude it all as a whole but nope... many questions a left unanswered and it seems we may have to wait for season 3. Wasn't a bad season, but it wasn't exactly great either. To those who are well-versed with celebrities in K-POP, you may enjoy it a bit more, maybe. Even then, it was okay. I'm not sure if I'll stick around for season 3 but yeah... what are your thoughts?",
        "upvotes": 10,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hn5wuw/spoiler_my_thoughts_on_squid_game_season_2/"
    },
    {
        "id": "1hnigwr",
        "author": "Chucky949208",
        "title": "Is anyone having problems with netflix?",
        "content": "So the last couple days think this started Christmas day, we have been having issues with netflix. I went to put on paw patrol for my toddler and his continue watching shows were not showing, when I searched paw patrol it came up add to wish list. Same is happening with other shows and not just on his profile but on my in laws profile and my profile and my husbands. We have checked all tvs and phones and same problem is happening. My mother in law wanted to watch a film the other day and it came up add to wish list. Has anyone else had this problem and if so how did you solve it? We have logged out, uninstall edited the app, restored phones and tvs and the problem is still occurring. Any help would be appreciated. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hnigwr/is_anyone_having_problems_with_netflix/"
    },
    {
        "id": "1hnie9o",
        "author": "More-Ad7683",
        "title": "If I downloaded a film and it leaves Netflix today can i access it after it leaves?",
        "content": "If I download a film from Netflix and it’s set to leave the platform today, will I still be able to access it afterward? If so, for how long can I watch it?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hnie9o/if_i_downloaded_a_film_and_it_leaves_netflix/"
    },
    {
        "id": "1hn9l0b",
        "author": "EvelynClede",
        "title": "Squid Game's Season 2 - A Comprehensive Overview",
        "content": "",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hn9l0b/squid_games_season_2_a_comprehensive_overview/"
    },
    {
        "id": "1hnfpq9",
        "author": "LatterPick7252",
        "title": "WWE RAW | LIVE on Netflix | Starting January 6",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnfpq9/wwe_raw_live_on_netflix_starting_january_6/"
    },
    {
        "id": "1hnajhg",
        "author": "mister_alma_raynard",
        "title": "problem with netflix on my browser",
        "content": "hi, so am using my netflix on browser and many movies dont appear that ive seen previosly. example i wanted to watch babylon. it aint there after i search. if i go to my mobile its there. i tired a different browser and same problem.\n\nsome more movies where is problem occurs are the other guys, gifted, the interview.........and so on\n\nive added these movies to my list before in the browser itself and one day many movies just dissapear. i tried searching them as well but they dont appear. any fix?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnajhg/problem_with_netflix_on_my_browser/"
    },
    {
        "id": "1hmi2o0",
        "author": "Robemilak",
        "title": "Adam Sandler Shares the First Teaser for Netflix's Sequel ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 253,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1hmi2o0/adam_sandler_shares_the_first_teaser_for_netflixs/"
    },
    {
        "id": "1hmqmv2",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Movies Coming in 2025",
        "content": "* **Back in Action (January 17)**\n* **The Electric State (March 14)**\n* **Wake Up Dead Man: A Knives Out Mystery (2025)**\n* **The Old Guard 2 (2025)**\n* **Fear Street: Prom Queen (2025)**\n* **The Life List (2025)**\n* **Frankenstein (2025)**\n* **Happy Gilmore 2 (2025)**\n* **Havoc (2025)**\n* **Plankton: The Movie (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/) **|** [**Anticipated Netflix Shows**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/)\n\n",
        "upvotes": 36,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqmv2/10_highly_anticipated_netflix_movies_coming_in/"
    }
]