[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1hgrwf9",
        "author": "Frosty_Substance_293",
        "title": "Italian Interview",
        "content": "I am a high school student in the US and I have a school project to interview someone that grew up in Italy. The questions will be about your country’s culture and way of life.\n\nIf you are interested please respond and I will dm you the questions. If you have any questions feel free to ask.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hgrwf9/italian_interview/"
    },
    {
        "id": "1hgphb0",
        "author": "mango_fiero",
        "title": "Locale noir a Torino ",
        "content": "Conoscete un locale che incarna lo spirito noir a Torino? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hgphb0/locale_noir_a_torino/"
    },
    {
        "id": "1hg8or1",
        "author": "dkroods",
        "title": "📢🚈🚊Next update Take It Easy Torino",
        "content": "Ciao ragazzi, abbiamo scritto questo post per chiedere a comunità per il prossimo aggiornamento del’app Take It Easy Torino, noi pensavamo di aggiungere un nuovo sezione (tab) sotto per avere tutta la lista delle trasporti pubblici tipo\n___________\nM1\n___________\n1\n___________\n2\n___________\n3\n___________\n4\n___________\n….\nE per ogni uno dare la possibilità di aprire la mappa per vedere tutto il percorso in mappa real time.\nCosa pensate?\n\nPotete anche scrivere vostri 💡 idee!\nGrazie a tutti!!\n\nSe non avete ancora scaricato l’app Tale It Easy Torino \nEcco il link Android: https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app",
        "upvotes": 9,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lowt03i5ae7e1.jpeg?auto=webp&amp;s=f0856cfce673692032731f91c1f2ad983f4926ad"
        },
        "permalink": "/r/torino/comments/1hg8or1/next_update_take_it_easy_torino/"
    },
    {
        "id": "1hg936j",
        "author": "Pleasant_Feeling_553",
        "title": "Jobs for international students",
        "content": "hello everyone, do you know any jobs that are suitable for international students in torino?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hg936j/jobs_for_international_students/"
    },
    {
        "id": "1hg5gza",
        "author": "daccia",
        "title": "Filigrana a Torino",
        "content": "Ciao, \nTrovo bellissimi i gioielli in filigrana che fanno in Sardegna e Portogallo, a qualcuno è capitato di trovarne a Torino?\n",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g8nfqa5o2d7e1.png?auto=webp&amp;s=c08c6bb13b7281687fba5446550c35005feda846"
        },
        "permalink": "/r/torino/comments/1hg5gza/filigrana_a_torino/"
    },
    {
        "id": "1hfp09q",
        "author": "Next_Blueberry1984",
        "title": "Anelli maschili Torino ",
        "content": "Ciao, devo fare un regalo di Natale al mio ragazzo e pensavo di comprare un anello artigianale. Mi potreste consigliare qualche negozio di bigiotteria maschile che non sia troppo costoso? Grazie!",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hfp09q/anelli_maschili_torino/"
    },
    {
        "id": "1hfh6dr",
        "author": "Petboy241",
        "title": "Cosa portare a casa di tipico per Natale",
        "content": "Ciao a tutti, sono l'ennesimo fuorisede che torna a casa per Natale. Vorrei portare qualcosa di tipico di Torino da far assaggiare a casa, ma non so bene cosa scegliere ne dove acquistarlo.\n\nGuardando online ho trovato un paio di raccomandazioni, come i gianduiotti o i torroni, ma volevo sapere se c'è qualcos'altro di meno conosciuto, magari una di quelle chicche che solo i torinesi doc possono consigliare.\n\nInoltre mi devo subire un viaggio non indifferente per il ritorno, quindi c'è da tenere a mente che il prodotto sia trasportabile e che duri fuori dal frigorifero. ",
        "upvotes": 11,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1hfh6dr/cosa_portare_a_casa_di_tipico_per_natale/"
    },
    {
        "id": "1hfdwoq",
        "author": "ThrowRA2947492o282",
        "title": "persone nerd/metallare a Torino?",
        "content": "Sono una ragazza di 17 anni e vorrei conoscere più gente con i miei interessi, preferibilmente di Torino o d'intorni così anche da poterci vedere. Mi piace il metal, i videogiochi, gli horror, i giochi da tavola e il fantasy. Il genere della persona mi è indifferente.\n\n(scusate per l'account di merda che sto utilizzando è l'unico che ho)",
        "upvotes": 16,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1hfdwoq/persone_nerdmetallare_a_torino/"
    },
    {
        "id": "1hfqe3z",
        "author": "No-More-Blue",
        "title": "Mi consigliate una buona palestra in zona centro/S.Giulia?",
        "content": "Sto cercando un buon posto per iniziare ad allenarmi da gennaio, ho visto che la solita arancione è un po' fuori mano, in quella zona ci sono valide alternative? (Non troppo dispendiose s'intende).",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hfqe3z/mi_consigliate_una_buona_palestra_in_zona/"
    },
    {
        "id": "1hfp1k3",
        "author": "ilcornalito",
        "title": "Cena Della vigilia",
        "content": "Consigli per un buon ristorante con cena della vigilia di Natale per una famiglia con bambini? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hfp1k3/cena_della_vigilia/"
    },
    {
        "id": "1hfhh3x",
        "author": "Bright-Ice989",
        "title": "Raccolta rifiuti a Torino centro (Vanchiglia)",
        "content": "Ciao a tutti, sono uno studente fuorisede appena trasferito a Torino e sto cercando di capire come funziona la raccolta dei rifiuti, in particolare nella zona di Vanchiglia.\n\nHo notato che ci sono cassonetti dell'indifferenziata in strada, ma non mi è chiaro se si faccia anche la raccolta differenziata e, se sì, come e dove. Per esempio, carta, plastica e organico vanno separati e conferiti in contenitori specifici? Oppure qui nel centro si usa prevalentemente il sistema dei cassonetti dell'indifferenziata?\n\nSe qualcuno ha indicazioni precise o può condividere un link utile al regolamento locale, gliene sarei davvero grato.\n\nGrazie mille in anticipo!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hfhh3x/raccolta_rifiuti_a_torino_centro_vanchiglia/"
    },
    {
        "id": "1hf04yk",
        "author": "Dr_Funkmachine",
        "title": "Conoscere persone a Torino",
        "content": "Ciao a tutti, sono un ragazzo di 29 e vivo a Torino da quasi 6 anni. Sono abbastanza introverso. Mi piace uscire ma spesso oltre agli amici conosciuti nel corso di questi anni, non riesco a fare amicizia. Credo che sia dovuto al fatto che comunque non esco spesso e tendo a fare le solite cose. Ho molti interessi, ma a volte quando so di dover fare qualcosa da solo perdo gli stimoli e tendo a non fare.\n\nCosa fate a Torino per conoscere nuove persone?\n\nUn saluto, grazie a tutti in anticipo",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1hf04yk/conoscere_persone_a_torino/"
    },
    {
        "id": "1hf0nz7",
        "author": "emish89",
        "title": "Panettone migliore di Torino",
        "content": "Ciao a tutti, sono torinese d’adozione da diversi anni e ho già comprato vari panettoni artigianali negli anni.\n\nVolevo chiedere quale fosse per voi il migliore, per aprire un po’ la discussione (perché dovrò comprarne uno per genitori e suoceri come da tradizione).\n\nIo ho provato la famosa nuvola di Ghigo e non fa per me. Troppo dolce, troppo lattosa… non è la mia.\n\nHo provato Iginio Massari l’anno scorso e l’ho trovato veramente buono, è il papabile se non trovo alternative.\n\nStratta anche molto buono, però i suoceri avevano preferito Iginio nel blind test 😄\n\nAvevo comprato anche da Sacco in corso de Gasperi e in vari altri posti, alcuni buoni altri meno buoni. \n\nPerò non essendo vero torinese mi aspetto sempre che ci sia qualche perla nascosta, conosciuta solo dalle sciure doc, che fa il ‘vero panettone’.\n\nPs: non cerco panettoni aromatizzati o altro per via di intolleranze varie. Al massimo la variante ‘al cioccolato’. ",
        "upvotes": 11,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1hf0nz7/panettone_migliore_di_torino/"
    },
    {
        "id": "1hf7th2",
        "author": "No_Effect5229",
        "title": "SOS cerca struffoli (pignolata)",
        "content": "Ciao a tutti. It’s struffoli season!\n\nLi sto cercando da una settimana e non li trovo da nessuna parte. Vi prego: dove li posso comprare in centro? Sono disperata! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hf7th2/sos_cerca_struffoli_pignolata/"
    },
    {
        "id": "1hezgv5",
        "author": "LostInMyLoneliness",
        "title": "AIUTO PER CASA A TORINO!!",
        "content": "Scrivo questo post perché ho intenzione di trasferirmi a Torino dopo aver fatto la maturità. Ho bisogno di consigli sul trovare appartamenti in affitto a Torino in zone tranquille e vicino a mezzi di trasporto. Ho iniziato a guardare su qualche sito (ad esempio Idealista, Immobiliare.it ecc..) ma vedo già da adesso che molti appartamenti costano davvero troppo oppure hanno complicanze riguardo alle spese condominiali e cose varie. Qualcuno per caso conosce anche agenzie immobiliari (che non siano scam) a cui rivolgersi? Oppure qualcuno che sappia consigliarmi e che è più ferrato in questo campo?? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hezgv5/aiuto_per_casa_a_torino/"
    },
    {
        "id": "1hetmph",
        "author": "Pollofifo03",
        "title": "Raccolta Rifiuti",
        "content": "Ciao a tutti, per quelli di zona Via Onorato Vigliani, sapete mica dirmi in che giorni vengono a prendere la plastica, l'umido ecc...? (Ho provato a guardare nel sito dell'Amiat ma non mi fa entrare, dev'essere in manutenzione)",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hetmph/raccolta_rifiuti/"
    },
    {
        "id": "1heolih",
        "author": "Muted-Dependent-9873",
        "title": "Capodanno a Torino",
        "content": "Buongiorno, qualcuno può consigliare qualche locale per cenare a Capodanno? Poi, un altro locale per il dopocena con un po' di musica dove si può bere.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1heolih/capodanno_a_torino/"
    },
    {
        "id": "1hegjpd",
        "author": "LuxJupiterian",
        "title": "Esiste un canale/sito che elenchi Stand Up Comedy ed eventi culturali in generale a Torino?",
        "content": "Mi riferisco ad eventi come Stand Up Comedy, eventi teatrali, mostre, live music ecc... \n\nA Bologna seguivo un canale Telegram che indicava settimanalmente tutto ciò ed era una figata.\n\nGrazieee",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hegjpd/esiste_un_canalesito_che_elenchi_stand_up_comedy/"
    },
    {
        "id": "1heshzp",
        "author": "No-Adhesiveness9120",
        "title": "torino torino torino",
        "content": "ma gwnte di torino nerd ragazzini DOVE VI TROVATE come si fa amicizia…… ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1heshzp/torino_torino_torino/"
    },
    {
        "id": "1heak23",
        "author": "AnyBill9251",
        "title": "Qualità della vita a Torino",
        "content": "Chi ha voglia di raccontarmi la vita a Torino sotto tutti i punti di vista?",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1heak23/qualità_della_vita_a_torino/"
    },
    {
        "id": "1he594p",
        "author": "catdestroyerrr",
        "title": "Visiting Turin for the first time",
        "content": "Hi people, we are 22M and 24F visiting Turin next week. We would like to explore the city from a local’s perspective and don’t want to do touristy things. \n\nOpen to food, bars, nightlife, etc. We would like to connect with some locals as well, if you’re in the city and would like to tag along feel free to dm! \n\nOpen to hear some tips for first timers! \n\n",
        "upvotes": 3,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1he594p/visiting_turin_for_the_first_time/"
    },
    {
        "id": "1hecb82",
        "author": "ChillDudeTwenty2",
        "title": "mi potreste raccomandare un negozio per gli amanti di anime e manga per favore?",
        "content": "devo cercare un regalo per una persona che è appassionata di anime e manga. non necessariamente un albo, magari una action figure o altri articoli. c'è una fumetteria particolarmente fornita di giochi e action figures o un negozio dedicato a comics e manga a Torino e cintura?\n\ngrazie in anticipo",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hecb82/mi_potreste_raccomandare_un_negozio_per_gli/"
    },
    {
        "id": "1hdzcm9",
        "author": "Ajryan120",
        "title": "Consigli per cercare case in affitto a Torino ",
        "content": "Salve, mi sono trasferito da un po' a Torino e stavo cercando un bilocale in affitto per una coppia. Non cerco chi sa che. Il problema che online è tutto una truffa che chiami e ti dicono che per una somma di tot ti fanno accedere ai loro database. Manco fossero l'FBI. \nQuindi mi chiedevo è più facile se vado in qualche agenzia immobiliare o mi devo mettere quando ho tempo a cercare casa da solo. Un saluto a chi sta cercando casa come me o ci è già passato.",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1hdzcm9/consigli_per_cercare_case_in_affitto_a_torino/"
    },
    {
        "id": "1he3xjm",
        "author": "Matte_D19",
        "title": "Vendere cose da moto usate ",
        "content": "Ciao a tutti,\nMio papà ha ancora molte cose da moto (giacche, caschi) che però non usa più dato che ha venduto la moto. Ho provato a vedere su Vinted ma essendo tante cose le vorrei vendere anche tutte insieme, piuttosto perdendoci. Conoscete dei negozi che potrebbero fare al mio caso?\nGrazie",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1he3xjm/vendere_cose_da_moto_usate/"
    },
    {
        "id": "1he0u89",
        "author": "King_of_Tavnazia",
        "title": "Minigolf al coperto a Torino?",
        "content": "Qualcuno conosce un minigolf al coperto decente a Torino?\n\nGoogle continua a riportare i soliti due che sono però all'aperto.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1he0u89/minigolf_al_coperto_a_torino/"
    },
    {
        "id": "1he1nay",
        "author": "Hyzev_",
        "title": "Aule studio notturne",
        "content": "Ciao ragazzi, ispirato da un post precedente volevo chiedervi se conoscete delle aule studio aperte fino a tardi, sono uno studente lavoratore unito che non ha mai frequentato",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1he1nay/aule_studio_notturne/"
    },
    {
        "id": "1hd9v0i",
        "author": "KalebMorrison1",
        "title": "|||||||||| Gentrificazione in corso, please wait...",
        "content": "Questa mattina ho fatto un errore madornale. Non ero concentrato su cosa stessi facendo e ho aperto Instagram. Non apro mai instagram.\n\nImmediatamente sono stato messo al cappio da un paio di reel divertenti e infine l'indomabile algoritmo mi ha inferto la stoccata finale con il video di una influencer canadese che illustrava ai suoi stalkers i motivi per cui è venuta a vivere a Torino.\n\nIl motivo reale (affitti più bassi della media della grandi città italiane) è sempre accompagnato da qualche motivo satellite volto a illudere sé stessi e gli altri d’essere più furbi della media e non semplicemente dei poveri, che qua – e specialmente su Instagram – non si può essere poveri.\n\nNel guardare il reel srotolarsi un paio di volte, ho sentito il sangue ribollire come ragù, mentre uno sviluppatore di Meta riceveva nel frattempo un bonus produttività.\n\nMi sono tornati in mente i palazzi del Centro e di Sansalvario che negli ultimi anni ho osservato essere venduti ad agenzie che li ristrutturano, gli affibbiano un nome che dovrebbe dargli dignità come “Nizza 68” o “Belfiore 7”, fanno lievitare il prezzo e cercano di ingolosire questo sottoinsieme di borghesi.\n\nIl Circo è arrivato in città.\n\nPasseggiando su Via Madama Cristina, due o tre mesi fa, noto l’ennesimo palazzo svuotato in ristrutturazione. Guardo attraverso le finestre che danno su appartamenti vuoti e mi chiedo: ”Chissà dove sono le persone che abitavano qui”.\n\nIeri, durante l'aperitivo di Natale, una collega che abita in Santa Giulia mi racconta di aver ricevuto una notifica di sfratto dalla casa in cui ha abitato negli ultimi ventiquattro anni. Il padrone di casa ha venduto l’appartamento a un’agenzia che ristrutturerà l’immobile e lei ha tre anni di tempo per trovarsi una nuova sistemazione. Ha cominciato a dare un'occhiata in giro ma ovviamente nessun appartamento ha un affitto paragonabile a quello che pagava attualmente. \n\nIl Circo è arrivato in città.\n\nQuando si candidò l’Appendino non la votai. Mi ricordo, sì, che diceva di volere che Torino restasse ai torinesi. Diceva di volerla difendere da un PD che aveva in progetto di svenderla agli investitori, come era stato fatto per Milano e Firenze. Ricordo che ho anche riso con i miei amici di queste affermazioni. \"Se Torino diventa un centro di attrazione come Milano, ancora meglio!\"\n\nIl Circo è arrivato in città.",
        "upvotes": 81,
        "comments": 62,
        "media": null,
        "permalink": "/r/torino/comments/1hd9v0i/gentrificazione_in_corso_please_wait/"
    },
    {
        "id": "1hde62f",
        "author": "Meiyo_ayoo",
        "title": "INCONTRO IL SINDACO (finito male)",
        "content": "Buongiorno miei fieri destrieri torinesi! Oggi sono qui per riportarvi gli annunci e le parole del grande Sindaco. Prima di iniziare vi chiederei perdono perché c’è stato un miss-understanding con la mia scuola e l’incontro si è svolto oggi. Dunque senza ulteriori indugi inizierei con gli spoiler… ma prima SIGLA!\nsigla*\n•Metro 2; ebbene sì ragazzi, avremo un’altra metro e i lavori inizieranno nel 2025. Il prodigioso Sindaco dice che sarà il più grande lavoro dell’Italia nord-ovestiana.\n•Eventi sportivi; nei prossimi anni ci saranno un bel po’ di eventi sportivi, tra cui le Olimpiadi invernali e le Nitto ATP finals.\n•Progetto a barriera; per tutti gli abitanti di barriera è un ottimo annuncio e investiranno un bel po’ di soldi.\n •Euro Pride 2027; per fare contenti tutti beccatevi sta notizia\n•nuovi progetti; tanti bei progettini che sono:\n-progetto parco Valentino\n-ospedale nuovo torino nord (lavori per il 2025/6)\n-parvo della salute in zona lingotto\n-via roma pedonale (si, diventa zona pedonale)\n-lavori in piazza baldissera (2025)\n-lavori piazza bengasi (2025)\n•Digital Twin; sarebbe una mappa 3D di Torino… stay tuned.\n•NUOVI BUS!; il nostro grandissimo Sindaco dice che arriveranno pullman nuovi, elettrici e saranno belli puliti e spera di risolvere il problema con la puntualità (facendo anche una battuta ma la eviterei).\n•CHIUDIAMO LE BUCHE!; eccerto amici miei, anche qui la battuta non è mancata ma il superbo Sindaco dice che chiuderanno ste buche (tanti soldini mannaggia).\n•Riqualificazione edifici; entro il 2030 verranno riqualificati un sacco di edifici e usati terreni inutilizzati per zone verdi ecc.\n\nRagazzuoletti miei questo è più o meno tutto perché si, manca qualcosa, ma è davvero tutto quello che c’era di più importante. Ci terrei a fare un appunto su due cose. La prima sono le OGM che FORSE verranno riqualificate perché il sindaco dice non essere territorio comunale ma proverà a inventarsi qualcosa. Seconda cosa sono i mezzi di trasporto da poveri, cioè i monopattini e le bici (sto scherzando amici solo che non so come chiamare quel genere di mezzi) che a detta sua sono e saranno resi più sicuri con l’avvento di nuove ciclabili.\nDetto questo amici vi lascio per qualche altro annetto dicendovi che mi sono letteralmente aperto il dito mentre scrivevo perché sono caduto e che il nostro Superbo e Stimabile Sindaco è una persona davvero gentile e disponibile (non per leccare l’anus). \nAdios amigos torinesos",
        "upvotes": 19,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1hde62f/incontro_il_sindaco_finito_male/"
    },
    {
        "id": "1he722i",
        "author": "Sorry_Carrot7537",
        "title": "gente con cui uscire anche sta sera",
        "content": "ciao, non sono di Torino però per il momento ci vivo praticamente, ho 19 anni e boh mi piacerebbe conoscere qualche ragazza con cui uscire, nessun doppio fine chiarimente, l'importante è che sia gente seria e rispettosa",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1he722i/gente_con_cui_uscire_anche_sta_sera/"
    },
    {
        "id": "1hdg5my",
        "author": "Anonymous_77_",
        "title": "Looking for a job",
        "content": "Hello everyone I’m a student in torino and I’m looking for a job urgently because I’m financially unstable. Also I dont speak italian that well so if anyone knows anything please feel free to tell me. ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hdg5my/looking_for_a_job/"
    }
]