[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 196,
        "comments": 722,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o5g2ay",
        "author": "T-tail88",
        "title": "Ed Gein story...how did the people in the town not know his mother was dead?",
        "content": "She dropped dead in front of two other people and then they had a graveside service for her. Not to mention her tombstone in the cemetery.  Does no one pay attention to anything in that town? ",
        "upvotes": 52,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1o5g2ay/ed_gein_storyhow_did_the_people_in_the_town_not/"
    },
    {
        "id": "1o5lhc0",
        "author": "The_Outsider27",
        "title": "The BTK Killer and Legacy of Familial Dysfunction/Trauma and Denial",
        "content": "Just finished watching. First I feel bad for his daughter Kerri and can see the turmoil and how he is still haunting her. Judging from the postings here, many have been harsh on her. She does look a lot like him and I am sure is suffering from the guilt of knowing she lived with a killer and could not save those women, is carrying his DNA which helped find him. Lots of complicated feelings. I respect her for expressing herself publicly. I am not sure if that is the BEST way to move on but I do feel she is sincere about her reason for doing this and it is not for profit. She is a victim too.  She has kids and likely this has impacted negatively her ability to earn a living in the same way most of us do. \n\nCan you imagine seeing yourself referenced in your serial killer dad's notes?  I also heard that Gary Ridgeway, the Green River Killer actually had his son in the car when he picked up some of his victims.  \n\n\nWhat I don't understand is how could she and her mom not find the stuff in the shed. The kill kit in the house could just be tools etc. I have duct tape and rope string etc in a closet and I am not a killer. But the stuff in the shed is bizarre. He also stalked many of his victims for endless hours sometimes at like 3am. Did his wife not notice him missing or soiled clothes, smells, the jewelry.  To sit on the couch and say to him \"He writes like you.\"   WTF?   Reminds me of that movie \"The Dead Girl\" with Brittany Murphy where this one woman played by Piper Laurie , realizes that her husband is a serial killer when she finds all that stuff in the storage shed.   BTK's wife had to know something was amiss. \n\nEven Ted Bundy's girlfriend was one of the anonymous callers to tip police about him. \n\nBTK's  words when he was caught were \"Tell my wife I won't be home for lunch.\"  \nOn its face sounds harmless enough but to me that sounds like a code. Could she have known and was in some sort of Stockholm syndrome hold with him? \n\nI also find BTK odd in that several times he killed with children present. Stalked women who were home alone with small kids. Can't help but think that somehow represented what he thought of families. He had two types of victims middle aged women living alone and women alone with children.   \nOne poor woman he was hiding in 2nd bedroom in her house. I think she even had a guest over and BTK sat in her house the entire time until person left for the evening.\n\nGet a dog everyone. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o5lhc0/the_btk_killer_and_legacy_of_familial/"
    },
    {
        "id": "1o5i4b2",
        "author": "TheMirrorUS",
        "title": "Here's why BTK didn't face the death penalty for murdering 10 people in Kansas",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5i4b2/heres_why_btk_didnt_face_the_death_penalty_for/"
    },
    {
        "id": "1o5h0jc",
        "author": "youRinlove7",
        "title": "Bridgerton Season 4 | Date Announcement | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5h0jc/bridgerton_season_4_date_announcement_netflix/"
    },
    {
        "id": "1o5af00",
        "author": "PositiveZucchini4",
        "title": "Running Point",
        "content": "There's only 10 episodes but please tell me other ppl know about Running Point. Kate Hudson, Brenda Song. Its about a family who runs a basketball team and theres a change of leadership that shakes things up. Its cute, heartfelt, and hilarious. If you haven't seen it yet,  put it on your \"to watch\" list! ❤️❤️",
        "upvotes": 14,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o5af00/running_point/"
    },
    {
        "id": "1o554y6",
        "author": "Bluesalvia",
        "title": "The most boring show ever",
        "content": "Trying to find a limited series that was on Netflix maybe 8-9 years ago. There was a woman lead who produced and starred in the show. Maybe a comedian?  She said her goal was to create the most boring show ever.  She worked in an office with cubicles and in one episode went on a very awkward date. The entire show was awkward but weirdly compelling. There were pencils and old school tech. Not sure where it was filmed but it reminded me of Monterey or N CA. I have tried to find it again many many times but can’t find it. ",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o554y6/the_most_boring_show_ever/"
    },
    {
        "id": "1o5n1et",
        "author": "bookruncrystal",
        "title": "Netflix's Culinary Class Wars Finalist Edward Lee Starring in New Series With Ryu Soo-Young",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5n1et/netflixs_culinary_class_wars_finalist_edward_lee/"
    },
    {
        "id": "1o4zlew",
        "author": "DefiantRanger9",
        "title": "Does anyone else find Mikey Day annoying from “Is It Cake”?",
        "content": "His mannerisms and basically anything else irk me. Also he keeps tilting the knife each time it IS cake which is a dead giveaway. Would love to see someone else host this show. Any suggestions? \n\nCan someone please get this back to the producers. The show has potential. Poor Mikey does not. LOL",
        "upvotes": 32,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1o4zlew/does_anyone_else_find_mikey_day_annoying_from_is/"
    },
    {
        "id": "1o5lrze",
        "author": "StealieErrl",
        "title": "Can’t Choose Episode?",
        "content": "Watching on my Sony A80K. \n\nAny show I choose it just takes me right into an episode. SOME shows I can pause and with the menu that pops up I can choose “episodes” however this is not the case for most things I’m trying to watch. \n\nWhat gives here? $20+ per month and not being able to choose the episode of what I want to watch feels a bit of an overstep on their end. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5lrze/cant_choose_episode/"
    },
    {
        "id": "1o52bs3",
        "author": "LegitimateHumor8212",
        "title": "Just watched tires and now i dont like anything else on Netflix",
        "content": "Please suggest me something good like tires, i really love how all the OG comics made that show.\nI have watched Brooklyn 99, breaking bad and superstore already.",
        "upvotes": 21,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1o52bs3/just_watched_tires_and_now_i_dont_like_anything/"
    },
    {
        "id": "1o5bwgv",
        "author": "Pitiful_Cupcake_4831",
        "title": "Just watched the second story of True Haunting and thought I recognized it",
        "content": "They had the same story on A Haunting season 3 back in the day. After watching that episode and then watching the second story it was an interesting watch to see the differences. Episode for reference: https://youtu.be/p4INsWKLNc0?si=wjZRGwMRM0wE7mi5",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5bwgv/just_watched_the_second_story_of_true_haunting/"
    },
    {
        "id": "1o5hdxo",
        "author": "annemijndolfijn4",
        "title": "Pretty sure I was scammed",
        "content": "Hi everyone, I need your advice on what to do next. Last february, I contacted the netflix chat after having trouble accessing my account. They sounded helpful but after a while and after resetting just about everything, I still had trouble getting into my account. This is when I decided to just cancel everything and I told the Netflix customer service to cancel my entire subscription and account. They then told me not to log in because this would reactivate my subscription. Fast forward to today, when I noticed a Netflix payment on my bank account and I was shocked. Apparently I had been paying 19 euros (instead of the 9 euros I was paying before cancelling) for the last months since cancellation. \n\nNaturally, I called customers support and they told me there was a completely different email address registered to my bank account. They did direct this to me as someone must have been able to access my email (which has 2FA so that must be impossible). Hopefully, they did cancel everything now and I do feel stupid for not noticing this earlier but it did not cross my mind to double check as I assumed it was cancelled. My question is, how is this possible and is there any way I can get my money back? Netflix told me the services were used so this won't be possible, but obviously they were not used by me as I did not have access to this account or email. What do I do? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o5hdxo/pretty_sure_i_was_scammed/"
    },
    {
        "id": "1o5gx8t",
        "author": "jerkoff1610",
        "title": "Director reveals The Woman in Cabin 10 scene that almost got cut – and why he fought for it",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5gx8t/director_reveals_the_woman_in_cabin_10_scene_that/"
    },
    {
        "id": "1o53cc4",
        "author": "Altruistic-Dot-5380",
        "title": "Bring back Daybreak!",
        "content": "I just recently watched Daybreak and didn't know it existed. It was not advertised enough. It's a great show and I'm so disappointed it wasn't given proper promotion. \n\nWe need season 2! ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o53cc4/bring_back_daybreak/"
    },
    {
        "id": "1o5fnxg",
        "author": "Forward-Violinist-27",
        "title": "The True Story behind the climax scene of the Ed Gein series",
        "content": "What you see, reality is crazier than the series. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5fnxg/the_true_story_behind_the_climax_scene_of_the_ed/"
    },
    {
        "id": "1o5cvgl",
        "author": "cj_shima",
        "title": "Never have I Ever - What were the writers thinking?",
        "content": "I'll probably end up watching the entirety of this dumpster fire, but seriously this girl does nothing but screw up over and over and over again. She keeps screwing up over and over again because Devi learns nothing! It is like watching Family Guy where the characters have a teachable moment by the end of the episode, but then the very next episode resume being horrible sh\\*tty people. I can't understand why the writers decided having such a dislikeable villain as the main character would be a good idea. Nearly \\*all\\* of the other characters experience character growth and change, but Devi just keeps adding more fuel to the dumpster fire, and it stinks. I am halfway through season 2. I only keep watching the series because I want to know what happens with the \\*other\\* characters. No fault of the actress--she got dealt this sh\\*t script, but at this point, best end would be Devi dies. Very few people in her life wouldn't be better off without her.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5cvgl/never_have_i_ever_what_were_the_writers_thinking/"
    },
    {
        "id": "1o5cfg4",
        "author": "Confident-Course-317",
        "title": "The Resurrected (2025)",
        "content": "Has anyone watched this yet? It's the Taiwanese revenge drama. I personally like it but I want answers about the ending lol. What are your takes on the series?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5cfg4/the_resurrected_2025/"
    },
    {
        "id": "1o5c264",
        "author": "trashxgoth",
        "title": "Ryan Murphy (monster/s) series finale theory.",
        "content": "So this might be an own personal theory of mine but after watching the Ed gien monster story, it's probably one of his most disturbing work Ryan Murphy has mainstreamed published,which I believe he could be getting more balsy with the next few seasons with the anthologys on true crime killers, the ending of Ed giens portrayal could be possibly be teasers for further cases on famouse killers to be portrayed later on In future Netflix series, but if Ryan Murphy wants to push his ideas on how the monsters could be portrayed. Who's to say he wouldn't save the biggest known monster for last, jack the ripper?orr.. War crime is technically true crime. Whats to say he isn't saving the worst criminal story depiction known to mankind for last? (Austrian painter) It's a leap to say but I believe it's probability because we know now that Ryan Murphy wouldnt stray away from filming that part of history, and he does like to go all out. Who knows maybe, but we already got confirmation for season 4 and who the story is about, this is just for the seasons down the road. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o5c264/ryan_murphy_monsters_series_finale_theory/"
    },
    {
        "id": "1o5jbhd",
        "author": "not-this-time-33",
        "title": "Unlocked my card for 30 seconds and Netflix hit it",
        "content": "I leave my card locked. I do not like auto pay. I unlocked my card for a quick purchase within that couple of seconds Netflix hit my account. This is not the first time. I’m wondering how that’s possible. Do they just try to hit your card every second or is there something set up in place for this event?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o5jbhd/unlocked_my_card_for_30_seconds_and_netflix_hit_it/"
    },
    {
        "id": "1o49rdr",
        "author": "SerialSeriesQueen",
        "title": "Does Ryan Murphy hate women?",
        "content": "I finished Ed Gein the other day and the longer I sit on it, the more I realize just how much I hated it. Charlie Hunnam and Laurie Metcalf's performances were great but what really grinds my gears are the portrayals of the actual known murder victims. I get writers take artistic liberties for entertainment but what they came up with was just so perverse. Mary Hogan was a former madam in Chicago? Bernice was a desperate old kinky cougar looking for a sugar baby? Was this to make us feel less sorry for them? Like maybe they deserved it bc they weren't \"virtuous\"? There's very little background online about either of the victims, at least nothing I could find, so I cant understand why they made these choices for these women? The only thing I could come up with was Ryan Murphy really doesn't like women.",
        "upvotes": 162,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1o49rdr/does_ryan_murphy_hate_women/"
    },
    {
        "id": "1o4ffyl",
        "author": "YnotThrowAway7",
        "title": "I wish this many people had discovered Animal Kingdom years ago. I think it could have been up there with some of the biggest shows.",
        "content": "I know this show apparently did well on cable but I had genuinely never heard of it until this year. Although season 1 was good I feel once it really hits its stride it is right up there in my top 10 shows easily. It also had one of the best characters on TV period in Pope and I didn’t expect to be emotional by the end but damn I was more emotional than the final season of Breaking Bad. I’m so glad it’s getting a resurgence of viewers since coming to Netflix, but I can’t help but wish it had been the type of phenomenon everyone was talking about while it was airing.",
        "upvotes": 63,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ffyl/i_wish_this_many_people_had_discovered_animal/"
    },
    {
        "id": "1o4xthy",
        "author": "Sara_b211",
        "title": "Wayward Discussion- Laura and her Parents",
        "content": "So I just finished the series and well…\n\nspoilers ahead\n\nI just really want to know what you guys think. Did laura actually kill her parents? We saw a glimpse when she killed that frog, but that could be since the frogs bring her trauma? \n\nBut then again I really did feel like she killer her parents.. she did not give me good vibes. and alex just ignoring that when he knew? im so confused ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o4xthy/wayward_discussion_laura_and_her_parents/"
    },
    {
        "id": "1o4ihji",
        "author": "LatteMermaid",
        "title": "Red flags or underrated masterpiece?",
        "content": "",
        "upvotes": 25,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ihji/red_flags_or_underrated_masterpiece/"
    },
    {
        "id": "1o579jd",
        "author": "katiebxby",
        "title": "is netflix down?",
        "content": "its saying that i am having having trouble accessing titles, i have restarted many times and turnt my tv on and off. i don’t know if it’s a personal problem or if everyone’s having the same issue",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o579jd/is_netflix_down/"
    },
    {
        "id": "1o52bw3",
        "author": "OwOwOwoooo",
        "title": "household no longer aknowledged (changed provider, i guess) but no smart tv to setup one?",
        "content": "Basically what the title said. Tried to connect via webside after i change internet provider few days ago, netflix tells me its not my household so i got a temporary allowance...\n\nThen i v looked up about it, seems i gotta use a smart tv to set up a new household? I dont have a smart tv.. i use chrome on pc, my android phone and chromecast for my tv. How am i supposed to use netflix on pc w/o using temporary code?\n\nPlz netflix stop beeing annoying QQ\n\n  \nEdit pc is on ethernet",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o52bw3/household_no_longer_aknowledged_changed_provider/"
    },
    {
        "id": "1o3ra72",
        "author": "GlitteringAd6571",
        "title": "Victoria Beckham victimization",
        "content": "This girl grew up in a wealthy family and went to school in a Rolls Royce. Even if she wasn't such a great singer and dancer, she became part of the most successful girl bands in the 90s (i don't recall her singing very much in that band anyway).\nIn her 20s she met one of the most talented and considered sexy football player in the world. She married him, she has 4 beautiful children and she maintained her silhouette (I know her eating problems, but she's lucky to have a good health and not being affected by a hormonal problem, as many women are going through). She has the life and the opportunities that 99% of the planet couldn't even dream of. She is still very rich and she can pursue her passion, the fashion-she is very talented in this to be fair.\n\nI watched the documentary. It looks like she is not aware of none of these things. ",
        "upvotes": 634,
        "comments": 217,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ra72/victoria_beckham_victimization/"
    },
    {
        "id": "1o4pkkw",
        "author": "WestOk9144",
        "title": "[spoiler alert] on the ending of Monster Ed Gein series",
        "content": "At the cemetery where the rowdy teenagers are plucking his tombstone, right after, one kid starts seeing the characters of the show but it seems only him can see them. Did this spark his schizophrenia, like it did for Ed? It was like a way of saying, this is a timeless condition, it doesn't have to do with Ed not having seen morbid pictures in his lifetime, it can happen to anyone? kind of like a spooky ending?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o4pkkw/spoiler_alert_on_the_ending_of_monster_ed_gein/"
    },
    {
        "id": "1o4y65k",
        "author": "pippawhiskers",
        "title": "Ed Gein - Monster",
        "content": "Ryan Murphy’s jab at Mindhunter in Ed Geins monster is sending me into a spiral. The least he could do is fund mindhunters revamp at this point… not try to re create it 😭😭😵‍💫😵‍💫 \n\nI just needed somewhere to share this where others may have the same opinion. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4y65k/ed_gein_monster/"
    }
]