[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1on4nrc",
        "author": "moodyhippy",
        "title": "i watched Idiocracy for the first time today",
        "content": "after my coworker saw me pour electrolytes in my water and she quoted a line from the movie that i had no idea what she was talking about haha. i enjoyed it, i laughed a lot. kinda wild how on point it is - the ads everywhere, the stupidity, the love of violence. big yikes. ",
        "upvotes": 402,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1on4nrc/i_watched_idiocracy_for_the_first_time_today/"
    },
    {
        "id": "1on93iz",
        "author": "missuniversearth",
        "title": "The Mother (2023) Netflix sad ending",
        "content": "Spoiler Ahead ⚠️\n\nJ Lo's character is so sad at the end and no matter what the haters say, her acting at the end and the makers really set that scene. Especially, with Kate Bush's song, there could have been no other better scene to compliment her song.\n\nSo fed up of this culture of adoptive parents being jerks. The adoptive mom is definitely one and it seems like she made J Lo keep her promise as she is very nonchalant and uninviting in that scene. Plus, in the reunion scene before when she and J Lo meet eyes and she is not even looking at her in spite of looking straight into her face. J Lo, on the other hand, nods while she proceeds to ignore her and hold their daughter tighter, especially when J Lo is pulling off, not giving a chance for the daughter to turn around and watch her leave.\n\nWhat are your thoughts? Would J Lo only observe her daughter and would they communicate only from a distance like in that scene?",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1on93iz/the_mother_2023_netflix_sad_ending/"
    },
    {
        "id": "1omywhy",
        "author": "Rannrann123",
        "title": "Looking for good episodic shows",
        "content": "Hey guys, I'm a busy college student who doesn't really have the time to keep up with shows that require you to remember what happened in previous episodes. What are some good episodic shows that I can just watch an episode or two of whenever I find myself with some spare time? Thanks :)",
        "upvotes": 26,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1omywhy/looking_for_good_episodic_shows/"
    },
    {
        "id": "1onc23q",
        "author": "Sufficient-Curve2951",
        "title": "The Asset",
        "content": "Mystery lovers, is the recent Danish series worth watching?? I find the premise quite interesting and the fact that it does not kick start with a murder is exciting too!! But is it worth the time? This article has listed some solid points and I might tune in\n\n  \n[https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist](https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1onc23q/the_asset/"
    },
    {
        "id": "1omc7i6",
        "author": "does_anyone_know_wtf",
        "title": "Netflix asking me if I’m still there- stop it",
        "content": "Sometimes I’ll turn on a show and literally like 20 minutes into it, It’ll ask if I’m still there. Yes, I’m still here and probably will be until I turn the tv off. Wtf is this about and why? Please just let me watch tv in peace without having to continuously tell them. It does not deter me in the SLIGHTEST. I just like background noise. But on a little bit of a creepier note, I’ve noticed just lately that it has popped up right when I walk away from the TV as if it’s watching my movements. Anyone else?",
        "upvotes": 361,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1omc7i6/netflix_asking_me_if_im_still_there_stop_it/"
    },
    {
        "id": "1on6g9t",
        "author": "HeyMay0324",
        "title": "Boots!",
        "content": "Omg, I loved this show! I cried at the end. My brother was in the USMC and it brought back memories of going to his graduation on Parris Island. I thought the acting from the drill instructors was spot on.\n\nDid anyone else watch it?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1on6g9t/boots/"
    },
    {
        "id": "1ondblb",
        "author": "5leepyewa",
        "title": "I have memories about a show or series from when I was younger but can't find anything that matches.",
        "content": "it was adult show on Netflix around 2012-2016 was the timeline my memory was set. I remember 2 scenes and don't know if they are from the same show or not. one scene contains a man (any facial details are out the window) who came up to a big-ish computer screen. it was from my memory an open and/or wide building. \n\nThe 2nd scene contains a man in a forest, rain most likely because he was wet. he was a white male who had long hair like a female and a beard (I think). I can't remember but I'm pretty sure there's blood involved somewhere given the fact I know this show had guns and knifes involved. \n\nThe show from the 2nd scene I know wasn't in English because subtitles and voice didn't match up.\n\nI came to see if anyone has seen or heard of a show(s) with similar details or a scene with similar details",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ondblb/i_have_memories_about_a_show_or_series_from_when/"
    },
    {
        "id": "1omwbw9",
        "author": "Repulsive_Knee9258",
        "title": "Controversial but I don’t see the issue with Liam hemsworth as the Witcher",
        "content": "I’m just your average watcher, i don’t make reviews and I watch Netflix here and there in my spare time after work and then get on with my life. So  I just started season 4 of the Witcher and found out Henry Cavill left and Liam hemsworth is now the Witcher and so far so. I’m enjoying the show. Great suspense, great magic and action scenes. It’s decent, it keeps you entertained which is all I’m looking for. But the reviews? The craziest hate load I’ve seen in a while to a cast change. I honestly don’t get the hate, but yeah that’s all im g onna say.",
        "upvotes": 14,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1omwbw9/controversial_but_i_dont_see_the_issue_with_liam/"
    },
    {
        "id": "1ond85w",
        "author": "cPa3k",
        "title": "There is a problem connecting to Netflix. Please try again later. Error",
        "content": "(ipad) I keep getting the “There is a problem connecting to Netflix. Please try again later.” “There is a problem connecting to Netflix. Please try again later.” errors and every time I open the app the “No internet connection” red banner at the top appears. \n\nI literally can do anything or even switch profiles. On my TV and my PS5 everything works fine and every other app on my ipad works normally. Last week I had the same problem and deleting the app and reinstalling worked but now the errors are back and deleting and reinstalling isn’t a a good solution if I have to do it every few days. Anyone know why this keeps happening or how I could fix it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ond85w/there_is_a_problem_connecting_to_netflix_please/"
    },
    {
        "id": "1ond6tv",
        "author": "Notyouravgtiramisu",
        "title": "Need some recommendations",
        "content": "Hey girls and guys but mostly girls\nI want to watch a movie or series revolving around fake dating or fake arrangements... Wattpad kind \nI am really bored and want to watch something with slow burn , romance , with hot leads \nPlease give me some suggestions ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ond6tv/need_some_recommendations/"
    },
    {
        "id": "1ond4d8",
        "author": "Plastic-Youth2036",
        "title": "Need show recommendations",
        "content": "I really tried to like Mindhunters. I’m on episode 3 and in some parts I find myself fast forwarding it.\n\nI need action or a little fast paced. I don’t like slow starting shows or shows that just drag on. It seems like a lot of good shows get canceled though. \n\nWhat can you recommend, something binge worthy. Otherwise I end up rewatching the same",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ond4d8/need_show_recommendations/"
    },
    {
        "id": "1onbvps",
        "author": "KnightedRose",
        "title": "What do you think of Stellar Bites?",
        "content": "There’s no sub and thread about this and I want to ask if there are other shows like this where the chef is paired with a contestant. Also Ep 1 is already about 2 hours. Thank you!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1onbvps/what_do_you_think_of_stellar_bites/"
    },
    {
        "id": "1onanps",
        "author": "Klara_wooly",
        "title": "Evil dead rise",
        "content": "Evil dead rise is not available for Netflix india? OR  is it available for Netflix advanced? How come once shown shows are automatically vanishing from the list? Was there any prior notification before deleting it from the list of movies? I think not..\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onanps/evil_dead_rise/"
    },
    {
        "id": "1omidrk",
        "author": "Miljkomax",
        "title": "Why is Netflix always so dark?",
        "content": "Noticed this earlier this year when I subscribed and watched the SciFi series Dark. Now I'm watching Black Rabbit during the day and all I can see is just fucking dust on my TV. This is literally unwatchable. \n\nThe brightness, contrast and everything else is at it's highest.\nIs there anything I can do to fix this?",
        "upvotes": 55,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1omidrk/why_is_netflix_always_so_dark/"
    },
    {
        "id": "1on40e5",
        "author": "Alex_03003",
        "title": "TBDBITL Stranger Things Show!!",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1on40e5/tbdbitl_stranger_things_show/"
    },
    {
        "id": "1on996l",
        "author": "Plantsnbooksnboats",
        "title": "Rank these streaming services from least to favorite (college voting systems project)",
        "content": "I am working on a voting systems project for my college math class.\n\nPlease rank the following streaming services from least to favorite:\n\n-Hulu \n-Netflix \n-Disney+ \n-Prime Video\n\nYour response must include all 4 of these services. #1 being most favorite and #4 being least favorite etc.\n\nThank you for your participation! 😃🙏",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1on996l/rank_these_streaming_services_from_least_to/"
    },
    {
        "id": "1on8kxm",
        "author": "Target1ockedOnXbox",
        "title": "Netflix ads UNmuting my TV??!",
        "content": "I’ve only been using Netflix with ads for a short time.. but it just unmute my Apple TV between ads. \n\nHad a 60 second ad break with 4 ads that were 15 seconds long. I’m listening on my apple airpods cuz it’s early in the morning and I muted the Apple TV with the remote. \n\nThen after the first ad finished, my Apple TV/airpods unmuted on their own, but still appeared as if the tv was muted. I the had to hit the mute button twice to remute it.\nThen it did the same thing 2 more times. Every time a new ad started my AirPods were unmuted automatically. \n\nLiterally, what the hell. Is this new?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1on8kxm/netflix_ads_unmuting_my_tv/"
    },
    {
        "id": "1on0lzl",
        "author": "Late-Association2732",
        "title": "Too much hate on Straw",
        "content": "I just finished watching straw and I absolutely bawled my eyes out but then I come to the internet and see people think it is “absolutely disgusting”. Does anyone else like this movie? I need to find my people! Although I think it would have been better executed if it was not Tyler Perry writing it.",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1on0lzl/too_much_hate_on_straw/"
    },
    {
        "id": "1omlm78",
        "author": "Lopsided_Doubt_3649",
        "title": "Witcher season 4",
        "content": "Well just finished Witcher season 4 and have nothing bad to say about characters. However storyline absolutely garbage did absolutely nothing in terms of any content, Netflix makes you wait years between seasons then gives you nothing for a story. What a absolute waste of time ",
        "upvotes": 23,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1omlm78/witcher_season_4/"
    },
    {
        "id": "1on68ks",
        "author": "Horror_Effective12",
        "title": "The Witcher Season 4 Review – Is Hemsworth able to follow in Cavill’s footsteps?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1on68ks/the_witcher_season_4_review_is_hemsworth_able_to/"
    },
    {
        "id": "1on68fu",
        "author": "MusicInTheAir55",
        "title": "black bars (pressed something)",
        "content": "I accidentally toggled some cropping function in NF where it crops the screen. I pressed something on the keyboard and don't know how to get it back to full screen (I am watching in full screen, but the show is cropped).\n\nEDIT -- Can anyone confrim that the show 'the Asset' is supposed to have black bars ? I looked up the specs on this show, and it says it was shot in 16:9 which should translate to no black bars on my 1080p television. \n\nAny tips on how to reset this would be appreciated.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1on68fu/black_bars_pressed_something/"
    },
    {
        "id": "1omygj1",
        "author": "vacantexpressions",
        "title": "Halo",
        "content": "I loved this series. The story, the characters, the ships, all of it. What does it take for Netflix to pick up production of a show? I'd really like to see more seasons of this. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omygj1/halo/"
    },
    {
        "id": "1omp30y",
        "author": "joe_dirty365",
        "title": "Ran here when I heard The Lady's Companion was cancelled.",
        "content": "This is just a PSA to watch it asap. It is so good I am flabbergasted that it got cancelled. Its hilarious, well written, campy, heartfelt and steamy. Was rooting for all the characters/love interests to work out ha. Sad to hear season 2 wasn't picked up. ",
        "upvotes": 9,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1omp30y/ran_here_when_i_heard_the_ladys_companion_was/"
    },
    {
        "id": "1on4mbo",
        "author": "Rider_man_clan",
        "title": "WE’RE GETTING A THIRD ZEROCALCARE SHOW",
        "content": "It’s coming in 2026. For those who don’t know the last two zerocalcare shows were “ tear along the dotted line” and “This world can’t tear me down”. \nThe new show is going to be called “Due Spicci” no idea what the English title is going to be but I’m beyond hyped!!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1on4mbo/were_getting_a_third_zerocalcare_show/"
    },
    {
        "id": "1omn28t",
        "author": "techieyo",
        "title": "Netflix's 2026 anime lineup might be better than Crunchyroll's",
        "content": "Am I crazy or does anyone else see this? What's everyone most excited about?\"",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omn28t/netflixs_2026_anime_lineup_might_be_better_than/"
    },
    {
        "id": "1on230j",
        "author": "Sufficient-Bill-4508",
        "title": "Goated seriess for you",
        "content": "What are the series you loved the most and people call it overrated???\n\nSo, I’ve been thinking about this for a while, how sometimes you fall completely in love with a show/series, but when you mention it online or to your friends, all you hear is “meh, it’s overrated.” Happens all the time, right?\n\nTell me fav ones which you love the most and everyone calls it overrated ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1on230j/goated_seriess_for_you/"
    },
    {
        "id": "1omqvcj",
        "author": "Top-Three-USA",
        "title": "Rei Ami Says She’s “Waiting for the Call” from Netflix as ‘KPop Demon Hunters’ Becomes Record-Breaking Hit",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omqvcj/rei_ami_says_shes_waiting_for_the_call_from/"
    },
    {
        "id": "1ome68t",
        "author": "No-Jaguar-7492",
        "title": "I figured out has to get past the household rule on a tablet or phone without asking for a code!",
        "content": "Ok so basically if you enter the app in airplane mode or without WiFi and it takes you to your downloads. After your in that area just pick the home button in the left hand corner. From there you just turn your device’s WiFi back on and boom in three steps you got Netflix without having to bug your family for the entrance code every 5 minutes!\n\n\nDisclaimer: I did this on an IPad and my IPhone but I’m not sure it will work for all devices. I haven’t tried this method on a pc yet or by using just the plane website Netflix but I doubt it would work there. I also don’t know if it work on non-apple devices but it’s worth a shot. Hope someone found this helpful!\n",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ome68t/i_figured_out_has_to_get_past_the_household_rule/"
    }
]