[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 111,
        "comments": 336,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mougvq",
        "author": "HallConscious9108",
        "title": "Netflix is in a slump",
        "content": "Feels like almost all the really good shows have been coming out on Prime or Apple TV lately \n\nFeels like content slop on the home page \n\nNetflix used to be the crème de la creme \n\nWhat happened? ",
        "upvotes": 205,
        "comments": 160,
        "media": null,
        "permalink": "/r/netflix/comments/1mougvq/netflix_is_in_a_slump/"
    },
    {
        "id": "1mp665a",
        "author": "TrifleNext9884",
        "title": "What are you guys currently watching 💭🧐",
        "content": "Comment below the name of shows or movie you guys are currently watching. Just curious and looking for something new to watch. Instead of asking for recommendations I feel like it’s easier just to see what everyone’s watching and maybe watch it later. ",
        "upvotes": 11,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1mp665a/what_are_you_guys_currently_watching/"
    },
    {
        "id": "1moq875",
        "author": "OCapalot14",
        "title": "Best Netflix Shows of all time",
        "content": "Stranger Things\n\nDark\n\nBlack Mirror\n\nBoJack Horseman\n\nOzark\n\nArcane\n\nCobra Kai\n\nHaunting of Hill House\n\nYou\n\nOrange is the New Black \n\nSex Education \n\nOuter Banks\n\nWednesday \n\nMindhunter \n\nSquid Game\n\nBridgerton\n\nGinny &amp; Georgia \n\nLupin\n\nWeak Hero\n\nNever Have I Ever \n\nAlice in Borderland \n\nBeef\n\nThe Crown\n\nNarcos \n\nQueen’s Gambit \n\nMoney Heist\n\nUmbrella Academy \n\nOne Piece (Live action)\n\nBlue Eye Samurai \n\nPeaky Blinders \n\nHouse of Cards \n\nLove Death + Robots \n\nNot in any particular order btw\n\n\n",
        "upvotes": 57,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1moq875/best_netflix_shows_of_all_time/"
    },
    {
        "id": "1mp4r5h",
        "author": "ShiftRepulsive7661",
        "title": "Please everybody go watch Fixed immediately, it’s a riot",
        "content": "Everything about this animated movie is fantastic, from the graphic style to the avalanche of visual gags and jokes.  \nIt’s not Shakespeare, but my husband and I had a very good time, laughing from start to finish. Genndy Tartakovsky wins again. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mp4r5h/please_everybody_go_watch_fixed_immediately_its_a/"
    },
    {
        "id": "1mp5zro",
        "author": "mmmadness",
        "title": "‘Fixed’ Review: Genndy Tartakovsky Goes Doggone Wild in R-rated Animated Comedy With Heart (and Balls)",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mp5zro/fixed_review_genndy_tartakovsky_goes_doggone_wild/"
    },
    {
        "id": "1moswbi",
        "author": "heiresss",
        "title": "Netflix raises monthly cost for Australian users",
        "content": "“Netflix has raised its membership prices once more.\n\nAccount holders on Netflix’s two standard plans will now be slogged an extra $2 per month, with the cheapest Netflix option, ‘Standard with ads,’ rising from $7.99 to $9.99 per month.\n\nThe standard, ad-free plan will rise from $18.99 to $20.99 per month. \n\nNetflix’s premium plan will see the steepest increase, up $3 per month from $25.99 to $28.99.\n\nThere’s also been a $1 price hike across the board to add an extra member to any of the plans.\n\nNetflix last increased its prices in May 2024 – before that, the premium plan was $22.99, meaning users on this plan have seen a 26 percent price increase over the past 15 months.”\n\nSource: News.com.au\nhttps://www.news.com.au/entertainment/tv/streaming/netflix-raises-monthly-cost-for-australian-users/news-story/a1c2c17c0a4e6a16912ef5e1fe98f6fd\n\nDefinitely considering cancelling ahead of this going into effect.",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1moswbi/netflix_raises_monthly_cost_for_australian_users/"
    },
    {
        "id": "1mp87lx",
        "author": "nikeatssoap",
        "title": "is there anything like an incognito mode on netflix?",
        "content": "i share an account with family members. And often when the TV is turned on a pop up recommends like “Continue For [my name]” and its the latest things i watched. I cant let my family members know im watching a series about LGBTQ+ people for safety reasons. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mp87lx/is_there_anything_like_an_incognito_mode_on/"
    },
    {
        "id": "1mp58tj",
        "author": "MysteriousDelay6266",
        "title": "Steve | Official Trailer | Netflix | October 3",
        "content": "Follow one pivotal day for a headteacher and his students, at a last-chance reform school in mid-90s England.  \n  \nSteve. A reimagining of Max Porter's bestseller Shy, starring Academy Award® winner Cillian Murphy and directed by Tim Mielants.  \n  \n**In select theaters from September 19 and on Netflix October 3.**",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mp58tj/steve_official_trailer_netflix_october_3/"
    },
    {
        "id": "1mp8oex",
        "author": "sabeani",
        "title": "Caricatures of Netflix Reality Shows (Love Island &amp; The Bachelor Make A Special Guest Appearance)",
        "content": "# Love Is Blind – The Engagement Speedrunner\n\n* Talks about marriage before knowing your last name\n* Makes “our song” a track they heard once in the pods\n* Defends their fiancé even when the receipts are televised\n* Calls breakups “growth moments”\n* Says “I knew the second I heard your voice” but can’t remember your birthday\n\n**Character Brief –** ***Proposal Paige***  \nPaige’s toxic superpower is mistaking adrenaline for intimacy. She believes love is purer when you can’t see the person, but still stalks your Instagram the second the wall drops. She thrives on tearful declarations, awkward family dinners, and proving to everyone at the reunion that “we’re stronger than ever” (right before unfollowing each other).\n\n# Too Hot to Handle – The Self-Help Casanova\n\n* Wears swim trunks to breakfast meetings\n* Learns one breathwork technique and becomes the villa’s “healer”\n* Breaks a $30k rule because “the vibe was right”\n* Calls every hookup “a spiritual connection”\n* Uses Lana as an excuse: “She didn’t *say* I couldn’t do that”\n\n**Character Brief –** ***Tantric Tyler***  \nTyler can’t go 12 hours without kissing someone, but will lecture you about “inner work” while rubbing sunscreen on their abs. His redemption arc involves crying once in a workshop circle and suddenly being everyone’s relationship coach — despite leaving the show with two exes and no prize money.\n\n# The Circle – The Emoji Manipulator\n\n* Ends every sentence with 💖🔥😂✨ to seem friendly\n* Keeps a chart of who said what and when\n* Accidentally slips slang their catfish persona shouldn’t know\n* Starts alliances they never plan to honor\n* Overreacts in messages to cover awkward silences\n\n**Character Brief –** ***Filter Frankie***  \nFrankie is a master of digital double lives. She’ll “bestie” you into trusting her, then use your own confession against you in a group chat. Frankie’s DMs are 60% flattery, 40% reconnaissance — and she knows exactly which selfie to post when she’s in danger of getting blocked.\n\n# The Mole – The Friendly Backstabber\n\n* Suggests wrong answers like they’re gospel\n* Volunteers for every key role… then botches it\n* Pretends not to know how to read maps\n* Gaslights teammates into thinking *they* messed up\n* Claps when someone else gets blamed\n\n**Character Brief –** ***Sabotage Sasha***  \nSasha is charming enough to carry the group’s groceries — and just careless enough to drop them “accidentally” before a checkpoint. She thrives on subtle chaos: swapping clue cards, “forgetting” the time limit, and watching trust disintegrate. The smile? Weaponized.\n\n# The Bachelor / Bachelorette – The Rom-Com Gaslighter\n\n* Gives “we’re meant to be” speeches to multiple people\n* Keeps the drama starter “one more week” for ratings\n* Calls every one-on-one date “the most special ever”\n* Has breakup tears timed to the golden hour\n* “For the right reasons” is their drinking game\n\n**Character Brief –** ***Rosewood Ryan***  \nRyan is a walking slow-motion montage. He’ll kiss you under fireworks, then hand the next rose to someone who insulted your outfit. He survives on love triangles, family skepticism, and speeches that sound like they were rehearsed in a limo. Bachelor Nation loves him until they realize he’s auditioning for *Paradise*.\n\n# Temptation Island – The Overconfident Heartbreaker\n\n* Swears they “couldn’t possibly” cheat on camera\n* Has their first slip-up before unpacking\n* Calls infidelity “a necessary test”\n* Starts a villa romance *and* keeps messaging their ex\n* Proposes on finale night to prove everyone wrong\n\n**Character Brief –** ***Tempted Trevor***  \nTrevor arrived as “the loyal one,” but the combination of ocean views, bottomless cocktails, and 12 singles with perfect teeth transformed him into a statistics study in bad decisions. His specialty is crocodile tears, claiming “we were on a break,” and somehow walking away engaged.\n\n# Love Island – The Casa Amor Chaos Machine\n\n* Says “I’m loyal” 12 hours before cheating\n* Practises speeches for firepit recoupling\n* Makes the balcony their betrayal HQ\n* Falls in love twice in one week\n* Thinks a tanning session counts as quality time\n\n**Character Brief –** ***Balcony Bree***  \nBree’s loyalty lasts exactly until Casa Amor. She thrives in slow-motion entrances, whispered flirts during workouts, and returning from a “test” fling with a justifying monologue. Her most used phrase? “My head’s been turned.”\n\n# Perfect Match – The Netflix Multiverse Villain\n\n* Knows your messy ex from another show\n* Switches partners mid-date\n* Drops gossip right before elimination\n* Flirts to get strategic alliances\n* Always has the “tea” no one asked for\n\n**Character Brief –** ***Crossover Corey***  \nCorey is a franchise veteran — three Netflix dating shows deep and counting. He thrives on multi-season drama arcs, stirring pots across villas, and framing every choice as “strategy” while collecting new followers like souvenirs.\n\n# ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mp8oex/caricatures_of_netflix_reality_shows_love_island/"
    },
    {
        "id": "1mofhb7",
        "author": "indiewire",
        "title": "IndieWire names Guillermo del Toro's \"Frankenstein\" as one of 53 of their most anticipated fall movies.",
        "content": "",
        "upvotes": 57,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mofhb7/indiewire_names_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1mp6lna",
        "author": "chrlie_1105",
        "title": "Olympo",
        "content": "Je viens de finir la série Olympo sur netflix et j'ai besoin d'un avis extérieur. J'aimerai savoir comment ça se passe vraiment dans les centres sportifs. Parce qu'à les entendre les athlètes passent leur temps à faire des soirées ou à se doper. Dans les premiers épisodes, les entraîneurs sont très stricts sur les horaires mais au milieu de la série ils sont plusieurs à quitter ou éviter les entraînements et ça ne dérange personne.\nApres je sais que ça reste une série et pas un documentaire mais voilà je me posais la question.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mp6lna/olympo/"
    },
    {
        "id": "1mp0oh3",
        "author": "lesleybozo",
        "title": "Fixed genuinely is insufferable and im only like 5 minutes in",
        "content": "I genuinely hate this. This is just corny sex jokes. I dont wanna see an animated dogs butthol flap while hes humping a grandmas leg. The animation is the only interesting thing. The movie is pretty bad so far. And the jokes are corny. Actually im writing this while watching and im like 7 minutes in and honestly royal penis is genuinely so weird. Honestly sony animation makes some random films. Went from peak (k pop demon hunters) to this shit. I wanna peep my eyeballs out of their sockets. WHY DO WE GOTTA SHOW HIS BUTTHOLE SO MUCH BROTHER. LIKE OMG. PLZ NEUTER HIM RN. Ok 8 minutes in and there is fucking shit and piss jokes. This is for millenials. And theres another butthole. SOS. So far i assume the film is only gonna go down hill from here. The dogs balls are flapping. Im just gonna go pray to god and stop watching. This movie is horrible and i dont need to watch it all. 4/10. This movie is trying to be as unserious as possible and even then it fails. Im not a movie critic but honestly, id rather watch war of the worlds.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mp0oh3/fixed_genuinely_is_insufferable_and_im_only_like/"
    },
    {
        "id": "1mowfpb",
        "author": "ClementTrandon",
        "title": "Shows similar to YOU",
        "content": "I finished the show, and am just wrapping up with Dexter and want to find a show similar to YOU that holds an inner monologue and at least somewhat focuses on things similar to you, it doesn’t have to be exact but I’ve been binging all the mainstream shows like it and want to find some more stuff to watch.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mowfpb/shows_similar_to_you/"
    },
    {
        "id": "1mp0kli",
        "author": "FinalBedroom5348",
        "title": "The Lincoln lawyer",
        "content": "So, my fall watch list is looking good! I saw that the new ‘Monsters: Ed Gein’ with Charlie Hunam  is this fall as well as ‘Nobody wants this’ s2. When is the next season of the Lincoln lawyer??? I feel like those seasons go so long in between. I wish Neve Campbell didn’t leave it. But they left the show on such a cliff hanger!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mp0kli/the_lincoln_lawyer/"
    },
    {
        "id": "1morcm5",
        "author": "Mental_Low_7944",
        "title": "Do you ever feel like time is moving quickly now? That could be because of how long your favorite shows have been taking to come out with new seasons.",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1morcm5/do_you_ever_feel_like_time_is_moving_quickly_now/"
    },
    {
        "id": "1morjid",
        "author": "Longjumping_Wolf_781",
        "title": "My Oxford Year Movie vs. Book",
        "content": "Did anyone else read the book and LOVE it but then HATE the movie? I mean practically everything was changed. First and foremost - having a degree in literature doesn’t qualify her to be a financial analyst? I guess technically she could have done internships or whatever BUT STILL I felt like a big part of the beginning of the book was that it’s her first time studying literature at a higher level and that was how the contrast was created between her studies at Oxford vs. her career in DC. I feel like everything that was good was taken out. Every scene was either changed or replaced entirely by a new scene. A lot of the characters were portrayed different in the movie from how they were written. I never expect an adaptation to be spot on but if they really wanted to change everything then why even call it an adaptation at that point? Just write a different story!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1morjid/my_oxford_year_movie_vs_book/"
    },
    {
        "id": "1movqwz",
        "author": "JuniorDebt4632",
        "title": "Looks so good.",
        "content": "Look at this amazing viewable space on Netflix Mobile. It feels like I can breathe. Not feeling claustrophobic at all.\n\nAren't we glad we have such an intelligent company making it so we can easily see our viewing options? \n\nKudos to you Netflix.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1movqwz/looks_so_good/"
    },
    {
        "id": "1mp58o9",
        "author": "clementtoh2",
        "title": "Did the sandman help anyone sleep better?",
        "content": "Before watching sandman i always hated sleeping early or waking up extremely late since i would be wasting time and tried not to sleep at some nights.\n\nBut after watching i started to sleep more, does anyone feel the same way as me?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mp58o9/did_the_sandman_help_anyone_sleep_better/"
    },
    {
        "id": "1mnu8dy",
        "author": "L0v3_1s_War",
        "title": "HUNTR/X’S ‘GOLDEN’ from ‘KPOP Demon Hunters’ Hits No. 1 on Billboard Hot 100",
        "content": "",
        "upvotes": 162,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mnu8dy/huntrxs_golden_from_kpop_demon_hunters_hits_no_1/"
    },
    {
        "id": "1moua4d",
        "author": "Southernbeard26",
        "title": "Shared account with multiple screens purchased needs code?",
        "content": "Second day in a row I’ve had to ge tmy code on a shared account to access Netflix. We have a multi screen account…is this an every day thing now? Wtf Netflix. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1moua4d/shared_account_with_multiple_screens_purchased/"
    },
    {
        "id": "1moen2v",
        "author": "Large_Basket_5440",
        "title": "One Hundred Years of Solitude - second part?",
        "content": "I have really enjoyed the first part of the series but when I looked online, I couldn’t find any information around when (or if) will be the second part aired. Did I miss any news or there were no news around the series? \n\nI had really low expactations about the series as a huge book fan before watching - but now I am desperate for the next part. \n",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1moen2v/one_hundred_years_of_solitude_second_part/"
    },
    {
        "id": "1moejzy",
        "author": "guesthost1999",
        "title": "Anyway to see if you watched a movie?",
        "content": "I got half way through a movie before everything came back to my head and realized I watched it already.\n\nWould be great if there was a way to show if/when a show was watched previously.",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1moejzy/anyway_to_see_if_you_watched_a_movie/"
    },
    {
        "id": "1moqa4f",
        "author": "PositiveAd537",
        "title": "Macbook screen flickering",
        "content": "Just got a new macbookOS which was used before first time watching netflix on it and my screen flickers only on Netflix I readjusted the mouse many times it works but it doesnt solve the problem fully it just happens every once in awhile so I have to keep changing the mouse size how can I solve it fully? And what may be causing the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moqa4f/macbook_screen_flickering/"
    },
    {
        "id": "1mofw7o",
        "author": "Realistic-Relief3865",
        "title": "Just finished the watcher",
        "content": "I honestly don’t know how I feel about it. A part of me wants to hate it because it just felt so messy and unsatisfying by the last episode.  I saw a lot of people being annoyed that the watcher wasn’t revealed but i felt like it was pretty obvious that it was the neighbours, especially when you consider them being in the tunnel, their group about conserving the houses, everyone getting letters once they have a bad interaction with them, and the fact that the man is a librarian and they mentioned theres a typewriter. One thing that annoyed me badly was the tunnels, they were so desperate to find out but yet didn’t go and explore the tunnels better themselves, the answer literally could have been revealed by then. Another thing that annoyed me was the fact that when the two ladies invited Nora over, she hears the thuds, left looking terrified, just to never bring that up again. I really wanted to like it and I felt like it could’ve been great if they actually properly worked on the storyline. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mofw7o/just_finished_the_watcher/"
    },
    {
        "id": "1moo3h8",
        "author": "graemeisverytired",
        "title": "Filming The Thursday Murder Club on Netflix felt more like a college reunion than working, according to Helen Mirren and Pierce Brosnan",
        "content": "“But you know the great thing about Thursday Murder Club,” explained Helen Mirren. “Was that we all kind of knew each other. I mean, I’d worked with Ben – Sir Ben, Sir Ben – in the theater when we were in, like, in our early 20s. So we knew each other really, really well.”\n\nMore: https://www.thepopverse.com/movies-the-thursday-murder-club-cast-helen-mirren-pierce-brosnan-college-reunion-vibes-jimmy-fallon-the-tonight-show",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moo3h8/filming_the_thursday_murder_club_on_netflix_felt/"
    },
    {
        "id": "1momrc3",
        "author": "Tobermory-",
        "title": "Low quality on Netflix app",
        "content": "For some reason this past month or so the Netflix app on my phone has been playing at no more than 720p for 99% of the time. Ive checked in the app settings and I’ve got it on streaming in highest quality and highest data usage, my WiFi is around 800mbps, and it’s streams in perfect 1080p on every other device I watch on through the same account. I’m on an iPhone 11 so I don’t know if that’s the issue but otherwise I’m stumped, does anyone have an answer?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1momrc3/low_quality_on_netflix_app/"
    },
    {
        "id": "1mo9fkx",
        "author": "YisusButAtWhatCost",
        "title": "So i finally start Dexter..",
        "content": "After seeing most of the show through Youtube Shorts for at least a year, i finally open netflix and start seeing it, even if i saw most major spoilers, i still find myself entertained watching it, can’t comprehend how didn’t notice this show back years… still, is worth it",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9fkx/so_i_finally_start_dexter/"
    },
    {
        "id": "1moj85z",
        "author": "omerhaim",
        "title": "Installing Netflix on iOS 15",
        "content": "Hey\nI had to erase my son iPad that had Netflix installed on it, now I can’t install Netflix the minimum iOS version is higher. 16 or 17 \nAnything I can do to get it installed?\nTried safari, it directs to the App Store ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1moj85z/installing_netflix_on_ios_15/"
    },
    {
        "id": "1mohxvc",
        "author": "Available_Clothes_18",
        "title": "Glitchy when \"Use graphics acceleration when available\" turned on",
        "content": "Hi, I use Google Chrome on my laptop, and when the \"Use graphics acceleration when available\" settings is turned on, Netflix glitches when in fullscreen. The screen is kind of \"jumpy\"  it makes it unwatchable.\n\nThe problem is, if I turn off the setting in Chrome, then it's Youtube that glitches in fullscreen, and some websites like Canva stop working properly.\n\nIm tired of having to turn it on/off all the time. Is there a definite way to make Netflix work properly on Google Chrome while still having the setting turned  on?  And without having to use another browser.\n\nBy the way this setting is in Chrome Settings &gt; System &gt; Use graphics acceleration when available\n\nthanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mohxvc/glitchy_when_use_graphics_acceleration_when/"
    },
    {
        "id": "1momgpo",
        "author": "RestlessRhys",
        "title": "Is it worth watching Wednesday season 2?",
        "content": "I liked season 1 but I'm two episodes into season 2 and i have no interest so far, does season 2 have anything worth continuing for? Or should i skip it and watch something else instead?\n\n(Obviously no spoilers as I might return to it in future)",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1momgpo/is_it_worth_watching_wednesday_season_2/"
    }
]