[
    {
        "id": "1in0byb",
        "author": "FlowAMA",
        "title": "Hey /r/movies - I'm Gints Zilbalodis, director/writer/producer of the Golden Globe-winning, Oscar-nominated film 'Flow'. Ask me anything! Back at 6 PM PT today (Tuesday 2/11) for answers.",
        "content": "",
        "upvotes": 1384,
        "comments": 468,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/53oyydcvwiie1.png?auto=webp&amp;s=b28384355bb0dc7c21187786587b41e1d27752cb"
        },
        "permalink": "/r/movies/comments/1in0byb/hey_rmovies_im_gints_zilbalodis/"
    },
    {
        "id": "1in4t7h",
        "author": "PaddingtonOfficial",
        "title": "Hello /r/movies. I am Paddington Brown, and I cannot wait to share my exciting new adventure 'Paddington in Peru' with my friends in the USA. Please ask me anything, I look forward to answering your questions.",
        "content": "",
        "upvotes": 109,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4kxambe2ujie1.jpeg?auto=webp&amp;s=fc06aa6bdac9199e339a8c6e3f11759525f5c76d"
        },
        "permalink": "/r/movies/comments/1in4t7h/hello_rmovies_i_am_paddington_brown_and_i_cannot/"
    },
    {
        "id": "1in3fqs",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Mortal Kombat 2'",
        "content": "",
        "upvotes": 10595,
        "comments": 1002,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jgus7mp9kjie1.jpeg?auto=webp&amp;s=0952888bfeeba3996c814fefc952e869458bce7c"
        },
        "permalink": "/r/movies/comments/1in3fqs/official_poster_for_mortal_kombat_2/"
    },
    {
        "id": "1ingpu7",
        "author": "Puzzleheaded_Bus_112",
        "title": "“The Thing” is the perfect horror movie.",
        "content": "Just had the privilege of watching this film all the way through for the first time last night. Haven’t stopped thinking about it since, the main thing for me was just the atmosphere of it all. The setting of them being in Antarctica with nowhere to run, nowhere to hide, is practically perfect for a horror movie. Arguably the best character (and in general) writing I’ve seen from a horror movie, they did everything right that they could, they were a group of scientists and they all acted like it. All came up with perfect plans to survive and figure out the monster. The movie didn’t have to rely on dumb characters to move the plot forward, they instead gave us incredibly smart characters that ended up having no choice but to fail in the end. Plus that ending, so masterfully done, cliffhangers suck until it’s something like that. Keeps you thinking about the movie long, long after you’re done watching it. Absolute 10/10 in my book.",
        "upvotes": 859,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1ingpu7/the_thing_is_the_perfect_horror_movie/"
    },
    {
        "id": "1imz673",
        "author": "MarvelsGrantMan136",
        "title": "Friendship | Official Trailer | A24",
        "content": "",
        "upvotes": 4133,
        "comments": 516,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gRbrz-IoIIiu7wtwG92YfPCk2rZcCuWBMSzMcFzXVY0.jpg?auto=webp&amp;s=87bf6d9b97d77f26e631db657ff089c8d5721b8f"
        },
        "permalink": "/r/movies/comments/1imz673/friendship_official_trailer_a24/"
    },
    {
        "id": "1in6l8y",
        "author": "KillerCroc1234567",
        "title": "Disney+ to Change Content Warnings Ahead Old Movies Amid DEI Strategy Shift",
        "content": "",
        "upvotes": 1548,
        "comments": 434,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NVshrMtaym0Xm9oXsKynRykJ6EvY0XEnbMQ7NYQwgQg.jpg?auto=webp&amp;s=580caf530d35ac3cd38e6186427fd468a2125402"
        },
        "permalink": "/r/movies/comments/1in6l8y/disney_to_change_content_warnings_ahead_old/"
    },
    {
        "id": "1ineg56",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for ‘The Rule of Jenny Pen’ - Confined to a nursing home and trapped within his stroke-ridden body, a former Judge (Geoffrey Rush) must stop an elderly psychopath (John Lithgow) who employs a child's puppet to abuse the home's residents with deadly consequences.",
        "content": "",
        "upvotes": 311,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vpiss20qulie1.jpeg?auto=webp&amp;s=1bda71354d72289da4e890c7205c40fceafbb00f"
        },
        "permalink": "/r/movies/comments/1ineg56/new_poster_for_the_rule_of_jenny_pen_confined_to/"
    },
    {
        "id": "1imw883",
        "author": "MarvelsGrantMan136",
        "title": "New Images of Ben Affleck, Jon Bernthal, J. K. Simmons and Cynthia Addai-Robinson in ‘The Accountant 2’",
        "content": "",
        "upvotes": 3640,
        "comments": 348,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h73t9z5othie1.jpeg?auto=webp&amp;s=20bf622ecca2200d9eff6b429bcf4a892b845253"
        },
        "permalink": "/r/movies/comments/1imw883/new_images_of_ben_affleck_jon_bernthal_j_k/"
    },
    {
        "id": "1in8fsi",
        "author": "DookieSweat",
        "title": "Any examples of movies that created a new fear and changed nationwide behaviors?",
        "content": "Recently rewatched Final Destination 2 and, as a kid who grew up during this time, I have never felt comfortable behind a log truck, and probably never will.\n\nI also imagine folks who saw Jaws in real time also felt new fears about getting in the water.\n\nAre there any other movies that caused rational/irrational fears in a large chunk of the population?",
        "upvotes": 556,
        "comments": 555,
        "media": null,
        "permalink": "/r/movies/comments/1in8fsi/any_examples_of_movies_that_created_a_new_fear/"
    },
    {
        "id": "1in1wss",
        "author": "indiewire",
        "title": "Wes Anderson’s ‘The Phoenician Scheme’ Set for May 2025 Release from Focus Features",
        "content": "",
        "upvotes": 927,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_PHIfm0TMGHjr5yFxVDKIY64_-cQRaDT_tq-B4KieoQ.jpg?auto=webp&amp;s=ec5740b3ba5ef5ba14f89c5856962e678fd0afe0"
        },
        "permalink": "/r/movies/comments/1in1wss/wes_andersons_the_phoenician_scheme_set_for_may/"
    },
    {
        "id": "1imz17k",
        "author": "Pyro-Bird",
        "title": "Female Actors Achieve Parity With Men As Leads In Top 100 Films of 2024",
        "content": "",
        "upvotes": 922,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wyJl4hONq19SivzwAyabEiltskI2x-F-_v2zUp97HFQ.jpg?auto=webp&amp;s=3da68d2ee09c7bf66447a940d18158f5b06a5e91"
        },
        "permalink": "/r/movies/comments/1imz17k/female_actors_achieve_parity_with_men_as_leads_in/"
    },
    {
        "id": "1inib4z",
        "author": "Splonk257",
        "title": "Nonstop action/aggressive movies?",
        "content": "So I'm really into heavy metal, dubstep, neurofunk music.. that sorta stuff and listening to those just get's you so pumped up, Idk how else to explain it.\nI was wondering if there are any movies that would give off the same vibe... just full on agressiveness, action, crazyness?\n\nGenre wise anything really goes.",
        "upvotes": 63,
        "comments": 289,
        "media": null,
        "permalink": "/r/movies/comments/1inib4z/nonstop_actionaggressive_movies/"
    },
    {
        "id": "1ine19p",
        "author": "Alternative-Cake-833",
        "title": "How would The Lord of the Rings films be if they had stuck to Miramax's vision?",
        "content": "So basically, back in 1997 after Peter Jackson's original version of King Kong got cancelled, Jackson moved onto Lord of the Rings when it was already set up at Miramax. It was basically envisioned as this: one Hobbit film, then two Lord of the Rings films under Miramax but UA actually owned the film rights to The Hobbit so they basically just decided to do two Lord of the Rings films and do The Hobbit down the road as a prequel.\n\nWell, Peter Jackson tried to talk Miramax into doing three films but there were intent on only doing two Lord of the Rings films, the first film covering Fellowship of the Ring and Two Towers and the second film covering Return of the King. And Jackson agreed to it for a while. Then somehow during pre-production, Disney CEO Michael Eisner looked at the budget which was $75M a piece for these two films. So basically, after that: Miramax wanted to tell the whole story all in one film. Here's what changes that Jackson made for Miramax's version.\n\n&gt;Between the synopsis and the treatment, Jackson decided to cut Gildor, Crickhollow, the Old Forest, Tom Bombadil, the Barrow-wight, Bill Ferney, Radagast, Lothlorien and Ghan-Buri-Ghan. The final treatment divides the story into two parts: The Fellowship of the Ring (which covered the novel of that name, and The Two Towers) and The War of the Ring. The first opens immediately with the Battle of the Last Alliance (in what Jackson called a \"James Bond\" opening) and ends with Saruman's death, and Gandalf and Pippin (the latter having looked into the Palantir) going to Minas Tirith\n\n&gt;In this treatment, Farmer Maggot and Glorfindel are present; Gwaihir and Gandalf visit Edoras after escaping Saruman, and Eowyn and Eomer help him find Shadowfax against the wishes of a possessed Theoden. Gollum attacks Frodo when the Fellowship is still united, a struggle during which the Ring falls into the mud and is picked up by Boromir. Bilbo attends the Council of Elrond and Sam looks into Galadriel's mirror. At the end of the film, Saruman is shot by an overhead Nazgûl and, before his death, is redeemed through issuing the Palantir for Gandalf to look into. Aragorn, Legolas and Gimli are sent south to espy Sauron's forces, and Frodo and Sam are en route to the Black Gate.\n\n&gt;The second film opens in the thick of battle, and ends with Frodo sailing to the West. It features a more pronounced romantic triangle with Arwen and Eowyn, including a scene of Aragorn and Eowyn \"asleep in each other's arms\"; and has Elladan, Elrohir and Erkenbrand join Aragorn on the Paths of the Dead (the latter dying in the process), which are described as though made of flesh. The Nazgul just make it into Mount Doom before they fall.\n\n&gt;In this version, Farmer Maggot and Fatty Bolger appear. Gandalf is more frail and has given up pipe-smoking, and Gimli's dialogue contains several vulgarities. Sam, Merry and Pippin are all caught eavesdropping behind the door and forced to go along with Frodo. The Nazgul skewer Barliman Butterbur and Wargs attack the Hobbits near Weathertop. Gandalf's account of his time at Orthanc was pulled out of flashback and Lothlórien was cut, with Galadriel doing what she does in the story at Rivendell. Denethor attends the Council of Elrond with his son. The Watcher in the Water, absent from the treatment, is reinstated. Arwen now rescues Frodo instead of Glorfindel, and later joins the battle of Helm's Deep, where a Nazgul sweeps in, only for its fell beast slain by Gimli. Indeed, Theoden's palace is placed in Helm's Deep itself. While on the Seat of Seeing, Frodo sees the Nazgul, having killed Saruman, attack Gandalf. He puts on the Ring to draw him away and is attacked by a fell-beast, which Sam lassos to the structure. The Nazgul attacks Sam before Frodo kills it.\n\n&gt;The second script included a sex scene between Aragorn and Arwen in the Glittering Pools, interrupted by Legolas and Gimli's sight-seeing the caves. Arwen later fends off a Nazgul that menaces Pippin and joins the Rohirrim. The writers considered having Arwen absorb Éowyn's role entirely by having her kill the Witch-king, with the resulting wound becoming the source of her illness. Faramir finds Frodo after Denethor sends him to do so, having learned the secret of the quest from Pippin. Imrahil and Forlong appear in the script, and Aragorn fights Sauron in front of the Black Gates\n\n&gt;Bob Weinstein commissioned Jack Lechner to sketch a one-film version of the story. Lechner saw the story as too \"dense\" and that any two-film version would have left audiences unfulfilled since the story was only \"half-told\". He thought Frodo was a weak character. On 17 June 1998, he sent a memo in which he suggested cutting Bree and the Battle of Helm's Deep, \"losing or using\" Saruman, merging Rohan and Gondor, and making Éowyn Boromir's sister, shortening Rivendell and Moria (losing the Balrog and the fight in Balin's Tomb in the process) as well as having Ents prevent the Uruk-hai from kidnapping Merry and Pippin.\n\nEven Peter Jackson admitted that cutting out half of the good stuff was not a good idea at all despite Miramax trying to force him to do at first, one four-hour film, then one two-hour film. In fact, Harvey Weinstein told Peter Jackson that Weinstein wanted Quentin Tarantino to direct it but the idea was shut down. Eventually, Miramax let Peter Jackson shop around the film but limiting the turnaround window to four weeks so that they could force Peter Jackson to do the one-film version. Before the four-week period was over, Jackson found a buyer with New Line to distribute, finance and produce these movies and not only that, Bob Shaye convinced Peter Jackson to do three Lord of the Rings movies, not two of them and the rest is history.\n\n",
        "upvotes": 106,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1ine19p/how_would_the_lord_of_the_rings_films_be_if_they/"
    },
    {
        "id": "1imh555",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24’s ‘Friendship’ Starring Tim Robinson &amp; Paul Rudd",
        "content": "",
        "upvotes": 25752,
        "comments": 1015,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ifk944o1ndie1.jpeg?auto=webp&amp;s=b9c63c43c8ba34df6a729b5c649039c54f9ff7ed"
        },
        "permalink": "/r/movies/comments/1imh555/official_poster_for_a24s_friendship_starring_tim/"
    },
    {
        "id": "1injpic",
        "author": "Optimus_Pyrrha",
        "title": "I feel like 80s films had the best songs.",
        "content": "I notice that ALMOST every movie from the 1980s had a soundtrack featuring variaties of songs. Whether they are from popular artisit or artist that have flown under the radar, they make me want to move to the beat. In my opinion, songs from film soundtracks are what define 80s music rather than the hits that play on the radio. Even if some radio hits were written for movies. For me, the movies from the 80s that had the best songs are *Night of the Comet, Transformers: The Movie, and The Wraith*. ",
        "upvotes": 23,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1injpic/i_feel_like_80s_films_had_the_best_songs/"
    },
    {
        "id": "1in5sju",
        "author": "Suppa_K",
        "title": "I absolutely loved Ad Astra. (Spoilers)",
        "content": "I had this movie on the back burner for literal years. Heard a little about why people weren’t so hot on it when it released, understood why. I had zero expectations really besides the trailer and knew it wasn’t some space faring action movie. \n\nTo be honest I don’t even love the plot but I think it was the world really. It’s one of the few movies that made you really feel how exhausting and long space travel could be. It really felt like I went on a journey with the protagonist. It felt absolutely grande from the opening on the space antenna, to the launches and vistas arriving on different planets. \n\nI loved how we watch Roy take his journey starting on a commercial flight, to the more treacherous journey to Mars and eventually beyond. By the time we got to Neptune I really felt like we were billions of miles away from where we started on Earth. It felt mysterious every step of the way. \n\nBy no means was this movie perfect but it left me wanting more. Despite plot holes or characters not having enough dialogue it felt so realistic. It really felt like this could be what a future in space looked like. I loved all the little details and things that just made me think like how the one character he met on mars was born there! How insane is that?! The whole time I kept thinking of the logistics of getting everything to these planets as well, it must have been a huge effort. \n\nThe action and suspense I thought was sprinkled in very well. The strange space pistols, pirates, the way how there was minimal sound when explosions and bullets are flying on the moon. The incident on the Cepheus too, so brutal how that one woman died during take off. \n\nSo much of it was so raw and intense. I think the minimal and somewhat flat dialogue actually made it feel more real. The research baboon was such a shock to me too. I loved that idea and it was horrifying. I feel like you could tell a million stories in this universe without things getting too alien or paranormal. I was honestly expecting aliens in the end, but I think not getting them was the right choice but I still would have loved to see how this movie portrayed it. \n\nI don’t know what it is that makes me love this movie so much, it’s only grown on me since I’ve seen it. I think it’s an amazing example of how a movies world building and aesthetics can truly draw you in and give you something besides the story to lean on. \n\nFor me this movie was the definition of “it’s about the journey not the destination” there’s been recently. I’d loved to hear others thoughts, I know this movie was mildly received but it’s not often we get something unique like this imo. ",
        "upvotes": 142,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1in5sju/i_absolutely_loved_ad_astra_spoilers/"
    },
    {
        "id": "1inmcn0",
        "author": "mrjohnnymac18",
        "title": "James McAvoy to receive outstanding contribution award at Glasgow Film Festival",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NEJ00PcnUM_rm-EiiRxBGmBUELBz8KGNbsMWPO0eqKA.jpg?auto=webp&amp;s=9958991c0c5bbf07f3f2390c2f74ea7a02ab7e46"
        },
        "permalink": "/r/movies/comments/1inmcn0/james_mcavoy_to_receive_outstanding_contribution/"
    },
    {
        "id": "1in136m",
        "author": "YoureASkyscraper",
        "title": "Green Day is working on a film inspired by their years in a tour van. The film is titled 'New Years Rev' and is currently in production and features The Office actresses Jenna Fischer and Angela Kinsey.",
        "content": "",
        "upvotes": 218,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kkOicG3Bj4mClnJOwXT1XT-9qrgVL0Wft5hnUunDfPA.jpg?auto=webp&amp;s=2c3b4b87aebf367989125d78d41363a19286eaf6"
        },
        "permalink": "/r/movies/comments/1in136m/green_day_is_working_on_a_film_inspired_by_their/"
    },
    {
        "id": "1ina9yq",
        "author": "Amaruq93",
        "title": "Actor Carl Lumbly discusses his many Film and TV roles: from \"Buckaroo Banzai\" and \"South Central\" to \"Cagney &amp; Lacey\" and J'onn J'onzz on \"Justice League\"",
        "content": "",
        "upvotes": 59,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ina9yq/actor_carl_lumbly_discusses_his_many_film_and_tv/"
    },
    {
        "id": "1in1wab",
        "author": "NoCulture3505",
        "title": "Kristen Wiig, Bill Murray to Star in Comedy ‘Epiphany’ From ‘Palm Springs’ Director, Rocket Science Selling at EFM",
        "content": "",
        "upvotes": 141,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ipttE3b8yLGpefHL5gJpR91O2Ffnv9RD283NZzN_HiU.jpg?auto=webp&amp;s=f430fa06705d11fa92eb2e06c57245b55f54d556"
        },
        "permalink": "/r/movies/comments/1in1wab/kristen_wiig_bill_murray_to_star_in_comedy/"
    },
    {
        "id": "1imzs79",
        "author": "johntentaquake",
        "title": "The Quick and the Dead: Sam Raimi’s Mythological Western Looms Larger Than Life at 30",
        "content": "",
        "upvotes": 167,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1imzs79/the_quick_and_the_dead_sam_raimis_mythological/"
    },
    {
        "id": "1inhaz6",
        "author": "bell-town",
        "title": "What are some movies that celebrate long-term relationships, as opposed to \"getting the girl\"?",
        "content": "I think a A Ghost Story (2017) with Rooney Mara and Casey Affleck is a good example... at least at the beginning.\n\nThere's one scene in 50/50 where JGL's character sees an affectionate older couple and envies them.\n\nIt seems like so many movies are either about breaking up or getting together, but few celebrate committed long-term relationships.",
        "upvotes": 14,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1inhaz6/what_are_some_movies_that_celebrate_longterm/"
    },
    {
        "id": "1inl5i3",
        "author": "Rosameer",
        "title": "I quite enjoy movies with neurotic characters (anxious, depressed, angry) that are both dramatic and funny. Do you relate? Favorite of mine is Little Miss Sunshine.",
        "content": "What are some movies you've enjoyed with sad or anxious characters? I mean movies that take a light and humorous approach to dealing with issues like anxiety, depression, loss, and other similar issues. I recently saw a film about loss but the movie was way too depressing and I did not finish watching it, so got me thinking that it's best to try to find films that while they let you face the reality the approach is not all serious and humorless.\n\nLittle Miss Sunshine does it so well. I mean it deals with &gt;!suicide attempt!&lt;for God's sakes, that's how it begins! Not exactly funny. Serious stuff. And the family all got their neuroses and ticks and mistaken assumptions about the world. They can't relate to each other, have their own dreams that are bound to fail, yet share a common humanity that links them in a very deep level. Not just to each other but to us. So while we laugh at them, we also laugh with them because there is a little of bit of that in all of us.",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1inl5i3/i_quite_enjoy_movies_with_neurotic_characters/"
    },
    {
        "id": "1imuxot",
        "author": "KillerCroc1234567",
        "title": "Dave Bautista To Lead Dystopian Sci-Fi Thriller ‘Dreadnought’ For ‘John Wick’ Producers Thunder Road; WME Independent Launching For EFM",
        "content": "",
        "upvotes": 305,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Q9QRDoCdeYe_-I3k4zYaiedNfmO1qQTIThRpSDkGvrA.jpg?auto=webp&amp;s=f97c7ea27855f58ca05ba536f73204c0fae27a98"
        },
        "permalink": "/r/movies/comments/1imuxot/dave_bautista_to_lead_dystopian_scifi_thriller/"
    },
    {
        "id": "1in40pq",
        "author": "Sprightly_Rosa",
        "title": "Dennis Haysbert Latest To Join Sam Raimi’s ‘Send Help’",
        "content": "",
        "upvotes": 73,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jluhCGUG-3dAd-QByrybEhPGAAae_zGT19O6tSMS2LQ.jpg?auto=webp&amp;s=698618db5b158bae53d46ce90521fb63fa285b80"
        },
        "permalink": "/r/movies/comments/1in40pq/dennis_haysbert_latest_to_join_sam_raimis_send/"
    },
    {
        "id": "1in8chh",
        "author": "Aggravating_Hat_8180",
        "title": "Manhunter. First time watching.",
        "content": "So I just watched Manhunter for the first time. As a long time fan of horror, thriller and true crime, and a long time lover of Silence of the Lambs, I was plenty surprised at this film. \n\nI enjoyed it as the first film adaptation, and find myself interested in researching the telling of the story from the book, and seeing which of the two film adaptations is most in line with it. \n\nSure, some cheesy 80s shlock here and there, but when Tom Noonan or Brian Cox are on screen, boy do you pay attention! \n\nWhat did you guys think? ",
        "upvotes": 39,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1in8chh/manhunter_first_time_watching/"
    },
    {
        "id": "1injt6f",
        "author": "Low_Yam_9157",
        "title": "Your must-watch movies from the last 2 decades?",
        "content": "Basically, I have watched VERY few movies in the last 15-20 years. When I was younger, I loved movies, watched many, and generally kept up with them and watched many of the classics and most notable movies. Now, however, I've seen maybe a dozen (at most) new and relevant movies in the last 15-20 years. I am looking to change that and catch up on lost time and good movies that have flown by me. What are your absolute must-watch movies that came out in the last 2 decades? Whether it be beautifully shot, a fantastic and engaging story, emotional or impactful, the reasoning behind it is up to you. Please keep your list to ideally around 5 movies, and please no MCU or other superhero movies (no hate whatsoever! just not my thing). This doesn't have to be your \\*personal\\* top 5 of the last 20 years, just movies you think are particularly important and should be watched. If I may sway your limited choices/recommendations in a particular direction, I am a huge fan of horror (paranormal to the front of the line), mind-fuck/psychological topics, general uniqueness, and just dark/spooky vibes. \n\nTL;DR Please list 5 or so of your most recommended movies from the last 2 decades. Respectfully, no MCU or superhero movies. ",
        "upvotes": 6,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1injt6f/your_mustwatch_movies_from_the_last_2_decades/"
    },
    {
        "id": "1in6lsq",
        "author": "KillerCroc1234567",
        "title": "New poster for ‘Penguin Lessons’ starring Steve Coogan &amp; Jonathan Pryce",
        "content": "",
        "upvotes": 46,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tkg20xk37kie1.jpeg?auto=webp&amp;s=8808500ec1668152cc0900ce09864a092b207f39"
        },
        "permalink": "/r/movies/comments/1in6lsq/new_poster_for_penguin_lessons_starring_steve/"
    },
    {
        "id": "1in83m0",
        "author": "SosseV",
        "title": "What movie did you watch because of this sub?",
        "content": "I've watched quite a few movies just because they are often mentioned in this sub, as I respect all your opinions. \nMost of them were absolute hits (12 angry men and Edge of tomorrow, the unbearable weight of massive talent and Gattacato name a few), but I just now finished watching Pacific Rim and it did not click for me at all. \n\nIt's referenced here a lot as one of those perfect action movies, but I was a bit disappointed. Just not my thing I guess, which might not be so strange as I have no affiliation with the whole anime thing as well.\n\nThat's the risk for going in blind except for the comments in this sub and it's a risk I am very willing to take, as most of those films were absolutely brilliant. \nJust made me wonder what movies other people here watched because of this sub.",
        "upvotes": 36,
        "comments": 157,
        "media": null,
        "permalink": "/r/movies/comments/1in83m0/what_movie_did_you_watch_because_of_this_sub/"
    },
    {
        "id": "1imlcvm",
        "author": "MarvelsGrantMan136",
        "title": "Peter Navy Tuiasosopo Dies: Honda in ‘Street Fighter' &amp; ‘Necessary Roughness' Actor Was 61",
        "content": "",
        "upvotes": 1182,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqVohzpwfgf7FxvrfverViRgtiIcvwjL_oT5DkbImvM.jpg?auto=webp&amp;s=99ae1dc4c34e6b6ef96870a5500d1cf88b070429"
        },
        "permalink": "/r/movies/comments/1imlcvm/peter_navy_tuiasosopo_dies_honda_in_street/"
    },
    {
        "id": "1in872k",
        "author": "indiewire",
        "title": "Sigourney Weaver on 'The Gorge' and Her Next James Cameron Reunion (Interview)",
        "content": "",
        "upvotes": 25,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9NbOf2oTSTdDFoDDXBCYzNQNeG7cNrck0WWWiHu41rs.jpg?auto=webp&amp;s=fd5757882a171223acef0a8610e49084b14d2a82"
        },
        "permalink": "/r/movies/comments/1in872k/sigourney_weaver_on_the_gorge_and_her_next_james/"
    },
    {
        "id": "1imifh6",
        "author": "ezikial2517",
        "title": "The Other Guys end credits go hard in today's economic climate",
        "content": "I rewatched The Other Guys for the first time since it came out, and I liked it way better than the first time I saw it. In 2010 I was kind of Will Ferrell'd out after being a big fan in the Anchorman era. \"Aim for the bushes\" is an all-timer, Michael Keaton kills it, and I had a blast whenever Ray Stevenson was on screen (RIP). However, the biggest impact for me was the end credits. \n\nSince the main plot point revolves around financial fraud, the credits are a series of infographics displaying the basics about Ponzi schemes, government bailouts, and CEO compensation contrasted to worker salaries. These numbers have only ballooned further in the last decade and a half, as have the societal frustrations. It was a really clear and effective way to get a message about class inequality across at the end of a great action comedy.\n\nFor anyone who hasn't seen it or doesn't remember much about it, it's definitely a solid watch, and it's under 2 hours, which is always appreciated.",
        "upvotes": 1602,
        "comments": 162,
        "media": null,
        "permalink": "/r/movies/comments/1imifh6/the_other_guys_end_credits_go_hard_in_todays/"
    }
]