[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o8jkte",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat Is Back.",
        "content": "I've been  waiting for season 3 of the Diplomat.... It wasn't a long wait and at least there's 8 episodes. Season 2 was a longer wait with 6 episodes... I dnt think 10 episodes is a thing anymore.",
        "upvotes": 85,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o8jkte/the_diplomat_is_back/"
    },
    {
        "id": "1o8aq54",
        "author": "Dariusgamer2007",
        "title": "Anyone else just can’t seem to watch Netflix anymore?",
        "content": "I don’t know if I’m going through a ‘burnt out’ phase with Netflix but I just can’t bring myself to watch new things anymore. Plenty of movies and series but when I try to watch one I just exit Netflix. Is it possible to be burnt out from watching movies &amp; series? ",
        "upvotes": 71,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1o8aq54/anyone_else_just_cant_seem_to_watch_netflix/"
    },
    {
        "id": "1o8itsw",
        "author": "Ember_Grove20",
        "title": "Any Netflix show or movie where you really loved the soundtrack?",
        "content": "I was rewatching Bridgerton, and I just love the music in it. It made me wonder what other Netflix shows or movies have soundtracks you really enjoyed.",
        "upvotes": 19,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1o8itsw/any_netflix_show_or_movie_where_you_really_loved/"
    },
    {
        "id": "1o8iyhk",
        "author": "CaptPeterlolol",
        "title": "The Haunting Of...",
        "content": "Was curious if the Haunting Of Hill House &amp; Bly Manor was worth a watch? Or if one is better than the other? It's hard to make out what kind of horror it is from the trailer. For example I really enjoyed the Conjuring films by James Wan and don't mind Supernatural elements as long as it doesn't take a front seat ahead of everything else too much.",
        "upvotes": 14,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1o8iyhk/the_haunting_of/"
    },
    {
        "id": "1o7qh13",
        "author": "lithdemi",
        "title": "So many Netflix shows get cancelled before their story is done — which one still haunts you?",
        "content": "I was talking with some friends about how shows like Warrior Nun and The OA got pulled even with solid fanbases.\n\nCurious what everyone here thinks:\n\n– Which cancellations hurt the most?\n– Which one could actually come back if fans organized?\n\n(I’m helping run a community that’s discussing this across fandoms, so I’m collecting opinions.)",
        "upvotes": 438,
        "comments": 1030,
        "media": null,
        "permalink": "/r/netflix/comments/1o7qh13/so_many_netflix_shows_get_cancelled_before_their/"
    },
    {
        "id": "1o8foj5",
        "author": "wicked56789",
        "title": "Finished the Hunting Wives…what to watch next?",
        "content": "I’m a mid-30s mom. Probably into what you’d stereotypically expect for that demographic 😅. Any suggestions for shows that have 6-10 episodes? I’m okay if it invites a new season, but like the idea of it wrapping up the current story line (like Hunting Wives did). I saw *House of Guinness* but audience reviews look pretty bleak. ",
        "upvotes": 6,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1o8foj5/finished_the_hunting_wiveswhat_to_watch_next/"
    },
    {
        "id": "1o7uu14",
        "author": "juneseyeball",
        "title": "Worst thing you’ve seen on Netflix recently?",
        "content": "Just watched the Maze Runner series after it was recently added to the Netflix catalogue. Absolute garbage after the first half of the first movie (and yes, I read the books back in ancient times). \n\nAdd it to the load of pitiful nonsense Netflix has added recently like Billionaire Bunker. Which duds have you wasted hours of your life watching? ",
        "upvotes": 121,
        "comments": 500,
        "media": null,
        "permalink": "/r/netflix/comments/1o7uu14/worst_thing_youve_seen_on_netflix_recently/"
    },
    {
        "id": "1o8b4is",
        "author": "Atlast_2091",
        "title": "The Beast in Me | Official Trailer | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o8b4is/the_beast_in_me_official_trailer_netflix/"
    },
    {
        "id": "1o85h1q",
        "author": "nw86281",
        "title": "Anyone getting a program/movie auto-starting when selecting it (so you can't see the screen with episode choice or synopsis)?",
        "content": "Not sure if this is a recent update from Netflix but it's extremely annoying. If I am watching a series on Netflix and choose the program, it used to open a screen where you can view the different episodes/add to watchlist/view similar etc. You then had an option to play it. It now starts auto-playing whenever you select an item and you have to go to an option on the screen to see an episode list. This happens on Apple TV and Google TV. \n\nIs there any way to turn this really annoying feature off? I've turned off previews in the profile but that makes no difference - it actually starts playing the item everytime.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o85h1q/anyone_getting_a_programmovie_autostarting_when/"
    },
    {
        "id": "1o8mdzc",
        "author": "Fragrant-Job-1889",
        "title": "Good scary movies ?",
        "content": "Has anyone seen any Good scary movies on Netflix? Any recent ? Wondering if there is anything good I haven’t seen. I also like suspenseful movies of anyone has any good suggestions on those. \n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o8mdzc/good_scary_movies/"
    },
    {
        "id": "1o8kgly",
        "author": "panhellenic",
        "title": "Good Movies on Netflix?",
        "content": "So I'm housesitting tomorrow and the place I'm staying has only Netflix as a streamer. Looking for a movie or two to watch while there. Movies, no series please.\n\nI like thriller, suspense, action, mystery. I saw that the Woman in Cabin 10 started, but I'm reading how awful it is, so no go there. I like stuff with at least a \"7\" rating on IMDB (although I know that's subjective - I've like stuff they have as a 6 and bored by something rated \"8\"). \n\nSo, whatcha got?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o8kgly/good_movies_on_netflix/"
    },
    {
        "id": "1o8j7sl",
        "author": "-KUMINGA-",
        "title": "Any good Zombie movies or shows on netflix UK?",
        "content": "Looking for a good zombie movies or show on netflix uk, been stumbling upon too much trash recently a bunch of stuff that looks good on the thumbnail but is very bad.\nAlso I've seen WWZ as I noticed it's on there so that's off the menu.\nSomething maybe grounded normal zombies not looking for flying alien zombies that breath fire uno.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o8j7sl/any_good_zombie_movies_or_shows_on_netflix_uk/"
    },
    {
        "id": "1o86ij6",
        "author": "Minute_Emu_9225",
        "title": "Show endings spoiled on socials",
        "content": "Does anyone think Netflix has been doing a terrible job at keeping cast members quiet until the full show airs anymore? It’s like anyone says or posts whatever they want, constantly spoiling the endings. The perfect match we all knew Ollie and AB made it as a couple (I love them of course) and I have heard plenty of Podcasts already from multiple LIB s9 talking about their experiences. Anton posted with a new girl? What is happening that these shows have no element of surprise anymore? I thought they used to have to sign a contract. I think it has to do with their long draw out on weekly episodes, but that’s just me. Air the season all at once!!! ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o86ij6/show_endings_spoiled_on_socials/"
    },
    {
        "id": "1o8a5oy",
        "author": "ellegrow",
        "title": "Nurse Jackie - Removed from Netflix Canada?",
        "content": "I started watching Nurse Jackie on Netflix Canada last week. This week it is no longer there. Does anyone know what happened? Was it mistakenly added to the Canada catalogue?\n\n",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o8a5oy/nurse_jackie_removed_from_netflix_canada/"
    },
    {
        "id": "1o81zmf",
        "author": "unholyburner",
        "title": "4k titles? Well, ask yourself",
        "content": "Hey there,\n\ncurrently I am watching Interstellar. I am paying 14-15 euro each month for the 4K subscription. You know, you may be wondering why I am actually here, typing this text, however I have been interested in the real answers for some time.\n\nHow is it possible, that Interstellar is not in 4K option?\n\nOr even better question is.... HOW many movies are you able to find that are in 4K available on Netflix? Just find some spare time to search throughout the genres and movies and series and try to do some math and calculation. For an example, search through random 100 movies and write in the comment section the actual result of 4k movies that you find.\n\nI mean, this cannot be serious. I pay 14-15 EURO a month so I can watch movies in 4K and actually there are only a few out of hundreds. How is this possible?\n\nWhose idea was to put Interstellar on Netflix with that trashy resolution? What is it? FHD? Where's 4K? Where's the IMAX 4K version so I can enjoy that? I am currently at the 36th minute and the quality of face is like painted out of Minecraft game.\n\nDo you have any explanation why I am not seeing titles in 4K, but rather old-trashy FHD? So why am I even paying for 4K when like all movies I have watched so far, were not in 4K at all....",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1o81zmf/4k_titles_well_ask_yourself/"
    },
    {
        "id": "1o87tht",
        "author": "GenevieveCostello",
        "title": "Are Diplomat season2&amp;3 worth watching?",
        "content": "I finished watching Diplomat season 1 a few months ago and tried the first few episodes of season 2 when it was released, but I failed to get hooked on it and felt quite bored. Did you guys enjoy season 2 and are you willing to try season 3? \nshare your opinions:)",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o87tht/are_diplomat_season23_worth_watching/"
    },
    {
        "id": "1o8j4d2",
        "author": "RedKl0wn",
        "title": "Is it worth paying just to play Netflix exclusive games?",
        "content": "Just as you hear it, I don't have much time due to my job, and when I do have some free time, I always prefer to play video games rather than, for example, watch a series or movie. Just as you hear it, I don't have much time due to my job, and when I do have some free time, I always prefer to play video games rather than, for example, watch a series or movie. I've had Netflix before and was happy with the platform, but when the prices went up and you couldn't share an account anymore, I just stopped using the service. Now, I'm thinking about getting it, since there are some games that catch my attention and having it on my phone makes it more convenient for me to play in my free time. I wonder if these games are really worth it and what their average length is (I imagine each one has its own style and some will last longer than others, but in general). Can these games take months to complete? Or can they be completed in a week, depending on the hours you put in? As I said, I have little time, so I'm more interested in shorter games, preferably so I don't have to pay for the service once or twice.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o8j4d2/is_it_worth_paying_just_to_play_netflix_exclusive/"
    },
    {
        "id": "1o712m6",
        "author": "sftradersf",
        "title": "Netflix has gone to the dogs",
        "content": "Just tried to watch and finish Cabin 10, which was “#1 in the movies today,” and it’s the worst show they’ve put on in ages. I think this streaming service has seriously jumped the shark \n\nIt’s been a little over a year now but it seems as if every single new show is just a horrific plot trying to garner some kind of notoriety or great experience and it’s just the exact opposite. I’m so disappointed with everything they seem to put out that I now think it’s time to call it. They’re just awful now!",
        "upvotes": 975,
        "comments": 592,
        "media": null,
        "permalink": "/r/netflix/comments/1o712m6/netflix_has_gone_to_the_dogs/"
    },
    {
        "id": "1o8awms",
        "author": "MysteriousDelay6266",
        "title": "Jingle Bell Heist | Official Trailer | Netflix | NOVEMBER 26",
        "content": "# Jingle Bell Heist\n\nThis holiday, payback never looked so festive.\n\nOlivia Holt &amp; Connor Swindells\n\nSophia (Olivia Holt), a sharp-witted retail worker, and Nick (Connor Swindells), a down-on-his-luck repairman, are small-time thieves with their eyes on the same Christmas Eve score: robbing London’s most notorious department store. Forced into an uneasy alliance, as secrets surface and feelings for each other deepen, Sophia and Nick put their relationship and the heist in jeopardy.\n\n* Only on Netflix **NOVEMBER 26**.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o8awms/jingle_bell_heist_official_trailer_netflix/"
    },
    {
        "id": "1o8akwt",
        "author": "hard2resist",
        "title": "Netflix's No. 1 Movie Is a Fun Thriller With a Weird Flaw",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o8akwt/netflixs_no_1_movie_is_a_fun_thriller_with_a/"
    },
    {
        "id": "1o7af4r",
        "author": "Secretly-Aware",
        "title": "Kingdom has to be the best piece of “zombie” media I’ve seen.",
        "content": "I was blown away by the quality of this show and don’t know why everyone isn’t talking about it. If you like zombie stuff, please go watch this show. If you don’t like zombie stuff, go watch it. The storyline is so complex and there are so many nail-biting political plots going on that there are entire episodes where I forgot that zombies exist. Love the alternate 17th century world-building, love the character development, love the HATS, people just go watch this for the hats alone and you won’t be disappointed.",
        "upvotes": 108,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1o7af4r/kingdom_has_to_be_the_best_piece_of_zombie_media/"
    },
    {
        "id": "1o865pb",
        "author": "Normal-Paper-312",
        "title": "Can I get some help with why my screen is only in the middle?",
        "content": "My Netflix is only running in the middle with two black screens at the top and bottom of my monitor any help it has been happening for the past few months and I’ve tried a lot of things to fix it but nothing works",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o865pb/can_i_get_some_help_with_why_my_screen_is_only_in/"
    },
    {
        "id": "1o8657c",
        "author": "Purple_Garage1199",
        "title": "Thinking of getting a subscription - how bad are the ads? Best deals?",
        "content": "The price difference is quite large between with ads and ad free....how bad are the commercials? Also, what I've done with Hulu for a while is pay for a month, then pause it (Hulu can be paused for up to 12 weeks at a time). I'm kinda done with the Hulu content, so I just canceled that subscription altogether. CAn I do that with Netflix, too? Just watch for a month and then pause? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o8657c/thinking_of_getting_a_subscription_how_bad_are/"
    },
    {
        "id": "1o8642o",
        "author": "JamGinGin",
        "title": "Show about video games",
        "content": "There was a show that was on Netflix between 2015-18 about the history of video games, anyone know what this show was? I think one of the hosts was a girl and I remember it was comedic ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o8642o/show_about_video_games/"
    },
    {
        "id": "1o84it1",
        "author": "Apprehensive-Star704",
        "title": "On the Netflix home screen, each show is a blank screen, and suddenly unable to play shows more than half the time - anyone experience this before or now?",
        "content": "On my local network, when I go to Netflix on any device, all the shows are black boxes, no previews, and when I play a show, most of the time it  is just the red circle going round. Sometimes the show does play but takes ages for it to load(I have a 750mbps connection)\n\nThis just started today and only happens on my local network. I've already reset my router + modem, confirmed it happens on all devices(apple tv, fire tv, phone) though I restarted these devices and even reinstalled netflix.\n\nNetflix works on my 5G connection.\n\nMy ISP says they are unable to see any issues on their network. I worked with them, they checked the screenshot of the issue, HAR file, etc. Everything else works as well - all websites, steam, prime, twitch, etc. It's really just netflix on my home connection. It worked with no issues for years.\n\nNetflix support was frustrating to say the least. I just learned they can't even receive a screenshot and was just asked to restart my router, device, everything I already did. I did anyway but yeah no dice.\n\nAnyone experienced the same thing?\n\nImage for reference [https://ibb.co/sJVSgcNB](https://ibb.co/sJVSgcNB)\n\nI mean it almost seems as if there's something in my local network that is blocking Netflix but I checked my Netgear router and I do not see any armor turned on, nor any content filter or any filters at all. Not sure what else I am missing.\n\n  \nThanks in advance for any advice. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o84it1/on_the_netflix_home_screen_each_show_is_a_blank/"
    },
    {
        "id": "1o7ioo7",
        "author": "Dazzling_Schedule365",
        "title": "Looking for shows with that Breaking Bad vibe",
        "content": "Hey *Breaking Bad* community,\n\nI’m truly grateful to have finally watched *Breaking Bad*. I can’t believe I had been missing such a masterpiece for so long. Now that I’ve finished the series, it has left me feeling both happy and sad at the same time.\n\nI’m wondering if there are any other shows out there with a similar vibe — cartels, building an empire, and that intense atmosphere I loved so much. If you have any recommendations, please feel free to share them.",
        "upvotes": 27,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1o7ioo7/looking_for_shows_with_that_breaking_bad_vibe/"
    },
    {
        "id": "1o8437z",
        "author": "Good-Schedule-5821",
        "title": "will Netflix mobile work on iPad 5?",
        "content": "just checking because I've subscribed to amazon prime mobile, and it cannot work on my iPad. it says that I need to upgrade my package to a standard one. will I have a problem like that on Netflix? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o8437z/will_netflix_mobile_work_on_ipad_5/"
    },
    {
        "id": "1o7loq0",
        "author": "Nook_6",
        "title": "Recommendations for a mini series that ends properly please",
        "content": "I’ve watched a few of the Harlan Coben adaptations on Netflix. They were mostly decent, some I liked more than others.\nThen I started watching other mini series and I keep getting disappointed. \nThe most recent two were “The Watcher” and “Wayward”. I felt like they had such good potential and I was intrigued to say where they’re going, but then the endings were just terrible.\nSo please, if you could recommend a short series with a decent story and a proper, thought out ending, that’d be great!\nI don’t care about genres, I watch everything.\n\nThank you! ",
        "upvotes": 19,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1o7loq0/recommendations_for_a_mini_series_that_ends/"
    }
]