[
    {
        "id": "1r10fpm",
        "author": "PollyFindlay-AMA",
        "title": "Hello /r/movies. I'm Polly Findlay, director of MIDWINTER BREAK. Starring Lesley Manville and Ciarán Hinds, it's based on the best-selling novel from Nick Payne and it's out in theaters next week. It Ask me anything!",
        "content": "Hello r/movies, I'm Polly Findlay, director of MINDWINTER BREAK. It's out in theaters starting Friday, February 20 and stars the wonderful Lesley Manville (PHANTOM THREAD) and Ciarán Hinds (BELFAST). It's my feature directorial debut.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=FeD\\_KEGIU\\_Q](https://www.youtube.com/watch?v=FeD_KEGIU_Q)\n\n**Synopsis:**\n\n&gt;Longtime retired couple Stella and Gerry realize that their relationship has reached a crossroads while on holiday in Amsterdam. After so much time and so many memories, long-held promises and deeply concealed wounds threaten to come to light and force them to confront their future.\n\nFocus Features is also offering free tickets to reddit users in LA, NYC, Austin, and Chicago here if you're interested (for screenings on Thursday 2/19):\n\n* [NYC - AMC Lincoln Square - 2/19 at 7:30 PM (Local Time)](https://docs.google.com/forms/d/e/1FAIpQLSfjNYcel8Fp5DE47nkD4KmFBQCLzamXIAItvVcG4z6guzLfcA/viewform?usp=publish-editor)\n* [LA - AMC The Grove - Thursday 2/19 at 7:30 PM (Local Time)](https://docs.google.com/forms/d/e/1FAIpQLSc-3D6YCe9rqViKibXTyq2zys_nmqBpC-7XmlGXs-ySlZUiDA/viewform?usp=publish-editor)\n* [Chicago - AMC River East - Thursday 2/19 at 7:00 PM (Local Time)](https://docs.google.com/forms/d/e/1FAIpQLSdtXmLQ-O0MT7JkRkTmb9imkucwLaQtSU2zn3wyds1DXSkSMQ/viewform?usp=publish-editor)\n* [Austin - AMC Barton Creek - Thursday 2/19 at 7:00 PM (Local Time)](https://docs.google.com/forms/d/e/1FAIpQLSfSP1rwoZF_ZPCMbR7Zc97c5bnhdana3dRcABuzRxlwEbKOzg/viewform?usp=publish-editor)\n\n**Bio:**\n\n&gt;POLLY FINDLAY (Director) is one of the UK’s leading theatre directors. Her recent productions include Alma Mater (Almeida Theatre), Assassins (Chichester Theatre), Beginning (National Theatre and West End), Middle (National Theatre), Rutherford &amp; Son (National Theatre), White Noise (The Bridge), A Number (The Bridge) and The Prime of Miss Jean Brodie (Donmar Warehouse). She is also developing her own feature film, Do No Harm, with BBC Films, Hinterland and Fable Pictures.\n\nAsk me anything :) I'll be back Wednesday 2/11 (tomorrow) at 3 PM ET to answer your questions.",
        "upvotes": 10,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uqz1r2210lig1.png?auto=webp&amp;s=9fb44cb58b86d2b48ec3ea8ec1cfd482dee5a794"
        },
        "permalink": "/r/movies/comments/1r10fpm/hello_rmovies_im_polly_findlay_director_of/"
    },
    {
        "id": "1r0ih8i",
        "author": "KevinLewisAMA",
        "title": "Hi /r/movies! I'm Kevin Lewis. I directed WILLY'S WONDERLAND, starring Nicolas Cage. My newest film, MISDIRECTION, stars Frank Grillo &amp; Olga Kurylenko, and it's out now. Ask me anything!",
        "content": "Hi Reddit! I'm filmmaker Kevin Lewis. My latest directorial effort starring Frank Grillo, Olga Kurylenko, and Oliver Treyvana - ***Misdirection*** is now streaming on your favorite PVOD platforms courtesy of Cineverse (the maniacs behind Terrifier 3 and The Toxic Avenger).\n\nWe AMA'd last month with I unleashed ***Pig Hill***, starring Rainey Qually and Shane West (also from Cineverse). And don't forget ***Willy's Wonderland*** starring Nic Cage!\n\nSynopsis for ***Misdirection***:\n\n&gt;A couple's trust is tested on their last \"big job\", as their victim reveals a hidden agenda resulting in murder.\n\n**Trailer**: [https://www.youtube.com/watch?v=lJvxW4V9wYc](https://www.youtube.com/watch?v=lJvxW4V9wYc)\n\n**Instagram**: [https://www.instagram.com/kevinlewisofficial/](https://www.instagram.com/kevinlewisofficial/)\n\n**Bio**: Filmmaker Kevin Lewis planted his cult flag on planet horror with Willy’s Wonderland (starring Nicolas Cage in a dialogue free performance) and quickly followed it up with the horror film The Accursed starring Mena Suvari. Cineverse (Terrifier 3, The Toxic Avenger) just released the action thriller Misdirection, and the Southern Gothic tale Pig Hill which premiered at FrightFest earlier this year. After almost succumbing to Covid back in 2021 (two weeks before Willy's release), Kevin has committed himself to not stop doing what he loves... making genre movies. Look for his upcoming films Oak and I Am Your Driver starring Jeremy Piven.\n\nAsk me anything! I'll be back tomorrow (Tuesday 2/10) at 6:30 PM ET to answer your questions.",
        "upvotes": 40,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7u4hidirgjig1.png?auto=webp&amp;s=3b07a679ee481cd42a2716f672fe90de727f573d"
        },
        "permalink": "/r/movies/comments/1r0ih8i/hi_rmovies_im_kevin_lewis_i_directed_willys/"
    },
    {
        "id": "1r139wg",
        "author": "MarvelsGrantMan136",
        "title": "‘Avatar’s’ Costly Sequels Are Getting Harder to Justify. Will James Cameron Make Two More? - The studio spent roughly $500 million to produce and promote “Fire and Ash,” meaning the threequel can be insanely popular yet barely profitable.",
        "content": "",
        "upvotes": 1617,
        "comments": 519,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lfe41y0AEmsDD6xz5tU21ytGqtkSempxjTLxzgCvM4Y.jpeg?auto=webp&amp;s=6c05314e77c818b604b85abd8250c19b1d6ba18f"
        },
        "permalink": "/r/movies/comments/1r139wg/avatars_costly_sequels_are_getting_harder_to/"
    },
    {
        "id": "1r11vk5",
        "author": "MarvelsGrantMan136",
        "title": "Paramount Skydance Says It Will Pay Warner Bros. Discovery Shareholders an Extra $650 Million per Quarter if Its WBD Takeover Isn’t Completed by End of 2026",
        "content": "",
        "upvotes": 1297,
        "comments": 277,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JsUU_ybp2AjR0WJVu8-R55dnO54uKUFrW9_uGi0WHGc.jpeg?auto=webp&amp;s=f2bbc2a405896d5fa2b9604c16b0d1d40ed9b675"
        },
        "permalink": "/r/movies/comments/1r11vk5/paramount_skydance_says_it_will_pay_warner_bros/"
    },
    {
        "id": "1r0z91t",
        "author": "Southern_Check_6827",
        "title": "What movie had an ending that saved the whole film?",
        "content": "You know those movies where you’re watching and thinking “this is okay I guess”, like it’s not boring, but it’s not hitting either. Then suddenly the ending comes in like a truck and makes the whole movie feel 10x better in hindsight. What are some films that were average for most of the runtime, but absolutely nailed the ending and saved it?\n\n",
        "upvotes": 407,
        "comments": 661,
        "media": null,
        "permalink": "/r/movies/comments/1r0z91t/what_movie_had_an_ending_that_saved_the_whole_film/"
    },
    {
        "id": "1r13nxj",
        "author": "ICumCoffee",
        "title": "Ryan Coogler Goes Deep on Shattering Oscar Records, Losing Chadwick Boseman and Battling Imposter Syndrome - The ‘Sinners' Director Silenced Skeptics by Scoring Big at the Box Office and Making the Most Nominated Film Ever. After a Decade of Hitmaking, Coogler Says He’s Just Getting Started",
        "content": "",
        "upvotes": 178,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ssJEZ8qPm6tUtRbk_xR9rk0BTAKv2RbfYIOw0D7ZuvI.jpeg?auto=webp&amp;s=718ac341c7ce5449df6fc1f768567ded35bdca34"
        },
        "permalink": "/r/movies/comments/1r13nxj/ryan_coogler_goes_deep_on_shattering_oscar/"
    },
    {
        "id": "1r0v4xt",
        "author": "joesen_one",
        "title": "Briarcliff is giving away 2,000 tickets for ‘Good Luck, Have Fun, Don’t Die’ for free to those who lost their jobs to AI",
        "content": "",
        "upvotes": 620,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BOycAMi_eTPIIF2VjsR_KXWn6P9MKfBbn2_JGV7CiSA.jpeg?auto=webp&amp;s=0e998783aa618a1dce75c7650eb3364d980e78e9"
        },
        "permalink": "/r/movies/comments/1r0v4xt/briarcliff_is_giving_away_2000_tickets_for_good/"
    },
    {
        "id": "1r158yi",
        "author": "Zhukov-74",
        "title": "Chainsaw Man - The Movie: Reze Arc Streams on Crunchyroll Spring 2026",
        "content": "",
        "upvotes": 112,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/deI5Y96IJzEYfsFag0lNNKud_RN3pE80h3uo-GlMIBE.png?auto=webp&amp;s=6fb7f021b71e386429f0af514ea42224092337f3"
        },
        "permalink": "/r/movies/comments/1r158yi/chainsaw_man_the_movie_reze_arc_streams_on/"
    },
    {
        "id": "1r0dk90",
        "author": "MarvelsGrantMan136",
        "title": "‘Sinners’ Exhibit Featuring Props, Costumes and Set Pieces Is Now Part of Warner Bros. Studio Tour",
        "content": "",
        "upvotes": 4454,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gs_D4p-7k3YOR4djSbmYDoop1xCFw2d-IKq4hAWsb4I.jpeg?auto=webp&amp;s=c524189a654b8f7d86e078524e183b5b7403f6ca"
        },
        "permalink": "/r/movies/comments/1r0dk90/sinners_exhibit_featuring_props_costumes_and_set/"
    },
    {
        "id": "1r0w74m",
        "author": "verb505",
        "title": "Kill Bill: The Whole Bloody Affair listed as being released digitally Feb 17th by Apple",
        "content": "Kill Bill: Whole Bloody Affair release date finally posted over on Apple for February 17th, just fyi for anyone that’s been waiting for an announcement.  It combines Volume 1 and Volume 2 into a single, longer film with an intermission, has an extended anime sequence, and reordered scenes. https://tv.apple.com/us/movie/kill-bill-the-whole-bloody-affair/umc.cmc.1us8j95kqhgm6janm37t70m5d",
        "upvotes": 211,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kwSFQNAVw8J4slY2CEa6Mflokh3xqZTWwMLhlsmC8Ns.jpeg?auto=webp&amp;s=35d6c9b7a2b4be3218513f0d09f3881e0bfa3011"
        },
        "permalink": "/r/movies/comments/1r0w74m/kill_bill_the_whole_bloody_affair_listed_as_being/"
    },
    {
        "id": "1r0eqhn",
        "author": "ChiefLeef22",
        "title": "'Wuthering Heights' - Review Thread",
        "content": "*Tragedy strikes when Heathcliff falls in love with Catherine Earnshaw, a woman from a wealthy family in 18th-century England.*\n\nDirector: Emerald Fennell\n\nAdapted from: 'Wuthering Heights' by Emily Brontë (1847)\n\nCast: Jacob Elordi, Margot Robbie, Owen Cooper, Alison Oliver\n\n**Rotten Tomatoes:** [71%](https://www.rottentomatoes.com/m/wuthering_heights_2026)\n\n**Metacritic:** [60 / 100](https://www.metacritic.com/movie/wuthering-heights-2026/)\n\nSome Reviews:\n\n[Variety](https://variety.com/2026/film/reviews/wuthering-heights-review-1236651546/) \\- Peter Debruge\n\n&gt;While not as salacious as ‘Saltburn,’ the director’s operatic Emily Brontë adaptation allows its tragic couple — played by Margot Robbie and Jacob Elordi — to consummate their passions, to a degree.\n\n[The Guardian](https://www.theguardian.com/film/2026/feb/09/wuthering-heights-review-emerald-fennell-margot-robbie-jacob-elordi) \\- Peter Bradshaw - 2 / 5\n\n&gt;Wuthering Heights doesn’t have the live-ammo impact of Fennell’s earlier films, or indeed Andrea Arnold's primitivist take on Brontë’s novel from 2011, which really did believe in the passionate truth of Cathy and Heathcliff’s love. For Fennell, it looks like a luxurious pose of unserious abandon. It’s quasi-erotic, pseudo-romantic and then ersatz-sad, a club night of mock emotion.\n\n[USA Today](https://www.usatoday.com/story/entertainment/movies/2026/02/09/wuthering-heights-2026-movie-review/88556199007/) \\- 3.5 / 4\n\n&gt;Emerald Fennell’s take on the literary classic isn’t exactly a Valentine’s Day pick-me-up. Yet it’s awfully stunning to look at with all sorts of toxic obsession, forbidden lust and gothic sauciness.\n\n[RogerEbert](https://www.rogerebert.com/reviews/wuthering-heights-film-review-2026) \\- Tomris Laffy - 2 / 4\n\n&gt;It’s hard to feel freely when you are constantly and loudly reminded by every aspect of the movie that you are supposed to feel things.\n\n[AVClub - Natalia Keoghan](https://www.avclub.com/wuthering-heights-review) \\- 'C-'\n\n&gt;Overlong and undersexed, Fennell’s version of Wuthering Heights betrays her audience of edgelords and perverts. Even stranger, those who have fostered a distaste for the filmmaker’s sensibility will similarly find themselves disappointed. It’s one thing to make art that can be read as indulgent, ill-conceived, and tasteless—it’s another to turn around and make something that’s just boring in comparison.\n\n[Slash Film - BJ Colangelo](https://www.slashfilm.com/2097045/wuthering-heights-2026-movie-review/) \\- 5 / 10\n\n&gt;This is not an adaptation of \"Wuthering Heights,\" but the result of what happens when you're playing an approximation \"Wuthering Heights\" without a full grasp on the material but all the money in the world to bring your questionable imagination to life.\n\n[Consequence - Liz Shannon Miller](https://consequence.net/2026/02/wuthering-heights-review-margot-robbie/) \\- 'A-'\n\n&gt;As soon as this project was announced, it was easy to assume that Fennell would show as much reverence for the classic text as she showed for the sanctity of a man’s grave in *Saltburn*. Except she defies that assumption by making sure that although *“Wuthering Heights”* remains a deliciously horny film, it does summon a certain degree of pure romance, especially in the few moments when its leads are able to see past their misunderstandings and actually connect. It’s a movie about how ugly people can be to each other, but also about the beauty they’re capable of — a message that, like the original text itself, remains timeless.\n\n[The Telegraph - Robbie Collins](https://www.telegraph.co.uk/films/2026/02/09/margot-robbie-jacob-elordi-wuthering-heights/) \\- 5 / 5\n\n&gt;Style over substance? Not at all – it’s more that Fennell understands that style can be substance when you do it right. Cathy and Heathcliff’s passions vibrate through their dress, their surroundings, and everything else within reach, and you leave the cinema quivering on their own private frequency.\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20260209-wuthering-heights-review) \\- 4 / 5\n\n&gt;Emerald Fennell's Wuthering Heights is *not* very faithful to Emily Bronte's novel, but we knew that. The trailer alone evoked so much hand-wringing from Brontë purists that the film became divisive sight unseen. This Wuthering Heights *is* very true to Fennell, the director of the scathing revenge drama Promising Young Woman and the lush, bitter story of class and obsession, Saltburn.\n\n[Collider - Therese Lacson](https://collider.com/wuthering-heights-review-margot-robbie-jacob-elordi-emerald-fennell-emily-bronte/) \\- 2 / 10\n\n&gt;What makes the original Wuthering Heights so powerful is the dizzying story at its core. The Earnshaws and Lintons have a complicated family tree, and Heathcliff comes in like a wrecking ball to blow everything up. On one hand, we want to believe that Heathcliff can change from his wicked ways with enough love from Cathy, but on the other hand, his actions are so cruel that it feels like Brontë is pushing us to the very brink of what is acceptable before ultimately redeeming him in his final moments. Emily Brontë's novel is about characters who are hateful and pitiable but still full of enough charm and complexity that we are desperate to learn their full, messy tale. Emerald Fennell's film is merely telling a shallow story about two people overcoming all obstacles to fall in love — not necessarily awful on paper, but it's an adaptation that feels like a 14-year-old skimmed the book and jumped to her own conclusions without any true understanding of the novel.",
        "upvotes": 2163,
        "comments": 687,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yFy-h5bIqS5lzea-2RFD6_7teNrEbthW6xn62vhwnJU.jpeg?auto=webp&amp;s=7aa179e052953a8f84d17b3f67d802e63418f0bb"
        },
        "permalink": "/r/movies/comments/1r0eqhn/wuthering_heights_review_thread/"
    },
    {
        "id": "1r0ibd7",
        "author": "Giff95",
        "title": "Ice Dance - \"Edward Scissorhands\" (1990)",
        "content": "",
        "upvotes": 1161,
        "comments": 85,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u6zwl0vuljig1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1r0ibd7/ice_dance_edward_scissorhands_1990/"
    },
    {
        "id": "1r0vvuv",
        "author": "Subject_Sandwich3008",
        "title": "What movie did you watch on a whim that ended up becoming one of your favorites?",
        "content": "No expectations, just randomly picked it and it blew you away.\n\nFor me it was The Fall (2006). Saw it on a streaming service years ago with zero context and it's still one of the most visually stunning movies I've ever seen. The storytelling, the cinematography, the way it blends reality and fantasy, I had no idea what I was getting into and it completely caught me off guard. Been recommending it ever since!\n\nWhat's yours?",
        "upvotes": 155,
        "comments": 288,
        "media": null,
        "permalink": "/r/movies/comments/1r0vvuv/what_movie_did_you_watch_on_a_whim_that_ended_up/"
    },
    {
        "id": "1r0yy7w",
        "author": "ilikescolouring",
        "title": "Due to some unprecedented downtime in January, I watched 36 movies in a month (PB). I don't know what else to do with this achievement(?) other than tell strangers.",
        "content": "The movies, in no particular order- \n- A working man\n- Modern times (Charlie Chaplin)\n- Dark City\n- Darkman\n- Dr Strangelove\n- Gran Tourismo\n- Heat\n- Heavy Metal\n- Heavy Metal 2000\n- Jurassic World Rebirth\n- Krazy House\n- Locke\n- Nosferatu\n- One Flew Over The Cuckoos Nest\n- Playdate\n- Slow West\n- The Green Knight\n- The Lost Boys\n- The Naked Gun\n- The Running Man (Edgar Wright)\n- The Shadow,\n- We Live In Time\n- 28 Years Later\n- Ballerina\n- Chainsawman the movie\n- Now You See Me, Now You Don't\n- Sinners\n- Street Fighter - The Legend of Chun Li\n- Terminator Salvation\n- The Smashing Machine\n- Tron Ares\n- Wake Up Dead Man\n\nUniversal Monster movies - \n- Dracula\n- The Invisible Man\n- Son of Frankenstein\n- The Creature From The Black Lagoon\n- Werewolf Of London ",
        "upvotes": 83,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1r0yy7w/due_to_some_unprecedented_downtime_in_january_i/"
    },
    {
        "id": "1r0kz9j",
        "author": "The-Perfect-Username",
        "title": "Heartbreaking scenes in otherwise unremarkable films?",
        "content": "What’s an example of a scene in a film that would otherwise be forgettable if not for one moment that absolutely punches you in the gut?\n\nThe one that springs to mind for me is the scene in Fantastic Four (2005) when Ben’s fiancée breaks up with him and then he tries to pick up the ring but can’t. As a kid that scene made me cry and as an adult I still get a lump in the throat.",
        "upvotes": 587,
        "comments": 385,
        "media": null,
        "permalink": "/r/movies/comments/1r0kz9j/heartbreaking_scenes_in_otherwise_unremarkable/"
    },
    {
        "id": "1r15ift",
        "author": "TheListenerCanon",
        "title": "Blake Garrett Dies: Former Child Actor In ‘How To Eat Fried Worms’ Was 33",
        "content": "",
        "upvotes": 17,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/t_BuiBHNLKA5MdxzGWAvn59_uePjm6iHiYZFKKfcwj8.jpeg?auto=webp&amp;s=15ea111457069fb7aa7b2f92c3995967227a1bfb"
        },
        "permalink": "/r/movies/comments/1r15ift/blake_garrett_dies_former_child_actor_in_how_to/"
    },
    {
        "id": "1r0iguz",
        "author": "killrobot",
        "title": "'Crawl 2' - Sam Raimi Provides an Update on the New York City-Set Sequel",
        "content": "",
        "upvotes": 404,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HHM7BAih3MoDygbUvigknVPw2FfvYziUi_UZYub1YeE.jpeg?auto=webp&amp;s=cc6b7b47862c5397591baa87abcb320c8046c1a0"
        },
        "permalink": "/r/movies/comments/1r0iguz/crawl_2_sam_raimi_provides_an_update_on_the_new/"
    },
    {
        "id": "1r07j58",
        "author": "ICumCoffee",
        "title": "Roger Deakins on 50 Years Behind the Camera, His Fears for Film’s Future and Why He Believes the Art of Visual Storytelling is in Decline",
        "content": "",
        "upvotes": 1303,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qYwgV-h5W1Kky2iyKFgDKDp1vomFwj7L_BB6UZfyscU.jpeg?auto=webp&amp;s=0a3d8d00e8a7d0ad6eac2ca014bbceefcb08144e"
        },
        "permalink": "/r/movies/comments/1r07j58/roger_deakins_on_50_years_behind_the_camera_his/"
    },
    {
        "id": "1r166xy",
        "author": "magikarpcatcher",
        "title": "First image from \"Hungry\" starring Madison Davenport. The movie centers on a group of holidaymakers who must fight for their lives against a rampaging hippo after becoming lost in the Louisiana swamplands.",
        "content": "",
        "upvotes": 18,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0blrn9pl6pig1.png?auto=webp&amp;s=3ca5a6d45302cf473fe924581902611efb1f2cfa"
        },
        "permalink": "/r/movies/comments/1r166xy/first_image_from_hungry_starring_madison/"
    },
    {
        "id": "1r0kh35",
        "author": "NixsatFramestore",
        "title": "Behind the Scenes of F1 the Movie's visual effects",
        "content": "",
        "upvotes": 259,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MdponWrjXiVyUyWa_PHMlsk4E9_iD09uqbZExvf78Ok.jpeg?auto=webp&amp;s=de1c7076e62bb081a0ca850fe41325a5f22063f7"
        },
        "permalink": "/r/movies/comments/1r0kh35/behind_the_scenes_of_f1_the_movies_visual_effects/"
    },
    {
        "id": "1r0f7ma",
        "author": "DemiFiendRSA",
        "title": "Laura Dern’s Criterion Closet Picks",
        "content": "",
        "upvotes": 456,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dAjggglB8RcrNRbF7-QHovuRMaoW2IJdxJyu_SUGo3M.jpeg?auto=webp&amp;s=27ec1ceb8738beac9387c8546ea1f682e19b8f6b"
        },
        "permalink": "/r/movies/comments/1r0f7ma/laura_derns_criterion_closet_picks/"
    },
    {
        "id": "1r0qgom",
        "author": "PeneItaliano",
        "title": "Poster for ‘The Blood Countess’ starring Isabelle Huppert",
        "content": "",
        "upvotes": 107,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a5efyrxpblig1.jpeg?auto=webp&amp;s=66f584d0e87d9effc46700e5d3c9c869c51367c8"
        },
        "permalink": "/r/movies/comments/1r0qgom/poster_for_the_blood_countess_starring_isabelle/"
    },
    {
        "id": "1r0gqot",
        "author": "StillStanding_96",
        "title": "Silliest Bond Villain scheme?",
        "content": "What do we all think? There’s definitely a spectrum of schemes in the Bond series, from the sensible to the absurd. \n\nI think \\*From Russia with Love\\*’s Kronsteen has a fairly reasonable plan: Spectre wants a Soviet code-breaking machine and James Bond dead, they play British and Soviet intelligence against each other, have Bond steal the machine and stage his and his Russian accomplice’s deaths. Classic spy stuff.\n\nThere’s plenty of silly schemes to choose from, like Drax’s plan in \\*Moonraker\\* to create a genetically perfect human race on a space station… from a few dozen men and women 🤦‍♀️\n\nBut I think \\*License to Kill\\* takes the silly cake. The plan basically revolves around a cocaine smuggling operation. While giving a tour of his facilities to potential investors, he demonstrates his method for transporting thousands of kilos of cocaine completely undetectably: dissolve it in gasoline, truck it to the destination, and recover the cocaine by running the gas through a coffee filter. This is the plan. Just… wow.\n\nBut what do you think? Is there another movie with an even sillier plan?",
        "upvotes": 367,
        "comments": 445,
        "media": null,
        "permalink": "/r/movies/comments/1r0gqot/silliest_bond_villain_scheme/"
    },
    {
        "id": "1r0revg",
        "author": "PeneItaliano",
        "title": "Naomi Watts And Odessa A’zion Join Sarah Paulson and Dianne Wiest In Cody Fern Movie",
        "content": "",
        "upvotes": 88,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xJFx_jP85sfAmwzPxyBUxug7f5sYuWV8HSwVvlhNOQY.jpeg?auto=webp&amp;s=e0869edeb8cb85280dba6a602b5b65a1c9f62aa7"
        },
        "permalink": "/r/movies/comments/1r0revg/naomi_watts_and_odessa_azion_join_sarah_paulson/"
    },
    {
        "id": "1r02k6q",
        "author": "MoneyLibrarian9032",
        "title": "HBO Max Sets U.K. Launch Date The platform will be available from March 26, with content from HBO, Warner Bros. Pictures, Warner Bros. Television, DC Studios and Max Originals.",
        "content": "",
        "upvotes": 1447,
        "comments": 378,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8EFUPZvXXmBdRoQDbkNjY7ylaP3QL241cVUCI41VMOA.jpeg?auto=webp&amp;s=6c949a25c5b6cb7683de0d35976a11cac383713e"
        },
        "permalink": "/r/movies/comments/1r02k6q/hbo_max_sets_uk_launch_date_the_platform_will_be/"
    },
    {
        "id": "1r0dxpl",
        "author": "darth_vader39",
        "title": "Film Academy Will No Longer Show Oscar-Nominated Films to Members on Big Screen",
        "content": "",
        "upvotes": 369,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/46Hf7QL1RVBNmzLq8C_GIL7Qvm4lpDR_iYN0BP4yWbA.jpeg?auto=webp&amp;s=e33ab2730e20aa9e2dbb815e3947612312482c47"
        },
        "permalink": "/r/movies/comments/1r0dxpl/film_academy_will_no_longer_show_oscarnominated/"
    },
    {
        "id": "1r0mmzj",
        "author": "jaystats2",
        "title": "Films that would completely fall apart if the lead actor were recast",
        "content": "Not just “they did a great job,” but cases where the actor’s presence, voice, or energy is the movie, and a recast version is basically unthinkable.\n\nTwo that come to mind for me are Taxi Driver, with De Niro’s specific mix of menace, vulnerability, and vacancy as Travis Bickle. Recasting Bob turns the character into either a cartoon or a cliché. \n\nThe other obvious choice is ‘Being John Malkovich’. This one barely works because it’s Malkovich. The entire conceptual joke collapses if the actor isn’t instantly recognizable but still kind of mysterious.",
        "upvotes": 124,
        "comments": 335,
        "media": null,
        "permalink": "/r/movies/comments/1r0mmzj/films_that_would_completely_fall_apart_if_the/"
    },
    {
        "id": "1r0o0kd",
        "author": "Defiant-Ad7732",
        "title": "Finished watching arrival.....",
        "content": "my god, what a movie, one of the best movies I've ever watched, I went into the movie expecting a nice solid 7.8/10 movie with some good acting and plot and visually stunning as it is Dennis Villeneuve, but it exceeded all my expectations, the tension was relentless for me personally, it kept getting escalated, the pacing was perfect imo\n\ncoming to the climax, I was not ready for this revelation, this gift by aliens, Louise's choice of continuing to conceive Hannah was such a huge moral and Philosopically charged question \n\nI absolutely loved the way the movie told the viewers what happened to Ian after their girl was born, that Louise told him the reality \n\nDennis Villeneuve continues to be AMAZING, bro has only masterpieces in his pocket. 9.3/10 for me, it not only has amazing concept and twist but a heart touching twist that really makes me emotional and rank this movie very high",
        "upvotes": 98,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1r0o0kd/finished_watching_arrival/"
    },
    {
        "id": "1r159tp",
        "author": "fritzthemarmot",
        "title": "Vinegar Syndrome's ANYTHING THAT MOVES on 35mm at SF Alamo: Tomorrow!!!",
        "content": "Hey folks - writer/director of [Anything that Moves](https://www.youtube.com/watch?v=lP_0tilCwng) Alex Phillips here. \n\n*An avant-gutter psychedelic dream, ANYTHING THAT MOVES is the latest from Vinegar Syndrome Pictures and the second feature directed by Alex Phillips (All Jacked Up and Full of Worms).*   \n  \n*A blood and skin-soaked, 16mm thriller set in the sticky corridors of Chicago, this rust belt murder mystery follows Liam, who, along with his girlfriend, works as a bike messenger, delivering business and pleasure to his lust-hungry clients. When a serial killer begins targeting those closest to him, Liam becomes determined to clear his name, only to discover that the trail of blood leads back to his own bed!*   \n  \n**AMA** with you all coming soon, but first please check out our **special screening on 35mm** at San Francisco's [Alamo Drafthouse ](https://drafthouse.com/sf/event/weird-wednesday-anything-that-moves)tomorrow! \n\nOtherwise, we have a ton of theatrical screenings coming up. Please come check out this freaky labor of love! - \n\nWed. 2/11: Alamo Drafthouse Raleigh, NC: [https://drafthouse.com/raleigh/event/weird-wednesday-anything-that-moves](https://drafthouse.com/raleigh/event/weird-wednesday-anything-that-moves)\n\nWed. 2/11: Alamo New Mission, San Francisco (35mm): [https://drafthouse.com/sf/event/weird-wednesday-anything-that-moves](https://drafthouse.com/sf/event/weird-wednesday-anything-that-moves)\n\nWed. 2/11: Alamo Cedars, Dallas: [https://drafthouse.com/dfw/event/weird-wednesday-anything-that-moves?cinemaId=0702](https://drafthouse.com/dfw/event/weird-wednesday-anything-that-moves?cinemaId=0702)\n\nWed. 2/11: Alamo Wrigleyville, Chicago w/ Alex in-person: [https://drafthouse.com/chicago/event/weird-wednesday-anything-that-moves](https://drafthouse.com/chicago/event/weird-wednesday-anything-that-moves)\n\nThur. 2/12: The Dreamland, Sacramento, CA: [https://www.simpletix.com/e/anything-that-moves-tickets-256229](https://www.simpletix.com/e/anything-that-moves-tickets-256229)\n\nMon. 2/16: Hyperreal Film Club, Austin: [https://hyperrealfilm.club/events/2-16/anything-that-moves-movie-screening](https://hyperrealfilm.club/events/2-16/anything-that-moves-movie-screening)\n\nThur. 2/19: Laemmle Theatre NoHo, LA w/ Alex &amp; Hal in-person: [https://www.laemmle.com/film/anything-moves](https://www.laemmle.com/film/anything-moves)\n\nFri. 2/20: Brain Dead Studios, LA (35mm) w/ Alex, Hal, Ginger in-person:  [https://studios.wearebraindead.com/movies/anything-that-moves/](https://studios.wearebraindead.com/movies/anything-that-moves/)\n\nSun. 2/22: Stray Cat Film Center, KC, MO: [https://www.straycatfilmcenter.com/screeningsandevents/anything-that-moves-myw72](https://www.straycatfilmcenter.com/screeningsandevents/anything-that-moves-myw72)\n\nWed. 2/25 - Wed. 3/11: Dave Barber Cinematheque, Winnipeg, Manitoba: [https://davebarbercinematheque.com/event/anything-that-moves/](https://davebarbercinematheque.com/event/anything-that-moves/)\n\nWed. 2/25: FilmScene, Iowa City: [https://icfilmscene.org/film/anything-that-moves/](https://icfilmscene.org/film/anything-that-moves/)\n\nSat. 2/28 + Sun. 3/1: Circle Cinema, Tulsa (35mm): [https://www.circlecinema.org/movies-events/anything-that-moves-on-35mm-film](https://www.circlecinema.org/movies-events/anything-that-moves-on-35mm-film)\n\nTues. 3/10: Music Box Theatre, Chicago w/ Alex in-person (35mm): [https://musicboxtheatre.com/films-and-events/anything-that-moves](https://musicboxtheatre.com/films-and-events/anything-that-moves)\n\nFri. 3/13 + Tues. 3/17: Community Theater, Catskill, NY\n\nFri. 3/20 - Sun. 3/22: Gateway Film Center, Columbus, OH (35mm)\n\nSat. 3/21: Arkadin Cinema, St. Louis, MO w/ Alex in-person: [https://arkadincinema.com/event/weird-wild-erotic-thriller-anything-that-moves-2025-live-qa-w-director-alex-phillips/](https://arkadincinema.com/event/weird-wild-erotic-thriller-anything-that-moves-2025-live-qa-w-director-alex-phillips/)\n\nFri. 3/27 - Sun. 3/29: Emagine Willow Creek, Plymouth, MN (35mm)\n\nFri. 3/27 - Sun. 3/29: Galleria 6 Cinemas, St. Louis, MO (w/ Alex in-person)\n\nSat. 6/27: Heights Theater, Minneapolis (35mm) w/ Alex in-person\n\nFri. 7/10: Facets, Chicago (w/ Alex in-person)...w/ WORMS + Alex shorts",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d5Msn4H60bgGA8MfK7Mac-b6oHnmwLtpby7phXI1NXQ.jpeg?auto=webp&amp;s=a849a3db418275af2e12d5cdb05d6efe9dbeff18"
        },
        "permalink": "/r/movies/comments/1r159tp/vinegar_syndromes_anything_that_moves_on_35mm_at/"
    },
    {
        "id": "1r15u10",
        "author": "MoneyLibrarian9032",
        "title": "Ariela Barer To Star In A24’s ‘Deep Cuts’ In Recasting Of Odessa A’Zion",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IaDtMj5hCk9fsCqKGWTJ_iVCvelznbarBeOWaswR9fE.jpeg?auto=webp&amp;s=740bdbef9983317f179cb7c6236519a5675fad8b"
        },
        "permalink": "/r/movies/comments/1r15u10/ariela_barer_to_star_in_a24s_deep_cuts_in/"
    }
]