[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 144,
        "comments": 511,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mxz31p",
        "author": "TheMirrorUS",
        "title": "Emily in Paris assistant director dies after collapsing while filming",
        "content": "",
        "upvotes": 650,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1mxz31p/emily_in_paris_assistant_director_dies_after/"
    },
    {
        "id": "1myfxwp",
        "author": "Apprehensive_Ask1279",
        "title": "The Jussie Smollett documentary",
        "content": "I would really like to hear from people who have watched the whole documentary to see if this has changed anyone’s opinion on the case.\n\nPersonally I still believe Jussie lied &amp; wants to be seen as some sort of martyr/activist. The Osundairo brothers are clearly opportunists but they have no reason to lie &amp; the producers of this are using Chicago PDs bad reputation to deflect, however multiple things can be true at the same time. \n\nLooking forward to hearing your thoughts! ",
        "upvotes": 74,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1myfxwp/the_jussie_smollett_documentary/"
    },
    {
        "id": "1myewjs",
        "author": "Ginishivendela",
        "title": "Accidentally watched through Kaos",
        "content": "To come to a cliffhanger ending and notice that it was cancelled. Absolutely loved the show, one of the best ones on the platform but as with all the other great ones I love they’re cancelled. \n\nWhy even make a show if you’re gonna cancel it before giving it an ending, and then keeping it on the platform. This has been a complaint for a long time and I can’t fathom why Netflix isn’t listening?? The viewers aren’t excited about new show due to the fear of having them cancelled. I mean who in their right mind would want to watch a brilliant show just to be disappointed by the end. Do the head honchos at Netflix have some kind of edging fetish or what’s up? \n\nI’m not the one paying my households subscription but in the future aka when I move out I’ll definitely won’t get a Netflix subscription because as much as I like the content on there I’d rather have a GoT shit ending than a cancelled show. ",
        "upvotes": 74,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1myewjs/accidentally_watched_through_kaos/"
    },
    {
        "id": "1mykfmx",
        "author": "Witch_King_Malekith",
        "title": "Wednesday and the non-stop oneliners.",
        "content": "Everything line out of Wednesday's mouth is a pun or a \"cheeky\" oneliner. And all the other characters do is setting her up for her unnatural and weird responses. It gets tiring after a while.\n\nAlso, she kept talking and explaining stuff to the audience by talking to herself. This show is either for kids or for dumb adults, at least according to the writers. \n",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mykfmx/wednesday_and_the_nonstop_oneliners/"
    },
    {
        "id": "1myms8o",
        "author": "bigguys45s",
        "title": "For those into Japanese tv shows/ series/ movies: Any thoughts/ opinions at all on, “Old Enough”?",
        "content": "I think that it’s a cute series and show overall, but honestly also a bit scary at times, considering the fact that these are some REALLY young kids walking alongside public roads/ cars/ bridges, and for pretty/ fairly long distances, especially for children that young of age. But it’s also a very unique look at Japan/ life in Japan/ Japanese culture/ Japanese food as well.\n\nOverall, it’s really enjoyable/ interesting/ sometimes sweet and funny to me as well. 😁👍",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myms8o/for_those_into_japanese_tv_shows_series_movies/"
    },
    {
        "id": "1myou14",
        "author": "Longjumping-Elk-7840",
        "title": "Long Story Short review – TV so funny and clever it could run for ever",
        "content": "Long Story Short review – TV so funny and clever it could run for ever | Television | The Guardian https://www.theguardian.com/tv-and-radio/2025/aug/22/long-story-short-review-tv-so-funny-and-clever-it-could-run-for-ever",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1myou14/long_story_short_review_tv_so_funny_and_clever_it/"
    },
    {
        "id": "1mxoe8c",
        "author": "Crafty-Ball9103",
        "title": "Can't stand how many of these exist.",
        "content": "",
        "upvotes": 392,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih9x1a5l8okf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxoe8c/cant_stand_how_many_of_these_exist/"
    },
    {
        "id": "1myc3hi",
        "author": "jgroove_LA",
        "title": "Arden Cho Thought She'd Retired, Then K-Pop Demon Hunters Changed Everything",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1myc3hi/arden_cho_thought_shed_retired_then_kpop_demon/"
    },
    {
        "id": "1myqbv8",
        "author": "lion_king3008",
        "title": "PoV in Adolescence",
        "content": "Sorry , I'm late for the party . I watched the series yesterday . I loved the Storytelling through single shot episodes . But I just realised the whole Adolescence series is shot from the PoV of Katie's Soul roaming around the characters ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myqbv8/pov_in_adolescence/"
    },
    {
        "id": "1myp4xs",
        "author": "totheunholy",
        "title": "If I end my subscription before the next billing date would I still be charged?",
        "content": "I started my Netflix account during summer break in May 14th, first billing was on June 14th. And my next is on September 14th\nI want to end my subscription for the 3 months and possibly come back later in December during the holidays/winter break. \n\n1. Today is August 24th, if I end my subscription will I still be billed on September 14th?\n2. And also can I freeze my account while all the profiles stay there with their information until December? If yes how can I do that. \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myp4xs/if_i_end_my_subscription_before_the_next_billing/"
    },
    {
        "id": "1mymnp0",
        "author": "Comfortable_Cook_965",
        "title": "Why does Netflix remove so many successful shows and movies?",
        "content": "I don’t really understand how the contract works, does the tv show/movie receive money every few months and then Netflix decides if it’s worth paying? Also surely it’s best to keep as many popular shows as you can on rather than only have Netflix originals because it means that the site will have the most famous movies which, as a collective, will be the most searched for and that will make Netflix seem like it has more media than it does. Why not let go of random films no one watches instead?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mymnp0/why_does_netflix_remove_so_many_successful_shows/"
    },
    {
        "id": "1my5dcc",
        "author": "peoplemagazine",
        "title": "Emily in Paris Resumes Production Days After Assistant Director’s Death as Lily Collins and Eugenio Franceschini Film in Venice",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1my5dcc/emily_in_paris_resumes_production_days_after/"
    },
    {
        "id": "1mxz3ap",
        "author": "forlornforbit",
        "title": "The premise if Hostage is so far removed from reality it's unwatchable",
        "content": "Disclaimer - I don't expect 100% realism in fiction. That's what documentaries are supposed to be for. I'm also a big sci-fi fan, so I can enjoy watching fantastical and implausible scenarios.\n\nBut I just don't see the point of setting a TV show in a real-world setting if you are going to completely distort that setting. That just makes it annoying, not fun.\n\nThis brings me to Hostage, the new political thriller about a British Prime Minister's husband being kidnapped, starring Suranne Jones and Julie Delpy. The sheer number of inaccuracies in the show are too numerous to point out (Oldham FC, anyone?). Mostly, they are the result of sloppy shortcuts in the writing.\n\nSo I'll just focus on the big one. The premise itself is simply not viable. There's absolutely no point in a kidnapper demanding that a British PM resign, because they can resign and then be reinstated almost immediately after the victim is released. Even if the kidnapper insisted on them resigning as a Member of Parliament, this presents only a minor technical hurdle to them being re-appointed.\n\nI can forgive shows taking liberties with reality if they're getting to the heart of an emotional issue. But this show doesn't do that because the whole family vs country dilemma doesn't stand up to scrutiny. Yet again I despair at the TV industry spending millions of pounds bringing together a huge agglomeration for talent for something that doesn't make the slightest sense.",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mxz3ap/the_premise_if_hostage_is_so_far_removed_from/"
    },
    {
        "id": "1myidhv",
        "author": "Mediocre_Concert4345",
        "title": "The Residence: I can't find a clip of a character doing a certain action",
        "content": "I saw a clip of&gt;! AB Wynter jumping out of a window !&lt;and I cannot find it. I saw it as a meme under a caption unrelated, but I have no idea where and what it was from. Maybe it was a trailer or something. Help me find it please. \n\n  \nSide note, I thought it was a phenomenal show. Just binged the last couple episodes with my lady. Top Notch production and very great casting. Great pacing. A little drawn out during certain moments, however the writing was phenomenal. Maybe I haven't watched a very very good murder mystery, but this was really good. I dont know what the general consensus is, It was a netflix show I took a shot on and it was a good shot. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1myidhv/the_residence_i_cant_find_a_clip_of_a_character/"
    },
    {
        "id": "1my9ip0",
        "author": "Reasonable_Toe3300",
        "title": "Teenage bounty hunters",
        "content": "I’m really mad this show never got another season. It had the best ending for a season two and had good reviews. Why does Netflix keep cancelling good shows all the time and then leave up stuff people don’t like as much for way too long? \n\nDesperate need to know what happens next even after years!!",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1my9ip0/teenage_bounty_hunters/"
    },
    {
        "id": "1mxvcd5",
        "author": "Breekoenekk",
        "title": "Miso is back!",
        "content": "It's gonna be awesome! If the fight scenes are half as good as in S1 they will still be better than those of 95% ofcall other series. \nIf they can keep the theme's of alienation, racisme, sexisme and discrimination in the Edo period, something Anime often overlooks, and the amazing sounddesign from S1 Blue eye Samurai S2 can become a instant classic like Arcane.\nCan't wait.",
        "upvotes": 21,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0idve7385qkf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxvcd5/miso_is_back/"
    },
    {
        "id": "1mxms1o",
        "author": "IGR777",
        "title": "What’s a good show that works mostly as background noise?",
        "content": "This might be an odd question, but sometimes I do some online work from home and I don’t like to just sit there and do the work so what’s a good show I can put on and not really pay attention to, but still understand so nothing with a  Deep story",
        "upvotes": 58,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1mxms1o/whats_a_good_show_that_works_mostly_as_background/"
    },
    {
        "id": "1mydjaa",
        "author": "King_Dareth",
        "title": "Screen occasionally flickering and glitching?",
        "content": "I mainly watch netflix on my phone, and on there it's perfect, i can download episodes and movies and do everything so problem, however on my laptop, when i go into fullscreen, the show i'm watching constantly flicks up and down just for a split second, and it's kinda irritating, obviously i can live with it, but still, like i said it's annoying and i want to solve it, for reference when i go onto websites like youtube and such and go to fullscreen on there it's fine, also this is the \"app\" not the website, if that makes any difference",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mydjaa/screen_occasionally_flickering_and_glitching/"
    },
    {
        "id": "1myha9p",
        "author": "Whatamievendoing142",
        "title": "Members forced to watch ads",
        "content": "Lmk if anyone has dealt with this and had more success than I did. *begins rant* \n\nA week ago I added my mother as an additional member on my account because the questions about who was on the \"home account\" got to be too much. I went in, and added her as an extra member, and was given only one option, $6.99 a month with ads. Not the 8.99 without ads. I have the premium plan so I guess that allows 2 people without ads. I told her to set it up and I'd work on the ads thing. Called today and they said, NOT ONLY do I have to wait for the next billing cycle (3 weeks) to upgrade it, but they have to completely delete her account and terminate all the data to then add her back without ads...\n\nFirst, I've never heard of a company making it impossible to upgrade a service mid-billing cycle. Seems to just be bad business. But also that we have to delete her data? They already deleted all my add'l a year ago, which happened to millions, and then blamed it on me. I'm so fed up with these people but I cant cancel because my family pays for every other streaming service and they say theyll kick me off those if i cancel this one. *end rant* ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1myha9p/members_forced_to_watch_ads/"
    },
    {
        "id": "1mybjex",
        "author": "Informal_Mouse_4305",
        "title": "Filter \"My List\" by duration",
        "content": "I wish there was a way to filter My List by duration, for two use cases:\n\n1) Find the longest movie from my list that fit within the remaining time (i.e. from now until bedtime). \n\n2) Find a new series based on duration... On TV nights, we binge \"regular\" hour-long shows (or movie) until close to bedtime than maybe switch to a shorter half-hour show if time allows... Finding a good 22-30 minutes show in My List or the whole catalog is sometimes a lot of clicks!\n\nIs it a good request? Any tip?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mybjex/filter_my_list_by_duration/"
    },
    {
        "id": "1myk8p0",
        "author": "Zeether",
        "title": "Is there any chance of a KPop Demon Hunters Blu-ray happening?",
        "content": "I know Netflix is notorious for not putting some stuff on physical media, but this SCREAMS for it. I can't believe Sony made the stupid mistake of handing it off to them because it deserves a good physical media release and shouldn't be stuck on the walled garden of streaming.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1myk8p0/is_there_any_chance_of_a_kpop_demon_hunters/"
    },
    {
        "id": "1mxc7io",
        "author": "smcneal",
        "title": "How KPop Demon Hunters Harnessed Girl Power To Become One of Netflix’s Biggest Hits Ever",
        "content": "Director Maggie Kang discusses inspo for the movie, including \"Buffy\" and her tween self:\n\n“I don’t think we see this kind of woman a lot in film, and there’s this kind of fear of showing women look ‘ugly’ and imperfect, especially in animation, and that message doesn’t sit well with me. So I hope girls can learn that there’s beauty in our imperfections, even in how we look on the outside.”",
        "upvotes": 119,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mxc7io/how_kpop_demon_hunters_harnessed_girl_power_to/"
    },
    {
        "id": "1my9l8g",
        "author": "Reasonable_Toe3300",
        "title": "More shows",
        "content": "For Netflix, paramount and prime what are your favourites? I need something new to watch instead of repeating old favs again.\nI really like anything horror/thriller and action.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1my9l8g/more_shows/"
    },
    {
        "id": "1my9cp7",
        "author": "RemarkableLab433",
        "title": "Netflix and Hulu",
        "content": "Good shows you recommend on Netflix and Hulu both mystery thriller vibes please \nI’m finishing only murder in our building on Hulu so looking for another good show you recommend ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1my9cp7/netflix_and_hulu/"
    },
    {
        "id": "1mxia1h",
        "author": "marianinacob",
        "title": "Shameless on Netflix Greece",
        "content": "Shameless was added on the greek Netflix on August 1, and i have been watching like crazy since then, I'm already on season 6 as of today. As I was watching, and the episode ended, it suddenly popped an error saying that it's not available in my region. How could that happen when it was just added 3 weeks ago? This is very frustrating.",
        "upvotes": 48,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1mxia1h/shameless_on_netflix_greece/"
    },
    {
        "id": "1my79uq",
        "author": "AppropriateWill485",
        "title": "Projector for netflix nights",
        "content": "Hello everyone, I’m hunting for a solid mid-budget projector specifically for Netflix movie nights. Ideally, it should offer:\n- Netflix built‑in (no extra device needed)\n- Outstanding image quality—sharp, vibrant visuals\n- Reliable streaming performance\n-Easy and clean setup\n\nWhich models would you recommend that shine in these areas? Any to avoid?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1my79uq/projector_for_netflix_nights/"
    },
    {
        "id": "1my5zeo",
        "author": "hlovesshows",
        "title": "Has this happened to anyone?",
        "content": "Hey, so, I’ve had Netflix for 3 or 4 years and I’d been looking for Pitch Perfect a couple of years ago. I found it and then, I couldn’t find it anymore, the next day. A few months later, I came across it again and double checked  because I intended on watching it a few days later. I didn’t save it to My List. Same thing happened yet again- it disappeared even when I looked for it AND saved it to My List. Now, it just showed on my Netflix on its own. I have no internet issues because the internet in my area is great and it’s not as if I travelled anywhere out of the city or country which could lead to such confusion. What could the problem be? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1my5zeo/has_this_happened_to_anyone/"
    },
    {
        "id": "1mxqmtf",
        "author": "Big_Buy8203",
        "title": "Currently watching bloodline",
        "content": "Currently watching bloodline on episode 22 and it’s been an interesting watch so far. I must say Danny has been a menace ever since the show started to introduce what his real motive for coming back was. \n\nDid anyone watch this show and begin to think of their own family to some degree? I understand that no family is perfect and we all have our issues but wow Danny was like a bad omen to the Rayburns lol",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mxqmtf/currently_watching_bloodline/"
    },
    {
        "id": "1my1wah",
        "author": "purplepikminisfat",
        "title": "can you guys give me some recommendations???",
        "content": "I like horror movies like The Conjuring/ Trashy but fun shows like Never Have I Ever/ Wholesome shows like Anne With An E or Young Sheldon!\n\nCan you guys give me some recommendations?? I prefer shows to movies!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1my1wah/can_you_guys_give_me_some_recommendations/"
    },
    {
        "id": "1mye9yo",
        "author": "Suspicious_State_318",
        "title": "Netflix Needs to Have a Chatbot that Recommends Movies/Shows",
        "content": "Netflix's recommendation system is meant to be top tier and they spend millions of dollars in R&amp;D making it incredibly good. But in terms of user experience, all I'm seeing is an endless feed of content that *might* be something that I would like but I would have no way of knowing until I consume enough of the content to have a good opinion on. The endless scroll recommendation system works great for something like TikTok because the content is literally a minute long but I'm not gonna spend twenty or thirty minutes on the off chance that I might like some show in my recommended feed.\n\nNetflix needs to add in a chatbot that not only recommends movies/shows based on what you have seen before, but also explains why you would like it and basically sells you on why it would be good.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mye9yo/netflix_needs_to_have_a_chatbot_that_recommends/"
    }
]