[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qc48y4",
        "author": "papa_commie",
        "title": "Qualcuno a Settimo Torinese disponibile per scambiare figurine Panini?",
        "content": "Non mi fido particolarmente della gente su Facebook che vuole spedire quindi preferisco fare dal vivo. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qc48y4/qualcuno_a_settimo_torinese_disponibile_per/"
    },
    {
        "id": "1qcb5ie",
        "author": "Correct_Seaweed2466",
        "title": "University of turin",
        "content": "Im thinking of applying to economic and finance with data science. I am currently enrolled in IB program and GPA of 3.9. What should I prepare for? I really want to get in. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qcb5ie/university_of_turin/"
    },
    {
        "id": "1qbwzgp",
        "author": "Bru_91",
        "title": "Cerco musicisti jazz",
        "content": "Ciao! Ho 34 anni, da tanto tempo suono il piano ma da circa 3 anni ho ripreso a studiare più seriamente jazz. Mi piacerebbe trovare qualcuno con cui suonare, l'ideale sarebbe bassista e batterista con cui formare ritmica, con l'idea principalmente di studiare insieme senza finalizzare gli incontri esclusivamente a esibizioni/serate. Il mio non é un livello professionistico, assolutamente, ma non sono nemmeno proprio agli inizi. Frequento già una scuola di musica ma lì non ho incontrato altre persone di Torino o con la stessa esigenza. Avete consigli o indicazioni? Grazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qbwzgp/cerco_musicisti_jazz/"
    },
    {
        "id": "1qat646",
        "author": "BrutalSock",
        "title": "Ma perché?",
        "content": "Cestino a 3 metri. La città è un campo minato di vetri rotti.\n\nMa perché?",
        "upvotes": 107,
        "comments": 56,
        "media": null,
        "permalink": "/r/torino/comments/1qat646/ma_perché/"
    },
    {
        "id": "1qbwuh3",
        "author": "Horror_Candle8127",
        "title": "Amicizie a Torino",
        "content": "Ciao a tutt\\* sono un ragazzo di 21 anni studente a Torino e vorrei fare amicizia ma sono imbarazzato a parlare con persone che non conosco così a caso e vorrei dei consigli/luoghi per fare amicizia qui a Torino. Faccio già palestra e ho il mio gruppetto qui, ma vorrei conoscere altra gente per espandere la mia rete di amicizie. Grazie già a chi mi risponderà 🫶",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qbwuh3/amicizie_a_torino/"
    },
    {
        "id": "1qb56ni",
        "author": "boluslai",
        "title": "Satispay: conviene?",
        "content": "Grande domanda che ho maturato da quando mi sono trasferito a Torino.\n\nVedo che in molti usano Satispay. La domanda è: conviene?\n\nMi sembra di aver capito che vada ricaricato, un po' come PayPal. Ma il vantaggio concreto qual è? Pagare direttamente senza fare la fila?",
        "upvotes": 24,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1qb56ni/satispay_conviene/"
    },
    {
        "id": "1qbpewy",
        "author": "solailes",
        "title": "Come si vive a Borgo Po?",
        "content": "Ciao a tutt\\*, vivo da 4 anni in San Salvario ma a breve un'amica potrebbe lasciarmi un appartamentino carino e non carissimo da affittare in Borgo Po. \n\nQualcuno che ci vive o lo frequenta mi sa dire come si trova? Ci sono delle belle realtà? Personalmente mi piace vivere in San Salvario perché c'è sempre vita e qualcosa da fare, gente per strada, mercati, baretti, casa del quartiere ecc.. e ho un po' paura che quella zona sia un po' troppo tranquilla o più frequentata da gente tanto più grande, ma non ho molta esperienza a riguardo. Allo stesso tempo è un quartiere oggettivamente bellissimo e più verde. Grazie! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qbpewy/come_si_vive_a_borgo_po/"
    },
    {
        "id": "1qbof63",
        "author": "Waste-Helicopter-460",
        "title": "Trasferimenti e acquisto casa Torino",
        "content": "Salve a tutti, sono under 30, vivo a Milano, ma ormai non la sopporto più. Vorrei trasferirmi a Torino, città che visiti spesso e mi piace, comprando casa (Max 200-250K).\nSarebbe bello che casa fosse un bilocale-trilocale (stanza, sala-cucina, bagno, e nel caso seconda stanza)\nQuali zone consigliereste per la ricerca a chi ama vivere in zone residenziali, pulite, ma vicine al centro (possibilmente a piedi o in metro)?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1qbof63/trasferimenti_e_acquisto_casa_torino/"
    },
    {
        "id": "1qb3ucv",
        "author": "ZeroTredici",
        "title": "Pagamento con Amex da ApplePay ai tornelli della metro",
        "content": "Ciao a tutti, DEVO condividere una situazione allucinante.\n\nCome ormai molti altri utenti fanno, non vado più in giro con le carte bancarie fisiche, ma uso solo più il Wallet di Apple; mi é quindi successo più di una volta di pagare l’ingresso alla metropolitana di Torino con il metodo Tap&amp;Go, per far diventare la mia carta (fisica o virtuale che sia) il mio documento di viaggio.\n\nEcco la parte divertente: se paghi con il Wallet usando American Express, i controllori GTT non riescono effettivamente a riconoscere il tuo acquisto, perché per qualche motivo il Wallet genera un codice carta fittizio che il loro sistema non identifica come valido.\n\nORA: più di una volta mi hanno fermato ed hanno cercato di farmi la multa, con la promessa di rimborsarla non appena avessi potuto provare di aver acquistato effettivamente un biglietto con il mio estratto conto….(certo, io adesso pago una multa non dovuta, recupero l’estratto conto e ve lo mando via mail, e poi attendo 6 mesi se va bene per avere un rimborso).\n\nIo ovviamente IMPAZZISCO davanti a queste cose e inizio ad agitarmi seriamente finché non capiscono che effettivamente é il loro sistema ad essere completamente NO SENSE, quindi fanno un passo indietro e mi lasciano andare.\n\nMa a questo punto mi chiedo, dato che ultimamente li trovo ai tornelli ogni volta che prendo la metro, c’é un modo per risolvere? A qualcun altro é successo?\n\nNON voglio sentire risposte/consigli tipo: \n\n‘usa un’altra carta’ \n\n‘paga in contanti’\n\n‘compra il biglietto in tabaccheria’\n\nperché sono loro a invitarti a usare AMEX e ad invitarti ad usare le carte digitali, quindi che trovino loro una soluzione, oppure tolgano AMEX dalle carte accettate.\n\nPlease help, perchè la prossima volta che mi fermano e non riconoscono il biglietto impazzisco.",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1qb3ucv/pagamento_con_amex_da_applepay_ai_tornelli_della/"
    },
    {
        "id": "1qbxj2r",
        "author": "Overall_Task_2783",
        "title": "Cerco programmatore per app o gente che ci sa fare",
        "content": "cerco uno capace di creare app o almeno che qualcosa e abbia voglia di imparare o la fame, preferibilmente uno che magari è all'uni o magari gente che non lo fa come professione ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qbxj2r/cerco_programmatore_per_app_o_gente_che_ci_sa_fare/"
    },
    {
        "id": "1qb6ajv",
        "author": "CardiologistSea9595",
        "title": "Quanto spendere di riscaldamento?",
        "content": "Ciao a tutti, ma voi quanto spendete per scaldare casa?\n\nMi piacerebbe fare un confronto dato che sto vedendo un po' di case con riscaldamento centralizzato e i preventivi sono altissimi!\n\nQualcuno inveve ha teleriscaldamento? Come vi trovate?",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1qb6ajv/quanto_spendere_di_riscaldamento/"
    },
    {
        "id": "1qb8v1l",
        "author": "MinimumInfinite",
        "title": "In omaggio al Torino",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/55mswsogrzcg1.jpeg?auto=webp&amp;s=c610c7b09bbffcbb82804e96517ed33797df90cb"
        },
        "permalink": "/r/torino/comments/1qb8v1l/in_omaggio_al_torino/"
    },
    {
        "id": "1qauo7d",
        "author": "Lucky_Assistance_293",
        "title": "Buche",
        "content": "Solo io sto vedendo dei crateri in questi giorni? \nÈ normale?\nNon mi riferisco alle classiche buche, ma ci sono proprio dei crateri oltre che profondi anche molto grandi... \nMagari è una mia impressione, sono abituato a girare in altri posti e in questi giorni Torino mi è sembrata molto messa male... Peccato...  ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qauo7d/buche/"
    },
    {
        "id": "1qawjea",
        "author": "marizaaaa",
        "title": "what to visit in Turin?",
        "content": "hello!\n\ni'm visiting turin again at the end of the month for 3 days (2 full days, 1 half day) and i'm wondering what else i can visit. i've been in turin in december for 4 days and here's what i visited when i was there:\n\npalazzo reale, museo egizio, galleria subalpina, venaria reale &amp; gardens, gran madre di dio, monte dei cappuccini, parco del valentino, river po, mole antonelliana (only outside)\n\nas well as walked through piazza castello and its shops, piazza vittorio veneto, piazza san carlo, piazza statuto.\n\ni would like any recommendation that includes history, museums, beautiful cafes where i would try anything local, or **i would be glad to receive any recommendation at all**! :)\n\nthank you in advance!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qawjea/what_to_visit_in_turin/"
    },
    {
        "id": "1qb1ndi",
        "author": "Training-Delay3986",
        "title": "bachloers in automotive engineering polito",
        "content": "hi everyone.. I am an Indian student wanting to do bachlors in automotive engeneering in poleticno di torino.. i don't know italian but it is mentioned that there is a fully english course.. but I'm still confused and unsure abt it can anyone please share some information if it's completely English taught for all 3 years??",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qb1ndi/bachloers_in_automotive_engineering_polito/"
    },
    {
        "id": "1qb1mre",
        "author": "Training-Delay3986",
        "title": "bachloers in mechanical engineering polito",
        "content": "hi everyone.. I am an Indian student wanting to do bachlors in mechincal engeneering in poleticno di torino.. i don't know italian but it is mentioned that there is a fully english course.. but I'm still confused and unsure abt it can anyone please share some information if it's completely English taught for all 3 years??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qb1mre/bachloers_in_mechanical_engineering_polito/"
    },
    {
        "id": "1qaqgy8",
        "author": "Specialist-Fig-5872",
        "title": "Grissini….Digestivi?!",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h5yz9dl3vucg1.jpeg?auto=webp&amp;s=6a71231d72c86b3c87210dd977aeb67a08d3f08d"
        },
        "permalink": "/r/torino/comments/1qaqgy8/grissinidigestivi/"
    },
    {
        "id": "1qa7zgs",
        "author": "Gadano",
        "title": "Cosa avete combinato? C'è un elicottero che vi cerca da un paio di ore.",
        "content": "",
        "upvotes": 27,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qa7zgs/cosa_avete_combinato_cè_un_elicottero_che_vi/"
    },
    {
        "id": "1qasdne",
        "author": "Tatjana_queen",
        "title": "Ciao a tutti, mi trasferirò a Torino tra circa un mese. Mi servirebbero i vostri migliori consigli su alcune cose.",
        "content": "1. **PALESTRA:** Cerco una palestra ben attrezzata (con macchine Technogym) che abbia anche spa/sauna e corsi come Pilates Reformer. Zona centrale o comunque ben servita.\n2. **COWORKING/CAFFÈ:** Conosco lo Starbucks in centro. Potreste consigliarmi altri bar  dove poter lavorare al PC o degli spazi coworking?\n3. Indicativamente, che prezzi hanno?\n4. **COMMERCIALISTA:** Ho una situazione fiscale mista (dipendente + partita IVA) e faccio il Modello Unico. Cerco un bravo commercialista in presenza (non online) che:\n   * Capisca il mondo online (fatturazione elettronica, pagamenti dall'estero).\n   * Sappia gestire l'iscrizione alla Camera di Commercio per evitare la doppia contribuzione INPS (se mi qualifico)\n   * Mi segua con competenza \n5. **EVENTI SOCIALI:** Consigli su eventi per conoscere persone, tipo \"Wine &amp; Paint\" \n\nGrazie mille in anticipo per l'aiuto! :))))",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1qasdne/ciao_a_tutti_mi_trasferirò_a_torino_tra_circa_un/"
    },
    {
        "id": "1qa9gav",
        "author": "carmelolg",
        "title": "About my last Christmas break with Nikon D3300 18-55mm f/3.5-5.6G",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qa9gav/about_my_last_christmas_break_with_nikon_d3300/"
    },
    {
        "id": "1q9mwh4",
        "author": "Tui_Coi",
        "title": "Rave party sul tetto della regione?",
        "content": "Voglio assolutamente sapere che tipo di party hard fanno sul tetto della regione, voglio partecipare anch’io ",
        "upvotes": 191,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4j2v7fb6pmcg1.jpeg?auto=webp&amp;s=25ceb935ae2efbe1e3a2fcb3ef542ca35b489c97"
        },
        "permalink": "/r/torino/comments/1q9mwh4/rave_party_sul_tetto_della_regione/"
    },
    {
        "id": "1qa8l3l",
        "author": "_L_-",
        "title": "Massaggi a Torino",
        "content": "Dove posso andare a fare dei massaggi seri (no happy ending) per stress muscolare?\n\nZona centro, Crocetta e dintorni ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qa8l3l/massaggi_a_torino/"
    },
    {
        "id": "1qa98dg",
        "author": "Liquid_Snake_72",
        "title": "Parcheggi via bianchi",
        "content": "Sono nato e cresciuto a Torino e fin da piccolo ho sempre notato che le auto in via Bianchi (nel tratto da piazza Campanella verso corso Lecce) parcheggiano sulla linea di mezzeria, dato che ai lati ci sono le rotaie del tram.\nMi chiedevo: questi parcheggi sono autorizzati dal Comune oppure si tratta di una sorta di “regola non scritta”?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qa98dg/parcheggi_via_bianchi/"
    },
    {
        "id": "1qaevsl",
        "author": "kussent",
        "title": "CERCO BATTERISTA",
        "content": "Ciaoo a tutti! Sto formando una band metalcore/sperimentale con un forte concept narrativo e un lore proprio a provincia di torino.\n\n\nCerchiamo un batterista motivato e con voglia di costruire qualcosa di serio nel tempo (17 - 28 anni). Interessato/a alla sperimentazione e alla performance\n\n\nInfluenze: metalcore, alt metal/rock, deathcore, post hardcore, elettronica, deep house, dark ambient, acustici\n\nBad Omens, Sleep Token, Bring Me The Horizon, Asking Alexandria, Chelsea Grin, Lamb Of God, Three Days Grace, Slipknot... \n\n\nAttualmente siamo: voce (clean/scream), chitarra 7 corde, basso e tastiere elettroniche\nSe qualcuno è interessato o vuole più info, scrivetemi in privato, posso inviare un Canva con tutto il progetto !! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qaevsl/cerco_batterista/"
    },
    {
        "id": "1qa47uw",
        "author": "emanueleoggiano",
        "title": "Locali con proposte senza glutine",
        "content": "Ciao, mi sono trasferito a Torino da qualche mese e ho un problema di celiachia. Potreste suggerirmi qualche locale (bar, ristoranti, altro) con proposte senza glutine?\n\nEDIT: grazie a tutti per le risposte",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1qa47uw/locali_con_proposte_senza_glutine/"
    },
    {
        "id": "1q9uv54",
        "author": "Interesting_Pen161",
        "title": "Mi sono trasferito da poco a Torino: fotografia, disegno, bici e due chiacchiere",
        "content": "Ciao!  \nSono argentino, mi sono trasferito da poco a Torino e mi piacerebbe conoscere persone con cui condividere interessi e fare due chiacchiere.  \nMi piace disegnare, stampare, fare uscite fotografiche, esplorare posti nuovi (anche paesini nei dintorni), andare in bici o camminare, oppure semplicemente incontrarsi, chiacchierare — mi piace anche l’idea dello scambio linguistico: italiano, spagnolo e inglese — e bere qualcosa insieme come un caffè o un mate 🧉.  \nMi farebbe piacere entrare in contatto soprattutto con persone più o meno della mia età (30+), senza troppe etichette 🙂  \nA presto\n\nhttps://preview.redd.it/5co4vqsxqocg1.png?width=2000&amp;format=png&amp;auto=webp&amp;s=4f4db3d4303960cff86a607661fc57a3d6a861f7\n\nhttps://preview.redd.it/9rjwl6ffrocg1.png?width=900&amp;format=png&amp;auto=webp&amp;s=0be4c7d179d1c7da3cc93682e7ff2b0ca320b4a2\n\n  \n\n\nhttps://preview.redd.it/7dhhpnluqocg1.png?width=1126&amp;format=png&amp;auto=webp&amp;s=0d3bb2cbf25b7079b3ee7755e0018f4d3082858d\n\nhttps://preview.redd.it/q881y550rocg1.png?width=1126&amp;format=png&amp;auto=webp&amp;s=0056ed1d4ab38f77d6445f4cf5a224e9ebd515ed\n\nhttps://preview.redd.it/ncluanlasocg1.png?width=966&amp;format=png&amp;auto=webp&amp;s=3632af85e25946fe3171b0244d248bf87962ac62\n\n",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q9uv54/mi_sono_trasferito_da_poco_a_torino_fotografia/"
    },
    {
        "id": "1qa9xz8",
        "author": "Open-Bathroom3465",
        "title": "Clubs",
        "content": "Ciao, I'm visiting torino for a week can't find a place to drink and dance, searching for a place where people will understand english😅",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qa9xz8/clubs/"
    },
    {
        "id": "1q9ctvy",
        "author": "IMNAGMAIMNAAI",
        "title": "Some photos I took in Jan/2020 when I was in Torino",
        "content": "The weather was quite chilly. I was surprised how flat the city was. Nature was very beautiful, and people were very nice. The whole city was very calm and peaceful 👌",
        "upvotes": 200,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1q9ctvy/some_photos_i_took_in_jan2020_when_i_was_in_torino/"
    }
]