[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 633,
        "comments": 4873,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nikksv",
        "author": "Less-Pen-5705",
        "title": "Yall remember back in the day when Netflix basic no ad plan was like 7/8.99???",
        "content": "Good times….now you have to pay like 20+ bucks to enjoy content without commercials…not only that, they’re piping down on password sharing and making it hard for people to use their family members/friends accounts….not only that, also the very limited new content that they have and the old content that they keep removing….in some ways Tubi is better than Netflix LMFAOOO. Yes tubi may have ads but atleast tubi is free!!! No way I’m paying 10/15+ bucks a month to still watch fucking commercials.",
        "upvotes": 32,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1nikksv/yall_remember_back_in_the_day_when_netflix_basic/"
    },
    {
        "id": "1nhxelr",
        "author": "SnooRevelations7068",
        "title": "Netflix cancelled after 10 years. Are you feeling Netflix has gone downhill too?",
        "content": "Hit me yesterday, we haven’t checked out Netflix in awhile. Popped in, layouts completely different and nonsensical, and there really wasn’t anything good or new. Cancelled Netflix after 10 years, but the lack of content and cancelling of interesting shows after a season was ruining Netflix for us anyways. Wife and I both agreed, we don’t give af about the last season of Stranger Things anyways. Anyone else feeling the same way?",
        "upvotes": 617,
        "comments": 458,
        "media": null,
        "permalink": "/r/netflix/comments/1nhxelr/netflix_cancelled_after_10_years_are_you_feeling/"
    },
    {
        "id": "1nilndj",
        "author": "darth_vader39",
        "title": "Tom Clancy's Splinter Cell: Deathwatch | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nilndj/tom_clancys_splinter_cell_deathwatch_official/"
    },
    {
        "id": "1ni7h51",
        "author": "Fabulous-Question173",
        "title": "Adolescence",
        "content": "So I started this today and I can't stop watching it. I can definitely understand why it won some awards. The show touches on a lot things that some of us just don't think about. I can't imagine what kids go through with social media nowadays. I was a freshman in HS in 2002. We were right on that beginning of it. We were right at that age where everyone still got outside and did everything. Like drag main street. Later on it was bon fire parties. I can't even begin to imagine the photos and videos that could be out there. ",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ni7h51/adolescence/"
    },
    {
        "id": "1nieev1",
        "author": "Orii21",
        "title": "Girl From Nowhere",
        "content": "Anyone can confirm if the 2018 thai series \"Girl from Nowhere\" is available in 4K? I'm gonna rewatch it and I'd subscribe to the Premium plan if it is.\n\nI think the most accurate info I can get about it is by asking directly in this sub.\n\nThanks.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nieev1/girl_from_nowhere/"
    },
    {
        "id": "1nhznag",
        "author": "theseawoof",
        "title": "Have series ever been renewed years after being cancelled?",
        "content": "Has Netflix been known to bring shows back after having been cancelled by them for years? Seems like shows get cancelled by Netflix quite a bit, but I've never really thought much about if they've been revived or not. \n\nBeen hung up on Skylines (2019) and Archive 81 (2022) for example. Extraordinary shows with great writing, casts and acting. Among shows that found their voices instantly, and continue lingering since they just began intriguing stories with no resolution. I'm over here trying to brainstorm how things would play out 🫠 so many great character journeys that need to continue- a disservice to the art",
        "upvotes": 18,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1nhznag/have_series_ever_been_renewed_years_after_being/"
    },
    {
        "id": "1ni5ls3",
        "author": "Reasonable-Ad-4760",
        "title": "Any shows like Archive 81?",
        "content": "I just started it and love it so far but i know there’s only one season. Particularly looking for something that has a mystery beyond the typical crime show premise ",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ni5ls3/any_shows_like_archive_81/"
    },
    {
        "id": "1ni30hi",
        "author": "HeyItzArrow",
        "title": "Not working?",
        "content": "Netflix won’t load once I click on a movie or show on my PC. It brings up the black loading screen with the red circle that goes around but never actually loads. \n\nAnyone else having this issue right now?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni30hi/not_working/"
    },
    {
        "id": "1ni6bi3",
        "author": "ReferenceSufficient",
        "title": "Echoes of Survivors; Inside Korea's Tragedy",
        "content": "Netflix most disturbing documentary yet of the Horrific torture and killing (thousands) innocent people including young Children in Korea in 1980s.  \nThe man who was in charge hardly got punished.  ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni6bi3/echoes_of_survivors_inside_koreas_tragedy/"
    },
    {
        "id": "1nh8v1b",
        "author": "indiewire",
        "title": "Owen Cooper Wins Emmy for 2025 Best Supporting Actor",
        "content": "",
        "upvotes": 312,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8v1b/owen_cooper_wins_emmy_for_2025_best_supporting/"
    },
    {
        "id": "1nibzg9",
        "author": "Heavy_Gap_5047",
        "title": "Netflix Deleted My Account and Stole My Balance",
        "content": "So I use Netflix sparingly, every once in a while I'll pick up a gift card, and watch for a month or two. It'd been a while so today I snagged a card at the store, and went to restart my membership. Go to log in and nope, account is gone, Netflix has no record of it or the balance left over from the last time I did this.\n\nI contact support and they're useless, to them it's as if my old account never existed. They appear to think their system is infallible, that if I ever had an account they'd be able to find it, but clearly this is not true.\n\nSo bottom line, Netflix stole the about $5 credit I had left from my last $20 gift card.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nibzg9/netflix_deleted_my_account_and_stole_my_balance/"
    },
    {
        "id": "1nibkzb",
        "author": "historyinprogress",
        "title": "Smith County Strikes Again (I Am a Stalker)",
        "content": "This was an okay series. Some stories were crazier than others but Episode 5? Come on. It felt like a stupid prank. I laughed a few times because it was so ridiculous. It’s something 13 year old girls would do to scare someone they don’t like. I don’t think it belonged with the rest of the stories in this series because it was so stupid. \n\nBut Smith County is a f-d up place and this is the 3rd documentary I’ve seen that reiterates that. I don’t know why anyone would want to live there. The police in that county are nuts. It feels like one sorry after another shows how bats-t that place is. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nibkzb/smith_county_strikes_again_i_am_a_stalker/"
    },
    {
        "id": "1ni2hav",
        "author": "Atlast_2091",
        "title": "The Great Flood | Official Teaser | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni2hav/the_great_flood_official_teaser_netflix_eng_sub/"
    },
    {
        "id": "1nhksce",
        "author": "MysteriousDelay6266",
        "title": "The Beast in Me | Official Teaser | Netflix | November 13",
        "content": "# THE BEAST IN ME\n\nClaire Danes, Matthew Rhys, and the team that brought you Homeland. \n\n* **The Beast in Me coming November 13th.**",
        "upvotes": 27,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1nhksce/the_beast_in_me_official_teaser_netflix_november/"
    },
    {
        "id": "1ni4cib",
        "author": "OkPea8377",
        "title": "A Wrong Paris (2025) - review",
        "content": "The Wrong Paris - it has everything, but something seems to be missing.\n\n\nThe brand new romantic comedy from the most famous digital streamer debuted recently and has already achieved great success. Starring former Nickelodeon teen star Miranda Cosgrove, in her second original work on Netflix (her first original work on the streamer was “A Mãe da Noiva”, another big recent success on the platform) and Pierson Fodé (The Perfect Date).\n\nSummary\nDawn (Miranda Cosgrove), a metallurgical artist, lives in the interior of the US state of Texas with her grandmother Bird and her sisters, dreaming of following in her mother's footsteps and becoming a real artist. Dawn, responsible, dedicated herself to working at a local café for a long time due to her private financial funds to study art in Paris. She actually manages to pass university, however, without the full scholarship, her savings are insufficient.\n\nOne of her sisters, a fan of reality shows, suggests that she sign up for the current production, the “Honeypot” or “Honey Pot”, a competition between women with 20 thousand dollars guaranteed to those selected for the great contest in search of the keys to the heart of a rich single man, which conveniently would take place in the City of Lights — or that's what the participants thought.\n\nSelected and gaining the affection of one of the show's producers, Dawn finds herself ready to reach the Eiffel Tower house. However, she is surprised by the production's prank, and the primary cause of the film's name, which lands her in Paris, Texas, less than 100 km from her home. Remaining in the dispute only for contractual reasons, she soon arouses the interest of the millionaire of the moment, Trey McAllen III (Pierson Fodé), a handsome cowboy, initially determined to be eliminated immediately. Throughout the dispute, between tests and intrigues typical of reality shows in confinement and some extra game moments, she will allow herself to live this passion.\n\nComments and opinion\nHome to many successful relationship reality shows, Netflix ironizes its own productions. From the beginning, Honeypot is presented as a self-criticism, properly a parody of the reality television genre. The entire structure and characters involved in the dispute are stereotypes of the most common human types to expose themselves in front of the cameras: the rich and spoiled influencer, the old school biker, the nerd, the free lover, the forgotten celebrity, the alternative girl, etc.\n\nThe film was directed by Janeen Damian, who has experience in the romantic comedy genre. He has already directed two other Netflix productions in the same style: Christmas Eve and Irish Wish. In The Wrong Paris, she inserts all the common and pleasant elements of romantic comedies, being quite predictable, which is no demerit. After all, when watching films or series of this type, we want an escape valve from the chaotic everyday life, where we have little or no control over what is going on around us. The constant presence of Dawn's family is an especially pleasant difference, constituting the viewer's voice within the film.\n\nEspecially her grandmother Bird, an emotional component of the plot, frequently advises her granddaughter and encourages her. Sometimes he interferes in the story that the most anxious audience would like to do for themselves. Miranda brings beauty and humanity to the film; It is perfectly possible to be indignant with her regarding the “villainess”'s far from discreet advances on the handsome millionaire. She conveys the character's insecurities well and definitely makes us fall in love with her too — an essential element for any self-respecting romantic comedy. Pierson fulfilled what his character needed: he delivers someone who is attentive, concerned, handsome and very passionate about the protagonist. There could be a slight touch more chemistry between the two characters (annoying me? Maybe).\n\nFeaturing beautiful landscapes and an interesting cast, the film also stands out for the quality of its production, ideal for the romantic comedy genre. Despite this, the story could have been better worked on. At 1h45 long, the extremely light plot (a good sign) goes by too quickly. There could be better development of the \"villain\" and the protagonist's confidant, through dialogues between them and the main character. In my opinion, there could have been more frank dialogues between the protagonist couple, giving a more solid basis for the passion between them. Some moments between Paris, Texas, and Paris, France, appear to occur with an expressed passion, without much emotional basis. Maybe 15 more minutes of film wouldn't hurt the production.\n\nWith an insightful critique in the background of the futility of influencers and the world of reality shows, limited to the formulas of the genre, it could have promised more than just a light and pleasant romantic comedy for a late afternoon when you just want to turn off your brain and disconnect from the busy routine, with cute moments starring passionate characters. I would have easily given that away. I think it was designed to be a single film, but there could be a sequel expanding this wonderful universe, especially Dawn's relationship with her family, especially her sisters.\n\nFINAL RATING: 4.5 STARS",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni4cib/a_wrong_paris_2025_review/"
    },
    {
        "id": "1ni7wsy",
        "author": "StaticLizard",
        "title": "Iso this top from the wrong paris !!!!",
        "content": "Does anyone know where the top Rachel is wearing in the wrong Paris. It's so cute and can't find it anywhere! Looking for this shirt from the movie. Help! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni7wsy/iso_this_top_from_the_wrong_paris/"
    },
    {
        "id": "1ni6vxu",
        "author": "Puzzleheaded_Sky3043",
        "title": "What are your opinions on the episode “Remember when our boys became men” from family reunion?",
        "content": "do you think it showed the issue poc face well? Whats your thoughts on the episode? I personally haven’t seen the episode in a while so i’m going back to rewatch it, however i do want your opinion on the episode since i do remember the general basic plot of the episode. Was there anything you did or didnt like? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni6vxu/what_are_your_opinions_on_the_episode_remember/"
    },
    {
        "id": "1ni1ymy",
        "author": "Ordinary_Mechanic_72",
        "title": "Hotel room tv to-go",
        "content": "Today 3 different customer support suggested me to either change my household or take the hotel room tv home so it's registered to my household...\n\nI stay around 260 nights a year at hotels and is the first time ever I got into this problem of not being able of logging into the hotel tv. And the answer given just makes me want to crush some heads. Previously I would get a \"traveling\" option,  not any more\n\nAnd, changing household means my family won't be able to watch it back home.... ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ni1ymy/hotel_room_tv_togo/"
    },
    {
        "id": "1ni5una",
        "author": "More-Steak-2600",
        "title": "Why is narcos not coming back",
        "content": "By far the best show. I mean production and storytelling was amazing. I thought we were going to get el chapo story I mean it did sort of end eluding that but idk. I still rewatch it ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ni5una/why_is_narcos_not_coming_back/"
    },
    {
        "id": "1ni5u8b",
        "author": "kartiervision",
        "title": "What’s a better show",
        "content": "Empire (the series) or Tyler Perry beauty in black??? I will have to say empire because that’s just my comfort show that I still binge watch to this day lol but I do feel like beauty and black got potential to be great!!!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ni5u8b/whats_a_better_show/"
    },
    {
        "id": "1ngxqjc",
        "author": "CultOfCurtis1",
        "title": "Love Con Revenge is honestly the most amateur, misleading, defamatory, insulting to our intelligence \"documentary\" I've ever watched.",
        "content": "I honestly don't know where to start with this. The primary host is presented as some expert — even speaking about psychology she clearly has no understanding of — when in reality she's just someone who fell for a scam. The private investigator? She doesn't seem to understand the law at all, calls up people and says *\"I'm investigating this person\"* with zero clue if the recipient of the call is friends with the target (which could expose her), and tails cars by following them in U-turns, parking lots, etc while wondering \"Do you think he spotted us?\"\n\nSeveral guys on the show are clearly unpredictable criminals. Which also makes it nuts that they're taking these women to confront them face to face when they should be calling the police. They tracked a guy who was a fugitive from justice, and instead of calling the cops, they went to yell at him (tipping their hand and potentially giving the target time to flee). Even worse? It's the misleading crap and leaving information out. \n\nThroughout the series, the show presents claims that are in no way verified. It's like they took *every* \"case\" that came their way, and when stuff started to look sus, they kept going and just left out info. For instance, [another Redditor](https://www.reddit.com/r/netflix/s/tymYcHrKzg) looked up the clinic from the Dr. Wilkerson episode and discovered that the victim was *heavily* involved in the practice — with many of the complaints over the years specifically mentioning her behavior. \n\nAnd while we're on that episode, the \"victim\" dropped her civil suit? And she's facing charges for filing a false police report? And even though there's a claim that the guy opened fake accounts in the daughter's name (a clear crime that would result in arrest), there's been no charges filed? And Netflix didn't feel like showing us evidence of those alleged fraudulent accounts? Even worse, the \"after story\" text at the end of the episode was up for mere seconds. I'm not into conspiracies, but it's almost like they *didn't want us* to read the additional info that cast doubt onto the entire story. \n\nLeading up to the Dr Wilkerson episode, I was already a little irked by the show. Even when it was established that there was no evidence of crimes, the hosts would say things like \"At least he's been exposed.\" Been exposed about what? That an ex partner is saying negative stuff about them? Stuff you completely didn't prove, not even enough to support a civil lawsuit (which isn't a high evidentiary standard)?\n\nBut yeah, the episode with the doctor is going to be it for me. By marrying his \"victim,\" he ensured that any debt would be his responsibility too. Great con artist, right? The episode clearly left out all information that showed the \"victim\" might be lying. And while earlier episodes *clearly* showcased real con artists, the way in which they were handled was dangerous, amateur, and is very likely to result in defamation lawsuits against Netflix. \n\nThis show idea was great, but the execution is absolutely pathetic. Did these two ladies just go out filming stuff on their own and then show up to Netflix like, *\"You should show this\"*? The \"private investigator\" is essentially using Google and hiring others to find info for her, and Cecilie Fjellhøy's only place in the show should be in a \"this is what happened to me\" role rather than speaking as if she's a subject matter expert (she's clearly not). Even worse, they're pushing unverified claims that will ruin people even if they end up not being true. \n\nAnd by the way, repeatedly badmouthing the police *is not* a smart way to ensure the police keep discussing cases with you in future seasons. This is worse than amateur hour. It's amateurs manufacturing anger for ratings — because they know a large portion of folks won't care about pesky little things like a lack of facts while treating real scam incidents and jilted ex scenarios as if they're equivalent. \n\nNetflix, do better. ",
        "upvotes": 309,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1ngxqjc/love_con_revenge_is_honestly_the_most_amateur/"
    },
    {
        "id": "1nhgyt8",
        "author": "rs1909",
        "title": "Adolescence!!",
        "content": "So so happy with all the Adolescence wins at the Emmys. What a sweep in every category it was nominated in. We need so much more content like this. Made with so much love and empathy. So real!! And technical marvel no less!! Congratulations to everyone at Adolescence ",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nhgyt8/adolescence/"
    },
    {
        "id": "1nhsgx3",
        "author": "Majestic-Day-5024",
        "title": "crawford post win",
        "content": "to me, crawford still hasn't had as much attention to his win against canelo, I don't really know what I was expecting but to me; it was a punch perfect performance against world class opposition, &amp; yet I've hardly seen much said about him.\n\nhas anyone else thought this? in my eyes he's one of the best boxers i've ever seen fight \n\nis he just not as well known as some of the other names? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nhsgx3/crawford_post_win/"
    },
    {
        "id": "1ni60ye",
        "author": "hermit_heaven2265",
        "title": "What’s the cheapest Netflix plan in your country? (India has a ₹149/$1.75 mobile plan)",
        "content": "I was surprised to see how affordable Netflix is in India compared to what friends abroad pay. Here, the cheapest option is the mobile plan at ₹149 per month (around $1.75 USD). I’m curious to know what the lowest Netflix subscription costs in your country, and whether it’s a mobile-only or a full plan. Please share your location and the price, it’ll be interesting to compare worldwide differences.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ni60ye/whats_the_cheapest_netflix_plan_in_your_country/"
    },
    {
        "id": "1ngvjx4",
        "author": "McKenna1981",
        "title": "Cancellations",
        "content": "When is netflix going to realise they're a streaming platform.  \n\nThis means new shows will not attract viewers the instant they drop, because they're already busy binging other shows.\n\nSo they need to stop cancelling new shows within weeks of their first season appearing.\n\nGetting very annoyed with netflix lately.  Rant over.",
        "upvotes": 283,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ngvjx4/cancellations/"
    },
    {
        "id": "1nhyy1g",
        "author": "Pretty_Track_7505",
        "title": "I’m so mad about La Palma rn",
        "content": "How can anyone rate this higher than two stars or like 4 out of 10 at best? \n\nIt had good premise, sure, it was promising BUT it disappointed so badly I can’t even begin to describe.\n\nSPOILERS AHEAD \n\n&gt;!Guy’s getting arrested, for apparently no reason, then his stupid sister hits a cop and suddenly she’s getting arrested and they forget about her brother lmao!&lt;\n\n&gt;!Doing all that just so they can have a reason to release a guy from prison who’s gonna kill her brother later… it’s so stupid, his death was so unnecessary to the plot I can’t.!&lt;\n\n&gt;!Stupid daughter wants to go back in the queue to TALK to her girlfriend, EVEN THO she’s getting in the other plane right behind her.!&lt;\n\n&gt;!But none of that matters because not one plane takes off anyways, and they get hit by tsunami, nearly drown, but conveniently daughter survives by falling asleep? Or whatever the fuck that was.\nTHEY SHOULD’VE DIED NOT THE BROTHER!&lt;\n\n&gt;!Also the stewardess doing CPR on her girlfriend for 5 minutes, cause fuck other travelers am I right?!&lt;\n\nI probably missed something, but anyways sorry for the rant I was mad because the series didn’t deliver WHICH THEY COULD, EASILY.\n\nedit: spoiler tags",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nhyy1g/im_so_mad_about_la_palma_rn/"
    },
    {
        "id": "1nha26l",
        "author": "Ok_Independent5571",
        "title": "A light hearted not so long show to binge?",
        "content": "Ive seen a LOT of shows ok? But currently I'm not in the mood at all to watch a breaking bad type. \nOr better call saul. But it doesn't have to be that light hearted, as long as it has good writing, and not traumatizing like baby reindeer or Orange is the new black then I'll take it.\n\nShows I've seen: \nThe good place (I want something like this, even tho it was 4 seasons, it was so well written and i loved the lightness of it.) \n\nArcane (loved the animation, and the writing, season 2 sorta flopped but its ok) \n\nBojack horseman (😭😭😭i fucking love this show) \n\nAvatar the last Airbender (i would sell a kidney to experience it for the first time again) \n\nQueens gambit (10/10) \n\nMaid (😭👍🏻) \n\nThe last kingdom (AMAZING) \n\nCrazy ex girlfriend (it was insane that i randomly found this show and it became my FAV SHOW ever.) \n\nBlack mirror (i loved the way the episodes made me think. One of my favs, perfect level of disturbing)\n\nDark (🥀🤧✨️) \n\nbridgerton (its good... but a bit cringe, not the most amazing writing, QUEEN CHARLOTTE however was amaziinggg) \n\nWednesday (kinda felt like it wasted my time) \n\nBlue eye samurai (loved it) \n\nDerry girls (😍) \n\nBaby reindeer (it was rlh good..., it was so triggering😰) \n\nHeartstopper (THIS SHIT IS ADORABLE UGH idc if its not the most amazing wtiting, the characters chemistry is adorable)\n\nBEEF (it was good....) \n\nOrange is the new black (its a good show but i 100% regret watching it. It was way too dark for me. I still get flashbacks to it like it was traumatizing)\n\nMO (haha funny) \n\n\nSex education (fun, later seasons a bit ass) \nThe end of the fucking world (loved it) \n\nOne day (😐) \n\nYou (i have no idea how to feel about this show. I wouldn't recommend it to ppl but i wouldn't call it a waste of time) \n\nDead to me (i liked it.., cliche but still..) \n\nSquid games (darn)\n\n\n\n\n",
        "upvotes": 25,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1nha26l/a_light_hearted_not_so_long_show_to_binge/"
    },
    {
        "id": "1nhuelp",
        "author": "unrealootin",
        "title": "Crunchyroll has voice search... what's up?",
        "content": "Chrunchyroll, a significantly smaller company than Netflix has a capable voice search on their TV app. We all know that TV manufacturers are incompetent when it comes to designing remotes. If they were not, air mouse would be a standard by now and my remote wouldn't look like it came out when I was born. And Android TV OS will probably never make sense. But then app makers figured it out. If we can not make the ui or a remote be usable, lets add a voice search. And Netflix said, naaaah... We love when they tire out their little thumbs. Get a grip Netflix. Add voice search... And sorry everyone for the rant ✌️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhuelp/crunchyroll_has_voice_search_whats_up/"
    },
    {
        "id": "1nhtnlx",
        "author": "missylyssy3210",
        "title": "Gaten Matarazzo reflects on final season of stranger things",
        "content": "\nhttps://youtu.be/NUtr6nrH7WI?si=d6noohFPuDxdF9eh\n\nDuring an interview from a lego star wars press junket gaten reflected on what thw show has taught him, when asked how fans would react to the final season he said they would be happy and it’s the perfect ending ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhtnlx/gaten_matarazzo_reflects_on_final_season_of/"
    },
    {
        "id": "1nhst6s",
        "author": "Luciferisnotalright",
        "title": "Shows like htsdo(f) and queenpins?",
        "content": "I really like the concept of like online illegal businesses in movies, like how to sell drugs online(fast) and queenpins\n\nSome unrelated but also shows that I liked(that may give u a bit of a better idea) \nThe end of the f*** world\nThe 7 Lives of Lea\nRussian Doll\nPoker face\n\n\nVibe wise teotfw and htsdof are my favorites ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nhst6s/shows_like_htsdof_and_queenpins/"
    }
]