[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 117,
        "comments": 360,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mrqbz2",
        "author": "Flowerofthesouth88",
        "title": "S Club 7 Netflix documentary in The Works",
        "content": "I know there was more of no hit wonder in The US with Never have a dream come true but in The UK and a few countries they had a few hits but The band isn’t make much money then people thought and once they broke up, They still have financial issues that one member, Jon Lee turned to drug abuse to cope and drug abuse that nearly killed him, And Paul Cattermole sadly died in 2023 of natural causes and was on benefits months prior and tried to sell his Brit Awards trophy just pay The bills, Jo O'Meara was a contestant on Celebrity Big Brother UK in 2007 where she was controversy of racism in The house that killed her career in The end and had suicidal thoughts because what went on as she even had death threats from The public, It’s would be interesting for Netflix Viewers to watch even there not into S Club 7 or never heard of them because with The darkness that The band went during and after S club 7 and that it’s shows how little they made within The success within how much fame and little money they made that The fans didn’t think and also how there mental health can take a toll. ",
        "upvotes": 233,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1mrqbz2/s_club_7_netflix_documentary_in_the_works/"
    },
    {
        "id": "1mrsbex",
        "author": "Et_Crudites",
        "title": "The Residence had more things I hate than in any other show I like overall",
        "content": "Halfway through. It’s a fun mystery. I like Cordelia when she’s being her own take on Sherlock Holmes. It should be great. The problem for me are some parts that are so distractingly awful they ultimately stick with me more than anything else. To wit:\n\n- Birding. I’ve never been more annoyed by a main character’s quirk. Every mention of birding felt forced, and not a single analogy landed. It felt like some writer read that specific birding book Cordelia carries around and got a huge inflated ego about it. I will instantly judge anyone I find out is into birding going forward. That’s not fair to them and it’s The Residence’s fault. \n\n- Two unbelievably bad actors. 1) The Secret Service comic relief guy is painful to watch. I feel second-hand embarrassment when he’s trying to make the Kylie Minogue jokes land. Heinous comedic acting. 2) The Congresswoman who constantly interrupts the proceedings. I initially thought they were going for a caricature of boorish, ignorant politicians, but now it seems like she was supposed to be playing some kind of champion of skepticism, challenging the establishment? Either way she comes off like she read the script immediately before each take, took a shot, did her lines, then did them again after the director told her to lay on the sarcasm even more thick. Truly awful. \n\nSnark - These writers cannot do snark. They think they can and that makes it worse. I almost turned it off for good in the office scene when the slimy friend of the president tells Cordelia “This is bigger than you” and her response is “Do you mean the house is bigger than me, because, like, duh, I’m inside the house!” \n\nI’m sorry, I had to get this out of my system. Normally any one of those annoyances would be a dealbreaker and I’d happily move on with my life. But I want to see how this ends. And I can’t until I purge my hatred of some do this stuff. ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mrsbex/the_residence_had_more_things_i_hate_than_in_any/"
    },
    {
        "id": "1mrbk7y",
        "author": "AsCrowsFly75",
        "title": "Because You Watched 😡",
        "content": "Is there any possible way to change the layout on Netflix? The current interface is so annoying. While they’re at it, please for the love of all that’s good, label a film or series as international so people can decide if that’s what they want or not. I have so many ‘Resume Watching’ shows that I bailed on because it was foreign with shitty voice-overs. ",
        "upvotes": 64,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1mrbk7y/because_you_watched/"
    },
    {
        "id": "1ms051n",
        "author": "niloufaeri",
        "title": "about echoes of survivors, ep1-2",
        "content": "i watched the first two episodes and it was gut wrenching. i am horrified this happened and i am utterly sad and outraged for the victims. i had absolutely no idea about this tragedy and i feel like more people should know about it. i mean there is barely any discussions or documentary about such horrific event. we should talk about this more, if there is any way the victims must know that the world has heard them and that we stand by them. has anyone here watched it too? and had you already heard about this case before ?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ms051n/about_echoes_of_survivors_ep12/"
    },
    {
        "id": "1mrpjuk",
        "author": "refdeser",
        "title": "The echoes of survivors:Inside Korea’s Tragedies - JMS (ep 3 &amp; 4)",
        "content": "\nMaple is such a strong woman, standing up and seeking justice for the sexual abuse. It takes a lot of courage, especially with JMS followers constantly harassing her. I’m so happy that, at the end of the episode, she finally got her own happy ending.\n\nAs the story unfolds, it’s really shocking to see how the authorities were also involved with JMS and even tried to disrupt the investigation. Salute to the director, despite being threatened by JMS followers, he continued investigating and kept the cameras rolling.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrpjuk/the_echoes_of_survivorsinside_koreas_tragedies/"
    },
    {
        "id": "1mrx992",
        "author": "Fast_Blacksmith_7790",
        "title": "I’m looking for some thriller shows with a close-knit friend group.",
        "content": "Hi guys! I’m hoping to find some thriller or horror shows where the main characters are a friend group. I’m looking for a show that’s got some real spooky and suspenseful stuff but also a comforting vibe because of their close bond. The crazy twists are a must and I’d love it if it had a happy ending.\n\nThanks to anybody who responds!!\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mrx992/im_looking_for_some_thriller_shows_with_a/"
    },
    {
        "id": "1mrx6gd",
        "author": "Sad-Perception-9894",
        "title": "How Would Wednesday Change if Ej Fell in Love With Enid?",
        "content": "I know this isn’t canon, but imagine if Ej was part of Wednesday’s story, falling in love with Enid. How would that affect her friendship with Wednesday, or her own growth? It’s just a ‘what if,’ but I’m curious how fans see this dynamic.\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mrx6gd/how_would_wednesday_change_if_ej_fell_in_love/"
    },
    {
        "id": "1mr7us0",
        "author": "satan_69-",
        "title": "We need to talk about The Echoes of Survivors",
        "content": "I am writing this to boost this tv serie, hoping at least the victims perhaps will receive some peace. People needs to know what happened to them, and internet has to talk about it!!!\n\nThis case blow my mind. Never heard about it before. Did a quick research. It is still 80% unknown, mainly the details of it. My heart aches for the victims that grew up being dead inside. I wonder, why this case is not talked enough??",
        "upvotes": 35,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7us0/we_need_to_talk_about_the_echoes_of_survivors/"
    },
    {
        "id": "1mra6eo",
        "author": "ShacklesOfLanguage",
        "title": "Netflix no longer allows sign in on desktop away from home?",
        "content": "Has anyone else experienced this problem?\n\nMy family has a second home, we haven’t been able to log into Netflix on the Roku since they stopped allowing sharing. That’s no surprise.\n\nWhat I can’t believe is now I tried to use it on my phone on the WiFi and that was blocked\n\nThen I tried my laptop and that was blocked\n\nAnd then I tried a DESKTOP and that was blocked\n\nThey’ve completely removed the ability for me to use it anywhere outside my home. I “get” blocking tvs, but desktops and phones make no sense and I do not understand. \n\nAnyone else have this problem?\n\n",
        "upvotes": 24,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mra6eo/netflix_no_longer_allows_sign_in_on_desktop_away/"
    },
    {
        "id": "1mrfzcw",
        "author": "Affectionate_Sky9090",
        "title": "Is JOELLE from the biggest loser on reddit? (Netflix documentary)",
        "content": "I just want her to see that I have so much love and appreciation for her.\nWhat an absolutely beautiful woman that didn't deserve all that horrid nastiness!",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mrfzcw/is_joelle_from_the_biggest_loser_on_reddit/"
    },
    {
        "id": "1mqun5q",
        "author": "Sweaty-Toe-6211",
        "title": "‘STRANGER THINGS’ creators The Duffer Brothers are negotiating leaving Netflix to join Paramount Pictures.",
        "content": "",
        "upvotes": 134,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1mqun5q/stranger_things_creators_the_duffer_brothers_are/"
    },
    {
        "id": "1mqlr42",
        "author": "BlackDoom_26",
        "title": "What is the most underrated show you have found on Netflix?",
        "content": "Sometimes I stumble upon a show I have never heard of before and end up loving it way more than I expected. I am curious if anyone else has had this experience. What is the most underrated show you have discovered on Netflix that more people should watch?",
        "upvotes": 581,
        "comments": 1204,
        "media": null,
        "permalink": "/r/netflix/comments/1mqlr42/what_is_the_most_underrated_show_you_have_found/"
    },
    {
        "id": "1mruyft",
        "author": "Oxjrnine",
        "title": "Dept. Q, what is with the Ford Merkur?",
        "content": "Loved the show, but when Carl gets asked to head Dept. Q he asks for a car (implying he doesn’t have one).  Later he is using what we call a Merkur here in North America.  That makes the car 40 years old.  I can’t imagine a government agency would go out and lease a mint condition \nFord from 1985.  So did he actually have an antique car that he didn’t want to put miles on or did the prop department want the character to drive a unique car and since everyone forgot about Merkurs, and it still looks contemporary, it’s supposed to represent an uk own 2024 model?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mruyft/dept_q_what_is_with_the_ford_merkur/"
    },
    {
        "id": "1mrxlnn",
        "author": "Tanya_Riyel",
        "title": "Done with Lincoln Lawyer S1-3",
        "content": "Done with Sandman as well.\n\nLooking for something that will pique my interest and keep me from falling asleep, most especially when I'm stuck in traffic. 😅\n\nWhat should I watch next?\nAppreciate your recommendations! 🫶🏼",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mrxlnn/done_with_lincoln_lawyer_s13/"
    },
    {
        "id": "1mrqq0m",
        "author": "Wild-Commission-9077",
        "title": "Any recomendation plz?!",
        "content": "Series I liked are \n- the grace\n-13 reasons why\n-olive kitteridge\n-can you hear me\n-girls\n-adolescence\n-queens gambit\n-YOU ( initial seasons only)\n- baby reindeer\n-three body problem\n-BB\n-bettdr call saul\n-heart stopper\n-the society\n-special\n\nI wish i could watch on Netflix,\na bit fantasy or anime are fine, thx! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mrqq0m/any_recomendation_plz/"
    },
    {
        "id": "1mrts81",
        "author": "Sad-Perception-9894",
        "title": "What If Wednesday Found True Love with Ej and Enid?",
        "content": "Imagine this: Wednesday’s story takes a turn where Ej enters her life, alongside Enid. How would this shift her understanding of love, loyalty, and connection?bWould Ej help Wednesday discover what true love feels like, or create tension and growth between her and Enid? I’d love to hear your thoughts, what moments would change, what feelings would deepen, and how might this love triangle, or bond, redefine their journeys? Let’s explore this “what if” togethe",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrts81/what_if_wednesday_found_true_love_with_ej_and_enid/"
    },
    {
        "id": "1mr8jcu",
        "author": "Eefienator93",
        "title": "Help a girl out!",
        "content": "I'm desperately searching for a serie to watch. So please let me know your top 5! They can be older series too. I wouldn't know the name of the category I like (maybe fantasy) but I'm looking for something that has little to nothing to do with daily life things. Preferably something that makes it feel like a different kind of dementia. The series I can think of off the top of my head that I really like are:\n*Sandman\n*The 100\n*From\n*Dark\n*1899\n*The OA\n*Dead boy detectives\n*Locke &amp; Key \n*The end of the f*king world (not really the same category but has little to do with everyday life sh*'t) \n*Strangers things, my least favorite tho (too many seasons, story gets boring but maybe they safe it in the last season)\n*Shadow and bone\n\nI also really like anime, my top 3 is:\n*Spirited away\n*Avatar the last airbender\n*Arcane \n\nMany thanks in advance! ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mr8jcu/help_a_girl_out/"
    },
    {
        "id": "1mqtvsj",
        "author": "Captain-jack-hobie77",
        "title": "Fit for tv",
        "content": "I am so excited for this to come out!! It says it will be released today but it isn’t available. I’m in EST in the United States  - does anyone know the standard time that Netflix releases programming? Anyone else as excited for this as I am? I LOVED the biggest loser growing up- it was actually horrible &amp; had no idea. Poor people. ",
        "upvotes": 31,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1mqtvsj/fit_for_tv/"
    },
    {
        "id": "1mrlgce",
        "author": "Frequent_Anteater_16",
        "title": "Trailers/Reviews UK",
        "content": "Can anybody help? I no longer get the short little preview/trailer on shows as I'm browsing.  I always found this really useful and I miss it! For context I'm in the UK, and my Netflix is through a sky q box. Also there now seems to be a 20 second delay in playing next episodes, anybody else? If someone could solve these issues for me id be ever so grateful!😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrlgce/trailersreviews_uk/"
    },
    {
        "id": "1mqqtca",
        "author": "mrkinkybilly",
        "title": "Just watched, train wreck poop cruise",
        "content": "Just watched poop cruise. A true story of a cruise ship which had a fire onboard and it lost all power and was drifting in the Gulf of Mexico. The toilets stop working as a result. I felt sorry for the passengers but I also found this funny to watch and kept laughing at it",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1mqqtca/just_watched_train_wreck_poop_cruise/"
    },
    {
        "id": "1mriwsg",
        "author": "Musical2one",
        "title": "Iconyx missed a golden opportunity on Building the Band",
        "content": "They could have absolutely crushed one of the most iconic love ballads of the ’90s. Imagine them performing “I Swear” or “I Can Love You Like That” by All-4-One. Both are timeless anthems, and Iconyx would have taken either to another level.\n\nIf you haven’t heard those songs, stop what you’re doing and go listen. Then picture Iconyx owning that stage with that 4-part harmony…goosebumps guaranteed. 🎤✨",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mriwsg/iconyx_missed_a_golden_opportunity_on_building/"
    },
    {
        "id": "1mqpbpq",
        "author": "Oxjrnine",
        "title": "What’s with all the hate for Sirens?",
        "content": "Just binged the miniseries and I haven’t enjoyed and been surprised by a show this much in years.\n\nI thought the premise was going to be literal and it wasn’t.\n\nI thought the characters were going to be cliched but they weren’t.\n\nAnd the best part — no one is a hero or a villain.  And how everyone ends up can be either amazing or tragic (spoilers)\nKiki can easily get a copy of that photo. And being with Pete was unhealthy. Did she really isolate him from his kids or did he use her as a scapegoat.\nSimone might actually be in love with Pete because Ethan was still alive if she just wanted security.  Was revenge a motivation or was her behaviour just doing what Kikki taught her?\nDevon has absolutely no idea how to feel but she has started to stop hating herself. \n\nNone of the characters actions happen in a vacuum so every time I thought I was going to put a character in the good or bad column the story forced me to put them in the human category.",
        "upvotes": 45,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mqpbpq/whats_with_all_the_hate_for_sirens/"
    },
    {
        "id": "1mrroif",
        "author": "Sad-Perception-9894",
        "title": "What if Enid’s love interest in Wednesday was Ej?",
        "content": "I’ve been imagining an alternate take on Wednesday where Enid’s romantic story doesn’t follow the show’s original path, instead, her love interest is Ej. It never appeared on TV, but thinking about it opens up new dynamics at Nevermore Academy: how friendships shift, how characters grow, and how the story’s vibe changes with this twist.\nHas anyone else imagined alternate storylines or character pairings for Netflix shows like this? I’d love to hear your ideas!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrroif/what_if_enids_love_interest_in_wednesday_was_ej/"
    },
    {
        "id": "1mrbzpo",
        "author": "tysonmama",
        "title": "Question about The Waterfront",
        "content": "Don’t want to rewatch right now as I have tons of shows to get to. So can anyone explain the Dave Annable WES character. I thought he was the real estate agent trying to help Belle sell the property to a developer. Then the bank papers came, then the ending where he will work for Belle now. WHO is this guy?  WHAT were the bank papers? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrbzpo/question_about_the_waterfront/"
    },
    {
        "id": "1mrgfix",
        "author": "nickelalkaline",
        "title": "Netflix video quality oddity",
        "content": "I was watching Seinfeld on Netflix and found something odd about the video quality. Im watching on a galaxy s24 ultra. This show usually keeps changing the camera angle according to who is talking. I noticed that the video quality is great, then there is a camera angle change and the quality is awful. Then return to previous angle and image quality is great, then it changes again and is bad. This keeps going for the entire show. Seems that the video is encoded with this odd coded that choses camera angles for saving bandwidth...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrgfix/netflix_video_quality_oddity/"
    },
    {
        "id": "1mrp7r6",
        "author": "Sad-Perception-9894",
        "title": "What if Wednesday had Enid as a love interest… and Ej was in the mix?",
        "content": "I’ve been imagining an alternate take on Wednesday where Enid becomes Wednesday’s love interest, but with a twist: Ej is also part of the story. Adding Ej changes the dynamics, their friendships, and even the vibe of Nevermore Academy in unexpected ways. It never appeared on TV, but thinking about it makes me wonder how this version could play out. Has anyone else imagined alternate storylines like this for Netflix shows?”",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrp7r6/what_if_wednesday_had_enid_as_a_love_interest_and/"
    },
    {
        "id": "1mrp4e5",
        "author": "Sad-Perception-9894",
        "title": "What if Wednesday had Enid as a love interest?",
        "content": "I’ve been imagining an alternate take on Wednesday where the story explored a romantic arc between Wednesday and Enid. It never appeared on TV, but thinking about it makes me wonder how it would have changed their friendship, character growth, and the vibe of Nevermore Academy.\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mrp4e5/what_if_wednesday_had_enid_as_a_love_interest/"
    },
    {
        "id": "1mrfct5",
        "author": "Gualuigi",
        "title": "4K Streaming on PC question",
        "content": "Hey everyone, I'm tired of seeing content in what looks to be 720p. I use the Chrome browser but from previous posts I've read, using the microsoft store app helps with streaming in 4k. I have tried it and it makes no difference to the streaming quality. I am subscribed to the 4k plan, the profile is set to \"high\" quality, I am using a 4k monitor, and I am also getting \\~700mbps download/upload. If you need to know my GPU, I have an RTX 4070. Thank you in advance!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mrfct5/4k_streaming_on_pc_question/"
    },
    {
        "id": "1mr7e6x",
        "author": "LeadershipFull2787",
        "title": "Obessed with Kpop demon hunters",
        "content": "Anyone else completely obsessed with kpop demon hunters ?!?! Its sooo good! The songs are so fun and cute. I wasn't expecting to get into it as much as I did!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7e6x/obessed_with_kpop_demon_hunters/"
    },
    {
        "id": "1mq9ah7",
        "author": "Karma_Moon84",
        "title": "Household",
        "content": "This is Beyond the pale. I have had Netflix since I got DVDs in the mail. I put up with rate hikes and kicked my family off as they left the house and made them get new accounts. Guess what. They never did. Not worth the cost. \n\nNow I am the only active profile and I take care of my father full time. He doesn't live in my home. I will start watching something at home but want to finish it at his house less than a mile from my house but to far to reach my WiFi. At first they said Are you traveling?  OK sure here's a code. But now they want me feel threatened and pay an Extra $7.99 a month to CONTINUE WATCHING WHERE I LEFT OFF.\n\n  Its beyond obvious that I am the same person. And that I'm bouncing between the same 2 physical locations. I shouldn't be forced to go through and entire \"Household location change/update\" twice a day everyday. \n\nI'm 99% sure I got a warning screen about password sharing from HBO max the other day, with a note that basically conveys don't worry this time though beacuse we can tell it's you by your viewing habits. \n\nGet it together Netflix. It's not that hard. I'm sure you have the technology to tell I haven't giving half the planet my password. You just wanna squeeze more out of me to pad your bottom line for share holders. \n\nSHAME ON YOU!",
        "upvotes": 147,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mq9ah7/household/"
    }
]