[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 71,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lmswi4",
        "author": "pnut88",
        "title": "Has anyone else watched and fell in love with Dept. Q? Man i thought this show was great!",
        "content": "The build up, the mystery, the acting. All if it. I thought it was superb. Highly recommend if you haven't seen it yet! Any news on if it has a season 2 in the works? Would love to watch another crime!",
        "upvotes": 133,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1lmswi4/has_anyone_else_watched_and_fell_in_love_with/"
    },
    {
        "id": "1lmzrmi",
        "author": "chrisarrant",
        "title": "[News] Netflix's The Sandman was hoped to run for four seasons... but then they re-read the comic, and decided to end it at two",
        "content": "",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzrmi/news_netflixs_the_sandman_was_hoped_to_run_for/"
    },
    {
        "id": "1lmulp4",
        "author": "Shoddy_Mission6702",
        "title": "Is it just me, or is Netflix's release strategy kind of ruining the hype?",
        "content": "Hey everyone,  \nI just wanted to get your take on this. Do you actually enjoy how Netflix handles its series these days?\n\nThey drop a handful of episodes—fewer and fewer —and then split the season in half, making us wait *years* to get the rest. It’s honestly driving me crazy.\n\nPersonally, I much prefer Disney+'s strategy of releasing one episode a week. It builds hype, whereas Netflix's approach kills it.\n\nLike... do they really think people still care about a show after all that time? I can barely remember what I had for lunch, let alone a series I watched ages ago.\n\nCurious to hear what you all think. Am I alone in this?",
        "upvotes": 30,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1lmulp4/is_it_just_me_or_is_netflixs_release_strategy/"
    },
    {
        "id": "1ln03uj",
        "author": "Upstairs_Demand_6018",
        "title": "Lack Of Content?",
        "content": "I don't mean to be negative here, but does it seem that Netflix is releasing less and less shows? Like it's been pretty dry within the last couple months. Not too many quality shows tbh but maybe it's just me.\n\nAny thoughts or insight on this?",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ln03uj/lack_of_content/"
    },
    {
        "id": "1lmozcm",
        "author": "Batrah",
        "title": "Are the english people in season 3 of squid game dubbed?",
        "content": "\n\nIt's really hard to listen to the vip people speaking. It's sounds so.. forced, dubbed or whatever and bad acting\n\nThe asian woman speaking english sounds the worst. Like the way she speaks doesn't fit her\n\nAm i the only one?",
        "upvotes": 34,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1lmozcm/are_the_english_people_in_season_3_of_squid_game/"
    },
    {
        "id": "1lmzu3y",
        "author": "Saltysuzy21",
        "title": "The Kraven movie was such a let down",
        "content": "I’m a marvel movie fan at heart- watched almost every movie and even red some of the comics so whenever marvel decides to release a new movie I have expectations- not to say every movie is gonna be a hit but fairly decent. This however was just not it. The acting was off. Why would you have American people with heavy American accents act as Russian boys? What is the deal with the female side character? Her acting was so rigid I cringed whenever she was on screen. The LINES good lord who wrote the script? There were so many unnecessary scenes- the flash back wasn’t even a proper flashback. Like why did they tell us SO MANY times that the brother was the child of a mistress as if we couldn’t grasp it the first time??? Like the male lead- I can tell he’s a decent actor but his cringy lines make his acting seem lacklustre. Everything was predictable. This felt like a waste of time, money and effort (that is if we can find the effort in question) so nope I did not like this one marvel. -1/10",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzu3y/the_kraven_movie_was_such_a_let_down/"
    },
    {
        "id": "1ln1kky",
        "author": "Peahaterlol",
        "title": "Sound mixing in k-pop demon hunters was a bit off",
        "content": "Im no expert but when i was watching the new kpop demon hunters movie on Netflix i found myself thinking the sound was very imbalanced, especially with Zoey at many points in the movie. Im not sure if i was delusional but i thought at many parts she sounded much louder than the other girls and often during their normal dialogue some characters would sound a lot louder than others. \n\nI remember it being really obvious to me rewatching the how its done video on YouTube but now it seems like its been fixed on that video. \n\nIm just wondering if anyone else noticed it, i still absolutely loved the movie and a little sound mishap of course wouldn’t make me get all dramatic. I’m just wondering if it was even a thing to begin with or if i was just looking too deep into it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln1kky/sound_mixing_in_kpop_demon_hunters_was_a_bit_off/"
    },
    {
        "id": "1lmv2ic",
        "author": "bookgirl2000",
        "title": "wth is going on in Olympo??",
        "content": "I am watching the new show Olympo right now but I am so confused about what is going on? Like, with Nuriá, how is she being kept at the Olympo facility and also sneaking back into the HPC to train? How did Roqué's hand grow from months of recovery to being fine? I am also confused about what Olympo is doing (isn't it just a clothing brand?) and it has been...interesting...to watch Amaia fall off the deep end. I could probably watch the rest and figure it out, but I can't follow the storyline at all and so I don't think that's the course of action for me. If someone has finished the show already, can you spoil it for me so I can actually understand? Thanks! :)",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmv2ic/wth_is_going_on_in_olympo/"
    },
    {
        "id": "1lmxk70",
        "author": "weareacouple00",
        "title": "Is there ANY way to see what shows/movies are coming up in the new Netflix layout?",
        "content": "It is so annoying I've been trying to find that section and can't find anything. I see a post from over a year ago with same issue, I thought that's gives them enough time to take customer feedback into account. I have emailed the customer service and they replied some generic message about new upgrade and always thinking about user experience first. Does someone have a fix?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lmxk70/is_there_any_way_to_see_what_showsmovies_are/"
    },
    {
        "id": "1lmll04",
        "author": "adobongmelk",
        "title": "What did you think about Squid Game Season 3?",
        "content": "I think it was a little bit rushed. I hated it when they killed off my favorite character, lol.  (It was expected anyway but still) The new games were awesomeee. I also hated the VIP's acting, they sound AI.",
        "upvotes": 10,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lmll04/what_did_you_think_about_squid_game_season_3/"
    },
    {
        "id": "1ln0doc",
        "author": "Aryy2211",
        "title": "Rumi from K-pop Demon Hunters as a Villain",
        "content": "Am I the only one that thought Rumi had the potential to become a villain? \n\nWhen she goes to where Celine is, after her friends saw the patterns, she says something kinda like this “If this is the Honmoon I have to protect, I would gladly see it destroyed” (paraphrasing) and when she said that, I immediately thought that she was going to somehow work with Gwi-ma 😭\n\nOr not work with him, but more likely do something against all the ideals she had as a demon hunter. Something not precisely correct according to Mira, Zoey and Celine.\n\nI don’t know what it could be, or how, I’m terrible at making theories and all that stuff, but yknow what I mean.\n\nI just think that if they had made her a villain, the story would’ve been SO interesting, and something completely different from all the other animated PG movies. We could easily see that in adults movies/shows, but I don’t recall ever seeing the main character become a villain in a kids movie, correct me if I’m wrong.\n\nAnd it wouldn’t be out of nowhere, she had all the reasons to be one.\n\n- Rumi feeling like no one would accept her and truly love her because of her patterns, since that’s what Celine made her believe her whole life, just in a more roundabout way.\n\n- Her feeling like she could never be a worthy demon hunter until her patterns were gone\n\n- The fact that she worked so hard to get rid of all demons, and her own patterns, but her friends still raised their weapons against her\n\nIt’s like even with all her efforts, nothing she ever did was enough for the people that surrounded her, and even for herself.\n\nIf you have something more deep to add that I probably didn’t have in mind, I would love to read it, and please tell me I’m not the only one! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln0doc/rumi_from_kpop_demon_hunters_as_a_villain/"
    },
    {
        "id": "1ln0a15",
        "author": "lil4cwine",
        "title": "Issue with logging in",
        "content": "Hello everybody! I am having this issue for months where netflix doesnt let me log in from my laptop even tho i am logged in on my phone and TV! I have tried clearing cookies and data,updating chrome. I also cant log in through a code or email because it says ‘it doesnt exist’ even tho it exists and works on my devices. If anyone can help please let me know! 🥲",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ln0a15/issue_with_logging_in/"
    },
    {
        "id": "1lm5vqj",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 3 made me feel like I wasted so much of my life",
        "content": "Where... do we even begin. At this rate, I would've preferred if Gi-hun just got on that plane in season 1's ending. I find it insane the cast all agreed this was the best possible ending.\n\nSo many characters wasted and built-up for nothing.\n\nJun-ho? He's a terrible Dora the Explorer. All this searching for the island across 2 seasons, WASTED. He doesn't even TALK to his brother. How in the hell is him just being sent the baby and money a satisfying conclusion for his character?\n\nDae-ho is another example. All this mystery of whether he's a fake marine or lying. It seems like he has an abusive dad, always changing the subject whenever he's brought up. You think we're going to get some story of him being traumatized right? NOPE! He's literally just a fake marine, he goes crazy and then he dies, murdered by Gi-hun.\n\nThe mother and son were an exact copy of the wife and husband. Grandma gives the inspiring speech... and then just kills herself.\n\nThe season is described as \"forgiveness\" by Lee Jung-jae. What forgiveness? I didn't see ANY of that.\n\nAnd MG Coin? This season basically just proved Thanos was right. Throughout the first 5 episodes, he's a genuinely well-written morally gray character... and then the finale throws it ALL out the window in lightning speed. He goes from protecting Gi-hun and the baby to suddenly trying to murder both. Right after asking if the baby is okay.\n\nThe writer/director claims he wasn't supposed to be a one dimensional villain but rather make \"human/realistic decisions\" but NONE of that was it. He just turned cartoonishly evil in the blink of an eye. A worse Sang-woo, at least his turn was gradual.\n\nAnd the ending doesn't even feel like a proper conclusion, just a set-up for the sequel's. I don't even need to get into the VIP's.",
        "upvotes": 57,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lm5vqj/squid_game_season_3_made_me_feel_like_i_wasted_so/"
    },
    {
        "id": "1lmu4fi",
        "author": "These_Landscape4073",
        "title": "Does Netflix wipe your saved payment methods if your account was stolen?",
        "content": "So for context on this question: My account was stolen, email and password was changed, so when I tried to sign in like normal my account was basically nonexistent. When I called Netflix's support line they told me my PayPal (that I had used to pay for a subscription) was associated to a different account, and they were quick to cancel the subscription as well as refund a charge that was made to it (the person who stole my account had upgraded the plan when I had it to the basic plan).\n\nSo, the question is: When Netflix cancels a subscription off a stolen account, is that payment option the person used completely wiped from their account too? I ask cuz I took the security measures needed so that no unwanted future payments go through (changing my PayPal password, adding 2FA, unlinking Netflix from my subscriptions/automatic payment page).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmu4fi/does_netflix_wipe_your_saved_payment_methods_if/"
    },
    {
        "id": "1ln1bxj",
        "author": "Moose_o",
        "title": "Squid games season 3 had horrible writing. So inconsistent with the previous seasons I literally thought it was filmed separately with a different director. Spoiler video as an example.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ntco3cdudr9f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ln1bxj/squid_games_season_3_had_horrible_writing_so/"
    },
    {
        "id": "1lmd42f",
        "author": "pxydustdreamz",
        "title": "What happened?!",
        "content": "This update is absolutely atrocious. Not user friendly, and there’s only ONE show in “continuing watching”???? And where the hell is The Office?!!! I didn’t see any warnings about shows being removed. Did I miss something?",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmd42f/what_happened/"
    },
    {
        "id": "1lm0e0r",
        "author": "Medical_Neat5037",
        "title": "Looking for a new show to binge",
        "content": "I'm looking for something new and interesting, paranormal or funny would be best. Some recent ones I finished are Evil, Lucifer, The Good Place, Supernatural, and A Man On the Inside. Bonus if there are several seasons.",
        "upvotes": 63,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1lm0e0r/looking_for_a_new_show_to_binge/"
    },
    {
        "id": "1lmc27m",
        "author": "graceandspark",
        "title": "I can only access on my phone!",
        "content": "I just came home and tried to open Netflix. I got the \"Your device isn’t part of the Netflix Household for this account\" - which is fine. I had been sharing an account. So, I texted my friend who has the account...and she gets the same message.\n\nI tried my phone and IT worked.\n\nI have no problem paying for an extra user (I didn't realize there wasn't one already) but my phone and my computer are on the same WiFi network. It seems to be treating my phone and my computer as two users and I don't know how to fix it. I don't want to pay for two separate users when it should just be one.\n\nThoughts?",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lmc27m/i_can_only_access_on_my_phone/"
    },
    {
        "id": "1ln30nj",
        "author": "naveen10012",
        "title": "Dude.",
        "content": "So, Netflix re-adds the hangover franchise, but they can't add GOD DAMN FULL HOUSE back?!?! LIKE WHY DONT THEY RE-ADD THE OGs?!?! ADD THE GOOD STUFF BACK 😭",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ln30nj/dude/"
    },
    {
        "id": "1lmjzlf",
        "author": "CableBeautiful4316",
        "title": "Most practical shows based on money and power",
        "content": "I loved house of cards, succession and billions, but now i don't think there are more shows like these 3, all others are soap operas and sitcoms.\n\n\n\nI loved yellowstone and its spinoffs and all shows by taylor sheridan.\n\n\n\nWatched all flanagan shows too, also watched the white lotus.\n\n\n\nIndustry 2020 is below average, watched money heist and berlin.\n\n\n\n  \n\nIs there any other show which is serious and protagonists are ruthless and powerful??",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lmjzlf/most_practical_shows_based_on_money_and_power/"
    },
    {
        "id": "1llkgpq",
        "author": "BrianLevre",
        "title": "What was the hardest thing to stomach when you watched Trainwreck Poop Cruise? SPOILER",
        "content": "For me, it's too close to call between three things:\n\n1) The sewage everywhere.\n\n2)  The completely irrational fear so many people had of pooping in a bag.\n\n3)  The women that were there having the bachelorette party.\n\nBacked up toilets making people walk through sewage... that's pretty messed up.  I don't want to imagine the smell or the illnesses people got because of it, but it's not going to last forever.  People have had to put up with worse.\n\nPooping in a bag... It beats pooping on the floor.  It's a logical measure to take when the sewage system stops working.  Poop in bags, it can all be collected, and it can be placed and contained in an appropriate area.  Truck drivers and van lifers poop in bags all the time.  It's no big deal.\n\nThose three women...  So many things about those women...\n\nFirst, the bride-to-be seemed like she was the inspiration for Kristen Wiig's role in The Californians on SNL...she was dripping with an abundance of unnecessary drama.  \"Why isn't the bar open???\"  Then taking the Imodium, doubling down on her fear of pooping without a toilet, and complaining about a soggy lettuce sandwich when there could have been zero food at all.\n\nThen the group talking about peeing in the shower.  It's like they were clueless about the fact they were born as human animals with biologic processes.  They seemed to not have an idea about how they could squat to pee in a shower.  They were disgusted with having to do it, needing a shower after.  Jeez ladies, it's just pee... ever been camping?",
        "upvotes": 321,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/1llkgpq/what_was_the_hardest_thing_to_stomach_when_you/"
    },
    {
        "id": "1lmk0he",
        "author": "---1---1---",
        "title": "Should I upgrade my subscription when I go on holiday?",
        "content": "I’ve got the basic subscription (UK- like £4.99 or smth) and I get on pretty well with it, but I can only have so many offline downloads. I am going to Germany for about 3 weeks with limited WiFi whilst out and about with my friend whom I share a subscription with. Would it be worth it to upgrade to an add free plan, would me and my friend both get unlimited downloads? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lmk0he/should_i_upgrade_my_subscription_when_i_go_on/"
    },
    {
        "id": "1lmei3r",
        "author": "Conscious_Sign7378",
        "title": "Similar to - The Quilters",
        "content": "I watched the quilters and rlly enjoyed it. The short nature of it and the heartfelt documentary style where you get to explore different peoples lives. Wondering if there were any recommendations for something similar to it?\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lmei3r/similar_to_the_quilters/"
    },
    {
        "id": "1lmj77b",
        "author": "UncloudedLensPH",
        "title": "Squid Game's Ending was Bleak—and Brilliant",
        "content": "I understand why people did not like the final season. It was anti-climactic, the characterizations felt off, and there was no *big* showdown. Ironically, I think these are exactly what made the ending exceptional. It didn't appeal to hopes or expectations, and instead, we were given a bleak conclusion, which aligns with the main theme of the show—oppression. No matter how righteous your intentions are, like Gi-hun, you cannot defeat a powerful entity with bare fists. He was *extremely* lucky, but he had no chance of defeating The Frontman. In the end, the powerful entity wins.\n\nMost did not like how certain characters were killed off early and the shifts in their behavior. But that's the point. The entire game was a matter of life or death, and it shouldn't be any wonder why people change from it. Hyun-ju and Jun-jee were likeable characters—we rooted for them. But oppression makes no exceptions.\n\nGeum-ja's suicide was no doubt a shock—many criticized it for being an act she would never do. But is that really the case? We witnessed her kill her own son. In season 2, she once said that if her son died, she would lose any reason for living. Sure, she had Jun-hee and her baby to care for, but try to think of her headspace. Her son was a loser. She witnessed him grow up wallowing in self-hatred after continuously being trampled on by everyone in his vicinity, to the point that he nearly killed himself. Now, how could a mother continue living after bearing that kind of burden? It's through oppression and self-preservation that her son was forced into trying to kill Jun-hee, and it was also its influence that made Geum-ja kill her son. Once again, oppression took victory.\n\nAnother thing that fans criticized was Dae-ho's transformation into an antagonist—many said that it did not fit his character. However, it makes sense. Dae-ho may have appeared enthusiastic, prideful, or \"tough,\" but in reality he was a coward, and oppression only worsened his state. An oppressive entity destroys a person's determination. Resilience is something you cannot easily obtain—this is especially true in the case of Dae-ho. Witnessing hundreds of people die and knowing that you *may* be next won't always be enough to make you stand up courageously. A coward like Dae-ho had no heart to be a hero, so in the end, he failed to assist them in their revolt and dropped all the blame on Gi-hun.\n\nSomething I found jarring this season is the lack of dialogue, especially on Gi-hun's part, but I think that's intentional. Last season, we anticipated him to be the hero to save the day. When his plans failed, that's when everything sunk in. Oppression to such a large degree as this fails to empower. Not only does it make a person physically unable to stand up and fight but also fail to speak up. His silence was a sign of defeat.\n\n*\"We are not horses. We are humans. And humans are...\"*\n\nHe did not get to finish his sentence. Most of us might have expected a powerful speech filled with emotion. But even before he jumped off to meet his demise, his feelings were already killed. There was nothing else to say. It was pointless.\n\nThe players saw the cruel aspects of humanity. No-eul, a soldier, saw its compassionate side. She was a North Korean refugee—she had lived through cruelty, and being a soldier in these games, she witnessed humanity at its worst. However, a part of her still had an inch of mercy and made the effort to save Gyeong-seok, the father of Na-yeon, a young cancer patient. After successfully fulfilling her plans and discovering that her daughter had \"died,\" she was about to shoot herself. But seeing Gi-hun sacrifice his life to save the baby changed her decision. When she met the father months later, she discovered that people donated for his daughter's treatment, showing humanity's empathetic side. Later on, the broker she spoke to last season eventually helped her track down her daughter. As grim as the themes are about society, you can't disregard its strengths, and the series showed that side in these instances—ironically from the perspective of one of the guards.\n\nFinally, everyone expected one big fight between Jun-ho and his brother. But that never came, and when he did meet his brother, he barely did anything. His lack of action is due to the fact that he was an outsider. Gi-hun returned because he experienced the oppression, and it inspired in him a sense of justice—that's why he planned the revolt. Jun-ho never knew its entirety. The main motive why he put so much effort into finding the island in the first place was to see his brother and know why he joined. When he finally got the chance to see him, he begged desperately. I think at this point he realized the futility in what he was doing—his brother was in too deep. There was also no use fighting him—that's not what he was there for.\n\nThis final season had its flaws, but it tied everything together surprisingly well—in a way that didn't give in to clichés. It was unpredictable and painfully bleak, which complemented the message. Most of us might have the optimistic notion of oppression as a requisite to justice—too often, media portrays oppression as a force that can be toppled through righteousness. But in reality, there will be instances when it's the complete opposite.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lmj77b/squid_games_ending_was_bleakand_brilliant/"
    },
    {
        "id": "1lm9cb8",
        "author": "Lord_Explosion",
        "title": "Why do I have to sign in on the TV in order to cast from my phone?",
        "content": "I travel between houses and am unable to watch Netflix on my TV even when I try to cast from my phone because there is no I’m traveling option. The I’m traveling option used to exist on the Samsung TV app, but it doesn’t anymore.  I tried to cast from my iPhone, but it still won’t let me watch on the TV despite having an active account on my phone. The house I’m currently at is not the primary Netflix household. I also don’t want to add this house to my household because I am not here often enough to necessitate in an extra $7 a month.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lm9cb8/why_do_i_have_to_sign_in_on_the_tv_in_order_to/"
    },
    {
        "id": "1lmct9y",
        "author": "zu_matski1",
        "title": "I hate netflix household",
        "content": "I genuinely do not get it. My TV is connected via Ethernet, so I'm puzzled about how to log in to Netflix through my computer and phone. Is Netflix this stingy??? I've been struggling for hours, and I've even tried calling Netflix themselves, but they keep giving me bs. ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lmct9y/i_hate_netflix_household/"
    },
    {
        "id": "1lmelwn",
        "author": "Ok_Help_9964",
        "title": "Best scary movie?",
        "content": "I rarely watch movies (maybe once a year) but finally got around to getting Netflix. I usually like scary movies, and was curious what everybody here thinks is the best scary movie up to date.Thoughts?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lmelwn/best_scary_movie/"
    },
    {
        "id": "1lmhs0t",
        "author": "kanks_06",
        "title": "Watched season 3 of squid game and here are my two cents.",
        "content": "I’m disappointed to say the least. The ending was so meh. I had such high expectations from this season considering it was gonna be the last but it seemed as though the creators wanted to quickly finish it. They couldn’t have chosen worst actors to play the Vips because the dialogue delivery was so terrible especially the woman vips’. I get that gi hun’s spirit was crushed and he didn’t have anything to say but they could have added some more dialogues. He seemed disinterested which I get but it was boring because he’s my fav character. Also Hwang not believing woo that captain park was playing them was so annoying, woo was his teammate and him choosing to believe the captain was just😖. The ending they gave to the mother son duo too was quite anticlimactic. So many characters died very quickly in the hide and seek game, I couldn’t understand who died and how (player 44 seon and dae ho) I wish they added something more to Dae ho’s storyline instead of killing him right away. In the end, I kinda expected gi hun to kill himself but the way he fought player 333 and protected the baby I wish he died once he was out of the game. I was also at some point hoping he’d give the baby to that North Korean guard with a daughter in china. Seeing Cate Blanchett in the end was unexpected and it felt like an advertisement. When gi hun meets the front man and he takes off his mask I was kinda hoping they’d share a passionate kiss even tho gi hun was fuming with anger and was astonished. The kiss would have made up for the plot they tried to sell and made my 6hrs worth it. I liked how the entire island blew up and all the guards running around to escape it. That and the front man almost tearing up seeing gi hun muster the courage to kill all the other players was peak squid game moment for me. All in all I’d give it a 6/10. (This is my first review that I’ve ever written so if my writing style was not on point or too casual please don’t mind)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lmhs0t/watched_season_3_of_squid_game_and_here_are_my/"
    },
    {
        "id": "1llsq0m",
        "author": "Ok_Resolution_9218",
        "title": "Netflix incognito mode",
        "content": "\nJust an idea: I think Netflix should add an incognito mode feature to the app! Sometimes users just want to watch something without it affecting their recommendations or appearing in their viewing history. This would be really helpful for people who share accounts, or even just for times when you’re watching something different from your usual preferences—like a kid’s movie, a guilty pleasure show, or a documentary for school.\n\nAdding incognito mode would allow users to explore more content freely, without worrying about Netflix’s algorithm messing up their suggestions. People use incognito mode in web browsers all the time for similar reasons—why not bring that privacy option to streaming too?\n\nAlso, I noticed a small typo in the original idea—“incognito mouse” was probably meant to say “incognito mode.” But hey, imagine a sneaky little mouse sneaking around Netflix too! 😄\n\nOverall, I think this feature could attract a lot more users and keep current ones happier.\n",
        "upvotes": 33,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1llsq0m/netflix_incognito_mode/"
    },
    {
        "id": "1lmh6uo",
        "author": "lostinthesauce1200",
        "title": "Logging out a device",
        "content": "If I log a device out of my Netflix account, will it take them to the login page immediately even if they are actively watching something on said device? Or will they still be able to watch until they close the app then try to open Netflix again on the device. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lmh6uo/logging_out_a_device/"
    }
]