[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ia3wns",
        "author": "krazykatz911",
        "title": "Cancelling after 20 years",
        "content": "Price increase again.   $24.99 a month.  $300 a year.  Just plain ripoffs.  \n\nI’ve been a customer for 20 years.  Never again.  \n\nThe content is garbage.  \n\nA lot of the shows/movies are in different languages.  Which is fine but allow the user to select what languages they only want to see.  Not mix it all together and you have to start playing it to find out. \n\nA lot are old and available free on prime anyway.  \n\nThe keep raising the rates like it’s something people can’t live without. \n\nI got 4 streaming services for less than half of what Netflix wants a year. \n\nGoodbye greedy Netflix. ",
        "upvotes": 668,
        "comments": 190,
        "media": null,
        "permalink": "/r/netflix/comments/1ia3wns/cancelling_after_20_years/"
    },
    {
        "id": "1ia2zgv",
        "author": "stellacampus",
        "title": "Anyone else think \"WTF is \"Emilia Pérez\"?\" when they saw 13 Oscar nominations?",
        "content": "Emilia Pérez got 13 Oscar nominations, more than any other movie, and I had never even heard of it until recently.  In all the time it's been on Netflix, I've never seen it suggested in any of the lists I've perused on my home page.  If I had seen it, I probably wouldn't have watched it - I mean it's a French movie, in Spanish only, about a trans gangster in Mexico, and it's a musical to boot.  Now of course I have to at least give it a shot!",
        "upvotes": 168,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2zgv/anyone_else_think_wtf_is_emilia_pérez_when_they/"
    },
    {
        "id": "1ia2id7",
        "author": "HehroMaraFara",
        "title": "Night Agent Season 2 = Massive Disappointment",
        "content": "I loved the first season and did not expect much from it, which might have been key. \n\nI was hoping for more of the same understated approach with brief bursts of action and situational resolution. \n\nThis was not that. This was a convoluted mess of overly complicated ideas and plot lines, with random characters that are just an inch deep on development. I’m not even gonna mention the whole first couple of episodes of him being a basketball coach protecting a kid from an abduction. They sooooo loosely tied it in with the main story that they might as well of labeled it as the “Peter is a great guy, remember?” Prologue. \n\nThe story is generally boring. They made Rose sadly annoying and inexplicably demanding and entitled. It got so stupid and lost that the head of the program was forced to say, in literal dialogue “Night Agent missions often hit deadends” as if accidentally being caught on a hot mic trying to explain away why there are so many dumb unnecessary twists. \n\nWatch season one and pretend this doesn’t exist. ",
        "upvotes": 45,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2id7/night_agent_season_2_massive_disappointment/"
    },
    {
        "id": "1i9lgow",
        "author": "Whobitmyname",
        "title": "‘Pantheon’ Season 2 to Stream For The First Time on Netflix, All 8 Episodes Premiere February 21",
        "content": "",
        "upvotes": 102,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lgow/pantheon_season_2_to_stream_for_the_first_time_on/"
    },
    {
        "id": "1ia7t8q",
        "author": "Punguin456",
        "title": "STOP PLAYING SKIPPING THE FUCKING CREDITS",
        "content": "Why in earth does Netflix do this shit when Im wayching a movie? I even unchecked the autoplay option in account setting but nothing happens. This does nothing for the end user and I'm tired of companies doing pointless shit that only frustrates and never benefits.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ia7t8q/stop_playing_skipping_the_fucking_credits/"
    },
    {
        "id": "1ia9aj6",
        "author": "greedy2024",
        "title": "Download Movies/Series On Laptop",
        "content": "Hi Users,\n\nI was upgrading my netflix plan to a premium thinking that I could download it on my Netflix App on my laptop. However, it turned out that I am unable to download anything, but on my mobile.\n\nIs Netflix intentionally doing it? I got scammed then\n\nwtheck",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ia9aj6/download_moviesseries_on_laptop/"
    },
    {
        "id": "1i9tqqv",
        "author": "AmericanFurnace",
        "title": "Are the Turning Point documentaries any good?",
        "content": "These documentaries look interesting to me, especially the 9/11 one. But I do know that Netflix documentaries don't have that good of a reputation. So I'd like to know if these Turning Point documentaries are good documentaries or just outright terrible.",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i9tqqv/are_the_turning_point_documentaries_any_good/"
    },
    {
        "id": "1i9o0kq",
        "author": "Practical-Creme-6025",
        "title": "Netflix hikes prices in the US, Croatia and Egypt",
        "content": "Price changes are as follows:\n\nUnited States \n\n- Standard with ads - $7.99 (up from $6.99)\n- Standard - $17.99 (up from $15.49)\n- Premium - $24.99 (up from $22.99)\n\nCroatia \n\n- Basic - €5.99 (up from €4.99)\n- Standard - €9.99 (up from €7.99)\n- Premium - €12.99 (up from €9.99)\n\n*No ad-supported plans available in Croatia\n\nEgypt \n\n- Basic - $1.99 (up from $1.39)\n- Standard - $3.39 (up from $2.39)\n- Premium - $3.99 (up from $3.29)\n\n*No ad-supported plans available in Egypt\n\nArgentina \n\n- Basic - $5.79 (up from $3.99)\n- Standard - $9.59 (up from $6.89)\n- Premium - $12.99 (up from $9.29)\n\n*No ad-supported plans available in Egypt\n",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i9o0kq/netflix_hikes_prices_in_the_us_croatia_and_egypt/"
    },
    {
        "id": "1ia6z3z",
        "author": "BearFluffy",
        "title": "Security breach and server down?",
        "content": "Was having trouble logging into my TV that's setup. Tried logging in but my account email couldn't be found, then saw I had an email that my email changed. I tried contacting but huge likes they're just redirecting...was I hacked or were a bunch of people?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ia6z3z/security_breach_and_server_down/"
    },
    {
        "id": "1i9z1zg",
        "author": "Aware-Leg-6725",
        "title": "I need a show to watch",
        "content": "I have not watched much shows so there is lots for me to watch. I have seen the big hits of stranger things, Wednesday, and squid game plus a few miscellaneous reality shows like squid game the challenge. What are your top recommendations.",
        "upvotes": 3,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1i9z1zg/i_need_a_show_to_watch/"
    },
    {
        "id": "1ia4n0f",
        "author": "DarkSoulCarlos",
        "title": "Question about show called \"freaks\"?",
        "content": "This is a long shot, but does anybody recall a show that was on Netflix called \"Freaks\"? I was going through my to watch list and I had written down \"Freaks\" but when I type in \"Freaks\", all I get are two movies, but no TV show. I tried searching on Google and all I find are the movies and Freaks and Geeks, except for one wiki which says that it was an HBO show about people with powers, but I can't find anything else about it. If anybody has any info, it would be greatly appreciated. Thank you for your time :)\n\n  \nEdit: [https://ideas.fandom.com/wiki/Freaks\\_(TV\\_Series)#Antagonists](https://ideas.fandom.com/wiki/Freaks_(TV_Series)#Antagonists) This seems similar to what I saw but I cannot find this credited on the IMDB page of any of the cast members mentioned on the Wiki. And there are some big names on that list. It makes no sense. What a mystery. ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4n0f/question_about_show_called_freaks/"
    },
    {
        "id": "1ia4jd8",
        "author": "Senna2019",
        "title": "Active subscription - check please?",
        "content": "Can someone with an active subscription please confirm if the show A Discovery of Witches is on the platform? I don’t want to spend money on their service, as expensive as it is, and find that the show I want is not even there.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4jd8/active_subscription_check_please/"
    },
    {
        "id": "1i9gfsp",
        "author": "Witty-Two-343",
        "title": "Anybody know a fix around this ?",
        "content": "",
        "upvotes": 45,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gfsp/anybody_know_a_fix_around_this/"
    },
    {
        "id": "1ia2hfp",
        "author": "gullzway",
        "title": "When does the price increase happen?",
        "content": "My Standard no Ads plan renews on Feb. 7th. No indication that the price is increasing, nor communication from Netflix about it.  \n\nWill it just charge me $17.99 on 2/7?\nIf so I may change to the ads plan before then.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2hfp/when_does_the_price_increase_happen/"
    },
    {
        "id": "1ia50wx",
        "author": "Ionenschatten",
        "title": "Removing game advertisement \"UNDERWATER-MELON\" from the front page?",
        "content": "Hey everyone!   \nFor months my front page has been blocked by this ginormous ad covering my entire screen.  \n\n\nhttps://preview.redd.it/llphzofwd9fe1.png?width=1849&amp;format=png&amp;auto=webp&amp;s=f82656d26988b68d241c9018cc518dc57b6e71d2\n\n\n\nDoes anybody know how to get rid of this? I'm a paying customer and downvoted this low-quality 1999 game already. It's still there and I haven't been getting any recommendations for months now because of this annoying game advertisement. It's so frustrating, I've found NOTHING online on how to deal with this. It's like a Computer Virus. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia50wx/removing_game_advertisement_underwatermelon_from/"
    },
    {
        "id": "1ia0auo",
        "author": "Shinola79",
        "title": "Question on Netflix with Ads",
        "content": "I would like to save money every month and go to the ad based service but what is holding me back are the types of ads. We have a 4 year old and I am amazed at the ads other services are showing during family shows and even kids shows. Heck even the banner at the top of Disney isn’t appropriate for their kids account…kid shows listed under a scary monster 🙄\n\nAnyone unhappy with the ad content their child might see?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia0auo/question_on_netflix_with_ads/"
    },
    {
        "id": "1i94kc3",
        "author": "mntgoat",
        "title": "Kevin Can F**k Himself",
        "content": "If you have some time to check out a very unique show, please give Kevin Can F**k Himself a chance. \n\nI don't want to spoil it for anyone, I feel it is best to just be surprised by the format.\n\nSmall warning, you must make it past the first scene before giving up. \n\nApologies if this has been posted before but I just haven't seen it mentioned here before. \n\n",
        "upvotes": 110,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i94kc3/kevin_can_fk_himself/"
    },
    {
        "id": "1ia2dru",
        "author": "superpowers335",
        "title": "Did Netflix remove the season recaps?",
        "content": "Is it just me or do some of the season recaps seem to be missing? For example, Cobra Kai would often have recaps at the start of the seasons if it had been some time since you've watched. I checked the section that has the trailers and recaps and there don't appear to be any recaps listed. Not a big deal. It had just been a while since I've watched and it caught me by surprise. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2dru/did_netflix_remove_the_season_recaps/"
    },
    {
        "id": "1i94xib",
        "author": "Honest-Regular-9561",
        "title": "Is the Night Agent actually good man?",
        "content": "I’ve been seeing so much promotion for the new season and it’s starting to intrigue me. I need to know is this show good. Not average because I could watch other stuff if it’s just a regular show. With all the hype is it some of the best when it comes to Netflix shows? The name always threw me off.",
        "upvotes": 91,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1i94xib/is_the_night_agent_actually_good_man/"
    },
    {
        "id": "1i9vddz",
        "author": "No-Cantaloupe2132",
        "title": "Sand Castle: When 'psychological' means 'nonsensical'",
        "content": "Spoiler alert!\n\nThe first half:  vibes of thrill and a beautiful family working together to survive. \n\nThen it all turns for the worse.  The mom delves into the water to save her drowning kid.  And from this point onwards, little to nothing made sense.  Suddenly Jana(?) turned out not to be in the water.  Then the mom drowned?  Although it was never clear, because they dragged her into the cabin(?).  \n\nYep — dead I guess?  She never appeared again, so.  But the brother (Adam) tells Jana nothing.  The dad asks for a cup of coffee.  Then a bit later he crawls out to the shore and appears to have some sort of strange seizure.  The son (Adam) puts on his headphones.  Is the dad dead now too?\n\n\"We'll see mom and dad soon,\" the son tells his sister.  Ehm . . . okay, is that a look back to when they were alone in the boat, before it capsized (mentioned in the beginning)?  Nope, they seem to be on the island still, so it's the present.  \n\nAnd then too much psychological randomness to handle.  Pictures flashing by, views into different places without context.  All kids in a school being bombed (seemingly on the island too?).  And Yara, which I thought was Jana's late sister, wearing that shoe.  \n\nSuddenly the island is covered with water, rising and rising, and from the lighthouse a blow-up boat suddenly unfolds — which had previously been underneath the sand on the shore. \n\nThat's right after they managed to communicate their location on the radio and saw help pass by, upon which Adam thought he could swin out to the boat with a short rope for safety. \n\nWhat am I missing?  \nWhy was it so incomprehensible to me?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i9vddz/sand_castle_when_psychological_means_nonsensical/"
    },
    {
        "id": "1i9v7h2",
        "author": "Lil_Slice_PJ",
        "title": "Hidden gem",
        "content": "My gf and I have recently stumbled across the show Loudermilk. It’s about a substance abuse counselor also an ex addict, meetings that he host. Triggers, along with his events that take place in his life. \nAs a child of two alcoholic parents this series appeals to me. I find it very entertaining. \nRon Livingston, who plays the main character Sam loudermilk is an excellent actor . I feel as if he isn’t acting that’s just the type of person he is and I love it. If you haven’t seen it I encourage you to watch at least 2 episodes. \nEach which are 30 minutes long definitely worth the watch IMP. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9v7h2/hidden_gem/"
    },
    {
        "id": "1ia4z3z",
        "author": "Bawful-",
        "title": "Is Netflix asking for updated households more often?",
        "content": "My parents pay for netflix and I live on my own and use their account. It used to be that Netflix would ask me to update my household every 2 weeks or so…which wasn’t a big deal at all. Now it’s kicking me out after less than 24 hours. Is this normal or is this a glitch? I’m usually watching from my smart tv. It’s getting pretty frustrating for everyone involved and we’re about ready to dump this greedy streaming service. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4z3z/is_netflix_asking_for_updated_households_more/"
    },
    {
        "id": "1i8rjwk",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix has reached an agreement and renewed the Breaking Bad series until April 18, 2027.",
        "content": "",
        "upvotes": 452,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1i8rjwk/netflix_has_reached_an_agreement_and_renewed_the/"
    },
    {
        "id": "1i8muj5",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Season 3 Is Coming ‘Sooner Than You Expect’ Director Says",
        "content": "",
        "upvotes": 1127,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1i8muj5/squid_game_season_3_is_coming_sooner_than_you/"
    },
    {
        "id": "1i9ekkb",
        "author": "Thin_Reward4843",
        "title": "[REQUEST] does anyone know this show?",
        "content": "Recent English language (American) Netflix drama series about a suburban family where someone shows up out of nowhere to a party and won't leave or something. The trailer is a guy at a party and another guy asking him to leave. It's a drama, not a comedy. It was not popular, didn't get a ton of reviews, isn't talked about a lot on Reddit. Every time I try to google it the browser takes me to the stupid app. I saw the trailer at my in laws house. I think it was called the Stranger or the Invitation or the Gift or something but I know those are all other movies or shows. Ugh. Help please! Does not come up when you google any of this. ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ekkb/request_does_anyone_know_this_show/"
    },
    {
        "id": "1i9rshq",
        "author": "Doonkeh",
        "title": "Unauthorised Password Change - Cannot Contact Netflix via Help Centre as Told to do so.",
        "content": "Email was just changed without my permission.\n\nhttps://preview.redd.it/du0738eua6fe1.png?width=822&amp;format=png&amp;auto=webp&amp;s=e6dd1ce746ad7b4fde59a72603e16d047106bda8\n\nWebsite states this, when I click on contact us, it takes me back to the help centre.\n\n  \nAny way to contact without being led in circles? I have emailed the email that had informed me the email had been changed but haven't had anything back. Is that email a no-reply?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9rshq/unauthorised_password_change_cannot_contact/"
    },
    {
        "id": "1ia6fe2",
        "author": "Alert_Perception_800",
        "title": "Squid Game2 Disappoints Hard",
        "content": "If you haven’t watched Squid Game season 2 yet, I’m here to save you, don’t bother, it’s not worth it. the pacing is annoying and definitely not worth the hype, the quality of season 1 is impossible to repeat",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ia6fe2/squid_game2_disappoints_hard/"
    },
    {
        "id": "1ia1mt4",
        "author": "Research_Tasty",
        "title": "American Primeval - character inconsistency *some spoiler*",
        "content": "Hi I'm only 3 episodes in.  \nso expect spoilers for 3 episodes.\n\nso Taylor kitsch' character for some reason decides to follow the woman and he son, stake out their party to see if they are attacked and then save the day and while under payment still decide to travel with them.\n\nNow 2 episodes later we find and even younger child alone in the woods, and his instinct is the leave the child behind.\n\nSoo..... did his character just suddenly develop in a totally different direction?   \ndoes he only have the urge to save some kids but not all kids ?",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ia1mt4/american_primeval_character_inconsistency_some/"
    },
    {
        "id": "1i9z5d2",
        "author": "Old_Investigator_427",
        "title": "What Inspired the Squid Game Sets? Discover the Architectural Influences Behind the Iconic Design!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9z5d2/what_inspired_the_squid_game_sets_discover_the/"
    },
    {
        "id": "1i9k9wx",
        "author": "North_Drummer2034",
        "title": "Tell Me Who I Am",
        "content": "I watched this last night at work and I’m confused about all the hate towards the brother after reading some other reviews. I feel like if I was Alex, I wouldn’t want to know. I don’t understand the whole “you kept this from me and it’s the ultimate betrayal” thing. What is the point of telling someone about trauma and abuse that they went through if they would’ve never remembered it. I think Marcus was right for trying to protect his brother. What do you guys think? I feel like I’m alone in this opinion ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9k9wx/tell_me_who_i_am/"
    }
]