[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 198,
        "comments": 722,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o5g2ay",
        "author": "T-tail88",
        "title": "Ed Gein story...how did the people in the town not know his mother was dead?",
        "content": "She dropped dead in front of two other people and then they had a graveside service for her. Not to mention her tombstone in the cemetery.  Does no one pay attention to anything in that town? ",
        "upvotes": 212,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1o5g2ay/ed_gein_storyhow_did_the_people_in_the_town_not/"
    },
    {
        "id": "1o69ekl",
        "author": "TheHippyWolfman",
        "title": "I enjoyed \"Wayward,\" this is my review",
        "content": "I enjoyed Wayward. As a matter of fact, I thought it was pretty good. I *did* go into it with absolutely no expectations, simply clicking the link after a brief look at the description. A critique I would have is that the eight episode format felt, to me, sort of limiting. There was a lot that was touched on but not really elaborated upon in a satisfying way. The show may have benefitted from either being shorter and more concise, in order to remove elements that were either unnecessary or improperly explored, or longer, so as to deal with these issues in a more coherent manner and to keep some of the plot points from having such a rushed execution. \n\nThat being said, if you’re down for a wild, and somewhat tonally inconsistent, ride, then there is fun to be had here. I found it relatively easy to get invested in the characters and their lives. The show was, at turns, endearing, unsettling and downright disturbing. There were twists I honestly didn’t expect and ended up enjoying (sometimes despite the execution and not because of it, but whatever). The psychological drama, I thought, was more often than not well done and satisfying. The fact that one pair of protagonists are teenagers and the other pair are adults allows the series to walk the line between teen and adult drama without fully committing to either audience, and maybe being accessible to both (but I will leave that for you to decide). In terms of acting, some performances were more memorable than others, but I found nothing unserviceable and the main antagonist to be delightfully both creepy and easy to hate. \n\nOverall, I feel as if I was able to feel satisfied with the series because I went into it with very little hype. It certainly wasn’t a masterpiece, but it gave me eight hours of solid entertainment and left me wanting to know *more-* about the characters, their pasts and their inevitable fates. That’s the primary pro and con of this series: it is like walking through a museum and looking at its portraits of people and landscapes. You are looking at \"snapshots\", and what both intrigues and frustrates about the experience is that each piece *suggests* so much to the mind, in terms of questions, speculations and fantasies, but the ultimate satisfaction of these suggestions occurs only in our imaginations.\n\nI have not settled on a rating yet, but I liked it, and my initial recommendation is to watch if you’re into some creepy cult-thriller fun with a heavy dose of teenage angst and a penchant for leaving you with more questions than answers. \n\n*I press post. I am sitting in a chair. I am crying out for the upvotes...*",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o69ekl/i_enjoyed_wayward_this_is_my_review/"
    },
    {
        "id": "1o626wz",
        "author": "Mora_Mountain5769",
        "title": "My Father the BTK killer",
        "content": "How didn’t his wife know or at least suspect her husband was off? Stories like this are so scary and really disturbing. \n\nI should definitely stop watching crime documentaries ",
        "upvotes": 5,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1o626wz/my_father_the_btk_killer/"
    },
    {
        "id": "1o5lhc0",
        "author": "The_Outsider27",
        "title": "The BTK Killer and Legacy of Familial Dysfunction/Trauma and Denial",
        "content": "Just finished watching. First I feel bad for his daughter Kerri and can see the turmoil and how he is still haunting her. Judging from the postings here, many have been harsh on her. She does look a lot like him and I am sure is suffering from the guilt of knowing she lived with a killer and could not save those women, is carrying his DNA which helped find him. Lots of complicated feelings. I respect her for expressing herself publicly. I am not sure if that is the BEST way to move on but I do feel she is sincere about her reason for doing this and it is not for profit. She is a victim too.  She has kids and likely this has impacted negatively her ability to earn a living in the same way most of us do. \n\nCan you imagine seeing yourself referenced in your serial killer dad's notes?  I also heard that Gary Ridgeway, the Green River Killer actually had his son in the car when he picked up some of his victims.  \n\n\nWhat I don't understand is how could she and her mom not find the stuff in the shed. The kill kit in the house could just be tools etc. I have duct tape and rope string etc in a closet and I am not a killer. But the stuff in the shed is bizarre. He also stalked many of his victims for endless hours sometimes at like 3am. Did his wife not notice him missing or soiled clothes, smells, the jewelry.  To sit on the couch and say to him \"He writes like you.\"   WTF?   Reminds me of that movie \"The Dead Girl\" with Brittany Murphy where this one woman played by Piper Laurie , realizes that her husband is a serial killer when she finds all that stuff in the storage shed.   BTK's wife had to know something was amiss. \n\nEven Ted Bundy's girlfriend was one of the anonymous callers to tip police about him. \n\nBTK's  words when he was caught were \"Tell my wife I won't be home for lunch.\"  \nOn its face sounds harmless enough but to me that sounds like a code. Could she have known and was in some sort of Stockholm syndrome hold with him? \n\nI also find BTK odd in that several times he killed with children present. Stalked women who were home alone with small kids. Can't help but think that somehow represented what he thought of families. He had two types of victims middle aged women living alone and women alone with children.   \nOne poor woman he was hiding in 2nd bedroom in her house. I think she even had a guest over and BTK sat in her house the entire time until person left for the evening.\n\nGet a dog everyone. ",
        "upvotes": 27,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o5lhc0/the_btk_killer_and_legacy_of_familial/"
    },
    {
        "id": "1o5w0ke",
        "author": "QuifftianBale",
        "title": "Thoughts on the Beckham documentaries?",
        "content": "I watched the David Beckham documentary and found it quite interesting, and think the family came across quite well, overall* (that was obviously the aim and was funded by the Beckham’s - so maybe no surprise.) \n\nVictoria’s documentary I found a a little less interesting, though I confess to not being especially interested in the fashion world, so perhaps it’s that. \nWhat surprised me was the amount of money the Beckham’s ploughed (and lost) into the fashion venture. \nI found it hard to sympathise with Victoria when she said she was “crying everyday before work”, where ‘work’ is your life’s passion that you’ve been financing. It felt out of touch somewhat, as many people have to work jobs they don’t like, for no money, where quitting isn’t an option. \n\n*Although they did kind of skirt around the whole affair situation where David was literally sleeping with the family Nanny… anyway.\n\nWhat were other people’s thoughts? \n",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o5w0ke/thoughts_on_the_beckham_documentaries/"
    },
    {
        "id": "1o66d3q",
        "author": "Equivalent_Phrase_25",
        "title": "(Spoiler just in case) How did we mess up the Pacific Rim series so bad",
        "content": "in my opinion first movie was great. good character development / story building / some realism. like 8.5/10 for me. \n\n  \n2nd movie 2.5/10. I liked some of the jokes and just the idea of giant robots is cool. everything else sucked. You're telling me after 10 years they have like 8 cadets in training and NO BACKUPS. Killing off Mako was just a bad decision and just like that too. I wished they ATLEAST mention that Pentecost had a son it was kinda weird they did't in the first movie. Newt being controlled does kinda make sense so I give them props to that. The robot designs were cool but they dismissed any element of realism unlike the first one. And they should've added Herc in the second one. \n\nAlso what's the deal with Amara, she was struggling to even get a connection like a day or 2 before the kyjou attacked and all of a sudden she's a pro and knows what she's doing?. \n\nAlso weird decision to kill that one cadet but the rest live? I feel like they thought they needed someone to die to make it a dramatic movie. Would have been better if they either let all of them live or just kill off the majority of them which would have been more realistic because IT WAS THEIR FIRST MISSION. \n\n  \nHaven't even watched the anime Ive heard its shit too so I don't even want to bother. just my opinion ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o66d3q/spoiler_just_in_case_how_did_we_mess_up_the/"
    },
    {
        "id": "1o5x4ps",
        "author": "DarkStephen",
        "title": "Why I am hooked on My Life with the Walter Boys.",
        "content": "I'm a college student studying Film and Television production and I discovered this show through my professor who did an analysis of it in class and now I'm hooked tbh. \n\nThis show has something for everyone,  it has the teen romance drama and I have to admit that's not what draws me in.  It has great character work.  Both in the teen characters and the adults.  They create multi layered performances that feel real and I can say for people like Alex, George, Kathrine, Nathan Danny and Cole. I've known people like them in my everyday life the actors do a great job of making them believable.  My aunt has a ranch in Ontario, Canada  and raises horses so I connected with that as well. \n\nThis is a great cast who does fantastic work but I find myself connecting most with the characters of Alex and George.  I had to be responsible for my family in elementary school and High School and I love George's struggle with wanting to preserve his land while at the same time wanting to provide and secure his families future.\n\nI encourage a lot of people to give this show a chance.  I think a lot of the actors on this show have a big future.\n\nThe actor who plays Alex would be very good in Disney's MCU as either Cyclops or Nate Grey (X-Man).",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5x4ps/why_i_am_hooked_on_my_life_with_the_walter_boys/"
    },
    {
        "id": "1o5i4b2",
        "author": "TheMirrorUS",
        "title": "Here's why BTK didn't face the death penalty for murdering 10 people in Kansas",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5i4b2/heres_why_btk_didnt_face_the_death_penalty_for/"
    },
    {
        "id": "1o5raqg",
        "author": "Boredpoquito31",
        "title": "I need an asian scary movie to watch, any recommendations?",
        "content": "Im bored and can you recommend  me the most horrifying and scary Asian movie you've watched on Netflix, any horror genre will do. I badly want to watch an asian horror movie so if you can recommend it would be nice. Thank you",
        "upvotes": 5,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1o5raqg/i_need_an_asian_scary_movie_to_watch_any/"
    },
    {
        "id": "1o63ink",
        "author": "Independent-Dog476",
        "title": "Black Rabbit: Vince’s tattoo?",
        "content": "Anybody have any ideas on what Vince’s tattoo was that he got from Gen? Did i miss it? To be fair i was writing a research paper for a good hour an a half so it’s totally possible i missed it lol. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o63ink/black_rabbit_vinces_tattoo/"
    },
    {
        "id": "1o5yiwp",
        "author": "Semtex7",
        "title": "So now upcoming titles is gone?",
        "content": "There are no more upcoming titles shown on the TV app. Is there someone in there in Netflix that is constantly wondering how to make this interface worse?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o5yiwp/so_now_upcoming_titles_is_gone/"
    },
    {
        "id": "1o62vzd",
        "author": "xCalzor",
        "title": "Watching raw no ads getting ads",
        "content": "This is my first time getting ads watching rerun of raw is this new ? Or even with no ads account you have to watch with ads now? Or if anyone found a solution let me know ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o62vzd/watching_raw_no_ads_getting_ads/"
    },
    {
        "id": "1o5t9gb",
        "author": "berrydanson",
        "title": "Didn’t like the Ed Gein show, are the other two in the Monster series worth it?",
        "content": "I was pissed off at the inaccuracies and sensationalized content in the Ed Gein series, so I was just going to write off the other two. But I do keep seeing people recommend the Jeffery Dahmer one, anyone have an opinion whether I should still give that one a try? Thanks!",
        "upvotes": 2,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1o5t9gb/didnt_like_the_ed_gein_show_are_the_other_two_in/"
    },
    {
        "id": "1o5rbdn",
        "author": "MysteriousDelay6266",
        "title": "2025 Netflix Holiday Trailer Week | Official Teaser | Netflix",
        "content": "# The Holidays start NOW with Holiday Trailer Week.\n\nEnjoy a new trailer every day this week celebrating the Netflix Originals coming this Holiday Season.\n\nHowever you celebrate, the holidays start on Netflix this week with a new trailer every day!\n\n* Tuesday - A Merry Little Ex-Mas Trailer\n* Wednesday - Champagne Problems Trailer\n* Thursday - Jingle Bell Heist Trailer\n* Friday - My Secret Santa Trailer",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5rbdn/2025_netflix_holiday_trailer_week_official_teaser/"
    },
    {
        "id": "1o64suk",
        "author": "TBiscuitville",
        "title": "WTF was that final episode of Monster: Ed Gein",
        "content": "Just finished watching the last episode and I'm kind of pissed lol \n\nI thought it was pretty decent, definitely dark and disturbing, and I know it was a mix of fact/fiction, but man that last episode just ruined the season. What was the point of it and why the hell did they not do a better job of aging Adeline? I just thought it was such a stupid way to end the season. ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o64suk/wtf_was_that_final_episode_of_monster_ed_gein/"
    },
    {
        "id": "1o5we3d",
        "author": "deepsdeepak",
        "title": "How can i use the same profile in 2 homes",
        "content": "Im going to uni soon in a different country and i want to keep the same account the same account in my home and my uni. Is this possible if so, could you guys please tell me how",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5we3d/how_can_i_use_the_same_profile_in_2_homes/"
    },
    {
        "id": "1o5af00",
        "author": "PositiveZucchini4",
        "title": "Running Point",
        "content": "There's only 10 episodes but please tell me other ppl know about Running Point. Kate Hudson, Brenda Song. Its about a family who runs a basketball team and theres a change of leadership that shakes things up. Its cute, heartfelt, and hilarious. If you haven't seen it yet,  put it on your \"to watch\" list! ❤️❤️",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1o5af00/running_point/"
    },
    {
        "id": "1o5tkt8",
        "author": "hentaigabby",
        "title": "The Summer Hikaru Died English dub",
        "content": "Does anyone know when the  English dub of *The Summer Hikaru Died*\n\nis being released  I have heard that Netflix is making a dub but anyone know the release date i am in the US and find its odd that the dub is not out yet when other Netflix anime shows get dub same day as release",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5tkt8/the_summer_hikaru_died_english_dub/"
    },
    {
        "id": "1o5h0jc",
        "author": "youRinlove7",
        "title": "Bridgerton Season 4 | Date Announcement | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5h0jc/bridgerton_season_4_date_announcement_netflix/"
    },
    {
        "id": "1o5shvf",
        "author": "Cubegod69er",
        "title": "Quick question about using the PS5 app",
        "content": "Is there no way to look at a list of every movie, in a certain genre? I've been trying to find a list of all the horror movies currently on netflix. But there just seem to be suggested lists, of certain types of horror movies, in the movies section. I can't find a complete list of each genre anywhere.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5shvf/quick_question_about_using_the_ps5_app/"
    },
    {
        "id": "1o554y6",
        "author": "Bluesalvia",
        "title": "The most boring show ever",
        "content": "Trying to find a limited series that was on Netflix maybe 8-9 years ago. There was a woman lead who produced and starred in the show. Maybe a comedian?  She said her goal was to create the most boring show ever.  She worked in an office with cubicles and in one episode went on a very awkward date. The entire show was awkward but weirdly compelling. There were pencils and old school tech. Not sure where it was filmed but it reminded me of Monterey or N CA. I have tried to find it again many many times but can’t find it. ",
        "upvotes": 28,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1o554y6/the_most_boring_show_ever/"
    },
    {
        "id": "1o5r9k0",
        "author": "liminal_ether",
        "title": "Question: Where are the Original Dub Tracks for Certain Shows?",
        "content": "Several anime series and other initially foreign-language properties do not appear to have their original dub tracks as selectable options. For example, the children's show \"YooHoo to the Rescue!\" does not have its original Korean dub track available. Is this due to something involving licensing? Thank you for all your help in advance.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5r9k0/question_where_are_the_original_dub_tracks_for/"
    },
    {
        "id": "1o5u4iu",
        "author": "DarkSnake223",
        "title": "Missing Raw Episodes",
        "content": "Why are so many old episodes of Raw missing on Netflix, especially in mid 90s? I was looking for March 4th 1996 Episode and I couldn’t find it. So I was genuinely curious. Any wrestling fan that watches and could explain why. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o5u4iu/missing_raw_episodes/"
    },
    {
        "id": "1o4zlew",
        "author": "DefiantRanger9",
        "title": "Does anyone else find Mikey Day annoying from “Is It Cake”?",
        "content": "His mannerisms and basically anything else irk me. Also he keeps tilting the knife each time it IS cake which is a dead giveaway. Would love to see someone else host this show. Any suggestions? \n\nCan someone please get this back to the producers. The show has potential. Poor Mikey does not. LOL",
        "upvotes": 35,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1o4zlew/does_anyone_else_find_mikey_day_annoying_from_is/"
    },
    {
        "id": "1o5n1et",
        "author": "bookruncrystal",
        "title": "Netflix's Culinary Class Wars Finalist Edward Lee Starring in New Series With Ryu Soo-Young",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o5n1et/netflixs_culinary_class_wars_finalist_edward_lee/"
    },
    {
        "id": "1o52bs3",
        "author": "LegitimateHumor8212",
        "title": "Just watched tires and now i dont like anything else on Netflix",
        "content": "Please suggest me something good like tires, i really love how all the OG comics made that show.\nI have watched Brooklyn 99, breaking bad and superstore already.",
        "upvotes": 27,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1o52bs3/just_watched_tires_and_now_i_dont_like_anything/"
    },
    {
        "id": "1o5gx8t",
        "author": "jerkoff1610",
        "title": "Director reveals The Woman in Cabin 10 scene that almost got cut – and why he fought for it",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5gx8t/director_reveals_the_woman_in_cabin_10_scene_that/"
    },
    {
        "id": "1o5lrze",
        "author": "StealieErrl",
        "title": "Can’t Choose Episode?",
        "content": "Watching on my Sony A80K. \n\nAny show I choose it just takes me right into an episode. SOME shows I can pause and with the menu that pops up I can choose “episodes” however this is not the case for most things I’m trying to watch. \n\nWhat gives here? $20+ per month and not being able to choose the episode of what I want to watch feels a bit of an overstep on their end. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o5lrze/cant_choose_episode/"
    }
]