[
    {
        "id": "1pmkghu",
        "author": "theywillkillyoumovie",
        "title": "We are Zazie Beetz, Barbara Muschietti &amp; Kirill Sokolov from the new horror film THEY WILL KILL YOU. Ask Us Anything!",
        "content": "https://preview.redd.it/kw4o52oug77g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=b11d7a93232e32b23d21045e64cf8a0beb2c538c\n\nHey Reddit, Zazie Beetz, Barbara Muschietti, and Kirill Sokolov here. You might know us from films/series like IT, IT: Welcome to Derry (Muschietti), Joker, Deadpool 2 (Beetz), and Why Don’t You Just Die! (Sokolov) and more. We're here to answer your questions! \n\nOur newest film, **THEY WILL KILL YOU**, is out in theaters March 27, 2026. \n\nAsk us anything - we’ll be back at 10am PT December 15th! ",
        "upvotes": 71,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/"
    },
    {
        "id": "1pk1m27",
        "author": "LiteraryBoner",
        "title": "Introducing the Fantasy Box Office Game: Two years ago I met a redditor who was running a Fantasy Box Office League game from an Excel spreadsheet and now it’s a fully functional website. Get ready for the 2026 Box Office year with us!",
        "content": "# [fantasyboxofficegame.com](http://fantasyboxofficegame.com)\n\n\n\nJust want to start off by stating that this is not a paid ad and this website is totally free to use.\n\n\n\nTwo years ago I was looking for a way to get more nerdy about movies. I love fantasy football and had heard of some similar games centered around the box office, so I did some googling and found a post on reddit from u/Chris_Tennant saying that he had made a game that runs off of Google Sheets. I messaged him and we ended up chatting on discord and he said it was a work in progress but he was looking for people to play it and give feedback. So I put a couple leagues together, two leagues with my coworkers and one with some other r/movies mods, and long story short we had an absolute blast with it. \n\n\n\nChris has been working on this thing like crazy since then and this last year he upgraded it from a Google Sheet to a \\[website\\](fantasyboxofficegame.com). It looks great and is really intuitive. This year I’m running four leagues and it’s been a wild year for the BO and anyone who follows the news will tell you it’s only going to get more unpredictable. Here’s how the game works.   \n  \n\n\n**The game consists of three drafts throughout the year, one every four months, in which you draft movies only for the coming four months. Jan-Apr, May-Aug, Sep-Dec.**\n\n\n\n**When you select a movie you take on the burden of 2.5x that movie’s budget upon release.**\n\n\n\n**So if you pick a movie with a budget of 100mil, you get negative 250mil when that movie comes out and then gain the box office for its entire theater run as it happens.** \n\n\n\n**There are essentially three different kinds of draft picks.**\n\n* **The Hit Pick. One movie chosen from the entire calendar year that you are betting on to make all the money. You only get one of these per year. You will probably want a major blockbuster.** \n* **Seasonal Picks. 3-4 of these per draft, so 9-12 total. This will make up the bulk of your roster. You can adjust how many depending on how many people are in your league or whatever rules you want.** \n* **The Bomb Pick. This is a pick that you think will** ***lose*** **a lot of money, and it goes to all of your opponents rosters instead of yours. You only get one of these per year and they are chosen during the first draft, much like the Hit Pick.** \n\n  \nAs the movies on your roster release, you take on their negative budget and watch it slowly climb back up as it continues to make money. Here’s what our current season looks like:\n\nhttps://preview.redd.it/ytyge9jcol6g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=be324efdcbc56169cc020cb951cb4c1bbe09c8b5\n\n\n\nEach of those datapoints is clickable to see what movie release it is and you can see the numerical stats here (please do not roast me for picking Snow White, no Disney Live Action Remake had lost money before this):\n\nhttps://preview.redd.it/f60anpkdol6g1.png?width=1045&amp;format=png&amp;auto=webp&amp;s=6592e4adcef2789259f7305b5371fa5028095a16\n\nWe have been playing this for two years now and the drafts are always so fun and unpredictable and there’s a surprising amount of strategy to it. You don’t always know budgets this far in advance so you have to gamble a bit on which studios are more conservative with their budgets and realistically how expensive movies look.   \n  \nSo get some friends together or organize a league here in the comments with other redditors. **It’s totally free** and if you’re a movie nerd like me then I can vouch that this really adds a lot of fun and investment to every release!",
        "upvotes": 76,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1pk1m27/introducing_the_fantasy_box_office_game_two_years/"
    },
    {
        "id": "1pmjjom",
        "author": "DemiFiendRSA",
        "title": "‘Zootopia 2’ Overtakes ‘Lilo &amp; Stitch’ to Become 2025’s Highest Grossing Hollywood Movie With $1.13 Billion",
        "content": "",
        "upvotes": 6756,
        "comments": 401,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-iLGH7udsGspyCOt1a4__64oANApJr8g3DiZ_9GJGFk.jpeg?auto=webp&amp;s=186016a275c89a7b4daf2233eb65acd8ebffba69"
        },
        "permalink": "/r/movies/comments/1pmjjom/zootopia_2_overtakes_lilo_stitch_to_become_2025s/"
    },
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 3933,
        "comments": 751,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pmooau",
        "author": "ZazieBeetzAMA",
        "title": "Hi /r/movies, I'm Zazie Beetz. You might know me from Joker, Atlanta, Deadpool 2, Bullet Train, Nine Days, The Harder They Fall, The Bad Guys. My newest movie, They Will Kill You, is out in theaters March 27. Ask me anything!",
        "content": "Hi r/movies! I'm Zazie Beetz. You might know me from **Joker**, **Atlanta**, **Deadpool 2**, **Bullet Train**, **Nine Days**, **The Harder They Fall**, **The Bad Guys**.\n\nMy newest film, THEY WILL KILL YOU, is out in theaters March 27, 2026 via Warner Bros.\n\n&gt;A woman takes a job as a housekeeper in a NYC high-rise, unaware of the building's history of disappearances. She soon realizes the community is shrouded in mystery.\n\nPlease head here to ask questions:\n\n[https://www.reddit.com/r/movies/comments/1pmkghu/we\\_are\\_zazie\\_beetz\\_barbara\\_muschietti\\_kirill/](https://www.reddit.com/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/)\n\nBack tomorrow at 10 AM PST to answer things.",
        "upvotes": 704,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y03v1nopf87g1.png?auto=webp&amp;s=9335b99ce0dedb75ffc810c4bd76dad211477e3b"
        },
        "permalink": "/r/movies/comments/1pmooau/hi_rmovies_im_zazie_beetz_you_might_know_me_from/"
    },
    {
        "id": "1pmgn70",
        "author": "BunyipPouch",
        "title": "Jeff Wexler Dies: Pioneering Oscar-Nominated &amp; BAFTA-Winning Sound Mixer of 'Fight Club', 'Almost Famous', 'The Last Samurai', 'Jerry Maguire', 'Spaceballs', and 'Independence Day' Was 78",
        "content": "",
        "upvotes": 765,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B-D488rI7yIRyGdWT3usRMz2NFCGFwUHKoY6-UIaunM.jpeg?auto=webp&amp;s=bea0f93cc85cef1f6355572122120b85db560636"
        },
        "permalink": "/r/movies/comments/1pmgn70/jeff_wexler_dies_pioneering_oscarnominated/"
    },
    {
        "id": "1pminii",
        "author": "MarvelsGrantMan136",
        "title": "Michael Giacchino To Compose Score For 'Spider-Man: Brand New Day'",
        "content": "",
        "upvotes": 541,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WjVoAiSEuQZFLJMaLtgj-721p4YA7ULIlTbuVKM2AWE.png?auto=webp&amp;s=b526c84083df8fa25c97147095bef53876aa2bdf"
        },
        "permalink": "/r/movies/comments/1pminii/michael_giacchino_to_compose_score_for_spiderman/"
    },
    {
        "id": "1pmhr7j",
        "author": "rowlfthedogfriend",
        "title": "Anti Chekhov gun scenes?",
        "content": "Spoilers for a 60 year old movie below.\n\n\nI watched the apartment last night and realized this has the quintessential anti Chekhov gun moment. About halfway through Jack Lemmon’s character is talking about his past suicide attempt by shooting himself. At the end of the movie he has seemingly lost everything and is packing up his apartment when we see him pick up a gun. At the end of the film we hear what sounds like a gunshot but it turns out the gun was never used, violating the rule. What other movies have scenes like this?",
        "upvotes": 561,
        "comments": 312,
        "media": null,
        "permalink": "/r/movies/comments/1pmhr7j/anti_chekhov_gun_scenes/"
    },
    {
        "id": "1pmih67",
        "author": "BunyipPouch",
        "title": "First Image from Comedy 'The Incomers' - Starring Domhnall Gleeson ('Ex Machina') - On a remote Scottish isle, siblings Isla and Sandy hunt birds and talk to mythical beings while fighting off outsiders. Their lives change when Daniel, an awkward official, arrives to relocate them.",
        "content": "",
        "upvotes": 406,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t68jw085777g1.jpeg?auto=webp&amp;s=13c392ec56a63c10936ac350b22b7f6bba1589ad"
        },
        "permalink": "/r/movies/comments/1pmih67/first_image_from_comedy_the_incomers_starring/"
    },
    {
        "id": "1pmeglq",
        "author": "Lone_Lunatic",
        "title": "Children of men is such a beautiful film.",
        "content": "I watched the 2025 Frankenstein a day before watching Children of Men. I was about to joke how Frankenstein shows how badly men want to give birth and this film was definitely inspired by that but I can't.\n\nIt's too beautiful for that. The dystopian world in the film might seem hopeless but characters portray otherwise. There is this slick contrast between the world and the characters. They reek of courage and hope unlike the world.\n\nThe famous scene shot in one take when the fishes and army ceasfires after hearing a baby's cry is such a powerful one. For a moment the world seems full of hope and peace; all because of a baby. Only for the firing to begin right after. This as per me is a contrast between the world we can have and the world we have made into our reality. We keep getting glimpse of this hopeful world through different characters be it Theo, Julian, Jasper, Miriam, Marichka, the family that helped them and finally everyone; from the people in the building to the army when there was ceasefire.\n\nPersonally speaking I feel like this film portrays today's situation really well. We might not be infertile(yet) but the hatred people seem to have for one of their own knows no bound. Looking at it; everything may seems like the end of the world but then you meet someone like Theo, Julian, Jasper or Marichka and the world starts glimmering with hope.\n\nAlright, that's it. Thank you for listening to my Ted talks and I hope everyone of you get pregnent quickly.",
        "upvotes": 605,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1pmeglq/children_of_men_is_such_a_beautiful_film/"
    },
    {
        "id": "1pmu41r",
        "author": "BarbMuschiettiAMA",
        "title": "Hi /r/movies :) I'm Barbara Muschietti. I've produced IT, IT: Chapter Two, The Flash, Mama, IT: Welcome to Derry, and more. They Will Kill You is out in theaters on March 27. Ask me anything!",
        "content": "Hi reddit! I'm Barbara Muschietti.\n\nOur newest film, THEY WILL KILL YOU, is out in theaters March 27, 2026 via Warner Bros. I'm joined by Zazie Beetz (star of the film) and Kiril Sokolov (director)\n\n&gt;\n\nPlease head here to ask questions:\n\n[https://www.reddit.com/r/movies/comments/1pmkghu/we\\_are\\_zazie\\_beetz\\_barbara\\_muschietti\\_kirill/](https://www.reddit.com/r/movies/comments/1pmkghu/we_are_zazie_beetz_barbara_muschietti_kirill/)\n\nBack tomorrow at 10 AM PST to answer questions.",
        "upvotes": 65,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j7grdnvbm97g1.png?auto=webp&amp;s=43d4df41bbe981b170736338fbfd2a7dadfd0582"
        },
        "permalink": "/r/movies/comments/1pmu41r/hi_rmovies_im_barbara_muschietti_ive_produced_it/"
    },
    {
        "id": "1pmso58",
        "author": "Donny-Moscow",
        "title": "What are the most interesting examples of directors doing something irregular to get a genuine response from actors?",
        "content": "I’m sure most of us have heard that while filming the scene where Hans gets thrown from the roof in Die Hard, Alan Rickman was expecting a 3 second countdown and they dropped him on 2 to get a genuine surprise. \n\nI’ve also heard that the “funny like a clown” dialogue of Goodfellas was left out of the script and rehearsals so that everyone’s had a genuine awkward response to the interaction between Ray Liotta and Joe Pesci. \n\nOn the darker side, Stanley Kubrick basically terrorized poor Shelly Duvall on the set of The Shining. Definitely immoral, but she also gave a fantastic performance for that movie (not justification for her treatment, just an observation). \n\nWhat are some other examples of this?",
        "upvotes": 74,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1pmso58/what_are_the_most_interesting_examples_of/"
    },
    {
        "id": "1pm0r9p",
        "author": "RealJohnGillman",
        "title": "Huntr/x from ‘KPop Demon Hunters’ perform “Golden” live at “A Year in TIME”",
        "content": "",
        "upvotes": 3795,
        "comments": 349,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Sm1sqtHzEJ8xd9q6YPf0FnOi-SFIK_WMxA-ZUJ8FG0.jpeg?auto=webp&amp;s=634f413b33daa2b80c976955bd301e321efe7e50"
        },
        "permalink": "/r/movies/comments/1pm0r9p/huntrx_from_kpop_demon_hunters_perform_golden/"
    },
    {
        "id": "1pm99bx",
        "author": "Big-Property7157",
        "title": "O Brother, Where Art Thou? (2000) - The Feared George \"Baby Face\" Nelson | ...",
        "content": "",
        "upvotes": 750,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1xy_luMbfZU8TZkWyYTWEvrYCesT6RGQC7qeupeUFC4.jpeg?auto=webp&amp;s=cbfb302eb5113f0ed467936aa0349b5a1621e781"
        },
        "permalink": "/r/movies/comments/1pm99bx/o_brother_where_art_thou_2000_the_feared_george/"
    },
    {
        "id": "1pm63hq",
        "author": "Insightful23blue",
        "title": "Planes, Trains and Automobiles, 1987-Wrong Way",
        "content": "",
        "upvotes": 933,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vg0rzw5ks37g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pm63hq/planes_trains_and_automobiles_1987wrong_way/"
    },
    {
        "id": "1pmf2w4",
        "author": "MrGittz",
        "title": "One of Jim Carey’s finest performances is for a movie I don’t see a lot of love for &amp; it’s a real shame. Robert Zemeckis’s 2009 “A Christmas Carol” is a wonderful adaptation &amp; has become a holiday tradition for my family",
        "content": "So I’ll admit when I first saw the 2009 version of A Christmas Carol starring Jim Carey, I was kind of unimpressed. Another Polar Express style film, this time costing 200 million dollars(!!!), of a movie we’ve seen dozens of iconic adaptations for. \n\nBut then one year I caught it on TV and was just blown away by Jim Carey’s Scrooge. And now it’s become what I consider to be the best Christmas Carol adaptation. It’s neck &amp; neck with Mickeys Christmas Carol(whose only weakness is that it’s not long enough!). Yet it’s Jim Carey who really impresses me. This is not phoned in, not just another role. The man gives it his all and gives what I think is one of his finest performances. \n\nI can’t say it enough. Carey is a stunning here. He plays multiple roles(including 2 of the Ghosts) but his Scrooge is something else. I honestly believe that had this been live action instead of animated, he might’ve received an Oscar nomination. \n\nHis performance in the “Ghost of Christmas Past” sequence really gets to me. “I could walk it blind folded”. This is a Scrooge who seems generally amazed &amp; awed by the things he’s seeing. \n\nI think a lot of people get turned off on the movie because it’s done in that Polar Express motion capture style. There’s one or two moments when the technology keeps us at an arms length but generally I find the visuals here to be terrific. Scrooge flying through the city, in the night sky? Great stuff. \n\nSo for those of you out there who maybe got turned off from the motion capture style, i really suggest giving this film another shot. I did and I’m so thankful. It’s just a wonderful Christmas film with a very underrated Jim Carey performance.",
        "upvotes": 168,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1pmf2w4/one_of_jim_careys_finest_performances_is_for_a/"
    },
    {
        "id": "1pmffq3",
        "author": "LaserDiscCurious",
        "title": "Why did \"The Pagemaster\" fail to find an audience when it first came out?",
        "content": "When it first came out, it only made 13 million. It had Macaulay Culkin in his last major film role, voicing an animated character who goes on an adventure with antromorphic books voiced by Whoopi Goldberg, Patrick Stewart and Frank Welker. Christopher lloyd as a wizard/librarian. A nice soundtrack with songs by Wendy Moten, Lisa Stansfield and Babyface. And a positive message about convincing kids to read, pretty much what The NeverEnding Story was supposed to be as well. But nobody saw it back then. \n\nNow, it's regarded as a cult classic, because many folks watched it on cable, home video. I discovered this movie thanks to a VHS tape that was lended to me and I loved it. Definitely my favorite 90s Hanna Barbera animated movie.",
        "upvotes": 148,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1pmffq3/why_did_the_pagemaster_fail_to_find_an_audience/"
    },
    {
        "id": "1pmk3fa",
        "author": "throw0101d",
        "title": "Seven years and 1,907 pages of music: The secrets of the Avatar soundtrack",
        "content": "",
        "upvotes": 77,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A1MLdnYdNxHjLEtkX0PGEyKgjCF-YmgrARnal2as-64.png?auto=webp&amp;s=df93150e23e12314410f739b6aebf9c238d592bd"
        },
        "permalink": "/r/movies/comments/1pmk3fa/seven_years_and_1907_pages_of_music_the_secrets/"
    },
    {
        "id": "1pmn0h0",
        "author": "EuphoricButterflyy",
        "title": "‘Mother of Flies’ trailer- When a young woman faces a deadly diagnosis, she seeks dark magic from a witch in the woods - but every cure has costs. Directed by John Adams, Zelda Adams and Toby Poser",
        "content": "",
        "upvotes": 43,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b5s5utkt387g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pmn0h0/mother_of_flies_trailer_when_a_young_woman_faces/"
    },
    {
        "id": "1plz0wc",
        "author": "stellifer_arts",
        "title": "The Boondock Saints (1999) directed by Troy Duffy - tired of crime, two Irish Catholic brothers from Boston take justice into their own hands. In this scene they infiltrate a hotel to take out the head of the Russian mobsters",
        "content": "",
        "upvotes": 1553,
        "comments": 357,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QV3Ya6HnZzJ8iGlVRw3ZilR52eiLSR5YpWAV0GEhmfc.jpeg?auto=webp&amp;s=af1652f656e9e1bb111cb6faac29c82b6138b72b"
        },
        "permalink": "/r/movies/comments/1plz0wc/the_boondock_saints_1999_directed_by_troy_duffy/"
    },
    {
        "id": "1pms3cy",
        "author": "OatSoyLaMilk",
        "title": "Movies where the language barrier hid some bad acting?",
        "content": "There's this low budget Japanese cult movie called Versus from 2000 or so that I was obsessed with as a kid. It's basically about a bunch of Yakuza that guys go to meet up with some escaped convicts in a forest where all the people they've killed over the years start rising from the dead, and it turns out both the convicts and the boss they were waiting for are more than they seem.\n\nNow according to the filmmakers, especially the director, the lead actor Tak Sakaguchi delivers his dialogue terribly in a lot of scenes, which I guess is unsurprising for an early effort from an inexperienced director like Ryuhei Kitamura was. I don't know if he's wooden in his inflection, emotes incorrectly, or what because I can't speak a single sentence of Japanese.\n\nRobert Rodriguez also speculated about his breakout feature El Mariachi that he figured Americans took it more seriously and got more out of it because the fact it was in subtitled Spanish convinced them it must be more highbrow that the kind of silly, contrived B movie that it he felt it actually was. One of the lead villains was 19 years old and delivered his lines very woodenly in Spanish but looked old enough to still be intimidating to an English speaker. \n\nAre there any movies you've seen from your home country being watched by people in other countries where you think you'd enjoy them less if they were native speakers of your language?",
        "upvotes": 19,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1pms3cy/movies_where_the_language_barrier_hid_some_bad/"
    },
    {
        "id": "1plrv0n",
        "author": "BunyipPouch",
        "title": "Béatrice Picard, ‘The Simpsons’ Voice Actor Behind French-Canadian Dub, Dies at 96",
        "content": "",
        "upvotes": 3211,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9GqoE6XfGAInkZwLhA2xsftcPkoY3dr5J2yihuo-gMw.jpeg?auto=webp&amp;s=03c5bf50b79cab8c5d39abd815871d6b70b93ca9"
        },
        "permalink": "/r/movies/comments/1plrv0n/béatrice_picard_the_simpsons_voice_actor_behind/"
    },
    {
        "id": "1pll78c",
        "author": "MarvelsGrantMan136",
        "title": "Original ‘Neon Genesis Evangelion’ Studio Gainax Officially Shutters After 42 Years",
        "content": "",
        "upvotes": 6999,
        "comments": 260,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A342nhHffZ88ve1PoDofIX1KJS4OdzyG3BCadGfwNh4.jpeg?auto=webp&amp;s=6e95dec190c2f9829b54a0450977fd69afa6b977"
        },
        "permalink": "/r/movies/comments/1pll78c/original_neon_genesis_evangelion_studio_gainax/"
    },
    {
        "id": "1pm3emk",
        "author": "EuphoricButterflyy",
        "title": "Girl, Interrupted (1999)- Daisy’s end of the road scene. Featuring Winona Ryder, Angelina Jolie, Brittany Murphy- Directed by James Mangold",
        "content": "",
        "upvotes": 400,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tmj7ches337g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pm3emk/girl_interrupted_1999_daisys_end_of_the_road/"
    },
    {
        "id": "1pm1iqq",
        "author": "Minifig81",
        "title": "Grandchildren Politely Decline David Cronenberg’s Bedtime Story Offer",
        "content": "",
        "upvotes": 541,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1pm1iqq/grandchildren_politely_decline_david_cronenbergs/"
    },
    {
        "id": "1pm8977",
        "author": "BunyipPouch",
        "title": "Michael B. Jordan &amp; Jesse Plemons | Actors on Actors",
        "content": "",
        "upvotes": 152,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dbTrOohx1_Jdp2XZ9gafjvXZik7gzarkJGSLW2fGuKY.jpeg?auto=webp&amp;s=d27a0967228a2867bf68a625bccf70590dc6e120"
        },
        "permalink": "/r/movies/comments/1pm8977/michael_b_jordan_jesse_plemons_actors_on_actors/"
    },
    {
        "id": "1plzhmc",
        "author": "BunyipPouch",
        "title": "First Poster for Iraq's Oscar-Contender 'The President's Cake' - In 1990s Iraq, 9-year-old Lamia must bake the President's birthday cake. She scrambles to find ingredients for the compulsory task, fearing punishment if she fails.",
        "content": "",
        "upvotes": 578,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7x4e8zqd527g1.jpeg?auto=webp&amp;s=e5b4b3e78a18c5d0d2e8880cf756630dafa660ce"
        },
        "permalink": "/r/movies/comments/1plzhmc/first_poster_for_iraqs_oscarcontender_the/"
    },
    {
        "id": "1pmrqzz",
        "author": "gimmeluvin",
        "title": "Fay Grim (2006): What genre/style was the director going for with this?",
        "content": "Edit: I think I've figured out why I'm responding to this material the way I am. Lately I've been watching a number of short videos giving coaching tips about what makes for good and bad acting, and what makes for a good audition. There is a striking similarity between the way Fay Grim's characters deliver their lines, and what is being sold as bad acting based on contemporary guidance! \n\nI'm a big fan of Parker Posey. I know she is one of those performers whose style is idiosyncratic. It's why she turns up in so many peculiar, almost niche roles. When I saw she was the lead in Fay Grim I was instantly excited.\n\nHaving watched this, I'm now a little baffled. There's something \"off\" about the storytelling. Aside from the choice to shoot or display the frames at skewed angles (we used to call it shooting for porn) there's something about the stilted delivery of the lines that seems to be trying to evoke a particular style that isn't typical, but that also doesn't feel new.\n\nIt's like the director is trying to evoke film noir, but somehow there's something that feels 80s about the execution.\n\nDoes anyone know what I'm talking about? Can anyone shed light on the weird energy this film is conveying?",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1pmrqzz/fay_grim_2006_what_genrestyle_was_the_director/"
    },
    {
        "id": "1pmml68",
        "author": "mjobby",
        "title": "Seeking films similar to Brighburn (not specifically seeking horror, more the scifi or alien elements and the powers etc that allure me), in particular noting there isnt a BB 2 to come now",
        "content": "I am a big fan of brightburn, watched it a good few times now, and rewatched again today\n\ni am usually not a fan of horror, but i dont see this as horror, although its tagged as such, i like the alien elements, the sci fi bits, the powers, maybe a bit of the confused boy story\n\nnot sure what, but i like it and seeking similar\n\nthanks",
        "upvotes": 15,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1pmml68/seeking_films_similar_to_brighburn_not/"
    },
    {
        "id": "1plzwhl",
        "author": "INGWR",
        "title": "Transformers: Dark of the Moon is surprisingly gritty compared to the others",
        "content": "I’m rewatching Dark of the Moon and I forgot how much casual mass murder happens the whole time on screen. You really see it first with the Laserbeak blasting families in their home and pushing Ken Jeong out of a window. Then the car chase on the DC highway when they just start flattening cars left and right - there’s a weird blood splatter effect when Transformers start transforming that feels odd because we know the robots don’t bleed red. \n\nThen when Sentinel and the Decepticons take over Chicago, they just start vaporizing people on screen. When Sam and his buddies roll up, they’re attacked and the incoming craft literally turns people into skeletons a lá Sarah Connor’s dream in Terminator 2. Sam definitely tries to blunt force trauma + electrocute Dylan on screen and Optimus does some gnarly mutilation to Megatron with a shotgun execution to Sentinel. \n\n\nIt’s nice to see, because frankly for all the massive fights that happen in all the movies, they typically gloss over the fact that thousands of people are probably obliterated in these massive skyscraper destruction scenes (e.g. Shockwave).",
        "upvotes": 432,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1plzwhl/transformers_dark_of_the_moon_is_surprisingly/"
    }
]