[
    {
        "id": "1o0hps8",
        "author": "shiruken",
        "title": "The Nobel Prize in Physics 2025: Awarded to John Clarke, Michel H. Devoret, and John M. Martinis \"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit\"",
        "content": "The Nobel Prize in Physics 2025 was awarded to [John Clarke](https://en.wikipedia.org/wiki/John_Clarke_(physicist)), [Michel H. Devoret](https://en.wikipedia.org/wiki/Michel_Devoret), and [John M. Martinis](https://en.wikipedia.org/wiki/John_M._Martinis) **\"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/physics/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/physics/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/physics/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=m9FUkAis62s)\n\n&gt;Quantum mechanics allows a particle to move straight through a barrier, using a process called tunnelling. As soon as large numbers of particles are involved, quantum mechanical effects usually become insignificant. The laureates’ experiments demonstrated that quantum mechanical properties can be made concrete on a macroscopic scale.\n\n&gt;In 1984 and 1985, **John Clarke**, **Michel H. Devoret** and **John M. Martinis** conducted a series of experiments with an electronic circuit built of superconductors, components that can conduct a current with no electrical resistance. In the circuit, the superconducting components were separated by a thin layer of non-conductive material, a setup known as a Josephson junction. By refining and measuring all the various properties of their circuit, they were able to control and explore the phenomena that arose when they passed a current through it. Together, the charged particles moving through the superconductor comprised a system that behaved as if they were a single particle that filled the entire circuit.\n\n&gt;This macroscopic particle-like system is initially in a state in which current flows without any voltage. The system is trapped in this state, as if behind a barrier that it cannot cross. In the experiment the system shows its quantum character by managing to escape the zero-voltage state through tunnelling. The system’s changed state is detected through the appearance of a voltage.\n\n&gt;The laureates could also demonstrate that the system behaves in the manner predicted by quantum mechanics – it is quantised, meaning that it only absorbs or emits specific amounts of energy.\n\n&gt;“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,” says Olle Eriksson, Chair of the Nobel Committee for Physics.\n\n&gt;The transistors in computer microchips are one example of the established quantum technology that surrounds us. This year’s Nobel Prize in Physics has provided opportunities for developing the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.",
        "upvotes": 311,
        "comments": 8,
        "media": null,
        "permalink": "/r/science/comments/1o0hps8/the_nobel_prize_in_physics_2025_awarded_to_john/"
    },
    {
        "id": "1nzltrq",
        "author": "shiruken",
        "title": "The Nobel Prize in Physiology or Medicine 2025: Awarded to Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi \"for their discoveries concerning peripheral immune tolerance\"",
        "content": "The Nobel Prize in Physiology or Medicine 2025 was awarded to [Mary E. Brunkow](https://en.wikipedia.org/wiki/Mary_E._Brunkow), [Fred Ramsdell](https://en.wikipedia.org/wiki/Fred_Ramsdell), and [Shimon Sakaguchi](https://en.wikipedia.org/wiki/Shimon_Sakaguchi) **\"for their discoveries concerning peripheral immune tolerance.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/medicine/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/medicine/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/medicine/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=vUut_3YYD6s)\n\n&gt;Every day, our immune system protects us from thousands of different microbes trying to invade our bodies. These all have different appearances, and many have developed similarities with human cells as a form of camouflage. So how does the immune system determine what it should attack and what it should defend?\n\n&gt;Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi are awarded the Nobel Prize in Physiology or Medicine 2025 for their fundamental discoveries relating to peripheral immune tolerance. The laureates identified the immune system’s security guards, *regulatory T cells*, which prevent immune cells from attacking our own body.\n\n&gt;“Their discoveries have been decisive for our understanding of how the immune system functions and why we do not all develop serious autoimmune diseases,” says Olle Kämpe, chair of the Nobel Committee.\n\n&gt;Shimon Sakaguchi was swimming against the tide in 1995, when he made the first key discovery. At the time, many researchers were convinced that immune tolerance only developed due to potentially harmful immune cells being eliminated in the thymus, through a process called *central tolerance*. Sakaguchi showed that the immune system is more complex and discovered a previously unknown class of immune cells, which protect the body from autoimmune diseases.\n\n&gt;Mary Brunkow and Fred Ramsdell made the other key discovery in 2001, when they presented the explanation for why a specific mouse strain was particularly vulnerable to autoimmune diseases. They had discovered that the mice have a mutation in a gene that they named *Foxp3*. They also showed that mutations in the human equivalent of this gene cause a serious autoimmune disease, IPEX.\n\n&gt;Two years after this, Shimon Sakaguchi was able to link these discoveries. He proved that the *Foxp3* gene governs the development of the cells he identified in 1995. These cells, now known as regulatory T cells, monitor other immune cells and ensure that our immune system tolerates our own tissues.\n\n&gt;The laureates’ discoveries launched the field of peripheral tolerance, spurring the development of medical treatments for cancer and autoimmune diseases. This may also lead to more successful transplantations. Several of these treatments are now undergoing clinical trials.",
        "upvotes": 1402,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yDcNjyI-ofoZkQ11U06qHRXewA5a88uMWZmjSAFL5Ug.png?auto=webp&amp;s=1d6140d470764758cb9e0b9cc9d844311965404d"
        },
        "permalink": "/r/science/comments/1nzltrq/the_nobel_prize_in_physiology_or_medicine_2025/"
    },
    {
        "id": "1o16jop",
        "author": "mvea",
        "title": "Scientists discover antibody that neutralizes 98.5% of more than 300 different HIV strains, one of the broadest antibodies against HIV identified. In experiment with humanized mice (with immune systems modified to resemble that of humans) it permanently reduced HIV viral load to undetectable levels.",
        "content": "",
        "upvotes": 3147,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lTOjon-ILcBLTBfvBAKpyOzmCFt_C6PwEIYt_r4CLys.jpeg?auto=webp&amp;s=a5d81b494070da2a0c993a43498ed34dfdb33bfc"
        },
        "permalink": "/r/science/comments/1o16jop/scientists_discover_antibody_that_neutralizes_985/"
    },
    {
        "id": "1o1f0r1",
        "author": "New_Scientist_Mag",
        "title": "Older men are more likely to pass on disease-causing mutations to their children because of the faster growth of mutant cells in the testes with age",
        "content": "",
        "upvotes": 582,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nDPtaDrvOb9L4v21JuTtmrRCI9_8Beit3gr5GC-pOq4.jpeg?auto=webp&amp;s=48c75b0320cc3200a90c68825c5276d3e414e457"
        },
        "permalink": "/r/science/comments/1o1f0r1/older_men_are_more_likely_to_pass_on/"
    },
    {
        "id": "1o14rle",
        "author": "holyfruits",
        "title": "Scientists develop first ‘accurate blood test’ to detect chronic fatigue syndrome",
        "content": "",
        "upvotes": 960,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2IqGIIBEV1UmN3IudVQVW451ulx05KoF-5es7AAuX-4.jpeg?auto=webp&amp;s=b6fd6829fb3a5b80e53add989b6c2933a0bc4f27"
        },
        "permalink": "/r/science/comments/1o14rle/scientists_develop_first_accurate_blood_test_to/"
    },
    {
        "id": "1o0v9kl",
        "author": "mvea",
        "title": "According to a new study, BMI may do more harm than good when used. It cannot distinguish between muscle and fat, doesn’t account for where fat is distributed in the body and overlooks factors like age, sex and race. Two people can share the same BMI but have completely different health profiles.",
        "content": "",
        "upvotes": 4409,
        "comments": 942,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aCc00znGbHGNz9VJjOyCKpzFbA8944gPRwQk1KP1Wy4.jpeg?auto=webp&amp;s=952c18a6fe2a236b8319b2d9d5b31f4d5bc975ef"
        },
        "permalink": "/r/science/comments/1o0v9kl/according_to_a_new_study_bmi_may_do_more_harm/"
    },
    {
        "id": "1o1dazf",
        "author": "chrisdh79",
        "title": "The Moai Statues Were Really “Walked” to Their Platforms | This ancient puzzle solved not with brute force, but with clever physics.",
        "content": "",
        "upvotes": 207,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0dx0MIiOrL7RNpc-uzfYiAIcXE08zWW24C9Vbz5DocY.jpeg?auto=webp&amp;s=6eccf150f269ae27473c6482c4d3ae82cba0a612"
        },
        "permalink": "/r/science/comments/1o1dazf/the_moai_statues_were_really_walked_to_their/"
    },
    {
        "id": "1o0n8vu",
        "author": "nohup_me",
        "title": "Scientists have achieved a “striking” reversal of Alzheimer’s disease in mice by restoring the normal function of the brain's vasculature—the network of blood vessels that supplies it with oxygen and nutrients",
        "content": "",
        "upvotes": 9654,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lcGmQW9P0VdJ9q4s8_c0BhIjnMNJkOqnhA6uxd05mxc.png?auto=webp&amp;s=29b709aaf8e612be4eb136770de5e4e98e1bddc7"
        },
        "permalink": "/r/science/comments/1o0n8vu/scientists_have_achieved_a_striking_reversal_of/"
    },
    {
        "id": "1o17jqt",
        "author": "James_Fortis",
        "title": "Low-carbohydrate diets may not be beneficial for primary prevention of type 2 diabetes unless they prioritize plant-based protein, healthy fats, and high-quality carbohydrates, study finds",
        "content": "",
        "upvotes": 296,
        "comments": 46,
        "media": null,
        "permalink": "/r/science/comments/1o17jqt/lowcarbohydrate_diets_may_not_be_beneficial_for/"
    },
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 109,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o0ma6r",
        "author": "New_Scientist_Mag",
        "title": "Scientists have identified five sleep profiles, each of which is linked to distinct mental health symptoms and brain activity patterns",
        "content": "",
        "upvotes": 3947,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/exeLQfE4VrKKpCzuuuudCDhfRLR_4DcS2TQPKTY6GMw.jpeg?auto=webp&amp;s=eb9deee6629c751f650a9cedcbe134fcacf6cb82"
        },
        "permalink": "/r/science/comments/1o0ma6r/scientists_have_identified_five_sleep_profiles/"
    },
    {
        "id": "1o0l37g",
        "author": "scientificamerican",
        "title": "Babies start processing language before they are born, suggests a new study published in Nature Communications Biology. A research team has found that newborns who had heard short stories in foreign languages while in the womb process those languages similarly to their native tongue.",
        "content": "",
        "upvotes": 4258,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wAOjpZ6Ze_MKjcDaIApIqALN0faOLE7tvd1OTA73rzk.jpeg?auto=webp&amp;s=6cf19c2327607b8ee10c9f02a0681fe41a261e57"
        },
        "permalink": "/r/science/comments/1o0l37g/babies_start_processing_language_before_they_are/"
    },
    {
        "id": "1o0an0u",
        "author": "mvea",
        "title": "Younger generations turning away from alcohol at unprecedented rates, with Gen Z driving cultural shift. Australian study shows over course of their life, Gen Z are nearly 20 times more likely to choose not to drink alcohol compared to Baby Boomers, even after adjusting for sociodemographic factors.",
        "content": "",
        "upvotes": 13073,
        "comments": 1424,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6B85kCMKeqvvtTlpT7Ssew8qJrOXaBbCiEtM54y3UYk.jpeg?auto=webp&amp;s=355432069eeea835a34cab11537bdf7fefb46477"
        },
        "permalink": "/r/science/comments/1o0an0u/younger_generations_turning_away_from_alcohol_at/"
    },
    {
        "id": "1o0p1w5",
        "author": "mustaphah",
        "title": "Scientists identify a brain circuit that keeps alcohol users trapped in addiction - showing how the brain learns to drink not for pleasure, but to escape the pain of withdrawal. The discovery, in rats, could open new paths for treating addiction, anxiety, and trauma-related disorders.",
        "content": "",
        "upvotes": 1657,
        "comments": 55,
        "media": null,
        "permalink": "/r/science/comments/1o0p1w5/scientists_identify_a_brain_circuit_that_keeps/"
    },
    {
        "id": "1o1bix5",
        "author": "calliope_kekule",
        "title": "In 2023, land use change and fires altered 0.3% of Earth’s surface (an area the size of California) according to new satellite tracking data.",
        "content": "",
        "upvotes": 44,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_rFMoBg2stdvaFwaKTPu55rF03FVsdU1Tun5doBBH0E.png?auto=webp&amp;s=87fa39f2c249ee40c8f12ab24f04f7bbd38416d1"
        },
        "permalink": "/r/science/comments/1o1bix5/in_2023_land_use_change_and_fires_altered_03_of/"
    },
    {
        "id": "1o0lis7",
        "author": "nohup_me",
        "title": "Fatigue might be the brain's method of safeguarding the body, and light activities such as walking, stretching, or light cycling could play a crucial role in managing it, both in daily life and treating illness",
        "content": "",
        "upvotes": 1270,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IyTmABM9L7KT3CVswK9cBasIxV6PEjmtYAeYVChqZdU.jpeg?auto=webp&amp;s=9378e69c49a136ab9484b3bb87504903ae102765"
        },
        "permalink": "/r/science/comments/1o0lis7/fatigue_might_be_the_brains_method_of/"
    },
    {
        "id": "1o1cc2z",
        "author": "Fraaankleb",
        "title": "Pyrolysis Breakthrough: From Saline Containers to Sustainable Fuel",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lMSMwBW_EPEdBfyRu1CGMq3Bk_-1n8KjRug2bQmZsVs.jpeg?auto=webp&amp;s=7763dc3b225c8251fbeacdad41d42b5f561f77e4"
        },
        "permalink": "/r/science/comments/1o1cc2z/pyrolysis_breakthrough_from_saline_containers_to/"
    },
    {
        "id": "1o0csyb",
        "author": "mvea",
        "title": "Young women who see pornography as a normal or acceptable part of sexual exploration may feel more comfortable discussing their sexual preferences with partners, which in turn can lead to more satisfying and affirming sexual experiences.",
        "content": "",
        "upvotes": 2431,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nm0PsCVReAKO4KC0xlH_ZhpvKnunY8FDJ2FCSCLQnBQ.jpeg?auto=webp&amp;s=547086f3ff691df159a0a6b24b690ed8e7000abd"
        },
        "permalink": "/r/science/comments/1o0csyb/young_women_who_see_pornography_as_a_normal_or/"
    },
    {
        "id": "1o0hynr",
        "author": "ChallengeAdept8759",
        "title": "Switching schools between middle and high school made teens more likely to drink than those who remained in the same building, research finds",
        "content": "",
        "upvotes": 837,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hZpZ4wvjH7rRjSymYiFeX5xkG4_t2TxepiCxc4T5920.jpeg?auto=webp&amp;s=e395023a2e516ea3df605318fd56271111c1de71"
        },
        "permalink": "/r/science/comments/1o0hynr/switching_schools_between_middle_and_high_school/"
    },
    {
        "id": "1o0i27e",
        "author": "chrisdh79",
        "title": "New sunlight-powered film kills 99.995% bacteria to provide safe drinking water | It offers a simple, affordable, and robust solution to the global safe drinking water crisis.",
        "content": "",
        "upvotes": 523,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gfh7hvGeqPxPWjH-PzbhIeO74ShKveAkgZlk0BwlrEo.png?auto=webp&amp;s=01ca2cdf1c35ddc2376257b435344bdbe6286763"
        },
        "permalink": "/r/science/comments/1o0i27e/new_sunlightpowered_film_kills_99995_bacteria_to/"
    },
    {
        "id": "1o10o0w",
        "author": "calliope_kekule",
        "title": "A new study finds that grey treefrogs use daylight length to trigger 'antifreeze' buildup for winter. But as climate change warms winters, this cue may mislead them into preparing too early or too late.",
        "content": "",
        "upvotes": 47,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o10o0w/a_new_study_finds_that_grey_treefrogs_use/"
    },
    {
        "id": "1o0ipp3",
        "author": "chrisdh79",
        "title": "Women carry a higher genetic risk of depression, new study says | Researchers in Australia find 16 genetic variants linked to depression in women but only eight in men",
        "content": "",
        "upvotes": 385,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OoikRvcp1RgolaKSjrOcLI2XuFZUjAryZxWg2m5wMDk.jpeg?auto=webp&amp;s=3971ba4f2cb9c499a951529e7008aa29741af154"
        },
        "permalink": "/r/science/comments/1o0ipp3/women_carry_a_higher_genetic_risk_of_depression/"
    },
    {
        "id": "1o129z2",
        "author": "BrnoRegion",
        "title": "Brno study finds cybersecurity's data problem has shifted from scarcity to quality, as researchers are often unaware of the existence and limitations of the datasets they use to train AI.",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o129z2/brno_study_finds_cybersecuritys_data_problem_has/"
    },
    {
        "id": "1o0jt05",
        "author": "Wagamaga",
        "title": "Seniors who get a concussion are more likely to develop dementia or falter as they age. Research found new cases of TBI were associated with a 69% increased risk of dementia developing within five years, and a 56% increased risk of dementia beyond five years",
        "content": "",
        "upvotes": 204,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vnOkRv6RBImhNmz_BXhkFQ5eGEc-h351zqcqELO_lJ0.jpeg?auto=webp&amp;s=1cec09e87bb1786584af4b3c14eeeab845684b00"
        },
        "permalink": "/r/science/comments/1o0jt05/seniors_who_get_a_concussion_are_more_likely_to/"
    },
    {
        "id": "1nztrs9",
        "author": "mvea",
        "title": "Children who “play like boys” in preschool show better spatial abilities a decade later: children with masculine-typical play styles at 3.5 years of age tend to perform better in a mental rotation task when they are 13 years old, regardless of their sex.",
        "content": "",
        "upvotes": 8078,
        "comments": 323,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZpZ-ld42oDUc87FaGkkx1JUi3W2N5ks0t0FdgK1zoaY.jpeg?auto=webp&amp;s=fb448e235d80b0cdb403e5af995c3188a3228a0e"
        },
        "permalink": "/r/science/comments/1nztrs9/children_who_play_like_boys_in_preschool_show/"
    },
    {
        "id": "1o0rv2f",
        "author": "AIBNatUQ",
        "title": "Prototype nanosensor for sensitive and selective detection of Vitamin C – opening the door to faster, cheaper and more accessible ways to test food freshness and quality.",
        "content": "",
        "upvotes": 51,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-CmPzTpQzvREnJmFs7QKbbz3R0UWRqsd_KyMgv1N2eo.jpeg?auto=webp&amp;s=5f41335284e40f8370a97f76f79d23847a76d050"
        },
        "permalink": "/r/science/comments/1o0rv2f/prototype_nanosensor_for_sensitive_and_selective/"
    },
    {
        "id": "1o0lz6m",
        "author": "Hrmbee",
        "title": "Millions of buildings at risk from sea level rise and underscores urgent need for planning | Assessing the exposure of buildings to long-term sea level rise across the Global South",
        "content": "",
        "upvotes": 79,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TPcjlO0VMwN0oGQ0gqP6u6ahS0XFMhL7NWL6ZEcuoKA.jpeg?auto=webp&amp;s=780bef8bfa7a67cb4d3fb07d368377aa059de8fd"
        },
        "permalink": "/r/science/comments/1o0lz6m/millions_of_buildings_at_risk_from_sea_level_rise/"
    },
    {
        "id": "1o1fzf9",
        "author": "Inevitable-Middle681",
        "title": "Weak magnetic field seems to affect the Earthworm movements",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XDQ_aZn4PdEDUmpaGjLOFsIfF9mfzdstkw8kJgX54_4.jpeg?auto=webp&amp;s=f2f356a923a144cec02821048430a695441388fa"
        },
        "permalink": "/r/science/comments/1o1fzf9/weak_magnetic_field_seems_to_affect_the_earthworm/"
    },
    {
        "id": "1nzzqi5",
        "author": "-Mystica-",
        "title": "Medication inhalers emit hydrofluoroalkanes (HFAs) with a global warming potential thousands of times greater than CO₂. A new study finds their annual climate impact equals emissions from about half a million cars, making inhalers a notable source of greenhouse pollution.",
        "content": "",
        "upvotes": 1441,
        "comments": 194,
        "media": null,
        "permalink": "/r/science/comments/1nzzqi5/medication_inhalers_emit_hydrofluoroalkanes_hfas/"
    },
    {
        "id": "1o04ufs",
        "author": "calliope_kekule",
        "title": "A nationwide US study finds that children in deprived neighbourhoods have less access to green space, with Hispanic children most affected.",
        "content": "",
        "upvotes": 637,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DqfXqnKsWQgVhHAGb7zlY7Lbd-WbXrjpKQdWEi0GLoo.png?auto=webp&amp;s=4902d0b76629e4888933de0e9588b95f45710c6b"
        },
        "permalink": "/r/science/comments/1o04ufs/a_nationwide_us_study_finds_that_children_in/"
    }
]