[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1oljhso",
        "author": "Less-Animator-4648",
        "title": "Porta Susa, ma che vergogna!",
        "content": "Voglio solo dire quanto mi fa schifo vedere Porta Susa in queste condizioni.\nNon so se i bagni siano sempre chiusi, ma ogni volta che ci sono passata erano chiusi.\nIeri sera avevo davvero tanta urgenza di andare in bagno e ho dovuto camminare un bel po’ per trovare un ristorante con i servizi aperti e chiedere di poterli usare.\n\nQuindi sì, non c’è da sorprendersi se tutta la stazione puzza di piscio ed è piena di sporcizia.\nLe rotaie sono piene di spazzatura, e sinceramente è davvero triste vedere una cosa del genere.\n\nE non stiamo parlando di una stazione sperduta: Porta Susa è nel centro della città, dove passano turisti, pendolari e visitatori ogni giorno.\nCom’è possibile che una delle stazioni principali di Torino sia ridotta così male?\n\nFinché resta in queste condizioni, le persone avranno sempre meno voglia di rispettarla e tenerla pulita. È un vero circolo vizioso di degrado e indifferenza.",
        "upvotes": 51,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1oljhso/porta_susa_ma_che_vergogna/"
    },
    {
        "id": "1olqyy6",
        "author": "Few-Connection-8313",
        "title": "Posti ignoranti dove passare una serata a Torino?",
        "content": "Ciao! Io e i miei amici stiamo impazzendo perché non riusciamo più a trovare posti \"ignoranti\" e locali/pub a Torino e provincia dove bere e divertirsi come si deve senza dover necessariamente mangiare lì prima (conosco il Befed ad esempio ma so che bisogna tassativamente cenare li).\n\nLocali e pub dove si fa karaoke con i classiconi della musica ma dove si salta anche sui tavoli e ci si diverte.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1olqyy6/posti_ignoranti_dove_passare_una_serata_a_torino/"
    },
    {
        "id": "1ol1dn1",
        "author": "cosyquaza",
        "title": "Nuove amicizie Torino HERE",
        "content": "Ciao, sono una ragazza di 28 anni nuova a Torino, appena trasferita per lavoro e studio! Vago per la città da qualche settimana e mi sembra abbastanza spenta in settimana, ma magari mi sbaglio (spero)\n\nSe vi va sto creando un gruppo telegram per persone nuove del posto come me, o anche chi ha voglia di conoscere nuova gente per organizzare cose easy: un caffè o un giro per mercatini, serate gioco di ruolo o da tavolo, serate film, gite nel weekend e simili.  \nSe avete bho dai 23 ai 33 anni (range ipotetico intorno alla mia età) scrivetemi pure, magari creiamo una bella community per non passare l'inverno a bere cioccolata calda da soli! \n\n&lt;3 ",
        "upvotes": 32,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1ol1dn1/nuove_amicizie_torino_here/"
    },
    {
        "id": "1olhrjz",
        "author": "Inner-Corner889",
        "title": "Un po’ di voglia di cambiare aria oggi",
        "content": "Oggi a Torino il cielo è un po’ coperto, e forse è proprio quel tipo di giornata che ti fa venire voglia di cambiare aria. Stavo leggendo qualche articolo su nuove mete da visitare e mi sono imbattuto in una proposta di viaggio che mi ha fatto sognare un po’. Ultimamente sto pensando se valga la pena affidarsi a qualcuno per organizzare tutto, oppure se sia meglio gestire le cose da soli. Voi come fate di solito? Preferite il fai-da-te o i viaggi già pianificati?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1olhrjz/un_po_di_voglia_di_cambiare_aria_oggi/"
    },
    {
        "id": "1olacky",
        "author": "Icy_Sand_1453",
        "title": "Bicerin",
        "content": "Where I can find the best bicerin in the city?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1olacky/bicerin/"
    },
    {
        "id": "1ol591b",
        "author": "Outside-Campaign-39",
        "title": "Nuove conoscenze che giocano nelle sale arcade? [19M]",
        "content": "Buona sera a tutti, sono 19M, cercavo compagnia per giocare prossima settimana alla sala arcade del King Bowling Funmily (sono innamorato di In The Groove 2).\n\nSe qualcuno è interessato/a, mi scriva nei DM.\n\nGrazie in anticipo :)\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ol591b/nuove_conoscenze_che_giocano_nelle_sale_arcade_19m/"
    },
    {
        "id": "1ola7vh",
        "author": "Icy_Sand_1453",
        "title": "Museo Nazionale del Cinema",
        "content": "Had anyone already visited?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ola7vh/museo_nazionale_del_cinema/"
    },
    {
        "id": "1ol015l",
        "author": "PureRaisin",
        "title": "C2C buddy",
        "content": "Sto andando al C2C da solo, sia alla serata di oggi che domani. Arrivo col treno da Trieste. Se ci sono altre persone che vanno da sole e vogliamo andare assieme, scrivetemi. \n\n\nGoing to C2C tonite and tomorrow, travelling alone from Trieste. If you are also going to C2C alone and fancy going with someone let's meet up!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ol015l/c2c_buddy/"
    },
    {
        "id": "1ol3m6r",
        "author": "Desperate-Law-2070",
        "title": "Free2Move Torino Roma",
        "content": "Hey everyone, what happens if I rent a free2move car from Torino and then I drop it on Roma at the airport? Will something happens?\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ol3m6r/free2move_torino_roma/"
    },
    {
        "id": "1okif9f",
        "author": "cake1066",
        "title": "Is Piedmontese worth studying, or just stick to Italian?",
        "content": "(Title) + sorry for the English",
        "upvotes": 8,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1okif9f/is_piedmontese_worth_studying_or_just_stick_to/"
    },
    {
        "id": "1oksyty",
        "author": "Difficult_Leek_5693",
        "title": "È sicuro prendere l’autobus alle 5 del mattino da via Frejus e Racconigi?",
        "content": "Ciao a tutti! Sono nuovo in città e devo prendere un autobus verso l’aeroporto intorno alle 5 del mattino, partendo dalla zona di via Frejus e corso Racconigi.  \nQualcuno sa se è sicuro muoversi a quell’ora? \n\nGrazie mille!",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1oksyty/è_sicuro_prendere_lautobus_alle_5_del_mattino_da/"
    },
    {
        "id": "1ojzf46",
        "author": "SteamPaz",
        "title": "Una Cometa su Borgata Frassati",
        "content": "C/2025/A6 (Lemmon) a magnitudine apparente +4.2 in cielo con indice Bortle 8 (27/10/25, ore 18:30-19:00).\n\n55mm f/6.3 su sensore aps-c (Canon EOS 2000D), ISO800, 198x10s (33min).",
        "upvotes": 64,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2zepueo19yf1.jpeg?auto=webp&amp;s=751f3384dd48ddc220bdbd1d6db0b11f63a0b159"
        },
        "permalink": "/r/torino/comments/1ojzf46/una_cometa_su_borgata_frassati/"
    },
    {
        "id": "1okog4l",
        "author": "Top-Text-7727",
        "title": "Prezzi dentro al c2c?",
        "content": "Ciao, sarò al festival in questi giorni e ho scaricato la app. Quanto costeranno dentro le consumazioni?  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1okog4l/prezzi_dentro_al_c2c/"
    },
    {
        "id": "1ok7m1b",
        "author": "Wyvern57",
        "title": "M1S non accetta pagamento con carta?",
        "content": "Ciao, mi è scaduto l’abbonamento sulla tessera BIP e non intendo rinnovarlo.\nQualche sera fa ho preso un sostitutivo della metro e nessuna delle due obliteratrici ha accettato la mia carta. \n\nSono stato sfortunato o sono tutti così? \nQuali altre linee hanno questo problema?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ok7m1b/m1s_non_accetta_pagamento_con_carta/"
    },
    {
        "id": "1ok34yu",
        "author": "sixlaneve4_0",
        "title": "Lungo dora Firenze.",
        "content": "Per chi è di Torino.\nNon entro nei dettagli, ma lungo dora Firenze - zona Aurora, che zona è?\nHo trovato un annuncio per una casa per studenti al n'31, ma su Google Maps, mi sembra più una pseudo casa popolare.",
        "upvotes": 4,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1ok34yu/lungo_dora_firenze/"
    },
    {
        "id": "1okc3v5",
        "author": "Dense-Knee547",
        "title": "Casa in affitto senza busta paga",
        "content": "Mi è sorto un dubbio, sicuramente molto banale, dettato dalla mia inesperienza in materia. Ipotizziamo che voglia prendere in affitto un monolocale/bilocale e che io non abbia buste paga da poter mostrare come garanzia economica in quanto ho appena finito gli studi. Inoltre, ipotizziamo che io abbia appena stipulato un contratto di lavoro a tempo determinato avrei delle possibilità di trovare qualcuno che mi dia una casa un affitto?\nPremetto non nessuno che mi possa fare da garante ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1okc3v5/casa_in_affitto_senza_busta_paga/"
    },
    {
        "id": "1ojwran",
        "author": "ZayaBt-",
        "title": "C'è qualcuno che non ha ancora ricevuto la pergamena?",
        "content": "Mi sono laureata all'Università di Torino ad aprile. Non mi hanno ancora dato la pergamena, ho inviato un paio di ticket, mi avevano detto di ricontattare fine ottobre ma adesso non mi rispondono più.\n\nMi serve questa cosa per rinnovare il mio permesso di soggiorno, la questura mi chiede se non è pronta la pergamena, almeno una certificazione di laurea timbrata da segreteria, ma non mi rispondono da un mese. \n\nMa davvero richiede così tanto tempo per dare la pergamena? Molto fastidiosa questa situazione. ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ojwran/cè_qualcuno_che_non_ha_ancora_ricevuto_la/"
    },
    {
        "id": "1ok9qoi",
        "author": "Tough-Assistant-9740",
        "title": "Furgoncino per trasloco",
        "content": "Ciao a tutti! Dovrei portare giusto un divano smontato e qualche altra cosetta da casa vecchia. Contavo di usare i furgoni di enjoy dato che hanno dei prezzi molto competitivi, ma sono due settimane che gli stalli sono vuoti (per chi non lo sapesse ora i furgoncini non sono più disponibili in giro).. sapete come mai? Avete qualche alternativa da propormi? Grazie mille",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ok9qoi/furgoncino_per_trasloco/"
    },
    {
        "id": "1ok270z",
        "author": "Gullible_Drummer_246",
        "title": "Dove comprare lepre?",
        "content": "Come da titolo cercavo un posto dove comprare una lepre.\n\nMi vengono a trovare e vorrebbero comprarla ma essendo io grossomodo vegetariano non ho la benché più minima idea di dove potrebbero trovarla.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ok270z/dove_comprare_lepre/"
    },
    {
        "id": "1ok7ya8",
        "author": "SpanishPilot",
        "title": "Best places to rent for a 30M?",
        "content": "Hi all, \n\nI'm moving to Torino for work starting on the 1st of January and I know nothing about the city. \n\nI'll be working at the airport and have to be at work at 5am some days and finish very late other days so I'm looking for something no further than 30' away, I will also have a car available so public transport is not a must. \n\nIdeally I'd love to find a 1-2 bedroom apartment to rent for around 6 months initially. I like the feel of a small town with good restaurants and a fun vibe. I'd also like to be close enough to the centre of Torino (15-20' by car or public transport).\n\nI was also wondering how much I can expect to pay in things such as gas/electricity/water/internet for 1 person and if there's any extra things like council tax that I'll have to pay as a tenant. \n\nMy budget for rent+bills is around 1300€/month. \n\nThank you for your help! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ok7ya8/best_places_to_rent_for_a_30m/"
    },
    {
        "id": "1ok7ocf",
        "author": "Accprova",
        "title": "Dove fare pranzo in periodo natalizio?",
        "content": "Amici!  \nIn periodo natalizio (weekend 20/21 dicembre) devo organizzare un pranzo a Torino con dei parenti.\n\nMia moglie è straniera, e vorrei farle provare della cucina piemontese BUONA.\n\nConoscete dei posti tipici dove fare pranzo a Torino, che facciano cucina piemontese? Posti dove siete stati e che potete raccomandare.\n\nL'unico dettaglio importante è che dev'esserci parcheggio, perché alcuni parenti (noi compresi) arrivano in macchina da fuori Piemonte.\n\nMerci!\n\nEDIT: Grazie a tutti! Mi avete dato ottimi suggerimenti",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok7ocf/dove_fare_pranzo_in_periodo_natalizio/"
    },
    {
        "id": "1ok6yki",
        "author": "CheloCochelo07",
        "title": "Consigli per fare amicizia a Torino ♥",
        "content": "Ciao! Sono Marcelo, da 3/4 anni vivo a Torino, e sento di averne un giro di conosciuti molto piccolo; vorrei conoscere gente con voglia di fare qualcosa. Sono argentino, ho 24 anni, mi sono separato poco fa e mi piacerebbe fare qualcosa fuori casa. Mi piace la pallavolo, i giochi online, e per me qualsiasi tematica di conversazione e interessante, Se vuoi mi puoi scrivere direttamente al IG (@Marcheleyn) Sennó anche un comment in questo post mi piacerá leggerlo. Grazie mille comunitá!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok6yki/consigli_per_fare_amicizia_a_torino/"
    },
    {
        "id": "1ojtfsd",
        "author": "Ok_Swordfish_5870",
        "title": "barbiere torino 10€",
        "content": "Ciao! Cerco un barbiere in centro che mi tagli i capelli per 10 o max 15€  \nAvete consigli?  \nGrazie!",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1ojtfsd/barbiere_torino_10/"
    },
    {
        "id": "1okb7n1",
        "author": "Historical-Baby-6345",
        "title": "Selling 1 Golden pass to C2C festival for 31 october!",
        "content": "Hello, I sadly can't make it tomorrow because my flight tickets to Turin were way too expensive :(\n\nDM if interested! \n\nhttps://preview.redd.it/n56o4dwx9byf1.png?width=539&amp;format=png&amp;auto=webp&amp;s=92538a9975710cb129a387b1bfacaa5b3647763e\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1okb7n1/selling_1_golden_pass_to_c2c_festival_for_31/"
    },
    {
        "id": "1ok44kc",
        "author": "IlKayMosca",
        "title": "Abbonamento parcheggio Zona Lingotto",
        "content": "Ciao a tutti, volevo sapere se i parcheggi blu di fronte il centro commerciale lingotto ricadono in qualcuno degli abbonamenti relativi ai parcheggi oppure sono solamente soggetti a tariffe orarie. Chiedo perché dal sito GTT sembra non ricadano in nessuna delle zone soggette ad abbonamento ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oub3ffc5y9yf1.jpeg?auto=webp&amp;s=391bdef5be9950ad92f0a0050883130df99e9322"
        },
        "permalink": "/r/torino/comments/1ok44kc/abbonamento_parcheggio_zona_lingotto/"
    },
    {
        "id": "1ojxesk",
        "author": "nickname1917",
        "title": "Lavori per ciclabile di via FIladelfia",
        "content": "Stanno allargando la ciclabile di via Filadelfia e fin qui tutto ok (almeno per me che uso la bici). C'è un tratto di marciapiede che sarà lungo si e no 20 o 30 metri su cui stanno scavando, trapanando, dissestando, scusate non conosco i termini tecnici da 12 - DODICI - giorni lavorativi. C'è qualche esperto di lavori stradali che mi possa illuminare sui passaggi necessari, perché non capisco come mai il marciapiede è ancora distrutto e non c'è traccia della posa del nuovo asfalto (o come si chiama)... i lavori sulla via vanno infatti avanti da prima dell'estate perché per ogni tratto è così. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojxesk/lavori_per_ciclabile_di_via_filadelfia/"
    },
    {
        "id": "1ojv701",
        "author": "Cotolettadipoll0",
        "title": "halloween 2025",
        "content": "questo è il mio primissimo post su reddit e ammetto che non me ne intendo molto!! \nComunque quest’halloween dovevo fare una festa con dei miei amici, solo che ieri mi hanno balzato all’ultimo…. \nSe qualcuno ha idee o consigli su cosa potrei fare sono ben accetti!! \nIn generale volevo passare una serata diversa non fare il solito giro in centro (non so se ci sono eventi o festini dove posso aggiungermi all’ultimo) ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ojv701/halloween_2025/"
    },
    {
        "id": "1ojv45p",
        "author": "_L_-",
        "title": "Escursioni x Via degli Dei",
        "content": "Ciao! Cerco consigli su escursioni da fare in zona in preparazione alla Via degli Dei Bologna-Firenze che vorrei fare ad aprile. \n\nNon faccio trekking e non ho nemmeno le scarpe, fisicamente sono messo bene ma non cammino spesso. \n\nMi sapete consigliare scampagnate da fare in giornata in zona raggiungibili con mezzi pubblici? \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ojv45p/escursioni_x_via_degli_dei/"
    }
]