[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p8yrhi",
        "author": "AfraidAd2805",
        "title": "è percorribile la corsia dei taxi a Torino Lingotto (stazione) ?",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xusgjm8rv04g1.png?auto=webp&amp;s=88b0edc60a2e8cfcdca460904ab687a65609a8bd"
        },
        "permalink": "/r/torino/comments/1p8yrhi/è_percorribile_la_corsia_dei_taxi_a_torino/"
    },
    {
        "id": "1p8u4jw",
        "author": "Majestic-Pain-7230",
        "title": "25, mi piacerebbe conoscere nuove persone",
        "content": "-Sì, so che siete stanchi di questi post\n\n-Sì, ci sono persone che hanno difficoltà ad avere amicizie anche in una città così grande \n\n-No, non riesco a fare amicizie con persone che incontro durante attività. Le persone vogliono fare attività e poi farsi i cazzi propri con amicizie che già hanno e non sono bravo a disturbare sconosciuti.\n\nChiariti questi punti…piacere sono un ragazzo di 25 anni che vive a Torino da qualche anno, zona nord che purtroppo non è collegata benissimo e questo non ha aiutato particolarmente la mia vita sociale dal momento che lavoro anche full time.\n\n Ho interessi molto diversi tra loro, mi piace leggere molto, principalmente filosofia e thriller, seguo diversi manga giapponesi e gioco spesso ai videogiochi, ma ho anche interessi sportivi come il basket e le arti marziali che pratico. \nNon cerco niente di complesso se non persone con cui passare del tempo a bere qualcosa e parlare di tanti argomenti diversi, quindi se qualcuno è alla ricerca di conoscenze come me si faccia pure avanti, grazie per aver letto fin qui \n\n\n",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1p8u4jw/25_mi_piacerebbe_conoscere_nuove_persone/"
    },
    {
        "id": "1p8ux3i",
        "author": "vamphorse",
        "title": "Flying into Turin? Get the right side window for an awesome view of the city.",
        "content": "If you know the city, you can distinguish pretty much every major landmark. Pista lingotto, Mole Antonelliana, Valentino, Porta Nuova and Porta Susa, Superga, all major Piazze...  Cool both by day and night.  \n\nOn the other hand, if you take the left window, you'll have a nice view of the Alps.\n\nSource: my experience from countless landings on the city. Not once has the plane taken a different approach to Caselle Airport. My guess is the Alps make it so that the wind direction is constant (?).",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1p8ux3i/flying_into_turin_get_the_right_side_window_for/"
    },
    {
        "id": "1p8scac",
        "author": "stormjena_",
        "title": "ZTL Torino – rischio multa? Tempi di arrivo e come verificarla online?",
        "content": "Ciao :)\n\nScrivo perché stamattina (venerdì 28 novembre) verso le 9:00 sono passato in auto in questo tratto del centro di Torino (screenshot allegato). Non sono residente e mi sono accorto solo dopo che probabilmente si tratta di una ZTL, perché ho visto le videocamere.\n\nPurtroppo ho spesso problemi con la posta: il postino fa fatica a trovare il mio indirizzo e ho sempre il timore che eventuali notifiche non mi arrivino.\n\nVolevo chiedervi:\n\n- questo tratto è effettivamente ZTL attiva alle 9 del mattino?\n\n- le telecamere funzionano e le multe vengono controllate regolarmente?\n\n- in genere dopo quanto arriva la notifica a casa?\n\n- esiste un portale ufficiale o un modo online per verificare se è stata registrata un’infrazione, prima che arrivi la raccomandata?\n\n- a quanto ammonta più o meno una multa ZTL a Torino? Leggo tra gli 80 ed i 100 euro :(\n\nGrazie mille a chiunque avrà voglia di rispondere, mi aiuterebbe a capire come regolarmi e a evitare problemi con la consegna della posta 🙏",
        "upvotes": 2,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w2l4z2ccez3g1.jpeg?auto=webp&amp;s=10ed22cffefa5ade0c9fd927c0c207ee1efb8724"
        },
        "permalink": "/r/torino/comments/1p8scac/ztl_torino_rischio_multa_tempi_di_arrivo_e_come/"
    },
    {
        "id": "1p8zjru",
        "author": "GiuseppeAlletto",
        "title": "Torino ❤️✨ e la sua bellezza immortale - Giuseppe Alletto art and travel",
        "content": "Torino ❤️✨   \nUn giro nella storia dei Savoia con testi scritti a mano introvabili e reperti preziosi. 📚🌃   \n  \nAl centro delle nostre raccolte spunta un codice francese del Quattrocento, copiato in corsivo semigotico con iniziali lavorate con cura: centoquindici pagine che narrano le radici di Casa Savoia fino ad Amedeo VI.   \n  \nTra i pezzi più belli sta la Historia di Torino (1676) di Giovanni Andrea Pauletti, uno storico e custode di archivi da Padova che finì arrestato come informatore di Carlo Emanuele II. Un volume raro che mostra una Torino diversa, quando il regno sabaudo contava ancora poco in Europa.   \n  \nEccezionale pure la mappa della Fortezza di Torino che si trova nel Ragguaglio istorico dell’assedio e liberazione del 1706, opera di Francesco Antonio Tarizzo, chi scrisse anche la famosa poesia in piemontese L'arpa dëscordà.   \n  \nConclude il percorso il vasto Fondo Claretta, l'insieme dei materiali raccolti dall'instancabile studioso di Torino Gaudenzio Claretta, che custodì la memoria del territorio e scrisse molti lavori, come il noto libro sul Comune di Torino durante la peste del 1630.   \n  \nUn affascinante viaggio nella vecchia Torino, tra fatti, racconti e documenti che ancora oggi definiscono chi siamo. ✨   \n  \n[\\#torino](https://www.youtube.com/hashtag/torino/shorts) [\\#storiaditorino](https://www.youtube.com/hashtag/storiaditorino/shorts) [\\#torinocentro](https://www.youtube.com/hashtag/torinocentro/shorts) [\\#piazzacarignano](https://www.youtube.com/hashtag/piazzacarignano/shorts) [\\#torinobynight](https://www.youtube.com/hashtag/torinobynight/shorts) [\\#torinostorica](https://www.youtube.com/hashtag/torinostorica/shorts) [\\#savoia](https://www.youtube.com/hashtag/savoia/shorts) [\\#casasavoia](https://www.youtube.com/hashtag/casasavoia/shorts) [\\#piemonte](https://www.youtube.com/hashtag/piemonte/shorts) [\\#piemontedalvivo](https://www.youtube.com/hashtag/piemontedalvivo/shorts) [\\#piemontedavivere](https://www.youtube.com/hashtag/piemontedavivere/shorts) [\\#visititalia](https://www.youtube.com/hashtag/visititalia/shorts) [\\#italia](https://www.youtube.com/hashtag/italia/shorts)🇮🇹 [\\#norditalia](https://www.youtube.com/hashtag/norditalia/shorts) [\\#instapiemonte](https://www.youtube.com/hashtag/instapiemonte/shorts) [\\#torinocittà](https://www.youtube.com/hashtag/torinocitt%C3%A0/shorts) [\\#torinopics](https://www.youtube.com/hashtag/torinopics/shorts) [\\#bookstagramitalia](https://www.youtube.com/hashtag/bookstagramitalia/shorts) [\\#culturaitaliana](https://www.youtube.com/hashtag/culturaitaliana/shorts) [\\#patrimoniostorico](https://www.youtube.com/hashtag/patrimoniostorico/shorts)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IPQpgpPN8CqF0YAtW6-deFb2TXiMrhVuXwfX0KFqJys.jpeg?auto=webp&amp;s=46f515ca60abd1b47dce1c6485193a5d9c9e0923"
        },
        "permalink": "/r/torino/comments/1p8zjru/torino_e_la_sua_bellezza_immortale_giuseppe/"
    },
    {
        "id": "1p8ozor",
        "author": "PlatanoThorn69",
        "title": "Pareri palestre",
        "content": "Ciao a tutti! \nQuali sono le migliori palestre a Torino e dintorni? Stavo pensando di iscrivermi alla FitActive che aprirà l'anno prossimo a Borgaro, ma mi piacerebbe avere un parere generale di qualcuno, grazie",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p8ozor/pareri_palestre/"
    },
    {
        "id": "1p8qgdw",
        "author": "CakeProper4562",
        "title": "Luci Sfatte di Natale",
        "content": "Local di Torino vi chiedo semplicemente se secondo voi l’opera sia completata o ci saranno nuovi sviluppi 😅",
        "upvotes": 2,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ga3q2e3usy3g1.jpeg?auto=webp&amp;s=b17525c26b541bc4d45856670089a9221f80c605"
        },
        "permalink": "/r/torino/comments/1p8qgdw/luci_sfatte_di_natale/"
    },
    {
        "id": "1p8cf87",
        "author": "gioorgis",
        "title": "Nuove conoscenze",
        "content": "Ciao sono una ragazza di 28 anni, trasferita da poco a Torino e come molti quì sto facendo veramente tanta fatica a conoscere persone più o meno della mia età con cui fare \"amicizia\" e organizzare qualcosa\nAnche solo una passeggiata/un aperitivo/una serata \nSe qualcun altro si trovasse nella mia situazione e avesse voglia di uscire con qualcuno di nuovo, non esitate a scrivermi :)",
        "upvotes": 16,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1p8cf87/nuove_conoscenze/"
    },
    {
        "id": "1p8wdn8",
        "author": "sousou4893",
        "title": "Altri imprenditori di Torino: per voi quanto conta il supporto post-lancio quando affidate lo sviluppo di un progetto?",
        "content": "Ho avviato da poco una mia attività (completamente online) qui a Torino e, non avendo un team IT interno, ho dovuto esternalizzare tutto lo sviluppo ad un’agenzia ( [https://www.huulke.com/](https://www.huulke.com/) ).\n\nLa localizzazione non era un problema, ma cercavo un partner che non si limitasse a consegnare il progetto e basta. Volevo qualcuno disponibile per il lungo termine, per gestire manutenzione, aggiornamenti e i problemi che inevitabilmente saltano fuori.\n\nAlla fine questa esigenza di supporto continuativo è stata un criterio di scelta fondamentale per me. Volevo evitare di ritrovarmi con un prodotto \"chiuso\" e nessuno a cui rivolgermi per le modifiche necessarie.\n\nPer chi ha già fatto una scelta simile: quanto è stato decisivo il supporto post-lancio? Vi siete trovati a dover richiedere spesso interventi, correzioni o aggiornamenti dopo il collaudo iniziale? Col senno di poi, dareste più peso a questo aspetto o pensate che una volta consegnato, si possa cambiare fornitore senza troppi problemi?\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2U5nx1heoipUQV4JRKVXuwgmNmXFpZIuDdpI1l_9vn0.png?auto=webp&amp;s=f9da22dc08e1255e929a21f40189247411384b8b"
        },
        "permalink": "/r/torino/comments/1p8wdn8/altri_imprenditori_di_torino_per_voi_quanto_conta/"
    },
    {
        "id": "1p8rce5",
        "author": "nagavasa",
        "title": "Amazon Q Developer Coding Challenge 1 dicembre",
        "content": "Ciao, segnalo un evento che ho trovato su meetup e potrebbe interessare a chi lavora o smanetta nel mondo dello sviluppo software\n\nLunedì 1 dicembre, dalle 17:00 alle 19:30, al Consorzio TOP-IX in Via Maria Vittoria 38 ci sarà la Amazon Q Developer Coding Challenge, organizzata dall’AWS User Group di Torino\n\nÈ una sorta di mini-sfida tecnica a tema AI su Amazon Q, pensata per sviluppatori o curiosi del settore",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p8rce5/amazon_q_developer_coding_challenge_1_dicembre/"
    },
    {
        "id": "1p8clhf",
        "author": "asilorepublic95",
        "title": "Fare benzina",
        "content": "Ma quando si fa benzina ,per pagare lo si fa al totem dove selezioniamo la pompa o bisogna pagare alla cassa dentro del negozio ( quando c'è) ... sto prendendo la patente e a volte vedo che si paga alla cassa e altre volte al totem...quindi ogni benzinaio è differente ?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p8clhf/fare_benzina/"
    },
    {
        "id": "1p8l72y",
        "author": "Ok-Mouse-7256",
        "title": "Online or Presencial?",
        "content": "The TIL, test of admission to PoliTo of Turim have a online test?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p8l72y/online_or_presencial/"
    },
    {
        "id": "1p7ycho",
        "author": "vamphorse",
        "title": "Dibatito sui semafori ripetitori a Torino",
        "content": "Visto il dibattito di questa settimana sui semafori ripetitori a Torino, volevo aggiungere un altro esempio che non ho mai capito.\n\nPremetto che sono completamente d’accordo con quanto scritto da\nu/dave-lon nel suo [post](https://redd.it/1p6l3ca) di ieri, anche riguardo al fatto che l’articolo 41, comma 11 del Codice della Strada non si applichi ai ripetitori, perché il semaforo a cui fa riferimento non riguarda chi ha già impegnato l’incrocio con il verde, per esempio in caso di svolta a destra, ma è rivolto a chi, dall’altra parte della strada, deve ancora entrare nell’incrocio.\n\nVorrei però portare un esempio che continuo a non comprendere: Piazza Sabotino. Ci sono tre semafori indicati nell’immagine. I semafori 1 e 3 sono chiari, con la relativa striscia di arresto. Ma il numero 2, cosa fa esattamente? Diventa rosso quando il semaforo pedonale torna verde, quindi sembrerebbe un semaforo dedicato a dare precedenza ai pedoni, ma non ha alcuna striscia di arresto. Dunque è un ripetitore? E di cosa, del semaforo 1 che si trova cento metri prima, dall’altra parte della piazza? Se ti trovi al semaforo 1, il numero 2 non lo vedi nemmeno. La stessa situazione si trova anche dall'altre parte della piazza, nel senso di marcia opposto.\n\nNon riesco a darmi una spiegazione. Voi come la vedete?",
        "upvotes": 22,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oqniz918ur3g1.png?auto=webp&amp;s=9e22d469c0c575524d28a1348742782a08d97172"
        },
        "permalink": "/r/torino/comments/1p7ycho/dibatito_sui_semafori_ripetitori_a_torino/"
    },
    {
        "id": "1p8f0c4",
        "author": "Famous-Print7360",
        "title": "Consigli per trovare alloggio",
        "content": "Buongiorno,\nSono un neolaureato e ho intenzione di venire a lavorare a Torino. Allora inizio la ricerca di un alloggio. Avete qualche sito di monolocali/affitti condivisi a Torino da consigliarmi? (Troppa paura delle truffe).\nQuali zone della città pensate siano le migliori o da evitare?\nGrazie per le risposte",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p8f0c4/consigli_per_trovare_alloggio/"
    },
    {
        "id": "1p87tzz",
        "author": "fratifresh",
        "title": "Looking for language exchange/meeting new people",
        "content": "Hi everyone!\n\nI'm an Italian student in my first year of Economics and Finance here in Turin. \nI'd love to meet new people in the city, especially international students or anyone who's up for a language exchange.\n\nI’m looking to improve my English, and I’m also really interested in learning new languages (especially Russian and French).\nIn return, I can help with Italian (and I’m always down for a coffee ☕).\n\nIf you're interested in language exchange, meeting up sometimes, or just chatting, feel free to reach out!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p87tzz/looking_for_language_exchangemeeting_new_people/"
    },
    {
        "id": "1p7ykf2",
        "author": "nicco_lo",
        "title": "Posti per mangiare a torino senza spendere le madonne",
        "content": "Ciao a tutti, sono a torino da poco e sabato verrà a trovarmi un mio amico. Vorrei portarlo a mangiare qualcosa magari di tipico ma non vorrei arrivare a spendere un rene, diciamo non oltre i 100 euro totali, meglio ancora dentro gli 80. Grazie!",
        "upvotes": 8,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1p7ykf2/posti_per_mangiare_a_torino_senza_spendere_le/"
    },
    {
        "id": "1p7ztyy",
        "author": "gh0stxfyou",
        "title": "posti abbandonati",
        "content": "ciao \nsto cercando dei posti abbandonati per girare un cortometraggio vicino a TORINO e provincia, avete idea di dove posso andare?",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1p7ztyy/posti_abbandonati/"
    },
    {
        "id": "1p7xznh",
        "author": "Powerful-Ostrich-120",
        "title": "Con la nuova Fiat 500 Ibrida, a Mirafiori torna il secondo turno: l'annuncio di Filosa",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XihZr11-Gr5q7LiszWR2WlB67q-n1ybaOVwdE-tcsc0.jpeg?auto=webp&amp;s=6a2c55e8e07ac205dbbd7884800143fb1124f43d"
        },
        "permalink": "/r/torino/comments/1p7xznh/con_la_nuova_fiat_500_ibrida_a_mirafiori_torna_il/"
    },
    {
        "id": "1p7xbk7",
        "author": "HermitCup",
        "title": "Palestra con piscina a buon prezzo",
        "content": "Per via di una condizione medica devo incominciare a fare attività fisica e la dottoressa a indicato il nuoto come l'opzione migliore, ma purtroppo non so nulla delle palestre qui a Torino e se c'è qualcuno che può darmi qualche dritta su questo campo gli sarei molto grato🙏",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p7xbk7/palestra_con_piscina_a_buon_prezzo/"
    },
    {
        "id": "1p7xuxu",
        "author": "DPPenjoyer18",
        "title": "Dove parcheggiare nel periodo natalizio?",
        "content": "Salve a tutti. Dato che nel periodo natalizio dovrò lasciare la macchina qui, dove potrei parcheggiarla per non lasciarla ferma in mezzo la strada? Si tratterebbe solo di 5 giorni e non vorrei spendere troppo.\n\nGrazie ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p7xuxu/dove_parcheggiare_nel_periodo_natalizio/"
    },
    {
        "id": "1p803mm",
        "author": "Famous_Steak7354",
        "title": "Palestre Bodybuilding torino e dintorni",
        "content": "Ciao a tutti!  \nSto cercando palestre ben attrezzate con tante macchine professionali tipo Panatta, Hammer Strength e simili. Qualcuno sa consigliarmi qualche palestra con una bella sala pesi ricca di questi macchinari? Grazie mille!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p803mm/palestre_bodybuilding_torino_e_dintorni/"
    },
    {
        "id": "1p7z18a",
        "author": "minidonnie",
        "title": "Cerco modell* o aspiranti per model test 📸",
        "content": "Cerco modell* e aspiranti tali a 📍Torino per dei model test per aggiornamento portfolio\nSe sei un aspirante e non sai da dove iniziare io posso fornire tutto il necessario per iniziare a lavorare come modelli\nDm su IG se interessati (@viaggiovisivo.ph)\nPortfolio: https://viaggiovisivo.mypixieset.com/",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p7z18a/cerco_modell_o_aspiranti_per_model_test/"
    },
    {
        "id": "1p7xr59",
        "author": "insearch4sunrise",
        "title": "parcheggio aereoporto Caselle: check-out dopo la data prenotata",
        "content": "Mi sono reso conto che ho fatto la prenotazione del P-A \"Sosta lunga\" per meno giorni di quelli che effettivamente mi servono; non posso più modificarla ma solo annullarla (ma non lo faccio sapendo che a ridosso delle Feste è impossibile trovare disponibilità). Pagherò l'extra-sosta, ovviamente.  \nPossono mica farti multe o rimuoverti l'auto? Non ho esperienza precedente di parcheggio lì",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p7xr59/parcheggio_aereoporto_caselle_checkout_dopo_la/"
    },
    {
        "id": "1p7f06h",
        "author": "dathena649",
        "title": "Help with rent problems",
        "content": "My friend who is EU is an international student in politecnico. He managed to get a flat but he wanted to register residency in Italy for tax purposes. When this was raised with the landlord to provide a contract for residency, landlord became agitated and asked him to leave the flat immediately. He is trying to look for a place who has the contract that can be used for residency, but no one is accepting. They only have contract but not for residency purposes. What is the deal with that? Why is it so difficult to get a place that can be used for residency purposes??\n\nHe’s worried he will be homeless. Any advice appreciated.",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1p7f06h/help_with_rent_problems/"
    },
    {
        "id": "1p7bf4j",
        "author": "Arel45",
        "title": "Cinema in lingua originale con sub in inglese",
        "content": "Ciao, sto cercando un cinema a Torino che proietti i film in lingua originale (inglese) con sottotitoli necessariamente in inglese. Finora sono riuscito a trovare solo cinema che programmano dei film in lingua originale ma con sottotitoli in italiano, sapete se ce n'è qualcuno che li abbia in inglese? ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p7bf4j/cinema_in_lingua_originale_con_sub_in_inglese/"
    },
    {
        "id": "1p77s4o",
        "author": "whateverguy59",
        "title": "Where can I find a barber/salon that cuts long hair on men?",
        "content": "Anyone know any good barber that specializes in long haired men? I am just trying to get the sides around the ears cleaned up a bit and not touch the length much, don’t want some idiot to fuck it up.\n\nGrazie! Sorry for the lack of Italian in this specific post. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p77s4o/where_can_i_find_a_barbersalon_that_cuts_long/"
    },
    {
        "id": "1p7kr25",
        "author": "torinoverdcioccbianc",
        "title": "Torino meet up",
        "content": "Ciao meet up Drosso adesso party",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p7kr25/torino_meet_up/"
    },
    {
        "id": "1p7ijuw",
        "author": "TroubleDesigner5441",
        "title": "Psicoterapeuta a Torino",
        "content": "Ciao! \nMi consigliate psicoterapeuti bravi donne a Torino che adottino tariffe agevolate? (50 a seduta o meno)? \nE se siete a conoscenza degli orientamenti, mi sapreste consigliare qualcuno che segue orientamento psicoanalitico / psicodinamico \n\nGrazie!! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p7ijuw/psicoterapeuta_a_torino/"
    }
]