[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 70,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lnrhna",
        "author": "antonia71007",
        "title": "a few takes of mine from the poop cruise documentary (this has definitely been talked about before but idc)",
        "content": "first of all, the guy with the glasses and the bachelorette party were so goddamn annoying. i’m pretty sure the guy cared more about his father in law than the cruise. now i get that shitting in a bag isn’t nice, but wanna know what’s worse? walking around ankle deep in other people’s piss and shit, or shitting on top of someone else’s layered shit. they were clearly all so privileged to act like that. and then they were all disgusted when the piss and shit got everywhere. who’s fault was that? yours for not using the damn bags and continuing to use the toilets. \n\nsecondly, who thought it was a good idea to open the bar? that was really stupid, they were obviously gonna go crazy. and then they were surprised when it turned into a poop deck frat party? like what did you expect?? theyve been stuck there for 4 days.\n\nthirdly, i felt bad for the dad. he was recently divorced and just wanted to have a good time with his daughter, and that was what happened, and he felt like he had failed. at least they still go on cruises together \n\nand obviously, i was dying laughing everytime the indian chef came on screen. when he was talking about someone throwing the shit bag and hitting someone else, i was rolling\n\nthat’s it folks. thanks for coming to my ted talk",
        "upvotes": 211,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrhna/a_few_takes_of_mine_from_the_poop_cruise/"
    },
    {
        "id": "1ln8s7l",
        "author": "Jumpy-Purple7593",
        "title": "What’s a hidden gem on Netflix that you always recommend but no one ever seems to watch?",
        "content": "We all have that one show or movie we loved on Netflix, the one you tell people about constantly, but for some reason, nobody ever seems to give it a shot. Mine is “The OA” ,weird, emotional, and absolutely brilliant. Every time I recommend it, people nod politely and go right back to rewatching The Office for the 6th time. So let’s hear it: what’s your underrated favorite? Could be a foreign film, a forgotten limited series, or a random docuseries that blew your mind. ",
        "upvotes": 1313,
        "comments": 1409,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8s7l/whats_a_hidden_gem_on_netflix_that_you_always/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lntmmm",
        "author": "picantepepper1",
        "title": "Someone Feed Phil Appreciation Post",
        "content": "This new season made me compelled to write this : I do hope he is a good person IRL, but wow, watching this show makes me feel really touched by the small gestures he does throughout the trips to these different countries. \n\nYes, the family connection is there with his wife, his kids, his brother, and previously his parents (RIP). He's been able to pivot to \"Jokes for Max\" in a really heartwarming way. \n\nBut there are two points I want to emphasize:\n\n1). How in recent seasons when he is traveling he is very conscious to discuss the societal issues and humanitarian efforts going on in all of these countries/cities. It might feel heavy handed at times, but it is the minimum he can do to raise awareness for good causes.\n\n2). How he treats the people he works with and the people he cares about. Almost always in each episode he has a scene where he's having the camera crew getting in on trying the food, too. He will typically treat the local fixers to meals which reinforces this as well. But most of all what I thought was touching this season were his personal stories with his dad's Filipino nurse and his Guatemalan nanny - how he went out of his way to honor them during these journeys. \n\nCombined to me shows someone who cares for his staff no matter how long you worked for him. Feeling like the Everybody Loves Raymond royalties are doing a bit of good in their afterlife. \n\nPhil if you see this, I love ya. \n\n",
        "upvotes": 33,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lntmmm/someone_feed_phil_appreciation_post/"
    },
    {
        "id": "1lo0aj7",
        "author": "Exzstence",
        "title": "Video games?",
        "content": "Why does Netflix not get that no one wants to play video games from Netflix? Why does it keep pushing this? I see GTA San Andreas every day on my homepage as if I did not play that game 15 years ago. People who play video games certainly would never use Netflix to do it. PlayStation and Xbox, etc, are the preferred options for that. Netflix should stay with movies and shows.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0aj7/video_games/"
    },
    {
        "id": "1lo25xa",
        "author": "micheal-in-the-bath",
        "title": "Redrawing a deleted concept from K-pop Demon Hunters",
        "content": "I haven’t watched this movie yet but it was all over my page on instagram, so I kinda know the storyline and characters. I just saw this art concept and THEY WERE SUPPOSED TO KISS 😭😭😭 Gotta say we were absolutely ROBBED. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lo25xa/redrawing_a_deleted_concept_from_kpop_demon/"
    },
    {
        "id": "1lnxtiv",
        "author": "kathi182",
        "title": "Poop Cruise questions..",
        "content": "All apologies if this has been asked already, but it’s driving me nuts- they say all electricity immediately shut off, but how did the key cards keep working to allow people into their rooms…and how were they able to continuously make announcements over the PA system? Don’t these systems require electricity?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lnxtiv/poop_cruise_questions/"
    },
    {
        "id": "1ln7niq",
        "author": "zentyme_",
        "title": "Squid Game: Season 1 vs Seasons 2-3",
        "content": "",
        "upvotes": 212,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1ln7niq/squid_game_season_1_vs_seasons_23/"
    },
    {
        "id": "1lnx5vp",
        "author": "44cody44",
        "title": "Love, Death, and Robots",
        "content": "I need to express my love/appreciation for this series. \n\nSome have described it as a black mirror for teenagers. And I have to respectfully disagree; as I find that statement extremely reductive and disrespectful to the show. It insinuates that the show is juvenile and lacks depth. \n\nholy cow! Does this show stand on its own. Perhaps it’s the fact that it is animated/CGI mostly, or that most episodes are 10-15 min. \n\nI’ve now seen most of the top rated episodes, and I’m thoroughly impressed. To say the least. \n\nThis series is a thousand things all at the same time. Shocking, Sexy, Violent, Mysterious, And even Comical.\n\nI haven’t heard much about it. And I only checked it out because of an instagram reel. But I’m glad I went down the rabbit hole. \n\nDo yourself a favor and watch the top 10 highest rated episodes on IMDB. You’ll thank me later. I’m sure. \n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnx5vp/love_death_and_robots/"
    },
    {
        "id": "1lo0rf2",
        "author": "kwaka300",
        "title": "Layout",
        "content": "This new layout is really winding me up making me not want to use Netflix. It’s so much clunkier and a slog to navigate. The expansion of thumbnails is overbearing and in your face, bring back the old one asap. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0rf2/layout/"
    },
    {
        "id": "1lo0m9x",
        "author": "Hopeful-Flamingo-145",
        "title": "Favourite tv show recommendations",
        "content": "What's ur favourite tv show recommendations like stranger things, fubar, OBX, dexter and more. It seems like all shows now suck. Im looking forward to hearing ur guys' responses ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0m9x/favourite_tv_show_recommendations/"
    },
    {
        "id": "1lo0l0w",
        "author": "LiteratureTough7727",
        "title": "Anyone else hate the imposed gaming in Netflix?",
        "content": "I hate everytime it asks me to try out a game, or suggest games again and again. It is super annoying and not the experience I presumably paid for.   \n\n  \nI haven't come across a single person who plays on netflix. Do you guys do? What do you find interesting? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0l0w/anyone_else_hate_the_imposed_gaming_in_netflix/"
    },
    {
        "id": "1lo0a76",
        "author": "Samadissad",
        "title": "Netflix downloads on add plan",
        "content": "Hello I just wanted to ask when I download on an add plan does it do the whole series and count as one of my 15 downloads or 1 episode that counts as 1 download. So then would it just be better for me to download movies? \n\nPlease help!!!\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lo0a76/netflix_downloads_on_add_plan/"
    },
    {
        "id": "1lnrdlf",
        "author": "randomuser_q12",
        "title": "What do you want to see on Netflix and what needs to come back?",
        "content": "I remember a few years ago they had the original twilight zone. I’m an old fashioned girly that loves her twilight zone and I want it to come back! But I’m very happy to see they have Alfred Hitchcock’s movies. I would love to see more Asian horror movies like my favs a tale of two sisters, juon series, and ringu. I don’t know if those were ever on Netflix but I hope to see it there one day!",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrdlf/what_do_you_want_to_see_on_netflix_and_what_needs/"
    },
    {
        "id": "1lnybrw",
        "author": "DentistFlashy6030",
        "title": "Extra Members with Premium?",
        "content": "Hi I pay for Netflix Premium and according to the Account &gt; Membership tab in my account, I should be getting 2 extra members 'for an additional $8.99/mo' which I am currently paying.\n\nThe problem is it's only allowing me 1 member. There's another slot that says '1 slot available' however there's no button or option to add a person, the only clickable button is 'Buy another slot' which is charging me ANOTHER $8.99 for that second member. \n\nIs anyone else running into this issue? It seemed to have just started today or recently. Up until now I've had 2 members without a problem, but now it's only showing one and the second one costs extra, although it's stating i get 2 extra members with my current tier. HELP!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnybrw/extra_members_with_premium/"
    },
    {
        "id": "1lnxvnl",
        "author": "jamieaugustine25",
        "title": "I love the Mingle scene in squid game",
        "content": "I think it’s my favorite game scene in the show, down to the way it’s filmed and the design of the game itself. The frantic, quick music represents the atmosphere and the blinking lights add to the atmosphere of panic. With an extremely time limit, hoards of people and a need for face paced decision making, the game really brings out the worst and shows what people will do when placed under high stress situations. I know that’s what most of the games are supposed to do, but this one just makes it better because when placed in a situation like this where everyone is yelling, people make decisions that might not be what they would usually do, but what they need to survive. I don’t know if this makes any sense, I just needed to rant.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnxvnl/i_love_the_mingle_scene_in_squid_game/"
    },
    {
        "id": "1lnm2ah",
        "author": "mmmadness",
        "title": "'KPop Demon Hunters' Review: Sony Animation's Stunning Animated Musical Slays Demons and Serves K-Pop Realness",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnm2ah/kpop_demon_hunters_review_sony_animations/"
    },
    {
        "id": "1lnx7sk",
        "author": "barneylerten",
        "title": "Is 'The Secret Agent' on Netflix or not?",
        "content": "Hi there! So several online articles said it was added on Friday, praised the 2016 3-part series 'The Secret Agent' - but we just searched Netflix every which way and couldn't find it, with or without the 'The.' Maybe it takes time to show up?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lnx7sk/is_the_secret_agent_on_netflix_or_not/"
    },
    {
        "id": "1lnwyau",
        "author": "richardgnz",
        "title": "5.1 / Atmos audio Issues with Netflix on fresh Windows install",
        "content": "Just wanted to share my findings with the issues regarding 5.1 sound on a fresh install of Windows version 24H2.\n\nI had the Dolby Access app installed, it detected my amp and said everything was fine. In Windows sound settings - everything was detected fine with \"Dolby Access for Home Theatre\". Local files were fine playing Dolby Atmos with MPC-HC or VLC but any streaming platform would not work. I would only get \"Spatial Audio\" which was nothing other than Stereo when played through my amp.\n\n**The problem:**\n\nIf you do a **fresh/clean** install of Windows 11 24H2 (Upgrading from previous versions will **not** have the issue) then you will be missing the AC-3 (\"Dolby Digital\") codec as per the following article.\n\n**The cause:**\n\n[https://support.microsoft.com/en-us/windows/codecs-in-media-player-d5c2cdcd-83a2-4805-abb0-c6888138e456](https://support.microsoft.com/en-us/windows/codecs-in-media-player-d5c2cdcd-83a2-4805-abb0-c6888138e456)\n\n**The fix:**\n\nDownload these and install - restart your system. You will now have 5.1 / Atmos support in streaming platforms - Netflix / Edge / Disney+ etc....\n\n[https://www.majorgeeks.com/files/details/dolby\\_ac\\_3ac\\_4\\_installer.html](https://www.majorgeeks.com/files/details/dolby_ac_3ac_4_installer.html)\n\nThis really needs to be addressed by Netflix - Microsoft no longer provide the codec required for Netflix to use 5.1 sound in Windows.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnwyau/51_atmos_audio_issues_with_netflix_on_fresh/"
    },
    {
        "id": "1lnn2l1",
        "author": "wijnandsj",
        "title": "any way to get rid of the mobile games in my view?",
        "content": "It's really rather annoying all those games I'm never going to play and have 0 interest in. Can it be removed from the app/site in any way? Or is this unavoidable?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnn2l1/any_way_to_get_rid_of_the_mobile_games_in_my_view/"
    },
    {
        "id": "1lmzrmi",
        "author": "chrisarrant",
        "title": "[News] Netflix's The Sandman was hoped to run for four seasons... but then they re-read the comic, and decided to end it at two",
        "content": "",
        "upvotes": 153,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzrmi/news_netflixs_the_sandman_was_hoped_to_run_for/"
    },
    {
        "id": "1ln8xoj",
        "author": "randomuser_q12",
        "title": "What is a Netflix show you wish had another season?",
        "content": "Ugh I miss the show Ju-on origins. It only had 1 season but the show was sooo intense and disturbing. I wish so much this show would come back to Netflix but I’m sure it won’t it’s been like 5 years 😭",
        "upvotes": 23,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8xoj/what_is_a_netflix_show_you_wish_had_another_season/"
    },
    {
        "id": "1lntwo2",
        "author": "ihsjsbs",
        "title": "Same account different movie selection between profiles",
        "content": "So  I have multiple Profiles on my Netflix most of them the setting language is German but mines is English. Now I saw a movie on my Profil and wanted my sister to see the movie also but she couldn't find the movie on her Profil it was only shown on my Profil. Is it because of the setting language ? Because the movie was not in German and didn't have German subtitles ? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lntwo2/same_account_different_movie_selection_between/"
    },
    {
        "id": "1lmswi4",
        "author": "pnut88",
        "title": "Has anyone else watched and fell in love with Dept. Q? Man i thought this show was great!",
        "content": "The build up, the mystery, the acting. All if it. I thought it was superb. Highly recommend if you haven't seen it yet! Any news on if it has a season 2 in the works? Would love to watch another crime!",
        "upvotes": 266,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1lmswi4/has_anyone_else_watched_and_fell_in_love_with/"
    },
    {
        "id": "1lntcad",
        "author": "PhoneFrequent8459",
        "title": "My overall thoughts on squid game s3 and why it didn't resonate with me",
        "content": "\n\nIt kinda felt off.\n\nFirst of all, Gi-hun killing Dae-ho made no sense, him not even regretting it and then going back to his “I’m not evil like them” persona when he was tested on whether he would kill the other contestants before the final game. Like obviously, he is kinda like them. He just killed a dude who literally did nothing wrong and who was crying and saying “sorry”. Literally killed him with his bare hands. Bye. And then he refuses to kill the front man or the other players before the final game (who are actually bad people and did commit clod blooded murder multiple times and were planning on killing a BABY). no instead he goes after the one guy who actually wanted to help him but physically and mentally couldn't anymore. I get that Gi Hun wasnt really in the right state of mind but them attempting to go back to: oh gi hun you're actually a good person your not evil and you have principles'?? Like no he doesn't, it just felt so hypocritical to me. \n\nThis show keeps killing every character, and too many characters too soon, where just the most useless characters were left (I’m looking at you, Player 100). So the last episode didn't really have any high stakes in my opinion and didn't feel that intense. \n\n\nAlso, Player 333—what happened there? I know he was a shitty person, and I was okay with exploring that side of him, but we never really got an explanation or build-up to why he’s actually this psychotic, to the point that he was willing to sacrifice his own baby. Like what? That came out of nowhere?? Needed better writing so we could understand what was even happening.\n\nI liked Gi-hun’s last words, but that’s about it in terms of what I liked about the ending. So many things didn’t make sense— Jun ho literally circling the island for what felt like an eternity just to shout “WHY” to his brother and watch him go up and down a platform (not gonna lie, that was kinda funny). Like what was the point of that storyline? I’m just so confused. The Front Man is still out there thriving, but In ho just doesn’t care anymore? Bro moved on—maybe he got sea sick \n\nThe Front Man literally had no screen time and wasn’t affected by ANYTHING that happened. He was just so nonchalant about it, like it’s a regular workday (probably is). But like, come on, dude.\nAlso literally no confrontation between front man and Gi hun?? What was all that build up in s2 for? Why wasn't there any conversation? Gi Hun literally just walked it off lmao he wasn't even mad about the betrayal he was like alright fine bye. \n\nDo we really have any indication that the games actually stopped in South Korea? 'Cause I don’t think so. The VIPs left unaffected. Sure, the whole place burned down, but that doesn’t stop them from just finding another location or building it up again. We got no real indication that this was the end of the games in SK.\n\nGi-hun sacrificing himself for a CGI baby (okay…). I get it—this is supposed to feel realistic and mirror corruption in real life, etc.—but it just didn’t feel well-executed. The build-up was weird and disjointed. Players acted way too out of character, and it just didn’t feel satisfying. It felt rushed, like they just flipped a light switch—“okay, games are over, moral of the story is corruption will always win, and bye.”",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lntcad/my_overall_thoughts_on_squid_game_s3_and_why_it/"
    },
    {
        "id": "1lnt2tc",
        "author": "HARJAS200007",
        "title": "Solution to the Pervasive stuttering during full screen in the windows app?",
        "content": "I recently just bought a Microsoft surface pro, 11th generation. I'm attempting to watch Netflix full screen but am met with constant lagging/glitching/video stutter. Is there any solution to this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnt2tc/solution_to_the_pervasive_stuttering_during_full/"
    },
    {
        "id": "1lnt0l4",
        "author": "anarchyRozen",
        "title": "Green screen on Android",
        "content": "Hi. I generally don't watch much Netflix—my family does—but lately, I've wanted to watch some series at night before going to sleep.\nThe thing is, I've watched two episodes halfway through, and my phone always freezes and then shows a green screen in the scariest way possible (like a dying GPU), which causes the phone to shut down completely.\nWhen I turn it back on, everything is normal.\n\nThis doesn't happen with any other streaming app or video player. I can't seem to find anything about this issue—just people experiencing a green screen, but not having their phones freeze.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnt0l4/green_screen_on_android/"
    },
    {
        "id": "1lnrjnn",
        "author": "TiddybraXton333",
        "title": "I need a movie recommendation please",
        "content": "I like stuff like training day, casino, good will hunting, 4th kind , etc\n\nSomething with a long drawn out plot line and action, wittiness, and maybe some mystery/ twists and turns. \n\n\nI feel like I’ve seen everything on the app they have shown me in their shitty menu. I know they have a huge library , but most of the stuff I see keeps getting recycled into the menu option they have.\n\n\n\nCan some one throw out some low key bangers please?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrjnn/i_need_a_movie_recommendation_please/"
    },
    {
        "id": "1lnrena",
        "author": "Sk8er_Infinity",
        "title": "Shows with this style animation?",
        "content": "Okay, so shows that I know of so far with this “certain” style are Voltron, The Legend of Vox Machina, Elves: Secrets of Elvendale and Skull Island. These all have the same animation/drawing style, and I LOVE it! Does anyone know any shows that have a similar/the same type of style?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrena/shows_with_this_style_animation/"
    },
    {
        "id": "1lmulp4",
        "author": "Shoddy_Mission6702",
        "title": "Is it just me, or is Netflix's release strategy kind of ruining the hype?",
        "content": "Hey everyone,  \nI just wanted to get your take on this. Do you actually enjoy how Netflix handles its series these days?\n\nThey drop a handful of episodes—fewer and fewer —and then split the season in half, making us wait *years* to get the rest. It’s honestly driving me crazy.\n\nPersonally, I much prefer Disney+'s strategy of releasing one episode a week. It builds hype, whereas Netflix's approach kills it.\n\nLike... do they really think people still care about a show after all that time? I can barely remember what I had for lunch, let alone a series I watched ages ago.\n\nCurious to hear what you all think. Am I alone in this?",
        "upvotes": 142,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1lmulp4/is_it_just_me_or_is_netflixs_release_strategy/"
    }
]