[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 23,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lz2vux",
        "author": "PulIthEld",
        "title": "Stop showing me games, I have never interacted with one.",
        "content": "Every time I open Netflix now its some stupid game.  Why?  That's not what I go to Netflix for.  I dont want their ads blaring every time I open Netflix.",
        "upvotes": 263,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1lz2vux/stop_showing_me_games_i_have_never_interacted/"
    },
    {
        "id": "1lzoanc",
        "author": "davidilanyann",
        "title": "Does Netflix use data if I watch downloaded content while my mobile data is on",
        "content": "I don’t want to use too much data on Netflix, and I usually download content to watch while outside. Sometimes I have to turn on my mobile data because I’m waiting for a message, and I want to know if Netflix uses data in that case if the content is downloaded. Thanks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzoanc/does_netflix_use_data_if_i_watch_downloaded/"
    },
    {
        "id": "1lz3wrl",
        "author": "itsnobigthing",
        "title": "14 hour car journey; need a series that’s so addictive I’ll be glad I’m not there yet",
        "content": "Ideally seeking one of those shows where it would take a physical intervention to stop you watching the next episode. Like Severance, or early Lost, or similar.\n\nBut I’m down for pretty much anything except horror, or things about gangs of men doing crime). Just something compelling and bingeable that I haven’t seen! 🙏🏻\n\nNo subtitles pls as I get car sick if i read them\n\n\n\n",
        "upvotes": 47,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1lz3wrl/14_hour_car_journey_need_a_series_thats_so/"
    },
    {
        "id": "1lzrcai",
        "author": "strawberries189",
        "title": "Girls Incarcerated",
        "content": "Hi! Question about \"Girls Incarcerated\". In the series, there was a scene where some of the girls were doing Bible study. One of the girls asked the teacher (an older woman) about same-sex marriage, and the teacher said that it wasn't ok. Does anyone know which season, episode, and time stamp this scene occurred? Thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzrcai/girls_incarcerated/"
    },
    {
        "id": "1lzodk3",
        "author": "MamaMia1325",
        "title": "Animal Kingdom-Smurf",
        "content": "Just finished season 1 and am having trouble continuing. None of the characters are really likable at all-MAYBE J-but that's it. Smurf is pure evil and I can only take so much of her \"baby\"..can anyone relate?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzodk3/animal_kingdomsmurf/"
    },
    {
        "id": "1lzn8my",
        "author": "aim-mami",
        "title": "HELP",
        "content": "Netflix keeps asking me to add another member when I’m literally not even sharing it 😩 Why does Netflix always assume I want to add someone? I’m not even using extra devices 😭 It’s always asking me to add a member, like chill Netflix, it’s just me 😤",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzn8my/help/"
    },
    {
        "id": "1lz6nrx",
        "author": "Timely-Hovercraft-76",
        "title": "I actually enjoyed the waterfront.",
        "content": "I actually enjoyed waterfront quite a bit. I made a post about a month ago or so asking how it is and I got some mixed inputs. It took like 2 episodes to get into it but after that, I quite enjoyed it. I liked the setting, the overhead shots of the area, the action was pretty good, son was a realistic character imo, I liked seeing Holt McCallany back in action and the plot was basic in ways but easy to follow and fun to watch. It’s not ozark but it’s only 1 season compared to like 5. I would give it a 7-8 out of 10. Topher grace’s character was pretty fun as well, he’s a good actor. All in all, a pretty fun watch. ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6nrx/i_actually_enjoyed_the_waterfront/"
    },
    {
        "id": "1lzkxgt",
        "author": "Ok-Permit4862",
        "title": "Avoid Mobile number",
        "content": "I’m try to get Netflix Nigeria but it doesn’t allow me to continue as I need a Nigerian mobile number to verify. I don’t have one, is there a way around this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzkxgt/avoid_mobile_number/"
    },
    {
        "id": "1lzktpo",
        "author": "EmilyKonocti52",
        "title": "Too Much: are Will and Megan a good match?",
        "content": "I am a fan of Will Sharpe and have seen him in a number of things.  I thought Megan was good in her role in “Hacks” where she plays the dingy inappropriate personal assistant.  But I just don’t see the chemistry between them or how they could even be couple.  Her character is so awful I don’t see her having a relationship with anyone not to mention the oh so cool Will Sharpe!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lzktpo/too_much_are_will_and_megan_a_good_match/"
    },
    {
        "id": "1lzq4on",
        "author": "peoplemagazine",
        "title": "Baby Reindeer’s Richard Gadd Says Series Originally Had 8 Episodes and Explains Why He Pushed for Only 7 to Be Shown",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzq4on/baby_reindeers_richard_gadd_says_series/"
    },
    {
        "id": "1lzct7o",
        "author": "stravocadomf",
        "title": "Ziam movie",
        "content": "I’m gonna be completely honest. I love anything zombie related but MAN, this movie really let me down.\n\nFor starters you don’t even understand why this is all happening. you just just some bs infected fish plot?\n\nThen the whole movie is all plot armor. (I know I know it’s literally zombies anyways, but still). besides the main character everyone else is really annoying bahaha. \n\nI repeat: literally half this movie doesn’t make any sense. barely any context to half the stuff going on lmao. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzct7o/ziam_movie/"
    },
    {
        "id": "1lzhpn9",
        "author": "frostedbratz",
        "title": "EMOTIONAL TV SHOW FOR GENZ TEENS",
        "content": "in February this year 2025, I saw this TV show in German Language- Cassandra. It’s about the robot who got transformed from human form to robot form due to the endurance of cancer. Her past was like the source of emotional outbreaks. I cried in the end, because that show is limited series and the ending further emulsified the rollercoaster of emotions into the shed of tears. I know it’s been like what 5 months, shows like this are often forgotten, my point is that maybe if you had seen some emotional movies or tv shows, they tend to make you feel nostalgic and bizarre like whoa time’s really flown so fast. I know this is not a complete review but I believe that this is legit outright review, not complete review. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzhpn9/emotional_tv_show_for_genz_teens/"
    },
    {
        "id": "1lzhfwd",
        "author": "jonhahaha_1",
        "title": "movies keep displaying in 480p",
        "content": "Hello, I am a PC user and use Chrome primarily to watch Netflix. Some movies keep only displaying in 480p. I'm on the Netflix standard plan. I've tried restarting the browser, reloading the website, signing out and back in, switching to Microsoft Edge, and none of this has solved this issue. I've only started experiencing this issue within the last two months and it only happens with some movies while other movies will show the full 1080p. I'm also sure it's 480p because I checked using the Ctrl + Alt + Shift + D shortcut to see more information. I'm also quite certain it's not my internet as my download speed ranges anywhere from 30mbps to 120mbps. Has anyone else experienced this and/or know how to fix it?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lzhfwd/movies_keep_displaying_in_480p/"
    },
    {
        "id": "1lz7she",
        "author": "BigRecommendation709",
        "title": "Ozark?",
        "content": "What shows are similar to ozark? I really loved the plot of ozark and the characters. Since then I’ve watched the show three times. lol. Need something else.  ",
        "upvotes": 5,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lz7she/ozark/"
    },
    {
        "id": "1lzgkhv",
        "author": "randomnoob22",
        "title": "Bullet Train Explosion",
        "content": "This is honestly the best movie I’ve watched in a long time. The acting on this was insane, and the plot was deep and the tactics used in the rescue operations were crazy. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgkhv/bullet_train_explosion/"
    },
    {
        "id": "1lzfgsx",
        "author": "Xerasi",
        "title": "Netflix lowering resolution to 140P on windows in the Netflix app and Edge",
        "content": "It starts the video fine and then slowly lowers it over like a minute. I don't understand why. I have 1gig internet and connected with ethernet. It just randomly started doing this (granted I haven't used Netflix on windows in the last 6 months) but it was fine before that. netflix on my phone is fine though.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzfgsx/netflix_lowering_resolution_to_140p_on_windows_in/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 464,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1lznzwz",
        "author": "WhoisthisDlVA",
        "title": "I'm i tripping or is the movie Back In Action released around 2022 and NOT 2025",
        "content": "I literally remember watching this movie during covid i js got a netflix subscription and saw that the movie was released and honestly im 100% sure i watched it before and i remember it very well because the plot was fucking boring and ass",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lznzwz/im_i_tripping_or_is_the_movie_back_in_action/"
    },
    {
        "id": "1lzmmog",
        "author": "Affectionate_Yam4221",
        "title": "10 Netflix Original Dramas That Are Better Than They Get Credit For",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lzmmog/10_netflix_original_dramas_that_are_better_than/"
    },
    {
        "id": "1lznryf",
        "author": "MountainGOAT5671",
        "title": "Petition to turn cancelled seasons of popular Netflix shows into books",
        "content": "As the title says, getting a bit tired (and hugely disappointed) by Netflix cancelling really good shows like Everything now, kaos etc after only one season. These shows have huge potential and very creative concepts. Seriously, how am I supposed to sleep not knowing what happens to my favourite character or the cliffhangers at the end of episode eight. So, this is a petition to turn the cancelled seasons into books or graphic novel. Heck, even audiobooks works (or better yet, Netflix renews them for subsequent seasons)\n\nSincerely,\nA heartbroken fan",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lznryf/petition_to_turn_cancelled_seasons_of_popular/"
    },
    {
        "id": "1lzd3z1",
        "author": "yadayodayada",
        "title": "The alpinist not on Netflix?",
        "content": "Wasn’t the Alpinist originally on Netflix? I guess I thought it was an original but it’s not on there anymore.  I wanted to watch it. \nWhen did it leave? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzd3z1/the_alpinist_not_on_netflix/"
    },
    {
        "id": "1lzlg40",
        "author": "ThrowALifeline89",
        "title": "'Boca a boca/Kissing Game': Why didn't it take off like 'Stranger Things'?",
        "content": "I recently found this Netflix Show *Boca a boca* (or *Kissing Game* in english) and ... that show is very trippy at times - literally. But the tone is also curious because it's serious, scary, tragic and dire but then sometimes it flips and almost seems like a parody of some sort (although I have no clue what it could be trying to poke fun at). The strict school director prefers to give her intimidating monologues to nervous students while sitting on a bouncy ball? There are regularly parties happening where everyone dresses up as if the theme was \"80s disco ball room with 90s grunge and a dash of hellraiser\"? And they all kind of become temporarily bisexual for as long as the party lasts?\n\nThen there is also the \"\"cows\"\" and the romance(?) with the cowboy(?) \n\nOh, in case you have zero clue what this show (supposedly) is about: there is a village shut off from the outside world (but also not at all) and they believe in a cult that's stalking the nearby woods (yet everyone knows they exist but they're not a cult or if they are virtually nobody cares anyway \\[cuz' drugs, I guess?\\]). Suddenly a disease starts wreaking havoc on the village folks. People start getting paranoid and violent. Shady business is being conducted, lies are being spewed, deception takes place. Also, \"\"cows\"\".\n\nWhile watching all of this unfold and refold and then unfold again in front of my eyes I began wondering if this could have been another *Stranger Things*. It has peculiar tone and sense of danger with some very strong visuals (especially later on in the show). Now I'm just curious to know if there is anyone else who has watched it - if you haven't, perhaps this is exactly what you're looking for. It sure is unique, in a way.\n\nSeriously, what in the trip is this show?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzlg40/boca_a_bocakissing_game_why_didnt_it_take_off/"
    },
    {
        "id": "1lzgadk",
        "author": "thewaterboi241",
        "title": "live streaming",
        "content": "so I want to live stream Netflix for a few friends but Netflix's terms of services say that i can't legally do that without permission.\n\nSo how do I get this permission, is there a form, application, or something I fill out, to get the rights to live stream it?\n\nI'm not gaining any financial benefit to it I just want to watch movies with friends who don't live near me",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgadk/live_streaming/"
    },
    {
        "id": "1lzcgnt",
        "author": "Main-Low741",
        "title": "Can you tell which game this song is from? 🎵🌀",
        "content": "Season 3 is finally out! I’m currently watching the jump rope game. But honestly... I still think the spinning game in Season 2 was way more intense and fun to watch!\n\nhttps://reddit.com/link/1lzcgnt/video/a5nocw67ircf1/player\n\n(This song is from the Muro Box app’s library, arranged by Jeffwong.)\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzcgnt/can_you_tell_which_game_this_song_is_from/"
    },
    {
        "id": "1lzi28d",
        "author": "Foreveraudio",
        "title": "Building the band not new ? I have seen these people before",
        "content": "Iv seen this before - says new 2025 but Iv seen this before years ago so is this just new additions or where else would I have seen this djdnddndndndjdjddndnddndndndndnddjdjdj sjdndndnd",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzi28d/building_the_band_not_new_i_have_seen_these/"
    },
    {
        "id": "1lysljv",
        "author": "Thin_Smile2722",
        "title": "Need recommendations to watch",
        "content": "I am currently having free time with no pending work or anything and thinking to start a new series/movie. \n\nPs: recommend series other than squid games ",
        "upvotes": 13,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1lysljv/need_recommendations_to_watch/"
    },
    {
        "id": "1lzq0kj",
        "author": "Otherwise-Row-6154",
        "title": "Why isn't Everything on Netflix?",
        "content": "I just signed up for Netflix and I don't know how much it earns, but I'm wondering: if it's so big, why doesn't it add all the series and anime? As I said, I'm a new member and I don't know much, so please answer accordingly. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lzq0kj/why_isnt_everything_on_netflix/"
    },
    {
        "id": "1lza5tf",
        "author": "Shapeshiftergaming",
        "title": "Show \"Lost In Space\" doesn't load.",
        "content": "Whenever we try to start watching this specific show on our living room TV or one of our phones, it simply will not work and asks us to unplug our TV for 30 seconds. Yet for some reason the show will load on the TV in the bedroom. Any ideas?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lza5tf/show_lost_in_space_doesnt_load/"
    },
    {
        "id": "1lyznkg",
        "author": "doorguy8888",
        "title": "Carry-On review",
        "content": "Hello! I just watched the Carry-On movie. I just got netflix again and it was one of the first movies that popped. I was interested because I'll be flying for the first time in a couple of months, hahaha. Crazy right? Watch a movie about airport devastation before my first flight ever 😂.\n\nI saw Jason Bateman's face, and I still can't picture him as a serious role actor. I think of him more from movies like \"Office Christmas Party\" or \"Identity Thief\". Goofy movies. But he did an amazing job acting and I was thoroughly impressed.\n\nI liked the suspense that the movie carried and all the twists it presented.\n\nHave you watched Carry-On? How did you like it?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lyznkg/carryon_review/"
    },
    {
        "id": "1lyi1um",
        "author": "Beastmaster122810",
        "title": "It has no right to be as good as it is",
        "content": "",
        "upvotes": 66,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p0n96mk91kcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lyi1um/it_has_no_right_to_be_as_good_as_it_is/"
    }
]