[
    {
        "id": "1k9e4sw",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tq71ve10xfxe1.png?auto=webp&amp;s=96ca7371b36d7db51aba489b3713541d887f495e"
        },
        "permalink": "/r/movies/comments/1k9e4sw/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n**I'm a bit behind on streaming releases so here's a bunch of them from the last few weeks**\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 30,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1k9joa4",
        "author": "BunyipPouch",
        "title": "Adam Driver Praises Francis Ford Coppola For Not Letting The Money Dictate ‘Megalopolis’ At AFI Life Achievement Tribute - Filmmakers like Steven Spielberg, George Lucas, Spike Lee &amp; more were also on hand to celebrate Coppola, as well as collaborators like Al Pacino, Robert De Niro, Elle Fanning",
        "content": "",
        "upvotes": 1730,
        "comments": 179,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aDli0zqbS9vHKvTnDeh3MNFur30lDUuNGumH-2fqLic.jpg?auto=webp&amp;s=2d4a9c12b619fab3a39f57d2a0e51bb25633fefd"
        },
        "permalink": "/r/movies/comments/1k9joa4/adam_driver_praises_francis_ford_coppola_for_not/"
    },
    {
        "id": "1k9oiod",
        "author": "Prabu-Silitwangi",
        "title": "What's a trend in movies right now that you wish dies a horrible death?",
        "content": "For me it's the uninspiring use of popular songs from the 70s, 80s, 90s, but preferably nirvana. It has to be nirvana if possible. Take the hook, slow it down and drown it in a heavy reverb effects and you just created a masterpiece of cinematical background music because the young audience will think the song is cool and the older ones will like it because it's nostalgic.",
        "upvotes": 379,
        "comments": 587,
        "media": null,
        "permalink": "/r/movies/comments/1k9oiod/whats_a_trend_in_movies_right_now_that_you_wish/"
    },
    {
        "id": "1k9durl",
        "author": "BunyipPouch",
        "title": "Rosamund Pike Visits the Criterion Closet",
        "content": "",
        "upvotes": 1660,
        "comments": 274,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZlOB43vCOn_hLS0SDOdlYtgc-j5M8OOcPvxe7H0ECv0.jpg?auto=webp&amp;s=10cf6a94e644bf597ebb2187e37d7b86c0091042"
        },
        "permalink": "/r/movies/comments/1k9durl/rosamund_pike_visits_the_criterion_closet/"
    },
    {
        "id": "1k9kt2q",
        "author": "everynamecombined",
        "title": "Who is a beloved actor that you have basically, unintentionally avoided their entire acting career?",
        "content": "As I mentioned, I'm not talking about actors you just dislike and specifically won't watch a movie they're in.  I am talking about actors that you have somehow essentially avoided everything they've ever been in.  This happens quite often to me so I'd love to hear some other peoples experiences.  \n\nMy example would be, Daniel Day Lewis.  I hear he is amazing, but somehow none of his movies have found there way to me, nor have I cared to seek them out.  So I would have to watch one of his movies for the sole purpose to see Daniel Day Lewis.  Which I am open to but just haven't gotten around to it.  How bout you?",
        "upvotes": 346,
        "comments": 695,
        "media": null,
        "permalink": "/r/movies/comments/1k9kt2q/who_is_a_beloved_actor_that_you_have_basically/"
    },
    {
        "id": "1k9d75g",
        "author": "Magical_critic",
        "title": "Actors whose non-acting talents were wasted in a movie?",
        "content": "What are examples of actors who you were baffled at the fact that their non-acting talents weren't utilized at all in the movie? For me two come to mind.\n\n1. Keegan Michael Key is surprisingly great at singing and dancing but he barely got to do any singing for Wonka. \n\n2. Let me get this f*cking straight, you hire the action gods from The Raid movies to star in Star Wars The Force Awakens, yet they're only on screen for 2 minutes and you don't give them a single action scene??? The disrespect is insane",
        "upvotes": 932,
        "comments": 406,
        "media": null,
        "permalink": "/r/movies/comments/1k9d75g/actors_whose_nonacting_talents_were_wasted_in_a/"
    },
    {
        "id": "1k99vkb",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for ‘Final Destination Bloodlines’",
        "content": "",
        "upvotes": 1349,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/38zqujwk0fxe1.jpeg?auto=webp&amp;s=f77c1714d85a40a7996fdf36ebb523fbf1eb530f"
        },
        "permalink": "/r/movies/comments/1k99vkb/new_poster_for_final_destination_bloodlines/"
    },
    {
        "id": "1k9mk1a",
        "author": "red_riders",
        "title": "I saw Revenge of the Sith in theaters in 2005 when I was nine. Twenty years later, I saw Revenge of the Sith in theaters again today.",
        "content": "So today, I took a nostalgic journey back to my childhood. Revenge of the Sith was the first Star Wars movie I ever saw in theaters, and I still carry some memories with me from that experience. I still remember reacting to the opening aerial battle over Coruscant, and I was so loud that my then-best friend who was sitting beside me had to lean over to me and tell me, “Dude, be quiet.”  I also remember after the car ride home, my grandmother, who has since passed away, called my cousin, my friend and I all “little Skywalker’s.”\n\nToday, I took my dad to see the 20th anniversary of Revenge of the Sith. He's the one I showed scenes to from all the Star Wars movies as a kid over and over and over, and he was the main one I had lightsaber fights with as a kid. He gave me new memories that I can carry with me from this theater experience. He always mimics Windu's face when he is lightsaber locked with Palpatine about mid-fight, he mouthed, “Darth….Vader” as Palpatine names him, and I noticed he side-eyed me when Anakin ignites his lightsaber in front of the Younglings.\n\nNow I have memories of old and new, and I had a very entertaining experience revisiting 2005 in 2025.",
        "upvotes": 200,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1k9mk1a/i_saw_revenge_of_the_sith_in_theaters_in_2005/"
    },
    {
        "id": "1k9gwfg",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy-Thriller 'Sew Torn' - A seamstress gets tangled in her own thread after stealing a briefcase from a drug deal gone bad. In an escalating game of cat and mouse, her different choices lead to drastically different outcomes along the way.",
        "content": "",
        "upvotes": 221,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ou3okqe7jgxe1.jpeg?auto=webp&amp;s=3e6e03dca54a2d983c018d5799b1ab3236141895"
        },
        "permalink": "/r/movies/comments/1k9gwfg/first_poster_for_comedythriller_sew_torn_a/"
    },
    {
        "id": "1k9maue",
        "author": "rolo_tamazi",
        "title": "Quentin Tarantino and Robert Zemeckis Interview Each Other (1995): The two directors have a conversation about film and filmmaking just after both FORREST GUMP and PULP FICTION were nominated for Best Picture.",
        "content": "",
        "upvotes": 82,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ZwmHJX1M1FexdDkHiok24BipUx3MMa3m1E3dChDGgk.jpg?auto=webp&amp;s=58907c1e217680590237d81df489c7e54577e8c4"
        },
        "permalink": "/r/movies/comments/1k9maue/quentin_tarantino_and_robert_zemeckis_interview/"
    },
    {
        "id": "1k9m2j1",
        "author": "Askanything236",
        "title": "What’s a movie that hit a little too close to home for you?",
        "content": "What is a film that you watch that when you watch it you feel like it is narrating something that has happened in your life: whether a difficult breakup, something impactful, just something in general that when you watch it you can truly connect and feel the emotions?\n  \n\n(And why?) I feel like movies and music are so incredibly relatable that I’d like to hear which maybe you were a little too close for comfort ",
        "upvotes": 68,
        "comments": 179,
        "media": null,
        "permalink": "/r/movies/comments/1k9m2j1/whats_a_movie_that_hit_a_little_too_close_to_home/"
    },
    {
        "id": "1k9ckit",
        "author": "Pizza_Hero24",
        "title": "What are the worst movie villains?",
        "content": "There’s usually a lot of discussion of the best movie villains. Darth Vader, Hannibal Lector, Hans Landa, etc. We all know who the best movie villains are. However, who are the worst movie villains? These can be villains that are severely underwritten, poorly casted, not threatening or intimating, etc. ",
        "upvotes": 276,
        "comments": 609,
        "media": null,
        "permalink": "/r/movies/comments/1k9ckit/what_are_the_worst_movie_villains/"
    },
    {
        "id": "1k942gr",
        "author": "FilmWaffle-FilmForum",
        "title": "If you could change one movie ending, what would it be and why?",
        "content": "First one that comes to mind is Law Abiding Citizen. Why on earth they thought it would be a good idea to let the lawyer “win” is beyond me. I would have preferred both of them to go down in the midst of their own selfish, personal desires.\n\nIf you had the opportunity to change one movies ending, what would it be and why? ",
        "upvotes": 583,
        "comments": 1181,
        "media": null,
        "permalink": "/r/movies/comments/1k942gr/if_you_could_change_one_movie_ending_what_would/"
    },
    {
        "id": "1k9dcq1",
        "author": "ophiosaur",
        "title": "California King (2025, out now) starring Jimmy Tatro, Victoria Justice, Travis Bennett, and Joel McHale - A mattress store manager hatches a wild plan to impress the girl of his dreams, chaos ensues.",
        "content": "",
        "upvotes": 118,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DHoiHuALP7JKQCE7onSxJ9aamCWYNtz7L97GZlO4LiI.jpg?auto=webp&amp;s=0f596474a7c63c92305338dd36c6a7b6e14345f4"
        },
        "permalink": "/r/movies/comments/1k9dcq1/california_king_2025_out_now_starring_jimmy_tatro/"
    },
    {
        "id": "1k93p47",
        "author": "AbbreviationsAway500",
        "title": "Name Good Low-Budget Movies.",
        "content": "It doesn't matter what genre.  There have been some solid movies made on a shoestring budget.  What are your top low-budget movies?\n\nI'll open with the 1979 Mad Max.  It had a budget of 350K  and launched Mel Gibson's career and created a long running franchise.\n\nMy Second Offering is Rocky.  Only a 1 Million Dollar Budget and won the Oscar for the best picture and sent Stallone's career in orbit.",
        "upvotes": 403,
        "comments": 984,
        "media": null,
        "permalink": "/r/movies/comments/1k93p47/name_good_lowbudget_movies/"
    },
    {
        "id": "1k95ms2",
        "author": "ConsistentTadpole861",
        "title": "Overdone improv in comedies...",
        "content": "I'm sure there's a million posts about this but.  This thing where they stand there and say the same sort of improv joke over and over and over again. With ever increasing shock value or whatever. In an attempt to be shocking and wacky is horrible.\n\nLike when there's two characters insulting another character and they alternate and scale up the the same insult, like: \n\n\"You look like a turd\" \n\n\"You look like turd that all the other turds don't like because you live in your turd-mom's turd-basement.\"\n\n\"You look like a turd that banged another turd and then had a turd baby out of its butt.\"\n\nEtc... they usually do five or six. I kept it to three.  They keep scaling up the same joke but are still saying the same joke over and over.  Yes, he's looks like turd haha. Let's move on.  \n\nThese are things that they used to do in movies and then pick the best one and use that in the movie and now they just leave them all in there and it's pathetic. \n\nWatching hot tub time machine 2 and they they keep doing this and then they're actually making references to the fact that they keep doing this which doesn't actually make it any funnier.  Hanging a lamp on laziness and stupidity is not comedy. \n\nJudd Apatow turned this into the regular and it's horrible. He's done some good stuff and it was fine that he was doing this in his movies. We don't need it in every other comedy movie made since. It's what comprised about 65% of the 2016 Ghostbusters movie's dialogue.  \n\nI want well-written comedy, not a brainstorming session on film.",
        "upvotes": 264,
        "comments": 172,
        "media": null,
        "permalink": "/r/movies/comments/1k95ms2/overdone_improv_in_comedies/"
    },
    {
        "id": "1k9kalj",
        "author": "Craphole-Island",
        "title": "Scream 2 - Gale Weathers’ chase through the recording studio is such a great scene",
        "content": "Been marathoning Scream movies and I just love this scene so much. One of my favorite chase scenes from any horror movie tbh. I love how they used the soundproof rooms and the way you can see Ghostface just behind her in the studio walls. \n\nAnd I just love Gale and Dewey so even though I’ve seen this movie 100 times, I’m still upset when he gets stabbed. Courteney Cox sla the hell out of it too and I think Scream 2 is my favorite version of Gale.\n\nBetween this and the scene with Sidney and Hallie having to escape from the back of the cop car, Scream 2 has some of my favorite setpieces in the franchise.",
        "upvotes": 33,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kqqGApm2T9e0bcw2mVfEh35aVDPzVPkga2mlMUxImSs.jpg?auto=webp&amp;s=a170216b18b1f242e36ed917f764f676cf838ac9"
        },
        "permalink": "/r/movies/comments/1k9kalj/scream_2_gale_weathers_chase_through_the/"
    },
    {
        "id": "1k9b4oo",
        "author": "leogodin217",
        "title": "What Weird, Quirky Movies Do You Love?",
        "content": "I'm talking about movies that don't have a big budget or even a genre. Any quirky gems you'd like to talk about? I'll start. \n\nThe Brass Teapot (2012) - One of my favorite movies for misanthropes. God Bless America is the top of that list for me. \n\nSafety Not Guaranteed (2012) - Scifi? Romantic Comedy? Aubrey Plaza. I'm in. \n\nAnna and the Apocalypse (2017) - Such a fun take on the zombie genre. \n\nVampires vs the Bronx (2020) - Great horror-ish comedy. \n\nSo many others I can't remember. Seems like 2010 - 2020 what the sweet spot for this weirdness. \n\nEdit - Wow! I love Reddit. So many great recommendations here. I've seen a few, but not many. \n\nAlso forgot one of my favorites, Lars and the Real Girl (2007) ",
        "upvotes": 121,
        "comments": 348,
        "media": null,
        "permalink": "/r/movies/comments/1k9b4oo/what_weird_quirky_movies_do_you_love/"
    },
    {
        "id": "1k94i2l",
        "author": "Celestialstardust17",
        "title": "What are some courtroom/crime movies where we never actually find out if the person is guilty or innocent?",
        "content": "I really enjoy movies where it's almost irrelevant whether or not the person accused actually committed the crime, because the primary focus of the story is the trial itself (or the aftermath of the verdict). The only ones I can think of are Anatomy of a Fall, 12 Angry Men, and Shawshank Redemption. Are there any others besides these three that exist?\n\n**EDIT**: I misremembered Shawshank Redemption. My apologies.\n\nEdit: It doesn't need to fit crime in the traditional sense, since Doubt also fits this category.",
        "upvotes": 275,
        "comments": 312,
        "media": null,
        "permalink": "/r/movies/comments/1k94i2l/what_are_some_courtroomcrime_movies_where_we/"
    },
    {
        "id": "1k9oi3o",
        "author": "Freddy-Philmore",
        "title": "In The War of the Roses (1989) Danny DeVito’s character, Gavin, is telling the terrifying story of Oliver and Barbara to his client (who’s considering divorce). Do you think Gavin is telling a true story or just inventing it as a cautionary tale?",
        "content": "I think *The War of the Roses* is one of the all-time best dark comedies ever made...*.* but I've always suspected the story Gavin tells (his client/Homer Simpson) is something he uses to make sure his clients really want a divorce.\n\nThere’s no clear answer that the Roses actually existed in the movie's universe. The way Gavin frames it, to me it feels like he’s trying to scare his client into rethinking a nasty divorce by telling an exaggerated or fictional horrifying example of how bad things can get.\n\nYou think he's telling a made-up story, or is he documenting real events from his life? I feel like DeVito who directed, intentional keeps it vague so you don't know for sure.",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1k9oi3o/in_the_war_of_the_roses_1989_danny_devitos/"
    },
    {
        "id": "1k95szv",
        "author": "Kudoshinichi0007",
        "title": "Perfect Days hit me harder than I expected...pure life lessons hidden in silence.",
        "content": "So today I watched *Perfect Days* (Japanese movie) and honestly...I didn't expect it to leave such a strong impact.\n\nAt first, it feels so simple... just a guy living his everyday life, cleaning toilets, listening to old cassettes, taking pictures of trees. But the more you watch, the more you realize how much peace and depth there is behind his routine.\n\nOne thing that stood out to me was how he smiles at the sky every morning. Like he’s genuinely grateful for another day. No rush, no complaints, just...existing with full heart.\n\nHe doesn’t talk much unless necessary, but when he does interact (like with his niece or that random guy he plays shadow games with), you can feel how much he enjoys human connection too. He’s not *avoiding* people...he just doesn't *need* noise to be happy.\n\nThere’s this beautiful bittersweetness. He’s not \"choosing loneliness\" in a sad way...it's more like, life took him down this path, and instead of fighting it, he embraced it with full acceptance. That’s powerful in today’s world where everyone feels pressure to chase something constantly.\n\nThe scene where his niece leaves... and he quietly cries...man, that hit different.  \nNot because he's weak or regretting, but because even the strongest hearts carry a little sadness somewhere deep.\n\nAnd that final drive...the way he smiles and then tears up while listening to music, that was pure *life itself*. Happiness, sadness, memories, gratitude...all flowing through him at once.\n\nHonestly gave me the same vibe I felt after watching Shawshank Redemption...the idea that freedom and peace are an inside job. No matter what life gives or takes away.\n\nOne of the most beautiful movies I’ve ever watched without trying to be \"loud\" about it. I liked the whole silent treatment vibe\n\nAlso, I’m surprised how not many people talk about this movie.\n\nWould love to hear what you guys felt after watching it.",
        "upvotes": 218,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1k95szv/perfect_days_hit_me_harder_than_i_expectedpure/"
    },
    {
        "id": "1k9qsz3",
        "author": "BillyThe_Kid97",
        "title": "How many of you guys still make it a point to go to theaters vs watch at home?",
        "content": "Ted Sarandos (Netflix CEO) recently gave an interview where he re-iterated how the theatrical model was outdated. So I thought I'd ask a sub of movie lovers. How many of you still enjoy going to the movies? Personally I still go when there's something that really peaks my interest. But current ticket prices have made me a lot more selective and obviously I tend to favor the big movies where the theatrical set up really shines vs the samller films that you can enjoy at home without missing much in terms of bigger screen and super duper sound set up. But, I do agree with the aspect that streaming has \"democratized\" the movie viewing experience. Not everyone lives close to a movie theater and not everyone has the time to go to one. Being able to press play and just enjoy is a huge plus. Also, home set ups are becoming more advanced. Some OLED and Mini LED tvs are out of this world in terms of quality and you can get a great sound system too. So I guess I'm 50/50 on this. What do you guys think?",
        "upvotes": 8,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1k9qsz3/how_many_of_you_guys_still_make_it_a_point_to_go/"
    },
    {
        "id": "1k9g2e1",
        "author": "ollymillmill",
        "title": "What is the technique called when there is a edit-reversed footage shot?",
        "content": "The most common example iv noticed is when a character is looking forward and then looks down in the original shot. However it is then edited (reversed) to make it so the character looks up from looking down originally. \n\nPersonally i find it very obvious but have never understood the reasoning. Is it intentional to give a surreal/irregular feel? Or is it because they didn’t have the shot they needed so just sort of butchered an already existing shot to fit the narrative? \n\nTheir eye movement and blink just its really unnatural but i’v not seen any evidence or articles mentioning this besides a couple of Reddit posts asking the same thing. \n\nWhat prompted me to post this question was i noticed it on Nicholas Hoult’s character in The Menu. If that helps the explanation of scene. \n\nI have included the shot in question, watch how his eyes flick. This is obviously reversed. \n\nhttps://imgur.com/a/Rl7kq3N",
        "upvotes": 54,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eZJi4h1srh5ScXmS5AqeTN3KIEGloFOLHwGQX_R1xpI.jpg?auto=webp&amp;s=a232f151b678f97d5a8dd5ebecff951bf2b61fd3"
        },
        "permalink": "/r/movies/comments/1k9g2e1/what_is_the_technique_called_when_there_is_a/"
    },
    {
        "id": "1k9q56d",
        "author": "Texas43647",
        "title": "Just finished Caddo Lake. What an insane anxiety inducing and heart wrenching movie.",
        "content": "Honestly, I’m sitting here in genuine shock about what I just watched. I casually read the description of the movie on HBO Max and thought it sounded interesting so I figured I’d watch it and all I can say is wow. What a ride. The acting was also amazing but perhaps too much so because I’m left feeling like I got shot in the heart but I guess that’s what makes it a good movie.",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1k9q56d/just_finished_caddo_lake_what_an_insane_anxiety/"
    },
    {
        "id": "1k95y34",
        "author": "Lokitusaborg",
        "title": "I forgot how much I love Wedding Crashers",
        "content": "Sometimes I can get stuck in a rut on movies. Lately movies have seemed to take themselves way too seriously and even comedies are dry and witless. I haven’t watched Wedding Crashers for years and I just fired it up this morning. I laughed so hard, it has just the right amount of awkward moments, fun dialogue, and Isla Fisher is absolutely amazing.\n\nNow I’m putting Meet the Parents and There’s Something About Mary on the re-watch agenda.",
        "upvotes": 170,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1k95y34/i_forgot_how_much_i_love_wedding_crashers/"
    },
    {
        "id": "1k96ayw",
        "author": "BunyipPouch",
        "title": "‘The Wretched’ Sequel to Begin Shooting in September",
        "content": "",
        "upvotes": 151,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fZ7Pk5e2kAosSNPf1U4wXCGehQw5t5_rGn_P9qcJACU.jpg?auto=webp&amp;s=9da245bc7fadf33a51ff06f9ac2d94482ab489d9"
        },
        "permalink": "/r/movies/comments/1k96ayw/the_wretched_sequel_to_begin_shooting_in_september/"
    },
    {
        "id": "1k9ie4b",
        "author": "anaxplain",
        "title": "movie recommendations about intense female friendships?",
        "content": "I’m writing a script for a short film and I’m looking to other films for inspiration, ones that feature very close female friendships, whether that’s portrayed negatively or positively. An example would be Heavenly Creatures (1994), Thoroughbreds (2017), Thelma and Louise (1991), Persona (1966), or Mulholland Drive (2001). Let me know!",
        "upvotes": 21,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1k9ie4b/movie_recommendations_about_intense_female/"
    },
    {
        "id": "1k9kora",
        "author": "KyzuDaHomie",
        "title": "Looking for an ocean themed movie",
        "content": "Me and my Gf are planning on watching a movie and I’m really wanting something ocean themed. We don’t want to watch a cartoon or a documentary but something that feels adventurous or explorative would be awesome.  If it involves diving, that would be even better. We are huge fans of the guardian (coast guard movie) and think a movie with a rescue attempt would be great. Thank you so much.",
        "upvotes": 12,
        "comments": 176,
        "media": null,
        "permalink": "/r/movies/comments/1k9kora/looking_for_an_ocean_themed_movie/"
    },
    {
        "id": "1k8cfid",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for the 25th Anniversary Re-release of Kevin Smith’s ‘DOGMA’",
        "content": "",
        "upvotes": 14263,
        "comments": 513,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xt2e8nxmg6xe1.jpeg?auto=webp&amp;s=90e3b947bc38737b496179d7767cc64a11ccb8d1"
        },
        "permalink": "/r/movies/comments/1k8cfid/new_poster_for_the_25th_anniversary_rerelease_of/"
    },
    {
        "id": "1k96cf2",
        "author": "BunyipPouch",
        "title": "Bleecker Street Acquires Thriller ‘Relay’ Starring Riz Ahmed, Lily James and Sam Worthington from Director David Mackenzie ('Hell or High Water', 'Outlaw King') - Planning 2025 Theatrical Release",
        "content": "",
        "upvotes": 81,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PKlzlt6hNChyG0_rZTSsgadRSmRM2uH54sIn4y0xgPU.jpg?auto=webp&amp;s=2df8bd8b8ff11d5029f53aadda68420e55194935"
        },
        "permalink": "/r/movies/comments/1k96cf2/bleecker_street_acquires_thriller_relay_starring/"
    },
    {
        "id": "1k9il34",
        "author": "termeric0",
        "title": "Looking for some feel good movie reccommendations",
        "content": "My wife and i had a pretty traumatic experience this week and i am hoping to find some feel good movies to watch without any sort of violence.  I don't really care what genre the movie is,  as long as we feel the opposite of movies like Requiem or Kids etc..  Bonus points for movies that aren't on netflix because their password sharing crackdown is lame. thanks.",
        "upvotes": 12,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1k9il34/looking_for_some_feel_good_movie_reccommendations/"
    }
]