[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o21zjd",
        "author": "Jess_in_Peace",
        "title": "Non sono di TO, ma la Libreria Luxemburg è uno dei miei luoghi del cuore nel mondo. Con tristezza ho appreso la notizia che avrebbe cambiato location. È già avvenuto? Dove andrà?",
        "content": "",
        "upvotes": 45,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j4k48oxl82uf1.jpeg?auto=webp&amp;s=a4281ac7db0e84190d838b6af34902e03821973c"
        },
        "permalink": "/r/torino/comments/1o21zjd/non_sono_di_to_ma_la_libreria_luxemburg_è_uno_dei/"
    },
    {
        "id": "1o23oex",
        "author": "CriticismOk9306",
        "title": "Salsicce di pollo ma non c'è il pollo dentro.",
        "content": "Da Ekom vendono queste salsicce di pollo fresche, (che fresche non sono, visto che poi sono uscite da confezioni enormi e non fatte al momento) chiedo per curiosità gli ingredienti visto che le ho viste particolarmente rosa, e l'inserviente legge molto impaurito gli ingredienti, saltandoli.   \n  \nAlla fine mi sono fatta dare la confezione (fresche? mhh) con l'etichetta sopra e gli ingredienti delle SALSICCE DI POLLO erano:  \n27% tacchino 50% PANCETTA DI MAIALE, rimanente fibre vegetali come piselli e bambù, sale e poi additivi vari.\n\nQueste sarebbero le \"salsicce i pollo\" vendute da EKOM.\n\nLeggete sempre le etichette con gli ingredienti prima di comprare, anche se vengono venduti nel banco \"fresco\".",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1o23oex/salsicce_di_pollo_ma_non_cè_il_pollo_dentro/"
    },
    {
        "id": "1o29dx0",
        "author": "Similar_Profit_7298",
        "title": "Lavorare come rider",
        "content": "Stavo cercando un lavoro part time da fare nel weekend insieme agli studi, sarebbe possibile ,secondo voi, lavorare tutti i weekend come rider e puntare a portarsi a casa circa 400/500€ al mese? Quante ore dovrei lavorare? Come funziona? Perché con una veloce ricerca su Google ho visto che la paga sarebbe di 10€ lordi all'ora, che sulla carta mi sembrano veramente un paradiso(la ristorazione ha ridotto di molto le mie aspettative), il che vorrebbe dire che lavorando circa 12 ore a settimana raggiungerei il mio obiettivo(contando che su paghe così basse si paga nulla o quasi di tasse). Dov'è la fregatura? Mi basta veramente salire in sella alla mia bici elettrica e sono apposto?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1o29dx0/lavorare_come_rider/"
    },
    {
        "id": "1o28r3d",
        "author": "Current-Remote8989",
        "title": "Phone Number Change in Residence Permit Application",
        "content": "How can I possibly change the phone number I provided in the residence permit application? The office helping asked me the number and K provided them but turns out I gave another number not related to me. How can I fix this, or does it matter if number isn’t corrected until the fingerprint appointment where I can tell the questura to correct it. Will I be receiving any important sms until fingerprint appointment? I obviously know the appointment date from the receipt I received when submitting the application. Thanks all. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o28r3d/phone_number_change_in_residence_permit/"
    },
    {
        "id": "1o26vfd",
        "author": "Afraid-Pie-5290",
        "title": "Permanente riccia donna",
        "content": "Buondì. Sto cercando un parrucchiere a Torino che sia bravo a fare le permanenti ricce / mosse e che faccia dei trattamenti con buoni risultati senza distruggere il capelli.  \nNon ho mai fatto in vita mia la permanente quindi non sono pratica di quali siano le diverse tipologie di trattamento, quindi faccio fatica a selezionare un parrucchiere di cui fidarsi.\n\nPer altro, non ho mai fatto la permanente riccia / mossa. E' una buona idea?  \nGrazie a chi avrà voglia di raccontarmi la sua esperienza : ) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o26vfd/permanente_riccia_donna/"
    },
    {
        "id": "1o26ohf",
        "author": "pas_me",
        "title": "Fare amicizia a Torino?",
        "content": "Ciao! \nSono una ragazza di 25 anni e vivo a Torino da circa un anno. Lavoro e studio nel campo IT, ma purtroppo finora non ho avuto molte occasioni di stringere nuove amicizie.\n\nMi piacerebbe conoscere persone queer o LGBT+ friendly con cui uscire, chiacchierare, giocare insieme o semplicemente condividere interessi.\nMi piacciono i giochi da tavolo (anche se non sono particolarmente esperta), i videogiochi quando ho tempo, e in generale provare cose nuove e passare del tempo in compagnia.\n\nSe vi va di bere qualcosa, organizzare una serata giochi o anche solo fare due chiacchiere, scrivetemi pure!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o26ohf/fare_amicizia_a_torino/"
    },
    {
        "id": "1o2aoi0",
        "author": "Independent_Joke2231",
        "title": "Ciao, qualcuno ha cialis o viagra, sono di torino passo io dove siete",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o2aoi0/ciao_qualcuno_ha_cialis_o_viagra_sono_di_torino/"
    },
    {
        "id": "1o2ajk6",
        "author": "mimi0-03",
        "title": "Japanese study buddies",
        "content": "Hi! I am searching somebody to practice/study japanese with (online and in person), send me a message if you are studying the language too :)\n\nCiao! Sto cercando qualcuno con cui fare pratica di giapponese (online e di persona), se stai studiando la lingua scrivimi un messaggio, se vuoi :)\n\nまたねー",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o2ajk6/japanese_study_buddies/"
    },
    {
        "id": "1o1zdol",
        "author": "hasumo",
        "title": "Travel from Milano Bergamo Airport to Turin",
        "content": "Hi, I am planning to travel to Turin. My flight is going to the Milano Bergamo Airport at 13th of October. How should ı transfer Milano Bergamo Airport to Turin?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o1zdol/travel_from_milano_bergamo_airport_to_turin/"
    },
    {
        "id": "1o1jbby",
        "author": "_tarassaco",
        "title": "lavoro",
        "content": "ciaooo, qualcuno che ha lavorato o lavora nella ristorazione può consigliarmi ristoranti/pizzerie/bar dove passare a chiedere se hanno bisogno di qualcuno in più in sala? sono qua da poco quindi non ho conoscenze, ho trovato un ristorante dove mi hanno presa in prova ma pagano sei euro all'ora, diciamo che mi servirebbe qualcosa in più e per evitare di trovarmi in altre situazioni simili e ho pensato di chiedere qui...",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o1jbby/lavoro/"
    },
    {
        "id": "1o16mzv",
        "author": "Euphoric-Spare-2871",
        "title": "Pensate che negli ultimissimi anni (dal Covid a oggi) Torino stia cambiando in meglio o in peggio?",
        "content": "",
        "upvotes": 17,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1o16mzv/pensate_che_negli_ultimissimi_anni_dal_covid_a/"
    },
    {
        "id": "1o1beah",
        "author": "Hyzev_",
        "title": "Ristoranti buoni ma economici",
        "content": "Ciao ragazzi, potete indicarmi dei ristoranti buoni ma economici dove andare a cena? Pensavo a qualcosa tipo 40€ a testa, meglio se piemontese ",
        "upvotes": 9,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1o1beah/ristoranti_buoni_ma_economici/"
    },
    {
        "id": "1o24ewr",
        "author": "Independent_Joke2231",
        "title": "Ciao, sto cercando Cialis o Viagra se qualcuno ne ha mi scriva, urgente oggi😅",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o24ewr/ciao_sto_cercando_cialis_o_viagra_se_qualcuno_ne/"
    },
    {
        "id": "1o1k5a7",
        "author": "Sorry_Carrot7537",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti, sono un giovincello di 20 anni (siciliano), tra qualche giorno mi trasferisco a Torino per lavoro, e nulla, volevo fare nuove amicizie. Ho già qualche amico, ma volevo ampliare un po' le mie conoscenze. Nel tempo libero faccio calisthenics, mi piacciono i videogiochi, le lunghe passeggiate e tutto ciò che riguarda i motori. Sono una persona piuttosto accollativa, non sono bravissimo a descrivermi nel dettaglio ma ci ho provato!!\nquindi se vi va di fare due chiacchiere e/o magari fare una nuova conoscenza io ci sono, scrivetemi pure. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o1k5a7/nuove_conoscenze/"
    },
    {
        "id": "1o1gnpy",
        "author": "Aggressive-Panda8084",
        "title": "affitti brevi a Torino",
        "content": "Ciao! A Novembre mi trasferirò a Torino per due mesi per un tirocinio. A Torino è difficile trovare stanze in affitto per affitti brevi di due mesi? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o1gnpy/affitti_brevi_a_torino/"
    },
    {
        "id": "1o1l34y",
        "author": "No_Reply4055",
        "title": "Attività carine da Fare a Torino il venerdì sera.",
        "content": "Ciao a tutti! avrei un immenso bisogno di consigli su attività carine che si possono fare a Torino il venerdì o sabato sera, qualsiasi proposta è ben accetta! che non siano il semplice cinema, cena, disco. grazie a tutti &lt;3 &lt;3",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o1l34y/attività_carine_da_fare_a_torino_il_venerdì_sera/"
    },
    {
        "id": "1o1iz88",
        "author": "exulansjs",
        "title": "Corsi musicali gratuiti?",
        "content": "Ciao a tutti, immagino che le possibilità di imparare a suonare uno strumento gratuitamente siano veramente poche, ma ci provo comunque. Per caso sapete di qualche corso di musica gratuito a Torino? Per adulti, sono una universitaria. Altrimenti sapreste indirizzarmi verso una struttura valida in cui non si spende troppo? A me piacerebbe tanto suonare la batteria, ma anche il pianoforte, e parto da zero.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o1iz88/corsi_musicali_gratuiti/"
    },
    {
        "id": "1o1isoq",
        "author": "EveryAnywhere",
        "title": "Zone malfamate del centro città?",
        "content": "Ciao a tutti, scusate se l'italiano non è perfetto, sto usando Google Translate. Vorrei venire a Torino per una settimana a fine novembre per un'occasione speciale. Ho trovato un hotel dall'aspetto perfetto chiamato UNA Principi, ma mi è stato detto che si trova in una zona con regolari proteste al momento. È corretto o è in una buona zona? Sembra molto centrale e vicino a tutti i negozi, quindi spero che vada bene. Grazie in anticipo per il vostro aiuto.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1o1isoq/zone_malfamate_del_centro_città/"
    },
    {
        "id": "1o0jxrg",
        "author": "matteo0MTF",
        "title": "Sapete cosa succede?",
        "content": "Sono passati adesso in emergenza (andavano di fretta con carro che ha il cannone ad acqua) verso il centro sembra, altra manifestazione pro pal o altro?",
        "upvotes": 77,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1o0jxrg/sapete_cosa_succede/"
    },
    {
        "id": "1o19009",
        "author": "Melodic-Dirt-5512",
        "title": "Agenzie Immobiliari 1 sola mensilità.",
        "content": "Ciao a tutti.\nSto cercando casa e tutte le agenzie in cui mi sono imbattuto (dato che di privati a Torino ce ne sono pochi) chiedono 2 o addirittura 3 mensilità. \n\nConoscete agenzie che prendono solo 1 mensilità?\n\nGrazie ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o19009/agenzie_immobiliari_1_sola_mensilità/"
    },
    {
        "id": "1o1egl9",
        "author": "verautopya",
        "title": "Cerco sarto/a e cosplay maker di Torino preferibilmente, per completare due cosplay per il Lucca Comics!",
        "content": "Salve! \nCerco un/una sarto/a e cosplay maker, di Torino preferibilmente, per aiutarmi a \"completare\" (ovviamente pagando) due cosplay per il Lucca Comics.\n\nSo come si presenta la richiesta (la solita richiesta disperata, non \"promettente o allettante\"), ma non chiedo un costume intero o lavori arzigolati/complicatissimi... \nPurtroppo ho avuto conferma tardi per il Lucca Comics, altrimenti lo avrei fatto avrei fatto preparato tutto con molto anticipo.\nI cosplay sono Esquie e Monoco di Expedition 33. \n\nChiunque possa essere interessato,\nnon esiti a scrivermi o contattarmi per maggiori info! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o1egl9/cerco_sartoa_e_cosplay_maker_di_torino/"
    },
    {
        "id": "1o18of6",
        "author": "FreeAd8663",
        "title": "Concerto Pino Scotto - venerdì 10 ottobre 2025 - presso \"Il Peocio\" di Trofarello (TO) - opening act Only One Black band",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o18of6/concerto_pino_scotto_venerdì_10_ottobre_2025/"
    },
    {
        "id": "1o0qntq",
        "author": "JohnnyCannuccia",
        "title": "Quanto spendete di condominio? [How much do you spend for condominium administration]",
        "content": "[English below]\n\nCiao a tutti! Sto cercando di capire se le spese ordinarie del mio condominio (onorario amministrazione + manutenzioni ordinarie, pulizie, ecc.) siano o meno sovradimensionate rispetto alla media. Vi chiederei pertanto, se vi va, di condividere all’incirca quanto spendete ogni anno di condominio senza contare spese straordinarie, acqua e riscaldamento (nel mio caso è autonomo) specificando, se possibile, quanto grande è il vostro condominio. Grazie in anticipo a chi vorrà rispondere!\n\nHi all! I’m currently trying to understand if the ordinary expenses of my building administration (administrator fees, ordinary checks, cleaning, etc.) are too much with respect to the average. Therefore, I’d like to ask you to share, if you want, how much do you pay per year without including extraordinary expenses, water, and heating (as in my case it’s autonomous) specifying, if possible, how big is more or less your building. Thanks in advance to who’s gonna answer!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o0qntq/quanto_spendete_di_condominio_how_much_do_you/"
    },
    {
        "id": "1o0oit1",
        "author": "Revolutionary_Move79",
        "title": "Consigli per un corso di fotografia (livello base/medio) a Torino",
        "content": "Ciao a tutti!  \nVorrei iniziare un corso di fotografia a Torino, livello base o medio, per migliorare nella pratica e imparare a usare meglio la fotocamera (scatto in manuale e in RAW, ma vorrei fare un po’ di ordine e tecnica).Mi piacerebbe un corso in presenza, magari serale o nel weekend, con un gruppo piccolo per poter esercitarsi davvero sul campo.  \nQualcuno ha esperienze dirette o può consigliarmi scuole, associazioni o corsi validi in zona Torino/Cuneo?\n\nGrazie mille in anticipo 🙏",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1o0oit1/consigli_per_un_corso_di_fotografia_livello/"
    },
    {
        "id": "1o0aeeh",
        "author": "eza137",
        "title": "Tips about Torino for a one-day trip: is it worth a visit?",
        "content": "Ciao tutti! I'm visiting my brother in Cuneo. I'm more of a city person - I live in Berlin and grew up in São Paulo - and my brother likes mountains and nature. I've visited a few big Italian cities before, but not Turin, so I'm thinking of checking it out tomorrow while he's at work, and I'm on vacation.\n\nI'm thinking of visiting two museums, the Risorgimento Museum and the National Cinema Museum, and eating some regional food. I'm also thinking about renting a car and spending the weekend with my brother in the mountains. Another idea would be a visit to the university, if that is possible for visitors. Just to have an idea of its environment.\n\nDoes anyone have recommendations for good local restaurants or cafés? Do you have any tips about renting a car and returning it on Sunday? I see that the city is culturally very rich ([WikiVoyage](https://en.wikivoyage.org/wiki/Turin)), so I am overwhelmed by the many possibilities.\n\nP.S. I can understand Italian because I lived here for a while, but I write much faster in English.",
        "upvotes": 6,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bdZcSWM0ksSPXGggj2ejANUqiqv8rz-nTxIioCRm9uI.jpeg?auto=webp&amp;s=b35d5ad7efe0abb45f85d7b8b1f398c31c1c65fc"
        },
        "permalink": "/r/torino/comments/1o0aeeh/tips_about_torino_for_a_oneday_trip_is_it_worth_a/"
    },
    {
        "id": "1o0aytu",
        "author": "Nibby067",
        "title": "Posto letto per studenti a torino",
        "content": "Ho iniziato quest'anno al dipartimento di informata, oltre al fatto che quest'anno hanno dato 14 posti letto (a me rode perchè ero 77esimo) su 550+ persone che hanno fatto richiesta, mi son ritrovato a cercare casa all'ultimo, poichè ero convinto avrei avuto il collegio, teoricamente dovrei ricevere, a metà ottobre, il 20% della borsa di studio (1661 euro) ma a sto punto, meglio essere pessimisti e sto facendo tutti i calcoli (con la mia famiglia) tenendo conto di non riceverla, nonostante il mio isee molto basso però ripeto, a sto punto meglio essere pessimisti; voi avete qualche consiglio? possibilmente no agenzie perchè money are tight, se non dovessi riuscire a trovare casa sarei costretto ad andare a bari e il solo pensiero di rimanere altri 3 anni nella mia città natale, sperduta nelle campagne del sud, mi fa solamente stare male ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o0aytu/posto_letto_per_studenti_a_torino/"
    },
    {
        "id": "1nzw7n2",
        "author": "the_owl_doctor",
        "title": "È un buon stipendio per Torino?",
        "content": "Ho ricevuto un'offerta da un'azienda italiana ma non conosco bene il costo della vita né gli stipendi medi in Italia. Sono un data engineer con 5 anni di esperienza.\n\n\nIl dettaglio dell'offerta è:\n\nRetribuzione annua lorda (14 mensilità): 24.000 euro\nBuoni Pasto: 5,29 euro per giorno lavorativo\nIndennità giornaliera: 30 euro per giorno lavorativo\nRimborso spese mensile: 800 euro al mese\n\nQuindi, il totale netto mensile ammonterebbe a circa 3007 euro.\n\n È uno stipendio adeguato?\n\nGrazie ",
        "upvotes": 17,
        "comments": 57,
        "media": null,
        "permalink": "/r/torino/comments/1nzw7n2/è_un_buon_stipendio_per_torino/"
    },
    {
        "id": "1nzexbz",
        "author": "Bruno_Barbiere",
        "title": "In queste settimane sono fuori da Torino per lavoro, vi chiedo quindi: com'è stato DAVVERO questo weekend di cortei e scioperi per Gaza? Violento con ingenti danni come i tg lo descrivono o tranquillo con casi isolati di violenza?",
        "content": "",
        "upvotes": 126,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cjkvi8m2tgtf1.jpeg?auto=webp&amp;s=c021f77367d574e323c547369cf64a40432d46a2"
        },
        "permalink": "/r/torino/comments/1nzexbz/in_queste_settimane_sono_fuori_da_torino_per/"
    }
]