[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qv4k7b",
        "author": "anonRedd",
        "title": "\"A Man on the Inside\" renewed for season 3!",
        "content": "",
        "upvotes": 408,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qv4k7b/a_man_on_the_inside_renewed_for_season_3/"
    },
    {
        "id": "1qvases",
        "author": "No-Daikon914",
        "title": "His &amp; Hers was written by idiots",
        "content": "I’m so sorry, WHAT is that “town hall”?! Why would they give an open mic to a literal stranger and just let her… give her opinion on a murder? I’m willing to \\*some\\* suspend disbelief  if the writers demonstrate a bit of commons sense, but this is pathetic. All of these characters are underbaked, but all the pieces that even ARE baked are the worse ones: bitter, vague, and cruel characters with no real reason to like them. I literally think the ChatGPT prompt would be “give me your worst attempt at Mare of Easttown that incentivizes people to be on their phone while they watch it”. \n\nTV is dead, our standards are dropping every year we release these annoying, made-for-TikTok snippets shows! ",
        "upvotes": 148,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1qvases/his_hers_was_written_by_idiots/"
    },
    {
        "id": "1qvdbav",
        "author": "mohoxpom_",
        "title": "Star Search: Jaïr and Johnny Woo",
        "content": "Singer Jaïr and magician Johnny Wu\\* (misspelled his name in the title) were completely robbed by the judges. This show feels rigged, with real talent getting eliminated way too early because of weird inconsistent judging.\n\nJohnny Wu performed actual magic and genuinely engaged the audience, literally had Chrissy on stage performing unexplainable magic while the other act TJ Salta relied on looks, shock value/theatrics hanging upside down with fire and a card in his mouth which seems like it couldve been completely orchestrated and rigged before the show went live. I feel like the kid Harry Piper had better magic tricks honestly than TJ.\n\nJaïr also had the best energy so far as a singer and felt like a true star, getting the crowd dancing and hyped. Sophie was awesome too but it felt like he was completely robbed.\n\nS1:E5",
        "upvotes": 80,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qvdbav/star_search_jaïr_and_johnny_woo/"
    },
    {
        "id": "1qv37z7",
        "author": "Next_Rhubarb_5986",
        "title": "if you could bring one show that Netflix canceled which one would you choose?",
        "content": "like if you became the owner of netflix today and you can bring back any one show which one?  \ni would choose raising Dion  cause i am the only person who liked season 2 lol  \nsorry for bad grammar english is my second laguge im trying to  get better ",
        "upvotes": 52,
        "comments": 413,
        "media": null,
        "permalink": "/r/netflix/comments/1qv37z7/if_you_could_bring_one_show_that_netflix_canceled/"
    },
    {
        "id": "1qvjomh",
        "author": "No_Pop7296",
        "title": "The Way Home— Hallmark show that’s actually good. The time travel and family dynamics works. Thoughts?",
        "content": "I also want to know if there’s a S3 and S4 coming? I’m in the middle of S2. I like how they’ve woven the theme of the family roots and lost child.  What’s everyone else’s take?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qvjomh/the_way_home_hallmark_show_thats_actually_good/"
    },
    {
        "id": "1qvcyf8",
        "author": "royoclarito",
        "title": "Any suggestions?",
        "content": "I love crime-related and mafia shows like The Sopranos, Snowfall, and The Mayor of Kingstown. Even though those shows aren’t on Netflix, I just made a Netflix account and I’m looking for recommendations in the same style. I enjoy stories with intense crime, powerful characters, and complex worlds where loyalty, betrayal, and family play a big role.\n\nNow that I’m on Netflix, I want to know what shows or movies I should watch next if I like gritty dramas with criminal empires and deep character development. I’m especially interested in series that focus on crime bosses, drug trades, gangs, or undercover stories — anything that gives the same kind of tension and world-building as the shows I already love.\n\nCan you suggest crime or mafia-style Netflix titles that would be a good fit for someone who enjoys dark, character-driven stories with moral complexity?",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qvcyf8/any_suggestions/"
    },
    {
        "id": "1quhpzo",
        "author": "itsy_bitsy_seer",
        "title": "Is Bridgerton craze over?",
        "content": "First half of season 4 has dropped but I haven't seen the same fan fare or discussions surrounding it. \nIt hasn't peaked to No. 1 in my area (it's at Number 3).\nIs it the solely about them splitting the season up or a boring Cinderella-esque storyline or fans have moved on? What do you think is going on?\n\nEdited to add:\nI should probably clarify - I loved it, but I didn't find enough discussion related to it. It may just be my algorithm.",
        "upvotes": 174,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1quhpzo/is_bridgerton_craze_over/"
    },
    {
        "id": "1qv8igo",
        "author": "Stranger-danger341",
        "title": "Noob question",
        "content": "I’ve always family shared our streaming services with each other but I’ve been cut off from Netflix cuz of the sharing rules and whatnot, but I was going to just suck it up and get my own plan.  I rock with an 85” oled Samsung. Is it really that big of a difference between standard and premium or is it just minute.  I’m 40. Kinda out of touch with a lot of technology. Just curious if premium is worth the price or if id just be satisfied with 1080p\n\nThanks! ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qv8igo/noob_question/"
    },
    {
        "id": "1qv95q1",
        "author": "gski4life",
        "title": "Genre/Category change meaning???",
        "content": "For context, there was a sudden movement or motivation to watch former 1st lady Michelle Obama's documentary \"Becoming\" instead of Melania's release.....well I noticed Netflix changed the category from documentary to KIDS???\n\nWhy? \n\nWhat are they tryna dumb down and avoid? Did someone from the WH give them a call? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qv95q1/genrecategory_change_meaning/"
    },
    {
        "id": "1qufjve",
        "author": "The540Incident",
        "title": "Netflix no longer available on PS3 after March 2nd 2026.",
        "content": "quite a run it has been! surprised it lasted this long, it’s also one of the few ways to view Netflix in 4:3 natively. Since PS3 never had ads I suppose Netflix never liked that.",
        "upvotes": 139,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1qufjve/netflix_no_longer_available_on_ps3_after_march/"
    },
    {
        "id": "1qvflz7",
        "author": "sshortsshit",
        "title": "Bridgerton title not working?",
        "content": "I am at a loss, so I’m trying Reddit. I have watched the first two and almost all of the third episodes of S4 Bridgerton, and suddenly after having it paused for around 10ish minutes, it just wont play at all. Gets stuck in the loading screen at 89%. I can, however, play other titles on Netflix no issues.\n\nWe have a new-enough Firestick, update to date. Internet has been restarted, Netflix data and cache cleared, force stop, uninstalled and reinstalled, log out and log back in, tried playing from another existing account and from an entirely new one, updated both the Stick and Netflix… what the hell, man. Anyone else experience this with a single show on Netflix before? I don’t know what else to try.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qvflz7/bridgerton_title_not_working/"
    },
    {
        "id": "1qvf807",
        "author": "DuxxieDings",
        "title": "season 3 of adult animated show wolf king?",
        "content": "me and my friends all watched wolf king, it's a adult furry animated show on netflix and it had 2 seasons. though the ending felt like it was open for more seasons or spinoffs. \n\ni did like the ending but i hope there is more because i really enjoyed it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qvf807/season_3_of_adult_animated_show_wolf_king/"
    },
    {
        "id": "1qvf76i",
        "author": "BidDisastrous8646",
        "title": "Any way to get Netflix for cheaper?",
        "content": "Was wondering if theres any way to get the Netflix subscription for cheaper? Currently paying around $26 and looking to see if theres any discounts or promos for the premium plan. Any help would be greatly appreciated!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qvf76i/any_way_to_get_netflix_for_cheaper/"
    },
    {
        "id": "1qumldy",
        "author": "projectoutliers",
        "title": "Peaky blinders is good but warrior is better",
        "content": "Exactly what the title says. Warrior easily deserves more seasons. Cancelling warrior is crime against good shows. Peaky blinders was solid but warrior is easily better. Sad peaky blinders gets full seasons plus a movie but warrior is canceled..really wish it got to finish the story ",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1qumldy/peaky_blinders_is_good_but_warrior_is_better/"
    },
    {
        "id": "1qv5hf9",
        "author": "Kakeru1986",
        "title": "\"Sort by year released\" no longer available",
        "content": "We used to be able to sort results by \"year released\".  \nIt was a very useful functions, as some people wants to check older movies or newer movies in an orderly manner.  \nDid Netflix get rid of it ?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qv5hf9/sort_by_year_released_no_longer_available/"
    },
    {
        "id": "1quwyol",
        "author": "thickerthanabeer",
        "title": "Anybody else watch the K-drama action thriller \"Bloodhounds\", that's releasing a 2nd season in a couple months?",
        "content": "Bloodhounds was FANTASTIC!! K-drama action with phenomenal fight choreography (the fight/stunt cheographer did all of Squid Games!) &amp; all-around beautiful cinematography with a fun &amp; intriguing plot &amp; likeable characters. \n\nThere's even some behind-the-scenes tea that occurred during filming that didn't negatively affect the plot &amp; There's a season 2 coming out in a couple months!!\n\nNone of my mates watched it but I haven't seen anything else like it before. Everything in it was good. I've even got the music from it cemented in my head!",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1quwyol/anybody_else_watch_the_kdrama_action_thriller/"
    },
    {
        "id": "1quslp0",
        "author": "lyncIE33",
        "title": "Why can't netlfix fix HDR subtitles?",
        "content": "This is not a new observation, so more of a rant than a question, but... why can't netflix make subtitles a sensible brightness in HDR?\n\nThey are set at much too high a brightness for any modern tv with good HDR capabilities. It makes some content basically unwatchable.\n\nYes, I've made them semi-transparent and tried different colours, but this is a sub-optimal fudge.\n\nWhat is stopping netflix configuring the brightness properly (or at least letting us do so)?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1quslp0/why_cant_netlfix_fix_hdr_subtitles/"
    },
    {
        "id": "1qucoje",
        "author": "MyViewOnThings",
        "title": "His and Hers",
        "content": "What in the “Hallmark made a mystery movie” is this nonsense?\n\nI’ve had a tough time recalling worse acting in a series, foreign language subtitles come to mind, and still make this look bad.  How in the Howie Mandel doing handstands on a handkerchief did this limited series trend at #1? I’m genuinely shocked at how bad this acting, writing, and over all production turned out to be. It’s so bad I stopped at the start of episode something or other to write this Reddit and I’m already having exceptionally more fun with my limited time on a work night. This series is like someone farted in a closed room with no ventilation after eating at Joes dinner sub 4:00 am. I believe watching the history of how man made Velcro shoes in the 1980s would have been a substantially more valid use of my evening. Who in the wide world of sports memorabilia watched this and gave it a thumbs up? Walking down 22nd street at 3:00 am hitchhiking a ride to New Port Richey would be a more productive use of thumbs or ups. I paused the TV with an “I’m not mad I’m just disappointed” expression and pondered my viewing choices or wondered if I should donate my TV to help educate underprivileged tribes in Papua New Guinea. I think the parents and entire community of people that raised the individuals responsible for making this “limited series” monstrosity should be forced to pay a tax and plead guilty to misdemeanor obstruction of justice. I’m beyond words for how incredibly underwhelmed I am at the thought of this dumpster fire to continue. When in the Men are from Mars women are from Venus did Netflix decide “let’s go with this one.”? I would rather go back to the recent Gasparilla parade wearing a thong while eating Icecream than watch this nonsense any longer. Please just say no to drugs and this series, it’s honestly that bad. I may delete my subscription to all streaming platforms and go pray in the Himalayan mountains for a solid year after this waste of hours, minutes and seconds with no purpose. The only redeeming quality is this is a “limited” series.\n\nSincerely,\n\nA concerned viewer",
        "upvotes": 48,
        "comments": 202,
        "media": null,
        "permalink": "/r/netflix/comments/1qucoje/his_and_hers/"
    },
    {
        "id": "1qvea2c",
        "author": "teapot574_",
        "title": "Did Netflix Rip-off TSITP?",
        "content": "I recently started watching the new Netflix show, Finding her Edge, and the two male leads are CLEARLY Conrad and Jeremiah coded. One’s a “bad boy”, the other knows the main female lead better than anyone and has always been her “best friend.” Jeremiah guy even calls his friend, Riley, “Riles.” I mean what is this 😭 \n\n(Don’t get me wrong, I lowkey like the show, but I can’t help but notice the blatant similarities…)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qvea2c/did_netflix_ripoff_tsitp/"
    },
    {
        "id": "1qvf1ih",
        "author": "Get-Stuff-Done-Girl",
        "title": "So did Netflix cave to the demands of the orange one like every other streamer?",
        "content": "Why did Michelle Obamas documentary movie that was climbing in the ratings again this weekend get moved to a kids movie list?  It’s #4 by the way.  Is Netflix owner compromised by the demand of the orange blob?  I thought NF was a good guy not controlled because they want approval for their purchase/merger?  I thought this company took a stand for good, but this latest move has me wondering.  Do tell if you know.  I don’t want to support a caver.  ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qvf1ih/so_did_netflix_cave_to_the_demands_of_the_orange/"
    },
    {
        "id": "1quxocx",
        "author": "misterpopculture",
        "title": "BTS’ “ARIRANG” Era Starts With Netflix Live Special and New Feature Documentary",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1quxocx/bts_arirang_era_starts_with_netflix_live_special/"
    },
    {
        "id": "1qugyyk",
        "author": "Pamsopinion",
        "title": "My Review of Secret Mall Aoartment",
        "content": "Like many documentaries it went too much into the weeds. I found the background material about Providence, building the mall etc. interesting. Also the artistic community emanating from Risdy. I was very interested in the tape art project + I was inspired by what art can do to heal and reach others. A central question the documentary raises, is the secret apartment art? I would say, No. It comes off more like a kids’ secret playhouse, a free place to live after the free spaces they lived in Eagle Rock were destroyed by builders. I would be interested in knowing more about the divorce between Michael and Adriana. Obviously, his obsession with the secret apartment is what drove them apart. I was going to recommend it to a friend who lives in Providence and my niece who went to Risdy, but changed my mind.",
        "upvotes": 14,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qugyyk/my_review_of_secret_mall_aoartment/"
    },
    {
        "id": "1qvadrn",
        "author": "LessAttention796",
        "title": "Am I being dramatic?",
        "content": "I was laying in bed and accidentally hit the  Netflix button on my remote and it showed me their Valentine's day special.  I was curious and clicked my profile and immediately went to the \"Love Is In The Air\" section.  I scrolled and I saw a biographical drama movie called Priscilla.  It's about 24 year old Elvis Presley's 14 year old girlfriend/wife. I got weirded out and took a picture.  I wish I could show it.\n\nTL;DR: Am I dramatic for thinking Netflix putting a movie about the relationship between a 14 year old girl and a 24 year old man in the Valentine's day section is weird and gross?  \n",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qvadrn/am_i_being_dramatic/"
    },
    {
        "id": "1qumtn9",
        "author": "Hopeful_Historian115",
        "title": "WWE quality issue",
        "content": "Hello I have the xiaomi tv a pro 32 inch qled google tv it's a 720p tv . I have the 1080p pack of netflix. But for few days only latest WWE shows are playing at 540p . But any other movies, series,old wwe shows are playing at maximum quality which is 720p . ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qumtn9/wwe_quality_issue/"
    },
    {
        "id": "1qum2d7",
        "author": "fkdjgfkldjgodfigj",
        "title": "Is there any way to force it into picture in picture mode? Background play?",
        "content": "My phone has a \"pop up window mode\" but it doesn't show up as a media notification so that you can unpause it to play while the phone is locked. I also set it to unrestricted battery settings and am paying for the highest tier plan.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qum2d7/is_there_any_way_to_force_it_into_picture_in/"
    },
    {
        "id": "1qu31dw",
        "author": "anonmouseguy",
        "title": "Run Away - List of all the Plot Holes",
        "content": "Doing this for my own sanity. The series has left me speechless in the wrong way.\n\nWould like your thoughts on any or all of these plot holes. Or if there any that I'm missing.\n\n1. Rocco the super detective - enticing him with 50k made him find random information that somehow the police couldn't find\n\n2. Ingrid turning into Dexter - She is committing her first ever murder yet is perfectly fine doing it in such brutal way and being okay with cutting off fingers\n\n3. Ingrid the secret keeper - Why not tell her husband that the daughter he has been looking for and going crazy for is in rehab\n\n4. Ingrid the fake investigator - Why would ingrid want to go to the shady drug dealer having known what she knows\n\n5. Rehab not alerting the police - The two detectives even mentioned that they are spreading their search so the Rehab wouldve heard about it for sure\n\n6. Wannabe Bonny and Clyde - The killer couple being so nonchalant about killing just because they were physically punished as children (yes thats awful but how does that turn you into such insane serial killers)\n\n7. Dumb Dee Dee - Dee Dee not being able to provide any real explanation for why she loved a \"religion\" where the main figure was hiring a hitman to kill of his bastard sons who he abandoned\n\n8. Victoria informing the cult - Why would she inform The Shining Truth about finding her son (Henry Thorpe) when she literally had to escape the place herself?? Make it make sense\n\n9. Super(Old)Woman - The old woman randomly appearing on the 4th floor at the last second out of no where to push Dee Dee off. Firstly, how did she even find them? Secondly, was she running with them up the stairs the whole time? Ludicrous!\n\n10. Ingrid and her Son - Why didn't Ingrid ask Paige how she knew about the son?\n\n11. Gullible PI - Makes no sense that the PI would just buy the story of Alison wanting to meet somewhere far away and get in the car with Dee Dee.",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qu31dw/run_away_list_of_all_the_plot_holes/"
    },
    {
        "id": "1qtkgut",
        "author": "MonsterZero0000",
        "title": "Netflix charging extra because I'm traveling",
        "content": "I'm in the military and traveling away from my family for a year but staying in the U.S. \n\nNetflix is asking me to add myself as a new member to my own account and pay more. I just wanted to say that I think this is a bad policy.\n\nThank you.",
        "upvotes": 159,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1qtkgut/netflix_charging_extra_because_im_traveling/"
    },
    {
        "id": "1qu6tbn",
        "author": "TimeExpensive9251",
        "title": "Any good k-drama recommendations",
        "content": "Hi everyone. So I’ve watched the following: Its Okay to Not be Okay, Hometown Cha-Cha, The Glory, Extraordinary Attorney Woo, Celebrity, Marry my Husband and When Life Gives You Tangerines. \n\nI wanted to ask for some good k-drama recommendations on Netflix, I’m looking for a feel good, romance, slice of life with some drama. \n\nAny suggestions?",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qu6tbn/any_good_kdrama_recommendations/"
    }
]