[
    {
        "id": "1jdcu8m",
        "author": "ControlFreakAMA",
        "title": "Hi /r/movies! We are Kelly Marie Tran &amp; Shal Ngo, lead actress &amp; director of CONTROL FREAK, a body-horror that's now streaming on Hulu. Ask us anything!",
        "content": "",
        "upvotes": 125,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x8lwh6kg49pe1.png?auto=webp&amp;s=b52b2b912f2d1b3904eccef59da44ae992e6f009"
        },
        "permalink": "/r/movies/comments/1jdcu8m/hi_rmovies_we_are_kelly_marie_tran_shal_ngo_lead/"
    },
    {
        "id": "1jdoypp",
        "author": "SanderSo47",
        "title": "March 14-16 Box Office Recap: It was the worst weekend of the year, as 'Novocaine', 'Black Bag', 'The Day the Earth Blew Up: A Looney Tunes Movie' and 'Opus' underwhelmed. Meanwhile, 'Mickey 17' collapses a steep 61% on its second weekend.",
        "content": "https://preview.redd.it/tc7irrhhmbpe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=810ea1720f0b3db3221738848d968cb2f2c3bbf6\n\nIt was a brutal weekend for theaters.\n\nDespite five films opening in wide release, there wasn't a single film above $10 million this weekend, and all of them fell under their modest expectations. This allowed ***Novocaine*** to take the top spot, while last week's champ ***Mickey 17*** had a terrible second weekend drop.\n\nThe whole line-up earned a combined $50.8 million this weekend. That's not only a steep 42% drop from last year, but it's also the worst weekend of the year so far. There were so many empty screenings this weekend.\n\nDebuting in first place, Paramount's ***Novocaine*** earned $8.8 million in 3,365 theaters. Quite weak, but as mentioned, strong enough to get the top spot this weekend. For reference, Jack Quaid's previous film, ***Companion***, earned $9.3 million in its first weekend. \n\nEven though it hit the top spot, one can't help but feel like the film should've done higher than this. After all, the competiton was insanely weak and Paramount spend a lot on marketing, including a Super Bowl spot. But despite a selling point (an action comedy with a man who cannot feel pain), ***Novocaine*** failed to diffentiate itself from other streaming action flicks. The audience simply wasn't big enough for that, even if reviews were positive (82% on RT).\n\nAccording to Paramount, 58% of the audience was male, and 54% was in the 18-34 demographic. They gave it a very middling \"B\" on CinemaScore, which is not very encouraging for its long-term prospects. Maybe it can hold on well, but for now, it would be a surprise if ***Novocaine*** came anywhere close to $30 million by the end of its run. \n\nIn second place, Steven Soderbergh's ***Black Bag*** debuted with $7.6 million in 2,705 theaters. This debut already surpassed of Soderbergh's previous film, ***Presence*** ($6.9 million), although that film played in just 1,750 theaters and with a far smaller marketing spend.\n\nOn paper, this should be a very good debut. But the problem is that the film cost $50 million, putting it in even more pressure to deliver better numbers. This marked Michael Fassbender's latest financial misfire, after the failure of ***Next Goal Wins*** back in 2023. It's hard to think on something that could have improved these numbers. After all, the reviews are so damn fantastic (97% on RT, 85/100 on Metacritic). Like seriously, what could've been done?\n\nAccording to Focus Features, 56% of the audience was male. It skewed old; 59% of the audience was 35 and over. They gave it a middling \"B\" on CinemaScore, although that's better than ***Presence***'s \"C+\". Generally, a film aimed at older audiences leg out, so perhaps ***Black Bag*** could surprise in the long run. Nevertheless, no need to worry for Soderbergh; a few days ago, he confirmed that his new film, ***The Christophers***, has wrapped and could actually premiere this year. Wow, 3 films in a single year is crazy.\n\nAfter is disappointing debut last weekend, ***Mickey 17*** didn't save face on its second weekend. Despite keeping PLF screens (including IMAX), the film collapsed 61%, earning just $7.4 million this weekend. That's absolutely brutal, but sadly unsurprising, given the film's tepid word of mouth.\n\nThrough 10 days, ***Mickey 17*** has made just $33.3 million. And with ***Snow White*** premiering and taking away its PLF screens, it's gonna have another steep drop this weekend. WB has also pretty much given up; they announced the film will hit PVOD on March 25, just 18 days after its release date. Right now, a $45 million lifetime is the absolutely ceilling for ***Mickey 17***.\n\nIn fourth place, ***Captain America: Brave New World*** eased just 32% and added $5.6 million this weekend. That took its domestic total to $185.6 million, and it looks like it might hit $200 million after all. A hollow victory, nevertheless.\n\nDebuting in fifth place, ***The Day the Earth Blew Up: A Looney Tunes Movie*** flopped with just $3.1 million in 2,827 theaters. That's Ketchup Entertainment's biggest debut, but it's not really saying much, considering most of their films have flopped. We won't even bother comparing it to the previous ***Looney Tunes*** films.\n\nThis debut is not surprising. WB didn't really intend for the film to hit theaters, it was actually set for their Max streaming service. Due to a restructuring, they decided to shop the film, with Ketchup acquiring it. But still, the popularity of the ***Looney Tunes*** appears to have cooled in the past few decades. While ***Space Jam*** was a success, ***Back in Action*** flopped back in 2003 and ***Space Jam: A New Legacy*** failed to connect with audiences. Focusing the film on Porky and Daffy Duck while also omitting other characters like Bugs Bunny made it look like a non-event for many. Simply put, it's hard to ask for better numbers here.\n\nAccording to Ketchup Entertainment, 64% of the audience was male and 69% of the audience was in the 18-34 demographic. The film failed to connect with kids; they represented just 17% of the audience. They gave it a middling \"B+\" on CinemaScore, which is quite mediocre for a family film. With competition like ***Snow White*** and ***Minecraft*** on their way, this film will vanish quickly from theaters.\n\nPinnacle Peak released the Christian drama ***The Last Supper*** in 1,575 theaters, although it made just a weak $2.7 million this weekend. Even with an \"A–\" on CinemaScore, it's unlikely the film stays long in theaters.\n\n***Paddington in Peru*** eased just 28%, adding $2.6 million this weekend. The film's domestic total stands at $41.2 million so far.\n\nDreamWorks' ***Dog Man*** eased 25% and earned $2.5 million. With this, the film has earned $92.8 million, and it's fighting to hit the $100 million milestone.\n\nIn ninth place, Neon's ***The Monkey*** eased 36% and added $2.4 million this weekend. The film has amassed $35.2 million so far.\n\nRounding up the Top 10 was Focus Features' ***Last Breath***, which fell from the third spot. It dropped 44% and added $2.2 million. This took its lifetime gross to $18.5 million.\n\nA24's ***Opus*** finished all the way till 12th place, where it flopped with just $1 million in 1,764 theaters. This is not a surprise, given that A24 chose to scale back on marketing after the film received weak reviews in Sundance. With a \"C+\" on CinemaScore, this film will disappear quickly.\n\n#**OVERSEAS**\n\n***Mickey 17*** added $15.6 million overseas, taking its worldwide numbers to $90.4 million. Its best markets are South Korea ($17.9M), the UK ($5.8M), France ($5.3M), Germany ($2.8M) and Mexico ($2.5M). Not much to be said here.\n\n***Captain America: Brave New World*** added $6 million, taking its worldwide numbers to $388 million. The best markets are the UK ($22M), Mexico ($15.2M), China ($14.4M), France ($13.6M) and Korea ($11.3M). By next week, it should finally hit $400 million worldwide. Respectable number, but not really a success.\n\n***Black Bag*** debuted in 37 markets, where it earned $4.3 million, for a $12 million worldwide debut. Its best numbers were in France ($1.2M), UK ($1.1M) and Australia ($600K). It will continue expanding to more countries, although clearly not gonna be enough to recover its $50 million budget.\n\n***Novocaine*** didn't feel love in the rest of the world. Debuting in 19 countries, it made a very weak $1.8 million this weekend, for a $10.6 million worldwide debut. It had very weak debuts in Mexico ($607K), South Korea ($154K) and Indonesia ($126K/No. 3). Ouch.\n\nWith $2.054 billion, ***Ne Zha 2*** has passed ***The Force Awakens*** to become the fifth highest grossing film ever.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Wicked* | Nov/22 | Universal | $112,508,890 | $473,231,120 | $795,420,331 | $150M\n*Companion* | Jan/31 | Warner Bros. | $9,300,113 | $20,809,101 | $36,504,351 | $10M\n\n- ***Wicked*** has ended its run with a fantastic $795 million worldwide. A dazzling result, but the film managed to surpass our wildest expectations. It was not front-loaded as many feared, becoming the rare $100 million opener to hit a 4x multiplier. If this film surprised you, just wait for ***Wicked: For Good*** this year to get even higher.\n\n- ***Companion*** has ended its run after just 6 weeks, with a very weak $36 million worldwide. While the budget was $10 million, Deadline reported that WB spent a further $29 million in marketing, explaining that the film would be considered a success if it finished with $40 million-$50 million domestically. A figure that it couldn't even reach worldwide. Despite great reviews, the audience was very niche, and the film collapsed very quickly. Maybe it will find a life in streaming.\n\n#**THIS WEEKEND**\n\nWe're getting 3 wide releases, with a clear #1. But it's very likely all three are heading for some ugly numbers.\n\nAfter months of bad PR (among other things), Disney's live-action remake of ***Snow White*** is finally getting theaters after so many delays. Disney has had success with these films, and they're coming off the success of ***Mufasa***, which made over $700 million worldwide. But it looks like ***Snow White*** will be closer to the failure of ***Dumbo*** instead. Pre-sales are looking rough and Disney has already cancelled many events in advance, suggesting the film is not gonna surprise in a good way. This film cost $240 million (some estimating $269 million), putting even more pressure.\n\nWarner Bros. is also releasing Barry Levinson's gangster film ***The Alto Knights***, which stars Robert De Niro in a dual role as 1950s mob bosses Vito Genovese and Frank Costello. A notable aspect about the film; it's the first film that was greenlit when David Zaslav took charge as CEO of Warner Bros. Discovery. But with a low marketing spend (the first trailer was released just two months ago), it's likely that the film won't be able to find an audience.\n\nBriarcliff is also releasing Elijah Bynum's ***Magazine Dreams***, which stars Jonathan Majors as a bodybuilder. You may have heard of this film before, and it's because it premiered in Sundance back in January 2023. After earning some great reviews, Searchlight bought the film and scheduled it for December 2023. But then Majors' controversies (and subsequent conviction) caused Searchlight to drop the film. Don't expect good numbers for this film.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 77,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BP69OVMjl9N9mvzEeF1NblmLt2n1G8RXM1EjOX0vhJY.png?auto=webp&amp;s=c09d89a56232ff351bcb196a4487e60c906148aa"
        },
        "permalink": "/r/movies/comments/1jdoypp/march_1416_box_office_recap_it_was_the_worst/"
    },
    {
        "id": "1jdbhhw",
        "author": "MarvelsGrantMan136",
        "title": "Oscars: Conan O’Brien to Return as Host in 2026",
        "content": "",
        "upvotes": 15623,
        "comments": 592,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ho-hgFZDMj3cut68D9pXkfApHpu8CJUAssmfy3i_Bgw.jpg?auto=webp&amp;s=52155c211c276f675bf72b88564965f0caf35825"
        },
        "permalink": "/r/movies/comments/1jdbhhw/oscars_conan_obrien_to_return_as_host_in_2026/"
    },
    {
        "id": "1jdbv1w",
        "author": "LarryKeene",
        "title": "What movie is 10/10, yet hardly anyone has heard of it?",
        "content": "The Man From Earth.\n\nIt's about a history professor that suddenly decides to quit his job and move away. His fellow professors decide to leave the party, and during that time they ask him why he's leaving. He decides to tell them he's 14,000-years-old, and he has to move on when people realize that he doesn't age. That's not giving anything away about the movie, even if it seems like it is. It's an absolutely fantastic movie, where they try to decide if he's crazy, or if he's telling the truth.",
        "upvotes": 10293,
        "comments": 5189,
        "media": null,
        "permalink": "/r/movies/comments/1jdbv1w/what_movie_is_1010_yet_hardly_anyone_has_heard_of/"
    },
    {
        "id": "1jdeqfj",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'Mortal Kombat II'",
        "content": "",
        "upvotes": 5469,
        "comments": 770,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1g1yf5gnl9pe1.jpeg?auto=webp&amp;s=39f6d0941305834277f8d066cac07f7236e36bdc"
        },
        "permalink": "/r/movies/comments/1jdeqfj/first_images_from_mortal_kombat_ii/"
    },
    {
        "id": "1jdcly8",
        "author": "MarvelsGrantMan136",
        "title": "‘Joker’ and ‘Matrix’ Producer Village Roadshow Files for Chapter 11 Bankruptcy",
        "content": "",
        "upvotes": 1548,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2fpFeR4zBj327bP13kiP-Kpaukp7fSLNdIGmAd0d0Qc.jpg?auto=webp&amp;s=fad65e3d56b8b6e8a8c9763e946869315908d8be"
        },
        "permalink": "/r/movies/comments/1jdcly8/joker_and_matrix_producer_village_roadshow_files/"
    },
    {
        "id": "1jdepkc",
        "author": "ChiefLeef22",
        "title": "‘Final Destination’ turns 25: How an ‘X-Files’ Spec Script Led to One of Horror’s Most Unkillable Franchises",
        "content": "",
        "upvotes": 1050,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdyU5aOEzpjbh4lG4Y9DxuWia-t1sFzWXLSppA3YbtE.jpg?auto=webp&amp;s=e0e3baaf00a4037dafaefff09a0b88a309f4c99d"
        },
        "permalink": "/r/movies/comments/1jdepkc/final_destination_turns_25_how_an_xfiles_spec/"
    },
    {
        "id": "1jdql10",
        "author": "MarvelsGrantMan136",
        "title": "‘Saw XI’ Stalled Amid Inter-Squabbling",
        "content": "",
        "upvotes": 166,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wg5FZ5G-ggyMOOOyajmNJBqJ6YNqUOGOVKW7lXuudno.jpg?auto=webp&amp;s=bd8be2e00657bd8285aad164d3b27abb6824e20e"
        },
        "permalink": "/r/movies/comments/1jdql10/saw_xi_stalled_amid_intersquabbling/"
    },
    {
        "id": "1jdc4di",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Celine Song's 'The Materialists' Starring Dakota Johnson, Chris Evans, and Pedro Pascal- Follows a young, ambitious New York City matchmaker who finds herself torn between the perfect match and her imperfect ex.",
        "content": "",
        "upvotes": 909,
        "comments": 535,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jv9bsova09pe1.jpeg?auto=webp&amp;s=4f155f990cd11ceb6b53e83ca2f69294dfd58ab9"
        },
        "permalink": "/r/movies/comments/1jdc4di/new_poster_for_celine_songs_the_materialists/"
    },
    {
        "id": "1jdivww",
        "author": "joesen_one",
        "title": "Official trailer for 'The Ugly Stepsister', a body horror spin on the Cinderella tale",
        "content": "",
        "upvotes": 345,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BMHpVBmGPrxLqpl-6SnN4osDrriCxVgbFKTxk6NbuhU.jpg?auto=webp&amp;s=8c8a625acf9fe7e7ed3b78374dd27711100a4615"
        },
        "permalink": "/r/movies/comments/1jdivww/official_trailer_for_the_ugly_stepsister_a_body/"
    },
    {
        "id": "1jdg7ab",
        "author": "cmaia1503",
        "title": "Pamela Anderson Joining Ellen Burstyn &amp; Taika Waititi Drama ‘Place To Be’",
        "content": "",
        "upvotes": 430,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1hWYyFckPotH4WGVXSTNgL2NNRc8h-MqiKvcNIWPjiw.jpg?auto=webp&amp;s=d942585226ec144d7cbabd3d079da937b11e3950"
        },
        "permalink": "/r/movies/comments/1jdg7ab/pamela_anderson_joining_ellen_burstyn_taika/"
    },
    {
        "id": "1jdjxzj",
        "author": "Puzzled-Tap8042",
        "title": "Daisy Ridley &amp; Alden Ehrenreich Making A Date For Philippines-Set Rom-Com ‘The Last Resort’",
        "content": "",
        "upvotes": 126,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jaAYYTVKgAzL9n6HuOEilVmKm9s1v6tnxi1t3CNe7uY.jpg?auto=webp&amp;s=1272a4e43b07f8f290ffa763e3eb0296070f0be1"
        },
        "permalink": "/r/movies/comments/1jdjxzj/daisy_ridley_alden_ehrenreich_making_a_date_for/"
    },
    {
        "id": "1jdhaho",
        "author": "Arm_chair_gawd",
        "title": "Rock And Rule (1983)",
        "content": "This Movie Is Essentially Lost Media as it is hard to find\n\nInternet archives has both the Canadian and American versions\n\nhttps://archive.org/details/RockRuleBDCollection\n\nRock And Rule is a True lost gem from the 1908's. A very well animated Rock and Sci-FI based movie, similiar to Heavy Metal.\nDebbie Hary, Cheap Trick, Iggy Pop, and Lou reed all contribute to the sound track.\n\nWhile the\nMOK character was meant to be voiced by Mick Jagger, others suck as Michael Jackson were\nconsidered. Ultiamtlely it would have been too costly, and the studio had to settle for Lou\nreed and Iggy pop as singing voices.\nHowever the most interesting bit is that the original idea for MOK to summon the demon was\nto turn Omar, Angel, and the band into instruments with his evil science and magic.\n\n",
        "upvotes": 139,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w74dO_Md2BGsqXkzwOTyJ1mr9bHkDDJCy0Jgw71bANE.jpg?auto=webp&amp;s=6540efc13cee7e1a2e95af5f4cc4808c406fdfa0"
        },
        "permalink": "/r/movies/comments/1jdhaho/rock_and_rule_1983/"
    },
    {
        "id": "1jd5i5k",
        "author": "general_smooth",
        "title": "Watching Birdcage (1996) Years later hits very different",
        "content": "Many years ago, me and my wife were on a late honeymoon trip to a cold mountain town. Sadly she got a fever-cold on the second day and we were confined to the hotel room (She pressed me to go out and enjoy, but the cold weather and the cosy room was making me stay put). TV was showing a movie Birdcage, and I found it utterly hilarious. I was laughing out loud, and she was laughing at me laughing. I was laughing at the movie, and she was laughing at me laughing. It was a great evening.\n\nWith a lot of nostalgic feeligns, I decided to watch this movie again recently. But it was a very different experience. \n\nIf you don't know the plot it goes like this: Robbin Williams and Nathan lane are a gay couple running a drag show/gay club where Nathan is the star. Robbin's son is in love with the daughter of a very conservative senator.\nThe gay couple disguise themselves as a heterosexual couple in order to meet and impress the conservative family \n\nI guess when I watched it the first time around, I was young and naive, and I watched from the pov of the young couple who just want to get married somehow, and all troubles Armand and Albert go through made me laugh. \n\nNow I watch it from the pov of the parents (I myself a parent now) and it feels very sad in parts. To pretend to be someone who you are not, for someone else's convenience feels like a sad sacrifice you are making. One speech from Nathan almost broke me.",
        "upvotes": 962,
        "comments": 180,
        "media": null,
        "permalink": "/r/movies/comments/1jd5i5k/watching_birdcage_1996_years_later_hits_very/"
    },
    {
        "id": "1jdpxc7",
        "author": "Puzzled-Tap8042",
        "title": "Singer Jesse Colin Young dies at 83, he was on the soundtracks of the films \"True Lies\" (1994), \"Zabriskie Point\" (1970), and \"A Walk on the Moon\" (1999)",
        "content": "",
        "upvotes": 34,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zlTjNGduSM-Td_FfDajtvEtV_rEZPNC313GuyDdYAvU.jpg?auto=webp&amp;s=753586da9ca22a4d2a38b71144c9288396ec9ddb"
        },
        "permalink": "/r/movies/comments/1jdpxc7/singer_jesse_colin_young_dies_at_83_he_was_on_the/"
    },
    {
        "id": "1jcsgog",
        "author": "Unlucky-Bug2412",
        "title": "Actors Who Were Everywhere… Until They Weren’t",
        "content": "You ever notice how some actors are in everything for a few years and then just disappear? One day they’re headlining big movies, and the next, it’s like Hollywood pretends they never existed. No big scandal, no retirement announcement, just gone.\n\nTaylor Kitsch is a perfect example. After Friday Night Lights, it felt like every studio was pushing him as the next big star. He got John Carter, Battleship, and True Detective, but after a few flops, he just stopped getting those lead roles. Same thing happened with Josh Hartnett. In the early 2000s, he was in Pearl Harbor, Black Hawk Down, Sin City, and then he just kind of faded away. I heard he turned down playing Batman in The Dark Knight, which probably didn’t help. Who else do you remember being everywhere and then suddenly gone?\n",
        "upvotes": 5780,
        "comments": 5268,
        "media": null,
        "permalink": "/r/movies/comments/1jcsgog/actors_who_were_everywhere_until_they_werent/"
    },
    {
        "id": "1jddux6",
        "author": "WerdNerd88",
        "title": "H E Double Hockey Sticks (1999) A Devil-in-training is sent to Earth to steal the soul of a hockey player. Starring Wil Friedle, Matthew Lawrence, Rhea Perlman, and Gabrielle Union",
        "content": "I went looking for this movie after I heard Wil Friedle making fun of it on his podcast. According to him this is one of those movies that Disney is ashamed of for some reason so there are no VHS/DVD releases and it's not on Disney+ or any streaming. I couldn't even find a trailer.\n\nMovie: https://youtu.be/70iNxgQWbtM?si=m0yWw528spVQsfcy 13:50. Wil Friedle had his first very real panic attack shooting that scene. His panic attacks are what lead to him gaining weight on Boy Meets World due to the meds he was on and eventually led to him quitting acting for a while. He instead became an awesome voice actor.  After Boy Meets World ended we wouldn't see Wil on TV again until his hilarious return on Girl Meets World. https://youtu.be/OQxkGLWbDig?si=OjhSZ1Ql7pyLhFm2\n\nAs a lifelong fan of Wil Friedle I can't hate this movie. It's a DCOM. I'm not expecting Oscar level writing and acting.\n\nWil Friedle and Matthew Lawrence did a movie together? No wonder they worked so well together when Matthew came to Boy Meets World.",
        "upvotes": 118,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8xQcT6DCnKWMVjP9iwJ-HvrrpKUAibj6drBe8cdINfY.jpg?auto=webp&amp;s=087b83cbf663562e73497105b569c65ed212576d"
        },
        "permalink": "/r/movies/comments/1jddux6/h_e_double_hockey_sticks_1999_a_devilintraining/"
    },
    {
        "id": "1jdsg3x",
        "author": "Pooseygeuse",
        "title": "Romper Stomper (1992) - Another Aussie Classic!",
        "content": "",
        "upvotes": 18,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WlRqjDKHFTdf9Qo8Cwxx3Dg61CKpebFkkUEtPBQjiso.jpg?auto=webp&amp;s=30705c6463fdcd1e2fe11f1a716c70c5cd1baeec"
        },
        "permalink": "/r/movies/comments/1jdsg3x/romper_stomper_1992_another_aussie_classic/"
    },
    {
        "id": "1jdc7ra",
        "author": "outremer_empire",
        "title": "Werner Herzog: The 60 Minutes Interview",
        "content": "",
        "upvotes": 123,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZRaRxnWUD-nP9AN9Yb1T9EHs8pMGsBWbHT0VzI-hdp0.jpg?auto=webp&amp;s=ca2dbec41407ae01f1647433da00b60c446a4832"
        },
        "permalink": "/r/movies/comments/1jdc7ra/werner_herzog_the_60_minutes_interview/"
    },
    {
        "id": "1jdoab1",
        "author": "learningallthis",
        "title": "When life gets chaotic and uneasy, which movies do you recommend that nothing that bad happens - and it's actually very positive and happy?",
        "content": "I feel like I'm so used to working my way towards a happy ending in a movie. At this point, I'm back to watching old Disney animations, childhood cartoons, and romcoms with predictable happy endings. \n\n  \nPlease suggest any movies that are fun, colorful, happy, easy to digest movies that avoids pushing through something horrible to get to the happy ending.\n\n  \nI'm okay with indie movies as well if that makes a difference. TIA!",
        "upvotes": 26,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1jdoab1/when_life_gets_chaotic_and_uneasy_which_movies_do/"
    },
    {
        "id": "1jd06bf",
        "author": "Puzzled-Tap8042",
        "title": "Émilie Dequenne Dies: Belgian Cannes Best Actress Winner Was 43",
        "content": "",
        "upvotes": 1168,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ROZ5eQXfFukzDzEWLse5oe4uV2kEgGeDltJX9o9Zqow.jpg?auto=webp&amp;s=fdf91f4278b4271ccf7b417372d6b72205506ea3"
        },
        "permalink": "/r/movies/comments/1jd06bf/émilie_dequenne_dies_belgian_cannes_best_actress/"
    },
    {
        "id": "1jdp6ip",
        "author": "S1nclairsolutions",
        "title": "If You Could Choose Any Movie for a Sequel, What Would It Be?",
        "content": "We’ve all watched a movie that left us thinking, I need more of this. Whether it ended on a cliffhanger, had an amazing world to explore, or just felt like it deserved another shot, some movies are begging for a sequel.\n\nFor me, that movie is The Shadow (1994).\n\nAlec Baldwin as Lamont Cranston was perfectly cast, and the film had this moody, pulpy 1930s aesthetic that nailed the tone of the original radio shows and comics. The visual effects might be dated now, but the core concept—a crimefighter who manipulates shadows and the minds of his enemies—has so much potential with today’s technology. Imagine a modern director leaning into the noir vibes, sharpening up the action, and giving us a deeper dive into The Shadow’s mythology.\n\nIt’s wild to me that we’ve had so many superhero revivals, yet this one remains untouched. With the right creative team, it could be a stylish mix of The Batman and Doctor Strange—gritty, mysterious, and full of cool mind-bending sequences.\n\nSo, what about you? What’s a movie you wish would get a long-overdue sequel?",
        "upvotes": 22,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1jdp6ip/if_you_could_choose_any_movie_for_a_sequel_what/"
    },
    {
        "id": "1jdf4wp",
        "author": "herewego199209",
        "title": "Re-watched Menace II Society and Dead Presidents and I have no clue how the Hughes brothers never became as big as the other 90s directors like PT Anderson, Tarantino, Fincher, etc. Dead Presidents especially is one of the deepest period dramas I have ever seen and it was done for no money.",
        "content": "First things first, I absolutely dig the fact that the Hughes brothers are shamelessly Martin Scorsese fans and their homages are clear as day. You can tell they were heavily influenced by goodfellas and a lot of Scorsese's techniques from that movie. I think they use it far better than PT Anderson did a few years later with Boogie Nights where it comes off as copying more than actually creating a homage. The overall stories and characters in both movies are so layered and polished. I think both movies are about how as a society these young men are set up to fail and both movies chronicle their downfalls. \n\nDead Presidents to me is their true masterpiece. Larenz Tate gives what should've been a star making performance in this movie. They show brilliantly how in the 60s black men during the war were taken into the Vietnam war when they had absolutely nothing and then chewed up and spit out of the system and sent back into these neighborhoods  with severe PTSD and nothing to fall back on. The Chris Tucker scene where he explains his issues post war with PTSD and anxiety and the end where Tate explains he's a war hero and he gets zero leniency are so powerful to me. It's a shame.both brothers after that and their brilliant pimp documentary became directors for hire. ",
        "upvotes": 52,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1jdf4wp/rewatched_menace_ii_society_and_dead_presidents/"
    },
    {
        "id": "1jd2opc",
        "author": "Pooseygeuse",
        "title": "Remo Williams: The Adventure Begins (1985)",
        "content": "",
        "upvotes": 493,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M8ZY92bSdEOSoWFxbySSC9QwWgzULIvh_AP2hRNcno4.jpg?auto=webp&amp;s=8a92986a74d6fa38fd549c8fa6ba67617427aae2"
        },
        "permalink": "/r/movies/comments/1jd2opc/remo_williams_the_adventure_begins_1985/"
    },
    {
        "id": "1jdpqoy",
        "author": "GenButter",
        "title": "Bonjour Tristesse | Official Trailer",
        "content": "",
        "upvotes": 11,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aEKlAli76dJFJ87ljx7zkPxJzfot34ZVzvvnZGMfclc.jpg?auto=webp&amp;s=7af0dc19f2db8e8ba26877f68fd024a3f607292e"
        },
        "permalink": "/r/movies/comments/1jdpqoy/bonjour_tristesse_official_trailer/"
    },
    {
        "id": "1jdraco",
        "author": "Pooseygeuse",
        "title": "Bad Boy Bubby (1993) - A great Aussie movie that everyone should see at least once!",
        "content": "",
        "upvotes": 9,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OuMe4zCWL85hp7_QElabGMeC3Jx5WyJzfyAR0_EHJc8.jpg?auto=webp&amp;s=4878341892d6c16348df91f7757b4aeea35d116b"
        },
        "permalink": "/r/movies/comments/1jdraco/bad_boy_bubby_1993_a_great_aussie_movie_that/"
    },
    {
        "id": "1jdt2ys",
        "author": "indiewire",
        "title": "Cate Blanchett’s 12 Best Performances: ‘Black Bag,’ ‘Tár,’ ‘Carol,’ and More",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u6WHJdD_wQEgGkg0xbUm1GFQphe-VIHQw3-yjBgj_jA.jpg?auto=webp&amp;s=c61cd6b7c2461a30ecdec01e868395809dab9df9"
        },
        "permalink": "/r/movies/comments/1jdt2ys/cate_blanchetts_12_best_performances_black_bag/"
    },
    {
        "id": "1jdiqov",
        "author": "maomao19",
        "title": "gene hackman forgotten movie",
        "content": "I think Narrow Margin is one of the best movies ever made. It is amazing, tense thriller happening mostly on the train. I suggest you go watch it and give honors to late Gene Hackman.\n\nActing is superb, movie is from 1990 so little old but still feels new. I cant say anything bad, just  I wanted it to be longer. And the final scene where they arrive to Montreal it should not be skipped......",
        "upvotes": 20,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1jdiqov/gene_hackman_forgotten_movie/"
    },
    {
        "id": "1jcv4of",
        "author": "boib",
        "title": "Inside The Actors Studio episodes are being posted on youtube",
        "content": "",
        "upvotes": 917,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K24PYmv4cnM2j9-xknkmCbMUO5DRa2sarjApYf5v8DI.jpg?auto=webp&amp;s=5323ad4021d2c03d601f259b9e644fe5dd8dc331"
        },
        "permalink": "/r/movies/comments/1jcv4of/inside_the_actors_studio_episodes_are_being/"
    },
    {
        "id": "1jdg1fg",
        "author": "Amaruq93",
        "title": "How Fred Astaire filmed a dance scene on the ceiling in 1951's \"Royal Wedding\"",
        "content": "",
        "upvotes": 22,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jrhFm8-vhVKfFaeVYeLr1IQsyesZ4Sqa-1p7nczILj4.jpg?auto=webp&amp;s=1a4a82bf761c48a5b14a3a307f00106b2a0216c1"
        },
        "permalink": "/r/movies/comments/1jdg1fg/how_fred_astaire_filmed_a_dance_scene_on_the/"
    },
    {
        "id": "1jdktx6",
        "author": "Davis_Crawfish",
        "title": "Rosalind Russell is an amazing find for anyone interested in exploring classic Cinema. She was a dynamo, was as good in comedy as she was in drama",
        "content": "For modern audiences, especially gay men, she's still remembered as the iconic Auntie Mame but she was much more than that. \n\nShe had a stellar career, doing comedies like The Women, His Girl Friday, and at the same time, deliverin tour de forces in drama with Mourning Becomes Electra, a film for which she nearly won the Oscar for. \n\nShe was able to sustain a career for many years, played strong, independent women without turning them into shrews. Her knack for dialogue and comic timing was perfect as you can see in His Girl Friday. \n\nShe refused to run as supporting for Picnic because she saw herself as a leading lady only and you can't disagree given what she did with her career. \n\nWhen roles dried up as she got older, she wrote the script for a vehicle for her, using an alias, called Mrs. Polifax. \n\n\nIt blows my mind she never won an Oscar. She certainly deserved one.",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jdktx6/rosalind_russell_is_an_amazing_find_for_anyone/"
    },
    {
        "id": "1jd65h6",
        "author": "Serious_Specter",
        "title": "‘All We Imagine as Light’ Wins Best Film at the Asian Film Awards",
        "content": "",
        "upvotes": 121,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O8e0fpni-ELrUi7sV_8u6OfPLYYkccXiquxg5Un0-os.jpg?auto=webp&amp;s=324db309c34fa0d1b8b0e0fe46d696ff65035dac"
        },
        "permalink": "/r/movies/comments/1jd65h6/all_we_imagine_as_light_wins_best_film_at_the/"
    }
]