[
    {
        "id": "1qnurzw",
        "author": "MelBrooks99AMA",
        "title": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!",
        "content": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!\n\nSynopsis: \n\n&gt;Mel Brooks: The 99 Year Old Man! explores the life, career, friendships, and loves of legendary writer, director, producer, and performer, Mel Brooks. One of Hollywood’s most daring satirists from the early years of television sketch comedy through his film and stage hits, Brooks has held a funhouse mirror up to the human condition and used laughter as a path to resilience, connection, and joy for nearly a century. \n\nFilmmakers: Judd Apatow &amp; Michael Bonfiglio - Streaming on HBO Max\n\n[Trailer](https://www.youtube.com/watch?v=eKo_urZAm9o&amp;embeds_referring_euri=https%3A%2F%2Fpress.wbd.com%2F&amp;source_ve_path=MjM4NTE)\n\nAsk me anything! Back Tuesday 1/27 at 3 PM ET to answer questions. ",
        "upvotes": 54,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/as4hvzp6prfg1.jpeg?auto=webp&amp;s=5901eaca67d3738c4075cfecf3b944bb6bd6eda2"
        },
        "permalink": "/r/movies/comments/1qnurzw/hey_rmovies_im_michael_bonfiglio_i_directed_and/"
    },
    {
        "id": "1qnwrff",
        "author": "SanderSo47",
        "title": "January 23-25 Box Office Recap – With a heavy storm hitting the country, it was a very slow weekend. 'Mercy' and 'Return to Silent Hill' flopped domestically, although the latter over-performs overseas. '28 Years: The Bone Temple' collapses a brutal 73%, as it earns just $45M worldwide.",
        "content": "https://preview.redd.it/4u2mu07g2sfg1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=ef041b7869cf013daf69de97aa589b390ad676c2\n\nIt wasn't a good time to be at the movies this weekend, mainly due to a severe winter storm impacting part of the country, with many states reporting some of the lowest temperatures in years. That led to many theaters closing in many states, as people preferred to stay indoors.\n\nFor the first time, an ***Avatar*** film didn't have the top spot on its sixth weekend. Amazon MGM's sci-fi ***Mercy*** took the top spot, but it wasn't the triumph that would prove Chris Pratt's star power, while ***Return to Silent Hill*** had a very weak start. A lot of holdovers experienced rough drops, and unfortunately, ***28 Years Later: The Bone Temple*** lost the most ground.\n\nThe Top 10 earned a combined $44 million this weekend. That's down 16.9% from last year, when ***Flight Risk*** topped the box office on a low note. It's one of the lowest grossing weekends in quite a while.\n\nOpening at #1, Amazon MGM's ***Mercy*** flopped with just $10.8 million in 3,468 theaters. That's below Chris Pratt's last original title ***Passengers*** ($14.8 million), and that's with 10 years of inflation and IMAX screens. At the very least, it can gloat that it ended ***Avatar***'s reign at the box office.\n\nEven with the winter storm impacting business this weekend, these numbers are very poor. Hell, you could double them and it would still be underwhelming. Amazon MGM spent a lot of money in marketing, believing that this had potential as a theatrical release. But it had too many obstacles to overcome.\n\nOriginal sci-fi films have a hill to climb in terms of audience interest. At the end of the day, they don't have the familiarty nor the IP brand to help themselves. The premise is not bad by itself (an AI judge that can determine the guilt of the accused), but the presentation is where the problems show up. I mean, the film was pretty much sold on... Chris Pratt seated on a chair. For IMAX. None of the trailers look exciting, and the film itself looked like a bland combination of ***Minority Report*** and ***Source Code***. Given the influx of AI in our lives, perhaps audiences weren't interested in seeing something like that in theaters.\n\nBut the problem is perhaps Chris Pratt. Pratt's films have earned a combined $14.1 billion worldwide, making him one of the biggest stars today. But the thing is that these are all IP or franchise titles (Marvel, *Jurassic*, *Mario* and *LEGO*), and even in something like ***Mario*** and ***LEGO***, his voice is dubbed outside America, so they have no idea it's him. His last original title was ***Passengers*** with $302 million, and even then, credit has to be divided between him and Jennifer Lawrence. What does it mean? That Pratt failed to build a career with original titles that would show he has potential as a lead star. It's one thing to star in profitable films, but it's another thing to be the main reason why people watched it in the first place.\n\nAnd finally, reviews confirmed what everyone pretty much knew: this was a stinker. It's sitting at a brutal 21% on RT, and that was the nail in the coffin. \n\nAccording to Amazon MGM, 60% of the audience was male, and 76% was 25 and over. As mentioned, Pratt is not a big attraction and the data confirms it: only 31% went to watch the film because of him. They gave it a poor \"B–\", indicating weak word of mouth. Even if it can recover after the storm, the film will still fade out quickly. It'd be a surprise if it made it past $30 million domestically.\n\nWhether it's the storm or the loss of IMAX screens, ***Avatar: Fire and Ash*** was clearly impacted this weekend. It dropped a rough 56% drop, earning $6.4 million this weekend. The prior films had the luxury of weak competition, allowing it to stay #1 for 7 weekends, but that stat died this week. The film has earned $377.9 million domestically, and it's currently $220 million behind ***The Way of Water*** through the same point. Should cross $400 million domestically, but it has no chance in dethroning ***Minecraft***.\n\n***Zootopia 2*** dropped 42%, adding $5.3 million this weekend. That allowed the title to cross the $400 million domestic milestone. Given its drops, it looks like it will outgross ***Avatar*** in the domestic market as well.\n\nIn fourth place, Lionsgate's ***The Housemaid*** experienced its worst drop so far. It dipped 54%, easing $3.9 million this weekend. That takes its domestic total to $115.1 million.\n\n***Marty Supreme*** benefitted from its 9 Oscar nominations, for it had the best hold among the wide releases. It eased just 36%, earning $3.5 million this weekend. The film has amassed $86.2 million, and it still has a shot in hitting $100 million domestically.\n\nLast week, ***28 Years Later: The Bone Temple*** had a soft start. But there was hope that a great reception and word of mouth could propel it to better legs than its predecessor. Unfortunately, that wasn't the case here.\n\n***The Bone Temple*** earned $3.4 million this weekend, falling to sixth place. That's a brutal 73% drop, even larger than ***Years***' 67% drop. Hell, it's Nia DaCosta's second film to drop higher than 70%, after ***The Marvels*** (78%). Looks like despite the great response, the film has failed to attract casuals. Through 10 days, the film has earned a meager $20.5 million domestically. It's now set to close with less than $30 million domestically, basically less than half of what ***28 Years Later*** made.\n\nIn seventh place, we've got another failure. That's Cineverse's ***Return to Silent Hill***, which flopped with $3.2 million in 1,850 theaters. It's far off from the 2006 film ($20 million), and it's also below the terrible 2012 sequel ***Revelation*** ($8 million). Interestingly, each follow-up debuted with less than half of what the prior film made.\n\nThese numbers aren't surprising. The film was stuck in post-production hell, sitting in the shelf after filming wrapped in February 2024. There wasn't an audience anticipating this, and the performance of ***Revelation*** showed that the franchise peaked with the original film in terms of audience interest. Cineverse hasn't had much luck outside the ***Terrifier*** franchise, so this only had a minimal marketing push. And surprise surprise, the reviews were horrible (15% on RT). It will piss of video game fans, and it also pushed casuals out of the way. No demo numbers available, but with such a terrible response, this will disappear quickly from theaters.\n\nFathom Events' re-release of ***The Lord of the Rings: The Fellowship of the Ring*** added $2 million this weekend, taking its domestic total to $325.6 million. \n\nComing off its 8 Oscar nominations, Focus Features expanded ***Hamnet*** to 1,996 theaters. It added $1.8 million this weekend, taking its total to $17.4 million.\n\nRounding out the Top 10 was the rest of the trilogy, ***The Return of the King*** and ***The Two Towers***. Both made $1.6 million this weekend, taking their respective lifetime grosses to $383.5 million and $349.7 million.\n\nOutside the Top 10, Paramount's ***Primate*** collapsed 69%, earning $1.5 million. It has earned $23.4 million so far.\n\n***Anaconda*** was also heavily hit this week, for it collapsed 61% for a $1.3 million weekend. The film's domestic total stands at $62.1 million.\n\nSony released the music drama ***Clika*** in 522 theaters, earning just $1.2 million. Talk about just dumping in January.\n\nAfter being shut out of any Oscar nomination, Neon's ***No Other Choice*** dropped a steep 70%, earning just $659,647 this weekend. The film has earned $8.2 million, and it might miss $10 million now that it has lost all award buzz.\n\nSearchlight expanded ***The Testament of Ann Lee*** to 500 theaters, but with a lack of Oscar noms, it only mustered $558,133. The film has crossed $1.4 million domestically, but it probably won't make it much higher.\n\nWith their Best Picture nominations, ***The Secret Agent*** and ***Sentimental Value*** increased in theater counts, taking their domestic totals to $2.8 million and $4.5 million, respectively.\n\nFor some reason, Universal expanded ***Wicked: For Good*** to 853 theaters, probably banking on some Oscar nominations like the original. But with the film failing to score a single nomination, the expansion was a failure; it actually dropped 51% and made just $150,395. An anemic $176 per-theater average. The film will probably ends its run very soon.\n\nAfter becoming the two most nominated at the Oscars, WB re-issued ***Sinners*** and ***One Battle After Another*** into 800 theaters. But an estimated number on sales were not available.\n\n#**OVERSEAS**\n\nOnce again, ***Avatar: Fire and Ash*** topped the overseas box office with $28.1 million, taking its worldwide total to $1.378 billion. It also crossed the $1 billion milestone overseas. It should cross $1.4 billion by next week, although it really looks like $1.5 billion will be a bit complicated.\n\n***The Housemaid*** added a further $21.3 million overseas, taking its worldwide total to a fantastic $294 million. It's officially Paul Feig's highest grossing film, overtaking ***Bridesmaids*** ($288 million). Given its holds, it really looks like $400 million will become a possibility.\n\n***Zootopia 2*** isn't far behind with $20 million, taking its worldwide total to $1.744 billion. In China, the film crossed $632 million, officially overtaking ***Avengers: Endgame*** in US dollars, after it already overtook it in ticket sales a long time ago. $1.8 billion worldwide is happening.\n\nOften times, you find a film that doesn't attract an audience in North America, yet for some reason it connects with audiences outside the country. Well, that was the case of ***Return to Silent Hill***. It opened with a pretty good $16 million overseas, for a $19.2 million worldwide debut. For some reason, the film over-performed projections in China, opening with a pretty good $9.3 million. As a point of reference, that number is higher than any superhero film from last year. Although with poor word of mouth, it'll fizzle out quickly. But it's clear that international markets could save this film from complete embarrassment. I mean, it was higher than ***Mercy***.\n\nSpeaking of ***Mercy***, the film might use the \"winter storm\" card to excuse it soft debut, but it doesn't have that excuse for anywhere outside America. It opened with a weak $11.6 million overseas, for a poor $22.4 million worldwide debut. It had very poor debuts in China ($2.6M), Mexico ($965K), the UK ($866K), Japan ($700K), Australia ($660K), Germany ($515K), Spain ($415K), Italy ($370K), and Netherlands ($310K). This already represents 80% of its markets, and it suggests the film will struggle to recoup its $60 million budget. \n\n***Hamnet*** is showing a much stronger life outside America. It earned $9.1 million overseas, taking its worldwide total to $42.3 million. It opened in Spain with a solid $1.3 million, in France with $995K, and in Germany with $706K. The UK remains the top market with $16.2 million. With a strategic release date to seize on its Oscar nominations, the film will continue adding more markets like Mexico, Italy, Korea and Japan soon. It definitely looks like this is going to be a financial success in theaters.\n\nJust like the domestic market, ***28 Years Later: The Bone Temple*** is also collapsing overseas. It collapsed a steep 63%, earning just $6 million overseas, for a brutal $45.8 million worldwide run. Given its $63 million budget, there's no way around it; this is a box office failure. It will finish with less than half of what the prior film made worldwide. Sony was fully confident in its prospects, as they greenlit a planned third installment with Cillian Murphy in talks to reprise his role. But these numbers, and their horrible drops, suggest the audience interest might not align with their hopes. Is the third film still planned to happen? We'll see.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nWhile business should pick up after a low weekend, it shouldn't be a big weekend either way. But even then, there's two wide releases hoping to make some big impressions.\n\nThe first is 20th Century Studios' ***Send Help***, which marks Sam Raimi's first horror since ***Drag Me to Hell***. The film stars Rachel McAdams and Dylan O'Brien as an employee and her boss, respectively, who become stranded on a deserted island after a plane crash and attempt to survive while tension rises between them. Reviews are very positive so far (94% on RT), and with the weak line-up of newcomers, this could benefit as a big horror atrraction.\n\nBut there's one thing that can't be under-estimated, and that is ***Iron Lung***, which marks the directorial debut of the YouTuber Markiplier. Based on the video game, it stars Markiplier as a convict sent to explore an ocean of blood discovered on a desolate moon using a poorly constructed midget submarine. The project has reported very incredible pre-sales, and it wouldn't be surprising if it took the top spot. But will it appeal to others outside Markiplier's fanbase?\n\nBlack Bear is also launching Jason Statham's new action film ***Shelter***. The plot is... please. It's Jason Statham kicking ass. The plot is irrelevant. Nevertheless, you can't be blamed if you didn't hear this was coming out, given the very low marketing spend on Black Bear's behalf. Black Bear is just barely getting started as a distributor, and this is their second distributed film. The first was Sydney Sweeney's ***Christy***, which massively flopped back in November. If ***Shelter*** flops this weekend, it'll have more to do with Black Bear's terrible distribution than Jason Statham's involvement.\n\nA24 is also releasing ***The Moment***, a mockumentary starring Charli XCX. She is coming off the massive release of her album ***Brat***, which became a success. But early impressions aren't promising; it's sitting at a mediocre 57% on RT. Which suggests this will struggle to catch general audiences' interest.\n\nOh and there's also another thing. For some reason, Amazon decided that Melania Trump was so deserving of a documentary detailing the twenty days before Trump's second presidential inauguration. Well, it's finally happening, cause ***Melania*** is opening on Friday. Oh and it's directed by Brett Ratner, on his first film since he was accused by many women of sexual misconduct. It cost $40 million, along with $35 million more in marketing. Well, I guess it proves mockumentaries are still in theaters.\n\n#**STREAMING DATA**\n\nThis weekend, a new section debuts. Wouldn't it be interesting to see how these Netflix titles are doing? Well, that's the point of this section. As Netflix is the only streamer to report weekly figures for their Top 10, it'll be the only point of discussion in here. If there's some notable performance on other platforms, I'll report it. I won't report on all the titles, only focusing on the important ones.\n\nThis section is *exclusively for films*. So don't expect reports on how much ***Stranger Things***, ***Wednesday*** or any other big hitter show has done. That's r/television material, and it should stay there. Netflix combines the Top 10 with both its originals and acquired films, so that will be the point of discussion. There's two separate sections (English and Non-English), but instead of making two charts with both Top 10s, I'll just grab a Top 10 based on the views of each chart.\n\nYou'll notice the date is a bit delayed, but that's not a mistake. Netflix usually reports the weekly figures on Tuesdays, and these Weekend Actuals are posted on Mondays. So we don't have the report for January 19-25 yet, only January 12-18. Just in case you're asking.\n\nFigures for the week of January 12 to January 18:\n\nNo. | Movie | Year | Studio | Weeks in Top 10 | Views | Runtime | Hours Viewed\n----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *The Rip* | 2026 | Netflix | 1 | 41,600,000 | 1:53 | 78,300,000\n2 | *People We Meet on Vacation* | 2026 | Netflix | 2 | 23,300,000 | 1:58 | 45,800,000\n3 | *One Last Adventure: The Making of Stranger Things 5* | 2026 | Netflix | 1 | 8,700,000 | 2:03 | 17,900,000\n4 | *KPop Demon Hunters* | 2025 | Netflix | 31 | 7,300,000 | 1:40 | 12,100,000\n5 | *Suitcase Killer: The Melanie McGuire Story* | 2026 | Netflix | 1 | 4,100,000 | 1:27 | 6,000,000\n6 | *How to Train Your Dragon: The Hidden World* | 2019 | Universal | 2 | 3,200,000 | 1:44 | 5,600,000\n7 | *De De Pyaar De 2* | 2025 | PVR | 2 | 3,100,000 | 2:26 | 7,500,000\n8 | *Me Before You* | 2016 | Warner Bros. | 3 | 2,800,000 | 1:50 | 5,200,000\n9 | *Paw Patrol: The Movie* | 2021 | Paramount | 17 | 2,800,000 | 1:26 | 4,000,000\n10 | *Madagascar* | 2005 | DreamWorks | 4 | 2,700,000 | 1:26 | 3,800,000\n\nMaking its way to the top spot, and with just 3 days of data, is Joe Carnahan's action thriller ***The Rip***, starring Matt Damon and Ben Affleck. It debuted with 41.6 million views, which translates to roughly 78.3 million hours viewed. This is the biggest debut for a Netflix original title since ***Happy Gilmore 2*** back in July (46.7 million views and 91.9 million hours viewed). The film is carrying a reported $100 million budget.\n\nThe film gained notoriety because of a very rare arrangement for a Netflix original. The contract between Artists Equity (the production company owned by Damon and Affleck) and Netflix stipulated that the streaming service would agree to pay a one-time bonus to the 1,200 people who worked on the film if the films meets certain performance benchmarks within its first 90 days (a figure that has not been disclosed). This is a departure from Netflix's usual approach of paying a single, upfront fee to talent (which is why a lot of their films carry insanely high budgets). \n\nObviously, without knowing what the benchmarks are, we have no idea if it will be eligible to get that bonus. But considering the amount of buzzy titles over the past months, this is a very strong debut for ***The Rip***. Time will tell if this will become the first of many more deals for other originals.\n\nIn second place, rom-com ***People We Meet on Vacation*** gained 35% from its opening weekend, taking its 10-day total to 40.5 million views. The film led to a renewed interest in the book, which saw a 515% surge in audiobook listens on Spotify and climbed up the New York Times bestseller list to No. 8.\n\nWe ain't talking about ***Stranger Things*** here, but the documentary ***One Last Adventure: The Making of Stranger Things 5*** is technically in this section, so that's definitely a point of discussion. It debuted with 8.7 million views. Obviously not as high as the seasons, but it's foolish to expect that.\n\nShowing absolutely no signs of stopping was ***KPop Demon Hunters***, which hit 7.3 million views on its 31st week in this chart. An absolutely insane performance.\n\nThe only non-English title in the Top 10 was the Indian film ***De De Pyaar De 2***, managing to crack the seventh spot with 3.1 million views.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1qnwrff/january_2325_box_office_recap_with_a_heavy_storm/"
    },
    {
        "id": "1qnnjbc",
        "author": "MarvelsGrantMan136",
        "title": "Israeli Police Shut Down Jerusalem Screenings of Oscar Entry ‘Palestine 36’",
        "content": "",
        "upvotes": 6141,
        "comments": 259,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIEaF_Xt4d1XK71uIIgyFIjE9LDe77-ov_O4-OfL5hc.jpeg?auto=webp&amp;s=a711bc2255c7f5b5a4095c5847996064b4c61c3c"
        },
        "permalink": "/r/movies/comments/1qnnjbc/israeli_police_shut_down_jerusalem_screenings_of/"
    },
    {
        "id": "1qnxwhm",
        "author": "BunyipPouch",
        "title": "Anticipated Sequel ‘Ready or Not 2: Here I Come’ Moves Up Release Date to March 20",
        "content": "",
        "upvotes": 461,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BCCDIyKjA66-7TD7JRKn2jlqwHhNiIuqrepm55rbFkQ.jpeg?auto=webp&amp;s=51fa35b6ff7c9daba673f8881b91a284bcc354e7"
        },
        "permalink": "/r/movies/comments/1qnxwhm/anticipated_sequel_ready_or_not_2_here_i_come/"
    },
    {
        "id": "1qno3cy",
        "author": "ubcstaffer123",
        "title": "Black cakes and branded buckets: welcome to the White House premiere for Brett Ratner’s Melania movie",
        "content": "",
        "upvotes": 1148,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pp0YzQjsysQg8RHtZijLkJbzPmc9RStTrANZNvU8Epo.jpeg?auto=webp&amp;s=f2de8f446ed1f557779e48fb24b0065242d20088"
        },
        "permalink": "/r/movies/comments/1qno3cy/black_cakes_and_branded_buckets_welcome_to_the/"
    },
    {
        "id": "1qnh9as",
        "author": "MarvelsGrantMan136",
        "title": "‘One Battle After Another’ Wins Best Picture &amp; Best Director At Online Film Critics Society",
        "content": "",
        "upvotes": 2340,
        "comments": 435,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hZmzpphlJBkBzp9TakAW_dHdLtnWVB5hEgwbLci5sLE.jpeg?auto=webp&amp;s=f6c92356ab99375209f1b4e4d5d3eaca008b719d"
        },
        "permalink": "/r/movies/comments/1qnh9as/one_battle_after_another_wins_best_picture_best/"
    },
    {
        "id": "1qnz0r6",
        "author": "latchkey_adult",
        "title": "Sidney Kibrick, the last remaining kid actor from the Little Rascals/Our Gang short films, died a couple of weeks ago at age 97.",
        "content": "It didn't get a lot of attention in the news so I'm posting it here.  He played the character \"Woim\" which is \"Worm\" with a Brooklyn accent. He was Butch's buddy and therefore the enemy to Spanky and Alfalfa. He was the last of them that actually had a featured role (non extra). Sad for classic film and comedy fans. ",
        "upvotes": 313,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_PwH1lwh0dM8SSnkJIJnoC9JrEI-j9lENxFEIUrbVDU.jpeg?auto=webp&amp;s=ce79e5c595eee7699af4f52be84ab6d097448ec9"
        },
        "permalink": "/r/movies/comments/1qnz0r6/sidney_kibrick_the_last_remaining_kid_actor_from/"
    },
    {
        "id": "1qnlpk9",
        "author": "ChiefLeef22",
        "title": "Sam Raimi's 'Send Help' - Review Thread",
        "content": "*A woman and her overbearing boss become stranded on a deserted island after a plane crash. They must overcome past grievances and work together to survive, but ultimately, it's a battle of wills and wits to make it out alive.*\n\nCast: Rachel McAdams, Dylan O'Brien\n\n**Rotten Tomatoes:** [95%](https://www.rottentomatoes.com/m/send_help)\n\n**Metacritic:** [72/100](https://www.metacritic.com/movie/send-help/)\n\nSome Reviews:\n\n[IndieWire - Alison Foreman](https://www.indiewire.com/criticism/movies/send-help-review-rachel-mcadams-sam-raimi-1235175473/) - 'A-'\n\n&gt;Wickedly lovable with the potential to be timeless, “Send Help” is controlled delirium microwaved on high heat. At 66, Raimi reminds us who he was when he made horror-comedy history with “Evil Dead II,” and more importantly, why his voice still matters. Watching McAdams snarl and strategize, you can practically imagine how much fun Raimi would’ve had handing her a chainsaw in the ’80s.\n\n[IGN - Tom Jorgensen](https://www.ign.com/articles/send-help-review-rachel-mcadams-dylan-obrien-sam-raimi) - 9 / 10\n\n&gt;Sam Raimi drives the survival thriller genre to some amazing and sadistically giddy ends, with Rachel McAdams and Dylan O’Brien along for the ride in the back seat cackling and stabbing each other the whole way through. Linda and Bradley’s ordeal creates immensely fertile ground for Raimi to interrogate the validity of first impressions with twists and turns of the plot and of various sharp objects that seldom tire. Sure, drag me to hell, but let's stop at this island on the way and have a freakin’ party with Linda and Bradley!\n\n[HighonFilms - Liam Gaughan](https://www.highonfilms.com/send-help-2026-movie-review/) \\- 3.5/5\n\n&gt;To characterize “Send Help” as a standard “eat the rich” satire would be slightly dismissive, as the film is more centered on workplace culture than it is on class. The narrative kerfuffles in “Send Help” don’t mean that it’s a highly watchable cinematic experience that is intended to be experienced with a crowd that can wince, jeer, laugh, and cover their eyes in equal measure. O’Brien and McAdams are two actors who can find emotional truths in the characters, even if they’re incorporating idiosyncratic traits that feel entirely original. “Send Help” won’t go down as one of Raimi’s defining achievements, but it makes the case that he’s back within his comfort zone.\n\n[Variety - Peter Debruge](https://variety.com/2026/film/reviews/send-help-review-1236637527/)\n\n&gt;Essentially stripping all that’s “logical” from the psychological thriller genre, Raimi doesn’t seem especially concerned with plausible human behavior, preferring to keep audiences guessing as the characters’ motivations keep changing. Once the master of extreme practical effects (with then-accomplice Tom Sullivan), Raimi now relies far too heavily on digital tools — and that’s one thing that has no business on a desert island, where everything from fire to fresh water must be cultivated by hand.\n\n[InSession Films - 8/10](https://insessionfilm.com/movie-review-send-help/)\n\n&gt;This is a return to form for horror-fare Raimi, including a stellar performance from Rachel McAdams\n\n[SlashFilm - Chris Evangelista](https://www.slashfilm.com/2085042/send-help-2026-movie-review/) - 7 / 10\n\n&gt;I had oodles of fun watching Raimi go wild and give McAdams a chance to play the type of unhinged weirdo she hasn't really played before. This is the type of sturdy, bloody, silly January genre programmer we need on the big screen again.\n\n[Micropsiacine](https://www.micropsiacine.com/2026/01/send-help-review-rachel-mcadams-and-dylan-obrien-in-a-brutal-survival-duel/) \\- Diego Lerer\n\n&gt;Pessimistic and biting, violent yet undeniably entertaining, ***Send Help*** functions as a kind of metaphorical capsule for the “every man for himself” ethos of the contemporary world. For Raimi, it also represents a reboot of sorts—a return to form. The catch, perhaps, is that what once played as cynical, absurdist black comedy in the ’90s now feels uncomfortably close to reality.  \n",
        "upvotes": 1225,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jwc5-XyeHceHVJulmXu7L5ecJpJmm7NssDp1qwbYGLc.jpeg?auto=webp&amp;s=4e24936c5fdbfc0d51bb4f30bd44691d48544fe5"
        },
        "permalink": "/r/movies/comments/1qnlpk9/sam_raimis_send_help_review_thread/"
    },
    {
        "id": "1qntchf",
        "author": "BunyipPouch",
        "title": "Kevin Smith, Dan Aykroyd, Kim Basinger to Star in R-Rated Animated Stoner-Comedy 'Getting Lost' - The nephew of a legendary wilderness TV host decides to finish his uncle's final episode after he dies during a catastrophic on-air incident. He heads into the jungle guided by a the pot-smoking ghost.",
        "content": "",
        "upvotes": 398,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gNcaINN_bRmpFeTozy0ypssP9eCzLLXKi1iRWZQqJvo.jpeg?auto=webp&amp;s=5dd2f74e79a71e14a2bc04fc3e45555803aa70a4"
        },
        "permalink": "/r/movies/comments/1qntchf/kevin_smith_dan_aykroyd_kim_basinger_to_star_in/"
    },
    {
        "id": "1qnzly7",
        "author": "PeneItaliano",
        "title": "The Red Sea parting in The Ten Commandments (1956) took six months and $1 million to film. DeMille’s team flooded a massive tank with 360,000 gallons of water and reversed the footage",
        "content": "",
        "upvotes": 167,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pxsvfkzknsfg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qnzly7/the_red_sea_parting_in_the_ten_commandments_1956/"
    },
    {
        "id": "1qno3mb",
        "author": "GoldDerby",
        "title": "Ving Rhames reveals why he gave his Golden Globe to Jack Lemmon:",
        "content": "",
        "upvotes": 508,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TqwO6XlmEjdF0yUaWFAmZiLyPiNYP0ZNz5jPU09jI8o.png?auto=webp&amp;s=25b528607a004cc8aafdf4ab753a2ae8b7f12211"
        },
        "permalink": "/r/movies/comments/1qno3mb/ving_rhames_reveals_why_he_gave_his_golden_globe/"
    },
    {
        "id": "1qnlshd",
        "author": "SanderSo47",
        "title": "Official Poster for the IMAX Re-Release of Alejandro Gónzalez Iñárritu's 'The Revenant', In Theaters February 26 and March 1.",
        "content": "",
        "upvotes": 614,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q91ro9516qfg1.jpeg?auto=webp&amp;s=b9f24ccbfb394fc101064cd75dea7851844bf72a"
        },
        "permalink": "/r/movies/comments/1qnlshd/official_poster_for_the_imax_rerelease_of/"
    },
    {
        "id": "1qnmyoh",
        "author": "Morgan-Moonscar",
        "title": "Turner Classic Movies becomes “Ongoing Home” of the Looney Tunes library in exclusive six year deal | Starts in February, with 45 shorts featuring 'Star of the Month' Bugs Bunny",
        "content": "",
        "upvotes": 511,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gyxgwYPQUTOc0BiFUj7KYj70EMUWibDakCHEr4NNVHo.jpeg?auto=webp&amp;s=9eab7eeb54832f6e5a14a5ed2bec03304cefc772"
        },
        "permalink": "/r/movies/comments/1qnmyoh/turner_classic_movies_becomes_ongoing_home_of_the/"
    },
    {
        "id": "1qnlx9w",
        "author": "SanderSo47",
        "title": "Official Poster for Boots Riley's New Film 'I Love Boosters', Starring Keke Palmer, Naomie Ackie, Taylour Paige, Poppy Liu, Eiza Gonzalez, LaKeith Stanfield, Will Poulter, Don Cheadle and Demi Moore. – A group of shoplifters take aim at a cutthroat fashion maven.",
        "content": "",
        "upvotes": 477,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/td1jlcww6qfg1.jpeg?auto=webp&amp;s=c8cba58272629c16834d5161bba19d8737c7b348"
        },
        "permalink": "/r/movies/comments/1qnlx9w/official_poster_for_boots_rileys_new_film_i_love/"
    },
    {
        "id": "1qn4uw7",
        "author": "MarvelsGrantMan136",
        "title": "‘The Odyssey’: Travis Scott Appears in New Teaser for Christopher Nolan’s Epic",
        "content": "",
        "upvotes": 4892,
        "comments": 1628,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JkWR8cRA3q8nH4Ewwxjax0j2ZlpFtXPD_zWrqDRgab0.jpeg?auto=webp&amp;s=f9b2e570eed19884e1ff94cb1ae25b1c988541a8"
        },
        "permalink": "/r/movies/comments/1qn4uw7/the_odyssey_travis_scott_appears_in_new_teaser/"
    },
    {
        "id": "1qnxbdt",
        "author": "IceTrucKilla",
        "title": "I don't care what people say, Terminator Salvation is awesome!",
        "content": "Just re-watched Terminator Salvation and I've got to say, I didn't get the hate that movie received when it came out. It's so awesome! It's the only one that sets it during the War, it doesn't rely on time travel nonsense in a lame attempt to soft reboot the franchise, the Easter eggs and links to the 1st &amp; 2nd are well placed, and the action is badass. And Young Arnie as a T-800 looked amazing (as far as de-aging goes)! Yes, the marketing spoiled the twist (if you want to even call it that). I would honestly put it as the best of the franchise, after 1 &amp; 2 of course. T3 and everything since salvation has been a joke. I would rank this franchise as follows:\n\n  \n1. T2\n\n2. Terminator\n\n3. Terminator Salvation \n\n4.\n\n5.\n\n6. T3, Genisys, Dark Fate\n\n\n\nThoughts? Who's with me??",
        "upvotes": 76,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1qnxbdt/i_dont_care_what_people_say_terminator_salvation/"
    },
    {
        "id": "1qnfvci",
        "author": "Morgan-Moonscar",
        "title": "\"Tombstone\" (1993) - Wyatt Earp (Kurt Russell) forms a posse, with Doc Holliday (Val Kilmer) amongst them, to seek revenge on the 'Cowboys' gang",
        "content": "",
        "upvotes": 427,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xolu2dd51pfg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qnfvci/tombstone_1993_wyatt_earp_kurt_russell_forms_a/"
    },
    {
        "id": "1qmt330",
        "author": "ChiefLeef22",
        "title": "'Project Hail Mary' has an official runtime of 2 hours &amp; 46 minutes",
        "content": "",
        "upvotes": 13231,
        "comments": 1032,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w37nDR3x_rPAZ6Y-r0Y1ZhD3u1fAeVM_BDtLHda84e8.jpeg?auto=webp&amp;s=0f32b89763c54b8c0e3b6bb04f7655e4c1c753f3"
        },
        "permalink": "/r/movies/comments/1qmt330/project_hail_mary_has_an_official_runtime_of_2/"
    },
    {
        "id": "1qnptxa",
        "author": "tomservo88",
        "title": "What’s the best “Disney movie” that Disney didn’t make?",
        "content": "Listening to the scores from *E.T.* and *Close Encounters of the Third Kind* for a while got me thinking about this - they’re both movies with similar themes to some of the best Disney films, some combination of dreamers’ hopes coming true, rebellion, transition from one time in your life to another, all presented with a lot of weight and grandiosity. *Close Encounters* also directly references *Pinocchio* and contains a passage of “When You Wish Upon a Star” in the score.\n\nSee also *Hook*, also by Spielberg, and I would say *Star Wars*, and although Lucas has credited Disney’s films as an inspiration, I feel it overall is its own thing and pulls more from other wells. The two *Wicked* films are probably the best comparison for modern Disney, especially with the source material predating and having similar story beats to *Frozen* and the films copying that movie’s marketing/merchandise blitz.",
        "upvotes": 111,
        "comments": 311,
        "media": null,
        "permalink": "/r/movies/comments/1qnptxa/whats_the_best_disney_movie_that_disney_didnt_make/"
    },
    {
        "id": "1qn9hd0",
        "author": "pinkxxbubblegum",
        "title": "Modern movies (2015 - now) that don't have \"netflix lighting\"",
        "content": "I'm talking about movies that have ACTUAL color and film grain, like the secret garden 1993 or the princess diaries. I'm talking about movies that don't have lighting so perfect to the point where everything looks blatantly like a commercial, grey and dull. I posted it here because my other post on movie suggestions got taken down. I also want to add that I'm not particularly fond of dystopian and depressing films. I like upbeat, drama and feel good movies. Also please just don't put Wes Anderson films In the comments.",
        "upvotes": 832,
        "comments": 326,
        "media": null,
        "permalink": "/r/movies/comments/1qn9hd0/modern_movies_2015_now_that_dont_have_netflix/"
    },
    {
        "id": "1qnr0fl",
        "author": "SquabbleBoxYouTube",
        "title": "Commando: Proof the 80's Were F*cking Awesome",
        "content": "Yes, that's right, the 1980's truly were f\\*cking awesome. 1985 especially. Commando has a reputation for being so bad it's good... only it's so bad, it's absolutely amazing! Every one on set was no doubt aware how cheesy this was, and they didn't care, resulting in one of the most deliriously entertaining action films of all time. ",
        "upvotes": 75,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dNd1OI5YvqsvZ6xBjB8zoJwAnP_x1EKyfZtXj4tdobg.jpeg?auto=webp&amp;s=d8664babc587cd643416636a9004feb318dcef18"
        },
        "permalink": "/r/movies/comments/1qnr0fl/commando_proof_the_80s_were_fcking_awesome/"
    },
    {
        "id": "1qnu5el",
        "author": "E_Barriick",
        "title": "The Life of Chuck … wow! Thank you for the recommendation!",
        "content": "So yesterday I asked this community if they could help me find another movie like Shawshank redemption that took me for an emotional journey and left me with a smile on my face. \n\nThere were so many wonderful recommendations. Many I had scene and agreed with, but one person recommended “The Life of Chuck.” I have actually read the first part of the short story but never finished it. I wanted to see it in theaters but life got in the way. So when he told me it was on Hulu I jumped for it. Credits just rolled for me and wow!\n\nWhat a beautiful moment that covered so many heavy moments and ups and downs but ended with such a happy moment that I smiled. I couldn’t help it. It was exactly what I needed. This is going in my top ten and will be a regular rewatch for me. \n\nThank you Reddit for helping me find a new favorite moment! ",
        "upvotes": 53,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1qnu5el/the_life_of_chuck_wow_thank_you_for_the/"
    },
    {
        "id": "1qnw7dx",
        "author": "toe_slurper2000",
        "title": "Best scenes of people giving in/up and becoming numb?",
        "content": "I'm looking for scenes in movies and tv of characters kind of giving into their anguish or depression or grief or WHATEVER it is and acting numb. Examples would be Catelyn Stark right before her death in the red wedding when she realizes it's too late and nothing matters anymore, or Bob in Thunderbolts giving into his depression--\"But then there are a lot of *bad* days when I remember that nothing, nothing matters.” *“So you’re just gonna sit here and let it take over?”* “Well there’s no use in fighting it. Least I found a nice room. The other rooms are *much* worse.”",
        "upvotes": 34,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1qnw7dx/best_scenes_of_people_giving_inup_and_becoming/"
    },
    {
        "id": "1qnz8f5",
        "author": "BunyipPouch",
        "title": "'Marty Supreme' Breakout Odessa A’zion to Star in ‘Deep Cuts’ at A24 from Director Sean Durkin ('The Iron Claw') - Joining Cailee Spaeny and Drew Starkey",
        "content": "",
        "upvotes": 26,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WH3BLlOEfAoc1JDqlNX4X_wlCLFtCqMHQKvvPn21INs.jpeg?auto=webp&amp;s=a6bb73e18cb0da704b346a5ceb498a6569ff142d"
        },
        "permalink": "/r/movies/comments/1qnz8f5/marty_supreme_breakout_odessa_azion_to_star_in/"
    },
    {
        "id": "1qmpmjt",
        "author": "TheChristmas",
        "title": "What’s the funniest reason you’ve heard for somebody not liking a movie?",
        "content": "My 3 year old saw a statue of E.T. At the coffee shop and was really into it. He got excited when I told him it’s from a movie. He got stoked and spent the whole day asking when we could watch it.\n\nThat night, halfway through the film he asks “Can we turn it off? E.T. SUCKS.”\n\nSo I asked him “what sucks about it?” and he replied “E.T. walks too slow. He sucks.” \n\nPretty funny. Got me wondering what other funny reasons people have for not liking particular films.",
        "upvotes": 6462,
        "comments": 2680,
        "media": null,
        "permalink": "/r/movies/comments/1qmpmjt/whats_the_funniest_reason_youve_heard_for/"
    },
    {
        "id": "1qnspac",
        "author": "_RikVa_",
        "title": "Movies with a focus on PNW wild nature?",
        "content": "Im obsessed with the beauty of the pacific northwest and in general of the stunning nature of north america so i would like some recommendations of movies that showcase this like, for a recent example, Train Dreams, but also Revenant, Into the Wild and Prey. Even though they are not set in the PNW id say movies like 28 years later and Stand by Me have some of what im looking for as well.\nAnyway do you guys have any recommendations for this type of film? \n\ni look away for 30mins and i see 70 replies lmao guys thank you so much im already losing track of all the recommendations 😭🙏",
        "upvotes": 31,
        "comments": 174,
        "media": null,
        "permalink": "/r/movies/comments/1qnspac/movies_with_a_focus_on_pnw_wild_nature/"
    },
    {
        "id": "1qmzhmr",
        "author": "SanderSo47",
        "title": "The Raid (2011, dir. Gareth Evans) – Rama fights the machete gang.",
        "content": "",
        "upvotes": 1581,
        "comments": 139,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tkdpuzhxzkfg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qmzhmr/the_raid_2011_dir_gareth_evans_rama_fights_the/"
    },
    {
        "id": "1qo06hg",
        "author": "RockingPie",
        "title": "The teenage sex scene that sparked infamous rift between edgy director brothers [Benny &amp; Josh Safdie] behind Hollywood’s hottest movies",
        "content": "",
        "upvotes": 21,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JvHSc8eIIyKdF8vGcGRpCeVxYhvAUl7Y8tx3ZJJU2q4.jpeg?auto=webp&amp;s=3b4532b606052adc63d504e3c06c29cbf05932de"
        },
        "permalink": "/r/movies/comments/1qo06hg/the_teenage_sex_scene_that_sparked_infamous_rift/"
    },
    {
        "id": "1qnez3c",
        "author": "herequeerandgreat",
        "title": "informal trilogies.",
        "content": "when we talk about movie trilogies, we typically talk about movies that are all part of one series. however, there are trilogies in existence that consist of unrelated movies that are tied by certain things, be them themes, actors, directors, etc.\n\nperhaps the most famous example of this is edgar wright's three flavors cornetto trilogy. it consists of shaun of the dead, hot fuzz, and the world's end. these 3 films are connected by writer/director edgar wright, stars simon pegg and nick frost, and the appearance of cornetto ice cream. however, there are other examples.\n\nmany directors have these. john carpenter has the apocalypse trilogy, ingmar bergman has the silence of god trilogy, wong jing has the colors trilogy, luico fulci has the gates of hell trilogy, terry gilliam has the imagination trilogy, luca guadagnino has the desire trilogy, alejandro G inarritu has the death trilogy, baz luhrmann has the red curtain trilogy, park chan wook has the revenge trilogy, roman polanski has the apartment trilogy, oliver stone has the vietnam war trilogy, and gus van sant has his own death trilogy.\n\nsometimes, unrelated movies form a trilogy due to having the same actor be in similar situations. for example, the weird reality trilogy consists of 3 films where jim carrey's life takes a turn for the strange. this trilogy consists of the truman show, bruce almighty, and eternal sunshine of the spotless mind. george clooney considers the first 3 movies he made with the coen brothers to be a trilogy, even dubbing it the idiots trilogy. nic cage has the beige volvo trilogy, which consists of the rock, con air, and face/off. these are 3 action movies starring nic cage and featuring a beige volvo.",
        "upvotes": 83,
        "comments": 344,
        "media": null,
        "permalink": "/r/movies/comments/1qnez3c/informal_trilogies/"
    },
    {
        "id": "1qnnvb2",
        "author": "EIDuderino",
        "title": "I noticed a hidden message during the end credits of John Carpenter's The Thing (1982).",
        "content": "At the point during the end credits when the style changes from slideshow to scrolling, there is a message contrasted on the black background that reads something to the effect of:\n\n91-91\n\n288-6\n\nCABLE\n\n4-20\n\nFor context, this is a 1987 MCA Video VHS release. It is NOT burn-in on the TV screen nor does it have anything to do with the CRT TV it is displayed on. It is part of the actual print of the film, and only visible during this credits transition. Any insight on what it means is welcome.",
        "upvotes": 21,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6iyohrkoiqfg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qnnvb2/i_noticed_a_hidden_message_during_the_end_credits/"
    }
]