[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iz1co8",
        "author": "anonRedd",
        "title": "What We Watched the Second Half of 2024",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz1co8/what_we_watched_the_second_half_of_2024/"
    },
    {
        "id": "1j04ns3",
        "author": "S4v1r1enCh0r4k",
        "title": "The Night Agent was the most streamed show between Jan. 27-Feb. 2, 2025 with 2.92 billion minutes",
        "content": "",
        "upvotes": 19,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j04ns3/the_night_agent_was_the_most_streamed_show/"
    },
    {
        "id": "1j0907w",
        "author": "Pogrebnik",
        "title": "Netflix to Adapt Audible' Vampire Audio Drama, 'Impact Winter,' as TV Show",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0907w/netflix_to_adapt_audible_vampire_audio_drama/"
    },
    {
        "id": "1izf0wa",
        "author": "Sweaty-Toe-6211",
        "title": "Millie Bobby Brown Urges Fans to 'Be Patient' for Final Season of “Stranger Things”: 'It Is Worth It, I Promise'",
        "content": "",
        "upvotes": 377,
        "comments": 232,
        "media": null,
        "permalink": "/r/netflix/comments/1izf0wa/millie_bobby_brown_urges_fans_to_be_patient_for/"
    },
    {
        "id": "1j00l7x",
        "author": "Much_Inevitable9031",
        "title": "FED UP with the household ordeal",
        "content": "I am SO SICK of this stupid household thing that mention has been pushing down everyone’s throats. i am so close to cancelling my whole account but i genuinly love some of the shows. i am a COLLEGE STUDENT DUDE I STILL AM DEPENDENT ON MY PARENTS so why aren’t blocking all my TV’s and my phone today said it wasn’t part of the household. are you seriously being for real? that makes no sense to be because you take your phone everywhere with you. This has been bothering more and more as i get blocked from watching. ",
        "upvotes": 13,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1j00l7x/fed_up_with_the_household_ordeal/"
    },
    {
        "id": "1j00oq5",
        "author": "EthanWilliams_TG",
        "title": "Netflix Bets Big on Canada with a Chilling New Monster Show",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j00oq5/netflix_bets_big_on_canada_with_a_chilling_new/"
    },
    {
        "id": "1j02oet",
        "author": "Robemilak",
        "title": "Everything Coming To (&amp; Leaving) Netflix in March",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j02oet/everything_coming_to_leaving_netflix_in_march/"
    },
    {
        "id": "1j096j4",
        "author": "visceration167",
        "title": "New UI on firestick",
        "content": "Haven't seen any posts in this, but Pl ase please change the ui back. A few month backs they made it where a row took up the entire screen and could only see 3 shows at a time. They reverted it and now it's back. Looks terrible and takes ages to find what show I'm looking for. Anybody else hate this new ui? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j096j4/new_ui_on_firestick/"
    },
    {
        "id": "1j08a6r",
        "author": "Substantial-Week-258",
        "title": "Emilia Perez not available on Australian Netflix?",
        "content": "Was curious to check out a bit of this movie and it's nowhere to be found on Australian Netflix? The oscars are this Sunday and this movie leads the pack with the most nominations and I can't even check it out?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j08a6r/emilia_perez_not_available_on_australian_netflix/"
    },
    {
        "id": "1izga6c",
        "author": "EthanWilliams_TG",
        "title": "Netflix’s Latest Engagement Report Shows What’s Truly Driving Views",
        "content": "",
        "upvotes": 59,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1izga6c/netflixs_latest_engagement_report_shows_whats/"
    },
    {
        "id": "1izwn7r",
        "author": "HotPinkTuesday",
        "title": "“Zero Day” Proteus Plot Q",
        "content": "At one point in the series, Valerie tells the Mullen that he should avoid going back home because that may be where the Proteus is being used on him. He sleeps in his office for like one or two nights and then starts going back home again. Did I miss something where they concluded that possible threat no longer existed? 👀\n\nI know he found that bug in the bird feeder in the last episode that Valerie had checked out and told him was probably nothing. But that just made me even more confused. 😂",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izwn7r/zero_day_proteus_plot_q/"
    },
    {
        "id": "1j04g7n",
        "author": "GdsAriel",
        "title": "Clickbait - have you seen it?",
        "content": "Not gonna spoil it because it would be too hard to anyway lmao. Has anyone seen it? I absolutely loved it because I watch so much that I say “I always see things coming” but this one!???? Every episode I thought something different! What would you guys rate it and why? I’m gonna do 9/10. Giving a 9 because can they just have made it a movie instead of 6 or so episodes? It would be easier to rewatch for me that way lol. Personal gripe. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j04g7n/clickbait_have_you_seen_it/"
    },
    {
        "id": "1izif1m",
        "author": "Leading-Bug-Bite",
        "title": "The Way Havana Syndrome Was Brought To Life in Zero Day",
        "content": "Tell me it's Havana Syndrome without telling me it's Havana Syndrome was a subtle and brilliant move by Netflix in Zero Day. It was very interesting to see that they dared bring this sensitive topic to life as the US government finally admitted that there is indeed such a thing and it's officially referred to as anomalous health incidents (AHI).\n\nTo the naked eye, viewers who aren't really in the know would see the symptoms as something related to more exposed mental issues such as Dementia, Alzheimers or even Schizophrenia. Netflix did a great job there. The alternative of directly confirming that it was Havana Syndrome would have been terrifying for inquiring minds. Leaving the culprit to the viewers's interpretation was mindful. The thought of goverments having the capability to remotely mess with people's brains is best left in the Sci-Fi, Horror or Dystopian genres. \n\nIn general Zero Day and the topics discussed are beyond most people's comprehension of possibilities and capabilities meeting real-life. There were obvious political points that distract viewers from the overall themes given our current political climate. This will obviously lead to negative reviews from those who are too passionate about their political affiliations to see the series as anything other that political propaganda pushing conspiracy theories. A risk that Netflix willingly took for the greater good?\n\nThere were some things that were the product of a bit of research and imagination. Other things were clear political warnings of the IFs.\n\nIn the end, I sincerely wondered who the real consultants for Zero Day were. Some things in Zero Day were too real for comfort. ",
        "upvotes": 21,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1izif1m/the_way_havana_syndrome_was_brought_to_life_in/"
    },
    {
        "id": "1j01vwi",
        "author": "peebloescobar",
        "title": "Is it just me of the true crime \"The Puppet Master\" made you also feel as if the victims were just too gullible?",
        "content": "I am sorry if this sounds like victim-blaming. I usually never do it. But it is hard to believe that so many people would just obey a man claiming to be an MI5 agent without having any proof and giving him their inheritance and what not for 10 years or more?! He didn't even hit them or coerce them. They just believed him. How does that even happen? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j01vwi/is_it_just_me_of_the_true_crime_the_puppet_master/"
    },
    {
        "id": "1izjxco",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game' Season 2 was the most-watched show on Netflix in Q2 2024, in only 5 days",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izjxco/squid_game_season_2_was_the_mostwatched_show_on/"
    },
    {
        "id": "1iz3un2",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Zero Day is so poor",
        "content": "Just finished Zero Day and it was excruciating. Apart from the terrible plot and hammy dialogue most of the actors looked like they were phoning it in apart from Jesse Plemons. Netflix has been in decline for years now and while it still produces a good show now and again the overall output has been horrendous. I know De Niro has a lot of alimony to pay but it's sad to see him in sub par tv shows like this.",
        "upvotes": 202,
        "comments": 176,
        "media": null,
        "permalink": "/r/netflix/comments/1iz3un2/zero_day_is_so_poor/"
    },
    {
        "id": "1izgp3i",
        "author": "Yuck_Few",
        "title": "Cassandra",
        "content": "For the love of Glob, just push the robot over and then smash the control panel in the basement \nOr just don't pay the electric bill?\nNothing about that story made any sense",
        "upvotes": 19,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1izgp3i/cassandra/"
    },
    {
        "id": "1iznklr",
        "author": "NostalgicRetro73",
        "title": "How can you tell if you’ve seen a show on Netflix?",
        "content": "There’s so many true crime shows on different streamers, I don’t know if I’ve seen that particular documentary.  Like American Nightmare.  I remember watching a documentary on that story, but Netflix has it as new as if I never watched it. But I swore I watched a documentary about the missing woman reappearing etc.  Does NF erase bookmarks on the shows I watch, and makes them look like I never watched them? 🤷",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1iznklr/how_can_you_tell_if_youve_seen_a_show_on_netflix/"
    },
    {
        "id": "1izgpuv",
        "author": "Pogrebnik",
        "title": "'Pokémon Concierge' Season 2 Will Debut in September on Netflix",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izgpuv/pokémon_concierge_season_2_will_debut_in/"
    },
    {
        "id": "1iyt6v9",
        "author": "Flat-Creek93",
        "title": "The Woman in the House Across the Street from the Girl in the Window",
        "content": "I’m going preface this by saying I’m a complete moron. I had no clue this was satire until like the last or second to last episode. In my defense, I knew nothing about this show when I clicked on it and was slightly preoccupied when I watched it. But OMG looking back on it, there’s so much dumb stuff I missed that’s absolutely hilarious. I might have to watch it again.",
        "upvotes": 440,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1iyt6v9/the_woman_in_the_house_across_the_street_from_the/"
    },
    {
        "id": "1izwjlf",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Top 10 Netflix Shows",
        "content": "My Top 10 Netflix Shows made by Netflix\n\n1. Mindhunter\n2. Stranger Things\n3. Godless\n4. Orange is the New Black\n5. House of Cards\n6. Ozark\n7. Unbreakable Kimmy Schmidt\n8. Narcos\n9. Russian Doll\n10. Lupin\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1izwjlf/top_10_netflix_shows/"
    },
    {
        "id": "1izvkns",
        "author": "Pale_Prior814",
        "title": "Need help with preview video audio always on now",
        "content": "General background info:\nI have the netflix app on my laptop, for the longest time it would keep audio muted on the preview videos and i could just toggle it on to hear with sound when I wanted to.\n\nProblem:\nSound is now always on for the previews and i have to mute every time I open the app, the big preview netflix always shows on the home page blasts at full netflix volume when i have it max 10 whenever watching anything on netflix and on my computer in general\n\nQuestion:\nDoes anyone know why its defaulting to having the preview audio always on now and how to fix it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izvkns/need_help_with_preview_video_audio_always_on_now/"
    },
    {
        "id": "1izvit2",
        "author": "Frank3634",
        "title": "New &amp; Popular",
        "content": "I always come here on Mondays to see what is new. It has been helpful not to keep track of all the shows. Just learned that Toxic Town was added to Netflix and never saw it in New &amp; Popular, how accurate is it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izvit2/new_popular/"
    },
    {
        "id": "1izz1h7",
        "author": "kevinsevin2",
        "title": "Why most of my show are gone",
        "content": "I was gonna watch some anime like solo leveling and tomo-chan but I can't seem to find them anymore this happened yesterday on my phone but it was still available on my tv so I didn't care too much Abt it. But today they are gone and there are only Netflix made shows now can someone tell me what happened?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1izz1h7/why_most_of_my_show_are_gone/"
    },
    {
        "id": "1izz7om",
        "author": "i-love-reddit13",
        "title": "cannot think of what show this is",
        "content": "i was trying to tell my friend about a quote from a show but now i cannot remember what the show was or even who the characters were 😭 can anyone tell me??\n\nits like that one show where the guy was like i would give you an 8 on my scale and thats out of 11 but 8 is the best 11 is worse than 8 and 7 is worse than 8 DO I SOUND INSANE BRO I CANT REMEMBER IT",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1izz7om/cannot_think_of_what_show_this_is/"
    },
    {
        "id": "1iza29u",
        "author": "MrHaZeYo",
        "title": "I wish streaming services had options to make your own like TV station.",
        "content": "This applies to all of the big ones (hulu, Disney, Netflix, max, etc)\n\nSo what I mean is:\n\nSay I want to pick 10 TV shows and put them in a queue of sorts. The service plays 1-3 episodes of show A, then auto changes to show B, then C, etc. \n\nIt'd be cool to be able to also have an app that has all of the services your paying for all in one. The services still get your money, and you get everything from one app.",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1iza29u/i_wish_streaming_services_had_options_to_make/"
    },
    {
        "id": "1j00dv1",
        "author": "AZULDEFILER",
        "title": "Why don't Voice-over actors have the accent of country in the show?",
        "content": "Netflix constantly does this. I just watched an old Thai man scream in a Texas accent. Can't Netflix get Voice-over actors with the local accent?! Kills immersion ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j00dv1/why_dont_voiceover_actors_have_the_accent_of/"
    },
    {
        "id": "1izp2ik",
        "author": "giagiu8",
        "title": "Catalog and search results are completely different on fire stick and mobile, am I missing something?",
        "content": "I watch mostly horror movies and I've recently noticed (since I've been using it more) that when I check the catalog on tv I literally get suggested the same movies and shows over and over again both on the homepage and under the single movie (\"similar to this\"), and even when typing 'horror' in the search bar- to the point where I started believing that Netflix genuinely had just those few horror movies. \nI don't really use Netflix on my phone but I opened it today to find a completely different homepage: not only I had more movies, but the ones that I keep getting suggested on the tv don't pop up until I scroll for a bit. Even the same movies I watched, in the \"similar\" section have more suggestions. \n\nIs it a fault of the firestick's app or is there an extra setting I need to toggle to see all of them, or something along those lines?\n\nFor now I can just use the mobile app to add them to my list so I can easily find them again, but it's kinda annoying",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izp2ik/catalog_and_search_results_are_completely/"
    },
    {
        "id": "1izbj82",
        "author": "Morganbanefort",
        "title": "CHAOS: The Manson Murders | Official Trailer | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izbj82/chaos_the_manson_murders_official_trailer_netflix/"
    },
    {
        "id": "1izklso",
        "author": "MiniNoodles",
        "title": "Netflix Special Fan Screening Email - Real or Fake?",
        "content": "Hi everybody,\n\n  \nI've been sent an email by [theelectricstate@netflixevents.com](mailto:theelectricstate@netflixevents.com) about attending a Netflix special fan screening for The Electric State in London next week. Is this a real email? There isn't any branding on the email and I can't find any information about the event online so I just want to make sure it's real before emailing back!\n\n  \nThanks everyone!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1izklso/netflix_special_fan_screening_email_real_or_fake/"
    },
    {
        "id": "1izuhjj",
        "author": "jredjolly",
        "title": "Netflix Extra Member Deleted My Account",
        "content": "I am the primary account holder and my parents who live in a different household are also on the account. We finally got forced to split our accounts. I learned about the extra member feature, and initially moved my mom there first. I then realized the price per month only includes one extra member. No worries yet. I realized I should make myself the extra member and my parents the primary. \n\nWell, well, well, this is most certainly not an option! I moved my mom back to the primary account which *obviously* deleted her Netflix history (apparently joining the extra member spot is a *one way trip*). I then also learned that the primary member cannot move themselves to the extra member spot nor transfer the primary status to a different account. \n\nSo in the end I whipped my mom’s history and my only option is to make myself a new account as the extra member. Such a cluster. Netflix sucks as does its customer support. I asked for an email to give feedback and support told me that was also their job…",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1izuhjj/netflix_extra_member_deleted_my_account/"
    }
]