[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hplhai",
        "author": "S4v1r1enCh0r4k",
        "title": " Park Sung Hoon Apologizes After Accidentally Sharing Nude 'Squid Game'-NSFW Video Cover ",
        "content": "",
        "upvotes": 707,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1hplhai/park_sung_hoon_apologizes_after_accidentally/"
    },
    {
        "id": "1hqgxd9",
        "author": "LastOnesLeft92",
        "title": "Sorting away already viewed materiel",
        "content": "Is there any way to remove already viewed materiel?\n\nFeels like there is no point for Netflix in filling my screen with things I have already seen or rated.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqgxd9/sorting_away_already_viewed_materiel/"
    },
    {
        "id": "1hqhu77",
        "author": "WastedTalent442",
        "title": "How Should TV Shows Be Released?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqhu77/how_should_tv_shows_be_released/"
    },
    {
        "id": "1hqa8ss",
        "author": "noneofmybusines",
        "title": "Can you suggest some mystery or crime drama",
        "content": "I wanna watch a mystery or crime thriller movie. I can’t find any new. Can you suggest some?\nI want something that is either originally made in English or Hindi.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hqa8ss/can_you_suggest_some_mystery_or_crime_drama/"
    },
    {
        "id": "1hqh2ch",
        "author": "The-Raccoon-Is-Here",
        "title": "Netflix and Travelling ",
        "content": "I am on the road for work regularly.  Will Netflix allow two people to use it if they have different locations or will i have to tell the household they are out of luck if I want to use the account while in a different time zone (since I assume this looks like account sharing to them).\n\nAlso how much time of commercials do you see if you sign-up for the cheaper option on a 90 minute movie?\n\nNever previously considered Netflix but one of the hotels I frequent has blocked devices from functioning on their TVs (so no more travelling with a firestick).",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqh2ch/netflix_and_travelling/"
    },
    {
        "id": "1hqgi5a",
        "author": "skullywogging",
        "title": "Squid Games season 2.",
        "content": "Separation.\n\nThey say they love giving others a choice on if they live or die.  But it's not true.  \n\nWhile leaving players in game, if the vote to leave and split the earnings failed, is fair. \n\nThere should be a 3rd option where players can leave with nothing if they don't want to continue. \n\nBecause if I don't want to play anymore others shouldn't decide if I do or don't.  \n\nWhat do you think? \n ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqgi5a/squid_games_season_2/"
    },
    {
        "id": "1hq5a69",
        "author": "MechanicalKiller",
        "title": "Squid Game 2 (slight spoilers)",
        "content": "Idk why but a lot of people thought this was going to be a “cash grab” even though the first season set up a season 2.\n\nI honestly think that this season out does season 1. It was cool seeing more sides of the Squid Games other than the games themselves.\n\nLee Jung-jae does an incredible job in showing the development his character went through and how it has matured Gi-hun.\n\nNew additions like Thanos, Kim Jun Hee, Cho Hyun-ju and others were great additions to the show. \n\nAnd seeing the mastermind play the games, at one point, i thought he actually turned good. But later events proved otherwise…\n\nI want to specifically point out that those last 2 episodes were also INSANE.\n\nMy only complaint is how the season ends, in my opinion it was a bad spot to end it. It kinda feels like were in the middle of an episode and BOOM, ending.\n\nI cant wait to see how season 3 picks up, especially after how it ended.\n\nAnd this last thing is kind of a tangent. I wonder if David Finchers American remake wont be a remake, but possibly a spin off, showing that the organization is global, and season 3 could possibly set that up.",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hq5a69/squid_game_2_slight_spoilers/"
    },
    {
        "id": "1hqeflj",
        "author": "RumB96",
        "title": "Only the children profiles seem to work on my Fire HD 8 (10th gen)",
        "content": "\nSo I have been using Netflix on my tablet for a while now.\n\nAll of a sudden today it stopped working. I click on my profile and it crashes. \n\nI have cleared data, cleared cache, restarted the device, uninstalled and reinstalled etc, used a different network connection… nothing works. The Netflix app is up to date. \n\nEvery other app works fine, I.e. prime video, Iplayer etc. \n\nThe very odd thing is that the children’s profiles seem to work completely fine. Can’t figure it out at all. I called Netflix and they’ve escalated the issue but something tells me they won’t be able to fix it.\n\nHas anyone else experienced this? It’s driving me mad. I use Netflix a lot!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqeflj/only_the_children_profiles_seem_to_work_on_my/"
    },
    {
        "id": "1hqdqf6",
        "author": "khush-sk",
        "title": "Show not on my profile, but appears just fine on a different profile on the same account.",
        "content": "On the TV and tablet it's the same except an option for Gilmore Girls does appear, but it doesn't have a play or continue watching option. Same with Better Call Saul. The thumbnail is in my continue watching but there's no play option.\n\nhttps://preview.redd.it/fecw0q60h6ae1.jpg?width=1236&amp;format=pjpg&amp;auto=webp&amp;s=5b1cab50273aa98573c588033f6c2e9d7d92cb48\n\nhttps://preview.redd.it/i1ufib9zg6ae1.jpg?width=1231&amp;format=pjpg&amp;auto=webp&amp;s=a636f4097a11cddd66c10006e37a9e56d6e319bf\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqdqf6/show_not_on_my_profile_but_appears_just_fine_on_a/"
    },
    {
        "id": "1hqd8gy",
        "author": "Flashy_Savings_8482",
        "title": "The best documentary that should be made for Netflix.",
        "content": "If you're a documentary buff and or into travelling the world this documentary is incredible and its made with out a budget. \n\nOnce you learn about Alex Rust and his adventures around the world, its a person you won't forget.  This so should be on Netflix or remade with a budget, it's already a 5 star watch without the funds available.\n\n[https://www.youtube.com/watch?v=ibP5IQxId34&amp;t=3s](https://www.youtube.com/watch?v=ibP5IQxId34&amp;t=3s)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqd8gy/the_best_documentary_that_should_be_made_for/"
    },
    {
        "id": "1hqcfai",
        "author": "Lord-LabakuDas",
        "title": "The duality of humans. ",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqcfai/the_duality_of_humans/"
    },
    {
        "id": "1hq4zd7",
        "author": "Asianmalaysion",
        "title": "Everything now says “remind me” / unavailable ",
        "content": "For some reason (mainly on my iPad) everything is not available and I have to restart the device or something idek, and eventually it works and my shows come back but sometimes it doesn’t work. Anyway it’s super annoying when I can’t watch a show I was just watching and then not a single thing is available when I try to put something on as a replacement",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hq4zd7/everything_now_says_remind_me_unavailable/"
    },
    {
        "id": "1hpyemy",
        "author": "TimesandSundayTimes",
        "title": "David Beckham pockets $36m as Netflix show boosts business empire",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hpyemy/david_beckham_pockets_36m_as_netflix_show_boosts/"
    },
    {
        "id": "1hqavxn",
        "author": "IGR777",
        "title": "Is there a way to see the actual list of movies/shows coming?",
        "content": "Ok, so the other day I was looking at what netflex has coming later, and I didn’t really see anything interesting (other then interstellar on Jan 1) but then out of nowhere I see 2 mad Max fury roads, then dune 2 the second day. All no where to be found in coming this week or next. So is there a way to know the actual movies and shows coming?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqavxn/is_there_a_way_to_see_the_actual_list_of/"
    },
    {
        "id": "1hqcx7t",
        "author": "jason2306",
        "title": "Does anyone know the current status of 5.1 with netflix? Did they just straight up remove it?",
        "content": "I've seen some posts from a few months ago but is there anything changing? I can't see any show with a 5.1 icon and none of them work with 5.1 be it in the windows 10 app or edge browser. This is insane, netflix is constantly becoming worse and asking for more lol",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqcx7t/does_anyone_know_the_current_status_of_51_with/"
    },
    {
        "id": "1hpp81t",
        "author": "TheGod4You",
        "title": "The Watchers, Furiosa: A Mad Max Saga, and Horizon: An American Saga are now on Netflix (US).",
        "content": "",
        "upvotes": 20,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hpp81t/the_watchers_furiosa_a_mad_max_saga_and_horizon/"
    },
    {
        "id": "1hpsmvf",
        "author": "hedoesntgiveashit",
        "title": "Any British Shows Recommendations? ",
        "content": "Some of the British movies/ shows are just really well made, and I miss hearing the accent lol (used to live there). \n\nThe ones I liked so far: *Peaky Blinders, The Gentlemen, Cunk on Earth, Bodies*\n\nAll very very good shows.\n\nAlso, is The Crown any good? I tried watching the first episode but didn't enjoy it.\n\nAnyway, feel free to make any suggestions! ",
        "upvotes": 11,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1hpsmvf/any_british_shows_recommendations/"
    },
    {
        "id": "1hqb6g6",
        "author": "Salty_Bill6588",
        "title": "[Confirmation] Is Netflix down?",
        "content": "Been trying to login to my netflix account and kept getting the error message “we are having technical difficulties…”. Tried several times in between 15 to 20-minute intervals and no luck. Is Netflix down?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqb6g6/confirmation_is_netflix_down/"
    },
    {
        "id": "1hpjx0f",
        "author": "Whobitmyname",
        "title": "'Mad Max: Fury Road' Is Now on Netflix",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hpjx0f/mad_max_fury_road_is_now_on_netflix/"
    },
    {
        "id": "1hpr2iz",
        "author": "rk-hunter",
        "title": "How many seasons planned for One Hundred Years Of Solitude?",
        "content": "I fully enjoyed One Hundred Years Of Solitude. The end of season 1 is at the book's chapter 7, and the book has 20 chapters in total. Will it take another season, or two more seasons to finish the whole story? Can't wait to see it.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hpr2iz/how_many_seasons_planned_for_one_hundred_years_of/"
    },
    {
        "id": "1hpgn0j",
        "author": "JaymehKhal",
        "title": "Squid Game season 2 covered so little ground.",
        "content": "I feel like it spent way too much time on the games and the voting, to the point where you're giving each character very little screen time outside of little convos here and there. You don't care about most of them because meh I barely know them. You knew virtually every time when someone would die (and conveniently the old woman and pregnant woman are fine from the night brawl....).\n\nAnd then the sub plots....what a waste of time. Got virtually nothing out of them. After the North Korean girl becomes a worker, every second with her felt so pointless.\n\n\nI'm pretty disappointed. Feel like the show didn't get into the nitty gritty of the interesting questions at all. First episode was good fun if nothing else but I really didn't like the direction it went in at all. Maybe would've been better to just release season 2 and 3 in 1 go but this felt like a lot of filler again.\n\n(Also, the insurrection at the end was dumb as shit. Why would they go along with that? And the whole time Gi Hun is iffy about 001 but never suspects it might be the same as last time? Wtf?)",
        "upvotes": 38,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1hpgn0j/squid_game_season_2_covered_so_little_ground/"
    },
    {
        "id": "1hq3icq",
        "author": "Butterscotch_740",
        "title": "Question about Carry On ",
        "content": "Was the original plan to kill that Mateo guy on the plane with everyone else? \n\nThe fact that the traveler asked him to kill Ethan seems to kind of confirm it, but I can’t be sure whether that was just because Ethan was being a pain in the ass and uncooperative. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hq3icq/question_about_carry_on/"
    },
    {
        "id": "1hq3c4l",
        "author": "Chepto2019",
        "title": "Q about Households",
        "content": "Hi, I pay for Netflix Premium, which includes 4 devices at the same time. (I never download stuff.) While it is super rare that we watch on even 2 devices simultaneously, I often have been traveling to my parents house (as they are elderly and I take turns caring for them), and I recently tried to login there. I updated my household to there because it prompted me to do so, but it kicked my husband out at our residence. It prompted him the same, but then it kicked me out. Is it not possible to watch on 2 different WiFi sources at the same time? Is there not a travel option? I swear there used to be, but again, I haven't been in this situation for many months. What do you suggest? Do I need a second email for my husband? Can I have 2 profiles on my account? Should I downgrade to Standard since I obviously don't make use of Premium? Thanks for your advice. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hq3c4l/q_about_households/"
    },
    {
        "id": "1hqbifk",
        "author": "S4v1r1enCh0r4k",
        "title": "Squid Game Star Park Sung Hoon is now facing \"cancellation\" due to sharing disturbing NSWF images on his social media. Fans are calling for him to be recast in the upcoming K-Drama  The Tyrant's Chef due to obvious reasons...",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hqbifk/squid_game_star_park_sung_hoon_is_now_facing/"
    },
    {
        "id": "1hq2o6l",
        "author": "indiewire",
        "title": "'Squid Game': 5 Burning Questions from Season 2",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hq2o6l/squid_game_5_burning_questions_from_season_2/"
    },
    {
        "id": "1hps8rv",
        "author": "marblefadex",
        "title": "Is the John McAfee Documentary any good? ",
        "content": "I recently came across Running with the Devil: The Wild World of John McAfee and was wondering if it’s worth a watch. I’ve heard the guy was pretty strange",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hps8rv/is_the_john_mcafee_documentary_any_good/"
    },
    {
        "id": "1hq2cot",
        "author": "Original2021",
        "title": "Six Triple Eight would have been better as a tv series than a movie.",
        "content": "It's surprising this idea was a movie and not a series.This movie was such an important part of history there's definitely potential for a follow up series.  Tyler Perry gave an interview and talked about Lena and Abram's story. It was surprising to hear that Lena and Abrams's story really happened. There's a prequel there somewhere. There's also room to hear how other women who served in the battalion came to the unit.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hq2cot/six_triple_eight_would_have_been_better_as_a_tv/"
    },
    {
        "id": "1hpku2e",
        "author": "noneofmybusines",
        "title": "What would be the one show you would recommend ??",
        "content": "I am bored and want to watch something on Netflix or any other ott. What would be your top recommendation?? \nIt can be any movie or series that you like. I looking some recommendations that would blow my mind and help me find under rated content on Netflix ",
        "upvotes": 11,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1hpku2e/what_would_be_the_one_show_you_would_recommend/"
    },
    {
        "id": "1hq1171",
        "author": "loopy741",
        "title": "Norbert Butz Voice Actor in La Palma?",
        "content": "Just started watching La Palma. It's good so far, but it's driving me bananas that I can't confirm if Norbert Leo Butz (one of the brothers in Bloodline, also Bill Belichick in a recent Aaron Hernandez show on FX) is doing the English voiceover of the dad, Fredrick, in La Palma.\n\nAnyone know for sure? Google is not helping me. \n\nThanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hq1171/norbert_butz_voice_actor_in_la_palma/"
    },
    {
        "id": "1hq3t8k",
        "author": "notjordansime",
        "title": "Stepdad is a waterbomber pilot and works seasonally. He’s having issues logging into our Netflix from Australia ",
        "content": "Something to do with “Netflix households”. We are one family, with one billing address, it’s not like we’re sharing it with a friend and trying to scam a free account out of it. He works winters in Australia and summers in the NWT. He’s the one who pays for our Netflix, but can’t access it. He doesn’t have time to contact support with their crazy wildfire season in Aus right now. How can I get the Netflix going for him? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hq3t8k/stepdad_is_a_waterbomber_pilot_and_works/"
    }
]