[
    {
        "id": "1nnicpi",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 24,
        "comments": 1931,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnicpi/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1nmo15w",
        "author": "IcefoxX5",
        "title": "[Match Thread] CA Osasuna Promesas - Real Madrid Castilla | Primera Federación, Matchday 4",
        "content": "#FT: OSASUNA B 1:0 CASTILLA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Ander Yoldi 22'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kick off, vamos! \n\n5' - the streaming platform is showing the wrong match... Every year it's a new platform, but the same incompetence in this league... \n\n15' - first quarter of an hour is gone, LaLiga+ has not noticed their error so far, and I still can't watch the game - I hope the team started well... \n\n⚽ 22' - Osasuna score - I still cannot watch the match\n\n35' - 34 minutes played, and they finally put the correct match! \n\nHT - obviously I could only watch the last 10 minutes, but the way Castilla are playing is straight up alarming, they fail to create any danger at all, can't get tempo into their attacking and are also shaky in defense despite little pressure by Osasuna who focus on defending their lead\n\n46' - 2nd half underway \n\n🔄 59' - first sub, Yáñez on for Pol Fortuny \n\n🔄 66' - next sub, Loren Zúñiga for Thiago Pitarch. An absolutely terrible second half of the team so far, absolutely no danger whatsoever\n\n70' - Fran González keeps the team in the match with a great 1v1 save after an easy counter by Osasuna - this team needs to wake up! \n\n76' - a penalty is reviewed for a pull on Loren Zúñiga, but the ref does not change his decision. For me, it was not enough\n\n🔄 78' - Palacios off for Gabri Castrelo, last sub \n\n79' - first good chance for Castilla in possibly the entire game - Castrelo's shot from a tight angle is saved nicely by their keeper\n\n82' - Aguado takes a rebound on the volley nicely, but it flies just over the bar \n\nFT - an absolutely awful performance by Castilla leads to the third loss in a row, without scoring a single goal, or I'd even say, without generating a single clear cut chance for the past 270 minutes. With the U20 World Cup coming up and Fortea, Pitarch, Cristian, Fran and Aguado being out for at least a month, this situation can go from bad to worse if Arbeloa doesn't rethink everything about the way he sets up this team, this way of playing doesn't work, we need to give up the control so there is some space to play into, especially since we don't have any attacker that can make the difference by himself against a tough defence\n\n&amp;#x200B;\n\n**Kickoff:** 12:00 CET\n\n**Venue:** Instalaciones Deportivas de Tajonar, Pamplona\n\n**Referee**: Aimar Velasco Arbaiza\n\n**Competition:** Primera Federación, Grupo 1, Matchday 4\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Lamini Fati, Joan Martínez, Jesus Fortea - Jorge Cestero, Thiago Pitarch (66' Loren Zúñiga), Manuel Ángel - Bruno Iglesias, César Palacios (78' Gabri Castrelo), Pol Fortuny (59' Dani Yáñez) \n\nBench: Guille Súnico (GK), Alejandro Moya, Mario Rivas, Manu Serrano, Víctor Valdepeñas, Cristian David, Roberto Martín, Jacobo Ortega. \n\nUnavailable: Sergio Mestre (first team call-up), David Jiménez (first team call-up), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WWLL\n\n**1ª RFEF stats:** 16th | 3pt | 1-0-2 | 2:3\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nmo15w/match_thread_ca_osasuna_promesas_real_madrid/"
    },
    {
        "id": "1nofec7",
        "author": "chunchunmaru1129",
        "title": "Congratulations to Dembele he deserved it wish Vini got the same treatment in 2024",
        "content": "",
        "upvotes": 838,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k94l2mx3mwqf1.jpeg?auto=webp&amp;s=54564f3497f70424d3b28b499d98f689b6520e41"
        },
        "permalink": "/r/realmadrid/comments/1nofec7/congratulations_to_dembele_he_deserved_it_wish/"
    },
    {
        "id": "1nofy64",
        "author": "Ok-Degree-7821",
        "title": "Thoughts on this? This hateful statement against Vini was from Rebecca Lowe last year. Yamal literally did the exact same thing yesterday and now she is silent.",
        "content": "Her instagram is @rebeccalowetv. Lots of people are pushing her to do a statement there. Im not asking for you to throw hate comments at her but just genuinely ask her what she thinks of Yamal doing the same thing now. Since the speech she gives here feels borderline racist. We are all wondering what she has to say about this.",
        "upvotes": 317,
        "comments": 116,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kgevxvuqqwqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nofy64/thoughts_on_this_this_hateful_statement_against/"
    },
    {
        "id": "1no0eps",
        "author": "Deezwend",
        "title": "There is a Madridista in Paris...",
        "content": "",
        "upvotes": 1287,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1bj1bhqrjsqf1.png?auto=webp&amp;s=647357e81d56540b30df2a4ebd964362c9a4f7ac"
        },
        "permalink": "/r/realmadrid/comments/1no0eps/there_is_a_madridista_in_paris/"
    },
    {
        "id": "1nojjqw",
        "author": "Disastrous-Duty-8152",
        "title": "My personal fav seasons of the real Madrid players I have shown",
        "content": "Cristiano 2017/18\n\nBenzema 2021/22\n\nVini 2023/24\n\nBale 2016/17 \n\nModric 2021/22\n\nCasemiro 2019/20\n\nRodrigo 2023/24\n\nDi Maria 2013/14\n\nSergio Ramos 2016/17 \n\nMarcelo 2016/17 \n\nCassilas 2007/2008\n\nRaul 2000/2001\n\nZidane 2002/2003\n\nSalgado 2002/2003\n\nVarane 2016/17\n\nKroos 2023/24\n\nCarvajal 2023/24\n\nTibo 2021/22\n\nOzil 2010/11 \n\nRaul 2000/2001\n\nWhat are Ur opinion on this?",
        "upvotes": 53,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nojjqw/my_personal_fav_seasons_of_the_real_madrid/"
    },
    {
        "id": "1no6cwl",
        "author": "Ok-Fold6928",
        "title": "This Is Why Mourinho is a Real Madrid Legend",
        "content": "",
        "upvotes": 363,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/219j43mawtqf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1no6cwl/this_is_why_mourinho_is_a_real_madrid_legend/"
    },
    {
        "id": "1no4w3n",
        "author": "Ok-Fold6928",
        "title": "With Beligol and Cama back, it’s time to bring this back too",
        "content": "",
        "upvotes": 229,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9jreffl0ltqf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1no4w3n/with_beligol_and_cama_back_its_time_to_bring_this/"
    },
    {
        "id": "1nno7mp",
        "author": "chunchunmaru1129",
        "title": "CR7 doesn't have a weak foot he has a strong foot and a stronger foot",
        "content": "I can't believe the amount of goals he has scored with his left foot which is just ridicoulous.I think he has scored the most with his weak foot among  anyone in football history. \n\nI think calling his left foot his weaker foot is wrong in my opinion CR7 has a Strong foot and then a stronegr foot.\n\nBecause the goals he scores with his left foot are like goals most other players score with their strong foot. ",
        "upvotes": 1614,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3hrok4yc9qqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nno7mp/cr7_doesnt_have_a_weak_foot_he_has_a_strong_foot/"
    },
    {
        "id": "1no4u95",
        "author": "mounteverest04",
        "title": "ESPN pundits said they would have voted for Lamine Yamal and Dembelé's ballon d'or is a one off",
        "content": "ESPN pundits are crying because Lamine Yamal didn't win the ballon d'or. They slapped Vini's face on the thumbnail. Those guys always pretend to complain that it's a popularity contest. Yet, when they rewarded it to probably the most deserving player in years, they start whining about it. ",
        "upvotes": 191,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XWcWFjFiFOTqAYnoPB2HeAF9lEBuEeA8vG_TFSiULGg.jpeg?auto=webp&amp;s=0997b6d2f6c9dd598d5f214fb2d5c95f81461cdf"
        },
        "permalink": "/r/realmadrid/comments/1no4u95/espn_pundits_said_they_would_have_voted_for/"
    },
    {
        "id": "1no765n",
        "author": "EffectiveTie3144",
        "title": "Latest pickup of the Real Madrid 06/07 season away kit.",
        "content": "",
        "upvotes": 105,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1no765n/latest_pickup_of_the_real_madrid_0607_season_away/"
    },
    {
        "id": "1no90rz",
        "author": "Imnotunderage420",
        "title": "Facing against haramball.",
        "content": "This team is getting better and better every game but the ONE concern that Xabi needs to solve is going up against low blocks. This squad is full of talented players to not be able to break down low block teams. Obviously I'm not expecting Mbappe or vini to dribble past the defense but what I am expecting is this team to be extremely creative and smart with their decisions making. ",
        "upvotes": 64,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1no90rz/facing_against_haramball/"
    },
    {
        "id": "1noa5a0",
        "author": "kasam-se",
        "title": "Final session before Levante clash! | Ciudad Real Madrid",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Q5qTnhF1dpREJv4Tuh61gKJxmtxrfMh2eyUaGSAYKVM.jpeg?auto=webp&amp;s=ca90dae0e888eaf36ca2db598aaefcaee0ac2c82"
        },
        "permalink": "/r/realmadrid/comments/1noa5a0/final_session_before_levante_clash_ciudad_real/"
    },
    {
        "id": "1nnwgjv",
        "author": "TypicalError9576",
        "title": "Negreira case needs a resounding conclusion",
        "content": "Even 7 years after he ceased his charge as Vice-President of the referree committee in Spain things have not changed. The same referees are still in place, the same reward structure prevails. As a RM fan who admires Barça and their philosophy and work with La Masia, this s\\*\\*\\* can't slide! It damages the whole competition and it goes against the very integrity of sporting merit and success.\n\nJust because we have had an impeccable start doesn't mean that it is a level playing field. The worst thing of it all is being gaslit about Real Madrid's supposed history with referees (or f-ing Franco), how Barça were so great with Leo Messi and Co, and how the rest of the league just sits idly by (with some exceptions) through this whole scandal. Just shows how deep this corruption goes, and what we have to row against all season long, and have been rowing for 25+ years since Negreira got to his position at the top of the CTA...\n\n[Number of fouls per yellow card from these first five rounds of play](https://preview.redd.it/8epi8ksjrrqf1.png?width=1004&amp;format=png&amp;auto=webp&amp;s=ec1d5686b8574d5052985c249d201fd3392b68a8)",
        "upvotes": 178,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnwgjv/negreira_case_needs_a_resounding_conclusion/"
    },
    {
        "id": "1noengm",
        "author": "GoaT_Ratio",
        "title": "Best bar in Madrid to watch Levante - Real Madrid",
        "content": "Hello,\n\nI am in Madrid this week and after attending the Espanyol game on Saturday, I want to watch the Levante game in a bar in the city. What are the recommendations for a good sports bar? I am not partically looking for an Irish pub, but more of a Spanish bar where Madridistas would watch the game. Thanks in advance! ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1noengm/best_bar_in_madrid_to_watch_levante_real_madrid/"
    },
    {
        "id": "1nno4yp",
        "author": "soulhunterrai",
        "title": "Real Madrid BC signs 11 year old Moussa Traore! He will likely compete in U14 championship which is one of the youngest to ever compete in U14 hisotry!",
        "content": "Barcelona has something similar with Mohamed Dabone Real Madrid answered! \nhttps://basketnews.com/news-231750-answer-to-barcas-13-year-old-phenom-real-madrid-signs-11-year-old-giant.html\nMoussa Traore is from Mali. Real Madrid every year signs African rising stars and boosts them into the biggest leagues like NBA. One case of this is Eli John Ndiaye who went from Real Madrid to Atlanta Hawks this year! ",
        "upvotes": 169,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nno4yp/real_madrid_bc_signs_11_year_old_moussa_traore_he/"
    },
    {
        "id": "1no1c9r",
        "author": "kasam-se",
        "title": "Levante vs Real Madrid - English Dub Pre-Match Press Conference La Liga Xabi Alonso 2025/26",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aFWzoZwmRGXEvQQkpz4GTAJRB4pRbW365H6VDrkR6L0.jpeg?auto=webp&amp;s=cd1a50e74f344a1385bd9e58f716226e54ca98bb"
        },
        "permalink": "/r/realmadrid/comments/1no1c9r/levante_vs_real_madrid_english_dub_prematch_press/"
    },
    {
        "id": "1nnixnl",
        "author": "Deezwend",
        "title": "Have you ever thought Benzema was overshadowed by CR7 and Bale?",
        "content": "When CR7 and Bale played for Real Madrid, almost everything were built around these two and as it planned, they made it; they were so good at dribbling, at scoring, at assisting, at passing that every Madridista loved them. However, Benzema looked like he was overshadowed by them; he couldn't score and assist as they could but I don't think it was about him being bad or something. He wasn't in the plans enough about scoring; I felt like he was more like responsible for establishing the pass connections in the forward line for CR7 and Bale. After all of these, when we were in 2022, CR7 wasn't already there, Bale wasn't even thought like he was there. It was the time for Benzema; everything was built around him, he became the captain, he played as a pure 9. When that happened, he performed the best, including all of his time in Real Madrid. He won against PSG completely all himself, He was in a critical role winning against City. Briefly, it wouldn't be weird if we said It was all for Benzema 80%-90% of success Real Madrid had in 21/22 season. Considering all this, I feel like Benzema was unfortunately really overshadowed rest of his times other than 21/22 here. What do you think?",
        "upvotes": 106,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnixnl/have_you_ever_thought_benzema_was_overshadowed_by/"
    },
    {
        "id": "1nnmb7u",
        "author": "Lost-Mention",
        "title": "Do we still need a Midfield Controller?",
        "content": "So we all know that last year our biggest issue was that Toni Kroos was not replaced and we suffered from a lack of a high volume, accurate, press resistant and creative passer to circulate and progress the ball from defence to attack. We eventually used Ceballos who then got injured and finally we settled Modric and Arda who couldn't really keep up with the physical demands of the game against energetic opposition for a full 90 minutes. \n\nThis season we still have Ceballos but he's inconsistent. And we have Arda who still struggles against physical opponents. \n\nBut what if we don't actually have the same need for a midfield controller as we did last season? What if the reason we needed one so bad was because we had Mendy/Fran as our LB and Rudiger paired with Ascenicio as our CBs and Lord Vazquez as our RB? \n\nWith Carreras, Huijsen, Militao and Trent/Carvajal, we have an infinitely more competent back line that is very capable of passing around and dribbling through the initial press. In Dean we have our highest volume and most accurate passer. He switches play and is extremely press resistant. Trent too is very adept at the short and long passing game. Militao and Carreras are no slouches on the ball and can also dribble out of pressure.\n\nNow add Tchouameni to the above and then ask yourself, in such a scenario do we actually need a dedicated DLP? Especially when we don't have one that's a perfect fit? \n\nI think Camavinga, Fede and Bellingham are all more than good enough to do the ball carrying required to help move the ball from this competent defence to our attackers. ",
        "upvotes": 27,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnmb7u/do_we_still_need_a_midfield_controller/"
    },
    {
        "id": "1nnfnei",
        "author": "AffectionateGift3560",
        "title": "Why do people hate that Mbappe drops deep to collect the ball ?",
        "content": "In games with limited midfield creativity, he must step down to collect the ball. R9 used to do this: he would take the ball from midfield and dribble into the opposing goal, either creating a chance or scoring. \n\nSo far, it's working, and if he hadn't done it against Espanyol, he'd have looked like Gonzalo Garcia, waiting indefinitely for that one chance.\n\n Furthermore, not standing in the box allows you to collect the cutback (which I believe is Cam's responsibility). I also believe that making Mbappe wait for the ball in the box wastes his talent. \n\nMy solution is that when Mbappe drifts wide, someone should fill in the space (Jude would be really good at this), and he just has to stay there and have a presence in the box, plus he's quite tall.",
        "upvotes": 86,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnfnei/why_do_people_hate_that_mbappe_drops_deep_to/"
    },
    {
        "id": "1nnagj2",
        "author": "Turbulent-Ad8813",
        "title": "Why is the atmosphere so bad?",
        "content": "i’ve been in madrid a couple weeks for work and also been to basque country, a weekend in coruña and seville, ive been luck enough to see about 10 matches so far preseason and now 4 of them at the bernabéu\n\nthe atmosphere there is honestly depressing biggest stadium i’ve been to but the quietest...  \nAt villamarín i couldn’t hear my friend over the chanting, at the bernabéu people were literally taking calls. I saw tourists taking pictures, barely any chants the only coordinated moments were when the announcer shouted player names and even then half the people didn’t know the second half of players' name so there were rows of just dead silence.  \n  \nThis seems like such a trivial thing for team like madrid, honestly feels like a tourist attraction. With that capacity it should be a pressure cooker but it isn’t.",
        "upvotes": 138,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nnagj2/why_is_the_atmosphere_so_bad/"
    },
    {
        "id": "1nmq29k",
        "author": "landofphi",
        "title": "Xabi Alonso gets asked on why Vinicius Junior is no longer an undisputed starter: \"Everyone wants to play. Even Franco, when I was subbing him off, he looked at me and said \"you're subbing ME?\" and I said \"Yes Franco, I'm subbing you\", he was a bit mad. So everyone wants to play, not just Vini.\"",
        "content": "",
        "upvotes": 1269,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/onnmkai9ciqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nmq29k/xabi_alonso_gets_asked_on_why_vinicius_junior_is/"
    },
    {
        "id": "1nmzzh3",
        "author": "RM-PostMatchSurveys",
        "title": "[Post Match Survey Results] Real Madrid 2-0 Espanyol",
        "content": "",
        "upvotes": 173,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l6l6zcagckqf1.png?auto=webp&amp;s=c9d4d171a908794d4982f6396e72d521b175d1f2"
        },
        "permalink": "/r/realmadrid/comments/1nmzzh3/post_match_survey_results_real_madrid_20_espanyol/"
    },
    {
        "id": "1nmgya5",
        "author": "Key_Researcher_5985",
        "title": "This angle of Vini's run",
        "content": "",
        "upvotes": 1480,
        "comments": 76,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fufr5s2gnfqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nmgya5/this_angle_of_vinis_run/"
    },
    {
        "id": "1nmvssq",
        "author": "Icy_Complex_6940",
        "title": "With Belligol back and looking sharp, who gets dropped Arda or Mastantuono?",
        "content": "Title says it all really. But Franco is aggressive, full of energy and looks a real gem (surely would’ve gotten his first goal yesterday if Mbappe and noticed him open and let it run through). \nArda looks like he’s about ready to have a breakthrough season especially considering the chemistry with Mbappe… but Bellingham. He should be back to full match fitness soon and when that happens, surely he won’t be benched. Right?",
        "upvotes": 127,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nmvssq/with_belligol_back_and_looking_sharp_who_gets/"
    },
    {
        "id": "1nma0nu",
        "author": "Miserable-Subject-87",
        "title": "Álvaro Carreras. Worth every penny.",
        "content": "",
        "upvotes": 3812,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o22eqlsa0eqf1.jpeg?auto=webp&amp;s=39761140f0eab438b666228b6f466f27ef98ec5a"
        },
        "permalink": "/r/realmadrid/comments/1nma0nu/álvaro_carreras_worth_every_penny/"
    },
    {
        "id": "1nmzluu",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 4 - 0 Deportivo La Coruña | Weir 2', Däbritz 10', 53', Athenea 92' | Comfortable win against Deportivo despite playing with ten for an hour after Shei red card | Liga F Match Day 4",
        "content": "",
        "upvotes": 70,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0eieiaox9kqf1.jpeg?auto=webp&amp;s=9578055da855085d84f9fa76b69515806a9029a3"
        },
        "permalink": "/r/realmadrid/comments/1nmzluu/fem_real_madrid_4_0_deportivo_la_coruña_weir_2/"
    },
    {
        "id": "1nn2i54",
        "author": "Fortnite_BattlePassX",
        "title": "How do you think things will go this season once everyone is hopefully healthy throughout most of the season.",
        "content": "I believe our injuries and poor defending was a reason for our poor result last season but also our inconsistency I hope Bellingham performs as well as 2024 and vini gets back into his ballon dor form but Im especially curious about the el Classico’s coming up and prove to Barcelona fans that this season will be different.",
        "upvotes": 27,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nn2i54/how_do_you_think_things_will_go_this_season_once/"
    },
    {
        "id": "1nmtt9v",
        "author": "Short_Mousse_6812",
        "title": "Valverde’s new role in the team",
        "content": "  As many have noticed, Valverde is now playing a different way than before. This is not a critique to Valverde, he is my favorite player in Madrid, but it is evident he has not been the most important part of the team anymore. So, why is Valverde not as highlighted as he used to? I believe it is because of being given a specific role. Valverde is a kind of player that should play out of scheme. He was the one who ran everywhere on the pitch and made sure to contribute everywhere. However, this is also a good sign, the fact that Valverde is not being seen as much means that the team is not a mess like last year. If Valverde is the best player in the team that’s unfortunately a bad sign. I feel like he should one of the only players in the team with no instructions since he is the best at moving around the pitch to contribute. ",
        "upvotes": 67,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nmtt9v/valverdes_new_role_in_the_team/"
    },
    {
        "id": "1nmaiq1",
        "author": "Obvious_Young_6169",
        "title": "Alvaro Carreras if he was playing for Barca",
        "content": "",
        "upvotes": 1165,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/knm5cf554eqf1.jpeg?auto=webp&amp;s=74d3dbcde59b0b1e3dc123e8a7cd66627c9ae773"
        },
        "permalink": "/r/realmadrid/comments/1nmaiq1/alvaro_carreras_if_he_was_playing_for_barca/"
    },
    {
        "id": "1nm12ql",
        "author": "xggq",
        "title": "Real Madrid [2]-0 Espanyol - Mbappe 47'",
        "content": "",
        "upvotes": 3592,
        "comments": 90,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fafw2zp78cqf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nm12ql/real_madrid_20_espanyol_mbappe_47/"
    },
    {
        "id": "1nmfnvq",
        "author": "Consistent-Crazy-708",
        "title": "Vini seems unhappy as Thibaut Courtois consoles him",
        "content": "\n&gt; I hope this isn’t breaking any rules, but does anyone know why he seems so unhappy or what exactly he’s unhappy about? Just curious if I missed something, because I can’t figure out the reason and it’s been bothering me for a while. Any insights would help!\n\nMy streaming service didn't show this. ",
        "upvotes": 468,
        "comments": 96,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1nlq186mbfqf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nmfnvq/vini_seems_unhappy_as_thibaut_courtois_consoles/"
    }
]