[
    {
        "id": "1o5si36",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - EG Daily - Tuesday 10/14 at 4:00 PM ET - Legendary voice actress known for voicing Tommy Pickles ('Rugrats'), Buttercup ('Powerpuff Girls'), Babe ('Babe: Pig in the City'), Mumble ('Happy Feet'), Bamm-Bamm ('The Flintstones'), and countless more.",
        "content": "",
        "upvotes": 100,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7go7oh29dxuf1.jpeg?auto=webp&amp;s=92b98d4869e2d5e1d7831f5fcdace246dd4367f3"
        },
        "permalink": "/r/movies/comments/1o5si36/amaqa_announcement_eg_daily_tuesday_1014_at_400/"
    },
    {
        "id": "1o5yqg5",
        "author": "SanderSo47",
        "title": "October 10-12 Box Office Recap – 'Tron: Ares' flops with just $33.2M domestically and $59.9M worldwide, against a $180M budget. 'Roofman' opens in second place, with a solid $8.1M. A24's 'The Smashing Machine' collapses a steep 69% on its second weekend.",
        "content": "https://preview.redd.it/egqb42j5jyuf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2215a8d9293f221e2811a3e6058d338a7e22f45d\n\nThird time's not the charm.\n\nDisney tried again in making the ***Tron*** franchise happen, and the result was one of the year's biggest flops. Paramount's ***Roofman*** also debuted with solid numbers, although it also shows the difficulty of selling original comedies. And Jennifer Lopez had one of her worst debuts as lead star with ***Kiss of the Spider Woman***.\n\nThe Top 10 earned a combined $64.0 million this weekend. That's slightly down from last year, when ***Terrifier 3*** opened with an impressive debut, and ***Joker: Folie à Deux*** collapsed a steep 81.4%.\n\nDebuting at #1, Disney's ***Tron: Ares*** flopped with just $33.2 million in 4,000 theaters. That's below ***Tron: Legacy***'s debut ($44.0 million), which is crazy considering this had so much inflation on its side. There's no point comparing it to the 1982 in terms of opening weekend.\n\nGiven that this cost $180 million ($10 million more than ***Legacy***), it's absolutely disappointing that ***Ares*** opened below it. In fact, the performance is eerily similar to the box office failure of ***Blade Runner 2049***: a sci-fi sequel released in October with a $180 million budget, but it could only open to $32.7 million. \n\nThere was a time for a ***Tron*** film, and it seems like Disney just waited too long to capitalize on it, and also took multiple wrong decisions. First, 15 years is way too long to release a sequel. Yes, ***Legacy*** released 28 years later, but Disney effectively sold the film as an original piece that would intrigue newcomers and also attract old fans. For many, this was probably the first ***Tron***, so ***Ares*** lacked the novelty aspect.\n\nBut there's a bigger problem, and it's that ***Tron*** is just not a very successful franchise in terms of box office. The original ***Tron*** made over $50 million worldwide back in 1982, but Disney was reportedly disappointed with its performance, which is why they didn't pursue a sequel. It wasn't until 2005, when Sean Bailey advocated for the film after it garnered a cult following. The result was ***Tron: Legacy*** in 2010, but even though it made $409 million worldwide, the high costs once again disappointed Disney. So you can see that the franchise has performed the studio's expectations twice.\n\nWhile ***Legacy*** also grew on to earn a cult following, Disney didn't really chase the audience. In March 2015, they finally greenlit a ***Legacy*** sequel, with Garrett Hedlund and Olivia Wilde reprising their roles, and Joseph Kosinski returning as director. But just two months later, they scrapped the film after the failure of ***Tomorrowland***. And so everyone involved moved to different projects.\n\nUntil in 2017, Jared Leto began circling a new ***Tron*** film. It didn't fully gain traction until 2023, when Joachim Rønning signed as director, with Leto serving as producer. But the film's lack of connection to ***Legacy*** ended up hurting the film; while it could help a newcomer join the film without watching the prior films, it also lost fans of the previous film. Hell, even Jeff Bridges' presence was limited in the marketing and in the final product. \n\nThe film was also hurt by its Leto connection; he's not really well-regarded by audiences, and sexual misconduct accusations from a few months ago also signaled problem. Double-edged sword though; if Leto didn't advocate and produce, the film wouldn't exist. The marketing was also a mixed bag; they highlighted that the Grid was coming to the real world, when the appeal of ***Tron*** is staying in the Grid. And the film's mediocre reception (56% on RT) was the nail in the coffin. It lost ***Legacy*** fans, and it didn't really intrigue non-fans.\n\nAccording to Disney, 68% of the audience was male. Gen Z and Millennials were its biggest audience; 52% was 18-34. No interest in the people who watched the original back in 1982 though; only 25% of the audience was 45 and over. They gave it a middling \"B+\" on CinemaScore, the exact same score as the previous films. It has no holiday legs to hold well like ***Legacy***, and it's unlikely it adds new fans in the next few weeks when it loses IMAX and PLF. For now, a $85 million domestic total for ***Ares*** is likely. Very, very poor numbers. It means it will have less attendance than the original ***Tron*** ($110 million adjusted).\n\nIn second place, Paramount's ***Roofman*** debuted with $8.1 million in 3,362 theaters. This is director Derek Cianfrance's biggest debut, overtaking ***The Place Beyond the Pines*** ($4.9 million), although in fairness, he never had a single film playing in more than 1,600 theaters. The debut was above Channing Tatum's previous film ***Blink Twice*** ($7.3 million), but below ***Fly Me to the Moon*** ($9.4 million).\n\nThe budget was kept low at $19 million, so this is a solid debut. It simply shows how difficult it can be to sell comedies, especially when it also involves crime. Even with its crazy real-life story, which was plastered all over the marketing, the audience was very limited in giving it a chance. Even though Paramount tried to build buzz by sending it to Toronto, it was still a challenge even with great reviews on its side (85% on RT).\n\nAccording to Paramount, 53% of the audience was male, and its biggest audience was women over 25 at 38%, thanks to Tatum's presence. They gave it a \"B+\" on CinemaScore, which is solid for a film like this. These kinds of films are noted for holding well, and with a weak October ahead, perhaps it could have a decent run. For now, ***Roofman*** should hit close to $30 million domestically.\n\nEven though it lost IMAX and PLF screens, ***One Battle After Another*** had a better drop than last week. It eased just 38%, adding $6.8 million this weekend. That takes its domestic total to $54.6 million, and it should continue holding well for the rest of the month.\n\nAfter its steep drop last week, ***Gabby's Dollhouse: The Movie*** recovered by dropping 35%, for a $3.5 million weekend. The film has earned $26.5 million domestically, and it should finish with a little above $35 million domestically.\n\nIn fifth place, ***The Conjuring: Last Rites*** dropped just 25% this weekend, for a $3.1 million weekend. The film's domestic total stands at $172.6 million.\n\nSony released ***Soul on Fire*** in 1,720 theaters, earning an okay $2.8 million this weekend. Even with an \"A\" on CinemaScore, it'd be a surprise if it reached $10 million.\n\n***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** dropped 36%, for a $2.2 million weekend. With $128.6 million, it has officially passed ***Crouching Tiger, Hidden Dragon*** ($128.5 million) to become the biggest non-English film domestically.\n\nA24's ***The Smashing Machine*** had a very poor debut last week, and its second weekend reflects that audiences are abandoning the ship as soon as possible. The film collapsed all the way to eighth place with a horrible 69%, which is a pathetic $1.7 million weekend. That translates to a very weak $541 per-theater average. A drop like this is not surprising, considering the film's divisive word of mouth. Through 10 days, the film has earned an abysmal $9.8 million. With such a poor per-theater average, it's gonna lose tons of theaters this week. The film is now guaranteed to miss $15 million domestically, and could even miss $12 million depending on its drop next week. It's gonna be Dwayne Johnson's worst ever wide release. It's crazy that despite its high $50 million budget, the film is not gonna be in A24's top 25 highest grossing films.\n\n***The Strangers: Chapter 2*** dropped 42%, adding $1.6 million this weekend. Its domestic total stands at $13.5 million, and it doesn't have much left in the tank.\n\nRounding out the top 10 was IFC's ***Good Boy***. It dropped a pretty good 40%, for a $1.4 million weekend. Through 10 days, the film has made $4.9 million so far.\n\n***The Long Walk*** continues holding well. It eased just 39%, grossing $1 million. That took its domestic total to $33.9 million.\n\nIn 12th place, Roadside Attractions' ***Kiss of the Spider Woman*** flopped with an abysmal $891,046 in 1,331 theaters. That's Jennifer Lopez's worst ever wide debut, and it translates to a meager $669 per-theater average. Unsurprisingly, the film just couldn't connect with audiences. With little award buzz, the film is going to disappear quickly from theaters. Needless to say, it won't come anywhere close to the 1985 original's domestic gross ($17 million).\n\nAmazon MGM released Luca Guadagnino's ***After the Hunt*** in 6 theaters. It earned $158,679, which is a solid $26,447 per-theater average. It's set to expand into around 1,200 theaters this weekend.\n\nA24 also released ***If I Had Legs I'd Kick You*** in 4 theaters. It earned $89,164, averaging $22,291 in each theater. It will continue adding theaters in the next few weeks.\n\n#**OVERSEAS**\n\n***Tron: Ares*** also got off to a very weak start outside America. It opened with just $26.7 million overseas, for a very poor $59.9 million worldwide debut. It had very soft to mediocre debuts in Mexico ($2.9M), the UK ($2.4M), France ($1.9M), Australia ($1.5M) and Germany ($1.4M). Given its massive $180 million budget, the film's path to profitability is going to be insanely hard. Nowhere close to ***Legacy***'s $409 million worldwide finish. We'd like to say that this is the nail in the coffin for the franchise, but let's face it, we'll probably see another one in 15-20 years.\n\n***One Battle After Another*** added $15 million this weekend, taking its worldwide total to $138.1 million. The best markets are the UK ($11.2M), France ($8.5M), Germany ($6.4M), Italy ($4.4M) and Australia ($4M). It reaches its final market, China, this week.\n\n***Gabby's Dollhouse: The Movie*** added $7 million, for a $46.3 million worldwide total. Its best markets are Australia ($2.9M), Mexico ($2M), Italy ($1.7M), France ($1.1M) and Poland ($1.1M).\n\n***The Conjuring: Last Rites*** has crossed $300 million overseas, and its worldwide total is now $473 million. Best markets are Mexico ($30.5M), the UK ($24.1M), France ($22.3M), Brazil ($17.5M) and Germany ($16.4M).\n\nWith $648 million worldwide, ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** is now officially the fifth biggest film of the year.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Big Bold Beautiful Journey* | Sep/19 | Sony | $3,252,578 | $6,671,082 | $20,171,082 | $45M\n\n- There's nothing beautiful about this. Sony's ***A Big Bold Beautiful Journey*** has closed after just 3 weeks with an abysmal $6 million domestically and $20 million worldwide. A big failure, even considering its mid $45 million budget. A huge, huge stain in the careers of Margot Robbie, Colin Farrell, and director Kogonada. Even with the talent, poor reviews and word of mouth sank the film. Ouch.\n\n#**THIS WEEKEND**\n\nUniversal is releasing Blumhouse's ***Black Phone 2***. Despite the original's ending, Ethan Hawke is back, going full Freddy Krueger mode. Given that it surprised everyone by grossing $161 million worldwide, a sequel felt inevitable. But there's still questions over whether the audience is on board with a sequel, and Blumhouse's brand has taken a massive dive in the past year with so many failures. Will this save them?\n\nLionsgate is releasing Aziz Ansari's directorial debut ***Good Fortune***, starring Ansari, Seth Rogen and Keanu Reeves. It seeks to bring comedy into theaters, with a fantasy angle (a guardian angel causes a body swap and shenanigans ensue). It had a solid response in Toronto (83% on RT), but it remains to be seen if audiences will show up.\n\nIn limited release, Sony Pictures Classics is releasing Richard Linklater's ***Blue Moon***, starring Ethan Hawke, Margaret Qualley, Bobby Cannavale, and Andrew Scott. With high acclaim (97% on RT, 78 on Metacritic), look for this to have one of the year's strongest per-theater averages.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 574,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IE7jReXXYqrhZMPVP-mD-vnf90Usz6ntVd61iTlDE3o.png?auto=webp&amp;s=ac1bee97705ae8509da5c136efec8e02385130df"
        },
        "permalink": "/r/movies/comments/1o5yqg5/october_1012_box_office_recap_tron_ares_flops/"
    },
    {
        "id": "1o5pgcu",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Guillermo del Toro's 'Frankenstein'",
        "content": "",
        "upvotes": 4974,
        "comments": 217,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2lqp3ccbuwuf1.jpeg?auto=webp&amp;s=38bd153a4833ad24c55f39823aa176eaa3e77984"
        },
        "permalink": "/r/movies/comments/1o5pgcu/new_character_posters_for_guillermo_del_toros/"
    },
    {
        "id": "1o613g7",
        "author": "TheWor1dsFinest",
        "title": "What kids movie do you think is way more profound than it gets credit for?",
        "content": "I think most people recognize the deeper meanings and mature life lessons of stuff like Zootopia, Up, Toy Story 3, etc. What are some of the kids movies you think fly under the radar as being deeper than they’re often given credit for?\n\nI put A Goofy Movie in this category. I think it’s a simple enough father and son movie, but its main message is a really important one for life in general and particularly parent-child relationships: if you love someone and want to be closer to them you don’t make it all about trying to make them do things you want to do, you go and do stuff with them that they enjoy to do. And while it goes both ways, it’s especially true for a parent to take the lead on this with their child. You’re the adult. Your kid needs to know that the things they like are ok and a source of bonding, not separation or judgment from their parents whose approval they desperately seek.\n\nDon’t know many other movies that convey the point as well as A Goofy Movie does.",
        "upvotes": 703,
        "comments": 679,
        "media": null,
        "permalink": "/r/movies/comments/1o613g7/what_kids_movie_do_you_think_is_way_more_profound/"
    },
    {
        "id": "1o60e4b",
        "author": "MarvelsGrantMan136",
        "title": "Diane Keaton Tribute: AMC Theatres Rereleasing 'Annie Hall,' 'Something's Gotta Give'",
        "content": "",
        "upvotes": 777,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IHwczXiZ6cWYsJwzlfaHRanJzeL1mj4LuogUOQCSoCw.jpeg?auto=webp&amp;s=52d0767f8fee395e06a1a5aab0ed2697547a9eb6"
        },
        "permalink": "/r/movies/comments/1o60e4b/diane_keaton_tribute_amc_theatres_rereleasing/"
    },
    {
        "id": "1o5nc86",
        "author": "ChiefLeef22",
        "title": "Apple TV+ Being Rebranded as Apple TV",
        "content": "",
        "upvotes": 1771,
        "comments": 563,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H1Wt-y_pGTEBByji7vMVhCOsYh0Bl_WIbQqKVfUf3rM.jpeg?auto=webp&amp;s=160d730a8074d8bb0972ae8540a4be4b11ff1400"
        },
        "permalink": "/r/movies/comments/1o5nc86/apple_tv_being_rebranded_as_apple_tv/"
    },
    {
        "id": "1o5q7kd",
        "author": "BunyipPouch",
        "title": "'Young Washington' - Official Trailer - Starring William Franklyn-Mille, Mary-Louise Parker, Kelsey Grammer, Andy Serkis and Ben Kingsley - It follows the early life of George Washington as he fights in the French and Indian Wars.",
        "content": "",
        "upvotes": 977,
        "comments": 588,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qUx1rRsF6_WTs-lRtlP-KSl4aNCE2DUtxIsZNnwrIfQ.jpeg?auto=webp&amp;s=e5bbfefc3de18c9a78bc04d027fcba17dd1daf9f"
        },
        "permalink": "/r/movies/comments/1o5q7kd/young_washington_official_trailer_starring/"
    },
    {
        "id": "1o636mf",
        "author": "_Prncss_brde_sux_",
        "title": "The movie \"Christine\" came out in 1983 and used a 1958 Plymouth Fury as a terror mobile. If the movie was made today and used a car from the year 2000, what would be the car?",
        "content": "The 1983 movie Christine featured a 1958 Plymouth Fury as its murderous machine. If that same movie were made today, keeping the 25-year difference, Christine would be a 2000 model car. So what vehicle from that era has the perfect mix of style, attitude, and menace to take her place? A sleek sedan? A muscle car? Something underrated and sinister?\n\n\n\n",
        "upvotes": 164,
        "comments": 284,
        "media": null,
        "permalink": "/r/movies/comments/1o636mf/the_movie_christine_came_out_in_1983_and_used_a/"
    },
    {
        "id": "1o5z9pg",
        "author": "EuphoricButterflyy",
        "title": "‘Basic Instinct’ (1992)- Interrogation Scene. Directed by Paul Verhoeven",
        "content": "",
        "upvotes": 259,
        "comments": 78,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hhqn6cklnyuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o5z9pg/basic_instinct_1992_interrogation_scene_directed/"
    },
    {
        "id": "1o5ifdk",
        "author": "ChiefLeef22",
        "title": "'Flow' director Gints Zilbalodis says he has finished the script for his next project titled 'Limbo'. It will be his first film to involve dialogue.",
        "content": "",
        "upvotes": 1749,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bzZgXvmJDUAC1bgxf0KXR9mPAumIkWHOzZNNO2d9--0.jpeg?auto=webp&amp;s=7c076df0c77be42a66bdf69994523a8d81703bda"
        },
        "permalink": "/r/movies/comments/1o5ifdk/flow_director_gints_zilbalodis_says_he_has/"
    },
    {
        "id": "1o5m31s",
        "author": "MarvelsGrantMan136",
        "title": "Brad Pitt’s ‘F1’ Sets December 12 Streaming Date on Apple TV+",
        "content": "",
        "upvotes": 1020,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WyeTbfKZF4CHkqRe4X4ktpu2O3Aliap5Br_QorOAe3o.jpeg?auto=webp&amp;s=cfcdcf5c81e4407b5efed4f7eec586951653ff79"
        },
        "permalink": "/r/movies/comments/1o5m31s/brad_pitts_f1_sets_december_12_streaming_date_on/"
    },
    {
        "id": "1o5v88k",
        "author": "KillerCroc1234567",
        "title": "Jackie Burch, Casting Director on ‘Sixteen Candles,’ 'Mask’ and ‘Dick Tracy,’ Dies at 74",
        "content": "",
        "upvotes": 370,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aXAdYC_nB6710g1uY8Ey3m_8BmwKWD4OhK7l66Bek44.jpeg?auto=webp&amp;s=ea789050ec0a9a29e21c7edf8e7a96777902839b"
        },
        "permalink": "/r/movies/comments/1o5v88k/jackie_burch_casting_director_on_sixteen_candles/"
    },
    {
        "id": "1o5a8v2",
        "author": "timinator4434",
        "title": "What is the best satire movie that most people don't realize is a satire?",
        "content": "The one that immediately comes to mind for me personally is Starship Troopers. It works really well as just a straight up action movie that it can be quite easy to just shut your brain off and enjoy the shoot 'em up (of which there is plenty). I speak from experience as my dad is like this.\n\nI would love to hear what other movies people list!\n\nEdit: spelling.",
        "upvotes": 7043,
        "comments": 3608,
        "media": null,
        "permalink": "/r/movies/comments/1o5a8v2/what_is_the_best_satire_movie_that_most_people/"
    },
    {
        "id": "1o61ltz",
        "author": "J_Greer20",
        "title": "What horror movie has the best scared as shit performance?",
        "content": "I always thought Shelley Duvall’s performance was bad in The Shining (1980). However, in recent years I think she is realistically portraying how someone would act in that situation. Not to mention the torment she experienced behind the scenes.\n\nAs a kid, Drew Barrymore really made the opening of Scream (1996) memorable.\n\nToni Collette of course was great in Hereditary (2018). Any other performances that don’t get the recognition?",
        "upvotes": 137,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1o61ltz/what_horror_movie_has_the_best_scared_as_shit/"
    },
    {
        "id": "1o5j26e",
        "author": "MarvelsGrantMan136",
        "title": "The Running Man | New Trailer",
        "content": "",
        "upvotes": 959,
        "comments": 386,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cq61mbbNDkZPEvYqYAP5o2NijHQjQmlCAle6D_x-2XA.jpeg?auto=webp&amp;s=0d0cd6d5e921e04151492080f96918dc31473c65"
        },
        "permalink": "/r/movies/comments/1o5j26e/the_running_man_new_trailer/"
    },
    {
        "id": "1o5xmx1",
        "author": "cyPersimmon9",
        "title": "The best directors who don't get quite enough love but gave us loads of awesome movies? I'll start: Peter Weir",
        "content": "Who are some of the greatest directors with long and varied careers, that are comparatively underknown but gave us a good amount of S-tier movies? Not just simply good, but amazing movies.\n\nA man commonly singled out in this category (where a director is not a household name but their own movies are absolute classics and not only to cinephiles) is the great Sidney Lumet. I'd like to proffer another filmmaker in this category: Peter Weir.\n\nRetired now, but he's one of the greatest Australian film directors ever. An underrated GOAT in my book, with a distinctive auteur sensibility. Quite a few of his movies possess an ambivalence with a slight otherworldliness to it.\n\n**Picnic at Hanging Rock** (1975) is a masterpiece, arguably the best Australian film of all time. For those who are unfamiliar, it's about what happens when a girls boarding school takes a field trip to an unusual but scenic volcanic formation called Hanging Rock. Several other girls venture off despite the rules forbidding them to do so. Set in the early 1900s, it's mysterious and really eerie, a spellbinding movie that some have considered to be almost horror in essence. \n\nWeir also directed **Dead Poets Society**. As well as **Master and Commander: The Far Side of the World**, and **The Truman Show**, and the great Harrison Ford movie **Witness** from 1985. Weir's resume is truly stellar.\n\nAnother superb Australian film, **The Last Wave** (1977). A business lawyer David Burton is assigned to defend five Aboriginals accused of a murder. None of them are willing to speak about what happened, even in their own defense, and the medical examiner can't figure out how the victim died. In the process, David learns disturbing things about himself and starts to have increasingly terrifying apocalyptic visions.\n\n**I know some people will probably disagree with Weir \"doesn't get enough love\", but I'm shamelessly giving him a shoutout anyway because his catalogue is both excellent and artistically varied.** And no, outside of reddit, he's not nearly as famous as a Nolan or a James Cameron.\n\nWho are some other filmmakers who weren't just one-hit wonders, that may not have been the biggest names but had a killer catalogue of smashing good movies? To a point where it's a wonder they're not talked about more often.",
        "upvotes": 178,
        "comments": 259,
        "media": null,
        "permalink": "/r/movies/comments/1o5xmx1/the_best_directors_who_dont_get_quite_enough_love/"
    },
    {
        "id": "1o5svd0",
        "author": "SanderSo47",
        "title": "Jamie Bell, Cosmo Jarvis, Thomasin McKenzie, Jonny Lee Miller &amp; Woody Norman Join Paul Greengrass’ Peasant Revolt Pic ‘The Uprising’, Also Starring Andrew Garfield – Follows a man who leads a ferocious rebellion against the tyranny of King Richard II.",
        "content": "",
        "upvotes": 284,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hFPk3a0xKj6SsBwjJGw2Jj-yLRCY5UTWssNLk6NxdpY.jpeg?auto=webp&amp;s=9ecade7e75697bac43d4c5b6c6aab15f8d6081ce"
        },
        "permalink": "/r/movies/comments/1o5svd0/jamie_bell_cosmo_jarvis_thomasin_mckenzie_jonny/"
    },
    {
        "id": "1o65h11",
        "author": "ubcstaffer123",
        "title": "Back to the Future Trilogy Gets New 4K Ultra HD Release for 40th Anniversary",
        "content": "",
        "upvotes": 47,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IUQY783oPPrUYOTAhdhAZ-aDobsq8XJhuTu1dCKs65k.jpeg?auto=webp&amp;s=54f4f4b834f800e5024ead4f0810b75b09338fff"
        },
        "permalink": "/r/movies/comments/1o65h11/back_to_the_future_trilogy_gets_new_4k_ultra_hd/"
    },
    {
        "id": "1o5uc1e",
        "author": "darth_vader39",
        "title": "Ian Freebairn-Smith, Grammy-Winning Composer Who Arranged for ‘A Star Is Born’ and Sang ‘MASH’ Title Song, Dies at 93",
        "content": "",
        "upvotes": 220,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nXtpVCeH2GlRGiarZVqNsssbKRLpZV7QROjAuSxOI0s.jpeg?auto=webp&amp;s=af3d661feb8186cceed756b8ceb6bc2d332fb44f"
        },
        "permalink": "/r/movies/comments/1o5uc1e/ian_freebairnsmith_grammywinning_composer_who/"
    },
    {
        "id": "1o5iu3l",
        "author": "JaneLevyAMA",
        "title": "Hi Reddit! I'm Jane Levy, star of A LITTLE PRAYER, a Sundance film written and directed by Angus MacLachlan, now available to watch everywhere. You might also know me from Don't Breathe, Evil Dead, Suburgatory, and Zoey's Extraordinary Playlist. AMA!",
        "content": "Hi Reddit, I'm Jane Levy.\n\nYou might know me from Don't Breathe, Evil Dead, Suburgatory, Zoey's Extraordinary Playlist, and other things! My new movie, A Little Prayer (co-starring David Strathairn), is out now. Ask me anything!\n\n*Other information:*\n\n***Description:***\n\nA loving father (David Strathairn) grapples with how to protect his daughter-in-law (Jane Levy) when he discovers that his son is having an affair. A heart-tugging drama about finding kindred spirits in unexpected places, A Little Prayer is a sensitive and searching portrait of a Southern family from writer-director Angus MacLachlan. Now available to rent/purchase wherever you watch films.\n\n***More here:***\n\n[https://www.musicboxfilms.com/film/a-little-prayer/](https://www.musicboxfilms.com/film/a-little-prayer/)\n\n***Trailer:***\n\n[https://youtu.be/\\_tsHp2PM2lQ](https://youtu.be/_tsHp2PM2lQ)\n\nAsk me anything! Back at 5 PM ET today (Monday 10/13) to answer your questions.",
        "upvotes": 601,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ozn4lsqklvuf1.png?auto=webp&amp;s=0b4c70ab3f31a119c05040b86a8629a30b554490"
        },
        "permalink": "/r/movies/comments/1o5iu3l/hi_reddit_im_jane_levy_star_of_a_little_prayer_a/"
    },
    {
        "id": "1o59vh9",
        "author": "DemiFiendRSA",
        "title": "‘Demon Slayer: Kimetsu no Yaiba Infinity Castle’ surpasses ‘Crouching Tiger, Hidden Dragon’ to become the highest grossing non-English international film of all-time in the U.S.",
        "content": "",
        "upvotes": 2992,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1o59vh9/demon_slayer_kimetsu_no_yaiba_infinity_castle/"
    },
    {
        "id": "1o66e6e",
        "author": "shaka_sulu",
        "title": "What movie features a story with the longest time span?",
        "content": "As I was rewatching the Eternals I said to myself \"They really covered a lot of years in this movie\". Then I started to wonder about other movies that beat it. That covered more years.\n\nEternals takes us from 5000 BC to present day (2021). 2001: A Space Odessy was even longer. I think Tree of Life, which goes from the Big Bang to 2010 might be the winner. Anyone have any other movie that tops that?",
        "upvotes": 29,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1o66e6e/what_movie_features_a_story_with_the_longest_time/"
    },
    {
        "id": "1o64gt8",
        "author": "PuzzleheadedTrack942",
        "title": "Best movie to fall asleep to - one volume.",
        "content": "What’s the best movie to fall asleep to that is MONOTONOUS in volume and tone and vibe. I’m a light sleeper so if a movie at any point has a loud bang or sudden exciting up in music it’ll wake me up with a jolt. Still, been going through some life issues and don’t want to sleep in silence. \n\nThus. Which movies would you say have the most calming vibes the whole way through. Not necessarily to watch, but to have on in the background while you sleep. \n\nOff the top of my head I’m thinking Notting Hill, Garden State, Cinderella (live action), Little Women, Pride and Prejudice maybe? ",
        "upvotes": 30,
        "comments": 131,
        "media": null,
        "permalink": "/r/movies/comments/1o64gt8/best_movie_to_fall_asleep_to_one_volume/"
    },
    {
        "id": "1o5qvdc",
        "author": "LavRyMusic",
        "title": "Movies that keeps the climax going?",
        "content": "I'm talking like how One Battle After Another and Miracle Mile just keep going once it gets to the climax, like there's no break where the characters are just aitting around talking etc... I know I've seen other movies like this before but I can't really think of any right now... was gonna say Birdman but that's not really what I mean either\n\nAny recommendations would be amazing, ",
        "upvotes": 166,
        "comments": 285,
        "media": null,
        "permalink": "/r/movies/comments/1o5qvdc/movies_that_keeps_the_climax_going/"
    },
    {
        "id": "1o4vwte",
        "author": "Old_Specialist7892",
        "title": "David Fincher testing the RED camera on DiCaprio. Shot with only the light of a matchstick",
        "content": "",
        "upvotes": 21936,
        "comments": 745,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/au0cgzxmzpuf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o4vwte/david_fincher_testing_the_red_camera_on_dicaprio/"
    },
    {
        "id": "1o59r40",
        "author": "CosmosisJones42",
        "title": "What’s the worst movie leak of all time?",
        "content": "There’s been some wild movie leaks that totally changed how people saw a film before it even dropped. i still remember in high school when that unfinished wolverine movie leaked online and everyone was watching it with half the cgi missing lol. the hateful eight script leak made tarantino so pissed he almost bailed on it. the sony hack was on another level too with private emails casting talks and full projects getting dumped online. and then no way home got spoiled months early cause people cant keep a secret to save their life\n\nyou could even go back to when revenge of the sith leaked before release or when the first 10 minutes of rise of skywalker got out and fans tore it to shreds. expendables 3 leaked before theaters and they blamed that for killing the box office. and the matrix resurrections trailer leaking early just made everyone clown on it before it even had a chance\n\nits crazy how a single leak can just kill the hype and mess up everything. what do you think was the worst one the leak that really changed a movie or wrecked the excitement completely?",
        "upvotes": 1592,
        "comments": 898,
        "media": null,
        "permalink": "/r/movies/comments/1o59r40/whats_the_worst_movie_leak_of_all_time/"
    },
    {
        "id": "1o6760o",
        "author": "awfoolNuggets",
        "title": "Pleasantville (1998)",
        "content": "Hadn't ever heard of this movie before untill very recently. Surprisingly, through The Beatles. And it feels like such a \"pleasant\" (pun intended) concept. Just because you have a different definition of \"perfect\" than the society, doesn't mean it's wrong. I know it's not a mind-blowing take on things at this day and age, but I still felt I could relate to it in certain aspects. It's just a \"pleasant\" watch overall (sorry). And hey, It could never be enough of Tobey for me.",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1o6760o/pleasantville_1998/"
    },
    {
        "id": "1o5uuel",
        "author": "BunyipPouch",
        "title": "After 26 years, Regal South Beach 18 closes its doors. A large &amp; iconic theater in the heart of Miami's South Beach, and a host to many film festivals &amp; events, the theater joins several recently-shuttered area theaters and will be replaced by a museum despite efforts from local cinemagoers.",
        "content": "",
        "upvotes": 71,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JjSDU0090PSRFARmV58VgXpLSG0aUIkJRoEKLes23jM.jpeg?auto=webp&amp;s=9b6c3685196dafd3eec1901cdfa2c1bd6efde478"
        },
        "permalink": "/r/movies/comments/1o5uuel/after_26_years_regal_south_beach_18_closes_its/"
    },
    {
        "id": "1o5gfdf",
        "author": "mrjohnnymac18",
        "title": "Nobel Prize-Winning Philosopher Bertrand Russell Biopic in Development, Amanda Curdt-Christiansen to Pen Script (EXCLUSIVE)",
        "content": "",
        "upvotes": 321,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F9MijyAgXN8IYWkmxoEp3vZlIuPdkno7-YTUbwaFumU.jpeg?auto=webp&amp;s=f5004fbd58b1498c993862643d871e8e5e86d3dc"
        },
        "permalink": "/r/movies/comments/1o5gfdf/nobel_prizewinning_philosopher_bertrand_russell/"
    },
    {
        "id": "1o5lfom",
        "author": "spliffiam36",
        "title": "ILM Visual Effects Artist Breaks Down Hidden VFX | Vanity Fair",
        "content": "",
        "upvotes": 107,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RKHgmculLjLCLoijo--2d4XpalX2Zy3vhY6pRALFNi4.jpeg?auto=webp&amp;s=7a8067cde75a384b9eb55dfe7def4acd4ef94f7f"
        },
        "permalink": "/r/movies/comments/1o5lfom/ilm_visual_effects_artist_breaks_down_hidden_vfx/"
    }
]