[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qbbq72",
        "author": "Secretly_Wealthy90",
        "title": "11.22.63 IS SOOOO Good!!! highly recommended",
        "content": "how did i not know about this until now, 10 years later after it came out. Hulu did not do a good job at promoting it, Netflix put this at the top. \n\nall other streaming services should just shut down and license their content to Netflix IMO.\n\n\n\n",
        "upvotes": 348,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbq72/112263_is_soooo_good_highly_recommended/"
    },
    {
        "id": "1qaw6fh",
        "author": "jerkoff1610",
        "title": "This hidden detail in Harlan Coben’s Run Away explains what actually happened to Henry at the end",
        "content": "",
        "upvotes": 74,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qaw6fh/this_hidden_detail_in_harlan_cobens_run_away/"
    },
    {
        "id": "1qakmje",
        "author": "Sudden_Pop_2279",
        "title": "‘KPop Demon Hunters’ Wins Golden Globes for Best Animated Feature and Best Song",
        "content": "",
        "upvotes": 390,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1qakmje/kpop_demon_hunters_wins_golden_globes_for_best/"
    },
    {
        "id": "1qaya0c",
        "author": "Realistic_Leg5822",
        "title": "His&amp;Hers",
        "content": "I just finished watching his&amp;hers. 10/10 acting and storyline.  \n  \nCan anyone recommend similar films or series which are not too long but keep me hooked till the end?",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qaya0c/hishers/"
    },
    {
        "id": "1qbc06a",
        "author": "Different_Chance6818",
        "title": "Netflix System Design Explained | Cloud Architecture, Microservices &amp; Global Video Streaming",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qbc06a/netflix_system_design_explained_cloud/"
    },
    {
        "id": "1qb2v87",
        "author": "Mr-Vanderhill",
        "title": "His &amp; Hers… thoughts",
        "content": "Was this series.. supposed to be good?\n\nI thought it was bafflingly bad. A terrible story/plot, with horrible dialogue all around and some pretty awful acting. \n\nThe plot.. some high school girls coerce others into the woods in which they get paid to watch girls get abused? One of the girls changes her name and looks and also becomes an anchorwoman at the same place as the main character? She kills her own sister and turns into some sinister person.. Yawn. Lazy, horrible writing. I can go into much more but it’s truly not worth it. \n\nJon Bernthal is great and gives it his best but even he can’t really escape the again, horrible dialogue and plot. \n\nTessa Thompson is objectively horrible. Prior to this she was fine in other things. Not spectacular, not bad. She also is not given help with an awful plot and dialogue but god she was incredibly bad. So many scenes that were laughable and clearly a set of a show with soap opera type acting. \n\nTessa was not the actress to use in this show and well it shows. Nobody could’ve done the story justice sure but she made it a lot worse. \n\nThe climax.. her mom with “dementia” ends up being the killer.. yawn yawn yawn. That whole final act was such a drag and so lame. So many obvious and dumb red herrings all the way across the series. \n\nI typically won’t comment on something that I think is this bad but I’m seeing so much love that I can’t even wrap my head around. Hate to be the bearer of bad news but if you enjoyed this series, you are easy to please. ",
        "upvotes": 10,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1qb2v87/his_hers_thoughts/"
    },
    {
        "id": "1qbafmq",
        "author": "harpreetthind",
        "title": "Thoughts about the one last adventure making of Stranger things",
        "content": "What’s everybody’s thoughts on the one last making of Stranger Things I’m watching that right now. After watching the whole season of Stranger Things movie",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qbafmq/thoughts_about_the_one_last_adventure_making_of/"
    },
    {
        "id": "1qaznep",
        "author": "StatisticianFun2274",
        "title": "The Lazarus Project (2022-2024)",
        "content": "This one had been on my watch list for a while. I noticed this weekend that it was leaving Netflix soon. The better half and I binge-watched the first 6 episodes last night.   Enjoying it so far. Only 16 total episodes, but I'm guessing it ends on a cliffhanger?",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qaznep/the_lazarus_project_20222024/"
    },
    {
        "id": "1qbd2sp",
        "author": "Lilac_Dollie",
        "title": "Best shows to download for a 40 hour bus ride?",
        "content": "I’ll be going on a (in total there and back) around 40 hours of a bus ride. In order to keep myself busy im looking for shows or movies to download.\n\n I’m a big fan of of animated shows, some of my favorites being haunted hotel, arcane, jentry chau, death note, etc. \n\nand for non animated I’ve been a big fan of sweet tooth and the umbrella academy. \n\nIf anyone knows any similar shows let me know!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qbd2sp/best_shows_to_download_for_a_40_hour_bus_ride/"
    },
    {
        "id": "1qaht5l",
        "author": "RevolutionaryRub6553",
        "title": "Why is Netflix recommendations so bad?",
        "content": "I was scrolling through YouTube shorts, this is where I find **actual** good shows and movies to watch and it's pointed me to so many good shows and movies on Netflix that I don't actually get recommended for, I only find them after I've searched them. Literal shows and movies I've never seen or heard of on the Netflix home page. Has anyone else noticed this or am I just picky? ",
        "upvotes": 110,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1qaht5l/why_is_netflix_recommendations_so_bad/"
    },
    {
        "id": "1qbafqa",
        "author": "Psycho_66666",
        "title": "Any fixes to this problem",
        "content": "I have made the setting in the profile for the quality of the video it is set to high, but still when I open a movie or TV show it runs in so low quality that I can even count the pixels on the screen. Is there any fix on how to get the highest quality I have the 1080p plan the video is not even in 720p makes my eyes hurt I have comparison shots  ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbafqa/any_fixes_to_this_problem/"
    },
    {
        "id": "1qaxqkg",
        "author": "ideserveit1234",
        "title": "Don’t know why there is so much hate towards His&amp;Hers",
        "content": "It’s the first time in a long time that I want to watch something \\*again\\*.\n\nEverything about it was good, if not phenomenal, and I didn’t see many of the twists coming. I usually ALWAYS predict everything within 30 minutes of the movie… one of my biggest pet peeves. I suspected a few, but the last one was a surprise for sure.\n\nI don’t see why there is a lot of confusion around what characters are saying etc—this is to add depth to the character and give the viewer more insight on how corrupt (or what kind of corrupt) the character is. \n\nThere are some things that are left out from the story, but implied imo.\n\nAnybody else feel this way?",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qaxqkg/dont_know_why_there_is_so_much_hate_towards/"
    },
    {
        "id": "1qav427",
        "author": "SolutionPatient89",
        "title": "His&amp;Hers was weird.",
        "content": "Spoilers!!\n\nI don’t get why lexy and her husband acted so weird and tried to attack her when they were not the killers. Even more confusing is lexy’s character. She kills her sister for calling her fat but doesn’t do anything to her bullies ? \n\nThe twist was meh. ",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qav427/hishers_was_weird/"
    },
    {
        "id": "1qbd8oh",
        "author": "kheifert1",
        "title": "Ads on a live replay.",
        "content": "Why are there ads on a live replay ? I pay for ad free and I’m watching a replay of Raw ( not live ) and there are unskipable (sp) ads. What the hell ?  I get that they, for whatever reason, need to put ads on the live broadcast, but really ? On the replay ? I should at least be able to ff through them. That’s certainly not what I pay for. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbd8oh/ads_on_a_live_replay/"
    },
    {
        "id": "1qbcq7j",
        "author": "CryptographerLoud461",
        "title": "Netflix constantly blurry and buffering on LG TV",
        "content": "I have Netflix with ads. I recently got a new TV and new wifi (Verizon). A few days after using the TV, every time I go to watch Netflix it buffers for a long time before starting, and then the show is in like 240p — you can barely make out faces.\n\nDo you think this is purposeful, as a way for Netflix to try to get me to upgrade to an ad-free version? It’s really frustrating :(",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qbcq7j/netflix_constantly_blurry_and_buffering_on_lg_tv/"
    },
    {
        "id": "1qb6cgd",
        "author": "ToeWiggler23",
        "title": "How do I fix the black background on my subtitles?",
        "content": "So I'm watching the walking dead on my tv and the subtitles have a black background instead of the normal white background with a black shadow, it only happens when the subtitles are in english, whenever I put it in my country's language it's normal but I wanna watch it in english, it only happens to my tv, it's fine on my phone.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qb6cgd/how_do_i_fix_the_black_background_on_my_subtitles/"
    },
    {
        "id": "1qbbs6i",
        "author": "forevony_0904",
        "title": "His&amp;hers",
        "content": "this show is freaking amazing. watched it with my partner as we both wanted to watch it (and saves me time watching shows with him plus shows on my own to review aha). omgggg all the twist. I called the one regarding Katherine but the last twist omg. so unexpected. so glad I gave this a chance and watched it cos loveeeee\n\nif youse haven't already go watch it now \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbs6i/hishers/"
    },
    {
        "id": "1qaxjte",
        "author": "EmployeeBrave7455",
        "title": "Netflix &amp; Disney+ series recommendation",
        "content": "I recently finished watching His&amp;Hers and I would love your recommendations on such similar genre (Mystery, detective)\n\nAs reference, I also love glass onion (already watched all of them), the residence, 7 women and a murder, agents of mystery, only murders in the building, a deadly invitation and crime scene zero (I particulary love this one sooo much!) \n\nThanks before for your suggestions! ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qaxjte/netflix_disney_series_recommendation/"
    },
    {
        "id": "1qakhyr",
        "author": "Kurtz62",
        "title": "‘Adolescence” domination",
        "content": "‘Adolescence’ was clearly the best tv show on Netflix in 2025. \n\nIt swept the Emmys and looks to be on their way to sweeping the Golden Globes. \n\nThey deserve every single award they are nominated for. \n\nComplete, total domination. \n\nOnly complaint: they’re beating ‘The Beast in Me’ which I thought was an incredible show as well. ",
        "upvotes": 35,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1qakhyr/adolescence_domination/"
    },
    {
        "id": "1qbas5f",
        "author": "LimaDream2244",
        "title": "[UK Premium Plan] - Watching Raw replay and getting advertisements",
        "content": "Hey I am on a premium plan for netflix (confirmed on change plan page) and I am watching RAW, long after it's finished broadcasting live. I am however getting advisements. \n\nI'm pretty sure cause the broadcast has ended and I am now watching an On-Demand version of the show, I shouldn't be getting Advertisements, but I am.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qbas5f/uk_premium_plan_watching_raw_replay_and_getting/"
    },
    {
        "id": "1qa6yu9",
        "author": "RiskAndReason",
        "title": "“Wait… you STILL haven’t watched this?!”",
        "content": "It’s 2026 and there are still some iconic shows or movies people somehow missed.\n\nDrop your best “How have you not watched this yet?” recommendation and tell us why it’s a must-watch.",
        "upvotes": 136,
        "comments": 232,
        "media": null,
        "permalink": "/r/netflix/comments/1qa6yu9/wait_you_still_havent_watched_this/"
    },
    {
        "id": "1qasy88",
        "author": "painterpopular6781",
        "title": "Movies/ series similar to knives out and the residence",
        "content": "So recently I have finished watching all three movies in the series of knives out. I have also watched The Residence, and I found all these very entertaining to watch. So are there any movie/ series with murder mystery and is similar ( in genre) to the above mentioned ",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qasy88/movies_series_similar_to_knives_out_and_the/"
    },
    {
        "id": "1qb5wbw",
        "author": "Low_Dragonfruit8146",
        "title": "Need show suggestions",
        "content": "What are some good thriller/horror and/zombie shows on Netflix? I’ve watched the watcher, YOU, bird box etc. I was gonna try black summer but I heard it’s terrible 💀",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qb5wbw/need_show_suggestions/"
    },
    {
        "id": "1qagrhr",
        "author": "Hot_Purple_7082",
        "title": "His &amp; Hers",
        "content": "Am I the only one who expected the ending? The mom’s energy seemed off the entire show, but that could just be me being hyper observant.\n\nAll in all it was a good show, I just definitely thought it was the mom",
        "upvotes": 32,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1qagrhr/his_hers/"
    },
    {
        "id": "1qb4i1w",
        "author": "No-Lifeguard3759",
        "title": "Am I the only one who realized that the Netflix show “Pulse” is literally the American version of the Spanish show “Respira” ALSO on Netflix?",
        "content": "As someone who loves Spanish culture AND medical drama shows, of course I watched both shows. Even the title cards are very similar. Both shows also have a hospital wide power outage caused by the weather. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qb4i1w/am_i_the_only_one_who_realized_that_the_netflix/"
    },
    {
        "id": "1q9n7yj",
        "author": "hasanahmad",
        "title": "Netflix is now the Walmart/Amazon of entertainment media",
        "content": "You can find a lot . You can find sporadic quality , a lot of trash but America is all over it everyday. It’s way too big to fail at this point after after the competitors came in and all have flatlined to be barely there or rarely competing ",
        "upvotes": 1564,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1q9n7yj/netflix_is_now_the_walmartamazon_of_entertainment/"
    },
    {
        "id": "1qakuk7",
        "author": "121scoville",
        "title": "It's me. I'm the person binge-watching all the Harlan Coben series.",
        "content": "I haven't been subscribed to Netflix for almost five years and just re-upped. Apparently I'm the mood for mid formulaic thriller limited series. Now that I've exhausted the HC supply, is there similar stuff to move on to? (Certainly wouldn't mind BETTER. But hopefully of the same \"vibe\"). Tried Beast in Me but Claire Danes was stressing me out. ",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qakuk7/its_me_im_the_person_bingewatching_all_the_harlan/"
    },
    {
        "id": "1qaz5bx",
        "author": "Training-Plastic1457",
        "title": "Materialists",
        "content": "Decent movie, which started on a high and ended as a doozie. Am I the only who thought Harry and Sophie would have made a great match? It would have been an amazing twist and good ending.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qaz5bx/materialists/"
    }
]