[
    {
        "id": "1lozjxe",
        "author": "DontTellLarryAMA",
        "title": "Hey reddit, I'm Ed Begley Jr. - You might know me from things like Best In Show, Arrested Development, Better Call Saul, St. Elsewhere, This Is Spinal Tap, Pineapple Express, Strange Darling, and more. My newest film, a dark office-comedy titled Don't Tell Larry, is out now on VOD. Ask me anything!",
        "content": "Hey reddit, I'm Ed Begley Jr. - My newest film, a dark office-comedy titled Don't Tell Larry, is out now on VOD. Ask me anything!\n\n**Bio:**\n\n**Ed Begley Jr. -** If there’s a movie or TV show you really like, chances are, Ed's been in it. Ed has seven Emmy nominations, a Golden Globe nomination and has appeared in over 270 TV shows and movies throughout his prolific career. He played Dr. Ehrlich on the television series ST. ELSEWHERE, and he also co-hosted the green living reality show LIVING WITH ED. He is a recurring cast member in Christopher Guest mockumentaries, including THIS IS SPINAL TAP, BEST IN SHOW, A MIGHTY WIND, and more. Ed starred in SHE-DEVIL, the GHOSTBUSTERS reboot, Woody Allen's WHATEVER WORKS, and PINEAPPLE EXPRESS. He has held recurring roles on the TV hits ARRESTED DEVELOPMENT, SIX FEEET UNDER, PORTLANDIA, BETTER CALL SAUL, FUTURE MAN, GARY UNMARRIED, VERONICA MARS, PARENTHOOD, BLESS THIS MESS, and MODERN FAMILY. In addition to recently recurring on the CBS hit YOUNG SHELDON, Ed also appeared in HOLIDAY TOUCHDOWN: A CHIEFS LOVE STORY and the breakout indie hit, STRANGE DARLING.\n\n**Synopsis:**\n\nAn ambitious office worker tells a tiny lie to a truth-obsessed weirdo—and ends up trapped in a corporate nightmare of her own making.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=6xREP3uLf0Q](https://www.youtube.com/watch?v=6xREP3uLf0Q)\n\n**Available to rent/purchase:**\n\nAmazon Prime Video - [https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39](https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39)\n\nApple TV - [https://apple.co/4mL4UQ0](https://apple.co/4mL4UQ0)\n\nAsk me anything! I'm back at 1 PM PT/4 PM ET to answer your questions.\n\n",
        "upvotes": 12750,
        "comments": 1419,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9rv9sdly19af1.jpeg?auto=webp&amp;s=952cd27db6ae4b500867abeba14909ac21c4a3e4"
        },
        "permalink": "/r/movies/comments/1lozjxe/hey_reddit_im_ed_begley_jr_you_might_know_me_from/"
    },
    {
        "id": "1lp1fl1",
        "author": "DontTellLarryAMA",
        "title": "Hi /r/movies! I'm Patty Guggenheim. You might know me as Madisynn in Marvel's She-Hulk Attorney-At-Law or from Peacock's Twisted Metal. I'm also a member of The Groundlings improv and sketch comedy troupe. I'm starring in a new dark office-comedy, Don't Tell Larry. Ask me anything!",
        "content": "Hi r/movies! I'm Patty Guggenheim. You might know me as Madisynn in Marvel's She-Hulk Attorney-At-Law or from Peacock's Twisted Metal. I'm also a member of The Groundlings improv and sketch comedy troupe. I'm starring in a new dark office-comedy, Don't Tell Larry. Ask me anything!\n\n**Logline:**  An ambitious office worker tells a tiny lie to a truth-obsessed weirdo—and ends up trapped in a corporate nightmare of her own making.\n\n**Don't Tell Larry - Official Trailer:**\n\n[https://www.youtube.com/watch?v=6xREP3uLf0Q](https://www.youtube.com/watch?v=6xREP3uLf0Q)\n\n**Available to rent/purchase now on:** \n\n* Amazon Prime Video: [https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39](https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39)\n* Apple TV: [https://apple.co/4mL4UQ0](https://apple.co/4mL4UQ0)\n\n**Bio:**\n\nPatty Guggenheim - she plays the lead Susan Newmar - also known for her super viral fan-favorite role as Madisynn in Marvel's She-Hulk Attorney-At-Law; recurring on this upcoming season of Peacock's Twisted Metal, coming out next month; Member of the Groundlings Main Company.\n\nAsk me anything! I'll be answering questions at 4:00 PM ET today.\n\n",
        "upvotes": 417,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zso4zxfci9af1.jpeg?auto=webp&amp;s=e88db709280d55b9740ee1830437be9537c40d3c"
        },
        "permalink": "/r/movies/comments/1lp1fl1/hi_rmovies_im_patty_guggenheim_you_might_know_me/"
    },
    {
        "id": "1lp8vsv",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s ‘The Odyssey’ Teaser Trailer Is Playing Only in Theaters",
        "content": "",
        "upvotes": 4450,
        "comments": 477,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sVw-ECXyn3N_QKryX6C00dtDv1OlGTW0uup70XXUHUo.jpeg?auto=webp&amp;s=9b5219cfb5722638783ade10f41d1dd267cfd7b5"
        },
        "permalink": "/r/movies/comments/1lp8vsv/christopher_nolans_the_odyssey_teaser_trailer_is/"
    },
    {
        "id": "1lpj5l9",
        "author": "Kaiser_Allen",
        "title": "Studios Shot Down a Crash Bandicoot Movie, Says Sega of America CEO",
        "content": "",
        "upvotes": 733,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wzMrabMDg0TFRjjZuu5LSCjGgDp1e3qbHSEskYGbaeU.jpeg?auto=webp&amp;s=d22e77d808254e97bd85c1740fbd4fdf71f1f6c1"
        },
        "permalink": "/r/movies/comments/1lpj5l9/studios_shot_down_a_crash_bandicoot_movie_says/"
    },
    {
        "id": "1lp0too",
        "author": "RobotiSC",
        "title": "Official Poster for Edgar Wright's 'The Running Man'",
        "content": "",
        "upvotes": 3869,
        "comments": 615,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3a0rcm3qe9af1.png?auto=webp&amp;s=582d20efc97cea7741e10988a61be312d9f5f990"
        },
        "permalink": "/r/movies/comments/1lp0too/official_poster_for_edgar_wrights_the_running_man/"
    },
    {
        "id": "1lpccvx",
        "author": "JonasKahnwald11",
        "title": "Adrian Grenier Isn’t Returning for ‘The Devil Wears Prada 2’",
        "content": "",
        "upvotes": 913,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/il8_Gz3cYWnoBK78OhDJCmas0MaZHb-ZMYJ0Ermmh1M.jpeg?auto=webp&amp;s=b97e9b512111387f6924689736394ccb254981ad"
        },
        "permalink": "/r/movies/comments/1lpccvx/adrian_grenier_isnt_returning_for_the_devil_wears/"
    },
    {
        "id": "1lp0ur7",
        "author": "RobotiSC",
        "title": "The Running Man | Official Trailer (2025 Movie) - Edgar Wright, Glen Powell",
        "content": "",
        "upvotes": 3420,
        "comments": 1043,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pWsV0qFLgwft0Tgk_00u-N1HTW5pjB26WHgzkudfwew.jpeg?auto=webp&amp;s=f418453a1ad21a6ad36a3e716be1b1d4b99b0be3"
        },
        "permalink": "/r/movies/comments/1lp0ur7/the_running_man_official_trailer_2025_movie_edgar/"
    },
    {
        "id": "1lp5gnu",
        "author": "MarvelsGrantMan136",
        "title": "David Dastmalchian Lands Role Of Villain M. Bison In Legendary’s ‘Street Fighter’",
        "content": "",
        "upvotes": 1799,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aNT0J_F1j_tL7vuXwsAQfEAkokZybFtt6oYw9d2lylI.jpeg?auto=webp&amp;s=22ab54090b58e14e156ebb59d15d3b0fa64ef06c"
        },
        "permalink": "/r/movies/comments/1lp5gnu/david_dastmalchian_lands_role_of_villain_m_bison/"
    },
    {
        "id": "1lp59kr",
        "author": "PeteOfDawn",
        "title": "The Jurassic franchise makes me sad",
        "content": "I think the first film is a masterpiece. One of Spielberg's greatest films of all time. Maybe not number 1 but top 5 if not 3. I watched it last year for the first time in years. I didn’t think it would be all that good anymore with how lifeless the series felt in the modern age. But no. It’s still an amazing movie that lives on its simplicity. Dinosaurs are brought back. At first it seems magical. Then it’s a nightmare.\n\nAnd now with the seventh movie in the franchise coming out I’m feeling that same tired and apathetic feeling I felt before I re-experienced the original. This really feels like it was not meant to be a franchise. The first film is very simple and the minute you try to stretch it beyond that you lose the appeal. It’s not like Indiana Jones where you can have multiple adventures. That’s why we have Dial of Destiny a chance because a fifth movie could’ve worked. But with Jurassic I just can’t see it. \n\nAnd I feel like with how lifeless the series feels now it’s easier and easier to forget how amazing the first one actually is. Which is why I’m not even bothering to see this one. I saw some reviews of it and that was enough for me to learn this wasn’t worth my time or money. We should listen to the ending of the first one and let these creatures stay gone and not try to bring them back because it never works.\n\nNot sure how anyone else feels about this. For anyone who has actually seen it is there actually something in Rebirth that’s worth while?  ",
        "upvotes": 1638,
        "comments": 576,
        "media": null,
        "permalink": "/r/movies/comments/1lp59kr/the_jurassic_franchise_makes_me_sad/"
    },
    {
        "id": "1lp57pa",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Cat in the Hat' Starring Bill Hader",
        "content": "",
        "upvotes": 1214,
        "comments": 236,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iafx99twaaaf1.jpeg?auto=webp&amp;s=521a18bb7269236907c050371e4c20348a003fbc"
        },
        "permalink": "/r/movies/comments/1lp57pa/official_poster_for_the_cat_in_the_hat_starring/"
    },
    {
        "id": "1lp802g",
        "author": "ComicBookFan20",
        "title": "Cody Rhodes Is In Talks To Portray Guile In ‘Street Fighter’",
        "content": "",
        "upvotes": 610,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V1L8Rmt2ohZyQMstm0HZEcSW0dVnuisWRws3sGEZXYk.jpeg?auto=webp&amp;s=e5640cc028fa1a57b9c33e8a884f7a0a371f3670"
        },
        "permalink": "/r/movies/comments/1lp802g/cody_rhodes_is_in_talks_to_portray_guile_in/"
    },
    {
        "id": "1lp9ir2",
        "author": "shesdrowningforher",
        "title": "2000’s erotic slasher film with major twist ending",
        "content": "EDIT: A big thank you to everyone who looked for this movie. I want to reassure you it's **not bride of chucky or urban legengs: bloody mary** (the final girl was visibly bi-racial, chucky wasn't in it etc.). I'm starting to think it was a cheap, softcore, direct to DVD one off. A few people commented who remembered this movie as well. None of us could remember anything outside of the details I shared in my post. With that, I'm gonna call it. If anyone does find it please DM. Thanks again!\n\n\n\nHi everyone! I’m looking for a very specific movie. I haven’t met anyone that’s seen it but I’m hoping movie buffs in this sub can help. I hope it’s alright to ask. \n\nWhen I was a kid I saw a movie in the early 2000’s (possibly late 90’s) about a group of young adults in a house (not sure whose house it was or why they were there). But one by one they were being murdered by a mask figure. Pretty generic but what stood it out was how sexual it was. A lot of nudity and sex. While it wasn’t an actual porn film, there was a lot of nudity and a few memorable scenes: \n\nA couple is having sex in a large bed with a red canopy. On the (I guess) ceiling of the canopy is a large mirror. The masked figure breaks the mirror and the couple is impaled while the woman is on top of the man. The mirror goes through both of them. I also recall a scene at the beginning of the movie where the final girl has sex at night on a beach while being watched by the masked figure.\n\nAnother memorable part of the movie is the twist ending (major spoiler alert):\n\nThe final girl is biracial (half black). At the end of the movie, the killer removes his mask and it’s a white male. It turns out he’s her father. I think she set fire to the house and he dies inside of the house (not 100% sure it's been 20ish years).\n\nI’m trying to find this movie because this one ignited my love of slasher films. I’ve seen countless ones since but never this one again. Does anyone know the title of this movie?",
        "upvotes": 455,
        "comments": 245,
        "media": null,
        "permalink": "/r/movies/comments/1lp9ir2/2000s_erotic_slasher_film_with_major_twist_ending/"
    },
    {
        "id": "1lpg52a",
        "author": "Intrepid_Moment_8879",
        "title": "What’s a film that changed the way you saw the world?",
        "content": "Sometimes a movie goes beyond just being a good watch. It hits something deeper and leaves you thinking about your own life, your beliefs, or the world around you. For me, that was *Into the Wild*. It made me reflect on freedom, materialism, and what really matters. I couldn’t stop thinking about it afterward.\n\nWhat’s a film that stayed with you long after it ended, and what about it made it stick?",
        "upvotes": 154,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1lpg52a/whats_a_film_that_changed_the_way_you_saw_the/"
    },
    {
        "id": "1lp5h0k",
        "author": "Comic_Book_Reader",
        "title": "The Cat in the Hat | Official Trailer",
        "content": "",
        "upvotes": 502,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1SoLCUoS44G0wuiYpJWYTPxe2o4TOMV2wbHxrU4HXGk.jpeg?auto=webp&amp;s=fa8289ab55514e287d97178b9b5f9a85b3a3f8fa"
        },
        "permalink": "/r/movies/comments/1lp5h0k/the_cat_in_the_hat_official_trailer/"
    },
    {
        "id": "1lpifo2",
        "author": "solodav",
        "title": "The Visuals in iRobot (2004) Still Look Great Today",
        "content": "I am enjoying rewatching iRobot (2004) with Will Smith this week.  I haven’t’ watched it in over a decade.  What stands out, in particular, is how sharp (picture quality) and good the futuristic visuals look.  The world-building is well done and enjoyable to be immersed in.  \n\nIt’s also got great acting from a charismatic cast and has decent plot with tension/suspense.  \n\n  \nAnyone else still enjoy this 20+ year old movie?  If so, what do you like most about it?",
        "upvotes": 87,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1lpifo2/the_visuals_in_irobot_2004_still_look_great_today/"
    },
    {
        "id": "1lov4t4",
        "author": "heromat21",
        "title": "What’s a movie you thought would flop but ended up being a massive hit?",
        "content": "I’ve been thinking about how some films totally defy expectations. For me, I was sure *The Lego Movie* would bomb, but it turned into a huge deal. I can't bet against any movie now. \n\nWhat’s a movie you bet against that surprised you with its success? Bonus points if you can figure out why it worked, although it did!",
        "upvotes": 1667,
        "comments": 1063,
        "media": null,
        "permalink": "/r/movies/comments/1lov4t4/whats_a_movie_you_thought_would_flop_but_ended_up/"
    },
    {
        "id": "1lpe4yo",
        "author": "Puzzled_Influence985",
        "title": "Best Event Movies where a large group of people come together to solve a problem?",
        "content": "Hey folks, as the title suggests, I'm trying to come up with a list of movie night films where a group of diverse people (in professions, backgrounds, etc.) come together to solve a big issue. I'm looking for films like **Unstoppable, etc.** Entertaining films that put a lot of interesting actors together. \n\nThanks! ",
        "upvotes": 88,
        "comments": 179,
        "media": null,
        "permalink": "/r/movies/comments/1lpe4yo/best_event_movies_where_a_large_group_of_people/"
    },
    {
        "id": "1lpegj3",
        "author": "BunyipPouch",
        "title": "Theater Chain CMX Cinemas Files for Chapter 11 Bankruptcy Protection - The Miami-based, dine-in, and luxury theater chain that's present in 8 states, haven recently upgraded many screens to IMAX, has filed for bankruptcy for the second time in 5 years.",
        "content": "",
        "upvotes": 79,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9lUKUDEoVO7VJ4ng5WGZPlxomVthiy2mLBkBJlVvcGw.jpeg?auto=webp&amp;s=46fdac40529a937021db89bbf45675f496f0ddf4"
        },
        "permalink": "/r/movies/comments/1lpegj3/theater_chain_cmx_cinemas_files_for_chapter_11/"
    },
    {
        "id": "1lpi6zz",
        "author": "antoniodiavolo",
        "title": "What are some movies that you wanted “more” of but absolutely do NOT want a sequel to?",
        "content": "I feel like the title might be confusing so I’ll elaborate.\n\nHave you ever seen a movie that left you wanting more but you also don’t think it should have a sequel?\n\nThe most recent example for me is Sinners. I wanted to see more of that world and those characters. At the same time, I definitely don’t want them to make a sequel or prequel. I think the movie works perfectly on it’s own and I think making spinoffs would kinda cheapen it. Not everything has to be a franchise.\n\nAnother example would be The Goonies for basically the same reasons.\n\nWhat are some movies that are that way for you?",
        "upvotes": 41,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1lpi6zz/what_are_some_movies_that_you_wanted_more_of_but/"
    },
    {
        "id": "1lp113n",
        "author": "NoCulture3505",
        "title": "SENTIMENTAL VALUE - Official Trailer - In Theaters 11.7",
        "content": "",
        "upvotes": 264,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Vfzhy5wWQS5K-4jcJDY-cpLqAPP4-SRyaChUB-wI65A.jpeg?auto=webp&amp;s=8535efb685a9a8cbe47f8c282676f2d89c2f161b"
        },
        "permalink": "/r/movies/comments/1lp113n/sentimental_value_official_trailer_in_theaters_117/"
    },
    {
        "id": "1lpqjng",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the scariest scene you’ve seen in a kids movie?",
        "content": "My pick is basic but the scene in Coraline when the “other mother” turns around to reveal she has button eyes will never fail to give me literal chills. Wish we would get more animated horror movies like Coraline, I don’t think anything has matched it since. \n\nWhat are some other scary scenes in kids movies? (can be live action or animated).",
        "upvotes": 7,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1lpqjng/what_is_the_scariest_scene_youve_seen_in_a_kids/"
    },
    {
        "id": "1lpml4f",
        "author": "walkfunnee",
        "title": "Are there any movies like Lars and the Real Girl?",
        "content": "I watched this movie thinking it was gonna be some bonkers comedy, but it’s actually really good. I found myself invested in it from start to finish, especially Ryan Gosling, his acting was just beautiful. I need more Ryan Gosling in these roles, however, it looks like this is the only movie he’s done like this besides The Notebook. I would appreciate recommendations of movies like this that have that raw vulnerability and just stellar acting. ",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1lpml4f/are_there_any_movies_like_lars_and_the_real_girl/"
    },
    {
        "id": "1lp7gze",
        "author": "darth_vader39",
        "title": "‘Spinal Tap’ Director Rob Reiner on the Forthcoming Sequel ‘The End Continues,’ the ‘Remasterd’ Edition of the Original Film, and How They Got Here",
        "content": "",
        "upvotes": 103,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cSCKLovi8i4hiR84jKci9P3BL9cE6yz-Q5HsftUPESQ.jpeg?auto=webp&amp;s=f06a848b26f6c5cf499297e8811f3d3d3b2a8018"
        },
        "permalink": "/r/movies/comments/1lp7gze/spinal_tap_director_rob_reiner_on_the_forthcoming/"
    },
    {
        "id": "1lp7cfi",
        "author": "DifferentInstance668",
        "title": "What’s that one movie you always end up rewatching?",
        "content": "It doesn't matter how many new tv shows or movies I watch I always catch myself going back to the same comfort ones when I just can't find anything else to watch or when I need some background noise while i'm cooking my dinner or cleaning the dishes. It's one of them: office or Interstellar (completely different genre I know) but even tho I know what will happen next I'm still able to find great joy because of how good they were made. What’s your comfort movie? Curious what everyone’s go to is when you just wanna chill out.",
        "upvotes": 101,
        "comments": 227,
        "media": null,
        "permalink": "/r/movies/comments/1lp7cfi/whats_that_one_movie_you_always_end_up_rewatching/"
    },
    {
        "id": "1lpr912",
        "author": "Psychological-Sand-9",
        "title": "Christopher Nolan's 'The Odyssey' - leaked teaser",
        "content": "First look at my favorite director's upcoming movie.\nThe buzz is already deafening for what promises to be a cinematic event of mythic proportions: Christopher Nolan’s The Odyssey. Following his Oscar triumph with Oppenheimer, Nolan is turning his lens to one of the cornerstones of Western literature, and fans are ecstatic. The prospect of the visionary director bringing Homer’s epic to the big screen has ignited a firestorm of anticipation, positioning it as one of the most awaited films of the decade.What makes this pairing so electrifying is Nolan’s signature filmmaking style. Known for his masterful manipulation of time and non-linear narratives, he is uniquely suited to adapt a story that begins in medias res and unfolds through flashbacks. Audiences are eager to see Odysseus’s ten-year journey not just as a linear sequence of events, but as a fractured, psychological odyssey. Nolan’s commitment to practical effects and awe-inspiring IMAX cinematography promises a visceral experience, translating the Cyclops’s cave and the Sirens’ call into breathtaking, tangible spectacles. The themes of perseverance, identity, and the haunting passage of time are central to the epic and resonate deeply with Nolan’s previous work in films like Inception and Interstellar.Fan excitement has been expertly stoked by a characteristically Nolan-esque marketing campaign. The release of a teaser trailer exclusively in theaters has created a sense of event and exclusivity, driving online discussion and speculation to a fever pitch. With an all-star cast reportedly led by Matt Damon and Tom Holland, every tidbit of news is devoured by a fanbase confident that Nolan will deliver a film that is both a faithful, grand-scale epic and a profound, thought-provoking masterpiece. The wait for its 2026 release will be a long one, but for movie lovers, the journey has already begun.",
        "upvotes": 5,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1ruenxo2ifaf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lpr912/christopher_nolans_the_odyssey_leaked_teaser/"
    },
    {
        "id": "1lp8fal",
        "author": "Past_Reflection_9695",
        "title": "The Real story of Big Fish",
        "content": "I originally watched the movie Big Fish once in theaters because I love Tim Burton movies and I loved the movie for being a fanciful stretch of reality like Edward Scissorshands.\n\nI just watched the movie again with my wife and kids and I get a new perspective from the dad.  The stories are mostly real but they are somewhat more frightening as a real tale without the softened edges for the son.  There are major historical events in Big Fish that I think Tim Burton weaved into the story to give the son perspective without trying to scare him while the father deals with his own issues.  The stories come with real life issues like depression, cowardice, PTSD, paralysis, and risk of death.\n\nWhat if your son asked you about your time in war?  A lot of people just didn't talk about it after WW2.  A lot of people went nuts after their time in Vietnam.  Here, the father gets to tell the tale of almost dying by ignoring the dark parts and violenc by emphasizing his recruitment of twins for defection for a carnival act, and managing them as he worked his way home across multiple Communist countries; rather than telling a tale about his family thinking he was dead, the hardship of war, and his desertion from the military after being a POW (the book version has the boat he was on being sank off of North Korea).\n\nWhat if your son wanted to ask you about your childhood and you spent a long time paralyzed from polio hooked up to machines that pushed and pulled on your body?  You were paralyzed in youth because there were no polio vaccines before 1953 (before Korean War and up to 30 years before end of Vietnam War).  Your son was fully vaccinated and you never even told you about the scare of life with polio (heck, a lot of anti-vaxxers now grew up with vaccines and never knew what polio was).  How do you tell your child about a risk in your life that he will never have to face in his lifetime?\n\nEvery two weeks, you save for a home for your wife and kids.  You put away money for years while your wife and kids live in a trailer park.  You scrimp and save only to have it wiped away by the oil speculation crash of 1986.  Only, the stock crash isn't only affecting Texans, you go home to Alabama to find this gambling destroyed small towns like Spectre as well after Black Monday in 1987.  The father happens to know people who retained their wealth through the crash and he makes a predatory purchase on the whole town of Spectre for pennies on the dollar (via public tax auction).  Then he places it in trust so his friends can get steady payments on the city while he \"saves\" some childhood friends.  Instead of telling the son about exploiting people at their worst and taking advantage after the big banks reamed people over, the dad gets to spin it as a tale of being an accidental bank robber and advising a friend to becoming an even bigger villain in a comical way.  Additionally, he avoids telling his son that he also lost all the family money in speculation by saying a robber took his money.\n\nWorking for a circus with a homeless giant you met battling by the river has a more magical ring is just it's own thing.  The werewolf at night that rages may have been helping Danny Devito deal with his demons like alcohol abuse after hours in his trailer.\n\nTim Burton wrote the movie based on the book but also his own relationship with his own dad.  I think there was more real truths than lies in this story.\n",
        "upvotes": 69,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1lp8fal/the_real_story_of_big_fish/"
    },
    {
        "id": "1lorp63",
        "author": "BunyipPouch",
        "title": "Poster for the 35th Anniversary Theatrical Re-Release of 1990's 'Teenage Mutant Ninja Turtles' - Will include a featurette that has never-before-seen footage, extended deleted scenes, director commentary, and behind-the-scenes extras.",
        "content": "",
        "upvotes": 830,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g3ym8dj2o6af1.jpeg?auto=webp&amp;s=429a6c02e6f048d787ffe7b8bbf326d6972b435c"
        },
        "permalink": "/r/movies/comments/1lorp63/poster_for_the_35th_anniversary_theatrical/"
    },
    {
        "id": "1lpkmqt",
        "author": "WritingUnicorn2019",
        "title": "Great Musical Scores",
        "content": "I just finished watching Blues Brothers from 1980 and I still think it’s one of the first — and best — soundtracks compiled from hits and hit artists. The music, the original artists, and the great attempt at the blues from the SNL brothers all enhances the experience. What are some of your favorite movies with kick ass soundtracks?",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1lpkmqt/great_musical_scores/"
    },
    {
        "id": "1lotq45",
        "author": "tokwamann",
        "title": "In Praise of Character Acting (Actors Who Aren't A-Listers or Leads but Whose Characters are Just as Important)",
        "content": "",
        "upvotes": 501,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gXIIVC6qyPhxI_SDuhQIOfCUXsVMW3NRt5W2BzyWqLg.jpeg?auto=webp&amp;s=febf13b3bd5ba297af6dbfcdac0f2b204600d7e5"
        },
        "permalink": "/r/movies/comments/1lotq45/in_praise_of_character_acting_actors_who_arent/"
    },
    {
        "id": "1lpe1kd",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Ilya Naishuller - Wednesday 7/2 at 3:00 PM ET - Director of 'Hardcore Henry', 'Nobody', and 'Heads of State'",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pxej9a6czbaf1.png?auto=webp&amp;s=a45eac6a29f51ee37169efc258de7218c70cc342"
        },
        "permalink": "/r/movies/comments/1lpe1kd/amaqa_announcement_ilya_naishuller_wednesday_72/"
    },
    {
        "id": "1loaxem",
        "author": "MoviesMod",
        "title": "Project Hail Mary - Official Trailer (fair warning, it reveals way too much according to a lot of users)",
        "content": "",
        "upvotes": 5865,
        "comments": 1143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DNij_KXMqEq44ilvf3N8C0zHxUzmORjt98hrEkIM6g.jpeg?auto=webp&amp;s=4662b771d0351cdc0e96e724924456ae417459fa"
        },
        "permalink": "/r/movies/comments/1loaxem/project_hail_mary_official_trailer_fair_warning/"
    },
    {
        "id": "1lojvuk",
        "author": "MarvelsGrantMan136",
        "title": "Inside Elio’s Catastrophic Path: America Ferrera’s Exit, Director Change and Erasure of Queer Themes",
        "content": "",
        "upvotes": 1893,
        "comments": 704,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/43Wj_tT9XrXaV_sBCJQVIJ9Syt6Wt7ZG__uwUqTDKq0.jpeg?auto=webp&amp;s=12c89ed806b56ef01142910a07b77e9b60355733"
        },
        "permalink": "/r/movies/comments/1lojvuk/inside_elios_catastrophic_path_america_ferreras/"
    }
]