[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ix6jar",
        "author": "ellissabain",
        "title": "Brian Laundrie’s sister speaks out after Gabby Petito doc and angrily defends her brother",
        "content": "",
        "upvotes": 874,
        "comments": 364,
        "media": null,
        "permalink": "/r/netflix/comments/1ix6jar/brian_laundries_sister_speaks_out_after_gabby/"
    },
    {
        "id": "1ix1eod",
        "author": "Somethingman_121224",
        "title": "Dave Bautista Is Pushing Netflix To Finally Make A 'Gears Of War' Movie",
        "content": "",
        "upvotes": 220,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ix1eod/dave_bautista_is_pushing_netflix_to_finally_make/"
    },
    {
        "id": "1ixjtz3",
        "author": "Worldly-Committee-71",
        "title": "Maria isn’t Maria",
        "content": "I love Angelina to bits, but what horrible movie… I couldn’t finish it. Terrible pacing, no emotion, no range. I don’t believe Callas was that. \nThere were some good scenes when she sang, but all the rest is … really really bad and nothing saves it.\n\nWho thought it’s Oscar-worthy? ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ixjtz3/maria_isnt_maria/"
    },
    {
        "id": "1ixc6fq",
        "author": "RamboToots",
        "title": "Watching ‘Don’t Look Up’ Again",
        "content": "I recommend watching Don’t Look Up with Leave the World Behind.  Two movies worth a watch right now with all that’s going on.  Some comedic effect which I always appreciate.  ",
        "upvotes": 22,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc6fq/watching_dont_look_up_again/"
    },
    {
        "id": "1ixa6r8",
        "author": "RebelGrin",
        "title": "Belle Gibson docu - why wasn't she criminally charged?",
        "content": "Belle Gibson’s actions—falsely claiming to have cured her cancer through natural remedies and profiting from those lies—were certainly unethical and deceptive. However, she was never criminally charged in Australia. Instead, she faced civil penalties under consumer law. \n\nAnd why didn't Apple and Penguin sue her? \n\nHere’s why criminal charges were not pursued in Australia:\n\n1. Civil vs. Criminal Law – Gibson’s conduct was primarily treated as a violation of consumer law rather than criminal fraud. The Australian Competition and Consumer Commission (ACCC) pursued her under the Australian Consumer Law (ACL) for misleading and deceptive conduct.\n2. Burden of Proof in Criminal Cases – For criminal fraud charges, prosecutors would need to prove beyond a reasonable doubt that she knowingly and intentionally deceived people for financial gain. While morally clear, legally, this can be more complex.\n3. Consumer Law Penalties – In 2017, the Federal Court found Gibson guilty of misleading consumers and fined her $410,000 for false health claims and failing to donate promised proceeds to charity. This was seen as a sufficient legal response.\n4. No Individual Criminal Complaints – Fraud charges often require direct victims to make formal complaints. While many people felt deceived, there wasn’t a widespread push for criminal prosecution.\n5. Lack of Specific Criminal Charges – Australian law does have fraud provisions, but proving criminal intent and harm at a level warranting prosecution may have been difficult.\n\nSo while her actions seemed fraudulent in a moral sense, legally, authorities chose a civil route rather than criminal charges. \n\nWould you have preferred a criminal case? \n\nI would ! ",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ixa6r8/belle_gibson_docu_why_wasnt_she_criminally_charged/"
    },
    {
        "id": "1ixaox7",
        "author": "TheMirrorUS",
        "title": "Karla Sofia Gascon plans to attend Oscars after Twitter scandal as Netflix funds outing",
        "content": "",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ixaox7/karla_sofia_gascon_plans_to_attend_oscars_after/"
    },
    {
        "id": "1ixghwd",
        "author": "snagbuck",
        "title": "Crossover opportunity for Night Agent and Recruit?",
        "content": "As a fan of both the recruit, and night agent…I think there is a fantastic crossover opportunity with these and the ways both second seasons wrapped up. Without mentioning spoilers, they’re headed to the same location. Bonus points if you can tie in the diplomat (though I only watched the first season of that one). I know the story lines are completely different, but a person can dream. Or maybe the Marvel TV universe has me spoiled. \n\n\nAnyone else thought about this? Anyone care to weigh in on how completely unrealistic this fantasy is? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixghwd/crossover_opportunity_for_night_agent_and_recruit/"
    },
    {
        "id": "1ixn2ln",
        "author": "TheViolist2000",
        "title": "Cassandra list of songs",
        "content": "Can someone please go through the effort to list all the songs (not the Netflix soundtrack but the actual songs) played in Cassandra? I've suddenly developed an affinity for 70s German pop as a result of watching???",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixn2ln/cassandra_list_of_songs/"
    },
    {
        "id": "1ixmm4h",
        "author": "hooper610",
        "title": "Zero Day not Playing in 4k or HDR",
        "content": "Zero Day for whatever reason will only play in HD. I have tried in Apple TV and LG Netflix app. Every other show I have tried works fine in 4k and HDR. Episode 4 and 5 are totally broken. The earlier episodes I could get HDR or 4k by restarting the stream sometimes. Anyone else? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixmm4h/zero_day_not_playing_in_4k_or_hdr/"
    },
    {
        "id": "1iwwzok",
        "author": "S4v1r1enCh0r4k",
        "title": "Jessica Gunning has won the SAG Award for Best Actress in a Limited Series for her role in Baby Reindeer.",
        "content": "",
        "upvotes": 43,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iwwzok/jessica_gunning_has_won_the_sag_award_for_best/"
    },
    {
        "id": "1ixmj3m",
        "author": "DeviantBoi",
        "title": "I accidentally clicked on getting weekly reminders for WWE Raw. Can't find how to make them stop.",
        "content": "I misclicked on my phone and now I'm getting weekly reminders about it.\n\nIt was on My List but the option to remove wasn't there. I had to click on the \"+\" to add it to my list and then I could remove it. But that hasn't stopped the notifications.\n\nEDIT: Just checked my list and it's back on it even though I had removed it. I guess it adds itself with each reminder. This is annoying as hell.\n\nAny ideas?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixmj3m/i_accidentally_clicked_on_getting_weekly/"
    },
    {
        "id": "1ixc9f5",
        "author": "Stephxnle",
        "title": "Netflix Error Code CM: 42709",
        "content": "I have gotten a new phone and I had it replaced and now Netflix is popping up this error only on this device. \n\nMy TVs work fine and customer service was unable to resolve this issue so unfortunately I’m stuck. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ixc9f5/netflix_error_code_cm_42709/"
    },
    {
        "id": "1ix5zg5",
        "author": "MysteriousDelay6266",
        "title": "Adolescence | Official Trailer | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ix5zg5/adolescence_official_trailer_netflix/"
    },
    {
        "id": "1iwhx3j",
        "author": "katiereadalot",
        "title": "What cancelled Netflix show would you bring back if you could only pick 1?",
        "content": "If I can only pick one I’m torn between Julie &amp; the Phantoms and The Society but I think more people want JATP. Plus I could use more JATP songs, that album gets so much play on my Spotify for an adult…",
        "upvotes": 246,
        "comments": 1315,
        "media": null,
        "permalink": "/r/netflix/comments/1iwhx3j/what_cancelled_netflix_show_would_you_bring_back/"
    },
    {
        "id": "1ixib6i",
        "author": "Bloomingalenight",
        "title": "What if we are also living in a place just like in pantheon",
        "content": "Hey yall I started watching pantheon it honestly is super relaxing to watch with just the right amount of drama but I can’t stop thinking if…. This has been done before (with the use of chatgbt and other systems), if we too are living in a simulation, or even if what we think is real is all an illusion. What do yall think",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixib6i/what_if_we_are_also_living_in_a_place_just_like/"
    },
    {
        "id": "1iwqn2e",
        "author": "Loose_Clock609",
        "title": "Gabby &amp; Brian- Their Parents",
        "content": "Brian is the villain, there's no doubt about that. He used classic abuse tactics not only on Gabby but her mom as well. It should be discussed how he abused Gabby but how he manipulated the parents as well. \n\nGabby's mom said Brian would text her things about Gabby being around bad people and she believed him. I wonder if the mom had a history of abuse or if this is common with abusers. \n\n**I don't blame her parents. I do wonder if her friends or family intervened would it have changed the outcome? If victims of abuse feel they have a safe place to go-do they go?",
        "upvotes": 65,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1iwqn2e/gabby_brian_their_parents/"
    },
    {
        "id": "1ixaj7w",
        "author": "Yana123723",
        "title": "Just watched Hunger(2023)",
        "content": "This review that I’m writing right now isn’t much because I’m only and Hour and 25 minutes into the movie but so far I’m loving it the Chef is very strict in the movie but also has some nice parts to him, but when he serves the food to his customer’s it looks like he makes it look bloody which could be a bit creepy, but when you get halfway in and hear why he wanted to become a chef it sorta makes sense as too why he likes looking at them eat like that but this show also makes me scared to get married one day because I just past the scene where on the news it shows that the father killed his wife and daughter and then his self after having a meal made by the main chef in the movie and now I can’t just stop thinking what if I get married one day and my husband decides that life is too hard for him and makes the ultimate decision to unalive me and my child then him last. I know death eventually will happen to all of us but I felt that was a coward move to make.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ixaj7w/just_watched_hunger2023/"
    },
    {
        "id": "1ixfdui",
        "author": "Helpful-Figure-1545",
        "title": "Set lighting program?",
        "content": "Hey I want to get into set lighting for netflix. Don't know who to reach out. I heard they have a program to recruit. But don't the name of the program. It there anyone that knows of this program or guidance to get into set lighting for netflix? Internships? In LA? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ixfdui/set_lighting_program/"
    },
    {
        "id": "1iwikkm",
        "author": "PhantasiaFan23",
        "title": "I found the filming location for the house from the series “Cassandra”",
        "content": "",
        "upvotes": 112,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iwikkm/i_found_the_filming_location_for_the_house_from/"
    },
    {
        "id": "1ixj62d",
        "author": "notsokyaut",
        "title": "Netflix Account Issues",
        "content": "I just realized that I can't access Netflix while traveling as I get the error \"your account can't be used in this location\". On reaching out to customer support, I was told that I need to restart the account such that the subscription will be based on the country I am in. However, once I do that, my account won't be accessible in my home country where I originally created the account. My account is a shared account and this is a weird policy. What is the point of having a shared account with multiple screens and all if Netflix enforces such policies. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ixj62d/netflix_account_issues/"
    },
    {
        "id": "1ix8jkt",
        "author": "Ok_Bag_3020",
        "title": "Series recommendations",
        "content": "Hello guys! I really need some series recommendations. I will start to say that i watch literally everything. The best shows that i’ve ever watched are breaking bad,euphoria,you,shameless,squid game,skins till s4,baby reindeer…and others for sure\nI really like series like euphoria,skins or the movie thirteen where parties and drugs are involved.\nBut as i said i really watch every kind of series or movies. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ix8jkt/series_recommendations/"
    },
    {
        "id": "1ix84ip",
        "author": "Scary_Couple8243",
        "title": "Tv show suggestions?",
        "content": "Anybody got great tv show suggestions? If it’s an amazing show but it’s not on Netflix, feel free to tell me about it too!\n\nThese are the shows I watched and really enjoyed: \n-3 Body Problem\n-Breaking Bad\n-Brooklyn 99\n-Stranger Things\n-The Good Place\n-You\n-DarK\n-Mindhunter\n-Squid Game\n-The Queen’s Gambit\n-A Man on the Inside\n-Arcane \n-Cyberpunk Edgerunners\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ix84ip/tv_show_suggestions/"
    },
    {
        "id": "1ix7lzw",
        "author": "jhaas2629",
        "title": "Confused about Brooklyn Nine Nine status",
        "content": "We started watching the episodes available on Netflix a couple weeks ago. Noticed a \"last day to watch: 2/25\" message. But then a few days ago it also started saying \"new seasons are coming\". What is happening?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ix7lzw/confused_about_brooklyn_nine_nine_status/"
    },
    {
        "id": "1iwwy86",
        "author": "The_goat_42",
        "title": "Blacklist",
        "content": "I’ve seen so many people writing about how great this show is so I decided to give it a go.\n\nI’m 4 episodes in and I don’t get it… the main plot line is thin, the dialogue is ridiculous, the individual episode plots aren’t interesting, I love Spader but his character is so annoying. It’s just like any other Mentalist/Lucifer etc. shows with the quirky main character and BS mysteries…\n\nDoes it ever get better? \n",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iwwy86/blacklist/"
    },
    {
        "id": "1iwuaog",
        "author": "Somethingman_121224",
        "title": "Insider Seemingly Confirms 'Stranger Things' Season 5 Release Dates, Focus of the Season Will Be on Three Characters",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iwuaog/insider_seemingly_confirms_stranger_things_season/"
    },
    {
        "id": "1iwazcd",
        "author": "feudingfandancers",
        "title": "Price rise is ridiculous (UK)",
        "content": "I’m guessing they just think people will roll over and take it but I’m cancelling my subscription that I’ve had continuously for many years. \n\nNetflix is the one streaming service I’ve kept each month because I felt it was worth it, but a £2 rise is ridiculous. So instead of my £11 (already most expensive sub) each month, I’ll probably use it a few times a year now. ITV now has loads of comedies (which is what I use Netflix for the most) and is much cheaper. \n\n\nI hope others will also cancel and it will affect their profits. \n",
        "upvotes": 92,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1iwazcd/price_rise_is_ridiculous_uk/"
    },
    {
        "id": "1iwob95",
        "author": "Alan_Stamm",
        "title": "'Offline Love' ditches digital dating and puts old-school romance to the test",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iwob95/offline_love_ditches_digital_dating_and_puts/"
    },
    {
        "id": "1ixd3gm",
        "author": "Friendxx",
        "title": "Something I noticed about Love Is Blind",
        "content": "The couples that make it all the way to wedding, usually the woman is physically attractive. The couples that split or break up at the alter, almost always the woman is average or less physically attractive. It seems that every \"hot\" woman with a decent personality always gets a yes at the end. It's possible to predict with fairly consistent certainty if a relationship is going to fail, just by looking at how attractive the woman is. Obviously there are exceptions, especially when the man is also conventionally unattractive. But a conventionally attractive man almost always only ends up saying yes at the end to a good looking woman.\n\n  \nIt's kind of lame but I feel like a lot of the contestants drag out the relationship as long as possible just so they can stay on TV and get more social media followers, when you could just tell most times the guy will never say yes to a woman. Also a lot of times the woman would sense the guy is not interested, and proactively reject him, often times very harshly, because of that to place the blame on the guy.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ixd3gm/something_i_noticed_about_love_is_blind/"
    },
    {
        "id": "1ixn2yn",
        "author": "GenX-istentialCrisis",
        "title": "Squid Game 2 absolutely sucks and is a complete waste if time.  Blatant money grab for Netflix to set up for a Season 3.",
        "content": "Don't bother watching the second season of Squid Game. Absolute garbage. The biggest letdown ever I have experienced in a show. Nothing smart or nuanced like the first season...just gratuitous violence and deplorable characters. Everyone dies and there is nothing even remotely redemptive about the storyline.  Just gore and death and pointlessness until the very end when you are encouraged to tune in to Season 3 to see what happens. A complete waste of a good show and a blatant money grab by Netflix.  I am so pissed off at the hours I wasted hoping there might be some kind of payoff, but nothing. It has completely killed my desire to watch any further.  After sitting through hours of pointless bloodshed, I could care less about a Season 3.  Don't bother wasting your time on Season 2 of Squidgame. Garbage!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ixn2yn/squid_game_2_absolutely_sucks_and_is_a_complete/"
    },
    {
        "id": "1ix6sgk",
        "author": "ellissabain",
        "title": "Gabby Petito: Who FBI agent Loretta Bush actually is, and why you can’t find her online",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ix6sgk/gabby_petito_who_fbi_agent_loretta_bush_actually/"
    }
]