[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hb1k7v",
        "author": "bangeybois25",
        "title": "What’s the name of this show? ",
        "content": "Used to have a subscription to Netflix years ago (10+). I remember there was this survival show based on true events. Specifically there was this one episode about a man surviving a bear attack in the woods. It got pretty gruesome at some points. The show was apart of my childhood and I’ve been trying to find it again and have had no luck. \n\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hb1k7v/whats_the_name_of_this_show/"
    },
    {
        "id": "1hb5yzn",
        "author": "ayoitselena",
        "title": "Beauty in black",
        "content": "I rlly wanna watch this show but I have severe hemetophobia, so please can someone tell me if there are any vomit scenes? Timestamps or previous scenes/words in order to avoid it are appreciated🙏🏻🥺",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb5yzn/beauty_in_black/"
    },
    {
        "id": "1hb400v",
        "author": "EpicVictoryRoyalBoi",
        "title": "Audio and Subtitles changing when in another country",
        "content": "I’m currently in Peru, although i came from australia just for holidays. I’m trying to watch the mob psycho anime, but before coming here, i’ve it downloaded in english. However now that i’m in Peru, the audio and subtitles have changed and my downloads also have changed to only the spanish, japanese and portuguese options with no English audio or subtitles available anymore. \n\nI’ve put the profiles and everything on english but the language for the dub and subtitles are only either in japanese, spanish or portuguese still! Idk if it’s the same situation for anyone else but it is something that’s been driving me insane.\n\nI’m on the third season and things have been getting really good and I love Reigens VA int eh english dub so I don’t wanna lose that! Please help!!!\n\nTL:DR: My audio and subsidies have changed for the anime i’m watching and i can’t change it back despite setting everything to english primarily. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb400v/audio_and_subtitles_changing_when_in_another/"
    },
    {
        "id": "1hb3ifj",
        "author": "misterpopculture",
        "title": "That Christmas With Director Simon Otto",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb3ifj/that_christmas_with_director_simon_otto/"
    },
    {
        "id": "1hau90t",
        "author": "AlexaDives",
        "title": "Help Identifying a Japanese Film from Netflix I saw in between (2010-2011) with Explicit Sex Scenes and Comedic Elements",
        "content": "Hi everyone, I’m trying to track down a Japanese film I watched on Netflix around 2010-2011. I’m sure it was a sex film. Not sexual scenes but scenes with full blast sex. The movie had explicit sex scenes, comedic elements, and was definitely in the adult or niche section of Netflix at the time.\n\nSome details I remember:\n\t•\tThe film featured actual sex scenes (not just sexual content, but actual explicit scenes) of a young woman and an old man where he feels her up on and begins to try and have sex with her, he tries to penetrate her but she keeps blowing him until he finishes to prevent him from wanting to feel like finishing in her or whatever. \n\t•\tIt had a comedic tone, not taking itself seriously.\n\t•\tThere were scenes involving bugs being used in fights or some bizarre concept along those lines.\n\t•\tAt one point, the suns face turned to the face of one Japanese dude in the film and started talking to him.\n\nI’m pretty sure the word “sex” was in the title, but it’s been so long I can’t recall the exact name. Has anyone seen a film with these themes from that era? Any suggestions would be greatly appreciated!",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hau90t/help_identifying_a_japanese_film_from_netflix_i/"
    },
    {
        "id": "1hatvm0",
        "author": "MrJeff18",
        "title": "Netflix charged me directly after canceling Verizon Play+",
        "content": "Just an FYI I had Netflix premium free for a year through Verizon Play+.  I cancelled my subscription though Verizon Play+ and Netflix started charging me directly through my Netflix account.  I never authorized them to start my subscription and when I try to contact support I'm greeted with \"Wait time for live help is longer than usual\nCheck back later\".  If you have Netflix through your phone company and planning on cancelling be aware.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hatvm0/netflix_charged_me_directly_after_canceling/"
    },
    {
        "id": "1havg7g",
        "author": "wellthatspeculiar",
        "title": "Windows app not streaming over 1080p on PC",
        "content": "Hi folks,\n\nHoping I can get some better advice here than I got from Netflix Support.\n\nI'm trying to stream Netflix above 1080p on my PC. I'm streaming through the Netflix Windows app on Windows 11. I'm running an MSI MAG 271QPX QD-OLED E2 through an HDMI 2.1 Certified cable into an RTX 3070. All three components support HDCP 2.2.\n\nI was happily streaming in 1440p throughout the day when all of a sudden my stream was interrupted by an error message and after reloading the stream was stuck at 1080p again. I've tried clearing the cache for Microsoft Edge and restarting my computer to no avail. Graphics card driver and Windows update are both fully up to date. I pay for Netflix Premium. I also have the HEVC extension installed and I've tried resetting it. \n\nI reached out to Netflix support with the same details and the best advice I got was to try streaming through Safari. Needless to say, I'm hoping I get better advice here.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1havg7g/windows_app_not_streaming_over_1080p_on_pc/"
    },
    {
        "id": "1hau6jq",
        "author": "anayonkars",
        "title": "Questions about Kaleidoscope",
        "content": "Not sure if this is correct sub (found couple of subs but those are inactive since 6-8 months).\n\nI have couple of questions (spoilers ahead):\n\n1. &gt;!Why they went it all the way for the elaborate heist? I mean it's clear that Vernon is only interested in hurting Salas, and not in money. So why do all of this and endanger lives of other people? There got to be something easier than targeting most secure vault in US (e.g. targeting Salas' other weak points etc.)!&lt;\n2. &gt;!Did Vernon die in the end? There's a montage where a unknown person walks behind and pulls a gun. Does it mean that Judy &amp; Stan are only survivors?!&lt;\n\nThanks in advance!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hau6jq/questions_about_kaleidoscope/"
    },
    {
        "id": "1haz7yq",
        "author": "yutgoj",
        "title": "Does netflix have bad subbing or is it js my device",
        "content": "Every other episode theres always subtitles delay, between my phone and my ipad its so hard to keep up with what they're saying since its delayed, i haven't had this problem with other shows (except for the occasional wrong spelling and grammar), i checked on other sub languages and it actually keeps up with it",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1haz7yq/does_netflix_have_bad_subbing_or_is_it_js_my/"
    },
    {
        "id": "1hb0rwt",
        "author": "Necessary_Force_3972",
        "title": "So I just recently saw the trailer for the electric state movie, and it was kinda meh",
        "content": "I dunno, to me this movie doesn't really nail the vibe of the electric state art and setting. I likely will watch it, but the trailer seems painfully generic. I really liked the art style, but come on, the only similarity it seems is the same basic scenery.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hb0rwt/so_i_just_recently_saw_the_trailer_for_the/"
    },
    {
        "id": "1h9yr0b",
        "author": "Backwoodz333",
        "title": "Why does this happen when i try to watch any show?",
        "content": "Everything looks fine in the main menu, preview of the show, and preview when I’m fast forwarding but when i play the show the contrast is way off\n\nWhat’s happening? It says Netflix is updated",
        "upvotes": 195,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1h9yr0b/why_does_this_happen_when_i_try_to_watch_any_show/"
    },
    {
        "id": "1harkez",
        "author": "bigced",
        "title": "Big Sean Thanks Tyler Perry For Grandmother’s Story In Movie",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1harkez/big_sean_thanks_tyler_perry_for_grandmothers/"
    },
    {
        "id": "1hb4u98",
        "author": "Metro-UK",
        "title": "Netflix viewers slam ‘offensive’ new movie about Mary with Bible inaccuracies",
        "content": "Netflix viewers have condemned a new movie, Mary, which follows the mother of Jesus from her childhood in Nazareth to the birth of the prophet.\n\nHowever, after tuning in, many viewers have were not impressed with the film taking creative liberties with the story. \n\n‘Not accurate at all according to the Bible. I’m offended by it. Don’t watch this piece of trash,’ one posted.\n\n‘Awful. Brutal. In almost no way followed the original source material about Mary,’ Laurie shared.\n\nSome critics have said the film has a lack of Arab and Palestinian representation and questioned the casting of an Israeli actress in the lead role.\n\nMeredith Warren, a Senior Lecturer in Biblical and Religious Studies at the University of Sheffield wrote: ‘The story of a Palestinian mother who gave birth in a ruined building, on the run from murderous soldiers, could have been timely and important.\n\n‘Instead, \\[the film\\] reinforces many dangerous stereotypes that have historically led to violence against Jews, while avoiding showing the holy family’s embrace of Jewish practices.’\n\n**Read more:** [https://metro.co.uk/2024/12/10/netflix-viewers-slam-offensive-new-movie-mary-bible-inaccuracies-22158570/](https://metro.co.uk/2024/12/10/netflix-viewers-slam-offensive-new-movie-mary-bible-inaccuracies-22158570/)",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hb4u98/netflix_viewers_slam_offensive_new_movie_about/"
    },
    {
        "id": "1har79b",
        "author": "ms_1102",
        "title": "Annoying sounds…",
        "content": "I’ve been watching the madness and now black doves, in both the background car engines and revving has definitely felt amplified and like there’s more of it. I am very sensitive to noises but I notice them so much more and it kind of doesn’t fit. The madness has this mostly, black doves is just music a lot of the time, but yeah. Is it just me? Please somebody tell me I’m not going crazy🤣",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1har79b/annoying_sounds/"
    },
    {
        "id": "1haqq7c",
        "author": "Effective_Machina",
        "title": "Trick to get Netflix to save progress?",
        "content": "I don't watch a ton of Netflix, I am primarily watching on a Roku but I think it does it elsewhere as well.\n\nif I have to walk away is there a trick to get it to actually save my progress? It's never where I leave it, it's always way back. \n\nIt seems like Netflix reports your position at very low interval and for some reason doesn't send it when you hit pause.\n\nEdit: For example I just took a pic turned tv off was at episode 9 - 24:36 minutes. \n\nTurned the tv back on it showed I was on episode 8 a quarter in but I clicked it and it started episode 8 from the very beginning\n\nDeleted and reinstalled the app Roku is updated, restarted Roku. Nothing changed.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1haqq7c/trick_to_get_netflix_to_save_progress/"
    },
    {
        "id": "1h9e4ln",
        "author": "IAmPookieHearMeRoar",
        "title": "Netflix Sued Over Jake Paul-Mike Tyson Boxing Match Glitches",
        "content": "",
        "upvotes": 2077,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1h9e4ln/netflix_sued_over_jake_paulmike_tyson_boxing/"
    },
    {
        "id": "1habw46",
        "author": "Sweaty_Recipe6199",
        "title": "Different audio between kids and 'normal' account?",
        "content": "I have an autistic child and some cartoons he will only watch on my netflix account and not on the kids account as he says the voices are different.\n\nAnyone else had or noticed this or know the reason for this if it is a thing?\n\nThe main two he won't watch on kids because of this are:\n\nNot quite narwhal \nWonderoos",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1habw46/different_audio_between_kids_and_normal_account/"
    },
    {
        "id": "1haphkm",
        "author": "user809080",
        "title": "1080p or 4K",
        "content": "I have a Oled 16-inch computer with 2k resolution. I was considering a basic Netflix account since the one with 4k costs much more. Is the 4k one worth it? Is the difference that noticeable?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1haphkm/1080p_or_4k/"
    },
    {
        "id": "1ha1ay6",
        "author": "Extreme_Homework7936",
        "title": "Tony Hale: “Woman of the Hour isn't an easy watch, but it’s an important one.”",
        "content": "",
        "upvotes": 20,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1ay6/tony_hale_woman_of_the_hour_isnt_an_easy_watch/"
    },
    {
        "id": "1hajade",
        "author": "minemeister",
        "title": "Audio issues on spatial audio",
        "content": "So I tried watching breaking bad on the Netflix app on windows. But the audio just did was just static thumping. I then went to watch it on my browser and it worked perfectly fine. \n\nThe issue only seemed to come up with programs with spatial audio. I am using a DAC with optical input and this issue has not come up before. My other ports seem to also just be working fine. So I'm not sure if the issue was just with the app itself or something else",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hajade/audio_issues_on_spatial_audio/"
    },
    {
        "id": "1hat7tz",
        "author": "2short4thepit",
        "title": "Hot Frosty's surprising subtext",
        "content": "I watched Hot Frosty last night because my friend and I wanted to have a cozy night in with a silly movie, but holy shit, guys. Was not expecting an allegory for the drug epidemic — once you realize it, you can’t miss it. For example, his body’s reaction to being away from snow is textbook withdrawal. Would love to know if others noticed this!\n\nAnd here’s the kicker: The title “Hot Frosty” is obviously an oxymoron. And the movie is about… an \"oxy moron.\" Nuts.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hat7tz/hot_frostys_surprising_subtext/"
    },
    {
        "id": "1h9mzr7",
        "author": "mrmrln42",
        "title": "Terrible bitrate on Netflix ",
        "content": "Netflix 4k, 3 body problem in 4k, dolby vision+atmos. 2Mbps. NOT MBps...\n\nNetflix 4k, kung fu panda in 4k, dolby vision+atmos, 5Mbps\n\nApple tv plus, for all mankind in 4k, dolby vision+atmos, 30mbps \n\nThere was nothing else going on on the network. I paused several times to confirm and the download speed went away (it's only my phone and pc on the network and neither was doing anything). It says outbound because of the interface I selected, but it's download. I started the show (burst of download for the buffer) and then let it stabilize for 2 minutes. \n\nHow can netflix get away with a 6-15 TIMES WORSE bitrate than apple tv? I knew their bitrate is shitty, but this is crazy bad. Apple tv shows look great, on Netflix I can see color banding and lack of detail from 3m away... Such a shitty service - and that's their highest tier too. It sucks so much that such cool looking content is completely destroyed by a shitty low bitrate streaming service. ",
        "upvotes": 113,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1h9mzr7/terrible_bitrate_on_netflix/"
    },
    {
        "id": "1ha9ps0",
        "author": "shanetsh",
        "title": "Ultimatum S3 = The Idol",
        "content": "Is it just me, or does Scotty and Zaina's trial marriage feel oddly like the whole Tedros and Jocelyn relationship in the Idol.\n\nThe lovebombing, the anger issues, the gaslighting. Scotty even looks and act oddly like the Weekend's character. XD",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ha9ps0/ultimatum_s3_the_idol/"
    },
    {
        "id": "1hahb1c",
        "author": "LegWoman",
        "title": "How do I pitch an input for a documentary?",
        "content": "I have a case that I want to bring to light that happened in march. There is so much to the story and I have a LOT of screenshots and videos of events that are connected to the case. \n\nI don't want to be very egotistical and say \"oh my case is like no other\" but it really is like no other. I really feel like my case is very interesting and a lot of people would be on the edge of their seats learning about it. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hahb1c/how_do_i_pitch_an_input_for_a_documentary/"
    },
    {
        "id": "1h9vk8d",
        "author": "allyourtv",
        "title": "A pretty good rundown of the best global TV of the year",
        "content": "Not just Netflix shows, although they obviously are the majority of the releases\n\n[https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees](https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees)",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9vk8d/a_pretty_good_rundown_of_the_best_global_tv_of/"
    },
    {
        "id": "1h9nu6v",
        "author": "Ok-Fee-5067",
        "title": "Love never lies South Africa (on Netflix) is sooo good ! ",
        "content": "Have you seen it ?! \nThe episodes, the couples, the reunion everything was  great, genuine but also crazy ! \nThe reunion OMG the Lacheys from LIB.. please take note ! The truth was told ! It was crazy ! \nNo spoiler here so go watch it and we can discuss after 🫣",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h9nu6v/love_never_lies_south_africa_on_netflix_is_sooo/"
    },
    {
        "id": "1h9xjz5",
        "author": "Mundane-Midnight-672",
        "title": "Monsters- Menendez Bros cast question",
        "content": "The scene at the beginning where Leslie is talking to the adoption agent- who plays that guy? I could’ve sworn it was the guy who played Buzz on Home Alone. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9xjz5/monsters_menendez_bros_cast_question/"
    },
    {
        "id": "1h9py36",
        "author": "sorakawa_94",
        "title": "Recs for light-hearted, cheerful show that has nice, bright cinematics?",
        "content": "Looking for a show to put in the background that I don't have to pay much attention to. \n\nI like the classic sitcoms like The Office, HIMYM, etc but find that the look of a lot of these shows is muted and dreary. Just IRL visuals I guess, but I want something brighter and more saturated. \n\nI took a quick peek at Emily in Paris and it seems to have the look I'm going for, but haven't actually tried the show yet. \n\nAny recommendations would be greatly appreciated. Thank you!!",
        "upvotes": 7,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1h9py36/recs_for_lighthearted_cheerful_show_that_has_nice/"
    },
    {
        "id": "1ha1fyc",
        "author": "goexuma",
        "title": "Crazy surges in volume",
        "content": "We have had Netflix for at least 5 years and this. Is only happening in the last few months.\nIrregardless of the show we are watching, the volume goes up like crazy on each act that has drama.\nI keep the keyboard on my lap just to control the increase s quicker than the mouse \nIs there any option to keep this from happening.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1fyc/crazy_surges_in_volume/"
    },
    {
        "id": "1h9fol2",
        "author": "PixelVapor",
        "title": "EXCLUSIVE: Richard Gadd may be personally sued as Fiona Harvey Netflix libel case looms",
        "content": "",
        "upvotes": 28,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fol2/exclusive_richard_gadd_may_be_personally_sued_as/"
    }
]