[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 708,
        "comments": 5201,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o0e7iq",
        "author": "ElectroElk31",
        "title": "Catch Me If You Can, would a Frank Abagnale style con work today or would tech stop it?",
        "content": "Just finished rewatching Catch Me If You Can and I keep getting stuck on how much of Abagnale’s success relied on people trusting a confident story and paper records. He forges checks, pretends to be pilots and doctors, and basically wins on smooth talk, timing, and exploiting gaps in how institutions verified things back then. Looking at 2025, there are two clear directions. Modern banks, airlines, and employers have more automation, KYC checks, instant database lookups, and cross-referenced ID services that can flag fakes in seconds. A fake resume or a paper letter seems much harder to use to fool those systems. Digital trails and audit logs make it easier to trace and stop suspicious activity.  \n  \nBut there’s also a huge amount of real personal data out there from breaches and data brokers, and that can be stitched together to build very believable identities. Deepfakes and AI can clone voices or make convincing video snippets. Human trust is still a major vulnerability: social engineering works because people rush, want to help, or assume an authority figure is legitimate. A modern operator could combine old-school charm with new tech  build an online persona first, then use carefully timed phone or in-person moves to close the deal. Some targets would be harder today and others are still shockingly soft. Big finance, enterprise HR, and major airlines are much tighter. Small hospitals, local businesses, and customer-support teams at smaller services often rely on phone calls and quick checks, which feels like low-hanging fruit. Logistics and delivery systems can also be manipulated if you know the right touchpoints.  \n  \nMy mental image of a 2025 Abagnale is someone who layers things: scraped data to bootstrap a backstory, polished social media and LinkedIn history, AI-generated voice clips for cold calls, and then a confident in-person moment where people fill in the blanks. Or it could be less theatrical and more distributed: exploit gaps in onboarding flows, trick CS systems, and collect many small wins across dozens of targets instead of one big caper.  \nWould a charismatic impersonator still pull it off today, or has tech made that kind of con obsolete? If someone tried something like this now, where would you expect them to succeed first and where would modern verification stop them quickly? Any examples of modern scams that felt like a Catch Me If You Can remake but for the internet age?",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o0e7iq/catch_me_if_you_can_would_a_frank_abagnale_style/"
    },
    {
        "id": "1nzotzy",
        "author": "camwtss",
        "title": "does ANYONE like the ed gein series?",
        "content": "im bummed because i was really looking forward to watching this, but i have seen nothing but negative comments about it. did anyone enjoy it? or is it a waste of 8 hours.",
        "upvotes": 193,
        "comments": 471,
        "media": null,
        "permalink": "/r/netflix/comments/1nzotzy/does_anyone_like_the_ed_gein_series/"
    },
    {
        "id": "1o0bnmo",
        "author": "ADMlN-",
        "title": "Ed Gein series felt insulting and narcissistic",
        "content": "From a purely horror, acting and even artistic standpoint, this was well done, but it was just wayyyy too try-hard. \n\nIt feels as if Ryan Murphy is insulting us as viewers. He thinks we are too dumb to understand what he's trying to deliver, so he repeats his messages in as many drawn out disturbing ways as possible.  \n\nAnyone else feel this way?  ",
        "upvotes": 6,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o0bnmo/ed_gein_series_felt_insulting_and_narcissistic/"
    },
    {
        "id": "1nzv2dk",
        "author": "Adventurous_Ant5428",
        "title": "Why didn’t Alice in Borderland ever gain popularity like Squid Game?",
        "content": "Kind of similar premise involving survival games, so why didn’t Alice in Borderland seem to gain as much traction? It has a more complex storyline and the games are arguably more interesting. ",
        "upvotes": 65,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1nzv2dk/why_didnt_alice_in_borderland_ever_gain/"
    },
    {
        "id": "1o01zsp",
        "author": "Aggressive_Cost_4667",
        "title": "Monster trilogy",
        "content": "When Dahmer first came out I remember thinking wow this is probably one of the best limited series I’ve watched (coming from someone who never knew who he was) and was not shocked when it won so many awards. Then by the end of the series with them teasing John Wayne gacy I was thrilled to see that this trilogy wasn’t over and that another serial killer who this time I knew would be the next story they focus on. When the news was confirmed that the next season would be about the Menendez brothers who this time I knew a lot about I was kind of disappointed not because of them personally but because I think the Segway from Dahmer to JWG especially since they were active during the same time would have made an awesome season 2.  Why didn’t Netflix decide to go ahead with JWG is beyond me. Now with season 3 being Ed gein, who mind you barely has any video or audio recording to base the series off with most of it being inaccurate and dramatised, has Netflix missed the potential to make a record breaking trilogy series beyond Dahmer? Especially considering already the ratings for Ed gein aren’t merely as high as the Menendez brothers yet alone Dahmer. \n\nNow again, with the teasers for season 4 being Lizzie Borden? I mean seriously, Ed Geins evidence to base season 3 off was dry to nothing and now they want to focus on someone way before Ed geins time? I don’t think the ratings will be going up anytime soon if they don’t plan to start focusing on newer stories with some evidential backup. \n\n(Also when I say seasons I knew they’re separate shows it’s just to help the timeline ) \n",
        "upvotes": 15,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o01zsp/monster_trilogy/"
    },
    {
        "id": "1o03p0o",
        "author": "DestroWOD",
        "title": "Im so tired of this current layout !",
        "content": "Since a few months its so hard to browse Netflix 😥. I used to be able to see my list easily and it was pretty quick browsing it all now i feel like i have to scroll forever 😡\n\nAny way to revert to old look? Like dark/light modes on twitter or something... ",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o03p0o/im_so_tired_of_this_current_layout/"
    },
    {
        "id": "1o0jmdq",
        "author": "alessiac44",
        "title": "The witcher stagione 4",
        "content": "Premetto che non ho mai giocato al videogioco né conoscevo The Witcher prima della serie Netflix. È stata proprio la serie a farmi appassionare tantissimo alla storia — amo le ambientazioni fantasy e, fin da subito, mi sono innamorata del cast.\nHo visto i nuovi trailer con Liam Hemsworth al posto di Henry Cavill nei panni di Geralt, e… per me è davvero inguardabile. Nulla contro Liam, ma Henry era semplicemente perfetto per il ruolo: presenza, fisicità… tutto.\n\nCapisco che Cavill se ne sia andato di sua spontanea volontà per vari motivi, ma personalmente avrei preferito che avessero preso tempo, anche due anni se necessario, pur di non cambiare attore.\n\nComunque ormai è andata così 😅 Ma sono curiosa: voi chi avreste visto bene nei panni di Geralt, al posto di Cavill? Perché sinceramente, Liam ha troppo la faccina pulita da bravo ragazzo per reggere il personaggio secondo me!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0jmdq/the_witcher_stagione_4/"
    },
    {
        "id": "1o0ipr1",
        "author": "Kaskelontti",
        "title": "Heavenly Ever. After",
        "content": "After a slow start, Heanvely Ever After is quickly becoming one of my favorite series. It's an exhilarating, funny, and touching fantasy series. I'm only on the fourth episode, but this series is picking up speed like a bullet train.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o0ipr1/heavenly_ever_after/"
    },
    {
        "id": "1o07jui",
        "author": "obscure_monster",
        "title": "Any recommendations for Anime?",
        "content": "Anyone have recommendations for anime on Netflix? I really need something NEW to watch. New to me at least. I’ve watched a looot on Netflix and I’m now going through the anime on Netflix. ",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1o07jui/any_recommendations_for_anime/"
    },
    {
        "id": "1o0hsgw",
        "author": "JournalistMore2356",
        "title": "Monster: Ed Gein Story, is it hard to watch",
        "content": "When I watched Dahmer, I enjoyed it, but wasn’t prepared for how dark and disturbing it was. So this time around, I want to have a certain mindset to watch Monster,  the Ed Gein Story. If that makes sense.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o0hsgw/monster_ed_gein_story_is_it_hard_to_watch/"
    },
    {
        "id": "1o0ggxs",
        "author": "TheSaltyJ",
        "title": "Adolescence",
        "content": "&gt;!Epic series for sure. But was I the only one who still thought he might be innocent until almost the end? The video that we saw the father and the son watching looked a bit like he could also just throw her to the ground and hit her with the fists. But apparently that was the whole evidence and for the family there is no doubt that he had done it (whether they want to accept it or not). !&lt;\n\n\n\n&gt;!In other words, there was no new evidence coming in after episode 1. Should the viewer have picked up on it? The showrunners describe the show not as \"who dunnit\" but \"why did he do it\", but to me it wasn't clear that he done it. !&lt;",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o0ggxs/adolescence/"
    },
    {
        "id": "1o042rk",
        "author": "Imaginary-Ad5624",
        "title": "A title I was watching earlier in the day is suddenly no longer available.",
        "content": "A title I was watching earlier in the day is suddenly no longer available. It was scheduled to leave Netflix at the end of the month. It's not the end of the month. What happened?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o042rk/a_title_i_was_watching_earlier_in_the_day_is/"
    },
    {
        "id": "1o0cnog",
        "author": "Albertvierstein",
        "title": "Help me decide what to watch",
        "content": "I rarely watch/watched stuff on Netflix when it comes to shows. Apparently my gf loves her shows so much that I start to hear „omg this and this show is soooo good you gonna love it, just trust me“ etc. \n\nSo I thought I‘ll give them a try again. \n\nI once watched The Walking dead back then, it was good but not that good that it motivated me to watch any more shows. \n\nThese are the shows I got recommended, let me know what you guys think I should start with:\n\n- mindhunter\n- dark \n- midnight mass\n- beef\n- the 100\n- black summer \n- Eternauta\n\nIf in your opinion there are better shows than what I got recommended let me know. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o0cnog/help_me_decide_what_to_watch/"
    },
    {
        "id": "1o0i060",
        "author": "Atlast_89P13",
        "title": "The Witcher: Season 4 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o0i060/the_witcher_season_4_official_trailer_netflix/"
    },
    {
        "id": "1o034ck",
        "author": "MattNola",
        "title": "Next Monsters",
        "content": "Would Netflix touch John Wayne Gacy as the next Monster? I know it’s even more gruesome and harrowing than the previous 3 (which says a lot) but with it being mostly Children I’d think they’d stay away from that? The whole clown thing seems right up their alley though.\n\nEdit: for those interested, Soft White Underbelly did an interview with a man who had a run in with Gacy when he was 16. I was terrified listening/watching it. Definitely worth a listen.",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1o034ck/next_monsters/"
    },
    {
        "id": "1o0bv0z",
        "author": "priMa-RAW",
        "title": "Monster: Ed Gein Story - from a different angle, im left a bit confused",
        "content": "So i posted before how this was really unsettling and disturbing, which it really is! Some parts left me feeling like i wanted to be physically sick… no programme ive ever watched before has ever had that affect on me, ive had to take a break from it because i was so disturbed. But during this break, something just hit me and has left me confused: \n\nWith the Dahmer series, it explored his childhood a bit, and tried to atleast give some form of explanation, rightly or wrongly, as to how it started with him… the road kill with his Dad, leading up to exploring in the army etc. With the Ed Gein story there is non of that, so im left thinking how does he go from being slightly awkward and a unusual guy, to wearing head masks out of someones real flesh, making things out of their skin… you know? What was the trigger? How did it start? Was it just that German magazine he was shown? It doesnt feel like enough, was there something in his childhood and growing up? \n\nOf course i dont think the story was designed to tackle this issue in the way its been produced, but i wish they had… knowing “why” is a big part of it… but i dont know, what does everyone else think? Interested to hear other peoples thoughts and perspectives",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o0bv0z/monster_ed_gein_story_from_a_different_angle_im/"
    },
    {
        "id": "1o0b8j9",
        "author": "ImEmilyCampbell",
        "title": "Who else found the games in AIW Season 3 a bit too complicated to follow?",
        "content": "Firstly, after you finish S2, it becomes a little unrealistic (I wont give out any spoilers here) and then on top of that the games are so complicated that you lose interest. I think the thrill in this genre is to help the players (the leads) find a way out in your head and if you dont understand the game or why they're doing what they are doing, you are not engaged. The only one I liked was the one on the train. What do you think?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o0b8j9/who_else_found_the_games_in_aiw_season_3_a_bit/"
    },
    {
        "id": "1o0b6in",
        "author": "BrainImpressive9529",
        "title": "Billionaires’ Bunker!!",
        "content": "I just finished watching billionaires’ bunker and WOW! It’s so good I ended up binge watching.. \n\nIf y’all liked money heist you’ll like billionaires’ bunker too..\n\nAt first I thought it would be boring and based on just a fancy bunker but it is so good with so much suspense and so many twists.. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o0b6in/billionaires_bunker/"
    },
    {
        "id": "1o0jlet",
        "author": "Former_Blueberry9645",
        "title": "Ed Gein",
        "content": "Am I the only one who felt bad for Ed Gein at the end of this series?! The dude murdered two (possibly more) people and dug up their bodies to wear them and I’m sitting here teary eyed at the end when he got to be reunited with his mother. 🤦🏼‍♀️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o0jlet/ed_gein/"
    },
    {
        "id": "1o072kb",
        "author": "daily_apprehensive",
        "title": "Monster Season Suggestions?",
        "content": "If you could pick the subject of the next Monster season, who would it be? And what makes it unique or fascinating enough for the eight episodes?\n\nI’d love to see one on Jerry Sandusky, examine the Monster facet from that angle. Plus there are so many stories/perspectives that could be told alongside it for commentary: Aaron Fisher and his mom (self-identified victim and mother), the red-haired assistant whistleblower, Paterno, Dottie Sandusky.\n\nI have to admit I haven’t enjoyed the most recent seasons of Monster but Dahmer remains some of the best television I’ve ever seen. And all three have been great with their social commentary. I just wish Ryan Murphy was more interested in facts and less interested in shocking sex scenes. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o072kb/monster_season_suggestions/"
    },
    {
        "id": "1o065sk",
        "author": "Low-Concert5170",
        "title": "Live action Cardcaptor Sakura Please?",
        "content": "So Sabrina and Wednesday were simply iconic. Would love to see a live version of Sakura the Cardcaptor please. \n\nI was such a huge fan of the original anime series and would love to see a live adaptation someday.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o065sk/live_action_cardcaptor_sakura_please/"
    },
    {
        "id": "1nyv5v2",
        "author": "DMFD_x_Gamer",
        "title": "Just found a relic in a packed away box.",
        "content": "Still has a CD in it. Not sure what the movie is though. The envelope is sealed. I dont even have a DVD player anymore so im in no real hurry to see what's inside. Still a cool find. ",
        "upvotes": 1357,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1nyv5v2/just_found_a_relic_in_a_packed_away_box/"
    },
    {
        "id": "1o030e0",
        "author": "Apprehensive-Site-25",
        "title": "Portrayal of Adeline Watkins in Monssters: Ed Gein show",
        "content": "Is anyone else appalled at the portrayal of Adeline Watkins in this new series?? Show spoiler: she’s straight up suggests to Ed that he dig up a body to be his girlfriend and then proceeds to help him grave rob. There’s no evidence anywhere that Adeline was suggesting things like this or involved in his crimes. If I was the family of Adeline I would be so incredibly upset at this portrayal. Just ranting/wondering what you all think!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o030e0/portrayal_of_adeline_watkins_in_monssters_ed_gein/"
    },
    {
        "id": "1o08xna",
        "author": "ConsciouslyKind93",
        "title": "Lazarus Project - the most promising sci-fi premise ruined by stupid plot",
        "content": "Just watched the series because I was craving for a good sci-fi story.\n\nBut with each episode, I see almost every character make the most stupid decisions and choices ever, and the series gets dumbed down to the level of any other relationship drama. \n\nPerfect example of having a great sci-fi premise with great potential, ruined by the writers' small minds and limited imagination.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o08xna/lazarus_project_the_most_promising_scifi_premise/"
    },
    {
        "id": "1o0idu1",
        "author": "Alone-Macaroon-2415",
        "title": "House of Guinness unpopular opinion",
        "content": "As someone with Irish ancestry I came into this with a lot of hope to learn about apart of me I haven’t got the chance to explore.. but House of Guinness quite literally just looks like Bridgerton in Ireland. It’s full of stereotypes. \n\nTo kick it off, I loved Arthur’s story line but it could have been expanded on a little bit more in a sexual sense. Like during that dual scene Benjamin and his love interest were full on doing THE DEED and then you see Arthur getting a blowie… \n\nit just isn’t realistic, there was plenty of room to add more. Otherwise it just feels like *you’re adding too many useless concepts you don’t expand on. Especially when you only have 8 episodes.*\n\nFurthermore I feel as though Annie’s character DEVELOPMENT could have been expanded on as well. Maybe flashbacks from her childhood or even simply more insight on her mental disorders not just “the doctors having a look” *never speaks about it again*\n\nAnd Samuel could have easily been turned into an anti-hero or even one of the main antagonists because he was left on the side to deal with his debt and drinking issues with zero of his families fortune. \n\nPS: *These are all the negatives I really did enjoy the show but the take away is sometimes less is more and more is less. This is the issue with 8 episode seasons.*",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o0idu1/house_of_guinness_unpopular_opinion/"
    },
    {
        "id": "1nzp5lx",
        "author": "GoldDerby",
        "title": "‘Monster: The Ed Gein Story’ star Charlie Hunnam reflects on ‘Sons of Anarchy’ awards snubs: ‘Nice to receive them, bad form to covet them’",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nzp5lx/monster_the_ed_gein_story_star_charlie_hunnam/"
    },
    {
        "id": "1o085v8",
        "author": "Strong-Ingenuity-680",
        "title": "ed gein conversation regarding media is good. but fails to recognise its own place in that",
        "content": "idk man. everyone online seems to be hating this movie but i actually think it’s both really good and really bad at the same time. like, i get why people are grossed out or mad about it - i was literally gagging at parts, it’s one of the most disgusting movies i’ve ever sat through - but i also think that’s kind of the point.\n\nit’s weirdly nuanced in the way it shows how media shapes us. like the comics and nazi photos sending him over the edge, adeline’s obsession with horror photography, the way psycho literally captivated the masses and started a whole new wave of fascination. it’s showing how we’ve always wanted more. more horror, more depravity, more blood, more “realism.” and we got exactly what we asked for.\n\nand yeah i could barely stomach it. i’m literally struggling to eat after watching it because it’s so repulsive. but it’s also kind of brilliant in how it shows where all this came from. like, after ww2, we saw the actual horror humans are capable of - concentration camp photos, mass graves, the stuff that made us realize hell isn’t some mythical place, it’s what people can do. and instead of turning away, we became fascinated. and as humans do,,,, we fetished it   that’s where horror really started to mutate. from psycho to texas chainsaw massacre to scream, horror slowly turned into soft porn with a knife. and now ed gein being portrayed as next captain america with his six pack and buff arms….. fucking a corpse…. \n\nand the thing is, horror has always mirrored culture. vietnam war, sexual liberation, the rise of porn —- all of that bled into and made the “sex horror” genre. and this movie captures that. but what bugs me is that it doesn’t seem to realise it’s also part of that same cycle. that ed gein saw this horrors in the media - and copied it. it’s talking about how media inspires horror, but it’s also gonna inspire some creepy fuck to copy it. like this narrative that is portrayed as “the truth” will inevitably inspire minimum one person to make a nipple chair. the same way school shooters copy each other. that’s just reality.\n\nso yeah, i think the movie gets it but also doesn’t. it’s an amazing critique of how media feeds on violence and trauma, and how violence feeds on the media in one big bisous cycle of sick fucks. but it’s also feeding the same beast. \n\nthe brutality and gruesomeness is definitely reflection of where we are now - gaza, ukraine, congo etc.  horror is everywhere. right at our fingertips tips. every day i see another hospital getting bombed in a gaza on my literal tik tok fyp and i just go about my day. it’s everywhere. and we are so desensitised. and because of that, there’ll always be another movie, another killer, another atrocity.\n\nit’s messed up. i hated watching it. but i also think it says something really real about us.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o085v8/ed_gein_conversation_regarding_media_is_good_but/"
    },
    {
        "id": "1nz263e",
        "author": "no_tengas_miedo",
        "title": "Ed Gein is pretty bad",
        "content": "At first I thought it was going to be good. Especially the first 2 chapters, I liked them a lot, but throughout the series my desire to watch it disappears. It all consists of telling stories about psychosis actors, the Texas massacre, film producers who were inspired by him, and above all, romances they have had and experiences that are not real or are still theories.\nI thought I was going to see how Ed Gein acted, the things he did, what he did with corpses, everything. But instead I find that shit. \nI had a lot of hype for this season, I thought it would be good and above all that it would be the creepiest of all. But it feels pretty bad. It's morbid of me to want to see more of what the crimes were like and how he really acted, but damn, that's better than wanting to see stories that never happened about his life.",
        "upvotes": 426,
        "comments": 343,
        "media": null,
        "permalink": "/r/netflix/comments/1nz263e/ed_gein_is_pretty_bad/"
    }
]