[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1otuwg4",
        "author": "JamieLTR",
        "title": "Documentary",
        "content": "Looking for a good documentary to watch! Just got done with unknown number the high school catfish. I’ve watched several other documentaries on Netflix (Murdaugh murders, Gabby’s petito, take care of maya, etc). Any recommendations?\n",
        "upvotes": 138,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/1otuwg4/documentary/"
    },
    {
        "id": "1oth71o",
        "author": "Candiez89",
        "title": "“Beef” on Netflix",
        "content": "Wow. Just wow. I’d never even heard of the tv series “Beef” on Netflix and randomly stumbled upon it when I was browsing Netflix last night looking for something to watch. I ended up binge watching the whole thing in one go, and I have to say it was hands down one of the best tv series I’ve watched in a very long time. It had me laughing, crying, and just feeling all the feels.\n\nSerious credit to the actors, producers, and screenwriters for real. A special shoutout to the actor Steven Yeun in particular, who played the main character, Danny 👏👏🙌... Amazing.\n",
        "upvotes": 632,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1oth71o/beef_on_netflix/"
    },
    {
        "id": "1oudqiy",
        "author": "IndicaOatmeal",
        "title": "New bee species named after Netflix’s Lucifer",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oudqiy/new_bee_species_named_after_netflixs_lucifer/"
    },
    {
        "id": "1otvvzj",
        "author": "57829",
        "title": "‘Wednesday’ Star Catherine Zeta-Jones Wants Danny DeVito to Play Cousin It: ‘He’s Gonna Kill Me for That’",
        "content": "",
        "upvotes": 58,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1otvvzj/wednesday_star_catherine_zetajones_wants_danny/"
    },
    {
        "id": "1oud3xr",
        "author": "croixla1",
        "title": "Squid Game star found not guilty of sexual assault",
        "content": "Netflix Star Oh Young Su, who played the role of Oh Il Nam was initially accused of a sexual assault. However, in appeal's court, he was found not guilty.\n\n[https://www.youtube.com/watch?v=JyeU\\_Qj2jbw&amp;t=1s](https://www.youtube.com/watch?v=JyeU_Qj2jbw&amp;t=1s)  \n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oud3xr/squid_game_star_found_not_guilty_of_sexual_assault/"
    },
    {
        "id": "1otxqx3",
        "author": "[deleted]",
        "title": "What’s one song that became so iconic because of the movie it was used in, that you can’t hear it without instantly thinking of that film?",
        "content": "Love Me again by John Newman.\nThe song was used in the film \"Edge of Tomorrow\" and with its increased popularity found its way into the FIFA 15 game's soundtrack which boosted its success even more. However, those who've watched Edge Of Tomorrow, now can't remember the movie without remembering the song first!",
        "upvotes": 20,
        "comments": 192,
        "media": null,
        "permalink": "/r/netflix/comments/1otxqx3/whats_one_song_that_became_so_iconic_because_of/"
    },
    {
        "id": "1oua7s8",
        "author": "AffectionateAge1448",
        "title": "Love is blind",
        "content": "I think people  forget reality tv is NOT real. It's set up to cause drama. If you dont know how reality tv works you should look into it. I think it's interesting reading these threads, but at the same time I have to remember myself how staged all of it is. So i will explain a little, basically the producers set up scenes for them. The producers will say stuff like \" why dont you go confront so and so\" or \"why dont you leave so and so and go talk to blank\" \n\nFor example joes comment about Madison's body. \nIn this case im 99% sure the producers said something along the lines of \"joe what is your typical body type\" and he explained it. They just chop it up to make it look worse for shock value. &amp; based on how the shows are edited Joe could have even said that at a completely different time, such as auditions.  The producers  could have said \"what type do you usually  go for\"  and then they edidted the clips to make it seem like he was talking down on Madison. \n\nAlso edmond.. poor edmond. Remember theres hundreds of hours of him and they clipped out the parts where he was acting how he was shown, to make him look that way. Even the bed scene could have been edidted and clipped to shit to make him look pushy. I guarantee it was a different conversation about how he is always the nice guy and gets walked over, and then producers edidted it to be about sex, or they chopped clips together, or they told them to say those things, or turn it into a convo about sex. \n\nPeople need to remember that theres likley hundreds of hours of filming,  chopped down to 8 hours. Those 8 hours are highly edited to create a storyline. They move clips around to create a story line, one scene could be from 3 different nights. I remember watching a documentary and they said the producers sometimes add words in, so if you ever look at someone and dont see their mouth lining up with the words, this is why. \n\n-Franken-bites\": This is a technique where editors take parts of sentences from different times and stitch them together to create a new, often out-of-context, quote that wasn't said in that exact way.\"\n\n-Narrative Construction: Producers and editors work to build a story, and they select footage that fits the pre-planned narrative, even if it occurred at a different time. The goal is to tell the \"best story,\" not necessarily present events in a strictly chronological or unvarnished way.\n\n-Reaction Shots: Editors often use \"cutaways\" or reaction shots filmed at separate times and locations to show a contestant's reaction to an event, even if that reaction was originally for something else entirely.\n\n-Confessionals/Interviews: The \"talking head\" interviews are typically filmed after the events have occurred and can be shot over multiple days. Producers often guide participants with specific questions to get sound bites that help explain or set up a storyline, which are then edited into the main action.\n\n- Continuity: To maintain the illusion of a single, continuous scene, participants are often asked to wear the same outfits and jewelry for interviews or pick-up shots filmed on different days.\n\n\n-Time Compression: Long periods of filming (e.g., a week or even 21 days for shows like Naked and Afraid) are compressed into a 30-42 minute episode, requiring significant manipulation of time and sequence to create a flowing episode. \n\nNow apply this to every single person on LIB. \n\nReality tv is not real. Which is why its crazy to me that strangers online are so comfortable with bullying the contestants. \n",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oua7s8/love_is_blind/"
    },
    {
        "id": "1oubtd7",
        "author": "umnomecreativo",
        "title": "Have any of them worked?",
        "content": "Has any petition been successful yet? I believe we made petitions to return: Anne with an \"e\", Insatiable, The society, The hollow, One of Us Is Lying, I Am Not Okay With This... And as far as I know none of them worked unfortunately, I wanted to know if this effort has ever yielded results?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oubtd7/have_any_of_them_worked/"
    },
    {
        "id": "1ou9yis",
        "author": "Specialist_Job_2897",
        "title": "Halo 🥲",
        "content": "Im watching Halo and I thought it would be really bad like every other halo big screen adaptation but it shocked me how good it was. Im almost finished with season 2 and im getting SO depressed that it’ll never return because I know it’s a cliff hanger at the end. What do you guys think of it? Season 3?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ou9yis/halo/"
    },
    {
        "id": "1otcxn2",
        "author": "FinalLightNL",
        "title": "Another price hike... Are you guys serious???",
        "content": "€20,99 for the new plan is ridiculous, how are you guys oblivious to why people are taking other roads to watch shows and movies?\n\nThat's it, i couldn't give less of a ...   i'm canceling my sub.",
        "upvotes": 91,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1otcxn2/another_price_hike_are_you_guys_serious/"
    },
    {
        "id": "1ou8blm",
        "author": "Da-Vin-chi",
        "title": "Does anyone know how to get this thing off my screen in the top left corner?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ou8blm/does_anyone_know_how_to_get_this_thing_off_my/"
    },
    {
        "id": "1ou13yo",
        "author": "bbsquirell",
        "title": "Finishing Nurse Jackie soon and I need a plan for what to watch when I finish it",
        "content": "Im very into the drug addict aspect of this show. I’d like to lean into that as I search for a new show. I also like the drama! I’m probably going to stay away from more medical shows because the whole time I’ll just be thinking “nurse Jackie is better” looking for suggestions for shows that are really good and dramatic but not soapy. Preferably with multiple seasons! I’m patiently waiting for stranger things season 5, but I’m going to finish this series before that is released. \n",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ou13yo/finishing_nurse_jackie_soon_and_i_need_a_plan_for/"
    },
    {
        "id": "1ou1k1z",
        "author": "Shah2002",
        "title": "Cinematography of FRANKENSTEIN (2025)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ou1k1z/cinematography_of_frankenstein_2025/"
    },
    {
        "id": "1ou0gvj",
        "author": "TheGavinator1",
        "title": "Frankenstein James Jean poster",
        "content": "does anyone have a spare poster from their screening? eBay has a lot of fakes posted, and I can't trust ones that seem legit because they'll have copy and pasted descriptions. will pay",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ou0gvj/frankenstein_james_jean_poster/"
    },
    {
        "id": "1ot3vhz",
        "author": "[deleted]",
        "title": "What is that one movie which everyone loves unanimously but you hate it with all your heart?",
        "content": "For me it's Leon - The Professional.\nExcept the opening sequence and Gary Oldman's performance, nothing else felt quite compelling to me as most made it out to be. The pedophilic thread was the boiling point for me as I've never been this uncomfortable in even a disturbing movie, let alone a so-called \"action\" film. I'm familiar with the director's personal life as well as the extended cut and the disgust relating to it just goes on more by the day. Do let me know what is your opinion on this film as well as the films you hate which received critical acclaim.",
        "upvotes": 170,
        "comments": 777,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3vhz/what_is_that_one_movie_which_everyone_loves/"
    },
    {
        "id": "1otqbal",
        "author": "MasterSparrow",
        "title": "Man Vs Baby trailer",
        "content": "There's something weirdly AI generated about the baby. But good trailer overall.\n\nAnything with Mr Bean/Rowan Atkinson in it gets my watch and Man Vs Bee was amazing.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otqbal/man_vs_baby_trailer/"
    },
    {
        "id": "1otckfi",
        "author": "Frosty_Ad_5096",
        "title": "What show or movie is this from?",
        "content": "",
        "upvotes": 25,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1otckfi/what_show_or_movie_is_this_from/"
    },
    {
        "id": "1otfjwb",
        "author": "Sufficient-Curve2951",
        "title": "Jacob Elordi's monster in Frankenstein",
        "content": "Is Guillermo del Toro’s Frankenstein the most humane depiction of the monster? This article makes some good points! Getting emotional over this movie was the last thing I expected but here we are! Monster's tale was beautifully adapted. What do you think?\n\n  \n[https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored](https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored)",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1otfjwb/jacob_elordis_monster_in_frankenstein/"
    },
    {
        "id": "1otytda",
        "author": "Far_Pen3186",
        "title": "What's a movie you always in real life reference, get reminded of, see parallels to, etc?",
        "content": "Movies that stay in your frame of references, etc.   What's a movie you always reference, get reminded of, see parallels to, etc?   Movies that you bring up in conversations, like \"this reminds me of movie XYZ\", etc",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otytda/whats_a_movie_you_always_in_real_life_reference/"
    },
    {
        "id": "1otjw9a",
        "author": "littleMissTired123",
        "title": "Just watched \"Behind Her Eyes\" need suggestions for similar stuff",
        "content": "Wow... what a show. I first saw a vid on tiktok and people were talking abt the plot twist and how crazy it was.  So, I watch it and the whole time im thinking \"oh I know what the twist will be\" but BOY WAS I WRONG.\n\nWhat did u think abt it? And do u guys have any similar shows with a crazy twist? I don't want a show that's 1+ seasons. Thanks ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1otjw9a/just_watched_behind_her_eyes_need_suggestions_for/"
    },
    {
        "id": "1otw0s2",
        "author": "justbeingmebc2069",
        "title": "Wwe",
        "content": "Anyone else have an issue with watching WWE. Unless it is on my phone it is so grainy. We have watched different tv's and trust using a roku. We have the best wifi out there. And yet quite a bit it gets SO grainy. What are we doing wrong or as anyone else experienced this. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otw0s2/wwe/"
    },
    {
        "id": "1otu6rl",
        "author": "greennurse0128",
        "title": "Help finding shows dubbed in english.",
        "content": "Deadwind.\n\nDeath Inc.\n\nTwo shows, I wish were dubbbed in english! A lot of the times I am doing something else and cant always stare at the screen.\n\n\nI watch a lot of the these these shows. The Killing, Pagan Peak, BorderTown, The Breakthrough (so good) etc. I search netflix for european drama shows, german shows, swedish shows.  And the results are lackluster. \n\n\nIs there a way to find these english dubbed shows?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1otu6rl/help_finding_shows_dubbed_in_english/"
    },
    {
        "id": "1otnwiu",
        "author": "BespokeMe",
        "title": "Is there a way to tell if my extra member is actually using his account?",
        "content": "I added my brother as an extra member but I don't know if he has ever used his membership. He isn't replying to my texts (a bit of a hermit). Is there anyway for me to determine if he is making use of the membership? Thanks in advance to anyone that has an answer. The Netflix website is worthless.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1otnwiu/is_there_a_way_to_tell_if_my_extra_member_is/"
    },
    {
        "id": "1oteq9z",
        "author": "Sufficient-Curve2951",
        "title": "Heweliusz",
        "content": "Just got to know the real story through this article! A great tragedy indeed but the Systematic failure and the cover-up are honestly a shame.\n\n[https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama](https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama)",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oteq9z/heweliusz/"
    },
    {
        "id": "1otgv3x",
        "author": "jaguaraugaj",
        "title": "Gunslingers - WTF",
        "content": "I love Westerns, but after Nicolas Cage spoke, I thought I was watching Idiocracy. So terrible, why has the quality of simple movie production become such a problem?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1otgv3x/gunslingers_wtf/"
    },
    {
        "id": "1osywvk",
        "author": "GeneralIronsides2",
        "title": "Finished Death by Lightning and....",
        "content": "It is so well put together, and I was blown away by the fact that a lot of what happened in the show was pretty faithful to what actually happened, Charles Guiteau did become apart of a free loving commune, and was a failure at everything he did in life. Garfield was a Civil War hero and a abolitionist, and he didn't initially want his parties nomination, and is considered one of the last 'log cabin' Presidents, because he like Lincoln was born in a log cabin. Guiteau had hidden the gun in his pocket and the police only found it after taking him to the police station, and the first metal detector was used on Garfield. Guiteau's brain was actually studied, and its thought that his actions may have been due to syphilis, though of course in the 1880s medical tests like that were very unreliable. And Chester Arthur passed a lot of Garfield's corruption reforms. The score was great, made by the same composer that did Game of Thrones and Iron Man. I also thought they nailed Michael Shannon's look, his beard looks very similar to Garfield's pictures. Betty Gilpin's performance was so convincing.",
        "upvotes": 47,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1osywvk/finished_death_by_lightning_and/"
    },
    {
        "id": "1ot7z4m",
        "author": "purple_jelly30",
        "title": "Can someone suggest me shows similar to Derry girls ?",
        "content": "I really loved the show and also I enjoyed the accent so I’m looking for something as refreshing , funny and light as Derry girls. Please do recommend me some ! ",
        "upvotes": 9,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7z4m/can_someone_suggest_me_shows_similar_to_derry/"
    },
    {
        "id": "1otn4tj",
        "author": "Teknevra",
        "title": "Orpheus Sings to Hades | The Sandman | Netflix Philippines",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1otn4tj/orpheus_sings_to_hades_the_sandman_netflix/"
    }
]