[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1icnzzl",
        "author": "StarKCaitlin",
        "title": "Netflix's Music Streaming Platform Is Coming in 2025, According to Industry Experts",
        "content": "",
        "upvotes": 66,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1icnzzl/netflixs_music_streaming_platform_is_coming_in/"
    },
    {
        "id": "1icn5lb",
        "author": "strawberrylemontart",
        "title": "Binge watched American Primeval",
        "content": "Damn the mormons, lol..\n\nAnyway, I liked the show. I don't really watch old American western shows, but it kept me entertained. I liked that they actually used a Native American cast and language. I liked the conflict plot between the different groups a bit more than the journey portion. But Oh My God, the shots of nature were gorgeous! And of course the acting was great all around. I just liked it, lol. There were some things that were...questionable \\*cough\\*wolfattack\\*cough\\* and some others, but whatever.\n\nI def wanted to slap Sara a few times, like girl! Just listen one time!! Two moons was so cute!! Bridger was awesome! I'd like to have a drink with him. \n\nI know the mormon church is probably pissed about how they are being represented...but IYKYK\n\n",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1icn5lb/binge_watched_american_primeval/"
    },
    {
        "id": "1icofec",
        "author": "Association-Feeling",
        "title": "White chicks on Netflix has been edited! The famous p. Diddy white party has been cut out.",
        "content": "That is all. Did this happen before or after all this shiz came out. Is the media gonna get censored or is this something he did himself? \n\nI know it’s not the first movie to be altered on a streaming service but to what end? ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1icofec/white_chicks_on_netflix_has_been_edited_the/"
    },
    {
        "id": "1ic6pni",
        "author": "boltsofsaffron",
        "title": "The Bernie Mac Show - a freaking gem",
        "content": "Man....I forgot just how funny this show is. The subtle humor, the flashbacks, the writing over the scenes, the end scenes that add extra context to what happened during the show...its hilarious man. Jordan, Baby Girl and Vanessa have some great comedic timing for being kids, and Bernie...well, he's a legend. I've been watching from the beginning again, and it might be one of my new all time faves. ",
        "upvotes": 92,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ic6pni/the_bernie_mac_show_a_freaking_gem/"
    },
    {
        "id": "1icpbw9",
        "author": "North_Drummer2034",
        "title": "Thoughts on “Man on the Inside” ???",
        "content": "I’ve been watching it and I really wanted to like it but I just can’t get into it. I know it’s supposed to be funny but it’s just really cringe and corny to me. I’m already halfway through the series so I feel like I might as well finish it now but I keep getting distracted during the episodes and having to start over 🤣🤣 I might just skip to the last episode ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1icpbw9/thoughts_on_man_on_the_inside/"
    },
    {
        "id": "1icm1az",
        "author": "MindOfDay",
        "title": "Kill me but I enjoyed Night Agent S2",
        "content": "I finished the season just a bit ago and im not gonna lie I kinda liked it. Although I do think S1 was way better, I don't think this season was bad. I checked what other people were saying after I finished so my opinion couldn't be swayed by others and thank god I didn't. Some points I didn't like were Farhad, Rose (she was off icel), and Tomas specifically what annoyed me was the fact that no one could lie to save their life. BUT I loved the action I think it was 10x better than S1 kinda felt repetitive with the mole or whatever but I still enjoyed it. I'm not no film critic or wtv i'm actually employed but I'm hoping for a S3 with the last scene with Peter and Catherine seemed promising.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1icm1az/kill_me_but_i_enjoyed_night_agent_s2/"
    },
    {
        "id": "1icm61d",
        "author": "jadesxs",
        "title": "Is my subscription whack, is Netflix going crazy or am I going crazy?",
        "content": "Just how the title says, am I going crazy or is Netflix going crazy? I live in the Philippines, and I just want to go about my day when I noticed that I couldn't watch some of the titles that I was currently watching. I tried searching for some of the titles and surely enough, they weren't there. I tried searching information on the internet if something happened or were they removed by Netflix but they weren't. For context, I was rewatching SPY X FAMILY and currently watching SAKAMOTO DAYS.\n\nI have my account logged in on both our TV, Laptop, and my phone. I noticed that I couldn't search up the titles on the TV. I tried searching in on the web then clicking the link to redirect me to Netflix, it worked but I couldn't play the series. The series shows up on my phone too, but there wasn't any play button as well. I don't know if I'm going crazy or what. **(EDIT: Just a few days ago, even yesterday, I was watching SPY X FAMILY just fine.)**\n\nI don't know if this information helps but I was also on time with payment for my subscription. I am currently on the Standard plan, \"Great video quality in Full HD (1080p). Watch ad-free on any phone, tablet, computer or TV. Download on 2 devices.\"\n\nAnyone knows what happened here? Thanks in advance for any answers!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1icm61d/is_my_subscription_whack_is_netflix_going_crazy/"
    },
    {
        "id": "1icko0a",
        "author": "smcderm",
        "title": "Did anyone else notice get an email about the price increase from Netflix?",
        "content": "When I go into my account it still says my plan is 15.49. The other plans I see have the price increase. Am I missing something here? My next billing cycle is on 2/1. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1icko0a/did_anyone_else_notice_get_an_email_about_the/"
    },
    {
        "id": "1ic4h53",
        "author": "StarKCaitlin",
        "title": "Jeremy Allen White to Star in 'Enigma Variations' Series at Netflix",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic4h53/jeremy_allen_white_to_star_in_enigma_variations/"
    },
    {
        "id": "1ico1sf",
        "author": "Working-Frosting9490",
        "title": "Senna Brawl Scene",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qo3znyxyrvfe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ico1sf/senna_brawl_scene/"
    },
    {
        "id": "1ico0zg",
        "author": "Working-Frosting9490",
        "title": "Senna - Heart Of Glass",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9t3qih9orvfe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ico0zg/senna_heart_of_glass/"
    },
    {
        "id": "1icf854",
        "author": "HospitalHairy5133",
        "title": "cult-like documentaries &amp; series?",
        "content": "I love anything cult-related or borderline cult. I've seen and enjoyed:\n\n\\-Keep Sweet Pray and Obey\n\n\\-Wild Wild Country\n\n\\-Filthy Rich (both the Epstein and Ghislaine episodes)\n\n\\-Jimmy Saville\n\n\\-Bikram\n\n\\-Zodiac \n\n\\-The Program\n\n\\-Escaping Twin Flames\n\nAnything on or off Netflix that's similar - send it my way!",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1icf854/cultlike_documentaries_series/"
    },
    {
        "id": "1iclcjk",
        "author": "Outrageous_Cheek7940",
        "title": "Thrillers?",
        "content": "Hi!\n\nI loveeeeeee Netflix’s sci-fi/horror/thriller/mystery shows it’s created but I feel like I’ve watched all the good ones including:\n\n1899\nBoth “the haunting of”s\nDark \nMidnight mass \nRatched \n3 body problem \nThe Rain \nThe oa \nManiac\n\nThe terror \nTrue detective \n\n\nIf you’re into similar genres and know of any more I’d love to hear and I have nearly every other streaming service as well. Interested in movies too\n\nThank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iclcjk/thrillers/"
    },
    {
        "id": "1icc93t",
        "author": "orange-black-tea",
        "title": "French Adaption of the Show Alpha Male",
        "content": "I watched the French adaption of the Spanish show “Alpha Male” called “Shafted” last night. My God, it was so bad. It reminded me of another French show “Hookup Plan. \n\nThen I googled it, turned out the producer of “Hookup Plan” Noemie Saglio is the director of the French version of “Alpha Male”. \n\nI love the original Spanish version. Netflix is adapting into French, Italian and Dutch versions. Hope that the Italian and the Dutch versions will have the same high quality as the original Spanish version.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1icc93t/french_adaption_of_the_show_alpha_male/"
    },
    {
        "id": "1ico9gh",
        "author": "waitingtogrowup",
        "title": "Netflix, I don't want to see games",
        "content": "Netflix, why is there no option to turn off games?\n\nWe're adults, there's no kids in the house, yet there's a huge game trailer/video on the main page and have two upper rows of games. We have never played games, we do not intend to play games (at least not on this platform), we even deleted the \"kids\" profile, and there's still no option to get rid of this annoyance. \n\n  \nNetflix, please give us the option to disable the games. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ico9gh/netflix_i_dont_want_to_see_games/"
    },
    {
        "id": "1icohpj",
        "author": "enderbey",
        "title": "Is the Netflix Series Squid Game based on a real story?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1icohpj/is_the_netflix_series_squid_game_based_on_a_real/"
    },
    {
        "id": "1icg5au",
        "author": "Heavy-Rough-3790",
        "title": "Horrible audio clipping",
        "content": "Has anyone else noticed horrible audio clipping? I have been watching the walking dead season 11 and the loud scenes sound like someone screaming into the mic. It’s so bad. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1icg5au/horrible_audio_clipping/"
    },
    {
        "id": "1ickc5h",
        "author": "Winter_Pollution_692",
        "title": "Can’t remember the Name of series",
        "content": "Hi. Can somebody help me out please. I forgot the title of the series. It’s about a woman who murdered some guy during a picnic at the beach? She just suddenly killed a random guy at the start of the series. Then she was put in the prison and she kept on seeing a wallpaper in her thoughts, which brought pieces together that lead the detective to prove her innocence. Turned out she was drugged by someone which led her to murder the guy and forget things about her past. Idk something like that. I think it was a Spanish or French series. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ickc5h/cant_remember_the_name_of_series/"
    },
    {
        "id": "1ib9728",
        "author": "Whobitmyname",
        "title": "Carey Mulligan ‘Just Started’ Filming ‘Beef’ Season 2 and Says ‘Almost Everything’ Is Different",
        "content": "",
        "upvotes": 507,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1ib9728/carey_mulligan_just_started_filming_beef_season_2/"
    },
    {
        "id": "1icfglg",
        "author": "DashiellHammett",
        "title": "Night Agent S2 ~ Let's List All the Unbelievable, Ridiculous, or Flat-Out Stupid Plot Points",
        "content": "So many to choose from.  I'll go first, sticking to Episode 1 (because I bailed by the end of Episode 2 because I couldn't take it anymore).  But please post examples from the entire second season. \n\nRose is a genius computer software engineer, and she goes into a potentially make-or-break meeting with an investor with $50 million dollars on the line for an amazing computer program she helped to create, and....She takes her phone into the meeting. It is not on silent. She is apparently unable to figure out how to  make it be silent as it continually interrupts the meeting, forcing her to finally leave the meeting while her boss explains that she is apparently having an \"off day\" (or something). ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1icfglg/night_agent_s2_lets_list_all_the_unbelievable/"
    },
    {
        "id": "1icoyx3",
        "author": "daily_mirror",
        "title": "Netflix users fume over major Stranger Things change after 3 year wait",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1icoyx3/netflix_users_fume_over_major_stranger_things/"
    },
    {
        "id": "1icde8o",
        "author": "Old-Firefighter224",
        "title": "Need show recommendations",
        "content": "I’ve watched all the newer shows and documentary’s on Netflix. Need some good recommendations of shorter shows. I can’t commit to something like greys anatomy lol ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1icde8o/need_show_recommendations/"
    },
    {
        "id": "1ichejy",
        "author": "SomewhatProvoking",
        "title": "Question about the 8 show",
        "content": "I don't know if it fits as a pothole or abandoned element \n\nWhen 6th floor chose a card, there was blood on the table. But why? Nobody had been hurt yet so how did any blood get there. It was on the back so what does the blood really do for the storyline or characters? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ichejy/question_about_the_8_show/"
    },
    {
        "id": "1ibzxq7",
        "author": "qna27",
        "title": "Continue play on same device",
        "content": "I understand they have a service to keep track of point of time I'm watching a movie or series. But at times it plays a previous time when i resume on same device. I guess it makes sense of i played on device 1 then resumed on device 2, then went back to device 1 and there was a sync error. \n\nBut I have noticed this even when I play back on same device. \n\nSuggestion:\n\nOn same device save time played till locally &amp; don't overwrite that with server time if not played on different device.\n\nAnyone else experience this?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ibzxq7/continue_play_on_same_device/"
    },
    {
        "id": "1icndoa",
        "author": "Kelsierr",
        "title": "Don't fall for the subscription scam.",
        "content": "Netflix offers a 4k subscription plan but only delivers 540p playback.\n\nHit them up in the chat-box far off way down there in the very left corner of your screen as you are looking for your refund option in your subscription plan and talk to a \"human\" to get it sorted. Don't just cancel it, demand a fucking refund.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1icndoa/dont_fall_for_the_subscription_scam/"
    },
    {
        "id": "1ichsgd",
        "author": "TryEasy6525",
        "title": "A community within Netflix? Good or Bad?",
        "content": "1) Would you be interested in connecting with other Netflix users who share similar content preferences?\n\n2) What features do you think would be cool in a Netflix community? For example, Discussion boards for shows/movies. Groups based on content preferences (e.g., action fans, true crime enthusiasts. Watch parties. Content recommendations from community members. \n\n3) How likely are you to write reviews or rate shows/movies or comment if a community feature is added to Netflix?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ichsgd/a_community_within_netflix_good_or_bad/"
    },
    {
        "id": "1ibjioi",
        "author": "Intrepid-Discount976",
        "title": "The Night Agent trying to become the new Jack Ryan is going to be its downfall",
        "content": "Jack Reacher, Jack Ryan, James Bond, Jason Bourne, whatever. The trope of the hyper competent spy action thriller that's geared specifically towards the male demographic. There are so many of these already, and apparently we needed another one?\n\nIMO what set the first season of The Night Agent apart was the male/female duo dynamic which tapped into both demographics and a wider audience. And while the writing occasionally went on the corny side, I appreciated the realistic aspect of physical limitations, i.e. the fighting was often clumsy, Rose was the computer wiz and not suddenly defeating men twice her size in hand-to-hand combat, and Peter wasn't this unrealistic prodigy agent who was somehow equally talented at technology and combat - they both needed the other in a believable partnership.\n\nSeason 2 felt like they were diverging away from the formula in order to turn it into another long-running spy thriller franchise, which the show runners pretty much confirmed in an interview. Also, the decision to make her suffer from PTSD and anxiety, and be in therapy twice a week felt entirely out of place considering Peter is somehow completely mentally unaffected? And how has no government organization recruited Rose yet to be a cyber intelligence officer? Instead this season wrapped up with her effectively becoming his Bond girl, with the writers saying it's undecided if Rose will even be back next season. Peter being willing to trade his whole life to save her and Rose in turn being like \"this gives me anxiety, I just wanna go back to Silicon Valley and be a normal girl :(\"\n\nAll of this made complete sense btw when I found out S1 is based on a book, and S2 was the show runners writing without any source material. For me the season was a letdown, and I'm honestly just uninterested in the direction they're taking this show",
        "upvotes": 44,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1ibjioi/the_night_agent_trying_to_become_the_new_jack/"
    },
    {
        "id": "1ic6d5x",
        "author": "patoons",
        "title": "Fast forwarding/Rewinding on netflix frame preview",
        "content": "I watch Monday night raw a day or 2 after it airs mainly because I can’t commit 3h to watching live and I’m not interested in like 50% of the show. Watching the next day allows me to ff thru the show and play when I want. I notice that when I FF, only sometimes it displays a small thumbnail of the frame the video is on. Sometimes it doesn’t show and I’m just seeking blindly. I am using the same device to stream Samsung smart tv) so it’s not a matter of device features. Any idea?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ic6d5x/fast_forwardingrewinding_on_netflix_frame_preview/"
    },
    {
        "id": "1ibr6j0",
        "author": "notyourhistoryclass",
        "title": "The History Behind The Six Triple Eight.",
        "content": "In December of 2024, Tyler Perry came out with a movie called The Six Triple Eight, starring Kerry Washington. I love history and after doing a deep dive on the story, I found out that, while dramatized and a handful of fictional characters sprinkled in for the sake of good storytelling, it was in fact very accurate. I really love Kerry Washington's portrayal of Major Charity Adams, especially the scene where she tells Dean Norris, \"over my dead body, sir!\" Especially since this scene actually happened in real life. She was a woman, being sick of mistreated for so long, that she wasn't going to let anyone stand in her way of what she wanted. ",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ibr6j0/the_history_behind_the_six_triple_eight/"
    },
    {
        "id": "1iclelj",
        "author": "LeagueIndependent826",
        "title": "If something is on the top 10 popular shows on Netflix does it mean it’s “most likely good quality?”",
        "content": "Partner and I are trying to find a show to watch on Netflix. We see one that’s #3 on the most popular list and partner says it’s probably good then. I disagree. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iclelj/if_something_is_on_the_top_10_popular_shows_on/"
    }
]