[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hrc6ol",
        "author": "S4v1r1enCh0r4k",
        "title": " Netflix Accidentally Leaks 'Squid Game' Final Season Release Date -June 27 ",
        "content": "",
        "upvotes": 405,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc6ol/netflix_accidentally_leaks_squid_game_final/"
    },
    {
        "id": "1hr9xg9",
        "author": "MarlowInvests",
        "title": "La Palma - Ending really p***ed me off.",
        "content": "I've just finished watching the limited series of \"La Palma\", which I was really enjoying. Right up until the last 15mins of the last episode. So much so it's pi**ed me off.\n\nHow can someone survive a frigging tsunami after being hit with it whilst taking off in a plane? They must of been underwater for at least 15mins (that's being generous) whilst the rest of the island gets wiped out.\n\nThey should of ended it where she and her new girl friend died. \n\nHow does everyone else feel about the ending?",
        "upvotes": 47,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hr9xg9/la_palma_ending_really_ped_me_off/"
    },
    {
        "id": "1hrk9qg",
        "author": "infallables",
        "title": "DOTA: Dragon’s Blood is Incredible",
        "content": "This is an absolutely incredible series. World class quality in the voice acting, action, animation, and above all dialogue. Does anybody know if there will be further seasons? Are Mitch Iverson or Ashley Edward Miller writing or producing any more series?",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrk9qg/dota_dragons_blood_is_incredible/"
    },
    {
        "id": "1hrm3qp",
        "author": "Neither_Technology74",
        "title": "Discussion: Too many low grade, effortless, productions.",
        "content": "Here's where I currently stand on Netflix as a whole:  \n  \nAs an example: If Netflix produced Star Trek: The Next Generation, it would have been cancelled after the first season and it would never have become as huge as it is today.  \n  \nNetflix needs to take more responsibility to bring stories to fruition and conclusion. Stop producing so much absolute C, D and F grade productions.   \n  \nFocus up and work to improve the shows that have traction to be there. You cancel shows with viewers measured in millions and waste money producing umpteen 100's of things with viewership measured in thousands. \n\nPeople pay good money to spend their time getting involved in concepts, plots, character development, etc., only to have Netflix repeatedly and relentlessly pull the plug on them. \n\nAlso becomes difficult to find things worth watching because you have to browse forever through low grade productions on the platform. \n\nPersonally, I think they should stop wasting so much money, only to pull the plug on good productions because of.... money, and stick to their guns and see things through. \n\nThere's a mathematical reality to having, for example, 10,000 things to watch, spread over your subscribership, vs 5,000 higher quality things spread over your viewership. Viewership hours are finite. They put so much out there, they distract viewership from coagulating onto good productions that rely on viewership to continue production. It seems like they do not understand this basic concept. \n\nCurious to hear what you all think, please comment below :) ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hrm3qp/discussion_too_many_low_grade_effortless/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 1152,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hro1x0",
        "author": "Bybebyebirdie",
        "title": "Where can I still find this?",
        "content": "So they have this great experience in Amsterdam, but I'm not sure they still have it.\nDo you guys know where I can find this or something like it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hro1x0/where_can_i_still_find_this/"
    },
    {
        "id": "1hrnmm8",
        "author": "sassylilchix",
        "title": "Extra member forced ads ",
        "content": "So my parents added me as an extra member on their Netflix so I can watch squid game in peace.\n\nBUT the extra member account I have is with ads. I only found one other person on Reddit with the same issue.\n\nIf I were to buy Netflix with ads in my own it’s 6.99 but an extra member is 7.99…?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrnmm8/extra_member_forced_ads/"
    },
    {
        "id": "1hr3h5o",
        "author": "Kaleidoscope_Pure",
        "title": "Is House of Cards worth watching?",
        "content": "Always thought this is probably a good show, however things with Kevin Spacey went down really fast, and i think the show might end up kinda bad after he left.\nEven with all that, is it worth watching? ",
        "upvotes": 42,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1hr3h5o/is_house_of_cards_worth_watching/"
    },
    {
        "id": "1hr0xa7",
        "author": "No_Spinach_9309",
        "title": "loved squid game season 2. thought it was good",
        "content": "# so i kinda loved season 2. (also season 1) i think its crazy how much hate i saw on this sub about the season. just showed me not to go on reddid after watching shows, its so negativ. \n\nand some comments i see about the season are just weird. like the crirics for it. im like what do you mean? this didnt made sense? it wasnt unrealistic either. it totally did. or that the characters werent likeable or the acting wasnt that great. and even with more specific negativ reviews im like? the comments just dont make sense to me. also i didnt found it boring at all. i have the feeling people just want to watch extrem games and people dying. they dont care about the story. the only thing i hated was the ending lol. so sad",
        "upvotes": 72,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0xa7/loved_squid_game_season_2_thought_it_was_good/"
    },
    {
        "id": "1hrlq1p",
        "author": "dacluelessbadger",
        "title": "Unable to watch specific titles on Netflix Apple TV",
        "content": "Since this morning I have been unable to watch certain shows on my Apple TV specifically on my Netflix profile. I tested other devices and other profiles and they did not have this issue. \n\nI initially thought that this issue was limited to the shows I was currently watching, given that I couldn’t find the “continue watching” tab or actually start watching those shows after searching for them. The only options I saw were “Remind Me” and “Watch Trailer.” Then I realized that this issue is also affecting almost every single non-Netflix original and some Netflix originals. These Netflix originals do not have title cards and are just text. Also, there are no titles on my watch list even though I remember having many shows and movies added.\n\nI contacted support and they were not helpful in the slightest (they suggested I just wait and that my request will be processed in the backend… whatever that means). \n\nIf anyone has experienced anything similar recently I would greatly appreciate any troubleshooting advice!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrlq1p/unable_to_watch_specific_titles_on_netflix_apple/"
    },
    {
        "id": "1hrongs",
        "author": "add_Mozi",
        "title": "If you pay for your Netflix subscription do you still have to pay for something else ?",
        "content": " when I looked at Google for the serie Dexter it said \"you can watch Dexter in Netflix , *other company*, *other company* if you pay and watch for free in *other company* soo is there additional fees if I want to watch some series or what?(Thank you for reading)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hrongs/if_you_pay_for_your_netflix_subscription_do_you/"
    },
    {
        "id": "1hrl2yc",
        "author": "Last_Till8596",
        "title": "Need Help Finding TV show ",
        "content": "I need help finding a tv show. It stars Taissa Farmiga. When her character was young girl her family visits an island where her older sister dies while with two African men. One of there names in gogo. In the present day Taissa Farmiga's character is living in New York and comes across one of the men accused of killing her sister. She tries to prove or figure out if he really killed her sister. In the end we find out her older sister actually just slipped and hit her head on some rocks.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hrl2yc/need_help_finding_tv_show/"
    },
    {
        "id": "1hqzrxn",
        "author": "RhiAndroid1990",
        "title": "I’m so annoyed at the lack of old episodes uploaded for WWE Raw &amp; Smackdown",
        "content": "Me &amp; husband were watching all the old 2000 episodes on WWE Network, and now it’s moved to Netflix. Was excited. Saving 1 subscription and been a long Netflix subscriber but we wake up this morning and there are NINE episodes for 2000 &amp; 2001 and then it jumps to 2022. I’m pretty upset to be fair. ",
        "upvotes": 49,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzrxn/im_so_annoyed_at_the_lack_of_old_episodes/"
    },
    {
        "id": "1hrf5gk",
        "author": "mkebrewersfan",
        "title": "Thanks Netflix for making me feel old",
        "content": "\n\nWell,it happened. I just turned 30. Skimming through Netflix and there is a category that says “retro”….now when I think of Retro….i think of Herbie,Sanford and son,convoy,Star Wars,Dirty Dancing. \n\nSo,I start scrolling through them….\n\nBut,what did I see? All the shows I watched growing up…THAT’S RIGHT. Reba,Zoey 101,Fairly odd parents and when it really hit me……….Drake and Josh. \n\nTime flies so fast in this life. Thanks for reminding me of that Netflix. Always in a hurry. We don’t look at the present. I couldn’t wait to finish highschool,couldn’t wait to finish college,get married,have a career. To which I have done all of that. Even bought my dream vehicle. \n\nThanks for reading. Im off to watch Drake and Josh while I stroll down nostalgia avenue. \n\n",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hrf5gk/thanks_netflix_for_making_me_feel_old/"
    },
    {
        "id": "1hrmzsd",
        "author": "NihilusCF",
        "title": "Is anyone else getting this weird glitch?",
        "content": "Season 2 episode 5 of squid games, it's corrupt, I've tried different accounts, using my phone, the episode has some.kind of error ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2ldn9261siae1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hrmzsd/is_anyone_else_getting_this_weird_glitch/"
    },
    {
        "id": "1hrmawd",
        "author": "Fabulous_Island_5621",
        "title": "En una publicación que se eliminó casi de inmediato, la cuenta de YouTube de Netflix Corea publicó “por error”, la fecha de lanzamiento de la tercera temporada de la exitosa serie El Juego del Calamar, causando emoción en los fans.",
        "content": "En una publicación que se eliminó casi de inmediato, la cuenta de YouTube de Netflix Corea publicó “por error”, la fecha de lanzamiento de la tercera temporada de la exitosa serie El Juego del Calamar, causando emoción en los fans.\n\nEl video con la sorpresiva revelación se bajó de la red solo minutos después de que algunos seguidores ya habían registrado la filtración y compartieron la noticia en sus redes sociales haciendo viral el anuncio.\nLa fecha de estreno de la tercera temporada de El Juego del Calamar 3, será, según lo filtrado por Netflix Corea el próximo 27 de junio de 2025.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrmawd/en_una_publicación_que_se_eliminó_casi_de/"
    },
    {
        "id": "1hrc05v",
        "author": "H4RDCANDYS",
        "title": "Missing you ",
        "content": "Another mediocre Harlan coben show. I had high hopes for this one but it missed the mark for me. What are y'all opinions on \"missing you.\"  I can't get into Harlan coben shows. The only decent ones are shelter, and stay close in my opinion. ",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc05v/missing_you/"
    },
    {
        "id": "1hrfxc4",
        "author": "I_like_cookies_a_lot",
        "title": "Does anyone know how to access a list of movies with the ‘most liked’ tag?",
        "content": "I’ve almost always enjoyed the shows and movies with the ‘most liked’ tag on them, but can’t seem to search directly for the tag or easily find a list online.\n\nDoes anyone know a good way to find a list of them?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrfxc4/does_anyone_know_how_to_access_a_list_of_movies/"
    },
    {
        "id": "1hrkfxp",
        "author": "uniquetiger_",
        "title": "the good doctor and obx ",
        "content": "i am not ok this is not ok I just saw dr Melendez AND JJ die in the span of a few weeks. 😭😭 2 character deaths that just ruined the show for me. IM SO PISSED OFF AHHH",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrkfxp/the_good_doctor_and_obx/"
    },
    {
        "id": "1hrjwab",
        "author": "Kwikli",
        "title": "Opening Netflix crashes my pc",
        "content": "Everytime I open the Netflix app on my pc, it just gives me a white screen, freezes my pc and then crashes it. The browser version works fine. I've tried uninstalling and reinstalling multiple times, and yesterday it helped only once and then the app started crashing again. This started out of nowhere, I have no clue what could be causing it. I've tried pretty much every trick I could find by googling, but none of them helped, and also I couldn't even find any thread anywhere with the exact same problem as me, everyone else had the crash happen differently. Has anyone else experienced this? Any idea what could help?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hrjwab/opening_netflix_crashes_my_pc/"
    },
    {
        "id": "1hrn8zw",
        "author": "Balance_Be_Gone",
        "title": "How long do I have to connect to my crappy WiFi each month for the household thing to go away?",
        "content": "Usually I’m several episodes in before I remember to check if it did it and I have to manually turn on WiFi on my phone and turn it back off. \n\nIt’s not necessarily slower, but it’s cluttered and things have priority and my phone always ends up buffering on even just webpages. Then I have to remember to check and turn WiFi back off. Now that I’m no longer using wireless CarPlay it’s pretty much always in the off off state and I have to turn it on intentionally. Since I got my account a few months ago I’d been using wireless CarPlay and kept accidentally leaving WiFi on to search and connect. Now that I’ve switched over to wired CarPlay due to indexing issues that’s not a thing. \n\nWhat is the minimum amount of time I need to spend on my crap WiFi? Everything I’ve read thus far just says a day streaming once a month and that is so far from clear to me. All day? Half a day? A single 30minute episode? \n\nEverytime I have a chance to test it I just set my phone to the side to stream while I’m doing something else since it’s going to spend a large chunk of time buffering anyways. I usually forget about it and am 6-8 episodes in before I remember to see if it worked.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrn8zw/how_long_do_i_have_to_connect_to_my_crappy_wifi/"
    },
    {
        "id": "1hre2s1",
        "author": "seal973",
        "title": "Suggestions for Shows to Binge during holidays/NYE break",
        "content": "Hi guys \n\nI have been scrolling around Netflix, unsure what to watch for days. I am looking for something that will get me so hooked I will stay up till 5 am watching it. Also going through a break up so I need a good healthy distraction, gotta be extra good for the escapism!! Any reccs is good but nothing toooo heavy ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hre2s1/suggestions_for_shows_to_binge_during_holidaysnye/"
    },
    {
        "id": "1hr0yz6",
        "author": "techfinpro",
        "title": "‘Santa Clarita Diet’ Creator Victor Fresco Learned his Show was Canceled when Netflix took apart its Sets",
        "content": "",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0yz6/santa_clarita_diet_creator_victor_fresco_learned/"
    },
    {
        "id": "1hri1o1",
        "author": "NiceBat9877",
        "title": "Netfilx Character Elimination",
        "content": "Can someone make a Character Elimination x Netflix fanfic whenever is here on Reddit or Ao3 or Wattpad \nIt Will 41 Characters from anything on Netflix (like anime tv series cartoons and movie) inculding Netflix originals \nMake suggetions :)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hri1o1/netfilx_character_elimination/"
    },
    {
        "id": "1hrgdkg",
        "author": "Art_Poem71105",
        "title": "Deleted Account ",
        "content": "Question, can I use the same email after a year of deleting my netflix account?\n\nAsking as my friend is having a hard time trying to get on their account after deleting their account a month ago.\nThe message that they are getting is \"that this account already exist\" when they use the same email that they always had use for their netflix account.\n\nNeed to know as I deleted mine about four months ago and would want to know if I can use the same email if I were to created a new one with that same email after a year of deletion.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrgdkg/deleted_account/"
    },
    {
        "id": "1hr0pmm",
        "author": "TinyZookeepergame292",
        "title": "Harlan Coben's Missing You. Kat is a detective but cannot detect anything???",
        "content": "So we have just started the series and are flabbergasted with how incompetent Kat is at doing detective work. Her friend who is a private investigator and a kid who is looking for his missing mother do more detective work than her. \n\nIn the most problematic scene for me, Stacey finds out that the missing ex fiance was arrested 11 years ago. How can Stacey find this information but not Kat who is an actual police officer? This is beyond irritating. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0pmm/harlan_cobens_missing_you_kat_is_a_detective_but/"
    },
    {
        "id": "1hrcvvv",
        "author": "Jamez_Neckbeard",
        "title": "Thinking of signing up for the standard withbads package. Just how many adverts do you get?",
        "content": "I stopped my subscription maybe 18 months ago but am thinking of signing back up. How many adverts do you get with the advert package. I'm obviously used to terrestrial tv adverts and don't mind those . ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrcvvv/thinking_of_signing_up_for_the_standard_withbads/"
    },
    {
        "id": "1hqx0s4",
        "author": "Vojuln3",
        "title": "Don't Die: The Man Who Wants to Live Forever - Discussion Thread\n",
        "content": "How far would you go to live forever - or even just slow down the aging process? This startling documentary by Chris Smith (Fyre, 100 Foot Wave) is told through intimate access to Bryan Johnson, a man who has dedicated his life to defy aging. Don't Die: The Man Who Wants to Live Forever dives into the controversial wellness practices one man is using to maintain youth and vitality, and the effect this journey has on himself and those around him.\n\nReleased today on Netflix\n\nTrailer: [https://www.youtube.com/watch?v=kf9e1o7rUeo](https://www.youtube.com/watch?v=kf9e1o7rUeo)",
        "upvotes": 15,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hqx0s4/dont_die_the_man_who_wants_to_live_forever/"
    },
    {
        "id": "1hrbs14",
        "author": "diamondeyes7",
        "title": "Looking for romance or romance/fantasy TV series!",
        "content": "I just read the first 2 books of the ACOTAR (A Court of Thorns and Roses) and now I'm craving some romance lol.\n\nI don't typically watch romance but I'm not looking for some of Netflix's recommended romances like Grey's Anatomy, Nobody Wants This, etc.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrbs14/looking_for_romance_or_romancefantasy_tv_series/"
    },
    {
        "id": "1hr18wu",
        "author": "Stunning_Ad6376",
        "title": "Profile issue on fire tablet ",
        "content": "Hi\nI'm having an issue watching Netflix on an Amazon fire tablet, it suddenly after working for years, loads 12 and under profiles and closes when selecting a 15 or 18 profile.\n\nI've tried everything suggested for errors I've found on the net: clearing cache, checking for system and app updates, restarting the device, deleting and reinstalling the app.\n\nAnyone had a solution for this problem?\n\nThank you",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hr18wu/profile_issue_on_fire_tablet/"
    }
]