[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 16,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1keghs6",
        "author": "LawInside0",
        "title": "what should i watch on netflix?",
        "content": "i usually tend to just watch shows that are popular.\nshows i like are: orange is the new black, sex education, money heist, stranger things, anne with an e, you, the end of the fucking world, etc.\n\nand reality  tv shows like too hot to handle, love is blind, etc.",
        "upvotes": 10,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1keghs6/what_should_i_watch_on_netflix/"
    },
    {
        "id": "1kejp46",
        "author": "cloecherise",
        "title": "Trying to recall a series/movie",
        "content": "I’m trying to remember the title of a series or movie I watched. I remember that it starts with a young woman walking past a park at night and hearing someone scream — possibly a murder. She goes to check it out. Later, she becomes a suspect herself (i guess?). She had some kind of sexual relationship with a man who lives nearby, and he might be the killer. I remember that at some point she breaks into his apartment to investigate, but he comes home and she has to hide/escape. He lived in an attic apartment.\n\nMaybe someone knows it – thanks in advance!",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kejp46/trying_to_recall_a_seriesmovie/"
    },
    {
        "id": "1kdrq65",
        "author": "TheExpressUS",
        "title": "Netflix's 3 most disturbing documentaries based on real-life tragedies",
        "content": "",
        "upvotes": 228,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1kdrq65/netflixs_3_most_disturbing_documentaries_based_on/"
    },
    {
        "id": "1ke6wte",
        "author": "ConflictFluid5438",
        "title": "Bad influence - disposition",
        "content": "Edit: The title should have been “disappointed” \n\nJust finished watching the documentary and honestly, I’m really disappointed by how surface-level it was on some major issues. They say they’re sharing their story “so no other kids go through this,” but the whole thing was settled out of court for $1.8M and never really held anyone accountable. And even now, they still have their kids all over social media—then wonder how to protect them from “all those hate comments”\n\nWhat really got me was when they left the Squad and were mostly worried that their views were tanking. Like... that’s the concern? Not what the kids went through? And those scenes where the kids are sending messages to Pipper? “If she ever watch this” they looked super uncomfortable. You can totally tell it was staged. \n\nIt’s just upsetting how lightly the documentary touches on the real impact of putting kids in the spotlight like that and building a whole image around them. It’s honestly disturbing.\n\n",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ke6wte/bad_influence_disposition/"
    },
    {
        "id": "1ke8zed",
        "author": "Senior_Molasses_3136",
        "title": "Who do you never want to see again in the reality programming.",
        "content": "Since Netflix insists on continually casting the same people (primarily influencers) over &amp; over again from one show to another. For example, Battle Camp and Perfect Match are comprised of individuals who have already been on at least one other Netflix show. So I am wondering who do you never want to see again &amp; why?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ke8zed/who_do_you_never_want_to_see_again_in_the_reality/"
    },
    {
        "id": "1kdts6b",
        "author": "newlife07_",
        "title": "Looking to be obsessed with a show again lol",
        "content": "Last show that got me obsessed was outlander. I was completely sucked into the universe when i discovered the show last year and rewatched it like 2 months after with a family member. I bought the books. I’m currently reading book one. I still watch part of the episodes often on netflix or listen to the show’s themes songs.\n\nI want to find another show that will leave me feeling as passionate and obsessed with it. I’m big on love stories but it’s okay if there isn’t one. Can someone recommend me a show?",
        "upvotes": 58,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1kdts6b/looking_to_be_obsessed_with_a_show_again_lol/"
    },
    {
        "id": "1ke81ro",
        "author": "Hom3dog117",
        "title": "Suitcase from Carry On?",
        "content": "My little brother loves the movie Carry On, and I tend to get props from movies/shows he's into for his birthday. \n\nDoes anyone know the suitcase they used in the movie? The ones I see on Amazon are close, but not the exact one.\n\nThank you!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ke81ro/suitcase_from_carry_on/"
    },
    {
        "id": "1kel8e0",
        "author": "MrFixYoShit",
        "title": "JFC can you commit to a show Netflix???",
        "content": "I've watched at least 6 GREAT shows this year. ALL of which have been cancelled or moved to another service after only one or two seasons!! \n\n  \nGuess what folks??? Sometimes it takes \\*years\\* for a show to really catch on. Parks and Rec didn't really hit their stride until season 3. I don't even want to watch anything on Netflix anymore. The suggestions suck, the good shows get cancelled, and your stupid autoplay blocker goes off every half hour",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kel8e0/jfc_can_you_commit_to_a_show_netflix/"
    },
    {
        "id": "1kdesan",
        "author": "haugs91",
        "title": "Santa Clarita Diet - Please",
        "content": "Next to Mindhunter, this has gotta be the biggest tragedy of a canceled series that should’ve continued. \n\nEverything about this show is comedically amazing and I wish it would get rebooted haha. Thoughts?! ",
        "upvotes": 183,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kdesan/santa_clarita_diet_please/"
    },
    {
        "id": "1kedzlk",
        "author": "kings_lightstone",
        "title": "any way to over come this?",
        "content": "[don't mid the quality loss](https://preview.redd.it/541wmow5upye1.png?width=1370&amp;format=png&amp;auto=webp&amp;s=131df0302c54170d0a1bbd7a2862e99bed99b33c)\n\ndoes netflix expect every viewer to pay?? i'am using my mom's account who is at home and i'm in college...wtf netflix!  \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kedzlk/any_way_to_over_come_this/"
    },
    {
        "id": "1kdvyji",
        "author": "Suspicious_Teach4469",
        "title": "Lost in space (2018) Character development.",
        "content": "I’m aware it’s been quite a bit since this show was released but I resently become obseesed! So I’m here to talk about my FAVORITE character developments.   \n1. Don West.   \n  \nOk I feel this might be self explanatory, but come on I mean at first I thought he was the annoying, selfish, mechanic in space. Then now he’s my favorite character! My favorite episodes showing this are S2 E10 where Will, Penny and Judy have to board the Jupiter . Knowing Don he probably wasn’t into goodbyes but he showed up for this one cause he didn’t owe any of them money ended hugging penny before she left that’s my favorite scene of the whole show, and I think… S2 E6 is it where Don saves Penny, Vijay, Dr. Smith and Mr. Jackson from freezing in space “Hey, kiddo you alright?” Melted my heart.   \n\n\n2. Dr. Smith \n\nAnother I feel is self explanatory. I wanted her to die for 2 seasons and then I wanted her to thrive! She might’ve been the evil, con artist who stole identities and killed people, but she get better all she really wanted was a fresh start and yes to get that she did have to poison her sister but anyway…I feel if the series continued she would become the weird aunt to the kids.\n\n  \n3. Ben Adler\n\nYasss! He was good all along if you rewatch the series! Like yeees!\n\n  \nWhat do y’all think?\n\n",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kdvyji/lost_in_space_2018_character_development/"
    },
    {
        "id": "1kefq4c",
        "author": "Rude_Ad_1760",
        "title": "I'm horrified...",
        "content": "I was watching a TV series on Netflix, I am horrified of ovens. If you don't know, it's Cassandra, (Please check the show out) a TV series I am supposed to be grown up. But I don't want my face to be burned or I don't wanna be burned alive. I am scared of smart homes too. But very good show 9/10.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kefq4c/im_horrified/"
    },
    {
        "id": "1kdygvy",
        "author": "indiewire",
        "title": "The 26 Best Rom-Coms on Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdygvy/the_26_best_romcoms_on_netflix/"
    },
    {
        "id": "1ke5yzu",
        "author": "Hour-Initiative-2766",
        "title": "Movies Suggestions",
        "content": "Can someone suggest some really good movies? It could be about any topic just really good movies that are currently on Netflix. Ideally movies that are lesser well known that you feel are diamonds in the rough.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ke5yzu/movies_suggestions/"
    },
    {
        "id": "1kd9j3t",
        "author": "rushdisciple",
        "title": "The Four Seasons",
        "content": "Haven't seen a proper discussion thread about this show so I thought I would make one. \nI really liked this a lot, it took me an episode or 2 to get on its wavelength but I laughed my ass off pretty much the whole time, even though I had to watch some of it through my fingers. I couldn't really relate to any of the characters but with the humour and the chemistry between the cast/characters it didn't really matter. The fact that the episodes were 30 minutes or so helps, I'm not sure if it could've been 45-50 minutes each. I had no problem binging it within a day. Highly recommended.\n",
        "upvotes": 165,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1kd9j3t/the_four_seasons/"
    },
    {
        "id": "1kdxp3b",
        "author": "plopascual",
        "title": "Why does Netflix have 2 English language settings each with different set of shows?",
        "content": "I was watching the 2nd season of Apothecary Diaries in Netflix then suddenly it disappears completely from my account. Not only this but I also noticed that so many of my current shows just disappeared from Netflix altogether and even the search bar doesn't help. However, I switched to another profile in my own home and the show is suddenly back. Doing a bit of research, I found out that your language preferences affect which shows get put into your account. So I changed mine to include English (UK) and voila, it went back to how it was a week ago.\n\nMy question is why is there 2 English subtitles (one UK, one without tag) and why does is have to affect the list of shows when they are both clearly the same language? ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kdxp3b/why_does_netflix_have_2_english_language_settings/"
    },
    {
        "id": "1kdzhzi",
        "author": "Lost-Way-1702",
        "title": "Audio",
        "content": "Recently whenever i open an episode of a show, the default audio set is with description, which is really annoying, i tried to set it without audio description and it returns back whenever i open a new episode/show.\n\nHow to solve this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdzhzi/audio/"
    },
    {
        "id": "1ke2070",
        "author": "kepler180",
        "title": "2015 Netflix frozen pixels glitch",
        "content": "Does anyone remember 2013-2016 when Netflix had a big problem with frozen pixels? I remember even when you would rewind the show the pixels would still get frozen at the same spot. Obviously the devs fixed this but was there every an announcement about fixing the problem because it was chronic issue",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ke2070/2015_netflix_frozen_pixels_glitch/"
    },
    {
        "id": "1kdha5m",
        "author": "EldritchDWX",
        "title": "Help me find a TV show that was once on Netflix (probably cancelled).",
        "content": "I've been racking my brain and would love to watch it again. Of course, it was on Netflix. It was about a serial killer who had effectively retired and a cop who had been hunting the serial killer for some time (possibly retired also). The serial killer was somewhat of a local legend, I believe inspired by Gary Ridgeway (The Green River Killer). I believe the serial killer and the cop are neighbours.\n\nMost of the show involved general family drama and such, while our serial killer, let's call him \"Bob\" struggles to control his \"urges\" after being \"retired\" for some time. \n\nEventually, he gives in, and \"Bob\" commits further murders (I think). The first season ends when the cop, having been hunting \"Bob\" for decades, suddenly concludes that our guy, \"Bob\", his neighbour, is indeed the guy he's been looking for for some time. \n\nIn the final scene, our detective guy whispers in the serial killer's ear, \"I know\" or something like that. Which is basically where the finale ends.  \n\nI'm hoping there was a second conclusive season that I can watch. If not, I would love to watch that first season again. Thanks in advance!",
        "upvotes": 21,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1kdha5m/help_me_find_a_tv_show_that_was_once_on_netflix/"
    },
    {
        "id": "1kdk4u9",
        "author": "meomeo118",
        "title": "The Four Season",
        "content": "Have anyone watched this yet? I def thought it is some white lotus play off but the show is def a roller coaster. Real about marriages and have representation of all couples ( except for races lol ) . It is a nice reminder to see that marriage is hard. Gay or not, divorced or moved on. I personally wish Anne would have more scenes for her own self. It is also a beautiful representation of a group of friends that keep in touch years to years, in different season of lifes.\n\n",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kdk4u9/the_four_season/"
    },
    {
        "id": "1ke3dbw",
        "author": "lockdownsurvivor",
        "title": "The Four Seasons",
        "content": "What a piece of garbage.  The only thing good in it was Alan Alda, who has been a favourite of mine since his M\\*A\\*S\\*H days.\n\nTina Fey and Steve Carell were totally wasted talents, as was Coleman Domingo.\n\nI guess that's why no one is watching it.\n\nI wanted to like it, I really did.  But it doesn't have a single redeeming feature.\n\nSave your time and breath.",
        "upvotes": 0,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1ke3dbw/the_four_seasons/"
    },
    {
        "id": "1kdg4ld",
        "author": "thepurplethorn",
        "title": "Into the Fire: The lost daughter",
        "content": "I know i am late to the game, and this has probably discussed and posted so many times but I just watched it and I am not okay.\n\nI just wish this Brenda woman burns in hell where she belongs with her murderer … she is disguising, completely detached from reality .. i hate hate hate her \n\n\nedit: Can you please suggest something similar to watch? ",
        "upvotes": 15,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kdg4ld/into_the_fire_the_lost_daughter/"
    },
    {
        "id": "1kd6cdj",
        "author": "Visible_Economics_79",
        "title": "Night Agent",
        "content": "How does everyone feel about season 2 of the night agent? I thought season 1 was good but quit on season 2 after the 2nd episode. Maybe it’s me but I feel like Gabriel Basso is terrible in it. ",
        "upvotes": 59,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1kd6cdj/night_agent/"
    },
    {
        "id": "1kdlgsw",
        "author": "Hopeful-Bee-4030",
        "title": "Battle Camp",
        "content": "I just finished watching the game show Battle Camp on Netflix and I just wanted to come on here to read what people thought about the cast members (who did you like and dislike) and what you thought about the ending. The cast members really got on my nerves, expect Avori and Shubham (I really liked them and I wanted one of them to win). Also, I thought the ending was very anticlimactic. I think the show should have continued to have at least 2-3 players left in the end to battle it out. What did you think? ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kdlgsw/battle_camp/"
    },
    {
        "id": "1kdujc9",
        "author": "ahmedfigo0",
        "title": "Top New TV Shows to Watch in May 2025: Sci-Fi, Drama &amp; Thrillers",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdujc9/top_new_tv_shows_to_watch_in_may_2025_scifi_drama/"
    },
    {
        "id": "1kdrbjc",
        "author": "xgelic",
        "title": "shows missing all of a sudden",
        "content": "hii! usually i’d have way more shows in my continue watching (jojo, houseMD, paddington etc) and they’re all done! i can’t even search them up! what the helll??? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kdrbjc/shows_missing_all_of_a_sudden/"
    },
    {
        "id": "1kdqlew",
        "author": "eskajay",
        "title": "Cassandra",
        "content": "Im sorry,(not) but Juno is sooooo annoying. I know she’s just a kid, but she’s up there with one of the most annoying kids in a show for me. She irks me. It’s really giving baby lala ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kdqlew/cassandra/"
    },
    {
        "id": "1kdlbx5",
        "author": "Hopeful-Bee-4030",
        "title": "GOLD AND GREED",
        "content": "I just finished watching the documentary GOLD AND GREED (great documentary btw). I was surprised and caught off guard at the end when Justin revealed his very own treasure hunt. However, when watching the series, I did notice Justin adjusting the clock several times throughout his interviews. Does anyone have any information about this could possibly mean and if anyone else noticed any other clues hidden in the show? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kdlbx5/gold_and_greed/"
    },
    {
        "id": "1ke26dj",
        "author": "VosGezaus",
        "title": "Just watched adolescence few days ago. Anyone up for discussion?",
        "content": "I have also watched mind hunter, and comming from there, Adolescence was far less disturbing for me to watch atleast. I think directors did a really good job on making the psychological horror more accessible to general public.\n\nThe boy fking nailed it in third episode. Those bursts of uncontrollable anger, and how slowly his true personality was exfoliating, it was crazy good.\n\nNow here are some opinions I had.\n\nFirst: most online discussion seems distorted because how relavent the topic is today, and a lot of people came in and out without having an open mind. Don't get me wrong, there were depths and nuances which were discussed, but, I think people saw it more like a commentary than a psychological horror. I felt  it was both, but a lot of people viewed it only through lens of commentary.\n\nSecond: the motivation of murder, and this will help me explain my first point further. I read a lot of people calling it unrealistic, and I put some thought into this question, if the portrayal of murder was realistic or not.\n\nJamie was 13. I know he acted way more mature than his age, but dude, 13 is so young! While mind hunter showed how childhood trauma and past shapes a murderer, this is a literal childhood mistake we are talking about.  At that age child likely doesn't realise weight of murder. And this was also reflected upon in the last minutes of third episode, where Jamie was constantly denying of doing anything wrong, he likely didn't grasp the weight of his own actions even by then. He kept saying 'even though I should have' he didn't realise what taking someone's life actually meant. \n\nThird, his father. Even here I saw so many people blaming the father, while he himself said he tried his best. Yes he was flawed, but jamie's actions, in my opinion, was largely his own doing, or more like, doing of whatever he was consuming online. Yes his father had bursts of anger, but internal philosophy of father and son were just so different. His father never justified violence, like Jamie did. His father wasn't controlling in his anger, just aggresive, while Jamie was trying to be controlling with his bursts of anger. \n\nEven friendships, Jamie mostly acknowledged his father's male friends, while his father was clearly shown in 4th episode to interact well with both men and women. His entire lens of worldview had shifted so hard he started seeing his father for things he wasn't, even though how minor.\n\nAdolescence, to me, seemed to be a product of malleability of young minds, and how under right 'or extremely wrong' conditions they can be moulded in worst possible way. How social media, at such young age can so drastically shift someone's internal moral compass, and how due to lack of communication, between parents and child, there was no one to correct him(yeah his father did try his best, but come on, there were still plenty things he did wrong, even his mother).\n\nMost of us are mature enough to ignore toxic content, or at maximum feel disgusted by it, but there are literal children who are also watching it. Children who can't distinguish between right and wrong like we can. The series did a fantastic job at highlighting how vulnerable children are to online content.\n\nThat was my opinion.",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ke26dj/just_watched_adolescence_few_days_ago_anyone_up/"
    },
    {
        "id": "1kdn0k1",
        "author": "NotYourFlowers",
        "title": "Gypsy - I need answers",
        "content": "I decided to rewatch this show and I'm mad all over again at the fact that it got canceled after just 1 season and ending on a massive cliff hanger. I'm dying to know what s2 would've been.\n\nDoes anyone know of a good fanfic or something I can read to scratch this itch???\n\nI know this show is so old and relatively forgotten. But I just need something to fill this void lol.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kdn0k1/gypsy_i_need_answers/"
    }
]