[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r17xat",
        "author": "shanthor55",
        "title": "Ads during a manual pause shouldn’t happen.",
        "content": "I’m fine with ad breaks in watching my movie or show so that they can plug whatever. It has unfortunately become expected over the years. \n\nWhat I’m not fine with is an ad taking over the entire screen when the purpose of my pausing was to read some scribble, take time to process subtitles, or look over some other detail that is integral to the plot of a complicated story. Ex: The entire reason I paused my viewing was to look more intently at something written in a language I struggle to understand that overlaid an intricate map, but now it’s taken over by Glenn Powell. ",
        "upvotes": 54,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1r17xat/ads_during_a_manual_pause_shouldnt_happen/"
    },
    {
        "id": "1r1jr7l",
        "author": "Raccoon1122",
        "title": "“Hang the DJ” is a masterpiece",
        "content": "I posted this earlier today on the r/blackmirror sub just wanted to see what more people thought :)\n\nI consider myself to be someone who loves love more than almost anything so maybe this is just me but “Hang the DJ” (S4, E4) of black mirror is one of the most beautiful pieces of cinema I’ve ever watched.\n\nI’ve probably rewatched it about 100 times and it brings me to tears almost EVERY SINGLE TIME.\n\n(It also helps that Georgina Campbell is an absolutely GORGEOUS woman and they are both incredible actors)\n\nEven the scene where they hold hands for the first time in like the first 10 minutes, just an absolutely beautiful scene and it hits me so hard.\n\nMan I love it so much. Gotta do another rewatch tonight after writing this! \n\n(Side question: anyone got any recs to anything similar?)",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r1jr7l/hang_the_dj_is_a_masterpiece/"
    },
    {
        "id": "1r1k12l",
        "author": "lunds11",
        "title": "ER Added to Netflix Canada - Worth Watching?",
        "content": "ER just dropped on Netflix Canada. Never seen an episode before in my life and 15 seasons seems daunting. Any fans of the show out there able to sell me on it? Maybe there’s a good breaking point where you don’t watch all the seasons? Or maybe it’s good enough for the full haul. Thanks!",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r1k12l/er_added_to_netflix_canada_worth_watching/"
    },
    {
        "id": "1r0r8wn",
        "author": "twomilliontwo",
        "title": "Lincoln Lawyer",
        "content": "Netflix, you cannot make enough episodes of this show. This is my favorite show on streaming currently. Whether you have read the books or not, the show does not disappoint the viewer. We’ve got a little 90s vibe with a pacing and a current vibe with the casting. And I just can’t say enough about my favorite Netflix show. \n\nGive us more seasons! Maybe longer seasons how about a longer season and you could take the episodes down a couple of minutes, but give us 20 episodes!\n\nThank you in advance. \n\n ",
        "upvotes": 246,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1r0r8wn/lincoln_lawyer/"
    },
    {
        "id": "1r1hlwg",
        "author": "mgepark",
        "title": "Message From The King",
        "content": "Watched it for the third time last night. It gets better every time. What a shame that we lost Chadwick Boseman at such an early age. What a great actor he is. Gosh! Amazing movie. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1hlwg/message_from_the_king/"
    },
    {
        "id": "1r16bxf",
        "author": "Master_Addendum3759",
        "title": "Top 100 highest rated films on Netflix right now, ranked by aggregating 6 different sources",
        "content": "Built a thing that pulls ratings from IMDb, RT, Metacritic, Letterboxd, AlloCiné, and Douban and blends them into a single weighted score. The algorithm is weighted, with critics &gt; cinephiles &gt; mainstream. But you can change this to be all equaled or preferring mainstream sources.\n\nI ran it against every film on Netflix. Here's the top 10:\n\n1. The Godfather (1972) - Francis Ford Coppola: 94.7\n2. The Godfather Part II (1974) - Francis Ford Coppola: 93.8\n3. Grave of the Fireflies (1988) - Isao Takahata: 90.5\n4. Pulp Fiction (1994) - Quentin Tarantino: 90.4\n5. Spirited Away (2001) - Hayao Miyazaki: 89.7\n6. The Dark Knight (2008) - Christopher Nolan: 88.6\n7. No Country for Old Men (2007) - Joel Coen: 88.4\n8. Spider-Man: Into the Spider-Verse (2018) - Bob Persichetti: 87.1\n9. My Neighbor Totoro (1988) - Hayao Miyazaki: 87.0\n10. Whiplash (2014) - Damien Chazelle: 86.9\n\nFull top 100 here: [https://moviesranking.com/top?provider=8&amp;limit=100](https://moviesranking.com/top?provider=8&amp;limit=100)\n\nWhat do you guys think?",
        "upvotes": 19,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r16bxf/top_100_highest_rated_films_on_netflix_right_now/"
    },
    {
        "id": "1r1kpq5",
        "author": "flexsf",
        "title": "Subtitles gone wild",
        "content": "All of a sudden, my subtitles cannot be changed. It automatically defaults to the black box around the words. And instead of being centered in the middle, it bounces around depending on who’s talking.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r1kpq5/subtitles_gone_wild/"
    },
    {
        "id": "1r10ki1",
        "author": "rulanmooge",
        "title": "Netflix added an extra user slot suddenly?!?",
        "content": "Beware!!! \n\nYesterday I get a message when we opened Netflix as usual....on our Roku streaming platform that we now have a slot for another user outside of household.  We didn't ask for this.\n\nI signed onto my account and sure enough....we are now going to be charged an extra $8.99 a month for the ability to add someone not in our household.  I did NOT ask for this...so I first changed my password. Changed my email.  Signed out of all devices...we only have two.   Signed out of Netflix....and back in again and **canceled the extra user slot**.\n\nIs this something that Netflix is (sneakily) adding...or could someone have hacked my account?",
        "upvotes": 18,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1r10ki1/netflix_added_an_extra_user_slot_suddenly/"
    },
    {
        "id": "1r0o11y",
        "author": "Little_SmallBlackDog",
        "title": "Catherine O'Hara fan?",
        "content": "Check out 'Best in Show'. It's a funny mockumentary about Dog Show people that is oddly accurate. \n\nIt's dry satire so it may not be everyone's cup of tea. ",
        "upvotes": 124,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1r0o11y/catherine_ohara_fan/"
    },
    {
        "id": "1r1khrb",
        "author": "Large-Cardiologist54",
        "title": "What’s the point of my list if I never watch anything on it?",
        "content": "I have like 40 things saved on my list, and I’m always trying to convince myself “this is the night I’ll finally watch one of them.”\n\nThen I still somehow, I’ll scroll every night, read descriptions, watch trailers, always second guess everything, and end up watching nothing... By the time I decide I’m already too tired. Why is it so hard to just press play?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r1khrb/whats_the_point_of_my_list_if_i_never_watch/"
    },
    {
        "id": "1r1kboi",
        "author": "laureidi",
        "title": "Star Search giving space for being super preachy gives me the ick",
        "content": "So I am a little late to it, but just now watched the first two episodes of Star Search. I’m not very invested in contemporary music so I didn’t know who Jelly Roll was. I thought he was charming through watching this, noticed a moment when he was talking about the Christian god in the first episode but it was brief so I ignored it. Now at the end of the second episode, I’m realizing I’ll be removing this show from my list. Suddenly the whole thing became a televangelist prime time, which, when we’ve literally mentioned several times already that this show is live for the whole world to see, to me became very tone deaf. I don’t care what kind of religion you practice, as long as you don’t shove it in my face and especially if you’re gonna try to convert me I’m hella out. I just came here to watch some sparkly talent entertainment compete with each other I didn’t ask for missionaries wtf ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r1kboi/star_search_giving_space_for_being_super_preachy/"
    },
    {
        "id": "1r1hr6i",
        "author": "mgepark",
        "title": "Homefront Kudos",
        "content": "Wow, this super amazing movie from 2013 with the legendary Jason Statham makes it to number 3 (13 years later) in the top 10 and well deserved. I’ve now seen it 3X. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1hr6i/homefront_kudos/"
    },
    {
        "id": "1r1a01y",
        "author": "arm2424",
        "title": "Parisian Agency Season 6",
        "content": "When is season 6 supposed to release on Netflix US? It’s been out in other markets for a while but I can’t find any info. They posted on social it would release to Netflix Feb 5, but I haven’t seen it yet!\n\nSuch a refreshing take on a real estate show compared to shows like selling sunset, love the Kretz fam and excited to watch the newest season!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r1a01y/parisian_agency_season_6/"
    },
    {
        "id": "1r1chw9",
        "author": "sourlemon9595",
        "title": "Critical: Between Life and Death",
        "content": "Disclaimer: spoilers and references to surgical procedures \n\nI’m about halfway through the series, and wow. I’ve been shaking my head throughout most of it because I CANNOT EVEN FATHOM the level of skill, stress management and dedication of these Doctors/surgeons. You’re talking &gt;!peeling the face back and re-arranging fragments of bone to ‘fit’ back together, and weaving veins into a foot?!!&lt; \n\nI already had a deep appreciation of the NHS and experience with emergency surgery myself, but this just renewed it to another level. Following those stories, the families… and then the Drs’ absolute focus and coordination. So much respect. \n\nHaven’t finished it yet but couldn’t wait to post about it. For those who have seen it, what did you think?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1chw9/critical_between_life_and_death/"
    },
    {
        "id": "1r0u0oo",
        "author": "messengers1",
        "title": "Kelly Hu Joins Eric Bana-Led Netflix Series ‘Untamed’",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r0u0oo/kelly_hu_joins_eric_banaled_netflix_series_untamed/"
    },
    {
        "id": "1r1ayie",
        "author": "pjand08",
        "title": "Movies or series like perks of being a wallflower",
        "content": "Suggest me a movie or series like perks of being a wallflower like it should have a teen or young adult love story with the lead having trauma or some struggle in his life.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r1ayie/movies_or_series_like_perks_of_being_a_wallflower/"
    },
    {
        "id": "1r1anpi",
        "author": "AltruisticAide9776",
        "title": "Has no one seen the show \"eternally confused and eager for love \" ?",
        "content": "Its so cozy , funny, quirky , it just has a certain vibe to it that I ve not seen a lot of shows have. Such a disappointment it did not get renewed but the Indian show that did go on for a quite a few seasons was little things which I found a bit boring . \n\nEternally confused was just so much yet it didn't get renewed, ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1anpi/has_no_one_seen_the_show_eternally_confused_and/"
    },
    {
        "id": "1r0zorb",
        "author": "femalevideographer",
        "title": "East of Eden?",
        "content": "Does anyone have scoop on the Florence Pugh/Zoe Kazan East of Eden adaptation? It was said to be coming to Netflix early this year, but there’s been no news, no trailers, and no release date. Hoping that all is well, really looking forward to this miniseries! ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r0zorb/east_of_eden/"
    },
    {
        "id": "1r0gvuq",
        "author": "Hot-Signature2387",
        "title": "Emily in Paris",
        "content": "\nTbh, the show started really well. I loved the characters and the storyline during the first few seasons. Then it completely lost the plot. The characters lost their personalities and became very poorly written.\n\nNow the entire show just revolves around  dumb ahh characters making the worst decisions imaginable. None of them can keep it in their pants. They bang, regret it, get back together, break up again, then immediately start dating someone new. Rinse and repeat.\n\nAnd don’t even get me started on the way they run this marketing firm. It's crazyy. All they do is make reckless decisions, ignore basic logic and somehow every campaign is a massive success anyway. No planning, no strategy, no consequences. Just Emily \"girlbossing\" her way through it. I know it’s all fictional, but come on 😭 a little bit of logic would be nice. ",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1r0gvuq/emily_in_paris/"
    },
    {
        "id": "1r0ws63",
        "author": "hanandmeow",
        "title": "AI in documentary",
        "content": "The Investigation of Lucy Letby includes 'Digitally Anonymised’ parents and acquaintances. It’s super weird that they made AI photographs of “Maisie” and Lucy - why did they need to do this? The characteristics aren’t quite right and it’s giving uncanny valley vibes. \n\nWhy have they done this? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r0ws63/ai_in_documentary/"
    },
    {
        "id": "1r1fd43",
        "author": "TurtleT84",
        "title": "Was gonna post this on the cobra kai subreddit but not enough karma",
        "content": "Who else things that when a cobra kai spinoff comes out hopes we got some of the orginal cast im not talking about just like a sequel with the whole main cast but like someone like chozen would be cool to see and just having some of the orginal people would be great and i doubt most of them are busy since the actor for daniel obviously did karate kid legends so yeah i just wanted to talk about that cause im 6 episodes away from completing the show NO SPOILERS",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r1fd43/was_gonna_post_this_on_the_cobra_kai_subreddit/"
    },
    {
        "id": "1r06beg",
        "author": "Almjdh",
        "title": "Take-Two hails Netflix as Red Dead Redemption nears 10 million installs on mobile.",
        "content": "According to Sensor Tower via The Game Business, Red Dead Redemption has been downloaded over 10 million times on mobile since launch. Almost all of that number is from the Netflix-supported version.",
        "upvotes": 66,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r06beg/taketwo_hails_netflix_as_red_dead_redemption/"
    },
    {
        "id": "1r1emjh",
        "author": "Longjumping_Land_977",
        "title": "What Lucy Letby is really like as a person, in the words of five people who know her",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1emjh/what_lucy_letby_is_really_like_as_a_person_in_the/"
    },
    {
        "id": "1r0n6j4",
        "author": "Elyx_117",
        "title": "Mercy For None is a great watch",
        "content": "Finished it in two sittings over the weekend and am now rewatching again. The Korean original adds to the loooooooong list of revenge action thrillers coming out of the country on both big screen and small. This one again ticks all the right boxes - a very strong cast with solid acting across the board, excellent fight scenes, and a predictable but well told underworld tragedy. \n\nThe genre is an acquired taste - caution: all adult male cast, blood-splattering violence, zero humor - but if you're a fan, this one is very much worth your time. Only seven episodes anyway. I hope there's a prequel tho.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r0n6j4/mercy_for_none_is_a_great_watch/"
    },
    {
        "id": "1r09ea1",
        "author": "Krunkledunker",
        "title": "Sandokan! Sandokan!",
        "content": "This might be a hot take, but Sandokan was awesome. I can see it receiving a lot of hate from viewers who anticipate something other than what it is, but taken with a grain of salt it’s pure fun.\n\nIt’s vibe seems to draw from Bollywood and American 80’s action, telenovela-like drama, and at parts seems to show some sense of self awareness. There is some good acting and actors that carry the story, as well as some not very good acting and actors that actually (whether intentionally or not) keep it light and silly, but I didn’t actually see that as a turnoff.\n\nIf I expected Black Sails I’d probably hate it, but my wife and I found ourselves bingeing it and laughing with it (and sometimes at it which was just as enjoyable). The story wasn’t deep but kept us watching all the same, would definitely watch a second season.\n\nDid anyone else get into it?",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r09ea1/sandokan_sandokan/"
    },
    {
        "id": "1r0p3zf",
        "author": "FoldMajestic3324",
        "title": "Subtitles: Is it worth submitting error reports to Netflix?",
        "content": "I'm watching \"The Closer\" and finding that the English subtitles are riddled with errors, way worse than any other show I've seen. It's mainly typos, where it looks like a bad copy-paste from the previous screen, with extra characters attached to the end of words, though occasionally they get words wrong.\n\nI started to hit the flag button to report errors every time I found one, but I found that I'm submitting multiple reports per episode.\n\nDoes anybody here know if someone at Netflix actually reads these reports and makes corrections to subtitles? If so, it's worth my time to keep doing it. But if they're just being ignored or going into the void and won't result in a better viewing experience for others, I'll just ignore all the errors and not bother reporting them.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r0p3zf/subtitles_is_it_worth_submitting_error_reports_to/"
    },
    {
        "id": "1r0ggwx",
        "author": "TheDylorean",
        "title": "Samuel, a brief review",
        "content": "One could say \"it's easy to make a show with a 'sketch' animation approach\". Another could say \"It's been done\". Perhaps both views can be correct, but it is safe to say the medium has found its intended audience in 'Samuel', a light hearted, and uniquely rich journey through the eyes of a young boy who uses sketch animation to bring life to the various stories which compromise his diary. \n\nSamuel demonstrates a micro series type of storytelling, making short entries in a diary each a distinct episode, while tying them together through the common themes of growing up, falling in love, and socializing as a preteen. \n\nThe messages of each story are often as relatable as they are personal, rich with flaws of life as a child growing up at the turn of the century. The additional wrinkle of 'Samuel' taking place in the early 00's makes it as much a fresh experience for younger audiences, as it is a look back for older ones. \n\n'Samuel' may perform well as its own one season micro series, or it may continue to grow as the titular character does. In either case, such a vibrant, heartfelt experience told in such a succinct way is a welcome addition to the world of 'coming of age' media. It is a beautiful story that will leave one not only looking back, but looking forward.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r0ggwx/samuel_a_brief_review/"
    },
    {
        "id": "1r0m2ol",
        "author": "lilcee504-",
        "title": "Vikings",
        "content": "Can anyone tell me why the show Vikings is missing huge chunks of the show out of the episodes on Netflix? It will jump from one scene to the next without any context making it look like it was not only poorly written but poorly filmed. I watched this show from start to finish when it was made and decided to go back and re-watch it, but it's all effed up. Huge pieces are missing. Going from one episode to the next. It makes no sense and is a travesty considering the importance of this show. What the hell are they doing? ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1r0m2ol/vikings/"
    }
]