[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i2s8o0",
        "author": "CautionCurb",
        "title": "Black bars showing on side even though tv is correct size.",
        "content": "Tried finding something in the settings to adjust aspect ratio but couldn't find anything. Does anyone know how to get rid of the black bars on the side? I'm literally using a tv that would fit the exact size of the show.",
        "upvotes": 640,
        "comments": 177,
        "media": null,
        "permalink": "/r/netflix/comments/1i2s8o0/black_bars_showing_on_side_even_though_tv_is/"
    },
    {
        "id": "1i2mvd3",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game Season 2's Thanos Star Breaks His Silence On Casting Backlash In First Major Interview",
        "content": "",
        "upvotes": 562,
        "comments": 122,
        "media": null,
        "permalink": "/r/netflix/comments/1i2mvd3/squid_game_season_2s_thanos_star_breaks_his/"
    },
    {
        "id": "1i2negv",
        "author": "peoplemagazine",
        "title": "'Ms. Rachel' to Launch Worldwide on Netflix, with More Episodes Later This Year",
        "content": "",
        "upvotes": 128,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i2negv/ms_rachel_to_launch_worldwide_on_netflix_with/"
    },
    {
        "id": "1i2sabw",
        "author": "misana123",
        "title": "'You' Season 5: April 24 Release Date Set on Netflix for Final Episodes",
        "content": "",
        "upvotes": 59,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1i2sabw/you_season_5_april_24_release_date_set_on_netflix/"
    },
    {
        "id": "1i2qzr0",
        "author": "Brilliant_Leg_4950",
        "title": "Netflix hs been recomeding DEXTER for me and now i see why.",
        "content": "I have been watching shows like house,breaking bad and the watcher. Dexter is like all of those shows mashed up together and now it is my favourite show. I totally recomed it!",
        "upvotes": 46,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1i2qzr0/netflix_hs_been_recomeding_dexter_for_me_and_now/"
    },
    {
        "id": "1i2ah9e",
        "author": "SignatureLabel",
        "title": "It is criminal that Mindhunter did not get a 3rd season.",
        "content": "Absolutely criminal. I’m aware of the cost of making the show and the low viewership at the beginning but now there is no reason not to make one season and finish up what I consider to be Netflix’s best show by a long shot.",
        "upvotes": 639,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1i2ah9e/it_is_criminal_that_mindhunter_did_not_get_a_3rd/"
    },
    {
        "id": "1i2o4d2",
        "author": "odd_coin",
        "title": "I just finished watching XO, kitty season 2",
        "content": "As mentioned in the title, I just finished watching it, and I’d say it was worth the wait.kind of. If you haven’t seen the series yet I suggest skipping this  to avoid spoilers\n\nThat said, I’m a bit disappointed. This season focused heavily on homosexual relationships. I’m not saying that’s bad, but most of us want to see the main character’s love story, not a side character creating drama in everyone else’s love lives. The story was supposed to center around Kitty discovering more about her mom, which was why she went to KISS in the first place\n\nOn top of that, making Kitty bisexual felt like a misstep. It shifted the focus away from the original premise, leading to unnecessary fights and breakups that dominated the screen time. If you’ve seen the show, you’ll notice that more than half of the relationships are homosexual. It felt like the series lost sight of Kitty’s journey and the charm of the original story\n\nWhat I did enjoy, however, was Kitty finding new love. I genuinely thought she’d end up with the same person(Dae) from season 1, so that twist was refreshing. And seeing Margot and Peter from To All the Boys was so relieving(?) honestly, that was the main reason I watched this season\n\nOverall, I feel like the story doesn’t completely wrap up, leaving me hoping for another season to tie up loose ends\n\n",
        "upvotes": 30,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1i2o4d2/i_just_finished_watching_xo_kitty_season_2/"
    },
    {
        "id": "1i293jx",
        "author": "AdmirableOx",
        "title": "American Primeval feels like watching \"The Revenant\"",
        "content": "Randomly stumbled upon this show and wow. This had no bussiness being THAT GOOD. The Revenant is my all time favorite movie and the way this is shot instantly reminds me of the movie. \n\n10/10 for me!! Finally a great show I really enjoy watching!",
        "upvotes": 254,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1i293jx/american_primeval_feels_like_watching_the_revenant/"
    },
    {
        "id": "1i2r7ma",
        "author": "LauraEats",
        "title": "Surviving Black Hawk Down premieres February 10 - The real story that inspired Ridley Scott’s 'Black Hawk Down,' as told by those who survived. \n\n",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i2r7ma/surviving_black_hawk_down_premieres_february_10/"
    },
    {
        "id": "1i2k7uh",
        "author": "Pogrebnik",
        "title": "'Fear Street: Prom Queen' Gets an \"R\" Rating - Coming To Netflix This Year",
        "content": "",
        "upvotes": 36,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2k7uh/fear_street_prom_queen_gets_an_r_rating_coming_to/"
    },
    {
        "id": "1i2sy5r",
        "author": "SoftPois0n",
        "title": "YOU: Season 5 | Date Announcement | Show Countdown Begins | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2sy5r/you_season_5_date_announcement_show_countdown/"
    },
    {
        "id": "1i34749",
        "author": "Adventurous_Band2417",
        "title": "Gen Z and nostalgic shows/movies",
        "content": "Hi everyone! I’m conducting academic research on the intersection of Gen Z and nostalgic viewing patterns on U.S. streaming platforms. If you watch older content on streaming platforms and identify as Gen Z, I’d appreciate it if you fill out the survey!! Thank you in advance 😊\n\n[https://qualtricsxmxxlc44m2h.qualtrics.com/jfe/form/SV\\_5jOkXdcWHvjgEdw](https://qualtricsxmxxlc44m2h.qualtrics.com/jfe/form/SV_5jOkXdcWHvjgEdw)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i34749/gen_z_and_nostalgic_showsmovies/"
    },
    {
        "id": "1i2q604",
        "author": "isthisagoodusername9",
        "title": "For those that can't watch Netflix in 4K and Dolby Vision in their Windows PCs",
        "content": "This is an informative post and update for those that watch Netflix on their Windows PCs. I'm writing this update since I've saw there were few other people experiencing this.\nPrecisely two weeks ago I discovered, out of the blue, that I wasn't able to watch Netflix in 4K/Dolby Vision anymore but only in 1080p SDR at max. After a lot of tampering and reinstalling drivers, apps and extensions (DV would always work outside of netflix) I've finally found the culprit: the current versions of Microsoft Edge.\nStrangely enough, DV/4K streaming are broken and don't seem to work in my system when using the normal version of Edge or the Netflix app (which is not a standalone app anymore but a wrapped version of the Netflix page in the browser).\n\n*Using Edge Dev (which is a stable development version) everything works as intended.* \n\nSo for the time being, I'd suggest to download that version and watch Netflix there. The Netflix app can only use the normal one but it's a workaround in the meantime that it will be updated. \n\nI hope this post of mine can help someone, ofc I dunno if my case can be applied to anyone but it's something at least, especially considering that Netflix/Microsoft customer supports were not useful to say the least. Cheers",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i2q604/for_those_that_cant_watch_netflix_in_4k_and_dolby/"
    },
    {
        "id": "1i333gp",
        "author": "luka_147",
        "title": " How are my prices for standard and premium plan the same? ",
        "content": "https://preview.redd.it/fa6ewykx1gde1.png?width=946&amp;format=png&amp;auto=webp&amp;s=aab3bb3068570eb9f9ad66d61d9a418d10479e69\n\nHow are my prices for standard and premium plan the same?  \nUsually the premium is 12.99 euros, but I've been paying 9.99 for premium last 6months",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i333gp/how_are_my_prices_for_standard_and_premium_plan/"
    },
    {
        "id": "1i2j7qr",
        "author": "Robemilak",
        "title": "'Bloodhounds' Season 2 Is Coming: Woo Do-hwan and Lee Sang-yi Are Back, Jung Ji-hoon Joins the Cast",
        "content": "",
        "upvotes": 20,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i2j7qr/bloodhounds_season_2_is_coming_woo_dohwan_and_lee/"
    },
    {
        "id": "1i2mt2h",
        "author": "sensesalt",
        "title": "HERE starring Robin Wright and Tom Hanks arrives on Netflix US on January 30th",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i2mt2h/here_starring_robin_wright_and_tom_hanks_arrives/"
    },
    {
        "id": "1i266c2",
        "author": "DavidC_is_me",
        "title": "The fires in the Netflix \"Fireplace For Your Home\" footage are awful.",
        "content": "They're so badly built only half the logs burn properly and it is the most frustrating thing because you want to rearrange it or at least take a poker to it.\n\nI mean the whole point of the whole thing is just a fire. One job. Build a decent fucking fire.\n\nBut nooooooo. Build a shit fire and none of the crew ever notice that it's a shit fire. Assuming any of them stand aloft and have opposable thumbs, any one of them should be able to build a better fire than that.",
        "upvotes": 140,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i266c2/the_fires_in_the_netflix_fireplace_for_your_home/"
    },
    {
        "id": "1i2m3z6",
        "author": "Firm_Pause_4542",
        "title": "XO Kitty Season 2, this just keeps getting worse ",
        "content": "Is it just me or like every character in XO kitty S2 is just so weird, no character development and to be honest very tedius to watch... The only reason I kept watching cuz I just wanted to know how they even end it but alas I failed, it's just bad...like the plot just doesn't make any more sense and they kind of just keep adding more weak plot twists that do not make any difference. Also what is happening in that school?? could they have not shown a few classes atleast happening like just for a second or two, the school in this series is more useless than the school in the Riverdale series and we all know that was just bad. I just wanna know am I the only one who feels this way and also those who watched the season 2 completely, can you guys just lemme know what happens in the end????? ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i2m3z6/xo_kitty_season_2_this_just_keeps_getting_worse/"
    },
    {
        "id": "1i3099i",
        "author": "StephenHunterUK",
        "title": "\"Missing You\" reaches #19 in the UK-wide viewing charts for its opening week",
        "content": "[https://www.barb.co.uk/viewing-data/most-viewed-programmes/](https://www.barb.co.uk/viewing-data/most-viewed-programmes/)\n\n\"Missing Programme\" would be the 4 January edition of *The Masked Singer*. Clearly a fault in their system.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3099i/missing_you_reaches_19_in_the_ukwide_viewing/"
    },
    {
        "id": "1i2gder",
        "author": "RiverLongjumping3823",
        "title": "Lucas neff in American primeval ",
        "content": "Does anyone else appreciate Lucas neff in the show? Watched this man in raising hope and now he’s killing it in American primeval as the captain. He really did a good job honestly didnt expect that from him. But I’m happy he got the role he nailed it on the dot. ",
        "upvotes": 27,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i2gder/lucas_neff_in_american_primeval/"
    },
    {
        "id": "1i27a50",
        "author": "footballersabroad",
        "title": "Netflix viewership overtakes BBC One for first time",
        "content": "",
        "upvotes": 81,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1i27a50/netflix_viewership_overtakes_bbc_one_for_first/"
    },
    {
        "id": "1i2q6jq",
        "author": "lukaboi",
        "title": "Why does my pc screen turn black when watching netflix?",
        "content": "I have no Idea why this happens my pc screen turns black on and off when watching netflix, no matter what browser I use or if I use the netflix pc app. This doesn’t happen with any other website or app. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i2q6jq/why_does_my_pc_screen_turn_black_when_watching/"
    },
    {
        "id": "1i1t0t8",
        "author": "Whobitmyname",
        "title": "‘Squid Game 2’ Becomes Netflix’s Third Most-Watched Season Ever, After ‘Squid Game 1’ and ‘Wednesday’",
        "content": "",
        "upvotes": 380,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1i1t0t8/squid_game_2_becomes_netflixs_third_mostwatched/"
    },
    {
        "id": "1i2jalu",
        "author": "Robemilak",
        "title": "The Night Agent returns next thursday. Gabriel Basso recaps Season 1 to help you get ready.",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2jalu/the_night_agent_returns_next_thursday_gabriel/"
    },
    {
        "id": "1i32lvm",
        "author": "Exxenmann",
        "title": "Netflix Original Korean series \"60 Days: Designated Survivor\" with Nazi flag for Germany ",
        "content": "https://preview.redd.it/bxuwmfnsxfde1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=6893017e7593aa7e7da3b196f910c325c3730d03\n\nHow can this happen in a modern high budget production like this?  \nIs this really an honest mistake?\n\nFor Germans this is a really bad mistake - almost an insult :D\n\nEDIT1:  \nAh I just noticed the \"AXIS\" label.  \nStill this scene has no relation to old world war powers whatsoever.  \nWhy blend that in like this? :D",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i32lvm/netflix_original_korean_series_60_days_designated/"
    },
    {
        "id": "1i2m2ot",
        "author": "Michigan-Guy-2727",
        "title": "Some episodes 720p while others are 1080p?",
        "content": "PS5 Netflix app, and Chrome/Edge on PC\n\nI've been re-watching The Walking Dead and I've noticed some episodes are 720p but others are 1080p. Is there a reason for this? I did try watching a few shows on Hulu as well and they are all 1080p there, any idea on what's going on? Thanks guys.\n\nEdit: Season 6 Episode 7 of The Walking Dead for example is only playing in 720p, but Season 6 Episode 5 and Episode 6 is playing in 1080p. I have tried refreshing the app in the settings, and pretty much every basic troubleshooting solution you can think of.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i2m2ot/some_episodes_720p_while_others_are_1080p/"
    },
    {
        "id": "1i1jxms",
        "author": "Temporary-Spell3176",
        "title": "American Primeval is amazing, give it a try.",
        "content": "If you’re into gritty, no holds barred Wild West stories, this is it. Set in 1857, it throws you right into the chaos of frontier life, no sugarcoating, just raw survival. The landscapes are insane, the action hits hard (not just shootouts, but brutal hand-to-hand stuff), and the story actually moves.\n\nIt’s not all talky drama, but when there’s dialogue, it matters. The main characters are solid. Isaac Reed is a total mystery, and the tension between settlers, Native tribes, and religious groups feels so real. It also ties in actual historical events, which makes it feel even more grounded.\n\nNot gonna lie, it’s dark and violent, so don’t expect any warm, fuzzy cowboy vibes. It’s like if Yellowstone and The Revenant had a gritty baby. Definitely worth the watch if you’re into intense Westerns or just want a break from the usual predictable shows. \n\n",
        "upvotes": 565,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/1i1jxms/american_primeval_is_amazing_give_it_a_try/"
    },
    {
        "id": "1i2i37u",
        "author": "Little-Air2931",
        "title": "Recommendations ",
        "content": "Hey so it's quite a while that i have binge cdrama as i was studying hard for my exams but i want to now watch them again.\nI am specifically looking for some of these similar drama if you guys have any recommendations please put forward - \nCdrama drama (historical) \nThe romance of rose and tiger \nAutumn balled \nNovoland: pearl eclipse \nBack from the brick\nA female student in the imperial court \n\n(Modern) \nPut your head on my shoulder \nThe brightest star in the night sky \nGo ahead \nLove o2o \nMeteor garden \nThe love you gave me \nMy girlfriend is an alien \nHidden love \nWhen I fly towards you \n\nKdramas(limited to these only) \nThe liberation notes \nWelcome to slamdri \nA moment of 18 \nSummer strike \nWeak Hero class 1 \nTomorrow \nWeight lifting fairy \nStrong woman \nW \nThe flower of evil\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i2i37u/recommendations/"
    },
    {
        "id": "1i2r2ow",
        "author": "Healthy_Challenge_34",
        "title": "Leaving Shows",
        "content": "I need to understand why Mr Queen is leaving Netflix. The only reason I actually pay for Netflix is so I can rewatch that specific show 😂😂.\n\nI’m not okay",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i2r2ow/leaving_shows/"
    },
    {
        "id": "1i2ulqm",
        "author": "Cloud_Kicker049",
        "title": "How to bypass account sharing block?",
        "content": "I'm not sure if this will work for everyone but I was able to watch a downloaded series (Castlevania Nocturne season 2) on my brother's account.\n\nI have a profile created before the ban, if I try to watch on my home wifi it blocks me and asks to request a one time code since it thinks I am traveling.\n\nOn my phone however using mobile data, I'm able to login, browse shows and download for later.\n\nThen I turn on airplane mode and I'm able to watch the show.\n\nYes I know it's extra steps and might be troublesome if you're out of storage. But it beats having to keep asking my brother for the OTP everytime I want to watch a show.\n\nThis work for anyone else?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i2ulqm/how_to_bypass_account_sharing_block/"
    }
]