[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 698,
        "comments": 5112,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nu9kbz",
        "author": "Tr0jan___",
        "title": "Ms. Rachel announced as the new global ambassador for PCRF (Palestine Children's Relief Fund)",
        "content": "",
        "upvotes": 93,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu9kbz/ms_rachel_announced_as_the_new_global_ambassador/"
    },
    {
        "id": "1nuabrk",
        "author": "Sweaty-Toe-6211",
        "title": "'THE WITCHER' Season 4 reportedly cost over $25M per episode, making it $221M overall - The total budget for ‘THE WITCHER’ series has now reached an estimated $720M",
        "content": "",
        "upvotes": 66,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1nuabrk/the_witcher_season_4_reportedly_cost_over_25m_per/"
    },
    {
        "id": "1nu5lno",
        "author": "Original2021",
        "title": "Toni Collette totally carried the Wayward series",
        "content": "This has to be one of the oddest shows I’ve ever seen. The storyline had potential but the bad acting (aside from one of two performances) and unrealistic storyline was terrible. There was some mention about some of the kids jointing government agencies but they all lived in the town. Like huh??? The only saving grace was Toni Collette’s performance. She’s the only reason I watched until the end. I hope she gets an Emmy nomination for having to make something out of a Nonsensical script. ",
        "upvotes": 96,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nu5lno/toni_collette_totally_carried_the_wayward_series/"
    },
    {
        "id": "1nu8did",
        "author": "Sea-Opposite3920",
        "title": "Why does everybody hate Wayward",
        "content": "It completely gripped me for 7 hours. I mean sure its unrealistic and there were plot holes, but like it's fiction. The acting was great - I thought - and the emotional abuse which lead to character developments felt real. Not everyones cup of tea I suppose. ",
        "upvotes": 25,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8did/why_does_everybody_hate_wayward/"
    },
    {
        "id": "1ntkjg0",
        "author": "jerkoff1610",
        "title": "An actual family member reveals six things Netflix’s House of Guinness gets wrong in the show",
        "content": "",
        "upvotes": 217,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1ntkjg0/an_actual_family_member_reveals_six_things/"
    },
    {
        "id": "1nuh62m",
        "author": "Anteater_Able",
        "title": "Duffer Brothers on Netflix Exit, Stranger Things Future",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nuh62m/duffer_brothers_on_netflix_exit_stranger_things/"
    },
    {
        "id": "1nu8e71",
        "author": "LCarbonus",
        "title": "Alice in Borderland... Season 3?!",
        "content": "Is it just me or does Alice in Borderland closes per-fec-tly in season 2? Has anyone read the manga? Does it have more there? Because this feels like it's just them trying to milk the cow a bit more. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8e71/alice_in_borderland_season_3/"
    },
    {
        "id": "1nufmuv",
        "author": "Practical-Finger-613",
        "title": "can u guys help me",
        "content": "so I bought a netflix subscription and I did rhe payment and everything the money went through but netflix is showing \"ur payment is pending\" I don't know what to do \nI contacted costumer support and after 7 MINUTESS an agent finally got the call I told them about my situation and they hang up. please help",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nufmuv/can_u_guys_help_me/"
    },
    {
        "id": "1nu8iz8",
        "author": "Interesting_Ad8895",
        "title": "Whats the series you unexpectedly just keep going back to for a relaxing rerun, let me start",
        "content": "[Ngl  am about to watch this for the fourth  wtime, and I just really enjoy the storyline and the dynamic between North &amp; South, Right &amp; Wrong, Good &amp; Bad](https://preview.redd.it/3asuxio1s9sf1.png?width=2598&amp;format=png&amp;auto=webp&amp;s=2d0ab639e2f2190d1bf9d9441d590a915efcf293)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8iz8/whats_the_series_you_unexpectedly_just_keep_going/"
    },
    {
        "id": "1nu84xh",
        "author": "piemat94",
        "title": "Breaking Bad suddenly disappeared from my netlix",
        "content": "Hello,\n\n  \nI am totally new on Netflix platform thus apologies if this issue may sound trivial. Since yesterday I cannot find Breaking Bad on the list of available series on the website. Everything was going smooth and fine so far until yesterday. When I was trying to launch BB from a history I got an UI3003 indicating that the product is not available in my country.\n\n\n\n I looked up on the internet and some of the troubleshooting steps involved clearing the browser's history and cache however this didn't work. I launched the Netflix app on my mobile phone with the same issue however when I turned my wi-fi off and switch to mobile data (set to Czech Republic) it reappeared. Does anybody know what may be the reason of this sudden regional exclusion?\n\n  \nThank you.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nu84xh/breaking_bad_suddenly_disappeared_from_my_netlix/"
    },
    {
        "id": "1nua230",
        "author": "Marshall_Lawson",
        "title": "Wednesday pilot vs show",
        "content": "I just watched S1 E2 of Wednesday last night and it feels different from the pilot. The pilot was closer to being cinematic in quality. Episode 2, the one with the canoe race, feels much more amateurish in pacing, direction, acting, writing, etc. It's like watching someone play an RPG videogame. Most of the characters speak entirely in cliches (the roommate and the queen bee girl especially). The dialog is so clean like how they take turns perfectly and don't really move around while talking. Wednesday gets away with that because she's a creepy deadpan snarker and Ortega pulls off the deadpan thing very well. But, most of the characters aren't suited to it. \n\nIf the argument is \"This is made for teens\", well, okay even when I was a teenager I could tell a good quality screen production from a cheesy one. \n\nIf the rest of the series is like this I'm probably going to be really disappointed, which is too bad because I think Ortega, Zeta-Jones, Guzman, and the kid that plays Pugsley are great casting for the Addams family.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nua230/wednesday_pilot_vs_show/"
    },
    {
        "id": "1nuhoum",
        "author": "timmy30274",
        "title": "Someone on snapchat I’m talking to wants Netflix and i wanna be nice to buy one payment but",
        "content": "I’m gonna make a email account then give her the mail password and the netflix login. Will that work?\nOr will the block happen to her? I first thought create an email, sign up netflix, pay then immediately delete the payment I have on file so she can’t potentially use my card for something else. \n\nBut will that work? Or will i mess it up?  I would think to log in and watch something to make sure the payment goes thru\n\nThen logout and hand her the info or will that Not Part of household popup, making it a huge waste to be nice?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nuhoum/someone_on_snapchat_im_talking_to_wants_netflix/"
    },
    {
        "id": "1nu8rws",
        "author": "Rare-Connection-7084",
        "title": "Autoplay setting disappeared",
        "content": "Ok. Autoplay seems to have stopped working consistently and I can't find the settings anywhere. Netflix updated and the home screen is different. The menu is at the top not the left side anymore. The first few episodes I watch are playing all the way to the end of the credits and then suddenly it will autoplay again. I'm watching netflix through my lg tv menu. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8rws/autoplay_setting_disappeared/"
    },
    {
        "id": "1nsrqsy",
        "author": "Ok_Kiwi_5692",
        "title": "I feel so bad for the dad in this show man",
        "content": "Adolescence (2025)",
        "upvotes": 1879,
        "comments": 358,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95txb29ffxrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nsrqsy/i_feel_so_bad_for_the_dad_in_this_show_man/"
    },
    {
        "id": "1ntdvac",
        "author": "Prudent_Swimming_296",
        "title": "Wayward (SPOILERS)",
        "content": "Was left very underwhelmed. Honestly just poorly written and not well thought out.\n\nI didn’t buy Leila’s sudden change of heart in the end at all and I didn’t buy Abby and Rory’s romance.\n\nWhy was the kid in the beginning who got stabbed by Alex affected by Laura’s mumbling? No answers.\n\nWhat’s the significance of the toads? Never revisited.\n\nWhat happened to the other kids at Tall Pines? Did they escape? Wasn’t addressed.\n\nWTF was the point of that whole “ponderosa” corporation plot point if it played absolutely no role in the story? Never answered.\n\nThis show was full of sloppy writing, massive plot holes, underdeveloped characters, arcs that were started but never took off or finished, and an ending that just felt like a total cop out. Very unsatisfying and not very good.\n\nI’m praying they don’t make a second season but given how popular it is, it’s very much a possibility.",
        "upvotes": 69,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1ntdvac/wayward_spoilers/"
    },
    {
        "id": "1nu70uf",
        "author": "AMillion-dreams",
        "title": "Suggestions Please!",
        "content": "So, I have watched Friends, 2 Broke Girls, Young Sheldon, Lucifer, Why Women Kill, Scream Queens, American Housewife, Modern Family, The Vampire Diaries, The Originals, Reign, Game of Thrones, Bridgerton, and the Rookie.\nNow I'm looking for a great series to watch.\n\nAll suggestions are welcomed!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nu70uf/suggestions_please/"
    },
    {
        "id": "1nu57yf",
        "author": "Filme727",
        "title": "Black Rabbit",
        "content": "These two loan shark bone heads, just killed that woman for nothing. And there was $25k and a cashier’s check for more money. Did they even search her apartment for said money that she was blackmailing the restaurant for? And Vince is a total screw up. I almost quit watching because of him. Jake told him to keep the girls away from that creepy dude. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu57yf/black_rabbit/"
    },
    {
        "id": "1ntf7ev",
        "author": "Cold_Classroom_5655",
        "title": "Netflix’s ‘Wayward’ Was Inspired By A Real School For Troubled Teens",
        "content": "",
        "upvotes": 27,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ntf7ev/netflixs_wayward_was_inspired_by_a_real_school/"
    },
    {
        "id": "1ntubqs",
        "author": "LouisTully9000",
        "title": "Small Town, Big Cult Energy in Wayward",
        "content": "Just in time for the annual corporate-sanctioned month of fear, better known as October, Netflix has gifted us ***Wayward***, an eight-episode miniseries that manages to be equal parts horror, comedy, and “what the hell did I just watch?” The show arrives courtesy of Mae Martin, a Canadian stand-up comic whose ability to pivot from punchlines to existential dread proves that comedians, when they go dark, often out-horror the horror directors. (Think Jordan Peele, but with more maple syrup and self-deprecation.)\n\nLet’s be clear from the start. This is not ***Wayward Pines****.* No Shyamalan twists. No forest conspiracy cults. Instead, ***Wayward*** feels like what would happen if Ari Aster, yes, ***Hereditary*** Ari Aster, was handed a stack of Judy Blume novels and told to make them deeply upsetting. The setting is the suspiciously quaint Tall Pines, a town where everyone knows everyone, and everyone waves, and everyone would probably lend you sugar, before locking you in a basement and asking you to recite scripture backwards. Think Stars Hollow, if Stars Hollow had a headmaster played by Toni Collette and zero coffee shops...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ntubqs/small_town_big_cult_energy_in_wayward/"
    },
    {
        "id": "1nu3ct5",
        "author": "Impossible-Draw-6627",
        "title": "Why does the app do this?",
        "content": "Whenever I try to watch an event that was live but after it's done airing, sometimes when it goes to commercial, then comes back and shows the beginning of the show.  Then after the beginning segment it starts at the segment AFTER the one I'm trying to watch!  I can't find any way to avoid this and it's frustrating.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu3ct5/why_does_the_app_do_this/"
    },
    {
        "id": "1nuc967",
        "author": "skopiadisko",
        "title": "[Spoiler] Dark is too overrated",
        "content": "Im posting this here because I am not a fan of the Dark subreddit \n\nMy husband and I just finished the show and while the story is mysterious, thrilling, mostly well written and so on so on, there are things that would piss me off almost at every episode but I kept watching (idk why)\n\n1. The fact that no one suspects that the people they see in their actual reality, were once part of their past. For example, how come Hannah never ever saw a childhood pic of her husband Michael and didn’t flip out when she saw Urlichs son Mikkel before disappearing? This question could apply to any other character and their past/present stories. The only thing they say is that they have some sort of deja vu 😀 like wtf\n\n2. The first two seasons are waaay too slow while the third one is like each episode feels like a new season, so accelerated… \n\n3. Their naivety 🙃🙃 for example, how on earth did it take Urlich so long to run DNA tests when they found the body of Mads? How on earth do you not recognise your brother even if the eyes are burnt black?!!!!\n\nIdk, maybe I am missing something and pls educate me but to me this show is way too overrated. And I just cant figure it out how it has so many devoted fans that a lot of people rewatch it almost every year\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nuc967/spoiler_dark_is_too_overrated/"
    },
    {
        "id": "1nu04ci",
        "author": "LifeUnfolding54",
        "title": "The Godfather: Coda",
        "content": "I am chilling on a Monday evening. I retired tomorrow. \n\nThis is a brilliant piece of Cinema. It continues on with the story, and through the use of CGI and a i, they actually put the face of the character from that., on to that face, from that. Brilliant. I'm not able to describe it, but I love this movie!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nu04ci/the_godfather_coda/"
    },
    {
        "id": "1nt2mo2",
        "author": "Quiet-Example-8804",
        "title": "Haunting of hill house",
        "content": "This has to be one best Netflix series ever. I swear I’ve rewatch it a few times a year since it came out.. that’s all I had to say 😅 it’s just too good!! ",
        "upvotes": 125,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1nt2mo2/haunting_of_hill_house/"
    },
    {
        "id": "1nu7rq4",
        "author": "Stressed_Dump_295",
        "title": "ALICE IN BORDERLAND",
        "content": "Alice in Borderland s1 - S3 complete review\n\nAbout kay Arisu At iba pang tao na napunta sila sa ibang mundo or borderland. Kailangan nila sumali sa mga games para maka-survive At makabalik sa kanilang totoong mundo.\n\n3 seasons Walang Tapon sa storyline. The games, the twist, and how life and death really means. Although medyo kinabahan ako sa S3 kasi hinaluan nila ng original plot para sa Joker Card which is barely na mention o konti Lang ang details sa manga version. But gladly na manage nila na maayos. \n\nSome characters are great. May mga characters Lang nakakainis lalo na sa S3. Muntik na ako ma disappoint kay usagi sa huli 😆. The best thing is Arisu did a big character development. \n\nThe only plot hole Lang sa akin is pano naka access si Banda sa real world. At di na pinakita kung Ano nangyari kay Yaba sa huli. \n\nOverall rating (s1-3): 9/10",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nu7rq4/alice_in_borderland/"
    },
    {
        "id": "1ntw73y",
        "author": "Icy_Alfalfa1766",
        "title": "Black Rabbit potential S2(spoilers)",
        "content": "Okay so maybe I’m in the minority here, but I loved Black Rabbit. Maybe it just scratched that Ozark itch, and I love Jason Bateman. Part of me wishes they’d make another season and just resurrect Vince. I get alive-the-whole time is a shark jumpy trope, but…What if he didn’t call the police from Jake’s phone but called a fixer or the lawyer to help him fake his death(like the insurance guy when they burned the house down). I imagine even if he fell into a trash can or something from that height, he’d still probably die. I also realize that narratively, his death had to happen and was always going to happen. But Season 2 could follow Jake finding out Vince is alive in another country trying to protect him by faking his death and maybe they make a plea deal with the FBI to catch Mancuso. Wouldn’t make the most sense, but I just love Law and Bateman’s brotherly chemistry and want more of it!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ntw73y/black_rabbit_potential_s2spoilers/"
    },
    {
        "id": "1ntla8p",
        "author": "Lindsamanda12",
        "title": "Orphan Black vs Mr. Robot",
        "content": "I have 2 shows I think I want to try but I’m not sure which I should try first, I got around 30 mins into Orphan Black before I realized it’d likely be anxiety filled so I went to browse for something else interesting &amp; remembered I saw very high compliments on Mr. Robot, which one is better or at least which one should I watch first?",
        "upvotes": 3,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ntla8p/orphan_black_vs_mr_robot/"
    },
    {
        "id": "1ntblds",
        "author": "GovernmentLess1991",
        "title": "What to watch on Netflix these days",
        "content": "I need some recommendations of what to watch on Netflix. These days, I have binged\n\n* Crime Scene Zero\n* Owning Manhattan\n* Cook at all costs\n* Sky Castle\n* Alice in Borderland\n* The Devil's Plan\n* Kian Bizarre B&amp;B\n* Bon Appetit Your Majesty\n* KPOP Demon Hunter\n* Easy Bake Battle\n* Next Gen Chef\n* Hell's Kitchen\n\nWell, yea I hope you could get a grasp of my watching style. No horror or thriller. Just lighthearted ones.\n\nSo recommend me some good shows please! I have run out of stuffs to watch.",
        "upvotes": 11,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1ntblds/what_to_watch_on_netflix_these_days/"
    },
    {
        "id": "1nsw9v9",
        "author": "AccomplishedPut5175",
        "title": "Wayward",
        "content": "What did I just watch\nI didn't have great expectations, but this series is so strong, that I was left without text.\nIn fact the emotions were mixed, did I just watch a masterpiece or something else.\nIn fact, you can't stay immune to the emotions that lead you through this series.\nThe actors are so amazing as the action of the series.\nFrom me any recommendation, with a note that the series is not for everyone.\n",
        "upvotes": 120,
        "comments": 395,
        "media": null,
        "permalink": "/r/netflix/comments/1nsw9v9/wayward/"
    }
]