[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qdvcd0",
        "author": "Mucek121",
        "title": "What's the Best Documentary You've Ever Seen? Need Recommendations!",
        "content": "Looking for must-watch documentary recommendations! Whether it's mind-blowing, inspiring, or eye-opening—drop your favorites!\n\n  \nThank you for answer",
        "upvotes": 494,
        "comments": 1129,
        "media": null,
        "permalink": "/r/netflix/comments/1qdvcd0/whats_the_best_documentary_youve_ever_seen_need/"
    },
    {
        "id": "1qekauv",
        "author": "Thissuxxors",
        "title": "What a beautiful show MO is...",
        "content": "As a Palestinian, I was upset with Netflix that MO was only 2 seasons. It seems to obviously be rushed, so I don't think it was the original idea to only have it as 2 seasons. Clearly there were some ugly people that didn't want the show to continue and put pressure on Netflix.\n\nNow I could say that Netflix are cowards if that is indeed the case as I assume, however, I don't think that. If anything, Thank you Netflix for having the guts to allow this show to exist. To produce it and to put it on your platform. It truly is a hilarious, wonderful, heartfelt show that shows the struggles of Palestinians. I would say it is a love letter to Palestinians and our beautiful culture.\n\nThe actors were absolutely wonderful, and while some of it was just hard to watch, particularly MOs struggles. The show left me feeling good and hopeful.\n\nParticularly I loved the Thanksgiving get together at the farm. It was just beautiful to see all these people who are different come together because it felt they were all family.\n\nSorry if my post sounds corny, but I really did love this show so much.\n\nAnyway, for those who haven't seen it, I highly recommend it. It's a brilliant, clever and outrageously funny show.\n\nThank you Netflix.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qekauv/what_a_beautiful_show_mo_is/"
    },
    {
        "id": "1qeiru5",
        "author": "Flapalms239",
        "title": "The Rip",
        "content": "I have the cheapest ad plan. I watched this movie this morning and had zero ads!  I’m not complaining but did anyone else notice this as well? \n\nAs for the film itself I enjoyed it for the most part. I don’t see myself watching it a second time though. ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qeiru5/the_rip/"
    },
    {
        "id": "1qe3wpp",
        "author": "Dramatic_Stretch2760",
        "title": "People We Meet On Vacation",
        "content": "Let me preface this by saying: I love rom-coms. Like, I will defend the genre every time. That said… this movie was not it.\n\nI haven’t read the book, so don’t come for me- I’m judging purely on the film. From the very beginning, both main characters were insufferable. Poppy leaned too hard into the chaotic, ultra–Type B personality, while Alex was painfully rigid and Type A. We’re told they’re best friends, but the movie never convincingly shows why. I genuinely couldn’t see how they’d tolerate each other for more than 20 minutes, let alone build a long-term friendship.\n\nThe chemistry was nonexistent. On top of that, the emotional cheating while they were both in relationships was uncomfortable - are we just supposed to normalize that now?\n\nThe pacing was off, and the story tried to cram in every rom-com trope imaginable, which made everything feel rushed and forced instead of charming or organic. I kept waiting for it to click… and it never did.\n\nDisappointing, especially for a genre I usually adore.",
        "upvotes": 51,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1qe3wpp/people_we_meet_on_vacation/"
    },
    {
        "id": "1qeaoxr",
        "author": "RiseoftheBandit",
        "title": "His &amp; Hers",
        "content": "I couldn’t come to Reddit fast enough . I legit just binged this show on Netflix because of the actors . I first played it for background noise because I needed a new show. But let me tell you I was hooked . All the plot twist was crazy. I’m glad it was short and straight to the point. If you need a show while you are cleaning or playing a game this is it !  ",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qeaoxr/his_hers/"
    },
    {
        "id": "1qdxfl7",
        "author": "Southern-Brother5693",
        "title": "Netflix &amp; Sony Pictures Strike Industry-First Exclusive Pay-1 Deal",
        "content": "",
        "upvotes": 54,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qdxfl7/netflix_sony_pictures_strike_industryfirst/"
    },
    {
        "id": "1qejbwf",
        "author": "Illustrious_Iron_774",
        "title": "Bad performance",
        "content": "Hi, I’m having issues with Netflix in my tv, when I play any movie/serie, I can’t use subtitles bc they are with delay, ui slows downs a lot… This don’t happen with Amazon prime, yt or anything else. What can I do?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qejbwf/bad_performance/"
    },
    {
        "id": "1qdp9cu",
        "author": "Yungvalor20",
        "title": "Black Summer Cancelled",
        "content": "I just finished Black Summer and it was fantastic. I googled to see when season 3 was coming out and it said it was cancelled. What an absolute shame. Personally I believe this is the best zombie apocalypse series I have ever seen. It's realism and cinematography is top notch. The acting and performances are outstanding. I really do not understand how Netflix could just let this one go. I am really sad about this one!",
        "upvotes": 122,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1qdp9cu/black_summer_cancelled/"
    },
    {
        "id": "1qe68tx",
        "author": "Dex_Stlap",
        "title": "The Rip review – Ben Affleck and Matt Damon tear through flashy Netflix bro thriller",
        "content": "The Rip review – Ben Affleck and Matt Damon tear through flashy Netflix bro thriller\n\nOne of much watch to see this weekend highly anticipated cast of Ben affleck &amp; Matt demon through the ups &amp; down of life.\n\nReally great direction &amp; visuals &amp; drama is quite impressive \n\nA must watch for movie lovers ",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qe68tx/the_rip_review_ben_affleck_and_matt_damon_tear/"
    },
    {
        "id": "1qdv393",
        "author": "BazookoTheClown",
        "title": "Seven Dials is insufferable",
        "content": "Currently watching the new Agatha Christie mini series.\n\nMia McKenna Bruce is the worst actress I've ever seen. You can see her \"acting\" every second. It just seems so unnatural.\n\nAlso, the lens/filter choice makes every picture look like a drunk scene in another movie might look.\n\nLazy directing. The amount of good content that Netflix releases has really shrunk to a minimum. ",
        "upvotes": 44,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qdv393/seven_dials_is_insufferable/"
    },
    {
        "id": "1qe92u2",
        "author": "Joker_esk",
        "title": "Spoilers - Run away 📉",
        "content": "I really enjoyed the first half of the show. But then towards the end I got more and more mad. The reasoning for the killings I really disliked, also the fact Paige was just in rehab the whole time. \n\nAlso I think we never knew if this Henry guy was still alive? Propably not but still no info. \n\nAnd how did the murder couple even knew about Elena? \n\nBut still I think this show had a chance to turn it all around for me if Simon would have divorced his wife at the end. He was kept out of every important family thing for years. He must have been feeling as an outsider. I think after all these reveals I couldn’t have lived with this family any longer. This could have saved it for me. But instead now he has the secret. Mayor dislike. ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qe92u2/spoilers_run_away/"
    },
    {
        "id": "1qeid7d",
        "author": "United-Win-2432",
        "title": "The rip is unwatchable",
        "content": "I've had to adjust the volume in the first 2 minutes four different times. It started out with whispering then a phone call where the person on the phone was inaudible while the person we're watching speak was too loud. And then I went deaf with gunshots.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qeid7d/the_rip_is_unwatchable/"
    },
    {
        "id": "1qdx3wn",
        "author": "TerrifierBlood",
        "title": "Check out Bone Lake",
        "content": "Bone Lake is a horror film that came out last year.  it just dropped today on Netflix.  Basic premise is very Barbarian like.  Two couples end up at the same vacation house at the same time.   This movie is hot.  Has a lot of twist and turns.  Definitely worth checking out.  ",
        "upvotes": 18,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qdx3wn/check_out_bone_lake/"
    },
    {
        "id": "1qe0v07",
        "author": "Left_Actuary_7890",
        "title": "I am looking to watch limited series or basically tv shows which are short .",
        "content": "As the title says I am basically binge watching right now. I have been away from netflix and tv shows for a while now, about 2-3 years. So i am kinda going backwards. Starting with newer and shorter shows then moving to longer and older stuff.\n\n  \nDo you guys have any recommendations? I am open to everything and every Genre.  \nJust watched: the beast in me, Emily in paris, his &amp; hers, Monster: ed gein,\n\n\n\n",
        "upvotes": 10,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1qe0v07/i_am_looking_to_watch_limited_series_or_basically/"
    },
    {
        "id": "1qee11e",
        "author": "AltruisticAide9776",
        "title": "I thought the relationship in Tall girl ( Jack and forgotten the tall girl's name ) was kind of sweet , better than people we meet on vacation..",
        "content": "I think that is how you do friends to lovers right . \n\nThey were especially good in the second film cause then you saw both of them yearning for each other not just Jack yearning for tall girl. \n\nThat scene of tall girl seeing Jack do Karoke and then the voice over saying that Jack is out there living his best life , but then the camera goes to Jack and he is actually sad .. \n\nAnd I liked how in the end when tall girl tells Jack that maybe photography could be your thing but Jack is like i don't think i ve found my thing tbh, but i know I want you in my life , i thought that was a  nice lesson that you know not everyone sort of finds their \" thing\" especially not in high school. \n\nI also loved how her nemesis comes around and is actually supportive but i also liked how her nemesis has a male friend and they don't fall in love and she teases him about his crush on tall girl . Like you could feel they really are just opposite gender friends. \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qee11e/i_thought_the_relationship_in_tall_girl_jack_and/"
    },
    {
        "id": "1qe74ty",
        "author": "Hamsterluver167",
        "title": "11.22.63",
        "content": "okay the acting was so cheesy in some parts but if your an emotional person and like romance this show is for you, why I say emotional is because you really have to be involved in it to experience it. Great show watch til the end tears rolling down my face is all I can say. I know there is a book as well if you want to read it!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qe74ty/112263/"
    },
    {
        "id": "1qdprxr",
        "author": "misha2h2f",
        "title": "His &amp; Hers unanswered questions",
        "content": "Why did they show Jack hit Rachel during one of his flashbacks to their sex scene in his truck after she said something like is that how Anna likes it? It shows him choke her and she scratches his face which should show an injury on his face but he doesn’t have one? And when it shows the mom watching them the night she killed Rachel it shows Rachel all normal and happy exiting the truck and saying bye. If they just got in this physical fight I don’t think she would’ve appeared all happy walking out of his truck? \n\nAnd what kind of teenage girls pay men to rape another teenager and just watch, what do they get out of that? It shows Rachel getting paid but is she not rich herself why does she need the money? Also, these men are so despicable to do something like this then what’s to stop them from not paying and raping all of them for free? \n\nAnd why is Lexi mad at Anna when Anna saved Lexi from getting raped at her own expense? And does she know her husband is sleeping with Anna? If yes, why is she ok with it and what were they planning on doing at the lake house?\n\nWhy did Zoe tell Jack Anna isn’t who you think she is based on the 20yr old rape? If anything that would be bad on her not Anna? \n\nSo many unanswered questions/plot holes ",
        "upvotes": 24,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1qdprxr/his_hers_unanswered_questions/"
    },
    {
        "id": "1qecdq0",
        "author": "Complete_Stress5815",
        "title": "Scary movies!!!🍿",
        "content": "Im having a scary movie marathon tn, is there any movies you guys would recommend? I want to be so scared i cant sleep and k want there to be ACTUAL jumpscares, only movie that still keeps me up is “lights out” and im seeking that feeling of fright again!🎬",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qecdq0/scary_movies/"
    },
    {
        "id": "1qec2qc",
        "author": "emadhimself",
        "title": "Now that Stranger Things is over, what can I watch after it?",
        "content": "Stranger Things has come to an end and I really loved the series, anything to watch after it that has this ensemble vibe?\n\nNot necessarily action or mystery,slice of life is preferable with a good story.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qec2qc/now_that_stranger_things_is_over_what_can_i_watch/"
    },
    {
        "id": "1qej4pu",
        "author": "Border-Worried",
        "title": "If I get Netflix with a neighbor that has different Wi-Fi, will it kick one of us off",
        "content": "I recently had Netflix with my family a couple towns over, but got kicked off by Netflix. Does their system go by Wi-Fi or IP location? We’re literally two doors down from each other.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qej4pu/if_i_get_netflix_with_a_neighbor_that_has/"
    },
    {
        "id": "1qdld0q",
        "author": "Key-Contribution985",
        "title": "Need Netflix series recs for this weekend - horror would be perfect!",
        "content": "So it's freezing cold outside and apparently I want to make myself even colder?? 🥶\n\n\n\nLooking for some good series to binge this weekend. Horror would be absolutely perfect (because why not add psychological chills to the physical ones lol), but I'm open to anything that'll keep me glued to the couch.\n\n\n\nWhat are your recommendations? Hit me with your best/scariest/most binge-worthy series!",
        "upvotes": 22,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1qdld0q/need_netflix_series_recs_for_this_weekend_horror/"
    },
    {
        "id": "1qdf8eg",
        "author": "Few_Pipe_9933",
        "title": "Best Black Mirror episodes?",
        "content": "I was wondering what some of the best episodes are so I can just sort thru them instead of watching random episodes. Let me know what your favorites are",
        "upvotes": 36,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1qdf8eg/best_black_mirror_episodes/"
    },
    {
        "id": "1qdub7k",
        "author": "UrMomisgayWithDora",
        "title": "Stone cold fox",
        "content": "I'm watching this movie and it's pretty decent I just can't get past the fact they could've chose ANY name to be yelled the entire movie and they chose to make the main character yell \"spooky\" the whole time it just sounds so goofy to me it'd be better if it was an actual name imo.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdub7k/stone_cold_fox/"
    },
    {
        "id": "1qe39vh",
        "author": "Medium-Education-659",
        "title": "There’s one thing about run away that is bugging me",
        "content": "So there’s one thing that I cant seem to find any answers too. At the end we find out Paige went to rehab. Her mom was part of the shining light but from what we can gather from Paige she “escaped” then went to rehab. Wich leads me to my theory. Was the rehab also part of the shining light? The insider from the cult that kills Dee Dee mentions that she will make another off shoot of the cult and makes it seem like there are more out there that weren’t caught in the raid. When Paige explains what led her to go back to rehab she specifically says she “found her truth” wich is exactly what Dee Dee says when she joined the cult. Add in the fact that the mom ALSO went to this rehab. Am I crazy to assume that Paige is now also now a member of the shining light?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qe39vh/theres_one_thing_about_run_away_that_is_bugging_me/"
    },
    {
        "id": "1qeb33t",
        "author": "ImortalWw",
        "title": "His &amp; hers 8/10",
        "content": "I’ll say it did have its flaws, but the raw conversations really kept me paying attention. I even teared up during one episode.\n\nI might also be a little biased because I’m a Jon Bernthal fan.\n\nI just finished the last episode. What are your guys’ takes?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qeb33t/his_hers_810/"
    },
    {
        "id": "1qdwjsl",
        "author": "Sea-Junket-7164",
        "title": "sweet Cinderella Closet",
        "content": "I am so moved by this series. One of the most sensite and beautiful love stories ever. It is not about cross dressing but about seeing a person in themselves.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdwjsl/sweet_cinderella_closet/"
    },
    {
        "id": "1qebj0z",
        "author": "Over_Abbreviations_3",
        "title": "I’VE SPENT 30+ HOURS OF PAIN AND TEARS MAKING THIS SONG AND VIDEO FOR DARK. 😭😭😭😭",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qebj0z/ive_spent_30_hours_of_pain_and_tears_making_this/"
    },
    {
        "id": "1qdnthw",
        "author": "Kaskelontti",
        "title": "GyeongSeong Creature",
        "content": "GyeongSeong Creature is another incredibly cool and exciting series from Korea. When you watch Korean series, all American series start to feel like soap operas with the same plot but lots of spectacular action to cover up the fact that they have nothing to offer. I've been seriously thinking about canceling my Netflix subscription and switching to KOCOWA+ instead, because it seems like I only watch Korean series these days.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qdnthw/gyeongseong_creature/"
    }
]