[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kj3bot",
        "author": "RoxieMatthews",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "I’m in shock with this girl - she’s an absolute psycho. Like the audacity to be talking like she’s the victim!? Like we should feel bad for her?\n\nHer lies about giving birth to Sarah, and how obsessed she is talking about adopting them. She wanted those kids and Jason paid for it. \n\nAlso the RECORDING they tried to use as proof as abuse is insane. Yelling and fighting within families is normal and doesn’t = abuse. Absolutely pathetic excuse. \n\nHer and her disgusting father should still be in prison. I hope she has an awful life. Vile humans. ",
        "upvotes": 63,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kj3bot/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1kif3wc",
        "author": "Zalensia",
        "title": "a deadly american marriage",
        "content": "I'm 43 minutes in and hooked but can not find conversations etc on it. \n\nSo thought i would make one asking for other people's opinions and points of views, as i know I'm already asking about billion questions, to the point I'll have to go to my computer and boot up to actually do the research myself. \n\nI'm very ill, with brain damage etc and that's really hardwork today, but I won't  manage on this latest fold phone as it's still just a useless phone 😅🙃 \n\nMy other phone that's partitioned etc is in the car and that's over at Inverness!",
        "upvotes": 303,
        "comments": 611,
        "media": null,
        "permalink": "/r/netflix/comments/1kif3wc/a_deadly_american_marriage/"
    },
    {
        "id": "1kj2vxw",
        "author": "Own_Refrigerator9254",
        "title": "A deadly American marriage.",
        "content": "Am I the only one who is in the middle and somewhat believes Molly? \n\nSo hear me out before hating. I went through a similar situation in which my ex, verbally abused me for years because he was the main income and I didn’t want to lose our son. I knew he would take him away. Everyone around us thought he was perfect and I never said anything because the two times I told people they replied “ oh, no man is perfect” etc. so when I had the courage to divorce him he indeed, did everything to take my son away. Anyway, when I heard the types I heard my ex every single day making issues for nothing trying to break me. \n\nThoughts on molly? ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kj2vxw/a_deadly_american_marriage/"
    },
    {
        "id": "1kimg7j",
        "author": "The-Dragon_Queen",
        "title": "The new format makes me hate TV",
        "content": "This is a rant, be warned lol \n\nNetflix had everyone beat with their format. Where the search was and how to scroll genres, etc. Now it’s the worst one of all the streaming service. Whatever coder did this needs a new career. I might be getting old cause I want to cancel my Netflix over this. I stopped using it cause it’s so annoying. I can’t be the only one… right? ",
        "upvotes": 30,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kimg7j/the_new_format_makes_me_hate_tv/"
    },
    {
        "id": "1kj031y",
        "author": "Lollelowksss",
        "title": "Good shows ?",
        "content": "Just finished ransom canyon &amp; virgin river I need something else to watch 😩 any suggestions? Doesn't have to be the same type of show just don't feel like searching Netflix for hours to find something good 😭",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kj031y/good_shows/"
    },
    {
        "id": "1kiaw7v",
        "author": "Efficient-Cup1752",
        "title": "Why is no one talking about The Residence? Such a good show wow",
        "content": "I mean it’s by ShondalandMedia so I’m not surprised it’s such a good show, but I’m surprised no one is talking about it! It’s like the TV Show version of playing the board game murder mystery. So entertaining to watch with your friends on a pizza night lol",
        "upvotes": 157,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1kiaw7v/why_is_no_one_talking_about_the_residence_such_a/"
    },
    {
        "id": "1kj5i37",
        "author": "Wrong_Garlic141",
        "title": "Why is my Netflix telling me to update Google Play Services when I can't and it won't let me login cuz it says Password incorrect despite it being correct",
        "content": "I have a Vivax TV and I didn't have any issue with Netflix till now, I have tried to replace the google play services with an APK i got online but it says App Not Installed everytime I try. Does anyone know how to fix this cuz I tried every youtube tutorial on the planet and it didn't fix it. My grandma who has a Fox TV started having the same issue as my TV. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kj5i37/why_is_my_netflix_telling_me_to_update_google/"
    },
    {
        "id": "1kiv9mn",
        "author": "Fun_Cod2356",
        "title": "I just watched American vandal !!",
        "content": "I finished season 1 and started season 2 immediately but I'm so sad they skipped the 3d models this season ;( that's all I just wanted to complain lol and of course recommend the show if you haven't watched it already, I literally just found out about it and it has been around for many years!! I literally cried of laughter with season 1",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kiv9mn/i_just_watched_american_vandal/"
    },
    {
        "id": "1kj49fs",
        "author": "Beneficial-Claim8373",
        "title": "The Residence - What was the purpose of the secret service crash?",
        "content": "The show placed a lot of attention on it in the first few episodes but then it was never addressed? Everything else seemed to either add up to the end except for this.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kj49fs/the_residence_what_was_the_purpose_of_the_secret/"
    },
    {
        "id": "1kiwaq1",
        "author": "stellacampus",
        "title": "The Last Night at Tremore Beach is pretty good",
        "content": "The Last Night at Tremore Beach is kind of a sleeper in that I can easily see folks blowing by it, but I actually thought it was pretty captivating if perhaps a little too drawn out.  I even had to watch it dubbed into English from Spanish because I am having some eye issues at the moment, and I thought the dub was much more natural than usual.  I;m sure there will be \"experts\" who decry plot holes and the like, but I thought it was overall put together very well as far as the mystery.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kiwaq1/the_last_night_at_tremore_beach_is_pretty_good/"
    },
    {
        "id": "1kihnod",
        "author": "AdventurousCandle203",
        "title": "The Four Seasons Episode 7: um what the fuck?",
        "content": "I won’t post spoilers in my post but can’t guarantee there won’t be any in the comments.\n\nI can’t believe that happened! I was really loving this show and now I actually kind of hate it. I don’t really want to finish the last episode anymore. ",
        "upvotes": 22,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1kihnod/the_four_seasons_episode_7_um_what_the_fuck/"
    },
    {
        "id": "1kiztmh",
        "author": "bluecoastblue",
        "title": "British Show About Girl Kidnapped at Sleepover?",
        "content": "This is driving me crazy. I am two episodes in on what I think is a British tv series about girl who goes to a sleepover and when the parents go to pick her up the house is empty and a cleaning woman tells the parents it's an empty vacation rental. I've tried searching several times and I can't find it and it's not in my \"continue watching\" Only one episode released every week. Anyone know what it is? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kiztmh/british_show_about_girl_kidnapped_at_sleepover/"
    },
    {
        "id": "1kiyfdb",
        "author": "Admirable_Iron8933",
        "title": "Nonnas- Wigs and Chemistry",
        "content": "It was promising. The cast. True, compelling story. \n\nBut I don’t know which was more like sandpaper to my heart- the lack of chemistry (between a great cast) or the tragic wigs. \n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kiyfdb/nonnas_wigs_and_chemistry/"
    },
    {
        "id": "1kixmuw",
        "author": "SynthRogue",
        "title": "After literal years, I have just finally found the cause for why I was getting sub 720p on netflix, on pc. So here is the solution for those who are still frustrated and looking for a fix.",
        "content": "# Install the HEVC Video Extensions\n\nThat’s the last (and key) piece you're missing.\n\n1. Open the Microsoft Store\n2. Search for: **“HEVC Video Extensions”**\n3. Choose this one: **HEVC Video Extensions – $0.99 on Microsoft Store**\n4. Install it\n5. Restart your PC\n6. Try Netflix again in Edge or the Netflix app\n7. Press `Ctrl + Alt + Shift + D` while playing content and verify:\n   * Codec: `hevc`\n   * KeySystem: `HW_SECURE_DECODE`\n   * HDR support: `true`\n   * Bitrate: `16000+ kbps`\n   * Resolution: `3840x2160`Install the HEVC Video Extensions That’s the last (and key) piece you're missing.    Open the Microsoft Store       Search for: “HEVC Video Extensions”       Choose this one:  HEVC Video Extensions – $0.99 on Microsoft Store       Install it       Restart your PC       Try Netflix again in Edge or the Netflix app       Press Ctrl + Alt + Shift + D while playing content and verify:       Codec: hevc       KeySystem: HW\\_SECURE\\_DECODE       HDR support: true       Bitrate: 16000+ kbps       Resolution: 3840x2160\n\nthe **HEVC Video Extensions** from the Microsoft Store is:\n\n# A one-time purchase\n\n* You pay **$0.99 USD** once — **no subscription**, no renewal fees.\n\n# Tied to your Microsoft account\n\n* Once purchased, it’s permanently linked to your **Microsoft account**.\n* You can **install it on any other Windows 10/11 device** you sign in to with that account — no need to pay again.the HEVC Video Extensions from the Microsoft Store is: A one-time purchase    You pay $0.99 USD once — no subscription, no renewal fees.    Tied to your Microsoft account    Once purchased, it’s permanently linked to your Microsoft account.       You can install it on any other Windows 10/11 device you sign in to with that account — no need to pay again.\n\n  \nWhy You Need the HEVC Codec for HD/4K Netflix on PC\n\nNetflix uses different video codecs depending on the device, platform, and stream quality. The key reasons for needing HEVC are:\n\n 1. 4K (and sometimes even Full HD) Requires HEVC on PC\n\n HEVC (H.265) is a more efficient codec than AVC (H.264). It compresses video better while keeping quality high.\n\n Netflix streams 4K content (and often HDR) using HEVC, which requires:\n\n   HEVC decoding capability\n\n   Secure content protection (DRM like Widevine L1 in hardware)\n\n\n\nIf you don’t have the HEVC codec, Netflix falls back to AVC1, which maxes out at 480p or 720p, even with a 4K plan.\n\n 2. Windows 10/11 Doesn’t Include HEVC by Default\n\n Microsoft used to bundle the HEVC codec for free.\n\n But around 2017, they stopped because:\n\n   HEVC is not free to license. It has royalty fees tied to it (paid to patent holders).\n\n   To reduce Windows licensing costs, Microsoft made it an optional \\\\$0.99 addon in the Store.\n\nThis is why TVs, phones, game consoles still get HEVC support for free — the manufacturer licenses it for that device. But with PCs (especially custombuilt desktops), you’re responsible for getting the codec.\n\n 3. Why You Didn’t Notice Before\n\n If you only watched Netflix at 720p or lower before, AVC1 was enough.\n\n Or you might’ve been on a device that came with HEVC preinstalled (like a laptop from Dell, HP, etc.).\n\n Now that you're on the Premium plan, Netflix tries to stream 4K — but it can’t unless your PC supports HEVC with DRM.\n\nWhy Charge \\\\$0.99 at All?\n\nThe \\\\$0.99 price is basically a token fee to offset Microsoft’s licensing cost. The real reason you have to pay:\n\n Microsoft can't legally distribute HEVC for free on Windows unless it's covered by an OEM license (e.g. Dell paid for it for your laptop).\n\n You’re only charged once per Microsoft account, and the codec is yours forever.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kixmuw/after_literal_years_i_have_just_finally_found_the/"
    },
    {
        "id": "1kir0d6",
        "author": "trutrutrudadada",
        "title": "How does changing netflix plan work when its in the middle of a already paid sunscription?",
        "content": "If i change my plan on netflix will it change now or next month\nIf i change the plan from like basic HD to standard full HD will it switch instantly or next month? And if it does switch instantly do i pay like the price difference the two plans have? I really need to know.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kir0d6/how_does_changing_netflix_plan_work_when_its_in/"
    },
    {
        "id": "1kifqx8",
        "author": "chrisdh79",
        "title": "Netflix is removing Black Mirror: Bandersnatch | The company has been moving in a different direction with its interactive experiences.",
        "content": "",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kifqx8/netflix_is_removing_black_mirror_bandersnatch_the/"
    },
    {
        "id": "1kife5e",
        "author": "UpvotesPlssss",
        "title": "Just remade the theme song for The Good Place in soundtrap using MIDI!",
        "content": "What did you guys think of this show?",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/de4a4k9njqze1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kife5e/just_remade_the_theme_song_for_the_good_place_in/"
    },
    {
        "id": "1kir6qo",
        "author": "HehroMaraFara",
        "title": "Havoc (2025)",
        "content": "So, I love Tom Hardy. For the most part I will always support anything he’s in. Hes one of the most “normal guys” in the action world of Hollywood. Yes, all his American accents are circa 1945 Brooklyn, but whatcha gonna do. \n\nAll that being said I REALLY wanted to like Havoc. If you turn your brain COMPLETELY off, it’s kind of possible. \n\nIt’s the cabin scene though that they completely lost me. All three standing in the wide open while a dozen guys open up on them in full auto from about 100 feet away. Not only do they have time to duck inside and “cover” but nary a bullet hits a one of them. The walls are essentially cardboard and somehow they are not only not getting hit, but returning fire and getting kills instead themselves. Ludicrous doesn’t even begin to describe it. \n\nThis movie so desperately wanted to be an updated Max Payne kinda vibe, but instead it was more Uwe Boll Max Payne. Do better. ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1kir6qo/havoc_2025/"
    },
    {
        "id": "1khp91l",
        "author": "ernmygherd",
        "title": "The Four Seasons - Unpopular Opinion",
        "content": "Does anyone else think this show doesn’t deserve all the hype it’s getting? I binge watched it and thought it wasn’t bad, but it’s not very good. I like the cast a lot, but the story and the acting? There was really nothing special and it felt so rushed like I didn’t have a chance to really get attached to any of the characters or story. I’m so thrown off by everyone being like OMG LOVED IT SO GOOD!!!!!! ",
        "upvotes": 188,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1khp91l/the_four_seasons_unpopular_opinion/"
    },
    {
        "id": "1ki6dmb",
        "author": "IhateWingflation",
        "title": "North of North - Ting?",
        "content": "I've just started watching North of North and so far love the show! It's so awesome to see this part of Canada and its culture showcased with such high production value and quality storytelling.\n\nI'm wondering if anyone on here can tell me about the name \"Ting\". Is this a common Inuit name, with a certain meaning, or is it a nickname or short form of a longer word?\n\nI just thought it sounded different from the other names in the show! Forgive me for my very limited knowledge of Inuit culture.  \n",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ki6dmb/north_of_north_ting/"
    },
    {
        "id": "1kilyp2",
        "author": "Live-Monk-2198",
        "title": "Aspect Ratio keeps fluctuating, while watching content.",
        "content": "Please help, the video aspect ratio keeps on fluctuating, I use Microsoft Edge, Laptop is HP Envy, 2800×1800, 120Hz\n",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kaybed8k3sze1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kilyp2/aspect_ratio_keeps_fluctuating_while_watching/"
    },
    {
        "id": "1kictbl",
        "author": "Valdra595",
        "title": "Can you make stop spoiling shows in preview",
        "content": "I was making my partner watch how to train your dragon race to the edge and we’re about 4 seasons in and we finished an episode and went out and the autoplay preview just fully showed a MAJOR twist villain attacking the main character is there a way to make it either stop playing previews from later seasons or turn it off completely? It’s kinda ruined the big reveal that’s 4 seasons and two other shows have been building up to. ",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kictbl/can_you_make_stop_spoiling_shows_in_preview/"
    },
    {
        "id": "1khu6e5",
        "author": "intelerks",
        "title": "Last chance to watch ‘Secret Diary of a Call Girl’ –controversial adult series leaving Netflix",
        "content": "Fans of provocative British television have a limited window to stream the popular ITV drama *Secret Diary of a Call Girl* on Netflix before it is removed from the platform. The show, which originally aired between 2007 and 2011, will no longer be available after 29 May.\n\n",
        "upvotes": 51,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1khu6e5/last_chance_to_watch_secret_diary_of_a_call_girl/"
    },
    {
        "id": "1kips26",
        "author": "MWH1980",
        "title": "So, when Season 5 of Stranger Things hits, what do you think that will do to Netflix’s subscriptions numbers?",
        "content": "I’m predicting a pretty hefty spike for people wanting to get their fix, and then a drop afterwards.\n\nI’ve been without Netflix for at least a year, and only have plans to return temporarily to get that little viewing once it hits. Anyone else?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kips26/so_when_season_5_of_stranger_things_hits_what_do/"
    },
    {
        "id": "1kil3xj",
        "author": "super_Fig6242",
        "title": "Certain types of characters",
        "content": "Is there any big sized female character, in movies, or TV shows, who works as a professional strong boxer, or an intimidating strict coach, or something similar? If yes, like who?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kil3xj/certain_types_of_characters/"
    },
    {
        "id": "1kh8qjg",
        "author": "mydearmelody7",
        "title": "I will never forgive you for this 💔",
        "content": "",
        "upvotes": 1145,
        "comments": 302,
        "media": null,
        "permalink": "/r/netflix/comments/1kh8qjg/i_will_never_forgive_you_for_this/"
    },
    {
        "id": "1kibju0",
        "author": "LKS983",
        "title": "Asteroid City",
        "content": "Has anyone else watched this film, which is now available on Netflix (where I live)?\n\nSo many famous actors, but I've no idea as to the point - and HATED the overlighting.\n\nYes, I know that the 'writer' said that the scenes should show the sun as being neither hot or cold, just very bright.",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kibju0/asteroid_city/"
    },
    {
        "id": "1khh3bl",
        "author": "purplewizardshoes",
        "title": "I will also never forgive… or forget…",
        "content": "Capitalizing u/mydearmelpdy7 ‘s post… These are the cancellations that make me want to visit their headquarters and leave bags of flaming poo for all their executives… still mad. 💔",
        "upvotes": 150,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1khh3bl/i_will_also_never_forgive_or_forget/"
    },
    {
        "id": "1khpax5",
        "author": "According-Rent-224",
        "title": "Shows like Black Mirror",
        "content": "*Black Mirror* is by far my favorite show, I love how every episode hits you with something unexpected.\n\n*Love, Death &amp; Robots* and *Behind Her Eyes* were both solid, definitely not on the same level, but at least e they also had that same kind of unpredictable feel. And with *LD&amp;R*, each episode had its own unique style just like Black Mirror.\n\nI know Black Mirror is quite unique but does anyone know a show thats basically dark, weird, surprising, and ideally with different vibes or stories each episode???",
        "upvotes": 21,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1khpax5/shows_like_black_mirror/"
    },
    {
        "id": "1kht9el",
        "author": "Atlast_2091",
        "title": "The Old Guard 2 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kht9el/the_old_guard_2_official_trailer_netflix/"
    }
]