[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p01zjb",
        "author": "am3142",
        "title": "It’s So Refreshing to See Claire Danes’ Real Face on “The Beast In Me.”",
        "content": "Hey y’all, I just want to say how refreshing it is to see a real face, like Claire Danes’ in this latest series. NO SPOILERS! I am only on the second episode. I love that (it seems at least) she has not done any fillers, botox, or other procedures. I love that she can be fully expressive, she can fully emote, and be comfortable as a woman who is growing and aging. No shade to actresses who do get cosmetic work, the pressure to look young and beautiful all the time must be immense. I was wondering if you noticed how expressive she is as Aggie Wiggs, and if you too felt it refreshing to see a woman in all of her glory take space with her aging face in this show.",
        "upvotes": 258,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1p01zjb/its_so_refreshing_to_see_claire_danes_real_face/"
    },
    {
        "id": "1ozrj44",
        "author": "RiskAndReason",
        "title": "What’s the LAST thing you watched on Netflix?",
        "content": "Curious what everyone’s been watching lately.   \nWhat was the last movie or show you finished on Netflix, did it live up to the hype, and is it something you’d recommend to others here? ",
        "upvotes": 371,
        "comments": 1520,
        "media": null,
        "permalink": "/r/netflix/comments/1ozrj44/whats_the_last_thing_you_watched_on_netflix/"
    },
    {
        "id": "1oztriy",
        "author": "bottlecoco",
        "title": "Which is the best long comedy show on Netflix for nonstop laughter?",
        "content": "I’m looking for a long comedy series on Netflix that I can watch while eating or during small breaks. The goal is simple: laugh as hard as humanly possible.\n\nPlease suggest shows that are all hits, no misses — the kind that will genuinely make me burst out laughing. No slow burners, no “it gets better after a few episodes” types. Just pure comedy gold from the start.\n\nWhat do you recommend?",
        "upvotes": 26,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1oztriy/which_is_the_best_long_comedy_show_on_netflix_for/"
    },
    {
        "id": "1ozwz9m",
        "author": "fbutterfield96",
        "title": "Netflix Bid for Warner Bros. Raises Antitrust Concerns, GOP Rep. Says: Streamer ‘Wields Unequaled Market Power’",
        "content": "",
        "upvotes": 15,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ozwz9m/netflix_bid_for_warner_bros_raises_antitrust/"
    },
    {
        "id": "1p02k0j",
        "author": "Ms_Chessnudt",
        "title": "What Did Jack Do?",
        "content": "Not really here to say much except that this might have been the best thing I've ever seen in my whole life. Seriously if you haven't watched it, it's a short film by David Lynch, maybe the last thing he did, somewhere between 12 - 17 minutes... If you are an Eraserhead person, you will definitely love this if you haven't already seen it. \nRecently I heard someone say that art is dead. David Lynch might be dead, but he left a reminder that art is, indeed, very much alive.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p02k0j/what_did_jack_do/"
    },
    {
        "id": "1ozrejd",
        "author": "Expert-Chicken6519",
        "title": "Is There A \"Leaving Soon\" Section Yet?",
        "content": "Why is there no Leaving Soon section on Netflix, or is there? I don't see one on my Apple TV device's app. I should not have to search in Google for what's leaving soon in my Watch List.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ozrejd/is_there_a_leaving_soon_section_yet/"
    },
    {
        "id": "1ozv18h",
        "author": "Zebitty",
        "title": "Rating system question",
        "content": "At the end of a movie Netflix asks me \"Loved it\", \"Liked it\", \"Not for me\"\n\nLet's say I'm a sci-fi fan and I 'rate' a sci-fi movie \"Not for me\" because the movie was garbage, will Netflix be less likely to suggest other Sci-fi movies in future?\n\nIs there a way of saying that a specific movie was bad without Netflix thinking I don't like sci-fi in general?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ozv18h/rating_system_question/"
    },
    {
        "id": "1oztdcv",
        "author": "spaceyastro",
        "title": "Series recommendations for 10 hour flight",
        "content": "Hello! I have a long 10 hour flight coming up and am open to any series recommendations on Netflix. Want to download a bunch of content in case the inflight entertainment doesn’t hold up. I’m pretty open to all genres except true crime - I get kind of spooked. Thanks! ",
        "upvotes": 6,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1oztdcv/series_recommendations_for_10_hour_flight/"
    },
    {
        "id": "1ozj2ly",
        "author": "Sufficient-Curve2951",
        "title": "The Beast in Me",
        "content": "Don't you think the 'supposedly' ideal and small-town setting is getting too monotonous for crime thrillers these days? Same closely knit society and a crime that disrupts its 'harmony'. I have just started watching The Beast in Me but the Oyster Bay setting feels too similar and overdone!\n\n  \n[https://www.soapcentral.com/shows/where-the-beast-me-take-place-setting-netflix-series-explored](https://www.soapcentral.com/shows/where-the-beast-me-take-place-setting-netflix-series-explored)",
        "upvotes": 16,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ozj2ly/the_beast_in_me/"
    },
    {
        "id": "1p01dy5",
        "author": "Ok-Simple-4548",
        "title": "Mother/daughter show",
        "content": "What’s a good show for a mother to watch with her adult daughter?  We have watched and enjoyed Firefly Lane and Anne with an E.   It can be any streaming service.  Downton Abbey, The Crown, and Call the Midwive are some other favorites.  ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p01dy5/motherdaughter_show/"
    },
    {
        "id": "1p00nnz",
        "author": "harrys123456",
        "title": "movies/shows",
        "content": "how many movies/dramas/shows do you watch in aweek / amonth ?\nand which plan do you have?\nwhere do you live ?\nhow mch do you pay ?\n\nme in US\nonly watch in weekend 2-3 movies\nstandard plan for $17.99/a month ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p00nnz/moviesshows/"
    },
    {
        "id": "1oyfyts",
        "author": "cheeseymom",
        "title": "Is anyone else who really enjoyed stranger things just completely lose interest with how long they took?",
        "content": "I don't even know if I'll bother to watch the 5th season. I remember liking and enjoying all the others but it's been so long I forgot most of it and now I just don't even care. It's a shame they couldn't have just ended it in a timely manner.",
        "upvotes": 2313,
        "comments": 381,
        "media": null,
        "permalink": "/r/netflix/comments/1oyfyts/is_anyone_else_who_really_enjoyed_stranger_things/"
    },
    {
        "id": "1ozz5pq",
        "author": "Is_Anyone_Home00",
        "title": "Commercials",
        "content": "Rant: during the live wwe raw, like currently right now, it's 20minutes of \"dramatic\" talking in the beginning, then they are wrestling, right, but during said match is when you get the ads, 15 minutes of a match, and six of those was commercial. So you are missing the good stuff by six minutes. \n\nLiterally it was the start of a match and the first three minutes was a commercial. \n\nThat's all, I'm not even sure if this post is allowed. It's just.. why.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ozz5pq/commercials/"
    },
    {
        "id": "1oz7258",
        "author": "Upbeat-Meringue-6401",
        "title": "Thoughts on The Beast in Me? (SPOILERS)",
        "content": "I just binged all the episodes of The Beast in Me and I loved it. Claire Danes did an amazing job and Matthew Rhys's faces scared the shit outta me. I love a show that has me yelling at my TV. I would like to take this opportunity to list a few of the people in this show who pissed me off.\n\n1. Abbott - Why would you approach someone who you know is a pysopath and serial killer pretty much, all alone, with one weapon? I knew as soon as he followed him he was gonna die, smh. It was so upsetting.\n\n2. Marvin - I completely understand him wanting to help his son and being in denial about how sick he really was, but he was constantly having to clean up Nile's messes. His legacy was also constantly at risk because of Nile's recklessness, but he just kept helping him over and over again. I know that's his son, but I would have called the police on him asap.\n\n3. Shelley - Was anyone else annoyed by Shelley? Why would you be mad at your ex wife for not being able to forgive the man who was driving drunk and caused a crash that killed your child?? And then to blame Aggie for his suicide to her face when she came to you telling you that she thinks Teddy was murdered. Obviously Aggie wasn't 100% in the right for doing things like throwing the brick through his window, but I can understand her anger. Also, having to see him constantly, knowing that he was never punished must have been hell. It's like they all made her out to be the crazy one for being angry.\n\nNile - Obviously he pissed me off cuz his impulse control was dog shit, and he was a terrible person all around, but he made a really good villain. I think a good villain makes the best stories.\n\nHow did ya'll feel?",
        "upvotes": 46,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1oz7258/thoughts_on_the_beast_in_me_spoilers/"
    },
    {
        "id": "1ozrr00",
        "author": "cameronarchambault",
        "title": "My netflix was hacked cant change to my native language",
        "content": "I changed my password and booted any devices I dont use off of my account, although every show I watch now is in spanish even though my profile is set to english. Does anyone have any recommendations to fix this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ozrr00/my_netflix_was_hacked_cant_change_to_my_native/"
    },
    {
        "id": "1oz7xlo",
        "author": "Justanothermom6",
        "title": "Why is Australia part of Physical Asia?",
        "content": "They are not asian right? Their team members are also significantly taller, bigger in physique compared to asians which gives them upper-hand in most battles! Nothing against Aussies, I love them and I have worked with them (they’re amazing human beings!). Just really wondering?! ",
        "upvotes": 13,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1oz7xlo/why_is_australia_part_of_physical_asia/"
    },
    {
        "id": "1ozny15",
        "author": "Lilacjasmines24",
        "title": "Release date of BBC limited series - Pan Am one",
        "content": "\nI have been waiting patiently for the Pan Am 103 show that was released on BBC on May 2025. I thought it was gonna be released worldwide on Netflix? \n\nThe plan fell through? I thought it was a collaboration?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ozny15/release_date_of_bbc_limited_series_pan_am_one/"
    },
    {
        "id": "1ozmynu",
        "author": "Upbeat_Possession714",
        "title": "Recommend me a good historical action serie",
        "content": "Hey everyone. I'm struggling to find a cool historical serie. When i say historical i don't mean it needs to be 100% accurate but happening in the past. Some series i enjoyed :\n\n* Barbarians\n* The last kingdom (I enjoyed it more than Vikings tbh)\n* Marco Polo\n* Tudors\n* Medicis\n* Pillards of the Earth\n* Kingdom\n* Rome\n* Spartacus\n\nI want a bit of action as well, not something like Downton Abbey. And the more important of all, a serie with an ending, not a show that was cancelled.\n\n  \nAny recommendations ?\n\n",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ozmynu/recommend_me_a_good_historical_action_serie/"
    },
    {
        "id": "1ozt33x",
        "author": "PaoloFence",
        "title": "Finally switched to Linux",
        "content": "Is there really no way to stream 1080p and higher on Linux?  \nIf yes: Why is that the case?\n\nTheir servers even run Linux. I want to subscribe but I also require some service for my money.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ozt33x/finally_switched_to_linux/"
    },
    {
        "id": "1ozdwe2",
        "author": "Aggravating_Bit_5218",
        "title": "Adding someone to your account",
        "content": "If I have a standard netflix package that allows for 2 people to access at one time and I add an outside account member, does this mean that 3 people can access the account at the same time?\n\nI have been on premium subscription for ages, the price is wild now.\nMy child has gone to university and they have stopped access to our family account. There's only 3 of us, 1 adult and 2 kids, one of which is outside the house. \nIt just sickens me to pay £25 a month to give access to more people than is literally in my family while paying extra for the other house access\n\n",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ozdwe2/adding_someone_to_your_account/"
    },
    {
        "id": "1ozwr38",
        "author": "osmanbosanac",
        "title": "Did Netflix cancel my membership? Am I banned now?",
        "content": "Basically, my girlfriend has a Netflix account, Standard plan, and we both use her account. We currently live in different countries, have done for months, and will for a few more. Her father, who lives in the same country as her but in a different city, also sometimes uses her account. There were never any issues before. \n\nSuddenly, we try to watch something only to discover that her membership is apparently cancelled. None of us did it. When she tried the \"Restart your membership\" button, it would either not do anything, or the following error message popped up:\"Sorry, we are unable to complete that action now. Please try again later.\" Payment is not an issue, because the invoice confirms there are another 10 days before the next payment is required. \n\nWe have tried troubleshooting, but nowhere does it mention anything about this kind of situation. The Help Centre offers no help, and the chat is unavailable. The phone app can't be accessed for the purposes of calling them. Basically, no way to contact them.\n\nDoes anyone have any idea what is happening? How do we resolve this? Thanks in advance for any and all help!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ozwr38/did_netflix_cancel_my_membership_am_i_banned_now/"
    },
    {
        "id": "1oyy4st",
        "author": "Nastyday",
        "title": "How do you choose what to watch on Netflix when watching together?",
        "content": "Hi everyone!   \nI’m curious how you decide **what to watch on Netflix when you're watching with someone else**.\n\nI know it can really depend on the people and the situation, but I’d love to hear your preferences—  \n**Do you like watching “together-together” (same screen, same time) or watching “alongside” (same show, but separately)?**\n\nSome studies show that even with Netflix’s powerful recommendation system, people still spend **10–30 minutes just scrolling** because of *choice overload*.  \nCurious to hear your thoughts and experiences—how do *you* pick something?\n\n  \n",
        "upvotes": 16,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1oyy4st/how_do_you_choose_what_to_watch_on_netflix_when/"
    },
    {
        "id": "1ozlfou",
        "author": "Western_Quit_4966",
        "title": "What’s the most emotional Stranger Things moment you still think about?",
        "content": "Rewatching some scenes and realized something funny, Stranger Things has these tiny moments that stick in your head way longer than expected.\n\nLike the first time we see Eleven steal the waffles, or the Season 4 group scenes that just *feel* nostalgic now.\n\nCurious what moments you all still remember, even years later?\n\nAlso, do you think fans should keep some kind of “digital memory wall” for shows we love? Or is that too sentimental?\n\nNot promoting anything — just curious how people feel about the idea of preserving fan memories from a show.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ozlfou/whats_the_most_emotional_stranger_things_moment/"
    },
    {
        "id": "1oyuc11",
        "author": "Spicypanda78",
        "title": "Anybody else enjoy Minx as much as I did?",
        "content": "I really enjoyed this show and hope Netflix renews them. Ophelia Lovibond and the rest of the cast deserve a third shot. I cackled at some of the references and a lot of the jokes. Heartbroken when I found out that there is only 2 seasons with no renewal. Did anyone else just find out about this show, which was released in 2022 on HBO, Then Stars? ",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oyuc11/anybody_else_enjoy_minx_as_much_as_i_did/"
    },
    {
        "id": "1oz23uo",
        "author": "Demonicpineapplehat",
        "title": "The Witcher Season 4 - intermittent black screen",
        "content": "Has anyone experienced similar and found a solution:\nWe’ve just started watching the Witcher season 4 on our tv (LG OLED). During what feels like key action scenes, and as the camera changes angle, the screen will go black for a second or less.. but the subtitles and sound will continue. A second later and the picture will return. \n\nFor example: S4E1 at 50:17-50:18. \n\nWe’ve literally just finished rewatching season 3 and didn’t experience the issue. Nor on any other Netflix show. \n\nIt’s infuriating. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oz23uo/the_witcher_season_4_intermittent_black_screen/"
    },
    {
        "id": "1oz9rw8",
        "author": "not_at_ALT",
        "title": "Netflix's Delhi Crime can't get simple title credits correct.",
        "content": "Noticed while watching the incredible title sequence for Delhi Crime Season 3 that they listed Ceiri Torjussen as the \"Music Copmoser\". Insulting misspelling; especially considering that the title sequence is only good because of the music.\n\nScreengrab:\n\n[https://ibb.co/tMvPF1SM](https://ibb.co/tMvPF1SM)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oz9rw8/netflixs_delhi_crime_cant_get_simple_title/"
    },
    {
        "id": "1oz9rlv",
        "author": "LOACHES_ARE_METAL",
        "title": "I never had troubles connecting my monitor",
        "content": "Until one day I tried hdmi to a smart tv. As soon as I dragged the chrome browser containing netflix, it would disconnect. I fought it a few times, eventually it worked for a few hours, then cut out. Now, my main monitor connected directly through hdmi struggles to be recognized. It's glitchy just like how it was when I was trying to watch netflix except, I'm not trying to watch netflix. I'm just trying to use my monitor.\n\nA post I just posted was removed immediately and as I'm trying to post once more, my monitor is connecting and disconnecting making my screens act bananas, like they're trying to gaslight me into not posting. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oz9rlv/i_never_had_troubles_connecting_my_monitor/"
    },
    {
        "id": "1oybrum",
        "author": "Overall-Path-4686",
        "title": "Claire Danes’ Lip Quiver in The Beast In Me",
        "content": "Pretty good show, and Claire Danes is great in it but her lower lip quivers in every single emotionally intense scene and it’s so distracting. \n\nWould have loved if she picked a single other way to communicate emotion in her face besides a lip quiver.\n\nDid anyone else notice this?",
        "upvotes": 133,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1oybrum/claire_danes_lip_quiver_in_the_beast_in_me/"
    }
]