[
    {
        "id": "1m31589",
        "author": "NickOffermanAMA",
        "title": "Good Day, reddit, my name is Nick Offerman. You may have seen me in such fare as Parks &amp; Rec, The Last of Us, Civil War, MI: The Final Reckoning, DEVS, or heard my voice in The Lego Movie. I’m here today to discuss a new film in which I am an actor, SOVEREIGN. Ask me anything, please &amp; thank you.",
        "content": "Good Day, reddit, my name is Nick Offerman. You may have seen me as an actor in such fare as *Parks &amp; Rec*, *The Last of Us*, *Civil War*, *Mission: Impossible 8 - The Final Reckoning*, *DEVS*, or *Umbrella Academy* or maybe you heard my voice in *The Great North* or *Smurfs* or *The Lego Movie*. You might also have read one of my five books or seen me perform as a humorist, or maybe you have checked out some of my woodworking at [Offermanwoodshop.com](http://Offermanwoodshop.com)   In any case, I’m here today to discuss a powerful new film from Christian Swegal in which I am an actor, called SOVEREIGN. Ask me anything, please and thank you.\n\nSOVEREIGN is out now.\n\nIn this tense and provocative true-crime thriller inspired by true events, a father and son who identify as \"sovereign citizens\" follow a belief system deeply rooted in distrust of government authority. The pair's view turns deadly after a police confrontation, setting off a tragic chain of events that forces a reckoning with power, principle, and the limits of freedom.\\]\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=\\_T4JHPowGbg](https://www.youtube.com/watch?v=_T4JHPowGbg)\n\nAsk me anything, reddit. Back at 12:00 PM ET.\n\n",
        "upvotes": 47972,
        "comments": 4936,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7gle1rubakdf1.jpeg?auto=webp&amp;s=4b9c51892ca7789dc9384c18d7427976ef85d74a"
        },
        "permalink": "/r/movies/comments/1m31589/good_day_reddit_my_name_is_nick_offerman_you_may/"
    },
    {
        "id": "1m2q9jw",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Eddington / I Know What You Did Last Sumer (2025)) Plus a very special throwback discussion!",
        "content": "**New In Theaters**:\n\n* [Eddington](https://old.reddit.com/r/movies/comments/1m2q3dy/official_discussion_eddington_spoilers/?)\n* [I Know What You Did Last Summer (2025)](https://old.reddit.com/r/movies/comments/1m2q3hj/official_discussion_i_know_what_you_did_last/?)\n* [Smurfs](https://old.reddit.com/r/movies/comments/1m459z3/official_discussion_smurfs_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [X-Men](https://old.reddit.com/r/movies/comments/1m2q3kr/official_throwback_discussion_xmen_spoilers/)\n\n**Still In Theaters**:\n\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 31,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1m2q9jw/official_discussion_megathread_eddington_i_know/"
    },
    {
        "id": "1m585th",
        "author": "zip9990",
        "title": "Have you ever paid to see a movie twice in a theater?",
        "content": "Someone recently told they have seen movies they liked so much that they have returned to the theater to watch it again before it was released on DVD or streaming. Just curious if anyone else has done this and what movie or movies they have felt compelled to see twice before they were available for viewing elsewhere.",
        "upvotes": 826,
        "comments": 2348,
        "media": null,
        "permalink": "/r/movies/comments/1m585th/have_you_ever_paid_to_see_a_movie_twice_in_a/"
    },
    {
        "id": "1m4r9t3",
        "author": "bluenowait",
        "title": "‘Pee-wee’s Big Adventure’ Original Red Bike Acquired by the Alamo",
        "content": "",
        "upvotes": 5249,
        "comments": 246,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CxoSr0H-xNJU4lr5MFZrAP10xFlEXQdK1H-RedyOIdY.jpeg?auto=webp&amp;s=002cbce532100c0a8026eb4d45a002bebfbd5371"
        },
        "permalink": "/r/movies/comments/1m4r9t3/peewees_big_adventure_original_red_bike_acquired/"
    },
    {
        "id": "1m4xr78",
        "author": "Gimetulkathmir",
        "title": "Most Egregious Case of \"For the Audience Only\"",
        "content": "My wife is currently watching a TV show and the episode is about a group of people who are kidnapping people and selling them. One of the women who is imprisoned is revealed to be the mastermind of the entire operation at the end of the episode. At one point, other members of the group come and take her away from an actual captive, but they still continue to act like she's a captive as well long after they're away from the person. There is absolutely no reason for them to do this except to continue to dupe the audience into thinking this woman is a captive as well.\n\nSo, this got me thinking about other things like this. Another one I can recall is in a horror movie where the character on screen is facing to the left and the creature pops out from behind him in a jump scare that is SOLELY for the camera. The character would never have seen her or even knew she was there.\n\nWhat are some other examples of this?\n\n  \nEDIT: Yes, it's an episode of Criminal Minds, for those asking.",
        "upvotes": 1594,
        "comments": 512,
        "media": null,
        "permalink": "/r/movies/comments/1m4xr78/most_egregious_case_of_for_the_audience_only/"
    },
    {
        "id": "1m4wbk0",
        "author": "BunyipPouch",
        "title": "First Poster for Animated Fantasy-Horror 'Dog of God' - It depicts a 17th century witch trial in Eastern Europe that uncovers a werewolf within a devout community.",
        "content": "",
        "upvotes": 1569,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n4ofabplo2ef1.jpeg?auto=webp&amp;s=9d5f9a9622942991ab8b570a735fc267b8841f21"
        },
        "permalink": "/r/movies/comments/1m4wbk0/first_poster_for_animated_fantasyhorror_dog_of/"
    },
    {
        "id": "1m55rbl",
        "author": "EuphoricButterflyy",
        "title": "I’ve always been a Superman fan who always skipped over “Superman Returns” (2006) until yesterday…",
        "content": "All I’ve ever heard about this film is bad things since it first came out. People still will tell me it’s terrible and that Routh is a terrible Superman etc. I finally decided to watch it tonight, and disagree. I’m actually upset I never watched it sooner.\n\nIs it perfect? Far from it. But even the Reeve films weren’t perfect. I’ve seen people say it’s all too “convenient”, but so were the Reeve films? I mean Reeve literally rewound time in the first one to fix everything.\n\nThis film feels like a love letter to the Reeve films and I loved that. Routh gives an honorable and respectful performance as Reeve’s Superman. He plays Superman with this gentleness and warmth I liked. His Superman feels warm. I found him lovely. It’s a shame he got most of the hate when the film came out. Had Reeve lived to see this film made I think he would be proud of Routh’s work. He was honorable and respectful in his portrayal.\n\nKate Bosworth is miscast as Lois Lane, as she is too young and dare i say… too pretty? Bosworth was only 23 when cast. They definitely needed someone who looked a bit more mature, but she did best with what she was given. Her Lois is a bit whiny though?\n\nKevin Spacey actually looks like he’s having a blast playing Luther and he plays it up just like Gene Hackman.\n\nParker Posey is perfection here.\n\nI don't think people REALLY understand that ‘Superman Returns’ (2006) was a direct sequel to ‘Superman 2.’ That's why Luthor knows where the Fortress of Solitude is and how Superman knocked up Lois.\n\nMost people I hear say that they just didn’t really like how Brandon Routh portrayed Superman, but Brandon Routh captured the spirit of Chris Reeves perfectly. He looks just like him at that age (Reeves was also in his late 20s during the filming of the first 2 movies) and totally sold me on this being the same boy scout/awkward dork character from those films.\n\nI agree Kate Bosworth was miscast being too young to play Lois (she was 23, while Margot Kidder was older than Reeves during the earlier movies), but as far as acting goes she, much like Routh, captured old Lois very well.\n\nLuthor seducing a rich old lady to get him out of jail and inherit her money sounds like something he'd do in the past movies. It's absurd comedy! A staple of the old films.\n\nAnd most people complain that the ending was quick and convenient when that was the case with the earlier films as well (time reversal, anyone?).\n\nOverall, I love this movie and it gets more shit than it deserves.",
        "upvotes": 440,
        "comments": 225,
        "media": null,
        "permalink": "/r/movies/comments/1m55rbl/ive_always_been_a_superman_fan_who_always_skipped/"
    },
    {
        "id": "1m4vyob",
        "author": "Somnambulist815",
        "title": "The quickest you realized you were watching a bad movie",
        "content": "What movie did you have the fastest realization of \"oh, I made a mistake\"? This question was spurred by Eddington, which (in my opinion) quickly revealed to have not much to say, and not say it very well, in the first scene we get with Joaquin.\n\nHowever, a movie which hit me with regret from the very first line of dialogue was \"The New Mutants\". I know, all the signs of poor quality were flashing to begin with, but it was at the height of FoX-Men hate, so I went in with an open mind. But the second I heard that flat delivery of that elementary school parable, I knew I was in trouble.",
        "upvotes": 1572,
        "comments": 2096,
        "media": null,
        "permalink": "/r/movies/comments/1m4vyob/the_quickest_you_realized_you_were_watching_a_bad/"
    },
    {
        "id": "1m4wdi7",
        "author": "AnomalyDocs",
        "title": "Rap World is a hilarious slice of life mockumentary by Connor O'Malley about three stoners trying to record a hiphop album in one night back in 2009 - free on YouTube!",
        "content": "",
        "upvotes": 1186,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/48KiL3nEVGM997q6PPhDlNNm8jBRlPS6nPXyHB6sdHA.jpeg?auto=webp&amp;s=f57fa048f44265c5e3752e400dc07cb2356cf0ec"
        },
        "permalink": "/r/movies/comments/1m4wdi7/rap_world_is_a_hilarious_slice_of_life/"
    },
    {
        "id": "1m4xvff",
        "author": "ubcstaffer123",
        "title": "Long-lost Inuit animation films restored and released after 50 years",
        "content": "",
        "upvotes": 889,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z0nPk2bCuPqQKzfR4OwLDq7ulAwhQf23JJ-ofFRGvWE.jpeg?auto=webp&amp;s=5c42b30d6e22a667bd29ebe7bacc15b167f13de7"
        },
        "permalink": "/r/movies/comments/1m4xvff/longlost_inuit_animation_films_restored_and/"
    },
    {
        "id": "1m5as0w",
        "author": "JordyCANsurf",
        "title": "What was your “definitely not supposed to be watching this” movie?",
        "content": "Example. I’m sick and home from school at 10 years old. It’s early morning and I’m watching the syfy channel.\n\n“From Dusk till Dawn” starts playing. Confused on how this is syfy channel related but I’m caught up in the opening gunfight at the Gas station.\n\nContinue watching, confused but caught up in the brothers storyline and how they have kidnapped a family. Forgetting I’m on the syfy channel at this point.\n\nWe arrive at the strip club across the border, Salma Hayek is dancing on the table with a snake… I’m watching from behind the covers, confused, pretty sure I’m not supposed to be watching this, but still caught up in the wackiness of the location.\n\nSalma Hayek turns into a snake vampire and takes a bite out of Quentin Tarantino. I remember I shot out of bed, caught off guard, barely able to comprehend the turn the movie just took but MAN, I sat glued to that screen for the remainder of the movie. It was the coolest thing I’d ever seen.\n\nI remember trying to explain what I had watched to my dad later that day and him stopping me halfway and saying “you watched From Dusk Till Dawn by yourself?!?!”\nThat weekend he bought it on dvd and we watched the uncut version together, I remember the general message from my dad being “you probably shouldn’t have watched that, but it is a cool flick huh?”\n\n\nWhat was your similar experience, and what movie was it?",
        "upvotes": 95,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1m5as0w/what_was_your_definitely_not_supposed_to_be/"
    },
    {
        "id": "1m572xo",
        "author": "Substantial-Alps5746",
        "title": "The Nightingale/movies that are truly horrifying…",
        "content": "I’m wondering what movies people have found truly horrific, scarring, or traumatic?\n\nI’m a true horror fan; I’m mostly desensitized to film themes or tropes, and can handle most films…it’s quite rare for me to be bothered by a movie. I tend to find horror enjoyable (sounds weird to some I’m sure) but the movie that has horrified me and truly made me feel destroyed mentally was Jennifer Kent’s: The Nightingale. It’s interesting this film isn’t a “true horror” film…I just have never been haunted by a movie until I watched this.\n\nIf you feel the need for a movie to truly move you and change you please watch it, but if you have triggers definitely look up the themes of the movie. By no means does the Nightingale glorify the messed up themes…I want to know what movies have scarred you for life; if you’ve watched The Nightingale I would like to know your opinion (protect spoilers). I haven’t met anyone, or had any friends who’ve seen this movie without my recommendation.",
        "upvotes": 112,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1m572xo/the_nightingalemovies_that_are_truly_horrifying/"
    },
    {
        "id": "1m4wc7o",
        "author": "darth_vader39",
        "title": "50 Years Ago, Robert Altman’s Tumultuous and Transcendent ‘Nashville’ Told the Story of What America Would Become",
        "content": "",
        "upvotes": 352,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JtqpxJo3eGBoMgHJc6WfiX71Yb5pjLOU_A2uN7f1RR4.jpeg?auto=webp&amp;s=b63ed921eae3099fe4cd0f6b7737f166279361d2"
        },
        "permalink": "/r/movies/comments/1m4wc7o/50_years_ago_robert_altmans_tumultuous_and/"
    },
    {
        "id": "1m57gif",
        "author": "Illustrious_Slide_30",
        "title": "Click (Adam Sandler)",
        "content": "Anybody think this is one of the saddest movies of all time. Like seriously, I can’t even watch it. Tried to watch it this afternoon, started balling when his dad tried to show him the coin trick and it was the last time he saw him. It is insanely tragic of a movie. \n\nThe end also is insanely sad. Where he’s just laying there on the road yelling out to his kids. ",
        "upvotes": 69,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1m57gif/click_adam_sandler/"
    },
    {
        "id": "1m4r573",
        "author": "BunyipPouch",
        "title": "Aria Covamonas, Acclaimed Mexican Filmmaker, Dies At 46 - The celebrated Mexican filmmaker and experimental animator was known for her radically non-linear works and appropriation of public-domain media.",
        "content": "",
        "upvotes": 525,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HL73e3PrcKY_Or1-ZPHJFVeq-EhxqSZOevNvfHT2zwo.jpeg?auto=webp&amp;s=0d8610722531da56fbe8f2850c2d6bd4447d0a0d"
        },
        "permalink": "/r/movies/comments/1m4r573/aria_covamonas_acclaimed_mexican_filmmaker_dies/"
    },
    {
        "id": "1m4pcut",
        "author": "BenFranklinsCat",
        "title": "Time Travel Movies using the \"Fixed Stream\" Formula",
        "content": "I love time travel as a story trope, but I'm hella picky about it.\n\nMy favourite time travel movies are where time is a fixed loop of some kind - there's not multiple branches to consider or any hokey \"paradox correcting\" fading-out-of-existence stuff. Time Travel where time travel must happen because it has happened, even if that might invoke some kind of bootstrap paradox.\n\nI already know Predestination, Primer, Time Crimes, Triangle and at a push you could include Time Trap and Coherence ... but are there any other little hidden ones I don't know about?",
        "upvotes": 442,
        "comments": 448,
        "media": null,
        "permalink": "/r/movies/comments/1m4pcut/time_travel_movies_using_the_fixed_stream_formula/"
    },
    {
        "id": "1m570uu",
        "author": "Elegant_War_10",
        "title": "What’s one thing from a “bad” movie that you’d absolutely die for?",
        "content": "Could be a song, a line, a cameo—anything.\n\nFor me, it’s “Kiss from a Rose” from Batman Forever. I used to listen to that song e v e r y single day. Yeah, the movie’s a disaster, I know, but that song? It gave life to so many of my mental music videos and teenage fantasies. It honestly made me a little bit happier during those years :) \nSo even if the movie flopped, I’ll always be thankful it gave me that.\n\nWhat’s yours?",
        "upvotes": 45,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1m570uu/whats_one_thing_from_a_bad_movie_that_youd/"
    },
    {
        "id": "1m58b3z",
        "author": "letsgopablo",
        "title": "Friendly reminder that Kubrick made a non-linear heist noir and it's AWESOME",
        "content": "If you haven't seen Kubrick's The Killing (1956), like I didn't until about a day ago, I think you're missing out on one of the best noir thrillers to come out of the genre. Bleak, expertly crafted, and tense all throughout its 84 minute run-time. Barely any fat on this baby. Jim Thompson's snappy fast-paced dialogue is music to the ears, and the fragmented story-line, jumping back and forth in time and between character POVs, is masterfully done. Kubrick's cold and detached camera lends an atmosphere of foreboding, culminating in an iconic heist sequence and an ending that is just the perfect capstone to a film dripping with dread and cynicism. Just wanted to gush about this gem. I might be late to the party here but I'm glad I showed up. Give it a watch, folks.",
        "upvotes": 36,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1m58b3z/friendly_reminder_that_kubrick_made_a_nonlinear/"
    },
    {
        "id": "1m589hj",
        "author": "Talon-Action",
        "title": "A Star is Born (2018)",
        "content": "I’ve been thinking about this for years now, and I still can’t wrap my head around how Bradley Cooper didn’t win Best Actor for A Star is Born. This film is an absolute masterpiece and easily ranks among the finest movies of the past decade and a half.\nCooper didn’t just act in this film – he directed it, co-wrote it, produced it, and performed all his own vocals live. The emotional depth he brought to Jackson Maine was extraordinary. Every scene crackled with authenticity, from his struggles with addiction to the tender moments with Ally. You could feel the weight of his character’s pain and vulnerability in every frame.\nAnd then there’s the technical achievement. Cooper transformed himself physically and vocally for the role, spent years learning guitar and developing Jackson’s specific singing style, and created some of the most emotionally resonant musical performances ever captured on film.\nI understand Bohemian Rhapsody was a cultural phenomenon, but let’s be honest about what we’re comparing here. Rami Malek delivered a solid performance, but he was lip-syncing to Freddie Mercury’s vocals for most of the film. Meanwhile, Cooper was singing live, in character, creating original music that became genuinely iconic.\nDon’t get me wrong – Malek’s physical transformation and embodiment of Mercury was impressive. But when you stack it against Cooper’s multi-faceted artistic achievement in A Star is Born, it feels like the Academy missed recognizing one of the most complete creative accomplishments in recent memory.\nThis still ranks as one of the most puzzling Best Actor decisions in Oscar history. What are your thoughts? Am I being too harsh on the Bohemian Rhapsody win?",
        "upvotes": 30,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1m589hj/a_star_is_born_2018/"
    },
    {
        "id": "1m4xuvo",
        "author": "109267",
        "title": "The 13th Warrior - I am only counting 12 though?",
        "content": "So I just watched The 13th Warrior, but as far as I counted, there were only 12?  \nDuring the scene where they introduce al 13 Warriors, I also only counted 6, when the Translater said 8, but that is a different Issue.\n\nThey clearly went with 13 Warriors (as Antonio Banderas is the Titular 13th Warrior).  \nThey lost 2 men during the initial night attack when they were 'asleep'--&gt; 11  \nThey lost 4 men during the subsequent City defense --&gt; 7  \nThey lost 1 men who stayed behind after they killed the Mother in the cave --&gt; 6  \nBut then we are left with:  \nThe King  \nAntonio Banderas  \nThe Northman that spoke Greek  \nThe Scout Guy  \nThe Redhead.  \nThat's 5.  \nAt the end those are also the only 4 of them that surround the Dead King on his 'Throne'.\n\nSo where is the actual 13th Warrior?",
        "upvotes": 76,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1m4xuvo/the_13th_warrior_i_am_only_counting_12_though/"
    },
    {
        "id": "1m421w5",
        "author": "stekene",
        "title": "Voice actors demand regulation on AI voice cloning",
        "content": "&gt; If no legislation is passed, she said voice dubbing done by humans \"will disappear,\" at the expense of millions of artists' jobs.\n\n&gt; But human voice actors still have the edge, said Mario Heras, dubbing director for video games in Mexico. AI cannot make dialogue \"sound funny, broken, off -- or alive,\" he said.\n\n**AI voice-cloning without permission can't be tolerated, why is it allowed?**",
        "upvotes": 9999,
        "comments": 719,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1HrLsfbryjwYjEmLx0MkCSP5D0aCUbs0W6ItgqODylY.png?auto=webp&amp;s=a6291591af64edf07ef02a97322453c19b22029f"
        },
        "permalink": "/r/movies/comments/1m421w5/voice_actors_demand_regulation_on_ai_voice_cloning/"
    },
    {
        "id": "1m4dnrm",
        "author": "SituationAdmirable76",
        "title": "What movies suffered because they were released the same year as juggernauts",
        "content": "For those that don’t know Brady &amp; Jordan are athletes who won a lot of championships while also preventing a lot of great players from winning one.\n\nTo relate this to film what are some great movies that might’ve done better during award season had they not been released the same year as an absolute fucking juggernaut \n\nAn example that comes to mind is Chinatown unfortunately being released the same year as the godfather part 2. What are some other examples of this happening?",
        "upvotes": 1554,
        "comments": 846,
        "media": null,
        "permalink": "/r/movies/comments/1m4dnrm/what_movies_suffered_because_they_were_released/"
    },
    {
        "id": "1m5c2ex",
        "author": "Rabbitpyth",
        "title": "What moment in a movie gave you a major heartbreak and still lives with you?",
        "content": "I think the most common answer to this would be Leo in titanic which is true but I was thinking about more recent ones and I thought about Robert Downey Jr in Avengers Endgame. \n\nThe way that he started the whole universe with his solo movies and then sacrificed himself. Long live Iron Man.\n\nShare your thoughts.",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1m5c2ex/what_moment_in_a_movie_gave_you_a_major/"
    },
    {
        "id": "1m4f9wx",
        "author": "Grouchy-Step-7136",
        "title": "Schwarzenegger fan, but never saw Commando (1985) until now…",
        "content": "I’m not sure why this one flew under my radar for so long. It’s Arnold in all of his mid-80s glory, muscles glistening and rippling in all the right ways. \n\nJohn Matrix (Arnold’s character) is a badass former military commando who just wants to settle down and be a dad to his daughter Jenny (Alyssa Milano), but he’s made some enemies along the way, and they’re looking for trouble.\n\nDude… John Matrix kills like 412 people. He’s firing guns with infinite bullets. He lays down maybe a half dozen small mines, hits the remote, and explosions go off for like 6 minutes.\n\nIt’s everything I wanted it to be. 8.5/10",
        "upvotes": 1057,
        "comments": 496,
        "media": null,
        "permalink": "/r/movies/comments/1m4f9wx/schwarzenegger_fan_but_never_saw_commando_1985/"
    },
    {
        "id": "1m4pvjc",
        "author": "Negligent__discharge",
        "title": "Best of the Worst: Star Slammer, Talos, and The Apple",
        "content": "",
        "upvotes": 157,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JWVT7QedtOZRWw7Rvtpx3X3mwwrM-VZOskNnYRRr8nc.jpeg?auto=webp&amp;s=2af4e0c6b5e25a7aabd2498b61e6bebc7c3689c7"
        },
        "permalink": "/r/movies/comments/1m4pvjc/best_of_the_worst_star_slammer_talos_and_the_apple/"
    },
    {
        "id": "1m4zv9j",
        "author": "Capable_Handle_4763",
        "title": "Which actors are not only amazing on screen but also super interesting in real life?",
        "content": "Being a great actor is one thing, but having a unique and fascinating personality is another. \n\nSome actors manage to do both  they give incredible performances while also standing out as genuine, funny, or just plain cool in real life.\n\n Either it can be their hilarious interviews or cool personality something about them makes them standout or someone u wanna hang out and being real life friends with. \n\n",
        "upvotes": 40,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1m4zv9j/which_actors_are_not_only_amazing_on_screen_but/"
    },
    {
        "id": "1m4ta7n",
        "author": "DietDewymountains17",
        "title": "What would you put in the pantheon top five of romantic comedies of all time?",
        "content": "My top 5 is as follows \n\nPhiladelphia story \nIt happened one night\nWhen Harry met Sally \nThe big sick\nFour weddings at a funeral\n\nThe only one there I think may be controversial is the big sick but I think it's maybe the best modern look at falling in love and dealing with family at the same time.  \n\nPhiladelphia story and it happened one night are the classics.  When Harry met Sally set the modern archetype.  Four weddings in a funeral was just perfect.  ",
        "upvotes": 88,
        "comments": 242,
        "media": null,
        "permalink": "/r/movies/comments/1m4ta7n/what_would_you_put_in_the_pantheon_top_five_of/"
    },
    {
        "id": "1m4ww7d",
        "author": "Allalise",
        "title": "What obscure quote lives in your head rent free?",
        "content": "Not the classics, but some lesser known line that just always appealed to you, or that somehow got stuck in your brain.\n\nMine is from the Boondock Saints. I haven’t watched that movie in ten years at least, but I can still hear Willem Dafoe say, “That's two sound theories in one day, neither of which deal with abnormally sized men. Kind of makes me feel like Riverdancing.” The rhythm and absurdity of it just rubs me the right way.\n\nWhat’s yours?",
        "upvotes": 53,
        "comments": 404,
        "media": null,
        "permalink": "/r/movies/comments/1m4ww7d/what_obscure_quote_lives_in_your_head_rent_free/"
    },
    {
        "id": "1m4b36x",
        "author": "Bennett1984",
        "title": "12 Monkeys, Ghost in the Shell, Species, and the Essential Sci-Fi Movies of 1995",
        "content": "",
        "upvotes": 1402,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8ZVWTo64sx7nuNBtngUN-wPKLPglhg_wBi7HNaGFiS4.jpeg?auto=webp&amp;s=d75aff76ee65771c13d4c2b4667c70f2162fcd83"
        },
        "permalink": "/r/movies/comments/1m4b36x/12_monkeys_ghost_in_the_shell_species_and_the/"
    },
    {
        "id": "1m4npzw",
        "author": "Visrut__",
        "title": "Movies like Due Date, where a buttoned-up guy meets someone wild and ends up questioning life?",
        "content": "I just rewatched *Due Date* (2010)*,* and this is what I think and want some more suggestions on movies like these:\n\n&gt;!Peter (RDJ) has his life on autopilot, super organized, always in control. Then Ethan shows up: unpredictable, wild, and goes with the flow. He throws Peter off balance, and Peter starts thinking, \"Maybe life doesn’t have to be so planned? Maybe I can loosen up?\"!&lt;\n\nDoes that sound like the core of *Due Date*? If so, what other movies show a straight-laced character getting shaken up by someone opposite, leading to personal growth or just hilarious chaos?\n\nIt's like a \"someone flips your world upside-down\" vibe. Thank you so much to everyone who suggested can't reply personally, but thanks.",
        "upvotes": 137,
        "comments": 283,
        "media": null,
        "permalink": "/r/movies/comments/1m4npzw/movies_like_due_date_where_a_buttonedup_guy_meets/"
    },
    {
        "id": "1m563z7",
        "author": "ReturnOneWayTicket",
        "title": "What are your 5 most watched movies?",
        "content": "These are the 5 that I'll always watch no matter what, so I've always kept count of each time I watched one of them. Sometimes I'll watch one after the other or oddly, rewatch one as soon as it finishes. \n\nI'll be watching Police Academy 5 today for I think, the 14th time. That'll be enough times but I really do enjoy that movie. Anyway, here's mine...\n\nCrackerjack - 104\n\nThe Blues Brothers - 72\n\nCube - 59\n\nBad Boys 2 - 33\n\nChristine - 17",
        "upvotes": 14,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1m563z7/what_are_your_5_most_watched_movies/"
    },
    {
        "id": "1m5bvcq",
        "author": "SergeantGunsalsa",
        "title": "what’s a movie you watched way too young that totally messed you up, but now you love it because of how weirdly formative it was?",
        "content": "i’ll go first: donnie darko. had no idea what was going on, couldn’t sleep for days, but now it’s one of my favorite movies ever.\n\ncurious what everyone else’s “accidentally traumatized but now it’s a favorite” movie.  the kind you were way too young to understand, but it stuck with you and ended up shaping your taste forever.",
        "upvotes": 5,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1m5bvcq/whats_a_movie_you_watched_way_too_young_that/"
    }
]