[
    {
        "id": "1qdvz3j",
        "author": "reddituser0912333",
        "title": "Reminder: use the Open Thread for random thoughts, frustrations, ideas on where to go from here, etc.",
        "content": "Hey, everyone. No one is happy with the current happenings at the club with regard to the recent losses, sacking of Xabi, effort from some players, etc. I want to remind this sub of our rule to use the open thread (OT) for these posts. The purpose of the OT is to have these discussions, and allows for the home page to stay relatively clean. Sometimes we will keep posts up that have 'gained enough traction' (i.e., enough comments, upvotes) but we will be removing posts that do not fit the home page no matter what at this time. Thank you.",
        "upvotes": 29,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdvz3j/reminder_use_the_open_thread_for_random_thoughts/"
    },
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 6696,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qem0fb",
        "author": "Resident-Stretch9723",
        "title": "''Left ? Right? Middle? No Problem , I Just Want To Play''",
        "content": "why current players in the team lack this enthusiasm?",
        "upvotes": 1345,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xvop03qhvqdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qem0fb/left_right_middle_no_problem_i_just_want_to_play/"
    },
    {
        "id": "1qew1vf",
        "author": "Fit_Wrap_9580",
        "title": "I dont even know what goes through his head to be honest",
        "content": "In this single instance, I was begging him to just pass it through, like I dont even know what goes through his head when he plays like this. at this moment we were tied too, \n\nSimilarly in the goal which he scored it is one of the best goals ever, as he went past de jong, Gonzalo was running with amount of space, but he went solo good thing he scored, if not people would have burnt him alive.\n\nPeople say he played really well and was glazing every where, but apart from the goal, I dont think he played really well. And after 70th minute he was walking, and people criticize Xabi for taking him off, how couldnt he, these kind of dumb decision from him lead to that.",
        "upvotes": 188,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2f3qvix0psdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qew1vf/i_dont_even_know_what_goes_through_his_head_to_be/"
    },
    {
        "id": "1qep4d2",
        "author": "o6ohunter",
        "title": "The footage of the Albacete fan throwing a banana towards Vini",
        "content": "",
        "upvotes": 256,
        "comments": 83,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jiw9rjzmfrdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qep4d2/the_footage_of_the_albacete_fan_throwing_a_banana/"
    },
    {
        "id": "1qeluvy",
        "author": "DamnThatsInsaneLol",
        "title": "Arbeloa is living Raúl's dream: Real Madrid legend Raúl spent 7 years coaching his beloved club's youth team, winning the UEFA Youth League &amp; San Gabriel Cup. He left this summer after losing patience with the management and was succeeded by Arbeloa, who got promoted to the first team 6 months later",
        "content": "",
        "upvotes": 251,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qeluvy/arbeloa_is_living_raúls_dream_real_madrid_legend/"
    },
    {
        "id": "1qekgt0",
        "author": "OwnWitness2836",
        "title": "Álvaro Arbeloa: \"I valued Vinícius's EFFORT because I know where he came from; for me, the efforts he made, the relentless facing up to challenges, carrying the team on his back, demanding the ball over and over, that's what being a LEADER is, and that's what I want from him.\"",
        "content": "",
        "upvotes": 256,
        "comments": 251,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jpmbo320mqdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qekgt0/álvaro_arbeloa_i_valued_viníciuss_effort_because/"
    },
    {
        "id": "1qeomwf",
        "author": "OwnWitness2836",
        "title": "Álvaro Arbeloa: \"I have a lot of respect for the Bernabéu crowd, I understand that they're hurting, but I'm going to ask them to support their players.\"",
        "content": "",
        "upvotes": 105,
        "comments": 95,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vlour5hicrdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qeomwf/álvaro_arbeloa_i_have_a_lot_of_respect_for_the/"
    },
    {
        "id": "1qeg8zl",
        "author": "Ready_Ad_1353",
        "title": "Florentino Perez identifies Argentina NT coach Lionel Scaloni as possible candidate for Madrid’s next manager. The board wants a coach capable of handling a dressing room filled with elite personalities &amp; they believe he fits that description. His contract with Argentina expires after the World Cup",
        "content": "",
        "upvotes": 239,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5MGIJCFIxB_YSCdb1fVcfxFELgKaNsSfY_YF71doN0U.jpeg?auto=webp&amp;s=0c30649d155bd47d3aff1253203814b7d0ace494"
        },
        "permalink": "/r/realmadrid/comments/1qeg8zl/florentino_perez_identifies_argentina_nt_coach/"
    },
    {
        "id": "1qea5am",
        "author": "Big-Treacle-9203",
        "title": "List of decisions Jose Mourinho took when he was given complete control of the club by Florentino",
        "content": "People often forget our Golden period only started after Jose Mourinho took Over Real Madrid and demanded literally complete control over the club including staff, transfers, youth, and management. There is no other manager who Perez surrendered the club to other than Jose.\n\nWhen Jose arrived, he wanted us to play counter attacking football to compete against Barcelona tiki taka and here are some decisions he took..\n\n* Firstly changed the formation of Real’s 442 that they played since 2000s to a 4231 or 433.\n* Got rid of Guti, who had issues with managers before..and Raul,by promising only a bench role and nothing more..even though Jose wanted him to stay.\n* Signed Ozil to play no 10, and benched a Balon D’or winner Kaka.\n* Signing Di Maria as a winger, Khedira as CDM despite having Lassana, Gago and Granero and signing Ricardo Carvalho despite having Pepe, Garay and Raul Albiol. Important to note Ricardo Carvalho was got to bring in some leadership to the group \n* Got the Castilla coach Alberto Toril sacked because he didn't like how Jese and Nacho were being developed, and wanted to play a young Dani Carvajal in the copa Del Rey in 2011\n* Got Jose Valdano Sacked cause he had criticised Mourinhos tactics before he even joined Madrid. Mourinho eventually became head of Football operations\n* Got Zidane to Be director of football, then got him demoted because of Zidane's criticism\n* Benched Iker Casillas for performance and other reasons, and played Adan.. A Castilla GK to show Iker that nobody is bigger than the team. Then made Diego Lopez his starter even after Iker returned from Injury.\n* Partially converted Ronaldo to a Striker, and Ramos to a full time CB and unleashed a monster out of Ramos and promoted him to captain despite having a feud with him\n* Showed several players their place.. Iker is one example, Replacing Pepe with a young Varane, Made Arbeloa permenant RB in the second half of 2013, Replaced Marcelo for Coentrao to suit his tactics\n* Literally Fought for and got Luka Modric over Santi Carzorla, and David Silva\n* Starting 11 was purely merit based, Benzema had to compete Higuain, Pepe with Varane, Kaka with Ozil, Marcelo with Coentrao. Each place was earned through merit.\n* He went out of the dugout before the game started so that the Bernabeu could boo him and not the players.. for 40 minutes.\n* Openly took on players in the dressing room such as Ozil, Kaka, Benzema, Pepe, Granero, Ramos, Iker, and even Ronaldo if they weren't chasing, tracking back, or making defensive errors.\n* Benched his whole defence in 2013 Jan after seeing it wasn't working..from Iker, Arbeloa,Pepe, Carvalho, Marcelo..to Deigo Lopez, Arbeloa, Ramos, Varane and Coentrao.\n\nUltimately, Ramos and Iker threatened to leave and the entire dressing room revolted against Mourinho. Once he left, Mourinho mentioned that its more about dealing with politics than with football at Real. Just goes to show the problems a manager has to face when he manages the club.\n\nNot advocating a Mourinho return, just highlighting the politics he had to endure and the decisions he took when he was here. If any manager took one of the decisions today, he will have terrible consequences for any manager.\n\nFrom 8 consecutive R16 UCL eliminations to teams like Lyon and Roma, to 3 consecutive UCL SEMIs is a big achievement.\n\nAncelotti succeded cause Mourinho had already prepared the players mentally and tactically. But even he followed what the management ordered him to\n\n* Played Diego Lopez as his La Liga GK, but eventually had to play the worst GK of the 2014 WC, Iker Casillas as his main GK\n* Changed the whole formation to accommodate James Rodriguez and played Odegaard For PR. (Mentions in his book)\n\nAt the end, Real is now all about egos and politics..and sadly it looks like the Galacticos era is back where players hold the ultimate powers, then the club management and last is the manager",
        "upvotes": 650,
        "comments": 133,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qea5am/list_of_decisions_jose_mourinho_took_when_he_was/"
    },
    {
        "id": "1qet2ch",
        "author": "ManuMora98",
        "title": "[Basket] Win against Barça 80-61 after stepping up our defense performance, 2-0 against them in Euroleague, key if there are ties in the table",
        "content": "",
        "upvotes": 54,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z08pskti6sdg1.jpeg?auto=webp&amp;s=818a7553e3d05fbec9e473ad16f6cb5f7da63de8"
        },
        "permalink": "/r/realmadrid/comments/1qet2ch/basket_win_against_barça_8061_after_stepping_up/"
    },
    {
        "id": "1qds3xc",
        "author": "Oblongcashew",
        "title": "This is what indiscipline and impatience does to this club",
        "content": "",
        "upvotes": 4170,
        "comments": 249,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ntqsbm397kdg1.jpeg?auto=webp&amp;s=c10abc6e551a3dd820cdc29d037521408b6b55c9"
        },
        "permalink": "/r/realmadrid/comments/1qds3xc/this_is_what_indiscipline_and_impatience_does_to/"
    },
    {
        "id": "1qe4t9d",
        "author": "AccomplishedWatch834",
        "title": "Vini and Bale stats for Madrid!",
        "content": "",
        "upvotes": 625,
        "comments": 150,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m1xljx58qmdg1.jpeg?auto=webp&amp;s=b1be9b6d6ec9640de091d8d32513070d16d125b9"
        },
        "permalink": "/r/realmadrid/comments/1qe4t9d/vini_and_bale_stats_for_madrid/"
    },
    {
        "id": "1qez4e6",
        "author": "FergieBall_FC",
        "title": "Diario AS: Endrick speaks to AS: Brazilian \"could write a book about\" former Real Madrid boss | After scoring on his Lyon debut, the on-loan Real Madrid forward is set for his home bow on Sunday. Ahead of that game, he spoke exclusively to AS.",
        "content": "Diario AS: Endrick speaks to AS: Brazilian \"could write a book about\" former Real Madrid boss | After scoring on his Lyon debut, the on-loan Real Madrid forward is set for his home bow on Sunday. Ahead of that game, he spoke exclusively to AS. \n\nFrom Marco Ruiz \n\nFull Writeup: \n\n**How have your first days in Lyon been?** \n\nThey’ve been great. I arrived here champing at the bit. It’s been a tough stretch of work, learning everything I need to be able to play, and also handling things off the field with the transfer. I came to give everything for Lyon and finish the season better than the last one. I’m very focused on training, recovery, and my individual work, so I barely have time to leave the house. \n\n**Do you like the city?** \n\nIt’s beautiful. I already had the chance to eat at Bocuse, which is a legendary restaurant here. And I took a walk through the city center and visited the New Balance store. I want to see a lot more, but I also want to keep pushing forward in my preparation. \n\n**What kind of club is Lyon?** \n\nIt’s a highly respected club in France, with plenty of national titles. It has a huge amount of supporters throughout the country. The structure is excellent - we lack for nothing - and the squad is full of players from all over the world. Everyone has given me a really warm welcome; I’m honestly impressed. \n\n**Did you ever dream of such a special debut, scoring the winner in a cup victory over Lille?**\n\nFrom the first ball I touched, I tried to show that we were going to win. It wasn’t a dream. It was a plan. An aim. Go out there and win. Every one of us gave everything, and in attack, I always have to look for the goal. \n\n**How did you feel after that match? Was it a release?** \n\nI came away feeling really happy. Advancing to the next round was very important. Scoring in my first match was special; it’s something I’ve also been able to enjoy doing in other competitions. It shows I can adapt quickly to new tactics and different types of opponents. The group has helped me a lot, and I already feel like I’m part of everything here. \n\n**Was leaving Real Madrid on loan a hard decision to make?** \n\nIn our careers, we have to understand that time is very valuable. When we’re starting out, we need to grow, and to grow, we need to play. Recovering from my injury and all the work for my return kept me out for months, and I knew it would be difficult to get a steady run of matches in Spain. The hard part was the recovery. I came to France to do what I love. Train and play. Chasing our dreams is always a good thing. \n\n**Why did you choose Lyon?** \n\nIt offers everything I need. It plays in a major league, I’m in a country that’s a reference point for high-level soccer, it has a squad with players from all over the world, an excellent coaching staff that likes to attack with a very technical style of play, passionate fans, and it’s also a club with a strong history of success with Brazilian players. You really can’t ask for more. \n\n**How did Lyon head coach Paulo Fonseca sell the club to you?** \n\nPaulo called me and showed me how he likes to prepare his teams, what Lyon was doing, and what the club could do with my arrival. It was clear to me that he would help me a lot, that I’d have a group that would support me, and that I could help them too. He showed me that now we all have to be together. \n\n**Did you ask Madrid’s French players - the likes of Kylian Mbappé - for advice?** \n\nBefore the announcement, I talked to some players, especially the Brazilians who played at Lyon in recent years. After the announcement, several others reached out to talk to me about the club and French soccer. I got a lot of support and encouragement from many people, not just the French, and that was extra motivation. \n\n**What are your goals between now and the end of the season?** \n\nI have one goal each week: to start the next week better than the last one. That will push me to give everything for the club so we can win every match. My objective is to help the team win. If I manage that, I’ll get the best reward: goals and trophies. \n\n**Are you thinking about your return to Madrid?** \n\nI just got here! \\[laughs\\] I haven’t even played my first home game yet. This is not the time to think about going back. Right now, all I’m thinking about is a [full stadium](https://en.as.com/soccer/endrick-madness-hits-lyon-with-50000-tickets-sold-to-see-the-brazilian-f202601-n/) \\[against Brest\\] on Sunday and seeing our fans. At this moment, I don’t need to worry about anything except Lyon. \n\n**Is Real Madrid still at the center of everything for you?** \n\nMy relationship with Real Madrid hasn’t changed at all. Right up until the day I traveled to Lyon, the club gave me all the support I needed and helped with this move, responding to my request for a loan. \n\n**How tough were these last few months for you?** \n\nThey were tough - I can’t deny it. An injury that keeps a player off the field is always sad. You’re not doing what you love, and sometimes you don’t know when you’ll be able to do it again, or if you’ll do it as well. Fortunately, it wasn’t a serious injury, and the club paid close attention to the recovery process. \n\n**What was the worst moment you’ve had since you left Brazil to move to European soccer?**\n\nFinding out I’d miss the Club World Cup in the United States. That I wouldn’t be able to play for several months. The moment you discover you won’t be able to compete. Losses are painful, but they’re part of football. We all win and lose. Only a few win titles. No one wins all the time. But injuries take you out of the game. \n\n**And how do you evaluate your first season in Spain under then-Madrid boss Carlo Ancelotti?** \n\nI wish I could have helped more, but I think it was a season where I learned and grew a lot. I scored on my debut in several competitions and shared the field with some of the best athletes in the world - a world-class team. I can only thank God. \n\n**Do you think you can make Brazil’s World Cup squad?** \n\nI have to believe. I want to be better in the next game - and then the next, and the one after that. I’ve already been with the national team, and if I improve every week, I’ll be better than I was when I was first called up: more experienced and more mature, with more options in my game. I have to prove that I can help any team. \n\n**Did Ancelotti make a big impression on you?** \n\nI could write a book about everything I learned from him. He played at a high level for major clubs and has won everything as a coach in several countries. He taught us so much about the game, but also about the life of a soccer player. \n\n**Did you expect Xabi Alonso’s departure as Real Madrid head coach?** \n\nI made my debut here when the final was played in Saudi Arabia. I wasn’t able to follow the match. I’m very focused on Lyon now, but I’ll always be rooting for everyone who helped me in Madrid, wherever they are. Xabi was a brilliant player, a world champion, a champion as a coach in Germany, and he’ll soon be at a new club or national team. \n\n**And any message for the people who believe in Endrick and expect the best from him?** \n\nI thank God for all the support I receive and ask Him to bless me so I can bring joy to everyone who supports me - to everyone who enjoys watching me play. I fight for my family and teammates, but also for those who support me. ",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jt3J8tKYxV4slNR4Th0R9GZRWWdbNlg6n68s5Y7QTBQ.jpeg?auto=webp&amp;s=25a278c449cdfddd464e33999eec9f40260effcc"
        },
        "permalink": "/r/realmadrid/comments/1qez4e6/diario_as_endrick_speaks_to_as_brazilian_could/"
    },
    {
        "id": "1qehy5h",
        "author": "OwnWitness2836",
        "title": "Real Madrid Squad for Levante",
        "content": "",
        "upvotes": 58,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qehy5h/real_madrid_squad_for_levante/"
    },
    {
        "id": "1qedew3",
        "author": "Noob2Geek",
        "title": "Home-made 3d printed flag",
        "content": "What  do you think about this creation ? It's 3d printed but still flexible ! As a maker I'm quite happy with the result but I wonder if fans like it also ? It's my first experience with articulated design,  and of course , I decided to start with the biggest and most popular football club in the world 😀",
        "upvotes": 68,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5dxqa9h74pdg1.gif?format=png8&amp;s=268d8123b22a399f3a2a78c7fd2bf2722c7edca3"
        },
        "permalink": "/r/realmadrid/comments/1qedew3/homemade_3d_printed_flag/"
    },
    {
        "id": "1qek3qq",
        "author": "asensia-kopfschmerz",
        "title": "🎙️ Arbeloa reflects on Copa elimination🤔 \"Those who stayed in Madrid couldn't play or we assumed a risk if they did\"💪🏼 \"I understand that people look for culprits, but I work to find solutions\"",
        "content": "",
        "upvotes": 21,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qek3qq/arbeloa_reflects_on_copa_elimination_those_who/"
    },
    {
        "id": "1qe2ecl",
        "author": "asensia-kopfschmerz",
        "title": "Real Madrid hierarchy concluded after loss to Albacete that Xabi Alonso should’ve been fired earlier",
        "content": "There is a thought installed in Valdebebas and he talks about the moment of the change of coach. Some bet on having done it in the first days of December. Others, that of prolonging the situation (they were the ones who won) waiting for that change that did not come. What happened in Albacete comes to give reason to those who thought after the match against Celta it was time for change. \"The decision to dispense with Xabi Alonso and recruit Álvaro Arbeloa should have been made earlier,\" was the most talked about on the tragic night of Wednesday, the one that began with fog and ended in darkness.",
        "upvotes": 198,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3dL5n8I3KLyCA44bk6APzn17luMhQe050wyFHBnc1pI.jpeg?auto=webp&amp;s=376d9383592569b75514226d9447623ed7bf0b76"
        },
        "permalink": "/r/realmadrid/comments/1qe2ecl/real_madrid_hierarchy_concluded_after_loss_to/"
    },
    {
        "id": "1qe81xm",
        "author": "International_Oil189",
        "title": "Toni Kroos: when did Real Madrid fans start appreciating him?",
        "content": "Hi,\n\nI am a Bayern fan from Germany and I am curious:\n\nHow has the view of Kroos as a Madrid player evolved over time?\n\nbecause in Germany, he was long disrespected as „Sidepass-Toni“, someone who could only play passes from side to side. Only late in his career did the general German public start to respect Toni as a great midfielder.\n\nSo I would like to know from Madrid fans:\n\nWas Toni always highly respected and appreciated? Or was he initially considered just a squad player to complement the Galacticos?\n\nAnd how do you view him today after his retirement in light of the current lack of playmaking + leadership in the team?",
        "upvotes": 82,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qe81xm/toni_kroos_when_did_real_madrid_fans_start/"
    },
    {
        "id": "1qdq028",
        "author": "dakdakdakp",
        "title": "Alvaro Arbeloa has decided that Federico Valverde will not play RB anymore, as he tries to ease locker room tensions. Valverde had already complained to the board about this issue previously, under Ancelotti &amp; Alonso. When Trent &amp; Carvajal are both injured, Arbeloa will now rely on academy players",
        "content": "",
        "upvotes": 638,
        "comments": 299,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xv7VGR7coa30V58iWjiFf2QtRLCt1nfDgdhu_C8JH90.jpeg?auto=webp&amp;s=4ae454e538e28d3a8f15590e8c607af2d594d924"
        },
        "permalink": "/r/realmadrid/comments/1qdq028/alvaro_arbeloa_has_decided_that_federico_valverde/"
    },
    {
        "id": "1qdtwqq",
        "author": "ace-s",
        "title": "The club executives are now blaming the players for the defeat last night. There could be very surprising decisions this summer. (My opinion: Then why sack Xabi then?)",
        "content": "",
        "upvotes": 401,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BPtEp_97lvWnPXVVFvlTbk0cFf-dr85zxMJ_Dmbmis0.jpeg?auto=webp&amp;s=e4d134ceb45ff5b05cd6739b81709724c3c8accd"
        },
        "permalink": "/r/realmadrid/comments/1qdtwqq/the_club_executives_are_now_blaming_the_players/"
    },
    {
        "id": "1qdpqjt",
        "author": "Ornery_Self_8758",
        "title": "Florentino Pérez's goal is to bring José Mourinho back to coach Real Madrid. Mourinho is currently causing a stir at Benfica to get himself sacked. He was the only coach Pérez has been happy with. Although he had arguments with Zidane, Ancelotti, Del Bosque etc, he always got along well with José",
        "content": "",
        "upvotes": 549,
        "comments": 198,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PVWpB4YQ9PLqinqfkMyH3YItPuSBISSXRGAoi9d3GvE.png?auto=webp&amp;s=a0c8135f0031b6b7a8dc9710f95005b06e58faf6"
        },
        "permalink": "/r/realmadrid/comments/1qdpqjt/florentino_pérezs_goal_is_to_bring_josé_mourinho/"
    },
    {
        "id": "1qdhfgk",
        "author": "tfisthh",
        "title": "Real Madrid’s Standard Has Hit Rock Bottom.",
        "content": "remember Cristiano Ronaldo getting booed.\nremember him being whistled even after scoring hat-tricks and winning Ballon d'Ors.\nand what did he do? \nhe stood in the middle of the stadium and listened to the boos like a man. no drama. no tantrums. no victim role.\ntoday, players with 1 goal in 20 games are openly clashing with a proven manager and acting bigger than the club \nthat tells you everything.\nReal Madrid's standards have hit rock bottom.",
        "upvotes": 1426,
        "comments": 116,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/61fk7xa24idg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdhfgk/real_madrids_standard_has_hit_rock_bottom/"
    },
    {
        "id": "1qdkiuw",
        "author": "GreatAngel10",
        "title": "Historic booing at the Santiago Bernabéu on Saturday",
        "content": " I’ve been following Real Madrid for almost 20 years, and these divas who think they’re superstars should thank Florentino Pérez every single morning for banning the Ultras Sur.\nI’ve seen Casillas get booed for poor performances. I saw Mourinho bench him, and he left like any other player. I saw Kaká a legend at Milan sit on the bench quietly, without drama or public complaints.\n\nI watched Cristiano Ronaldo, Özil, Sergio Ramos, Xabi Alonso, Di María, Benzema give everything for this club. I saw Benzema benched for Higuaín. I saw Marcelo lose his place. I saw Gareth Bale lose his place. And you know what? None of them gave interviews attacking the coach. None of them acted bigger than the club.\n\n\nI’m not talking only about Vinícius Jr, no no, I’m talking about all those players who step into the pitch just to show off, constantly demanding privileges and questioning the coach publicly.\nI’m not here to defend Xabi Alonso, Ancelotti, or anyone else. I’m here for the club. For REAL MADRID.\n\nThis is not Ibiza Beach FC. This is Real Madrid. Even when we lost, rivals respected us because of who we were. I remember when the Bernabéu erupted just by seeing the players walk onto the pitch because they transmitted hunger, intensity, and pride.\nNow we’re forced to watch players with egos bigger than Cristiano Ronaldo’s, but with the level of Lucas Vázquez with all due respect to him. These players don’t feel what we feel.\n\nAfter a bad match, they board planes, return to their mansions, sleep with supermodels, and wake up worried only about which Lamborghini, BMW, or Ferrari to drive to training. They want to win without running, without fighting, because they believe they’re untouchable.\nThey don’t respect the fans.\n\nAnd here’s a message for those who started “supporting” Real Madrid in 2018, 2019, or especially in 2022: this club did not start with Valverde, Vinícius, Courtois, Hazard, or anyone else.\nStop blindly defending players at all costs. Cristiano Ronaldo left this club for much less, after giving us years of joy and historic performances and even he didn’t get special treatment on the way out.\n\nDo you honestly believe anyone in this current squad has done even 30% of what CR7, Marcelo, Ramos, or Benzema did? Of course not.\nSo stop defending laziness. At Real Madrid, effort is non-negotiable. Some players deserve to be booed loudly until they understand the weight of this shirt and some need to be booed to the point of asking to be substituted.\nThis is REAL MADRID.\n\nI have much more to say, but that’s for another time.\nThank you to everyone who read this far.",
        "upvotes": 832,
        "comments": 105,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdkiuw/historic_booing_at_the_santiago_bernabéu_on/"
    },
    {
        "id": "1qdt2z7",
        "author": "Immediate-Drink2196",
        "title": "So we sacked xabi so that Arbeloa can copy Carlo's management style when we had Carlo and sacked him lol this club man",
        "content": "As above so below,  I can't believe the decision making of this club. Sacked Carlo Ancelotti because \"the vibes\" approach wasn't working so we get a tactician, who we sack for being a tactician then hire our reserve team coach who says he will try and copy Ancelotties \"vibes approach\". If neither structure and fluidity work, there is something wrong at much more deeper level. ",
        "upvotes": 252,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdt2z7/so_we_sacked_xabi_so_that_arbeloa_can_copy_carlos/"
    },
    {
        "id": "1qdke6g",
        "author": "FinancialWolverine94",
        "title": "Brahim enjoying the AFCON while RM having a hard time",
        "content": "Brahim Diaz really escaped what is happening to RM during these days, I cant imagine the presure and the frustration inside the team, they got knocked out of la copa del rey and lost another final against FCB.\n\nBrahim is living a career highlight with his national team, he scored during five games in a row, yesterday Morocco got the the AFCON final after beating Nigeria in a very difficult game, they will play the final against Senegal, two african giants ! his joy after the final whistle tells it all, he was in tears as well !\n",
        "upvotes": 540,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ke1e6dxjsidg1.png?auto=webp&amp;s=d48e4fec4048628ae29edceccb746e7f0efc4753"
        },
        "permalink": "/r/realmadrid/comments/1qdke6g/brahim_enjoying_the_afcon_while_rm_having_a_hard/"
    },
    {
        "id": "1qdoa7g",
        "author": "OwnWitness2836",
        "title": "Real Madrid believes they hit rock bottom in Albacete and are preparing important decisions for next season.",
        "content": "The club's management believes the defeat is historic and will demand an extra effort from the players to fight for the two remaining titles. Changes are expected for next season.\n\n--------------------------------------------------------------------------------------\n\nReal Madrid lost to Albacete in the Copa del Rey round of 16 on Wednesday. Álvaro Arbeloa 's tenure began in the worst possible way with a heavy defeat in the final minute and further doubts surrounding the team. They have lost two titles in just three days, and on Saturday they host Levante at the Bernabéu with the fans on edge and a chorus of boos hanging over them in the lead-up to the match.\n\nWhat does the club say after the elimination?\nAccording to Melchor Ruiz, there is great displeasure at Real Madrid because they consider the defeat against Albacete historic , on par with those against Alcorcón or Alcoyano, also in the Copa del Rey. They believe the performance at the Carlos Belmonte stadium was unbecoming of a club like Real Madrid. Furthermore, they see the players as primarily responsible for the club's current situation. They feel that the Albacete defeat marked the lowest point, and they are convinced that they must make important decisions for next season, some of which could be surprising. They now hope that Arbeloa, in whom they have complete confidence , will be able to turn things around and fight for the two remaining titles: La Liga and the Champions League. However, no signings will be made in the winter transfer window.\n\n--------------------------------------------------------------------------------------\n\nArancha Rodríguez added that Real Madrid were clear that a change of direction was needed , which is why Xabi Alonso was sacked. The defeat is painful, but Arbeloa will be judged on his performance in the upcoming matches, not on the Albacete game, as he had only been at the club for a day. There is indeed concern about the players' fitness, and it is believed that the team will improve once this issue is addressed. The belief is that they can compete for La Liga and the Champions League , and that most of the players are underperforming, with the exception of Courtois and Mbappé.\n\n--------------------------------------------------------------------------------------\n\nAt Real Madrid , the players, including Arbeloa, will be asked to make an extra effort for this final stretch. This will happen before the match against Levante, and one of the club's senior figures will be in charge. They will be told that the situation is critical and that from now on they must give 100%. They know they are being targeted on social media , and a chorus of boos is expected. This is the angriest moment for Real Madrid fans in recent years.",
        "upvotes": 302,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BPtEp_97lvWnPXVVFvlTbk0cFf-dr85zxMJ_Dmbmis0.jpeg?auto=webp&amp;s=e4d134ceb45ff5b05cd6739b81709724c3c8accd"
        },
        "permalink": "/r/realmadrid/comments/1qdoa7g/real_madrid_believes_they_hit_rock_bottom_in/"
    },
    {
        "id": "1qdy20u",
        "author": "No-Independent2522",
        "title": "[Albacete] Club expresses its complete condemnation of the disgusting xenophobic chants that a small group of fans uttered in the vicinity of the Carlos Belmonte stadium hours before the match and which, we insist, in no way represent our values.",
        "content": "",
        "upvotes": 96,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XnCbEgm6ZstNFVIpz2P8YGynanCGejnWKei1zAyS9Mg.png?auto=webp&amp;s=eb6900f8a005272bfbba719f359e17b8f375a612"
        },
        "permalink": "/r/realmadrid/comments/1qdy20u/albacete_club_expresses_its_complete_condemnation/"
    },
    {
        "id": "1qdgjhe",
        "author": "ace-s",
        "title": "Not even one Real Madrid player(including captains Carvajal, Fede and Vini) took the responsibility and spoke in the locker room after the match to lift morale. All the players were silent. Arbeloa had to come in and console them, saying they have to regroup and that he is the most to blame.",
        "content": "",
        "upvotes": 831,
        "comments": 121,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdgjhe/not_even_one_real_madrid_playerincluding_captains/"
    },
    {
        "id": "1qdou6m",
        "author": "Resident-Stretch9723",
        "title": "and real madrid 🤍!!!",
        "content": "",
        "upvotes": 191,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t51hvw8emjdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdou6m/and_real_madrid/"
    }
]