[
    {
        "id": "1jwessd",
        "author": "SonyPictures",
        "title": "We’re the Director (David F. Sandberg) and Producer/Writer (Gary Dauberman) for Until Dawn. AMA tomorrow, Friday April 11 at 11am PST on r/movies",
        "content": "[Until Dawn Movie Director David F. Sandberg, \\(Annabelle: Creation, Lights Out\\) and Producer\\/Writer Gary Dauberman, \\(Annabelle Comes Home, IT Chapter Two, The Nun\\) are answering all your questions tomorrow, April 11! Check back at 11am PST\\/2pm EST and get your tickets for Until Dawn, in theatres April 25th. ](https://preview.redd.it/ww5wbu6w34ue1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=7e6f083dfc27d3adee94d67a9a2970ca55d4746c)\n\n&gt;Thanks so much for all of the great questions! Make sure to see Until Dawn in theatres April 25. ",
        "upvotes": 58,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1jwessd/were_the_director_david_f_sandberg_and/"
    },
    {
        "id": "1jx8ze9",
        "author": "Sonia341",
        "title": "Warner Bros. Confirms New ‘Gremlins’ Movie and ‘Beetlejuice Beetlejuice’ Sequel",
        "content": "",
        "upvotes": 623,
        "comments": 244,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xFY8a4j0L1cSZ530I0Gl-todRIOanX6TGteWf6fBdaU.jpg?auto=webp&amp;s=01ec31b4c4f75831b59c3201d5816050cfc9f54e"
        },
        "permalink": "/r/movies/comments/1jx8ze9/warner_bros_confirms_new_gremlins_movie_and/"
    },
    {
        "id": "1jwz3xf",
        "author": "MarvelsGrantMan136",
        "title": "Ted Kotcheff, ‘Rambo: First Blood’ and ‘Weekend at Bernie’s’ Director, Dies at 94",
        "content": "",
        "upvotes": 2873,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mTtYFWDTgV0YcUUcM9yFFbYEo58Qgwz28xMFNDvwAYM.jpg?auto=webp&amp;s=13c6ca5b918259be907f21016f50ff0b10203e9f"
        },
        "permalink": "/r/movies/comments/1jwz3xf/ted_kotcheff_rambo_first_blood_and_weekend_at/"
    },
    {
        "id": "1jwyr9i",
        "author": "West_Conclusion_1239",
        "title": "Gladiator II made me finally understand the greatness and uniqueness of Russell Crowe's iconic performance.",
        "content": "When i was a kid and watched Gladiator, i obviously thought Russell Crowe was great as Maximus, but in the following years i never necessarily understood why he won an Oscar for it.\n\nIt's not the typical role and performance for which you are considered worthy of an Oscar, it's not a baity biopic about a real-life famous and beloved figure or an arthouse challenging auteur-driven project, it's an heroic figure in a sandal and sword blockbuster.\n\nWhat could be so great about this performance that you even win an Oscar for it??\n\nI didn't get it until recently when i saw on theaters the awaited sequel.\n\nGladiator II and Paul Mescal's performance in it (and i really like him as an actor) made me revalue and understand how hard it is to play convincingly an heroic role like that and how easy and effortless Crowe made it look like.\n\nIt's an iconic performance that still resonates today, but not necessarily for reasons the general public thinks about.\n\nHe managed to do character-actor work, immersing himself into this character and creating a three-dimensional human being out of this two-dimensional role and also imbue it with huge and rugged movie star charisma and such fierce intensity.\n\nWith Crowe's presence, there's such depth and gravitas into a role that on paper could have easily ended up being so flat and dull in the hands of many and many other actors, even good ones.\n\nHe's stoic, but never dull or uninteresting, he's absolutely magnetic, always elevating every scene with a ferocious potency.\n\nIt's almost a throwback to those powerful, big, theatrical, and commanding performances you would see on those sword and sandal epics of the 40s-50s-60s, but updated, modernized, and made accessible for the audiences of the new millennium.\n\nIt's a hard feat he pulled off, much harder than many people think, it's simply not a performance you can just imitate and replicate, and watching recently Mescal trying to inhabit that same type of stoic character made me realize it much more.\n\nRussell's performance wasn't just \"playing the hero\" or the good soldier, there was a personality and specific characterization you can't just copy, an entrancingly unique magnetism you can't just hope to recapture on film.\n\nHe's not just great, like i always thought, but quite frankly, no other actor in the world could have played Maximus and suddenly turn it into an Oscar winning role.\n\nIt's an unusual, unique, and absolutely deserved Oscar win, and a reminder of Crowe's unique talents and why he became a full fledged movie star after always having been a great actor.\n\nI hope one day we will see him again in an another role worthy of him and make a great comeback.\n\n\n",
        "upvotes": 2923,
        "comments": 408,
        "media": null,
        "permalink": "/r/movies/comments/1jwyr9i/gladiator_ii_made_me_finally_understand_the/"
    },
    {
        "id": "1jxayb1",
        "author": "Chai_Lijiye",
        "title": "When Michael Learned that it was Fredo..Who planned the attack on him.",
        "content": "I think this was one of the most important scene of the film... Iconic .🙌",
        "upvotes": 310,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/a5x8k9c8lcue1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jxayb1/when_michael_learned_that_it_was_fredowho_planned/"
    },
    {
        "id": "1jwrf71",
        "author": "indiewire",
        "title": "Pam Grier Says 'Blaxploitation' Term Was Meant to Deter Black Audiences",
        "content": "",
        "upvotes": 3847,
        "comments": 363,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_9zKtP7IUSyx5dS4uRzbabUeqqkzto_51oyD7LGdHYk.jpg?auto=webp&amp;s=983e20d04bd412c1bab410b460e2ded6491b8e0d"
        },
        "permalink": "/r/movies/comments/1jwrf71/pam_grier_says_blaxploitation_term_was_meant_to/"
    },
    {
        "id": "1jx7c61",
        "author": "BikeOk4256",
        "title": "I still stand by this being one of the best openings to a movie period (Willy Wonka and the Chocolate factory)",
        "content": "From its visuals of the chocolate process, to the beautiful orchestral soundtrack accompanying it; I can't stress that this opening, especially it's ost especially brings a tear to my eye. It straight up sounds like heaven in the form of a song. Does this intro have a special place for anyone else? ",
        "upvotes": 374,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/idq8k3gzgbue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jx7c61/i_still_stand_by_this_being_one_of_the_best/"
    },
    {
        "id": "1jx65on",
        "author": "BunyipPouch",
        "title": "Netflix's ‘Enola Holmes 3’ Starring Millie Bobby Brown Begins Filming in the UK",
        "content": "",
        "upvotes": 414,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0-vEB-ywjS5o7lh8rvEtooIH1IZc8CldgJjKr5LezfI.jpg?auto=webp&amp;s=02669da2aa19b3cb6b96f74b21f93a7fe7691056"
        },
        "permalink": "/r/movies/comments/1jx65on/netflixs_enola_holmes_3_starring_millie_bobby/"
    },
    {
        "id": "1jx6di6",
        "author": "lostartz",
        "title": "Tornado - Official Trailer",
        "content": "",
        "upvotes": 229,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H2b9KgenXpWLtgHb1ptgGtq6zXfJXho8hN-YmM-XfMg.jpg?auto=webp&amp;s=07958c5f5516b8a90462505f1f751e9c460652a7"
        },
        "permalink": "/r/movies/comments/1jx6di6/tornado_official_trailer/"
    },
    {
        "id": "1jwowlg",
        "author": "beatboxxx69",
        "title": "Austin Powers movies are a joy to watch in 2025",
        "content": "I'd had fond memories of the Austin Powers movies, but I hadn't watched them since they'd come out and I was much younger and more immature, and times were different. To be honest, I was afraid to watch them again because I figured I'd find them to be immature and dated.\n\nBut, I'd run out of movies I'd wanted to watch, and I figured I'd give them a re-watch all these years later. Oh, boy, was I impressed. They were all truly a delight to watch from start to finish.\n\nFortunately, I'd forgotten most of what happens during the films. There are scenes and jokes that I remembered, but they were also fun to watch because they're performed so well. Absolute classics. Then, the rest, had me laughing on the inside and the outside.\n\nNowadays, there aren't that many movies that I find truly joyful to watch from start to finish, but these movies all met the mark. When I first saw Goldfinger, I didn't even know who Beyonce was xD.\n\nI don't think there's been comedy like this since the last time it came out.",
        "upvotes": 2038,
        "comments": 393,
        "media": null,
        "permalink": "/r/movies/comments/1jwowlg/austin_powers_movies_are_a_joy_to_watch_in_2025/"
    },
    {
        "id": "1jxcf3q",
        "author": "jaguarp80",
        "title": "Everest (2015) is a surprisingly well crafted movie",
        "content": "Found it on Netflix and just finished watching, don’t remember seeing anything about it when it came out.\n\nStars Jason Clarke, Josh Brolin and Jake Gyllenhaal. They had top billing for obvious reasons, Brolin and Gyllenhaal are what attracted me to it, but there’s a lot of actors sharing the screen and they’re all top notch in this movie.\n\nI decided to watch it despite thinking to myself “okay, this is gonna be one of those movies that I can go ahead and play in my mind with probably 70% accuracy.” I thought it was gonna be superficial and formulaic - it was not.\n\nIt’s based on a true story of a disaster on Mt Everest in 1996. Won’t go into more detail than that to avoid spoilers.\n\nI doubt the movie would blow anybody’s mind but it’s just a really good, solid film. There’s a lot of human drama that felt very genuine to me, no melodrama. No cheesy dialogue. No caricatures. No actors hamming it up or overacting, in my opinion. No major genre cliches that I can recall. In fact I feel that it’s the type of movie that kinda defies genre, although you could categorize the themes well enough.\n\nPlot wise I didn’t find it predictable at all. If you’re already familiar with the story then I think you’ll find that the events aren’t portrayed predictably. No cheap thrills or cheap sentiment, just real ones. It made me feel shit.\n\nThe cinematography is great, there’s a lot of astounding shots of the mountain and surrounding environment. I don’t know if it was IMAX, but I’d have to assume it was because of some of the photography that just screams IMAX. Watch it on your biggest screen\n\nLong story short, I was expecting to accept a certain degree of eye rolling bullshit but there was none to be found. Really solid movie, it impressed me a lot.",
        "upvotes": 36,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1jxcf3q/everest_2015_is_a_surprisingly_well_crafted_movie/"
    },
    {
        "id": "1jwzgxi",
        "author": "Kudoshinichi0007",
        "title": "After all these years, I finally watched Grave of the Fireflies… and I’m broken.",
        "content": "I went into *Grave of the Fireflies* completely clueless , I had no idea what to expect. But by the time the movie ended, only one thought kept echoing in my mind:\n\n**“Whoever starts the war, no matter who wins or loses, the ones who truly suffer are the people just trying to survive it.”**\n\nThe pain, the sorrow, the daily struggle of those living through wartime…it’s unmatchable. Unless you've lived it, you can never truly understand it. And I was in tears by the end.\n\nI came across some online discussions where people were blaming Seita, the brother, saying his pride got them killed. But honestly? I don't agree. During a war, everyone is pushed to the edge , there’s food scarcity, fear of sudden death, bombing raids. Every morning, you wake up wondering if you’ll live to see another day. In that kind of world, the mind doesn't function normally.\n\nEven the aunt, who many view as cruel, was also a victim of the war. You could see how it was mentally breaking her. Seita and Setsuko were just children. Seita had just lost his mother, had no contact with his father or relatives, and on top of that, he had a little sister to protect. How is a child supposed to carry all that?\n\nPeople say it was pride...but if it was, would he have risked stealing food again and again, even after getting beaten, just to feed his sister? That’s not pride. That’s pure, desperate love. He didn’t have an adult to guide him. He was just a boy, doing the best he could in a world that had collapsed around him.\n\nThis movie doesn’t draw a line between good and bad—it shows how **unfair** war is to everyone. And I think this is the **saddest movie I’ve ever seen in my life**. I don’t want to watch it again... but I truly believe *everyone*, especially our generation, needs to see it **at least once**. You’ll learn something that no book or lecture can teach.\n\nAlso, that background music , Absolutely unforgettable. And that fireflies scene... the red glow, Seita and Setsuko sitting together on the bench in the night ,that image is forever engraved in my heart.\n\nThis movie... it’s more than a story. It’s an experience. And I’ll never forget it.",
        "upvotes": 331,
        "comments": 166,
        "media": null,
        "permalink": "/r/movies/comments/1jwzgxi/after_all_these_years_i_finally_watched_grave_of/"
    },
    {
        "id": "1jwtrsi",
        "author": "KillerCroc1234567",
        "title": "Josh Holloway To Star In Western ‘Flint’ Based On Louis L’Amour Novel",
        "content": "",
        "upvotes": 527,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SfrGhfi5HuyWw1lCMttMAnRbynFDSJYoUoehzVo9o30.jpg?auto=webp&amp;s=55bcfad23b20eb18a0a8668c06723c4e18a49d05"
        },
        "permalink": "/r/movies/comments/1jwtrsi/josh_holloway_to_star_in_western_flint_based_on/"
    },
    {
        "id": "1jx5xay",
        "author": "Quick_Silver2278",
        "title": "\"Crazy Stupid Love\" Steve and Gosling - what a duo",
        "content": "So I was up through the night and had a hotstar subscription so I decided to watch something to light my mood and picked up this fine piece of writing. The movie begins with a divorce, goes through crazy casanova playboy teachings and ends in perfect harmony of soulmate-y relationships of lead and side casts. \n\n'Crazy how stupid love is'\n\nI mean what made Emily cheat on a stable employed Cal and what made Jacob get into a committed relationship; Jacob meeting Cal crying and telling the tale of his divorce, turning him into a suave person and giving him lessons on how to pick up girls and then Jacob literally picking up a girl(Hannah), it was such intricate and finely connected as the teacher turns out to be first women picked by Cal from the bar and that line he used to pick her up...\n\nLove is jumbled and comes with alot of faucets you open the wrong one and you are in for a long time of regrets and self isolation.",
        "upvotes": 92,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1jx5xay/crazy_stupid_love_steve_and_gosling_what_a_duo/"
    },
    {
        "id": "1jwu6au",
        "author": "ChiefLeef22",
        "title": "Man On Fire: Jayson Dumenigo To Become Third Stunt Man In Movie History To Earn Oscar Recognition Thanks To His Burn Gel | His spectacular fire work on the upcoming John Wick spinoff 'Ballerina' prompted Dumenigo to finally submit himself for the Awards",
        "content": "",
        "upvotes": 378,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HZ6ulzcf9W4p1l1ssFV-ACKL93heMOcEr7bAM7ukbR0.jpg?auto=webp&amp;s=c3afec59a232436eadb577b3b3d66d44ca952f8a"
        },
        "permalink": "/r/movies/comments/1jwu6au/man_on_fire_jayson_dumenigo_to_become_third_stunt/"
    },
    {
        "id": "1jx7wh4",
        "author": "Outside-Pear9429",
        "title": "Best movies about cults/brainwashing that are maybe too realistic for comfort?",
        "content": "Been thinking a lot about the dangers of cults lately for reasons maybe some of you can understand. What are your favorite movies (fiction or very loosely based in actual events) that center around cults or mass brainwashing that really did a good job capturing the consequences or impacts and ideally were also well-acted? ",
        "upvotes": 38,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1jx7wh4/best_movies_about_cultsbrainwashing_that_are/"
    },
    {
        "id": "1jwz9ir",
        "author": "indiewire",
        "title": "Why New Stunt Oscar Will Become an Award for Best Action Design",
        "content": "",
        "upvotes": 91,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/54Bj9Znnjfn8hmGGRcHjZ-PQ5skyXsg-pkIq5W1up0U.jpg?auto=webp&amp;s=9d1f891a5211e67c14f4467bf47264fba42a9210"
        },
        "permalink": "/r/movies/comments/1jwz9ir/why_new_stunt_oscar_will_become_an_award_for_best/"
    },
    {
        "id": "1jxcllm",
        "author": "These_Feed_2616",
        "title": "Robert De Niro’s performance in Raging Bull is one of the best performances in film history",
        "content": "Robert De Niro is my favorite actor, and this performance is his crowning achievement. This was basically the first performance where an actor gained a lot of weight for the role which inspired many other actors to do the same thing to this day. His performance is raw, unfiltered, angry, and completely believable as Jake LaMotta. This performance is right up there with Brando in The Godfather and Daniel Day Lewis in There Will Be Blood. This film is just a perfect character study of a violent guy slowly destroying his own life professionally and personally. The black and white was perfect for this film as well, it almost made the boxing scenes feel more vicious in a weird way. The scene in jail where he’s punching the wall and crying and screaming is some of the finest acting you could ever see. He completely deserved his Oscar for this film.",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1jxcllm/robert_de_niros_performance_in_raging_bull_is_one/"
    },
    {
        "id": "1jxbjxq",
        "author": "WartimeHotTot",
        "title": "The Watcher in the Woods (1980) was a Disney movie and it gave me nightmares for years.",
        "content": "This aired on the Disney Channel. _The Disney Channel!_ I watched it when I was five years old and it scared the absolute shit out of me. \n\nMy five-year-old niece was recently watching something and I heard her whine. I went into the room and she was covering her eyes, very distressed. I asked her what was wrong and she said the show was too scary. I asked her what was scary and she said the soup the character was eating was too hot and it burned his mouth. \n\nI’m so glad she’s getting scared by soup and not getting terrified out of her mind by stuff like this. ",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L4e948DbkQvRNq4N_Xm7bctgXwsAIZUMG_eArMzoFQ0.jpg?auto=webp&amp;s=dc0d5a475c0f28f91dcc23e62d3000084eff1272"
        },
        "permalink": "/r/movies/comments/1jxbjxq/the_watcher_in_the_woods_1980_was_a_disney_movie/"
    },
    {
        "id": "1jw8ak1",
        "author": "cmaia1503",
        "title": "Oscars: Film Academy Establishes Stunt Design Award",
        "content": "",
        "upvotes": 5912,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8fOiQW9JPwAVE8DP2nfbb8UqjvWcKDNJXnpDxhOy_X0.jpg?auto=webp&amp;s=bc676d9c54fb69d9c8eb155fb2707cfa26194682"
        },
        "permalink": "/r/movies/comments/1jw8ak1/oscars_film_academy_establishes_stunt_design_award/"
    },
    {
        "id": "1jwrgyo",
        "author": "Dangerous_Treat_8074",
        "title": "Do you still prefer physical media for movies, even though digital streaming is so much more convenient?",
        "content": "When I was growing up, I used physical media all the time: VHS tapes, DVDs, Blu-rays. I remember going to the store or renting a movie and feeling a real connection to it. I used to collect DVDs and Blu-rays too, especially full series of movies I loved.\n\nThese days, with streaming platforms, everything is online and instantly available. It’s so convenient: you can watch whatever you want, whenever you want. The same goes for books and music.\n\nBut I wonder: do people still prefer physical media? Does anyone still collect Blu-rays or DVDs? Do you think physical media offers something digital just can’t replicate? Like, do you miss the experience of handling a book, album, or movie?\n\nI guess what I’m really asking is: do you miss that era of physical media, or are you glad we’ve moved on to everything being digital?",
        "upvotes": 151,
        "comments": 508,
        "media": null,
        "permalink": "/r/movies/comments/1jwrgyo/do_you_still_prefer_physical_media_for_movies/"
    },
    {
        "id": "1jwlotr",
        "author": "michajlo",
        "title": "Finally watched Arrival (2016) - Instant Favourite",
        "content": "For the longest time I've had this movie hidden away in my backlog, like a dowagers dark secret. Knew it was supposedly ambitious and the kind of movie that makes you think, but never bothered to read up on it, and I'm glad I didn't spoił it for myself.\n\nA great sci fi story, and probably the most interesting alien movie out there. Granted, I may be biased because I did study linguistics, so the movie was right up my alley, but I get the feeling it's be quite intriguing even if you're not into that particular science.\n\nI am giving the movie a big, fat, enthusiastic 9/10, and now I want to continue with the alien motif. I'll go for Sputnik either tonight or tomorrow, but can't decide what movie to pick as the third. Any recommendations?",
        "upvotes": 396,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1jwlotr/finally_watched_arrival_2016_instant_favourite/"
    },
    {
        "id": "1jwkb1c",
        "author": "East-Secretary",
        "title": "🎬 The Battle of Algiers (1966)\nDirector: Gillo Pontecorvo\nLanguage: French/Arabic\nStyle: Italian neorealism meets guerrilla filmmaking\nVibe: \"What if a documentary got possessed by revolution?\"",
        "content": "",
        "upvotes": 463,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/njg7rl3xs5ue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jwkb1c/the_battle_of_algiers_1966_director_gillo/"
    },
    {
        "id": "1jxc7u0",
        "author": "Background-Zombie689",
        "title": "The Place Beyond the Pines",
        "content": "Luke's life is a series of bad decisions... he's not a bad person, he just doesn't know how to make the good choices. And all of this had bad consequences on him and his entire family.\nSuch a tragic story. But such a masterpiece movie\n\n\n\"If you ride like lightning, you're gonna crash like thunder\"\n\nOne of the best movies ever hands down is go as far as to say it's one of the best movies ever just my opinion.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jxc7u0/the_place_beyond_the_pines/"
    },
    {
        "id": "1jwvirg",
        "author": "Adventurous_Caramel",
        "title": "Teaser trailer for long delayed crime film Sons of the Neon Night, starring Takeshi Kaneshiro, Tony Leung Ka-fai, Sean Lau, Louis Koo and Gao Yuanyuan",
        "content": "",
        "upvotes": 69,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9vc7kgwol8ue1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jwvirg/teaser_trailer_for_long_delayed_crime_film_sons/"
    },
    {
        "id": "1jwct2t",
        "author": "SULT_4321",
        "title": "The producer of DREDD explains Film Financing brilliantly",
        "content": "",
        "upvotes": 1231,
        "comments": 238,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ct0riqHpfWKV4FPq3O-HeoDYIwQSnfrkIG9Ges2r89M.jpg?auto=webp&amp;s=deaaef89790fd26433ba2a2299460d93c65539e2"
        },
        "permalink": "/r/movies/comments/1jwct2t/the_producer_of_dredd_explains_film_financing/"
    },
    {
        "id": "1jxa05l",
        "author": "Wide_Distribution167",
        "title": "Any movies like \"Happiness\" (1998) by Todd Solondz?",
        "content": "What particularly sticks out to me regarding this film is the juxtaposition between the bright sunny day, and all the terrible things that happen, as well as the offensive absurd sense of humor. \n\nI've seen the other works of Todd Solondz. And in terms of the description I gave above, Bobcat Goldthwait and John Water's filmography could easily fit. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1jxa05l/any_movies_like_happiness_1998_by_todd_solondz/"
    },
    {
        "id": "1jws9dr",
        "author": "ChiefLeef22",
        "title": "Kubrick Estate On Board Upcoming Documentary On Impact Of ‘2001: A Space Odyssey’; Leonardo DiCaprio, Mike Medavoy &amp; More Producing",
        "content": "",
        "upvotes": 64,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d9366ipTULhbuEbSQJI8BlF_Z66-Pc8mWS78UeIJg0U.jpg?auto=webp&amp;s=18fe1c9fc6b005a8d4c9c1160ebc5a008d64d651"
        },
        "permalink": "/r/movies/comments/1jws9dr/kubrick_estate_on_board_upcoming_documentary_on/"
    },
    {
        "id": "1jxc53l",
        "author": "Chemical-Ad8073",
        "title": "War of the Worlds (2005)",
        "content": "Rewatching War of the Worlds. When I first watched it back in 05 I hated Ratchel, she was whiney and annoying and her high pitched screaming irritated me. Now, after about 10 years I have 2 daughters and I 100% empathize with her. I can’t imagine trying to keep my kids alive in an apocalyptic environment when they won’t even listen to me long enough to make sure their school iPads are charged. Still an 8/10 movie at the end of the day but my viewpoint on this movie has changed with the times. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1jxc53l/war_of_the_worlds_2005/"
    },
    {
        "id": "1jxbwdi",
        "author": "Jazzlike-Estimate-15",
        "title": "Movie analysis - Sonic 3, thoughts?",
        "content": "I made this cuz I was bored but lmk your thoughts on it, I'm curious. (just a heads up: it is kind of a long read) \n\n\nPhase 1 - Introduction (to antagonist, Shadow the Hedgehog)  \n\nIn my opinion, this is the best way any movie can introduce an antagonist, and Sonic 2 and 3 execute it perfectly. In Sonic 2, Knuckles the Echidna is introduced right after we see Dr. Robotnik and his time spent on the mushroom planet. This approach is highly effective because it builds tension for the audience, making them aware of the looming threat to the protagonist(s).\n\nA similar technique is used in other films, such as Avengers: Infinity War. The movie opens with Thanos, a powerful and menacing figure determined to eliminate half of the universe’s population. At this point, viewers don’t yet understand his full intentions, which naturally sparks curiosity. Questions like \"Who is he?\" \"What does he want?\" and \"Why is he doing this?\" immediately arise, drawing the audience deeper into the story.  \n\nThe movie’s plot follows its own unique structure rather than replicating Sonic Adventure 2  (2001), where Shadow was originally introduced to the franchise. Since this is a movie adaptation, the pacing is much faster compared to a video game, ensuring that the narrative remains engaging for film audiences.  \n\nThe first fight scene between Team Sonic and Shadow further highlights the effectiveness of the movie’s storytelling. To make a film successful, it must consistently provoke curiosity in the viewer. If a plot is too predictable, the film risks failing to hold the audience’s attention. Sonic 3 avoids this pitfall, keeping the tension high as Shadow effortlessly overwhelms Team Sonic, reinforcing the threat he poses.  \n\nFor any story to work, the plot must follow four essential sections: Introduction, Motive, Climax, and Outro.  \n\n---\n\nPhase 2 - Motive  \n\nMotive is arguably the most crucial element in any plot. This is where the audience gains insight into a character, learning what drives their actions. When done effectively, it fosters understanding and makes the character more relatable.  \n\nShadow is portrayed as someone grappling with deep trauma, something many people can relate to. Later in the film, Gerald Robotnik is introduced, a character who was originally dead in SA2. Keeping him alive in this adaptation is a brilliant decision, as it strengthens the film’s moral themes and makes his story more cohesive than in the games.  (however, I personally like the idea of Gerald not being alive better but I am aware the game didn't execute it well enough) \n\nLike Shadow, Gerald is weighed down by grief, having lost his granddaughter, Maria. This loss, compounded by his imprisonment, fuels an overwhelming desire for revenge—not just against G.U.N., but against the entire planet. While this level of retaliation seems extreme, both Shadow and Gerald genuinely believe their actions are justified. For 50 years, their sole focus has been achieving justice for Maria. Gerald, now quite old, likely feels he doesn’t have much time left, and Shadow, without Maria, struggles to find any reason to carry on. Their pain has entirely consumed them. \n\nSonic attempts to reason with Shadow, but it’s futile—Shadow is too far gone. He sincerely believes his actions are right, making it nearly impossible to change his mind. People rarely change unless they truly want to, and the only way to shift someone's perspective/moral compass is to prove, beyond any doubt, that they are completely wrong. It must be so obvious and undeniable that they are forced into self-reflection.  \n\n---\n\nPhase 3 - Turning Point/Climax\n\nMany viewers mistakenly assume the climax as Super Sonic vs Super Shadow, but this is actually the post-climax. The true turning point comes when Shadow injures Tom. At that moment, Shadow begins to experience doubt and feeling guilt for harming Tom. At the same time, Sonic abandons his moral compass in pursuit of revenge, reinforcing the idea that \"hurt people, hurt people.\"  \n\nThe final fight between Sonic and Shadow is brief but impactful. It represents their internal conflicts—Sonic fighting for the people he loves while simultaneously betraying them for revenge, and Shadow fighting simply to prove that Sonic is no different from him. He wants to show that Sonic, just like him, has been hurt by others and seeks vengeance by any means necessary.  \n\nThe battle ends with Sonic ultimately defeating Shadow. He has the opportunity to end him but chooses not to, remembering Tom’s words. This shocks Shadow, who expected Sonic to crave revenge as much as he did. In this moment, Sonic realizes that revenge is ultimately meaningless, a lesson Shadow had never considered. This realization forces Shadow into self-reflection, as everything he once believed was right turned out to be wrong.  \n\nTheir super-powered fight is the most significant moment in the film. The choice to have them battle in their enhanced forms wasn’t just about demonstrating Sonic’s strength. A lot of people misinterpret this and think it means Shadow is too strong for Sonic. (in base) In theory, Sonic could beat Shadow without transforming, but until Tom was injured, he had no real desire to fight Shadow at all. Shadow won their first encounter largely due to the element of surprise, as Sonic had never faced him before.  \n\nThe reason their battle had to take place in their super forms is simple—Shadow needed to be defeated at his strongest for him to fully grasp his mistakes. If they had fought in their base forms, Shadow could have convinced himself that he still had an advantage in Super form. His defeat had to be undeniable. That’s why, immediately after losing, Shadow says, \"You won, take your revenge.\" He knows, beyond any doubt, that he was wrong.  \n\nThis loss is crucial for the plot. Without it, Shadow would never have joined Sonic to stop the Eclipse Cannon. His defeat is what allows the story to progress and his character to develop.  \n\n---\n\nPhase 4 - Outro/Ending\n\nAfter his realization, Shadow chooses to help Sonic stop the Eclipse Cannon, marking his redemption. The final moments of the film highlight the importance of choice—Shadow had to lose everything to fully understand the consequences of his actions. But in the end, he chooses to fight for something greater than revenge.  \n\nThe conclusion also gives Sonic his own moment of growth, reinforcing the idea that justice and revenge are not the same. He learns that while fighting to protect others is noble, seeking revenge is a path that ultimately leads nowhere.  \n\nThe film closes with a sense of resolution but still leaves room for the future. Shadow, now freed from his past, must find a new purpose, and Sonic moves forward with newfound wisdom. The ending provides closure while hinting at the possibilities ahead for both characters and the Sonic universe.\n\n\nJust a fun bonus point to add: In the final battle when Sonic &amp; Shadow are fighting Gerald's bots. if you pause it by the frame, you can actually see Sonic making the same pose while did in the SA1 game cover right before he kicks it. (before Sonic and Shadow hit their iconic pose) ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jxbwdi/movie_analysis_sonic_3_thoughts/"
    },
    {
        "id": "1jw9tmm",
        "author": "Lem__Mann7",
        "title": "Dr. Evil group therapy scene - Austin Powers: International Man of Mystery (1997)",
        "content": "This is legit one of my favorite scenes in any comedy, and I don’t think it gets the credit it deserves. I lose it every time he says the question mark line. Also “the sort of general malaise that only the genius possess, and the insane lament” is lowkey a pretty profound statement lmao. I wish they still made parody movies like this. Who else loves this movie and this scene? ",
        "upvotes": 1427,
        "comments": 163,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6tit17k7w2ue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jw9tmm/dr_evil_group_therapy_scene_austin_powers/"
    }
]