[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n92fre",
        "author": "Professional_Deer365",
        "title": "Prima volta a Torino in macchina",
        "content": "È la prima volta che guido a Torino, qual'é il modo giusto per passare da un viale al controviale che va nel senso opposto?",
        "upvotes": 29,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e0da45szxbnf1.png?auto=webp&amp;s=087549c838a564c366533cdfb5fadbdb66e6fccc"
        },
        "permalink": "/r/torino/comments/1n92fre/prima_volta_a_torino_in_macchina/"
    },
    {
        "id": "1n9188x",
        "author": "Lecco-rnie17",
        "title": "Balon e Gran Balon: sono ancora quelli di una volta?",
        "content": "Premetto: non sono di Torino, ma ci ho abitato per un annetto 14 anni fa. Mi piace scoprire pezzi vintage, quindi andavo spesso. Ci sono tornato quest'anno e, per quanto ancora apprezzi questo mercato rispetto ai mercati vintage nel resto dell'Italia, i prezzi mi sono sembrati non aumentati, di più, proprio schizzati in alto. Avete notato anche voi questa cosa? ",
        "upvotes": 14,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1y7g1jzrkbnf1.jpeg?auto=webp&amp;s=635b95d3e48c748990d3250275177d9e9fcf45e3"
        },
        "permalink": "/r/torino/comments/1n9188x/balon_e_gran_balon_sono_ancora_quelli_di_una_volta/"
    },
    {
        "id": "1n94xg1",
        "author": "MannyLove_s_You",
        "title": "Cercasi amic*",
        "content": "Il 13 settembre al ‘Magazzino sul Po’ (Murazzi) suona una band coreana che mi piace (chiamati Cotoba) e volevo sapere se ci sarà qualcuno della mia stessa età o se è possibile fare un gruppetto di persone con cui andare.\n\n\nIo sono una ragazza di 22 anni, studentessa, mi piacciono gli anime, l’arte, il true crime, la cultura asiatica e anche altro come cinema e musica e ascoltare le altre persone parlare dei propri interessi. Sono un po’ introversa ma spero davvero di poter fare amicizia con qualcuno❤️❤️\n\n\nPurtroppo i miei amici non ci saranno e l’ultima volta che sono andata ad un evento del genere da sola non me la sono passata molto bene.\nSe siete interessati al tipo di musica oppure se già pensavate di andare scrivetemi, ci scambiamo pure i profili insta se volete, magari possiamo anche berci un caffè un giorno o due prima per conoscerci.",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n94xg1/cercasi_amic/"
    },
    {
        "id": "1n93jtu",
        "author": "alexsimi",
        "title": "Quale app di Taxi",
        "content": "Devo prendere un taxi di sabato mattina per andare in centro (crocetta) ma non so quale sia più affidabile tra Wetaxi, Freenow e inTaxi.\n\nUber Black costa troppo.\n\nNon posso noleggiare auto/scooter/monopattini ecc. Neanche mezzi pubblici.\n\nGrazie!!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n93jtu/quale_app_di_taxi/"
    },
    {
        "id": "1n956wr",
        "author": "Intelligent-Tart-287",
        "title": "Difficoltà a trovare casa a Torino come studente straniero",
        "content": "Ciao a tutti,\nquest’anno mi trasferirò a Torino per studiare e sto cercando un bilocale in affitto. Purtroppo sto avendo moltissime difficoltà: la maggior parte dei proprietari con cui ho parlato non vuole affittare a stranieri senza conoscermi di persona, e questo rende tutto molto complicato.\n\nSto cercando soprattutto in zona Crocetta o Centro, ma sarei aperto anche ad altre zone come San Donato. Idealmente cerco un appartamento ristrutturato, ma fino ad ora non ho avuto fortuna.\n\nHo anche provato a contattare diverse agenzie immobiliari, ma spesso non rispondono alle chiamate, oppure nessuno parla inglese e a volte mi riattaccano il telefono in faccia.\n\nVorrei chiedere a chi vive a Torino:\n\t•\tquali sono le agenzie immobiliari più affidabili e sicure che potrei contattare?\n\t•\tavete consigli pratici su come muovermi in questa situazione da straniero?\n\t•\tconoscete servizi di traduzione o mediatori che possano aiutarmi a comunicare meglio con i proprietari/agenzie?\n\nOgni consiglio è ben accetto. Grazie mille a chi risponderà! 🙏",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n956wr/difficoltà_a_trovare_casa_a_torino_come_studente/"
    },
    {
        "id": "1n8zyen",
        "author": "ale_bella",
        "title": "Rivoli per lavoro",
        "content": "Ciao a tutti! Scrivo qui perchè ho ricevuto una proposta di lavoro interessante a Rivoli che potrebbe portarmi a un trasferimento da Milano dove attualmente vivo e lavoro. L'unica cosa che mi blocca è che mi sembra una bellissima cittadina, ma forse un po' \"solitaria\" per una 30enne. Premetto che non amo Milano nè la vita mondana e preferirei mille volte vivere in una città più piccola e ricca di bellezza. Avevo anche valutato di vivere a Torino e spostarmi a Rivoli ma non essendo automunita è un tragitto piuttosto lungo, almeno finchè non verrà estesa la metro. A tal proposito: è credibile vederla finita entro il 2026?\n\nMi trasferirei sola, non ho amici che abitano a Torino, quindi sarebbe un ripartire da zero. Credete sia semplice farlo facendosi qualche amico e un po' di vita sociale?\n\nGrazie!",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n8zyen/rivoli_per_lavoro/"
    },
    {
        "id": "1n9aa3i",
        "author": "Similar_Profit_7298",
        "title": "In Bici da Caselle a Settimo",
        "content": "Salve, mi servirebbe un'aiuto su una situazione molto specifica, vorrei chiedere se fosse possibile raggiungere Settimo Cielo, in bici, partendo da Caselle/Borgaro, non parlo della lunghezza, dovrebbe essere mezz'oretta in piano, mi interessa, più che altro, sapere se il percorso sia pericoloso(brutte strade etc...) e nel caso, se qualcuno l'avesse già fatto.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n9aa3i/in_bici_da_caselle_a_settimo/"
    },
    {
        "id": "1n9a0r4",
        "author": "Willing_Yogurt_2817",
        "title": "How to get weed in Torino",
        "content": "Hello, I will be visiting Torino for a couple of days next week, how do people get weed in Italy and Torino specifically ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n9a0r4/how_to_get_weed_in_torino/"
    },
    {
        "id": "1n97ybj",
        "author": "Esp3t0",
        "title": "Asking: Tips for a good shop to buy computer parts.",
        "content": "Buongiorno\n\nI am looking for a good shop to buy a case and a power supply to rebuild my computer.\n\nI found some places looking at google maps, but all of them seems more like they sell mounted PCs and notebooks.\n\nLooking on internet I found this site:\nhttps://www.computervalley.it/\n\nIs it a ok shop? Are the prices good? I have no idea what is a good price in euro.\n\nI need a case for a micro-ATX motherboard and a 650W gold power supply.\n\nP.S.: I dont know if in Italy have a service to check about the reputation of the place. In Brazil we have the \"Reclame Aqui\" that is a service that reunites complainings about places services and it gives notes to them. I always check it before using any service.",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/efGiZW5OnVV5wgmWSNfJmCX4u2kCRCsK7RER2P8PtwI.png?auto=webp&amp;s=2c0fe3c04351b4753dda6f7196e57008f6629e3a"
        },
        "permalink": "/r/torino/comments/1n97ybj/asking_tips_for_a_good_shop_to_buy_computer_parts/"
    },
    {
        "id": "1n97cf2",
        "author": "RichDragonfly4181",
        "title": "CX studentati a Torino recensioni",
        "content": "per caso qualcuno ha delle opinioni da condividere riguardo all'alloggio in questi studentati? vi siete trovati bene ? pulizia spazi comuni? reception educata personale gentile? robe del genere grazie per l'aiuto",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n97cf2/cx_studentati_a_torino_recensioni/"
    },
    {
        "id": "1n8zx3o",
        "author": "sol_asper",
        "title": "Esame Patente A da Privatista",
        "content": "Ciao a tutti, mi servirebbe un'informazione per l'esame pratico della patente A presso la Motorizzazione di Torino come privatista. Vorrei sapere se la Motorizzazione mette a disposizione una moto (con i requisiti corretti per l'esame) per i privatisti. Faccio questa domanda perché, per esempio, la Motorizzazione di Palermo mette a disposizione una moto per i privatisti.\n\nNel caso in cui non venga messa a disposizione una moto, conoscete qualche autoscuola che affitta solo la moto o qualche rental che affitta moto per gli esami?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8zx3o/esame_patente_a_da_privatista/"
    },
    {
        "id": "1n94o9n",
        "author": "katt12543",
        "title": "Favorite part about the city?",
        "content": "There are a lot of people here who talk about the worst parts, lots of complaints about traffic but what are your favorite places, things and parts about the city? What keeps you living here?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n94o9n/favorite_part_about_the_city/"
    },
    {
        "id": "1n8g6e5",
        "author": "KveldssangerM",
        "title": "Truffa soldi per benzina - Zona S. Rita",
        "content": "Ciao a tuttə,\nvolevo segnalare che, in zona Santa Rita, si aggira una ragazza(sulla 30ina) bionda, capelli corti, con occhiali, che ferma le persone per strada per chiedere soldi per la benzina, fingendo che il POS del benzinaio sia fuori uso.\nPromette di restituire i soldi immediatamente tramite bonifico/Satispay presentando e inviando la foto di pagamento effettuato, che però in realtà è una semplice ricerca sul sito Unicredit, all'interno della quale lei scrive \"Ricarica {numero} effettuata, {somma} €\"; poi vi gira un documento d'identità falso, dicendovi che per il pagamento ci vogliono 24h.\n\nCerca di distrarre con informazioni aggiuntive e credibili, per esempio a me ha detto che lavora da BojaFauss, con sede sia a Torino che ad Alba.\n\nLa carta di identità fornita è purtroppo a nome di un'altra persona, Roxana, che è anche il nome con cui questa truffatrice si presenta.\n\nI carabinieri sono a conoscenza sia della truffa che del nome della truffatrice da mesi ormai, hanno inviato al tribunale decine di denunce, ma dicono di avere le mani legate fino alla decisione del tribunale.\n\nFate attenzione, io sono stato preso in un momento di distrazione. È molto brava a fingere che sia in una situazione di reale bisogno (con me ha finto di chiamare la madre per rassicurarla che aveva risolto e che sarebbe tornata presto a casa).\n\n",
        "upvotes": 36,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1n8g6e5/truffa_soldi_per_benzina_zona_s_rita/"
    },
    {
        "id": "1n8ztqp",
        "author": "ohthanksobama",
        "title": "Baseball al Valentino",
        "content": "Qualcuno che ha voglia di fare 2 tiri di baseball al Valentino? Io ex giocatore semi professionista ma da almeno 10 anni fermo ;)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8ztqp/baseball_al_valentino/"
    },
    {
        "id": "1n92lx2",
        "author": "eddz_",
        "title": "Mi consigliate un'agenzia con cui potrei rivolgermi per cercare casa a Torino?",
        "content": "Buongiorno, io e un mio amico ci trasferiremo a Torino per continuare i nostri studi magistrali. Tuttavia, non conosciamo molte agenzie e la maggior parte sono delle truffe. Qualcuno può consigliarci un'agenzia a cui rivolgerci per quanto riguarda la ricerca di un alloggio? Potrebbe essere a Torino o nei dintorni, non ci interessa.\n\nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n92lx2/mi_consigliate_unagenzia_con_cui_potrei/"
    },
    {
        "id": "1n924xk",
        "author": "Ibrahimt51",
        "title": "Best way to go to Torino from. Malpensa airport.",
        "content": "Hi! I'm an international student coming to study at PoliTo, I'm going to arrive in Malpensa airport Terminal 1 on Ocotber 1st, the flight ticket says the plane should land at 13:30, I want to know what's the cheapest fastest way (direct trip if possible) to get to Turin from Malpensa airport terminal 1?\n\nWhat's confusing me the most is the timing, if I need to buy a train or bus ticket, then what's the appropriate departure time, or should I but ticket when I land in the airport and wouldn't that be more expensive than buying it in advance? ",
        "upvotes": 1,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1n924xk/best_way_to_go_to_torino_from_malpensa_airport/"
    },
    {
        "id": "1n91odh",
        "author": "Gu_Gu_Muck",
        "title": "Corsi di inglese",
        "content": "Ciao a tutti!\n\nSto cercando a Torino una qualche scuola che offra corsi di inglese, sono interessato a prendere una certificazione C1 dato che l’anno prossimo dovrei andare a studiare all’estero.\n\nConoscete scuole che preparano all’esame per la certificazione o che offrono la possibilità di sostenerlo direttamente da loro? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n91odh/corsi_di_inglese/"
    },
    {
        "id": "1n8kttb",
        "author": "pietrosantoro13",
        "title": "Birra?",
        "content": "Ciao a tutti sono un ragazzo di 24 anni trasferitosi da pochissimo a Torino per lavoro. Chi si fa due chiacchere e una birra domani sera in zona San Salvario? Se siete simpatici la prima la offro io ",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w7cxdkbug7nf1.png?auto=webp&amp;s=6cad35284f524cccdbef69c950dae5c696d58c36"
        },
        "permalink": "/r/torino/comments/1n8kttb/birra/"
    },
    {
        "id": "1n8dmj5",
        "author": "Fit_Bake_6569",
        "title": "Che ne pensate di un listening bar a Torino?",
        "content": "Ciao a tutti,  \nsto ragionando su un’idea ancora molto preliminare e mi farebbe piacere avere un feedback schietto.\n\nIl concept è un **listening bar**: di giorno una caffetteria con colazioni semplici e genuine, senza fronzoli; la sera un cocktail bar con musica ascoltata da un buon impianto stereo.\n\nVorrei dare spazio anche allo **sport**: dalle partite di calcio, basket e tennis all’hockey su ghiaccio, NFL (un po’ in stile USA), insieme a un tocco di cultura skate e street. L’obiettivo è creare un posto dove ritrovarsi, bere qualcosa, ascoltare musica, guardare sport e stare insieme.\n\nSono ancora in fase di studio di costi, permessi e investimenti → quindi questo è solo uno “smoke test”.  \nSecondo voi, a Torino una cosa del genere potrebbe funzionare?  \nE se sì, **in quale zona ve lo immaginereste meglio**?\n\nGrazie a chi vorrà dire la sua!",
        "upvotes": 17,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1n8dmj5/che_ne_pensate_di_un_listening_bar_a_torino/"
    },
    {
        "id": "1n8y4f2",
        "author": "Floofs-In-Space",
        "title": "Amateur cyclocross events?",
        "content": "Are there any training events or races for amateurs in town?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8y4f2/amateur_cyclocross_events/"
    },
    {
        "id": "1n8oi0t",
        "author": "Platform_Crocs",
        "title": "scambio linguistico",
        "content": "ciaoooo sono un americano da nyc e mi sono appena trasferito qui a torino la settimana scorsa. A New York ero un insegnante di inglese e ho lavorato all’università. Ho 24 anni e sto cercando per qualcuno cui aiutarmi con italiano e posso aiutarti con inglese :) non so esattamente il mio livello in italiano perché non ho mai fatto un lezioni in italiano. Ho vissuto a Roma and ho imparato da parlare con gente del posto. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8oi0t/scambio_linguistico/"
    },
    {
        "id": "1n8i3eu",
        "author": "Tall-Split-5528",
        "title": "L’acqua del rubinetto/doccia e capelli crespi",
        "content": "Mi riferisco soprattutto alle ragazze, ma anche i vostri capelli fanno schifo dopo averli lavati con l’acqua che c’è qui a Torino?\nAd agosto ho passato le vacanze con la mia famiglia che vive al sud, e i miei capelli risultavano molto più voluminosi e luminosi, mentre quando li lavo qui mi sembrano più spenti e crespi. È una mia impressione oppure ha senso che ci sia questa differenza? Se sì, a cosa potrebbe essere dovuta e come potrei risolvere?? ",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1n8i3eu/lacqua_del_rubinettodoccia_e_capelli_crespi/"
    },
    {
        "id": "1n8cdj0",
        "author": "Elegant-Credit7767",
        "title": "I see very few Indians here? Anyone up for a trip to Rome?",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8cdj0/i_see_very_few_indians_here_anyone_up_for_a_trip/"
    },
    {
        "id": "1n8d69z",
        "author": "MonPorridge",
        "title": "Come raggiungere il santuario di Oropa?",
        "content": "Ciao a tutt\\*, volevo organizzare una gita tra amici per visitare il Santuario di Oropa, ma dal sito non si capisce come arrivare senza macchina. Qualcun\\* piò aiutarmi? Vale la pena passarci una giornata? Grazie!",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1n8d69z/come_raggiungere_il_santuario_di_oropa/"
    },
    {
        "id": "1n85h6h",
        "author": "Murky_Giraffe8700",
        "title": "WTF succede con i cinema a Torino? Nessun film in inglese?",
        "content": "Ciao a tutti,\n\nma sono solo io o a Torino è praticamente impossibile vedere un film al cinema in lingua originale (con sub inglese oppure italiano)?\n\nSto guardando la programmazione delle sale “commerciali” (UCI, The Space, ecc.) e non trovo **nemmeno una proiezione** in originale. Solo doppiaggi italiani ovunque.\n\nMi sembra assurdo per una città come Torino, con università piene di studenti stranieri e gente che magari vuole solo godersi un film senza doppiaggio.\n\nE se volete il Cinema Centrale, il Massimo, eccetera, ma io voglio vedere il cinema commerciale una volta al anno\n\nPer esempio, Harry Potter, ora tutto in italiano e solo in UCI e inglese, ma alle 21:00 al Lingotto...\n\nSeriamente wtf",
        "upvotes": 11,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1n85h6h/wtf_succede_con_i_cinema_a_torino_nessun_film_in/"
    },
    {
        "id": "1n8kr0t",
        "author": "No-Ant-9038",
        "title": "Camerini con porta",
        "content": "C'è qualche negozio di vestiti a Torino che ha una porta da chiudere nei camerini, invece della solita tenda?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8kr0t/camerini_con_porta/"
    },
    {
        "id": "1n8c5yf",
        "author": "Yara603",
        "title": "DAMS",
        "content": "Ciao a tutti! 🙌\nMi sono iscritta da poco al DAMS dell’Università di Torino (UniTo) e mi piacerebbe avere qualche consiglio da chi già studia o ha finito.\n\nMi interessano in particolare alcune cose:\n\nQuali sono gli esami più facili e quali quelli più difficili al primo anno?\n\nE… ci sono professori un po’ “antipatici” o particolarmente severi da sapere in anticipo?\n\nSono un po’ in ansia per l’OFA Italiano DAMS — qualcuno può raccontare la propria esperienza?\n\nDove trovate di solito appunti gratuiti, registrazioni delle lezioni o materiali utili? Esistono chat/gruppi di studenti?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8c5yf/dams/"
    },
    {
        "id": "1n8701p",
        "author": "Lastmanintheearth",
        "title": "Dove mangiare questo weekend",
        "content": "Da sabato a lunedì saremo a Torino io e famiglia per visitare un po' di musei (egizio, automobile, cinema, parco del valentino, museo reale).\nConsigli su posti dove mangiare decentemente a pranzo o cena? Magari non cucina esclusiva a latticini... Alloggiamo in zona via porte palatine/via Garibaldi\n\nInoltre, ci muoveremo con la Piemonte card, quindi autobus e metro. Zone o cose a cui prestare attenzione, visto che abbiamo due bambini con noi?\n\nGrazie a chi risponderà!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n8701p/dove_mangiare_questo_weekend/"
    },
    {
        "id": "1n85mfs",
        "author": "balmil",
        "title": "Trovare e offrire casa a Torino",
        "content": "Ciao a tutti\n\nInsieme a due amici sto per lanciare un'app per aiutare:\n\n\\- i fuorisede a trovare case o inquilini (e volendo anche tutti e due in un colpo solo)\n\n\\- i proprietari ad affittare l'immobile a persone verificate e in linea con le loro richieste\n\nSiamo stati tutti fuorisede e sappiamo quanto faccia schifo tutto praticamente. Vi lascio il link se qualcuno fosse interessato ad approfondire l'argomento",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sNDL8bScWd96BEu_YpyuOMuSCCHX-UlYgU78z0-Vxn0.png?auto=webp&amp;s=934d66be20ae005c9d64cfefd4c94329fe58218f"
        },
        "permalink": "/r/torino/comments/1n85mfs/trovare_e_offrire_casa_a_torino/"
    },
    {
        "id": "1n8chbn",
        "author": "Alternative-Case-423",
        "title": "Argentinos por Turin!",
        "content": "Buenas, estoy recien llegado a Torino, algun Argentino por acá. O Alguien que se anime a probar el mate, el fernet y el asado! Envieme un mensaje por MD! Saludos ;) ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n8chbn/argentinos_por_turin/"
    }
]