[
    {
        "id": "1jz2rfp",
        "author": "netflix",
        "title": "Hi, I'm Gareth Evans, writer/director of new Netflix film HAVOC, as well as The Raid, The Raid 2 and Gangs of London, AMA",
        "content": "In between doing press for my new film HAVOC (starring Tom Hardy, Jessie Mei Li, Forest Whitaker, Justin Cornwell, Timothy Olyphant and Luis Guzmán – coming to Netflix everywhere on 25 April) I’ve got time to answer some of your questions. So feel free to ask me anything…\n\nTuesday 15th April, 5.00pm BST/9am PDT\n\nhttps://preview.redd.it/g2dmphnxptue1.jpg?width=4281&amp;format=pjpg&amp;auto=webp&amp;s=878e864458de372b6a45d9da591c76087d005c5e\n\n  \n",
        "upvotes": 14,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1jz2rfp/hi_im_gareth_evans_writerdirector_of_new_netflix/"
    },
    {
        "id": "1jxy5se",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (Warfare, Drop, The Amateur, Freaky Tales) + 25th Anniversary Discussions (Ready to Rumble, Return To Me, Rules of Engagement)",
        "content": "**New Theatrical Releases**\n\n[Warfare ](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**\n\n[Ready to Rumble](https://www.reddit.com/r/movies/comments/1jwewks/official_throwback_discussion_ready_to_rumble/)\n\n[Return to Me](https://www.reddit.com/r/movies/comments/1jwewhk/official_throwback_discussion_return_to_me/)\n\n[Rules of Engagement](https://www.reddit.com/r/movies/comments/1jwewf2/official_throwback_discussion_rules_of_engagement/)",
        "upvotes": 26,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jxy5se/official_discussion_megathread_warfare_drop_the/"
    },
    {
        "id": "1jyt5nj",
        "author": "OutrageousFootball10",
        "title": "Hollywood Is Cranking Out Original Movies. Audiences Aren’t Showing Up.",
        "content": "LOS ANGELES—When director Christopher Landon introduced his new thriller, “Drop,” before its premiere at the Chinese Theater on Hollywood’s Walk of Fame, he had a warning for the packed auditorium.\n\n“It’s really hard out there for an original movie,” he said, urging everyone who liked the Universal Pictures release to “scream it from the rooftops” and on social media.\n\n“Drop” opened this weekend to an estimated $7.5 million domestically, one of two new movies based on fresh ideas that fizzled at the box office. The other was Disney’s “The Amateur,” a spy thriller adapted from a little-known 1981 book, which opened to an estimated $15 million.\n\nAfter years of gripes from average moviegoers and Hollywood insiders alike about the seemingly nonstop barrage of sequels, spin-offs, and adaptations of comic books and toys, the film industry placed more bets on original ideas.\n\nThe results have been ugly. \n\nNearly every movie released by a major studio in the past year based on an original script or a little-known book has been a box-office disappointment. Before this weekend’s flops were Warner Bros. Discovery’s“Mickey 17” and “The Alto Knights,” Paramount’s “Novocaine,” Apple’s “Fly Me to the Moon,” Amazon’s “Red One,” and the independently financed “Horizon: An American Saga Chapter 1” and “Megalopolis.”\n\nJason Blum, who produced “Drop” and built his company Blumhouse largely on original horror franchises, said audiences’ preference for known properties has made it harder to release original movies in theaters, “even though that’s where some of the most exciting and risky storytelling still lives.”\n\nGetting people into theaters more frequently is a priority for a movie industry still recovering from the pandemic. Box-office revenue in the first three months of this year in the U.S. and Canada was the lowest it has been, excluding the pandemic, since 1996.\n\nAt the CinemaCon industry convention in early April, theater owners said they welcome more original films, but only if they are backed by robust advertising campaigns. Building buzz for a new film in a media environment fractured between YouTube, TikTok, streaming and sports is tough, particularly when it is an unknown title.\n\n“We’re opening films that have almost zero awareness,” said Bill Barstow, president of Main Street Theatres, a small Nebraska-based chain.\n\nMany consumers are content to wait until an original motion picture is available to rent online a few weeks after its theatrical release or to stream on a service like Netflix in a few months.\n\nThe only films succeeding in the current environment are those with built-in audiences, like “A Minecraft Movie,” which was released in early April and has grossed more than $280 million domestically. And these days, even franchises can be far from a sure thing. Long-running series such as Marvel and DC superheroes and live-action remakes of Disney animated classics are showing their age and proving unreliable at the box office.\n\nStudios say they have little choice but to make more original movies they hope will buck the odds.\n\n“Telling original stories and taking risks is the only path toward creating new global franchises,” Bill Damaschke, Warner Bros.’ head of animation, said at CinemaCon.\n\nSome of the increase in original film releases is attributable to Amazon and Apple, which are building film businesses with few well-established franchises. One of the biggest bets on an original film from any company this year is Apple’s “F1,” a June release starring Brad Pitt as a race-car driver.\n\nAmazon hyped 11 coming movies to exhibitors at CinemaCon, of which six were originals. Among traditional studios, Warner Bros. is taking the most risks on originals, with big budget films from directors Paul Thomas Anderson and Maggie Gyllenhaal. \n\nHollywood’s next original release comes Friday with Warner’s “Sinners,” a horror movie starring Michael B. Jordan. Next month even Marvel, home to Hollywood’s biggest franchises, is taking a gamble with “Thunderbolts,” about a super team brand new to all but the most devoted comic-book readers.",
        "upvotes": 2784,
        "comments": 1746,
        "media": null,
        "permalink": "/r/movies/comments/1jyt5nj/hollywood_is_cranking_out_original_movies/"
    },
    {
        "id": "1jyyb1g",
        "author": "MarvelsGrantMan136",
        "title": "Eddington | Official Trailer HD | A24",
        "content": "",
        "upvotes": 645,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pGfOvTdCDWm1IpjmsPzaTQT8qck2ZUfvNDpTkoH7OjE.jpg?auto=webp&amp;s=d3af50839dae87385099256bac4885e63064c423"
        },
        "permalink": "/r/movies/comments/1jyyb1g/eddington_official_trailer_hd_a24/"
    },
    {
        "id": "1jyp8dp",
        "author": "leafs81215",
        "title": "Actors who were going to be the next big thing and then…just weren’t?",
        "content": "I consider Clive Owen to be in this category. Nothing wrong with him, he’s a very good actor. But in the 2000s this dude was everywhere. Oscar nominated for ‘Closer’, Children of Men was tremendous, I mean he was heavily favoured to be James Bond before Daniel Craig showed up. And then, he just faded. He still works and acts quite regularly but he never got even close to those heights again. What are some other actors that just fell off of the top tier but there’s no real reason why. ",
        "upvotes": 3638,
        "comments": 3515,
        "media": null,
        "permalink": "/r/movies/comments/1jyp8dp/actors_who_were_going_to_be_the_next_big_thing/"
    },
    {
        "id": "1jz0arv",
        "author": "KillerCroc1234567",
        "title": "New poster for “Another Simple Favor”",
        "content": "",
        "upvotes": 251,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3g86kfxo9tue1.jpeg?auto=webp&amp;s=405b1c36a1d679a12975f6e48057e27a023a16a4"
        },
        "permalink": "/r/movies/comments/1jz0arv/new_poster_for_another_simple_favor/"
    },
    {
        "id": "1jyz71b",
        "author": "DamnThatsInsaneLol",
        "title": "‘House of the Dragon’ Star Emma D’Arcy Joins Tom Cruise in Alejandro Iñárritu’s New Film; Co-Starring John Goodman, Jesse Plemons, Sandra Hüller, Riz Ahmed, Sophie Wilde &amp; More",
        "content": "",
        "upvotes": 219,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GXcGRL7hBi8szeZjxICCRz5JybEsBPe2aMooCb-SfEU.jpg?auto=webp&amp;s=4290eb139e1f774afae0cde57bb738d8e411a5f1"
        },
        "permalink": "/r/movies/comments/1jyz71b/house_of_the_dragon_star_emma_darcy_joins_tom/"
    },
    {
        "id": "1jyzrze",
        "author": "NoCulture3505",
        "title": "Olivia Colman and Benedict Cumberbatch Fight to the Finish in 'The Roses' (First Images)",
        "content": "",
        "upvotes": 139,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cdLGGPdGNX0X3O1cmg93Mg_XYlhHW4Exgje7Re6iYBk.jpg?auto=webp&amp;s=36cf5a99c8f45a4c3dde8c1c2198f4317d571c4b"
        },
        "permalink": "/r/movies/comments/1jyzrze/olivia_colman_and_benedict_cumberbatch_fight_to/"
    },
    {
        "id": "1jyyqni",
        "author": "grandeluua",
        "title": "Meet The Feebles (1989)",
        "content": "",
        "upvotes": 101,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-YqBwU9niqmKwdOyUkzhu5bzQNA9ovEi40gH8GUCPig.jpg?auto=webp&amp;s=3154214b998b333d9ea99a87aa9fae2a26c0bce0"
        },
        "permalink": "/r/movies/comments/1jyyqni/meet_the_feebles_1989/"
    },
    {
        "id": "1jy6hgd",
        "author": "MarvelsGrantMan136",
        "title": "Official 30th Anniversary Posters for ‘A Goofy Movie’",
        "content": "",
        "upvotes": 6617,
        "comments": 263,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/47hintygilue1.jpeg?auto=webp&amp;s=e3abd42c1ac1f303e33f7f86716965d08aaae10d"
        },
        "permalink": "/r/movies/comments/1jy6hgd/official_30th_anniversary_posters_for_a_goofy/"
    },
    {
        "id": "1jyw3vl",
        "author": "xteve",
        "title": "Why does the audio always have such extreme dynamic range, even in productions made for home viewing?",
        "content": "I can't hear the stage-whispered details or the quiet calm of the muttering hero unless I turn up the volume. But if I do, any action or industrial noise or sweeping orchestral score is going to blow the roof off. It's anti-social if I live near anybody. This isn't a professionally-outfitted cinema. This is home viewing. I don't understand the extreme variability in sound level.",
        "upvotes": 75,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1jyw3vl/why_does_the_audio_always_have_such_extreme/"
    },
    {
        "id": "1jyl762",
        "author": "Amaruq93",
        "title": "Supporters rally to save the Cinerama Dome as future of the historic Hollywood theater complex remains uncertain",
        "content": "",
        "upvotes": 604,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NftrP3ITjUMPxxhnQjaMu-Xtt8VMI1FP3PJ_zjYWSWg.jpg?auto=webp&amp;s=9c488e05a4cb9923e6d5e5082bdf14609b54dfdc"
        },
        "permalink": "/r/movies/comments/1jyl762/supporters_rally_to_save_the_cinerama_dome_as/"
    },
    {
        "id": "1jysvr9",
        "author": "Tyll00PP",
        "title": "Just rewatched Arrival… and wow!",
        "content": "I randomly decided to rewatch *Arrival* last night, and man, it hit even harder the second time around. The way it blends sci-fi with emotion, time, and language is seriously underrated. Denis Villeneuve really doesn’t miss.\n\nAmy Adams deserved way more awards recognition for this—her performance was incredible. Also, the soundtrack?? Pure goosebumps. \n\nWhat do you think?\n\n",
        "upvotes": 136,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jysvr9/just_rewatched_arrival_and_wow/"
    },
    {
        "id": "1jytdbb",
        "author": "FilmWaffle-FilmForum",
        "title": "Which “serious” actors should take more comedic roles?",
        "content": "First person who comes to mind is Jesse Plemons. I’ve only seen him in one comedic role and it was Game Night (2018), his subtle dry humour and line delivery is brilliant. Even in his serious roles he’s got a knack for playing psychotic characters that are unintentionally funny.\n\nAre there any other actors you think should star in more comedy movies? ",
        "upvotes": 106,
        "comments": 210,
        "media": null,
        "permalink": "/r/movies/comments/1jytdbb/which_serious_actors_should_take_more_comedic/"
    },
    {
        "id": "1jyd9gh",
        "author": "Amaruq93",
        "title": "English actress Jean Marsh (Willow, Return to Oz) has died at age 90",
        "content": "",
        "upvotes": 1286,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UUstyg-i0BZEq8RFGAP4D5DsMv-Xh_dIW0htI89QYu4.jpg?auto=webp&amp;s=4e107cd879320c54f496b1a9643b9255132bd5ee"
        },
        "permalink": "/r/movies/comments/1jyd9gh/english_actress_jean_marsh_willow_return_to_oz/"
    },
    {
        "id": "1jygd8k",
        "author": "Freddy-Philmore",
        "title": "Starship Troopers first time viewing",
        "content": "I got to see this last night in a gorgeous single screen palace theater in Los Angeles. Dang... I went in thinking how this had a bad rep but was totally blown away... thought it was an incredibly smart, wild, blood-soaked satire of authoritarianism and fascism... like it was pretty obvious but still clever. Didn't realize the entire history of the film and how critics and audiences 30 years ago thought it was promoting fascism not satirizing it.",
        "upvotes": 682,
        "comments": 341,
        "media": null,
        "permalink": "/r/movies/comments/1jygd8k/starship_troopers_first_time_viewing/"
    },
    {
        "id": "1jye7es",
        "author": "BertyBert1",
        "title": "Saddest Imaginary Friend Death in Movies?",
        "content": "Personally I think it’s Wilson the Volleyball from ‘Cast Away’, while my wife thinks it’s Bing Bong from ‘Inside Out.’  Are there any other imaginary friend/character deaths we are missing?  Imaginary friend/character should not be a human or living creature, so please no animal deaths.  Animated humans and animals also do not count.  Thank you!",
        "upvotes": 743,
        "comments": 304,
        "media": null,
        "permalink": "/r/movies/comments/1jye7es/saddest_imaginary_friend_death_in_movies/"
    },
    {
        "id": "1jymlg4",
        "author": "Starvel-Avarice",
        "title": "The scene with Ryan telling the story about him and his brothers in Saving Private Ryan is arguably the best and saddest part of the movie imo",
        "content": "I watched it for the first time yesterday and this scene made me cry, aside from the 3 other times it did. The way he tells it, laughing through it, Damon's performance in that bit was incredible. The way it feels so real, just so heartbreaking. They only exist as a memory, and for Private Ryan to immediately recall something like that through the grief is really touching",
        "upvotes": 211,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1jymlg4/the_scene_with_ryan_telling_the_story_about_him/"
    },
    {
        "id": "1jz1hti",
        "author": "Initial_Doctor_9237",
        "title": "Movies That Made You Feel Tensed",
        "content": "Just finished watching Inglourious Basterds and it was amazing! I'm not much of a movie buff, but there were scenes that had me on the edge of my seat, clenching my jaw out of tension. Can anyone suggest movies that give a similar feeling? Looking for films with intense scenes that'll keep me hooked!",
        "upvotes": 15,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1jz1hti/movies_that_made_you_feel_tensed/"
    },
    {
        "id": "1jyg7q6",
        "author": "MrGittz",
        "title": "An appreciation for the dying art of practical Blood Squibs. There’s just something different about them. It’s one of the last things I feel CGi hasn’t been able to replicate 100% correct. What are some of the greatest blood squib effects in film?",
        "content": "I love blood squibs. For anyone who doesn’t know, these are practical blood packs put on an actor or stunt person to simulate bullet hits. Are they realistic? No. But there is something visceral and cool about them. And they are becoming a lost art. \n\nYou can see why CGI blood hits have taken over. Blood squibs take ALOT OF TIME. There’s the rigging, the safety, the clean up. There’s none of that with digital. Add it in post and you are good to go. There’s way more control with digital. Far more safety.  \n\nImagine blowing a take during the final big shootout of Django Unchained? Those were legit blood squibs. And the room’s walls are painted red. The clean up to start again? Hours. That’s a lot of $. \n\nBut for some reason, unless there’s an example I don’t know about, I haven’t seen CGI replicate what a blood squib does. With CGI you get the red mist, but I don’t see the chunks or clothing. There’s a look to squib hits. And I’m sure cgi maybe could get it exact if they really tried, but I don’t think it’s treated as seriously or something important enough to spend precious R&amp;D time on. \n\nBut I also think squibs affect the actors performance. Think of Al Pacino in Scarface. You feel those bullet hits and his body reacts to them. There’s a physical reaction the actors have. When you watch John Wick and John is blasting these guys left, right and centre, you don’t see the actors reacting to them too much. And look I love those movies. But the bullet hits don’t have much of an impact. It’s not visceral. \n\n\n Of course digital makes it easier to remove for ratings. Look at Die Hard 4. Released as PG13 and got an unrated cut for dvd. They added the blood in digitally and it looks awful.  Same many of the “unrated” cuts of movies that originally had PG13 ratings. Awful blood hits. It’s like they all use the same digital file to render the blood. \n\n So you can see why it’s dying. For a filmmaker to use legit blood squibs in today’s filmmaking world? I feel that needs to be celebrated. Because everything is going against you. Time, money, and yes safety. To set off a blood pack is requires a small explosive charge. They can hurt.\n\nWhen I watch John Wick 1-4, or the Deadpool movies, I’m hoping for some legit blood squib action. \n\nSo. In celebration of practical blood squibs, What are your favourite blood hits in cinema? I already mentioned Django Unchained. What else? \n\nBad Boys 2 has some great squib work. In the opening scene especially. \n\nPredator 1 &amp; 2? Jesse Ventura’s death is *chefs kiss*. Total Recall has some beauties. \n\nOf course one of the GOAT’s and one of the first major uses of a squib was in Godfather. The when Michael avenges his father’s death. Man. The hang time of that blood in the air is beautiful. In fact Godfather has a few great blood sequences. Sonny’s death is amazing. His body must have been riddled with squibs(I think they even get his face)",
        "upvotes": 431,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1jyg7q6/an_appreciation_for_the_dying_art_of_practical/"
    },
    {
        "id": "1jz1xe5",
        "author": "Dominaandherpuppy",
        "title": "Deep Blue Sea, Bad movie, or eclipsed by a great year for movies?",
        "content": "First Time posting here, and I just wanted to ask everyone's opinions about the above mentioned film, I will abbreviate to DBS for the rest of this post. In my own humble opinion this movie never gets the recognition it truly deserved, I have always been a fan of creature features and general shark movies, and I have to say personally I would rate this movie at least 2nd in the shark genre, it's fun, the actings on point, and the sharks actually look realistic, another thing I feel they did very well, was make the point, sharks are not like this, these aren't normal, so it didn't give sharks a bad name, they used a relatively unknown breed of shark with mako, and the premise was genuinely believable (to a degree) and for some reason, it never really gets a mention, and very few people I know have actually heard of it?\nAll that being said, the score of the sharks theme is also spine tingling and eerie, and it could have gone on to have a good sequel if they would have kept the graphics and effects what they were (we won't discuss DBS2 here) Honestly it had its flaws, what movie doesn't, but I'm genuinely curious, Deep Blue Sea, bad movie? Or underrated?",
        "upvotes": 12,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1jz1xe5/deep_blue_sea_bad_movie_or_eclipsed_by_a_great/"
    },
    {
        "id": "1jyxjiz",
        "author": "Spider-Man-4",
        "title": "The Practical FX Approach in Until Dawn",
        "content": "",
        "upvotes": 18,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HVMCfld5s-Au3liYcyQWpIoy1b9ldBUIFZRdzGLWdvk.jpg?auto=webp&amp;s=654faf6797ec011d53c85283a4c5cc4e508e2a57"
        },
        "permalink": "/r/movies/comments/1jyxjiz/the_practical_fx_approach_in_until_dawn/"
    },
    {
        "id": "1jz0din",
        "author": "DarkBehindTheStars",
        "title": "Movies Where The Villians Win",
        "content": "Without spoiling anything, some of the examples that immediately leap to mind on this subject are The Empire Strikes Back and Avengers: Infinity War. And arguably many Horror/Slasher films and their sequels could fit this criteria as well, with how so many of the headlining villains of those films always find ways to defy death and return for more sequels, regardless of what was done to them in the prior film(s).",
        "upvotes": 7,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1jz0din/movies_where_the_villians_win/"
    },
    {
        "id": "1jyyel0",
        "author": "Bennett1984",
        "title": "The Extraordinary Miss Flower - Trailer",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v9A_QRpJLILOLcB6rrZUlGxieKTPHarWoSZAK2EgscM.jpg?auto=webp&amp;s=50b769d5a683340e7a9b7fc71cf692a0e79e5f09"
        },
        "permalink": "/r/movies/comments/1jyyel0/the_extraordinary_miss_flower_trailer/"
    },
    {
        "id": "1jywu0l",
        "author": "Routine-Confusion-62",
        "title": "'Vitória', new film with Fernanda Montenegro, produced by her daughter's husband, Torres.",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zmtP6aATBlP71RdYepdRF-G-wjTf-e08WMPaKQSg4y8.jpg?auto=webp&amp;s=25faa8d9a42def5961d4afc8ea439a2bffb56d92"
        },
        "permalink": "/r/movies/comments/1jywu0l/vitória_new_film_with_fernanda_montenegro/"
    },
    {
        "id": "1jy0aoc",
        "author": "P3ptide",
        "title": "The HBO movie \"2073\" used the sound clip known as \"Loud Nigra\" online as a fill in for a protester getting beat up, lol",
        "content": "",
        "upvotes": 2482,
        "comments": 148,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zg6k0s1jdjue1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jy0aoc/the_hbo_movie_2073_used_the_sound_clip_known_as/"
    },
    {
        "id": "1jyf9o0",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the creepiest original score of all time?",
        "content": "My pick is more of a recent one but Jonathan Glazer’s ‘Under the Skin’ has a score so creepy it gives me literal chills every time I listen to it. Mica Levi does not get enough appreciation for creating arguably one of the best original scores in modern cinema. \n\nWhat original score never fails to give you the creeps?",
        "upvotes": 190,
        "comments": 223,
        "media": null,
        "permalink": "/r/movies/comments/1jyf9o0/what_is_the_creepiest_original_score_of_all_time/"
    },
    {
        "id": "1jyxq5t",
        "author": "NeonShark32",
        "title": "Who decides the \"movement\" of a camera? The Director, cinematographer, both, or many things combined efforts or ideas?",
        "content": "I was watching Amazing Spider-Man 2 scenes where Spider-Man does his swinging and action scenes.\n\nAnd a lot of us love those cinematography or camera movements.  \nWhich got me wondering who decides the shots? Director? Cinematographer? Both, or combined ideas from other crew?  \nWho knows, maybe even a storyboard artist made a cool storyboard shot that made it into the final film of a movie.\n\nIf you have an idea or if you have work at any of these departments. I would like to know.",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1jyxq5t/who_decides_the_movement_of_a_camera_the_director/"
    },
    {
        "id": "1jyhcp4",
        "author": "harpo_7879",
        "title": "Butch Cassidy &amp; the Sundance Kid appreciation post",
        "content": "I'm watching this movie again and I just... wow.\n\nI. Love. This. Film.\n\nI grew up in a \"movie family,\" with my dad quoting both famous and obscure films left and right throughout my childhood. He quoted this one *a lot* (specifically, \"I didn't know you were the Sundance Kid when I said you were cheating\"). Those quotes often led to the realization that his delivery sometimes was considerably better than the reality of whatever movie he was quoting, LOL\n\nThis, this right here, is the #1 exception. \n\nWhen I finally sat down and watched it at 16 or 17 (early aughts), I remember being blown away. This is one of the only movies that has retained that wonder for me over 20+ years now - I turn 40 this year.\n\nI'm not saying there aren't absolutely valid criticisms. There are. But this post is just about appreciating a film where, IMHO, the actors and the script and the cinematography are all nearly perfect.\n\nAnd the LINES. Just... I could quote this film forever. Which is wild because the script is in itself pretty sparse.\n\n\"I CAN'T SWIM!\"\n\"Who ARE those guys?\"\n\"You just keep thinkin', Butch, that's what you're good at.\"\n\"Rules! In a knife fight?!\"\n\"I work for Mr. E.H. Harriman...\"\n\nI know I'm not the only one who HEARS THEIR VOICES reading those, right?\n\nAll right, I'm done. Back to the movie. 🥰",
        "upvotes": 115,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1jyhcp4/butch_cassidy_the_sundance_kid_appreciation_post/"
    },
    {
        "id": "1jyluik",
        "author": "Odd_Advance_6438",
        "title": "Dementus’s gang in Furiosa is amazing. Love the weird names including the Octoboss, Rizzdale Pell, Smeg, etc",
        "content": "Loved that movie. All the Mad Max films have very memorable side characters, but that film was really them at their peak. I didn’t even mention Fang, Big Jilly, the History Man, Mr Norton, Mr Harley, and Mr Davidson\n\nThey don’t have a ton of screentime, but the actors said they were required by George Miller to come up with elaborate backstories for their characters. The stunt man of Rizzdale Pell said his backstory was too horrific to repeat, though he did mention that Pell wears a wig made of scalps from people he’s killed. David Collins said that Smeg is essentially Dementus’s hype man, and helps express what he’s thinking through weird movements",
        "upvotes": 61,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jyluik/dementuss_gang_in_furiosa_is_amazing_love_the/"
    },
    {
        "id": "1jyl89i",
        "author": "gerryf19",
        "title": "What is the worst trailer for a good movie?",
        "content": "Was looking at HULU and they have Tombstone, a movie I can never resist watching.  They also had the trailer and it is AWFUL.  If I saw that trailer I would never guess what a great movie Tombstone is.  \n\nConversely, Wyatt Earp is made around the same time, and its trailer is pretty good, but the movie is pretty, \"meh\".\n\nWhat other trailers for good movies were so bad you might have skipped the movie?",
        "upvotes": 62,
        "comments": 116,
        "media": null,
        "permalink": "/r/movies/comments/1jyl89i/what_is_the_worst_trailer_for_a_good_movie/"
    },
    {
        "id": "1jyzeo3",
        "author": "AlphaKoche",
        "title": "Where to watch 2015 \"extraordinary tales\"",
        "content": "I'm writing a paper on The house of usher adaptations, and I need to watch it as part of my corpus. I'm french so for some reasons most free websites, like m4uhd or fandango are unavailable. I don't really want to pay for it either. So if you have any idea of where I could watch it, i'd gladly take your requests. Thank you! (Feel free to suggest multiple websites, might always be useful). ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jyzeo3/where_to_watch_2015_extraordinary_tales/"
    }
]