[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 599,
        "comments": 4576,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nfww65",
        "author": "Haunting_Tie_589",
        "title": "Are you actually joking?",
        "content": "How DARE they? Like ads aren't bad enough now they block some shows and films unless you go and free?\n\nI am genuinely so angry about this.\n\nWhat do you guys think???",
        "upvotes": 112,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1nfww65/are_you_actually_joking/"
    },
    {
        "id": "1nfx3r9",
        "author": "Thick_Difficulty_247",
        "title": "Anyone Can Delete Profiles?",
        "content": "I have an adult account on Netflix and two child accounts. Is there anyway to stop the child accounts from being able to delete each other? They do this to spite and it’s a real inconvenience having to set it up all the time.\n\nI did look and the answer was no but this was 2 years ago so thought maybe I’d see if anything has changed!",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nfx3r9/anyone_can_delete_profiles/"
    },
    {
        "id": "1nf7w0j",
        "author": "ProofMechanic",
        "title": "With Netflix dropping a new Ed Gein series, fans are once again asking for Mindhunter to return",
        "content": "Ever since *Dahmer* became a massive hit, there’s been constant talk about whether Netflix might bring back *Mindhunter*. Now, with the upcoming Ed Gein series (October 3) from the same producer, a lot of people in the comments are repeating the same thing: *“Bring back Mindhunter.”* Is there still a change to make a comeback? ",
        "upvotes": 119,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7w0j/with_netflix_dropping_a_new_ed_gein_series_fans/"
    },
    {
        "id": "1ng19uc",
        "author": "SiSRT",
        "title": "Screen goes black with audio from time to time while watching Netflix in fullscreen mode. Happens with Firefox and Edge Browser. Happens probably 3 times per hour",
        "content": "I don't know what changed! But I have since a few weeks the issue, that the whole TV goes black while watching Netflix in full screen mode. The audio just continues. This happens with Firefox and Edge. Probably 3 times per hour. Annoying!\n\nTo resolve the problem I have either to disconnect the HDMI cable or to turn off the monitor and on again.\n\nIt does not occur while watching Netflix in window mode. this works in either browser, but obviously, it's not the same experience with all the menu bars ...\n\n* I have tested the HDMI cable on another monitor, it does not happen.\n* If i watch Youtube, Vimeo, streaming TV, Disney+ or even a video with VLC media player in full screen mode, I do not have this issue.\n\nThe issue \"goes suddenly black with only audio\" only happens with Netflix in full screen mode.\n\n* I have turned on and off hardware acceleration - did not help\n* I have disabled all AddOns - did not help\n* I've reinstalled the video AND audio driver - did not help.\n* I have ensured all Windows Updates are installed - did not help.\n\nWhat could be the issue?\n\nthank you.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ng19uc/screen_goes_black_with_audio_from_time_to_time/"
    },
    {
        "id": "1nfampr",
        "author": "LackAccomplished6057",
        "title": "Any movie recommendations to switch the brain off after a long day at work?",
        "content": "Hi everyone,  \nAfter long hours at the office, I usually come home mentally drained and don’t feel like watching anything too heavy or serious. I’m looking for some *switch-your-brain-off* kind of movies — something fun, light, maybe even silly, that doesn’t require a lot of thinking but is still entertaining.\n\nGenres I usually enjoy:\n\n* Comedies (feel-good or goofy)\n* Action movies with simple plots\n* Lighthearted rom-coms\n* Animated/family movies that adults can enjoy too\n\nBasically, something I can put on to relax, laugh, and forget about work stress for a while.\n\nWhat are your go-to *comfort movies* after a long day?",
        "upvotes": 51,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1nfampr/any_movie_recommendations_to_switch_the_brain_off/"
    },
    {
        "id": "1nfzylq",
        "author": "EntertainmentOk2661",
        "title": "Stranger things season 4 only in 4k",
        "content": "Why season 1-3 of stranger things not in 4k only season 4 im running Netflix on an Apple TV 4K with a lg g5 oled .Maybe it’s just my tv I don’t know answers will help.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfzylq/stranger_things_season_4_only_in_4k/"
    },
    {
        "id": "1nfdr0v",
        "author": "curdledwang",
        "title": "The Wrong Paris!!",
        "content": "Hey everyone!! I just stumbled across a hilarious new rom-com called The Wrong Paris! It stars Miranda Cosgrove (loved School of Rock)\n\nIt’s so cute, funny, amazing ensemble cast. Perfect for people who just need something to unwind and have a ton of laughs. Would recommend! ",
        "upvotes": 30,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nfdr0v/the_wrong_paris/"
    },
    {
        "id": "1nfz519",
        "author": "Jealous-Car-151",
        "title": "Kpop Demon Hunters: Fireplace?",
        "content": "Anybody getting this when they search Kpop demon hunters? The images are the only things that pop up on the screen. There is no video or anything it’s just a blank screen. I searched on google and nothing is popping up either. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfz519/kpop_demon_hunters_fireplace/"
    },
    {
        "id": "1nfjoli",
        "author": "AccomplishedPut5175",
        "title": "The Wrong Paris.",
        "content": "just finished watching this movie (my girlfriend made me), and if you want to watch something completely relaxing, this is the movie for you.\nAll best🍀☘️",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nfjoli/the_wrong_paris/"
    },
    {
        "id": "1nfwvek",
        "author": "Adventurous-Feed-197",
        "title": "Bad Resolutions on Non-Netflix movies",
        "content": "Ive been getting very bad resolutions, only on alot of the non netflix movies, like oppenheimer, ted and materialists (which was just added), this is only on my windows laptop, tried on edge, chrome, and even the windows app for Netflix, has anyone faced this? Is there a solution? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfwvek/bad_resolutions_on_nonnetflix_movies/"
    },
    {
        "id": "1nfo6kd",
        "author": "Orrion_the_Fox",
        "title": "Anyone else find the tags kind of useless?",
        "content": "There are the generic descriptive tags, ie. 'Thriller', 'Drama', etc. and those are fine.\n\nBut then you have tags like 'Suspenseful', 'Deadpan', 'Rousing', 'Imaginative' and 'Captivating' - tags so absurdly broad and subjective that they're completely meaningless if you're trying to use them to peruse the catalog, yet they're the majority of the tags used. Knowing ie. Peaky Blinders is a period piece drama is way more useful for knowing if I'd watch it, than knowing it's 'Captivating' and 'Provocative' or whatever.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nfo6kd/anyone_else_find_the_tags_kind_of_useless/"
    },
    {
        "id": "1nfv707",
        "author": "Nearby-Chocolate-289",
        "title": "Amsterdam",
        "content": "Brilliant film for our time, about history repeating itself and how the brave and considered fought back.\nAn all-star cast set in WWI era, uncovering a real conspiracy repeating today.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfv707/amsterdam/"
    },
    {
        "id": "1nfuqex",
        "author": "LedZepElias",
        "title": "Netflix Search AI is here (in beta)",
        "content": "Reposting this, since it looks like this community doesn’t approve screenshots and maybe my previous post is not visible at all -I respect that. So, I opened Netflix today and when I went to search something, a banner popped up. It looks like Search AI is coming to Netflix! Already tried it and it’s limited for now. I searched for “crime story with a detective trying to solve it which is also dark and mysterious”. It gave me results of shows including shows I’ve already watched and when I typed “show me only series that I haven’t watched yet” it replied “sorry, I cannot do that at the moment”. \n\nI also searched for House of Guinness and it gave me results similar to it (which of course the first result was the show itself), but when I replied with “Why Peaky Blinders isn’t listed? It’s from the same creator and is quite similar”, it just replied with similar shows other than Peaky Blinders, ignoring my question. So, I think it’s not as conversational as other AI assistants (Copilot, Gemini, etc), but it’s in beta so maybe that’s why? We’ll see.\n\nWhat do you guys think? Will you be using it?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nfuqex/netflix_search_ai_is_here_in_beta/"
    },
    {
        "id": "1nfuh6a",
        "author": "slave79",
        "title": "Standard Plan with Ads &amp; Live Sports Events",
        "content": "Today is the Canelo VS Crawford fight and I was planning on watching it with friends together. I have the Standard Plan with Ads for Netflix, will I still get Netflix's regular ads which you get during regular movies/shows or will it only be the commerical breaks from the live stream itself. Is there a possibility I will a get a Netflix Ad mid-round or will it be during downtime.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nfuh6a/standard_plan_with_ads_live_sports_events/"
    },
    {
        "id": "1nfuejw",
        "author": "imrannadir",
        "title": "What do you say about \"Saiyaara\" Movie?",
        "content": "I am planning to watch this movie and would love your feedback if you have watched already, is it worth watching or I will be wasting my time? \n\nI heard it's some awesome romantic movie..",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nfuejw/what_do_you_say_about_saiyaara_movie/"
    },
    {
        "id": "1nezmob",
        "author": "TheMirrorUS",
        "title": "Netflix's Eternal Love star Yu Menglong has died at the age of 37",
        "content": "",
        "upvotes": 74,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nezmob/netflixs_eternal_love_star_yu_menglong_has_died/"
    },
    {
        "id": "1nft1w2",
        "author": "Pankrakenator",
        "title": "I'm trying to find a show that was on Netflix between 2010 and 2014",
        "content": "It was an adult cartoon that I think was about a boy living in a trailer park with his family. I can't remember the name of it, the art style was really cheap I think, kind of south park esque but not quite. The main thing i remember was the characters cuss alooooooot. That's what made me watch the show. I remember watching it after I watched Code Monkeys but I just cant pin down what show it was, thanks in advance.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nft1w2/im_trying_to_find_a_show_that_was_on_netflix/"
    },
    {
        "id": "1nfjink",
        "author": "Original2021",
        "title": "Beauty in Black Season 2 made a huge storyline mistake",
        "content": "This season wasn’t nearly as interesting as the first season. The main reason is the lead character seems to be Rain, Kimmie’s  friend. This character is in almost every scene making weird faces and reacting with very few lines. I wanted this season to highlight more of the conflict from season one. There are too many plot holes to list here but the best scene is the last ten minutes of the season and takes place in the office. Perry’s writing and the acting were brilliant . The rest of the season was just meh- mostly  because the storyline didn’t build properly from season one. ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nfjink/beauty_in_black_season_2_made_a_huge_storyline/"
    },
    {
        "id": "1nfi2dy",
        "author": "Correct_End998",
        "title": "Looking for a feel good family movie for this weekend",
        "content": "With all the craziness going on in our lives , we really need something that isn’t too stressful and is kinda fun . We tend to enjoy movies about dogs , and my mom always enjoys a good romcom. Please nothing animated . ",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nfi2dy/looking_for_a_feel_good_family_movie_for_this/"
    },
    {
        "id": "1nf87e8",
        "author": "Top-Three-USA",
        "title": "Malin Åkerman and Brittany Snow Return as Netflix’s ‘The Hunting Wives’ Gets Season 2 Renewal",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nf87e8/malin_åkerman_and_brittany_snow_return_as/"
    },
    {
        "id": "1nfuvay",
        "author": "Ok_Aardvark5500",
        "title": "Is The Amazing Digital Circus \"appropriate\" for people with depression?",
        "content": "Sorry if I am in the wrong sub or this is not the place to ask this question. Someone told me about this show and I am curious but I am not sure if I should watch it or not, being in a very dark place right now I am afraid it would only make things worse. For a context, I do like some adult humor with psychological deepness like BoJack Horseman, but I don't like series that tend to be more provocative and extreme, like Rick &amp; Morty. Overall, I am interested in something that deals with mental illness but being this a comedy show (right?) I am afraid that people with mental illness will only be made fun of and I don't really need this right now. So, I don't know if I made the question clear.. should a person with depression watch The Amazing Digital Circus? Thanks to anyone who will answer",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfuvay/is_the_amazing_digital_circus_appropriate_for/"
    },
    {
        "id": "1nfo3yp",
        "author": "KindraTheElfOrc",
        "title": "NCIS",
        "content": "on netflix there is a new season coming soon, i tried looking it up but theres nothing about it just old stuff from the last time seasons were added, does anyone know what the season is? is it seasons 6-11 returning or season 18 being added?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfo3yp/ncis/"
    },
    {
        "id": "1nfo2ta",
        "author": "amessinprogresss",
        "title": "Beauty in Black season 2 overall",
        "content": "I noticed there ain’t a discussion and I love talking about shows I’m watching! What were y’all’s thoughts on this season or on it so far? \nGonna be spoilers in here since it can’t be episode by episode lol \nI’m only on ep 5, ima tune back in and comment after I finish 😊\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nfo2ta/beauty_in_black_season_2_overall/"
    },
    {
        "id": "1nfr83n",
        "author": "Ok_Lime_2098",
        "title": "mob psycho 100 mispelt",
        "content": "s2 e7 of mob psycho 100 is spelt 'Cornered \\~True Identity\\~' but netflix spelt it 'Cornered \\~True Identiry\\~' idek if this matters but i just saw it and was wondering if intentional or nah",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfr83n/mob_psycho_100_mispelt/"
    },
    {
        "id": "1nf9zn6",
        "author": "New-1978",
        "title": "Film for mid 40yr olds",
        "content": "Another night in with the other half- can you recommend a fun film about people in their 40s rediscovering themselves or going through mid life crisis but finding new lease of life / or going through some kind of epic journey of discovery!?!?  ",
        "upvotes": 7,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1nf9zn6/film_for_mid_40yr_olds/"
    },
    {
        "id": "1nf7iiv",
        "author": "No_Garage_2382",
        "title": "LOVE CON REVENGE",
        "content": "Have you guys watched the Love Con Revenge which was recently added on Netflix? If yes, which episode made you feel like WHAT THE ACTUAL F- IS REALLY WITH THIS CON PERSON? ",
        "upvotes": 8,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7iiv/love_con_revenge/"
    },
    {
        "id": "1nfj6d7",
        "author": "destinyrose1998",
        "title": "Netflix almost never works on my laptop.",
        "content": "Just as a reference, I have an HP spectre, bought about 3 years ago. Both the app and going online (internet explorer and Google chrome) rarely ever work. I get this weird green pixelated screen or just a black screen with the audio playing in the background. Neither are specific to what I'm on, as both have happened on the different platforms. \n\nI usually watch Netflix on my TV (as do most people, I assume), but any time I have tried to play it on my laptop, it's worked maybe 10% of the time. It's not a really big deal considering, but I would still like to know if anyone else is experiencing these problems or if anyone has any solutions? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nfj6d7/netflix_almost_never_works_on_my_laptop/"
    },
    {
        "id": "1nfa4ow",
        "author": "xxxbeebeew",
        "title": "Beauty and the Bester",
        "content": "Is this doc available outside of south africa and what are your thoughts, particularly if youre hearing/watching for the first time. Since we have a lot of background and saw the story unfold in real time, most of the stuff covered was stuff we already knew",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nfa4ow/beauty_and_the_bester/"
    },
    {
        "id": "1nfd7dj",
        "author": "Randomaf899",
        "title": "Looking for thriller series similar to Harden Coben shows :)",
        "content": "I'm so bored it's unreal and I've spent days trying to find something whilst rewatching the Harden Coben series in the background. \nI need some twists and turns and mystery. I have a thing for figuring out twists and endings far too fast so I get bored easily but at this point I'll try anything 🙉",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nfd7dj/looking_for_thriller_series_similar_to_harden/"
    },
    {
        "id": "1nfqttv",
        "author": "fostes1",
        "title": "Dissapointed",
        "content": "So, i get one month to check how is it. I check it on tv box and pc. \n\nFirst on tv box is soo slow and ugly. On pc is more beautifull.\n\nSecond, on pc somethimes it simply dont open. Example, i find tv show i want to watch, try to open but just get loading screen. I am soo dissapointed. \n\nhttps://preview.redd.it/357eeqkqrvof1.png?width=1916&amp;format=png&amp;auto=webp&amp;s=d807a4d0d9ee8a7f6ce33f760266532d8acc20b9\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfqttv/dissapointed/"
    }
]