[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 260,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iprjma",
        "author": "TheMirrorUS",
        "title": "Netflix says Emilia Perez controversy is 'bummer' for Selena Gomez and Zoe Saldana",
        "content": "",
        "upvotes": 61,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1iprjma/netflix_says_emilia_perez_controversy_is_bummer/"
    },
    {
        "id": "1ipdaia",
        "author": "Somethingman_121224",
        "title": "Netflix's Bela Bajaria Believes Amazon Overpaid 'Beast Games' To Snatch It From Netflix",
        "content": "",
        "upvotes": 119,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdaia/netflixs_bela_bajaria_believes_amazon_overpaid/"
    },
    {
        "id": "1ip9i52",
        "author": "brownieekb",
        "title": "Ralph Macchio on the new Karate Kid movie as Cobra Kai returns on Netflix",
        "content": "",
        "upvotes": 174,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1ip9i52/ralph_macchio_on_the_new_karate_kid_movie_as/"
    },
    {
        "id": "1ipw8zj",
        "author": "Robemilak",
        "title": "‘XO, KITTY’ has been renewed for Season 3 at Netflix.",
        "content": "The announcement was made on Netflix’s official X account on Friday. Season 2 of the YA series premiered on Netflix on Jan. 16.\n\n“I’m so excited to head back to Seoul for another season with our incredible cast and crew. If you thought junior year at KISS brought the drama…just wait,” said series showrunner, executive producer and writer Jessica O’Toole. “I know we left fans on a cliffhanger at the end of Season 2 but I can promise season 3 will be worth the wait, including our first summer episode — not to mention plenty of romance, friendship, adventure…and kissing. Lots of kissing.”",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipw8zj/xo_kitty_has_been_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1ipjm2l",
        "author": "MikeChatman",
        "title": "Big mistake",
        "content": "I actually like this feature. There’s no point in making it less likely I’d open my Netflix app. The only reason I renewed my subscription because I was told they finally integrated into Apple TV. Like I don’t mind that I’m basically paying for cable again with all the subscriptions I have. But taking away the convenience of the modern day tech is stupid. I like that Apple tells me about shows that are coming out from all my apps and and I just click continue watching. I don’t want to load up an app and scroll through all the ways companies organize their apps to show me what they want, not what I want. Ugh honestly I’m sure they have their financially sound reasons and I’m just venting. Either way, all these battles companies are having is preventing us from having an enjoyable experience and I guess im about to cancel Netflix again. I watch everything from Apple TV. I always end up forgetting about Netflix then I’m paying for an app I haven’t used in a year. 🤷🏾‍♂️",
        "upvotes": 31,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ipjm2l/big_mistake/"
    },
    {
        "id": "1ipwatd",
        "author": "Robemilak",
        "title": "Guillermo del Toro’s ‘FRANKENSTEIN’ will be getting a “bespoke qualifying run” in theaters from Netflix.",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipwatd/guillermo_del_toros_frankenstein_will_be_getting/"
    },
    {
        "id": "1ipdeik",
        "author": "DaviddStewartt",
        "title": "What film could you rewatch forever",
        "content": "Was looking for some films to watch, and wanted to get some ideas from everyone.\n\nWhat films could you rewatch over and over again without fail, i wanna join in\n\nIm planning to watch a film with anyone who is down with the new Public Cinema Extension. Just drop down some suggestions below:\n\nhttps://chromewebstore.google.com/detail/public-cinema/mfedjoeaeahicdibponegkifgdmbagai?hl=en",
        "upvotes": 18,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdeik/what_film_could_you_rewatch_forever/"
    },
    {
        "id": "1ipvrb3",
        "author": "Just_another_gamer_",
        "title": "Anyone know why Netflix keeps playing the last episode of a series first?",
        "content": "This is so annoying, every time I go to watch a new show it plays the most recent episode first. Just went to watch Scavengers Reign and was a third of the way through what I thought was a flash forward until I remembered to check. So that's spoiled now.\n\nI'm using the Netflix app on my Roku TV, on my own profile nobody else uses, and none of the episodes show as \"already watched\".",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipvrb3/anyone_know_why_netflix_keeps_playing_the_last/"
    },
    {
        "id": "1ipius4",
        "author": "Knightbear49",
        "title": "Netflix says its brief Apple TV app integration was a mistake. The short-lived support for Apple’s watchlist has been rolled back, according to a spokesperson",
        "content": "",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ipius4/netflix_says_its_brief_apple_tv_app_integration/"
    },
    {
        "id": "1ip5wqs",
        "author": "Robemilak",
        "title": "A Live-Action ‘Dungeons &amp; Dragons’ Series ‘The Forgotten Realms’ Is in the Works at Netflix",
        "content": "",
        "upvotes": 44,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ip5wqs/a_liveaction_dungeons_dragons_series_the/"
    },
    {
        "id": "1ipteu6",
        "author": "snowfrr",
        "title": "Show Recommendations",
        "content": "Anyone got any recommendations for shows on Netflix? I just finished watching Brooklyn 99 and looking for more shows like that. I have seen Psych in my recommended is that good?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipteu6/show_recommendations/"
    },
    {
        "id": "1ipsvt6",
        "author": "KhalilGibranIsAVibe",
        "title": "What kind of tv shows do you want to see more of and what do you want to see less of (Genre, Format, Subject matter, etc)? What is television getting right and what is it missing?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipsvt6/what_kind_of_tv_shows_do_you_want_to_see_more_of/"
    },
    {
        "id": "1ip0ytf",
        "author": "journothoughts",
        "title": "Real life Chanelle from Apple Cider Vinegar speaks out about the series",
        "content": "Chanelle McAuliffe recently spoke on a podcast about he show's depiction and what it got right and wrong about Belle Gibson's fake cancer story.\n\nKinda expected it to be dramatised, especially the show saying it was a true-ish story, but wondering where the line was in still being sensitive to people who were affected or just those in general suffering from cancer.\n\nIt was interesting to listen to and also hear her thoughts on the whole situation.\n\n[https://articles.listnr.com/news/what-you-need-to-know-from-the-friend-who-exposed-belle-gibsons-lie/](https://articles.listnr.com/news/what-you-need-to-know-from-the-friend-who-exposed-belle-gibsons-lie/)",
        "upvotes": 87,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ip0ytf/real_life_chanelle_from_apple_cider_vinegar/"
    },
    {
        "id": "1ipa24r",
        "author": "alanmcgeeny",
        "title": "What’s the best fantasy series on Netflix right now?",
        "content": "something with immersive world-building, interesting characters, and a story that pulls you in. I’d love some recommendations! What’s your top fantasy series on Netflix right now?",
        "upvotes": 10,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1ipa24r/whats_the_best_fantasy_series_on_netflix_right_now/"
    },
    {
        "id": "1ipeo17",
        "author": "brownieekb",
        "title": "Inspo if you're looking for a Valentine's day rom-com!",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipeo17/inspo_if_youre_looking_for_a_valentines_day_romcom/"
    },
    {
        "id": "1ipms58",
        "author": "Skywalker774",
        "title": "Picture froze but sound and episode goes on",
        "content": "It's happening just like I said in a title. I can't watch the show like this, it runs normally and then just freezes but episode is runing, I can hear the sound but nothing to see. I tried deleting/update. Nothing. Please help!\n\nP.S. watching on my phone",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipms58/picture_froze_but_sound_and_episode_goes_on/"
    },
    {
        "id": "1ipuu6x",
        "author": "Friendxx",
        "title": "Why is everyone so attractive on the new Love is Blind?",
        "content": "I’ve seen most of the previous seasons, and I feel like this season is an outlier because everyone is really attractive, especially the women. Like all the women look like they could be Instagram models. I think this really takes away from the point of the show, it’s now just like The Bachelor, where everyone is really attractive.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ipuu6x/why_is_everyone_so_attractive_on_the_new_love_is/"
    },
    {
        "id": "1ipodlh",
        "author": "WienerRetrievers",
        "title": "Netflix on win chrome is broken, help",
        "content": "I started watching Yellowstone on my pc, then 2 days ago the show vanished. nothing on search, and my currently viewing shows list was also gone. So i tried it on the firestick on my tv, and everything was there. My currently viewing list is back but its empty, except for the new show I started as I couldn't get Yellowstone. I had several shows in that list and I have no idea which ones. \n\nDoes anybody know how to fix this, as I primarily use my pc to watch my shows?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipodlh/netflix_on_win_chrome_is_broken_help/"
    },
    {
        "id": "1ipafuz",
        "author": "MysteriousDelay6266",
        "title": "My family | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipafuz/my_family_official_trailer_netflix/"
    },
    {
        "id": "1ipjrtz",
        "author": "CountTruffula",
        "title": "Sick note, what a gutting cancellation",
        "content": "Surprised I hadn't heard of this until recently. Ik it wasn't cancelled, just left in a limbo state without renewal but fuck. Building up to the finish I was ready for a sense of semi satisfaction despite a lack of closure with several plotlines closing but then they hammer in so much at the end. Felt like season 3 would have been absolute friedgold\n\nReally enjoyed Frost and Grint's dynamic in this and thought the side characters were all very strong. The copper was brilliantly tragic and hilarious, all in all just fantastic ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipjrtz/sick_note_what_a_gutting_cancellation/"
    },
    {
        "id": "1ipul1l",
        "author": "Neither_Technology74",
        "title": "No Netflix, I will not re-subscribe.",
        "content": "[GET WRECKED NETFLIX.](https://preview.redd.it/eaprw8grn8je1.png?width=886&amp;format=png&amp;auto=webp&amp;s=1b418a1edcaffac46ed49d8ca160c1ff1e67c022)\n\n  \nForcing me to accept before I can keep using the membership I AM ALREADY PAYING FOR. That's a hard pass, your mass of dead and crappy content just isn't worth it anymore.\n\nAre any of you going to be hanging up your membership after the latest price hike?",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ipul1l/no_netflix_i_will_not_resubscribe/"
    },
    {
        "id": "1ipdow7",
        "author": "Final_Artist9645",
        "title": "Can anyone recommend me some series to watch?",
        "content": "I've just finished Never I Have Ever and I'm about to finish Squid Game 2 too, so I'm running out of series to watch. I watched Wednesday too, and maybe someone can recommend me some series like those ones. Can you help me?",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdow7/can_anyone_recommend_me_some_series_to_watch/"
    },
    {
        "id": "1ip75db",
        "author": "v4mp_x",
        "title": "any recommendations to help cope with a passing?",
        "content": "this might be a weird thing to ask, but i’m at a loss rn and just need shows to help cope. i apologize if this goes against any rules this is my first post here but any recommendations would help! hope everyone has a wonderful day/night :) ",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1ip75db/any_recommendations_to_help_cope_with_a_passing/"
    },
    {
        "id": "1ipol4a",
        "author": "Saladee_7",
        "title": "Netflix renewals",
        "content": "Okay so a dumb teen show like XO kitty gets renewed but shadow and bone gets cancelled?! I know it got cancelled a while ago but I’m seeing all these mid shows getting renewed for the sake of media attention, and actual good shows getting put on the back burner. ",
        "upvotes": 0,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1ipol4a/netflix_renewals/"
    },
    {
        "id": "1ip1iyb",
        "author": "BusinessConcept8396",
        "title": "Surviving Blackhawk Down Documentary",
        "content": "Just finished watching the new Ridley Scott documentary about the actual battle of Mogadishu in 1993. I’m wondering how in the world they were able to track down people in Somalia and send a production crew there to interview them?!",
        "upvotes": 8,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1ip1iyb/surviving_blackhawk_down_documentary/"
    },
    {
        "id": "1ipe24p",
        "author": "EthanWilliams_TG",
        "title": "Netflix's Bela Bajaria Believes 'Oppenheimer' Would Have Had the Same Impact as a Netflix Original",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipe24p/netflixs_bela_bajaria_believes_oppenheimer_would/"
    },
    {
        "id": "1iosq90",
        "author": "Weak-Inspector4382",
        "title": "Bodies : Uniqueness in storytelling and why It is a perspective I never guessed",
        "content": "This series I witnessed holds a perspective I ached for a while. Every time I watched a series with varying timelines, the best of them gave me a satisfying ending but this one got me rethinking those endings and the overall storyline and the linear timeline of it all. This is one unique watch that focuses on filling the gaps regardless of the good vs evil debate I had in my mind accustomed to previous watches. Those of you, if had watched, Please confirm this{And sorry to rely on reddit for this (and believe you me I am not googling this trivia)}, I have a strong belief the lead is in Pirates of the Caribbean!",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iosq90/bodies_uniqueness_in_storytelling_and_why_it_is_a/"
    },
    {
        "id": "1ip4vfi",
        "author": "milm0ur",
        "title": "Emails In a different Language",
        "content": "Netflix has started sending me emails in what I think is Vietnamese. I’m trying to reset my password but every time I request a password reset email or a code to login it’s sent to me in Vietnamese? I’m pretty sure they’re official emails as the codes work but I can’t reset my email because I can’t read it. I also can’t contact Netflix Help for I don’t know what reason and I can’t find anything else online. These emails also aren’t random scam emails, they’re emails I’m specifically requesting when trying to login. Can anyone suggest any help?\n\nEdit to add: I just called 1800 404 982 and someone there talked me through getting my account back and I was able to log back in (had to resubscribe but needing to do that is what started this whole debacle) and I could log back in on the app. Would it be safe to say that it’s safe now?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ip4vfi/emails_in_a_different_language/"
    },
    {
        "id": "1ioug3i",
        "author": "thenicepunk",
        "title": "House MD subtitles bug",
        "content": "I'll explain myself, i'm french and i'm currently watching House MD in original version with subtitles and i noticed that, every two episodes the style of the subtitles is changing. Like, on S1 Ep 4 i'm having the normal Netflix subtitles, then on the next episode, i'm having the subtitles with a black background. I tried to change the subtitles but it's not working. \n\nDoes anybody has the same problem ? (I hope everybody understand what i wrote, English is not my first language sry guys)",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ioug3i/house_md_subtitles_bug/"
    },
    {
        "id": "1iped87",
        "author": "PyCoder2000",
        "title": "Netflix Incoming Intern - Need Advice",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iped87/netflix_incoming_intern_need_advice/"
    }
]