[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jiaf2l",
        "author": "Glass-Relative-9849",
        "title": "I Think adolescence is genuinely one of the most eye opening pieces of media made recently.",
        "content": "From the desensitised nature of the children in the school only asking for videos of the murder to the cheering and filming in the school fight as well has his friend casually lending him a knife to \"scare\" Katie. The pupils not listening to teachers who are emotionally and physically absent towards all of the children plus the children's refusals to take part/ care about the lessons or authority at all. This is even shown after Jamies  dad confronts the teens who vandalised his car laughing at his genuine struggle and emotion. Jamies behaviour towards women such as the psychologist and his mum and his immediate switches in attitude towards any male figures. The obsessive lying such as about pickles, marshmallows and his small ways of putting the psychologist down like calling her old or being rude about her sandwich as well as his mum where he says shes good at nothing but cooking roast. the obsession with media shown through his isolation into his bedroom after receiving a gaming set up. its not explicitly said he was watch the red pill andrew tate type media however its inferred. the detective who cannot connect with his son in the slightest due to his isolation and even the detective (I believe) viewing him as less than (due to his former popularity and the son not being popular). the way real society has received this media as well many people denying Jamie did it after CCTV showed explicitly what happened or justifying it due to Katies \"bullying\" which was just calling Jamie out on his genuine misogynistic views towards katie and girls in general. Believing he's better than other men as he didn't SA katie even thought he \"had the chance\" and after his guilt was discovered he less regularly said \"i didn't do it\" but switches to \"i didn't do anything wrong\" showing his rationalisation of his actions due to his veiws on women. This show is amazing i've never seen anything so real and so accurate of our society ever. I could write an essay about this show and these are just SOME of the tiny details in the show that i missed at first but its crazly well written and has a scarily accurate depiction of the disheartening youth culture currently so well. \n",
        "upvotes": 62,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jiaf2l/i_think_adolescence_is_genuinely_one_of_the_most/"
    },
    {
        "id": "1jhviki",
        "author": "Boukrarez",
        "title": "The OA, cancelled, Archive 81, cancelled, 1899, cancelled. Netflix can go fuck itself.",
        "content": "Sometimes I wonder what is their logic for doing this?\n\nI **understand** that some fan-loved shows get cancelled because of low ratings/viewership over-time, but these titles (among others) were topping the charts.. Why do they insist on shooting themselves in the foot while crap shows get renewed constantly? It's baffling.",
        "upvotes": 414,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1jhviki/the_oa_cancelled_archive_81_cancelled_1899/"
    },
    {
        "id": "1ji4y05",
        "author": "Inside-Afternoon4343",
        "title": "Adolescence - maybe a hot take",
        "content": "In the second episode, DS Frank talks about how what messes with her is that after all is said and done, they‘re here for Jamie, and people will remember Jamie as opposed to Katie. I thought this was a great jab at true crime and the fascination with killers who gain some sort of almost celebrity status that lasts even way after they‘re dead, while their victims often fall into obscurity.\nAnd yet, didn‘t adolescence end up doing the same? It‘s another show about another killer who remains centred. We are again trying to understand the killer and trying to figure out why he did what he did. On the other hand, we only see pictures of Katie and get some scenes with her best friend, but we never see her family, we never see what Jamie‘s act did to them. We don‘t learn anything about Katie except that she called Jamie an incel, which again is about him. We don‘t know what she liked, what her childhood was like, what she was like as a person, what her hopes and dreams were. Another girl fading into obscurity.\n\nDon‘t get me wrong, it‘s an excellent show from the craftsmanship perspective. Those one shot episodes are wild, and it‘s so impressive from all the actors as well. I just thought it was interesting they brought up that point in the second episode just to then end up doing the same. I know Bascombe replies to this that they‘re there for Katie, to get justice for her, but I just don‘t fully buy it. They wanted the understanding of Jamie‘s understanding. \n\nI‘d be very curious to hear other people‘s opinion on this because I may have missed the point, but this is just my interpretation of it ",
        "upvotes": 32,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ji4y05/adolescence_maybe_a_hot_take/"
    },
    {
        "id": "1ji1azd",
        "author": "Somethingman_121224",
        "title": "Hideo Kojima Praises Netflix's 'Adolescence'",
        "content": "",
        "upvotes": 27,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ji1azd/hideo_kojima_praises_netflixs_adolescence/"
    },
    {
        "id": "1jhmggt",
        "author": "-Xoz-",
        "title": "Adolescence is the best show from Netflix in a long while",
        "content": "My God! This show is so fucked. In mere 4 episodes, the show manages to tackle huge issues like the evil of social media among younger generation, the consequences of it, the legal system of a nation and the family which suffers through it all.\n\nThe cinematography and the music is intense. Check out the soundtrack by Aaron May and David Ridley. Stephen Graham is a mad actor! The other actors have done a great job and the overall production is a beautiful piece of art. They shot entire episodes in a single take! \n\nThe finale of the episode will tug at your heart strings. You can't stop from feeling the dread of the family. Stephen really outdid himself in this episode, he better have an Emmy or at least a nomination. I nearly cried, he portrays the emotion in such a devastating way that you may have to look away. \n\nI found the series highly engrossing. It draws you in and let's you do the work of filling in the gaps as a viewer, really makes you think. Most Netflix shows have been mid for me for the past couple of years, I haven't loved a Netlix show as much as this one in a long while. Do give it a watch.\n",
        "upvotes": 366,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1jhmggt/adolescence_is_the_best_show_from_netflix_in_a/"
    },
    {
        "id": "1jiacgy",
        "author": "Impossible-Bowler137",
        "title": "My thoughts on Adolescence",
        "content": "I think it was amazing. I was supposed to just watch one episode but watched it all in one sitting. I loved the fact that each episode was filmed in one shot, it felt very real and raw. \n\nI hate the kid, don’t feel sorry for him at all, hope he suffers and if my kid ever did anything like that id disown them. \n\nI do however empathise with the family, I felt so bad for them and I understand why they kept in contact and such. They actually kinda reminded me of my family being just me (daughter) and my parents, they felt so real and relatable in a way. \n\nThe acting was phenomenal from all the actors, main and background characters. \n\nIt was a really gripping drama that honestly had me thinking quite deeply about a lot of stuff, which I love to do. The message behind it is so important and the fact that it’s about such realistic topics makes me sad, but it’s important that we’re talking about these things. I hope there is better things in the future for the kids of our world and that we heal as a society 🙏 ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jiacgy/my_thoughts_on_adolescence/"
    },
    {
        "id": "1jibboc",
        "author": "Striking-Profession1",
        "title": "The Residence: what was about the blink???",
        "content": "&gt;! In the finale of 'The Residence,' how did Detective Cupp discredit Lilly Schumacher's account about the suicide note? \n\nLilly claimed she gave the note to Bruce, who then placed it in Wynter's pocket in front of her. However, Cupp said that Lilly couldn't have known the note's location unless she had  seen Wynter putting it there. Does it make sense ? !&lt;\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jibboc/the_residence_what_was_about_the_blink/"
    },
    {
        "id": "1ji0km5",
        "author": "S4v1r1enCh0r4k",
        "title": "New Trailer Released for South Korean Crime Thriller 'Karma' Coming To Netflix in April",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ji0km5/new_trailer_released_for_south_korean_crime/"
    },
    {
        "id": "1ji8m6l",
        "author": "Stepin-Fetchit",
        "title": "Any recommendations for good action or suspense thrillers newly available or that I may not have heard of on streaming from last 10 years?",
        "content": "Any recommendations for good action or suspense thrillers newly available or that I may not have heard of on streaming from last 10 years?\n\nLooking for something relatively fast paced and entertaining. Thanks!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ji8m6l/any_recommendations_for_good_action_or_suspense/"
    },
    {
        "id": "1jiegbu",
        "author": "liampixels",
        "title": "Plz help i need this so much (i watched this a LONNNG time ago)",
        "content": "**Title:** Looking for a Gross-Out Animated Show from Around 2017/2018 on Netflix!\n\n  \nHey, I’ve been trying to remember the name of this animated show I watched on Netflix around 2017/2018, and I need some help. Here’s what I remember:\n\n* The show was **3D animated**.\n* The main characters were **short adults**, kind of like action hero types (they wore vests like Rex Dangervest from *The Lego Movie 2*).\n* The humor was **gross-out** (think boogers, poop, slime, that kind of thing).\n* They didn’t really act as detectives, but they fought **gross creatures**, like weird, nasty monsters or creatures made of slime and other gross stuff.\n* The tone was **funny and over-the-top gross**, not serious at all.\n* I’m almost positive it was on **Netflix**, and it aired around **2017 or 2018**.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jiegbu/plz_help_i_need_this_so_much_i_watched_this_a/"
    },
    {
        "id": "1ji8nae",
        "author": "fivecoloursgirl",
        "title": "recommendations please",
        "content": "i just finished adolescence and enjoyed it, the only thing is i don’t know what to watch next!\n\ni tend to go for serious, thriller type series e.g murder mysteries\n\nwhat similar things have you enjoyed?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ji8nae/recommendations_please/"
    },
    {
        "id": "1ji1b1d",
        "author": "SignificanceExact963",
        "title": "Castlevania and Nocturne *Full Spoilers*",
        "content": "Just finished Castlevania and S2 of Nocturne. I loved Castlevania and pretty much every aspect of it from the plot, animation, action, characters, just everything. \n\nNocturne is a little disappointing this far. The plot doesn't really seem very cohesive and not as much time is spent on character development. My biggest gripe is everything involving Edouard. First off i was under the impression that soul forging took damned souls from hell and used dead bodies as a vessel to house them. But now apparently it's just the soul of the person who had the body? Not a fan of that. Also why on earth did no villains kill the night creature who betrayed them multiple times?? Ridiculous to keep him alive. Same with Drolta like it really ruins any death when they can just be brought back to live essentially perfectly themselves with no downside. I don't get why the Abbot didn't have control over them at all. \n\nThen there is the Abbot himself. What was his thought process? \"OH I should be the worst forgemaster ever and use demons to fight for god\" Then after everyone realizes that the Abbot is doing this they are just all to chill with that discovery. Father of my child or not I don't think I'm just chatting with him in my house after that. \n\nI also don't understand what Olrox was really doing there. He never seemed into the vampire messiah thing so why go there in the first place. \n\nFinally all the non main vampires crumbled like paper as well as the night creatures really. Then suddenly forest during the day=absolutely no sun reaches the ground and vampires get there safely somehow. \n\nThe animation, action scenes, and creature designs were top notch though. Let me know if others agree. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ji1b1d/castlevania_and_nocturne_full_spoilers/"
    },
    {
        "id": "1jhwund",
        "author": "S4v1r1enCh0r4k",
        "title": "Zero Day, Love is Blind, Cobra Kai, American Murder Made it to the Nielsen's Overall Top 10 For the week of February 17 to 23,",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhwund/zero_day_love_is_blind_cobra_kai_american_murder/"
    },
    {
        "id": "1jibjl2",
        "author": "Yuck_Few",
        "title": "Walking Dead, Dead City",
        "content": "The Marshall trying to arrest Negan for the stuff he did with the saviors is just silly. Remember at some point in the show they did a 6-year time jump so they're 18 years into the zombie apocalypse. At this point who cares who did what? \n\nAnd then there's the nail guns that somehow magically fire without an air compressor",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jibjl2/walking_dead_dead_city/"
    },
    {
        "id": "1jia7ho",
        "author": "Life247",
        "title": "Powerpuff Girls leaving?",
        "content": "Powerpuff Girls was shown as leaving on April 2, but after checking today that alert was removed from it. The other 2 specials on Netflix are still marked as leaving (the Christmas and the PPG rule!) On April 2. Are the series here to stay on Netflix?\n\nAre there any other specials not on Netflix that I should know about so I can find and watch them elsewhere? I live the Powerpuff girls!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jia7ho/powerpuff_girls_leaving/"
    },
    {
        "id": "1jhw8v0",
        "author": "Perdedorsinvalor",
        "title": "Is Netflix messed up for anyone else?",
        "content": "It has been like this for the past 24 hours. I only watch it through my Windows 11 PC. I've never had an issue with it before. It is very slow and mostly won't load at all. There is the error message, \"site cannot be reached. Took too long to respond.\" I've read all of the articles about it that I could find and have tried just about everything. I've cleared the cache, restarted my modem, tried different browsers, and tried the Windows app; nothing works, but my internet is just fine. ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jhw8v0/is_netflix_messed_up_for_anyone_else/"
    },
    {
        "id": "1jhe1vr",
        "author": "Immediate-Suit-4621",
        "title": "Fell for British Series – What Should I Watch Next?",
        "content": "After watching *Adolescence*, I’m well into British series now. The vibes, the storytelling, the characters, I’m all for it. So, drop me some recs! I’m down for a thriller that keeps me on my toes or a drama that hits right in the feels. As long as it’s a banger, I’m in. Old, new, whatever, just gimme the good stuff. What are your go-to British series?",
        "upvotes": 119,
        "comments": 289,
        "media": null,
        "permalink": "/r/netflix/comments/1jhe1vr/fell_for_british_series_what_should_i_watch_next/"
    },
    {
        "id": "1ji7ffz",
        "author": "Tanmay_Terminator",
        "title": "how to watch in HDR on windows, Netflix",
        "content": "I'm having issues getting Netflix to stream in HDR despite having a fully compatible setup. Here's what I have:\n\n* 4K OLED display with HDR capability (HDR is turned on in windows settings)\n* Netflix Premium (4K) subscription\n* Content that I know is available in HDR ( the piano lesson)\n* set Netflix streaming quality to \"High\" in app settings\n* Turned on DRM in Microsoft Edge\n* installed and reinstalled\n* restarted everything\n* Internet is above 100MB/s\n\nWhen checking the stream info, I'm still seeing:\n\n    CopyVideo Track: Codec: video/mp4;codecs=avc1.4d0028 (avc)\n    Video Tags: CE3-DO,POI,identPOI,ladder\n\nThis is standard H.264 encoding (not HDR), even though I should be getting HDR content.\n\nThis is standard H.264 encoding (not HDR), even though I should be getting HDR content.\n\nWhat should i do?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ji7ffz/how_to_watch_in_hdr_on_windows_netflix/"
    },
    {
        "id": "1jhgbda",
        "author": "Yuck_Few",
        "title": "Kim's Convenience",
        "content": "This was one of the best comedy series I've seen in quite some time. I hope all the actors get other acting jobs because they all did an amazing job.\nSanjiv Mehta was my favorite character. He was hilarious \nSucks that it got canceled because It leaves a lot of topics unresolved.\nLike did Janet's photography career ever take off or did Jung and Appa ever resolve their issues. Also, it never really gives a lot of detail as to why they didn't get along in the first place.\n",
        "upvotes": 76,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jhgbda/kims_convenience/"
    },
    {
        "id": "1ji699j",
        "author": "Adventurous-Dot-3350",
        "title": "Thought thoughts on your TV show.",
        "content": "With the upcoming season five I decided to see if I could rewatch you.  I started watching season one, and what I’m finding is that I don’t like it as much as I liked it the first time. I mean, I really loved it… and also I didn’t really see the dark humor in it the first time and not really sure why… but anyway, it just was not as interesting to me in a huge way, as it was the first time. I mean, Beck was an insufferable character, the first time around, and this time more so. The whole show just bothered me, but I kept waiting for it to get better for me. Mostly it was just funnier, but also something I didn’t want to commit my time too. I made it to season two, and then oh yeah, I remembered – even though  i still liked the show – I remembered how much I was starting to dislike it the first time around! With all of this said, I’m disappointed on how I feel about the show – I mean, as I said, I really liked it that first time! Who was I? I’m also remembering season four and the first time around with that. I really didn’t like it – all the characters bugged the crap out of me. Even so I’m still curious about season five, and curious about other thoughts on this as well!   Edit: talk texting mistake – so sorry! I’m referring to the TV show, “You”!!! And even since I posted this, I’m really on the fence about the show – I’m still questioning on what I liked about it in the first place – just not sure…\n\n",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ji699j/thought_thoughts_on_your_tv_show/"
    },
    {
        "id": "1ji0euj",
        "author": "salsamunny",
        "title": "The Residence Political Undertones",
        "content": "I’m not huge into murder mysteries, but The Residence is definitely entertaining in other ways and I’m loving these little sarcastic political undertones throughout the show. Cupp complaining about the male majority in the house  was pretty obvious and then the senator offering to abolish all education made me chuckle. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ji0euj/the_residence_political_undertones/"
    },
    {
        "id": "1ji51z3",
        "author": "Right_One_3575",
        "title": "romance recs for specific categories",
        "content": "Romance recs for oddly specific categories\n\nneed recs (both movies and shows work!) for these specific tropes:\n\n- no love triangles pls 😭 \n\n1. fictional school setting (fantasy school/school for misfits or supernatural kids, that sort of thing) + romance (bonus: swoonworthy male hero) + also not too childish???\n\n\n2. grump x sunshine romance + fantasy \n3. good girl x bad boy romance + fantasy (or no fantasy)\n\n\n- OR A COMBINATION OF ALL OF THE ABOVE\n\nromance heroes i love: damon salvatore, jace herondale, nick from my fault london/ my fault (not on netflix), peter kavinsky, james beaufort from Maxton Hall (not on netflix)\n ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ji51z3/romance_recs_for_specific_categories/"
    },
    {
        "id": "1ji3kel",
        "author": "E-ICheshire",
        "title": "Netflix suddenly asking for pin to watch Delicious in Dungeon",
        "content": "My parents recently made me my own profile on their Netflix account. I started watching Delicious in Dungeon yesterday and I got all the way to episode 11 but when I tried to continue watching it today it said \"Enter PIN to watch restricted content\"????? I know there's a pin for restricted content on both my moms' profiles but I never set one up for mine AND I didn't have to put one in yesterday so IDK why it's suddenly asking for a pin. Does Netflix use the same pin across all profiles or something? And if so why didn't I need it yesterday????",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ji3kel/netflix_suddenly_asking_for_pin_to_watch/"
    },
    {
        "id": "1ji39hv",
        "author": "cocolover6969",
        "title": "Can someone please help me",
        "content": "I want to watch anime on Netflix but theres only Japanese with Japanese subtitles, some of them are even German or French. Can someone help me on how to get English versions ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ji39hv/can_someone_please_help_me/"
    },
    {
        "id": "1jhp9ug",
        "author": "Just-Phill",
        "title": "Best episode of Adolescence being broken down by the 2 actors Owen Cooper and Erin Doherty",
        "content": "https://youtu.be/F7BRIlYFpPY?si=fSq9gng_6328VWw3\n\n\nCONTAINS SPOILERS** This video of Owen and Erin watching the therapy episode and discussing it is so intriguing I had to share it. This kid, if he wants to keep acting, had such a bright future his talent is through the roof.",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhp9ug/best_episode_of_adolescence_being_broken_down_by/"
    },
    {
        "id": "1jhuqk1",
        "author": "Current-Routine2497",
        "title": "How to turn off automatic playing of trailers?",
        "content": "While browsing trailers start playing every time you select a movie. Besides the fact that I hate trailers because they contain spoilers regularly, this also makes the browsing experience very stressful and not chill for me. Is there a way to turn this off?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jhuqk1/how_to_turn_off_automatic_playing_of_trailers/"
    },
    {
        "id": "1jhigbf",
        "author": "MysteriousDelay6266",
        "title": "'Little House On the Prairie' Reboot for Netflix begins search for Ingalls Family",
        "content": "",
        "upvotes": 26,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1jhigbf/little_house_on_the_prairie_reboot_for_netflix/"
    },
    {
        "id": "1jhimsj",
        "author": "SpecialistShort6421",
        "title": "More tornado documentaries centering around stories of survival.",
        "content": "Just finished watching Twister: Caught In The Storm. This was such a great documentary. It centered around stories of survival during the 2011 Joplin, Missouri Tornado. For someone who is fascinated with weather, I wish we had more documentaries like this surrounding stories of survival before, during and after major tornadoes like the 2012 Henryville Indiana Tornado. The Washington Illinois Tornado. The 2011 Super Tornado Outbreak in April. ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jhimsj/more_tornado_documentaries_centering_around/"
    },
    {
        "id": "1jianfz",
        "author": "Mindless_Hippo_174",
        "title": "Adolescence - Need clarity",
        "content": "Spoilers maybe ahead -\n\nI totally get how the young minds are being corrupted because of the age of the internet and unsupervised access to anything and everything. And the influence of some people on them.\n\nBut I noticed they pulled this guy called Andrew Tate into it. I knew his name from before but I really don’t know why he got into trouble or anything. From what I could search on Google and chatGPT, he never started all this “incel” stuff. From what I gathered, he’s put out some misogynistic content and for some of them he has given (not really) an apology / explanation.\n\nAnd now he makes videos about self improvement and pushing oneself and sells some course as well.\n\nI also gathered that he’s been considered a dangerous influence by many schools.\n\nI want to know if he actually suggests/suggested violence against women or promotes anything related to that.\nBecause the sources I gathered are extremely against the guy or extremely supportive of him. In my experience, truth lies somewhere in between.\n\nWhat are your thoughts? Was the naming justified? Or is the series promoting some sort of propaganda? Although I would have to agree with the underlying point. I’ve personally learnt about some kids talking about porn and all that stuff even before they turned 15. This definitely needs to stop.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jianfz/adolescence_need_clarity/"
    },
    {
        "id": "1jhwx6p",
        "author": "obliviousym",
        "title": "Netflix Household",
        "content": "Hi! Its been having a netflix account. I have a problem regarding the household? My smart tv is where my account is originally logged in to but ever since I bought a chrome cast for my non-smart tv, its been logging out. Or is in another issue? I keep logging it in and seems to work as normal but when I'm gonna open it in different tvs it keeps on logging me out and saying to update my household",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jhwx6p/netflix_household/"
    }
]