[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 49,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r24oyw",
        "author": "South-Base3985",
        "title": "Why isn’t there a skip outro button?",
        "content": "When i’m watching an anime or anything similar with a blooper after the outro i normally have to manually skip the outro but it would be so much better if there was a skip outro button. ",
        "upvotes": 33,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1r24oyw/why_isnt_there_a_skip_outro_button/"
    },
    {
        "id": "1r2bmih",
        "author": "Common_Floor_7195",
        "title": "Netflix still does not send 4K content to mobile devices in 2026...?",
        "content": "For $25.00 a month, the fact that you can't stream 4K movies and shows on your iPad Pro in 2026 is just insane and honestly feels like a scam for the premium price(yes I am fully aware you can stream 4K via your TV, set top box, PC or Mac on the web, etc.). Almost every other top service have supported streaming 4K on mobile for YEARS now, besides Netflix. How does a company worth $350 billion in February 2026 STILL get away with this?\n\nNETFLIX JOIN THE REST OF THE WORLD AND SUPPORT\n\n4K STREAMING ON MOBILE ALREADY.",
        "upvotes": 10,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1r2bmih/netflix_still_does_not_send_4k_content_to_mobile/"
    },
    {
        "id": "1r2917l",
        "author": "Bacon_king1202",
        "title": "I’m loving blacklist",
        "content": "Blacklist is amazing I’ve been enjoying it sooo much if you enjoy crime thrillers I’d really suggest this one I hear it starts to decline after season 5 from what I hear but I mean long shows always have a decline eventually ",
        "upvotes": 11,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1r2917l/im_loving_blacklist/"
    },
    {
        "id": "1r2fvcc",
        "author": "southsideserpent18",
        "title": "Why is music and background audio sound so low but voice is normal?",
        "content": "I watch Netflix almost every night but the last couple of days the sound has been messed up. I can hear the voices talk normal but music is so low and barely can hear it. Is there a fix to this?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1r2fvcc/why_is_music_and_background_audio_sound_so_low/"
    },
    {
        "id": "1r2hf7k",
        "author": "evoxbeck",
        "title": "I'm tired of signing in",
        "content": "Only use Netflix at home, every 5th day we have to log into the account. I'm so glad back in the day on Twitter \"passwords are for sharing\" now I can't stay logged into my f'ing account at home. Like the prisoner you make it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r2hf7k/im_tired_of_signing_in/"
    },
    {
        "id": "1r2hdyu",
        "author": "Significant_Ad3441",
        "title": "Star Search Live Voting not Available",
        "content": "Is anyone else not getting the Live voting prompt tonight? I’m so sad, I haven’t been able to vote. It’s not working on my Apple TV nor on my Netflix mobile app",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r2hdyu/star_search_live_voting_not_available/"
    },
    {
        "id": "1r1kboi",
        "author": "laureidi",
        "title": "Star Search giving space for being super preachy gives me the ick",
        "content": "So I am a little late to it, but just now watched the first two episodes of Star Search. I’m not very invested in contemporary music so I didn’t know who Jelly Roll was. I thought he was charming through watching this, noticed a moment when he was talking about the Christian god in the first episode but it was brief so I ignored it. Now at the end of the second episode, I’m realizing I’ll be removing this show from my list. Suddenly the whole thing became a televangelist prime time, which, when we’ve literally mentioned several times already that this show is live for the whole world to see, to me became very tone deaf. I don’t care what kind of religion you practice, as long as you don’t shove it in my face and especially if you’re gonna try to convert me I’m hella out. I just came here to watch some sparkly talent entertainment compete with each other I didn’t ask for missionaries wtf ",
        "upvotes": 86,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1r1kboi/star_search_giving_space_for_being_super_preachy/"
    },
    {
        "id": "1r27oj1",
        "author": "Right_Wall_1920",
        "title": "Feel good movies with stunning visuals",
        "content": "At my lowest today for some reason. Please suggest some feel good movies (absolutely no violence, nudity, hospitals). Crave to watch something with beautiful visuals. ",
        "upvotes": 4,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r27oj1/feel_good_movies_with_stunning_visuals/"
    },
    {
        "id": "1r1w786",
        "author": "RunDNA",
        "title": "I loved The Breakthrough. It's a Nordic noir show from Sweden about a real-life murder case that was investigated using genetic genealogy.",
        "content": "The Breakthrough [Genombrottet] (2025).\n\nIt only goes for 4 episodes, but I enjoyed it a lot. It's a police procedural with excellent acting and some deep emotions.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r1w786/i_loved_the_breakthrough_its_a_nordic_noir_show/"
    },
    {
        "id": "1r1jr7l",
        "author": "Raccoon1122",
        "title": "“Hang the DJ” is a masterpiece",
        "content": "I posted this earlier today on the r/blackmirror sub just wanted to see what more people thought :)\n\nI consider myself to be someone who loves love more than almost anything so maybe this is just me but “Hang the DJ” (S4, E4) of black mirror is one of the most beautiful pieces of cinema I’ve ever watched.\n\nI’ve probably rewatched it about 100 times and it brings me to tears almost EVERY SINGLE TIME.\n\n(It also helps that Georgina Campbell is an absolutely GORGEOUS woman and they are both incredible actors)\n\nEven the scene where they hold hands for the first time in like the first 10 minutes, just an absolutely beautiful scene and it hits me so hard.\n\nMan I love it so much. Gotta do another rewatch tonight after writing this! \n\n(Side question: anyone got any recs to anything similar?)",
        "upvotes": 56,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r1jr7l/hang_the_dj_is_a_masterpiece/"
    },
    {
        "id": "1r2910j",
        "author": "EzSM23",
        "title": "Good series to watch?",
        "content": "Any recommendations, I enjoyed DARK, Ozark, Snow P, 3%\n\nAnd many more, but please give me some of your favourite recommendations, I want to watch something good and stuck on finding anything ",
        "upvotes": 2,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r2910j/good_series_to_watch/"
    },
    {
        "id": "1r1khrb",
        "author": "Large-Cardiologist54",
        "title": "What’s the point of my list if I never watch anything on it?",
        "content": "I have like 40 things saved on my list, and I’m always trying to convince myself “this is the night I’ll finally watch one of them.”\n\nThen I still somehow, I’ll scroll every night, read descriptions, watch trailers, always second guess everything, and end up watching nothing... By the time I decide I’m already too tired. Why is it so hard to just press play?",
        "upvotes": 26,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r1khrb/whats_the_point_of_my_list_if_i_never_watch/"
    },
    {
        "id": "1r283ye",
        "author": "MindlessBlock6292",
        "title": "George Hodel",
        "content": "Was there a documentary on Netflix about George Hodel and his family? I vaguely remember watching a doc a few years back about a doctor who abused his children and family. I’m listening to the Root of Evil podcast and it sounds familiar. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r283ye/george_hodel/"
    },
    {
        "id": "1r17xat",
        "author": "shanthor55",
        "title": "Ads during a manual pause shouldn’t happen.",
        "content": "I’m fine with ad breaks in watching my movie or show so that they can plug whatever. It has unfortunately become expected over the years. \n\nWhat I’m not fine with is an ad taking over the entire screen when the purpose of my pausing was to read some scribble, take time to process subtitles, or look over some other detail that is integral to the plot of a complicated story. Ex: The entire reason I paused my viewing was to look more intently at something written in a language I struggle to understand that overlaid an intricate map, but now it’s taken over by Glenn Powell. ",
        "upvotes": 82,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r17xat/ads_during_a_manual_pause_shouldnt_happen/"
    },
    {
        "id": "1r237df",
        "author": "LilNello1",
        "title": "Vladimir (Trailer)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r237df/vladimir_trailer/"
    },
    {
        "id": "1r1k12l",
        "author": "lunds11",
        "title": "ER Added to Netflix Canada - Worth Watching?",
        "content": "ER just dropped on Netflix Canada. Never seen an episode before in my life and 15 seasons seems daunting. Any fans of the show out there able to sell me on it? Maybe there’s a good breaking point where you don’t watch all the seasons? Or maybe it’s good enough for the full haul. Thanks!",
        "upvotes": 17,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1r1k12l/er_added_to_netflix_canada_worth_watching/"
    },
    {
        "id": "1r1pvwv",
        "author": "MyOwnDirection",
        "title": "The auto \"Next Episode\" cuts episodes short!",
        "content": "I've been binging \"Search Party\", watching it on my iPad while doing some receptive work on my computer. So I let the episodes auto-play the next episodes ... and it was only half-way during the 3rd season that I realized that letting \"next episode\" automatically do its thing, cuts about 2-3 minutes from the end of every episode. \n\nYes, I have missed out on cliff-hangers and key points of this series for 2.5 seasons now. You HAVE to tap the screen to let the episode conclude properly.  Dammitt! I missed out on crucial points. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r1pvwv/the_auto_next_episode_cuts_episodes_short/"
    },
    {
        "id": "1r16bxf",
        "author": "Master_Addendum3759",
        "title": "Top 100 highest rated films on Netflix right now, ranked by aggregating 6 different sources",
        "content": "Built a thing that pulls ratings from IMDb, RT, Metacritic, Letterboxd, AlloCiné, and Douban and blends them into a single weighted score. The algorithm is weighted, with critics &gt; cinephiles &gt; mainstream. But you can change this to be all equaled or preferring mainstream sources.\n\nI ran it against every film on Netflix. Here's the top 10:\n\n1. The Godfather (1972) - Francis Ford Coppola: 94.7\n2. The Godfather Part II (1974) - Francis Ford Coppola: 93.8\n3. Grave of the Fireflies (1988) - Isao Takahata: 90.5\n4. Pulp Fiction (1994) - Quentin Tarantino: 90.4\n5. Spirited Away (2001) - Hayao Miyazaki: 89.7\n6. The Dark Knight (2008) - Christopher Nolan: 88.6\n7. No Country for Old Men (2007) - Joel Coen: 88.4\n8. Spider-Man: Into the Spider-Verse (2018) - Bob Persichetti: 87.1\n9. My Neighbor Totoro (1988) - Hayao Miyazaki: 87.0\n10. Whiplash (2014) - Damien Chazelle: 86.9\n\nFull top 100 here: [https://moviesranking.com/top?provider=8&amp;limit=100](https://moviesranking.com/top?provider=8&amp;limit=100)\n\nWhat do you guys think?",
        "upvotes": 46,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1r16bxf/top_100_highest_rated_films_on_netflix_right_now/"
    },
    {
        "id": "1r0r8wn",
        "author": "twomilliontwo",
        "title": "Lincoln Lawyer",
        "content": "Netflix, you cannot make enough episodes of this show. This is my favorite show on streaming currently. Whether you have read the books or not, the show does not disappoint the viewer. We’ve got a little 90s vibe with a pacing and a current vibe with the casting. And I just can’t say enough about my favorite Netflix show. \n\nGive us more seasons! Maybe longer seasons how about a longer season and you could take the episodes down a couple of minutes, but give us 20 episodes!\n\nThank you in advance. \n\n ",
        "upvotes": 296,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1r0r8wn/lincoln_lawyer/"
    },
    {
        "id": "1r1unow",
        "author": "Silver-Lawfulness453",
        "title": "What do I do if my audio isn't playing for one specific thing?",
        "content": "I've been trying to watch Bubble (the anime movie) but I hear nothing, and my TV is usually at 20 for noise.\n\nNot even the ads seem to have sound or anything.\n\nSo, is it just me?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1unow/what_do_i_do_if_my_audio_isnt_playing_for_one/"
    },
    {
        "id": "1r2ceij",
        "author": "TwinSong",
        "title": "A lot of Netflix shows seem very gory",
        "content": "Unless they are specifically rated for a younger audience, they tend to have a lot of gore. Things like limb removal, dismemberment, loss of eyes, tongue, characters having to perform painful surgery on themselves to survive. *Witcher* has a disturbing scene involving Yennifer, that put me off. It doesn't matter which genre, they seem to always have this.\n\nIt's like we've gone from films/shows being unable to show blood, to R-rated content as standard. Trying to find something that doesn't have these elements is difficult.\n\nThere are content warnings but they're kind of vague, \"injury detail\" is a broad category.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1r2ceij/a_lot_of_netflix_shows_seem_very_gory/"
    },
    {
        "id": "1r1hlwg",
        "author": "mgepark",
        "title": "Message From The King",
        "content": "Watched it for the third time last night. It gets better every time. What a shame that we lost Chadwick Boseman at such an early age. What a great actor he is. Gosh! Amazing movie. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1hlwg/message_from_the_king/"
    },
    {
        "id": "1r10ki1",
        "author": "rulanmooge",
        "title": "Netflix added an extra user slot suddenly?!?",
        "content": "Beware!!! \n\nYesterday I get a message when we opened Netflix as usual....on our Roku streaming platform that we now have a slot for another user outside of household.  We didn't ask for this.\n\nI signed onto my account and sure enough....we are now going to be charged an extra $8.99 a month for the ability to add someone not in our household.  I did NOT ask for this...so I first changed my password. Changed my email.  Signed out of all devices...we only have two.   Signed out of Netflix....and back in again and **canceled the extra user slot**.\n\nIs this something that Netflix is (sneakily) adding...or could someone have hacked my account?",
        "upvotes": 31,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1r10ki1/netflix_added_an_extra_user_slot_suddenly/"
    },
    {
        "id": "1r22uf2",
        "author": "punknatanke",
        "title": "Непоследовательность!?",
        "content": "1. Netflix ушел из россии, но последний сезон \"Stranger Things\" получил аудиоперевод по-русски. Почему?\n\n2. Netflix вышел из россии, но последний сезон \"Titans\" не получил аудиоперевода на русский язык. Почему?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r22uf2/непоследовательность/"
    },
    {
        "id": "1r20wci",
        "author": "Own_Jellyfish114",
        "title": "movies and show recommendations without triggers",
        "content": "I know some people get kind of dismissive or annoyed about trigger warnings in movies, but a few months ago I watched my boyfriend die gruesomely in front of me so now I have some ptsd triggers which make me really upset. I'd like to watch Netflix, but not only is it difficult to filter out content warnings, they don't necessarily cover everything or are vague. I'll probably do exposure therapy, but it'll probably be a while and in the meantime I need really gentle things. I don't want to just limit myself to kid's movies though.\n\nList of triggers: asphyxiation, asthma attacks/shortness of breath/wheezing, choking, coughing fits, EMTs, CPR, weird blue/purple skin coloration(confusing sorry) and cerebral palsy (sorry, also hard to explain but it was kind of part of the process), lung issues in general,  and to a lesser extent funerals, grief, dying. Ironically I could watch Sweeney Todd no problem, so I guess unrealistic bloody deaths are okay, plus that one was actually kind of validating in a weird way.\n\nMaybe I can find a list somewhere, and I know it's hard to remember what movies do and don't have these things without having those triggers yourself. My current comfort movie is Napoleon Dynamite which I could technically watch over and over, but I'd like some other options.\n\n\\*edit: I'd also like to stay away from romantic movies for now\n\nThank you!!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1r20wci/movies_and_show_recommendations_without_triggers/"
    },
    {
        "id": "1r1ufyu",
        "author": "RottenDog666",
        "title": "Trying to watch \"Deeper\"",
        "content": "Can't hear a word they're saying. The bells, the whistles, the toots, the fucking maracas, all screaming while old mate just mumbles about. Do sound engineers not exist anymore? I can't be turning it up any further either cause I'm currently staying at a motel with paper thin walls.  \n \nP.s. thanks for not logging out of ya Netflix Rhonda",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r1ufyu/trying_to_watch_deeper/"
    },
    {
        "id": "1r1rzx6",
        "author": "cartoon_fan_2",
        "title": "availability of netflix originals",
        "content": "why is voltron available on netflix in other countries? also, why aren't other netflix originals that are removed in the u.s. available in other countries?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r1rzx6/availability_of_netflix_originals/"
    },
    {
        "id": "1r1nsnd",
        "author": "3geek14",
        "title": "Can't watch credits on Roku TV?",
        "content": "When I watch a television show from my Roku TV, shortly after the credits start, they abruptly end, and there's a countdown to begin the next episode. Unlike when I watch from my desktop, there's no \"Watch Credits\" button. I can't find any settings in the app on the television. Is there a way to make it let me watch credits?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r1nsnd/cant_watch_credits_on_roku_tv/"
    }
]