[
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 323,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o0hps8",
        "author": "shiruken",
        "title": "The Nobel Prize in Physics 2025: Awarded to John Clarke, Michel H. Devoret, and John M. Martinis \"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit\"",
        "content": "The Nobel Prize in Physics 2025 was awarded to [John Clarke](https://en.wikipedia.org/wiki/John_Clarke_(physicist)), [Michel H. Devoret](https://en.wikipedia.org/wiki/Michel_Devoret), and [John M. Martinis](https://en.wikipedia.org/wiki/John_M._Martinis) **\"for the discovery of macroscopic quantum mechanical tunnelling and energy quantisation in an electric circuit.\"**\n\n* [Official Press Release](https://www.nobelprize.org/prizes/physics/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/physics/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/physics/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=m9FUkAis62s)\n\n&gt;Quantum mechanics allows a particle to move straight through a barrier, using a process called tunnelling. As soon as large numbers of particles are involved, quantum mechanical effects usually become insignificant. The laureates’ experiments demonstrated that quantum mechanical properties can be made concrete on a macroscopic scale.\n\n&gt;In 1984 and 1985, **John Clarke**, **Michel H. Devoret** and **John M. Martinis** conducted a series of experiments with an electronic circuit built of superconductors, components that can conduct a current with no electrical resistance. In the circuit, the superconducting components were separated by a thin layer of non-conductive material, a setup known as a Josephson junction. By refining and measuring all the various properties of their circuit, they were able to control and explore the phenomena that arose when they passed a current through it. Together, the charged particles moving through the superconductor comprised a system that behaved as if they were a single particle that filled the entire circuit.\n\n&gt;This macroscopic particle-like system is initially in a state in which current flows without any voltage. The system is trapped in this state, as if behind a barrier that it cannot cross. In the experiment the system shows its quantum character by managing to escape the zero-voltage state through tunnelling. The system’s changed state is detected through the appearance of a voltage.\n\n&gt;The laureates could also demonstrate that the system behaves in the manner predicted by quantum mechanics – it is quantised, meaning that it only absorbs or emits specific amounts of energy.\n\n&gt;“It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,” says Olle Eriksson, Chair of the Nobel Committee for Physics.\n\n&gt;The transistors in computer microchips are one example of the established quantum technology that surrounds us. This year’s Nobel Prize in Physics has provided opportunities for developing the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.",
        "upvotes": 383,
        "comments": 11,
        "media": null,
        "permalink": "/r/science/comments/1o0hps8/the_nobel_prize_in_physics_2025_awarded_to_john/"
    },
    {
        "id": "1o4afve",
        "author": "mvea",
        "title": "Major IQ differences in identical twins linked to schooling, challenging decades of research. When identical twins receive similar educations, their IQs are nearly as alike as those raised together, but when schooling is very different, their IQs can be as dissimilar as those of unrelated strangers.",
        "content": "",
        "upvotes": 14141,
        "comments": 571,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N-v7NODL6xxcz1Xi6D-sdCrK_0E9N3i6uqWHd4ONh_8.jpeg?auto=webp&amp;s=5d496984f4b9c748aad7421cb670df437b258cd3"
        },
        "permalink": "/r/science/comments/1o4afve/major_iq_differences_in_identical_twins_linked_to/"
    },
    {
        "id": "1o4fjxh",
        "author": "calliope_kekule",
        "title": "A study of 158 million US workers found health-related absences remain 13% higher than before the pandemic, reducing labour force participation.",
        "content": "",
        "upvotes": 534,
        "comments": 26,
        "media": null,
        "permalink": "/r/science/comments/1o4fjxh/a_study_of_158_million_us_workers_found/"
    },
    {
        "id": "1o4axrz",
        "author": "-Mystica-",
        "title": "A large study has found that calcium supplements, long recommended for bone health, particularly in older women, don’t increase dementia risk, offering reassurance for the millions who take them to protect against osteoporosis.",
        "content": "",
        "upvotes": 799,
        "comments": 14,
        "media": null,
        "permalink": "/r/science/comments/1o4axrz/a_large_study_has_found_that_calcium_supplements/"
    },
    {
        "id": "1o3tkfs",
        "author": "James_Fortis",
        "title": "Researchers took 44 young untrained males and randomly allocated them with either plant or animal protein supplement drinks over a 12-week training period. Both groups showed significant gains in strength and muscle mass, but there was no significant difference between the two groups.",
        "content": "",
        "upvotes": 8836,
        "comments": 540,
        "media": null,
        "permalink": "/r/science/comments/1o3tkfs/researchers_took_44_young_untrained_males_and/"
    },
    {
        "id": "1o3rrvm",
        "author": "mvea",
        "title": "People on the far-right and far-left exhibit strikingly similar brain responses. People with stronger political beliefs, regardless of whether they were liberal or conservative, showed increased activity in brain areas associated with emotion and threat detection.",
        "content": "",
        "upvotes": 3820,
        "comments": 1176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iw1-KeXWi7_IcukrZuAJfh7g1NUshus89cBAF-_1Z7M.jpeg?auto=webp&amp;s=156aad4998eb23054a878c1375d9e73c005e901d"
        },
        "permalink": "/r/science/comments/1o3rrvm/people_on_the_farright_and_farleft_exhibit/"
    },
    {
        "id": "1o41bz3",
        "author": "FunnyGamer97",
        "title": "A healthier gut may improve mental health: Studies find gut microbes can change brain chemistry, stress responses and behaviours in animal models, with early trials of probiotics, diet changes, and faecal microbiota transplants improving mood and anxiety.",
        "content": "",
        "upvotes": 822,
        "comments": 39,
        "media": null,
        "permalink": "/r/science/comments/1o41bz3/a_healthier_gut_may_improve_mental_health_studies/"
    },
    {
        "id": "1o3rv86",
        "author": "mvea",
        "title": "COVID-19 causes changes in sperm that lead to increased anxiety in offspring. The study found that changes in mouse sperm after aSARS-CoV-2 viral infection can affect an offspring’s brain and behaviour. Findings suggest the COVID-19 pandemic could have long-lasting effects on future generations.",
        "content": "",
        "upvotes": 2359,
        "comments": 125,
        "media": null,
        "permalink": "/r/science/comments/1o3rv86/covid19_causes_changes_in_sperm_that_lead_to/"
    },
    {
        "id": "1o4a4ll",
        "author": "-Mystica-",
        "title": "Scientists at the Francis Crick Institute and Vividion Therapeutics have developed compounds that block RAS, a key cancer-driving gene. Now in early human trials, these drugs could treat many cancers effectively while sparing healthy cells.",
        "content": "",
        "upvotes": 179,
        "comments": 9,
        "media": null,
        "permalink": "/r/science/comments/1o4a4ll/scientists_at_the_francis_crick_institute_and/"
    },
    {
        "id": "1o3wf3s",
        "author": "Humanprototype187",
        "title": "Consciousness could emerge from Glymphatic-generated Electromagnetic Fields",
        "content": "",
        "upvotes": 946,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qyGoJ1D8NCEjHvtD5g5FnabiqzoOdE83aQPxYaqUkLA.jpeg?auto=webp&amp;s=9f6ead4b1683a74dfdcab844c577949e2ccad6fa"
        },
        "permalink": "/r/science/comments/1o3wf3s/consciousness_could_emerge_from/"
    },
    {
        "id": "1o47zog",
        "author": "Dr_Neurol",
        "title": "Correlations between social media addiction and anxiety, depression, FoMO, loneliness and self-esteem among students",
        "content": "",
        "upvotes": 169,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o47zog/correlations_between_social_media_addiction_and/"
    },
    {
        "id": "1o4g3ty",
        "author": "calliope_kekule",
        "title": "Stalagmite records show a major drought and cooling event 2,800 years ago helped trigger the collapse of China’s Western Zhou Dynasty and mass southward migration.",
        "content": "",
        "upvotes": 33,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CjV6wdeO3h73sowRnAuBphM6QKRPczHZ26PRj96TBjQ.png?auto=webp&amp;s=d143c805b67cda96b9dbdf51deec62feae6ebad3"
        },
        "permalink": "/r/science/comments/1o4g3ty/stalagmite_records_show_a_major_drought_and/"
    },
    {
        "id": "1o41vmu",
        "author": "nohup_me",
        "title": "Aged rats who lived in socially enriched environments throughout life retained better memory and cognitive flexibility than those housed alone, and performed just as well as young adults in memory tasks. Highlighting the importance of social interaction in protecting the aging brain",
        "content": "",
        "upvotes": 165,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vKQUHf3hA5rlRi7NduqjEcDcuo6O5rze_BDtSjVQzEs.png?auto=webp&amp;s=41b5f7ab54b1e77d04f853dbd33921d898b66e36"
        },
        "permalink": "/r/science/comments/1o41vmu/aged_rats_who_lived_in_socially_enriched/"
    },
    {
        "id": "1o3u7om",
        "author": "Suitable-Economy-346",
        "title": "Repeated mRNA covid vaccinations may make more diverse and stronger T cell response, potentially better protecting against unseen and broader range of covid variants",
        "content": "",
        "upvotes": 413,
        "comments": 10,
        "media": null,
        "permalink": "/r/science/comments/1o3u7om/repeated_mrna_covid_vaccinations_may_make_more/"
    },
    {
        "id": "1o3y5av",
        "author": "-Mystica-",
        "title": "The timing of emissions cuts, not just their speed, will determine our planet’s fate as a new Cornell study warns that delaying reductions beyond 2050 could push the probability of irreversible ice melt and sea-level rise above 50%, locking humanity into centuries of coastal transformation.",
        "content": "",
        "upvotes": 228,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KwMbu8sU1ySlNKEawzsvQf5_0ZWBzMVrdc11H9WhAAo.png?auto=webp&amp;s=6100a4bb68211713342fdcd5bbcf1f85f2fa3f88"
        },
        "permalink": "/r/science/comments/1o3y5av/the_timing_of_emissions_cuts_not_just_their_speed/"
    },
    {
        "id": "1o380ep",
        "author": "nohup_me",
        "title": "Soft drink consumption linked to major depressive disorder (MDD) diagnosis in women, in part due to changes in the gut microbiota: for each increase in daily soft drink intake, the odds of having MDD were about 8% higher",
        "content": "",
        "upvotes": 8310,
        "comments": 289,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vrqzVNJdvwf0Eb5O9tEP-JIrt0LvOs0OvfusWUWOWJc.png?auto=webp&amp;s=1946ae05b4f4fd942547c3e4ac52d4a27c287c6e"
        },
        "permalink": "/r/science/comments/1o380ep/soft_drink_consumption_linked_to_major_depressive/"
    },
    {
        "id": "1o42aak",
        "author": "Super_Letterhead381",
        "title": "The production of ‘food boluses’ by Antarctic krill and implications for organic matter transport",
        "content": "",
        "upvotes": 38,
        "comments": 2,
        "media": null,
        "permalink": "/r/science/comments/1o42aak/the_production_of_food_boluses_by_antarctic_krill/"
    },
    {
        "id": "1o3e6jk",
        "author": "mvea",
        "title": "Gaps in sex education can have lasting impacts in adulthood, including relationship struggles, lack of confidence, and reduced quality of life. 1/3 never had information on healthy relationships, consent, communicating with partners, pleasure, or dating in their youth from school, family or friends.",
        "content": "",
        "upvotes": 1375,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a-aL4bfZOgz-mug_hvhYCW95EOaHk66Lhj8v89vMt4w.png?auto=webp&amp;s=ff3ea4b07b92268a5622a8a86f0f8c898f97687e"
        },
        "permalink": "/r/science/comments/1o3e6jk/gaps_in_sex_education_can_have_lasting_impacts_in/"
    },
    {
        "id": "1o3me90",
        "author": "Slow-Pie147",
        "title": "Early South American hunters primarily hunted megafauna, including giant sloths, new study reveals",
        "content": "",
        "upvotes": 353,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_KPrFWFkjmQleOSd439zuA-N7uYlhgzK9oZMcAvqBqY.jpeg?auto=webp&amp;s=0403859f4176000b9919a7028a726076ec725ee7"
        },
        "permalink": "/r/science/comments/1o3me90/early_south_american_hunters_primarily_hunted/"
    },
    {
        "id": "1o2v0nj",
        "author": "mvea",
        "title": "A next-generation cancer vaccine has shown stunning results in mice, preventing up to 88% of aggressive cancers by harnessing nanoparticles that train the immune system to recognize and destroy tumor cells. It effectively prevented melanoma, pancreatic cancer and triple-negative breast cancer.",
        "content": "",
        "upvotes": 17490,
        "comments": 441,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hy4z1H8ooxPtZ9X24UFL-104qSICnpOxZrnNe3PgX2A.jpeg?auto=webp&amp;s=39791e6e5e47c78e4b72ed0ada12f684933625a9"
        },
        "permalink": "/r/science/comments/1o2v0nj/a_nextgeneration_cancer_vaccine_has_shown/"
    },
    {
        "id": "1o3x8a4",
        "author": "Dr_Neurol",
        "title": "Parental behavior and near screen use in childhood: a route to reduce screen induced myopia",
        "content": "",
        "upvotes": 43,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o3x8a4/parental_behavior_and_near_screen_use_in/"
    },
    {
        "id": "1o3ve54",
        "author": "BrnoRegion",
        "title": "A study on cybersecurity education reveals that \"Capture the Flag\" games benefit students in different ways: less experienced students gain more skills, while more experienced students gain more confidence.",
        "content": "",
        "upvotes": 48,
        "comments": 2,
        "media": null,
        "permalink": "/r/science/comments/1o3ve54/a_study_on_cybersecurity_education_reveals_that/"
    },
    {
        "id": "1o3ml44",
        "author": "calliope_kekule",
        "title": "Scientists found that sperm switch on an enzyme called aldolase to boost energy for fertilization. Blocking this process could lead to new male contraceptives.",
        "content": "",
        "upvotes": 196,
        "comments": 17,
        "media": null,
        "permalink": "/r/science/comments/1o3ml44/scientists_found_that_sperm_switch_on_an_enzyme/"
    },
    {
        "id": "1o3vfsm",
        "author": "BrnoRegion",
        "title": "A new GPU-based method finally makes it possible to stream interactive 4K \"light field\" videos in real-time",
        "content": "",
        "upvotes": 41,
        "comments": 4,
        "media": null,
        "permalink": "/r/science/comments/1o3vfsm/a_new_gpubased_method_finally_makes_it_possible/"
    },
    {
        "id": "1o3d2tt",
        "author": "J4Jc3",
        "title": "Homemaking improves mental health, but not for moms with small kids, study finds",
        "content": "",
        "upvotes": 654,
        "comments": 56,
        "media": null,
        "permalink": "/r/science/comments/1o3d2tt/homemaking_improves_mental_health_but_not_for/"
    },
    {
        "id": "1o31qxr",
        "author": "chrisdh79",
        "title": "Moral absolutism explains support for bans better than conservative or liberal ideology | Research suggests that conservatives are more inclined to see morality as universal and absolute, while liberals tend to view it as relative and context-dependent.",
        "content": "",
        "upvotes": 2009,
        "comments": 243,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hXtvIyxuHDmv33DMiz6BtIQuAPMJKFW-xPRcl8e9fz0.jpeg?auto=webp&amp;s=bc98ca8c2fcd9176189be737ea8688edb0600791"
        },
        "permalink": "/r/science/comments/1o31qxr/moral_absolutism_explains_support_for_bans_better/"
    },
    {
        "id": "1o37iah",
        "author": "ChallengeAdept8759",
        "title": "New AI tool can detect melanoma with 99% accuracy, outperforming existing models",
        "content": "",
        "upvotes": 877,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fsom7NGy119gANC8W6RQhUAqXckkcKG9TaRojLlafMQ.jpeg?auto=webp&amp;s=47bca53a9d839fec2f770f3516d57839a192d09c"
        },
        "permalink": "/r/science/comments/1o37iah/new_ai_tool_can_detect_melanoma_with_99_accuracy/"
    },
    {
        "id": "1o3m08n",
        "author": "calliope_kekule",
        "title": "A study of Chinese college students found that those learning online showed lower self-acceptance, social connection, and goal direction than in-person peers.",
        "content": "",
        "upvotes": 103,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-WH__mw-tPEBpBvM7ysWiWM20qxfHENaucUhaN-qL-k.png?auto=webp&amp;s=efb49e31bb96946f95bfc94cb986953248dcc231"
        },
        "permalink": "/r/science/comments/1o3m08n/a_study_of_chinese_college_students_found_that/"
    },
    {
        "id": "1o36ubt",
        "author": "smurfyjenkins",
        "title": "Data on real estate prices in the US across 1890–2006 shows that real prices for rent have increased by 60% and real house prices have nearly quadrupled. Stringent land use and zoning regulations (e.g. bans on anything but single-family housing) are key contributing factors.",
        "content": "",
        "upvotes": 766,
        "comments": 52,
        "media": null,
        "permalink": "/r/science/comments/1o36ubt/data_on_real_estate_prices_in_the_us_across/"
    }
]