[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 17,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kcoqjg",
        "author": "5862724",
        "title": "Why does this company hate single folk?",
        "content": "If ever Netflix wakes up and realizes single person households exist and want to pay for Netflix at a reasonable single screen rate, the longer Netflix treats us like trash, the longer it will take me to buy in.",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kcoqjg/why_does_this_company_hate_single_folk/"
    },
    {
        "id": "1kckm7l",
        "author": "Fragrant_Peanut_9661",
        "title": "The Eternaut",
        "content": "So I just finished this one on NF. Plz tell me some of you have watched it! I've really gotten into the apocalyptic shit lately, been reading a lot of similar books. This show is soooo cool. However, I do have a few questions after watching it. \n\n1. Where do they get gas for the vehicles?\n\n2. Wtf are those things?!?!?\n\n3. Is it aliens? Or not? \n\n4. Wtf is up with Clara? \n\nLet me know your thoughts on this show. I'm interested in hearing how many others liked it...and who else saw how easily this could really happen...",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kckm7l/the_eternaut/"
    },
    {
        "id": "1kci1oh",
        "author": "Obversa",
        "title": "'School Spirits' Seasons 2-3 not coming to Netflix, Season 1 leaving in May 2025 as Paramount+ seeks to drive subscriptions to streaming service",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kci1oh/school_spirits_seasons_23_not_coming_to_netflix/"
    },
    {
        "id": "1kcg56t",
        "author": "Internal-Bed-3150",
        "title": "Geek Girl Season 2 confirmed: Exciting details you need to know now",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kcg56t/geek_girl_season_2_confirmed_exciting_details_you/"
    },
    {
        "id": "1kc7uh5",
        "author": "ak22801",
        "title": "The Residence has been a disappointment.",
        "content": "No real spoilers:\n\nThis is typically my favorite genre, but I just can’t get into this show—despite really wanting to.\n\nCupp feels like such a flat character. She’s deadpan the entire time, shows little depth, and it’s hard to connect with her emotionally. She mostly just snaps at others and loves birds. She’s essentially the main character of the show and is just boring, bland, and rude the entire time. The trailer made her seem almost goofy, which would have been great. If she was goofy and ditsy but also a brilliant genius detective. But that is not at all how she is portrayed in the show. \n\nThe storyline drags from episode to episode without much happening. I got a few laughs—Harry Hollins was funny early on—but overall it just feels bland, and I’m losing interest fast. Watching the show feels like a chore at this point. \n\nThat said, the White House set is incredible. Huge credit to the production team on that. Just mind blowing on the amount of work that must have taken.\n\nIf you’re into this type of show, The Afterparty on Apple TV is a way better execution of the concept. It’s funnier, better written, and the storytelling is on another level. Highly recommend. Two seasons and both impossible not to binge through. ",
        "upvotes": 16,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1kc7uh5/the_residence_has_been_a_disappointment/"
    },
    {
        "id": "1kcc8dt",
        "author": "LouisTully9000",
        "title": "The Seasons of Our Lives: Tina Fey Reboots an Alan Alda Classic With Wit, Warmth, and Will Forte",
        "content": "In an age where prestige television is often synonymous with prestige pathology; meth-cooking antiheroes, psychopathic chess prodigies, undead romances; it’s something of a minor miracle when a show chooses to linger in the smaller, messier moments of human connection. The Four Seasons, a new Netflix miniseries conceived by Tina Fey and co-conspirators Lang Fisher and Tracey Wigfield, offers just that: a beautifully funny and quietly profound meditation on the long, strange trip of modern marriage.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kcc8dt/the_seasons_of_our_lives_tina_fey_reboots_an_alan/"
    },
    {
        "id": "1kcoqhp",
        "author": "Doc891",
        "title": "Did Havoc (2025) use AI?",
        "content": "The CGI was just so bad. Like univerals fast and furious ride bad, but i noticed some of the tires didnt seem to move, so it made me wonder. Did they use AI to make this trash? Or were they really hiring the worst of the worst?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kcoqhp/did_havoc_2025_use_ai/"
    },
    {
        "id": "1kcgfhx",
        "author": "dahonnn",
        "title": "Anne with an E",
        "content": "I believe Netflix viewers deserve another season of Anne with an E. The community has gotten so much bigger even after the show’s cancellation. If Netflix produces the series this time, I think it would be a huge success. With promotions the same as their other shows, such Bridgerton’s, people would go wild!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kcgfhx/anne_with_an_e/"
    },
    {
        "id": "1kcnydz",
        "author": "urlocal_wierdo",
        "title": "I can't get Netflix to show video",
        "content": "I have an android phone, and no matter what I try I can't get the app to show the video that goes with what I'm watching. I've tried restarting my phone, deleting then reinstalling the app, following all trouble shooting instructions on the website, downloading what I want to watch, but nothing works, it's just audio with a black screen. Does anyone know how to fix this before I throw my phone at a wall",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kcnydz/i_cant_get_netflix_to_show_video/"
    },
    {
        "id": "1kcmynu",
        "author": "Livid-Collection-687",
        "title": "Next must-watch series otw. But what's your fav so far?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kcmynu/next_mustwatch_series_otw_but_whats_your_fav_so/"
    },
    {
        "id": "1kcaapz",
        "author": "Super_Nectarine_8906",
        "title": "netflix premium on a 1440p monitor",
        "content": "I have netflix premium and i use it on a 1440p monitor. Does this mean it will downscale to 1080p because it doesnt recognise my monitor as 4k? There is so much grain, especially in dark settings, it's not sharp, often gets blurry, again, especially in dark settings etc. i feel like i'm watching a 720p video. anyone have possible fixes to ensure a 4k good quality video? \n\nIt doesn't even tell me what resolution im watching in, like how for example youtube does.",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kcaapz/netflix_premium_on_a_1440p_monitor/"
    },
    {
        "id": "1kc6e8v",
        "author": "t0xinsarefriends",
        "title": "Household issue",
        "content": "Hey everyone.\n\nDon't know if this is happening to anyone else, but today I can't access Netflix - rather, I can, but Netflix isn't recognising my device/network as part of my household, so I need to get a temporary code to access... thing is, I am on my personal PC or phone in my home on the same old Wifi network... Any ideas? Thanks\n\nEdit: thanks everyone for sharing your experiences with this issue and suggesting fixes. I think I figured it out eventually when I found out that signing in via smart tv seems to be what activates the household thingy. Our smart tv is connected to a different WiFi network, so that would explain why Netflix now is not accepting my devices as part of the household. I'll switch them to the same WiFi network as the tv and that should fix it I believe",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kc6e8v/household_issue/"
    },
    {
        "id": "1kcijoe",
        "author": "dbinco",
        "title": "only 2 days to watch before i leave…. what must i watch now??!!!",
        "content": "honestly. just basic rotation out after years of netflix subscription. will we be back someday? sure. but i must keep these subscriptions under control. only two days left…. What MUST i watch NOW?!!!!!!!",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kcijoe/only_2_days_to_watch_before_i_leave_what_must_i/"
    },
    {
        "id": "1kbe7z7",
        "author": "MysteriousDelay6266",
        "title": "'North of North' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 125,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kbe7z7/north_of_north_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1kbnklz",
        "author": "12dion",
        "title": "What is some good fantasy on netflix?",
        "content": "As the title said i am looking to watch a good fantasy/supernatural show thats not just some generic cookie cutter show and has some depth to the story and character, good cgi/special effects is a bonus",
        "upvotes": 24,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1kbnklz/what_is_some_good_fantasy_on_netflix/"
    },
    {
        "id": "1kc59rs",
        "author": "JackDempsey21",
        "title": "Netflix stutters on new phone sometimes",
        "content": "It feels like Netflix runs better on my 4-year old phone than on a new one.\nNetflix stutters for a second sometimes on Redmi Note 14 pro 5g (mediatek CPU).\nI do not notice this issue on my older Xiaomi Mi Note 10 lite phone (Snapdragon).\nMy Internet is fast so it is not a connection speed issue.\nShould I exchange the phone for the one that has Snapdragon CPU?\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kc59rs/netflix_stutters_on_new_phone_sometimes/"
    },
    {
        "id": "1kba9n4",
        "author": "Longjumping-Elk-7840",
        "title": "Is Resident Alien Worth Watching ?",
        "content": "It's on my watchlist for a while, Heard a lot about it but never actually tried tho. How is it anyways ? Worth watching or not ? I heard they It's kinda mix of sci-fi and Comedy (which I like). How many of you watched it ? \nFinding a weekend binge tho. \nIs it worth to watch all three seasons?",
        "upvotes": 79,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1kba9n4/is_resident_alien_worth_watching/"
    },
    {
        "id": "1kbu2j9",
        "author": "Anfraxx",
        "title": "How to reset a series watch history",
        "content": "I think this is the best way to word it but will try and explain more. \n\nI tend to go to sleep watching netflix and usually put something long on - at the moment it is usually wrestlemania. \n\nBut what normally happens as not every episode has played yet, I start on the latest and instead of it moving to the next one down,it jumps all the way down to the first unplayed episode, and I am pretty sure I haven't slept for 30 episodes at like 2+ hours minimum each haha. \n\nSo is there a way to reset the play history or series progress so I am not waking up in the middle of the night, to a wrestlemania from my teens?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kbu2j9/how_to_reset_a_series_watch_history/"
    },
    {
        "id": "1kbj9sw",
        "author": "Internal-Bed-3150",
        "title": "Ransom Canyon season 2 is more likely than ever after latest Netflix reveal",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kbj9sw/ransom_canyon_season_2_is_more_likely_than_ever/"
    },
    {
        "id": "1kbwi9c",
        "author": "Patient_Bake_6819",
        "title": "Amalia",
        "content": "About 2 years ago, there was a trailer for a series with a character named “Amalia” in it. Does anyone know the name of this series? I am sure it’s left Netflix already. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kbwi9c/amalia/"
    },
    {
        "id": "1kbsel1",
        "author": "Time_Imagination3575",
        "title": "Romance recommendations",
        "content": "Watched fake profile yesterday such a shitty show made me feel so frustrated and annoyed \n\nNow i wanna watch something romantic/ feel good it can be series or movie open to all languages and if not romance then thriller also works but it shouldn't be annoying or frustratin😭",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kbsel1/romance_recommendations/"
    },
    {
        "id": "1kbtamw",
        "author": "MasterCaster2000",
        "title": "How exactly does Muting your Netflix Account work?",
        "content": "So my next billing date for Netflix is always on the 4th day of each month (May 4th in this instance) and it's the last day of April. \n\nMoney is a little tight right now so I want to avoid the next billing date and the only two ways to do that is to either mute my account or cancel my subscription, but I want to avoid the latter, so I'm wondering if Muting my account will help me, and if I enable it today then will it carry over to the upcoming billing date?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kbtamw/how_exactly_does_muting_your_netflix_account_work/"
    },
    {
        "id": "1kbf1ng",
        "author": "ArmosFr",
        "title": "'Geek Girl' Renewed For Season 2 By Netflix After Delay",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kbf1ng/geek_girl_renewed_for_season_2_by_netflix_after/"
    },
    {
        "id": "1kbwdpt",
        "author": "Tool_Time_Tim",
        "title": "Kung Fu Hustle English Dub",
        "content": "Been looking for this for ages and cannot find it.  How am I going to expose my teen son to quality kung fu flicks like this with this ban on pure comedy?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kbwdpt/kung_fu_hustle_english_dub/"
    },
    {
        "id": "1kc42le",
        "author": "Queasy_Knowledge_853",
        "title": "YOU",
        "content": "Anyone else wish the ending was different? I wish Joe didn’t have to spend the rest of his life in jail. I wanted Kate, Bronte, and Nadia to die. Idk, of course the new season was great but I hoped for a happy ending with Joe and Henry 😩.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kc42le/you/"
    },
    {
        "id": "1kbgl71",
        "author": "indiewire",
        "title": "Alfred Hitchcock Films Coming to Netflix and Paris Theater Series",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kbgl71/alfred_hitchcock_films_coming_to_netflix_and/"
    },
    {
        "id": "1kba5u4",
        "author": "Vivid_Foundation_202",
        "title": "You",
        "content": "First of all I just wanted to mention that it’s a really awesome full circle moment that in the book they mention that Beck’s most watched show is Pitch Perfect and then Anna Camp stars in the finale season. Now is when I start shitting on the characters, don’t twist my words with this because I am in no way a Joe supporter BUT the women he was into was terrible. Beck was so shitty towards him and the relationship she didn’t really care. Marianne literally was a homewrecker. Love was crazy as hell I wish they would’ve stayed together. Kate was a hypocrite, a complicit contrite hypocrite. Brontë was honestly just annoying as hell. Penn played the hell out of this role though. The ending was definitely rushed and incomplete in my opinion. ",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kba5u4/you/"
    },
    {
        "id": "1kaw573",
        "author": "LushCharm91",
        "title": "'You' Season 5 Ratings: 10.1 Million Netflix Views in Four Days",
        "content": "",
        "upvotes": 108,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1kaw573/you_season_5_ratings_101_million_netflix_views_in/"
    },
    {
        "id": "1kbkmxx",
        "author": "ArmosFr",
        "title": "As ‘Big Mouth’ Comes To An End, Creators Bring ‘Mating Season’ To Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kbkmxx/as_big_mouth_comes_to_an_end_creators_bring/"
    },
    {
        "id": "1kbbxae",
        "author": "Vegetable_Pigeon",
        "title": "Netflix boing sound",
        "content": "This is a bit of a random one but does anyone else get that “netflix sound” in the middle of a show. It’s happened quite a few times now at random times with different shows. 😂 the image is still fine and there is no lag in the streaming. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kbbxae/netflix_boing_sound/"
    }
]