[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 33,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pud2t0",
        "author": "Wonderful_Highway629",
        "title": "People with money can afford no ads so they are marketing products to people with no money",
        "content": "The pay more for no ads model makes no sense.  People without money buy the ad version of the streaming service while people with money do not.  Advertisers end up marketing their products to poor people who cannot afford their products anyway while people with more disposable income see no ads.  It’s a really dumb setup.",
        "upvotes": 164,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1pud2t0/people_with_money_can_afford_no_ads_so_they_are/"
    },
    {
        "id": "1pudpow",
        "author": "the_Snowmannn",
        "title": "A Man on the Inside",
        "content": "Seriously underrated show.  Ted Danson is awesome.  A couple Easter egg call outs in late season two, to another show he was in a few years ago (actor cameos/footage).\n\nFunny and emotional and pretty friggin great.",
        "upvotes": 77,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pudpow/a_man_on_the_inside/"
    },
    {
        "id": "1pttlqg",
        "author": "intelerks",
        "title": "'Stranger Things' sets up a marathon finish as final runtimes are confirmed",
        "content": "",
        "upvotes": 192,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1pttlqg/stranger_things_sets_up_a_marathon_finish_as/"
    },
    {
        "id": "1puf6cx",
        "author": "Secretly_Wealthy90",
        "title": "I highly recommend the Movie \"Relay\" on Netflix US",
        "content": "the movie \"Relay\" just dropped on Netflix in the U.S. it was in theaters this past August. fresh plot that many of you will enjoy. good plot twist in the end :)",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1puf6cx/i_highly_recommend_the_movie_relay_on_netflix_us/"
    },
    {
        "id": "1ptuqyd",
        "author": "AssociateLittle1487",
        "title": "Worst/ disappointing Netflix shows of 2025? (Rate out of 10)",
        "content": "While there are some good TV shows on Netflix this year, there are also a lot of very bad TV shows that people have been outraged at for Netflix milking them or creating so badly.\n\nFor example, I think that Squid Game 3 is the worst/ most disappointing  Netflix show of 2025, and would rate it a 3-4/10 because of how pointless everything was. (And not in a way which is supposed to be the message of the show- just lame and cringey writing).\n\nHow about you? Please upvote and share this.",
        "upvotes": 57,
        "comments": 159,
        "media": null,
        "permalink": "/r/netflix/comments/1ptuqyd/worst_disappointing_netflix_shows_of_2025_rate/"
    },
    {
        "id": "1pubkp7",
        "author": "paulnptld",
        "title": "Train Dreams and Commercials",
        "content": "Hi everyone. We switched to the ad-supported version of Netflix a few months ago. I downloaded Train Dreams and watched it on a tablet. No commercials. But now I want to watch it at home on our big screen with my wife.\n\nIt's the kind of film that commercials midway through would just ruin. Can anyone tell me if the commercials are only at the start of the film? Thanks!\n\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pubkp7/train_dreams_and_commercials/"
    },
    {
        "id": "1ptvocv",
        "author": "AssociateLittle1487",
        "title": "What are the best Netflix shows of 2025?",
        "content": "Since I’m doing a post on the worst Netflix shows of 2025, I’ve also decided to make people more optimistic about shows in Netflix by asking this question- what are the best Netflix shows of 2025? There are definitely some iconic shows that have come out of this year. ",
        "upvotes": 35,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1ptvocv/what_are_the_best_netflix_shows_of_2025/"
    },
    {
        "id": "1pu76sq",
        "author": "Justalittle_batty",
        "title": "Four seasons (spoiler)",
        "content": "My husband and I just finished watching season one and decided to start it over. The first episode when nick and Anne scare the group in the car one of them yells “one of you is going to die”. Is this foreshadowing? Just a funny line? Intentional? I was shook! ",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pu76sq/four_seasons_spoiler/"
    },
    {
        "id": "1ptkxbr",
        "author": "Notoriously_So",
        "title": "‘Stranger Things’ Shatters Nielsen Record It Already Held As Season 5 Premiere Ushers In Highest Weekly Viewing Total Ever For A Streaming Title",
        "content": "",
        "upvotes": 183,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ptkxbr/stranger_things_shatters_nielsen_record_it/"
    },
    {
        "id": "1pu6zof",
        "author": "Alive-Recording-3400",
        "title": "Christmas movies?",
        "content": "I’ve been using Netflix since a DVD came in the mail. This is the first year I’ve ever not been able to find a Christmas staple movie on the platform. I know this is petty, but I’m genuinely considering canceling my subscription over this. The last few years, you could at LEAST do an add on to watch specific movies, and I feel like this year is all C list movies with horrible plots, and as im angry and writing this, whatever bull I put on in the background literally just said “whatever mister weenie” and then it went to a dramatic scene??? \n\nI would’ve loved that if it wasn’t the ONLY CHRISTMAS MOVIE AVAILABLE. FFS ",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pu6zof/christmas_movies/"
    },
    {
        "id": "1puh03y",
        "author": "LilNello1",
        "title": "Eden?",
        "content": "So I just finished watching Eden not that long ago and really enjoyed it a lot.  Just moved into my top 10 movies of the year and I thought Sydney, Ana and Vanessa, as well as Jude Law were pretty brilliant.  Some exceptional directing and storytelling by Ron Howard too.  I was surprised to hear it was partially and/or fully based on a true story too.  So without giving too many spoilers away for those who did watch.  What are your thoughts and did you like or not like it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1puh03y/eden/"
    },
    {
        "id": "1pugkew",
        "author": "BigEvil_300",
        "title": "Money Heist",
        "content": "So im rewatching money heist for the 3rd or 4th time and I had forgotten how good it was. I was wondering if the actress who played Tokyo is in anything else as good? I know its strange to say but im in love with that character if I could find a chick willing to be on some Bonnie and Clyde shit with. So again anything else that shes good in that you would recommend or any other shows with that \"Bonnie and clyde\" theme ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pugkew/money_heist/"
    },
    {
        "id": "1pug7y2",
        "author": "Thin_Dig_8140",
        "title": "Joko anwar's nightmares and daydreams is amazing and definitely worth watching.",
        "content": "No spoilders: \n\nJoko anwar's nightmares and daydreams is a show that has a main story that follows multiple stories that combine into one at the end, the story writing is pretty great the characters are extremely well written,  but the cgi is a litte rough at times, cgi is about a 7/10 but its a great show so far definitely worth watching. I'd give the show a solid 9ish/10 overall.\n\nAlso if what im reading is correct its renewed for a second season so im hyped for that.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pug7y2/joko_anwars_nightmares_and_daydreams_is_amazing/"
    },
    {
        "id": "1ptmrbr",
        "author": "dk_x",
        "title": "Netflix’s The One Piece Anime Once Again a No-Show Nearly 3 Years After Announcement",
        "content": "",
        "upvotes": 70,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ptmrbr/netflixs_the_one_piece_anime_once_again_a_noshow/"
    },
    {
        "id": "1ptxydv",
        "author": "-medicalthrowaway-",
        "title": "The Great Flood",
        "content": "If Interstellar, The Matrix and Inception… all influenced some South Koreans to make a lazy, dumb movie\n\nIt reminded me of the South Park episode, mocking Inception, where they say, “just because it’s complicated, doesn’t mean it’s cool”\n\nNote\\* Interstellar, The Matrix and Inception are some of my favorite movies",
        "upvotes": 10,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ptxydv/the_great_flood/"
    },
    {
        "id": "1puehgm",
        "author": "Status_Step7704",
        "title": "yall, the best netflix movie? i love robbery, theft, etc.",
        "content": "I need some good recommendation for a movie that is a robbery/heist movie. Or maybe something close to that genre! thanks! I have so far watched a few of them, but def list all you know pls!",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1puehgm/yall_the_best_netflix_movie_i_love_robbery_theft/"
    },
    {
        "id": "1pubgte",
        "author": "SoCliche666",
        "title": "Looking for shows to watch on the treadmill.",
        "content": "I’m looking for recommendations on shows to watch while I run on the treadmill. The shows I like best for this have a combination of intrigue and action. So far i’ve watched the following \n\n-Breaking Bad\n-Better Call Saul\n-Squid Game: Season 3\n-Dexter\n-Dexter: New Blood\n-Dexter: Original Sin\n&amp; I’m moving right through Dexter: Resurrection\n\nBonus points for recommendations with a lot of content as I usually run for fifty minutes a day. I use other streaming services as well as netflix.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pubgte/looking_for_shows_to_watch_on_the_treadmill/"
    },
    {
        "id": "1pub1tn",
        "author": "SBEPTY",
        "title": "The Fix was in for Best Guess Live tonight",
        "content": "Both puzzles guessed on first clue.\n\nSuch and easy thing to leak.\n\nI bet the fix was in.\n\nSad for legit players who would have gotten on third guess\n\nHe didn't even read who won second puzzle Bec it was very likely the same person. \n\n  \nAnd yes I am salty because I got Piggy Bank on 3rd clue and would have got a decent slice of 65k. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pub1tn/the_fix_was_in_for_best_guess_live_tonight/"
    },
    {
        "id": "1pu9cq7",
        "author": "Ok_Hippo6727",
        "title": "Ad version only good for TV",
        "content": "Recently switched to the ad version to save money. They had a deal going at the time. One thing I've noticed is the number of ads on movies are excessive.\n\nI was going to watch The Martian and paused to see there was going to be 11 Ads!  Ok maybe there's a movie with less, nope. On average there's 9+ ads per movie. Basically one every 12 to 14 minutes giver or take. I just can't find that enjoyable if I'm trying to sit down and watch a movie. For TV sure, but breaking the flow of a film bugs me. \n\nI decided to skip Netflix and go to another streaming service that had less ads or none for a film. When it comes to movie I think I'll be skipping netflix. I still enjoy the shows and the ads are less excessive, but I'm done with movies on Netflix. \n\nCurious if anyone else feels this way. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pu9cq7/ad_version_only_good_for_tv/"
    },
    {
        "id": "1ptgzom",
        "author": "IceCat767",
        "title": "Ed Gein being a virgin was too boring for Ryan Murphy?",
        "content": "Had to sex him up I guess. Is sexing something or someone up really that interesting? Ed Gein being a life-long virgin is plenty interesting to me. What do you guys think?",
        "upvotes": 59,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ptgzom/ed_gein_being_a_virgin_was_too_boring_for_ryan/"
    },
    {
        "id": "1pueufx",
        "author": "Southern-Brother5693",
        "title": "Can anyone see any Bond films in Netflix search?",
        "content": "Heard about the Bond films coming in Jan. but here in Singapore after searching Netflix I don't see any Bond films coming here yet. Not even in the Coming Soon section.\n\n  \nAnyone see any Bond titles coming yet in Netflix search?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pueufx/can_anyone_see_any_bond_films_in_netflix_search/"
    },
    {
        "id": "1ptn037",
        "author": "Similar-Ad-1945",
        "title": "Prestige &gt;&gt;&gt; shutter island",
        "content": "I’ve watched both The Prestige and Shutter Island, and while Shutter Island is a solid psychological thriller, Prestige operates on a much higher level for me. Shutter Island is powerful on the first watch, but once the twist is revealed, a lot of its impact fades. The film leans heavily on atmosphere and shock.\n\nPrestige, on the other hand, is built for rewatching. Every scene matters. The structure itself is part of the illusion, and the   themes-obsession, sacrifice, rivalry, and identity run far deeper than just a single twist. It doesn’t just surprise you; it plays with you.\n\nShutter Island tells you its truth at the end. Prestige hides it in plain sight from the very beginning. That’s the difference. One is a great experience once; the other is a masterclass that gets better every time you revisit it.",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ptn037/prestige_shutter_island/"
    },
    {
        "id": "1pu8sip",
        "author": "coupleofnoodles",
        "title": "Have a older tablet that says I can’t stream Netflix on it if I have ads on my services is there a work around? Feels pretty crappy to be priced out to use a service I pay for.",
        "content": "As the title states. Have a older tablet that says I can’t stream Netflix on it if I have ads on my services is there a work around? Feels pretty crappy to be priced out to use a service I pay for. I just want to be able to stream movies and tv on the tablet while I’m deployed. It’s a Amazon fire tablet gen 7",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pu8sip/have_a_older_tablet_that_says_i_cant_stream/"
    },
    {
        "id": "1pthkog",
        "author": "PoolOk6674",
        "title": "Does anyone know why this victorinox carry-on has a Netflix logo?",
        "content": "",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pthkog/does_anyone_know_why_this_victorinox_carryon_has/"
    },
    {
        "id": "1pubfqq",
        "author": "Dear_Crab_6814",
        "title": "Can i get the Netflix account back",
        "content": "It’s been around a year. I wanted to sign into my account, but when I tried, it showed that my account doesn’t exist anymore. I asked ChatGPT, and it says Netflix keeps accounts for up to 10 months. I was wondering if anyone has ever gotten their account back by calling customer service?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pubfqq/can_i_get_the_netflix_account_back/"
    },
    {
        "id": "1psve36",
        "author": "domrayn",
        "title": "Fargo (S1-S5) just dropped. OMG",
        "content": "Dunno if other countries already have this but this just dropped yesterday in mine (Philippines). I can't recommend this show enough guys. Every season is self contained so there are little to no pacing issues. The story is quirky, weird, violent but very engrossing. It's masterful storytelling at its finest. I used to religiously wait for a new episode every week but now everything is available. Lucky you. That's all. I'm gonna do a rewatch XD",
        "upvotes": 165,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1psve36/fargo_s1s5_just_dropped_omg/"
    },
    {
        "id": "1ptt3pn",
        "author": "Kralgore",
        "title": "Power Rangers (Original) wibbly wobbly.",
        "content": "So, my kids have been watching this, and with my own previous love from the 90s, I have sat with them and noticed this, so I ask, does anyone know why the Original Power Ranger show panning causes serious artifact drag?\n\nThis doesn't happen on any other show or streaming service.  It only seems to occur on original Power Rangers.  It is actually quite nauseating.  I don't get travel sick, but I feel that this would be the feeling...\n\nIt only happens on the panning movements. It looks like the screen is only able to update at a really low refresh rate.\n\nI have been wondering if it is part of the cheap recording at the time or very poor digital conversion.  I originally thought it wasn't happening on the sentai stuff, but it actually is,  just less obvious. \n\nThe TV isn't the issue.  I see the same thing on my PC.  Not as obvious on the phone though.\n\n\nHas anyone else seen this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ptt3pn/power_rangers_original_wibbly_wobbly/"
    },
    {
        "id": "1pu8tra",
        "author": "purple_sunday",
        "title": "I hate netflix now",
        "content": "I can’t even have the same account at my moms vs my dads. this is the worst possible way to deal with people breaking the “rules” i’m DEFINITELY not gonna make my dad pay for something i SHOULD be getting for free. and i certainly am telling my mom to cancel her subscription. being penalized for having divorced parents, thanks netflix.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pu8tra/i_hate_netflix_now/"
    }
]