[
    {
        "id": "1j1dayc",
        "author": "BunyipPouch",
        "title": "Upcoming /r/movies AMAs/Q&amp;As",
        "content": "",
        "upvotes": 16,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ery8ipyq06me1.png?auto=webp&amp;s=a558d3b75e7f73bf4c89f62b1719d32f4216a92d"
        },
        "permalink": "/r/movies/comments/1j1dayc/upcoming_rmovies_amasqas/"
    },
    {
        "id": "1j0i4dk",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Game Card Pickup Thread",
        "content": "#[Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) if you want to just nab one and skip the wall of text.\n\n---\n\nAlright everyone, Oscar Sunday is quickly approaching and with it the growing anticipation to simultaneously be enthralled and disappointed by the glamour and politics of Hollywood. Well, to make it all a little more interesting we are doing Oscar Bingo again this year. A week ago we [asked you guys to come up with things that might happen during the ceremony](https://old.reddit.com/r/movies/comments/1itlqyx/oscar_bingo_xii_submission_thread/) and vote for your favorites. We then collected the top 65 plausible and non redundant submissions and our friends over at www.print-bingo.com made us a Bingo game card generator that has a ton of game cards for you fine folks to download.\n\n- Feel free to get however many you want for your needs but please don't waste them! \n\n- [Here is the gamecard generator.](https://print-bingo.com/reddit/oscars2025.php) Just do the captcha and your card will be generated via **link to a pdf.** You will have to click the link for the card, don't do the captcha a bunch of times because it's not automatically downloading. That wastes cards and each one could be a winner!\n\n- Check out [last year's game thread](https://old.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/) for reference.\n\nEveryone is welcome to participate. On Oscar Sunday we will make an official game thread for everyone to discuss their cards and the game. The game thread will also serve as a referee zone for me and participating users to make judgement calls on the more ambiguous answers. Here are some things to know about the \"competition\" side of this little shindig:\n\n- If you win just be sure to yell \"BINGO\" really loud wherever you are. And if you wanna post your gamecard to the game thread that would be fine too.\n\n- This thread will be stickied until Oscar night when we make the game thread. There will also be an official Oscar discussion thread separate from the Bingo game thread.\n\n\nFinally, none of this ridiculousness could have been possible for such a large-scale website without print-bingo.com, and they have a message for us!\n\n*\"Print-Bingo.com is used by hundreds of teachers, event hosts, party organizers, and ex-pats in all corners of the globe to make both traditional and custom bingo cards through a web browser. We are happy to help Reddit with this fun, specialized, use of our website.\"*\n\nSo hey! Pick up a gamecard. Pick up 5. Play with your friends. Play alone with your cat. And let this be a reminder to all of us not to take the Oscars too seriously.",
        "upvotes": 25,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1j0i4dk/oscar_bingo_xii_game_card_pickup_thread/"
    },
    {
        "id": "1j1txhm",
        "author": "Icy_Smoke_733",
        "title": "The Highest-Earning Actors Of 2024 - The Rock Tops the List with $88M, Followed by Ryan Reynolds ($85M), Kevin Hart ($81M), Jerry Seinfeld ($60M), And Hugh Jackman ($50M) - Including all earnings, film salaries, &amp; other forms of income.",
        "content": "",
        "upvotes": 522,
        "comments": 232,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nMtZd62ygfqdkt6mXMPXtTovwCJqPrgqGaqY51z7bl0.jpg?auto=webp&amp;s=07f9e3030089ae8d8c9232d063837766a4ef33d1"
        },
        "permalink": "/r/movies/comments/1j1txhm/the_highestearning_actors_of_2024_the_rock_tops/"
    },
    {
        "id": "1j17tas",
        "author": "MarvelsGrantMan136",
        "title": "Harrison Ford drops out as presenter at 2025 Oscars after shingles diagnosis",
        "content": "",
        "upvotes": 14385,
        "comments": 614,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/omd8CskG_zMc72cfv5I4ayCTBUVFeBDXAtTM3t_u9do.jpg?auto=webp&amp;s=d294acf6d9fcb067f7464efb9f3534eea19daaab"
        },
        "permalink": "/r/movies/comments/1j17tas/harrison_ford_drops_out_as_presenter_at_2025/"
    },
    {
        "id": "1j1gvxt",
        "author": "Geauxtoguy",
        "title": "What's the worst movie to win an Oscar?",
        "content": "I completely understand that a lot of award shows, especially the Oscar's, are mostly internal politics; and just because a movie wins an award doesn't necessarily mean it's actually a great film. \n\nI know a ton of movies that SHOULD have won an award, but I want to hear your thoughts on some of the worst movies that HAVE won at least one Oscar. ",
        "upvotes": 1379,
        "comments": 2021,
        "media": null,
        "permalink": "/r/movies/comments/1j1gvxt/whats_the_worst_movie_to_win_an_oscar/"
    },
    {
        "id": "1j17euu",
        "author": "SamLarsons",
        "title": "What is the greatest animated film of all time?",
        "content": "See title. What is your greatest animated, not live action, movie? One that you could watch over and over again and never get tired of it?\n\nIn honour of Miyazaki’s latest (and maybe final) film, my friend and I got into a discussion about what the best animated film ever was. Is it a given that it is a Miyazaki?",
        "upvotes": 5426,
        "comments": 7603,
        "media": null,
        "permalink": "/r/movies/comments/1j17euu/what_is_the_greatest_animated_film_of_all_time/"
    },
    {
        "id": "1j1j1r4",
        "author": "West_Conclusion_1239",
        "title": "Don't Look Up is truly a film ahead of its time",
        "content": "Don't Look Up, (despite getting Best Picture and Best Screenplay nominations) was maligned by many critics at the time of its release.\n\nSome people three years ago found it too on the nose and over the top.\n\nBut i'm telling you, in retrospect, especially considering the rise of this new administration, this movie is so ahead of its time.\n\nIt predicted a dumb tech billionaire having massive influence in the government, who's also obsessed on rare minerals and going to another planet, and in the meantime there's an upcoming meteor which could strike Earth.\n\nAnd this billionaire is enabled by an equally dumb populist president and the dishonest media which control an extremely large and ignorant part of its population.\n\nIt's one of those \"prophetic satires\" that deserves to be put up there among Dr.Strangelove, A Face In The Crowd, Ace In The Hole, Network, and Being There.\n\nIt's like a documentary of this time we are living.\n\nAlso there's a great cast with hilarious and very committed performances, in my opinion the standouts were Blanchett, Di Caprio, Rylance and Hill.\n\nIt will be a new classic satire in years to come.",
        "upvotes": 622,
        "comments": 339,
        "media": null,
        "permalink": "/r/movies/comments/1j1j1r4/dont_look_up_is_truly_a_film_ahead_of_its_time/"
    },
    {
        "id": "1j1rsxm",
        "author": "marchof34_",
        "title": "Like Tears in Rain | Trailer UK/US",
        "content": "",
        "upvotes": 82,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9FIGpJG5gwSBwPKlS8zoG7dmmOmACu2iAcLlnJYkQHw.jpg?auto=webp&amp;s=0505fc5737fe17aaec1e582e5685836461024142"
        },
        "permalink": "/r/movies/comments/1j1rsxm/like_tears_in_rain_trailer_ukus/"
    },
    {
        "id": "1j11xs7",
        "author": "MarvelsGrantMan136",
        "title": "Jack Black &amp; Paul Rudd’s ‘Anaconda’ Reboot Has Officially Wrapped Filming",
        "content": "",
        "upvotes": 5819,
        "comments": 466,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O5ZLJjrTe2ebagyjbcNQjlTRQqmYdFV6JyXdkZtN_zo.jpg?auto=webp&amp;s=873cf66a2460e369f77660d41ef2215e138d9437"
        },
        "permalink": "/r/movies/comments/1j11xs7/jack_black_paul_rudds_anaconda_reboot_has/"
    },
    {
        "id": "1j1it9u",
        "author": "Tall_Ant9568",
        "title": "SLC Punk is one of the saddest movies I have ever seen; simply because it is so plausible in real life. The trauma and uncertainty addiction inflicts on people is so painful. I have rarely seen another actor portray grief better than Matthew Lillard. This movie left me in thought for days.",
        "content": "After watching this movie, I really considered my life as taken for granted, and it made me thankful for the position I’m in right now. For being a cult classic, It’s something worth watching but it’s pretty emotionally jarring. One of Lillard’s best movies. \n\nTwo most famous quotes:\n\n“What do you do when your foundation falls apart? I don’t know. They don’t teach you that in school.”\n\n&gt;! ”Fucking poser! Only Posers die you fucking idiot! Now what am I gonna do for a best friend? You’re my only friend. Please wake up! I’m sorry! Oh fuck. Oh man, oh jeez. Oh, my god. I wasn’t ready for this. I wasn’t ready.” !&lt;",
        "upvotes": 427,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1j1it9u/slc_punk_is_one_of_the_saddest_movies_i_have_ever/"
    },
    {
        "id": "1j1iejc",
        "author": "yanakozlova",
        "title": "What’s that one movie you could watch over and over again without getting tired of it?",
        "content": "Some movies just have that magic that keeps you coming back no matter how many times you’ve seen them.\n\nI think mine is Happy Gilmore. I think I watched it 15-20 times in one year before which is a lot. Such a nostalgic, comfort movie for me.\n\nIf I don’t feel like looking for something to watch I’ll just watch an old comfort comedy like that.\n\nWhat’s that one movie for you, and what makes it so special?",
        "upvotes": 357,
        "comments": 1155,
        "media": null,
        "permalink": "/r/movies/comments/1j1iejc/whats_that_one_movie_you_could_watch_over_and/"
    },
    {
        "id": "1j17ke6",
        "author": "vatred",
        "title": "David Johansen Dies: New York Dolls Singer &amp; ‘Scrooged’ Actor Was 75",
        "content": "",
        "upvotes": 1489,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xVQevtK49414QLXniq04HMjX_u69zEVqlnBF0mYpgYY.jpg?auto=webp&amp;s=b11003dc2d58aa5cc02246a927856de105fdb821"
        },
        "permalink": "/r/movies/comments/1j17ke6/david_johansen_dies_new_york_dolls_singer/"
    },
    {
        "id": "1j1i5ia",
        "author": "flynnfx",
        "title": "What would you say is the greatest *sequel* of all time to the original movie?",
        "content": " Had a discussion in r/lv426 about Alien/Aliens, and which was the better movie.\n\n Now, Alien I love,  and Aliens I love - which is better/superior is still hotly contested to this day.\n\n What I will say, imho, Aliens is the best sequel of all time.\n\n And yes, that includes Indiana Jones, Star Wars, Star Trek, Back To the Future, Lord of the Rings, and even Avengers (although it's a close second).\n\n Like to hear from you all!\n \n Agree? Disagree? \n\n What do you consider the best sequel movie ever made?\n\n EDIT - OMIGOD..now I know what \"rip my inbox!\" means!!",
        "upvotes": 251,
        "comments": 835,
        "media": null,
        "permalink": "/r/movies/comments/1j1i5ia/what_would_you_say_is_the_greatest_sequel_of_all/"
    },
    {
        "id": "1j1hs32",
        "author": "clarastongue",
        "title": "Which movie opening did you see that had a scene so exciting/funny/badass that the entire audience went insane in the theatre?",
        "content": "For me, Captain America lifting Mjolnir. The entire theatre literally descended into madness when that happened. I have heard stories of other movies creating quite a scene in the theatre but genuinely want to hear yours. I’m always looking for new films and do love me some shock value. Super curious to hear your guys’ experiences. ",
        "upvotes": 217,
        "comments": 339,
        "media": null,
        "permalink": "/r/movies/comments/1j1hs32/which_movie_opening_did_you_see_that_had_a_scene/"
    },
    {
        "id": "1j1sh7j",
        "author": "HeStoleMyBalloons",
        "title": "John Lithgow and Geoffrey Rush talk horror in \"The Rule of Jenny Pen\"",
        "content": "",
        "upvotes": 22,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xLGjJO0g9L5cU19eEhqIxOXMLVbhRMM3A-In7xOP8sQ.jpg?auto=webp&amp;s=b0da821634efbb2ab5d24b3c350c8527ef250b2f"
        },
        "permalink": "/r/movies/comments/1j1sh7j/john_lithgow_and_geoffrey_rush_talk_horror_in_the/"
    },
    {
        "id": "1j1gi2t",
        "author": "herewego199209",
        "title": "The you wanna hurt me scene in PLANES TRAINS AND AUTOMOBILES is one of the saddest monologues ever in a comedy movie because not only is it the first time Del stands up for himself in the movie but because the twist hits even harder going back to this scene.",
        "content": "What makes this scene heartbreaking is the reveal that Del has nothing. These moments with Neal are probably the most human interaction he's had in nearly a decade and this scene where he finally fights back his only response is of what he had in his prior life before his wife's death. When you get that twist at the end of the movie it makes the entire movie that much more heartbreaking. Del's entire monologue is esentially him fighting back by just reininsicng on the life he once had. Amazing performance from Candy who probably would've been one of the better character actors if he stayed alive.   \n  \n",
        "upvotes": 219,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1j1gi2t/the_you_wanna_hurt_me_scene_in_planes_trains_and/"
    },
    {
        "id": "1j1ngrn",
        "author": "jtello_ct",
        "title": "What are some of your favorite early 2000s comedies?",
        "content": "I just watched White Chicks for the first time and it brought me down the rabbit hole of early 2000s comedies that have a similar style. I’m talking your “Mean Girls” and your “Dude Where’s My Car” type of movies. I want to ask the question to all of you guys, What are some of your favorite 2000s comedies?",
        "upvotes": 22,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1j1ngrn/what_are_some_of_your_favorite_early_2000s/"
    },
    {
        "id": "1j169er",
        "author": "NstgElNino",
        "title": "What are the best revenge movies ?",
        "content": "For me the best and underrated revenge movies is Law Abiding Citizen. This movie got so much potential to be a masterpiece if the ending is different. My next favorite revenge movies is I Saw The Devil. The guy that played the bad guy is so convincing in his character and made me so angry watching him. ",
        "upvotes": 287,
        "comments": 775,
        "media": null,
        "permalink": "/r/movies/comments/1j169er/what_are_the_best_revenge_movies/"
    },
    {
        "id": "1j1t902",
        "author": "Miserable-System-286",
        "title": "Flow animated film",
        "content": "I know I enjoyed this movie but what is it about? Can anyone tell me? It’s absolutely gorgeous to watch. And also kept my toddler engaged for most of it. But I am at a loss for what it “means”\nThere are moments where it can feel like a religious allegory. But I feel like there may be more to it than that. Let me know your thoughts.\nWhat are your favorite moments of the film and which character is your favorite?\n\n#oscars2025 #flowanimatedfilm #nodialogue",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1j1t902/flow_animated_film/"
    },
    {
        "id": "1j1ib5z",
        "author": "BrooklynDuke",
        "title": "Nickel Boys Was Not What I Expected!",
        "content": "I expected a straightforward movie about a horrid corner of American history focusing on injustice and racism and the resilience of the human spirit. Movies like that aren’t always bad, but they’re rarely artistically exciting. What I got was something more like Tree of Life, and I mean that as a huge compliment. I thought the story was so much more powerful because of its surrealist qualities. I expected scenery chewing villains and overwrought scenes of torture. What I got was more akin to a haunted dream that left me pondering the passage of time. This is a bold film from a real artist. I’m not even raving about the movie. On letterboxed I gave it 4 out of 5 stars and It’s far from my favorite of the year. But I’m truly struck by the artistry and how much the movie surprised me. Bravo! ",
        "upvotes": 40,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1j1ib5z/nickel_boys_was_not_what_i_expected/"
    },
    {
        "id": "1j1s15q",
        "author": "FrontStruggle6607",
        "title": "Dead poet society.",
        "content": "This movie resonates with me on so many levels. Family trying to control me and self harm...\nMy family are orthodox jews living in Israel, and I do not share the same beliefs. Needless to say my parents try to control me on about everything, from life choices to dictating who I can and can't hang out with. I've had self harm thoughts more than I can count(I am currently getting professional help) and it all just connected when watching this movie. I need to live for myself and if that bothers my parents so be it. If my parents can't accept me for who I am I won't change myself to fit the mold of the person they want me to be. On another note, great movie fr.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1j1s15q/dead_poet_society/"
    },
    {
        "id": "1j1jpnk",
        "author": "SpicyBigDad1337",
        "title": "Horror movies that really stick with you for a while",
        "content": "Just like the title suggests, what are some really good horror movies that give you that persistent feeling of dread and fear later on after you’re done watching them?\n\nFor me one really sticks out in particular: Lake Mungo. When first watching it I thought it was pretty boring and the climax of the movie which is supposedly “the scariest scene ever” didn’t even phase me… until I thought about it later on.\n\nSomething about it really disturbed me and made me think about it for a while even though at the time of watching it wasn’t scary. \n\nDoes anyone else have a personal example? Also post general horror movie recommendations.",
        "upvotes": 29,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1j1jpnk/horror_movies_that_really_stick_with_you_for_a/"
    },
    {
        "id": "1j1tbu2",
        "author": "HallowedAndHarrowed",
        "title": "Josef Sommer in his very first film role as the District Attorney in Dirty Harry (1971). Very few times was Clint Eastwood upstaged in a scene, this was one of those times.",
        "content": "",
        "upvotes": 6,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2jvUWneLqI6n6JRJW1f8qX9niXDSmGL8Pd_GNRupO74.jpg?auto=webp&amp;s=a1bbbc187c7f9632ab0ce538cb533482e4a30cbb"
        },
        "permalink": "/r/movies/comments/1j1tbu2/josef_sommer_in_his_very_first_film_role_as_the/"
    },
    {
        "id": "1j15p6d",
        "author": "TinStingray",
        "title": "Looking for \"good versions\" of movies like National Treasure and The Da Vinci Code—historical-conspiracy sort of mystery",
        "content": "I loved The Da Vinci Code and National Treasure as a kid.  I'm not sure they hold up quite as well to my adult eyes, but I still like the general vibe—a historical mystery with roots going back centuries, secret groups of people, etc.\n\nWhat other movies are like that, but maybe a little more acclaimed?",
        "upvotes": 183,
        "comments": 216,
        "media": null,
        "permalink": "/r/movies/comments/1j15p6d/looking_for_good_versions_of_movies_like_national/"
    },
    {
        "id": "1j1hj7n",
        "author": "goboys88",
        "title": "What’s the best 90s thriller/ mystery",
        "content": "I feel like I’ve watched every thriller mystery movie made in the 90’s. I don’t know if these movies are necessarily the greatest movies ever but Kiss the Girl, Primal Fear, and Bone Collector and movie like them are top tier to me. I just am trying to find some titles that fit into this that I may have forgotten about! Drop your favorites or any suggestions that are close to this type of movie! ",
        "upvotes": 23,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1j1hj7n/whats_the_best_90s_thriller_mystery/"
    },
    {
        "id": "1j0ujc0",
        "author": "Lets_Go_Why_Not",
        "title": "Best Examples of Bringing an Audience Up to Speed in a Movie",
        "content": "I just finished watching Deepwater Horizon, which is generally fine, but one thing I really appreciated was the way it found to explain what was happening on Deepwater Horizon and what Marky Mark's company did, thus allowing the rest of the movie to be a lot easier to understand from both a technical and political perspective. Basically, an early scene has Marky Mark's young daughter practicing her speech for class on what her Dad does, with a Coke can as a demonstration. \n\nThat got me wondering, in an era where so many movies seem to just plunk two characters down and have them talk about things that they are both already aware of solely for the audience's benefit (\"Wow, I can't believe it's been 5 years since you had that car accident where you lost your young son named Michael, after which your wife left you because she couldn't process her grief, and you moved back in with your estranged father....\"), do you have any other examples where a movie found an elegant or effective way to deliver some complicated backstory or foundational knowledge required to understand the specifics of the story?",
        "upvotes": 874,
        "comments": 438,
        "media": null,
        "permalink": "/r/movies/comments/1j0ujc0/best_examples_of_bringing_an_audience_up_to_speed/"
    },
    {
        "id": "1j0x1ju",
        "author": "Biomilch1",
        "title": "I don’t get Anora",
        "content": "I mean I get the movies story and stuff, but I don’t get why it is so popular and hyped. I personally thought the movie was good, not the 10/10 masterpiece I see people hail it to be. \n\nThe camerawork was incredible, as well as the performances but I thought the story, while dealing with an important topic, was told in an extremely shallow way. I couldn’t connect to any of the characters and didn’t feel much during the entire movie. The only time I really thought „yeah this is great storytelling“ was that last scene in the car. \n\nSo if anyone who really really loves Anora would explain to me why you do I‘d greatly appreciate it.",
        "upvotes": 406,
        "comments": 286,
        "media": null,
        "permalink": "/r/movies/comments/1j0x1ju/i_dont_get_anora/"
    },
    {
        "id": "1j0bb00",
        "author": "MarvelsGrantMan136",
        "title": "2025 Razzie Award Winners: 'Madame Web' Wins Worst Picture",
        "content": "",
        "upvotes": 22712,
        "comments": 1342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TrjA45g8bevmcbEPBwoeUgCorGq1g1AiVG3_kS5o20k.jpg?auto=webp&amp;s=f0bba2d99bbe6bb0d3553ad85720479b94b6aa31"
        },
        "permalink": "/r/movies/comments/1j0bb00/2025_razzie_award_winners_madame_web_wins_worst/"
    },
    {
        "id": "1j1n0ux",
        "author": "CakeMadeOfHam",
        "title": "Mads - Best zombie outbreak movie?",
        "content": "MadS from last year probably flew under most peoples radar, a relatively small french horror movie, but holy smokes! Shot and edited to look like one single take á la 1917, the movie takes place one night in the suburbs as we follow a couple teens doing what teens do - party, do drugs, have sex. But what they don't know is that Romain, the person we first meet, has come in contact with something infectious earlier that night and now it's slowly spreading.\n \nIt's like The Crazies meets Irréversible with a bit of Kids thrown in the mix. It's relentless! I can't recommend it enough!\n \nEdit: Title was supposed to be the best zombie outbreak movie you've never heard about",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1j1n0ux/mads_best_zombie_outbreak_movie/"
    },
    {
        "id": "1j0wnp2",
        "author": "DemiFiendRSA",
        "title": "Poster for 'Demon Slayer: Kimetsu no Yaiba Infinity Castle Chapter 1'",
        "content": "",
        "upvotes": 321,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ms6vl8w22me1.jpeg?auto=webp&amp;s=fc913e982e5c8c5996cd0964efd4c3bf9a377c40"
        },
        "permalink": "/r/movies/comments/1j0wnp2/poster_for_demon_slayer_kimetsu_no_yaiba_infinity/"
    },
    {
        "id": "1j1r4x1",
        "author": "ripterrariumtv",
        "title": "My interpretation of Rear window's ending",
        "content": "I think, contrary to popular opinion, even though Jefferies and Lisa are depicted as happy at the end, this doesn't represent a shift in Jefferies’ perception of Lisa's \"perfection.\" Although he witnessed different facets of Lisa's personality, his preoccupation with Thorwald prevented him from revising his initial, flawed interpretation of her.\n\nThis is symbolized by the difference in how Jeffries is portrayed while he uncovered the truth about Thorwald and how he is portrayed when the dancer’s truth was shown.\n\n1. When he formed his interpretation of Thorwald, Jefferies is shown looking into the window.\n2. When the dancer’s truth about her relationship is revealed, we see Jefferies away from the window with his eyes closed – symbolizing the fact that he never modified his flawed interpretation of the dancer’s, and subsequently Lisa’s, “perfection”.\n\nJefferies’ obsession fueled his interpretation of Thorwald's actions, ultimately leading to a correct conclusion. Ironically, this same obsession blinded him to the truth about Lisa. This demonstrates that while a biased, obsessive approach can coincidentally uncover truth, it's a dangerous and unreliable method. Relying on such methods is inherently risky, even if they occasionally produce a correct outcome.\n\nJefferies’ obsession with his own interpretation led him to uncover one truth while simultaneously blinding him from others.\n\nBy only showing Lisa and Jefferies’ “happy ending” for a few seconds during the ending scene, the film replicates Jefferies' limited perspective and implicates the audience in the same act of potentially misinterpreting a brief observation as the whole truth.\n\nJust as Jefferies' view through the rear window offers a fragmented and potentially misleading view of his neighbors' lives, the film's concluding glimpse of Jefferies and Lisa \"being happy\" is misleading – underscoring the unreliability of limited perspectives as a source of truth.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1j1r4x1/my_interpretation_of_rear_windows_ending/"
    },
    {
        "id": "1j1m4o6",
        "author": "PerspectiveEvening56",
        "title": "'The Holdovers\" Review: Toast to the Lonely Ones",
        "content": "The Holdovers is a movie set in the 1970s at a boarding school in Boston. It’s neither a time nor a place I’m familiar with, yet I still feel a sense of nostalgia. It's a story about lonely people during the joyful holiday season.\n\nThe protagonist, Paul Hunham, is a cynic, disillusioned with the world. He is lonely and disliked, neither by his colleagues nor his students. His self-pity is on full display, evident in his words: \"I think the world is a cold and bitter place, and it thinks the same about me.\" What he doesn’t realize is that his own actions contribute to his misery. Or maybe he does, but he seems to take a certain pride in the aesthetic of being a loner and an outsider. He clings to the moral high ground because it’s the only thing he has left. It makes him feel superior to others, serving as an excuse to avoid confronting his own insecurities. An excuse to justify being an asshat, because, in his own mind, it’s the world that’s flawed, not him. An excuse to avoid true self-examination. Armed with Meditations by Marcus Aurelius, a powerful book on stoicism, he uses it to justify his solitude. Yet, despite holding the philosophy so dearly, he fails to embody its principles, allowing addictions to take control of him.\n\nHe reminds me of who I once imagined I would become, or might still become, a loner, angry at the world, unable to see that I was sabotaging myself with self-pity.\n\nThen there’s Angus Tully, a student left behind at school by his family, abandoned in a place he doesn’t want to be. He watches the other students leave, reunited with their families, while he remains, trapped. The loneliness and quiet betrayal feel like crying out loud without a sound. Since kindergarten, I was always the last one waiting to be picked up, standing alone, watching the world move on without me. Waiting and waiting for my parents to show up. I’ve forgotten most things from my childhood, but that feeling, that sense of hopelessness and desperation, still haunts me from time to time.\n\nSpeaking of loneliness, the first loner I ever knew was my father. I used to wonder, Why do you always stay home instead of going out with friends? I told myself I would never be like that when I grew up. But somehow, I did. Just like the movie says, \"The steps you take to avoid your fate are the very steps that lead you to it.\"\n\nSo how do we fill the void of loneliness? Not by obsessing over ourselves but by thinking about others. Everyone is fighting their own demons, too busy bleeding to notice the next guy’s wounds. Paul Hunham assumes Angus Tully is just another troubled kid, abandoned because his parents don’t want him around. Angus, in turn, sees Paul as a lonely loser on a power trip, clinging to authority because he has nothing better to do. Trapped in their own perspectives, neither realizes the depth of the other’s suffering.\n\nBut the story shifts when they begin to care. When Angus learns the truth behind Paul’s bitterness, and when Paul sees the pain behind Angus’s defiance, their loneliness starts to dissolve. It’s a cliché, but a true one. Loneliness isn’t cured by endless self-improvement or chasing happiness. It’s eased by genuine care for others. The light we give to others is the same light that fills our own void.\n\nIn the end, Paul takes the fall for Angus. But in doing so, he sets himself free. Finally, he can pursue his dream of writing his monograph. Will he succeed? Who knows. But at least, now he’s free.\n\nI guess the reason I love this movie so much, aesthetic aside, is that I can feel every bit of loneliness it conveys—but also see a cure for it.\n\nToast to the lonely ones. To the holdovers.                 ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1j1m4o6/the_holdovers_review_toast_to_the_lonely_ones/"
    }
]