[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hp685t",
        "author": "Tough-Carrot-4650",
        "title": "SG2 was awesome (no spoilers)",
        "content": "Season 2 of Squidgames was exactly what a season two of any successful 1st seasoner should be. \n\nIt was not a let down in any way, it built on it's core story and didn't invent nor remove any plot points to try and make it something which it isn't.\n\nWas it better than the first season? Of course not, but how would it be? It's not possible since we know what it's about. Not many possible inventions appart from the few we saw, and yet to be seen that made and can make the show keep being great.\n\nBut was it awesome? Yes it was, I watched it in 7 hours. As many others did as well.\n\nIt starts of very captivating.\n\nThe main participants (some annoying, not in a good way, but do get better) are introduced well.\n\nThe games are not repetitive.\n\nThe story makes you question what the plottwist will be because of taunts. Some of them not forseeable.\n\nAnd overall the ending makes you feel exactly what you (don't) want to feel, which is a good thing if you ask me!\n\nGreat job!",
        "upvotes": 49,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hp685t/sg2_was_awesome_no_spoilers/"
    },
    {
        "id": "1hpgn0j",
        "author": "JaymehKhal",
        "title": "Squid Game season 2 covered so little ground.",
        "content": "I feel like it spent way too much time on the games and the voting, to the point where you're giving each character very little screen time outside of little convos here and there. You don't care about most of them because meh I barely know them. You knew virtually every time when someone would die (and conveniently the old woman and pregnant woman are fine from the night brawl....).\n\nAnd then the sub plots....what a waste of time. Got virtually nothing out of them. After the North Korean girl becomes a worker, every second with her felt so pointless.\n\n\nI'm pretty disappointed. Feel like the show didn't get into the nitty gritty of the interesting questions at all. First episode was good fun if nothing else but I really didn't like the direction it went in at all. Maybe would've been better to just release season 2 and 3 in 1 go but this felt like a lot of filler again.\n\n(Also, the insurrection at the end was dumb as shit. Why would they go along with that? And the whole time Gi Hun is iffy about 001 but never suspects it might be the same as last time? Wtf?)",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hpgn0j/squid_game_season_2_covered_so_little_ground/"
    },
    {
        "id": "1hpdwdh",
        "author": "Qwiffee",
        "title": "Permanently remove from continue watching?",
        "content": "If I were to, hypothetically, be using someone else’s Netflix profile, and, hypothetically, wanted to permanently hide a certain show from them, how would I go about doing that? Hypothetically of course.",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hpdwdh/permanently_remove_from_continue_watching/"
    },
    {
        "id": "1hpg841",
        "author": "Due_Molasses9749",
        "title": "Ayúdame ",
        "content": "Got on netflix to watch my show (The Walking Dead) and my language got changed to spanish. how the hell do i change it back. think it was my ex. she has access to my netflix and is kinda spiteful lol. just a little inconvenient. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpg841/ayúdame/"
    },
    {
        "id": "1hof2qz",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 2 is the first show in history to be #1 in 93/93 countries",
        "content": "",
        "upvotes": 1166,
        "comments": 161,
        "media": null,
        "permalink": "/r/netflix/comments/1hof2qz/squid_game_season_2_is_the_first_show_in_history/"
    },
    {
        "id": "1hpcl6u",
        "author": "fleshflavoredgum",
        "title": "Fireplace for your home show",
        "content": "I have to say I was very disappointed. The only firewood you had available was “crackling birchwood.” My family was really looking forward to seeing pine this season, and was very let down to see the rerun of birchwood. The fire only lasted one hour and it wasn’t even that warm. During the preview, the fire showed that it was much much bigger.  Very misleading. I tried poking it to feed the flame and it only pressed the television behind the dresser. Of course I ran to grab the water hose to put out the flame as my wife called the fire department. We could hear the fire continue to crackle and see the light behind the dresser. Don’t yall think it’s strange that your fire smelled like cat pee only after the “fireplace” fell? It didn’t even have any aroma before… we’re hoping the pine smells better. We soaked the flame until the sparks finally put the light out from the flames just as the fire department arrived. The gentleman were so happy we took care of the job that they were laughing with us as they left. I would think yall can update the fire to a safer, more aromatic pine for next year. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hpcl6u/fireplace_for_your_home_show/"
    },
    {
        "id": "1hpczep",
        "author": "RevolutionaryBag5424",
        "title": "Maestro in Blue Final Season",
        "content": "No one I know personally watches this show and I need to discuss it with somebody!\n\nI assume there will be spoilers in the comments, folks!\n\nOverall, I did enjoy the episodes but it felt so rushed to tie things up! How do we feel?",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hpczep/maestro_in_blue_final_season/"
    },
    {
        "id": "1hotcnq",
        "author": "S4v1r1enCh0r4k",
        "title": "Hwang Dong-hyuk says Squid Game season 2 served as a comeback for T.O.P. following his Marijuana Scandal, the director said that it took a lot of guts to portray rapper with drugs problems considering his past",
        "content": "",
        "upvotes": 73,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hotcnq/hwang_donghyuk_says_squid_game_season_2_served_as/"
    },
    {
        "id": "1hph48d",
        "author": "dthdtql",
        "title": "How to turn off skip?",
        "content": "I just got Netflix this month in anticipation of all WWE programming moving to it in Canada next month. I like watching programs as they originally aired so i want to watch all episode recaps, opening theme songs, and end credits. How do I go about doing that?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hph48d/how_to_turn_off_skip/"
    },
    {
        "id": "1hph0ur",
        "author": "Secret-Income6920",
        "title": "How to add another person to a plan? ",
        "content": "Hello. I was using my mom's account before Netflix required all the \"household\" stuff. It's been a pain and now it's too much of a pain. She said she'll pay the extra so she can use it at her house, and I can use it at mine, without interruption for either of us. She went through what she thought was the obvious way. It wasn't.\nJust looking for a extremely simple explanation on how to use my profile, on her account, from a different house, without it logging one of us out, each time the other uses it. The instructions on how to pay for the plan and get this, were not clear enough, I guess lol. Thank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hph0ur/how_to_add_another_person_to_a_plan/"
    },
    {
        "id": "1hpgdc1",
        "author": "lavalamplavender",
        "title": "removed profile pictures?",
        "content": "does anyone know how to change your profile picture to one that is not available anymore? i want taylor swift but the tutorial online isn't working since its from 2022. i have the image id (AVATAR|fe19e860-5a6c-11ea-8dd9-0af231b9590b|en|CA|81249014) but i dont know how to do the coding! thank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpgdc1/removed_profile_pictures/"
    },
    {
        "id": "1hpfdfk",
        "author": "taekwondodo609",
        "title": "100 Years of Solitude - help identifying song in E7",
        "content": "OHYS is an astounding show, and well worth the watch. Without any spoilers, Pietro Crespi sings a song outside the house in episode 7. Does anyone know whether this was composed for the show or whether it was a pre-existing song? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpfdfk/100_years_of_solitude_help_identifying_song_in_e7/"
    },
    {
        "id": "1hpfb17",
        "author": "realboarder09",
        "title": "Remind Me",
        "content": "I was watching Vikings when the episode ended, and now all of a sudden the show is no longer available. Same thing with Lost which I was also watching a little while ago. Now only the Remind Me option is available. Anyone else run into the same problem?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpfb17/remind_me/"
    },
    {
        "id": "1hpczq2",
        "author": "MogenCiel",
        "title": "Disappointments",
        "content": "I've encountered two notable disappointments over the holidays. I had to give up on Reindeer Games at Episode 3 or 4. Dude, if you're still trying to be Mr. Nice Guy after all these blazing and terrifying red flags, you have a mental health problem too and I don't wanna watch. Also, the new season of Virgin River ... ? I always liked this sweet show, but am I the only one finding the new season boring AF? I was hoping to binge it but walked away after a few episodes. I may flip back to a new episode occasionally, but I just can't binge this.\n\nAny other disappointments?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hpczq2/disappointments/"
    },
    {
        "id": "1homj8d",
        "author": "ashekyux",
        "title": "I didn't expect this message ",
        "content": "",
        "upvotes": 78,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1homj8d/i_didnt_expect_this_message/"
    },
    {
        "id": "1hp80c3",
        "author": "Temporary_Solid_4267",
        "title": "Does Netflix allow you to look at watch history?",
        "content": "I’m trying to figure out all the seasons of shows I’ve watched this year and was wondering if you could see the past shows and movies of an account or profile",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hp80c3/does_netflix_allow_you_to_look_at_watch_history/"
    },
    {
        "id": "1hp6uje",
        "author": "groob__",
        "title": "In need of recommendations ",
        "content": "I tend to stick to basic shows, I always find myself rewatching the office, superstore, and big mouth. However, I really like series, I loved squid game, as well as 'you'. I'm looking for more series to get me hooked, so bored of rewatching shows. \n\nAll recommendations appreciated!!",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hp6uje/in_need_of_recommendations/"
    },
    {
        "id": "1hpbd1h",
        "author": "iwatchterribletv",
        "title": "the perfect couple: reflections",
        "content": "so, um. \n\n- the scene shots, especially of the water, were phenomenal. \n- deeply inconsistent tone and character behavior, which i hate. they built a lot of good scaffolding and kind of wasted a lot of it. \n- why wasn’t amelia more destroyed about her friend the whole time? \n- the casting choice for isabel was not convincing.  \n- the wig choice for nicole kidman was even less convincing. \n- the kids faces when greer tells them she was an escort were excellent, and the “barry and cynthia” exchange (“hyacinth and brad!” “barry is fine.”) might have been the best random laugh in the whole show. the cops/door-slamming exchange was also cute. \n\nwith all the talent and money that went into this, why didn’t someone clean up the gaps?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpbd1h/the_perfect_couple_reflections/"
    },
    {
        "id": "1hpgge7",
        "author": "DekaenPyruzhine",
        "title": "Cursed needs to be revived and continued",
        "content": "Netflix made a huge mistake canceling this show. It has depth, a strong storyline, and is well written. \n\nThey need to stop canceling shows with substance in favor of lame shows with no depth and all gimmick. We Gen Xers like good stories. \n\nBring the show back, Netflix. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hpgge7/cursed_needs_to_be_revived_and_continued/"
    },
    {
        "id": "1hp48wy",
        "author": "thehighground426",
        "title": "Bluetooth won't change volume on laptop.",
        "content": "I have Bluetooth earphones I use for netflix on my laptop but for some reason I can't change the volume at which the sound comes out. It only works outloud. Any help?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hp48wy/bluetooth_wont_change_volume_on_laptop/"
    },
    {
        "id": "1hp8t67",
        "author": "Jamieb1994",
        "title": "Reminder set question ",
        "content": "Say if you have other user profiles on your Netflix account that you share with &amp; if you set a reminder for a movie/show to notify you it's available to watch on your own profile. Will the other users get the same reminder as well or if a reminder is set just on your profile. Do only you get the reminder alert?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hp8t67/reminder_set_question/"
    },
    {
        "id": "1hp6sol",
        "author": "hdwys2",
        "title": "Quick way to know whats available in a country",
        "content": "Is there a simple way to check what country has what shows or movies available? Like if a country has this or that added and what language or subtitles it has available. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hp6sol/quick_way_to_know_whats_available_in_a_country/"
    },
    {
        "id": "1hpez0a",
        "author": "Front-Judgment8941",
        "title": "Mismatched",
        "content": "uhm, i just got a Netflix subscription &amp; my friends are saying \"mismatched\" was a series ig? it was really good it seems, and my cousin started watching it yesterday and done with 3 episodes and says it's really great. do you guys recommend me watching it??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpez0a/mismatched/"
    },
    {
        "id": "1hon4p1",
        "author": "Zeroyhme",
        "title": "More Squid Game Season 1 vs Season 2 Comparisons (Updated)",
        "content": "",
        "upvotes": 24,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hon4p1/more_squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1hp2h3q",
        "author": "CyberGhostface",
        "title": "Do discontinued icons remain in history?",
        "content": "Right now I have a profile icon that is no longer available to choose. If I were to change my icon would it appear in the history to choose again or would it just disappear? Thanks.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hp2h3q/do_discontinued_icons_remain_in_history/"
    },
    {
        "id": "1hp7eql",
        "author": "Important-Eggplant44",
        "title": "Netflix membership no longer active",
        "content": "I wanted to come here because I didn't know where else to ask this but I have been logged out of Netflix on all devices and when I go to log in again, it takes me to the page for new sign-ups and asks me to select a plan. I don't know for how long my family has had Netflix, but it has been a few years and now suddenly I am logged out on everything and supposedly have no membership. I was watching Squid Game yesterday so this has happened over night. The issue shouldn't be that the transaction isn't going through since it has attached to an account that has enough money and we actively use Netflix so it shouldn't be an inactivity issue\n\nEdit: There have been no emails from Netflix such as notifications about email or membership changes. Absolutely no notification from Netflix",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hp7eql/netflix_membership_no_longer_active/"
    },
    {
        "id": "1hp1pak",
        "author": "marayay",
        "title": "Weird situation in Belgium regarding WWE deal with Netflix",
        "content": "You may know it or not, but in Belgium one half speaks Dutch, and the other half speaks French (and a small portion even German). Because WWE has a contract with ABXplore, they're apparently not going to stream WWE on \"Belgian\" Netflix. The problem is: AB1 is a channel in French, and nearly no Belgian that speaks Dutch cares about that channel. They dub it too, so it's pretty much useless to most of us, as we can't even rely on English audio.\n\nI think there's a really slim chance I might get it because my profile is in Dutch (and therefore sometimes gets merged together with Netflix Netherlands), but it definitely depends on how their contract is with ABXplore. I tried contacting them, but even for the staff it's really vague. I think I'll just see in a few days, though I'm ready to be disappointed.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hp1pak/weird_situation_in_belgium_regarding_wwe_deal/"
    },
    {
        "id": "1hpcu5d",
        "author": "Bongo_Johnson",
        "title": "Physical 100 Thanos Reference in SG2? ",
        "content": "So i noticed that the Purple Haired rapper in SG2 goes by Thanos, and in the 6 Legged Pentathalon Thanos teams up with a scrawny fellow named Min-Su, which was the name of the ABSOLUTE UNIT in Physical 100, Season 2, who also was known as Thanos. \n\nAnyone else notice these Netflix shows nodding to eachother? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hpcu5d/physical_100_thanos_reference_in_sg2/"
    },
    {
        "id": "1hpd7gy",
        "author": "D01D0G",
        "title": "New movie “Amber Alert” written with AI?",
        "content": "I never use Reddit but I don’t see anyone else making comments on this specific movie and I’m so mad that I just wasted 90 minutes of my life so this is my duty to the world. I’m home from college so my mom and I are being watching a lot of films. Basically, this movie appears to lack human touch. It genuinely feels like an AI generated mosh podge of poopy yuckyfuck slop! It’s not often I get angry when I watch a movie-but, the characters are genuinely so unbelievably stupid. No one talks normal, characters don’t behave like humans? Is this just me or has anyone else noticed this kind of trend with newer movies just… being so poorly produced? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hpd7gy/new_movie_amber_alert_written_with_ai/"
    },
    {
        "id": "1hp0701",
        "author": "VesnaKostic",
        "title": "Something more similar to Who were we running from? ",
        "content": "I need a recommendation for a tv show like Who were we running from? People who live on the run, murders, mystery, thriller as similar as possible to this show I am delighted with it, it is now my favorite series.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hp0701/something_more_similar_to_who_were_we_running_from/"
    }
]