[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p8vogh",
        "author": "Blue-Sea2255",
        "title": "Kevin hart special acting my age - it's worst than the war of the worlds ice cube movie.",
        "content": "\nIt’s terrible. I’m stuck eating the popcorn I made for this show while aimlessly watching random YouTube videos.\n\nHe's trying so hard, but those made up stories only make everything worse.",
        "upvotes": 189,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1p8vogh/kevin_hart_special_acting_my_age_its_worst_than/"
    },
    {
        "id": "1p8yhn5",
        "author": "MelloCello7",
        "title": "Genuine question: are you guys really okay with paying for a service and still getting ads?",
        "content": "Its been a looong time since I've used a Netflix account, (I've been been using better alternatives) but since the release of one of the goats Stranger Things, I was, like you know what, lets get an account for old times sake, only to find that the modest 7.99 had ballooned out to 17.99 a month, and the familiar payed basic tier had become riddled with Ads... Payed streaming service with ads was something I simply could not believe. \n\nThis was the most fundamental difference between Cable and Internet: you don't pay for ads. Needless to say I'm back to my usual options, but for those of you who do, are you guys really truly okay with paying for ads?",
        "upvotes": 109,
        "comments": 193,
        "media": null,
        "permalink": "/r/netflix/comments/1p8yhn5/genuine_question_are_you_guys_really_okay_with/"
    },
    {
        "id": "1p9a8zh",
        "author": "dehia_anne",
        "title": "Stranger Things Season 5: Is it just me or…",
        "content": "Is it just me or has it been hard to get into season 5? We all know there’s sooooo much time in between seasons. I didn’t have it in me to re-binge the first four seasons, so I read recaps then started season 5 earlier today. \n\nI’m just getting lost in all of the nitty gritty details. Maybe my attention span isn’t what it used to be, but I just am not getting into this last season like previous seasons (and I was once a diehard ST fan). Just me?",
        "upvotes": 8,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1p9a8zh/stranger_things_season_5_is_it_just_me_or/"
    },
    {
        "id": "1p8znc8",
        "author": "peoplemagazine",
        "title": "Netflix Actor Tony Germano Dies at 55 After Fatal Fall in Brazil: 'His Absence Will Be Deeply Felt'",
        "content": "",
        "upvotes": 33,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p8znc8/netflix_actor_tony_germano_dies_at_55_after_fatal/"
    },
    {
        "id": "1p8x845",
        "author": "winnneer",
        "title": "I was in depression for most of my life so i never watched any shows/movies. Recommend me some that i must watch before i die",
        "content": "My therapy is working and i am slowing gaining interest in the world around me so i took a Netflix subscription hoping to watch shows and movies and talk about them with others to cure and help in my depression journey. Please let me know shows/movies i must watch… Thank you &lt;3",
        "upvotes": 42,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1p8x845/i_was_in_depression_for_most_of_my_life_so_i/"
    },
    {
        "id": "1p85gri",
        "author": "pleasestoptalkin",
        "title": "Millie Bobby Brown takes me out of every Stranger Things scene she’s in",
        "content": "I don’t know if it’s the bad acting or the fact she’s a grown woman, who has had work done on her face, playing a little girl, but I just start laughing every time she’s on screen. If David Harbour really did snap at her, I get it because it seems like she stopped trying and their emotional scenes together are really bad. ",
        "upvotes": 2077,
        "comments": 707,
        "media": null,
        "permalink": "/r/netflix/comments/1p85gri/millie_bobby_brown_takes_me_out_of_every_stranger/"
    },
    {
        "id": "1p99m43",
        "author": "hailey998",
        "title": "Best Sci-Movies or Shows?",
        "content": "Particularly, parallel universes, alternate realities, and time-travel shows. I loved Sliders very much; there's been nothing like it for me since... and it's been many years. I did enjoy Dark Matter and The Man in the High Castle, but are there any others worth watching?",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p99m43/best_scimovies_or_shows/"
    },
    {
        "id": "1p90jn8",
        "author": "v2ikeemi",
        "title": "Netflix cuts straight to episode/movie instead of episodes list",
        "content": "Does anyone else have this issue? Recently my Netflix just starts playing the movie/show with no option to see the list of pisodes first.. So frustrating. ​Is there a way to change this somewhere? ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p90jn8/netflix_cuts_straight_to_episodemovie_instead_of/"
    },
    {
        "id": "1p8pngo",
        "author": "ThePale99",
        "title": "Train Dreams",
        "content": "Watched Train Dreams and I wasn't expecting much but heard good things here and there and it hit me hard how incredibly Beautiful it is it's truly something special.",
        "upvotes": 32,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1p8pngo/train_dreams/"
    },
    {
        "id": "1p915vo",
        "author": "RiskAndReason",
        "title": "What are we watching today? 🫂",
        "content": "Is everybody focused on Stranger Things? What’s on your watchlist tonight, and would you recommend it?\n\nI’m looking for something, whether it’s a movie, a documentary or a fresh series to dive into.",
        "upvotes": 5,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1p915vo/what_are_we_watching_today/"
    },
    {
        "id": "1p8tpoh",
        "author": "RiceResident308",
        "title": "Netflix editing/cutting movies ?",
        "content": "I just rewatched Mr. &amp; Mrs. Smith on Netflix. As its one of my favourite movies I've seen it quite a few times already including television and Dvd.\n\nAnd what i noticed on the Netflix version is that the sex scene between the two main characters ( played by Brad Pitt and Angelina Jolie ) is significantly shortened. Now it just looks akward in my opinion and it's obvious that it's altered.\n\nMy question is whether this is a common Netflix thing ? In some cases if a sex scene is too long or too explicit i would understand their reason. But in this case neither of the two applies.\n\n",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p8tpoh/netflix_editingcutting_movies/"
    },
    {
        "id": "1p90ant",
        "author": "DentistLate9967",
        "title": "How to watch offline via laptop",
        "content": "Going back to my in-laws place for Christmas but unfortunately they still live very rurally so no wifi or any reasonable level of signal. Now me and my girlfriend want to be able to watch the stranger things series with them. Is there any way we can do this offline? I know downloading is no longer available on laptop and a tablet/phone wouldn't work as there is only one very old TV with hdmi cables at the in-laws. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p90ant/how_to_watch_offline_via_laptop/"
    },
    {
        "id": "1p8txfn",
        "author": "Mission-Forever6267",
        "title": "Any Black Mirror fans on here?!",
        "content": "Was having a nosy at the Black Friday deals this morning and spotted this new Black Mirror merch store... looks interesting👀\n\n[https://blackmirror.co.uk](https://blackmirror.co.uk)",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p8txfn/any_black_mirror_fans_on_here/"
    },
    {
        "id": "1p8sabx",
        "author": "Fun_Molasses5215",
        "title": "House of Usher stat Ruth Code undergoes second leg amputation after losing first at 23",
        "content": "",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p8sabx/house_of_usher_stat_ruth_code_undergoes_second/"
    },
    {
        "id": "1p8wdle",
        "author": "soopadook",
        "title": "Why do Netflix anime English dub captions never match?",
        "content": "\n(Yes Japanese audio is usually better, but sometimes I want to watch the show while doing other stuff, and the English dub helps because I can still know whats going on without having to read subtitles. And I like subtitles with the dub because sometimes I like to read, it helps me with comprehending the plot)\n\nOn a lot of anime series on Netflix, the English captions simply don’t match up with the English dub. For this reason it’s very distracting to watch with English captions over English dub, which basically means that English captions are useless without Japanese audio. \n\nThis seems like such a huge and obvious oversight and design flaw.  Like a big deal. Like a cheeseburger without cheese. I assume it’s this way because the English captions are translated from the original language, but like, it’s such a huge flaw and it seems so damn lazy. Wouldn’t it be super simple to hire someone to re-do the captions to the actual dub? Or even cheaper just get AI to transcribe the dub and fix the small mistakes by hand??? Why are they all like this? Is there a good reason that Netflix anime is so flawed in this way, other than laziness? And it’s not a small flaw by any means; it makes the English caption/dub combo useless, because it’s so distracting. They are dramatically different a lot of the time. That seems like a huge UX issue.\n\nA lot of other shows and movies are not like this; the dub matches up perfectly with the subtitles.\n\nIt’s been like this for years too. I just started a new anime after not watching for a while and, surprise surprise, i can’t watch English dub with captions because they don’t match??? Like hello??",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p8wdle/why_do_netflix_anime_english_dub_captions_never/"
    },
    {
        "id": "1p8twjl",
        "author": "N3DSdude",
        "title": "Is anyone else getting crazy buffering on the new season of The Stranger Things right now?",
        "content": "Trying to watch Episode 1 and it keeps dropping quality to like 480p or just freezing completely.\n\nI ran a speed test and my internet is fine (getting 500 down), so it's not my connection.\n\nIs Netflix melting because everyone is watching at once? or is it just me? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p8twjl/is_anyone_else_getting_crazy_buffering_on_the_new/"
    },
    {
        "id": "1p91q65",
        "author": "Wonderful-Pick-3408",
        "title": "Streaming apps giving me choice paralysis!",
        "content": "Anybody else has this weird indecisiveness when it comes to choosing what to watch? \n\nI mean all these flashy thumbnails and yet so much confusion.\n\nHow do you guys decide?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p91q65/streaming_apps_giving_me_choice_paralysis/"
    },
    {
        "id": "1p8m5hz",
        "author": "-H3110_W0R1D-",
        "title": "Thoughts on Stranger Things 5?",
        "content": "I'm only two episodes in as of now, but I think it's pretty great. Of course there's the inevitable time-skip to compensate for the actors aging, but I don't really see it as that big of a deal. I was scared I wouldn't remember anything from the previous seasons considering how long it took, but I guess Stranger Things is just one of those shows where once you pick it back up, you suddenly remember everything. Again, I'm only two episodes in right now, but so far, I like it a lot. It could be that I've been starved of any Stranger Things content for a while now, but it's just nice to watch it again. In episode one I got so scared cause I thought they just killed off Dustin. They for real had me concerned. Besides that, I'm enjoying it. What do you think?",
        "upvotes": 11,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1p8m5hz/thoughts_on_stranger_things_5/"
    },
    {
        "id": "1p90vd7",
        "author": "justheretogossip",
        "title": "psa: if you had buffering during the stranger things drop, might not be netflix",
        "content": "seeing a lot of posts about buffering and quality issues from yesterday and wanted to share something that might help\nnetflix actually boosted their bandwidth by 30% for the premiere so if you're still having problems it's probably not on their end. lot of isps throttle streaming traffic during big events because so many people are online at once\neasiest way to test if it's your isp: i was having the same problem and tried connecting through purevpn and it instantly fixed it. if that works for you then you know it's your internet provider slowing things down not netflix struggling\nfigured this might save someone the frustration i went through yesterday. took me 2 hours to figure out what was happening lol",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p90vd7/psa_if_you_had_buffering_during_the_stranger/"
    },
    {
        "id": "1p8i9eo",
        "author": "JustAcivilian24",
        "title": "Stranger Things skipped an episode",
        "content": "Did season 5 skip an episode for anyone else last night? My wife and I were binging it last night and it went from episode 2 right to episode 4. Didn’t know until episode 4 was finished so we brought up the episodes and the show just straight up skipped episode 3. ",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p8i9eo/stranger_things_skipped_an_episode/"
    },
    {
        "id": "1p8zjaa",
        "author": "lynch527",
        "title": "Windows 11, Nvidia 5080, AW3423DW- can't get HDR with Netflix Premium.",
        "content": "I've tried the Edge browser and the Netflix app from windows store.\n\nInstalled \"HVEC Video Extensions\" from Microsoft store.\n\nDisable/Enabled Widevine DRM(disabling stops Netflix from playing videos),\n\nEnabled playready DRM\n\nTried \"force color profile\" to \"scRGB linear (HDR when available)\" and HDR10\n\nCouldn't find a way to disable Graphics or Hardware acceleration in Edge.\n\nUpdated NVidia drivers. Nvidia says GPU and Display are HDCP Capable.\n\nSet \"Override to reference mode\" in nvidia control panel, it was Current color accuracy mode: Enhanced before. Color settings are default in Nvidia under \"Change Resolution\".\n\nI've switched HDR on/Off in Windows and tried alternating setting above and Netflix always has HDR: false.\n\nIn Display/HDR  i eneabled \"allow HDR video streaming even when hdr is off\"\n\nNot sure what else to try. Any advice would be great!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p8zjaa/windows_11_nvidia_5080_aw3423dw_cant_get_hdr_with/"
    },
    {
        "id": "1p8yulk",
        "author": "Nokomis_Feather",
        "title": "Paying for an extra member but they can only watch on 1 tv in their house",
        "content": "I have Netflix Premium. I pay for our 'household', and pay an additional member cost for my widowed sister who lives 10 miles away. She has always been able to watch Netflix in both her living room, and her bedroom.   \nAbout a month ago, when she would attempt to log in, it tells her the tv is not in the 'household'. After trying various things, we were able to get her logged back in on her tv in the living room. It was trail and error as we mistakenly made her location the 'household' and I lost access here at my home. Now she has discovered that she is unable to sign into Netflix on the tv in her bedroom at all. Same 'device not in household' message.   \nFrom what I am reading in Netflix help center, she should be able to access Netflix on any device at her address under her wifi because I pay for her to do so.   \nIve seen 100s of 'help' articles all discussing how to reinstate a device at the main household location, but nothing addressing the extra paid member having issues logging in on more than 1 tv.   \nHas anyone else ran into this, and can you offer advise on what we are doing wrong, or not doing to reinstate both of her tvs into the network I pay for?  \nShe still shows up on my Netflix home page as part of my membership. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8yulk/paying_for_an_extra_member_but_they_can_only/"
    },
    {
        "id": "1p8xasi",
        "author": "ConstantDesigner4783",
        "title": "To get Hindi dubbed webseries or download",
        "content": "Is there any way to download or getting webseries like billions, undercover billionaire in hindi dubbed. As  I am getting it in English audio only. I want to watch in hindi.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8xasi/to_get_hindi_dubbed_webseries_or_download/"
    },
    {
        "id": "1p85fl1",
        "author": "Worried-Struggle2788",
        "title": "Anything on Netflix similar to Mr. Robot",
        "content": "I just finished rewatching Mr. Robot and it reminded me how good that style of show is. The mix of tech, paranoia, social commentary, and all the weird psychological stuff hits different compared to most series out right now.  \n  \nI checked Netflix but their recommendations felt kind of random and not really in the same vibe. Before I start scrolling for an hour, is there anything on Netflix with a similar feel? Something with hacking, underground groups, heavy atmosphere, or that same kind of tension where you never fully know who to trust.  \nI am not expecting a perfect match since Mr. Robot is pretty unique, but anything close in tone or theme would be solid. Would appreciate any suggestions from people who watch the same kind of shows.",
        "upvotes": 62,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p85fl1/anything_on_netflix_similar_to_mr_robot/"
    },
    {
        "id": "1p8mrp7",
        "author": "claire_luna_25",
        "title": "the beast in me",
        "content": "am i the only one who wanted Nile to come out winning in the end? \n\nmaybe it’s just me but sometimes if the show paint the “villain” well enough, i want them to get away with it. this is probably an unpopular opinion but i felt the same about joe from the show You. and for same with. cersei in GOT. \n\nplz tell me there’s more of you villain lovers out there ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p8mrp7/the_beast_in_me/"
    },
    {
        "id": "1p8v8xy",
        "author": "riky7ppp",
        "title": "Quality on android app",
        "content": "Hi, I have a samsung Tab S8 Ultra and the premium account, but the video quality is limited to 1080p, while on other streaming apps I can watch films up to 4K. The tablet supports 4K and has L1 widevine, so I don't understand why I can't play in 4K quality. Any help?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8v8xy/quality_on_android_app/"
    },
    {
        "id": "1p9427o",
        "author": "Wooden-Smell5816",
        "title": "Being Eddie Review: Netflix Dropped the Ball &amp; Here’s Why",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p9427o/being_eddie_review_netflix_dropped_the_ball_heres/"
    },
    {
        "id": "1p8r1vy",
        "author": "smobert",
        "title": "You know what netflix needs ?",
        "content": "Been thinking about the sea of unfinished shows, the one maybe two-season cliffhangers. There are two things that should happen that add to the long-term value of the network.\n\nIt's just too hard to be sure what will work. It's why cable did pilots.\n\nWhy can't streaming platforms have pilot seasons, maybe two a year? Perhaps they even change each month. They can produce a sitcom pilot season on say march, a sci-fi fantasy series in november, an anime month, a game show month, etc. Have a few of these a year for different sections, see what's popular and work from there. \n\nThey can make a big deal of it, such as voting and public engagement. People are watching to see what gets funded for a full season. There is potential for some actual sitcoms that people want to watch. \n\nThen, on the other side of the coin, a commitment to finish what they start. Mini-series, three episodes for any Netflix show to finish off their stories. Then nothing feels like a wasteland, as even if a show is cancelled, you know it will get wrapped up with perhaps quite limited funding. \n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p8r1vy/you_know_what_netflix_needs/"
    }
]