[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jchy01",
        "author": "NellyNoo2000",
        "title": "Adolescence - one shot q&amp;a",
        "content": "Loved this thread on Netflix UK &amp; Ireland Twitter page about how they filmed the show.\n\nI was fascinated by the one shot episodes &amp; this q&amp;a answered most of my questions. Hopefully it answers yours too",
        "upvotes": 104,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jchy01/adolescence_one_shot_qa/"
    },
    {
        "id": "1jcoxfo",
        "author": "Internal-Bed-3150",
        "title": "Adapting The Magician's Nephew first will make problems for Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jcoxfo/adapting_the_magicians_nephew_first_will_make/"
    },
    {
        "id": "1jcbf3z",
        "author": "Objective-Effort-614",
        "title": "Black Mirror",
        "content": "Looks like a new season is coming out soon. What’s your favorite episodes? Some of them are great and some are not so good. \n\nThinking about rewatching some episodes. Suggestions welcome. ",
        "upvotes": 51,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1jcbf3z/black_mirror/"
    },
    {
        "id": "1jcnofv",
        "author": "VirtualOutsideTravel",
        "title": "Netflix cancelled my membership after inability to charge new CC card",
        "content": "Now the price is showing as a higher price when i go to sign up again. I've always been a big fan of the service but refuse to rejoin at a higher price for no reason. Thats a totally good business plan (not). I had to switch CC cards due to a fraudulent activity on my old card. For some reason Nflix didn't accept my new CC card even though it works fine on other websites. Smart business plan, cancel paying customers for no reason.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jcnofv/netflix_cancelled_my_membership_after_inability/"
    },
    {
        "id": "1jciagd",
        "author": "bbportali",
        "title": "Looks like Adolescence has very good ratings and might be worth a watch as a mini series",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jciagd/looks_like_adolescence_has_very_good_ratings_and/"
    },
    {
        "id": "1jcpj95",
        "author": "Mental_Sherbet8768",
        "title": "Was there any significance to the scene when the police arrived to arrest Jamie and he had a little accident?",
        "content": "I'm talking about adolescence—when the police wrecked the Miller house to arrest Jamie. When he got up from bed, he had wet himself that night. Was that the aftereffect of what he did that night or was it meant to show how vulnerable he still was—that despite committing the most heinous crime, he was still just a boy?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcpj95/was_there_any_significance_to_the_scene_when_the/"
    },
    {
        "id": "1jcp6kk",
        "author": "Mental_Sherbet8768",
        "title": "How much time do you think Jamie will serve in the Adolescence after pleading guilty in court?",
        "content": "As far as I know, serving time for juveniles in the UK depends on the pleasure of His Majesty. Jamie is very young, but he committed the most heinous crime possible and showed no remorse. For the first two episodes, I was convinced by him—even after seeing his clip—that he didn’t do it, that it must have been some mistake. In most countries, for a crime like this, juveniles are kept in detention until they turn 18 or 21, with the possibility of an extension depending on the severity of the crime. So, what do you think Jamie's case would be?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jcp6kk/how_much_time_do_you_think_jamie_will_serve_in/"
    },
    {
        "id": "1jcelo9",
        "author": "OkTime3175",
        "title": "“Adolescence” pictures of kids in the intro?",
        "content": "Does anyone know the meaning behind the pictures of the kids in the intros for adolescence? I found it so eerie with the soundtrack but I can’t see how they link to the actual show ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcelo9/adolescence_pictures_of_kids_in_the_intro/"
    },
    {
        "id": "1jcele2",
        "author": "CortaCircuit",
        "title": "\"Sorry, something went wrong. Please try again later.\" Unable to sign up... this happens every time I try and reset my password or I try and add a payment method...",
        "content": "I have contacted Customer Service. They say it should go away within a couple days. Well it has been about two weeks since I last tried and it is still happening...\n\nAnyone had this error, how do you get around it?\n\nI had originally signed up fine. I was charged on my credit card, then two days later Netflix cancels my membership and refunds my payment. Now I can't do anything.  \n",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcele2/sorry_something_went_wrong_please_try_again_later/"
    },
    {
        "id": "1jc7b8c",
        "author": "FearlessDirection129",
        "title": "Hot Take: Shows like The Ultimatum/ Temptation Island are a recipe to Disaster for people in the show",
        "content": "Although fun to watch drama as a viewer, i don't understand how couples are brave enough to sign up for such shows when they are 99% sure they will break up after.\n\nSomethimes I think couples shown were never together and made up for the show for drama that is supposed to happen.\n\nAlso Netflix controls the view angle of the show so they can sabotage a career of any person and no one would trust them ever with thier actions shown on the show. Although they all still become instant celebs after premiere.\n\nWhat do you guys think?",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jc7b8c/hot_take_shows_like_the_ultimatum_temptation/"
    },
    {
        "id": "1jclfpe",
        "author": "Unlucky-Better",
        "title": "Every time I try to play a movie it's stuck on loading. Even if I download the movie it won't play and only get stuck on a black screen. My family members don't have this problem on their phones.",
        "content": "How do I fix this? I have tried everything I have seen. Restarting my device, changing networks, clearing cache, uninstalling and reinstalling Netflix and other stuff. I just wanna watch some movies bruh 😭😭🙏🙏",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jclfpe/every_time_i_try_to_play_a_movie_its_stuck_on/"
    },
    {
        "id": "1jc9ick",
        "author": "Worn-Out__Wishes",
        "title": "Please suggest disturbing / horror movies/shows/ documentaries!",
        "content": "What i have watched- \n\nDahmer \nAdolescence \nBlack mirror\nThe haunting of bly and hill house\nGacy tapes\nHouse of usher \nGabriel Fernandez doc\n\nBack on Netflix after a few years and would love some new recommendations. Thank you 🙏🏼 \n",
        "upvotes": 11,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9ick/please_suggest_disturbing_horror_moviesshows/"
    },
    {
        "id": "1jbq59u",
        "author": "Liquid_Lunch_1991",
        "title": "Adolescence",
        "content": "It takes a lot for a show/movie to upset and unsettle me and I wanna say with total honesty this show completely and utterly fucked my shit up. I admire the audacity of the filmmaking and writing and omg the acting is incredible, but seriously….this is the first time I’ve ever watched something I wished I could unwatch\n",
        "upvotes": 184,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1jbq59u/adolescence/"
    },
    {
        "id": "1jbs898",
        "author": "S4v1r1enCh0r4k",
        "title": "[Trailer] Netflix's New 'Bad Influence' Docuseries Explores the Dark Side of Kid Influencers",
        "content": "",
        "upvotes": 108,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jbs898/trailer_netflixs_new_bad_influence_docuseries/"
    },
    {
        "id": "1jcgp48",
        "author": "Rraai",
        "title": "How do I remove gaming apps recommendations in the netflix main page of the web browser?",
        "content": "I installed a game from Netflix that was in the Appstore and now everytime I go on Netflix through my PC on the web browser it recommends me apps in the main page and it's pissing me off because I use it as a streaming service, I do not care about games that don't even run on that platform.\n\nAnybody knows how can I remove them?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcgp48/how_do_i_remove_gaming_apps_recommendations_in/"
    },
    {
        "id": "1jc7x3q",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Cobra Kai Finale",
        "content": "Finished the final season of Cobra Kai recently and have to admit I'll miss it on Netflix as it was one of the better shows available on the streamer. While the dialogue may not be great and the plot can be very clichéd it also had some great humour especially from William Sabka as Johnny Lawrence. The young cast were also very reliable and it had some great recurring characters especially Paul Walter Hauser as Stingray. The fight scenes were well choreographed and it was nice to see so many of the cast from the older movies return. I wouldn't be surprised if there is a spinoff too considering how popular it was.",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jc7x3q/cobra_kai_finale/"
    },
    {
        "id": "1jca4hd",
        "author": "MamaMia1325",
        "title": "Younger",
        "content": "I hadn't ever heard of this show until about a month and a half ago. I absolutely love it. I'm sad that there are no more seasons. What are some similar shows to this? They don't have to be on Netflix, they can be on any streaming service. (tia). ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jca4hd/younger/"
    },
    {
        "id": "1jc9r94",
        "author": "EbbPhysical7246",
        "title": "Student survey: help me out!!",
        "content": "https://forms.gle/T5VzHoG7hBJvbkrh8\n\nNeed as many responses as possible for a class project- thanks!!!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9r94/student_survey_help_me_out/"
    },
    {
        "id": "1jby2iq",
        "author": "TheMirrorUS",
        "title": "Virgin River's Martin Henderson confesses one thing he 'hates' about Netflix drama as season 7 filming begins",
        "content": "",
        "upvotes": 28,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jby2iq/virgin_rivers_martin_henderson_confesses_one/"
    },
    {
        "id": "1jcha8e",
        "author": "According-Beyond-274",
        "title": "Eliab Gets Grounded Was Streamed On Netflix (Fanmade)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6nkty3dmm0pe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jcha8e/eliab_gets_grounded_was_streamed_on_netflix/"
    },
    {
        "id": "1jcb35y",
        "author": "No_Tune_7240",
        "title": "Pin entry is no longer hidden",
        "content": "Does anyone else have this problem?\n\nUp until a day or so ago, when I typed in my PIN number on my tv remote, the numbers were discrete on the screen and you wouldn't know which numbers were being entered.\n\nNow, the number being entered is highlighted as soon as I select it.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcb35y/pin_entry_is_no_longer_hidden/"
    },
    {
        "id": "1jccxm3",
        "author": "Ok-Algae-1661",
        "title": "How can I select the image quality?",
        "content": "I have ethernet plugged in, very good speed, yet sometimes Netflix still decides to show me lower qualities with no way to force my preference...why??? How do I stop this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jccxm3/how_can_i_select_the_image_quality/"
    },
    {
        "id": "1jccnnr",
        "author": "Independent-Waltz258",
        "title": "Buffer and glitch",
        "content": "For the past year or so, between all my devices while watching anything it'll buffer, then glitch out randomly. \n\nBeing one of the oldest streaming services,  it's definitely one of the most frustrating and unreliable. This is also between my roku tv, fire tv, on my Galaxy S23, laptop... \n\nAnyone have any fixes besides setting off an emp and just frying everything, calling it good?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jccnnr/buffer_and_glitch/"
    },
    {
        "id": "1jbk6vh",
        "author": "BlogEraForever",
        "title": "Why have I never heard of the show Unreal?",
        "content": "I thought I had scoured every corner of Netflix, but there is an old show called Unreal that is actually insanely good. The premise is arguably dumb - a drama focused on the production team behind the scenes of a reality show a-la the bachelor, but the writing and acting is so good. Do people know about this show??",
        "upvotes": 98,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1jbk6vh/why_have_i_never_heard_of_the_show_unreal/"
    },
    {
        "id": "1jc3a10",
        "author": "timm20017",
        "title": "Jacket worn by Stephen Graham in Adolescence",
        "content": "Anyone have a link to it or its name/colour?\n\nBeen googling for a while and can't find it!\n\nIt was the light blue canada goose one in episode 4, unsure of the exact colour and style/name\n\n Thanknyou in advance         \n",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jc3a10/jacket_worn_by_stephen_graham_in_adolescence/"
    },
    {
        "id": "1jc9edh",
        "author": "Smurfritow",
        "title": "Where the episodes between 2 and 5 go...",
        "content": "Was watching \"The Cage\" and after finishing the second episode it felt off. After looking about why i found out that episode 3 and 4 were missing and therefore i was sent to episode 5 right away. Anyway to fix this? \n\nhttps://preview.redd.it/4a1nay0m5yoe1.png?width=1248&amp;format=png&amp;auto=webp&amp;s=ca0a211b54ee516796e1efaaf9cebf27ba8bb7b4\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9edh/where_the_episodes_between_2_and_5_go/"
    },
    {
        "id": "1jbk4fc",
        "author": "MindToxin",
        "title": "Why can’t Netflix afford better English speaking voice actors?",
        "content": "Even though Netflix has so many great foreign language movies, the English voice acting is always so terrible that I can’t stand watching them with English audio on. The movies are so much better in their original foreign language audio with just reading the English subtitles!\n\nHow can a company like Netflix not be able to get better English voice actors? \n\nDoes anyone else feel the same? Are there any really good foreign language movies on Netflix that actually have good English voice actors? If so please give movie titles! \n",
        "upvotes": 47,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1jbk4fc/why_cant_netflix_afford_better_english_speaking/"
    },
    {
        "id": "1jc643p",
        "author": "TheTornado121",
        "title": "Probkems with new LG TV",
        "content": "I'd really need some help.\nGot a brand new LG 65QNED85T6C Smart TV. All streaming apps work perfectly fine but Netflix doesn't work at all. No problems on startup and login but the streams don't work.\nThe previews are either black or completely glitched, the streams themself glitch out, buffer, glitch out, and so on. \nInternet speed is 140 Mbit (in Netflix app)\nThe Infobox during stream shows 0.3 Mbit / 720p / Codec AV1\n\nOn my second TV (also LG) there are absolutely no problems and the box shows 1.1 Mbit / 720p / Codec HEVC\n\nMaybe the codec is the problem? But is there something i could do? Or any other guesses?\n\nEDIT: Yeah typo in title.... embarrassing... ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jc643p/probkems_with_new_lg_tv/"
    },
    {
        "id": "1jbpt8x",
        "author": "Royal-Principle6138",
        "title": "Adolescent",
        "content": "Ooh only seen the first episode so no spoilers please but my god what some amazing actors Stephen Graham really is an incredible actor and the child is amazing great story ",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jbpt8x/adolescent/"
    },
    {
        "id": "1jb65cs",
        "author": "Internal-Bed-3150",
        "title": "Daniel Craig in talks to join the Narnia Netflix movies",
        "content": "",
        "upvotes": 258,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jb65cs/daniel_craig_in_talks_to_join_the_narnia_netflix/"
    }
]