[
    {
        "id": "1hlsind",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (A Complete Unknown / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n**Nosferatu discussion coming on the 25th @9pm CST**\n\n**Babygirl discussion coming on the 25th @9pm CST**\n\n# Streaming Releases\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hlsind/official_discussion_megathread_a_complete_unknown/"
    },
    {
        "id": "1hk2j4a",
        "author": "HeavierTrip",
        "title": "Hello! We're Jukka Vidgren and Jusso Laatio, writers/directors of HEAVIER TRIP, a comedy about death metal band Impaled Rektum and sequel to 2018's cult hit HEAVY TRIP. Ask us anything! We'll be back to answer your questions Monday 12/23 at 12 PM ET!",
        "content": "",
        "upvotes": 90,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/88lpt1otkf8e1.jpeg?auto=webp&amp;s=ae4d66a7e5a236000053603d5f0a81e11005305a"
        },
        "permalink": "/r/movies/comments/1hk2j4a/hello_were_jukka_vidgren_and_jusso_laatio/"
    },
    {
        "id": "1hm9x4y",
        "author": "MarvelsGrantMan136",
        "title": "Hudson Meek, Actor Who Played Young Baby in ‘Baby Driver’, Dies at 16 After Falling from Moving Vehicle",
        "content": "",
        "upvotes": 2929,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kQlFpZXFvgRDbUPzVkgeu28XEXExAySYEYwu6jyryBM.jpg?auto=webp&amp;s=f3a89059170eb1c5dce60cb74002af7a6b953d2c"
        },
        "permalink": "/r/movies/comments/1hm9x4y/hudson_meek_actor_who_played_young_baby_in_baby/"
    },
    {
        "id": "1hm39va",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Love Me’ Starring Kristen Stewart &amp; Steven Yeun - A postapocalyptic romance in which a buoy and a satellite meet online and fall in love after the end of human civilization",
        "content": "",
        "upvotes": 8959,
        "comments": 775,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gr5jqbtip09e1.jpeg?auto=webp&amp;s=63aa733713272f00ce6555cce07b725dbf90c129"
        },
        "permalink": "/r/movies/comments/1hm39va/official_poster_for_love_me_starring_kristen/"
    },
    {
        "id": "1hm4fp4",
        "author": "chrispdx",
        "title": "Happy Gilmore 2 Teaser (Netflix)",
        "content": "",
        "upvotes": 2549,
        "comments": 535,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QC7J0U1LuED3-Jsw2qcPOlxLgZCS2bC5QAOVM8pIJM8.jpg?auto=webp&amp;s=641c7b9cc91caf33fbcaefd32020f2b1c22a938f"
        },
        "permalink": "/r/movies/comments/1hm4fp4/happy_gilmore_2_teaser_netflix/"
    },
    {
        "id": "1hmb9ms",
        "author": "davidmitchellseyes",
        "title": "Violent Night (2012) is the sleeper hit I didn't know I needed ",
        "content": "I got it mainly because it was filmed in my city and I generally like David Harbour. Holy moly did it exceed my expectations. Yknow how so many holiday themed movies don't do enough with the holiday specifics? This is not that.\n\nIt's like they made a point to inject christmassy elements everywhere they could. It's funny without being cringe. The violence, gore, and fighting it filmed expertly. The dialogue and acting is great. The score is SUPERB. Cinematography and editing is beautifully handled. Every character has something to do. I can't recommend it enough and it's now in the yearly Xmas rotation for sure.\n\nIf you like dark comedy action Xmas movies, do yourself a favour!",
        "upvotes": 524,
        "comments": 130,
        "media": null,
        "permalink": "/r/movies/comments/1hmb9ms/violent_night_2012_is_the_sleeper_hit_i_didnt/"
    },
    {
        "id": "1hm1kod",
        "author": "Bennett1984",
        "title": "Sherlock Holmes at 15: The Story Behind Guy Ritchie's Reimagining of the Baker Street Super Sleuth",
        "content": "",
        "upvotes": 1956,
        "comments": 211,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6FJX0_8247i4QNGu44q04tgxC7t-UsgUZ7nuPmSu1nw.jpg?auto=webp&amp;s=648397a7c67d32e99c67d8d5527239b3fac01583"
        },
        "permalink": "/r/movies/comments/1hm1kod/sherlock_holmes_at_15_the_story_behind_guy/"
    },
    {
        "id": "1hmbiqz",
        "author": "Agreeable-Divide-150",
        "title": "Scorsese finally suceeded in deglorifying the mafia with \"The Irishman\" and I think it being slow is part of the message",
        "content": "Frank is only an assoiciate in the mob, a trusted and clealry special associate, but that's all he'd ever be. This is a far more common position than the guys Scorsese has shown in prior mob movies, and Frank's life reflects that. He doesn't have a sugar bowl full of coke in his bedroom, he doesn't own a yacht, his quality of life only marginally improves once he's killing and enforcing for a living. \n\nInstead of Frank's 'protectiveness' for his family being deified in a heroic scene where he beats up the guy who attacked his girlfriend, instead he drags his daughter down to the store so she gets a good look at Frank breaking a guys hand just because he pushed a girl acting up. And of course he can hardly understand why his daughters want nothing to do with him as an old man, it's not just for killing Jimmy Hoffa as they suspect/knew he did, it's because as kids they could never tell him about a teacher who was being unfair or a bully because he'd probably just make them watch as he murdere them. The insane violence that's a part of his career doesn't make him seem strong to his kids, he looks scary and dangerous because he is.\n\nAnd in the end what does his loyalty get him? Does he get what Vito Corleone got, dying peacefully at a ripe age surrounded by family and friends? No, he dies alone and forgotten because he murdered his friend for his boss, and he won't even tell his friend's kids what he did with the body even though there's nobody left to know he snitched. Frank gets a long lonely death because he was too shortsighted and ignorant to stay away from organized crime for his family's sake.",
        "upvotes": 327,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1hmbiqz/scorsese_finally_suceeded_in_deglorifying_the/"
    },
    {
        "id": "1hm9opx",
        "author": "Level-Lecture9178",
        "title": "Nardwuar vs Timothée Chalamet",
        "content": "",
        "upvotes": 183,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yiKTWoHGy-KyyiaAGE8u-x3ozbOFVMw3a48D9spokiI.jpg?auto=webp&amp;s=4a88516bcca2c5178386f79758b642eee55c004a"
        },
        "permalink": "/r/movies/comments/1hm9opx/nardwuar_vs_timothée_chalamet/"
    },
    {
        "id": "1hmbftn",
        "author": "SanderSo47",
        "title": "Francis Ford Coppola’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 121,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qRI5ZWin2kH5wBGN2PSWjfB4ImfiY2hqvphUAAgz53A.jpg?auto=webp&amp;s=6eb716b986d6ba8514231f5ab12a320cec076ec2"
        },
        "permalink": "/r/movies/comments/1hmbftn/francis_ford_coppolas_criterion_movie_closet_picks/"
    },
    {
        "id": "1hm5c78",
        "author": "RhesusWithASpoon",
        "title": "Amadeus 4k Blu-ray is finally coming out and they're now taking preorders. Feb 25, 2025 release.",
        "content": "",
        "upvotes": 288,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gB2m_nAG2SPaviWN6t1fl-CSFPb_K8a0yf_Eh0484bw.jpg?auto=webp&amp;s=1701b1af65e514845b1af45770f9f1d029a8fd7e"
        },
        "permalink": "/r/movies/comments/1hm5c78/amadeus_4k_bluray_is_finally_coming_out_and/"
    },
    {
        "id": "1hm21t7",
        "author": "MollyMoviola",
        "title": "Mad Max Beyond Thunderdome is sheer insanity. Tina Turner rarely acted but when she showed up, you noticed.",
        "content": "It is unfortunate Tina Turner didn't act more because she was genuinely good in movies. I'm still bitter she said no to The Color Purple though I understand why, because she said she already lived through it. \n\nMad Max Beyond Thunderdome is generally seen as the weakest Mad Max movie of the series but I happen to love it, just not as much as Road Warrior and Furiosa. \n\nI liked the arc of Max ending up in Aunty Entity's territory and being forced to fight against another bad guy and becoming kind of a Guardian to a group of lost children who live under the hope of a desired, fantasy land. \n\nThe train sequence is incredible. Tina Turner is spectacular as Auntie Entity: strong, fearsome, bold. I wish we got to see Auntie fight Max in the movie, we rarely see her do much, but when she gets into action, you realize how powerful she is, like when she jumps from her bike into the moving train. \n\nMel Gibson was great as usual as Max. He's a bit more tolerant than usual. The kids didn't bother me because they weren't trying to be cute and cloying, they're more like the kids from the Lord of the Flies (without the turning homicidal part). Helen Buday is particularly adequate as Savannah Nix, the older kid who rebels against Max.",
        "upvotes": 316,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1hm21t7/mad_max_beyond_thunderdome_is_sheer_insanity_tina/"
    },
    {
        "id": "1hm4ebp",
        "author": "hekenwkskdn777728",
        "title": "Exclusive clip from ‘THE MONKEY’",
        "content": "",
        "upvotes": 172,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mrysrKn8Gl1cdovojEwp40RdeC08JGrsOkrnG1uq5QE.jpg?auto=webp&amp;s=bd1b9f0b3e2bd3ed9200e0a6c24fbd6e9ba9ecc6"
        },
        "permalink": "/r/movies/comments/1hm4ebp/exclusive_clip_from_the_monkey/"
    },
    {
        "id": "1hlyk1b",
        "author": "Puzzled-Tap8042",
        "title": "‘The Peanut Butter Falcon’ Writers Directors Tyler Nilson and Michael Schwartz are Currently Developing a New Take on Treasure Island for Disney.\n",
        "content": "",
        "upvotes": 535,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rX39z9zaOi4COzgrPfmforrQ9Wc5oIeoy8hlyG3cgXQ.jpg?auto=webp&amp;s=13d9708149644806551725bb4e57d02bfe333545"
        },
        "permalink": "/r/movies/comments/1hlyk1b/the_peanut_butter_falcon_writers_directors_tyler/"
    },
    {
        "id": "1hltzum",
        "author": "No-Zookeepergame5954",
        "title": "Movies with an opening scene that is vastly superior to the rest of the film?",
        "content": "To me, what comes to mind is La La Land.\n\nDon't get me wrong, I think it is a very good movie. But by far, the best scene (in my opinion) is the opener of \"Another Day of Sun.\" The singers and dancers are stronger than Emma Stone and Ryan Gosling and the camerawork is simply on a whole other level than the rest of the film.\n\nWhat other films fit this criteria of having a decline (slight or massive) after the opening scene?",
        "upvotes": 1404,
        "comments": 1772,
        "media": null,
        "permalink": "/r/movies/comments/1hltzum/movies_with_an_opening_scene_that_is_vastly/"
    },
    {
        "id": "1hm4d43",
        "author": "MusingsOnLife",
        "title": "Josh Horowitz invites Justin Long (Brandon) and Sam Rockwell (Guy) for the 25th anniversary of GalaxyQuest",
        "content": "",
        "upvotes": 127,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uim_Ue97nMwtQtBPvcysnx6-4P-E0wUp6lBnxDwzL2g.jpg?auto=webp&amp;s=34818d8e9c3a6cf1e86faaf8715b8a74a0ded4ff"
        },
        "permalink": "/r/movies/comments/1hm4d43/josh_horowitz_invites_justin_long_brandon_and_sam/"
    },
    {
        "id": "1hm91b2",
        "author": "Zhukov-74",
        "title": "Making of Disney's 20,000 Leagues Under the Sea (1954)",
        "content": "",
        "upvotes": 53,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6RPbAE-y_j0AmV8c7XDBQtqRJ4LNHVKWXePid22RDys.jpg?auto=webp&amp;s=c1a8f34e5ec90b37a8f29c0d8f7700249a29e170"
        },
        "permalink": "/r/movies/comments/1hm91b2/making_of_disneys_20000_leagues_under_the_sea_1954/"
    },
    {
        "id": "1hluoh6",
        "author": "mattybgcg",
        "title": "Aerosmith showing up at the end of Polar Express is highly jarring",
        "content": "We've watched this a handful of times now with the 7yo, and this movie has gotten better with multiple viewing. I haven't seen the end more than once or twice due to sleep, and every time I do and Aerosmith shows up, it's from way out of left field. I know the animation turns a lot of people off and it's one of the things I've learned to accept, but Aerosmith really takes me out of it. ",
        "upvotes": 800,
        "comments": 250,
        "media": null,
        "permalink": "/r/movies/comments/1hluoh6/aerosmith_showing_up_at_the_end_of_polar_express/"
    },
    {
        "id": "1hm8eqx",
        "author": "dactoo",
        "title": "I made a game that’s basically Wordle for movies",
        "content": "Hey r/movies,\n\nMy family loves those Wordle type guessing games, and someone had the idea to make one for guessing the movie of the day, so I went ahead and made it since I'm a programmer by trade. I think it's pretty fun and can be very challenging!\n\nI'm aware there are a million, \"guess the movie from the screenshot\" games. This isn't one of those. It's more similar to Spotle, if you're familiar with that.\n\nI was told you all might like to play it, so here I am, hopefully not breaking the rules with this post! It's called [Movizzle](https://movizzle.com). I hope you enjoy it!",
        "upvotes": 48,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JwC1rBL80Xk-ZQV0Vy5BWKuUGW413lvoXZ9GalPhNzY.jpg?auto=webp&amp;s=503aad9e13ac4eaa8578ab7e6713401be31e80ee"
        },
        "permalink": "/r/movies/comments/1hm8eqx/i_made_a_game_thats_basically_wordle_for_movies/"
    },
    {
        "id": "1hm9khe",
        "author": "doyoulikemyladysuit",
        "title": "Anyone else only now realizing in your middle ages that the movies you grew up on, xmas/otherwise, were WILDLY dark?",
        "content": "Is it just me or were the movies those of us born 1970-1985ish grew up on insanely dark? Here were my favs, what gnarly films twisted your mind?\n\nI have spent all xmas eve and so far today watching my recent favorite holiday movies, as well as pulling up some of my childhood favs. I don't know if it was just MY fucked up childhood, or if this was universal for the late GenX/early millennials but I realized my xmas/overall movie experience has been WILDLY dark. How it got from light hearted cheer to seeing a clear cry to Mom and Dad for therapy at the ripe old age of 6 years old.....\n\n\n1) \"Rudolph\" - the obvious. He is barely born before his father is recoiling in disgust at his deformity; Santa is walking into the family cave like he owns it to scope out the newly enslaved community member; Rudolph is ridiculed and outcast for his physical deformity; Herbie is cast out for his ambition; there exists a prison colony for unique and imperfect toys and a creature is assaulted and removed of his ability to nourish himself without his consent, then leashed and domesticated against his will. \n\n2) \"A Charlie Brown Christmas\" - not much needed to be said: the amount of abuse, disdain, teasing and flat ridicule this child endures would prime him to become a school shooter these days. Let's be real. \n\n\nand this is where the turn for me begins...\n\n\n3) \"'Twas the Night Before Xmas\", 1974 animated: A story about a town whose letters from Santa are returned because of an anonymous letter to the editor signed \"from all of us\" that declares its disbelief in Santa. The child who wrote it expresses his cynicism and disbelief based on logic and reason, of Santa's magical abilities to visit every house in a single night. That child is then ultimately made to feel guilty and have the burden of ruining xmas for the whole town because he dared used critical thinking. \n\n4) \"Babes in Toyland\", 1986 film with Keanu Reeves and Drew Barrymore. Wizard of Oz style where Barrymore hits her head and ends up in a fantasy land where an evil  Baron seeks to take over Toyland, marry a young girl who is in love with Reeves' character, and generally be gross old and evil. Come to find out, the only obstacle in the way of saving Toyland is Barrymore &gt;! who realizes at 11 years old, she has had to grow up too fast and never felt she was able to really be a kid and enjoy/believe in toys and it's only until she believes in toys again that they can save Toyland.!&lt;\n\n5) \"A Christmas Memory\" (1997 Hallmark channel version) based on the autobiographical story by Truman Capote. When his parents split Buddy is sent to the Depression-era South to live with distant and aging cousins. One is strict and joyless; the other is intellectually challenged and becomes his closest friend. After living with them for a few years, they share their last xmas as he is sent by his parents to military school. &gt;!Over the year his aunt's letters become more confused, forgetful of who he is and she dies before they can share another xmas together.!&lt;\n\n6)  \"A House Without a Christmas Tree\", made for TV in 1972, set in 1946. A widowed father lives with his mother and daughter, his wife having died shortly after the first xmas they shared with their daughter. She is 10 years old and has never been allowed to have a xmas tree and the movie centers around her fight to have one this year. She expresses to her grandmother she does not believe her father even likes her, let alone loves her; that he won't even look her in the eye or hug her, or even talk to her. It takes her &gt;!giving away a tree she is given for free by her school for her father to realize he's been a cold, cruel and withholding father her entire life to actually give in, get a tree and talk to her for the FIRST time about her mother.!&lt;\n\n7) \"Prancer\" - I'm sure this is one many are familiar with - but in case not...Another widowed father is caring for his  8 year old daughter and older son at xmas. His business is struggling and is making plans to send his kids to stay with his sister for awhile. Meanwhile, Jessica, daughter, still believes in Santa, his reindeer (which gets her ridiculed and in turn causes her to dump her best friend for being \"agnostic\") and when she runs into a reindeer multiple times after the breaking of a decorative one in town, takes him in to nurse his injuries. She believes this is Prancer and in the end, &gt;!while trying to free Prancer from the cage he ends up in, busts her head open which is what makes her father decide he loves her too much to get rid of her, essentially.!&lt;\n\n\n...it was around then I realized it wasn't just confined to holiday movies. Some of my other favorites movies I watched on repeat were about as equally, if not moreso, fucked up.\n\n\n8) \"Savannah Smiles\" was about a young girl, neglected by her politician father, decides to run away and leaves a note on the park bench her aunt is to pick her up at. She instead slips into a nearby car that happens to belong to two escaped convicts. She befriends the men and her dad burns the note about her running away for fear of public embarrassment. Instead, he offers a $100k reward for anyone that would return her safely. The convicts see this is a great opportunity to make some money, but have to scheme how to do it without bringing attention to themselves and getting sent back to prison. &gt;!Before they get the chance, she gets lost in the Utah mountains and they go searching for her, ultimately finding her, exposing themselves and getting caught for the sake of her safety.!&lt;\n\n9) \"Man on the Moon\", a coming-of-age tale of a 13 year old girl who feels forgotten by her mother, held to too high of a standard by her father (and occasionally physically abused), left behind by her older sister and too responsible for her younger sister. She meets the new family in town that summer and develops a crush on one of the sons. &gt;!The summer ends in tragedy, though, when her crush dies in a farming accident.!&lt;\n\n10) \"When the Whales Came\", about two children who live hard, rustic lives on the Scilly Isles during World War 1 and befriend and odd old man called \"Birdman\". He lives on a secluded island that is considered cursed by the residents of the isles. &gt;!When narwhales begin beaching themselves en masse, the children and Birdman work together to save them and uncover the island's secret history while doing so, breaking the supposed curse.!&lt;\n\n11) \"The Adventures of Baron Munchausen\", a 1988 box office flop that my Dad totally took me to see in the theater at the ripe old age of 5, written (in part) and directed by Terry Gilliam centered on the tall-tales of an 18th-century German nobleman that is loosely based on the reali-life baron Hieronymus Karl Friedrich Freiherr von Münchhausen, while fighting against the Ottoman Empire. \n\n12) \"The Threepenny Opera\" - though not the 1931 not the 1989 version. Nah, my mom played one of the prostitutes in a summerstock version in 1986 (I was 3) and she got a recording of the performance. It was my second favorite from the time I was 3 to 5.\n\n13) \"Godspell\" - again, a summerstock production recording (same summer from Threepenny). Mom played the role of Sonia/ Mary Magdalene. Y'know, the prostitute in Jesus' posse. I didn't care so much about the god stuff, I just really dug the music and the whole liberal leaning, give charity, take care of each other, do unto others attitude was my pops whole thing. (Not Mom's so much, but she was about that music). This was my favorite from 3 - 7. \n\n14) The Last Unicorn, A lonely unicorn, believing she is the last of her kind. This animated movie explores &gt;!THE existential topic of mortality and what it is to live a mortal life/die.!&lt;\n\n15) The Dark Crystal, this dude thinks he is the last of his kind and decided to go find the shards of the dark crystal. This gem was supposedly what once brought balance to the universe, but once the gem was broken an evil race explored its shards. Dude figures if he can find the final missing share, he can bring peace back. Talk about ego, amiright?\n\n16) Labyrinth - I think we all know this, but a girls dad and stepmom go on a night in the town and force her to babysit when she had plans. Her fantasies of the goblin King get his attention (in an unfortunately illegal way) and the 40 something man kidnaps a toddler to trap the girl in a fantasy land to manipulate her into marrying him. &gt;!He fails, but the whole thing is creepy af, even if Bowie makes man tights sexy as hell.!&lt;\n\n\n\nSo, what weird-ass movies did you grow up watching that you look back now and think \"dude, parents - how the FUCK did you not see the years of therapy and/or outright rejection coming?!?!\n\nOn that note....Merry Xmas, ya filthy animals! ",
        "upvotes": 37,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1hm9khe/anyone_else_only_now_realizing_in_your_middle/"
    },
    {
        "id": "1hm3lj6",
        "author": "destructomofoyo",
        "title": "If you liked taken or John wick .. I implore you to watch 'the man from nowhere'",
        "content": "I honestly am not too big a fan of movies like John wick but man when they get it right ... \n\nThe movie is about a pawn shop owner who is an outcast type... Making a friendship with a little girl  who is neglected by her mother .. the mother gets in deep with some bad people and they kidnap the little girl... Pawn shop owner to the rescue... This synopsis does not do the film justice tho as for an action film it definitely made me feel alot ... Worth a watch",
        "upvotes": 96,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1hm3lj6/if_you_liked_taken_or_john_wick_i_implore_you_to/"
    },
    {
        "id": "1hlf0g2",
        "author": "Amaruq93",
        "title": "25 years ago, \"Galaxy Quest\" (a One-of-a-Kind Sci Fi comedy), captured the hearts of Star Trek fans everywhere",
        "content": "",
        "upvotes": 7315,
        "comments": 503,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4XqL8g8wUAl0kzgeuew3NBodGkq09e9LC9FKLuY65Ng.jpg?auto=webp&amp;s=1e0b6fdeddf27ce60af174a6cc9cbd8359a288e7"
        },
        "permalink": "/r/movies/comments/1hlf0g2/25_years_ago_galaxy_quest_a_oneofakind_sci_fi/"
    },
    {
        "id": "1hlxk1v",
        "author": "MollyMoviola",
        "title": "A sad scene from a Disney picture, \"The Rescuers\": Penny &amp; Rufus",
        "content": "",
        "upvotes": 165,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n5qVY35ZtlsHgw6hLGNPq71dwuiZXd6-CxdpnnLmc8Q.jpg?auto=webp&amp;s=fe1f94eda2daf68f61da00d975e5fdfe618716d4"
        },
        "permalink": "/r/movies/comments/1hlxk1v/a_sad_scene_from_a_disney_picture_the_rescuers/"
    },
    {
        "id": "1hlsi27",
        "author": "LiteraryBoner",
        "title": "Official Discussion - A Complete Unknown [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/vNt33aq3Cw3i)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/vNt33aq3Cw3i)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nIn 1961, unknown 19-year-old Bob Dylan arrives in New York City with his guitar. He forges relationships with music icons of Greenwich Village on his meteoric rise, culminating in a groundbreaking performance that reverberates worldwide.\n\n\n**Director:**\n\nJames Mangold\n\n**Writers:**\n\nJames Mangold, Jay Cocks, Elijah Wald\n\n**Cast:**\n\n* Timothee Chalamet as Bob Dylan\n* Edward Norton as Pete Seeger\n* Elle Fanning as Sylvie Russo\n* Monica Barbaro as Joan Baez\n* Joe Tippett as Dave Van Ronk \n* Eriko Hatsune as Toshi Seeger\n* Scoot McNairy as Woodie Guthrie\n\n**Rotten Tomatoes:** [78%](https://www.rottentomatoes.com/m/a_complete_unknown)\n\n**Metacritic:** [70](https://www.metacritic.com/movie/a-complete-unknown/)\n\n**VOD:** Theaters",
        "upvotes": 499,
        "comments": 215,
        "media": null,
        "permalink": "/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/"
    },
    {
        "id": "1hlow2x",
        "author": "Open-Platform9637",
        "title": "Is there a dystopian movie about if it dosent stop snowing",
        "content": "Imagine everyday and every night it continuesly snows in this city, causing a natural disaster, apocalypse and catastrophe. The entire infrastructure would collapse, buildings would rumble under all the weight of the snow. Power failure, Electricity and water shortages. Moral sinking. People fighting over food etc. The government trying to find solutions. I thought of this idea because we want to go to Bosnia for the holiday, where it’s been snowing for the past 3 days, so it’s going to be hard driving there. There’s also been a power out today. Hopefully tap water will stay and power will probably come back tomorrow. That made me think what if it just dosent stop snowing, how would civilisation survive. I would love see my imagined scenario visualized to watch a movie, if there isn’t one there definelty should be one.",
        "upvotes": 946,
        "comments": 541,
        "media": null,
        "permalink": "/r/movies/comments/1hlow2x/is_there_a_dystopian_movie_about_if_it_dosent/"
    },
    {
        "id": "1hmb7re",
        "author": "SensitiveExpert4155",
        "title": "Willem Dafoe &amp; Robert Eggers Talk The “Fear” of Acting, Exploring The Darkness &amp; ‘Nosferatu’",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5Ge40U324bSH634C_JIGqwtoNRSPJgA0IcAAiMPMtq0.jpg?auto=webp&amp;s=11607026faa8e9b737d728e075f42cebf916ea3e"
        },
        "permalink": "/r/movies/comments/1hmb7re/willem_dafoe_robert_eggers_talk_the_fear_of/"
    },
    {
        "id": "1hllvi2",
        "author": "Amaruq93",
        "title": "How \"the Grinch\" stole Hollywood | The crazy story behind Ron Howard's 2000 adaptation",
        "content": "",
        "upvotes": 1381,
        "comments": 260,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMaQTDmKwoR1KbJC4mI0n8y4siuf0jFr9N1BEUc3FvE.jpg?auto=webp&amp;s=283e81ebcb3ea8a53126257939b33da359b887ee"
        },
        "permalink": "/r/movies/comments/1hllvi2/how_the_grinch_stole_hollywood_the_crazy_story/"
    },
    {
        "id": "1hlznz9",
        "author": "LoneWolfIndia",
        "title": "The Abyss- Close Encounters in the Deep",
        "content": "https://preview.redd.it/0ze8spwxgz8e1.png?width=184&amp;format=png&amp;auto=webp&amp;s=9d24f5a5c6af276c8789d3a25c7d3592d5d58568\n\nThis remains among my favorite James Cameron movies, right up there with Aliens and Terminator 2, basically ET meets Close Encounters Of 3rd Kind under the sea.\n\nThe movie starts off with an American submarine USS Nebraska, sinking in the Cayman trough, after it has an encounter with a mysterious moving object. In order to counter the Soviets, who are approaching there, the US Govt, arranges a **SEAL** team, which would use an experimental, underwater oil rig as a base for their operations.\n\nhttps://preview.redd.it/ltaqjolchz8e1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=388678361db5426bd6735f4bff52ee439adf9d9b\n\nOne of the team members is **Dr.Lindsey Brigman( Mary Elizabeth Mastrantonio),** who designed that underwater rig, while in typical Hollywood style, her ex husband **Virgil Brigman aka Bud( Ed Harris)**, is now a blue collar oil rig worker on the same platform. The leader of the team **Lt.Coffey( Michael Biehn)** is a grumpy paranoid soul.\n\nThe rig has a bunch of workers, that includes  **Catfish De Vries(Leo Burmester), Alan Hippy( Todd Graff), Lisa** ***“One Night”*** **Standing(Kimberley Scott)**.  As the team begins to search for the missing sub along with the rig workers, there is a whole lot that happens, including a nasty storm, that nearly ends up wrecking the underwater rig. And that is when the team has the encounter with the alien, that keeps changing shape. However Coffey, now decides to nuke the aliens, in the trench where he believes they come from.\n\nhttps://preview.redd.it/jgyi7d68kz8e1.png?width=1296&amp;format=png&amp;auto=webp&amp;s=5fa7ac22e012b9e95e25339a3154f2703531c88a\n\n\n\nThe movie has some of the best special effects ever, especially the alien encounter for the first time, and the morphing technique used.  Also Lindsey's near encounter with an alien.  Of course the last scene where the entire city rises from underwater,  is what you go to the theaters for, recall seeing it on big screen, and was absolutely stunning.\n\nThe scene where the rig gets flooded, is brilliantly shot, superb editing. As also the scene where Bud descends into the Abyss.\n\nThe human emotions part is the strong factor of this movie, especially the strained relationship between Bud and Lindsey, their ego clashes, and reunion is well shot. It helps that both Ed Harris and Mary Elizabeth Mastrantonio are both good actors. Though would not rate this among one of Harris best performances, he still lends the much needed gravitas, while Ms.Mastrantonio is equally good as the feisty, yet vulnerable Lindsey.\n\nhttps://preview.redd.it/zd1kk7sfkz8e1.png?width=566&amp;format=png&amp;auto=webp&amp;s=92acf5c02dc664b5dc73e0363280eb51101e29bb\n\nMichael Biehn, who had earlier appeared in Terminator and Aliens, is suitably nasty as Coffey, making him a strong antagonist, conveying the hate and paranoid nature really well.\n\nOf course being Cameron being Cameron, he does stretch that ending by a good 15-20 minutes, till you start looking at your watch. It's only the ending shot that makes up for the overlong climax.\n\nI personally would rate this among Cameron's best movies, liked it more than more Titanic or Avatar. Notwithstanding  a dragged out climax, it's worth a watch for it's brilliant special effects and some great performances by Ed Harris, Mastrantonio and Biehn.",
        "upvotes": 57,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1hlznz9/the_abyss_close_encounters_in_the_deep/"
    },
    {
        "id": "1hm3r5b",
        "author": "Extreme_Homework7936",
        "title": "Richard Curtis on Crafting Holiday Magic with \"That Christmas\"",
        "content": "",
        "upvotes": 23,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sbjFkmyzVsWSRGDqzPiuJRaBumLz435g7ZcHFIck7nM.jpg?auto=webp&amp;s=bfaae336dae35c09423336dc6e6fd8394592466a"
        },
        "permalink": "/r/movies/comments/1hm3r5b/richard_curtis_on_crafting_holiday_magic_with/"
    },
    {
        "id": "1hlrcnz",
        "author": "AntawnSL",
        "title": "Hundreds of Beavers: the most original movie experience of the year",
        "content": "It was a slow start, and a bit of a wilder ride than expected, but it held my attention for the whole 108min runtime (with ads on prime) as a mostly silent film. A major accomplishment in the year of our lord 2024. A couple laugh out loud moments. A couple big ideas that deserve a little more consideration. 100% would recommend this weird, goofy movie.",
        "upvotes": 322,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1hlrcnz/hundreds_of_beavers_the_most_original_movie/"
    },
    {
        "id": "1hm8ox2",
        "author": "hutaosgf_",
        "title": "All Quiet On The Western Front (2022) ",
        "content": "If you like knowing about ww1 you’re going to love this movie, i don’t know too much about wars but I think this movie shows a pretty accurate pov of ww1, even if it doesn’t sound too appealing to some of you I think you should still watch since it’s an amazing movie, it has an amazing quality and changes your mindset about a lot of stuff completely ‼️🐈‍⬛",
        "upvotes": 8,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1hm8ox2/all_quiet_on_the_western_front_2022/"
    },
    {
        "id": "1hlhb1v",
        "author": "JannTosh50",
        "title": "When Goldfinger Essentially Rebooted the James Bond Franchise",
        "content": "",
        "upvotes": 1082,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v9zkf7fp-9004tc8sQX9keOBs8JhtPlnfg1i5BRYCKU.jpg?auto=webp&amp;s=e6e5ad6d3d066d8fa3e7c531bdc2b0feca668ed1"
        },
        "permalink": "/r/movies/comments/1hlhb1v/when_goldfinger_essentially_rebooted_the_james/"
    }
]