[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 376,
        "comments": 2428,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n8dqlm",
        "author": "BlackDoom_26",
        "title": "Shows that totally lost you halfway through",
        "content": "Have you ever started a Netflix show that was amazing at the start but then kind of fell apart later on? Curious which ones had you hooked and then left you feeling disappointed.",
        "upvotes": 298,
        "comments": 1271,
        "media": null,
        "permalink": "/r/netflix/comments/1n8dqlm/shows_that_totally_lost_you_halfway_through/"
    },
    {
        "id": "1n8lagq",
        "author": "huffpost",
        "title": "Best international or foreign-language shows on Netflix that deserve more attention?",
        "content": "What are some bingeworthy international or foreign-language shows you’ve found on Netflix that completely blow any American show out of the water? Are there any you love that are flying under? What do you love about the show?",
        "upvotes": 34,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1n8lagq/best_international_or_foreignlanguage_shows_on/"
    },
    {
        "id": "1n8o5tu",
        "author": "Princessrage",
        "title": "\"Jinx\" from Arcane. Mixed media by my 13yo.",
        "content": "Hello, fellow Netflix fans! I'm a long time reddit lurker, and very rarely post, but my daughter requested that I share her creation with you fine folks. (She's the one who introduced me to Arcane.) Please be kind, I'm hoping to have some friendly feedback to show her tomorrow. TIA!❤️",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n8o5tu/jinx_from_arcane_mixed_media_by_my_13yo/"
    },
    {
        "id": "1n8b43i",
        "author": "darth_vader39",
        "title": "MONSTER: The Ed Gein Story | Official Teaser | Netflix",
        "content": "",
        "upvotes": 52,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n8b43i/monster_the_ed_gein_story_official_teaser_netflix/"
    },
    {
        "id": "1n8mpx7",
        "author": "GuitarsAndBourbon26",
        "title": "Obsessed with these “American Manhunt” docs",
        "content": "Just finished the Osama bin Laden doc. Wow. And now almost done with the Boston Marathon Bombing doc. These film crews &amp; Netflix absolutely nailed these. Firsthand accounts and photos inside the White House war room, etc. The dramatizations and recreated aerial footage of events really add to the realism, and are so convincing I forgot at times they were recreated. I can’t wait to dive into the others they’ve made and hope they continue this series. Well done Netflix. Very well done. ",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8mpx7/obsessed_with_these_american_manhunt_docs/"
    },
    {
        "id": "1n80kh8",
        "author": "thehealer2",
        "title": "Stand by Me (1986) is such an underrated gem.",
        "content": "This film is truly an underrated gem, beautifully capturing the raw essence of childhood friendships and the bittersweet journey into adulthood.\n\nFor a few hours, I felt like I was right there alongside Gordie, Chris, Teddy, and Vern, wandering through the woods, chasing whispers of a dead body, and facing their fears and dreams. The film’s strength lies in its authenticity; every laugh, heartbreak, and quiet moment feels genuine, drawing you into their world. It serves as a poignant reminder of how fleeting and impactful those youthful adventures can be.\n\nI really miss road movies like this, where a group of friends embarks on a journey to discover something meaningful.\n\nWhat did you think about this movie? I’d love to hear your thoughts and feelings after watching it!\n\nAlso, if you have any recommendations for similar movies, please share them below!",
        "upvotes": 183,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qup1tmd8r2nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n80kh8/stand_by_me_1986_is_such_an_underrated_gem/"
    },
    {
        "id": "1n86r5g",
        "author": "Glum_Reputation_9845",
        "title": "Watching Dirty Money’s Wells Fargo episode",
        "content": "I’ve been watching Dirty Money on Netflix again, and the episode about the Wells Fargo account fraud scandal really stuck with me. The whole thing about millions of fake accounts being created under people’s names without their knowledge was wild enough, but what got me was how little control regular people had over their own personal information once it was in the system. It makes me think about it, are our systems really that vulnerable nowadays that something like this can just happen to anyone? We spend so much time being told to make stronger passwords and enable 2FA, but if a bank or data broker already has your personal info in their system, what stops it from being misused?",
        "upvotes": 52,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n86r5g/watching_dirty_moneys_wells_fargo_episode/"
    },
    {
        "id": "1n8kjv3",
        "author": "theirishstew",
        "title": "Interface change… where are the categories?!",
        "content": "The Netflix interface has just changed for me on my TV and I’m having a hard time finding how to browse by category like you used to. Is it still something that’s available but I’m not seeing?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n8kjv3/interface_change_where_are_the_categories/"
    },
    {
        "id": "1n8qsw8",
        "author": "BoringClassroom5811",
        "title": "Is \"my life with Walter Boys\" a remix of \"The Summer I Turned Pretty\"?",
        "content": "Wow, at this point, the new red flag in this series is Jackie? Like girl pick a side please T\\_T you remind me of Belly a lot - keep switching between brothers like it's nothing T\\_T. okay, sorry for the rant lol didn't know who else to say this to. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8qsw8/is_my_life_with_walter_boys_a_remix_of_the_summer/"
    },
    {
        "id": "1n8j1jl",
        "author": "Batrah",
        "title": "Rebel Royals, a good documentary?",
        "content": "I'm surprised how underrated it seems. Currently only 80k views on the trailer. I thought it's the same people that made Tiger King? Anyway that couple, especially Durek seems completely out of it. Can't tell if it's an act or real people",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8j1jl/rebel_royals_a_good_documentary/"
    },
    {
        "id": "1n7ycvl",
        "author": "TeaRemote258",
        "title": "Wednesday S2 Underwhelming?",
        "content": "Just me? I know they had to change things around when they ditched that S1 actor but this season just felt like a jumble of storylines someone started slapping together. Only pieces here and there felt cohesive like someone thought about the plot in advance. And splitting the season up just didn’t help at all. I think Agnes was a good addition, though. ",
        "upvotes": 72,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1n7ycvl/wednesday_s2_underwhelming/"
    },
    {
        "id": "1n8cj5k",
        "author": "HecticJones",
        "title": "we should know about a Murder Club sequel this week, if it's happening [source]",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n8cj5k/we_should_know_about_a_murder_club_sequel_this/"
    },
    {
        "id": "1n8r7cv",
        "author": "joewhodunit",
        "title": "Netflix id NO longer working and giving E109 browser out of date error",
        "content": "Hello:\n\nYesterday we watched netflix on this device NO problem ...  \nThis evening I am getting this error NO MATTER what I do \n\nFirefox is up-to-date and I even   \nInstalled an add-on called WideVine - based on readings ...  \nCleared cache and cookies to no avail as well ...\n\nOk, PC is WIN7 and working fine up to now ...\n\nHELP !!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8r7cv/netflix_id_no_longer_working_and_giving_e109/"
    },
    {
        "id": "1n8q65r",
        "author": "oddreplica",
        "title": "a show i remember loving was just added to US east coast Netflix!",
        "content": "orphan black! AND there are no ads! \nI'm jealous of those who get to watch it for the first time. it's totally holding up on my second watch, omg. so good!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8q65r/a_show_i_remember_loving_was_just_added_to_us/"
    },
    {
        "id": "1n8pzdv",
        "author": "Huge-Ranger6977",
        "title": "Is anyone having trouble getting the Netflix app to load shows/movies?",
        "content": "I have tried restarting my tv, checking for updates, disconnecting and reconnecting to the 5g WiFi, opening other shows but nothing is working. It just keeps spinning and I eventually give up each time when it’s like at 24% after a couple of minutes. Is anyone else having this same issue?? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8pzdv/is_anyone_having_trouble_getting_the_netflix_app/"
    },
    {
        "id": "1n8j5vb",
        "author": "Miserable_Quail_8236",
        "title": "Wednesday S2 E7",
        "content": "It' would appear that episode 7 was not shot in Dolby Vision. Anyone else notice this? Wonder why they elected to do that and for what purpose? I've not yet seen E8, so it will be interesting to see what that's shot in. \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8j5vb/wednesday_s2_e7/"
    },
    {
        "id": "1n8egyz",
        "author": "indiewire",
        "title": "'Wednesday' Season 2 Ending Shows It's Already Out of Ideas",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8egyz/wednesday_season_2_ending_shows_its_already_out/"
    },
    {
        "id": "1n8ngnm",
        "author": "Armi5",
        "title": "CTRL+SHIFT+ALT+D is not working for years now",
        "content": "How come people still recommend CTRL+SHIFT+ALT+D to check resolution? It never does anything on my devices. \n\nDid they remove this feature? Or am I doing something wrong here? It used to work years ago and I could check all the data.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n8ngnm/ctrlshiftaltd_is_not_working_for_years_now/"
    },
    {
        "id": "1n8n7qz",
        "author": "FearIsLikeUnderwear",
        "title": "How are the ads?",
        "content": "I’m thinking about downgrading my plan after I found out that my family members who live in a different house aren’t able to log in anymore. So instead of paying the $17.99/month plan, I see there is one for $10 cheaper that has ads. \nDoes anyone have that plan, and how long are the ads? Are they show specific, or am I going to get ads for fucking prescriptions and credit cards on here now too? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n8n7qz/how_are_the_ads/"
    },
    {
        "id": "1n7mmgn",
        "author": "AccurateInflation167",
        "title": "KPop Demon Hunters dethrones Squid Game as Netflix’s most-watched title ever - KED Global",
        "content": "",
        "upvotes": 145,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1n7mmgn/kpop_demon_hunters_dethrones_squid_game_as/"
    },
    {
        "id": "1n884fb",
        "author": "Crazy_Guitar6769",
        "title": "I actually enjoyed Wednesday part 2",
        "content": "Like I heard people saying it wasn't good, and yeah, they definitely overdid the cliches a little, but I actually found it enjoyable.\n\nI liked the explored more of the lore, though I feel like they overdid the Gomez and Morticia secret. Should have given that to...idk, someone else.\n\nBut the rest of it, I did find it enjoyable. Especially when Wednesday and Enid...went to Rotwood.\nAnd I like the new invisible character quite a bit.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n884fb/i_actually_enjoyed_wednesday_part_2/"
    },
    {
        "id": "1n8k8zc",
        "author": "Quirky_Split_4521",
        "title": "What subscription service has the most comedy shows?",
        "content": "Parks and rec, the office, community, Brooklyn 99, psysh, etc, these types of shows. I'm mostly looking for lighthearted comedy shows. I've tried netflix but I can't find enough to watch.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n8k8zc/what_subscription_service_has_the_most_comedy/"
    },
    {
        "id": "1n89s3t",
        "author": "Fast_Buffalo_4951",
        "title": "I am convinced they are putting these huge gaps in seasons and episodes to.",
        "content": "Let people forget , so they have to go back and rewatch the start of the season or the previous seasons over again to fully know what’s going on. Current season of Wednesday for example was not memorable at the start. So of course I did not recall much that happened when part 2 was released. \n\n\n",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n89s3t/i_am_convinced_they_are_putting_these_huge_gaps/"
    },
    {
        "id": "1n7xsee",
        "author": "dailystar_news",
        "title": "Netflix's star Penn Badgley announces birth of twin boys with wife Domino Kirke",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7xsee/netflixs_star_penn_badgley_announces_birth_of/"
    },
    {
        "id": "1n8aoy3",
        "author": "dreadduck25",
        "title": "Games",
        "content": "Does anyone know if you can get netflix games free (on my sons phone for example) if you have a netflix account? &amp; if yes do you need to log out of another appliance to log him in to a game? 🙂",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n8aoy3/games/"
    },
    {
        "id": "1n86p40",
        "author": "cl4udia_kincaiid",
        "title": "Adding an extra household to Netflix?",
        "content": "My Mum pays for the Netflix you should be able to get an extra household on, however we can’t figure out how to add me now I live interstate. For the last 2 years I’ve had to just get the temporary code sent but it seems to have run out. When following the steps and logging into her account, there does not seem to be the option to add an extra household. Is this not an option in Australia yet or something? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n86p40/adding_an_extra_household_to_netflix/"
    },
    {
        "id": "1n8eskf",
        "author": "MrBalloonHands4",
        "title": "Netflix in multiple households",
        "content": "My girl and I live in separate houses. Can we share a Netflix account? It would even be okay if one of us could have it on our TV and one on our laptop. \n\nFrom what I’m seeing is you can only have 2 devices in the same IP location but not sure if I am understanding it correctly.\n\nWhat are our options? (Cheapest the best!)\n\nThanks",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n8eskf/netflix_in_multiple_households/"
    },
    {
        "id": "1n7vybz",
        "author": "self-fix",
        "title": "Netflix urges Tencent to stop airing plagiarized 'Culinary Class Wars' in China",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vybz/netflix_urges_tencent_to_stop_airing_plagiarized/"
    },
    {
        "id": "1n8hxjn",
        "author": "BellissimaFan",
        "title": "Sa vaut le coup ou pas?",
        "content": "Bonsoir, \nMon chéri et moi on hésite a prendre un abonnement Netflix a 15€. Je voudrais savoir si sa vaut toujours le coup ou si la plate-forme est devenue moins attractive en terme de série et films? \nPerso j'ai déjà un abonnement a 8€ sur paramouth+ qui est très bien. On sait déjà que si on prend un abonnement sa sera pas un avec les pubs. On vas pas sur des plate-forme pour avoir des pub sinon autant regarder la télé ses gratuit. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n8hxjn/sa_vaut_le_coup_ou_pas/"
    },
    {
        "id": "1n84dsb",
        "author": "1amtheknight",
        "title": "Anyone else have their extra profiles deleted?",
        "content": "Opened the Netflix app on my TV today to find my extra profiles gone. Went through all the troubleshooting steps:\n-Restarted TV\n-Cleared the app data and logged back in\n-logged in on a different device saw the extra profiles disappear as it loaded.\n-Logged in on a browser saw there was an error against my account for my TV. The error said the TV app couldn't access the Internet and check my network. No error message for my phone app though. \n-Checked the TV apps internet connection using the in app test which passed and tested the TVs internet connection using a speed test app full speed. \n-Contacted Netflix help and all they did was copy paste the checks from the error which I'd already done. I was then told sorry there was nothing they could do.\n\nSo now I've had to create the profiles again and all the viewing history is gone.\n\nAnyone else successfully restored \"deleted\" profiles? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n84dsb/anyone_else_have_their_extra_profiles_deleted/"
    }
]