[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 479,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h4r2iw",
        "author": "Robemilak",
        "title": "Dark premiered on Netflix 7 years ago today. One of the best shows ever?",
        "content": "",
        "upvotes": 479,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1h4r2iw/dark_premiered_on_netflix_7_years_ago_today_one/"
    },
    {
        "id": "1h4z3ws",
        "author": "Sheila3134",
        "title": "Question about Netflix with commercials? ",
        "content": "How does prime video get away with adding commercials to all content on prime video, but Netflix can't and some content can't be watched because of commercials? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4z3ws/question_about_netflix_with_commercials/"
    },
    {
        "id": "1h4y5mr",
        "author": "Pogrebnik",
        "title": "Writer and Director Hwang Dong-hyuk Reveals How Season 2 Changed the Ending of 'Squid Game'",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4y5mr/writer_and_director_hwang_donghyuk_reveals_how/"
    },
    {
        "id": "1h4pzbw",
        "author": "Amandamills089",
        "title": "Netflix Presents \"Senna,\" F1 Legend Ayrton Senna's Story",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4pzbw/netflix_presents_senna_f1_legend_ayrton_sennas/"
    },
    {
        "id": "1h4z90f",
        "author": "The_CreativeName",
        "title": "Any way to download shows for offline viewing for pc?",
        "content": "Im going on a trip in like a month, and would like to watch arcane in its entirety again, but the internet is going to be really bad on the way there, and really don’t wanna watch it on my phone. \n\nAny ideas? Just keep it legal/barely legal.  \n\nThanks in advance ;)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4z90f/any_way_to_download_shows_for_offline_viewing_for/"
    },
    {
        "id": "1h4xpio",
        "author": "Altruistic-Slip-6340",
        "title": "The Concierge/ For Love Or Money",
        "content": "Does anyone have any idea where I can stream this movie in the UK? I've tried Netflix but had no luck. A really underrated Michael J Fox movie in the vein of Secret Of My Success. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4xpio/the_concierge_for_love_or_money/"
    },
    {
        "id": "1h4qrqj",
        "author": "Evara333",
        "title": "Recently watched ‘I care a lot’ ",
        "content": "the best thing about the movie was, OFCOURSE PETER DINKLAGE!! 😭🤌🏼\nI mean yes, Rosamund Pike… I wanted to kill her myself, so yeah she did amazing! The end could’ve definitely been different tho, it let me down. Such a beautiful plot in the first half, and it just went downhill from there. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4qrqj/recently_watched_i_care_a_lot/"
    },
    {
        "id": "1h4wiyp",
        "author": "Mart1876",
        "title": "The Secret of the River was so awesome .",
        "content": "Very good show . I loved how it covered platonic friendship , exploring your identity at a young age and beating societal norms and standards . I watched the whole season yesterday and I’m rewatching again after work . A lot of scenes hit me hard and too bad it was only 8 episodes . I loved the friendship between Manuel (Sicaru )and Erik . Despite all the stuff that happened younger they still kept their promise to each other . 🥹",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4wiyp/the_secret_of_the_river_was_so_awesome/"
    },
    {
        "id": "1h4qecm",
        "author": "Still_Boat_233",
        "title": "Wednesday' Season 2 Wraps Filming",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4qecm/wednesday_season_2_wraps_filming/"
    },
    {
        "id": "1h4kov4",
        "author": "stellacampus",
        "title": "The new drama \"Senna\" was very good",
        "content": "I know there's also a really good Senna doc on Netflix, but this new drama is really well done and worth a watch if you have any interest in racing at all (or even if you don't, but are okay with a drama that revolves around it).  The actors are all good and it's easy to get pulled into the story.  When the racing gets going, there are some amazing effects that make you feel like you're in the car.  It's a good length too - long enough to tell a story spanning some years, but not so long you don't ever want to see another race.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4kov4/the_new_drama_senna_was_very_good/"
    },
    {
        "id": "1h4v8uv",
        "author": "Orangesplashy",
        "title": "Episode Playlist?",
        "content": "I have a big Christmas Eve party this year and have always had the idea to have xmas episodes from a multitude of my favorite/ popular shows playing in a non-main room for people who want to get away from the chaos. This has always been a tradition of mine to get myself in the spirit but usually I’d just manually switch through shows and that’d take too much effort while hosting. Does anyone know if this is possible using the download feature or is it just a pipe dream? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4v8uv/episode_playlist/"
    },
    {
        "id": "1h4tkf2",
        "author": "Wasp1e_",
        "title": "I can only watch Netflix productions",
        "content": "Can someone tell me why Netflix allows me to only watch Netflix productions? On any other production’ I have just “remind me” button, 2 days ago it was all fine. I tested on different devices",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4tkf2/i_can_only_watch_netflix_productions/"
    },
    {
        "id": "1h4sosb",
        "author": "Veroptik",
        "title": "Standard or premium for 1220x2712p phone and 1080p computer?",
        "content": "What plan should I buy if I plan to watch Netflix on my HD/1920x1080p computer and 1.5K/HD+/1220 x 2712 pixel phone?\nWould the slightly higher quality on the phone noticable? Money isn't a concern but like in terms of common sense there's no point in spending more if it has 0 impact.\nAnd does the plan impact anything else?\nThank you ✌️",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h4sosb/standard_or_premium_for_1220x2712p_phone_and/"
    },
    {
        "id": "1h4oroi",
        "author": "DMoney_10",
        "title": "Thoughts on “Later Dating” coach? (Logan Ury)",
        "content": "I went into Netflix’s new dating show excited because of the premise, but also because I’d been following Logan for years on social media. She seemed like an accomplished researcher, author and advisor to companies like Hinge which is so cool. I’ve also heard some of her original sound bites on dating that seemed decent. \n\nHowever I was really let down by her appearance on the show. First of all, she had zero personality. She came off as very meek, and bland, and if anything the participants facilitated the scenes and kept things energized. \n\nI also felt like her coaching moments were a mixed watch - some were totally decent, but others were lacking, and others came off as abrasive. \nFor example, there were many dates that seemed very decent and with potential, but the participant wrote it off quickly. As a coach, Logan should have challenged them a bit more instead of just agreeing - and I think this caused some people to lose out on connections that could have developed with a bit more time. \nOr another example - she tore into the lady with the big glasses - attacking her glasses choice and also telling her that her personality is too big. IMO Logan, as a coach, could have more gently engaged with the lady, rather than potentially making her self-conscious and feel put-down. It also just seemed odd to me to target her fashion choice, when the woman clearly puts in soooo much effort and presents herself thoughtfully. It’s not like on Queer Eye when a makeover is part of the deal, and the participant is in need of it - not just for dating but for their well-being. \n\nI think Logan is clearly still a smart lady! But I think she’s better suited for research…or for consulting on a show like this - with someone more charismatic in the spotlight. \n\nWhat are everyone else’s thoughts?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4oroi/thoughts_on_later_dating_coach_logan_ury/"
    },
    {
        "id": "1h4v3i4",
        "author": "OopsididathingTT",
        "title": "Netflix Recommendations ",
        "content": "What should I watch on netflix? \nShows i like: inside job, bojack horseman, diplomat, shameless, gilmore girls, breaking bad. \n\nwhat should I watch next? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h4v3i4/netflix_recommendations/"
    },
    {
        "id": "1h4az00",
        "author": "IntelligentBag93",
        "title": "I’m looking for positive and uplifting shows that aren’t fake",
        "content": "I’m kind of done with the murder mysteries and cold cases, and I want to watch something more airy/breezy, something you can also watch while cooking. But I’ve noticed that the ‘feel good with the fake obsticals to overcome’ style is irritating me. \n\nFor example a house make over show that pretends there is a storm coming and they don’t know if they’ll finish, while in reality there is no storm it’s just editing, that combining with a lot of dramatic and over the top editing and personalities is tiring to me.\n\nI saw a show called Motel Makeover or something that was less of what I described above so I enjoyed that very much, they didn’t pretend to have problems all there problems were pretty real and the brushed over it pretty quickly. Also I didn’t like the final table because it felt rigged at the end and too dramatic. But food related content is also up my alley!\n\nEdit: Love all the suggestions please keep them coming so I have a list!!",
        "upvotes": 14,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1h4az00/im_looking_for_positive_and_uplifting_shows_that/"
    },
    {
        "id": "1h42qwq",
        "author": "False_Summer6313",
        "title": "Dark was very boring for me",
        "content": "I watched 5 episodes. I tried watching 3 years back, i stopped at the 2nd episode. Again i tried watching it 1 year ago, stopped at 4th episode. Now at 5th episode. Literally everyone’s characteristics in this series are the same. The character designs are sooo bland. I can’t sit through 9 hours of very slow burn screenplay to get the ‘AHHHHH’ moment in the 10th episode. I usually like ‘mind-melting’ series which makes me think more. Idk what’s happening with this one. Should i continue it and give it a shot?",
        "upvotes": 40,
        "comments": 176,
        "media": null,
        "permalink": "/r/netflix/comments/1h42qwq/dark_was_very_boring_for_me/"
    },
    {
        "id": "1h4mhuc",
        "author": "Sensitive_Rock6788",
        "title": "AfrAId Netflix",
        "content": "The movie began a little slow, but I knew where it was going. Almost like a M3GAN vibe but didn’t quite hit the nail for me. Towards the end, when the husband was actually visiting the company and the owners were talking to him about Iya, I don’t understand veering off and shooting her co-owner. Him then being taken to a hotel as if that woman wasn’t also part of it (so obvious). The ending felt rushed. Like the whole thing just got-bizarro. I did however feel like it was creepy because of the fact that AI can morph into this all knowing/controlling thing which I think is very real and we are clearly heading in that direction, if not there already. The beginning with the little girl listening to the show instructing her to go outside, we have that now with these crazy ass YouTube shows “for kids”. The movie just could’ve been better in my opinion. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4mhuc/afraid_netflix/"
    },
    {
        "id": "1h4pbmk",
        "author": "Yashaswi_",
        "title": "With reference to \"Freedom at Midnight\" on NetFlix.",
        "content": "Mountbatten would make for such a great life partner, fr a cutie!! Like he is so respectful towards Edwina, literally tells her everything and takes all her suggestions into considerations and does as she says. Talks respectfully to all politicians as doesn't assert his power even though he has heaps of it (only did when jinnah was out of his limits). True gentleman!! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4pbmk/with_reference_to_freedom_at_midnight_on_netflix/"
    },
    {
        "id": "1h4p8da",
        "author": "SaucyAstro__",
        "title": "$15 standard plan worth it?",
        "content": "I cut Netflix almost two years ago because it’s rapid price increase was paying almost $30..\n\nThinking of getting the $15 plan with no ads but was wondering if their is any missing content with that plan such as shows/movies? \n\nIf anyone can please help me out that would be tremendously helpful and appreciated!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h4p8da/15_standard_plan_worth_it/"
    },
    {
        "id": "1h4n5jg",
        "author": "mortdepup",
        "title": "Is there a way to get rid of trailer after movies/final show episodes?",
        "content": "I know there isn't a default option, I've already unchecked both types of autoplays in the account settings (not that it stops them from constantly putting up unwanted 'skip intro' buttons or making the entire video unusable until I click on 'watch credits' every episode, or the fact I have to navigate to the next episode in a super specific way to avoid it automatically skipping the intro on the next episode...)\n\nDoes anyone have any Chrome extensions (or other browser extensions honestly) or workarounds or anything to make Netflix stop annoying the crap out of me when I'm trying to enjoy the credits of shows and movies? It just super ruined the vibe of a Christmas movie I was watching with the family when we didn't click on the itty bitty top left movie square in time to stop the trailer for Arcane from deleting our Christmas song singalong from existence lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h4n5jg/is_there_a_way_to_get_rid_of_trailer_after/"
    },
    {
        "id": "1h4h73q",
        "author": "QCNH-LLC",
        "title": "Cannot change phone number on netflix account. ",
        "content": "I have an old phone number linked to my account, which is now inactive. I would like to update this to my current phone number, but Netflix signs me out when I follow the \"security\"-&gt;\"change my phone number\" steps. Besides deleting this account and resigning up, or joining a different video streaming platform, can this be fixed?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h4h73q/cannot_change_phone_number_on_netflix_account/"
    },
    {
        "id": "1h45sdl",
        "author": "Big-Wolf8312",
        "title": "Ok I get there are ads now, but why Netflix ads on Netflix??",
        "content": "I have seen that \"you have to watch it!\" ad on Netflix with Simone Biles so many times, but only ever on Netflix itself. Wouldn't you want people who don't have Netflix to see that ad to make them wanna get it? I already have Netflix...",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1h45sdl/ok_i_get_there_are_ads_now_but_why_netflix_ads_on/"
    },
    {
        "id": "1h4fznw",
        "author": "SkoomaAddictJambles",
        "title": "Some Weird “New Device” Bug?",
        "content": "It only just started today but anytime I go into the app on my phone I get an email saying a new device has logged. It's says the new device is a mobile browser and I get the email within seconds of going to app on phone. I'm not worried that someone got my password or I'm being hacked. Just wondering if this is happening to anyone else.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4fznw/some_weird_new_device_bug/"
    },
    {
        "id": "1h4s69q",
        "author": "daily_mirror",
        "title": "Netflix drops two versions of 'most iconic Christmas story ever' just in time for the holidays",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h4s69q/netflix_drops_two_versions_of_most_iconic/"
    },
    {
        "id": "1h47lay",
        "author": "indiewire",
        "title": "Best New Netflix Shows in December 2024",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h47lay/best_new_netflix_shows_in_december_2024/"
    },
    {
        "id": "1h4hxaj",
        "author": "Praxisificator",
        "title": "playback quality stuck on 540p",
        "content": "Hey, idk why but recently netflix's quality dropped like crazy on my computer, its connected straight to the modem with 900mbps+ no connection problems what so ever and my quality in account settings is at the highest, i tried using add ons and i tried using the app and on a different browser but nothing has helped, its really bad so i hope someone here has an idea of how to fix it",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h4hxaj/playback_quality_stuck_on_540p/"
    },
    {
        "id": "1h4lwwi",
        "author": "No_Salad_68",
        "title": "When Netix only has the first few seaons of something?",
        "content": "I've noticed Netflix often only has the first few seasons of something.  For example they only have four seasons of the Rookie (I'm in NZ), although seven seasons have been made. \n\nIs it likely in these situations that more seasons will becone available on Netflix as they age, and (presumably) get cheaper?\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h4lwwi/when_netix_only_has_the_first_few_seaons_of/"
    },
    {
        "id": "1h3xuvg",
        "author": "_formula10",
        "title": "The MADNESS.. more like The UNBELIEVABLE.",
        "content": "\n25 minutes in, and I’m already peeved.\nIf a man reports to the police about men in masks with guns and a chopped-up body at a cabin in the woods, and then certifies himself to be an established news reporter guy (despite being disheveled) because why wouldn't he.. why are they not responding with more units? Why are they not treating the place as a crime scene? Why isn’t he taken back to the station to file a formal report?\nHow does a lawman fail to recognize the difference between running over a nail and a textbook slashed tire on the side wall? Why would the reporter be considered or treated as a suspect off the bat? just because he's a writer, he's automatically a body chopping homicidal individual? this is no Jussie Smollett case,(all though even his \"assailants\" were taken under better preliminary scrutiny) it's a possible cartelish sounding case with professionals at hand, which is far more pressing. yes, there's little proof to corroborate his story, but can a real cop tell us what would have taken place if a CNN or Fox personality with news media influence came to them with such a story?\nWhy hasn’t the reporter contacted his colleagues at the station? And why would he even stay near that property alone after the police left?\nThis isn’t a critique of the characters in this pilot ep.—it's about the story writing. It’s unrealistic, sloppy, and a product of LOUSY MADNESS so far.\n\nLousy madness or keep watching it gets better? \n",
        "upvotes": 21,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1h3xuvg/the_madness_more_like_the_unbelievable/"
    },
    {
        "id": "1h4o4mx",
        "author": "Illustrioushydra1582",
        "title": "I have a theory one Netflix keeps cancelling shows in thinking they’re doing poorly",
        "content": "Netflix only wants instant sensational hits so if it’s not instantly discovered and instantly popular within one month of release they’re just gonna abandon it before it gets discovered\nBut the problem with that is, they do nothing to advertise the new shows outside of their platform\nAnd the the form of advertisement they do have is absolutely terrible\nIt’s advertising the product Netflix not individual shows \n\nEveryone knows the name of Netflix so start using that data you’ve collected to have targeted ad campaigns so you can run advertisements for shows and movies that you think people would like\n\nDiscoverability of Netflix doesn’t need to be done, but discoverability of Netflix shows need more of it \n\nBecause I’ve noticed a lot of shows do not get discovered, because there is absolutely no advertisement outside of Netflix, and even with in Netflix it was badly advertised\n\nIf they want to actually have TV shows that actually are successful give them some breathing room like if it’s obviously a failure all the reviews online are saying it’s bad. We hated it don’t make anymore. Sure maybe that’s a sign that it’s a horrible TV show. \n\nBut if everyone’s talking good about the show, even though you’re not reaching  the preferred metrics of 80% completion or more within a week\nAnd even then that doesn’t matter there’s shows that meat Netflix is arbitrary metrics, and they decide to cancel it anyways \nIf you want to show to be successful, give it some breathing room, Bojack Horseman Netflix always goes on about how Bojack Horseman is there really good, animated, cartoon  because they gave breathing room\nBojack horseman, season one and two sucked \nBut by the end, it was a cultural masterpiece, because you gave the breathing room to the writers to actually write some thing instead of just abandoning ship. As soon as you don’t meet your preferred metrics. \n\nIf Netflix released any TV shows that were big hits in the early 2000s they would’ve cancelled them \n\nI understand their business to make money, but maybe instead of putting your profits into horrible movies that nobody wants to watch \nMaybe start putting it into TV shows and movies that people actually want to watch \n\nBecause the majority of shows that are actually really good nugget cancel Netflix doesn’t give us a reason but there’s tons of shows that are horrible dog shit with barely any ratings and Netflix keeps it going \n\nIt’s just Netflix does not allow users to discover new shows before they cancel it \n\nYou have to know every show that comes out on Netflix\nEven though they do not advertise when they’re coming out or what they come out with half the time \n\nI’m not following Netflix is Twitter every single day checking their Twitter account every single day for the new release because 90% of their posts are absolute brain rot Just to keep them relevant. \n\n\nJust stop cancelling shows \nBefore people discover them \n\nIf it’s 50% or more in the first season, give it a second season greenlight \n\nWe don’t expect you to buy five seasons at a time \n\nAnd if popularity is dying off before the show is released, you can just cancel it and cut your losses \nDo that with every other movie they think it’s going to do bad \n\n\nAnd another thing that is more of the movie industry problem than Netflix problem is companies expect movies to do poorly and they’re really good. They expect movies to do really good and they do poorly so maybe stop cancelling those movies you think you’re gonna flop  the couple of uptight critics said it would\n\nBecause time and time again, I see a movie come out critics say it’s going to be horrible\nAnd people love it \n\nLook at the Mario movie everyone said it gonna be horrible. All the critics were against it.\nAs soon as it came out, everybody loved it \n\nAnd that’s one thing I’ve noticed with a lot of movies critics when they hate a movie and think that it should be cancelled before it gets released so they can get a pay out \nBecause it’s only 80% complete\n\nMaybe finish the movie and release it because if you think it’s gonna do bad, it’s gonna be good\nIf you think it’s gonna be good, it’s gonna be bad",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h4o4mx/i_have_a_theory_one_netflix_keeps_cancelling/"
    }
]