[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 34,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pi3w47",
        "author": "Routine-Ad-1546",
        "title": "Sean Combs new documentary",
        "content": "One of the greatest things the documentary proved was that the jurors were dumb as fuck. No common sense whatsoever.\n\nI just know they got paid to act dense bc if they didn’t take a payoff I’d be very surprised…. It was shocking the jurors even wanted to save face with some ridiculous excuses to literally let the devil loose. The diddler belongs UNDER the jail, k.",
        "upvotes": 103,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1pi3w47/sean_combs_new_documentary/"
    },
    {
        "id": "1pi9fsh",
        "author": "NoMoreTicks",
        "title": "First We Waited for Seasons, Now We Wait for Volumes",
        "content": "Remember the good old days? We waited a year—maybe two—for a new **season** of our favorite show. It was painful, sure, but the eventual drop was a single, glorious binge-fest. We adapted. We endured the long waits for the return of hits like the final run of *Stranger Things*.\n\nBut now, the streaming overlords have added a new layer of torture: **Volumes**.\n\nIt’s not enough that we waited for what we were promised as \"Season 5\" of *Stranger Things*, only to get Volume 1—a cruel, tantalizing fraction of the story. You get four episodes of vital plot, a massive cliffhanger, and then... nothing. Back to the waiting game for Volume 2, which is essentially just the back half of the same season. The same happened with the highly-anticipated return of *The Family Man*, only for fans to have to wait again between parts.\n\n  \nWe signed up for the convenience of binge-watching, the freedom to control our viewing experience. Now, we are being forced back into an anticipated, staggered release schedule, only without the benefit of the traditional weekly TV model that kept the community discourse alive for months. Instead, we get an initial flash of binge-mania followed by a frustrating, momentum-killing pause.\n\n",
        "upvotes": 18,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pi9fsh/first_we_waited_for_seasons_now_we_wait_for/"
    },
    {
        "id": "1pic5nv",
        "author": "Mandarina_Espacial",
        "title": "Is netflix the owner of the nemesis system?",
        "content": "This is my first post here and i wanted to know if now that netflix bought warner, does that mean also has the ownership of the nemesis system?\n\nI hope the answer is YES and also to make it public, because what warner did with the patent was evil",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pic5nv/is_netflix_the_owner_of_the_nemesis_system/"
    },
    {
        "id": "1pi7yo0",
        "author": "Educational_Base_301",
        "title": "I feel like I watched everything on Netflix. Any new 2026 series to look forward to?",
        "content": "I’ve gone through so many shows over the last few years that I’m starting to run out of things to watch.  \nDo you guys have any recommendations for upcoming Netflix series in 2026 or something recent that feels fresh?  \nI’m open to any genre, as long as it keeps me hooked.",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pi7yo0/i_feel_like_i_watched_everything_on_netflix_any/"
    },
    {
        "id": "1phkmdn",
        "author": "Brandon84xx",
        "title": "The Beast In Me",
        "content": "Was I the only person who thought Nile asked Aggie to sign the book just to forge her signature for the jogging path?\n\nI was so sure but apparently not.",
        "upvotes": 98,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1phkmdn/the_beast_in_me/"
    },
    {
        "id": "1phzd9u",
        "author": "Cool_Bath_77",
        "title": "Love &amp; Death and Candy",
        "content": "I did not realize \"Love &amp; Death\" (2023) is the same story as \"Candy\" (2022). I am watching Love &amp; Death and did not realize it was the same storyline until episode 4. I probably watched Candy in 2022. I don't have a memory to remember character names years later.\n\nWhen did everyone else realize it was the same story?",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1phzd9u/love_death_and_candy/"
    },
    {
        "id": "1ph1mqu",
        "author": "Other-Squirrel-8705",
        "title": "Diddy is done.",
        "content": "Sean Combs:The reckoning.  What shocked you the most? Collecting bodily fluids to drink later 😱. Also when he shook hands with his fans/people in Harlem….and talked about needing a shower after. That man is layers of evil. ",
        "upvotes": 1507,
        "comments": 487,
        "media": null,
        "permalink": "/r/netflix/comments/1ph1mqu/diddy_is_done/"
    },
    {
        "id": "1ph42sv",
        "author": "HehroMaraFara",
        "title": "Sean Combs: The Reckoning",
        "content": "Obviously he’s generally a scumbag and that’s been well established. What struck me the most is almost any time he speaks at length, it is pure gibberish. \n\nThis mofo cannot put together a coherent thought. How he operated in any kind of a professional sense is unbelievable. It is pretty ridiculous that he was not exposed earlier. \n\nFuck Diddy. ",
        "upvotes": 684,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1ph42sv/sean_combs_the_reckoning/"
    },
    {
        "id": "1piaaqu",
        "author": "MechRat",
        "title": "How to fix your monitor going black when opening Netflix, Spotify, Disney+ on your PC, caused by HDCP, when the NVIDIA setting \"Content Type Reported to the Display\" doesn't appear",
        "content": "My setup: *Windows 11, AMD Ryzen 9, RTX 3070, Dual Acer Monitors. However, I've experienced this with other setups too.*\n\nMy monitors going black when loading up Netflix, Spotify and other services, whether through desktop apps or through any browsers, has plagued me for years. Yesterday I finally tried a fix that actually worked flawlessly for me.\n\nFor reference, I tried the most popular fixes, such as disabling audio devices in Device Manager or Content Type Reported to the Display in NVIDIA Control Panel (as I don't have that option appear), but to no avail.\n\nI stumbled upon this [forum](https://forums.guru3d.com/threads/disable-hdcp-regedit.442563/), discussing how to disable HDCP with a registry edit. And it worked flawlessly for me.\n\n**DISCLAIMER: Editing the Windows Registry carries significant risks. Disabling HDCP may cause other issues with compatibility in other software and services.**\n\n1. **Get your GFX Class GUID** (*Open Device Manager, right click your graphics card under Display adaptors, go to details, select Class GUID, right click the number that appears and copy and paste somewhere!)*\n2. **Open Command Prompt** (*Press Windows key, type Command Prompt, right click and open as administrator*)\n3. **Disable HDCP** (*Paste in the command below to update your registry, checking that the ID matches your GFX and then press enter)*\n4. **Restart your PC**\n\n`reg add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e968-e325-11ce-bfc1-08002be10318}\\0000\" /v \"RMHdcpKeyglobZero\" /t \"REG_DWORD\" /d \"1\" /f`\n\nI hope it can help others - it was driving me mad!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piaaqu/how_to_fix_your_monitor_going_black_when_opening/"
    },
    {
        "id": "1phedey",
        "author": "DetectiveHot2071",
        "title": "50 Cent claims Diddy sent him ‘creepy’ gift from prison after explosive Netflix doc",
        "content": "",
        "upvotes": 83,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1phedey/50_cent_claims_diddy_sent_him_creepy_gift_from/"
    },
    {
        "id": "1pi3zk9",
        "author": "curiouscat_20",
        "title": "Series/Movies Reco",
        "content": "I want to watch series or movie which will give different prospective and has different story than typical family/love drama. Don’t want to watch horror or crime. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pi3zk9/seriesmovies_reco/"
    },
    {
        "id": "1phlklm",
        "author": "Butterscotch8721",
        "title": "Homeland, is anyone else watching this?",
        "content": "If you have watched or are currently watching what are your thoughts on Carrie?\n\nI'm only on season 4 but the more I watch her the more I dislike her. I know her character is meant to be unstable but I also find her incredibly selfish and manipulative. I'm not sure I can even finish the entire series but maybe it'll get better. ",
        "upvotes": 30,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1phlklm/homeland_is_anyone_else_watching_this/"
    },
    {
        "id": "1phyz8q",
        "author": "BiploarFurryEgirl",
        "title": "Has anyone else noticed that subtitles are suddenly not correct on translated shows?",
        "content": "I love Ragnarok. I’ve watched it about 4 times and I started my 5th watch today, but I don’t remember the subtitles being this wrong. The third episode is especially glaring. I’m so confused on what happened, like thank god I’ve watch the show before so I wasn’t confused when the subtitles during the therapist’s and Ran’s conversation shows the therapist (via subtitles) saying that he SHOULD be telling Ran the things Magna had just told him, when in reality the actual conversation (via audio) says that he shouldn’t be saying these things. My fiance was confused though so I had to pause to explain. And that’s just one of many translation issues in this episode.\n\n\nI’m so confused, this show was pretty well translated about a year ago? What happened?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1phyz8q/has_anyone_else_noticed_that_subtitles_are/"
    },
    {
        "id": "1pi4p68",
        "author": "Fickle_Memory4327",
        "title": "Frankstein - Review",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pi4p68/frankstein_review/"
    },
    {
        "id": "1php4g8",
        "author": "Temporary_Egg_1633",
        "title": "NEED THRILLER/MYSTERY/HORROR SERIES RECOMENDATIONS PLEASE &lt;3",
        "content": "I am struggling to find a thriller/mystery/dark/horror/apocalypse/monsters serie that I like. Some examples that I watched are Dark, Bodies, 1988, Beyond Evil, Mask Girl, Sweet Home, All Of Us Are Dead, Kingdom, Alice in Borderland, Hellbound, Strangers From Hell, The Silent Sea, GyeongSon Creature, Happiness, The OA, American Horror Story and Stories, and more that I forgot.\n\nCan someone please lighten my night and recommend me something. It's been days trying to see something new and I get bored at 20min.\n\nThank you!!!! &lt;3\n\nEdit: I have Netflix and Disney+ :)))",
        "upvotes": 10,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1php4g8/need_thrillermysteryhorror_series_recomendations/"
    },
    {
        "id": "1pgdmxt",
        "author": "Swamp_Hawk420",
        "title": "Canceling my subscription, this is too ridiculous",
        "content": "I’m traveling right now about a thousand miles from home. It’s late, I can’t sleep, tried to throw on a movie, and got notified that Netflix has decided that I’m trying to commit fraud by watching tv outside of my house. The account is linked to my wife’s email so I can’t get the temporary password. The fact that they treat us like we’re trying to steal from them after paying so much is just a bridge too far. ",
        "upvotes": 6214,
        "comments": 398,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdmxt/canceling_my_subscription_this_is_too_ridiculous/"
    },
    {
        "id": "1pi7nk5",
        "author": "Ms_Dontworryaboutit",
        "title": "The ads!",
        "content": "Has Netflix lost their mf minds with these ads??? Its worse than YouTube! I pay enough already, I cant fast forward or rewind without atleast 3 damn ads! Wtf. Really pisses me off and ruins the viewer experience. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pi7nk5/the_ads/"
    },
    {
        "id": "1pi2dfo",
        "author": "Prowling_Owl",
        "title": "Halo season 3",
        "content": "So from what I gather is Paramount+ has officially canceled the production in 2024. Since Netflix picked up the franchise off of paramount and had huge success and influx of viewers customers etc. Why doesn’t Netflix just buy the rights to the show so they can continue to make good shows? Sick show so far love it and dreading the end of season 2 being left on a cliff hanger I’m sure 🙄 ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pi2dfo/halo_season_3/"
    },
    {
        "id": "1pht5w9",
        "author": "buzz72b",
        "title": "Anyone having buffer issues all the sudden?",
        "content": "I’ve had the same fios gigabit internet for 6 years… never, ever had a buffer unless it was something like that goofy Tyson fight… everything on Netflix now buffers for 20 seconds before it starts i have even had a few buffer freezes that I had to reboot systems.  Started  about a month or so ago… different devices to that all show good signal (Roku stick, internal tv apps etc)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pht5w9/anyone_having_buffer_issues_all_the_sudden/"
    },
    {
        "id": "1phvaeu",
        "author": "eartotheshell99",
        "title": "“And the Nominees Are!” – The St. Louis Film Critics Association announces their 2025 Film Nominations",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1phvaeu/and_the_nominees_are_the_st_louis_film_critics/"
    },
    {
        "id": "1phpli0",
        "author": "cumbrutha",
        "title": "Audio desync issue, unable to find a fix... any suggestions?",
        "content": "I just got a new TV (LG C4 OLED) that I'm using with a Google TV streamer, and I'm noticing a pretty significant audio/video desync when watching anything-- specifically, the audio seems to be several hundred milliseconds earlier than the video. Only Netflix seems to have this issue, and it seems to be consistent across all the content I've tried.\n\nI've seen several other posts with the same issue, and tried some of the suggested fixes to no avail. I've tried switching the audio in the app from \"English 5.1\" to \"English\", I've disabled all surround sound on the Google TV (so just using PCM), I've restarted both the TV and streamer, and a few other things. Has anybody with the same issue found a solution? Any and all suggestions appreciated, thanks.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1phpli0/audio_desync_issue_unable_to_find_a_fix_any/"
    },
    {
        "id": "1phua7q",
        "author": "TheSleepyTeeDJ",
        "title": "Netflix app and Apple TV",
        "content": "I have an Apple TV 128 4K plugged into ethernet by way of a router extension. I pay for the top settings with Netflix (4k and whatever else). I also have 2.5 gig internet connected to a pretty nice tp link router, so that’s no problem. \nEvery app works great on my 85” highsense tv (with the Apple TV) except Netflix. It looks like garbage. \nI had the App set to auto for quality and eventually set it to the highest settings instead of auto. And it looked great for 20 seconds after the change and then gave the buffer wheel for a brief second and looked like garbage again. I am aware that I live in an old house with thick walls and shitty WiFi movement. But every other app looks great. And Netflix does not. And I pay the most out of all of them for their 4k streaming. What am I doing wrong?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1phua7q/netflix_app_and_apple_tv/"
    },
    {
        "id": "1phnki6",
        "author": "Western-Mall5505",
        "title": "Playing the games with friends",
        "content": "Does anyone on here know if you can play games like pictionary with friends who are in other house holds?\nThe crappy ai thing that pops up when you googled says yes, but I couldn't find anything on Netflix faq.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1phnki6/playing_the_games_with_friends/"
    },
    {
        "id": "1ph74e3",
        "author": "RedditBurner_5225",
        "title": "Sean combs the reckoning",
        "content": "Who did Diddy and his son Justin shoot in the bathroom? Who is G? Did anyone figure that out?\n\nAlso, why was he having freakoffs with his son Justin?! That is beyond insane.\n",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ph74e3/sean_combs_the_reckoning/"
    },
    {
        "id": "1pi1rng",
        "author": "AdministrationNo5052",
        "title": "This is new policy is ridiculous",
        "content": "I haven’t had Netflix for 2 years and now while I’m abroad for study I try to again subscribe for my account, I now wish I never tried to. Firstly after 20 attempts I somehow get into my account because my email apparently just vanished from Netflix servers. I choose subscription, get to pay, authorise card by the app and there is no possibility to get payment approved. Contacted support and they say  “well, to successfully subscribe you need to pay with local bank card”. WHERE AND HOW do you want me to get not just bank account but BANK CARD in the country where I don’t know if I have right to open a bank account and where I don’t want to open bank account, I don’t even use my local bank card when I’m home because of fraud attempts, I pay everything with either Revolut or Wise. \nSo if anyone knows a way to watch Diddy documentary without having Netflix pls help or I’ll just wait 3 months for it till I come back home, as lucky as I am by that time probably Diddy will get it off the Netflix 🥲",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pi1rng/this_is_new_policy_is_ridiculous/"
    },
    {
        "id": "1phnoqn",
        "author": "conniewanders",
        "title": "Anyone else watching Ripple? Lovely bit of cheese",
        "content": "\n\nSo I just randomly clicked on Ripple after it popped up in my Netflix suggestions. Watched the trailer, thought “this could either be really lovely or painfully cheesy”, and decided to give episode 1 a go.\n\nI’m actually really into it so far. Feels like the right mix of heartwarming and emotional without going full Hallmark cheese (no offence to any hallmark fans out there)\n\nI also love that there are some familiar faces... Ezra from PLL (Ian Harding) is in it, and Frankie Faison, who I remember from The Wire and Coming to America. \n\nPLL fans will appreciate this: there’s a scene where Ian Harding’s character is chatting with a woman about a musician and her name is Aria. I actually lol’d at that. Someone in the writers’ room knew exactly what they were doing.\n\nAnyone else watching?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1phnoqn/anyone_else_watching_ripple_lovely_bit_of_cheese/"
    },
    {
        "id": "1phy3ou",
        "author": "DoctorSyndrome",
        "title": "Here's an idea!",
        "content": "How about actually loading your videos before starting to play them instead of ruining any potential suspense or immersion by playing sound while the actual video is still loading? In other words, at least do the bare minimum of your job, because your upcoming deal won't do crap unless people aren't getting fed up watching your janky platform.\n\nEdit: for those who have commented so far and others like them, just because you don't have this issue, that doesn't mean there aren't people who do deal with it. Everyone I know struggles with loading issues or crashing from Netflix. Maybe it's a regional issue. I don't know. But it IS an issue.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1phy3ou/heres_an_idea/"
    },
    {
        "id": "1phlf1u",
        "author": "itsleget",
        "title": "Can't download anything, I have no registered download devices.",
        "content": "Pretty much what it says in the title, I had downloaded previously with no issues and I've decided to delete it all to redownload more stuff before my flight home on Wednesday, only it's not letting me download quoting my maximum download allowance (15 per device for 2 devices obviously.) I've tried clearing cache/data on my device, logging me out via the website and clearing my downloaded devices (I have 0/2) and still nothing. The Netflix website is utterly useless in telling me anything but upgrading my plan. Anybody know what I could do about this? Thanks",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1phlf1u/cant_download_anything_i_have_no_registered/"
    }
]