[
    {
        "id": "1j7x3ld",
        "author": "BrothersAfterWar",
        "title": "Hi /r/movies! We are Gary Sinise &amp; Jake Rademacher. Executive producer &amp; director of BROTHERS AFTER WAR, a documentary that highlights the experiences of our nation's veterans, out in theaters now. You might also know Gary from Forrest Gump, Apollo 13, Of Mice and Men, CSI: NY. Ask us anything!",
        "content": "",
        "upvotes": 150,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l11drnuyoune1.png?auto=webp&amp;s=e165456b8b936b42f349a39bba4e1708ecc9c020"
        },
        "permalink": "/r/movies/comments/1j7x3ld/hi_rmovies_we_are_gary_sinise_jake_rademacher/"
    },
    {
        "id": "1j7ygpx",
        "author": "AgentSkidMarks",
        "title": "The New Literalism Plaguing Today’s Biggest Movies - The New Yorker",
        "content": "",
        "upvotes": 919,
        "comments": 418,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rwgNbYRy0HW0mbMiuvfG6DBbSNATMnzONdukjcAEHZg.jpg?auto=webp&amp;s=53b2c2085adbf49672bee9aaf019170113c6914a"
        },
        "permalink": "/r/movies/comments/1j7ygpx/the_new_literalism_plaguing_todays_biggest_movies/"
    },
    {
        "id": "1j7tlue",
        "author": "Robemilak",
        "title": "Matthew McConaughey on Returning to Acting After a Six-Year Hiatus With ‘The Rivals of Amziah King’ and Why His Season of ‘True Detective’ Is the Best",
        "content": "",
        "upvotes": 1849,
        "comments": 207,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yq7fpcJv0JE_W134zsVYSecIB5ivxhLm7e3g4HPht3s.jpg?auto=webp&amp;s=1ed10ac5736b98dcb3c65fc3c4ddfaf75ead5842"
        },
        "permalink": "/r/movies/comments/1j7tlue/matthew_mcconaughey_on_returning_to_acting_after/"
    },
    {
        "id": "1j7y1b2",
        "author": "AporiaParadox",
        "title": "Characters who ended up being deleted entirely in the final cut",
        "content": "Deleted scenes are a common thing in movies, but not as common is when an entire character is cut out and every single scene they were meant to be in is removed or edited. The actor still got paid at least, but all of their efforts were for naught.\n\nFor example, all of Christopher Lee's scenes as Saruman were left out of the Return of the King theatrical cut, meaning his character never got any closure. Christopher Lee was understandably not happy about that. Fortunately his scenes were restored in the Extended Edition.\n\nPeeves the Poltergeist from the books was meant to be in the first Harry Potter movie played by Ril Mayall, but his scenes were cut, never even shown on the DVD release, and he never appeared in any of the sequels either. He did still pop up in the videogame adaptations though.\n\nSo what other notable cases are there of entirely cut characters?",
        "upvotes": 262,
        "comments": 328,
        "media": null,
        "permalink": "/r/movies/comments/1j7y1b2/characters_who_ended_up_being_deleted_entirely_in/"
    },
    {
        "id": "1j7wl12",
        "author": "NewMonitor9684",
        "title": "What is the most controversial film you have ever watched?",
        "content": "*In the Realm of the Senses* (1976) is a controversial film directed by Nagisa Ōshima, based on the true story of Sada Abe, a woman whose obsessive relationship with her lover led to a shocking crime in 1930s Japan. The film explores themes of passion, power, and sexuality, pushing boundaries with its explicit content and challenging societal norms. Its raw depiction of human desire and taboo subjects has made it both acclaimed and polarizing.",
        "upvotes": 338,
        "comments": 579,
        "media": null,
        "permalink": "/r/movies/comments/1j7wl12/what_is_the_most_controversial_film_you_have_ever/"
    },
    {
        "id": "1j81nc2",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Mike Flanagan's 'The Life of Chuck' - A life-affirming, genre-bending story based on Stephen King's novella about three chapters in the life of an ordinary man named Charles Krantz",
        "content": "",
        "upvotes": 155,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5k5jwxcmuvne1.jpeg?auto=webp&amp;s=2170fe34d5f5785bc586e771cf70163ad70c423c"
        },
        "permalink": "/r/movies/comments/1j81nc2/official_poster_for_mike_flanagans_the_life_of/"
    },
    {
        "id": "1j7h29e",
        "author": "MarvelsGrantMan136",
        "title": "‘Ne Zha 2’ Tops $2B In China, Passes ‘Avengers: Infinity War’ to Become No. 6 Movie Ever Worldwide",
        "content": "",
        "upvotes": 2251,
        "comments": 394,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ztOhrwbpmxsS_dLtIwaOhiQsjj_68vMXOXLMUX7EpmM.jpg?auto=webp&amp;s=d469a559c3e317ee208284839fdaf9272e78b96e"
        },
        "permalink": "/r/movies/comments/1j7h29e/ne_zha_2_tops_2b_in_china_passes_avengers/"
    },
    {
        "id": "1j7ydti",
        "author": "Affectionate_Owl_619",
        "title": "Which actors are the best at changing their voice with each role? Not just their accent, but their cadence, pitch, etc.",
        "content": "I've heard people mention actors like  James Spader and RDJ (outside of Tropic Thunder) that are phenomenal at what they do, but the way they talk is almost the same in every role. Who are some on the other side of the spectrum where if you closed your eyes, you wouldn't even know it was them? And I don't mean like how Hugh Jackman can effortlessly change accents, but someone who can play different characters with the same accent but can still make them sound convincingly difference. Voice actors excluded since that's their whole job. ",
        "upvotes": 68,
        "comments": 228,
        "media": null,
        "permalink": "/r/movies/comments/1j7ydti/which_actors_are_the_best_at_changing_their_voice/"
    },
    {
        "id": "1j815qs",
        "author": "timeforknowledge",
        "title": "The War Zone (1999) - the actual most messed up movie of all time...",
        "content": "&gt; After his family relocates from London to rural Devon, sullen British teen Tom (Freddie Cunliffe) spends most of his time moping about the house. When he inadvertently discovers an incestuous relationship between his older sister, Jessie (Lara Belmont), and their father (Ray Winstone), the revelation threatens to have dire consequences. The mother of the family (Tilda Swinton), unaware of the dark secret, has recently given birth, and the siblings must contend with the harrowing situation.\n\nI just want to know why, I watched it years ago and it still haunts me. Why was this ever created? \n\nYou can't tell anyone you've seen it. \n\nYou can't tell anyone to watch it. \n\nYou can't tell anyone anything about it. \n\nIt just cannot be publicly discussed because the subject is just so unbearable.\n\n&gt; At a public screening of this movie during the 1999 Toronto International Film Festival, one viewer was so upset and devastated that he rose to his feet and shouted that he couldn't take any more, then headed for the exit, intending to pull the fire alarm.\n\n&gt; According to director Tim Roth, the bunker scene was so difficult to film that the sound man almost ruined a take by crying into his microphone. \n\n&gt; The bunker scene was very difficult for Ray Winstone, also because Lara Belmont was the same age as Ray's real life oldest daughter. \"I was great until I got to the scene, I couldn't do it. I went, 'what the fuck am I doing here in this movie, what are we making this for?' And my bottle completely and utterly went, and I'm having a go at Tim, I said, 'there's something wrong with you, you know. You're fucking making films like this, what do you call this?' And I became my dad for a minute you know, 'you call this entertainment? This ain't fucking entertainment.' I went right kind of like a film critic for a minute.\n\nWe discuss many other movies that are scary or sad or cover difficult topics, but none of them have had those sorts of reactions... \n\nThis is why I think this is the actual most messed up movie. Not just because the subject is so hard but because the filming was so awful and the movie leaves you so depressed and alone because you wouldn't want to discuss and share the sadness with anyone else. ",
        "upvotes": 25,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1j815qs/the_war_zone_1999_the_actual_most_messed_up_movie/"
    },
    {
        "id": "1j7k4gy",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Frankie Muniz - Tuesday 3/18 at 3:00 PM ET - Star of Malcolm in the Middle, Agent Cody Banks, Big Fat Liar, Renner, and Racing Stripes",
        "content": "",
        "upvotes": 458,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4kam9ezduqne1.png?auto=webp&amp;s=9aeec389e19ec328ee80342097accb21dbe8f266"
        },
        "permalink": "/r/movies/comments/1j7k4gy/amaqa_announcement_frankie_muniz_tuesday_318_at/"
    },
    {
        "id": "1j7ncwj",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Jack Quaid - Wednesday 3/12 at 12:00 PM ET - Star of Companion, Novocaine, The Boys, Scream, Oppenheimer, Star Trek: Lower Decks, and Logan Lucky.",
        "content": "",
        "upvotes": 233,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7s2138nmmrne1.png?auto=webp&amp;s=12a895e51dda647ef57fc4c7cf1320aef86434c4"
        },
        "permalink": "/r/movies/comments/1j7ncwj/amaqa_announcement_jack_quaid_wednesday_312_at/"
    },
    {
        "id": "1j7udbr",
        "author": "oliverjaamess283",
        "title": "Which movie made you cry the most?",
        "content": "I want to watch a good emotional movie but can't decide what to pick. I even searched on Google, but the options were overwhelming, and now I'm confused. Can you guys suggest some movies with a really strong storyline that will leave a lasting impact? I'm looking for something truly heartfelt! I’d love to hear what made you emotional. Thanks in advance",
        "upvotes": 59,
        "comments": 383,
        "media": null,
        "permalink": "/r/movies/comments/1j7udbr/which_movie_made_you_cry_the_most/"
    },
    {
        "id": "1j7jy9g",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Kelly Marie Tran - Monday 3/17 at 12:00 PM ET - Star of Raya and the Last Dragon, The Croods: A New Age, Control Freak, Star Wars: The Last Jedi, The Wedding Banquet",
        "content": "",
        "upvotes": 336,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/49vp0oxwsqne1.png?auto=webp&amp;s=985e2532b5ce503e69f4a58e619d42d06054d00d"
        },
        "permalink": "/r/movies/comments/1j7jy9g/amaqa_announcement_kelly_marie_tran_monday_317_at/"
    },
    {
        "id": "1j7ptf4",
        "author": "milliondollardrift",
        "title": "If every frame is a painting, what movies do you believe best embody that philosophy?",
        "content": "I’m looking for movies whose every shot, or a great many of its shots, have a carefully planned and deliberate beauty to them, shots whose viewers could pour over for hours, or even hang on the wall in a museum. Any such powerhouses of aesthetic and meaningful beauty come to mind? I’ll welcome suggestions of any time period, medium, and country of origin.",
        "upvotes": 129,
        "comments": 570,
        "media": null,
        "permalink": "/r/movies/comments/1j7ptf4/if_every_frame_is_a_painting_what_movies_do_you/"
    },
    {
        "id": "1j7mccd",
        "author": "Big_Accident494",
        "title": "What Movie Shocked You With Their First Act",
        "content": "  Just Saw Executive Decision with my Father last night. \n\n   I was expecting the run of the mill action movie with Steven Segal killing bad guys with ease until he gets to the final boss.\n\n   But, I was shocked when he died in the first act. This actually made the movie more suspenseful, and entertaining. ",
        "upvotes": 223,
        "comments": 268,
        "media": null,
        "permalink": "/r/movies/comments/1j7mccd/what_movie_shocked_you_with_their_first_act/"
    },
    {
        "id": "1j7a8u8",
        "author": "kookookachu26",
        "title": "Great movies that have an abysmal cult following?",
        "content": "The biggest culprit of this I think HAS to be the wolf of Wall Street. Everyone watched that movie and all the young people of the world thinks that they are now a financial expert and stock broker. I really truly think that this movie is what popularized all the efforts to make it big off of meme coins and penny stocks. I have seen so many different reels of people who have clearly watched this movie and start using words like, “price position,” and “leveraged,” when we all know they don’t know at all what they are talking about. \n\nThat being said, I do think that the wolf of Wall Street is a great movie and is one of Scorsese’s best films to date… it just gets slightly tarnished by the awful cult following it has. ",
        "upvotes": 1073,
        "comments": 880,
        "media": null,
        "permalink": "/r/movies/comments/1j7a8u8/great_movies_that_have_an_abysmal_cult_following/"
    },
    {
        "id": "1j7s1cx",
        "author": "Wallaby_Thick",
        "title": "What's the best beginning movie that ends the worst?",
        "content": "I just watched Vivarium. I thought it was great at first, be I kept wanting to know why. Towards the end of the movie, you think you're going to know why. Then the end comes, and you still never figure out why. To my best understanding, aliens. But why? There's no reason. I would guess that it maybe a way to eradicate humans, but that's a terrible way to do it if you're aliens. What do you think? ",
        "upvotes": 66,
        "comments": 281,
        "media": null,
        "permalink": "/r/movies/comments/1j7s1cx/whats_the_best_beginning_movie_that_ends_the_worst/"
    },
    {
        "id": "1j6xfq3",
        "author": "Vanderlyley",
        "title": "Paramount Posts $286M Fourth Quarter Streaming Loss",
        "content": "",
        "upvotes": 10683,
        "comments": 1272,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FRXeGK0eWl04ZUB1PqPZq7OlIJrxW-4dRwNMk2-GlWc.jpg?auto=webp&amp;s=135184559ba88e0a345bdc1617bf4d57a1bc9882"
        },
        "permalink": "/r/movies/comments/1j6xfq3/paramount_posts_286m_fourth_quarter_streaming_loss/"
    },
    {
        "id": "1j82cjl",
        "author": "JaguarNeat8547",
        "title": "Recommend a movie about friendship",
        "content": "Had a birthday yesterday and i'm feeling nostalgic about the past. Thinking back to the people i've known. Good friends that i thought would last forever that have just faded away. Friends that seem to dip in and out of my life at odd or appropriate times. Or those friends that are just always there when you need them.\n\n  \nTime is the key factor here. Not looking for movies about friendship per se, but about how a friendship has evolved (either good or bad) or stood over time.\n\nMaybe an example would be Butch Cassidy and the Sundance Kid as two friends who were always there to the very end, but maybe i'm looking more for movies where the friends drift in and out of each other's lives. But whatever you've got, give me your recs.\n\n  \nThanks!",
        "upvotes": 8,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1j82cjl/recommend_a_movie_about_friendship/"
    },
    {
        "id": "1j831ak",
        "author": "Zhukov-74",
        "title": "Creator to Creator: Neil Druckmann (The Last of Us) &amp; Alex Garland (28 Years Later)",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8OJ715F4XWvnbRQJ6JbaE8SirWsngoKv7FoRBs9Mfsw.jpg?auto=webp&amp;s=96dae18381bfbbb2b3d085398028df5241957a02"
        },
        "permalink": "/r/movies/comments/1j831ak/creator_to_creator_neil_druckmann_the_last_of_us/"
    },
    {
        "id": "1j7bkkt",
        "author": "mayukhdas1999",
        "title": "First Poster for 'DESCENDENT' - follows Sean Bruner, a man racked by trauma as the birth of his first child approaches. Discovering a mysterious beam of light during a graveyard shift, Bruner reawakens with visions of extraterrestrials and a slippery sense of reality | From producers Moorhead-Benson",
        "content": "",
        "upvotes": 579,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vpond5quzone1.jpeg?auto=webp&amp;s=4c2b7f195dbc4fa958a2b689a4a37ea0ac095277"
        },
        "permalink": "/r/movies/comments/1j7bkkt/first_poster_for_descendent_follows_sean_bruner_a/"
    },
    {
        "id": "1j7zvsc",
        "author": "artpayne",
        "title": "With Amazon's recent James Bond takeover and all the talk, this rooftop scene from The International (2009) is the closest we've gotten to see Clive Owen as 007.",
        "content": "",
        "upvotes": 9,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F7LyJK7tE4nN7e-e2er4AmIPWH9SLzlGH_dT--svTUY.jpg?auto=webp&amp;s=021cdbcc2dbf4499acba82e591cdc564530beb63"
        },
        "permalink": "/r/movies/comments/1j7zvsc/with_amazons_recent_james_bond_takeover_and_all/"
    },
    {
        "id": "1j769o2",
        "author": "MarvelsGrantMan136",
        "title": "‘Jaws’ at 50: Celebrating the Film That Forever Haunted Our Oceans",
        "content": "",
        "upvotes": 1166,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OJWhgL81Xiw6Xcvku7h2OCDSjFW8NCH-0vVVVo7Kp-I.jpg?auto=webp&amp;s=a742d92280b2c53629bee9ad710758a536936aef"
        },
        "permalink": "/r/movies/comments/1j769o2/jaws_at_50_celebrating_the_film_that_forever/"
    },
    {
        "id": "1j7jdvp",
        "author": "Blacklagoonballoon",
        "title": "What is an action scene that stuck with you?",
        "content": "Doesn’t have to be your favorite or the best, but just a scene that hit or you still think back to. Key word is action so it can be a fight, training montage, chase, or anything where the actors are doing more than saying. \n\nIt can also be simple too, like just a few cuts that you think back to a lot. I’m just curious to hear what scenes stuck with you.\n\nEdit: These answers are incredible. Thank you! ",
        "upvotes": 168,
        "comments": 928,
        "media": null,
        "permalink": "/r/movies/comments/1j7jdvp/what_is_an_action_scene_that_stuck_with_you/"
    },
    {
        "id": "1j7hgm8",
        "author": "ChiefLeef22",
        "title": "'The Accountant 2' - Review Thread",
        "content": "*Christian Wolff (Ben Affleck) has a talent for solving complex problems. When an old acquaintance is murdered, leaving behind a cryptic message to \"find the accountant,\" Wolff is compelled to solve the case. Realizing more extreme measures are necessary, Wolff recruits his estranged and highly lethal brother, Brax (Jon Bernthal), to help.*\n\n**Rotten Tomatoes:** [86%](https://www.rottentomatoes.com/m/the_accountant_2/reviews)\n\n**Metacritic:** [58/100](https://www.metacritic.com/movie/the-accountant-2/)\n\nSome Reviews:\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/the-accountant-2-review-ben-affleck-1236332243/)\n\n&gt;To me, this franchise had nowhere to go but up. And that, I’m pleased to say, is exactly what happened. The Accountant 2 is an agreeably loopy hyperviolent good time. It is one of the only thrillers I’ve seen you could characterize as a hangout movie.\n\n[The Hollywood Reporter - Lovia Gyarkye](https://www.hollywoodreporter.com/movies/movie-reviews/the-accountant-2-review-ben-affleck-jon-bernthal-1236158676/)\n\n&gt;The puzzle at the center of *The Accountant* *2* matters insofar as the film needs a narrative propellant. But Bernthal and Affleck are the real draw, and O’Connor knows this. He uses any opportunity to get the brothers talking, and follows each major development in the fictional case with a moment of brotherly bonding. And while this critic would have welcomed more restraint in the violence, which can have an inuring effect, fans of the first film will find plenty to admire and root for in this entertaining fraternal union.\n\n[DEADLINE - Glenn Garner](https://deadline.com/2025/03/the-accountant-2-review-ben-affleck-jon-bernthal-sequel-sxsw-1236306104/)\n\n&gt;Although sequels rarely surpass the original, Gavin O’Connor’s long-gestating *The Accountant 2* is a pleasant surprise. The familial dynamics in the movie manage to tug at the heartstrings. And while everyone’s arc might not wrap up the way audiences hope, they all find what they truly need, whether it’s a stray cat, the perfect office chair or some good old fashion vengeance.\n\n[JoBlo's Movie Network - Chris Mumbray](https://www.joblo.com/the-accountant-2-sxsw-review-affleck-and-bernthal-are-a-great-buddy-movie-combo/)\n\n&gt;I’m not complaining, though—as a meat-and-potatoes action fan, I’ve been starving for a film like this. I love the sleek 87North-style action flicks that are in favour now, but *The Accountant 2* is old-school in a way I’ve been missing. The extra emphasis on characterization only sweetens the pot.\n\n[The Guardian - Adrian Horton](https://www.theguardian.com/film/2025/mar/09/the-accountant-2-review-ben-affleck)\n\n&gt;Still, sentiment aside, this is a movie of cinematic adrenaline and ludicrous set-ups – ironically for its hero, stupid pleasures, but the fun kind of stupid, the kind that draws loud cheers from a crowd at a SXSW premiere and gets people streaming on the couch. It’s neither groundbreaking nor exceptional, but it does deliver above the admittedly low bar for a questionable sequel, with enough juice for another at-home hit.\n\n[Screen Rant - Graeme Guttmann](https://screenrant.com/the-accoutant-2-review/)\n\n&gt;***The Accountant 2***'s best scenes have nothing to do with guns or hand-to-hand combat. In fact, when I saw the film last night at its SXSW world premiere, the audience was laughing along with it more than they were gasping when Jon Bernthal breaks a man's neck over a cinder block or Ben Affleck smashes a gun into someone's face. It's not at all what I expected, but I think I loved every second of it.\n\n[Slash Film - Ryan Scott](https://www.slashfilm.com/1806843/the-accountant-2-review/)\n\n&gt;Is it sometimes outlandish? Completely, but since when did movies have to be realistic? Escapism often works very well when we can leave reality behind. What I can say with confidence is that anyone who enjoyed \"The Accountant\" will undoubtedly enjoy this follow-up. It's rare that sequels outdo what came before, but O'Connor manages to do so here. This is pure popcorn entertainment, executed effectively. Let me put it this way: If they make three more \"Accountant\" movies, I will watch three more \"Accountant\" movies. Honestly, I hope they do.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/the-accountant-2-review-ben-affleck-and-jon-bernthal-are-back-with-a-winning-formula/5202769.article)\n\n&gt;There’s a B-movie purity to how this franchise conducts its business, eschewing the flash of modern blockbusters for a more pummelling, elemental approach to its shootouts and hand-to-hand fight scenes. On top of that, *The Accountant 2* has added a winning sense of humour to the equation.\n\n[Roger Ebert - Brian Tallerico](https://www.rogerebert.com/reviews/the-accountant-2-movie-review-2025)\n\n&gt;The truth is that pacing often trumps realism, and “The Accountant 2” just doesn’t build enough momentum. I think one of the reasons for that is that O’Connor is far more interested in the brother buddy comedy than the human trafficking action film, and never quite figures out how to blend the two. The film about two very different brothers who try to bridge the chasm of personality between them? Almost completely works. Everything else? Total hokum. Merging the two becomes an assignment too difficult for even The Accountant to decipher.\n\n[Loud and Clear - Wesley Hunt](https://loudandclearreviews.com/the-accountant-2-film-review/)\n\n&gt;If you liked the original *Accountant* for its grit and stunt work, *The Accountant 2* is something radically different in tone and pacing, and may be a bit of a jarring transition. O’Connor’s effort to make a sequel which is not just a remake of the original is commendable, but in terms of **shifting genre from film noir to comedy**, it will appeal to different people for different reasons. There is an argument to be made for either film in the series being the superior installment, and some people will hate the sequel for the same reasons people like it. \n\n[The Wrap - Matt Donato](https://www.thewrap.com/the-accountant-2-review-ben-affleck-john-bernthal/)\n\n&gt;“The Accountant 2” surpasses its original by keying into a lenient and dangerously playful tone. Affleck is charming and vulnerable as Christian in moments where he’s just living everyday life, trying to navigate the anxious minefield of dating or friendships through his exceptional perspective. It’s not the sequel you’d expect, which is a compliment. Bernthal’s the unexpected MVP despite Affleck’s leading role, but the real treat is how “The Accountant 2” becomes a wholesome and heart-pumping family affair.\n\n[Next Best Picture - Matthew Creith](https://nextbestpicture.com/the-accountant-2/)\n\n&gt;Bernthal and Affleck are top-notch, though, with a whacky script from “The Accountant” writer Bill Dubuque, returning to the screen with dialogue that belongs more in the “The Hangover” franchise than a supposedly sleek thriller, hard-hitting action thriller (which is surprisingly light on the action). We know Gavin O’Connor is capable of telling far more compelling stories, as demonstrated in “Warrior,” “Miracle,” and even “The Way Back,” and although “The Accountant 2” is funnier than the first, it’s not as engrossing in scope and scale, making it a messy sequel that lacks ambition and ingenuity.\n\n[IndieWire - Christian Zilko](https://www.indiewire.com/criticism/movies/the-accountant-2-review-ben-affleck-jon-bernthal-1235102308/)\n\n&gt;At its heart, “The Accountant 2” is a story of brothers working through their drama through drunken nights at honky tonk bars and deep conversations on the roof of an Airstream. I’m still not convinced this franchise exists for any reason other than Affleck being jealous that Matt Damon won the coin toss to decide who got to play the math genius in “Good Will Hunting,” but it manages to offer more heart and more laughs the second time around.\n\n[The Playlist - Chase Hutchinson](https://theplaylist.net/the-accountant-2-review-ben-affleck-jon-bernthal-fight-for-the-buddy-comedy-in-a-sad-excuse-of-an-action-movie-sxsw-20250309/)\n\n&gt;One hesitates even to call it an action film save for a climactic shootout that feels obligatory more than it does exciting or well-staged; there aren’t any moments of creative fights we get to sit with for more than a few seconds. Much of this is by design, as the film seems to want to be just about the relationship between the two brothers and is at its best when it leans into this, but it also can’t get out of its own way either.\n\n[The Mary Sue - Rachel Leishman](https://www.themarysue.com/the-accountant-2-review/)\n\n&gt;So maybe what I really want is a road trip movie with these two. Or just a buddy cop movie. But without Chris and Brax’s relationship, *The Accountant 2* would feel like a lukewarm sequel that didn’t need to happen. Luckily, we have Bernthal and his iconic grunting fighting style to keep us invested throughout the slightly bloated runtime.",
        "upvotes": 190,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OVNKRRb52PNW-iICiLR5_oZye5jOH3G3U_rjAbbvP9k.jpg?auto=webp&amp;s=6484ca2653c8165421929e6529efcaa346dc719b"
        },
        "permalink": "/r/movies/comments/1j7hgm8/the_accountant_2_review_thread/"
    },
    {
        "id": "1j82g4n",
        "author": "Forward_Bite9256",
        "title": "Movies scenes that make you think of the trailer",
        "content": "I've been going through a Jurassic Park marathon with my son leading up to rebirth this summer. While watching Jurassic Park 3, I was somehow reminded of the trailer for the movie from almost 25 years ago. I don't know how, but I specifically remember hearing \"Jump Billy!\" from the trailer. Same for The Sum of all Fears \"the bomb is in play!” and Pirates of the Caribbean \"...you like pain, try wearing a corset\". \n\nAre there any other movies or movie scenes that immediately remind you of the trailer itself?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1j82g4n/movies_scenes_that_make_you_think_of_the_trailer/"
    },
    {
        "id": "1j7p7hg",
        "author": "Catcaves821",
        "title": "I need recommendations for my movie rot day coming up.",
        "content": "I have a day coming up to recharge and turn my brain off. please recommend some movies based on the following genres: I like horror, true crime, documentaries, comedy, indie films, films that blow your mind. I am not a big super hero movie person, and not a big rom com person. I am open to old or new films. ",
        "upvotes": 47,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1j7p7hg/i_need_recommendations_for_my_movie_rot_day/"
    },
    {
        "id": "1j7e02s",
        "author": "Medicinema_Podcast",
        "title": "Interview with Flow (2024) Animation Supervisor Pierre Mousquet",
        "content": "",
        "upvotes": 210,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QlRRkr_0qL9OtZot6ZduZ-EU7OFmsctkv7MOlN3dUEA.jpg?auto=webp&amp;s=6e023f95f427d4ca55a91e6e2a99fe1fdfdf48bf"
        },
        "permalink": "/r/movies/comments/1j7e02s/interview_with_flow_2024_animation_supervisor/"
    },
    {
        "id": "1j7swun",
        "author": "randomvegasposts",
        "title": "No one talks about REALLY old movies on this thread. So I pose the question. Buster Keaton or Charlie Chaplin",
        "content": "I feel like people who haven't watched the movies will immediately go Chaplin.  He has the most iconic roles.  (The great dictator, the kid, modern times)... \n\nBut Keaton might be the greatest stunt man of all time.  Not just actor stunt man (cruise, and chan) But overall, what he did with practical effects was amazing. \n\nI also think that Sherlock jr. Hits every emotional beat of the kid or modern times.  \n\nIt's really close.. but i still go with Chaplin. \n\nOld movies are great... That is the key takeaway from this post. ",
        "upvotes": 20,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1j7swun/no_one_talks_about_really_old_movies_on_this/"
    },
    {
        "id": "1j7zrtt",
        "author": "Formidable-Facts",
        "title": "Free Movie Tickets?",
        "content": "I’m a member of the Cinemark rewards program that gives you one free movie a month. I use to go the movies all the time but I recently become a dad to twins and have no spare time. I want to cancel the membership but have 12 free movie credits to use and it seems like a waste if they don’t get used. If anyone wants a free movie ticket let me know the movie, showtime and date and I’ll DM you the tickets. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1j7zrtt/free_movie_tickets/"
    },
    {
        "id": "1j7797a",
        "author": "AdrianVeidt19",
        "title": "I stopped watching trailers and it's the best movie related decision i ever made",
        "content": "It's been years and it's not something i did on purpose, it just happened.\n\nYou might think 'yeah, trailers became very spoilery and it makes sensw' but not necessarily, sure it's a giant fuckin problem but major reason, at least for me is that there were a lot of times trailers made me interpret some scenes wrong and i know it's kinda the point sometimes but couldn't help it, i was always disappointed, trailer moments mixed with different music with different vibes and then you waiting them always ruined the moment for me, can't even explain properly but it just fuckin mixed my emotions wrongly. Avoiding spoilers and not knowing any scenes is a bonus.\n\nMost of the time I don't even read synopsis, i always go blind into the movies now (of course if it's not known widely what it is about) and it's been great.",
        "upvotes": 490,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1j7797a/i_stopped_watching_trailers_and_its_the_best/"
    }
]