[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ojzf46",
        "author": "SteamPaz",
        "title": "Una Cometa su Borgata Frassati",
        "content": "C/2025/A6 (Lemmon) a magnitudine apparente +4.2 in cielo con indice Bortle 8 (27/10/25, ore 18:30-19:00).\n\n55mm f/6.3 su sensore aps-c (Canon EOS 2000D), ISO800, 198x10s (33min).",
        "upvotes": 18,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2zepueo19yf1.jpeg?auto=webp&amp;s=751f3384dd48ddc220bdbd1d6db0b11f63a0b159"
        },
        "permalink": "/r/torino/comments/1ojzf46/una_cometa_su_borgata_frassati/"
    },
    {
        "id": "1ok270z",
        "author": "Gullible_Drummer_246",
        "title": "Dove comprare lepre?",
        "content": "Come da titolo cercavo un posto dove comprare una lepre.\n\nMi vengono a trovare e vorrebbero comprarla ma essendo io grossomodo vegetariano non ho la benché più minima idea di dove potrebbero trovarla.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ok270z/dove_comprare_lepre/"
    },
    {
        "id": "1ojwran",
        "author": "ZayaBt-",
        "title": "C'è qualcuno che non ha ancora ricevuto la pergamena?",
        "content": "Mi sono laureata all'Università di Torino ad aprile. Non mi hanno ancora dato la pergamena, ho inviato un paio di ticket, mi avevano detto di ricontattare fine ottobre ma adesso non mi rispondono più.\n\nMi serve questa cosa per rinnovare il mio permesso di soggiorno, la questura mi chiede se non è pronta la pergamena, almeno una certificazione di laurea timbrata da segreteria, ma non mi rispondono da un mese. \n\nMa davvero richiede così tanto tempo per dare la pergamena? Molto fastidiosa questa situazione. ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ojwran/cè_qualcuno_che_non_ha_ancora_ricevuto_la/"
    },
    {
        "id": "1ojtfsd",
        "author": "Ok_Swordfish_5870",
        "title": "barbiere torino 10€",
        "content": "Ciao! Cerco un barbiere in centro che mi tagli i capelli per 10 o max 15€  \nAvete consigli?  \nGrazie!",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1ojtfsd/barbiere_torino_10/"
    },
    {
        "id": "1ok44kc",
        "author": "IlKayMosca",
        "title": "Abbonamento parcheggio Zona Lingotto",
        "content": "Ciao a tutti, volevo sapere se i parcheggi blu di fronte il centro commerciale lingotto ricadono in qualcuno degli abbonamenti relativi ai parcheggi oppure sono solamente soggetti a tariffe orarie. Chiedo perché dal sito GTT sembra non ricadano in nessuna delle zone soggette ad abbonamento ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oub3ffc5y9yf1.jpeg?auto=webp&amp;s=391bdef5be9950ad92f0a0050883130df99e9322"
        },
        "permalink": "/r/torino/comments/1ok44kc/abbonamento_parcheggio_zona_lingotto/"
    },
    {
        "id": "1ok34yu",
        "author": "sixlaneve4_0",
        "title": "Lungo dora Firenze.",
        "content": "Per chi è di Torino.\nNon entro nei dettagli, ma lungo dora Firenze - zona Aurora, che zona è?\nHo trovato un annuncio per una casa per studenti al n'31, ma su Google Maps, mi sembra più una pseudo casa popolare.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ok34yu/lungo_dora_firenze/"
    },
    {
        "id": "1ojv45p",
        "author": "_L_-",
        "title": "Escursioni x Via degli Dei",
        "content": "Ciao! Cerco consigli su escursioni da fare in zona in preparazione alla Via degli Dei Bologna-Firenze che vorrei fare ad aprile. \n\nNon faccio trekking e non ho nemmeno le scarpe, fisicamente sono messo bene ma non cammino spesso. \n\nMi sapete consigliare scampagnate da fare in giornata in zona raggiungibili con mezzi pubblici? \n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojv45p/escursioni_x_via_degli_dei/"
    },
    {
        "id": "1ojxesk",
        "author": "nickname1917",
        "title": "Lavori per ciclabile di via FIladelfia",
        "content": "Stanno allargando la ciclabile di via Filadelfia e fin qui tutto ok (almeno per me che uso la bici). C'è un tratto di marciapiede che sarà lungo si e no 20 o 30 metri su cui stanno scavando, trapanando, dissestando, scusate non conosco i termini tecnici da 12 - DODICI - giorni lavorativi. C'è qualche esperto di lavori stradali che mi possa illuminare sui passaggi necessari, perché non capisco come mai il marciapiede è ancora distrutto e non c'è traccia della posa del nuovo asfalto (o come si chiama)... i lavori sulla via vanno infatti avanti da prima dell'estate perché per ogni tratto è così. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojxesk/lavori_per_ciclabile_di_via_filadelfia/"
    },
    {
        "id": "1ojv701",
        "author": "Cotolettadipoll0",
        "title": "halloween 2025",
        "content": "questo è il mio primissimo post su reddit e ammetto che non me ne intendo molto!! \nComunque quest’halloween dovevo fare una festa con dei miei amici, solo che ieri mi hanno balzato all’ultimo…. \nSe qualcuno ha idee o consigli su cosa potrei fare sono ben accetti!! \nIn generale volevo passare una serata diversa non fare il solito giro in centro (non so se ci sono eventi o festini dove posso aggiungermi all’ultimo) ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ojv701/halloween_2025/"
    },
    {
        "id": "1ojy921",
        "author": "RainDesigner",
        "title": "puntura con ago a secco a Torino",
        "content": "Ciao a tutti, mi chiedevo se fosse possibile sottopormi a un trattamento di puntura con ago a secco da qualche parte a Torino e farlo coprire dall'assicurazione. Ho un dolore piuttosto persistente che sono sicuro sia causato da alcuni punti trigger, poiché i modelli di dolore sono una copia esatta dei comuni modelli di dolore riferito dai punti trigger, ma farlo di tasca mia è un po' troppo costoso. Nel mio paese sapevo come farlo coprire dall'assicurazione, ma non sono sicuro di come funzioni qui. Qualsiasi aiuto è molto apprezzato, se qualcuno ha avuto un problema simile in passato e sa come procedere",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ojy921/puntura_con_ago_a_secco_a_torino/"
    },
    {
        "id": "1ojdxva",
        "author": "ElectricalVegetable6",
        "title": "Come bippare su SFM?",
        "content": "Ho fatto una tessera Bip Universitaria, che mi permette di usare i servizi urbani/suburbani e i treni nel comune di Torino. La mia domanda è: come si fa a bippare la carta nelle stazioni ferroviarie? Non trovo una macchina per bippare, a parte la macchina verde Tap&amp;Tap di Trenitalia.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojdxva/come_bippare_su_sfm/"
    },
    {
        "id": "1ojkuxj",
        "author": "Icy_Sand_1453",
        "title": "Best food a Torino",
        "content": "What food should I not miss in Turin?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojkuxj/best_food_a_torino/"
    },
    {
        "id": "1oj6ha0",
        "author": "Rascoyho",
        "title": "Soffiafoglie",
        "content": "\nScusate, ma anche a voi danno fastidio quei maledetti soffiafoglie a benzina che rompono i timpani e soprattutto i cog.. ni? \nIl comune non può bandirli a favore di quelli a batteria? ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oj6ha0/soffiafoglie/"
    },
    {
        "id": "1ojj7o8",
        "author": "Haunting_Hat5975",
        "title": "partiboi69 in turin",
        "content": "Hey, is anybody going to partiboy69 on friday?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojj7o8/partiboi69_in_turin/"
    },
    {
        "id": "1ojepzk",
        "author": "EstablishmentFit7936",
        "title": "Carte Pokémon Torino",
        "content": "Ciao a tutti!\nSono nuovo a Torino e sto cercando di completare il pokedex, sapete di qualche negozio o mercatino qui a Torino che vende carte singole ? Mi servono tutti i tipi di carte solo che non so dove trovarle",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ojepzk/carte_pokémon_torino/"
    },
    {
        "id": "1oj897t",
        "author": "reddithatsick",
        "title": "AAA cercasi squadra calcio a 7",
        "content": "Ciao Raga, io e un mio amico avremmo voluto fare tornei di calcio a 7 ( ma anche sporadiche partite ) ma mi sono reso conto che mi viene veramente difficile contattare squadre. Qualcuno di voi ha qualche dritta?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oj897t/aaa_cercasi_squadra_calcio_a_7/"
    },
    {
        "id": "1oj4lt6",
        "author": "Hot-Garage-4536",
        "title": "Scrittori a Torino e dintorni",
        "content": "Ciao a tutti! Starei scrivendo una storia per un fumetto, solo che scrivere non é una gran passione per me, quindi far uscire qualcosa di buono ci metto un po’. \nSe qualcuno avesse voglia di mettersi in gioco e aiutarmi a portare avanti sto progetto, vi sarei grata :)\n\nNon saprei neanche da dove partire per rendere più intrigante la mi proposta, quindi se avete delle domande fate pure :,)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oj4lt6/scrittori_a_torino_e_dintorni/"
    },
    {
        "id": "1oj297d",
        "author": "kvlt1",
        "title": "Place to sleep Friday 26",
        "content": "Ciao a tutti! Venerdì sera sono al C2C e dovevo dormire da amiche varie, che mi hanno però paccato...sto cercando qualcuno disposto a ospitarmi! se viene al C2C posso offrire birrette e varie in serata, altrimenti la mattina dopo una bella colazione! Grazie a tutti\n\nHi everybody! On Friday I'll be at C2C (Club2Club Festival) and I was supposed to crash at some friends' house, but they stood me up...I'm looking for somebody available to host me! if you're coming to C2C as well I can offer beer or whatever else, otherwise a good breakfast the morning after! thanks guys",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oj297d/place_to_sleep_friday_26/"
    },
    {
        "id": "1oj09rz",
        "author": "Icy_Sand_1453",
        "title": "Arrivare a Torino",
        "content": "Arriverò a Malpensa il 26. Dal Terminal 2 ho visto autobus diretti con Flixbus e Flibco. Autoestradale non ha biglietti disponibili; non so se saranno in servizio durante le festività natalizie. Conoscete altre compagnie di autobus? Vale la pena acquistare il biglietto in anticipo o è meglio acquistarlo sul posto?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1oj09rz/arrivare_a_torino/"
    },
    {
        "id": "1oi550s",
        "author": "Vittoriooh",
        "title": "Tram metro e SFM",
        "content": "",
        "upvotes": 103,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/252t7kmmrtxf1.jpeg?auto=webp&amp;s=9ca6f826ed92176e9b55e93e6df3375f3438e0a5"
        },
        "permalink": "/r/torino/comments/1oi550s/tram_metro_e_sfm/"
    },
    {
        "id": "1oigd6k",
        "author": "Tyvas",
        "title": "Dove comprare interruttori, encoder e potenziometri a Torino?",
        "content": "Ciao a tutti!\n\nSto costruendo un pannello per simulatore di volo fai da te (tipo quello che c'è in foto) e sto cercando un negozio che venda componenti elettronici come:\n\n* Interruttori a levetta\n* Encoder o selettori rotativi\n* Potenziometri \n* LED o materiali per retroilluminazione\n\nSo che potrei ordinare tutto online ma mi piacerebbe vedere i pezzi in persona, per assicurarmi della qualità. Avete qualche negozio da consigliare, possibilmente in zona Lingotto o facilmente raggiungibile in metro?\n\nSe qualcuno ha già realizzato controller simili e vuole condividere la sua esperienza sarei felice di saperne di più. Grazie in anticipo! ",
        "upvotes": 13,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k3stfz574wxf1.jpeg?auto=webp&amp;s=888ba9a4f52fd54e5f1211e66c114de8866957fc"
        },
        "permalink": "/r/torino/comments/1oigd6k/dove_comprare_interruttori_encoder_e/"
    },
    {
        "id": "1oio8ag",
        "author": "Zoremia",
        "title": "Cerco lucina del bracciale concerto Lady Gaga",
        "content": "Ciao! Sono stato al concerto di Lady Gaga a Milano, dove distribuivano questi bracciali con lucine. \nSto facendo alcuni esperimenti per attivarle dal computer, ma al momento ho solo uno di questi aggeggi. Se qualcuno ce li ha e se ne vuole sbarazzare, lo prendo volentieri!\n\nMi interessa solo la lucina, non il bracciale intero. Dovrebbe andar bene anche se è di altri concerti.\n\nGrazie :D",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4hwepuianxxf1.png?auto=webp&amp;s=be1e4310e92f234668f4198b8dc84bcdb35a2b8d"
        },
        "permalink": "/r/torino/comments/1oio8ag/cerco_lucina_del_bracciale_concerto_lady_gaga/"
    },
    {
        "id": "1oicpqu",
        "author": "Hyzev_",
        "title": "AAA Cercasi compagni di studio",
        "content": "Ciao ragazzi, dato che ogni giorno leggo dei post generici per fare gruppo e conoscere gente nuova ci provo anche io ma in modo più specifico.\n\nSono un ragazzo di 28 anni che lavora da 5 e per questo ha messo in pausa la propria carriera universitaria. Vorrei ricominciare a studiare decentemente e con costanza quindi vorrei creare un gruppo di studio per aumentare un po' la motivazione. Attualmente sono iscritto al corso di laurea triennale in Informatica presso UNITO, essendo uno studente lavoratore ho degli orari un po' stravaganti ma magari qualcuno vuole unirsi a me anche solo una volta a settimana (non sto cercando gente iscritta esclusivamente ad informatica, qualsiasi corso di laurea va bene, anche magistrale). Fino ad ora ho sperimentato solo l'aula studio EDISU in San Salvario, per me va benissimo ma sono disponibile a valutarne altre. L'importante è che siano aperte fuori dall'orario d'ufficio, i miei orari sono:\n\nLunedi: -\nMartedi: 19:00/23:00\nMercoledi: -\nGiovedi: 19:00/23:00\nVenerdi: -\nSabato: 10:00/20:00 \nDomenica: 10:00/20:00\n\nVorrei creare un gruppetto (anche su wa/tg) per organizzarci, scrivetemi pure in dm (anche studenti stranieri ed erasmus sono ben accetti!)",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oicpqu/aaa_cercasi_compagni_di_studio/"
    },
    {
        "id": "1oige17",
        "author": "Lollodoro",
        "title": "Dove bere il bicerin?",
        "content": "Buona sera cari amici Torinesi,\nMi stavo chiedendo se ci sia un locale del centro in cui sia possibile trovare il bicerin la sera, dopo ora di cena.\n\nGentilmente.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oige17/dove_bere_il_bicerin/"
    },
    {
        "id": "1oi72m6",
        "author": "zacchinator",
        "title": "Vista di Crocetta e delle Colline del Po",
        "content": "La luce autunnale a Torino è incredibile. Adoro il contrasto tra le ville signorili e l'esplosione di verde, giallo e rosso degli alberi. Un angolo di pace, nonostante siamo in piena città. 🌿🏘️",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z9q86u2uauxf1.png?auto=webp&amp;s=4aff5190522b4835836ccd2ad17b90627fbb84d4"
        },
        "permalink": "/r/torino/comments/1oi72m6/vista_di_crocetta_e_delle_colline_del_po/"
    },
    {
        "id": "1oibhvh",
        "author": "Glad-Lecture-1700",
        "title": "Piscine Torino centro",
        "content": "Consigli per piscine con possibilità di nuoto libero per adulti a Torino centro con prezzi decenti? \n\nHo trovato la piscina comunale Cecchi ma pare che sia aperta per il nuoto libero solo fino alle 15.30 e, lavorando, potrei andare solo dopo le 18. \n\nHo provato a chiamare la \"Omniafit\" che pare avere buone recensioni ma mi hanno chiesto di andare fin là solo per sapere il prezzo, cosa idiota che purtroppo fan tutte le palestre, magari se qualcuno ci va sa dirmi quanto costa senza dovermi fare 30 minuti di bus per conoscere un prezzo nel 2025...",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oibhvh/piscine_torino_centro/"
    },
    {
        "id": "1oi4j1c",
        "author": "Sufficient-Visit-440",
        "title": "Corso Principe Oddone angolo Dora, com'è?",
        "content": "Ciao a tutti, non sono di Torino e volevo chiedervi che ne pensate della zona tra corso Principe Oddone e il fiume Dora. Avrei trovato lì una palestra che mi interessa, ma non so come sia la zona soprattutto la sera.   \nQualcuno conosce la zona?  \nCom'è a livello di sicurezza, specialmente la sera? ",
        "upvotes": 6,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w54i17a6ktxf1.png?auto=webp&amp;s=28496593c91e6fa96fc7133717dc24d8ee55b8e4"
        },
        "permalink": "/r/torino/comments/1oi4j1c/corso_principe_oddone_angolo_dora_comè/"
    },
    {
        "id": "1oieyqd",
        "author": "Icy_Sand_1453",
        "title": "Capodanno a Torino",
        "content": "Sarò a Torino a fine anno. Qualche festa in città, qualche spettacolo? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oieyqd/capodanno_a_torino/"
    }
]