[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qtqan6",
        "author": "Purple_CEO",
        "title": "Stendere i panni",
        "content": "Vivo a Torino, a circa 1km dal Politecnico. Ho un balcone che da sulla strada ma il proprietario di casa ha ricevuto lamentele per quanto riguarda i panni stesi e questo mi ha notificato e chiesto di non farlo più perché è contro il regolamento.   \nMi sono fatto rimandare il regolamento di condominio (Datato 1947) e a parte regole assurde che dichiarano:\n\n\"I ritrovi di giovani a scopo di bivacco devono essere notificati in anticipo all'amministratore di condominio\" (Questo per farvi capire quanto questo regolamento sia datato) non ho trovato niente che riguarda i panni stesi sul balcone che affaccia sulla strada pubblica.\n\n  \nQuindi ho parlato con il proprietario di casa e mi si è appellato ad una legge non ben specificata che vige a Torino che riguarda il \"Decoro urbano\". Anche secondo lui (Siciliano) è una cazzata, perché per noi meridionali è normalissimo appendere roba visibile sulla strada. Però appunto per quanto siamo contro c'è questo regolamento comunale non ben specificato. \n\nVorrei sapere se ci sono modi per contestare questa cosa, se non esiste, se esistono orari per farlo ecc perché non sopporto tenere i panni in camera ad asciugare perché fanno un odore molto intenso di detersivo e in questi giorni con il massimo di 7 gradi fuori non posso permettermi di tenere la porta a finestra aperta. Consigli?",
        "upvotes": 26,
        "comments": 77,
        "media": null,
        "permalink": "/r/torino/comments/1qtqan6/stendere_i_panni/"
    },
    {
        "id": "1qtn2g5",
        "author": "TheTrampIt",
        "title": "Parlano di noi…",
        "content": "",
        "upvotes": 16,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JjTU9IIrXsHQm6--IuAsSYtVW7p5pOnzWjEwij3A3Zg.jpeg?auto=webp&amp;s=98754a5c93a5bd29e9a6f2a7c41a2c5d562c8ab3"
        },
        "permalink": "/r/torino/comments/1qtn2g5/parlano_di_noi/"
    },
    {
        "id": "1qtwaz4",
        "author": "Alternative-Book-749",
        "title": "Trovare lavoro It come junior",
        "content": "È davvero così difficile trovare lavoro nell' it come junior?\n\nHo un diploma in informatica di 90/100\ncon conoscenze che ritengo abbastanza buone ma sembra che le posizioni nell' it per i junior siano inesistenti e quelle poche che ci sono non ti guardano nemmeno il CV.\nAnche andando per posizioni da sistemista o tirocini vari che di solito sono meno ambite non si riesce a trovare nulla. \n\nPer ora mi sono focalizzato ad iscrivermi alle varie agenzie del lavoro che ci sono, candidarmi alle offerte di lavoro e scrivere direttamente alle aziende per candidature spontanea. \n\nQualcuno ha qualche consiglio su cosa potrei fare? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qtwaz4/trovare_lavoro_it_come_junior/"
    },
    {
        "id": "1qt65wc",
        "author": "UglycoreIT",
        "title": "Manifestazione Torino 31 Gennaio - la storia del poliziotto",
        "content": "Questo è ciò che è successo PRIMA del famoso video del poliziotto.\n\nIl post è della giornalista Rita Rapisardi lo trovate nei suoi spazi:\n\n(…) Fortuna vuole che quella scena l'abbia vista con i miei occhi, ero a cinque metri, ancora più vicina del videomaker che si trovava alle mie spalle, in mezzo al corso, diviso dalle barriere del tram. A quel punto della serata gli scontri stavano andando verso la conclusione, i manifestanti si erano dileguati da corso Regina, quello di Askatasuna, dove si sono svolti per la maggior parte, per scappare verso il lungo Dora attraverso i giardinetti che portano al Campus Einaudi.\n\nMigliaia di persone si sono riversate in quel poco spazio e pian piano sono riuscite ad arrivare dall'altra parte, sulla Dora appunto, anche perché le forze di polizia arrivavano da entrambi i lati e la paura era quella di essere chiusi contro i cancelli, motivo per cui alcuni hanno aperto un varco tra le grate. Il tutto per fortuna si è svolto abbastanza tranquillamente, in molti urlavano di fare piano, con calma e non agitarsi. Nel frattempo continuava incessante il lancio dei lacrimogeni.\n\nIn corso Regina ormai erano in pochi. Sono tornata indietro per controllare, si parla di 20-30 persone al massimo. Mi affaccio e arrivano lacrimogeni ad altezza uomo (cosa vietata), una ragazza di fianco a me viene colpita, un'altro batte sull'angolo del muro e mi sfiora. Indietreggiamo, capisco che da lì sono un bersaglio, quindi torno sul corso e mi nascondo tra le auto.\n\nA questo punto vedo arrivare da sinistra una squadra di venti agenti in antisommossa che corrono per manganellare quei dieci più vicini, ormai deboli di numero. Sono pronta ad urlare\n\n“stampa\", convinta le avrei prese anche io, abituata a vestirmi sempre di nero poi.\n\nUno di questi, esce dallo schieramento, parte da solo e si allontana di 15 metri, per inseguire un paio di persone, mi pare una avesse un'asta in mano. Le inizia a manganellare, uno finisce a terra.\n\nAltri manifestanti arrivano in soccorso prendono il poliziotto e lo sbattono via, lui cade a terra e da lì ci sono quei secondi immortalati dal video ormai virale. Perde casco non allacciato e poi i due colpi di martelletto (non martello).\n\nMi giro e guardo la squadra, nessuno arriva a salvarlo, eppure l'hanno visto. Intanto da dietro arrivano delle urla, \"basta, basta, lasciamolo stare\". I militanti si allontanano e finalmente arriva un collega. In due poi lo trascinano via. Doppia ritirata, a quel punto mi allontano anche io, non era rimasto più nessuno.\n\nCosa capiamo quando vediamo un video? Dov'è la nostra capacità di analisi? Quali domande ci facciamo? Cosa è successo prima, come interpreto quei pochi secondi, saranno tagliati ad arte? Ieri sera leggo \"il poliziotto assaltato, circondato, preso e isolato\".",
        "upvotes": 65,
        "comments": 172,
        "media": null,
        "permalink": "/r/torino/comments/1qt65wc/manifestazione_torino_31_gennaio_la_storia_del/"
    },
    {
        "id": "1qt7sjz",
        "author": "Cool-Impression6669",
        "title": "Torini Named Among the World’s Top 3 Most Walkable Cities. 1st is Milan.",
        "content": "",
        "upvotes": 42,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1qt7sjz/torini_named_among_the_worlds_top_3_most_walkable/"
    },
    {
        "id": "1qtxs02",
        "author": "EducationalTicket458",
        "title": "Esami o verifiche in istituto tecnico superiore ict",
        "content": "Ciao a tutti community di reddit!\nVorrei confrontarmi con qualcuno che ha già frequentato un corso ITS ICT a Torino. In particolare, mi interesserebbe avere un confronto sull'impostazione e sul livello di difficoltà delle varie verifiche/esami dato lo scarso livello di trasparenza riscontrato su internet quando si cerca nello specifico qualche informazione in merito. Parliamone o qui o anche in privato con molto piacere 🙂.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qtxs02/esami_o_verifiche_in_istituto_tecnico_superiore/"
    },
    {
        "id": "1qtxesx",
        "author": "Ok-Interview-420",
        "title": "Assistance with Certificato di idoneità alloggiativa - Floor plan discrepancy",
        "content": "Buongiorno a tutti. I need to obtain a Certificato di idoneità alloggiativa for my family's stay. I'm looking for a qualified professional (architect/surveyor) to conduct the inspection.\n​I have a technical hurdle: my apartment's planimetria shows an antebagno, but the physical structure is missing. The landlord is unwilling to undergo renovations for such a short-term stay.\n​I'm looking for a professional who can advise me on how to handle this discrepancy or if there are any legal workarounds for temporary stays/highly specialized workers. If you are a professional or can recommend someone who handles \"difficult\" cases regarding floor plan discrepancies, please send me a DM. Thank you!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qtxesx/assistance_with_certificato_di_idoneità/"
    },
    {
        "id": "1qtx2ki",
        "author": "Overall_Task_2783",
        "title": "Lavoro minori",
        "content": "So che non è il miglior posto per chiedere e forse le persone che sono qua sono probabilmente persone molto giovani, ma sapete se da qualche parte assumono persone minorenni, parliamo di 16 anni che ne fa 17 a Marzo",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qtx2ki/lavoro_minori/"
    },
    {
        "id": "1qttbg0",
        "author": "tumbawomba",
        "title": "Looking for a private driver for a day (end of March)",
        "content": "Hey! \n\nIm visiting Torino with 6 friends in the end of March and we plan to head out to Piemonte do visit a couple of vineyards and restaurants. Since we are 7 people, I wasn't able to find an a personal driver yet. We have been doing these trips before and in other places I was able to rent a van and connect with eg. a student to take us around for that day (obviously for pay). \n\nWhat would be a good way to get in touch with students/people who'd be up for that?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qttbg0/looking_for_a_private_driver_for_a_day_end_of/"
    },
    {
        "id": "1qtt6wm",
        "author": "kentidze",
        "title": "Barber that speaks English",
        "content": "I am looking for a barber that speaks English , Can you recommend any place that has good service and price. Thanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qtt6wm/barber_that_speaks_english/"
    },
    {
        "id": "1qtt3r8",
        "author": "Busy-Alarm-2872",
        "title": "Furti in Crocetta, avete notato un aumento?",
        "content": "Ciao a tutti, volevo chiedervi se anche voi state notando un aumento dei furti o dei tentativi di furto in zona Crocetta.  Oggi mia suocera, una persona anziana, ha subito un tentativo di furto in strada da parte di due ragazze. Fortunatamente non ci sono state conseguenze, ma l'episodio ha creato molta preoccupazione. Ci stiamo organizzando per aumentare il pattugliamento. ",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1qtt3r8/furti_in_crocetta_avete_notato_un_aumento/"
    },
    {
        "id": "1qtxblv",
        "author": "Scary_Outcome5954",
        "title": "Vendo 2 biglietti per candlelight The Lord of the Rings",
        "content": "Ciao a tutti, come dice il titolo \\^\n\nI biglietti sono per venerdì 06/02 alle 17.30, zona A. \n\nLi vendo a €80 (costo originale, €40 per biglietto). \n\nScrivetemi in privato se interessati! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qtxblv/vendo_2_biglietti_per_candlelight_the_lord_of_the/"
    },
    {
        "id": "1qt9gvm",
        "author": "Erleyx",
        "title": "Bar/ biliardo",
        "content": "Ciao ragazzi, there’s this bar/biliardo north of porta nuova that i went to while on a date, problem is i dont remember either the name or the location, basically the bar is upstairs while the biliardo is downstairs, the pool tables are red and u cant play without ordering a drink or something\n\nAlso I remember a guy working there that has hair long to his upper shoulders , and i think he had those curled mustache styles, if anyone knows ill be really grateful if u help \n\nThanks!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qt9gvm/bar_biliardo/"
    },
    {
        "id": "1qt5zsi",
        "author": "akejavel",
        "title": "Turin: 50,000 protest Askatasuna eviction",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qt5zsi/turin_50000_protest_askatasuna_eviction/"
    },
    {
        "id": "1qs0tv8",
        "author": "nazarthinks",
        "title": "Domanda alla gente con i cani",
        "content": "Considerate tutti normale lasciare che il vostro cane faccia pipì sulle ruote delle macchine, bici o monopattini?\n\nIn soli 10 minuti di passeggiata in San Salvario li ho visti tutti e tre. Sto cercando di capire se sono solo alcune persone che lo fanno o se è proprio una caratteristica culturale di Torino?",
        "upvotes": 480,
        "comments": 348,
        "media": null,
        "permalink": "/r/torino/comments/1qs0tv8/domanda_alla_gente_con_i_cani/"
    },
    {
        "id": "1qt2xi1",
        "author": "Low_Casio",
        "title": "Via Alessio/Tepice",
        "content": "Ciao, sto considerando di prendere in affitto una casa in questa zona (appena trasferio a Torino). Vorrei sapere com'è la sera, qual è il profilo dell'abitante medio, ho visto che c'è un padiglione delle Molinette (e una grande ciminiera!). Come sono i servizi? Parcheggio? Etc. Grazie mille!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qt2xi1/via_alessiotepice/"
    },
    {
        "id": "1qt51ha",
        "author": "Marzipan6312",
        "title": "Car rental Turine",
        "content": "Hello, my family will be arriving in Turine in a few days. Since its a family of 6, the famous rental companies are quite expensive for the 7/9 seater car. I was wondering if there are any local car companies that would offer more aff rates?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qt51ha/car_rental_turine/"
    },
    {
        "id": "1qswgcv",
        "author": "DraftApprehensive439",
        "title": "Dormitories in Turin",
        "content": "Hello everybody,\n\nI'd like to ask which dormitory I should chose for my stay there (arrival few days before semester, let's say 20th February, departure at the end of June). What dormitory is better - Bernini or Relife student housing? My concern is about the location of Relife close to Barriera di Milano and Aurora. Is it safe there even at night? What are your experiences?\n\nThank you all for replies",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qswgcv/dormitories_in_turin/"
    },
    {
        "id": "1qt0dyy",
        "author": "KinnaraDragon2006",
        "title": "Tips for exchange student",
        "content": "Ciao! I'm planning to apply to the University of Turin as an exchange student. I'm a molecular biology student. Do you have any suggestions? Does it offer suitable conditions for an exchange student? What are the exams and courses like? Are they challenging? I have a high GPA and I don't want it to drop for my master's degree. I would be very grateful if those with experience could share their thoughts!! Thank you all! :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qt0dyy/tips_for_exchange_student/"
    },
    {
        "id": "1qryug6",
        "author": "logperf",
        "title": "È da un po' che non venivo in centro. Devo buttare qualcosa e mi ritrovo tutti i cestelli chiusi a lucchetto. WTF?",
        "content": "",
        "upvotes": 117,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ajqk9sclvngg1.jpeg?auto=webp&amp;s=a796c2442c918d3f3d6c000ca16007384b527540"
        },
        "permalink": "/r/torino/comments/1qryug6/è_da_un_po_che_non_venivo_in_centro_devo_buttare/"
    },
    {
        "id": "1qs8v04",
        "author": "_domhnall_",
        "title": "Per chi è lì: perché esattamente sono iniziati gli scontri?",
        "content": "Sto leggendo ora della grandissima manifestazione contro la chiusura del centro sociale Akatasuna. Leggo che gli scontri sarebbero iniziati proprio nei pressi della struttura. Ma il comune non sapeva sarebbero passati di li o non era stato concordato? Gli scontri sono avvenuti in base a provocazioni dei manifestanti?\n\nPensavo di chiedere qui perché altrove se ne leggono già di cotte e di crude e vorrei anche solo un briciolo di verità da chi è sul posto. \n\nGrazie and stay safe.",
        "upvotes": 31,
        "comments": 88,
        "media": null,
        "permalink": "/r/torino/comments/1qs8v04/per_chi_è_lì_perché_esattamente_sono_iniziati_gli/"
    },
    {
        "id": "1qsfdeq",
        "author": "Crazy-Guidance9959",
        "title": "M18 in cerca di compagnia",
        "content": "Ciao ragazzi, mi chiedevo se ci sarebbe qualcuno nella mia fascia d’età (quindi preferirei gente che non abbia 10 anni o 30) per fare qualcosa, uscire normalmente o altro, che siano gruppi o persone singole, se per caso siete interessati scrivetemi pure",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qsfdeq/m18_in_cerca_di_compagnia/"
    },
    {
        "id": "1qs12mr",
        "author": "Plenty_Sleep_6871",
        "title": "Solitudine",
        "content": "Ciao a tutti, sono M29 e sono solo da tanti anni, complice disturbo evitante indubbiamente che mi ha isolato dal mondo purtroppo. \n\nSono un “nerd” appassionato di videogiochi, manga, anime, letteratura e storia, lettura in generale (romanzi thriller e horror e in generale libri sulla geopolitica contemporanea) \n\nSe qualcuno/a ha voglia di scambiare due chiacchiere io sono qui\n\nGrazie a tutti ",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qs12mr/solitudine/"
    },
    {
        "id": "1qsgamn",
        "author": "BirthdayDapper2748",
        "title": "Aperitivo caratteristico San Salvario",
        "content": "Ciao a tutti, sto cercando un posto dove poter fare aperitivo con i miei amici (saremo circa 20) in zona San Salvario. Si tratta di un aperitivo pre-cena di laurea quindi cercavo un posto carino ma con buon rapporto qualità prezzo, o comunque un posto caratteristico.\n\ngrazie:)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qsgamn/aperitivo_caratteristico_san_salvario/"
    },
    {
        "id": "1qs5p1t",
        "author": "Alarmed-Carpenter975",
        "title": "Torino Spazio pubblico",
        "content": "https://www.facebook.com/share/171YgwJomH/\nSe non sai cosa fare, incontrare gente, dare una mano, partecipa.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qs5p1t/torino_spazio_pubblico/"
    },
    {
        "id": "1qs654t",
        "author": "chack1172_temp",
        "title": "Yogurteria",
        "content": "Andavo sempre alla yogurteria Km0 in via po a prendere lo yogurt, poi però hanno chiuso e si sono trasferiti all'estero.  \nConoscete qualche buona yogurteria in centro che ti faccia mettere cose sia sul fondo che sopra? Grazie.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qs654t/yogurteria/"
    },
    {
        "id": "1qsm3jh",
        "author": "UglycoreIT",
        "title": "Manifestazione 31 Gennaio",
        "content": "Vorrei creare un thread dove raccontiamo cos’è stata DAVVERO la manifestazione.\n\nPer me è stato davvero un momento bellissimo, era pieno di famiglie e anziani e ovviamente non è che lottavamo per un centro sociale “e basta” ma anzi. Lottavamo per una idea di mondo e d’Italia che a noi non sta bene, a partire dalla chiusura degli spazi sociali di quartiere, alla questione ambientale, al coinvolgimento dell’Italia nel genocidio palestinese, al diritto allo studio e al diritto dei lavoratori, insomma eravamo 60mila persone che lottano per una nuova idea di società. \n\nPer quanto riguarda gli scontri, semplicemente sono stati fatti ad hoc dalla polizia perché eravamo tutti pacifici. In corso regina (circa altezza di caffè Rossini) alcuni manifestanti camminavano verso Askatasuna e fin lì non ci vedo nulla di strano: quello è il mio quartiere, lì c’è casa mia ed è militarizzato. Ergo, la polizia (nonostante fossimo a poco meno di mezz’ora a piedi per Aska e nonostante il corteo non stesse andando lì) per disperdere la folla ha fatto un uso massiccio di lacrimogeni, hanno colpito anche una carrozzina e fortunatamente il figlio era in braccio, ripeto: c’erano centinaia di migliaia di minori e di anziani. Questa è stata una violenza totalmente deliberata della polizia. Sono finita in mezzo alla calca con la gente che scappava e siamo quasi tutti finiti o verso le Panche o la traversa dopo dove c’era il corteo ma ripeto: eravamo in pochi e non organizzati. Chiaramente da lì è nata la “”violenza”” che poi di cosa stiamo parlando? Di ragazzi che lanciano sassi (meno di 50 persone) contro centinaia di anti sommossa e camionette con maschera antigas. Ma è guerriglia questa? Loro che sparano ad altezza uomo lacrimogeni e idranti (che peggiora il bruciore l’acqua) e hanno aggredito anche un anziano abbandonandolo per strada - fortunatamente è stato soccorso dai manifestanti anche se la polizia pur vedendolo invece di chiamare l’ambulanza l’hanno solo trascinato da una parte e basta. \n\nIl famoso video dei manifestanti che “picchiano” il poliziotto? Credetemi: fatto ad hoc. \n\nIn nessun punto della manifestazione vedevi poliziotti singolarmente, erano almeno in gruppi da 7-10 persone, l’aggressione è avvenuta dopo il lancio deliberato di lacrimogeni e CASUALMENTE (sarcasmo) il poliziotto era da solo, cosa che ripeto era letteralmente impossibile. Fatto apposta? Io penso di sì, affinché si facessero dei video per dire che siamo NOI gli antagonisti.\n\nCredetemi: c’è stata tantissima violenza da parte delle forze dell’ordine e abusi, hanno fermato persone che volevano andare in manifestazione senza valida ragione perquisiti e portati in cella con vari fogli di via, alcuni anche per 2 anni. \n\nI giornali vogliono raccontarci come violenti quando non è stato affatto così, hanno aspettato sera, da dopo palazzo nuovo giravano elicotteri e droni, insomma: cosa vi aspettate da questo governo?\n\nPerò vi prego, raccontate anche la vostra esperienza durante la manifestazione per chi c’era e cerchiamo di fare contro informazione. ",
        "upvotes": 0,
        "comments": 68,
        "media": null,
        "permalink": "/r/torino/comments/1qsm3jh/manifestazione_31_gennaio/"
    },
    {
        "id": "1qrz0ij",
        "author": "Exciting-Look-7721",
        "title": "Appello alle ragazze torinesi: cheratina",
        "content": "Ciao ragazze, siccome vivo da poco a Torino e noto che i miei capelli non durano più causa umidità, nebbia(ci impiego 2h a fare una piega che non dura). Sarei interessata a fare un trattamento lisciante per capelli crespi.  Siccome non mi va di spendere una fortuna, sapete consigliarmi un salone con prezzi onesti qui a Torino?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qrz0ij/appello_alle_ragazze_torinesi_cheratina/"
    }
]