[
    {
        "id": "1jyv6sq",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 40,
        "comments": 2702,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jyv6sq/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k0vj3d",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Real Madrid vs Arsenal, UCL round of 8 leg 2",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0vj3d)",
        "upvotes": 82,
        "comments": 1199,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0vj3d/post_match_thread_real_madrid_vs_arsenal_ucl/"
    },
    {
        "id": "1k0qzjo",
        "author": "Equivalent_Hawk_6602",
        "title": "Scenes outside Santiago Bernabéu",
        "content": "",
        "upvotes": 1064,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nr12sr1yk8ve1.jpeg?auto=webp&amp;s=93da6c9de9e15173da1a30ebb82b95feb7d8220c"
        },
        "permalink": "/r/realmadrid/comments/1k0qzjo/scenes_outside_santiago_bernabéu/"
    },
    {
        "id": "1k0u4og",
        "author": "Constant_Aspect_6632",
        "title": "Dani Carvajal and Saka had words at the end of the half.",
        "content": "",
        "upvotes": 547,
        "comments": 131,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7z2687ey79ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0u4og/dani_carvajal_and_saka_had_words_at_the_end_of/"
    },
    {
        "id": "1k0su89",
        "author": "Constant_Aspect_6632",
        "title": "Courtois 🧱 saves the penalty",
        "content": "",
        "upvotes": 640,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2at2ip3gy8ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0su89/courtois_saves_the_penalty/"
    },
    {
        "id": "1k0qmg4",
        "author": "Bexewa",
        "title": "You all ready for tonight?",
        "content": "",
        "upvotes": 588,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/payas4zdi8ve1.jpeg?auto=webp&amp;s=0b59a87f84d003fdc893742420de48010c1900e3"
        },
        "permalink": "/r/realmadrid/comments/1k0qmg4/you_all_ready_for_tonight/"
    },
    {
        "id": "1k0zjql",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: \"Arsenal deserved to go through and I hope the best for them... No excuses, in both games they were better. It can happen in football. We are upset of course. We had a lot of epic moments in the past and tonight we have to manage the setback.\"",
        "content": "",
        "upvotes": 123,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lsphygiweave1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0zjql/ancelotti_arsenal_deserved_to_go_through_and_i/"
    },
    {
        "id": "1k0yj7b",
        "author": "TestProfessional6716",
        "title": "\"Our front line should be destroying Europe\" is a stupid take",
        "content": "Tough defeat today, but I see this a lot in the threads :\n\n\"We have 3 nuclear weapons in the front and we don't know how to use them, it's coach's fault\"\n\nStupid take. That would be the case if you're playing FIFA on PS5. What you have is 3 fast right footed midgets, with brute force players in the midfield without a single one with decent build up quality to link defense and offense, and in the back, you have literally no fullbacks !\n\nThe front 3 is attractive, but not balanced ! Perez ruined a very good squad by buying a player we didn't fucking need and NOT replace 4 key players :\n\n1. Joselu, a tall cunt that wins most of his aerial duals and is always a threat in crosses. He was a downgrade of Benzema but thank god we had him to mix up our offense last season and he was VERY important !\n2. Kroos, a midfielder who has guaranteed &gt;90% pass accuracy,\n3. Nacho, a player who plays all positions in the defense\n4. Carvajal, our ONLY RB since 2014\n\nWatch the board buy another Brazilian midget by the end of the season !\n\nXabi Alonso, Klopp, Guardiola, Mourinho, none of them, separated or combined in any fucking way, will achieve shit with this squad either ! Easy to call out 'Carlo has no tactics' but you don't win chess games on high level with 6 bishops instead of the other pieces ! You need 2 Bishops, 2 Knights and 2 towers !\n\nCould Ancelotti have managed this season better ? Yes. Is he fully to blame ? Absolutely not and don't forget to shit on the board before shitting on the coach. Man asked for Harry Kane but got a CAM Bellingham so he switched the entire formation to fit him for a false 9 and it worked thanks to Vini wonder season.. So Perez decided to do this every fucking time because the next Brazilian midget he will buy will play as a left back because the board is to lazy to splash cash on an ACTUAL LB.\n\nY'all realize we have been playing for most of the season with 2 defenders in the 4 backline ? Tchou moved to CB and LV as RB are not their positions, Ancelotti's fuck up is not playing Asencio earlier, but it's sad to watch Alaba being average, then Fran comes in and he is just worse, together with Mendy's performances in this season. I don't need to talk about LV.\n\n3 Lewandowskis in the front won't work ! 3 Harry Kanes won't work ! 3 Sakas won't ! 3 Viniciuses won't work ! You need an actual number 9, an actual RW and an actual LW, but instead we have 3 LWs and people are like 'Any coach will destroy Europe with MVR' because they do in career mode on their PS5.\n\nWe can't win the UCL every season. Congratulations to Arsenal. Hala Madrid !",
        "upvotes": 120,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0yj7b/our_front_line_should_be_destroying_europe_is_a/"
    },
    {
        "id": "1k0m66r",
        "author": "monerfinder",
        "title": "I’ve created a Real Madrid Pendant for the “Remontada”!!",
        "content": "Hello dear Madridistas!\n\nI made myself a Real Madrid Pendant with my 3D Printer and I want to share it with you. I made it as a charm to bring if possible some luck to our boys today!\n\nI made the 3D model myself and I posted in Makerworld for any of you that wants to print it for yourself 😊. I will post the link to the model in the comments.\n\nI wish you a really nice game day and I hope that we can manage to pass today 💪💪!!\n\nHala Madrid!!",
        "upvotes": 521,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0m66r/ive_created_a_real_madrid_pendant_for_the/"
    },
    {
        "id": "1k0qzfh",
        "author": "Charybd1ss",
        "title": "Real Madrid have arrived",
        "content": "",
        "upvotes": 247,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i9ytr0qsk8ve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0qzfh/real_madrid_have_arrived/"
    },
    {
        "id": "1k0ti67",
        "author": "Short_Mousse_6812",
        "title": "Dumb hate against Madrid",
        "content": "Everyone complains about Madrid “robbing” or paying referees. But it is funny how they ignore when Madrid is done wrong by refereeing. Arsenal today wasn’t penalty, same as ours probably wasn’t in my own opinion. However everyone focuses on Madrid. If the penalty is given against Madrid then it is, “ cry Madrid you will lose”, but if it is in favor of Madrid then it is robbery. It is like being the best club makes people cry out since they have no other way of matching its greatness. ",
        "upvotes": 122,
        "comments": 108,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0ti67/dumb_hate_against_madrid/"
    },
    {
        "id": "1k0hnzs",
        "author": "RogueHaven",
        "title": "It’s game day, people!",
        "content": "m",
        "upvotes": 529,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/puo20gkgi6ve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0hnzs/its_game_day_people/"
    },
    {
        "id": "1k0qo38",
        "author": "Onegoofylad",
        "title": "The ritual has begun",
        "content": "",
        "upvotes": 141,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n1ki38cpi8ve1.jpeg?auto=webp&amp;s=6926773abc769605307f46c4e43088506bd5f96c"
        },
        "permalink": "/r/realmadrid/comments/1k0qo38/the_ritual_has_begun/"
    },
    {
        "id": "1k0pza8",
        "author": "xdjocko",
        "title": "Can we say Fran Garcia is done at Madrid?",
        "content": "Being the substitute for Mendy, one would think he would start in case Mendy is injured or unavailable.\n\nAncelotti has shown time and time again that he has no trust in Fran. Every big game there are talks that Fran is not trusted enough by Carlo to deal with X opponent. I am sure this takes a hit on Fran's confidence and actual will to play the game.\n\nAfter seeing today's starting eleven, where Alaba is again starting at left-back, can we say that Fran Garcia has no prospects at Real Madrid anymore?",
        "upvotes": 145,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0pza8/can_we_say_fran_garcia_is_done_at_madrid/"
    },
    {
        "id": "1k0k53h",
        "author": "skyejedi27",
        "title": "Tonight’s TIFO. Chessboard with City and Atleti knocked down, taking Arsenal. PERFECTION 😍",
        "content": "",
        "upvotes": 284,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0k53h/tonights_tifo_chessboard_with_city_and_atleti/"
    },
    {
        "id": "1k0gzjd",
        "author": "Yenoon",
        "title": "My Legend, it’s today or never.",
        "content": "",
        "upvotes": 478,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0gzjd/my_legend_its_today_or_never/"
    },
    {
        "id": "1k0pl1a",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Arsenal",
        "content": "",
        "upvotes": 126,
        "comments": 394,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dh8N8483MV08bSPfMCHXGRESZOvBxM4X96YKPKPwM48.jpg?auto=webp&amp;s=09dcdf3ff395da9e4785fad01a7d47497147849f"
        },
        "permalink": "/r/realmadrid/comments/1k0pl1a/our_starting_𝗫𝗜_arsenal/"
    },
    {
        "id": "1k0rgbk",
        "author": "Okforealtho",
        "title": "Those script writers sure know how to put on a show",
        "content": "#stolen",
        "upvotes": 91,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/geasa8nbo8ve1.jpeg?auto=webp&amp;s=5c262c54cc7b8929b53f79cfdda4e8cc018d6daa"
        },
        "permalink": "/r/realmadrid/comments/1k0rgbk/those_script_writers_sure_know_how_to_put_on_a/"
    },
    {
        "id": "1k0qywn",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Arsenal FC Live Score | UEFA Champions League | Apr 16, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0qywn)",
        "upvotes": 94,
        "comments": 9119,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0qywn/match_thread_real_madrid_vs_arsenal_fc_live_score/"
    },
    {
        "id": "1k102aa",
        "author": "Danickcoolman",
        "title": "Football is played on the pitch, not on social media.",
        "content": "I’ve said it multiple times and I’m going to say it again: Carlo needs to leave. He needs to leave because a legendary manager cannot continue to tarnish his legacy by what was being displayed by his players and by himself. Today, 7 out of 42 crosses were successful, Vazquez was seemingly one of our best players and the attitude of some players that are supposed to be leaders was downright embarrassing. Just like the title says, you play on the pitch, not on social media. \n\nThis is a lesson for the Instagram warriors that are our players and the admin of the club’s account. For an entire week, we’ve heard them say “Remontada this, remontada that” or “we’re going to comeback” or even “remontada has been the most used word in the dressing room” when a remontada DOESN’T come out of thin air. 3-0 against Wolfsburg was thanks to a brilliant Cristiano Ronaldo, 3-1 against City in 2022 was thanks to a brilliant Rodrygo, Courtois and Benzema and etc. Do you guys see a pattern here? Every remontada has been thanks to players trying their hardest because they believe that they can do it and that they don’t need to talk on social media to play their football. But what about today? We had:\n\n- Rodrygo Silva de Goes who has been invisible, yet AGAIN. His last goal being against Atletico back in march. “Only idiots forget the R”. I know that he’s playing out of position, but Raphinha has been playing out of position since the beginning of the season and is at 50 G/A+. Great players should always perform even if they play out of position.\n\n- Kylian Mbappé Lottin who wants to play as a central midfielder instead of making runs in behind. “Adaptation period is over: I’m going to be the one deciding matches now”\n\n- Vinicius José Paixao de Oliveira Junior who, despite being the best out of the three tonight, has been seen hugging the touch line too much instead of exploiting the space centrally when Mbappe wasn’t there and playing with Alaba when he was overlapping in the first leg. “I’m going to do it 10x more, they are not ready.”\n\nWhat I hate the most in football are people who like to talk days before the actual game. We put out a disastrous performance in the first leg and you would think that the players and the coaching staff would learn from their mistakes and prepare at least **something** against Arsenal, am I right? I can understand that we’re playing against the best defence in the Premier League, but this doesn’t excuse the lack of solutions from Ancelotti. I mean, Courtois said in an interview that the players are doing what Ancelotti is telling them to do, they want to respect his wishes. Spamming crosses to nobody in the box or refusing to play out from the back isn’t how you’re going to win matches. Time and time again in today’s match, long balls were being spammed when we know that our front three has no aerial threat, so why are we doing that? And don’t get me started on David Alaba. He never should’ve started at LB.\n\nPutting the blame on the coach and the players is unfair, right? So, how about we talk about the so called “ruthless president” that is Perez and the idiots that run our board? It’s maddening how Perez thought that adding another left winger to a team that already has two was a great idea. Don’t get me wrong, Mbappé is a fantastic player, but he sure as hell **WASN’T** the player that Madrid needed. \n\nEveryone, Madridistas and neutrals, could see that Madrid needed a REAL number 9 to finally have the aerial threat that they had been lacking ever since Benzema left the club. Vini’s best season has been when he had a number 9 to rely on so what does Perez do after seeing that we need a number 9 and that Joselu has been a fantastic player when it comes to aerial threat despite being on loan? He buys another left winger because Galactico! The result is a disjointed attack with three guys that want to play on the left, leaving 34 years old Lucas Vazquez essentially playing as the RW and Valverde running from defence to attack just to cover the gaps left by Vazquez. But hey, the board is there to help, right? Of course not. We have bums that consider Eder Militao, 2 ACL injuries in two years by the way, the “signing” of next season. Bums who clearly see that we desperately need fullbacks but chose to renew Vazquez. Clueless idiots who will come out on an interview and say “we won two champions league, so everything will be okay” when we are getting outplayed by every big team either at home or away. When will this circus end? When will these human beings finally acknowledge that our squad depth is embarrassing and that spending 50 millions on Dean Huijsen who has been fantastic for Bournemouth and Spain isn’t something to be ashamed of? Is the club just a joke for them? I speak for every Madridista when I say that we love this club with passion and that we will continue supporting Real Madrid no matter what happens, but we are not idiots. We can see that the club is not going well and it is **INFURIATING** to see the people in power not doing a single thing to help this cause. Real Madrid is the greatest club in the world and a club with such a title should not be allowed to be so immature when it comes to transfers or squad depth. The board and Perez are supposed to be helping the manager with signings, so why aren’t they doing it?",
        "upvotes": 25,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k102aa/football_is_played_on_the_pitch_not_on_social/"
    },
    {
        "id": "1k0qbzg",
        "author": "EmperorLedford",
        "title": "David Alaba and Lucas Vasquez",
        "content": "So the lineup is out. Most of us aren't happy, but I hope that everyone turns up. Carlo is taking a huge gamble but I am hoping it pays off. Any mistakes from anyone especially Vasquez and Alba will basically seal their fate at Real Madrid. This game will be a turning point this season either for the better or worse. \n\nI'll have faith in the team, let's just get the job done. ",
        "upvotes": 72,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0qbzg/david_alaba_and_lucas_vasquez/"
    },
    {
        "id": "1k0txkg",
        "author": "MHBosteer12",
        "title": "UEFA explains why penalty awarded to Real Madrid vs Arsenal was overturned after VAR review",
        "content": "",
        "upvotes": 45,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L_YQkuqGjMZrJn_88o8cxY7SiFUe82s2sHiOtOjBwFk.jpg?auto=webp&amp;s=62c5f79f32499708fa0265e15f889ef560976ac9"
        },
        "permalink": "/r/realmadrid/comments/1k0txkg/uefa_explains_why_penalty_awarded_to_real_madrid/"
    },
    {
        "id": "1k0hhxv",
        "author": "Domesticated_Cum",
        "title": "Whatever happens today, Im very proud of the image Real Madrid has in everyone's mind this week.",
        "content": "Not a single other club can do what we did this week. 3-0 down. Playing bad for most of the season. Vs a team that is known to have one of the most solid defenses. And yet everyone is talking about a comeback and not to discount Real Madrid already. Arsenal fans are legit scared to celebrate the lead. If this was ANY other club it would be a done deal. Yet here we are.\n\nLETS FUCKING COOK.",
        "upvotes": 220,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0hhxv/whatever_happens_today_im_very_proud_of_the_image/"
    },
    {
        "id": "1k0kzyi",
        "author": "Troopzie",
        "title": "Tonight I just want to see us play football...",
        "content": "I just hope tonight we finnaly play with some passion even if we don't end up going thru. I want to see vini and mbappe tracking back and pressing for the whole 90minutes, Ceballos and modric creating chances, Bellingham everywhere correcting everyones mistakes (hopefully none).\n\n I am delusionally confident we will turn it around but this should be the bare minimum.",
        "upvotes": 120,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0kzyi/tonight_i_just_want_to_see_us_play_football/"
    },
    {
        "id": "1k0pqaj",
        "author": "yowhosmansisthis",
        "title": "Just in time for the remontada!",
        "content": "",
        "upvotes": 59,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b4lqvss1c8ve1.jpeg?auto=webp&amp;s=fe52dac26db2df2a4c1b48e143f003076098efe6"
        },
        "permalink": "/r/realmadrid/comments/1k0pqaj/just_in_time_for_the_remontada/"
    },
    {
        "id": "1k0vijc",
        "author": "soccer-stats",
        "title": "Post Match Stats: Real Madrid vs Arsenal",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k0vijc)",
        "upvotes": 26,
        "comments": 191,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0vijc/post_match_stats_real_madrid_vs_arsenal/"
    },
    {
        "id": "1k0cryw",
        "author": "Medium_Breadfruit_22",
        "title": "Literally the only player we have that can recycle possession at high volume while being press resistant (similar to Kroos), his injury has a lot to do with our current struggles",
        "content": "",
        "upvotes": 354,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t4hezo18t4ve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0cryw/literally_the_only_player_we_have_that_can/"
    },
    {
        "id": "1k0n9ww",
        "author": "BeautifulSea9005",
        "title": "Next season goalkeeper kit is a masterpiece",
        "content": "",
        "upvotes": 48,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/80cbgms3u7ve1.png?auto=webp&amp;s=9360b231b20c04012cab55935315038d883ee362"
        },
        "permalink": "/r/realmadrid/comments/1k0n9ww/next_season_goalkeeper_kit_is_a_masterpiece/"
    },
    {
        "id": "1k0fplf",
        "author": "mishhka1",
        "title": "Real Madrid matching lock/home screen combo I created ⚽",
        "content": "[See wallpapers here](https://wallpics.app/soccer)",
        "upvotes": 101,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0fplf/real_madrid_matching_lockhome_screen_combo_i/"
    },
    {
        "id": "1k0z02t",
        "author": "Top_Village2471",
        "title": "Where do we go from here",
        "content": "I'm sure alot of you are wondering where we go from here.\n\nHeres what we know about next season:\nWe'll be signing TAA (not confirmed close enough)\nWe'll probably be getting a new manager in the way of Xabi Alonso\nWe have to play the stupid club world cup\n\nSpeaking on TAA. this whole thing is giving me mbappe vibes again. We have a whole attack which cant press or man mark if their life depended on it and we want to sign a RB who cant even defend. This just relegates valverde to a cm whose only job is to help TAA defend. Everyone kept thinking last season how is mbappe gonna fit into this side. And so many people said if anyone can figure it out its Carlo. Well look where that got us. And now its gonna happen all over again.\n\nNow a possible new manager and a club world cup coming up. When do we sack Carlo ( if we do). Do we do it before or after the club world cup. Will our new manager have enough time to instill his new tactics. Its takes a whole preseason to atleast get the squad  comfortable with a change. Look at how amorim has struggled to get his tactics across. Imagine if flick had a half a preseason at barca. This club world cup is just adding alot of confusion. Add in a possible mix of new player and it gets even worse\n\nBut one thing is clear from this whole debacle, if one man is to take the blame for this its Perez. Its like his whole plan was Carlo will figure it out. You cant play 11 players on the pitch on vibes and you certainly cant run a whole football club and its recruitment on vibes. I can only hope common sense prevails at the club somehow.",
        "upvotes": 7,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0z02t/where_do_we_go_from_here/"
    },
    {
        "id": "1k0dl0z",
        "author": "StrongStyleDragon",
        "title": "Today’s the day!!!!!",
        "content": "",
        "upvotes": 124,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wo000bto25ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0dl0z/todays_the_day/"
    },
    {
        "id": "1jzzd6n",
        "author": "nicootimee",
        "title": "Came just in time for the remontada",
        "content": "",
        "upvotes": 894,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ybkvuilol1ve1.jpeg?auto=webp&amp;s=65a1238fe48d1fdb466640cd993eaad55071cdea"
        },
        "permalink": "/r/realmadrid/comments/1jzzd6n/came_just_in_time_for_the_remontada/"
    }
]