[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jg2pvg",
        "author": "Flashy-Squirrel6762",
        "title": "The reason so many of us are missing the point of Adolescence",
        "content": "To everyone saying it’s pretty clear in the first episode and all the evidence points to it. \n\nI, like many, was waiting for the plot twist where *anyone else* was the murderer. \n\nAnd I sat with why, one reason is - it’s because we are constantly shown what it looks like from Jamie’s view. Like the lady constable DS Frank said in the school, “Right, the perpetrator always gets the front line. ‘A man raped a woman’. We’ve followed Jamie’s brain around this entire case…Everyone will remember Jamie. No one will remember her”. \n\nIt’s also shot in such a way that you *feel* like you are a bystander - right next to Jamie, experiencing everything with him. \n\nFrom the moment they barge into his room, sitting in the van looking out the window, not eating his cornflakes, drawing blood, the strip search and to the room where he keeps denying it. You say yes he punched her but you don’t SEE the knife or the stabbing clearly. \n\nAnd then as the episodes progress, you pick and choose the information that supports your hypothesis. He was bullied, he just retaliated. Someone else has the knife. \n\nThe only impact we visibly see of Katie’s death was her friend - who was hurting but was also rude &amp; violent &amp; “troubled”. \n\nThe scene with the psychologist also starts with Jamie being beaten - again more sympathy. He likes hot chocolate, he LOOKS so innocent. Boys will be boys, but Katie rejected him, while he was doing a nice thing by showing her support. The only time you feel some sense of horror is when he’s yelling at the psychologist, but then he calms down and says sorry. \n\nUntil he actually says he wants to plead guilty, you don’t *want* to believe it. \n\nThis whole show is a masterclass in **how we erase the victim every step of the way**. The narrative is always from the man’s point of view and we forget the woman. \n\nAnd how to find excuses because we don’t want to believe. I couldn’t even tell you what Katie looked like. But I know Jamie likes hot chocolate and hates pickles. \n",
        "upvotes": 248,
        "comments": 160,
        "media": null,
        "permalink": "/r/netflix/comments/1jg2pvg/the_reason_so_many_of_us_are_missing_the_point_of/"
    },
    {
        "id": "1jg0jf8",
        "author": "julialoveslush",
        "title": "Who is this actor in adolescence?",
        "content": "Can’t find him on IMDB but sure I’ve seen him somewhere. He was behind the desk at the police station ",
        "upvotes": 120,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1jg0jf8/who_is_this_actor_in_adolescence/"
    },
    {
        "id": "1jg1z9p",
        "author": "Prestigious-Neat-625",
        "title": "Stephen Graham is F-ing Phenomenal",
        "content": "I cant get over his performance in Adolescence, but also Bodies, This is England, and everything he's done. HE IS SO FUCKING AMAZING IN EVERY ROLE HE DOES.\n\nI'm sorry, idk if this is the right sub, but Adolescence has been an unreal watching experience. Not only is the story, cinematography, and acting amazing, but the underlying message too?? Omg. \n\n\nNetflix, it's time to leave Hollywood behind and keep finding British shows!!",
        "upvotes": 82,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jg1z9p/stephen_graham_is_fing_phenomenal/"
    },
    {
        "id": "1jg7f5l",
        "author": "Super-Jury8571",
        "title": "Adolescence, people are hyper fixated on the bullying",
        "content": "I loved the show, I watched a few days ago, and since then I’ve been seeing a lot of videos and post about the show. Something that’s been bugging me is the hyper fixation of the bullying. I don’t think it should be ignored, it was showed for a reason, however I hate seeing people use it as a justification or excuse for murdering Katie. \n \nJamie was a victim, but not of Katie’s. Katie’s comments were made after he participated in the passing around of her nudes and the negative commentary of her body and then tried to take advantage of Katie’s “vulnerability” by asking her out. When she rejected him he felt so insulted and humiliated because “how dare someone who is flat and who no one else wants rejects him”. When she retaliates by calling him an incel he tries to intimidate and scare her and when that doesn’t work he murders her. He then leaves her body on the ground, runs off and proceeds to deny murdering her even though there is OVERWHELMING evidence that he killed her. He feels absolutely no guilt and even tried to validate himself by calling her names later in the series. A lot of people act like Jamie is Katie’s victim or that the names she called him is why he killed her when it’s not. \n\nJamie is a victim of societies unrealistic standards for men, unbroken familial cycles, the school system and other men who prey on insecure, neglected and isolated boys. With that being said I don’t feel bad for Jamie, I recognize what he represents however I feel no sympathy. Jamie still killed an innocent girl because he was insecure. Jamie did not kill Katie because she called him names, he killed her because he felt small and powerless and needed to make someone feel weaker. \n\n(This is just how I interpreted the show, I’m interested to hear yalls opinions!! Just keep it kind please) ",
        "upvotes": 34,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jg7f5l/adolescence_people_are_hyper_fixated_on_the/"
    },
    {
        "id": "1jgc5mm",
        "author": "Exotic_Process_8235",
        "title": "UK teachers, how real are the school scenes in 'Adolescence'?",
        "content": "As a mother of a baby boy, I am frankly horrified of the state of the school. Teachers that are dead inside, only videos playing, unruly students and bullies etc. I'm so worried that this is the future for my son. Is it overly dramatised or is it the reality? ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jgc5mm/uk_teachers_how_real_are_the_school_scenes_in/"
    },
    {
        "id": "1jfng61",
        "author": "Plane-Cloud-5837",
        "title": "Netflix unveils plans for Adolescence season two and beyond",
        "content": "",
        "upvotes": 223,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1jfng61/netflix_unveils_plans_for_adolescence_season_two/"
    },
    {
        "id": "1jga8il",
        "author": "OkTime3175",
        "title": "Adolescence: generational trauma",
        "content": "I haven’t seen much discussion about this. People are mainly putting the blame on incels and toxic masculinity. While I agree, I believe the main reason why he lost control is because of his childhood upbringing by his parents while well intentioned. \n\nHis dad experienced physical abuse from his dad. That shapes the way he treats his son. He tries his best but he has a terrible temper as we see the way he confronts the graffiti boys. That scene was chilling since it really reminded me of the way Jamie acted towards the therapist and the girl he murdered. If the dad was holding a knife I could see things turning out differently. He was out of control with his anger hence throwing paint all over his car and staining the carpark. I believe Jamie really didn’t mean to go as far as murdering him. His rage (learnt from his dad) took over and he lost control.\n\nThe way his dad talks to his mum was terrible. Treating her without respect and that would shape Jamie’s view on how men should treat women. This might’ve led him to be drawn to the incel community. Also his lack of self worth could be from his dad as well, never being able to please his dad. As a child, pleasing our parents is our #1 goal and this helps build our self esteem, see us worthy of dating. \n\nIf his dad went to therapy before he had a child and sorted out his rage and his attitude towards his wife, things could’ve turned out a lot better. \n\nI don’t know. I wanted people to pick up this idea more. I hoped this would make parents wary about how they treat their children, how it effects children when they see their parents argue (peacefully talking vs yelling until the other subsides). ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jga8il/adolescence_generational_trauma/"
    },
    {
        "id": "1jfqc21",
        "author": "BloodAndSpit36",
        "title": "Concerned with people's responses to Adolescence",
        "content": "I've seen quite a lot of reviews of the show discussing how much viewers hate Jamie, see him as evil and so on. \n\nI think these people are missing such a crucial point of the show - that being that children are growing up much too quickly in modern society. \n\nWe cannot view a 13 year old throught the lens of being evil, and responding to their behaviours so virulently as to say we hate him. \n\nEvery aspect of the show is concerned with the lost childhood. The obsession with sex for both the boys and girls in the school, the \"sexual marketplace\" competition accelerating bullying between boys, from boys to girls and from girls to boys. \n\nJamie is eerily mature for his age, we see this in how cognisant he is of the situation that he and the people his age are in; but that maturity isn't a true maturity and acts as an illusion which I can understand make people think he is responsible for his actions. \n\nThat maturity is a very fragile one. It's superficial, only existing as an expression on the surface - a performance that others his age copy from social media and force each other to fit into. \n\nI think that's the main point to take from this show. ",
        "upvotes": 43,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1jfqc21/concerned_with_peoples_responses_to_adolescence/"
    },
    {
        "id": "1jfxkcf",
        "author": "_CaptainKaladin_",
        "title": "Shows like Adolescence?",
        "content": "I just finished the show, holy crap that was incredible. Devastating finale, the actors were all incredible. \n\nAnyone have any recommendations for shows with a similar premise? Thanks! ",
        "upvotes": 14,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jfxkcf/shows_like_adolescence/"
    },
    {
        "id": "1jgbxsd",
        "author": "BewitchedHare",
        "title": "My thoughts on adolescence",
        "content": "Adolescence is a gripping, unflinching look at youth, crime, and the fraying edges of modern Britain. Across its episodes, the series—helmed by writer Jack Thorne and a talented cast—excels at plunging viewers into raw, real-time tension. Episode 1’s chaotic school shooting aftermath and Episode 2’s haunting family fallout showcase its strengths: taut pacing, stellar performances (Stephen Graham’s anguished dad, Erin Doherty’s layered psychologist Briony), and a knack for capturing the messy humanity of crisis. The single-shot style amplifies the claustrophobia, making every moment visceral. It’s a series that doesn’t flinch from tough questions about kids, violence, and responsibility.\n\nBut Episode 3, centered on Briony’s evaluation of 13-year-old Jamie—a boy who’s murdered a classmate—lays bare the show’s limits and a deeper truth: the system is broken. Here, Adolescence shifts from reflection to indictment, exposing a society that breeds tragedy then shrugs. Briony’s session with Jamie, meant to assess his mental state for court, is a microcosm of failure. She corners him with questions about his dad, masculinity, and victim Katie, triggering predictable outbursts—chair-throwing, shouting—that she logs as “volatility.” It’s obvious stuff; push a kid hard enough, and he’ll snap. As a forensic psychologist, she’s bound by protocol, but that’s the problem: her role confirms the obvious without digging into why Jamie exploded.\n\nThink of HBO’s Chernobyl. There, the RBMK reactor’s meltdown traced back to a toxic mix—Dyatlov’s recklessness, a lying Soviet system. Jamie’s crime has its own synergies: bullying from Katie and peers, manosphere radicalization online, overworked teachers, absent parents, rigid police “procedure.” He might’ve had a colder streak—less empathy, a shorter fuse—but these forces pushed him over the edge. Briony’s report misses this, stuck on “he’s violent when provoked.” It’s like noting the reactor blew up without asking why it was primed to. The episode flashes these culprits—mean kids, social media sludge, adult neglect—but doesn’t indict them. It’s a lost chance to dissect the guilty instances, leaving viewers with a shrug where Chernobyl gave answers.\n\nThe good shines through: Doherty’s Briony is compellingly human, fraying under pressure, and the one-shot format traps you in Jamie’s rage. The series mirrors reality—overstretched schools, toxic online spaces, procedural inertia—with unsettling accuracy. But Episode 3 stumbles by not pushing further. Briony’s protocol sucks by today’s standards; it’s a relic, blind to prevention. She could’ve probed the bullying’s depth, the radical voices Jamie absorbed, the system’s failures—data to stop the next tragedy. Instead, she’s a cog in a machine that files reports while the reactor hums, ready for another blowout.\n\nHow to fix it? The system needs a rethink—protocols that demand context, not just symptoms. Forensic assessments should trace social threads—peer cruelty, online poison, institutional gaps—giving courts tools to address root causes, not just punish outcomes. Schools need resources to spot and stop bullying; parents and platforms must face accountability. Adolescence shows what’s broken but stops short of solutions. It’s a stark portrait of a failing Britain—one that can’t even name its demons, let alone slay them. Episode 3 proves it: we’re still confirming explosions, not preventing them.\n\nEdit: Fixed mistake pointed out by comment. \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jgbxsd/my_thoughts_on_adolescence/"
    },
    {
        "id": "1jfkkm4",
        "author": "ManyFaithlessness404",
        "title": "Watched adolescence and it was powerful",
        "content": "The show is the need of the hour, toxic masculinity is real, incel culture is real and it is scary. I did try giving Jamie benefit of the doubt for the first 30 seconds and then I couldn't. This is so prevalent all around and I hope and pray the world becomes better but I doubt it will.\n\nNeedless to say, the show was done brilliantly - the actors did an amazing job and my heart cried for the parents and the show was so raw and I loved that. \n\nJust finished watching 30 minutes back and the raw emotions still linger in my mind and in my heart.. ",
        "upvotes": 62,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jfkkm4/watched_adolescence_and_it_was_powerful/"
    },
    {
        "id": "1jfntm9",
        "author": "elphiegal",
        "title": "Adolescence shows the importance of parental figures",
        "content": "Please don’t read if you haven’t watched or don’t want it spoiled for you.\n\n\nI have read people saying that adolescence is boring, it’s not realistic, it’s not “murder mystery” and its just not everyone is understand the point of the show?\n\nIt never ever said it was a murder mystery, we find out from the very start who the killer was, it was about why the killer did what he did. \n\nIt’s about the reasoning and the logic behind one’s actions especially at a young age.\n\nOne thing that is important and they made a big deal to point it out in episode 3, is Jamie’s relationship with his father, he says his dad is kind but can be angry and is a “good man” but can lose his temper.\n\nWe see in episode 1 that once Jamie has been arrested, his dad never comforts him once, he doesn’t reassure him, he doesn’t hug him or touch him, just looks at him awkwardly like “what do I do?”\n\nEven his mother was confused when Jamie asked for his dad to be his appropriate adult, the reason to why he didn’t have his mom was more than likely he couldn’t deal with her disapproval in her face, while with his dad he’s use to it as he says in episode 3 with his therapist, when he played football and messed up his dad would look away.\n\nUntil his dad sees the CCTV footage and realised that his son has killed someone and that is when he hugs his son, whether that was comfort to him or for his son or fear for the fact his son is going to prison!\n\nThe show shows how children learn how to react based on how their parents react to situations.\n\nIf he sees his dad acting all aggressive and angry towards his mother and sister, then he must think it’s okay for him to act like that towards other women, since his dad does it! \n\nHis dad does not give him love or affection from what we see when he’s arrested and if he doesn’t receive that from his own father how is he meant to understand how to give love and affection?\n\nEverything we know is what we have learnt from watching our parents.\n\nNow insert social media, your parents don’t show you how to act so you go to the internet and there’s the forums degrading women, then that must be how to be a man.\n\nMen need to stop thinking being masculine means not being kind and loving. \n\nThere’s so much more I would want to say but I’d be here forever. ",
        "upvotes": 21,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jfntm9/adolescence_shows_the_importance_of_parental/"
    },
    {
        "id": "1jfsylt",
        "author": "V_Frln",
        "title": "The Four Seasons | Official Teaser | Netflix -&gt; May 1",
        "content": "Dare I say I am positively impressed by this? Seems fun ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jfsylt/the_four_seasons_official_teaser_netflix_may_1/"
    },
    {
        "id": "1jfo5x0",
        "author": "OverSyncopatedBeats",
        "title": "After Adolescence, Owen Cooper is in this new show written by and starring Aimee Lou Wood!",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jfo5x0/after_adolescence_owen_cooper_is_in_this_new_show/"
    },
    {
        "id": "1jf1wbf",
        "author": "seethatocean",
        "title": "Adolescence made me angry",
        "content": "As a mother of a teenage daughter, Adolescence made me angry.\n\nI mean, it was impossible to feel any sympathy for Jaimie after seeing the video evidence.\n\nI find it ridiculous that people are making excuses for Jamie and blaming online toxicity for his actions. As if he is a victim..\n\nLike - I don't care whether your son was born like this, or became an anti-women terrorist because you allowed him to watch inappropriate online content , or you yourself radicalized him - he doesn't get a right to kill teenage girl and then play the victim card. \nHe needs to be locked away in jail as per whatever law decides. \n\nWe need to perhaps revisit our laws in various countries where underage criminals get away with almost anything. \n\nDo we show the same consideration to religious islamic terrorists and to black youth? Do we say - oh come on, they are just being radicalized online, let's not blame them. \n\nBut if it is a white straight boy, then the sympathy floodgates open up huh. \n\nI also wonder if people's reactions would be different if the victim was another boy- a white straight boy - instead of Katie. Then everyone would have said that Jamie was a criminal and not blamed the victim maybe.\n",
        "upvotes": 468,
        "comments": 295,
        "media": null,
        "permalink": "/r/netflix/comments/1jf1wbf/adolescence_made_me_angry/"
    },
    {
        "id": "1jg6a9q",
        "author": "biggreenegg99",
        "title": "Closed Caption as default for Roku TV Netflix app?",
        "content": "My mom needs closed caption on every thing she wants on Netflix.\n\nI know how to turn CC on individually for each show she watches but is there a way to set a default so that CC is on for every thing she watches?\n\n  \nthis is for a Roku TV Netflix app.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jg6a9q/closed_caption_as_default_for_roku_tv_netflix_app/"
    },
    {
        "id": "1jg24gz",
        "author": "Mirko02__",
        "title": "\"Horizontal Line Issue on LG UltraGear OLED 34GS95QE (Only on Netflix)\"",
        "content": "I have an issue with my PC monitor that I only notice when using Netflix. The problem is a horizontal line at the bottom of the screen, as if it's slightly out of focus. The line is about one pixel high but stretches across the entire width of the screen. My monitor is an LG UltraGear OLED 34GS95QE. Please help me — I really don't want to send the monitor for repair if it's something that isn't caused by the monitor itself.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jg24gz/horizontal_line_issue_on_lg_ultragear_oled/"
    },
    {
        "id": "1jfohoz",
        "author": "Robemilak",
        "title": "Wonka-Inspired Series 'The Golden Ticket' Is Coming To Netflix and You Can Compete in It!",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfohoz/wonkainspired_series_the_golden_ticket_is_coming/"
    },
    {
        "id": "1jg6k7z",
        "author": "Spiky-Penguin2023",
        "title": "Karate Kid universe battle: Miguel Diaz (Cobra Kai Season 6 Part 3) vs Colonel Dugan (The Next Karate Kid)",
        "content": "This is a fight between Miguel Diaz from Season 6 part 3 of the Cobra Kai series and Colonel Dugan from The Next Karate Kid movie.\n\nWhile Dugan is an adult and Miguel is a teenager, it is important to note that Dugan is clearly the weakest among the evil \"senseis\" (if you can even call him that lol) we've seen in the Karate Kid franchise, whereas Miguel is a world Karate champion among teenagers.\n\nWho wins in a fight?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jg6k7z/karate_kid_universe_battle_miguel_diaz_cobra_kai/"
    },
    {
        "id": "1jfcmxr",
        "author": "Inspired_Owl",
        "title": "Adolescence",
        "content": "What a masterpiece, I was sobbing at the end. \n\nFirst of all, my sympathy goes out to the family, especially the father. It was really eye opening to what goes on online and how it can affect people, especially young people. I’m 18 and had no idea about ‘incel’ or ‘exploding pill’, it was terrifying seeing what content anyone can access. \n\nI couldn’t take my eyes of the screen, 4 hours straight I was on the edge of my seat. \n\nI honestly think this is a good programme for anyone raising kids to watch. It was very eye opening.\n\nAnd the acting. Holy shit, I had to remind myself often that it was a to show and not a documentary. Hats off to everyone who worked on the programme.",
        "upvotes": 50,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jfcmxr/adolescence/"
    },
    {
        "id": "1jg0u26",
        "author": "somepinky",
        "title": "Has anyone else experienced delay with subtitles?",
        "content": "I've never seen the need to use subtitles, but now when I want to do so, the subtitles take a long time to appear or they don't appear at all, I tried to contact support but, there is a stupid excuse...I use my father's account so I dont have his password or email lol\nTo clarify I use Netflix on my SMART TV (Tophouse)\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jg0u26/has_anyone_else_experienced_delay_with_subtitles/"
    },
    {
        "id": "1jfzcnx",
        "author": "Tvshownerd",
        "title": "Only one show(big bang theory) is not opening from my mobile app but works on tv. Is there a reason?",
        "content": "It says “Sorry something went wrong. Please try again later” but it’s been more than 3 days and I tried uninstalling and installing again but still no use.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jfzcnx/only_one_showbig_bang_theory_is_not_opening_from/"
    },
    {
        "id": "1jga1ij",
        "author": "Solid-Basis1026",
        "title": "Can someone enlighten me on why I should finish adolescence?",
        "content": "I’m so terribly bored. I’m trying to get through the first two episodes but it’s dragging so bad. It’s top 10 so clearly most people like it. My attention span is short. So after the first 30 mins I usually start zoning out, I’m trying really hard here. Is it actually worth finishing?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jga1ij/can_someone_enlighten_me_on_why_i_should_finish/"
    },
    {
        "id": "1jgcbn2",
        "author": "JMHorsemanship",
        "title": "I don't usually hate a show or movie, but adolescence has to be the worst series I have ever watched.",
        "content": "First 2 episodes I thought were great. 3rd episode i'm like wtf? and 4th episode it's like this shit is dumb. I've always enjoyed almost everything but this show is terrible. I googled it because I wanted to know what people are saying and apparently people like this? so confusing. Epsiode 1 and 2 were interesting with them finding out details, getting to the bottom of it. episode 3 is just shrink bull shit and episode 4 seems like they were just bored and had to pay their actors, so they ran around filming extra random shit. Am I the only one who hated the show?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jgcbn2/i_dont_usually_hate_a_show_or_movie_but/"
    },
    {
        "id": "1jeot1i",
        "author": "flannel_flower",
        "title": "Why are so many missing the point of Adolescence?",
        "content": "There’s a lot of articles on Facebook about the new series Adolescence and the vast majority of people seem to have completely missed the point of the series and the message it’s trying to convey?                                                                   You have people asking whether Jamie really killed Katie, saying that it was left on a cliff hanger and there will be a series 2, that it was about bullying or knife crime. The series is clearly about toxic masculinity and how young boys are being brain washed by Andrew Tate and the likes. Jamie couldn’t handle being rejected by a “flat-chested” girl who was weak and vulnerable after her topless photos were circulated. He thought he was entitled to her, that he deserved her. She did ridicule him online with her comments on his Instagram which was a contributing factor but it really did come down to Jamie thinking he was entitled to Katie.",
        "upvotes": 1325,
        "comments": 540,
        "media": null,
        "permalink": "/r/netflix/comments/1jeot1i/why_are_so_many_missing_the_point_of_adolescence/"
    },
    {
        "id": "1jf78nv",
        "author": "sidroy81",
        "title": "Anurag Kashyap rips 'dishonest, morally corrupt' Netflix India, says they would 'never make' something like Adolescence",
        "content": "",
        "upvotes": 57,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jf78nv/anurag_kashyap_rips_dishonest_morally_corrupt/"
    },
    {
        "id": "1jg7el8",
        "author": "Gabblebabbi2",
        "title": "Okay, can we have a real conversation about adolescence?",
        "content": "It just felt like a huge tease. Only 4 episodes, and that’s the way it ends? So we don’t get to see any de-programming? We don’t get to find out why Jamie decided to plead guilty? That was extremely out of character for him, they could at least explain how he got there. And no trial to get more in-depth on Jamie’s motives and extreme, violent beliefs? No sentencing? We don’t get to meet Katie’s family? \n\nIt just really fell short for me, for a piece that’s finally tackling the red-pilled losers and what a threat they really are, it just left me feeling so unsatisfied. I need more. I need to see a fully fledged character arc. Leaving a limited series with hardly any gratification just really does any limited series a disservice, and leaving so much important information out really just takes away from such an important message. It didn’t really have anything that’d hold a mirror up to an incel and explain why it’s so messed up. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jg7el8/okay_can_we_have_a_real_conversation_about/"
    },
    {
        "id": "1jfz80c",
        "author": "doteezworld",
        "title": "Adolescence",
        "content": "OMG how good is this series ....the acting is incredible and one ep in particular had me riveted I couldn't move or break focus!! Such a good insight to young boys that may follow the Andrew Tate line of thought about life. Am I right in saying Brad Pitt was an executive producer on this??? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jfz80c/adolescence/"
    },
    {
        "id": "1jezg16",
        "author": "Grogman2024",
        "title": "Jamie’s crime in Adolescence",
        "content": "How is there so many people asking whether or not Jamie did it when he was very clearly caught on camera stabbing Katie. I’ve even seen a lot of people saying in the video you only see Jamie pushing her when you very clearly see more than that? Just very confused overall haha",
        "upvotes": 105,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1jezg16/jamies_crime_in_adolescence/"
    },
    {
        "id": "1jfs0db",
        "author": "menelauslaughed",
        "title": "Psychologists out there - opinion on Adolescence?",
        "content": "Any idea what she may have written in her report on Jamie? How much would she focus on her own emotions during the assessments? Would she have made any sentencing recommendations?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jfs0db/psychologists_out_there_opinion_on_adolescence/"
    }
]