[
    {
        "id": "1nthwc2",
        "author": "DreamEaterAMA",
        "title": "Hi r/movies! We’re Mallory Drumm. Jay Drakulic &amp; Alex Lee Williams, the team behind DREAM EATER, a new found-footage horror about a couple’s winter getaway that spirals into madness when sleepwalking leads to something much darker. We wrote, directed &amp; produced the film ourselves. Ask us anything!",
        "content": "Hi reddit! We're the filmmaking team behind DREAM EATER, a new found-footage horror film out in theaters October 24th.\n\n**Here's the trailer for our film:**\n\n[https://www.youtube.com/watch?v=ivl9iXq98TU](https://www.youtube.com/watch?v=ivl9iXq98TU)\n\n**About Dream Eater**: \n\nDuring their holiday at a cabin deep in the snowy Laurentian mountains, Mallory documents her boyfriend Alex’s violent parasomnia. When his sleepwalking gets worse, Mallory suspects the cause may be something far more sinister than a mere sleep disorder. Using her expertise as a documentary filmmaker, Mallory digs into Alex’s shadowy past and begins to unravel a decades-long mystery steeped in trauma and the occult. As darkness closes in, an ancient evil awakens – plunging the couple into a downward spiral of madness and horror that threatens to destroy more than just their relationship. By the time the end credits roll, DREAM EATER will have you questioning who you’re really sleeping next to at night.\n\n**Website**: [https://horrorsectionstudios.com/dream-eater/](https://horrorsectionstudios.com/dream-eater/)\n\nAsk us anything! We'll be back at 6:00 PM ET tonight (Monday 9/29) to answer your questions!",
        "upvotes": 37,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/47ktvxewk3sf1.png?auto=webp&amp;s=a85d3c057227ea2432d75e07852a70ccb0ce44ff"
        },
        "permalink": "/r/movies/comments/1nthwc2/hi_rmovies_were_mallory_drumm_jay_drakulic_alex/"
    },
    {
        "id": "1ntwc24",
        "author": "SanderSo47",
        "title": "September 26-28 Box Office Recap – 'One Battle After Another' opens with a very soft $22M domestically and $48M worldwide, against a $130M budget. 'Gabby's Dollhouse' opens with $13.6M. 'The Strangers – Chapter 2' debuts with just $5.8M. 'Demon Slayer: Infinity Castle' crosses $600M worldwide.",
        "content": "https://preview.redd.it/gxdw9gv2l6sf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=e413b513efedb7d45b8e2fb4b5afa72fc01437e3\n\nSeptember is coming to an end with three newcomers, and neither had a particularly impressive start.\n\nWarner Bros.'s ***One Battle After Another*** topped the box office, but its numbers are a far cry from its profitability prospects. DreamWorks' ***Gabby's Dollhouse: The Movie*** also had a soft debut, followed by an even worse performance overseas. But the week's worst performer was ***The Strangers – Chapter 2***, which fizzled out from the original film.\n\nThe Top 10 earned a combined $67.3 million this weekend. That's down 20.1% from last year, when ***The Wild Robot*** topped the box office and ***Megalopolis*** massively flopped.\n\nDebuting at #1, WB's ***One Battle After Another*** opened with $22 million in 3,634 theaters. And so, after 7 films, WB's streak of films debuting with $40+ million has come to an end. This debut is slightly below Leonardo DiCaprio's previous film ***Killers of the Flower Moon*** ($23.2 million). This was also Paul Thomas Anderson's first film to hit #1 and was his biggest debut, although that's not a high bar; none of his films started on wide release, none played at more than 2,000 theaters, and none earned more than $5 million on a weekend. \n\nOn its own, this would be a respectable figure. But there's one big problem: the film is carrying a gigantic $130 million budget. And so it goes from respectable to \"quite bad\". These numbers are eerily similar to the performance of ***Mickey 17*** earlier this year; it debuted with just $19 million on a $118 million budget before fizzling out quickly. One could argue that the film was made solely for acclaim or awards, but it's still a $130 million blockbuster with an extensive marketing campaign and a huge emphasis on IMAX. So its performance must be judged as a blockbuster.\n\nSo how could the film open this low? It's got a fantastic filmmaker teaming up with one of the most popular actors today, and the reviews are fucking fantastic (96% on RT, 95 on Metacritic). Wouldn't that translate into at least $30 million?\n\nFor starters, and this is something that it's a very sad truth, Paul Thomas Anderson is a stranger to the public. He's got the acclaim and awards, but his films have not connected with the public. His highest grossing film is ***There Will Be Blood*** with $40 million domestically. The rest of his films haven't cracked $30 million, and his last three films didn't even hit $25 million. With the exception of ***There Will Be Blood*** and ***Boogie Nights***, all of his films have flopped at the box office. And that's a huge shame, for he has delivered so much high quality for the decades. But audiences only recognize a few directors, and sadly, Anderson is not one of those directors.\n\nLeonardo DiCaprio is definitely a box office draw. Otherwise, the film wouldn't have opened to $20 million (and it's quite similar to ***Killers of the Flower Moon*** last year). But it's strange that this film opened below that film, considering it had a \"shorter\" runtime, more action and proper actor promotion (***Killers*** debuted during the SAG strike). While DiCaprio can attract audiences to theaters, seems like there's only so much he can do for a film like this.\n\nThe \"no marketing\" excuse can't be thrown here. WB mounted a very extensive marketing campaign, to the point that they even had a Fornite collaboration. It simply seems that the audience just wasn't interested in what the film had to offer, or the interest was smaller than expected. The first trailer also struggled to properly sell the film, focusing solely on DiCaprio and the cast going on crazy shenanigans. The second trailer properly sold the film's premise on a clearer angle, but it feels like the audience didn't want to give it a chance. With current tensions (both inside and outside America), it seems like audiences weren't in the mood for a story about revolutionaries.\n\nAccording to Warner Bros., 62% of the audience was male, and a colossal 77% was 25 and over. Those demographics are a bit concerning; it means young audiences didn't give a chance to the film, and that DiCaprio's presence failed to attract women to the film. 45% of the audience primarily watched the film for Anderson, and 41% for DiCaprio.\n\nAs an interesting stat, Deadline just reported that 72% of the film's performance came from blue counties. It overperformed in theaters located in blue counties by 13%, and underperformed in red counties by 24%. 51% of the film's attendance were in areas with populations north of 1 million. Compared to non-horror R-rated films, it over-performed in New York City (22% over the norm), San Francisco (+21%), Washington, DC (+26%) and Toronto (+61%). Two underperforming cities were Houston (-30%) and Dallas (-23%).\n\nNow, not everything is lost. Audiences gave the film a strong \"A\" on CinemaScore, which is the best of Anderson's career and the greatest score for DiCaprio since ***Titanic***. The film's older demographic also indicates that those don't neccessarily rush out to watch a film as soon as possible. With strong word of mouth and awards buzz, perhaps the film could leg out through October. It should definitely cross $70 million domestically. But is that going to be enough for this film? Look at the overseas section.\n\nIn second place, Universal/DreamWorks' ***Gabby's Dollhouse: The Movie*** debuted with $13.6 million in 3,500 theaters. That's DreamWorks' seventh lowest debut ever, and it goes all the way to top 5 worst if we adjust inflation.\n\nConsidering the film's tepid $32 million budget, this is not really a bad way to start. But it truly shows that a show's popularity doesn't always translate to a great result in the box office. Getting audiences invested in a ***Gabby's Dollhouse*** film was always going to be a challenge; it's a pre-scholar show with basically nothing for adults. Kids are obviously the main target, but adults are the ones who pay tickets and so it came a dilemma: will adults pay to watch something that their kids can watch at home in Netflix?\n\nAccording to Universal, 72% of the audience was female, and obviously the main demo was young girls. They gave it a rare \"A+\" on CinemaScore, which is actually DreamWorks' first ever film to get that grade (crazy, right?). The film's advantage is that there's not much family competition through October, so it could leg out. For now, it should hit around $45 million domestically.\n\nDropping to third place after topping the box office for two weeks, ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** continued its collapse. This time, it dropped 59%, adding $7.1 million this weekend. The film has amassed $118.1 million so far, and it should finish with around $130 million.\n\n***The Conjuring: Last Rites*** dropped 45%, adding $6.7 million. The film's domestic total stands at $161.3 million, and it looks like it will struggle to hit $180 million domestically.\n\nIn fifth place, Lionsgate's ***The Strangers – Chapter 2*** mustered just $5.8 million in 2,690 theaters. That's down a very rough 51% from ***Chapter 1*** ($11.8 million), which debuted back in May 2024.\n\nThere was no way this film was gonna come close to ***Chapter 1***. Not only because they waited 17 months to release the sequel, which was already complete back then, but because the film also earned very poor reviews, signaling that there was very little interest in a follow-up. And if you were expecting the film to be an improvement, well, that's not really the case (16% on RT).\n\nAccording to Lionsgate, 51% of the audience was female and 73% of the audience was in the 18-34 demographic. They gave it a brutal \"C–\" on CinemaScore, which is the lowest in the franchise. Given the horror competition on its way, it would be a surprise if ***Chapter 2*** made it past $15 million domestically. And there's still a ***Chapter 3*** waiting to be released, so we'll see how low the floor can get.\n\nUniversal's ***Him*** fumbled hard on its second weekend. The film collapsed a horrible 73%, earning just $3.5 million this weekend. The drop is not a surprise, considering the film's very poor word of mouth. Through 10 days, the film has earned just $20.7 million, and it's now guaranteed to miss $30 million domestically.\n\n***The Long Walk*** keeps on walking with some good drops. Once again, it dropped just 47% and added $3.3 million this weekend. The film has earned $28.7 million, and it should get to over $35 million by the end of its run.\n\nIn eighth place, ***Downton Abbey: The Grand Finale*** earned $3.3 million, for a 48% drop. The film has made $38.9 million, and it should finish with around $47 million domestically.\n\nFathom Events re-released Sam Raimi's ***Spider-Man*** trilogy, and they made $2.25 million this weekend combined.\n\nRounding out the Top 10 was the Indian film ***They Call Him OG***, which made $1.4 million ($5.2 million four-day).\n\nAfter its horrible start last week, Sony's ***A Big Bold Beautiful Journey*** pretty much died this week. It earned just $1.1 million, which was a very poor 66% second weekend drop. Romance films never drop that high. With just $5.7 million in 10 days, the film is going to lose so many screens. It won't make it much further than $7 million domestically.\n\nVertical released ***Dead of Winter*** in 605 theaters, but it could only make $1 million. It won't last long in theaters.\n\nSony also released Scarlett Johansson's directorial debut ***Eleanor the Great*** in 892 theaters, but it was a misfire with just $865,000 this weekend. Ouch.\n\n#**OVERSEAS**\n\n***One Battle After Another*** debuted with $26 million overseas, for a $48 million worldwide debut. That's just a little bit better than the worldwide debut of ***Killers of the Flower Moon*** ($21 million overseas, $44 million worldwide). Anderson's biggest debut, but like the domestic market, not a high bar; none of his film has made more than $80 million worldwide. The best debuts were in the UK ($3.4M), France ($3.4M), Germany ($2M), Italy ($1.4M) and Saudi Arabia ($1.3M). Markets like South Korea, Japan, Turkey and China are left.\n\nThe one way to describe these numbers is \"incredibly soft\", but it's also close to \"bad.\" DiCaprio's films are known for legging out, but it's still a huge barrier for the film to reach the $300 million it needs to break even. We'll keep an eye on this one. At the very least, this film should win tons of awards. And with this film, WB has officially crossed $4 billion, becoming the first studio this year to achieve it.\n\n***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** added $19.2 million. As such, the film has crossed $600 million worldwide, the first anime title to do so. The best Crunchyroll/Sony markets are Mexico ($16.6M), Germany ($12.5M), France ($12.3M), India ($9M) and the UK ($8.4M).\n\n***The Conjuring: Last Rites*** added $15.6 million this weekend, taking its worldwide total to $436 million. The best markets are Mexico ($28.5M), the UK ($22.1M), France ($18M), Brazil ($16.4M) and Germany ($14.4M). \n\nIn Asia, ***Chainsaw Man – The Movie: Reze Arc*** added $7 million, for a $26 million overseas run. It will release in other markets through October.\n\n***Gabby's Dollhouse*** opened with a soft $5.5 million overseas, for a so-so $19.2 million worldwide debut. While it still has many markets left, that's not an encouraging sign for its prospects.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Jurassic World: Rebirth* | Jul/2 | Universal | $92,016,065 | $339,640,400 | $867,114,682 | $180M\n\n- Universal's ***Jurassic World Rebirth*** has closed its run with $339 million domestically and $867 million worldwide. Another big success in this dino trilogy, despite the very mediocre reception it has garnered. Universal did everything on its power to make sure the film got finished quickly and released here because reasons. And it paid off profit-wise. Although it didn't really change the fact that the franchise has continued its decline at the box office; going $1.6B &gt; $1.3B &gt; $1.0B &gt; $867M suggests that maybe you should work on improving the writing, you know?\n\n#**THIS WEEKEND**\n\nWe're getting three wide releases and a limited release.\n\nThe biggest release is actually not a film. It's ***Taylor Swift: The Official Release Party of a Showgirl***, a special program for the release of Swift's new album, ***The Life of a Showgirl***. She already had a lot of power with ***The Eras Tour*** making over $260 million, and while this won't perform like that, it will still post some strong numbers. It was reported that the film has already sold $15 million in pre-sales in its first 24 hours across all circuits. But this event will only last one weekend.\n\nThere's also A24's ***The Smashing Machine***, the new film from Benny Safdie. It stars Dwayne Johnson and Emily Blunt, following the life of former amateur wrestler and MMA fighter Mark Kerr. The film is sold pretty much on \"The Rock is acting\" and has been a point of praise in all the film's reviews so far. Reviews for the film are positive (but not exactly highly acclaimed), and maybe the audience will respond favorably to the film.\n\nIFC and Shudder are also releasing horror film ***Good Boy***, which tells the story of a haunted house from the perspective of a dog. The companies seem confident in the film, considering they chose to open it in wide release instead of starting slow. The budget is insanely low, so the chances of breaking out are on its favor.\n\nAnd in limited release, there's Focus Features' ***Anemone***. The film has one selling point: the return of the GOAT Daniel Day-Lewis after a 8-year absence, who co-wrote the film with his son Ronan (the director). Everyone knows he always delivers, and this is not going to be the exception. The film itself, however, won't. It's currently sitting at a middling 60% on RT and 48% on Metacritic, which is very poor for a platform release. With other adult dramas this month, it's likely that it will get lost once it expands wide next week.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 55,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3tIOQA3SE6kAKec6MLeOkduL-3CIMW_IRn2bVS65Vmc.png?auto=webp&amp;s=43d662cf16f058bdedf83bcdbff0ce599fcf5250"
        },
        "permalink": "/r/movies/comments/1ntwc24/september_2628_box_office_recap_one_battle_after/"
    },
    {
        "id": "1ntp6it",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the New 'The Simpsons' Movie",
        "content": "",
        "upvotes": 26292,
        "comments": 1814,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fdrkwcoa85sf1.jpeg?auto=webp&amp;s=2240e7d5ffc2927cbfbb6bea9b88607e81ba9bbb"
        },
        "permalink": "/r/movies/comments/1ntp6it/official_poster_for_the_new_the_simpsons_movie/"
    },
    {
        "id": "1ntv30m",
        "author": "GoldDerby",
        "title": "‘Serenity’ at 20: Alan Tudyk revisits his ‘shocking and absurd’ death scene in the ‘Firefly’ feature film",
        "content": "",
        "upvotes": 1699,
        "comments": 245,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O8fyfQhhCyNorBGE7zPwlqK14iVI0hZ_9jT3lTcJZjQ.jpeg?auto=webp&amp;s=5f3fd218b9b18d45b690dcb0be1ed72e363bab18"
        },
        "permalink": "/r/movies/comments/1ntv30m/serenity_at_20_alan_tudyk_revisits_his_shocking/"
    },
    {
        "id": "1nthdxy",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'John Candy: I Like Me'",
        "content": "",
        "upvotes": 5120,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2l888hjlq3sf1.jpeg?auto=webp&amp;s=bcb8355d84e5cfebb3e4a05c519675a58f58e01d"
        },
        "permalink": "/r/movies/comments/1nthdxy/official_poster_for_john_candy_i_like_me/"
    },
    {
        "id": "1ntlxje",
        "author": "MarvelsGrantMan136",
        "title": "'The Naked Gun' Sets Paramount+ Release Date - September 30",
        "content": "",
        "upvotes": 2165,
        "comments": 159,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iQL5r6N7hcIzdxzNo1SSo1c2I_dqUAGvSLXL3JkSqtY.jpeg?auto=webp&amp;s=b544a6b719063d40c53c2d4768ad526a366509f7"
        },
        "permalink": "/r/movies/comments/1ntlxje/the_naked_gun_sets_paramount_release_date/"
    },
    {
        "id": "1ntlr51",
        "author": "ChiefLeef22",
        "title": "'Interstellar' (2014) | \"Messages Span: 23 Years\" | Directed By Christopher Nolan",
        "content": "",
        "upvotes": 2161,
        "comments": 281,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/td69lqofl4sf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ntlr51/interstellar_2014_messages_span_23_years_directed/"
    },
    {
        "id": "1ntc9qf",
        "author": "ChiefLeef22",
        "title": "Denis Villeneuve's 'Sicario' Turns 10: Taylor Sheridan's Screenwriting Debut Is A Lesson 101 On How To Use Tension",
        "content": "",
        "upvotes": 5158,
        "comments": 436,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YV-k_BTdjksU41TOVwJ9Ligz1UxDZwyL1d42V2Ky1Wo.jpeg?auto=webp&amp;s=2a0b6732caa77d513e7b707e6e31ac8231b1dc5b"
        },
        "permalink": "/r/movies/comments/1ntc9qf/denis_villeneuves_sicario_turns_10_taylor/"
    },
    {
        "id": "1nthh99",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Zootopia 2'",
        "content": "",
        "upvotes": 884,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6a17h8s9r3sf1.jpeg?auto=webp&amp;s=5ef763e8844c606d76574c9f5a78077d3fc67e10"
        },
        "permalink": "/r/movies/comments/1nthh99/new_poster_for_zootopia_2/"
    },
    {
        "id": "1ntnur2",
        "author": "fullmoon_123",
        "title": "What's the worst movie you've seen in a while?",
        "content": "I can't believe I actually have something to add to this because I usually find something good to say about any movie that I choose to watch but holy shit my dad put on **Unsung Hero** the other day. Very misleading synopsis, that talked about faith but we assumed it meant faith in a more general, spiritual sense of endurance and perserverance, not actual religious faith, and we had imdb giving it a 7.0 so we gave it a go. We're not americans so we had no idea about the people the film was actually about. \n\nJust basically a movie about filthy rich, extremely religious white (australian) people that get some (~~debatably minor~~) setbacks in life but they endure with the help of their equally filthy rich, extremely religious white (southern american) friends. I get that they go from million dollar home to a middle class house with no furniture and they all have to chip in and help out with paying the bills and groceries but that's literally most of the lives of people I know lol. And then everything gets better because they are religious and have religious friends helping them out, giving them a car, giving them gifts for christmas, paying their hospital bills, etc and eventually getting the daughter a label deal basically. Oh and the absolute corniness of it all didn't help one bit. \n\nI don't know, I feel like a very specific group of people would enjoy this movie (~~christian southern americans~~) and that's completely fine if you do like it. But I don't see anyone else enjoying this movie.",
        "upvotes": 357,
        "comments": 1275,
        "media": null,
        "permalink": "/r/movies/comments/1ntnur2/whats_the_worst_movie_youve_seen_in_a_while/"
    },
    {
        "id": "1ntlydq",
        "author": "KillerCroc1234567",
        "title": "SHELBY OAKS - Official Trailer #2 - In Theaters October 24",
        "content": "",
        "upvotes": 399,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cwt9GwMJIFYG_6goT5ggNoQgdIMqBt3BKbQvaar7TAU.jpeg?auto=webp&amp;s=d8d318f6791fa89b8fe5fc506d0044798698e292"
        },
        "permalink": "/r/movies/comments/1ntlydq/shelby_oaks_official_trailer_2_in_theaters/"
    },
    {
        "id": "1ntq5pw",
        "author": "Task_Force-191",
        "title": "Marion Cotillard’s Closet Picks",
        "content": "",
        "upvotes": 215,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hde0StnrSMowaBF2cY68DjVv7lMmCa3qGMNYAAjYDJQ.jpeg?auto=webp&amp;s=78538c7398ed9df1a4f2b9b91f3bf2eaba209db8"
        },
        "permalink": "/r/movies/comments/1ntq5pw/marion_cotillards_closet_picks/"
    },
    {
        "id": "1ntwx8v",
        "author": "Bullingdon1973",
        "title": "Jim Jarmusch credits his 'Broken Flowers' star Bill Murray with helping him take care of his mom in her final years.",
        "content": "\"I was treated very well very early on by the French producer and distributor for my film *Down by Law*. And I made a little bit of money there. *Broken Flowers* was very helpful to me because Bill Murray and I had backend in the film, and the film did make some money. Whenever Bill would get paid, he would say, 'Well, did you pay Jim?' And they’d go, 'Oh? Oh, yeah, we’ll get right on it.' Bill really protected me, and I got paid enough to keep my mother in her own home her last years in Ohio, which was incredibly important to me and very expensive. And I got some other things taken care of for the people close to me. I must say Bill had a lot to do with that.\"",
        "upvotes": 77,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4SFPlq2dcJmhv-x_Frl64dTf4akUJEPW1qdWkJ2Q7f0.jpeg?auto=webp&amp;s=b9b00d552534c7e78aed884cf1b9f95f1af5ea2c"
        },
        "permalink": "/r/movies/comments/1ntwx8v/jim_jarmusch_credits_his_broken_flowers_star_bill/"
    },
    {
        "id": "1ntl5cy",
        "author": "NoCulture3505",
        "title": "‘Together’ Director Michael Shanks Sets Next Film ‘Hotel Hotel Hotel Hotel’ At A24",
        "content": "",
        "upvotes": 275,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xUfevLejcDtl2FzBtd86V1w1Wvu5bnGeHliIWuFkgAQ.jpeg?auto=webp&amp;s=036f5728705f9d47c0403a2dffc23ecc20e1cfdc"
        },
        "permalink": "/r/movies/comments/1ntl5cy/together_director_michael_shanks_sets_next_film/"
    },
    {
        "id": "1nthe3n",
        "author": "Comic_Book_Reader",
        "title": "Zootopia 2 | Final Trailer",
        "content": "&gt;Zootopia will be changed furrrever...\nGet ready for #Zootopia2​, only in theaters November 26!\n\n&gt;In Walt Disney Animation Studios’ “Zootopia 2,” detectives Judy Hopps (voiced by Ginnifer Goodwin) and Nick Wilde (voiced by Jason Bateman) find themselves on the twisting trail of a mysterious reptile who arrives in Zootopia and turns the mammal metropolis upside down. To crack the case, Judy and Nick must go undercover to unexpected new parts of town, where their growing partnership is tested like never before. Oscar® winners Jared Bush (co-director/co-writer “Zootopia,” director/co-writer “Encanto”) and Byron Howard (director “Zootopia,” director “Encanto”) are directing; Bush is writing the script; Yvett Merino (Oscar-winning producer “Encanto”) produces. “Zootopia 2” hits theaters in Nov. 26, 2025.",
        "upvotes": 415,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/faYA7PdqKWb_q6MGYXAbVg2-1TPYC2ck5875c_2H2dI.jpeg?auto=webp&amp;s=3f8295a265f1a1782e915da2ccb4963744704d0c"
        },
        "permalink": "/r/movies/comments/1nthe3n/zootopia_2_final_trailer/"
    },
    {
        "id": "1ntbvbh",
        "author": "RJKaste",
        "title": "The Warriors (1979) The intro that sparked mayhem in theaters",
        "content": "Back in 1979, when The Warriors hit theaters, it caused such a stir that some theaters actually pulled it after reports of fights and gang violence breaking out. I was 13 when it came out, and I still remember the buzz around how dangerous it was supposed to be. Here’s the intro that set the tone for all that mayhem.",
        "upvotes": 864,
        "comments": 172,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Lg2FqbMSH3DrXaUDyDqYFDkzsZSjh1bWEbcBKu5DPg.jpeg?auto=webp&amp;s=83e6c7e427f1484933a2dec4d07359694dbb36fd"
        },
        "permalink": "/r/movies/comments/1ntbvbh/the_warriors_1979_the_intro_that_sparked_mayhem/"
    },
    {
        "id": "1ntg2qc",
        "author": "KillerCroc1234567",
        "title": "Jay Kelly | Official Trailer | Netflix",
        "content": "",
        "upvotes": 377,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7aE_K0r6LVg9qrP-dL5cTmzt0f2SevtglaQIBfLNUXM.jpeg?auto=webp&amp;s=ce0fbd5bd9502e0b53af09bbf2facfba7ef13553"
        },
        "permalink": "/r/movies/comments/1ntg2qc/jay_kelly_official_trailer_netflix/"
    },
    {
        "id": "1ntgjlx",
        "author": "BunyipPouch",
        "title": "New Poster for Netflix's 'Jay Kelly' - Starring George Clooney, Adam Sandler, Laura Dern, Billy Crudup, Patrick Wilson, Greta Gerwig, Riley Keough, and Eve Hewson - Directed by Noah Baumbach ('Marriage Story')",
        "content": "",
        "upvotes": 330,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k2j3c6wkj3sf1.jpeg?auto=webp&amp;s=e2e4faa09558f19f4eac5d279c323bd330253b74"
        },
        "permalink": "/r/movies/comments/1ntgjlx/new_poster_for_netflixs_jay_kelly_starring_george/"
    },
    {
        "id": "1nsxa82",
        "author": "BunyipPouch",
        "title": "Tim Heidecker and Eric Wareheim, the comedy duo behind Adult Swim’s 'Tim and Eric', are writing a horror film script together. They described it as \"much sicker\" than what most people are going to want to watch.",
        "content": "",
        "upvotes": 5560,
        "comments": 416,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vKwpZw6sLiervPC9ajQO-g33IKn5MvY5ER-RD1QYp1g.jpeg?auto=webp&amp;s=f3d3343d6aad4ea5bc264a03b14b1cb1f48cbee7"
        },
        "permalink": "/r/movies/comments/1nsxa82/tim_heidecker_and_eric_wareheim_the_comedy_duo/"
    },
    {
        "id": "1ntnywy",
        "author": "Draftysperm2",
        "title": "What’s a movie everyone seems to love that you just don’t get?",
        "content": "For me it’s The Great Gatsby. I know it’s considered this big cultural classic and people rave about the DiCaprio adaptation but honestly? It just didn’t land with me. The characters felt shallow the story never really grabbed me and by the halfway point I caught myself zoning out.\n\nIt always amazes me how some films end up being universally praised as masterpieces while for others they just don’t click at all.\n\nWhat’s that one movie for you like the “beloved classic” that left you scratching your head?",
        "upvotes": 72,
        "comments": 498,
        "media": null,
        "permalink": "/r/movies/comments/1ntnywy/whats_a_movie_everyone_seems_to_love_that_you/"
    },
    {
        "id": "1nszv2m",
        "author": "EuphoricButterflyy",
        "title": "‘American Psycho’ (2000)- Patrick Bateman kills Paul Allen scene. Featuring Christian Bale and Jared Leto- Directed by Mary Harron",
        "content": "",
        "upvotes": 2312,
        "comments": 196,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o3x4d79p1zrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nszv2m/american_psycho_2000_patrick_bateman_kills_paul/"
    },
    {
        "id": "1nttvpn",
        "author": "SteamerTheBeemer",
        "title": "Can anyone recommend a good interesting/surprising documentary?",
        "content": "Helloooo,\n\nCan anyone recommend me any good documentary’s. It can be on any subject matter. Just something that’s gonna hook me in.. please if possible just give a very brief idea of what it’s about (I like surprises though so feel free to be vague is it something like…unexpected).\n\nThanks in advance! :) .",
        "upvotes": 24,
        "comments": 195,
        "media": null,
        "permalink": "/r/movies/comments/1nttvpn/can_anyone_recommend_a_good_interestingsurprising/"
    },
    {
        "id": "1ntsa0q",
        "author": "justletgo7",
        "title": "I've been wanting to write this review for about a year, but I never had the energy for it. \" Our parents are not just our parents \".. Aftersun",
        "content": "\n\nThe Film's Story:\n\nThe film tells the story of Sophie, a woman reflecting on a holiday she spent in Turkey with her young father, Calum, twenty years ago. At the time, she was unaware of his struggle with depression. The journey reveals his inner sadness and conflicts, which she only came to understand as an adult. The film explores Sophie's memories, a blend of truth and imagination, as she tries to understand the father who was an enigma to her and reconcile with his past to better know herself.\n\n**My First Viewing:**\n\nI first saw this film before I left my family and moved away due to circumstances in my life, around the end of 2022, just after it premiered at festivals and on streaming platforms. Back then, I didn't find it particularly special. I watched it online, gave it three stars, and that was that.\n\n**My Second Viewing &amp; Personal Reflection:**\n\nLater, when I started living alone, I began to rethink my relationship with my parents. I started seeing them as human beings separate from me—not just as \"Mom and Dad,\" but as people who were living life for the first time, just like me. They had their own stories, lives, and experiences that shaped them long before I existed. This perspective made me overlook some of the problems from my childhood. I even realized that when we texted on the phone, we expressed our feelings more freely because of the distance, unlike when I lived with them.\n\nThis reminded me of a saying: \"Our parents haven't lived seven thousand years; this is their first time living life, just like us.\" It's possible they faced situations they didn't know how to handle and made mistakes with us. All of this thinking brought me back to *Aftersun*, and I found myself deeply relating to it this time.\n\nMy second viewing was in a cinema. Even though I had already seen it, I felt a need to watch it surrounded by people. The theater was packed because the film had gained fame for impressing the critics.\n\n**Understanding the Film's Core:**\n\nAnd then I truly grasped the film's story: Sophie, whose father committed suicide after their last vacation together. She was angry at him for it. As a child, she didn't understand the reasons; to her, he was just normal. She thought his yoga was just \"weird moves.\" There was a distance between them, visually represented by the camera in some scenes. She couldn't remember everything perfectly, so she had to fill those gaps in her memory, aided by the camcorder footage from their holiday.\n\n**What I Loved About the Film:**\n\nWhat I appreciated most was that the film never directly stated the reason for Calum's suicide. Instead, we discover it alongside Sophie. We see scenes of him crying, hints of his financial struggles, his separation from his wife, and his own suffering with his father during his childhood. This background made him strive to provide everything he could for Sophie, despite his poverty, so she wouldn't feel the lack he felt as a child—something Sophie herself notices and mentions to him in one poignant scene. The scene where he breaks down after Sophie celebrates his birthday, which clearly triggered childhood trauma, was especially powerful.\n\nThe film speaks to the gap between children and parents. A child sees a parent as someone who is supposed to provide for them, often failing to see them as a human being with a full life, burdens, and a personality that was formed long before they became a parent. Sophie tries to see Calum as the person she didn't understand when she was young, the person she was angry at for leaving her. She re-evaluates him through the lens of her own adulthood and experience as a mother.\n\n\nThe film ended, and I spontaneously started clapping. Soon, the entire theater joined me.\n10/10.",
        "upvotes": 29,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1ntsa0q/ive_been_wanting_to_write_this_review_for_about_a/"
    },
    {
        "id": "1ntae43",
        "author": "ChiefLeef22",
        "title": "Gore Verbinski's 'Good Luck, Have Fun, Don't Die' - Review Thread",
        "content": "*A man claiming to be from the future takes the patrons of an iconic Los Angeles diner hostage in search of unlikely recruits in a quest to save the world.*\n\nCast: Sam Rockwell, Haley Lu Richardson, Michael Pena, Zazie Beets\n\n**Rotten Tomatoes:** [100% (5 reviews)](https://www.rottentomatoes.com/m/good_luck_have_fun_dont_die)\n\n**Metacritic:** N/A (updating)\n\nSome Reviews:\n\n[SlashFilm - Rafael Motamayor](https://www.slashfilm.com/1979287/good-luck-have-fun-dont-die-review/) \\- 8 / 10\n\n&gt;What follows is a truly bonkers, balls-to-the-wall, hilarious sci-fi adventure that starts out as \"Repo Man\" and ends up going full \"Akira.\" It's bold, it's got a great cast, it's one of the timeliest genre movies in years. It is great to have Gore Verbinski back.\n\n[IGN - Matt Donato](https://www.ign.com/articles/good-luck-have-fun-dont-die-review-sam-rockwell-haley-lu-richardson) \\- 8 / 10\n\n&gt;At its best, Good Luck, Have Fun, Don't Die is a laugh-filled yet incredibly dark and poignant fever dream that pleads for a safer AI tomorrow. Verbinski's command over utter chaos is nothing short of marvelous, even if the pacing slows while jumping between storylines that eventually all fit together. There's a hopefulness that tries to prevent the film from feeling fatalistic, like there's nothing we can do about AI at its most harmful. But it's also quite entertaining, as Rockwell leads his ragtag squad into escalating unknowns that he actually knows after so many failed missions. As offbeat and dreamlike as Good Luck, Have Fun, Don't Die becomes, ballooning in scale as time ticks down, its timeliness and prescience are still its most impressive factors. A film this wacky shouldn't be this straightforward, and yet here we are, cleaning the glitter off our bodies; you'll understand soon enough.\n\n[Fandom Wire - Sean Boelman](https://fandomwire.com/good-luck-have-fun-dont-die-fantastic-fest-review/)\n\n&gt;Ultimately, much of the film rides on the back of Sam Rockwell, who is giving one of the most unhinged, fun performances of his career. In the years since his Oscar win for *Three Billboards*, he’s been taking on more “serious” work, and while he’s great at that too, it’s nice to see him return to his zanier *Confessions of a Dangerous Mind* and Justin Hammer side. He is incredibly charming and thrives in this comedic space, and his lead performance makes the over-two-hour runtime ",
        "upvotes": 336,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wcPmKDdIJx9RkWVSdRQ0gftUayITV9e-5XU116OdRek.gif?format=png8&amp;s=de034f3cd2777eb1802523ba41f9ea4571e64fd1"
        },
        "permalink": "/r/movies/comments/1ntae43/gore_verbinskis_good_luck_have_fun_dont_die/"
    },
    {
        "id": "1nsy3rh",
        "author": "Queasy-Secret-4287",
        "title": "Trailer for 'The American Revolution' by Ken Burns, on PBS and the PBS app in November",
        "content": "",
        "upvotes": 1871,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wkaSh2HB94gW8XgQC3uDLjMtNvoKt0Xp19xEadM9Efk.jpeg?auto=webp&amp;s=958f842ba7d4f90ea6ab2f14423b22a5f411f8a0"
        },
        "permalink": "/r/movies/comments/1nsy3rh/trailer_for_the_american_revolution_by_ken_burns/"
    },
    {
        "id": "1nticiy",
        "author": "AdSpecialist6598",
        "title": "Warner Bros. Begins Production on Korean Remake of The Intern",
        "content": "",
        "upvotes": 58,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bYeb5ldJfq961S2bo4mqGmUnhgFmL3SirFCKdJzph6U.jpeg?auto=webp&amp;s=33c979e68ee75741d1013735c5541a14094a7453"
        },
        "permalink": "/r/movies/comments/1nticiy/warner_bros_begins_production_on_korean_remake_of/"
    },
    {
        "id": "1nt4fpp",
        "author": "BunyipPouch",
        "title": "First Poster for Found-Footage Horror 'Dream Eater' - The movie follows a documentary filmmaker who films her boyfriend's increasingly violent parasomnia at a remote cabin, only to uncover a deeper, sinister mystery involving trauma and the occult.",
        "content": "",
        "upvotes": 610,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k0ny55zf20sf1.jpeg?auto=webp&amp;s=b3466ec9bc461b430f9f40b2a453a94b273894a5"
        },
        "permalink": "/r/movies/comments/1nt4fpp/first_poster_for_foundfootage_horror_dream_eater/"
    },
    {
        "id": "1nttjgm",
        "author": "igavr",
        "title": "Busan 2025 Review: BUGONIA, Vivid and Deranged Remake of Korean Cult Classic Seeks the Truth",
        "content": "Thriller **Bugonia**, a ravishing concoction of deranged paranoia and inspired aesthetics\n\n\"Teddy believes that pharmaceutical company CEO Michelle Fuller (Stone) is one of those Andromedans.\"",
        "upvotes": 13,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ex707TIFbTxhoGUMarkXlMgtyVneHM0ITMuJ431pY80.jpeg?auto=webp&amp;s=409cdd2fea707eaa548eb4105711cff472de1c17"
        },
        "permalink": "/r/movies/comments/1nttjgm/busan_2025_review_bugonia_vivid_and_deranged/"
    },
    {
        "id": "1ntvpcb",
        "author": "BunyipPouch",
        "title": "Daniel Day-Lewis, Ronan Day-Lewis, and Sean Bean Discuss their New Film 'Anemone' at the World Premiere (New York Film Festival)",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AyzzBrzZRubS0gtpoQtzI9jX0WiK9EvNMRBVtXFYJ_A.jpeg?auto=webp&amp;s=003942bab736aa7840782b4fd739e06e087eec77"
        },
        "permalink": "/r/movies/comments/1ntvpcb/daniel_daylewis_ronan_daylewis_and_sean_bean/"
    },
    {
        "id": "1nt0hyq",
        "author": "MarvelsGrantMan136",
        "title": "Anemone - Review Thread",
        "content": "**Anemone - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/anemone_2025): 61% (31 Reviews)\n* [Metacritc](https://www.metacritic.com/movie/anemone-2025/): 51 (14 Reviews)\n\nReviews:\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/anemone-review-daniel-day-lewis-1236385949/):\n\n&gt;What lingers as the end credits roll is Daniel Day-Lewis’ noble face — full of sorrow, resentment, guilt and shame, emotions that Ray spends much of the early action masking in hardened indifference. Regardless of the film’s shortcomings, it’s a thrill to have this giant of an actor back on a movie screen, hopefully next time with a more satisfyingly fleshed-out screenplay.\n\n[The Guardian](https://www.theguardian.com/film/2025/sep/28/anemone-review-daniel-day-lewis) (2/5):\n\n&gt;The younger Day-Lewis shows promise as a film-maker – Anemone certainly *looks* serious, the correct scowls and swirling skies and wordless, eerie montages to suggest weighty themes, big emotions and ominous suspense. The tools to back up that style with emotional punches that land like the real ones of the brothers – best believe they tussle it out, because of course – are not yet refined, but in this father-son duo, at least, I have faith.\n\n[Variety](https://variety.com/2025/film/reviews/anemone-review-daniel-day-lewis-1236530758/):\n\n&gt;There are flashes of talent in “Anemone.” Ronan Day-Lewis, who has come up in the world as a visual artist, knows how to frame a shot, and he’s canny about playing off the mystique of his father. The whole plot, with Jem entreating Ray to come out of his self-imposed exile, is almost a sly metaphor for how Daniel Day-Lewis would take a sabbatical from acting to become a cobbler or cabinet maker, or for his retirement now. Yet for most of its 125-minute running time, “Anemone” just sits there.\n\n[Deadline](https://deadline.com/2025/09/anemone-review-daniel-day-lewis-ronan-day-lewis-sean-bean-1236557832/):\n\n&gt;*Anemone*, is a film that doesn’t live in or anything’s or anyone’s shadow, even though that’s what the story is essentially about, a plot point made all the more salient by the casting — or perhaps that should be *positioning* — of acting giant Day-Lewis Sr. in his first starring role since *Phantom Thread* (yep, another PTA production). Press-wise, the fervor for this long-anticipated return has already done a lot of heavy lifting, especially for savvy arthouse audiences. But, although he could so easily have rested on his old man’s laurels, Day-Lewis Jr. instead exploits those *expectations* of his father’s power (more of that later), and he does so in a fuss-free way that serves the story surprisingly well, right up until the actor finally coughs up his elusive character’s shocking backstory.\n\n[Indiewire](https://www.indiewire.com/criticism/movies/anemone-review-ronan-day-lewis-1235153177/) (B):\n\n&gt;This is a dense, unforgiving movie in the classic sense, an adults-only drama that doesn’t placate despite its stylistic overreaches. It’s disappointing that in its final moments, the movie has come so far off its own hinges, so deconstructed its own rivets, that it can’t put them back together again. But everything that’s come before is so rich that you’re ready to forgive it. The title, by the way, comes from the flowers that bloomed from Ray’s own father’s planting. Ronan Day-Lewis seems to have plucked and pruned the best lessons from them, too.\n\n\n# \n\nCast:\n\n* Daniel Day-Lewis \n* Sean Bean \n* Samantha Morton \n* Samuel Bottomley \n* Safia Oakley-Green\n\nDirected by Ronan Day-Lewis\n\n",
        "upvotes": 630,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gRsQUrEviyP-sAwF7ontmg7XdeYKaW8FKyFkG9UVqco.jpeg?auto=webp&amp;s=68a900fb5eeb41c9cc565a0f38fcfc1b3b922867"
        },
        "permalink": "/r/movies/comments/1nt0hyq/anemone_review_thread/"
    }
]