[
    {
        "id": "1lumzpk",
        "author": "LarryCharlesAMA",
        "title": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, and DICKS: THE MUSICAL. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM &amp; wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. Ask me anything!",
        "content": "Hi reddit, I'm Larry Charles. You might know me as the director of BORAT, BRUNO, THE DICTATOR, RELIGULOUS, DICKS: THE MUSICAL, MASKED AND ANONYMOUS and ARMY OF ONE. I’ve also directed many of your favorite episodes of CURB YOUR ENTHUSIASM and wrote many of your favorite SEINFELD episodes. My new book, COMEDY SAMURAI, is out now. It chronicles my life and work in the battleground of American comedy. Please, I beg you, ask me anything!\n\n**Here's where you can purchase my book:**\n\n[https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing](https://www.hachettebookgroup.com/titles/larry-charles/comedy-samurai/9781538771549/?lens=grand-central-publishing)\n\nAsk me anything! I'll be back at 3 PM ET today to answer your questions.\n\n**Bio and more information:**\n\nFrom Peabody, Golden Globe, and Emmy Award-winning writer/producer/director Larry Charles, COMEDY SAMURAI: 40 YEARS OF BLOOD, GUTS, AND LAUGHTER is a rollicking journey through modern American comedy, as he shares behind-the-scenes stories from his life\\&amp;#39;s work.\n\nGrand Central will publish Charles’s memoir on June 17, 2025. To tell Larry Charles’s life story is to tell the story of modern American comedy. Over the last 40 years, few comedians have been a part of so many iconic, beloved projects. Larry was one of the original writers and producers on the first five seasons of Seinfeld, executive produced both Curb Your\n\nEnthusiasm and Entourage while directing 18 episodes of Curb and served as the showrunner for Mad About You. His film directing credits include Borat, Bruno, and The Dictator, the comic documentary Religulous (starring Bill Maher), and Masked and Anonymous (which he co-wrote with Bob Dylan who stars).\n\nIn Comedy Samurai, Charles pulls back the curtain on the making of his successful projects, offering sharp, never-before-told anecdotes about Jerry Seinfeld, Sacha Baron Cohen, Bill Maher, Bob Dylan, Nic Cage, Mel Brooks, Julia Louis-Dreyfuss, and Larry David, among many others.\n\nLarry Charles rose from the mean streets of Brooklyn and the working-class housing projects of Donald Trump’s nefarious father Fred, to become the director of Borat, Bruno, The Dictator and Religulous amongst others. He directed Bob Dylan and an all-star cast (Jeff Bridges, John Goodman, Jessica Lange and Penelope Cruz among others) in the film, Masked an Anonymous which he and Dylan wrote together. He has also directed numerous episodes of Curb Your Enthusiasm and was one of the original writers and producers of Seinfeld. Larry is a Peabody, Golden Globe, and Emmy-award winner. Since the Malibu fires, he, and his wife and two dogs are vagabonds.\n\nBack at 3 PM ET to answer your questions!\n\n\n\n",
        "upvotes": 144,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pk0c6pt13nbf1.jpeg?auto=webp&amp;s=c5eb6c3d1705132602f36864169aaf4a15394d77"
        },
        "permalink": "/r/movies/comments/1lumzpk/hi_reddit_im_larry_charles_you_might_know_me_as/"
    },
    {
        "id": "1lu8bkm",
        "author": "SanderSo47",
        "title": "July 4-6 Box Office Recap – 'Jurassic World Rebirth' opens with a fantastic $147.8M domestically and $322.6M worldwide on its first five days. Meanwhile, 'F1' reaches almost $300M worldwide and becomes Apple's biggest film at the box office.",
        "content": "https://preview.redd.it/gaqv8rk75jbf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d006313609133fa978537c52a8d1d185b3009d57\n\nIt was a weekend for fireworks and dinosaurs.\n\n***Jurassic World Rebirth*** opened with a monster $322 million worldwide, showing there's still power in this franchise after 30 years. And while ***F1*** took a rough drop in the domestic market, it's still a hit overseas, as the film is nearing $300 million worldwide and officially became Apple's highest grossing film ever.\n\nThe Top 10 earned a combined $152 million this weekend. That's 0.2% up from last year, when ***Despicable Me 4*** debuted atop.\n\nDebuting at #1, ***Jurassic World Rebirth*** debuted with $92 million in 4,308 theaters. Adding in its numbers from Wednesday and Thurday, the film earned an incredible $147.8 million. This is hard to compare with the previous ***Jurassic World*** films, as all films opened on Friday. So just for reference; ***Fallen Kingdom*** earned $148 million on its first 3 days, and ***Dominion*** made $145 million.\n\nWhat does this debut suggest? What everyone always knew: people love dinosaurs. And that has always been the franchise's biggest advantage. There are no other dino franchises currently, which has allowed Universal to cater to an audience that wants to see these monsters in the big screen. There's a lot of franchises that have experienced fatigue, but the ***Jurassic*** clearly is still beloved 32 years later after its debut in theaters.\n\nThe film had a very rushed production; it was officially announced in January 2024, although a script was written for quite some time. Gareth Edwards was hired one month later, when the current release date was already set. So basically the film was reported, filmed and released in the span of just 18 months. That's very short for a blockbuster. But then again, audiences don't pay much attention to productions. What they care for is if the film looks interesting or catches their interest, and Universal achieved it. They sold it as a \"back to basics\" film, choosing to just abandon all characters from the prior films and focus on new characters, played by Scarlett Johansson, Mahershala Ali, Jonathan Bailey. Turns it out all worked out.\n\nAccording to Universal, 61% of the audience was male. The films are popular with families, although ***Rebirth*** starts to point that it's losing some young audience members. Only 36% of the audience was 25 and under, which is below ***Fallen Kingdom*** (56%) and ***Dominion*** (41%). At the end of the day, that's pretty much imminent when your franchise is 30 years old.\n\nSo yes, everything worked out in the end. Well, almost everything. What did ***Rebirth*** fail at? Reception. Critics were unimpressed with the film, giving it a mediocre 52% on RT. Somehow, that was an improvement over the past two films, but that's still not a good score. Regardless, the debut suggests the audience was still excited to watch the film. But the film's word of mouth indicates that this will play very, very differently, and that's another thing were ***Rebirth*** failed.\n\nAudiences gave ***Jurassic World Rebirth*** a very weak \"B\" on CinemaScore, which is very poor for a blockbuster. That's worse than any of the ***Jurassic World*** films, and it's the second lowest in the franchise, just above ***Jurassic Park III*** (\"B–\"). This is an indication that audiences are not content with the film. It's hard to point to a domestic total prediction given that this is a 5-day debut, but with high competition like ***Superman*** and ***The Fantastic Four: First Steps*** arriving, it's very likely the film will continue the franchise's decline at the box office. Definitely a success, but it's gonna put a lot of pressure on the next film.\n\nLast week's champ ***F1*** added $25.7 million this weekend. That's a rough 55% drop from last week, but when you have a juggernaut like ***Jurassic World***, a drop like that is pretty much imminent. Through 10 days, the film has amassed $109.2 million domestically, the first Apple title to hit that milestone. There's still heavy competition on its way, but ***F1*** should still have enough gas left to hit $160 million domestically.\n\nIn third place, ***How to Train Your Dragon*** dipped 43%, adding $11.2 million this weekend. That took its domestic total to $224.2 million, finally becoming the franchise's biggest film in the domestic market.\n\nThere doesn't appear to be any signs of life in Disney/Pixar's ***Elio***. It dropped 45% and made just $5.7 million. That drop is barely better than last week, indicating word of mouth isn't really doing anything to save the film. The film has made an abysmal $55 million so far, and it's going to struggle to hit $65 million at this rate.\n\n***28 Years Later*** remained at #5, although it still dropped 53% and added $4.5 million this weekend. At least that's better than last week's steep 67% drop, but it's still rough. The film has already earned $60.2 million, and it should finish with around $67 million domestically.\n\n***M3GAN 2.0*** continued disappointing on its second weekend. The film collapsed a poor 61%, earning just $3.9 million this weekend. That's far worse than the original's second weekend drop (a very light 39.8%). The sequel has earned a very poor $18.7 million, which is a colossal 68% behind the original through the same point. With more competition on its way, it's highly likely the film will finish with less than $25 million domestically.\n\n***Lilo &amp; Stitch*** dropped 45% and earned $3.8 million. The film has amassed $408.5 million so far.\n\nIn eighth place, ***Mission: Impossible – The Final Reckoning*** eased just 34% and added $2.7 million this weekend. The film's domestic total stands at $191.1 million, and it will soon pass ***Rogue Nation*** ($195 million) to become the fourth biggest film in the franchise.\n\n***Materialists*** had another rough drop this weekend. This time, it dropped 55% and added $1.3 million. That took its total to $33.5 million.\n\nRounding out the Top 10 was the 41st anniversary re-release of ***This Is Spinal Tap***. It earned $1 million from 1,015 theaters, taking its lifetime gross to $5.7 million. Man, it should've made $1.1 million, come on.\n\n#**OVERSEAS**\n\n***Jurassic World Rebirth*** debuted with $174 million overseas, for a monster $322.6 million worldwide debut. China was its biggest debut with $41.5 million, which is the biggest for a Hollywood title this year. However, it should be noted that the film was quite front-loaded in the market amidst poor word of mouth. Other strong debuts were seen in the UK ($16.6M), Mexico ($13.9M), Germany ($7.6M), South Korea ($7.4M), Spain ($6.5M), Australia ($5.9M), India ($5.5M/best of franchise), France ($5.3M) and Italy ($4.7M).\n\nAll the ***Jurassic World*** films have cracked $1 billion, but don't expect the same to happen to ***Rebirth***. Not only was it lower than ***Dominion*** $392 million worldwide debut, but most of these debuts were all from 5-day debuts, which is boosting its numbers. For now, a $800 million worldwide total is likely. Another success in the franchise, but it will continue marking another decline.\n\n***F1*** was impacted domestically, but it continues killing it overseas. Despite the arrival of ***Rebirth***, the film dipped just 38% and added $56.3 million overseas, taking its worldwide total to $293 million. It's already Apple's biggest film worldwide. In China, the film had an insane 2% second weekend drop, which is the best for a Hollywood title this year, and now the film is set to massively over-perform in the market. The best markets are China ($22M), the UK ($17.3M), Mexico ($12.3M), France ($11.5M) and Australia ($9.8M). Assuming it keeps holding very well, the film should definitely pass $450 million worldwide.\n\n***How to Train Your Dragon*** added $21 million overseas, taking its worldwide total to $519 million. The best markets are China ($35.5M), Mexico ($33.4M), the UK ($24.6M), Brazil ($17.2M) and France ($14.2M). It has already passed the original film's worldwide gross, and by tomorrow it will pass ***The Hidden World*** ($520 million).\n\n***28 Years Later*** added $7 million overseas, allowing it to cross $125 million worldwide. The UK has been its biggest market, unsurprisingly, earning $17 million so far. The film should finish with around $140 million worldwide.\n\nContinuing its absolutely pathetic run in pretty much every territory, Disney/Pixar's ***Elio*** made $6.7 overseas, taking its worldwide total to just $97.7 million worldwide. The best markets are France ($4.7M), the UK ($4.1M), South Korea ($3.6M), China ($3.5M) and Mexico ($2.8M). 3 weeks in and a Pixar title still hasn't cracked $100 million worldwide. What a time to be alive.\n\n***Lilo &amp; Stitch*** added $6.1 overseas, taking its worldwide total to $972 million. That allowed it to finally pass ***A Minecraft Movie*** as the year's second highest grossing film, just behind ***Ne Zha 2***. The best markets are Mexico ($66.5M), the UK ($48.3M), France ($40.5M), Brazil ($36.5M) and Germany ($30.8M).\n\nWith $3.9 million overseas, ***Mission: Impossible – The Final Reckoning*** has officially passed ***Dead Reckoning*** worldwide with a $576.1 million total, becoming the fourth biggest film in the franchise.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*A Minecraft Movie* | Apr/4 | Warner Bros. | $162,753,003 | $423,949,195 | $954,928,702 | $150M\n\n- *A Minecraft Movie* has closed its run with a fantastic $954 million worldwide. Considering the insanely negative response to its first teaser, it's still a sign of the brand's strength that it could make almost $1 billion. Of course, the film's legs were very mediocre (2.60x is not great at all for family films, given those easily pass 3x), which is a sign that they weren't fully satisfied by the film itself. Whenever the sequel comes up, they must deliver something better than this, quality-wise.\n\n#**THIS WEEKEND**\n\nA new era of DC begins this weekend.\n\nThat's because it's the arrival of DC's ***Superman***, the first film in the new DC Universe (DCU). Written and directed by James Gunn, it stars David Corensweet as the Man of Steel, and it follows Superman's journey to reconcile his alien heritage with his adoptive human family. To say that expectations are high for this film is selling it short. As previously mentioned, this is gonna kick off a new DC Universe, after the DCEU had the insane distinction of having 8 box office flops in a row. And that's not even including the absolute misfire of ***Joker: Folie à Deux***. Needless to say, the brand is at an all-time low and ***Superman*** will need to win over people. With a high $225 million budget and an extensive marketing campaign, this film really needs to be a home run for the sake of DC.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 409,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u5G-BUhw-Vcgp9aUmeWslLrW3Rgsz6McvdI0CNWIsao.png?auto=webp&amp;s=9a469a3b2d530dd36c12c0fef3bbb468132a12c1"
        },
        "permalink": "/r/movies/comments/1lu8bkm/july_46_box_office_recap_jurassic_world_rebirth/"
    },
    {
        "id": "1lut620",
        "author": "MarvelsGrantMan136",
        "title": "Denis Villeneuve’s ‘Dune 3’ Gets Official Title 'Dune: Part Three', Will Be Shot With Imax Cameras",
        "content": "",
        "upvotes": 1804,
        "comments": 350,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AIDadH49N1ZgX5rCrWnVJ--85poerbVbQtG43LY0_No.jpeg?auto=webp&amp;s=12132d558addd68a18682a884e7e49c2ddd04d5e"
        },
        "permalink": "/r/movies/comments/1lut620/denis_villeneuves_dune_3_gets_official_title_dune/"
    },
    {
        "id": "1lupdrg",
        "author": "MarvelsGrantMan136",
        "title": "Fandango Raises $1.3 Million to Send Members of Boys &amp; Girls Clubs of America to Movies",
        "content": "",
        "upvotes": 825,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0TYK_Jm5FOAm7h1QpK1tOA7YNzVD1MGOvBtWqCcty8A.jpeg?auto=webp&amp;s=4f1c6ac63360112a9809fd17da39e730e837c065"
        },
        "permalink": "/r/movies/comments/1lupdrg/fandango_raises_13_million_to_send_members_of/"
    },
    {
        "id": "1luseg9",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Osgood Perkins' 'Keeper'",
        "content": "",
        "upvotes": 343,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ou0phvo1bobf1.jpeg?auto=webp&amp;s=92b0aa818f379b733781fb17572cd27ec3b7a2cf"
        },
        "permalink": "/r/movies/comments/1luseg9/official_poster_for_osgood_perkins_keeper/"
    },
    {
        "id": "1luspim",
        "author": "TiredWithCoffeePot",
        "title": "Official Poster for ‘THE SPONGEBOB MOVIE: SEARCH FOR SQUAREPANTS’",
        "content": "",
        "upvotes": 105,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ox8a5q46dobf1.jpeg?auto=webp&amp;s=b478e07ca79776858f301a80c8e92abd24a20fa0"
        },
        "permalink": "/r/movies/comments/1luspim/official_poster_for_the_spongebob_movie_search/"
    },
    {
        "id": "1luj3qw",
        "author": "Agile-Tie-7433",
        "title": "Which actors do you only ever see as themselves, and which completely disappear into their roles?",
        "content": "Had a chat with my fam about this the other night while watching a film. For whatever reason, with some actors, no matter what film I’m watching with them in it, I don’t see the character, I just see the actor.\n\n\nSometimes it’s because they basically play themselves every time, or they’re typecast into the same type of role over and over. Other times it’s just their massive star power overshadowing the entire film.\n\n\nFor example, Marilyn Monroe - one of the earliest examples of this. Hell yeah, she was a great actress, but in every film, all I see is Marilyn. I can never even remember her characters’ names because it’s just her.\n\n\nPerfect example: Dwayne “The Rock” Johnson...he’s been playing himself since the mid-2000s. imo Jack Black too. Jeff Goldblum feels like he’s parodying himself these days. And as much as I love Bruce Willis (😢) after Die Hard, 90% of his roles felt like slight variations of a cavalier John McClane. Pacino too - after Scent of a Woman, all I see is Pacino being Pacino. Watching Tom Cruise in a movie these days feels like Tom Cruise doing cool Tom Cruise things, and as hilarious as I find Ryan Reynolds, Deadpool is basically Van Wilder in a suit. I don't mean to bash on any of them at all, I've enjoyed every single one, i just thought it interesting to point out. \n\n\nBut then you've got absolute superstars like DiCaprio, one of the most recognizable faces on the planet, yet when I watch his movies, I don’t see Leo, I see his characters. Same with guys like Daniel Day-Lewis, Gary Oldman, and Christian Bale, who completely vanish into whoever they’re playing.\n\n\nFunny enough, Johnny Depp used to be on that list for me. the king of vanishing into a role. But now, even though he looks nothing like himself under all that makeup, i'm still sitting there in the theatre like: “yep, that’s Johnny Depp doing his thing.”\n\n\nNicolas Cage is the wildcard. Sometimes I can’t get past that it’s just Nic Cage being Nic Cage, other times his performance is so phenomenal I completely forget it’s him...or maybe because it’s actually John Travolta, playing Nic Cage, playing John Travolta…\n\n\nWhat about you guys? Which actors can you never unsee, and which ones completely vanish into their characters for you?",
        "upvotes": 202,
        "comments": 361,
        "media": null,
        "permalink": "/r/movies/comments/1luj3qw/which_actors_do_you_only_ever_see_as_themselves/"
    },
    {
        "id": "1ltxdtg",
        "author": "ChiefLeef22",
        "title": "Lily Gladstone has been cast in the new ‘Thomas Crown Affair’ movie, directed by &amp; starring Michael B. Jordan | The film follows a rich playboy who enjoys stealing art for a hobby but meets his match in an insurance investigator who quickly fall for each other.",
        "content": "",
        "upvotes": 4622,
        "comments": 512,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zReRIP-JO9Dv8J1xK2YzOlRy1sc7CAYNfx8BGwk5B2s.jpeg?auto=webp&amp;s=1d6147eeede7cf325f4e4713ad98838f639cff3a"
        },
        "permalink": "/r/movies/comments/1ltxdtg/lily_gladstone_has_been_cast_in_the_new_thomas/"
    },
    {
        "id": "1lukpah",
        "author": "SubstantialLion7926",
        "title": "2001: A Space Odyssey is the most cinematic movie I've ever seen",
        "content": "I'm 26 and this was just... wow. I saw this yesterday and I am thoroughly impressed with the cinematography and haven't gotten it out of my head. I'm still thinking about the last 20 minutes when Dave gets to the monolith at Jupiter. \n\nI have no idea how they were able to make this movie. I honestly can't even say the movie is dated. It's certainly a product of it's time, but there didn't seem to be anything in it that screams out \"THIS IS OLD!\" other than the ape costumes, but even then it still looks good. I'm not going to pretend like I understood everything that happened in the movie, but damn was it good.",
        "upvotes": 140,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1lukpah/2001_a_space_odyssey_is_the_most_cinematic_movie/"
    },
    {
        "id": "1lushol",
        "author": "Siir_Gamer",
        "title": "Whats one movie you have no shame in saying you cried to.",
        "content": "Mine has to be \"Million Dollar Baby\". The ending was just so so so heartbreaking and just the character interactions and development and relationships just got me. Its in my top 5 list of my favorite movies without a doubt. Everything about it is great and it needs to be more well-known and recognized.",
        "upvotes": 44,
        "comments": 175,
        "media": null,
        "permalink": "/r/movies/comments/1lushol/whats_one_movie_you_have_no_shame_in_saying_you/"
    },
    {
        "id": "1lu0adr",
        "author": "cmaia1503",
        "title": "Cosmo Jarvis Pulls Out Of Christopher Nolan’s ‘The Odyssey’; ‘Shogūn’ Star Replaced By Logan Marshall-Green",
        "content": "",
        "upvotes": 2301,
        "comments": 340,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EZURG3Of8vnLBKw_AGqF3np-VbkY3Wa7uIABLt5IVwo.jpeg?auto=webp&amp;s=ef3cb932589ba66e0baa60e2c6fad3845c4c84bc"
        },
        "permalink": "/r/movies/comments/1lu0adr/cosmo_jarvis_pulls_out_of_christopher_nolans_the/"
    },
    {
        "id": "1ltzkt7",
        "author": "MarvelsGrantMan136",
        "title": "AMC Theatres to Offer 50% Off Tickets on Tuesdays and Wednesdays (Starts July 8)",
        "content": "",
        "upvotes": 2350,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P-A2BTzRsG-dl-sYNAZFE0wZkJuSud-0ONUdLBeI1BU.jpeg?auto=webp&amp;s=1afe1fb62304bc916e44d65afecc675badd7b9d8"
        },
        "permalink": "/r/movies/comments/1ltzkt7/amc_theatres_to_offer_50_off_tickets_on_tuesdays/"
    },
    {
        "id": "1ludfsq",
        "author": "Chinesefireball69",
        "title": "This is Spinal Tap is one of the greatest movies ever created.",
        "content": "If you can go see it in theaters for the 41st anniversary you absolutely should. It was life-changing. So funny, but similarly, so human in its comedy. It didn’t over rely on vulgarness, but felt genuine in its comedy. Its one liners were great and the movie had so much soul. I laughed and laughed and honestly can’t wait to watch it again. Almost a shame it’s not as wildly available on many streaming services. ",
        "upvotes": 296,
        "comments": 142,
        "media": null,
        "permalink": "/r/movies/comments/1ludfsq/this_is_spinal_tap_is_one_of_the_greatest_movies/"
    },
    {
        "id": "1luoz5j",
        "author": "artpayne",
        "title": "What are some of the best examples where an unstoppable force meets an immovable object?",
        "content": "Neil McCauley vs. Vincent Hanna in *Heat* is, like, my favorite example of this.\n\n*\"I tell you, if it's between you and some poor bastard whose wife you're gonna turn into a widow, brother, you are going down.\"*\n\n*\"There is a flip side to that coin. What if you do got me boxed in and I gotta put you down? Cause no matter what, you will not get in my way.\"*",
        "upvotes": 35,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1luoz5j/what_are_some_of_the_best_examples_where_an/"
    },
    {
        "id": "1ltlh9d",
        "author": "DemiFiendRSA",
        "title": "Scarlett Johansson Becomes Hollywood’s Highest Grossing Lead Actor With ‘Jurassic World Rebirth’",
        "content": "",
        "upvotes": 12125,
        "comments": 1191,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5LsF-9mqXB03YDesSKAqkowzaFLSsqAZfJie8Qv95W0.jpeg?auto=webp&amp;s=52fec97e3600bc0c8bae61f4c25ecb5fd82d18c5"
        },
        "permalink": "/r/movies/comments/1ltlh9d/scarlett_johansson_becomes_hollywoods_highest/"
    },
    {
        "id": "1lut84e",
        "author": "PokemonGoBao",
        "title": "Whats a movie whether successful or not that changing its title would attract more people to it?",
        "content": "Take, for example, the Harley Quinn birds of prey movie. They changed it because the words Harley Quinn wasn't spelled outright in front of them. What movie title do you think if they changed the name, it would have attracted even more people? \n\nAs I previously posted, a glorious movie I've seen recently was Dungeons and Dragons Honor Among Thieves. But man, is this movie hard to pitch to some people who see dungeons and dragons in the title and nope out. Yet they adore Princess Bride and Monty Python...\n\n...While yea it has dungeons and dragons all over it, you can enjoy it and know 100% nothing and still enjoy yourself. I think it would have been better as its own title, and it gets revealed at the end that it was dungeons and dragons all along.\n\n",
        "upvotes": 13,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1lut84e/whats_a_movie_whether_successful_or_not_that/"
    },
    {
        "id": "1lu3aqv",
        "author": "vaisatriani",
        "title": "Movies You've Walked Out Of",
        "content": "I'm curious what movies you've walked out of for any reason.  Maybe the movie was terrible, maybe you got sick, maybe you got an emergency text.\n\nDid you eventually see the film?\n\nI've got a few of 'em.\n\nDRAGONSLAYER: I was 11 years old and a friend's mom took us.  The film is surprisingly rather brutal, and when we got to the scene where the baby dragons are eating the princess, she noped out of the film and we all had to leave.  I ended up seeing it a few weeks later when the film hit a second run theater (my brother took me).  Great movie.\n\nJOES VS THE VOLCANO: My girlfriend at the time was hating it so we left shortly after Tom Hanks got onto the yacht.  She offered me positive inducement to leave so we did so.  I eventually saw it when it hit VHS and a few times since.  It's OK.\n\nSPIDER-MAN: I was liking the film but something didn't agree with me from the meal I had prior to sitting down.  What I thought would be a quick bathroom break ended up running until the film ended.  I was loving the film up until the point that I left so I went and saw it the following weekend.  My wife, who was with me for the aborted viewing, loved the film and saw it again with me.  Great movie.  I know that critical consensus holds that the sequel is the best of the trilogy but I prefer that first one still.\n\n  \nThere have been others I've come close to walking out on because the movie was terrible but, to my memory, those are the only three for me where I actually did leave early.",
        "upvotes": 542,
        "comments": 2150,
        "media": null,
        "permalink": "/r/movies/comments/1lu3aqv/movies_youve_walked_out_of/"
    },
    {
        "id": "1lumfmn",
        "author": "MrPuroresu42",
        "title": "Kurt Vonnegut's novels that have been adapted to the big screen: Slaughterhouse-Five (1972), Mother Night (1996) and Breakfast of Champions (1999).",
        "content": "Kurt Vonnegut is easily one of my favorite authors. So it goes. His novels have both made me laugh out and loud as well as shed tears. I took it upon myself to look at the 3 adaptions of his novels with *Slaughterhouse-Five,* *Mother* *Night* and *Breakfast* *of* *Champions* and look at how they went about adapting Vonnegut's unique voice and what may have been lost in adaption.\n\nFirst, we have *Slaughterhouse*\\-*Five*, easily Vonnegut's most well-known and read novel, one that has a big place in literary history. The novel, concerning the character of Billy Pilgrim being \"unstuck in time\" and based on the real-life bombing of Dresden (which Vonnegut witnessed as a POW), was released in 1969, proving to be such a hit that it was turned into a film only 3 years later. The film adaption would be directed by George Roy Hill, best known for *Butch Cassidy and the Sundance Kid* (1969), for which he won the Oscar for Best Director. The film adaption was well received by critics, winning the *Prix du Jury* at the Cannes Film Festival. So it goes. Even more of a glowing commendation came from Vonnegut himself, who said he couldn't be happier with how his novel was adapted. Watching the film and I am impressed by how closely they stuck to the novel and the casting was pretty damn good. However, I find that it's one of those films that fails to live up the heights of the novel, especially when it came to how I pictured certain parts and characters as I read it. I'd recommend it to fans of the novel, with the caveat that it isn't the same as reading the novel.\n\nSecondly, we have *Mother* *Night*, which has the biggest gap from the novel to the film adaption of Vonnegut's works, with the novel being published in 1962 and the film being released in 1996. The novel is about Howard W. Campbell Jr., an American who lives in Germany with his family since post-WW1, who becomes recruited by American Intelligence to become a double-agent, broadcasting Nazi Propaganda while secretly communicating with the Americans about Nazi plans. The film was directed by Keith Gordon, who is most known for his role as Archie Cunningham in *Christine* (1983), but had directed a few indie flicks before adapting Mother Night. This is my favorite adaption of the 3 films and it's especially due to Nick Nolte's fantastic performance as Howard W. Campbell Jr. Nolte brings his trademark rage and sense of self-loathing to the role with aplomb. Nolte really makes this a one-man show but their are some nice supporting performances by Sheryl Lee, Alan Arkin, Frankie Faison and John Goodman. This adaption was also well received by critics and Vonnegut also commended the film for how it adapted his novel. So it goes. \n\nFinally, we have *Breakfast of Champions*, the novel being published in 1973 and the film being released in 1999. The novel and film concerns itself with Dwayne Hoover, a well respected businessman whose mental health deteriorates over the course of the novel; the novel also looks at the city Dwayne lives in, Midland City, as well as exploring the various people that make up the city; also, the novel feature Kilgore Trout, the biggest reoccurring character in Vonnegut's 'Verse, who's a curmudgeonly writer on his way to Midland City for an Arts Festival. The film was directed by Alan Rudolph, a longtime director of indie films in various genres. The film was roundly panned by critics. So it goes. I find this adaption to be the most frustrating, as while it has some of comedy of the novel, it completely misses the pathos. The film also suffers from changing various elements of the novel, cutting out crucial scenes of adding whole new ones. Despite the overall disappointment I found in the film, I did come away liking some of the performances. I thought Bruce Willis did a fair job at portraying Dwayne Hoover as Willis used some of his natural comedic timing to pull off Hoover's decreasing mental state. The incomparable Albert Finney does well in the time he's given as Kilgore Trout. Nick Nolte gets the chance to play a zanier role as the crossdressing Harry LeSabre, with Nolte really excelling with the comedic bits. ",
        "upvotes": 22,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1lumfmn/kurt_vonneguts_novels_that_have_been_adapted_to/"
    },
    {
        "id": "1ltw49n",
        "author": "KillerCroc1234567",
        "title": "New Poster for \"The Bad Guys 2\"",
        "content": "",
        "upvotes": 1032,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6skcyw19tgbf1.jpeg?auto=webp&amp;s=f878a6c9617bc48b312cc9220bf0c7b7919c141e"
        },
        "permalink": "/r/movies/comments/1ltw49n/new_poster_for_the_bad_guys_2/"
    },
    {
        "id": "1ltwfbl",
        "author": "KillerCroc1234567",
        "title": "Jon M. Chu To Direct Live-Action ‘Hot Wheels’ Movie For Mattel, Warner Bros. &amp; Bad Robot",
        "content": "",
        "upvotes": 641,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qsjeV-ss7amDp76UTQbVUsV-pHtEOpKFSHCcg5C1Eh4.jpeg?auto=webp&amp;s=81b2d9d17f4f2e2fa0d8e18fb01d76666c889445"
        },
        "permalink": "/r/movies/comments/1ltwfbl/jon_m_chu_to_direct_liveaction_hot_wheels_movie/"
    },
    {
        "id": "1luu0pt",
        "author": "IReadTheWholeThing",
        "title": "What's a movie you went into blind and it completely blew you away?",
        "content": "For example I watched A beautiful mind and fight club without knowing anything about them, and I was mind blown by the stories. Some movies hit harder when you go blind. That's why I always try not to read much or watch trailer of the film before watching. \n\nCurious to know which films surprised you the most when you had no idea what to expect. P.S. no spoiler please. ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1luu0pt/whats_a_movie_you_went_into_blind_and_it/"
    },
    {
        "id": "1lthzdy",
        "author": "dvsinla",
        "title": "Saw Spaceballs in 70mm last night... sound cut out, audience took over, it was amazing",
        "content": "Went to see Spaceballs in 70mm last night in Hollywood… part of a summer 70mm program.\n\nIt was packed.\n\nThe movie started great as usual... but right when Dark Helmet gets to Mr. Radar, the sound cuts out.\n\nSo we all end up watching in silence for about 5 minutes…\n\nBut the best part? Since most people there knew the movie by heart, they just started doing the dialogue out loud. It was hilarious. People were actually matching the lip movements on screen.\n\nEventually they had to cancel the screening, which was a bummer, but those 5 minutes were awesome. I would’ve honestly watched the whole thing that way. I know it by heart.",
        "upvotes": 5770,
        "comments": 243,
        "media": null,
        "permalink": "/r/movies/comments/1lthzdy/saw_spaceballs_in_70mm_last_night_sound_cut_out/"
    },
    {
        "id": "1luon73",
        "author": "Ok_Afternoon_3084",
        "title": "What were the top 5 films from the year you were born",
        "content": "https://preview.redd.it/zr6nwqyijnbf1.png?width=1067&amp;format=png&amp;auto=webp&amp;s=37f96934aa98b055cfd43f217ef793573100398e\n\nI was born in 1985, in my opinion, a great year for film. Top 5 were all great but there were a few that I'd personally rank higher, but that didn't do as well at the box office. The Goonies, Police Academy 2, National Lampoons European Vacation, A view to a Kill, Breakfast Clube (one of my favourite films ever), Brewsters Millions, Commando, Weird Science, Friday 13th A New Beginning... Actually, just writing them down has made me want to have a film night. ",
        "upvotes": 7,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1luon73/what_were_the_top_5_films_from_the_year_you_were/"
    },
    {
        "id": "1lu4lxa",
        "author": "darth_vader39",
        "title": "Terry Gilliam Reflects On ‘Brazil’ As Film Celebrates 40th Anniversary &amp; The Challenges Of Getting Movies Made Today: “I Really Don’t Want Any More Fights”",
        "content": "",
        "upvotes": 161,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OGDgajJ5v7DGQ6VkQi8LiJC8QDtC0lVB5G_FQGyYsiM.jpeg?auto=webp&amp;s=c3be784d58800994fc6f8c53a2770bc609fc7baf"
        },
        "permalink": "/r/movies/comments/1lu4lxa/terry_gilliam_reflects_on_brazil_as_film/"
    },
    {
        "id": "1luaps5",
        "author": "firedog7881",
        "title": "It’s amazing how much Robin Williams’ Man of the Year is still relevant today",
        "content": "I’m watching Man of the Year and it sounds like it was made in the last 5. It really showcases how much the parties sway but the issues are the same. Robin Williams’ character is the blending of so many people today no matter where you’re at on the left to right spectrum. This is not meant to be anything other than an observation of the relevance of the movie. ",
        "upvotes": 68,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1luaps5/its_amazing_how_much_robin_williams_man_of_the/"
    },
    {
        "id": "1ltxy6c",
        "author": "NoCulture3505",
        "title": "TOGETHER - Official Trailer #2 - In Theaters July 30",
        "content": "",
        "upvotes": 320,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TpHtmlMhbF2ZapOD5zvMO6Kk0Rab9NyO0SJth0Y6-XA.jpeg?auto=webp&amp;s=546103d95c529de25566ca399059867479ecd19f"
        },
        "permalink": "/r/movies/comments/1ltxy6c/together_official_trailer_2_in_theaters_july_30/"
    },
    {
        "id": "1lutmw5",
        "author": "tylerthe-theatre",
        "title": "The Best Horror Movies of 2025 So Far, Ranked: ‘Sinners,’ ‘Final Destination Bloodlines,’ ’28 Years Later’ and More",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1h7ErXunzecK6hNx9GbjDg_85JMMKEraOgCXOWJyTuo.jpeg?auto=webp&amp;s=e0c411fa9a61f8a92aecda4c54e616de80e37366"
        },
        "permalink": "/r/movies/comments/1lutmw5/the_best_horror_movies_of_2025_so_far_ranked/"
    },
    {
        "id": "1ltxvom",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Oscar Nunez - Friday 7/18 at 2:00 PM ET - Actor from 'The Office', 'Disenchanted', 'The Lost City', 'Mr. Iglesias', 'People of Earth', 'Baywatch', and much more.",
        "content": "",
        "upvotes": 263,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ew0yqqci4hbf1.jpeg?auto=webp&amp;s=83f6e08f42896a555d9ffcacb3f3ea7dbee98154"
        },
        "permalink": "/r/movies/comments/1ltxvom/amaqa_announcement_oscar_nunez_friday_718_at_200/"
    },
    {
        "id": "1ltsgnb",
        "author": "BunyipPouch",
        "title": "First Poster for Coming-of-Age Animation 'Boys Go To Jupiter' - Billy, a teenage gig worker, aims to make $5,000. His quest is derailed by a gelatinous alien's appearance.",
        "content": "",
        "upvotes": 528,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aenn6ip9zfbf1.jpeg?auto=webp&amp;s=776a08ad3525e8caf90c82d79c6958412ba06b7a"
        },
        "permalink": "/r/movies/comments/1ltsgnb/first_poster_for_comingofage_animation_boys_go_to/"
    },
    {
        "id": "1lu30tv",
        "author": "BoFlix",
        "title": "New Sovereign teaser 'America' - Nick Offerman, Jacob Tremblay",
        "content": "",
        "upvotes": 138,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oT_URwOsj8RtlK9R7-LeM4WdbnBvDQ-qjNsDQcSFDtw.jpeg?auto=webp&amp;s=90e6ebbdb90df5191295dadf265eecbec8aa0d58"
        },
        "permalink": "/r/movies/comments/1lu30tv/new_sovereign_teaser_america_nick_offerman_jacob/"
    },
    {
        "id": "1lu3idv",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary '2000 Meters to Andriivka' - A Ukrainian platoon attempts to liberate a strategic village from Russian forces. A journalist joins them, observing the impacts of war and growing doubts about its resolution.",
        "content": "",
        "upvotes": 108,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hn107w767ibf1.jpeg?auto=webp&amp;s=f0169a0f67e151902f35c7399f179b288a684693"
        },
        "permalink": "/r/movies/comments/1lu3idv/first_poster_for_documentary_2000_meters_to/"
    },
    {
        "id": "1lutc9j",
        "author": "theturdistheword",
        "title": "Sinister movies?",
        "content": "So I watched Red Rooms (2023) back in February. That movie feels so overwhelmingly evil, and for the second half of the movie I was legitimately queasy. It’s not just the subject matter (even though it did help), but the filmmaking itself that just feels downright sinister. I don’t really know how to describe it. The problem is I wanna feel something like that again. It’s the most emotion a film has made me feel in years.\n\nI’ve just watched Chime (2024), which didn’t quite do it for me, and I plan to watch Cure (1997) later tonight, so we’ll see. \n\nDo y’all have any recommendations for movies that are just enshrouded in dread? Movies that made you feel uneasy but not necessarily in The Human Centipede gross-out type of way? Just purely mean, bleak, horror filmmaking where the gore/imagery might come second to the general tone? I’d love to hear what some of y’all think. Thanks.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1lutc9j/sinister_movies/"
    }
]