[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p5seiv",
        "author": "afk_exe",
        "title": "Netflix wants you to stream its video podcasts in between binge-watching its shows.",
        "content": "",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p5seiv/netflix_wants_you_to_stream_its_video_podcasts_in/"
    },
    {
        "id": "1p5y3fm",
        "author": "KnopeLeslieKnope",
        "title": "Shows Recommendation",
        "content": "Hey guys! So my Netflix subscription renews March 2026 and that's when I'll be canceling. Are there any shows you would recommend me to watch? It's my least streamed service lately and I wanna get the last bang for my buck! I prefer shows that have all of their seasons completed. I also don't mind if a show has been canceled. Give me your recs, please!",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1p5y3fm/shows_recommendation/"
    },
    {
        "id": "1p5in2i",
        "author": "hard2resist",
        "title": "Thriller Series Like \"YOU\"  Need Recommendations for Non-Stop Suspense &amp; Dark Psychological Twists",
        "content": "I'm looking for recommendations for series or movies on Netflix or Prime Video that match the psychological thriller and suspense vibe of YOU.\n\nWhat I'm looking for:\n\n\t\\* Crime thrillers with strong suspense elements\n\n\t\\* Action-packed series that keep you on edge\n\n\t\\* Shows with psychological depth and dark themes\n\n\t\\* Fast-paced storytelling that hooks you from episode one\n\nI loved YOU for its unpredictable plot twists and the way it kept me guessing. Now I need something that delivers that same intensity and gripping atmosphere.\n\nWhat are your top picks for thriller series that deliver non-stop suspense and action? Bonus points if it's something that's criminally underrated.",
        "upvotes": 22,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p5in2i/thriller_series_like_you_need_recommendations_for/"
    },
    {
        "id": "1p5zgpf",
        "author": "Jazzlike_Ad_8236",
        "title": "Black Rabbit “One Month Earlier”",
        "content": "So I just watched the first scene of Black Rabbit then turned it off. Idk if I’m alone in this, but i absolutely cannot stand when a show opens with the climax, then cuts halfway thru to a previous point in time. To me it feels like such a cheap and lazy way to create intrigue. I cannot think of a single instance where there’s a narrative purpose for it. Anyone else feel that way?\n\n(Sidenote: ik I can’t judge the show, but the dialogue in that one scene was so bad I was worried I wouldn’t like the show. Legit the first line is “well that is definitely the most amount of money I’ve ever had in this safe” that is the most expository line I’ve ever heard)",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p5zgpf/black_rabbit_one_month_earlier/"
    },
    {
        "id": "1p4l0s5",
        "author": "hard2resist",
        "title": "What Netflix show kept you up all night binge-watching recently?",
        "content": "I just finished The Beast in Me in one sitting and realized I haven't had that \"just one more episode\" feeling in a while. Now I'm looking for my next obsession.\n\nWhat's the last Netflix show that had you completely hooked? The kind where you tell yourself you'll watch one episode and suddenly it's 3 AM.\n\nLooking for something that grabs you from episode one and doesn't let go.",
        "upvotes": 1192,
        "comments": 882,
        "media": null,
        "permalink": "/r/netflix/comments/1p4l0s5/what_netflix_show_kept_you_up_all_night/"
    },
    {
        "id": "1p5lgij",
        "author": "redd84x",
        "title": "Brooklyn 99 vs The Office US - Which one stays?",
        "content": "These are my two comfort-rewatch shows on Netflix. I’ve gone through both more times than I can count, and they somehow never get old.\n\nBut if only one could stay on Netflix…\nWhich one would you keep, and why?\n\nIf I had to choose, I’d probably keep Brooklyn 99 (big Andy Samberg fan here, sorry Steve).",
        "upvotes": 6,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1p5lgij/brooklyn_99_vs_the_office_us_which_one_stays/"
    },
    {
        "id": "1p5ptzl",
        "author": "Beginning_Bridge_272",
        "title": "squid game season 1 was the best",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5ptzl/squid_game_season_1_was_the_best/"
    },
    {
        "id": "1p5posn",
        "author": "techniscalepainting",
        "title": "netflix at two different locations?",
        "content": "I have a home and an apartment which i am often staying at for extended periods\n\nnetflix is registered to use my home wifi as the \"household\" however in the apartment i have a desktop pc which i use while im there, including watching netflix\n\nI have seen that to allow you to keep using netflix on a mobile device on other wifis you have to log into it once a month on the home wifi, however that obviously isnt possible with the desktop\n\n  \nis there a way that i can watch netflix at both the home address, and on the apartment desktop pc, without having to go through the steps of allowing temporary access every 2 weeks? \n\n",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p5posn/netflix_at_two_different_locations/"
    },
    {
        "id": "1p5bv0e",
        "author": "Curious-Monitor497",
        "title": "Need recommendations for thrillers",
        "content": "Please recommend really good thriller shows/movies. Mainly short series, as I don't want to watch multiple seasons to get a conclusion. \n\nI recently watched the following:\nMindhunter (liked this, but 2 seasons of detectives working on sexual crimes was too disturbing)\nThe sinner (liked this)\nBodkin (liked this)\nUntamed (it was okay, not a fan)\nInside man (okay, not a fan)",
        "upvotes": 9,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p5bv0e/need_recommendations_for_thrillers/"
    },
    {
        "id": "1p5rpbb",
        "author": "Environmental-Flan11",
        "title": "I can’t use the Netflix app on my tv",
        "content": "I have a problem and it is that the Netflix application does not detect my smart TV and I have already tried all the recommendations that Netflix gave and nothing worked, what can I do? (And before they ask, it's not the TV control, it's from the app)",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1p5rpbb/i_cant_use_the_netflix_app_on_my_tv/"
    },
    {
        "id": "1p4wmz4",
        "author": "peacharooroo",
        "title": "What’s up with all the blue and brown in The Beast In Me",
        "content": "I’m curious what the purpose is behind the color scheme in The Beast In Me. All the characters wear shades of blue and brown through each episode, and all their eyes are bright blue. Beyond that, the houses, apartments and business offices all have blue and brown walls and accent pieces, even the outdoor Safari birthday party has decor and guests in those colors. There are also smaller accents of purples and greens. There’s enough to let me know it was more than intentional, it’s meant to be noticed. But why? ",
        "upvotes": 69,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p4wmz4/whats_up_with_all_the_blue_and_brown_in_the_beast/"
    },
    {
        "id": "1p5opf5",
        "author": "ChallengeAdept8759",
        "title": "Meet the game designer who lied his way through ‘Squid Game: The Challenge’",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5opf5/meet_the_game_designer_who_lied_his_way_through/"
    },
    {
        "id": "1p5q0hs",
        "author": "TextThis8793",
        "title": "Missing: Dead or alive",
        "content": "Is this show fake? Vicki seems so insincere putting on a fake sad face when victims are mourning. S2E4 the fact that the officers, family, and accused misgender Shandon every time is so disrespectful! Southern states…",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p5q0hs/missing_dead_or_alive/"
    },
    {
        "id": "1p586fm",
        "author": "MiddlePath2",
        "title": "Should I watch the series 'Supernatural'?",
        "content": "What are 3 episodes I can watch that will pull me into the show without revealing too much lore? \n\nLike filler episodes.\n\n(I want to see if its even going to pull me in before I start from episode 1 and get too invested into something I dont like) \n\nPreferably scary episodes.",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p586fm/should_i_watch_the_series_supernatural/"
    },
    {
        "id": "1p57g32",
        "author": "Techiesarethebomb",
        "title": "Netflix Games Doesn't Work for New Samsung TVs?",
        "content": "So I have a 2023 Samsung QLED TV and I tried to access the netflix games selection (tetris, boggle, pictionary, lego party) and I noticed when I clicked on it I got the \"play on select TVs only\" response...but when I go to the FAQ my TV clearly looks like one of the eligible smart TVs to use it. It's fully updated and I am just confused why my TV can't access it. Has anyone else had this problem?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p57g32/netflix_games_doesnt_work_for_new_samsung_tvs/"
    },
    {
        "id": "1p562in",
        "author": "wilcojunkie",
        "title": "Netflix Fire TV app issue - content immediately starts",
        "content": "I feel like this is a bit of a Boomer app tech question but, here goes. I use the Netflix app for my smart TV. I haven't used it in a while but, when I go to click a movie or show instead of a landing page appearing where you can see the info, add it to your watchlist etc, the content immediately starts. So I can't figure out if this is a settings issue or what. No clue. Anyone have any idea on what to do or have encountered this issue before? ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p562in/netflix_fire_tv_app_issue_content_immediately/"
    },
    {
        "id": "1p5c034",
        "author": "Lazii_Xy",
        "title": "HOW DO I TURN OFF THE BETA SEARCH",
        "content": "This is gonna send me into some weird frenzy. I literally cannot escape the Beta AI search after accidentally somehow turning it on and it's driving me nuts. Someone please tell me how to get rid of it cause there's NO option up to opt out on my screen.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5c034/how_do_i_turn_off_the_beta_search/"
    },
    {
        "id": "1p55n31",
        "author": "garrettj100",
        "title": "Whiskey from s1e5 of *The Beast In Me*",
        "content": "Matthew Rhys is waving the bottle around at the 6:39 mark while playing *Psycho Killer* on the record player.  The bottle appears to say CALLIS or CALLIE or perhaps DALLIS or BALLIS.  And there is a second (empty) bottle that Danes was drinking from at the end of s1e4.\n\nAre these real bottles or just TV props?  Anybody recognize either?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p55n31/whiskey_from_s1e5_of_the_beast_in_me/"
    },
    {
        "id": "1p51bkj",
        "author": "Stretch1164",
        "title": "What to watch",
        "content": "I am home alone for several days, as my husband and kids are camping. I want to eat a gummy or two and laugh my butt off. What should I watch?\n\nMy brand of comedy is heavily influenced by British sitcoms, ie The IT Crowd, Keeping Up Appearances, and Are You Being Served. My favorite movie is Ghostbusters, and taboo jokes are completely on the table.",
        "upvotes": 10,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1p51bkj/what_to_watch/"
    },
    {
        "id": "1p5280z",
        "author": "joe_m___",
        "title": "I just found out that netflix hides seasons or shows depending on profile language",
        "content": "I live in sweden so the standard language for my profile was swedish. Now when the language is set to swedish for example scissor seven has 4 season but when i changed it to english it got 5 seasons. Now this is only when i changed the setting for a profile and not the full account.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p5280z/i_just_found_out_that_netflix_hides_seasons_or/"
    },
    {
        "id": "1p5gwr8",
        "author": "chowchowchow4321",
        "title": "This Is Going To Hurt terminologies?",
        "content": "I work for a US health system and just started watching this.  I am very confused by their roles - like they call Lockhart “Mr” Lockhart, “consultant”, but he is clearly as surgeon as he is seen in scrubs performing surgery.  In US they would call him Dr. Lockhart and refer to him as Supervising Attending.  The “supervising” title may vary by health system, but he would officially be know as Attending Surgeon.\n\nAlso is Tracy a nurse or a midwife? Or are those interchangeable over the pond?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p5gwr8/this_is_going_to_hurt_terminologies/"
    },
    {
        "id": "1p5brot",
        "author": "Live_Sort5110",
        "title": "The Beast In Me",
        "content": "Hi Netflix, just finished watching the show and it was so good. Maybe the end was tad bit predictable but it had me on my edge throughout the episodes.\nHowever, please correct “Karma” is a concept from Hinduism. It mentioned Buddhism in the last episode. \nKindly, research better next time ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p5brot/the_beast_in_me/"
    },
    {
        "id": "1p53bcr",
        "author": "Midasisgolden",
        "title": "What Did You Think Of “From Scratch”?",
        "content": "I think it’s one of the best romantic dramas I’ve watched in a very long time. The writing, the chemistry between the actors, the ACTING, the storyline and the ending 🤌\nI cried so many different tears, especially the last few episodes 😭 \nI wasn’t even really paying attention until the scene where Amy drew a heart on Lino’s knee, writing “Amo”. \n\nMy poor heart strings 😭😭",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p53bcr/what_did_you_think_of_from_scratch/"
    },
    {
        "id": "1p5mhb0",
        "author": "RiskAndReason",
        "title": "Tell me something I probably don’t know about STRANGER THINGS",
        "content": "With the new season of Stranger Things only days away, I want to hear something about the show that most people might not know.  \n  \nFun facts, behind-the-scenes stories, production details, anything goes.\n\nHit me with your best obscure Stranger Things knowledge.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1p5mhb0/tell_me_something_i_probably_dont_know_about/"
    },
    {
        "id": "1p5pxr8",
        "author": "Due-Information-6277",
        "title": "Why do you pay for Netflix?",
        "content": "I've been wondering this for a long time. Isn't Netflix just a bunch of old movies? I'm not trying to offend anyone lol I just think if I were to sign up for Netflix right now that is all I would see. Just a bunch of old stuff. Not gonna lie i do find value in it and think it's good sometimes. For example I signed up when stranger things or squid games came on but after that I just saw no reason to keep it.i find If there is something I want to watch usually a movie i will just go to the movies or if there is something specific I usually can't even find it on Netflix so what's the point. So I usually just end up going to “ other sites” or just renting it... anyway l'd like to hear your thoughts. Maybe I'm just an introvert and maybe you just get recommendations from friends haha don't be to harsh haha. Ps I do like movies and tv maybe I'm just old and preferred when things just played and I didn't have to make a choice on watch to watch and I'm not that old im 30.",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1p5pxr8/why_do_you_pay_for_netflix/"
    },
    {
        "id": "1p5wwj7",
        "author": "houndsailing",
        "title": "Is it me or did it put more$ in all white casting then before Jan 2025",
        "content": " I was indoctrinated in all white casting movies growing up  and was fine with it, but once the movie scene started expanding in Netflix spent more $ on diverse casts I liked that more now I find myself not interested in shows/movies with not one diverse lead role 🧐",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p5wwj7/is_it_me_or_did_it_put_more_in_all_white_casting/"
    },
    {
        "id": "1p561nw",
        "author": "Doctor-Wayne",
        "title": "Speculative Fiction recommendations",
        "content": "I'm looking for Speculative Fiction recommendations, whether scifi, cosmic horror, philosophy, thriller or whatever. Preferably movies but series are fine. Some people i know are almost immune to mentally engaging with hypothetical scenarios and I'd like to see if I'm able remedy this buy consuming media with them and trying to have a chat. Extra points if on Australian netflix ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p561nw/speculative_fiction_recommendations/"
    },
    {
        "id": "1p5ic3p",
        "author": "strngthry",
        "title": "Looking for active Netflix users for a quick 20-min chat",
        "content": "Hi everyone! I’m working on a small user research project to understand how active Netflix watchers use the app. If you watch Netflix for **3+ hours a week** and are open to a **short 20-minute conversation**, I’d really appreciate your help.\n\nNo pitches, no selling — just understanding real user habits.\n\nIf you’re interested, please comment ‘Yes’. Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5ic3p/looking_for_active_netflix_users_for_a_quick/"
    }
]