[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 34,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pwqjqs",
        "author": "justameesa",
        "title": "Stranger Things might crash as hard as GOT",
        "content": "The writing is not doing any favors to the plot or the characters. At this point of time listing things from the 80s is the only \"appeal\" to this nostalgia driven show.\n\nD&amp;D curse much? ( Duffer and Duffer)",
        "upvotes": 934,
        "comments": 601,
        "media": null,
        "permalink": "/r/netflix/comments/1pwqjqs/stranger_things_might_crash_as_hard_as_got/"
    },
    {
        "id": "1pwtfiu",
        "author": "job_hunter101",
        "title": "Any one else hate these batch releases?",
        "content": "Either release it all at once so we can binge it, or release it weekly so people can enjoy discussing it each week. Instead, these batch releases make me hate it entirely. You usually wouldn’t know when these get released and sometimes it’ll be days before you even know it, unless you don’t have any life. \n\nIt’s bad enough as it is with the yearly gaps between each season and to add these batch releases to it just makes my interest go down the drain. ",
        "upvotes": 168,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtfiu/any_one_else_hate_these_batch_releases/"
    },
    {
        "id": "1pwtmvv",
        "author": "Normal_Comfort_5847",
        "title": "So we’re just supposed to know Stranger Things lore from a stage play (The First Shadow) now?",
        "content": "I get that Stranger Things: The First Shadow (Broadway / West End) is meant to deepen the lore, but honestly it feels like it introduces major information that should not be locked behind a stage play that most fans will never see.\n\nThere are things in the show that already felt like loose threads, and now it turns out they are “explained” in the play:\n\n1. Henry’s cave memory in Season 5, where he’s clearly interacting with / absorbing Mind Flayer-like particles. In the show, this is presented as something mysterious and significant… but never really followed up on in a satisfying way. Apparently the play adds context, but the series itself doesn’t.\n\n2. The Oklahoma poster in Max’s hand during one of Henry’s memories strongly suggests Joyce, Hopper, and Henry all went to school together. That’s a huge implication; yet across four seasons, Joyce and Hop never say a single word about knowing Henry Creel? Not even a hint?\n\n3. Henry’s early connection to the Upside Down, Brenner’s involvement, and the timeline of how everything starts are apparently much clearer in the play but on screen, it still feels incomplete or oddly rushed.\n\nThe problem isn’t expanded lore. It’s that the main TV series feels like it’s missing chapters unless you’ve seen a West End/ Broadway show that:\n\nA. isn’t accessible worldwide,\n\nB. isn’t cheap,\n\nC. and won’t be seen by the vast majority of viewers.\n\nAt this point, it feels like they should’ve done a limited prequel season or special between Season 4 and 5 to properly set this up. Relying on a stage production to carry essential canon just makes Season 4 feel retroactively unfinished.\n\nWith only one episode left, I’m worried the finale will have too much ground to cover, and that casual viewers will never even realize why certain things don’t quite add up.\n\nEnd rant. Curious if this bugs anyone else or if I’m just overthinking it. ",
        "upvotes": 148,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtmvv/so_were_just_supposed_to_know_stranger_things/"
    },
    {
        "id": "1pwzt7w",
        "author": "TurnipYadaYada6941",
        "title": "The new Netflix UI is atrocious!",
        "content": "Which idiot put the top level menu at the top, where you cannot reach it without scroll for eternity!\n\n  \nDid the same idiot make it impossible to filter films by genre easily?\n\nis there any way to get Netflix to provide a usable II?",
        "upvotes": 46,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pwzt7w/the_new_netflix_ui_is_atrocious/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 2665,
        "comments": 593,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pwvee8",
        "author": "Additional_Key_8044",
        "title": "Stranger Things Season 5 Volume 2 Review: Mostly Exhausting",
        "content": "",
        "upvotes": 23,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pwvee8/stranger_things_season_5_volume_2_review_mostly/"
    },
    {
        "id": "1pwuz38",
        "author": "Strange_Light5219",
        "title": "Isn't Stranger Things missing the Ultimate Unbeatable villain?",
        "content": "If you think about it, the Mind Flayer does seem like this looming, unstoppable force compared to Vecna. Vecna's powerful, sure, but the Mind Flayer feels like this bigger, more all-encompassing threat. It's not just one dude with crazy powers—it’s this force that controls the entire Upside Down.\n\nIf Vecna had been taken out earlier, leaving the Mind Flayer as the final big bad, it could’ve made for an epic conclusion, especially with the whole \"creature from another dimension\" vibe. Plus, we’ve seen so much of Vecna already and defeated him once, so a new, final enemy could've really upped the tension.\n\nThe final season could've had a nice twist if they just focused on the Mind Flayer and made it a true battle for survival. I think it would've given the show even more of a chaotic, \"can they even win?\" energy. What do you think peeps?\n\n\n",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pwuz38/isnt_stranger_things_missing_the_ultimate/"
    },
    {
        "id": "1pwbsi3",
        "author": "entcanta333",
        "title": "How do you feel about the three-part release of Stranger Things?",
        "content": "I was so excited for this last season and after watching part 2, I feel like I've almost lost interest. I'm just in it to see the ending at this point, I don't feel emotionally invested in the show. ",
        "upvotes": 235,
        "comments": 236,
        "media": null,
        "permalink": "/r/netflix/comments/1pwbsi3/how_do_you_feel_about_the_threepart_release_of/"
    },
    {
        "id": "1pwm44z",
        "author": "brianmcnail",
        "title": "Death By Lightning",
        "content": "Please don’t sleep on this show.  Netflix did an amazing job bringing this show to life yes there is A LOT of creative liberties, but this amazing and would love to see Netflix to take a stab at other lesser discussed moments from history.",
        "upvotes": 55,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pwm44z/death_by_lightning/"
    },
    {
        "id": "1pwa2j8",
        "author": "stroh_1002",
        "title": "Sadie Sink teases the Stranger Things series finale: 'It feels like a homecoming of sorts. It feels complete'",
        "content": "",
        "upvotes": 95,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pwa2j8/sadie_sink_teases_the_stranger_things_series/"
    },
    {
        "id": "1px1u3v",
        "author": "hxneygirly",
        "title": "\"dark\" on netflix",
        "content": "im 3 episodes in, only on season 1. but im feeling really bored of it right now, and not super impressed. however people tell me to keep watching, what do you guys think? watch it or drop it ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1px1u3v/dark_on_netflix/"
    },
    {
        "id": "1pwz3i9",
        "author": "DuxxieDings",
        "title": "what are some good netflix adult animated shows like arcane and wolf king?",
        "content": "is there more dark story based netflix adult animated shows like arcane and wolf king? im not talking about adult cartoons like big mouth or haunted hotel, im asking for shows like arcane / wolf king where it feels real and it isnt over exessive blood or dirty jokes every 5 minutes, yeah im fine with blood and cursing. im asking for more animations that focus on the characters and plot. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pwz3i9/what_are_some_good_netflix_adult_animated_shows/"
    },
    {
        "id": "1pwyp4j",
        "author": "Glarms3",
        "title": "Need a long show to binge",
        "content": "I’m looking for a Netflix show with a lot of seasons, something I can stick with for weeks and not run out of episodes fast. I prefer serious shows with a good story, not something super light or random.\n\nI’ve already seen stuff like Breaking Bad and Ozark, and I liked that kind of vibe. Any good long-running shows you’d recommend right now? What kept you hooked for multiple seasons?",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pwyp4j/need_a_long_show_to_binge/"
    },
    {
        "id": "1pwy4hu",
        "author": "Hot-Slide-7305",
        "title": "Mike and Eleven",
        "content": "What is your feelings on Mike and Elevens relationship in the TV show Stranger Things?\nSome fans think they are connected by love. Others think they are connected only by trauma and once everything is over their relationship will not work \nPersonally I'm a fan of the show who thinks love, I think their great together. Have great connection and show lots of love and friendship but what's your opinion?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwy4hu/mike_and_eleven/"
    },
    {
        "id": "1pwy3it",
        "author": "RudolfTheRedNosedRat",
        "title": "The decline of (mostly non-English) audio tracks on Netflix",
        "content": "I’ve noticed something that’s been bugging me lately: Netflix will still show a movie with localized artwork/title for my region, but then the expected audio tracks aren’t available anymore.\nAfter thinking this for the last months, I've seen it again today when trying to watch \"The Grinch Stole Christmas\" (Jim Carrey, 2000; Der Grinch in German). I’m in the German-speaking region and I’ve watched it in German on Netflix before. Now the German audio track is gone for us and I only get German subtitles.\n\nI understand licensing/rights are probably the reason (regional contracts, changing agreements, blablabla). But for a huge international company like Netflix, it feels like a quality issue when a title is clearly marketed locally and the obvious local language track just isn’t there, with no clear explanation.\nAnd it doesn’t feel like a one-off. I’ve had this impression more and more: Movies and series that used to have certain language tracks suddenly don’t.\nSometimes even the original language options feel inconsistent depending on the region, which feels especially weird to me. I fear it might get even worse, where I can't even watch English originals in English anymore (like it is on Sky/HBO and Amazon at times).\n\nHas anyone else seen this? Did you find other affected titles? What’s the best way to actually get Netflix to address this beyond contacting support?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwy3it/the_decline_of_mostly_nonenglish_audio_tracks_on/"
    },
    {
        "id": "1pwxysk",
        "author": "Aggravating_Coffee66",
        "title": "Why is Netflix taking Mare Fuori off in the Netherlands??",
        "content": "Hi,\n\nMy favourite series, mare Fuori (the sea beyond) is being taken off Netflix by January 17th! I’m shocked, how am I going to watch it now? \n\nWhy Netflix? Why??? \n\nAnd how can I watch it after that date then?\n\nI just don’t get it, a 5th season is on the way, it’s a smash hit… and now they’re taking it off?!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pwxysk/why_is_netflix_taking_mare_fuori_off_in_the/"
    },
    {
        "id": "1pwnb11",
        "author": "J-Dogg989",
        "title": "Not working for me how about you guys?",
        "content": "I’m trying to open Netflix, I’m hearing the “duh duh” but then it just freezes and nothing loads. Is this happening for anyone else right now or is it just me? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pwnb11/not_working_for_me_how_about_you_guys/"
    },
    {
        "id": "1pwvk5k",
        "author": "Purple-Acanthisitta8",
        "title": "Stranger things sound design is amazing.",
        "content": "Every time a new season for stranger things comes out, my sound system gets a proper workout. They just know how to engage using sound, although this season is not the best but the sound design keeps you hooked.\n\nIf you have a proper sound system, you will know what I’m talking about. The entire room start shaking and walls begins to vibrate and you just feel you are surrounded inside there.\n\nAmazing work by people involved in the sound design, just wanna throw an appreciation cuz they don’t get much love.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwvk5k/stranger_things_sound_design_is_amazing/"
    },
    {
        "id": "1pvqg9x",
        "author": "ChuckieDabs",
        "title": "Netflix “Spoilers Commercial” 2025",
        "content": "Netflix just released a commercial for themselves during this 2025 Christmas NFL game that contained legitimate spoilers for the newest seasons of their TV shows. I do not get what marketing executive thought it was a good idea to run that. It was genuinely annoying and the message was some generic corporate American pandering.",
        "upvotes": 530,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqg9x/netflix_spoilers_commercial_2025/"
    },
    {
        "id": "1pwh06l",
        "author": "ALife_TimeModerater",
        "title": "More people need to watch to ronja the robbers daughter the two season show is perfect and is very sad at the end of the show",
        "content": "The show is a medieval fantasy about two lost friends who battle each other and two children who don’t want to follow in there parent’s footsteps and two sisters who hunt robbers for traumatic reasonings  and a nice old dude ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwh06l/more_people_need_to_watch_to_ronja_the_robbers/"
    },
    {
        "id": "1pw9zix",
        "author": "bishtpd",
        "title": "Suspense, crime, detective series on Netflix",
        "content": "I’m looking for recommendations for a gripping suspense or crime series on Netflix, similar in tone and depth to The Fall, Broadchurch, or The Sinner—slow burn, strong characters, and a dark, psychological edge. \n\nAny suggestions?",
        "upvotes": 16,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pw9zix/suspense_crime_detective_series_on_netflix/"
    },
    {
        "id": "1pwsl3i",
        "author": "Asuperniceguy",
        "title": "Remove watch history?",
        "content": "My KID LOVES creature cases and wants to watch it on repeat, which is fine because it's goated, but Netflix knows she's seen every episode so at the end of an episode it's like 'what to watch next'. I want to tell Netflix that we haven't seen it so it'll just play the next episode. Any ideas? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwsl3i/remove_watch_history/"
    },
    {
        "id": "1pwepm6",
        "author": "Sufficient-Tip-4454",
        "title": "What is up with all these weird new kid shows?",
        "content": "Maybe this is the wrong sub since I didn't see any other kid based discussions... But what is the deal with all these seemingly new kid shows that have no speaking and are just characters doing silly things?? They drive me absolutely crazy &amp; my son always finds them and cackles incessantly at them 😵‍💫😵‍💫 maybe I'm the only one with this opinion lol but please make it stop!",
        "upvotes": 9,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pwepm6/what_is_up_with_all_these_weird_new_kid_shows/"
    },
    {
        "id": "1pwoj1w",
        "author": "Glonkingvvvvvvv",
        "title": "Help pls",
        "content": "I’ve been trying to play a  game called red dead redemption, since I got i membership, but whenever I try to use option to tell it where I live, I get stuck on a screen saying help with the Netflix logo. And I can’t do anything with it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwoj1w/help_pls/"
    },
    {
        "id": "1pvqf6c",
        "author": "cancerman1120",
        "title": "What was with that commercial?",
        "content": "Watching football and Netflix runs a commercial on its own service spoiling a bunch of shows? Maybe it was a gag since I covered my eyes since I did not want anything spoiled for me. Anyone watch it? Were there spoilers?",
        "upvotes": 159,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqf6c/what_was_with_that_commercial/"
    },
    {
        "id": "1pvvbtb",
        "author": "Baapofmovies_123",
        "title": "Stranger Things Season 5 Volume 2 Review (2025): Strong Moments, Weak Payoff Before the Finale",
        "content": "It continued  Netflix’s flagship sci-fi saga and is carrying the weight of an ending that fans have waited years to see. However, with so much expectations, Volume 2 falls flat, as it ultimately feels like an extended bridge to the finale rather than a satisfying chapter on its own. ",
        "upvotes": 61,
        "comments": 239,
        "media": null,
        "permalink": "/r/netflix/comments/1pvvbtb/stranger_things_season_5_volume_2_review_2025/"
    },
    {
        "id": "1pwzzea",
        "author": "SuspiciousSession475",
        "title": "How do people not find Stranger Things extremely overrated?",
        "content": "I recently watched Stranger things from first season because of all the hoopla around it, and I honestly can not believe why this show has gotten this much traction. There is WAY better acting and way more nuanced plot points that keeps viewers guessing in other tv shows including Game of Thrones (think Better Call Saul, Good Girls etc.) . I can understand season 1 plot was intriguing yes, but the story is rinse and repeat ever since (not to mention the extremely “mid” acting of most of the actors, understandably because they are underage). However none of these other shows (except GoT) got as much popularity as Stranger Things. \n\nIs it due to more kids watching Netflix? Is it due to 80s nostalgia? I am still puzzled by the disproportionate popularity this show has achieved ",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pwzzea/how_do_people_not_find_stranger_things_extremely/"
    },
    {
        "id": "1pvk4u5",
        "author": "TheMirrorUS",
        "title": "Netflix viewers furious over streaming issues during NFL Christmas coverage",
        "content": "",
        "upvotes": 294,
        "comments": 306,
        "media": null,
        "permalink": "/r/netflix/comments/1pvk4u5/netflix_viewers_furious_over_streaming_issues/"
    }
]