[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 656,
        "comments": 4987,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nl5mw2",
        "author": "HotComplaint1203",
        "title": "Just finished binging Black Rabbit and don't see anybody on here talking about it yet. I'm surprised.",
        "content": "Jason Bateman and Jude Law in a dark crime drama with gangster loan sharks, shady business dealings, extremely flawed to downright despicable characters, and an interesting look at familial relationships? I was signed up for it the instant I saw the trailer. How is this show not the talk of the town on the sub right now? Great acting, overall great story. It was a bit like The Bear meets Uncut Gems to me, and I thought it was absolutely great.\n\nIf you're into the genre, please check it out, because these are the exact type of shows I want Netflix to make more of!",
        "upvotes": 27,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1nl5mw2/just_finished_binging_black_rabbit_and_dont_see/"
    },
    {
        "id": "1nklwhg",
        "author": "BlackDoom_26",
        "title": "Which Netflix movie or show had the best twist?",
        "content": "Netflix has so many movies and shows that pull off twists you don’t see coming. I’d love to hear which one surprised you the most and stuck with you. Excited to see what everyone else thought was the most surprising.",
        "upvotes": 129,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1nklwhg/which_netflix_movie_or_show_had_the_best_twist/"
    },
    {
        "id": "1nkvxdf",
        "author": "_mcklovin_",
        "title": "Adolescence (groyper, incel)",
        "content": "Okay, I have a few things to say. So, first of all this was a super weird coincidence that I watched this today because I’ve been learning about the alt-right incel groyper pipeline on TikTok literally all week after the you-know-who assassination because I was totally ignorant to all of that, and I watched Adolescence today literally not knowing AT ALL that’s what it is about. I started watching it because that kid was the youngest to ever when an Emmy, and I was like oh must be good. Well it was good, and it was objectively the best time I could’ve watched it and deeply understood it. I need to lie down. \n\nSecond, media literacy is literally dead methinks. I was on a different subreddit and this girl said she didn’t like how the show propped up the killer and diminished the victim and other female characters, but that was LITERALLY the entire point. It even pointed out that the killers are always remembered and the victims are forgotten. Again, maybe if you’re not super familiar with the alt-right incel groyper stuff which I also wasn’t aware of until this week, I can see where you wouldn’t totally fill in all the gaps, but the entire point was to show this normal kid who you could chalk his actions up to bullying when in reality, even if he was bullied (2 things can be true at once) he clearly displayed woman-hating, aggressive, and isolated tendencies that the girls in his class could recognize via his Instagram posts and behavior. Why would a girl want to hang out with someone like that? She also could see right through his little “clever” scheme of asking her out when she was at her weakest when it wasn’t clever, he just thinks women are stupid and sub-humans that are just a means to a sexual end. To incels, they always look outward, never inward. This was also highlighted by the fact this was clearly a cute, not ugly at all little boy saying “I’m ugly” over and over, so his scapegoat was his looks when that wasn’t the problem at all. A lot of these incels who claim they are unattractive are actually attractive on the outside but behave in such a way that their physical appearance doesn’t matter at all which is really the reason they can’t get girls. It has nothing to do with looks at all, but the online chat forums and the rejection by girls reinforces their untrue ideas.\n\nThird, which pretty much I’ve already covered more or less is that there was no twist which ended up actually being the twist because this is simply reality. It’s these kids who are by all means normal at first but then fall into this echo chamber they can’t get out of because their behavior reinforces their perception, and the parents are not sitting down with them and having important conversations about women and sex and simultaneously letting them stay on the computer all the time. The truth is right in front of us, which in this case is a double truth (1. we can clearly see him committing the crime on camera, so there is no plausible deniability at any point even though we want to believe there will be some big twist. 2. we know why young men are growing violent and discontent i.e. groyper chat rooms and unchecked internet use), but we don’t want to see the truth. We the audience and we society. This was covered in the end with the parents pretty well. Tell me your thoughts. ",
        "upvotes": 21,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nkvxdf/adolescence_groyper_incel/"
    },
    {
        "id": "1nl6c1s",
        "author": "DetectiveHot2071",
        "title": "“I did not f*** a single person on Riverdale”: Madelaine Petsch shuts down KJ Apa rumours",
        "content": "update to the article from a couple weeks back hahahaaha",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nl6c1s/i_did_not_f_a_single_person_on_riverdale/"
    },
    {
        "id": "1nl21p8",
        "author": "wapiskiwiyas56",
        "title": "I have an idea. How about Netflix launching a live late night tv division?",
        "content": "They could have plenty of talent to get the ball rolling, like Stephen Colbert and Jimmy Kimmel, and probably Seth Meyers and John Stewart and John Oliver soon. They could either run them all consecutively each night with maybe a half hour show, or do an hour each of, say, Colbert and Stewart Mondays and Wednesdays, Meyers and Kimmel on Tuesdays and Thursdays. John Oliver could take the Friday slot since he’s used to one show a week anyway, or just have them all stream every night at the same time and folks could just watch the ones they want at their own leisure. Just a thought. ",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nl21p8/i_have_an_idea_how_about_netflix_launching_a_live/"
    },
    {
        "id": "1nky279",
        "author": "dfssjdfissicj",
        "title": "Some Wild Theories about now airing Tempest drama! what do you think about them and if you have any?",
        "content": "I have some really wild theories after watching it's latest episode and I wonder if someone else also has thought about them + how come I can not find anything related about over internet.\n\nIf you haven't watched ep 4&amp;5 better skip it because it might spoil few bits for you!\n\nWe can see mention of **stella young** in ep 5 (an American arms lobbyist named Stella Young has been purchasing the materials required for a submarine. But she entered South Korea ten years ago and has been there ever since) and **my theory is** that this stella young is non other than our Munji (Jun Ji Hyun).\n\nMy few assumptions are - 1) See how Junik in his last mail with Miller says \"that he believes that he knows who Stella is and is trying to sort it out\" and in the first episode when Munji was getting ready for going to the church she asks Juniks what's wrong and he says to her that we will talk after this and sort out everything but he died that day. I believe that he knows who Munji was and he died because she figured out that he knows her.\n\n2) Munji was raised in America and she came back in Korea around 9-10 years back I guess when she got married to Junik? IDK the exact time but she cam to korea around that time too, backing up my Hypothesis a bit.\n\nAnother Assumption- Munji being pregnant - I believe that bastard child of Juniks is actually of Munji and Junik's (as we can see how she was also pregnant 9 years ago and how that child is also about the same age, but something happened and she lost her child, we are yet to know that) but I believe Junik got to know about Munji being Stella around the time when she was pregnant with his child and he purposely stole their child from her so he can keep him safe from Stella.\n\nI may have comprehended something differently or may have missed few bits and pieces. Maybe I am completely wrong about all of this and maybe I guessed it right, only time will tell! Please tell me your theories or if you can also relate with mentioned theories? LMK\n\nThanks for reading\n\nhttps://preview.redd.it/igjgqs9r23qf1.png?width=634&amp;format=png&amp;auto=webp&amp;s=96749dec26ac81847b7cb8da21a2914c8287c09d\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nky279/some_wild_theories_about_now_airing_tempest_drama/"
    },
    {
        "id": "1nkxcji",
        "author": "aditigupta22",
        "title": "When comedy feels brutally honest and still makes you laugh",
        "content": "What I love about Hacks is how it balances razor-sharp humor with moments that cut deep emotionally. One second you’re laughing at the savage punchlines, and the next you’re hit with a line that feels way too real. The storytelling never tries to sugarcoat, yet it still leaves you smiling in the end…..\n\nAnyone else feel like it’s one of the rare comedies that doesn’t just entertain but also says something bigger about ambition and resilience?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nkxcji/when_comedy_feels_brutally_honest_and_still_makes/"
    },
    {
        "id": "1nklphq",
        "author": "TheForceWillsMe",
        "title": "28 Years Later on Saturday and the third season of Alice in Borderland a week from today! Let’s Fucking Go!!!",
        "content": "",
        "upvotes": 25,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nklphq/28_years_later_on_saturday_and_the_third_season/"
    },
    {
        "id": "1nka4jy",
        "author": "PlusHumanist",
        "title": "What is your opinion on the South Korean president saying he will increase the financial support for K-pop, K-dramas, and K-webtoons to 211 billion dollars?",
        "content": "[https://www.youtube.com/watch?v=k0XHFgth2Cw](https://www.youtube.com/watch?v=k0XHFgth2Cw)\n\n[https://www.koreaherald.com/article/10468573](https://www.koreaherald.com/article/10468573)\n\nThe South Korean president said he will increase the financial support for K-pop, K-dramas, and K-webtoons to 211 billion dollars.\n\nHe said this since he was a candidate and he said it again weeks ago.\n\nIs this great for people who love K-dramas on Netflix?",
        "upvotes": 74,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nka4jy/what_is_your_opinion_on_the_south_korean/"
    },
    {
        "id": "1nki2pf",
        "author": "Sudden_Pop_2279",
        "title": "Netflix’s Alice in Borderland Season 3 Review: A Satisfying Finale",
        "content": "",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nki2pf/netflixs_alice_in_borderland_season_3_review_a/"
    },
    {
        "id": "1nl2llr",
        "author": "sjbzc",
        "title": "Always A Witch on Netflix",
        "content": "A must watch about a witch being burned on the stakes in 1546 but time travels into 2019 some country different century...all for love and to possibly end slavery",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nl2llr/always_a_witch_on_netflix/"
    },
    {
        "id": "1nl5dz7",
        "author": "neidbrbduror",
        "title": "Guys I need recommendations sorry this is not the first time I send this",
        "content": "I need a series or a movie about war romance kr something like the man fights and the girl keeps worrying about him and crying and when she sees him she hugs him and shut and he rescues her you know what I mean give me hundreds of recommendations deadass give me hundreds ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nl5dz7/guys_i_need_recommendations_sorry_this_is_not_the/"
    },
    {
        "id": "1nkn3b9",
        "author": "Western-Cheesecake64",
        "title": "Need a new show",
        "content": "Hello, Im looking for any suggestions on what to watch next. I have my “safe shows” I always end up going back to but I want something new and I’m struggling to find something. Most of the shows I watch are fantasy, horror, comedy, and drama. My biggest struggle is something I can watch for a while. For example I’ve watched supernatural (15 seasons) or vampire diaries (8 seasons) but all I can find that looks remotely interesting is only between 1-3 seasons with episodes that are like 20 minutes each. I prefer episodes anywhere from 40min to an hour. \n\nSide note: game of thrones is not really for me. I don’t think I could get past the first season but I might give it another shot. If anyone has any recommendations I would greatly appreciate it! \n\nI also enjoyed shows like bojack, Rick and Morty, and inside job so I’m no stranger to more of the cartoony stuff but a lot of the recent stuff I’ve seen just kind of seems boring or stupid. ",
        "upvotes": 7,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1nkn3b9/need_a_new_show/"
    },
    {
        "id": "1nkyaop",
        "author": "Electronic_Weather26",
        "title": "Adolescence",
        "content": "I heard a lot of good things about Adolescence. I tried watching Line Of Duty but couldn’t get into it but I loved Happy Valley. Crime Dramas were never really my thing but I decided to give this a try and OMG, I absolutely loved it! I have watched through the whole thing 3 times already and already like rereading scenes by reading a bit and then watching a bit more. It feels like the show has been out a lot longer than it actually has.\n\nMy favourite episode was the first one. I really love the process of how Jamie goes into the police station to getting the solicitor, doing the tests and then the investigation. It makes me want to commit a crime just so I can go through a similar process (don’t worry, I’m not actually planning on doing that, just a positive to how good the show sets it up)\n\nThe second episode at the school was fine enough, nice to see some of the students but I don’t find it particularly memorable.\n\nThe third episode also stood out to me as it really shows Jamie’s inner turmoil. Whether Briony was intentionally trying to provoke him or it just goes to show how aggressive Jamie can be and it could show how him murdering Katie can see the evil side of him. I can relate to a lot of his frustrations about being self-conscious and wanting reassurance.\n\nThe fourth episode I initially thought was the weakest but I think the weakest is now episode 2. I really like how it shows a bit more insight into the family and just how broken everything is. \n\nWhen I first watched it, I wished for a 5th episode to tie up some loose ends and see Jamie get sentenced but as I’ve watched it more, I think it does make sense to leave it where it was. The 4 episodes kind of show everything the viewer needs to know without showing or explaining everything.\n\nI would pray for a second series, even though that isn’t the intention. If there was, maybe some gaps to fill in or side stories. Like, maybe showing how Jamie was before the crime took place, any more advice from the solicitor, how Paul and Adam’s father son relationship is doing etc… \n\nI think I would rather see more shows like this rather than a second series entirely. Let the series remain as the legend it deserves to be! Well done, you’ve delivered a winner here! \n\nScore: 9.9/10",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nkyaop/adolescence/"
    },
    {
        "id": "1nkqzlc",
        "author": "michelob81",
        "title": "Beauty and the bester documentary",
        "content": "Just finished this show. Some serious corruption going on in South Africa!\nCould hardly believe people on the series were actually taking the side of that crazy woman. \"She must have been manipulated\"... \"She probably believed he was innocent\".  If I was talking to someone doing life in prison for murder and they told me they were innocent, I wouldn't immediately think \"Oh what a travesty! I should start stealing and burning bodies to help you escape\". Truth is, she enjoyed the thrill of it all. \nAs for him. The only sentence that would bring true justice would be death by fire. I don't mean firing squad, I mean blaze him up like a Doobie.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nkqzlc/beauty_and_the_bester_documentary/"
    },
    {
        "id": "1nk840d",
        "author": "Atlast_2091",
        "title": "The Diplomat: Season 3 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 17,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nk840d/the_diplomat_season_3_official_trailer_netflix/"
    },
    {
        "id": "1njlc22",
        "author": "ZaphodBeeb69",
        "title": "Does Netflix Just Not Care?",
        "content": "Netflix has some GREAT original series. Stranger Things, Ginnie and Georgia, F Is For Family, etc, but they take sooooo long to come out. The girl from Stranger things is a married woman with a child and still playing a teenager in the show. It's been on for over 10 years. WTF? It's become a meme at this point. There's no way the higher ups at Netflix aren't hearing the jokes. They're not course correcting or trying to give us more consistency. By the time any new season of anything comes out, I've forgotten what's already happened. I think they just straight up don't give a shit about their customer base. ",
        "upvotes": 450,
        "comments": 178,
        "media": null,
        "permalink": "/r/netflix/comments/1njlc22/does_netflix_just_not_care/"
    },
    {
        "id": "1nkgzee",
        "author": "Euphoric_Breakfast79",
        "title": "First reviews in for Alice in Borderland season 3",
        "content": "**Radio Times: (4/5)**  \n\"Alice in Borderland season 3 is close to perfect - but still offers more questions than answers\"  \n**GamesBraves: (7.5/10)**  \n\"Alice in Borderland Season 3 successfully maintains the tension, mystery, and emotional depth that made the series compelling while pushing its themes into more complex territory.\"  \n**Comic Book: (4/5)**  \n\"There’s a close attention to detail from the writing to the final product, and it all comes together in the best finale seen for a Netflix original in years. It’s just a success all around.\"  \n**HobbyConsolas: (75/100)**  \n**\"The games still pack the punch, with twists we sometimes don't see coming to create even more drama.\"**  \nUnlike the other cards, which were limited to one game, the Joker card has, as we've said, special rules. To summarize without giving too many details, a championship with several elimination rounds awaits those unfortunate enough to return to Borderland. And the \"eliminate\" part is going to be literal, you know...\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nkgzee/first_reviews_in_for_alice_in_borderland_season_3/"
    },
    {
        "id": "1nkox9v",
        "author": "TenPointsforListenin",
        "title": "Does The Residence get better?",
        "content": "My first episode impression was kind of negative. They code the protagonist as neurodivergent, kinda, but it's more for flavor- she likes talking about birds. Might as well be a hobbyist. The show goes to great lengths to say how great she is, but nobody tries harder to say how great they are than our protagonist.\n\nIt doesn't feel earned. She's snarky and unhelpful to everyone except one particular employee, who... is obviously involved in this, but there's not really much of a reason for why only the newly appointed first in command of housing gets a pass when nobody else does, even when they're trying to be helpful.\n\nThey compare her to other fictional detectives, including Benoit Blank from Knives Out, but Benoit Blank feels different than this- he makes no effort to promote himself, and is kind and civil on the outset, only really dropping the mask and giving his actual opinions on people towards the end of each case. I think there are better choices for this mystery than Cordelia explicitly because of how horrible she is at dealing with people.\n\nAlso the actress talks in a dry monotone without much body movement while everyone else is putting their heart and soul into this.\n\nIt's a bit rough to watch but I love this kind of thing- does it improve?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nkox9v/does_the_residence_get_better/"
    },
    {
        "id": "1nkow48",
        "author": "DraftCommercial8848",
        "title": "“Leaving soon” but reappears a day after it “leaves”",
        "content": "I know it’s probably so they can spike viewership before signing a contract extension but it’s pretty annoying/ weird. \n\nBrooklyn 99 was on “leaving soon” scheduled to be removed on the 17th. It has been less than 24 hours and it’s already back up.\n\nIt’s not problematic but it’s just annoying and a slightly shady business tactic.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nkow48/leaving_soon_but_reappears_a_day_after_it_leaves/"
    },
    {
        "id": "1nkg17n",
        "author": "_deepblack_",
        "title": "Haunted Hotel | First 9 Minutes Sneak Peek | Netflix",
        "content": "Keep with with the show at r/HauntedHotel \n\nHere's something to start your weekend off right: a sneak peek of HAUNTED HOTEL, a spooky new animated series from the guys behind Rick and Morty (out September 19). From creator Matt Roller (Rick &amp; Morty), Haunted Hotel follows a single mother of two who struggles to run a haunted hotel with the help of her estranged brother, who is now one of the ghosts haunting the hotel -- and thinks the other ghosts have some pretty good ideas. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nkg17n/haunted_hotel_first_9_minutes_sneak_peek_netflix/"
    },
    {
        "id": "1njze7s",
        "author": "CourseSpare7641",
        "title": "Here's every single vocab word from casa de papel s1 e1-2 ranked by frequency with translations so you can learn some Spanish",
        "content": "So the folks in r/languagelearning liked [my post where I pulled every word you need to understand season 1 episode 1 of Casa De Papel.](https://www.reddit.com/r/Spanish/comments/1nbk3nr/i_went_psycho_and_pulled_every_single_word_from/)\n\nSo I went ahead and pulled every single word used in Casa de Papel Episode 2 as well and ranked by frequency.\n\nOne note was that the formatting sucked.   \nSo this time it's formatted in a downloadable googlesheet for yall.  \nThis is basically the full vocab map for the episode.\n\nSo here you are 2,318words in all:  \n[**Casa De Papel S1 episode 1 &amp; 2 Vocab**](https://docs.google.com/spreadsheets/d/1rDu99z2WTp7okCns1bSa53IO93nzZzewKCuPpqOfX64/edit?usp=sharing)\n\n\n\n  \nBonus: I also found this interview with the cast + crew in Spanish, and ran it through my little site and turned the interview into interactive flashcards. [Here's a link to the interactive flashcard deck made with an interview with the cast.](https://vocablii.com/VideoDetails?videoId=68c290eed578bcae6990ce3b&amp;shareId=68ca52afc6706fe112657519)\n\n",
        "upvotes": 70,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1njze7s/heres_every_single_vocab_word_from_casa_de_papel/"
    },
    {
        "id": "1nky9za",
        "author": "LKS983",
        "title": "Netflix (or being able to watch/view Netflix) has gone downhill, ever since the 'new screen/version') was forced on everyone paying for Netflix.",
        "content": "Numerous posts have made it very clear that we all hate the new layout, and that we're having more problems since it was introduced - but Netflix doesn't care and continues with their latest (**appalling/seriously disliked**) version!\n\nEvery film/series I watch is added to 'Continue Watching' (even after I've watched the entirety of the film/series)- and it's **impossible** to delete them from 'Continue Watching'.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nky9za/netflix_or_being_able_to_watchview_netflix_has/"
    },
    {
        "id": "1nk8192",
        "author": "Professional-Gain-62",
        "title": "Who do I have to pay for more trash truck??",
        "content": "😭😭😭😭 need atleast two more seasons, a movie and a Easter +halloween special. Merch?? Toys??\n\nMax if you’re reading this I’ll settle for just about anything, thanks in advanced ❤️",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nk8192/who_do_i_have_to_pay_for_more_trash_truck/"
    },
    {
        "id": "1nkkadz",
        "author": "digsafe",
        "title": "Netflix color issue",
        "content": "Netflix has a weird color issue for me watching in Chrome on a MacBook. I’ve tried resetting but no joy. Anyone else having this problem? I went through tech support but the were useless. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nkkadz/netflix_color_issue/"
    },
    {
        "id": "1nk7h2m",
        "author": "TheNoodleSloth",
        "title": "Stranger Things Season 5: Vol 1,2 &amp;3?!?!",
        "content": "Yeah it only took them a decade to complete 5 seasons and now what is this 3 different release dates. I just rewatched the entire 4 seasons to refresh it but damn! Just release it already! Also how did El's hair grow so much so quickly lol The trailer looks amazing tho but I need the complete season right now! Ugh this is frustrating",
        "upvotes": 4,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1nk7h2m/stranger_things_season_5_vol_12_3/"
    },
    {
        "id": "1nk56pt",
        "author": "WolandPT",
        "title": "Just finished the French thriller 'La Mante' on Netflix... and I need to talk about how nonsensical it is.",
        "content": "ey everyone,\n\nMy cousin recommended this show to me, saying it was on par with *Mare of Easttown*. I binged all 6 episodes, and... wow, what a frustrating mess. I had to come here to see if I'm the only one who felt this way.\n\nThe concept is solid gold: a detective has to team up with his estranged mother, a famous serial killer known as \"The Mantis,\" to catch her copycat. It's got that classic *Silence of the Lambs* vibe, and I was completely on board.\n\nBut the execution is just painfully slow. It feels more like a boring soap opera than a thriller, with characters just talking endlessly while nothing happens. The plot is full of holes you could drive a truck through—the copycat's motivation makes zero sense, and there are entire subplots with red herring characters that are completely pointless and could be erased from the show entirely.\n\nI was so baffled by the writing that I wrote up a full, no-holds-barred review on my blog, **Freddy's Cine IT**. If you're interested in my full takedown, you can check it out.\n\nAlso, if you've seen it and were as confused as I was, the post has a **complete episode-by-episode explanation** to try and make sense of the convoluted plot. I'll drop the link in the comments.\n\nWould love to hear if anyone else felt this way or if you actually enjoyed it!",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nk56pt/just_finished_the_french_thriller_la_mante_on/"
    },
    {
        "id": "1nkhtam",
        "author": "jujustu_yuno",
        "title": "My life with the Walter boys S2 is so stupid",
        "content": "I just finished watching season 2 And I am so pissed right now..\n I mean I was happy that Jackie building something with Alex.. okay whatever call me a team Alex ... I like Alex .. he's nice , super cute and handsome and he's actually in love with Jackie... But b*** wtf???? Why she has to go back and forth with Alex and Cole? Like pick one dude... And stop hurting other ... I think Jackie is so selfish... Yes she lost her parents...and everything...but that doesn't mean you get confused between TWO BROTHERS AND RUIN THEIR RELATIONSHIP... \n\nGod they it looks like same misales from season 1 Jackie never learn from her mistakes ..does she???",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nkhtam/my_life_with_the_walter_boys_s2_is_so_stupid/"
    },
    {
        "id": "1nkgn07",
        "author": "RothStonk",
        "title": "Stranger Things House Listed for $350,000 Outside Atlanta",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nkgn07/stranger_things_house_listed_for_350000_outside/"
    },
    {
        "id": "1nk6pxi",
        "author": "Jakethedane1972",
        "title": "Too many downloads",
        "content": "Hello!\n\nI have had my current account for several years and never experienced any issues at all. I am going sesh for business for a few days, and am looking to download a few episodes of NH favourite show. \n\nBut Netflix tells me I have too many downloads on my devices, even though I just checked all of them, and there are literally nothing. Wife and kids each have their own profile, and they don't have anything on them. \n\nWhen I address this to netflix, I get an automated reply saying I need to check my downloads, yeah right, or get another subscription.\n\nAny tips?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nk6pxi/too_many_downloads/"
    }
]