[
    {
        "id": "1j2jmou",
        "author": "theatlantic",
        "title": "Hi! We’re Shirley Li and David Sims, staff writers at The Atlantic, where we cover culture and Hollywood. We watched the Oscars last night to see which events at the awards show can tell us about the future of the industry—and whether any films snagged an upset. Ask us anything!",
        "content": "",
        "upvotes": 142,
        "comments": 265,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p30kmcwmghme1.jpeg?auto=webp&amp;s=137db712ab8b507063c04ac21a1101312b0186c5"
        },
        "permalink": "/r/movies/comments/1j2jmou/hi_were_shirley_li_and_david_sims_staff_writers/"
    },
    {
        "id": "1j2xbfx",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Tuesday 3/4 at 3:00 PM ET for a live AMA/Q&amp;A with Cutter Hodierne, the writer-director of heist-thriller 'Cold Wallet' - A team of Redditors lose everything after a cryptocurrency scam. This leads them to plot to kidnap the \"financial influencer\" who screwed them over.",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/77sgf2uwbkme1.jpeg?auto=webp&amp;s=51c4340007fcece02a30ed64ba872d25ff56a79a"
        },
        "permalink": "/r/movies/comments/1j2xbfx/join_us_tomorrow_tuesday_34_at_300_pm_et_for_a/"
    },
    {
        "id": "1j2r7x7",
        "author": "Stormy8888",
        "title": "'Ne Zha 2' Surpasses $2-Billion Mark, Becomes First Animated Film to Do So",
        "content": "",
        "upvotes": 3636,
        "comments": 855,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IjAGJh05sPtqfnedgChrrOo6w46DP65mE09nq9gu9Ss.jpg?auto=webp&amp;s=6a13440317bd685cb54a7b487f1065008b31015c"
        },
        "permalink": "/r/movies/comments/1j2r7x7/ne_zha_2_surpasses_2billion_mark_becomes_first/"
    },
    {
        "id": "1j2oiw7",
        "author": "Both_Sherbert3394",
        "title": "'School of Rock' aged shockingly well for an early 2000's comedy",
        "content": "I rewatched this not that long ago, and even though I know it's pretty standard to watch comedies from this era and see a lot of things that are like 'wow that didn't age well' (even if it's still an otherwise funny movie), but rewatching this, I was surprised at how the overall messaging and way it depicts these characters felt a lot more fair and interesting than a lot of other films from that era.\n\nParticularly, the scene where Jack Black takes the principal out to get drinks and we see a totally different side of her, as well as when we see the barrage of parents harassing her and suddenly we totally get a sense of how this kind of pressure could lead to someone becoming like this. I feel like the trope of 'the stuffy old mean teacher lady' has been a comedy thing for about as long as there have been movies set in schools, but this one just flips it on its head in a way that really stood out to me.\n\nIt also does a really good job at avoiding the overly cartoony cliche ending of \"oh, but look what they learned! it's totally fine!\" I mean, yes, it does that somewhat with the very ending over the credits, but the parents are still very rightfully furious that this random stranger has been with their kids, and the movie treats it more like how I expect people would react to it in real life. It's a tiny thing, but just giving these elements (such as the principal or the parents reactions) a little more believability and less cartoonish one dimensionality really adds to it.\n\nI'm also glad they never did a sequel, because there's absolutely no reason to, although now that I've said that I'm assuming we'll see a headline that it's been greenlit within the next two days.",
        "upvotes": 4604,
        "comments": 411,
        "media": null,
        "permalink": "/r/movies/comments/1j2oiw7/school_of_rock_aged_shockingly_well_for_an_early/"
    },
    {
        "id": "1j2tqie",
        "author": "pantherfanalex",
        "title": "Elijah Wood explaining why, if he could remove ANY one movie from cinema history, it would be Tim Burton's \"Charlie and the Chocolate Factory\" (timestamp 45:00)",
        "content": "",
        "upvotes": 1025,
        "comments": 172,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x_zNtenqDVRpZd54XzHU1zQaFtjaR4jay_wRsfWN8m4.jpg?auto=webp&amp;s=5e7cdef867f48de0bbb3faac8be3e31ec1ad0e1d"
        },
        "permalink": "/r/movies/comments/1j2tqie/elijah_wood_explaining_why_if_he_could_remove_any/"
    },
    {
        "id": "1j2h08o",
        "author": "NikNola2020",
        "title": "Juno is totally different as an adult",
        "content": "I recently watched Juno for the first time since I was about 13 or 14. I was in junior high I believe when the movie first released, and seeing it as an adult really blew my mind. The creators somehow perfectly captured the awkward and intense feelings of not being a kid, but not quite an adult yet either. \n\nFirst note, Mark was a massive creep and weirdo. Kissing a teenage girl when you’re an adult is creepy and gross all on its own. Then you throw in that SHE WAS CARRYING THEIR ADOPTIVE CHILD. What the actual fuck! What a disgusting pathetic man. Watching the scene when he took Juno to the basement to show her the comic of a pregnant super hero was so disgusting. Their relationship in general was coming off very grooming, then he was seducing a pregnant 16 year old girl who was extremely vulnerable. In my young teenage mind, I thought Vanessa was such a wet blanket, suppressing his creative side and making him and Juno both feel like losers. In reality, she was a saint who should have kicked him to the curb way sooner. He deserved no grace. I cannot imagine my partner not only cheating on me, but cheating with a teenager. And not just a teenager, a pregnant teenager who is carrying my adoptive son. Vanessa was such a great person and didn’t deserve anything that pathetic excuse of a man put her through. \n\nSecond note, Juno(and company) is extremely immature and the creators did a great job of showcasing it. I love her quirkiness, but the way she did not understand why it was inappropriate to be popping up at Mark and Vanessa’s house was very telling. There are two sides to that coin, because she may have known it was inappropriate but was too young and naive to see the long term outcome of the situation. She definitely didn’t understand why a man of his age shouldn’t be chumming it up with her. In fact, she seemed to enjoy the fact that he was even giving her attention at all. It helped that he liked the same things, so in her mind it was confirming she was cool. It just shows exactly how immature she was, unable to look past your own bubble to see the rest of your life. \n\nOn another note, it was implied that she and Bleaker were way better friends than what we saw in the movie. It seemed that they were hanging out everyday, had all the same interests and hobbies. But, when Juno came up pregnant Bleaker fell off the map. He never seemed pressed when she would stop and say hey, but he did absolutely nothing to try and help her in the situation. He also didn’t understand why it hurt her so much he was taking someone else to a dance. At that point in the plot, we really got to see how the normally confident and abrasive Juno was becoming self conscious and confused by the weight of her feelings. Highlighting how juvenile everyone was, while dealing with such a serious situation was just top tier writing. The whole movie did such a great job of capturing exactly how it feels to be 16. Too old for childhood, but nowhere near an adult yet. Even though every single 16 year old in the world thinks they’re an adult. It takes growing up to realize exactly how childish you still are at that age. \n\nI do think it’s worth mentioning how great of parents her dad and Bren were. Bren was her step mom and they didn’t seem particularly close, but she didn’t hesitate when it came to Juno. Of the jump, she was getting her to a doctor, coming to her defense when needed, and making sure she had everything she needed. And her father, who was obviously uncomfortable with emotional bridges with his teenaged daughter, made sure she knew she was loved. The scene of her in hospital after giving birth brought tears to my eyes. \n\nAs a whole, the movie is great. I’m not sure what category you could out this movie in, but they somehow captured a vibe of nostalgia I didn’t know I was missing. And just to bring it in again, we should all beat Marks ass if we ever happened to see his character out in the real world. \n\n*Edit Note: \n\npeople are being gross about Elliot Page being in the movie. Elliot is an amazing actor and their gender at any point in their life has absolutely NOTHING to do with the character of Juno. I’m referring to Juno as she/her, not Elliot. You’re weird if you care about someone else’s gender enough to be a dick about it. No one cares what you think. Elliot is happy and that’s all that’s important. Keep your weird ass comments to yourself if you’ve got something nasty to say. You’re the weird one if you can’t just simply respect what a person wants for their own autonomy. We support LGBTQ+ on this post! ",
        "upvotes": 4412,
        "comments": 407,
        "media": null,
        "permalink": "/r/movies/comments/1j2h08o/juno_is_totally_different_as_an_adult/"
    },
    {
        "id": "1j2nu6c",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for A24's 'Death of a Unicorn'",
        "content": "",
        "upvotes": 835,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m2n4eo8zcime1.png?auto=webp&amp;s=0798f06a4581a393dbaaf8a2e35275b68630a5cd"
        },
        "permalink": "/r/movies/comments/1j2nu6c/new_poster_for_a24s_death_of_a_unicorn/"
    },
    {
        "id": "1j29pq0",
        "author": "MarvelsGrantMan136",
        "title": "2025 Oscar Winners: 'Anora' Wins Best Picture &amp; Director; Adrien Brody, Mikey Madison, Kieran Culkin, &amp; Zoe Saldaña Win Acting Awards (Full Winners List)",
        "content": "",
        "upvotes": 13662,
        "comments": 3648,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q4loOQf3crB6dcmKhBngvBwKzG2fqxP5Tb9y-ivBcek.jpg?auto=webp&amp;s=92b7926fc390d559487c5a070d911d73208c1e14"
        },
        "permalink": "/r/movies/comments/1j29pq0/2025_oscar_winners_anora_wins_best_picture/"
    },
    {
        "id": "1j2wfk8",
        "author": "Puzzled-Tap8042",
        "title": "Oscars Explore New TV Home After ABC Exclusive Negotiating Window Ends",
        "content": "",
        "upvotes": 108,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dpiulg54iZinRH9x8rTwdWHw420S7tpr78TfReGEXRg.jpg?auto=webp&amp;s=74d6dbaf5f0161f6b94a10fb2a52d3ac3abe438c"
        },
        "permalink": "/r/movies/comments/1j2wfk8/oscars_explore_new_tv_home_after_abc_exclusive/"
    },
    {
        "id": "1j2rb6s",
        "author": "NoCulture3505",
        "title": "Disney Hires Former Warner Bros. Executive Andrew Cripps as Head of Theatrical Distribution",
        "content": "",
        "upvotes": 161,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fgmv6nbgRlM0IwJF8N6MxUsH0jp3v2rTeXgw1JLZf2U.jpg?auto=webp&amp;s=f0c04dd3825c24fafd70546e87919ea53a54fff5"
        },
        "permalink": "/r/movies/comments/1j2rb6s/disney_hires_former_warner_bros_executive_andrew/"
    },
    {
        "id": "1j2qxmk",
        "author": "LazerDude99",
        "title": "Would you rather be trapped in Groundhog Day or the Truman show?",
        "content": "I was having a discussion with some coworkers today about this and it’s actually kind of interesting \n\nBecause on the one hand in the Truman show you’re living in the world where everything around you is fake nothing in your life is real but every day there’s new adventures and new things happening and unlike Truman, you might not even figure out that everything is fake so to you, life would be normal, but you would still feel an unease, because people would act very strange around you. It’s possible you would figure it out and make an escape but it’s also possible that wouldn’t happen.\n\nOn the other hand in Groundhog Day, it’s really the opposite because in the Truman show everyone else knows what’s happening and you don’t but in Groundhog Day, you’re the only one who knows that the day is repeating over and over again, you’re the only one that can comprehend what is really happening in a lot of ways you’re the only one who is real, and there would be benefits as Bill Murray’s character found out you could live every day and have no consequences life would have limited things that you could do and you would live in a world where no new things would come into existence, you couldn’t have any real meaningful relationship, I guess if you’re already married or dating your partner would just relive the day with you but conversation would never blossom, and you would eventually know what everybody is going to say…\n\nThe other problem is that you might never figure out the perfect day to end the loop\n\n\nBoth scenarios there’s a possibility of escape but neither is a guarantee…\n\nSo if you have the choice, which one would you choose?\n",
        "upvotes": 170,
        "comments": 278,
        "media": null,
        "permalink": "/r/movies/comments/1j2qxmk/would_you_rather_be_trapped_in_groundhog_day_or/"
    },
    {
        "id": "1j28v96",
        "author": "twinbloodtalons",
        "title": "Conan O' Brien's Monologue To Open The 97th Oscars",
        "content": "",
        "upvotes": 3269,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RBFwPRZCm-OxsrBkIJSAhj_MIr3QqZX2V4seyiadzqc.jpg?auto=webp&amp;s=c2d575213332d7363fcb11ec479a455d333b03d6"
        },
        "permalink": "/r/movies/comments/1j28v96/conan_o_briens_monologue_to_open_the_97th_oscars/"
    },
    {
        "id": "1j2jw2d",
        "author": "CrusherWillis",
        "title": "Will Conclave bring back the PG rated adult drama?",
        "content": "In recent years, the PG rating has been reserved almost exclusively for family fare from animation to faith based pictures. But now, Conclave has become a critical and financial success as a PG rated drama for grown ups, a genre which has seen few hits since the dawn of the PG13 rating. So will Conclave be the start of a new generation of films like Out of Africa and Driving Miss Daisy (PG rated Oscar winning dramas from the post PG13 era) or is it just an outlier?",
        "upvotes": 358,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1j2jw2d/will_conclave_bring_back_the_pg_rated_adult_drama/"
    },
    {
        "id": "1j2ne17",
        "author": "eggflip1020",
        "title": "Prisoners (2013) Who the hell was David Dasmalchian?",
        "content": "Spoilers for a 15 year old movie. I understand that Melissa Leo was the abductor and that Paul Dano was a freak and a weirdo but he kind of didn’t do anything, but who the hell was David Dasmalchian? He was like the random weirdo in the movie, went to the department store and was buying kids clothes, then he gets arrested and managed to shoot himself. What the hell was his involvement, if any? I still don’t get that. \n\nI know it’s the Oscars hangover today, but this occurred to me and I still have no idea who the hell he was. ",
        "upvotes": 215,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1j2ne17/prisoners_2013_who_the_hell_was_david_dasmalchian/"
    },
    {
        "id": "1j2h3xw",
        "author": "MaxProwes",
        "title": "I rewatched Escape From LA (1996) and honestly shocked how well it aged despite some dodgy CGI, John Carpenter was always ahead of the curve and people appreciate it only years later",
        "content": "",
        "upvotes": 508,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sx4vD0KE03NgyIg_kT141LaGLK5IBMr1chf6pat_H38.jpg?auto=webp&amp;s=2121c80141b5ca7ef103a91f1da9fab45ae46b53"
        },
        "permalink": "/r/movies/comments/1j2h3xw/i_rewatched_escape_from_la_1996_and_honestly/"
    },
    {
        "id": "1j2xkk8",
        "author": "chrisscan456",
        "title": "Is Cocktail (1988) “so bad, it’s good” or just bad?",
        "content": "I personally love the movie but it is very flawed. Unlikable hero, poorly paced, bad dialogue, etc. Where I go back and forth on is if these flaws throw the movie into the guilty pleasure category or is it objectively bad and liking it means you have poor tastes? Cruise himself has said it's it his crowning jewel. ",
        "upvotes": 41,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1j2xkk8/is_cocktail_1988_so_bad_its_good_or_just_bad/"
    },
    {
        "id": "1j2to1a",
        "author": "supercavemanindeed",
        "title": "What’s the best sneaking sequence of all time?",
        "content": "Not action. Sneaking. I suppose any kind of spy movie or thriller of some sort. I just wonder what movie has the most suspenseful and engaging sneaking sequence of all time. People often talk about best car chase or best fight but what about just sneaking around? Who was the best ninja? Thanks in advance. ",
        "upvotes": 38,
        "comments": 169,
        "media": null,
        "permalink": "/r/movies/comments/1j2to1a/whats_the_best_sneaking_sequence_of_all_time/"
    },
    {
        "id": "1j254r1",
        "author": "LiteraryBoner",
        "title": "Official Oscars Thread 2025",
        "content": "Welcome to the r/movies Official Oscar Thread. Some notes about tonight!\n\n- All Oscar related content posted to r/movies will be condensed to this thread.\n\n- This thread will be sorted by New, refresh often so you can see the most recent comments and join the conversation!\n\n- There will be a post Oscar discussion thread as well posted soon after the ceremony closes.\n\n---\n\n**Best Picture**\n\n- **Anora**\n\n- The Brutalist\n\n- A Complete Unknown\n\n- Conclave\n\n- Dune: Part Two\n\n- Emilia Perez\n\n- I'm Still Here\n\n- Nickel Boys\n\n- The Substance\n\n- Wicked\n\n**Best Actor in a Leading Role**\n\n- **Adrien Brody in The Brutalist**\n\n- Timothee Chalamet in A Complete Unknown\n\n- Colamn Domingo in Sing Sing\n\n- Ralph Fiennes in Conclave\n\n- Sebastian Stan in The Apprentice\n\n**Best Actress in a Leading Role**\n\n- Cynthia Erivo in Wicked\n\n- Karla Sofia Gascon in Emilia Perez\n\n- **Mikey Madison in Anora**\n\n- Demi Moore in The Substance\n\n- Fernanda Torres in I'm Still Here\n\n**Best Supporting Actor**\n\n- Yura Borisov in Anora\n\n- **Kieran Culkin in A Real Pain**\n\n- Edward Norton in A Complete Unknown\n\n- Guy Pearce in The Bruatlist\n\n- Jeremy Strong in The Apprentice\n\n**Best Actress in a Supporting Role**\n\n- Monica Barbaro in A Complete Unknown\n\n- Ariana Grande in Wicked\n\n- Felicity Jones in The Brutalist\n\n- Isabella Rossellini in Conclave\n\n- **Zoe Saldana in Emilia Perez**\n\n**Best Animated Feature**\n\n- **Flow**\n\n- Inside Out 2\n\n- Memoir of a Snail\n\n- Wallace &amp; Gromit: Vengeance Most Fowl\n\n- The Wild Robot\n\n**Best Cinematography**\n\n- **The Brutalist**\n\n- Dune: Part Two\n\n- Emilia Perez\n\n- Maria\n\n- Nosferatu\n\n**Best Directing**\n\n- **Sean Baker, Anora**\n\n- Brady Corbet, The Brutalist\n\n- James Mangold, A Complete Unknown\n\n- Jacques Audiard, Emilia Perez\n\n- Coralie Fargeat, The Substance\n\n**Best Original Score**\n\n- **The Brutalist**\n\n- Conclave\n\n- Emilia Perez\n\n- Wicked\n\n- The Wild Robot\n\n**Best Foreign Language Film**\n\n- **I'm Still Here, Brazil**\n\n- The Girl with the Needle, Denmark\n\n- Emilia Perez, France\n\n- The Seed of the Sacred Fig, Germany\n\n- Flow, Latvia\n\n\n**Best Original Screenplay**\n\n- **Anora**\n\n- The Brutalist\n\n- A Real Pain\n\n- September 5\n\n- The Substance\n\n**Best Adapted Screenplay**\n\n- A Complete Unknown\n\n- **Conclave**\n\n- Emilia Perez\n\n- Nickel Boys\n\n- Sing Sing\n\n---\n\n[Here is a full list of nominees. ](https://www.oscars.org/oscars/ceremonies/2025)\n\nThe ceremony is at 7:00pm EST on ABC",
        "upvotes": 1770,
        "comments": 18119,
        "media": null,
        "permalink": "/r/movies/comments/1j254r1/official_oscars_thread_2025/"
    },
    {
        "id": "1j2aec8",
        "author": "RegularGuyy",
        "title": "How would you rank the Oscar best picture winners from the past 10 years?",
        "content": "These are the winners of best picture from the past 10 years. How would you rank these movies from 1-10 from best to worst?\n\nAlternate question: if these 10 movies were all released in 2024, which one do you think would have won the Academy Award for best picture? \n\n2024: Anora \n\n2023: Oppenheimer\n\n2022: Everything Everywhere All at Once\n\n2021: CODA\n\n2020: Nomadland\n\n2019: Parasite\n\n2018: Green Book\n\n2017: The Shape of Water\n\n2016: Moonlight\n\n2015: Spotlight\n\n2014: Birdman",
        "upvotes": 758,
        "comments": 903,
        "media": null,
        "permalink": "/r/movies/comments/1j2aec8/how_would_you_rank_the_oscar_best_picture_winners/"
    },
    {
        "id": "1j29w5l",
        "author": "LiteraryBoner",
        "title": "2025 Oscars Post Game Thread",
        "content": "Feel free to discuss the Oscars in hindsight here! Some surprises but many well deserved wins!\n\n# We love da movies! ",
        "upvotes": 741,
        "comments": 1124,
        "media": null,
        "permalink": "/r/movies/comments/1j29w5l/2025_oscars_post_game_thread/"
    },
    {
        "id": "1j2lzgf",
        "author": "Comic_Book_Reader",
        "title": "The Woman In The Yard | Official Trailer 2",
        "content": "",
        "upvotes": 80,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0FYmf9_elr6jWN8vjuddYENyFusV-wl29I8sUcWPKrs.jpg?auto=webp&amp;s=1a43e5983949966657b16fe24c4176078c11acfb"
        },
        "permalink": "/r/movies/comments/1j2lzgf/the_woman_in_the_yard_official_trailer_2/"
    },
    {
        "id": "1j2rdt8",
        "author": "Upbeat-Sir-2288",
        "title": "Robert Pattinson &amp; Bong Joon-Ho Talk Mickey 17, Future Roles &amp; Guilty Pleasures",
        "content": "",
        "upvotes": 32,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S11rZbBeS-h8sfs-I6m8twzlyXdo9k7v-tlLfTuD0SU.jpg?auto=webp&amp;s=d42d29f227e98611ce87c916ad160d87c1e712e8"
        },
        "permalink": "/r/movies/comments/1j2rdt8/robert_pattinson_bong_joonho_talk_mickey_17/"
    },
    {
        "id": "1j1txhm",
        "author": "Icy_Smoke_733",
        "title": "The Highest-Earning Actors Of 2024 - The Rock Tops the List with $88M, Followed by Ryan Reynolds ($85M), Kevin Hart ($81M), Jerry Seinfeld ($60M), And Hugh Jackman ($50M) - Including all earnings, film salaries, &amp; other forms of income.",
        "content": "",
        "upvotes": 6321,
        "comments": 1187,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nMtZd62ygfqdkt6mXMPXtTovwCJqPrgqGaqY51z7bl0.jpg?auto=webp&amp;s=07f9e3030089ae8d8c9232d063837766a4ef33d1"
        },
        "permalink": "/r/movies/comments/1j1txhm/the_highestearning_actors_of_2024_the_rock_tops/"
    },
    {
        "id": "1j2fduq",
        "author": "GlobexCoporationMD",
        "title": "UK Oscars coverage - a studio of irrelevant party poopers.",
        "content": "I know Johnathan Ross used to present Film on BBC, but he looked like he could barely keep his eyes open mid-way through the show, his jokes were unfunny and all very mean spirited. Mariella Frostrup seemed to role her eyes savagely at anything she deemed unworthy, pointless or less noble than her own favourites. Jason Isaacs admitted he couldn't stand awards ceremonies. The only person seemingly happy to be there and offering some genuine thought behind her opinions was Elle Osili-Wood. \n\nIt was infuriating having to keep switching back to a studio full of grumpy whingers about what they didn't like. I would rather have just had ad breaks! Just don't put smug, highly critical old-farts together when trying to appeal to an awards show audience. ",
        "upvotes": 199,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1j2fduq/uk_oscars_coverage_a_studio_of_irrelevant_party/"
    },
    {
        "id": "1j2szt9",
        "author": "mcurotto",
        "title": "Op-Ed from Steven Soderbergh’s brother on the biggest “Best Actress” upset in history",
        "content": "Steven Soderbergh’s brother writes about the time Steven made him watch three movies, one of which ended up taking the award for Best Actress in 1951. It’s an interesting article. And fun to learn that Soderbergh was such a fan of old films as a kid (not surprising, of course). Regarding the Best Actress upset—Do you agree? Does this trump the convo about last night’s upset? Love that he brings it back to 1951 , putting the Anora/Substance upset into context. ",
        "upvotes": 29,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8cqfR-Ymb5fHbWALO6r3NQTI_L4RiuxIm_ZNdh2YJfk.jpg?auto=webp&amp;s=0e3b7c45803de257483d13316b52bdaafa550c85"
        },
        "permalink": "/r/movies/comments/1j2szt9/oped_from_steven_soderberghs_brother_on_the/"
    },
    {
        "id": "1j20cxb",
        "author": "JannTosh50",
        "title": "The Sound of Music at 60: a flawed but enduring cultural touchpoint",
        "content": "",
        "upvotes": 2140,
        "comments": 427,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dE4b6L6SY8Fi5v5_zvxDskJJ12u6b24eTYlUW-4-hEU.jpg?auto=webp&amp;s=634a7deaa49d62b57cdf882a685606abfa1bde6e"
        },
        "permalink": "/r/movies/comments/1j20cxb/the_sound_of_music_at_60_a_flawed_but_enduring/"
    },
    {
        "id": "1j2xc5d",
        "author": "mrjohnnymac18",
        "title": "James McAvoy Talks Directorial Debut 'California Schemin'",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kcF4OyhJTmBwpLX8cOOpHgLGsd7vuRrUDmIwTM9_i74.jpg?auto=webp&amp;s=7794d9a19bf9be7773a95b43f8f73a6741acbc19"
        },
        "permalink": "/r/movies/comments/1j2xc5d/james_mcavoy_talks_directorial_debut_california/"
    },
    {
        "id": "1j2dhex",
        "author": "matt73132",
        "title": "Does anyone think the movie The Burbs was one of the most unique and oddly fascinating comedies ever made?",
        "content": "It has an endearing quality to it. After you've watched it one time, you don't think that much about it, but then it grows on you like a fungus. It reminds me of hanging out with everyone in my neighborhood when I was a kid. It was such an original idea for a comedy (you could also say it was a semi-dark comedy) and there hasn't been anything quite like it since.",
        "upvotes": 200,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1j2dhex/does_anyone_think_the_movie_the_burbs_was_one_of/"
    },
    {
        "id": "1j2yrgi",
        "author": "elevenatexi",
        "title": "What is the best club scene from a movie?",
        "content": "Many movies have a scene or two that take place in a club or where the protagonists are meeting  someone and adjourn to a back room or are being  chased thru as part of an action sequence.\n\nI am wanting to know which movies have the very best of these scenes. Where the music and the lights are on point, the architecture and mood are captivating, and the crowd is lively and attractive.\n\n\n\n\n\n",
        "upvotes": 7,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1j2yrgi/what_is_the_best_club_scene_from_a_movie/"
    },
    {
        "id": "1j2tcmd",
        "author": "LunchyPete",
        "title": "Phoebe Waller-Bridge to Narrate and Produce ‘Octopus!’ Two-Part Documentary for Amazon Prime Video",
        "content": "",
        "upvotes": 16,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xbzbP-_5mVIQPYtbb3l14aEoZRbAVtjI7c33p6MP_Ko.jpg?auto=webp&amp;s=713c412c21c27c4ca3e1be4f0ef1eed345b0594c"
        },
        "permalink": "/r/movies/comments/1j2tcmd/phoebe_wallerbridge_to_narrate_and_produce/"
    },
    {
        "id": "1j2hojp",
        "author": "processocivil42",
        "title": "Give I’m Still Here a chance",
        "content": "Now that the awards season is over, there’s something I’d like to vent about. While most of the discussion surrounding the Oscar-nominated movies revolved around the likes of Anora, The Brutalist, Conclave, and Emilia Perez, I couldn’t help but notice that I’m Still Here was overlooked by most moviegoers. For instance, Fernanda Torres, the lead actress of I’m Still Here, delivered a performance that was every bit as Oscar-caliber as anyone else’s. However, in the outcry over Mikey Madison’s victory, I struggled to see anyone mentioning her in the Oscar’s threads as a potential contender, especially compared to Demi Moore, who many people thought deserved the award (though Fernanda was my first choice).\n\nThe reason for this is simple: not many people bothered to watch I’m Still Here in the first place. And I’d like to encourage you to do just that. I’m biased, of course, as a Brazilian, but I’m Still Here tells a unique story (that of Eunice Paiva and her family) in a very special way (kudos to Walter Salles, who is a national treasure). I have yet to meet anyone—Brazilian or not—who watched the movie and didn’t like it. So, please, give it a chance! You won’t be disappointed.\n\nBTW, I’m not saying that I’m Still Here didn’t get any recognition at all. I read a couple of articles (NYT, for example) in which it was mentioned as a frontrunner for the Best Actress award. Furthermore, it won Brazil’s first Oscar with its Best International Feature award victory, and first Golden Globe with Fernanda Torres’ victory. I just felt, from what I could read here on Reddit and other social media platforms, that not many people were talking about it as much as I felt it deserved, given its quality vis-à-vis the other nominees.",
        "upvotes": 57,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1j2hojp/give_im_still_here_a_chance/"
    },
    {
        "id": "1j2qkfz",
        "author": "Cinenamorado",
        "title": "Do you ever give up on a film in its first act/half?",
        "content": "There are two movies I tried to watch this week but I couldn't continue watching.\n\n\"The Inheritance\" by Mauro Bolognini but the only version I saw was a badly dubbed movie and I couldn't take Dominique Sanda seriously with her dubbed voice sounding like Katy Caterpillar. \n\n\"The Passion of Darkly Noon\". I love Phillip Ridley, he brings such a  eerie, dark atmosphere into his directing style and I adored \"The Reflecting Skin\", but the acting in the first act is so bad. Stilted and wooden, it took me out. Ashley Judd is introduced in jeans and a tank top. I mean, c'mon. It has a 44% rating on Rotten Tomatoes. \n\n\nIngrid Bergman once said if she's not liking a movie by the first 30 minutes, she quits on it, because she didn't want to waste her time in a movie she's not liking. If it's good enough for Ingrid Bergman, it's good enough for me.",
        "upvotes": 15,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1j2qkfz/do_you_ever_give_up_on_a_film_in_its_first_acthalf/"
    }
]