[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1rffzbp",
        "author": "Ok_Departure4795",
        "title": "Com'è questa parte di Parella?",
        "content": "",
        "upvotes": 16,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jv6jw3j1gvlg1.png?auto=webp&amp;s=fcae304fe1f4ffe328640c20bc8b601fec93fe20"
        },
        "permalink": "/r/torino/comments/1rffzbp/comè_questa_parte_di_parella/"
    },
    {
        "id": "1rfk486",
        "author": "DPPenjoyer18",
        "title": "Com’è questa parte di Moncalieri?",
        "content": "",
        "upvotes": 10,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/urolm6oo6wlg1.jpeg?auto=webp&amp;s=cee54d94c0e8cc19aa5bc31d4c31d18a67b6c730"
        },
        "permalink": "/r/torino/comments/1rfk486/comè_questa_parte_di_moncalieri/"
    },
    {
        "id": "1rf5sch",
        "author": "Witty_Nar",
        "title": "Il Festival via da Sanremo? Torino sarebbe davvero pronta?",
        "content": "Ho appena letto che si sta parlando seriamente di spostare il grande Festival della musica italiana proprio qui a **Torino**. Dopo l'Eurovision, sembra che la nostra città sia diventata la meta preferita per i grandi eventi musicali.\n\nSinceramente mi è venuto qualche dubbio e volevo sapere che ne pensate voi:\n\n* Vi piacerebbe vedere Torino come \"nuova casa\" della musica o pensate che il fascino di Sanremo sia insostituibile? \n* Secondo voi la città riuscirebbe a gestire il caos e il traffico di una settimana intera di Festival?\n* Quale location vedreste meglio? Il PalaOlimpico come per l'Eurovision o qualcosa di più storico?\n\nIo sono diviso tra l'entusiasmo di vedere la città protagonista e il timore che diventi tutto un grande ingorgo. 😅\n\nVoi da che parte state? Favorevoli o contrari al trasloco?",
        "upvotes": 53,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7e8xc1uz5tlg1.png?auto=webp&amp;s=5436e15a993fdca719ded392eb457638e27d6c70"
        },
        "permalink": "/r/torino/comments/1rf5sch/il_festival_via_da_sanremo_torino_sarebbe_davvero/"
    },
    {
        "id": "1rfcxw3",
        "author": "Purple_CEO",
        "title": "Citofono e acufene",
        "content": "Vivo nell'appartamento al 19 della via. Il 21 (Quello adiacente) ha il citofono rotto che fischia in continuazione. è come se avessi l'acufene, lo sento tutto il giorno, anche con porte e finestre chiuse. Sono andato vicino per vederlo e porca troia se è fastidioso per i timpani. Da vicino viene proprio dolore alle orecchie.\n\n  \nC'è qualcosa che possa fare? Si può chiamare la polizia per un qualcosa del genere? O magari mettere un cartello sulla porta per farlo smettere, non ne ho idea.\n\nA volte cambia pure pitch il suono, diventando più acuto. Non ce la faccio più- ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1rfcxw3/citofono_e_acufene/"
    },
    {
        "id": "1rf3d47",
        "author": "mattgwa",
        "title": "Calendario concerti gratuiti al Conservatorio di Torino",
        "content": "👋 Ciao!\n\nQuesto è il calendario dei concerti gratuiti di musica classica al Conservatorio Giuseppe Verdi, in via Giuseppe Mazzini 11.\n\nA questo link potete prenotare anche i biglietti.\n\n[https://eventi.conservatoriotorino.eu/](https://eventi.conservatoriotorino.eu/)",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1rf3d47/calendario_concerti_gratuiti_al_conservatorio_di/"
    },
    {
        "id": "1rf84yd",
        "author": "alessiojean93",
        "title": "Dove poter dormire a basso prezzo?",
        "content": "Ciao a tutti!\n\n  \nPremetto che ho già cercato nel sub se ci fossero post molto simili al mio, e ammetto di aver trovato qualcosina... non esattamente \"in linea\" con ciò che è stato chiesto quindi eccomi qui.\n\n  \nPer varie ragioni avrò bisogno di sostare anche per tempi brevissimi (potrebbero essere anche solo 1-2 giorni, ma non lo posso sapere in anticipo) nella vostra magnifica città e sono in cerca di qualche soluzione molto basic in cui poter aver un letto e un bagno privato senza troppe pretese visto che starei tutto il tempo in giro. \n\n  \nDai post presenti nel sub ho letto più volte una certa \"pensione Kitty\", che come qualità prezzo parrebbe top, ma da quelle poche informazioni che ho trovato su Google pare che i bagni di questa struttura siano condivisi. Qualora foste a conoscenza di realtà simili, vi sarei grato se me ne indicaste qualcuna così poi da poter continuare le mie ricerche in autonomia.\n\n  \nGrazie mille in anticipo!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rf84yd/dove_poter_dormire_a_basso_prezzo/"
    },
    {
        "id": "1rfckw3",
        "author": "Giadatempo",
        "title": "finale festival in pub",
        "content": "Buongiorno torinesi!\n\nIl weekend della finale di Sanremo sono con dei colleghi a Torino, vorremmo vedere la finale in un locale. Sapete se qualcuno organizza qualcosa in città?\n\nGrazie!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rfckw3/finale_festival_in_pub/"
    },
    {
        "id": "1rform1",
        "author": "Coccorocco1",
        "title": "Com’è questa zona di Moncalieri?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vg7armlo1xlg1.jpeg?auto=webp&amp;s=1cb4f38367f93c167201d850f478599b0de107b4"
        },
        "permalink": "/r/torino/comments/1rform1/comè_questa_zona_di_moncalieri/"
    },
    {
        "id": "1rfie5f",
        "author": "DraftApprehensive439",
        "title": "Student discounts",
        "content": "Hello everyone, is it possible to have a discount on Bardonecchia ski resort with ESN card (Erasmus student) or ISIC? Or is it possible only with physical Unito card? Thanks for replies",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rfie5f/student_discounts/"
    },
    {
        "id": "1rfbi9z",
        "author": "Mizuki_27",
        "title": "Concerto a Collegno",
        "content": "Ciao a tutti!  \nC'è qualche ragazza che quest'estate a luglio andrà al concerto di Gio Evan a Collegno? Oppure vorrebbe ma non sa con chi andare?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rfbi9z/concerto_a_collegno/"
    },
    {
        "id": "1rfe3em",
        "author": "Effective_Excuse_667",
        "title": "Commercialista torino",
        "content": "Ciao,\n\npotreste gentilmente consigliarmi un commercialista di fiducia?\n\nMi servirebbe qualcuno per seguire una nuova partita iva ordinaria, che mi segua per bene ottimizzando le tasse da pagare se possibile.\n\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rfe3em/commercialista_torino/"
    },
    {
        "id": "1rf9fzn",
        "author": "nazarthinks",
        "title": "Are there regulations for the brightness of these LED displays at pharmacies?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rf9fzn/are_there_regulations_for_the_brightness_of_these/"
    },
    {
        "id": "1reeiwi",
        "author": "Maleficent-Regret802",
        "title": "Stiamo pensando di creare un gruppo whatsapp per andare al cinema in gruppo. Qualcuno sarebbe interessato?",
        "content": "Ciao!\n\nL'altro giorno avevo fatto un post in cui chiedevo se ci fossero cineforum a Torino. Purtroppo la risposta è stata negativa, ma alcune persone hanno manifestato il proprio interesse.\n\nQuindi, è nata un po' lì, sul momento, l'idea di creare un gruppo whatsapp per beccarsi e organizzare uscite o andare al cinema e parlarne in compagnia una volta usciti dalla sala. Sono dell'idea che la sala sia un luogo magico e che parlare di un film dopo la visione sia parte integrante di quest'esperienza.\n\nQualcuno qui sarebbe interessato? Se sì, fatemi sapere (qui o in privato)!",
        "upvotes": 50,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1na5cf0kgnlg1.jpeg?auto=webp&amp;s=1a93e5f62518e81b2061cb1d9828db8ae358a917"
        },
        "permalink": "/r/torino/comments/1reeiwi/stiamo_pensando_di_creare_un_gruppo_whatsapp_per/"
    },
    {
        "id": "1reqyfk",
        "author": "glorious-ahole",
        "title": "Looking for new friends",
        "content": "hey everyone I'm a 24 year old guy. i am new to turin and im looking to meet new people here in the city. I like to reading books, cycling, playing board games and getting drunk haha. if any of these sound something like you'd be interested in, let me know. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1reqyfk/looking_for_new_friends/"
    },
    {
        "id": "1reaynr",
        "author": "enoughtodo67",
        "title": "Ristoranti/trattorie cinesi",
        "content": "Ciao popolo torinese...\nVorrei conoscere qualche nuovo ristorante, trattoria o perché no, anche street food di cucina cinese autentica.\nNon le solite pietanze (che mi pare di avere capito nemmeno mangino in Cina), ma qualcosa di particolare.\nAvete suggerimenti?🤍",
        "upvotes": 16,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1reaynr/ristorantitrattorie_cinesi/"
    },
    {
        "id": "1rejbqx",
        "author": "MagnoliaTree888",
        "title": "Università di Torino",
        "content": "Ciao!\n\nVolevo sapere se qualche studente UniTo fosse disponibile a darmi una mano perché sono un po' persa e su Universitaly non mi hanno risposto purtroppo.\n\nVorrei provare a iscrivermi all'università di Torino l'anno prossimo (scienze della formazione primaria), ma prima di mettermi a studiare per il test vorrei parlare con uno studente per capire un po' di cose che sul sito non sono chiarissime.\n\nSe avete consigli di qualsiasi tipo fatemi sapere :) \n\nho scritto su un gruppo telegram ma non so quanto sia attivo, ho anche pensato di contattare un rappresentante studenti ma non so se sia il caso e se rientri nel loro ruolo 😅 \n\nApprezzo qualsiasi risposta!\n\ngrazie mille ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rejbqx/università_di_torino/"
    },
    {
        "id": "1rej6ls",
        "author": "stirlingWizard",
        "title": "Incontri scacchistici",
        "content": "Ciao, sono un ragazzo di 32 anni, sto cercando un amico/a a Torino per giocare a scacchi e migliorarsi a vicenda nel tempo libero (che non è tanto purtroppo). Ho un ELO attuale di 1100 circa (non ufficiale), quindi non ho grosse pretese. \n",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1rej6ls/incontri_scacchistici/"
    },
    {
        "id": "1refftz",
        "author": "Separate_Fix_",
        "title": "Cercasi Co-Founder",
        "content": "Ciao a tutti,\n\nNon so se sono OT ma ho pensato che questo approccio possa essere promettente.\n\nCerco un co-founder per una serie di progetti principalmente di natura tech.\n\nHo già dei progetti avviati e ne voglio avviare altri.\n\nPer poterlo fare nel modo giusto so di aver bisogno di almeno uno (o più) cofounder.\n\nSe vi sentite incentivati a mettervi in gioco e vedere come funzionano le cose quando sei autonomo scrivetemi e parliamone, spero che ci sia reciproco interesse.\n\nLe idee sono tante e seguo l’approccio a container per i miei progetti.\n\nNon ho affiliazioni con prodotti ne aziende, sono semplicemente una persona che si lancia in qualcosa di nuovo (di nuovo).\n\nGrazie :)\n\nEdit:\n\nNon l’ho specificato ma sono progetti che vorrei far partire in città o nelle limitrofe",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1refftz/cercasi_cofounder/"
    },
    {
        "id": "1refkf2",
        "author": "Plenty-Hat-6661",
        "title": "Questiom about a traffic fine",
        "content": "Ciao, a dicembre eravamo a Torino con un'auto a noleggio. Ho appena ricevuto una notifica dalla compagnia di autonoleggio che mi comunica che ho una multa con la Polizia di Torino - VIOLAZIONE CIRCOLAZIONE CENTRI ABITATI. Se non ricordo male, Google Maps ci ha guidato attraverso il centro città. C'è un sito dove posso verificare se la multa è stata emessa? Ho un numero di denuncia, ma mi trovo in un altro paese dell'UE e dubito che i nostri servizi postali consegneranno la multa?\n\nSapevo che c'era qualcosa che non andava visto che eravamo l'unica auto in centro 🥲\n\nGrazie!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1refkf2/questiom_about_a_traffic_fine/"
    },
    {
        "id": "1re7xpv",
        "author": "Albert230398",
        "title": "Band stile Royal Blood",
        "content": "Ciao! Non so se è il posto giusto; sono un batterista di 27 anni, mi piacerebbe avviare o unirmi a un progetto di inediti alt-rock stile Royal Blood.\n\nQualcuno interessato? ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1re7xpv/band_stile_royal_blood/"
    },
    {
        "id": "1rebu3p",
        "author": "Tusus_",
        "title": "Question about public transport card",
        "content": "Hi, \n\nI have a question regarding the BIP card and the monthly subscription. I just got the card and managed to get one month but I was wondering that if I need more months later is it possible to buy them online and load them to the card. Thank you for the answers. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rebu3p/question_about_public_transport_card/"
    },
    {
        "id": "1rdy70r",
        "author": "nickt001",
        "title": "\"Le cansson dla Piola\" qualcuno hai testi di questi album",
        "content": "Ho scoperto Roberto Balocco da poco, mi sta facendo innamorare del mio dialetto in modo assai divertente, ma non capisco tutto, e non ho persone vicine a cui far ascoltare per tradurre senza scadere in grande imbarazzo\n\nConoscete altri cantautori che cantano in piemontese?\n\n\n\n",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1rdy70r/le_cansson_dla_piola_qualcuno_hai_testi_di_questi/"
    },
    {
        "id": "1re8oin",
        "author": "sodomaioo",
        "title": "Di chi e?",
        "content": "Ciao ho trovato questo cofano di auto nel mio giardino di quale auto è? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1re8oin/di_chi_e/"
    },
    {
        "id": "1rdp1p2",
        "author": "Maleficent-Regret802",
        "title": "Cineclub a Torino?",
        "content": "Ne esistono, per caso? O posti in cui si parla di cinema in generale(?)",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1rdp1p2/cineclub_a_torino/"
    },
    {
        "id": "1rdtc2j",
        "author": "LaFaticaDellaRagione",
        "title": "Vivere ad Airasca",
        "content": "Ciao a tutti, \n\nsto valutando l’acquisto di una casa ad Airasca, comune sulla direttrice Pinerolo-Torino. Io lavoro a Torino e dal lunedì al venerdì dovrei muovermi per venire in città. Secondo voi è fattibile? Qualcuno che vive tra Torino e Pinerolo potrebbe darmi qualche feedback? Sto valutando di comprare un appartamento di ottima metratura immerso nel verde. Sono automunito ma non mi dispiacerebbe utilizzare anche il treno (porta Susa dovrebbe essere raggiungibile in 31 minuti). \n\nGrazie ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1rdtc2j/vivere_ad_airasca/"
    },
    {
        "id": "1rdozfe",
        "author": "Dangerous_Bite_7601",
        "title": "Cerco signora per pulizie a casa",
        "content": "Ciao ragazzi come da titolo, entrando a casa nuova venerdì cerco qualcuno che possa aiutarmi un paio d'ore almeno per le pulizie di casa..sapreste indicarmi associazioni/gruppi/ o qualcuno di vostra conoscenza?\n\nEdit: zona fermata metro Spezia",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rdozfe/cerco_signora_per_pulizie_a_casa/"
    },
    {
        "id": "1rdkld9",
        "author": "kacokaj_kejdis",
        "title": "Cosa vuol dire o chi l'ha fatto e perche l'ha fatto la scritta nacho sui muri?",
        "content": "",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rdkld9/cosa_vuol_dire_o_chi_lha_fatto_e_perche_lha_fatto/"
    },
    {
        "id": "1rdq05x",
        "author": "Accurate-Writing6926",
        "title": "Primo lavoro per Ing Meccanico magistrale",
        "content": "Ciao\n\nQuali sono le opportunità per un neo laureato in ing meccanica qui a Torino?\n\nQuali aziende é utile controllare o sono migliori di altre?\n\nSe fossero aziende di consulenza mi chiedevo quali dessero la possibilità di esperienze più “utili” e non puro body rental senza grandi risultati in termini di formazione e crescita\n\nSecondo voi quale é un range onesto di RAL per un primo impiego?\n\nOgni altro consiglio é ben accetto\n\nGrazie",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rdq05x/primo_lavoro_per_ing_meccanico_magistrale/"
    }
]