[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 505,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k7yt4n",
        "author": "Upper-Transition4714",
        "title": "Does every new show/movie added to Netflix make it to the top 10?",
        "content": "My friends and I were wondering if every show/movie makes it to the top 10 Daily. We went through the most recent shows release and they all seemed to be in the top 10 at least for a day in some country. I understand the incentive for Netflix to do so but I was wondering if you have noticed any new show/movie that hasn’t. ",
        "upvotes": 27,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yt4n/does_every_new_showmovie_added_to_netflix_make_it/"
    },
    {
        "id": "1k7zmvn",
        "author": "urfavnjb",
        "title": "One Day WARNING (other suggestions?)",
        "content": "I went blind into this show, and was not expecting to be hit so hard by the ending. I really thought it was just a funny silly feel-good romcom, got hooked into it (cinematography was amazing btw), and now bawling like a little baby. Life is just so cruel and this show really personifies the worst of it, but also the best and most beautiful parts of it. I literally do not know what to do with myself atm. \n\nAnyways, does anyone have any suggestions for an actual feel-good movie/show? ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k7zmvn/one_day_warning_other_suggestions/"
    },
    {
        "id": "1k7n76b",
        "author": "Internal-Bed-3150",
        "title": "Netflix is dropping 55 movies and series this week (April 26 - May 2, 2025)",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k7n76b/netflix_is_dropping_55_movies_and_series_this/"
    },
    {
        "id": "1k7v333",
        "author": "KingFyx",
        "title": "Did Netflix just gave up promoting their once popular tv shows ?",
        "content": "This year, I got back into rewatching a few old shows from Netflix only to realise that there was a new season of Black Mirror. That's weird I thought to myself cause Netflix usually would promote their shows leading up to the release. \n\nAnd now with You season 5 being released, I realised that Netflix hasn't done any promos for their old shows for a while for the past 2 years ? It's only a week after the season hits or some random Tiktoks that i would find out a show is coming up. What happened ? \n\nEdit: I just went through their trailers and like, this entire year is loaded with their highest viewership shows ? How are they not making a big deal out of this year being the year of Netflix coming back with their cult classic shows ? We have Sandman, Love, Death and Robots, Wednesday, as well as Stranger Things (although I did saw Stranger Things being announced this year BUT not because of Netflix bombarding it in my face). ",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1k7v333/did_netflix_just_gave_up_promoting_their_once/"
    },
    {
        "id": "1k7yrbs",
        "author": "HumdrumHoeDown",
        "title": "Recommendation: Warrior",
        "content": "I slept on this show since it became available. Watched a few minutes of it, didn’t bite. But i heard some hype and decided to give it a try just recently, and holy shit am I feeling rewarded for it. \n\nIt doesn’t even take long to get good, and rarely falters in any area. Writing, production, acting, casting, costumes, what have you: it’s all on point 90% of the time.\n\nIt’s a gangsters/families, cops and robbers martial arts drama, with the various gangs being fictional, but still feeling plausible in its’ historicity. I treat it as fiction, but made in imitation of real life, at least as far as the broad tensions and power dynamics of that place and time.\n\nThe writing is sharp, the characters are great portrayals of certain archetypes. The action is excellent and stylish. It’s quality top to bottom. And it’s a unique perspective.\n\nThe focus is the Chinese immigrant population of 19th century San Francisco, but also the Irish population and other ancillary forces such as nativist white supremacy, economics, existing political structures, culture barriers, space and resource limitations etc etc. \n\nIf you like historical fiction, martial arts, sopranos style gangster drama…this is for you. \n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yrbs/recommendation_warrior/"
    },
    {
        "id": "1k7o601",
        "author": "mono_six651",
        "title": "YOU season 5",
        "content": "Imma be honest, surprisingly season 5 was perfect. Everything is just reasonable I cannot pick sides in this season. Everybody is in the right, literally.\n\nWhat’re your guyss thoughts?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k7o601/you_season_5/"
    },
    {
        "id": "1k7rql9",
        "author": "Deivelicious",
        "title": "Question about camera on \"Adolescence\":",
        "content": "Hey people, I just finished Adolescence on Netflix and I'm pretty amazed by their camera work and also loved to see the short making of.\n\nA still unanswered question though is how they did the camera tracking shot in the second episode at about minute 38:35 (something like that)\nwhen the camera follows Ryan and it seems to be flying through a closed window right next to the open one where he escapes through.\n\nI haven't found any footage of how they managed to do that, is it probably just the \"effect\" of a closed window? Someone has an idea?\n\nCheers in advance and have a good one!\n\nForgive me my english for that isn't my first language.\nBest regards",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k7rql9/question_about_camera_on_adolescence/"
    },
    {
        "id": "1k7hfnq",
        "author": "OkBert12345",
        "title": "YOU Season5 on Netflix",
        "content": "The final season is out now on Netflix Australia.\nAnyone else bingeing it?\nJoe is back in his black cap, doing classic Joe things, back in New York, and the end seems nigh.\nI’m up to ep6 and it is a ride!\n",
        "upvotes": 25,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k7hfnq/you_season5_on_netflix/"
    },
    {
        "id": "1k81856",
        "author": "Striking_Car4692",
        "title": "netflix isnt working?",
        "content": "I started watching the new season of you yesterday and it was working fine. I wake up this morning and not only is it gone from “continue watching” i cant even search to find it. Is anyone elses Netflix bugging? I know I paid this month so just need to know if its just me or not. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k81856/netflix_isnt_working/"
    },
    {
        "id": "1k80pko",
        "author": "scorpioassociation",
        "title": "Show suggestions!!??",
        "content": "Can someone please suggest me some good Netflix shows? My taste in shows is very vast. I love modern family, dexter, you, breaking bad, young Sheldon, behind her eyes and many more!!\n\nPS: No romantic shows pls",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k80pko/show_suggestions/"
    },
    {
        "id": "1k6zj5x",
        "author": "PressureForsaken7147",
        "title": "Netflix household sucks",
        "content": "I know this isn’t new, but I still want to share my thoughts on Netflix’s household policy.\n\nJust because a family doesn’t live under the same roof doesn’t mean they’re not family. In today’s world, it’s normal for siblings or parents to live in different cities. We still stay connected, so why can’t we share a Netflix account — especially when we’re already paying for one with multiple profiles?\n\nNetflix used to be okay with sharing. They even encouraged it back in the day. And now they’re changing the rules just to make more money. It doesn’t feel fair.\n\nWhat’s more annoying is that even though this policy started a while ago, I was still able to use Netflix on my laptop — just not on the mobile app. But today I got a notification on my laptop saying I can’t use it anymore either. So that’s it, I guess. One more reason to unsubscribe.",
        "upvotes": 208,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1k6zj5x/netflix_household_sucks/"
    },
    {
        "id": "1k7yej9",
        "author": "Consistent_Way2386",
        "title": "Can’t access my account on my MacBook, but can on my iPhone",
        "content": "I moved away for university, but am still using my dad’s account. I’ve had no issues using my laptop until today. Now it says “Your device isn’t part of the Netflix Household […]” but when I open Netflix on my phone, it’s still allowing me in. I just downloaded the newest MacOS update, so maybe this has something to do with it? No clue. Any help is appreciated.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yej9/cant_access_my_account_on_my_macbook_but_can_on/"
    },
    {
        "id": "1k72ro9",
        "author": "TCACampbell",
        "title": "Unable to use certain profiles",
        "content": "Hi, i’m currently trying to use my profile but any time I use it or my friends on the same account they cause netflix to bring up the error code tvq-st-149. \nOther profiles on the account don’t cause this. just these two. Both accounts were working fine earlier and I am trying to access them from the netflix household. Signing out and i’m in again/ reloading seems to have no effect. any help is appreciated.",
        "upvotes": 84,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1k72ro9/unable_to_use_certain_profiles/"
    },
    {
        "id": "1k7cl12",
        "author": "philfnyc",
        "title": "Article: Netflix Debuts Dialogue-Only Subtitles",
        "content": "Netflix, you read my mind! This is an excellent option that I’ve silently wished for. 👏🏼👏🏼👍🏼\n\nArticle: https://www.macrumors.com/2025/04/24/netflix-debuts-dialogue-only-subtitles/",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k7cl12/article_netflix_debuts_dialogueonly_subtitles/"
    },
    {
        "id": "1k7t7f1",
        "author": "Express-Swim2713",
        "title": "*Spoiler* YOU S5 - I think u found a plot hole no one’s talking about",
        "content": "Ok so now that we’ve binge watches the entire season in a single day, IVE GOT QUESTIONS! And I think the director has deliberately kept it that way.\n\nWhen Maddie was put in the cage by Joe, maddie tried to show for a moment that she’s quite strong and doesn’t care if she’s a hostage, but soon when Ketoacidosis kicks in, and she gets know about her “superior” twin learning about the affair… she just looses it and reveals how she’s such a weak little girl. All throughout the season we see her as impulsive and extraordinarily weak in every minor situation after the cage incidence… which wasn’t really the case before that!\n\nMy theory is … when  Reagan was locked in with her… who just showed moments ago that she can easily beat up Joe, and is quite tough, CAN’T BE KILLED THAT EASILY BY HER WEAKER SISTER , that too by an insulin injection when she’s all awake and athletic!!\n\nAlso, the killing of Reagan scene and the scene when maddie hits her husband unconscious is both not shown on the show… making perfect sense that Reagan killed maggie and then pretended to be her for the rest of the show!\n\nBut even till the final episode .. it wasn’t shown.. the hallucinations, the - going to jail and still not breaking character were all a big show to make people hooked on when the show will reveal that it’s actually Reagan pretending to be her twin and not the other way around… but it was never shown!\n\nDid anyone else notice that? I can’t be the only one.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k7t7f1/spoiler_you_s5_i_think_u_found_a_plot_hole_no/"
    },
    {
        "id": "1k7nypo",
        "author": "Somethingman_121224",
        "title": "Netflix Has Just Released Its Full Summer 2025 Slate and There Are Some Exciting Titles Coming Our Way",
        "content": "",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k7nypo/netflix_has_just_released_its_full_summer_2025/"
    },
    {
        "id": "1k6xlxi",
        "author": "ToonAdventure",
        "title": "LOVE DEATH + ROBOTS VOLUME 4 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 54,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k6xlxi/love_death_robots_volume_4_official_trailer/"
    },
    {
        "id": "1k6p399",
        "author": "theipaper",
        "title": "Fans deserve better than You's insulting final season",
        "content": "",
        "upvotes": 101,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1k6p399/fans_deserve_better_than_yous_insulting_final/"
    },
    {
        "id": "1k7ap4c",
        "author": "CorruptedDucky21",
        "title": "Why is weak hero not releasing?",
        "content": "For australia it said it would release today (25th of april) but its been pretty much 13 hours since then and its not releasing. I did search up whether there was an exact time but I couldn't find anything about it so I assume its supposed to release today at midnight. I might be missing something but please help 🙏",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k7ap4c/why_is_weak_hero_not_releasing/"
    },
    {
        "id": "1k7tkls",
        "author": "anonymous_wine-O",
        "title": "You season 5 ending",
        "content": "Ok so spoiler talk ahead so if you haven't seen it don't read. \n\nI'm not crazy about the ending, of course it makes sense and be should go to jail for certian murders. \nHe did technically kill love only after he found out she was going to off him, and honestly I understand mariann being afraid of him and coming back in her life but Love talked to her. I'm guessing her coming back was more of a ptsd thing. \nNadia working with Kate was interesting but kind of boring in my opinion. \nJoe should of kept Maddie out of jail bc she was more useful outside of jail. \n\nAlso Maybe unpopular opinion, I'm not a fan of Bronte. I thought her character was annoying and she was the one to outsmart Joe, idk i guess I can see it but she just wasn't it for me.  Honestly I wished she would of drowned bc i really didn't like how they kept bringing everyone back to life. How did Bronte survive a gunshot and being drowned.\nHow tf did Kate survive a gunshot and burning building with  just minimal scaring?! The bookstore was on fire and she was shot like what.... That makes absolutely no sense. \n\nI love the series and it was a fun season the show finale I would of like to see Joe kinda disappear and with a new look in like Canada or Iceland and have the credits go Hey.. YOU... and fade off j think that would of been more impactful then this feel good everyone lived stuff.\n\n\nJust my. Opinion ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k7tkls/you_season_5_ending/"
    },
    {
        "id": "1k7hmrt",
        "author": "isingifeelalive",
        "title": "What YOU season 5 should have been (spoilers)",
        "content": "It’s honestly hard to ignore how incredibly one-sided the final season feels. Yes, Joe is a psychopath—there’s no denying that. But Kate is just as morally compromised. Not only did she know that Joe killed her father for her, but she also directly asked him to kill her family’s long-time advisor when he betrayed her. That wasn’t implied or subtle—it was a calculated, deliberate request. She knew exactly who Joe was and what he was capable of.\n\nKate claims she's trying to be “good,” but that façade cracks the moment she no longer needs Joe or starts seeing him as a liability. It’s manipulative, self-serving, and above all, dishonest. If she had just admitted that she was a narcissist playing her own long game—and that she didn’t want Joe messing up her plans—it would’ve at least felt real. Instead, she tries to present herself as the noble heroine who had to “escape” Joe, when in truth, she reclaimed her empire with him.\n\nBronte’s character only adds to the emotional whiplash. One minute she loathes Joe, the next she’s falling for him, and then she’s back to exposing him. It’s not nuanced—it’s incoherent. And it undermines the idea that she’s supposed to represent the moral compass of the season.\n\nAlso, it feels like the writers were trying to position Bronte’s emotional flip-flopping—her swinging between attraction and repulsion toward Joe—as a reflection of what women experience in abusive relationships. The confusion, the push-pull dynamic, the trauma bonding—that seems to be the angle they were aiming for.\n\nBut the problem is, Joe never actually abused Bronte. Not emotionally, not physically, not psychologically, leading up to her betrayal. Yes, he’s done horrific things in the past—to other people—but not to her. In fact, he was protective, vulnerable, and even deferential around her. So her behavior, if it’s meant to mirror the experience of an abuse survivor, comes off as misapplied and unearned in this context.\n\nWhat’s even more tragic is that Joe did try. He was a loving, faithful husband for three years. The only time his darker instincts began to resurface was when Kate emotionally withdrew and saw him not as a partner, but a monster—even though she had already accepted, even relied on, that side of him before. Her disgust is performative, not principled.\n\nThis season could have been so much more. Instead of Bronte preaching to Joe about love without violence, imagine if Kate—the person who truly knew him—had taken that role. If she had said, \"I love you, but you don’t need to earn my love by killing. I’ll love you no matter what, and we can keep each other good, like we said,\" it could’ve been a transformative arc. Joe finally learning to separate love from violence, not through punishment, but through someone loving him without conditions. That’s how redemption works—not through shame, but through truth.\n\nEvery woman in this story is painted as either a victim or a victor, when in reality, they’re playing the same games Joe is—just with cleaner hands.\n\nIn my view, the most poetic and meaningful ending would’ve been one rooted in sacrifice and selflessness—in what love should be, not what it’s been distorted into throughout the series.\n\nImagine this: Kate finally snaps—driven to the brink of destruction with her sister about to expose the pipeline scandal—and does something reckless. Something that reveals she was just as damaged, just as capable of destruction, as Joe ever was.\n\nBut instead of spiraling back into violence, Joe, now genuinely changed, makes a different choice.\n\nHe doesn’t retaliate.\nHe doesn’t manipulate.\nHe protects her.\n\nHe takes the fall—not because he was caught, but because, for the first time in his life, he chooses to do the right thing for someone else, with no ulterior motive. He sacrifices himself, not to preserve an illusion of love, but to protect someone he truly loves. It’s not about possession, or control, or fear—just pure, quiet selflessness.\n\nThat would’ve been the ending this series could have earned. One where love doesn’t conquer darkness by pretending it’s not there, but by confronting it with honesty, and rising above it with compassion, accountability, and grace.\n\nActual character growth in Joe—not a full redemption, but a man finally choosing selflessness over control, love over violence.\n\nInstead, the show reduces everything to a flat message:\n“Evil is evil. Kill it.”\n\nNo nuance. No context. Just a binary ending for a character built in shades of gray. To the writers: maybe the problem is YOU. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k7hmrt/what_you_season_5_should_have_been_spoilers/"
    },
    {
        "id": "1k7cdiu",
        "author": "Inevitable-Cream-510",
        "title": "Need help with 'household'",
        "content": "I can't for the life of me figure out how on earth to get Netflix working again on all our devices and it's infuriating me because the help info online and on the apps is absolutely useless and doesn't offer any troubleshooting options.\n\nNetflix works currently on my TV, my laptop, and my phone. The issue is with my ipad and I assume the issue is because it spends a significant amount of time connected to my mum's ipad when I'm at her place. The issue is even when I'm at home at MY place, connected to MY wifi, that my TV is also connected to, it still tells me that the device isn't part of my household?! And there don't seem to be any options to fix it. I sign out, reconnect wifi, sign back in, refresh app, etc. but nothing makes a difference. What gives? How the eff do I get it connected?\n\nAlso, as an aside, what the hell happens now if I want to watch Netflix outside my own home not connected to my wifi? I travel, spend a lot of time at other people's houses, etc. I get that Netflix doesn't want one person sharing their account with their 10 buddies, but it's genuinely outrageous that I can pay for a service and then not actually use it outside my own house. How does the 14 day temporary access thing work? What if I'm travelling overseas for a month?! At this rate I'm tempted to just unsubscribe because this is outrageous. I feel sorry for kids moving between divorced parents' houses. What a nightmare that must be. \n\nThanks for your help.  ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k7cdiu/need_help_with_household/"
    },
    {
        "id": "1k7gwpl",
        "author": "bubbles67899",
        "title": "Anyone remember “jockeys”?",
        "content": "Just starting “race for the crown” \n\nI don’t event remember what channel I watched this on back in the day (it could have been animal planet back in early 2000s haha), but does anyone remember “jockeys”?! \n\nI remember Mike Smith and Chantelle Shutherland dating… they showed all the “flipping” (aka jockeys throwing up so much they change the pipes in every track 3x a year from stomach acid), all them living together at Santa Ana and fighting often? \n\nSo funny watching this cute produced Netflix version- I wonder if it’s changed or if it’s just Netflix polish? \n\nI know nothing about horse racing besides the old show and a few OTBs, so I’d love to hear people’s perspectives! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k7gwpl/anyone_remember_jockeys/"
    },
    {
        "id": "1k71jeq",
        "author": "ChewysCorner",
        "title": "Can anyone help with an issue on the Netflix SkyTV app?",
        "content": "It keeps displaying the error tvq-st-149 and getting stuck in an error loop. I've tried pressing the reset option, sign out and restart and can occasionally get to the profile section but then get sent back to the error screen again. It's working on my phone so I don't think it's an account issue. Any help would be great thanks!",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k71jeq/can_anyone_help_with_an_issue_on_the_netflix/"
    },
    {
        "id": "1k7qymp",
        "author": "riice_beats",
        "title": "YOU Season 5",
        "content": "me and my husband binged watch it yesterday, damn we thought Joe would change and have a happy ending haha. but i guess the ending is what he deserves. I love all the season, its sad its the last season tho. we thought there would be more :( ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k7qymp/you_season_5/"
    },
    {
        "id": "1k7eta8",
        "author": "RhiAndroid1990",
        "title": "Switching Profiles",
        "content": "I know Netflix was down but online reports say that its ’fixed’ \n\nWe logged on this morning and put on a child profile.\nWhen we try to switch to 1 of the adult accounts, it brings up the error screen, but then lets us access another. Is this still Netflix being broken or do I have to do something now to resolve this glitch?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k7eta8/switching_profiles/"
    },
    {
        "id": "1k756h7",
        "author": "PalmTrees_City",
        "title": "Show question",
        "content": "Hey everyone, I’m curious.. Has anybody watched the show called ‘’You’’ apparently it was trending for like 14 weeks and I started watching it and it’s pretty psycho and weird but interesting?? I ended up loving it and I’m still watching it. Any thoughts?? ",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1k756h7/show_question/"
    },
    {
        "id": "1k786bv",
        "author": "Luminous-Mari24",
        "title": "Netflix logs me out of entire account when opening certain profile",
        "content": "I have 5 profiles on my netflix account, and 4 of them work. However, when I open a specific profile on my phone, it completely signs me out of the account. As for the TV, after clicking the profile I got stuck in a loop of error screens every time I open the app. \n\nHow do I solve this?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k786bv/netflix_logs_me_out_of_entire_account_when/"
    },
    {
        "id": "1k6c43k",
        "author": "indiewire",
        "title": "Netflix Co-CEO Says They’re Not in China Because ‘Not a Single Episode’ Cleared the Censorship Board",
        "content": "",
        "upvotes": 367,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1k6c43k/netflix_coceo_says_theyre_not_in_china_because/"
    },
    {
        "id": "1k7djf8",
        "author": "Long-Version-8734",
        "title": "forgotten series",
        "content": "I remember an animated series about poor American teenagers, the animation was somewhat strange and was not very successful, it was dark humor. I don't remember what it's called, does anyone know it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k7djf8/forgotten_series/"
    }
]