[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 699,
        "comments": 5133,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nv1czx",
        "author": "EclipseTheStars",
        "title": "If Netflix *ISNT* Releasing Seasons All-At-Once, Why Not Do Weekly Episodes Instead??",
        "content": "Just found out that Stranger Things 5 will be airing 4 episodes in November, 3 in December, and 1 in January for \"viewer retention.\"\n\nWhy don't they just start on Thanksgiving with weekly episodes that go throw 3 core holidays? Thanksgiving, Christmas, and New Years?\n\nPeople talk about it on social media, share their opinions, sometimes it's on talk shows, Game Of Thrones did this best, I don't know why Netflix doesn't do this. WEDNESDAY was the same.\n\n\\---------------------------------------------\n\nTL;DR\n\nObviously, just give me the entire season all at once. The premise is that they \\*DONT\\* do that anymore. And honestly, splitting up the seasons of these shows a few episodes MONTHS apart is so much worse than week-by-week episodes for a few months sraight.\n\nAlso, people tend not to give a @#$% anymore after binge watching half the season and then having to wait another month for the rest. Am I only in this way of thinking?",
        "upvotes": 53,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1czx/if_netflix_isnt_releasing_seasons_allatonce_why/"
    },
    {
        "id": "1nv6kgg",
        "author": "SomeoneNicer",
        "title": "We really need a Death to 2025",
        "content": "Current events this year have hit an all-time high where parody and satire can't keep up with reality fast enough. It's due time to return the series that gave us the evergreen gem of Death to 2020.",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nv6kgg/we_really_need_a_death_to_2025/"
    },
    {
        "id": "1nvacy2",
        "author": "Luv2006",
        "title": "Anyone else miss the Netflix roulette feature?",
        "content": "I completely forgot this existed until I read about it online the other day but it made me realise how much I actually miss it! Please tell me you guys also remember the very brief time when Netflix had a roulette option on the app to choose what to watch for you?! \n\nI can’t understand why they decided to get rid of it. It would save me a lot of time. I’m fed up with spending at least half an hour scrolling through different movies tryna figure out what to watch, just to end up going on my phone or to bed instead in the end. Anyone else miss this option? ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nvacy2/anyone_else_miss_the_netflix_roulette_feature/"
    },
    {
        "id": "1nv8czt",
        "author": "Atlast_89P13",
        "title": "Frankenstein (2025) | Guillermo del Toro | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nv8czt/frankenstein_2025_guillermo_del_toro_official/"
    },
    {
        "id": "1nv96uu",
        "author": "jesuslovesdank646260",
        "title": "My biggest Wayward questions",
        "content": "Finished the series last night, &amp; these are the things I’m still wondering this morning:\n\nWhy did Rabbit want to “adopt” Stacey? Does Rabbit know that Stacey admires her? (At least that’s how I saw it, if anyone thinks differently let me know!) The hug after Stacey k*lls Daniel had me speechless. Does Rabbit think Stacey will protect her? From what?\n\nDoes Ello or Evelyn survive? \n\nAlex left Toast with the car for Abby, presumably so she wouldn’t be all alone, have some sort of company, but I mean after that Laura never wonders where Toast went? Did I miss something?\n\nI was so upset the daydream before the end was just that, a daydream. WHY would Alex stay? What the heck does he want with the craziness? Will Laura take Evelyn’s place? If so please tell me your theories!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nv96uu/my_biggest_wayward_questions/"
    },
    {
        "id": "1nuztc3",
        "author": "Anteater_Able",
        "title": "Charlie Hunnam on Becoming Ed Gein for Netflix's 'Monster'",
        "content": "",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nuztc3/charlie_hunnam_on_becoming_ed_gein_for_netflixs/"
    },
    {
        "id": "1nvc5jz",
        "author": "Thin-Presence-154",
        "title": "Good Girls- I hate the husbands",
        "content": "I just started watching Good Girls.  I've enjoyed the show. I'm not done with it yet. I'm on season 4 episode 13. Dean is an awful husband and has the nerve to be mad about how Beth makes money despite her saving their home and keeping them above water. He has so much audacity considering he cheated multiple times, lost their funds multiple times, and lied about having cancer to manipulate her. Stan has the nerve to be mad a Ruby and try to take down Beth when Ruby and Beth are the reason their daughter got an organ.  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nvc5jz/good_girls_i_hate_the_husbands/"
    },
    {
        "id": "1nv28cl",
        "author": "Enzian_Blue",
        "title": "European shows",
        "content": "Hi there. We loved shows like Dark, der Pass (Pagan Peak), das Boot.. the atmosphere is special, the actors are more ‘real’. Any recommendations that we might enjoy? \n\nThank you :)",
        "upvotes": 5,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1nv28cl/european_shows/"
    },
    {
        "id": "1nvb3yr",
        "author": "Complex-Specialist26",
        "title": "Wayward is brilliant(spoilers)",
        "content": "I was holding on to every episode! Usually I pull out my phone while watching but this series had me glued to the screen. There are parts I don’t really understand, like the door and the “leap” part of the program. What does it do to you? I’m going to rewatch but was hoping for some insight! \n\nI didn’t understand Laura, was she bad or was it trauma? Why did she kill that frog?! \n\nReally hoping for a season 2! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nvb3yr/wayward_is_brilliantspoilers/"
    },
    {
        "id": "1nvazg7",
        "author": "Far-Artichoke7331",
        "title": "Secret behind the scene of  \"Adolescence\" shocked me but it makes me smile.",
        "content": "I know it adolescence released few month ago but I just saw the the link of YouTube video about adolescence from BBC called \"The One Show\" and saw the title of the video so I thought why not watch it.\n\nOwen Cooper who acted as Jamie Miller yawned in episode 3 of Adolescence around 10 min 40 sec into the video then Erin Doherty who acted as Briony Ariston said \"Am I boring you?\" which isn't scripted at all.\n\nHere is a link [https://youtube.com/shorts/UTNVOGi8tbA?si=5rfm3BsBAfg7vs3E](https://youtube.com/shorts/UTNVOGi8tbA?si=5rfm3BsBAfg7vs3E)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nvazg7/secret_behind_the_scene_of_adolescence_shocked_me/"
    },
    {
        "id": "1nu9kbz",
        "author": "Tr0jan___",
        "title": "Ms. Rachel announced as the new global ambassador for PCRF (Palestine Children's Relief Fund)",
        "content": "",
        "upvotes": 195,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu9kbz/ms_rachel_announced_as_the_new_global_ambassador/"
    },
    {
        "id": "1nulvlm",
        "author": "FNAFLV22",
        "title": "Just heard of “Maniac” and saw the IMDb rating. To those who have seen both shows, which show did you like more?",
        "content": "",
        "upvotes": 35,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1nulvlm/just_heard_of_maniac_and_saw_the_imdb_rating_to/"
    },
    {
        "id": "1nv94ma",
        "author": "bball4224",
        "title": "11 Rebels",
        "content": "I'm in Japan, so idk if any of you will even have this movie as an option, but there is some crazy audio mixing with this movie this is nearly unbearable. I've had issues with things where audio is a little too quiet, or music is too loud, etc. But this movie is the worst example of it I've had so far. All of the dialogue scenes I'm turning up 5 volume levels more than I normally do, and even then it's still quiet. But the moment any sound effects happen, they're insanely loud.\n\nJust curious if there's an issue with the netflix version of this movie, because I'm not having this level of issues with anything else. I would say maybe it's the movie, but I would think netflix probably works on audio regulating and optimizing themselves as well. 🤔",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nv94ma/11_rebels/"
    },
    {
        "id": "1nuabrk",
        "author": "Sweaty-Toe-6211",
        "title": "'THE WITCHER' Season 4 reportedly cost over $25M per episode, making it $221M overall - The total budget for ‘THE WITCHER’ series has now reached an estimated $720M",
        "content": "",
        "upvotes": 140,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1nuabrk/the_witcher_season_4_reportedly_cost_over_25m_per/"
    },
    {
        "id": "1nv580d",
        "author": "kanonenjagdpanzer105",
        "title": "How do you disable deaf subtitles on videos?",
        "content": "I watch movies while moving(cars,subways,buses,trains). So I watch movies on my phone. Albeit one day I see my subtitles being like this “I award you this medal (People clapping in the background). This whole thing takes a lot of space from the screen and are sometimes annoying when they add the tiniest amounts of details on it. I don’t remember setting this before and I don’t see the normal option on the settings from some of the videos. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nv580d/how_do_you_disable_deaf_subtitles_on_videos/"
    },
    {
        "id": "1nuxals",
        "author": "Corrupt_Echo",
        "title": "Need a new show",
        "content": "I’m 13, have seen Locke and key and thought it was cool (not scary at all) and a good show of mine, not a big fan of stranger things\nI’m looking for a good horror/thriller",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nuxals/need_a_new_show/"
    },
    {
        "id": "1nu5lno",
        "author": "Original2021",
        "title": "Toni Collette totally carried the Wayward series",
        "content": "This has to be one of the oddest shows I’ve ever seen. The storyline had potential but the bad acting (aside from one of two performances) and unrealistic storyline was terrible. There was some mention about some of the kids jointing government agencies but they all lived in the town. Like huh??? The only saving grace was Toni Collette’s performance. She’s the only reason I watched until the end. I hope she gets an Emmy nomination for having to make something out of a Nonsensical script. ",
        "upvotes": 167,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1nu5lno/toni_collette_totally_carried_the_wayward_series/"
    },
    {
        "id": "1nv8duk",
        "author": "Sharp_Spare1738",
        "title": "I'm having flue, recommend me a mini series to watch today please",
        "content": "I'm into biography, thriller, and especially comedies. The shorter the series the better because i never watch TV but today i'm forced as i'm recovering from flu.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nv8duk/im_having_flue_recommend_me_a_mini_series_to/"
    },
    {
        "id": "1nuvf16",
        "author": "Worth_Vermicelli_319",
        "title": "In the mood for a sci-fi and romance series that has both psychological and romantic tension.",
        "content": "I’m in the mood for a sci-fi and romance series that has both psychological and romantic tension. I have watched Dark, 1899, Into the Night, Call Me by Your Name, and Normal People. Can you recommend me something that’s a combo between them and has a similar theme?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nuvf16/in_the_mood_for_a_scifi_and_romance_series_that/"
    },
    {
        "id": "1nv1t7z",
        "author": "No_Caregiver_5382",
        "title": "Trying to run Netflix in 4K on PC",
        "content": "I'm being driven crazy with ts.\n\nI downloaded the codec on the mircosoft store\n\nI have a RTX 4090. and a MSI 321 URX QD OLED.\n\nI've unplugged every other mointor\n\nI've tried to use HDMI and the DP cable that comes with this, its a DP 1.4 and HDMI 2.0.\n\nI have the netflix plan that allows me to even use 4K, Hell, it for some reason doesnt even SHOW 4k, just \"HD\" i've tried squid game, devil may cry, and the witcher. all show the same thing. it'll show the dolby thing. but not the 4K HDR\n\nI tried Edge and the app itself. However in the debugging stats for nerds, it shows 1080p. I've done everything i can to try and make it work but it just won't. If anyone here has any ideas. please let me know what it could be. i'm at my wits end. Is there anything that i'm doing wrong that's making it not work? Do i need to reinstall windows? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1t7z/trying_to_run_netflix_in_4k_on_pc/"
    },
    {
        "id": "1nu8did",
        "author": "Sea-Opposite3920",
        "title": "Why does everybody hate Wayward",
        "content": "It completely gripped me for 7 hours. I mean sure its unrealistic and there were plot holes, but like it's fiction. The acting was great - I thought - and the emotional abuse which lead to character developments felt real. Not everyones cup of tea I suppose. ",
        "upvotes": 55,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8did/why_does_everybody_hate_wayward/"
    },
    {
        "id": "1nv0uj6",
        "author": "alwayzhope",
        "title": "random shows (recommended Because You Watched...) kept playing on their own episode after episode while I'm watching another show, concurrently",
        "content": "something's wrong with netflix! anyone experiencing the same???\n\nobviously checked devices signed in and there is nothing suspicious. the only device showing last viewing activity coincides with my computer which I was watching netflix on. it's like my computer with 1 window, 1 netflix tab, has been playing 2 shows AT ONE GO for a couple of weeks now.\n\nso i want to know, anyone experiencing the same??? i am 100% sure it's netflix problem, yet i cannot report it on the viewing activity page...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nv0uj6/random_shows_recommended_because_you_watched_kept/"
    },
    {
        "id": "1nur96v",
        "author": "Signal-Style-6159",
        "title": "Nightmares of Nature - wowza",
        "content": "Has anyone seen it yet?  It's awesome.  \nIt is a different perspective on nature.\nI've never seen anything like it.\nI have been watching nature documentaries for over 55 years.  Thank you Netflix!  More please 🦉🐜🐊",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nur96v/nightmares_of_nature_wowza/"
    },
    {
        "id": "1nuymuc",
        "author": "Xuayu",
        "title": "Need suggestions",
        "content": "Looking for shows similar to Workin’ Moms, Survival of the thickest, and Bonding. Generally looking for feel good shows I can have on in the background. Something funny, maybe raunchy? Or crude humour? Not sure what the genre is called.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nuymuc/need_suggestions/"
    },
    {
        "id": "1nutwjv",
        "author": "Eaglemama70",
        "title": "HOUSE OF GUINESS",
        "content": "I pretty much binged this series. It is so good! I am biased being 35% Irish. There is something about Irish music and men beating the shit out of each other!!!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nutwjv/house_of_guiness/"
    },
    {
        "id": "1nuxi1z",
        "author": "blossombreeze34",
        "title": "I'm a bit confused about a scene in the 5th episode of Alice in Borderland Season 3. Can anyone help clarify?",
        "content": "I have a question about the 5th episode were ee see Ryuji watching a clip of his future where he and Usagi are meeting and chatting about an interview and his theory. After that, they’re walking together, laughing about her story. Then, he asks her out for dinner, and she replies with a smile, \"Let me think about it.\"\n\nSo, my doubt is, at that point in time, is Usagi single or still married to Arisu in that future and hinting a possible affair ? I'm really confused by all the future clips.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nuxi1z/im_a_bit_confused_about_a_scene_in_the_5th/"
    },
    {
        "id": "1nuh62m",
        "author": "Anteater_Able",
        "title": "Duffer Brothers on Netflix Exit, Stranger Things Future",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nuh62m/duffer_brothers_on_netflix_exit_stranger_things/"
    },
    {
        "id": "1nusucl",
        "author": "EnderFreakYT",
        "title": "“Get a code to watch on this TV” cannot select options",
        "content": "So i recently was hit with the lovely get a code to watch screen and when i click the “im traveling” button, it takes me to a page to request a code… except it doesnt let me highlight the button and select it. Its happening on both xbox and on the TV remote itself.\n\nAny ideas?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nusucl/get_a_code_to_watch_on_this_tv_cannot_select/"
    }
]