[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pclmvl",
        "author": "BurgerNugget12",
        "title": "‘Stranger Things 5’ Opens With 59.6 Million Views, Netflix’s Biggest English-Language TV Debut Ever",
        "content": "",
        "upvotes": 437,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1pclmvl/stranger_things_5_opens_with_596_million_views/"
    },
    {
        "id": "1pctv6n",
        "author": "Glad-Ad-6240",
        "title": "sean combs the reckoning",
        "content": "This doc was put together so well. What really gets me is how he got so huge without much talent, just by attaching himself to other people’s success. Diddy has harmed a lot of people, but the part that blew my mind was the evidence pointing toward his involvement with Pac’s death. I honestly think he had something to do with both Biggie and Pac’s death and was jealous of both him and Biggie, like he created this whole “beef” to get rid of them. A 50-month sentence isn’t long enough.\n",
        "upvotes": 63,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pctv6n/sean_combs_the_reckoning/"
    },
    {
        "id": "1pcdorr",
        "author": "SaberNoble47",
        "title": "The Matt Rife Xmas auto-play trailer ruins Santa in its immediate first second of dialog (US) upon entering the Netflix menu",
        "content": "Look I get it, there’s custom settings, you can turn off the auto-play trailers, you can mute, you can have kid friendly user accounts that won’t play more mature content but for the most part I don’t give a sh*t about that, my little kids don’t care and aren’t paying attention. Yes this one is ultimately on me, but I feel like  you turn Netflix on and IMMEDIATELY the auto trailer is that comedian sitting in a chair and he blurts out “it was hard when you find out your parents are Santa clause” and it’s loud and crisp and you’re just in the opening menu without navigating anywhere I think it’s a jerkoff move. Also that guy sucks. ",
        "upvotes": 206,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1pcdorr/the_matt_rife_xmas_autoplay_trailer_ruins_santa/"
    },
    {
        "id": "1pcu3uc",
        "author": "michelob81",
        "title": "Sean Combs the reckoning",
        "content": "Fantastic watch but surely 4 years in prison can't be the end of the story! The female jury member came across like she'd been on an interview for Pop idol instead of a court case. Puffy appeared to be demonic and should have received at another 2 years for his fixation with baby oil alone.",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcu3uc/sean_combs_the_reckoning/"
    },
    {
        "id": "1pcakae",
        "author": "businessinsider",
        "title": "Netflix show developer to stand trial for $11 million spending spree, including 5 Rolls-Royces, $638,000 in mattresses",
        "content": "",
        "upvotes": 146,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pcakae/netflix_show_developer_to_stand_trial_for_11/"
    },
    {
        "id": "1pcw8wa",
        "author": "YaNiBBa",
        "title": "Wolf of Wall Street is censored now?",
        "content": "So Wolf of Wall Street is back on Netflix and I decided to watch it, yet again. But this time for whatever reason, it's censored with blurred out genitals which I've never seen on Netflix, especially when it wasn't censored before.",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcw8wa/wolf_of_wall_street_is_censored_now/"
    },
    {
        "id": "1pcfjd3",
        "author": "DizzyBeyBlade",
        "title": "Ozarks is top 10",
        "content": "I'm on my 4th rewatch of this show and I'm willing to argue that it is an absolute masterpiece. I take into account everyone has their own taste in media and the fact that what resonates with me might not work for others, but the storytelling, character development, and emotional depth here are unmatched in my eyes. The only contenders I have to this show are THE BODYGUARD &amp; HOUSE OF CARDS (prior to the bullshxt)",
        "upvotes": 18,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfjd3/ozarks_is_top_10/"
    },
    {
        "id": "1pcyptx",
        "author": "tvuniverse",
        "title": "ROTFLMAO: Does Netflix not advertise their shows outside of Netflix anymore? I missed the whole season!",
        "content": "I had ZERO idea there was a season 2 of Squid Game The Challenge. I only found out today because a local tv news interview with one of the contestants showed up in my suggested videos on Youtube. WTF! Like I heard literally NOTHING about this show and apparently all the episodes dropped weeks ago.\n\nThis is not the first time Netflix shows have flown under my radar....Had no idea about Knives Out 3 either!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcyptx/rotflmao_does_netflix_not_advertise_their_shows/"
    },
    {
        "id": "1pcwscq",
        "author": "MrProobYT",
        "title": "RDR Netflix Bug",
        "content": "# RDR netflix got released today and i am not able to play because of all this bug wher the screen becomes glitchy green does anyone have the same problem and how to solve it (I use iphon e 10 XS Max)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcwscq/rdr_netflix_bug/"
    },
    {
        "id": "1pcvev6",
        "author": "y2corbin",
        "title": "Episode choosing feature",
        "content": "Is anyone else having the issue where you can’t see the episode list anymore? I clicked on Stranger Things after I watched Season 5 to look at the extras and it started playing Season 1 Episode 1 and the episode list is now blank. I restarted my TV and it still had the same behavior. I really don’t like the new feature where it starts a show automatically without letting us choose the episode first. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcvev6/episode_choosing_feature/"
    },
    {
        "id": "1pct4zy",
        "author": "Spudnic16",
        "title": "Season 2 of Squid Game reality show seems kinda fishy (plants/paid actors)?",
        "content": "I’m about half way through the second season of Squid Game reality show and the whole thing seems kinda fishy imo. When my family was watching it, my brother theorized that certain players were actually paid actors that sabotage the game to make it more interesting. He said this during the six legged pentathlon game when the player who was portrayed a spoiler brat did horrendously at it when faces against the twins. \n\nMy brother then theorized that she was an actress planted into the game to be unlikable and get the pre-established “main” characters through the first game. I felt his claim had some merit due to how badly she in particular did in the game, but I wrote this off as her just genuinely doing terribly and the producers simply playing up her “spoiler brat” past in post-production. Still, I kept the thought in the bad of my mind.\n\nCut to the end of episode 4. Everybody simultaneously agrees to just refuse to play the game. That on its own it very strange. Players had every reason to betray that agreement, and all it would have taken was one team to do so for the whole thing to fall apart. Then they get in teams of 2 anyway, and that’s how the producers decide marbles opponents.\n\nIt seems extraordinary unlikely that ALL players would simply refuse to keep playing, and that the producers either a. had planned on that happening or b. had all the marbles ready to go within minutes of that happening. \n\nHow could the producers have planned on that happening, if all players were genuinely just playing the game?\n\nIt all seemed to line up a bit too well.\n\nMakes me think that the show either has plants disguised as players to influence the outcome or is just outright scripted.\n\nWhat do you think?\n\nTL;DR: it seems highly unlikely that the producers of Squid Game reality show could have anticipated everyone refusing to play at the end of game 3. Makes me suspect the show has paid actors or is just outright scripted. What do you think?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pct4zy/season_2_of_squid_game_reality_show_seems_kinda/"
    },
    {
        "id": "1pci36w",
        "author": "cataniluel",
        "title": "Can you play Netflix Games in a long flight that goes over 10 hours?",
        "content": "Last time I tried with my boy, his data was gone as soon as we landed and got online but it was 1-2 years ago. \n\nI guess it depends on the games but has anyone tried it recently? \n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pci36w/can_you_play_netflix_games_in_a_long_flight_that/"
    },
    {
        "id": "1pcbv4a",
        "author": "Anxious_Maize_1823",
        "title": "Red Dead Redemption now available to download on App Store",
        "content": "Version 1.50.60293175 is now available to download and the size is 3.08 GB before any in-app downloads. The requirements however is iOS or iPadOS 18.0 or later.",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv4a/red_dead_redemption_now_available_to_download_on/"
    },
    {
        "id": "1pcs32k",
        "author": "zestylemonpulp",
        "title": "Dramedy Recommendations?",
        "content": "Hello, does anyone have any recommendations on what to watch next? Some shows I have enjoyed are Breaking Bad, You, The Beast in Me, Maid,  Beef, In The Dark, Nurse Jackie, Hunting Wives etc",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcs32k/dramedy_recommendations/"
    },
    {
        "id": "1pcry17",
        "author": "SpotonSpot873",
        "title": "Episode 6 of the Beast in me missing on Netflix US",
        "content": "Episode 5 is displayed twice. I’ve clicked on both and both start episode 5, so there’s 8 total but episode 5 is displayed twice. Hoping someone at Netflix sees this. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcry17/episode_6_of_the_beast_in_me_missing_on_netflix_us/"
    },
    {
        "id": "1pcrwn3",
        "author": "Ajax2Ajax",
        "title": "Is there an easy way to mark a series as unmatched?",
        "content": "So, Netflix is kind of bad when re-watching a series. If you have already watched it, it often doesn't give you the iption to jump into the next episode, so you have to know which episode you were watching and manually look for the next one, which usually starts on the ending credits, so there one more extra step to make it start from the beginning. \n\nIn short, my toddler only likes like 3 cartoons and when he's allowed to watch tv, he watches and re-watches the same thing over and over. As he's to young to know how to navigate the ui, I have to do it for hi, which is particularly bothersome when he's watching 15min episode cartoons (sea of love is even shorter).\n\nI know there is a way to do this via web browser, but there has to be a way to do it via the app... I mean who uses a web browser for Netflix? Also, there are so many apps that give you this option, it's so easy and not a new thing at all.\n\nAny help would be appreciated. \n\nEdit: sorry I cant edit the tittle. It was supposed to say unwatched, not unmatched. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pcrwn3/is_there_an_easy_way_to_mark_a_series_as_unmatched/"
    },
    {
        "id": "1pcqwjg",
        "author": "Shetland95",
        "title": "Freezing frames",
        "content": "\n\nWhat could be the reason for netflix freezing on frames for a couple of seconds ( but the sound keeps going)  and  doing this every few minutes ?\n\nGalaxy tab A8\n\nNB : it doesnt do it with any other streaming apps. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pcqwjg/freezing_frames/"
    },
    {
        "id": "1pbnpt4",
        "author": "RiskAndReason",
        "title": "What do you think is the most overrated thing on Netflix?",
        "content": "Curious what everyone’s pick is for the most overrated Netflix show or movie.\n\nWhich title do you think gets way more hype than it deserves, and why? \n\nI’m not looking for hate, just honest opinions and maybe a few hot takes. 🫡",
        "upvotes": 211,
        "comments": 698,
        "media": null,
        "permalink": "/r/netflix/comments/1pbnpt4/what_do_you_think_is_the_most_overrated_thing_on/"
    },
    {
        "id": "1pcq0g8",
        "author": "amazon_sdee",
        "title": "Netflix interview structure!",
        "content": "Hey everyone! I’m chatting with a Netflix recruiter soon for a Distributed Systems role and wanted to see if anyone here has insight into their recruiting process or what to expect. Any tips would be super appreciated!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pcq0g8/netflix_interview_structure/"
    },
    {
        "id": "1pbdb97",
        "author": "Ha8lpo321",
        "title": "Netflix quietly killed casting from phones to newer Chromecasts and Google TV Streamer",
        "content": "",
        "upvotes": 308,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdb97/netflix_quietly_killed_casting_from_phones_to/"
    },
    {
        "id": "1pcbv0t",
        "author": "HereW1thoutDorinda",
        "title": "Netflix Home Screen",
        "content": "PSA to parents:  when I opened Netflix today, the first preview clip is the Matt Rife Christmas special and immediately talks about how Santa is really your parents. I tried to contact Netflix to have this updated but hopefully others will message them too. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pcbv0t/netflix_home_screen/"
    },
    {
        "id": "1pcuakj",
        "author": "Stock_Cheesecake5969",
        "title": "Is “I think we’re alone now“ featured in another show?",
        "content": "Obviously the answer is yes. After watching stranger things s5 snd hearing Tiffany’s “I think we’re alone now” I keep trying to pick out what show its from.\n\nI believe it’s a montage of a bunch of different characters pairing up and hooking up. So my immediate thought was the show sex education, but I can’t really place it.\n\nUpdate: Not umbrella academy, I REPEAT, not umbrella academy\n\nIt is in fact Sex Education, i just wasn’t sure. Damn Netflix loves that song",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pcuakj/is_i_think_were_alone_now_featured_in_another_show/"
    },
    {
        "id": "1pbgp78",
        "author": "Such_Environment5893",
        "title": "What is the justification of increasing subscription prices when Netflix continues to cancel shows after 2 seasons?",
        "content": "It doesn't make any sense to me.\n\nWhy get me hooked on shows if they are not going to be finished?\n\nWhat is the justification of this cycle of killing shows after 2 seasons only to start new shows?\n\nIs the price difference THAT MUCH between a renewal vs a new show?\n\nOr is it this overwhelming desire to find the next \"Walking Dead\" or \"Game of Thrones\" mega hit? Is it a case of \"unless it goes viral, its a failure?\"\n\nThe economy of streaming services is pissing me off. These price increases don't seem justified in the slightest.\n\nThis is why I've more often switched to watching YouTube, as at least I can rely on those content creators to keep giving me content I want to watch instead of \"well, my last video didnt get 1 million views, so I guess I'm calling it quits!\".",
        "upvotes": 128,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1pbgp78/what_is_the_justification_of_increasing/"
    },
    {
        "id": "1pceoje",
        "author": "mayyam808",
        "title": "No english subtitles??",
        "content": "I tried to watch one punch man earlier this year and it didnt have english subtitles only arabic ones searched it up no one seemed to have this issue now im trying to watch spy x family exact same problem no english subtitles only arabic my app is on english the languages preference is english i dont have any arabic anywhere on my phone why is it doing that? \n\nFor spy x family i only have english dub the original sub or arabic dub but for the subtitles its only arabic \n\nOne punch man is basically the same but no arabic dub only subtitles \nIm talking about the first episode of the first season so its not like it just didnt get translated yet",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pceoje/no_english_subtitles/"
    },
    {
        "id": "1pckslt",
        "author": "fa11enw1ngs",
        "title": "Restricted on an 18+ account?",
        "content": "Red dead redemption 1 just released and I’ve been trying to access this through my phone, problem is that Netflix keeps telling me my maturity rating is too low to play this even though it’s an unrestricted account? Any fixes for this? My parent’s accounts work just fine and we have the exact same settings?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pckslt/restricted_on_an_18_account/"
    },
    {
        "id": "1pc1ufz",
        "author": "TimesandSundayTimes",
        "title": "Gary Lineker nets multimillion Netflix World Cup podcast deal",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pc1ufz/gary_lineker_nets_multimillion_netflix_world_cup/"
    },
    {
        "id": "1pc2rjw",
        "author": "Hot-Slide-7305",
        "title": "Christmas movies",
        "content": "I've recently got netflix got put on my Television, at this time of year there will no doubt be plenty of Christmas TV shows/movies on it, can any of you recommend any of good ones you think I may enjoy?\n",
        "upvotes": 5,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pc2rjw/christmas_movies/"
    },
    {
        "id": "1pcd303",
        "author": "intelerks",
        "title": "Ross Duffer rules out a 'Stranger Things' feature film as live-action spinoff moves forward",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pcd303/ross_duffer_rules_out_a_stranger_things_feature/"
    }
]