[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m7yfl2",
        "author": "manzworld",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle\nThe woman who claims to be the real life Martha from the hit Netflix show Baby Reindeer is suing the streaming giant for $170 million, with a pretrial conference taking place",
        "content": "Article - A woman claiming to be the real life Martha from Baby Reindeer [is suing Netflix for $170 million](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-real-life-martha-524997) and one legal advisor has warned [the streaming giant](https://www.themirror.com/all-about/netflix) to expect a \"long\" court battle.\n\nFiona Harvey [filed a lawsuit against Netflix last year for defamation](https://www.themirror.com/entertainment/golden-globes-netflix-baby-reindeer-882144), intentional infliction of emotional distress, negligence and violation of her right of publicity, according to court documents obtained by The Mirror US. She alleged Netflix \"created an easily accessible road map to allow viewers to track her down in real life and connect the dots to her identity.\" In the show, the character Martha is played by Jessica Gunning.\n\nHarvey claimed she was \"tormented\" after [the show, in which she isn't named](https://www.themirror.com/entertainment/celebrity-news/baby-reindeers-richard-gadd-issues-462748), was released. She said she suffers from \"anxiety, nightmares, panic attacks, shame, depression, nervousness, stomach pains, loss of appetite and fear, extreme stress and sickness,\" according to the court documents. She's seeking $170 million in damages.\n\nA pretrial conference will be taking place in regards to the case today. Legal advisor James Pipe has spoken to The Mirror US and shared what he thinks Netflix could expect as the case begins.\n\nPipe told us, \"This lawsuit between Fiona Harvey and Netflix is already making headlines, and honestly, it's got all the ingredients of a long, messy legal battle. Harvey is suing for $170 million, claiming Baby Reindeer is basically a version of her life, and that Netflix defamed her, violated her privacy, and acted negligently by letting it air. But is she likely to win? That's not so easy to say.\"\n\nHe continued, \"First, she’ll need to prove that viewers could clearly tell she was the inspiration behind the character, and that what was shown was both false and harmful to her reputation. That's a tall order.\"\n\nThe expert explained, \"Netflix hasn't named her, and the show is billed as a dramatized 'true story', meaning some parts are based on real life, but others are fictionalized.\" When suggesting how Netflix will respond, Pipe said they will \"likely lean hard on freedom of speech.\"\n\nHe added, \"They'll argue that the show is protected artistic expression, that names and details were changed, and that no reasonable viewer would assume the character was a 100% accurate portrayal of a real person, especially someone never named.\"\n\nPipe also suggested Harvey might find it difficult to win the negligence parts of her case. \"They'll argue they didn’t act recklessly and took steps to fictionalize the story,\" he said.\n\nThe trial could be a long one, according to Pipe. \"With a claim this size and the level of media attention, we're probably looking at least a year or two before there's any final decision, unless they settle early, which can happen if both sides want to avoid a drawn-out court fight,\" he suggested.\n\nThe expert concluded, \"Bottom line: Harvey has a shot, but Netflix has deep pockets and strong legal arguments. It’s going to come down to whether the court sees this show as storytelling, or something more damaging.\"\n\nBaby Reindeer tells the dramatized story of comedian Richard Gadd's experience of being stalked, with the character Martha ending up with a nine-month jail sentence for her harassment against him. In a statement shared with The Mirror US, Harvey previously said, \"Earlier in 2024, Netflix released a program called 'Baby Reindeer', which they billed and marketed as a 'true story'. One of the two main characters, 'Martha', was clearly intended to be based on me.\"\n\nJames Pipe is a legal advisor who spoke with The Mirror US on behalf of [Free Grants For Felons](https://www.freegrantsforfelons.org).",
        "upvotes": 599,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yfl2/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1m86v7l",
        "author": "Odd_Eye_8730",
        "title": "Just finished Blue Eye Samurai. What a fantastic show!",
        "content": "Just finished Blue Eye Samurai and I’m honestly blown away. The animation is absolutely stunning — every frame feels like a piece of art, blending traditional Japanese aesthetics with a cinematic, modern flair. The fight choreography is some of the best I’ve seen in adult animation — fluid, intense, and grounded in real emotion. But it’s not just eye candy. The storytelling is layered and powerful, exploring identity, vengeance, and isolation with remarkable depth. The voice acting (especially Maya Erskine) brings so much weight to the characters, making them feel heartbreakingly real.\n\nWhat really impressed me was how Blue Eye Samurai balances action with emotion. The writing never talks down to the audience — it trusts you to understand the character’s internal struggles without spoon-feeding exposition. The historical setting adds another layer of richness without feeling forced or preachy. It’s raw, mature, and unafraid to be brutal when the story calls for it. Easily one of the most compelling shows Netflix has dropped in a long time, and I truly hope it gets the recognition (and second season) it deserves.",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m86v7l/just_finished_blue_eye_samurai_what_a_fantastic/"
    },
    {
        "id": "1m803tg",
        "author": "Personal_Bus_758",
        "title": "Why am I sure Amy Bradley fell off board",
        "content": "\nI personally believe that more than one eyewitness is lying. Besides the two girls in the ship I really don't buy the other stories. What makes me doubt whether she was trafficked or not is her leaving her wallet and shoes behind. A missing pair of shoes would prove she exited the room by her own feet. Usually people don't bring too much shoe wear to a week trip in a ship- mostly sandals and something for the nightclubs. If my sister were missing and she left her shoes behind, I would search in the wardrobe in case she picked another pair of shoes. If this was the case, they would have mentioned it. \n\n And if she was promised drugs like the navy said (I personally don't like that guy for a million reasons. Like wdym you didn't report it to extra military authorities asap. He's just, and I apologize for the language, a selfish scum) she would have taken her wallet and ID with her. In many trafficking operations victims are asked to bring along such documentation, especially cash money. Also, I found it weird her friends and family didn't mention any past history with drugs. The brother said she just smoked and drank, but not even a single thing about weed or some stronger stuff. Nor did her friends. Even there were some pictures in which she held pills, I wouldn't take that as a definitive hint.\n\nAnother important point, the pictures on the prostitution website were proven not to be her, since the tattoos don't match with other pictures that weren't shown on the doc. I don't know why they left that out. I feel like they left a lot of things out \n\nThe easiest explanation is that she  fell off the board, (maybe she felt a bit sick and wanted to puke or something), but then the two girls that saw her would have been confused or lying. If these girls are being truthful, then the father never saw her in the balcony, since one can't just teleport in so little time. They recently interviews yellow, who I noted didn't appeared on the doc, and some people noted that he lied about when he came back to his room. I haven't watched the video so I can't confirm myslef. That's something I read on the brother's X, who talks about scientology and shit... how the hell does someone get to that conclusion?\n\nThe trafficking narrative is overly complicated and has so many gaps were one has to fill with wondering and subjective eyewitnesses that might have been influenced by the phycosis of the media surrounding the case. It's not new people coming forward claiming to see someone who was already dead by then. The taxi driver, the tourist, the navy and the woman... I don't know, the way they told their stories was too fantastical to believe. \n\nBut if she did in fact fell off board, why haven't they found the body? Some people say she was eaten by fish, but I don't believe that. They mentioned in the doc that some mafias, more likely drug dealers or traffickers of all sorts (remember Curacao is relatively near to Venezuela and Colombia) operated there. Perhaps the body was found by someone who didn't report to the authorities, maybe because of fear of because they worked with this associations.\n\nPerhaps there are more witnesses who either are afraid to come forward or just didn't know it was her, or didn't care. I just found out about the case on Netflix. I hope the doc brings more leads to the case, and justice is brought to her and all similar victims. My family after watching the doc blamed Amy for her stupidity, selfishness and nativity. But I don't believe she was the kind of person to leave for drugs in such a shady situation without at least telling someone she was leaving, or writing a note. \n\nEDIT: I also forgot, was her key card in the cabin? That would be the first question I'd ask her brother. If the key card was missing, she either \n\nA) left and planned to come back\n\nB) fell off the balcony with the key card\n\nIf the key card was in the room\n\nA) she either left and didn't plan to come back, which doesn't make sense since she wanted to stay in the boat\n\nB) she left and forgot about it \n\nC) she fell off the balcony \n\nDoes anyone know whether her key card was found and if Brad knows about it? ",
        "upvotes": 27,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1m803tg/why_am_i_sure_amy_bradley_fell_off_board/"
    },
    {
        "id": "1m77f2i",
        "author": "Legitimate_Ad3625",
        "title": "KPop Demon Hunters has made Netflix history by breaking an unlikely record 5 weeks after its release",
        "content": "",
        "upvotes": 855,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1m77f2i/kpop_demon_hunters_has_made_netflix_history_by/"
    },
    {
        "id": "1m898ml",
        "author": "Huseynov26",
        "title": "Any quick watch movies that are a great one and done? (Example: Red Eye, Speed, Fall)",
        "content": "Movies that dont need too much thinking and does not get boring with needless exposition and boring middle or beginning portions. Best examples that I can give is movies like Red Eye, Speed, Fall, Phone Booth). My wife gets bored too quick watching movies unless the movie is like 90-100 minutes long with not a lot of exposition that keeps you on the edge. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m898ml/any_quick_watch_movies_that_are_a_great_one_and/"
    },
    {
        "id": "1m88rj3",
        "author": "MysteriousDelay6266",
        "title": "Train Dreams | Official Teaser | Netflix",
        "content": "Starring Joel Edgerton, Felicity Jones, with Kerry Condon and William H. Macy.\n\nFrom the Academy award nominated co-writers of Sing Sing.\n\nBased on Denis Johnson’s beloved novella, Train Dreams is the moving portrait of Robert Grainier, a logger and railroad worker who leads a life of unexpected depth and beauty in the rapidly-changing America of the early 20th Century.\n\nTrain Dreams, in select theaters this **November 7** and on Netflix **November 21**.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m88rj3/train_dreams_official_teaser_netflix/"
    },
    {
        "id": "1m88o55",
        "author": "khargooshekhar",
        "title": "A Deadly American Marriage - the bizarre lies",
        "content": "I just watched this documentary on Netflix, and I am thoroughly disgusted with the outcome. While I understand that it would be distressing for Molly to think that the children she was helping to raise could be taken away from her, particularly after experiencing a miscarriage. I also can empathize with the fact that the refusal to formally adopt the children made her feel illegitimate and sidelined in their role as mother figure (even though Jason’s family maintained that he *was* taking steps to move forward with the adoption, but he was concerned about custody - which I find to be completely legitimate). \n\nHowever, trying to effectively erase the biological mother of two small children and late wife of her current husband is inexcusable. I believe both of the children’s accounts that she was overbearing and needed constant reinforcement that they loved her and saw her as their mother. It’s a tough spot to be in, but she displayed such utter disrespect (to put it lightly) to the memory of Mags that I just cannot fathom this. I myself lost my father to illness at a very young age, and I cannot imagine my mother trying to replace another man as my father. That doesn’t mean a child can’t accept a new person as a parental figure in their life, but it should never be at the expense of someone’s memory and legacy. \n\nMy real discussion point, however, is the bizarre lies she told about going to Ireland to be their godmother, as if they already had a very close relationship with the family prior to Mags’ death. Why was this just mentioned and then glossed over? That is a HUGE lie! Then also telling a book group that she gave birth to Sarah?! I found these to be very significant details that speak to her propensity to tell flat-out lies that she could never back up. That is just pathological. \n\nWhat does everyone make of this omission? They mentioned it and then didn’t elaborate at all. There was also something, if I’m not mistaken, about him being a professional boxer or something? What the hell? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m88o55/a_deadly_american_marriage_the_bizarre_lies/"
    },
    {
        "id": "1m7ybka",
        "author": "begentlebutrough",
        "title": "Six feet under, underrated",
        "content": "Watch it right now if you haven’t. It’s about a family that owns a funeral home, and delves deep into basically any topic and experience you can imagine. The show is truly unique and made me cry more than I care to admit, especially the finale. \nThe sound track is beautiful, the characters are dynamic and you love and hate them, the cast is amazing. It’s real world, it’s an experience that I haven’t seen done so beautifully other than with this show. \nWatch it now \n",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ybka/six_feet_under_underrated/"
    },
    {
        "id": "1m76lde",
        "author": "Double-Reputation151",
        "title": "so...just finished watching building the band",
        "content": "ngl im massively dissapointed that szn4 didnt win but ngl they also lowkey messed up in episode 10...\n\nidk why for episode 10, the performance to win it ALL, they chose to stay pretty static on stage :/ the song choice was just lackluster tbh I was pretty confused when they chose \"Human\" which is a pretty repetitive song that says the same phrase like 50 times. not the greatest choice for a competition to win 500k\n\nI already started to see szn4's loss coming as I watched episode 8 and 9 because they didn't choose great songs at all :/ believer didn't have enough vocal range and complexity to show the uniqueness of szn4 and I forgot what other song they sang (speaks volumes)\n\nits just so disappointing because earlier in the game, somebody that I used to know and sweet love ate SOOOOOO hard and listening to them sing those songs gave me goosebumps. they really missed the mark with song selection - don't get me wrong tho, they sounded great still and their uniqueness still makes them a superior band\\~\n\nmeanwhile 3quency definitely chose very fitting songs - they had dynamic choreo and they just looked and sounded like what someone would typically think of when you say \"girl group\" - the fact that they just fit the image probably played a role in their ultimate win",
        "upvotes": 193,
        "comments": 348,
        "media": null,
        "permalink": "/r/netflix/comments/1m76lde/sojust_finished_watching_building_the_band/"
    },
    {
        "id": "1m7lfgb",
        "author": "Mr-RedT",
        "title": "When Netflix almost got sold to Blockbuster",
        "content": "In 2000, Netflix offered to sell to Blockbuster for $50 million.\n\nBlockbuster said no. \n\nToday, Netflix is worth over $200 billion — and Blockbuster has one store left.",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m7lfgb/when_netflix_almost_got_sold_to_blockbuster/"
    },
    {
        "id": "1m7w6rm",
        "author": "Rushkovski",
        "title": "Next Zerocalcare series WHEN???!!!",
        "content": "Tear Along The Dotted Line was a masterpiece and so was This World Can't Tear Me Down...\n\nThe first two shows were two years apart, so I hope he was more in him to make and Netflix keeps ordering them because if they don't I *will* start a GD kickstarter.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7w6rm/next_zerocalcare_series_when/"
    },
    {
        "id": "1m77eb5",
        "author": "Sadie_UK",
        "title": "With The Gentleman series 2 currently filming, which do you prefer? Movie or Series?",
        "content": "I love both, but I feel the movie is JUST a little better than the series. What do you think? I'd imagine we'd get a trailer after Christmas!",
        "upvotes": 47,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1m77eb5/with_the_gentleman_series_2_currently_filming/"
    },
    {
        "id": "1m7ysuy",
        "author": "whomda",
        "title": "Menu previews and sounds much louder than programs recently?",
        "content": "It seems a recent change on our system, that the audio is level is much louder when browsing titles in the menus then when playing a movie. This includes video previews and menu navigation sounds. Anyone else seen this or have advice?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ysuy/menu_previews_and_sounds_much_louder_than/"
    },
    {
        "id": "1m7xb4y",
        "author": "HehroMaraFara",
        "title": "Critical: Between Life and Death",
        "content": "There’s a bunch of similar type shows, like Lennox Hill, that I really enjoyed. This one has its good moments, but I actually found it ended up being way too gratuitous than it ever had to be and lost the story pretty quickly along the way. \n\nIt’s almost more something you might expect to watch in a 2nd or 3rd year class in a pre-med program in college. I actually even enjoy good horror movies and I had to fast forward a ton because it ended up just being big stretches of watching the full on surgery and long shots of the injuries and wounds.\n\nWatch it if you really get off on fucked up injuries, I know some do, but skip it if you enjoy the stories and getting a vibe for what’s happening in a hospital the 99.99% of the time you aren’t there. Instead watch the aforementioned doc. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m7xb4y/critical_between_life_and_death/"
    },
    {
        "id": "1m727zn",
        "author": "nickmillersmaid",
        "title": "Why are they rapid firing so many Trainwreck documentaries?",
        "content": "I loved Woodstock 99’. Since, I’ve watched Astroworld, Poop Cruise, and Balloon Boy. I love this style of documentaries, so I’m satisfied and entertained. I’m just wondering why they’re releasing so many all at once? When Woodstock 99’ came out, I was wondering why they wouldn’t continue the series (Like Monsters, the Jeffrey Dahmer series and later the Menéndez Brothers.) ",
        "upvotes": 74,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1m727zn/why_are_they_rapid_firing_so_many_trainwreck/"
    },
    {
        "id": "1m8210z",
        "author": "No_Brain292",
        "title": "New Netflix Show (26F)",
        "content": "Good morning lovely peeps - I am currently watching a new show on Netflix called “Building The Band” and I just need someone else to tell me they’re watching this show so we can talk about it. No one around me ever watches what I watch so I feel like I never get to talk about anything with anyone! So let’s go shall we? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m8210z/new_netflix_show_26f/"
    },
    {
        "id": "1m7wxo4",
        "author": "ace_loser_whitebeard",
        "title": "Cpop Satan hunters- Rice the pop (non-oc MV)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7wxo4/cpop_satan_hunters_rice_the_pop_nonoc_mv/"
    },
    {
        "id": "1m81t1y",
        "author": "jerkoff1610",
        "title": "People think this overlooked shoe theory in the Amy Bradley case might have been a key piece of evidence",
        "content": "I’ve been thinking about this shoe theory in the Amy Bradley case. From what I’ve read, she brought like 10 or more pairs of shoes on the trip. It just seems really strange to me that someone who obviously loves shoes would leave barefoot or leave shoes behind. That feels like a pretty big detail that was defo overlooked.\n\nI don’t know, maybe it’s nothing, but it kind of makes me wonder if there’s more to the story here. So confusing, whether she jumped, fell, or got abducted. I wish this theory were pursued and we'd get answers.\n\n\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m81t1y/people_think_this_overlooked_shoe_theory_in_the/"
    },
    {
        "id": "1m7ctuo",
        "author": "ladyaftermath",
        "title": "Finally watched a Deadly American Marriage - question about interviews",
        "content": "Why didn't the interviewers ask Molly more questions about her lying to people regarding how she knew the kids' birth mother or how she claimed to give birth to them? I'd be curious what her answer would be.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ctuo/finally_watched_a_deadly_american_marriage/"
    },
    {
        "id": "1m70z0d",
        "author": "Atlast_2091",
        "title": "All of Us Are Dead | Season 2 Announcement | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 42,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m70z0d/all_of_us_are_dead_season_2_announcement_netflix/"
    },
    {
        "id": "1m7qmoq",
        "author": "Mafesbfr7",
        "title": "Building the band",
        "content": "Anyone else get the feeling that it's completely scripted? I'm watching the judges' discussion and the acting is so bad...\nYou can see it's not natural at all.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m7qmoq/building_the_band/"
    },
    {
        "id": "1m7pr16",
        "author": "Eyale111",
        "title": "Since the app change to edge microsoft i always have bugs like this.",
        "content": "Since the app change to edge microsoft i always have bugs like this.\n\nI already tried everything included their lame support.\n\n  \nI am here before i cancel netflix my membership.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7pr16/since_the_app_change_to_edge_microsoft_i_always/"
    },
    {
        "id": "1m7pggh",
        "author": "Fuzzy_Dragonfruit504",
        "title": "Evil “Elton John” Movie",
        "content": "Does anyone know the name of a movie, I’m pretty sure it was on Netflix, but there was an actor that played like an evil villain Elton John. I watched it maybe a year or two ago.  Not rocketman. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7pggh/evil_elton_john_movie/"
    },
    {
        "id": "1m7twy7",
        "author": "Mundane_Cause7049",
        "title": "who is your favorite character in animal kingdom",
        "content": "and why is it Pope.  i haven't been as obsessed with a character and their development since Pan in OUAT.  i have no one to talk about this with, if not Pope then why. spill all the beans ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7twy7/who_is_your_favorite_character_in_animal_kingdom/"
    },
    {
        "id": "1m7oufw",
        "author": "ZephyrosOmega",
        "title": "Screen now plays over UI, preventing me from fullscreening, pausing, or adding subtitles.",
        "content": "As said in the title, the actual UI with the progress bar, fullscreen  button, and subtitles button are all stuck under the video screen itself and can't b e interacted with. It was working just fine a couple days ago, I'm not sure what happened or how to fix it. I tried turning off hardware acceleration, refreshing, and resetting my computer. Help?\n\nhttps://preview.redd.it/2fgzus1ilpef1.png?width=4032&amp;format=png&amp;auto=webp&amp;s=2cf9874c65da4ca3385977de42d9d012d3a007be\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7oufw/screen_now_plays_over_ui_preventing_me_from/"
    },
    {
        "id": "1m7yngx",
        "author": "jerkoff1610",
        "title": "A full timeline of how Amy Bradley went missing from a Caribbean cruise in 1998",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7yngx/a_full_timeline_of_how_amy_bradley_went_missing/"
    },
    {
        "id": "1m7nw6q",
        "author": "Sync_Sy",
        "title": "Zombie Recommendations UK",
        "content": "I’m using UK Netflix and I’ve watched loads of zombie series and movies just seeing if anyone knows any more that are good I’ve not watched. I’ll try list of the top of my head what I have watched - Done Z nation, black summer, #Alive, the Korean one when they’re in the school can’t remember the name, I’ve seen quite a lot so if anyone can recommend me anything you think I might not of seen that’s really good that would be great.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m7nw6q/zombie_recommendations_uk/"
    },
    {
        "id": "1m7seae",
        "author": "Flat_Bookkeeper4850",
        "title": "Building the band should have broken up and rebuilt two bands (spoilers)",
        "content": "Hear me out. In episode 9 instead of sending Sweet Seduction home they should have told both bands they’re not working as groups (because they’re not) and give them a new option.\n\nThey have to form two new groups with the members from SS and MTM. \n\nThen they get an hour to learn a new song together and have to perform as their new group, and the stronger one gets to progress.\n\nIt still leaves the power and decision making with the singers but gives us an underdog to root for (because there isn’t really one now), brings some fresh energy, shows us another mixed group. \n\nAnd obviously the interpersonal dynamics (seeing who is quick to abandon their band, the Connor Allison thing, etc).\n\nThoughts? What would you change? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7seae/building_the_band_should_have_broken_up_and/"
    },
    {
        "id": "1m7nes5",
        "author": "The10thDoctorWhovian",
        "title": "Is there any way to remove the preview images that show up between episodes?",
        "content": "I was planning on introducing a show to someone, but I noticed the preview image that pops up between episodes contains a MASSIVE spoiler for one of the characters. Is there any way to change or remove the image? It pretty much makes it unwatchable on Netflix, since it literally pops up each time between episodes...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7nes5/is_there_any_way_to_remove_the_preview_images/"
    },
    {
        "id": "1m7uwfs",
        "author": "National_Tangerine72",
        "title": "I'm so excited!",
        "content": "Wow, can’t wait for Netflix’s Minecraft series… coming out right after the Sun dies in 5 billion years! This will be amazing! I can't wait! Pure joy 🙌🙄",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7uwfs/im_so_excited/"
    }
]