[
    {
        "id": "1n2ayjv",
        "author": "ElijahWoodAMA",
        "title": "Hey /r/movies, I'm Elijah Wood. Ask me anything!",
        "content": "Hey r/movies, I'm Elijah Wood. You might've seen me in things like Lord of the Rings, Yellowjackets, Wilfred, Dirk Gently's Holistic Detective Agency, Maniac, The Monkey, Everything Is Illuminated, and other stuff. I'm also in The Toxic Avenger. It's unrated, and it's only in theaters starting this Friday 8/29/25.\n\nHere's the trailer:\n\n[https://www.youtube.com/watch?v=HKe0pep35gQ](https://www.youtube.com/watch?v=HKe0pep35gQ)\n\n&gt;Set in a fantasy world, following janitor Winston Gooze, who, after a freak accident, transforms into a mutant vigilante known as Toxie. Armed with his mop, the unlikely hero battles freaks, gangsters and corrupt CEOs while trying to save his relationship with his son.\n\nDirected by Macon Blair (I Don't Feel at Home in This World Anymore) and produced by Troma Entertainment. It also stars Peter Dinklage, Jacob Tremblay, Taylour Piage, Julia Davis, Jonny Coyne, and Kevin Bacon\n\nTickets/info:\n\n[https://toxicavenger.com/](https://toxicavenger.com/)\n\nAsk me anything reddit! Back at 12 PM PT/3 PM ET today (Thursday 8/28) to answer your questions.",
        "upvotes": 73974,
        "comments": 13646,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p16ratvfzqlf1.jpeg?auto=webp&amp;s=a921dc10c2e1a4e74056070846e37eba77acb5dc"
        },
        "permalink": "/r/movies/comments/1n2ayjv/hey_rmovies_im_elijah_wood_ask_me_anything/"
    },
    {
        "id": "1n2v8jl",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Toxic Avenger (2025), Caught Stealing, The Roses) plus throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Toxic Avenger (2025)](https://old.reddit.com/r/movies/comments/1n2v42x/official_discussion_the_toxic_avenger_2025/?)\n\n* [Caught Stealing](https://old.reddit.com/r/movies/comments/1n2v46f/official_discussion_caught_stealing_spoilers/?)\n\n* [The Roses](https://old.reddit.com/r/movies/comments/1n2v49v/official_discussion_the_roses_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Bring it On](https://old.reddit.com/r/movies/comments/1n2v4cx/official_throwback_discussion_bring_it_on_spoilers/?)\n\n* [The Art of War](https://old.reddit.com/r/movies/comments/1n2v4gl/official_throwback_discussion_the_art_of_war/?)\n\n* [The Crew](https://old.reddit.com/r/movies/comments/1n2v4k7/official_throwback_discussion_the_crew_spoilers/?)\n\n**Still In Theaters**:\n\n* [Nobody 2](https://old.reddit.com/r/movies/comments/1mqleeh/official_discussion_nobody_2_spoilers/?)\n* [Americana](https://old.reddit.com/r/movies/comments/1ms61l4/official_discussion_americana_spoilers/?)\n* [Weapons](https://old.reddit.com/r/movies/comments/1mkiuk7/official_discussion_weapons_spoilers/?)\n* [Honey Don't!](https://www.reddit.com/r/movies/comments/1mwu2vw/official_discussion_honey_dont_spoilers/?)\n* [Relay](https://www.reddit.com/r/movies/comments/1mwu2z0/official_discussion_relay_spoilers/?)\n* [Eden](https://www.reddit.com/r/movies/comments/1mwu328/official_discussion_eden_spoilers/?)\n* [Primitive War](https://www.reddit.com/r/movies/comments/1mwu35t/official_discussion_primitive_war_spoilers/?)\n* [Ne Zha II](https://www.reddit.com/r/movies/comments/1j5dv7y/official_discussion_ne_zha_2_spoilers/)\n\n\n\n**New On Streaming:**\n\n* [The Thursday Murder Club](https://old.reddit.com/r/movies/comments/1n5045m/official_discussion_the_thursday_murder_club/?)\n* [The Home](https://old.reddit.com/r/movies/comments/1n5046o/official_discussion_the_home_spoilers/?)\n* [Eenie Meanie](https://old.reddit.com/r/movies/comments/1n5043w/official_discussion_eenie_meanie_spoilers/?)\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)\n* [Happy Gilmore 2](https://old.reddit.com/r/movies/comments/1m9hjw9/official_discussion_happy_gilmore_2_spoilers/?)",
        "upvotes": 39,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1n2v8jl/official_discussion_megathread_the_toxic_avenger/"
    },
    {
        "id": "1n5n4ur",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Bob Odenkirk in ‘Normal’ - Ulysses is appointed substitute sheriff in the tiny Minnesota town of Normal. When the local bank is sacked, Ulysses unknowingly uncovers something far more explosive than a simple bank robbery.",
        "content": "",
        "upvotes": 2187,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2doefuzepjmf1.jpeg?auto=webp&amp;s=e4ba1001a0421fad6a3b1ae37cca917157acf68e"
        },
        "permalink": "/r/movies/comments/1n5n4ur/new_image_of_bob_odenkirk_in_normal_ulysses_is/"
    },
    {
        "id": "1n5khoe",
        "author": "RejectingBoredom",
        "title": "Best example of “I can’t believe these two movies were made by the same director” pairings?",
        "content": "Example:\n\nIn 1998, Martin Campbell delivered what, at that time, was one of the all time great swashbuckling adventure movies in Mask of Zorro. Complete character revival and revitalisation, one of the best comic book movies of the decade.\n\n8 years later he makes one of the all time great spy movies and all time great Bond movies in Casino Royale. \n\nTwo absolute masterpieces of their respective genres, right?\n\nThen in 2011 he directs fucking Green Lantern, one of the worst comic book movies of all time and basically put GL on ice for over a decade. Even the animation stuff cooled off on GL. \n\nSo Campbell is clearly a very talented director but he goes from a couple of all time greats to an almost universally hated movie.\n\nOther examples?",
        "upvotes": 1310,
        "comments": 767,
        "media": null,
        "permalink": "/r/movies/comments/1n5khoe/best_example_of_i_cant_believe_these_two_movies/"
    },
    {
        "id": "1n5guls",
        "author": "megamindwriter",
        "title": "The birth of James T. Kirk and the death of his father in Star Trek (2009)",
        "content": "",
        "upvotes": 2552,
        "comments": 418,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zazvxt5tthmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n5guls/the_birth_of_james_t_kirk_and_the_death_of_his/"
    },
    {
        "id": "1n5tazq",
        "author": "tylerthe-theatre",
        "title": "Paul Walter Hauser backed out of Rob Ford role to avoid playing 'every chubby idiot ne'er-do-well' from history",
        "content": "",
        "upvotes": 180,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/paucecElLuA3JsCh9We8pEis2uYkoe-5nBrNgDvpHIM.jpeg?auto=webp&amp;s=5142e516ef6d33b77f00fb65a329c95f883fd56e"
        },
        "permalink": "/r/movies/comments/1n5tazq/paul_walter_hauser_backed_out_of_rob_ford_role_to/"
    },
    {
        "id": "1n5plod",
        "author": "jesepy",
        "title": "Local theater is doing a 'forgotten films' marathon: what's a movie you always recommend but nobody's heard of?",
        "content": "My local theater is doing a 'forgotten films' marathon and I want to suggest some truly underrated movies from the late 90s to early 2000s. Looking for films that deserved way more attention but got overshadowed by blockbusters. I'm thinking quality dramas or thrillers that critics loved but audiences missed. What's a movie you always recommend but nobody's heard of?",
        "upvotes": 185,
        "comments": 646,
        "media": null,
        "permalink": "/r/movies/comments/1n5plod/local_theater_is_doing_a_forgotten_films_marathon/"
    },
    {
        "id": "1n59dbj",
        "author": "Happy_Philosopher608",
        "title": "I ruined Flubber for myself after rewatching it as an adult after all these years later... 😞🤦",
        "content": "I have fond memories of seeing this movie as a kid in the cinema and also breaking the VHS tape rewatching over and over, but I never truly realised until today rewatching it as an adult with a mature perspective, JUST HOW MUCH OF AN ABSOLUTE SCUMBAG PSYCHO PROFESSOR PHILIP BRAINARD is!! \n\nLike seriously, this dude leaves his supposedly beloved fiance at the altar THREE times:\n\nConstantly forgets his dates and even that he had a rehearsal dinner the night before (thus surely making Sarah feel like hes not remotely interested in her or this wedding);\n\nBriefly apologises but then acts as if its no big deal he humiliated her yet again and just tries to excuse it by saying he was busy playing with his goo all night in a darkened basement;\n\nThen spies on his ex gf and enviously lobs innocent fruit at his arch nemesis just for trying to comfort his Phil's jilted ex;\n\nProceeds to rig a junior high basketball game and cheat his team to victory just to impress his girl again (which he even brags about to her face like its meant to win her heart because he's a full blown autist who cant read emotions, comprehend social norms or even basic morality);\n\nAnd even bloody threatens literal minors to take his equivalent of steroids and indeed cheat their way to victory;\n\nBefore finally learning absolutely nothing by the end of it, and the movie ends with him once again prioritising his madcap science experiments over taking an hour to get out and marry his soul mate (who bizarrely has now given him FOUR chances to do so like a proper mug!!), and instead just calls in via Zoom to exchange vows like its a pesky distraction thats totally beneath him!!  \n\nAnd this is supposed to be the protagonist of the movie who Disney wants us to root for?! Guy's a complete scumbag ffs. Not to mention keeping all the world changing tech secrets to himself lol \n\nAnd i swear this guy isnt just simply \"absent minded\"... Hes such a genius yet cant tell time properly and misses the first wedding, whilst not realizing hes been lecturing a life drawing class for a full 5 minutes, nor that he was at a rehearsal dinner for his own wedding just the night before, is utterly bonkers!! \n\nI mean theres ditzy and scatterbrained, and then theres just full blown dementia! 🤦\n\nDear god this has spoiled my memories of this flick BIG TIME! 😞\n\nDid I miss anything? Lol. ",
        "upvotes": 2487,
        "comments": 354,
        "media": null,
        "permalink": "/r/movies/comments/1n59dbj/i_ruined_flubber_for_myself_after_rewatching_it/"
    },
    {
        "id": "1n4tt9s",
        "author": "AnonymousTimewaster",
        "title": "Steve Carrell's 2004 audition for Anchorman",
        "content": "",
        "upvotes": 12944,
        "comments": 160,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2zee7pdupcmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n4tt9s/steve_carrells_2004_audition_for_anchorman/"
    },
    {
        "id": "1n5h6f5",
        "author": "wtfytya",
        "title": "What was the first movie that kinda shattered your childhood and showed you how messy the world really is?",
        "content": "For me, it was Matilda. My parents showed me this probably thinking oh this is just a movie about this cute little girl with superpowers! \n\nThis movie wasn’t just a cute kid’s flick it was the moment I realized the world is basically a chaotic mess but there’s still some hope. Miss Trunchbull? Basically every nightmare you didn’t know you had she literally turned dessert into a war crime. Poor Bruce was up there, shoving cake while the entire school was chanting. Then there’s that pigtail scene, That Little girl shows up with cute braids, and Trunchbull is likr “Oh, you like flying?” and just yeets her across the playground, I didn’t know whether to laugh or cry, that scene still terrifies me till this day.\n\nOh and Matilda’s parents, just the absolute champions of terrible parenting. The fact that those responsible to protect you can be so evil! \n\nThen there’s Miss Honey, the one decent adult in the whole story, her character to this day remains one of my favorite, wanted to be like her growing up.\n\nAnd Matilda? Tiny but mighty basically saying, “Screw your unfair world, I’ve got powers.”\n\nThis movie taught me life isn’t always flowers and sunshines, it’s messy, painful, but beautiful sometimes ! As a kid, this movie did some great numbers for me.\n\nWhat about you? What was the first movie that gave you that “oh crap, life is complicated” moment as a kid? How did it mess with your brain?",
        "upvotes": 305,
        "comments": 289,
        "media": null,
        "permalink": "/r/movies/comments/1n5h6f5/what_was_the_first_movie_that_kinda_shattered/"
    },
    {
        "id": "1n5n1fa",
        "author": "Fisher212121",
        "title": "What ‘classic’ novels do you feel have never really had a really good film adaptation?",
        "content": "[Discussion](https://www.reddit.com/r/movies/?f=flair_name%3A%22Discussion%22)\n\nWhat ‘classic’ novels do you feel have never really had a really succesful film adaptation?\n\nWhich novels would you most like to see adapted? Feel free to go classic or modern.\n\nPersonally I’d go for ‘The Island Of Doctor Moreau’. I've always assumed the 70s version was highly regarded but turns out it isn't!",
        "upvotes": 79,
        "comments": 228,
        "media": null,
        "permalink": "/r/movies/comments/1n5n1fa/what_classic_novels_do_you_feel_have_never_really/"
    },
    {
        "id": "1n5d1vz",
        "author": "Alexgsuperfan22",
        "title": "What is the most “Halloween” Halloween movie?",
        "content": "I’m not talking about the franchise (although Halloween 3 could probably take the cake for this question), but what movie gives you the most Halloween “vibes”? I’m talking the classic motifs like bats, haunted houses, witches, dead trees &amp; leaves, pumpkins etc.! Could be for a younger or older audience I’m just curious to see everyone’s picks for this!",
        "upvotes": 439,
        "comments": 543,
        "media": null,
        "permalink": "/r/movies/comments/1n5d1vz/what_is_the_most_halloween_halloween_movie/"
    },
    {
        "id": "1n4v4gl",
        "author": "bibilima93",
        "title": "What’s a long movie that earns every minute of its runtime?",
        "content": "Some movies over 2.5 or 3 hours drag, but others fly by and leave you wanting more.\nOne perfect example is Seven Samurai. Even though it’s over 3 hours long, it never feels slow or boring. The story, the characters, and the way it builds tension pull you in completely.\n\nWhat’s a long movie that felt totally worth every minute from beginning to end for you?\n",
        "upvotes": 3836,
        "comments": 3039,
        "media": null,
        "permalink": "/r/movies/comments/1n4v4gl/whats_a_long_movie_that_earns_every_minute_of_its/"
    },
    {
        "id": "1n565rs",
        "author": "BlankSthearapy",
        "title": "Vivacious Lady (1939)",
        "content": "",
        "upvotes": 940,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hxym5piv6fmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n565rs/vivacious_lady_1939/"
    },
    {
        "id": "1n5ootx",
        "author": "Nice-Chef-3364",
        "title": "What annoys you most about film criticism/discussion nowadays?",
        "content": "What’re some things that annoy you personally the most about film criticism/discussion these days?\n\nThere are a few things but the main one I miss is general nuance. It either has to be a 10/10 movie or it’s terrible. There’s no acknowledging of good things in bad movies (which sometimes isn’t easy to find so sometimes there is just nothing redeeming about it) or criticisms for good movies. It’s always “well is it a fresh or rotten review?”, “What’s the rating?” “Sum up your thoughts in a sentence”, “movie good or movie bad”. \n\nI’m also sick of the “well you didn’t agree with me on a movie therefore I can’t listen to your opinions about anything”. It’s. Subjective. Someone not reacting the same way as you doesn’t mean their opinion is invalid. \n\nOr the whole “they just hate fun” argument. Or “why can’t you just enjoy it??! It’s not that deep!” I don’t go into every movie thinking I’m going to hate it. I do give the benefit of the doubt. \n\nSure some opinions can be pretentious. Hell - I’ve been in that boat where I question someone’s tastes because they’ll say something isn’t “that bad”. And I did not handle those conversations well. But now I don’t try to make them think they’re wrong for an opinion. I try to ask what worked for them or what didn’t. Sometimes they’ll give me a boring answer like “I was just entertained” but sometimes they’ll throw a point that I may not agree with but can understand. \n\nThere are people who are genuinely nuanced in their approach to talking about movies. But good grief it’s not what it once was. I don’t want to sound like that old guy by saying that given that I’m in my late 20’s but it has gotten worse in the last decade. ",
        "upvotes": 39,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1n5ootx/what_annoys_you_most_about_film/"
    },
    {
        "id": "1n558k0",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Dakota Fanning in ‘Vicious’ - Follows a young woman who must spend the night fighting for her existence as she slips down a disturbing rabbit hole contained inside a mysterious gift from a late-night visitor",
        "content": "",
        "upvotes": 843,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9x6c303j0fmf1.jpeg?auto=webp&amp;s=6d0c91e2b897190d16cfdc744f6cf601b79a5665"
        },
        "permalink": "/r/movies/comments/1n558k0/first_image_of_dakota_fanning_in_vicious_follows/"
    },
    {
        "id": "1n5moeg",
        "author": "BunyipPouch",
        "title": "Lav Diaz's Historical-Epic 'Magellan' Selected As The Philippines' Oscar Entry For International Feature - It stars Gael García Bernal as Portuguese explorer Ferdinand Magellan.",
        "content": "",
        "upvotes": 42,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9p5JERD0y9EwQqGpHXhvv4hUXw32-6_nCYtBTU-PAWs.png?auto=webp&amp;s=1d83470384d5aa92746041d3efa776145e866485"
        },
        "permalink": "/r/movies/comments/1n5moeg/lav_diazs_historicalepic_magellan_selected_as_the/"
    },
    {
        "id": "1n5h5ef",
        "author": "TapExtension5900",
        "title": "Swingers is the best breakup movie for guys",
        "content": "First time watching. Just recently had my girlfriend break up with me while I was being manipulated and emotionally taken advantage of the whole time. Took me until the breakup to realize. \nI always watch films to try and distract my mind but try to tap in to ones that trigger exactly what I’m feeling. The “why won’t she call?” scene got some tears rolling, because that’s exactly what I’m wondering. It’s been a rough few weeks, but I know that treatment is not what I deserve. \n\n“Baby you’re so money and you don’t even know it”\n\nOddly some of the most inspirational and motivating words I’ve heard from anyone while going through this. ",
        "upvotes": 103,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1n5h5ef/swingers_is_the_best_breakup_movie_for_guys/"
    },
    {
        "id": "1n558q1",
        "author": "Bennett1984",
        "title": "Indiana Clones of the 1980s: From King Solomon’s Mines to Romancing the Stone",
        "content": "",
        "upvotes": 620,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yi2aSwYcUYbYDUrXqfzcTjt3yOCyimzGWDoUOokVxks.jpeg?auto=webp&amp;s=fb0e6525d06f438f34d9ac27623167aede51dbf5"
        },
        "permalink": "/r/movies/comments/1n558q1/indiana_clones_of_the_1980s_from_king_solomons/"
    },
    {
        "id": "1n5eab8",
        "author": "Shaomoki",
        "title": "Dan Snow gives a chronological look at World War 2 using Movies and Films dating back as early as 1955 3h03m by History Hit",
        "content": "This is a really thick piece of content that takes a look at the major events of WWII and even looks at fictional pieces and how they create some background to some events.",
        "upvotes": 132,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s6V82Bi-Q_3Yr27QNCO8MrHv3s40Ow_BXKW7AhKemRk.jpeg?auto=webp&amp;s=136043fc524ca7473017b706b97a8511be675a95"
        },
        "permalink": "/r/movies/comments/1n5eab8/dan_snow_gives_a_chronological_look_at_world_war/"
    },
    {
        "id": "1n5d4zh",
        "author": "appalachian_hatachi",
        "title": "Mark Kermode explains the dream sequence from The Exorcist. Taken from 'Mark Kermode's Secrets Of Cinema'. [BBC iPlayer]",
        "content": "",
        "upvotes": 118,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6jqdmvyntgmf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n5d4zh/mark_kermode_explains_the_dream_sequence_from_the/"
    },
    {
        "id": "1n5fumc",
        "author": "Let_mego",
        "title": "Tell me some movies like Anaconda 1997, Jaws, Lake Placid which are visually gritty and not sterile like The Meg (doesn't have to be hollywood)",
        "content": "I really like old creature feature movies but the new ones are very \"clean\" in terms of visuals. Also I don't care about a great story but it's definitely a +.\nIt doesn't have to be creature feature but that mix of Action, evil and comedy is what I am looking for. I would love to know about some modern movies too if they are gritty \n",
        "upvotes": 72,
        "comments": 227,
        "media": null,
        "permalink": "/r/movies/comments/1n5fumc/tell_me_some_movies_like_anaconda_1997_jaws_lake/"
    },
    {
        "id": "1n5i5g8",
        "author": "meowing444ever",
        "title": "Death of a Unicorn",
        "content": "Just watched death of a unicorn… i’m really shocked on how many poor reviews and ratings it got. I’m not hard to impress with movies, but I really enjoyed it. It was comical, gory, had a good storyline, and made me cry. I feel like the story moved at a good pace and the ending was satisfying. Thoughts and opinions?",
        "upvotes": 45,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1n5i5g8/death_of_a_unicorn/"
    },
    {
        "id": "1n4soaf",
        "author": "EnazS",
        "title": "Bland, easy to follow, for fans of everything: what has the Netflix algorithm done to our films?",
        "content": "",
        "upvotes": 1157,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U5QbFdD5kVHQMyFKBxtEtYMui2fjtgLGa1nzZ9ubnsQ.jpeg?auto=webp&amp;s=8eddf491a6d5d540ce2b4bdebd76840a61afdcbd"
        },
        "permalink": "/r/movies/comments/1n4soaf/bland_easy_to_follow_for_fans_of_everything_what/"
    },
    {
        "id": "1n5genp",
        "author": "ElvisWasMyUncle",
        "title": "Was watching The Cable Guy tonight.",
        "content": "SHOCKING how many stars are in the movie. Who surprised you the most? For me it's Bob Odenkirk. For runner up I'd say Kyle Glass, from Tenacious D. The guy from Arrested Development(Tobias)/ Scary Movie 2(Wheelchair guy) sorry I can't think of the actors name. \n\nNot surprising: I love Leslie Mann's acting. This and Big Daddy, she was in both my favorite actors movies. I think she's married to Judd Apatow too. Knocked up and This is 40 are great. 👌",
        "upvotes": 44,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1n5genp/was_watching_the_cable_guy_tonight/"
    },
    {
        "id": "1n5sblm",
        "author": "BlackMonk7",
        "title": "Spike Lee Breaks Down His Best Shots From Malcom X, Do The Right Thing and More | My Best Shots",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XESLSWbYxPxGWTA-Z5clFwGqCNIFslV5Fcj5mYAVQnM.jpeg?auto=webp&amp;s=066c230537db5ae0ab50e22b6e6c0ea7a2eb6b41"
        },
        "permalink": "/r/movies/comments/1n5sblm/spike_lee_breaks_down_his_best_shots_from_malcom/"
    },
    {
        "id": "1n4xmbo",
        "author": "darth_vader39",
        "title": "Colin Farrell Delivers a Tour de Force Performance in Edward Berger's 'Ballad of a Small Player'",
        "content": "",
        "upvotes": 534,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aylJldjIJx48yG1xDOAQ4KmkqmQPSXwsbPMtqjd5ZHM.jpeg?auto=webp&amp;s=f342d3e113203eb8f343923894a816fb9e09e289"
        },
        "permalink": "/r/movies/comments/1n4xmbo/colin_farrell_delivers_a_tour_de_force/"
    },
    {
        "id": "1n5odzz",
        "author": "Puterboy1",
        "title": "Malcolm McDowell interview on Voyage of the Damned",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GQoUld-zoQcdVkB6x3ojrTfW0_60QhD74o-4Vj9JzCA.jpeg?auto=webp&amp;s=e097ae4d22acab797e5f878e36acd08f023b1c8a"
        },
        "permalink": "/r/movies/comments/1n5odzz/malcolm_mcdowell_interview_on_voyage_of_the_damned/"
    },
    {
        "id": "1n5njmf",
        "author": "BunyipPouch",
        "title": "London Film Festival: Daniel Day-Lewis, Richard Linklater, Yorgos Lanthimos, Lynne Ramsay, Tessa Thompson, Jafar Panahi, and Chloé Zhao to participate in live Q&amp;As.",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DCKV7QmVt3LJ6VUM-bYw5YhMajRhYF62lPprQTaulxs.jpeg?auto=webp&amp;s=f8d1034fafd8b1c760f9f1674911b921d64e19d9"
        },
        "permalink": "/r/movies/comments/1n5njmf/london_film_festival_daniel_daylewis_richard/"
    },
    {
        "id": "1n4sjzb",
        "author": "MarvelsGrantMan136",
        "title": "Shawn Levy Confirms Claudio Miranda (‘F1’, ‘Top Gun: Maverick’) Will Serve as Cinematographer for ‘Star Wars: Starfighter’",
        "content": "",
        "upvotes": 957,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hii22Xjk7QTcXEjf_RyzJGXki6Fo2dwxU8cF38LlCWE.jpeg?auto=webp&amp;s=42dbe1ffebc68a6c19085f26117fb580e0ab5550"
        },
        "permalink": "/r/movies/comments/1n4sjzb/shawn_levy_confirms_claudio_miranda_f1_top_gun/"
    },
    {
        "id": "1n4yz50",
        "author": "gggetswings",
        "title": "What is the best in-theatre moviegoing experience you've had?",
        "content": "I was thinking about this recently after seeing Weapons in a sold-out theatre on half-price Tuesday. To be in a place where everyone is reacting in unison - gasping and laughing, is just so special, and an experience that (to me) doesn't happen so often anymore.\n\nMy favourite experience was seeing Scott Pilgrim vs. The World the first day in a sold out theatre in Toronto (my hometown). Seeing Toronto be itself in a film (Not a US city) along with laughing at jokes that only Torontonians would get, is a special memory.\n\nWhat are some of those experiences for you?",
        "upvotes": 344,
        "comments": 890,
        "media": null,
        "permalink": "/r/movies/comments/1n4yz50/what_is_the_best_intheatre_moviegoing_experience/"
    },
    {
        "id": "1n5fl40",
        "author": "Lokitusaborg",
        "title": "Watching The Fifth Element again",
        "content": "The first time I watched this movie I was unimpressed. I thought that it felt disjointed and campy and cartoonish. I did not like it. I gave it another shot a few months later and really liked it. Now, as I’ve watched it dozens of times I have to say, it is an absolute masterpiece. The casting is spot on, the effects are fun and it is such a ride from beginning to end. It is now EASILY one of my favorite movies.\n\nAnyone else have similar experiences with other movies? Something you just didn’t get the first time around? This movie had such a hard swing for me, from thinking it was ridiculous and soft-baked to seeing how much time and effort was put into it in such a low key manner that the artistry was NOT seeing it. It legit hits all the boxes looking back. ",
        "upvotes": 30,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1n5fl40/watching_the_fifth_element_again/"
    }
]