[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 68,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1llkgpq",
        "author": "BrianLevre",
        "title": "What was the hardest thing to stomach when you watched Trainwreck Poop Cruise? SPOILER",
        "content": "For me, it's too close to call between three things:\n\n1) The sewage everywhere.\n\n2)  The completely irrational fear so many people had of pooping in a bag.\n\n3)  The women that were there having the bachelorette party.\n\nBacked up toilets making people walk through sewage... that's pretty messed up.  I don't want to imagine the smell or the illnesses people got because of it, but it's not going to last forever.  People have had to put up with worse.\n\nPooping in a bag... It beats pooping on the floor.  It's a logical measure to take when the sewage system stops working.  Poop in bags, it can all be collected, and it can be placed and contained in an appropriate area.  Truck drivers and van lifers poop in bags all the time.  It's no big deal.\n\nThose three women...  So many things about those women...\n\nFirst, the bride-to-be seemed like she was the inspiration for Kristen Wiig's role in The Californians on SNL...she was dripping with an abundance of unnecessary drama.  \"Why isn't the bar open???\"  Then taking the Imodium, doubling down on her fear of pooping without a toilet, and complaining about a soggy lettuce sandwich when there could have been zero food at all.\n\nThen the group talking about peeing in the shower.  It's like they were clueless about the fact they were born as human animals with biologic processes.  They seemed to not have an idea about how they could squat to pee in a shower.  They were disgusted with having to do it, needing a shower after.  Jeez ladies, it's just pee... ever been camping?",
        "upvotes": 89,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1llkgpq/what_was_the_hardest_thing_to_stomach_when_you/"
    },
    {
        "id": "1lldmyp",
        "author": "adham_deiib",
        "title": "IMDb ratings on Netflix!",
        "content": "Hi,\n\nI developed a chrome extension that brings IMDb ratings directly into your [Netflix](https://www.linkedin.com/company/netflix/) experience!\n\nI’ve always valued IMDb ratings, as they usually provide an accurate reflection of how good a movie or a show really is, often aligning with my own opinion—which made me realize how helpful it would be to have those ratings visible while browsing Netflix.\n\nThe idea came from the all-too-familiar struggle of endlessly scrolling through Netflix, unable to decide what my next watch is going to be.\n\n💡 It’s completely free to use—give it a try and let me know what you think! I'm actively looking to upgrade and maintain this project, so if you have any cool ideas or feature suggestions, I’d love to hear them.\n\n🧩 You can add it to your browser here: [https://chromewebstore.google.com/detail/mpepkheopbiedmfpjbikkfaehbblelbe?utm\\_source=item-share-cb](https://chromewebstore.google.com/detail/mpepkheopbiedmfpjbikkfaehbblelbe?utm_source=item-share-cb)",
        "upvotes": 42,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lldmyp/imdb_ratings_on_netflix/"
    },
    {
        "id": "1lljyg1",
        "author": "Peppermint07_",
        "title": "The Waterfront - that Grady is annoying AF",
        "content": "I don’t like his voice, it’s a high pitched, annoying voice. His demeanor is pathetic. His games are stupid. He’s the most stupid villain portrayed on TV. I feel like skipping the scenes he shows up. Does he get killed by the end of season 1? I’m so much hoping we can have a more decent villain.",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lljyg1/the_waterfront_that_grady_is_annoying_af/"
    },
    {
        "id": "1lkrm3k",
        "author": "gubigal",
        "title": "Dept. Q - Has it been renewed for another Season?",
        "content": "It needs to be.  Best show I’ve seen on Netflix in a long time.  Not what I was expecting and there are so many things I just love about the show.  The casting is phenomenal, the subplots and stories associated with each character aren’t over done or exploited.  It’s a proper amount of mysterious but powering through  and are more reflective of real life where everyone has their own struggle.  The main plot was great.  Ending was awesome.\n\nThere needs to be a season 2.  I need more of this.  Netflix - are you listening?  Season 2.",
        "upvotes": 177,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lkrm3k/dept_q_has_it_been_renewed_for_another_season/"
    },
    {
        "id": "1lloujy",
        "author": "MelodyHearts678",
        "title": "What do you guys think of Ultraman Uprising?",
        "content": "Now that it’s been 1 years since this amazing movie came out.\n\nI must say that I actually loved it.\n\nThe character arcs,\n\nThe songs,\n\nThe animations,\n\nAnd even the baby kaiju which stole my heart up first view.\n\nIt was really good.\n\nAnd probably one of my favourite 2024 movies.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lloujy/what_do_you_guys_think_of_ultraman_uprising/"
    },
    {
        "id": "1llf78s",
        "author": "ny1115",
        "title": "Standard with ads?",
        "content": "I want to watch Black Mirror and Squid Game — I don’t really mind the ads but I’ve seen people say some shows are “locked” for the standard plan.\n\nDoes anyone know if this is the case for Black Mirror and Squid Game if I choose to go with the Standard plan?\n\nTy in advance🙏🏼",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1llf78s/standard_with_ads/"
    },
    {
        "id": "1llmt53",
        "author": "slushy_potato",
        "title": "Device not registered",
        "content": "I've been logged out and logged in for the past 2 months on my laptop and mobile , even though I am on a  family plan which did include my devices too . \n\nYesterday I was able to log into netflix and watch a few shows and today on the same device it shows that the device is not part of Netflix household . What do I do ? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1llmt53/device_not_registered/"
    },
    {
        "id": "1llmdso",
        "author": "Holiday_Record2610",
        "title": "Why So Many Featured Christmas Movies In June?",
        "content": " I noticed Netflix changed their entire user interface on my TV, I haven’t checked the app. I don’t use it. And instead of having the usual tiles across the top with new movies and then the movies you’ve been watching below it and recommended movies, etc., It now shows four different sections of Christmas themed movies…? Why are Christmas movies being promoted on US Netflix right now?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1llmdso/why_so_many_featured_christmas_movies_in_june/"
    },
    {
        "id": "1ll9nrt",
        "author": "greenhierogliphics",
        "title": "The Intern",
        "content": "I just watched this feel good movie with DiNero, Renee Russo and Anne Hathaway. I really enjoyed it. Mostly light hearted and, like I say, feel good. As I am turning 65 in August and work in e-commerce, I enjoyed the theme of DiNero reentering the work force in this field at the age of 70, and finding romance as well as respect. ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ll9nrt/the_intern/"
    },
    {
        "id": "1llctiv",
        "author": "DaRealClinical",
        "title": "Your device isn't part of the Netflix household suddenly?",
        "content": "Apologies if this is a recurring issue on the sub but I didn't find any similar situations previously posted and I don't have time looking for more. \n\nI don't understand why I get the message \"Your device isn't part of the Netflix Household for this account\" suddenly. \n\nI'm the sole user of my account on my mac. Yesterday it worked fine. I'm appalled. I'm paying for a service which I can't even get. Why? Any way I can fix this without contacting support team?",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1llctiv/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1ll07j0",
        "author": "Fluffy_Hope_7287",
        "title": "I loved K-Pop Demon Hunters – but I really hope they turn it into a full series!",
        "content": "Just watched K-Pop Demon Hunters and honestly, I LOVED it. The concept, the animation, the music, the action – it was such a fun ride with way more emotional depth than I expected. But I really hope this isn’t the end and they continue the story, either with a sequel or (fingers crossed) a full series.\n\nThere’s just so much more they could explore. Like, we never got the full story of how Rumi's mom fell in love with a demon?? That could be an entire arc on its own. Also, how did the girls even meet and form the band? The dynamic is so strong, and I’d love to see those early days – both as idols and as demon hunters.\n\nPlus, the demon threat is definitely not over. At the end, the new Honmoon wasn’t gold, which I’m sure means demons can still escape into the human world. That feels like a huge open door for future stories.\n\nAnd okay, can we talk about Jinu?? I know he died, but he gave his soul to Rumi – what if that means he could come back? Maybe not as a human, but as an angel or some kind of spirit warrior? I feel like his story isn’t over yet.\n\nAnyway, I’m just hoping enough people support the movie so the creators get the green light to keep building this world. There’s so much potential!\n\nAnyone else feel the same?",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ll07j0/i_loved_kpop_demon_hunters_but_i_really_hope_they/"
    },
    {
        "id": "1llin9f",
        "author": "Revolutionary_Fly769",
        "title": "Stops",
        "content": "Netflix works good on my TVs, and used to work good on my iPhone. Now it stops every 10-15 minutes on my iPhone. Anyone else having this issue and figured out the fix? I’ve updated, deleted, reinstalled the app and it’s still happening. It was doing the same on my old iPhone. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1llin9f/stops/"
    },
    {
        "id": "1lkabs8",
        "author": "Longjumping_Land_977",
        "title": "Carnival Cruises has issued a new statement about the Trainwreck: Poop Cruise documentary",
        "content": "",
        "upvotes": 485,
        "comments": 201,
        "media": null,
        "permalink": "/r/netflix/comments/1lkabs8/carnival_cruises_has_issued_a_new_statement_about/"
    },
    {
        "id": "1llleuv",
        "author": "mel-06",
        "title": "We need a Netflix docuseries on Hollywood’s most protected abusers: Marilyn Manson, Steven Tyler, P. Diddy &amp; more",
        "content": "With so many survivors coming forward and lawsuits being filed, how do we still not have a full Netflix docuseries exposing the patterns of abuse in Hollywood and the music industry?\nWe’ve seen streaming platforms tackle R. Kelly, Jeffrey Epstein, and even Jimmy Savile — but where’s the series that digs into the ongoing cases involving people like:\n\n\n•\tMarilyn Manson – Multiple women have come forward with allegations of grooming, assault, and psychological abuse. Evan Rachel Wood’s Phoenix Rising was powerful, but barely scratched the surface and didn’t get the Netflix-level attention it deserved.\n\n\t•\tSteven Tyler – In his own memoir, he admits to becoming the legal guardian of a 16-year-old girl he was in a relationship with, allegedly coercing her into an abortion after their apartment burned down. She has since filed a lawsuit.\n\n\t•\tP. Diddy (Sean Combs) – Recently hit with a wave of lawsuits and disturbing footage. Multiple people have accused him of sexual assault and trafficking. It’s getting harder to ignor",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1llleuv/we_need_a_netflix_docuseries_on_hollywoods_most/"
    },
    {
        "id": "1llgqyl",
        "author": "Frostiielf",
        "title": "Olympo En Español - accent question",
        "content": "I tend to watch teenie Bopper TV shows in the original Spanish so I can practice my language skills. I just watched another show with some of the same actors called Ni Una Más (highly rec) and I had no problem understanding them. But in the olympos series I find it extremely difficult to understand them. I know in some instances there are clearly speaking catalan, but beyond that it does seem like it's mostly traditional Castilian Spanish. I guess I was hoping someone would tell me that they're from some region where the accent is definitely different or that they're speaking extremely fast. But any insight from native speakers or otherwise is appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1llgqyl/olympo_en_español_accent_question/"
    },
    {
        "id": "1lkp6rl",
        "author": "FukudaSan007",
        "title": "'Bet' Renewed For Second Season By Netflix",
        "content": "I really like this show and I thought for sure it wouldn't be renewed. Very happy to be wrong. I have seen the anime it's based on, of which I was also a fan, and Bet is quite a departure. However, it doesn't bother me and can stand apart from the source material. Hopefully, the second season will be as good as the first. \n",
        "upvotes": 48,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lkp6rl/bet_renewed_for_second_season_by_netflix/"
    },
    {
        "id": "1llevr3",
        "author": "Euphoric_Flow_8288",
        "title": "Netflix UK; DarkGame not showing up on my TV",
        "content": "It comes up when I look on my phone, but I've turned my TV off and on multiple times to try to fix this problem and it still refuses to show up on the search in the TV app. I've had this issue with Black Mirror a few months ago and never found any explanation for why, which I think annoys me even more than the glitch itself",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1llevr3/netflix_uk_darkgame_not_showing_up_on_my_tv/"
    },
    {
        "id": "1llbhid",
        "author": "radioheadsz",
        "title": "I need help finding this game!",
        "content": "Hi everyone im not sure how to ask this but there is  this game I played a long while ago sadly i do not know the lore or anything about it i only know its a poc mc and it's kinda turned based and you kick a ball to defeat the enemies this is so frustrating i can't find the game anywhere ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1llbhid/i_need_help_finding_this_game/"
    },
    {
        "id": "1ll49j4",
        "author": "eve_patchett",
        "title": "Extra member",
        "content": "Have taken over payment for our main account (standard plus extra member)\nExtra member wants to pay for their account separately and separate the accounts completely using their extra member login, how do I make that happen? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ll49j4/extra_member/"
    },
    {
        "id": "1lk447f",
        "author": "IrishStarUS",
        "title": "Cobra Kai stars seen in furious row after Martin Kove 'bit' Alicia Hannah-Kim",
        "content": "",
        "upvotes": 171,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1lk447f/cobra_kai_stars_seen_in_furious_row_after_martin/"
    },
    {
        "id": "1llg7kj",
        "author": "Lexnhq",
        "title": "Why do we not have comments?",
        "content": "I think it would be so dann cool if we had comments, not only on netflix but any other streaming platform. I would love to read the comments After watching a plotteist episode or something.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1llg7kj/why_do_we_not_have_comments/"
    },
    {
        "id": "1lklx58",
        "author": "lalauvte",
        "title": "what movie should i watch tonight? no horrors plz",
        "content": "just wondering i really need to watch a movie that will entertain me and enjoyable for my adhd if that makes sense. i like romance, mystery , murder , sci fi  and anime comment below plz (:",
        "upvotes": 14,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1lklx58/what_movie_should_i_watch_tonight_no_horrors_plz/"
    },
    {
        "id": "1llba5v",
        "author": "Unusual_Pineapple_19",
        "title": "Titles never available",
        "content": "I am so frustrated, I HAVE NEVER EVER, found a good recommendation online availbale on netflix and I mean NEVER. What js the point of paying 15€ or 20€/mo if I don’t find sht. No series, no movies, nothing, I MEAN NOTHING",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1llba5v/titles_never_available/"
    },
    {
        "id": "1ll4r2p",
        "author": "EPIC1NUGGET",
        "title": "What is this, and how do I fix it?",
        "content": "https://preview.redd.it/54p0rsctta9f1.png?width=740&amp;format=png&amp;auto=webp&amp;s=0572ecf222960d651a057e2dc3434ef23af1133f\n\nFor some reason when I try and watch Netflix on my pc this pops up and I don't know what it means by it, I just really confused as to why this shows now since it didn't show like a week ago",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ll4r2p/what_is_this_and_how_do_i_fix_it/"
    },
    {
        "id": "1ll9qv0",
        "author": "JitaJka",
        "title": "If you could rewatch one episode of The Rookie for the first time again — which one would it be? 👀",
        "content": "Honestly, I can't even pick just one. 😄 There are too many insane, emotional, or just straight-up badass episodes. 😅👏 Every time I think: \"Okay, this episode is the best”, the next one just comes in and totally crushes it. These writers love messing with us.💯😅 \n\nIf you could hit a \"Forget This Episode\" button just to experience your favorite The Rookie episode for the first time again... which one would it be? 👀❤️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ll9qv0/if_you_could_rewatch_one_episode_of_the_rookie/"
    },
    {
        "id": "1lkvhjo",
        "author": "Ok-Display-6604",
        "title": "Song titles!",
        "content": "In your opinion, what's one of the greatest show or movie opening songs? Is it just the song or the entire opening scene? And do you prefer long or short opening scenes? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lkvhjo/song_titles/"
    },
    {
        "id": "1lktx2a",
        "author": "Adritenki",
        "title": "Why is Scissor Seven season 5 still not on Netflix, not even any announcement or new?",
        "content": "Scissor Seven is really an amazing show (a donghua, a Chinese animated show, to be specific) which also has an awesome dub.\n\nSeason 5 was released in China in October 2024, which means 8 months ago. I would understand 6 months later, like I think it happened with season 4. But 8 months and any single announcement or something? At least Netflix could say if they really are going to something or it is cancelled or something.\n\nBasically, this all sums up in: Scissor Seven season 5 on Netflix? Yes? No? And, if yes, when?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lktx2a/why_is_scissor_seven_season_5_still_not_on/"
    },
    {
        "id": "1llbaw0",
        "author": "Maz-Dawahreh",
        "title": "Why are so many new Netflix shows making men look weak or stupid to empower women can't they just keep both strong and look good?",
        "content": "Lately, I’ve noticed a trend in a lot of Netflix shows and movies where men are portrayed as either weak, incompetent, or emotionally broken, especially when the focus is on empowering a female character. It feels like the only way they show women as strong is by making every man around them look foolish or irrelevant.\n\nIs this intentional? Why is this becoming so common? Can't strong female characters exist without making male ones seem useless?\n\nJust to be clear, this isn’t only happening on Netflix. I’ve noticed similar trends in movies and shows from other platforms, too. Netflix stands out more because of how much content it releases.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1llbaw0/why_are_so_many_new_netflix_shows_making_men_look/"
    },
    {
        "id": "1ljwlqb",
        "author": "CorpseJuiceSlurpee",
        "title": "Thoughts on Trainwreck: Poop Cruise",
        "content": "I just finished the documentary and I was pretty disappointed in the quality of this documentary.\n\nGenerally, it seems like an interesting topic, and something that I remember happening but don't really know the details of; and I feel like the events leading up to and the cause of the outage were covered pretty well. And that's kind of where my compliments on this doc stops.\n\nThe crew they interviewed were somewhat interesting.The lady who was the voice of the ship was had some great detail of the event because she was where the action and decisions were happening. The chef had some funny anecdotes. The Russian lady was solely there to be horny and call Americans stupid.\n\nThey seemingly found the absolute worst passengers to comment on their experiences. There was little more relayed than it was gross and upsetting. The bachelorette party was insufferable and somehow 12 years later hasn't changed a bit. They acted like such stereotypical bachelorette \"woo girls\" that I can't tell if they were putting on an act or if that's genuinely how they are. \n\nThe entirety of the father-daughter footage can be summed up in, \"I was scared and this experience was not what we paid for.\"\n\nI don't know if this was just the interviewees in particular or maybe it's a true cross section of the type of people who go on cruises, but all the passengers acted like pooping in the red biohazard bags was the absolute end of the world. The son in law seemed to care for little else except that. His grand victory was finding a working toilet. That's might have been the highlight of his life. I've shit into wag bags before and carried it out with me. It's not the most pleasant thing but you do what you gotta do. And they didn't even have to pack it out, they could put it in garbage cans around the ship.\n\nAdditionally all the passengers acted like they were alone on a raft weathering the elements, forced to hand deliver their turds into red bags. Let's be real, they say on their asses while the crew did actual work amidst spoiled people on their worst behavior.\n\nI would have loved to hear what the crew was doing to help passengers day to day, and they did a bit here and there, but it was never really covered. And I would have loved to hear what went on interpersonally on the ship between passengers. People were doing shitty things like hoarding and claiming territory, was there bartering? Did people form loose alliances? This could have been an interesting study on human behavior and instead the biggest takeaway was poop lasagna.\n\nAlso, there's a tie for biggest piece of shit between the Carnival Marketing guy and the Cruise Lawyer.  \n\n3/10 - Still not as bad as Untold: The Liver King",
        "upvotes": 110,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwlqb/thoughts_on_trainwreck_poop_cruise/"
    },
    {
        "id": "1lkjggi",
        "author": "Ok-Display-6604",
        "title": "The rookie",
        "content": "I've tried google'ing it but haven't seen a solid answer to the question, is season 7 of 'The rookie' ever coming to Netflix or not? Thanks in advance! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lkjggi/the_rookie/"
    }
]