[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 480,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hhwt5i",
        "author": "SoftPois0n",
        "title": "First poster for the final season of ‘YOU’ - Releasing in 2025 on Netflix.",
        "content": "",
        "upvotes": 243,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1hhwt5i/first_poster_for_the_final_season_of_you/"
    },
    {
        "id": "1hibqk2",
        "author": "Pep_Baldiola",
        "title": "Netflix is leaning hard into the 'Squid Game' universe. Its creator said he's 'sick' of working on it.",
        "content": "",
        "upvotes": 19,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hibqk2/netflix_is_leaning_hard_into_the_squid_game/"
    },
    {
        "id": "1hi641z",
        "author": "indiewire",
        "title": "What's Coming to Netflix in January 2025",
        "content": "",
        "upvotes": 22,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hi641z/whats_coming_to_netflix_in_january_2025/"
    },
    {
        "id": "1hhsfhw",
        "author": "Robemilak",
        "title": "Netflix Is Reportedly Making an Adaptation of the S.T.A.L.K.E.R. Video Game Series",
        "content": "",
        "upvotes": 102,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hhsfhw/netflix_is_reportedly_making_an_adaptation_of_the/"
    },
    {
        "id": "1hi98g0",
        "author": "deeznuttingtons",
        "title": "King of Tupelo - Possibly the goat netflix doc. ",
        "content": "I normally don't gas up shows that I enjoyed watching like this but holy shit King of Tupelo had me crying laughing and dropping my jaws in awe at just how insane the story is. The production cooked; shooting and editing were elite. One reason that I found it so entertaining was that the first two episodes set up such a satisfying twist in the last episode.\n\nKC and Everett are hysterical foils of each other, not to mention they're both absolutely fucked as individuals. Everyone interviewed are such good storytellers, having a certain southern style humor/charm that doesn't get old quickly. The ending is so good too; there's a feeling of a hero's redemption with KC which ties the story very nicely. All in all, super impressed and grateful to see Netflix invest in this show. What a treat.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi98g0/king_of_tupelo_possibly_the_goat_netflix_doc/"
    },
    {
        "id": "1hi2gre",
        "author": "iirison1",
        "title": "Shows to watch with my dad",
        "content": "I’m a 17 years old girl, who wants to bond with my dad, who’s currently on sick leave from work (that he loves dearly) and has been struggling a lot. I want to find a show with a bunch of seasons to watch with my dad to spend some time with him, but I can’t seem to find any.",
        "upvotes": 16,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1hi2gre/shows_to_watch_with_my_dad/"
    },
    {
        "id": "1hidjdi",
        "author": "JemJemIsHerName",
        "title": "Prison Break, now on Netflix ",
        "content": "I watched at least the 1st 3 seasons when it orriganly aired in 2005. I’ve been binging it on Netflix and on season 5 now. I have a love/hate with this show. The original plan to break out was so premeditated and thought out with like contingency’s on contingency for the original subsequent prison break. After that additional prison breaks and heists are like ok, I guess? I am really enjoying it but also I constantly yell at the TV “it looks like it’s time for another prison break!” ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hidjdi/prison_break_now_on_netflix/"
    },
    {
        "id": "1hi8uo7",
        "author": "tablefortress",
        "title": "Shows to Watch with a 6-Year-Old",
        "content": "My daughter (almost 6) and I have been watching Junior Bake Off together, and it's been so cozy. What other wholesome, NOT scary shows do you recommend that are interesting for both the kids AND adults watching?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hi8uo7/shows_to_watch_with_a_6yearold/"
    },
    {
        "id": "1hhymeb",
        "author": "StEvUgnIn",
        "title": "You Season 5 - Did you figure out the secret code?",
        "content": "",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hhymeb/you_season_5_did_you_figure_out_the_secret_code/"
    },
    {
        "id": "1hi460r",
        "author": "Interesting-Wait-591",
        "title": "High school TV shows recommendations ",
        "content": "Does anyone have like TV shows like outer banks, stranger things and like Riverdale S1, like high school adventurous kinda of TV show, I mean I am currently watching Riverdale and I really liked season 1 it is like the kind of TV shows that I like but after season 1 it starts getting bad, so does anybody have good TV shows in that genre??",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hi460r/high_school_tv_shows_recommendations/"
    },
    {
        "id": "1hicndy",
        "author": "dangibby",
        "title": "Purple hearts problems ",
        "content": "I feel like I’m the only person who noticed cassie was rather mean and a bitch in purple hearts, did anyone else notice she wasn’t the nicest of people, in some ways this made for a more unique film having one of the leads be a bit  unlikeable and not the nicest of people \nI had no issues with her standing up for what was right and I enjoyed the film, but I did think she treated Luke not the nicest of ways and was a bit bitchy and mean to him ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hicndy/purple_hearts_problems/"
    },
    {
        "id": "1hic42j",
        "author": "Zejjs",
        "title": "Netflix Household BS",
        "content": "My mobile devices just started complaining that they're not part of my household. The issue is I do not own a TV, and have not the slightest idea what network my household is supposed to be. I checked my signed in devices and it's only shown me the usual culprits (PC, iPad, phone). I called the Netflix support line and they advised me I buy a TV to fix this. This is such absolute nonsense. Has anyone ran into something like this and found a workaround better than inputting a code on every device 2 weeks? Would closing and re-opening my account help?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hic42j/netflix_household_bs/"
    },
    {
        "id": "1hhtyb1",
        "author": "xantub",
        "title": "TV comedies to watch with grandma (84)",
        "content": "I'm looking for shows to watch with grandma in Netflix (or Max for that matter). I'm staying with her for a month so looking for stuff to watch with her a couple of episodes a day (30 min, or one episode for 1-hour shows).  Some of the requirements are:  \n - No sex or nudity.  \n - No violence, blood.  \n - Not much drama.  \n - No \"smart\" comedy, just for reference I finished Man on the Inside with her and still had to explain things here and there.  \n - Preferably more \"wholesome\" upbeat series where good things happen.",
        "upvotes": 12,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1hhtyb1/tv_comedies_to_watch_with_grandma_84/"
    },
    {
        "id": "1hi9bv3",
        "author": "Ok-Release-1463",
        "title": "Another Harlan Coben series",
        "content": "Looking for recommendations to watch anotber Harlan Coben series adaptation. I’ve watched two that I enjoyed (the Stranger &amp; Safe) and one of them, not so much (Fool Me Once). I know there are a few but I would like some input cause I really don’t want to sit through with a series just to end disappointed. Thanks in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi9bv3/another_harlan_coben_series/"
    },
    {
        "id": "1hhjdin",
        "author": "yesidkwhat1",
        "title": "La Palma and Carry-On",
        "content": "By far some of THE most insane unrealistic pieces of media I’ve ever consumed, not a single thing made any sense and I loved every bit of all of it. Merry Christmas! ",
        "upvotes": 66,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1hhjdin/la_palma_and_carryon/"
    },
    {
        "id": "1hhshy9",
        "author": "Robemilak",
        "title": "'La Palma' - super unrealistic, but still enjoyable and bingable?",
        "content": "Some scenes were super unrealistic. Also, the plot and acting were kinda meh. Still, it was super entertaining to watch! I binged it easily. Kinda reminds me of 2022's 'Watcher.' There were a lot of cons, but easily one of the best binges of the year (speaking of 'Watcher'). What do you think?",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hhshy9/la_palma_super_unrealistic_but_still_enjoyable/"
    },
    {
        "id": "1hi6jd4",
        "author": "Character-Ad-7000",
        "title": "Sorry if it’s a stupid question ",
        "content": "I’m currently watching one piece and I’ve noticed there is a big jump between episodes so I was wondering if Netflix has a schedule to when they’ll add the one piece episodes that are currently missing ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi6jd4/sorry_if_its_a_stupid_question/"
    },
    {
        "id": "1hi62fq",
        "author": "Difficult_Most_8032",
        "title": "Good physiological thriller options? ",
        "content": "I love shows like Behind Her Eyes, all the shows by that director that did Fool Me Once, loved Perfect Couple. \n\nAny other good shows that kinda fuck with your head and keep you guessing? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hi62fq/good_physiological_thriller_options/"
    },
    {
        "id": "1hi2ds1",
        "author": "Tsooth-saya",
        "title": "3 Body Problem | Spoiler Question on San Ti",
        "content": "Pls don't read this if you haven't seen the series yet and are planning to do so.\n\n\n\n\nAlright so there's this scene in the Episode Judgment Day where the San Ti become hyper concerned about how a story about Red Riding Hood showed the ability to make up stuff that wasn't true, even if it makes a larger point.\n\nHowever, in the initial episodes, hundreds of people are playing a make-believe video game so as to recruit future supporters for the San Ti.\n\nAssuming that they were omnipresent throughout this, why the sudden breakup? 😂 So many people died because of it.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hi2ds1/3_body_problem_spoiler_question_on_san_ti/"
    },
    {
        "id": "1hhhi5g",
        "author": "Mu5hroomHead",
        "title": "Every American should watch “If Anything Happens I Love You”",
        "content": "America probably has the highest number of school shootings in the whole world. And every time a school shooting happens, it’s all over the news. It ignites conversations about gun control, etc. But in the end, nothing changes.\n\nThis short film portrays the devastation left behind after everyone forgets and moves on. It beautifully shows the destruction left behind. It’s personal, and it’s raw.\n\nI think everybody should watch this short film, especially Americans. Put yourselves in the situation of the parents…",
        "upvotes": 25,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhhi5g/every_american_should_watch_if_anything_happens_i/"
    },
    {
        "id": "1hi0gnl",
        "author": "novusanimis",
        "title": "Turning off Dolby Vision",
        "content": "So all of a sudden in the past few months they added Dolby Vision Atmos to my plan here, which is nice, but I don't like how everything looks like a high FPS videogame with unnatural movement. Is there a way to turn it off? I could only find how to change the audio in the audio selection.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hi0gnl/turning_off_dolby_vision/"
    },
    {
        "id": "1hhzx90",
        "author": "AlexAwesome1124",
        "title": "Question About Streaming on an International Flight",
        "content": "On Christmas day, I will be flying from the US to an international destination. I want to watch Netflix while in the air. More specifically, I want to watch the live NFL broadcast of the Kansas City Chiefs vs the Pittsburgh Steelers. I am, of course, willing to pay for the in-flight WiFi, but I wanted to ask how that works with streaming Netflix -- in particular, streaming live.\n\n  \nI know that sometimes on American Airlines flights, they will have live television that you can watch on the seat-back screens, but since this game isn't aired on television and is a Netflix exclusive, I just wanted to check.\n\n\n\nI know the game will be available both to US and international audiences on Netflix, but I don't know how it will work with live streaming in the air and leaving the US.\n\n  \nDo you think I will be able to watch the game? If so, do you think just buying the in-flight WiFi and then loading Netflix up on my phone would work? \n\nThank you!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhzx90/question_about_streaming_on_an_international/"
    },
    {
        "id": "1hhy5is",
        "author": "Robemilak",
        "title": "Squid Game 2 Creator 'So Sick' of Netflix Series as Business Booms",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hhy5is/squid_game_2_creator_so_sick_of_netflix_series_as/"
    },
    {
        "id": "1hhxlbr",
        "author": "ixam1802",
        "title": "Search Bar doesn‘t work?",
        "content": "So I was trying to watch Batman the caped crusader on my pc because I saw it on the Netflix app on my phone today. If I search for Batman on my phone it shows most movies, but if I search for it on PC, it won’t pop up",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhxlbr/search_bar_doesnt_work/"
    },
    {
        "id": "1hhxi64",
        "author": "tryingmybestuwu",
        "title": "Nothing Has Ever Filled Me With So Much Rage - La Palma",
        "content": "Major Episode 1-3 Spoilers: Had to stop at the end of Episode 3 with 5 mins to spare when &gt;!they killed Eric off!&lt;. Not sure I can even finish, let alone start the final 4th episode. I get that for show and movie plots, characters have to make some amount of \"mistakes\" to keep the story going or else you could wrap the story up in 5 minutes, but god damn, this is one of the few pieces of media I've consumed recently where every 2 minutes, I can't help but wonder how exactly these people keep making the dumbest decision, after the dumbest decision, after the DUMBEST decision!\n\nSuspension of disbelief is obviously necessary to enjoy most movies and shows but this show asks too damn much of it, and not even because of whatever is happening with the nature side of it all, but with people specifically. I know I'm probably an outlier, but I would have 100% been on the 1st boat out after&gt;!the plane crash especially because there had already been a group of tourists who died on a boat in the first scene of episode 1.!&lt;\n\nMost of us would have been catatonic/devastated/&gt;!on the ground screeching at the idea that our kid was in a plane that we just saw crash before our eyes, and if not then, at the very minimum at the hospital when it was mentioned that she was missing because she was at the front of the plane and most likely dead.!&lt;\n\n&gt;!Side note, I would have probably gotten slapped into another plane of existence had I pulled the little skit Sara pulled, trying to run away by boarding a plane without my parents! Also what are the odds of her getting on that 1 plane of all planes?? !&lt;\n\n&gt;!When they get to Eric's small boat, Eric starts struggling with the guy trying to steal it from them, while Marie and Fredrik just...stand there?? But they could miraculously let go of the boat once he gets shot, right?? !&lt;\n\n&gt;!Jennifer also doesn't seem very devastated that her husband Fredrik is left behind. Every time they show her, her face pretty much screams \"oh damn, that sucks\"! !&lt;\n\nIdk, after a certain amount of bad decisions, you just start hating everyone and not rooting for a single character, so why should I keep watching?!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hhxi64/nothing_has_ever_filled_me_with_so_much_rage_la/"
    },
    {
        "id": "1hguwkt",
        "author": "GaleSTRIK3",
        "title": "La Palma Was Absolutely Ridiculous ",
        "content": "I NEED to know the math behind this wave because there is no way in hell anyone on that plane is in one piece",
        "upvotes": 653,
        "comments": 280,
        "media": null,
        "permalink": "/r/netflix/comments/1hguwkt/la_palma_was_absolutely_ridiculous/"
    },
    {
        "id": "1hi05vj",
        "author": "Tasty_Active_6680",
        "title": "Demon slayer season 4 and season 5 cannot be found",
        "content": "Does anyone know what’s happening with this? I live in Qatar and season 1-3 are available normally but I cannot find 4 and 5 is this a regional thing or issue with Netflix or what?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hi05vj/demon_slayer_season_4_and_season_5_cannot_be_found/"
    },
    {
        "id": "1hhx1l8",
        "author": "Massive_Log1736",
        "title": "most interactive shows removed?",
        "content": "So I searched on Netflix captain underpants and no epic choice o rama. I clicked one of the other Captain underpants shows/movies  and still no epic choice o rama.\n\nFinally I searched interactive but not only Captain Underpants : Epic choice o rama wasn't there , but most of the kid shows wasn't there (I was using a kid profile) only you vs wild shows appeared",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhx1l8/most_interactive_shows_removed/"
    },
    {
        "id": "1hhgcdi",
        "author": "Alan_Stamm",
        "title": "'The Six Triple Eight' Review: Kerry Washington in Inspiring WWII Drama from Tyler Perry",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhgcdi/the_six_triple_eight_review_kerry_washington_in/"
    },
    {
        "id": "1hhxx4v",
        "author": "DJMFS",
        "title": "NFL Christmas games may not be on in your local bar... here's why",
        "content": "",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hhxx4v/nfl_christmas_games_may_not_be_on_in_your_local/"
    }
]