[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 93,
        "comments": 280,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mjenv3",
        "author": "Far_Print5884",
        "title": "Netflix is boring",
        "content": "Is it just me, or does Netflix have a talent for making even good stories boring? I’ve noticed this pattern for a while now, and I’m genuinely curious if others feel the same way. Netflix has some great concepts and plots—things that should, on paper, make for compelling shows or movies. But somehow, they often manage to stretch the story so much that it becomes boring, even frustrating to watch.Netflix shows are so slow paced.",
        "upvotes": 101,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1mjenv3/netflix_is_boring/"
    },
    {
        "id": "1mja9b7",
        "author": "ComfortableWage",
        "title": "Anyone else getting tired of good series getting cancelled to the point you're just reading books more instead?",
        "content": "To be honest, that's where I'm at. And this doesn't just apply to Netflix, but Amazon and other streaming services as well. I'm tired of them pumping out series like candy, some of which in my opinion are really good, only for them to eventually get cancelled often times after just one or two seasons.\n\nIt's annoying. It's a disservice to subscribers. And frankly, I've been reading books of any series I find online now instead anyways because I've been so conditioned to just assume anything I like will eventually get cancelled anyways. \n\nAnd honestly? The books have been offering me a much better experience overall. I feel better, even if I spend all day reading a book or two, than I would've had I spent it binging a show. I also have the added confidence knowing that I'll be able to finish the series without getting pissed off after wasting so much time watching it only to find out it's cancelled later.\n\nSo yeah... books for the win! Depending on how into books I go I may honestly just get rid of my Netflix subscription altogether.",
        "upvotes": 51,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1mja9b7/anyone_else_getting_tired_of_good_series_getting/"
    },
    {
        "id": "1mj4s0m",
        "author": "BadShi-6",
        "title": "What’s with every new series being split in to 2 parts?",
        "content": "I’ve just sat down to watch the new season of Wednesday — I’ve noticed yet again Netflix has split the season into part 1 and part 2. Why do they keep doing this?  It’s actually super annoying to me, long gone are the days you can just sit and binge a new series on your day off. \n\nDo you guys prefer them split into 2 parts? I lose interest waiting for the second part of anything.. is there specific reasons for this like stretching out views etc? I don’t think it builds suspense like Netflix thinks, it’s actually just annoying 😂 ",
        "upvotes": 61,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1mj4s0m/whats_with_every_new_series_being_split_in_to_2/"
    },
    {
        "id": "1mjn139",
        "author": "pvpixelarts",
        "title": "Untamed is just so so",
        "content": "Just my personal opinion on Untamed series. \n\nIt was so much hyped up IMO. No depth in the story line and I could not keep myself engaged in the series at all. What you all think? ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mjn139/untamed_is_just_so_so/"
    },
    {
        "id": "1mj2tuw",
        "author": "intelerks",
        "title": "‘The Walking Dead’ Actress Kelley Mack Dies at 33",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mj2tuw/the_walking_dead_actress_kelley_mack_dies_at_33/"
    },
    {
        "id": "1mizgyd",
        "author": "Sweaty-Toe-6211",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 34,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mizgyd/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mjkrm0",
        "author": "Emmazingx",
        "title": "How to secure my account against hackers?",
        "content": "Hi, first time poster here. I don't know if this is the right sub but I need help.\n\nI have a shared account with my mom and siblings, and I think it has been hacked. The language was changed to German today which is what alerted me, but it has probably been going on for a while because I saw that someone has accessed the account from Germany, Greece and Ghana, in the past days/weeks (I normally don't pay attention to these notification emails because it's usually just my siblings).\n\nI used my Netflix profile to watch a show this morning and everything seemed normal, but since then, the profile names have all been changed and the language and suggestions are completely different. This confuses me: how can the algorithm have changed completely in just half a day?\n\nAnyways, I logged into the account, changed the password, logged off from all devices. I enabled PIN verification for all profiles and verified email and phone number. What more can I do to ensure that these people can no longer access our account? Or should we delete the account altogether for safety and create another one with a different email adress?\n\n  \nThank you for your help! Any advice is appreciated.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjkrm0/how_to_secure_my_account_against_hackers/"
    },
    {
        "id": "1mjerre",
        "author": "randomboreduserrr",
        "title": "Wednesday season 2 is out, anyone watching?",
        "content": "I watched the first episode and it was okayish only, i am invested tho cuz i can't leave such a short series mid way (its only 4 eps till now). What do you like and dont like about it soo far??",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mjerre/wednesday_season_2_is_out_anyone_watching/"
    },
    {
        "id": "1mjmjpv",
        "author": "Green-Direction-5458",
        "title": "Foreign documentaries",
        "content": "Anyone else tired of all of the foreign true crime docs and shows? The English dubbing is awful, most of the time the film quality is awful, grainy looking. Something looks interesting, I'll put it in without realizing, then I hear that's its dubbed, and I just cant continue watching. The voice actors are terrible, sound is bad. I have to assume Netflix gets these shows really cheap. Like cheap filler. There are so many now I feel like canceling ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmjpv/foreign_documentaries/"
    },
    {
        "id": "1mjmhcj",
        "author": "Mountain-Bid4317",
        "title": "Netflix series 60+ minutes in length per episode.",
        "content": "Are most Netflix shows like this? I noticed Wednesday's current season so far every episode is exactly 60 minutes (plus or minus one minute). But is this the thing for Netflix series now. Stranger Things has movie length episodes now.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmhcj/netflix_series_60_minutes_in_length_per_episode/"
    },
    {
        "id": "1mja0pi",
        "author": "False_Candle1666",
        "title": "Back to school",
        "content": "I feel like every year, all I have to watch when fall comes around is reruns of *Veronica Mars* and *Gilmore Girls*. Are there any other shows that give off the same vibe and are just as good?  \nI've already seen *Pretty Little Liars* and *Gossip Girl* — they’re okay, but I don’t love them as much.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mja0pi/back_to_school/"
    },
    {
        "id": "1mj9oap",
        "author": "Legitimate_Dream9721",
        "title": "Can’t find show name - may be spoilers",
        "content": "I’m watching Surviving Summer again on Netflix (absolutely the show). However, my head is mixing it up with another show that I believe was also Netflix. Can anyone remember what this show was, I have added some facts I recall below - beware some may be spoilers but I can’t remember all details:\n\nDaughter/model sent to live with aunt in Australia after ruining a designers outfit.\n\nThere’s a girl called Coco and I think the uncle had recently died? Aunt and uncle were a surfing family - he had a shed to make surf boards in.\n\nI think there was a character Tom?\n\nDaughter makes friends, offends friends, then makes a fashion show of swim suits through the decades for an annual celebration on the beach.\n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj9oap/cant_find_show_name_may_be_spoilers/"
    },
    {
        "id": "1mii95w",
        "author": "MoneyLibrarian9032",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 164,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1mii95w/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mjcler",
        "author": "Yali81",
        "title": "Netflix Preview Club-Focus Group",
        "content": "Hi guys!\n\nThis weekend I’m going to see my third preview and I just had a quick question. Do you guys think seeing the show/movie and completing the survey on the first day makes you more likely to get invited to the focus group? Also what is the email that it usually comes from (so I can look out for it)? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjcler/netflix_preview_clubfocus_group/"
    },
    {
        "id": "1mjkzd4",
        "author": "Any_Office1318",
        "title": "Ideas for Indian Squid Game",
        "content": "In an Indian version of Squid Game, the show should definitely introduce many characters of different language groups and religions because India is really diverse with many different languages and religions. Some players can be North, South, East, West and Central Indian. I think it would be interesting if a Northeast Indian character is also in the story. Northeast Indians are Indians with East Asian features because most of them have Chinese ancestry. It would be interesting to see characters from different regions because the show can reveal how diverse India is. They should definitely show some Indian characters who are Hindi, Tamilian, Punjabi and Bengali even Indians with different religions like Hindus, Muslims, Christians, Sikhs and maybe more Indians with other different religions. They could also show Indians with different skin tones like Indians with light, medium and dark skin tone even they could show some Indians with different ancestry. They can show some Indians with Persian and European ancestry. Some Indians with Portuguese and French ancestry like introduce some characters from Goa and Puducherry. They could introduce a character who is a Singaporean of Indian descent even they could also introduce an American, British or a Canadian of Indian descent. I think introducing a character who is a Malaysian or an Indonesian of Indian descent would also be cool idea. It would be interesting if they introduce a character who is an African university student because India is known to have several African students and they even talk about how they struggle with their lives in India due to their appearance. It would also be interesting if they introduce a Mauritian, Pakistani, Nepali, Bangladeshi, Sri Lankan, Afghan and a Bhutanese character. They could also introduce VIPs of different nationalities like American, Russian, Chinese, Brazilian, South African and Arab (UAE). The mysterious island where the games are held can be located somewhere near and a bit far away from North Sentinel Island.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjkzd4/ideas_for_indian_squid_game/"
    },
    {
        "id": "1mjb5u6",
        "author": "chessieba",
        "title": "I can't really figure out how to word this question to search the answer...",
        "content": "I'm trying to figure out how to prevent Netflix from advertising shows after the season of the show we are watching is over. For example, we just watched the last Puffin Rock and it starts playing a preview from Paw Patrol immediately. I'm not interested in my daughter getting involved with Paw Patrol, so I would like it to just not exist in my house for now. We have the ad free subscription and whenever I try to search a way to turn this off it keeps recommending that we get the subscription we already have. \nThanks for any help!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjb5u6/i_cant_really_figure_out_how_to_word_this/"
    },
    {
        "id": "1mjg5c6",
        "author": "intothevoidofsadness",
        "title": "Mo Amer Reminds Me Of",
        "content": "I just finished watching Mo on Netflix. I had never seen this show before or heard of him.\n\nHe reminds me of several other comedians/actors/characters. At least his character on the show does.\n\nParticularly his comedic timing, phrasing and the way he talks/sound of his voice. But also the qualities of his character on the show.\n\nSort of a blend of: Seth Rogan; Brett Gelman; Robb Wells; Jeff Garlin; Mike Mitchell\n\nand a tiny bit of Larry David. I think because of the repeated horrible situations he gets himself into.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjg5c6/mo_amer_reminds_me_of/"
    },
    {
        "id": "1mj8vtt",
        "author": "indiewire",
        "title": "Hunter Doohan on 'Wednesday' Season 2 and His 'Even More Deranged Arc'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vtt/hunter_doohan_on_wednesday_season_2_and_his_even/"
    },
    {
        "id": "1mj8vqs",
        "author": "scottishdrunkard",
        "title": "Netflix won’t play the credits…",
        "content": "So, I’m watching Netflix and on every show, it will not play the credits. And I’m one of the few people who likes credits, they have nice music. You know that tiny screen it turns into when the credits play and asks if you wanna skip to the next episode? Doesn’t play the credits. Highlighting that window just plays the episode over.\n\nThe Netflix is hooked up to the Sky Box, and the Sky Box has two other slave boxes connected to it. When you play Netflix on those TVs, the credits play. It’s just the main box that doesn’t play them. I was at one point told to turn the Sky Box off and on again to reset it, I even did a hard reset where I cut the power, and rebooted it, but nothing. No change. \n\nCan you help me fix it? Wednesday just started, and I like clicking my fingers at the end…",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vqs/netflix_wont_play_the_credits/"
    },
    {
        "id": "1mihl0d",
        "author": "-AI3x",
        "title": "What Should I Watch On Netflix?",
        "content": "I’m currently looking for something to watch on Netflix as I’m Quite Bored.\n\nI used to watch a lot of Horror Movies, Thrillers, Detective. Action and Comedy movies.\n\nSo something with those genres would be great. ",
        "upvotes": 35,
        "comments": 253,
        "media": null,
        "permalink": "/r/netflix/comments/1mihl0d/what_should_i_watch_on_netflix/"
    },
    {
        "id": "1mj57fc",
        "author": "Equivalent_Parking_8",
        "title": "Just switched to Standard from ad supported (UK)",
        "content": "I have switched my membership to standard for two reasons, one it doesn't work in Finland with ads and I travel there often, and I wanted to watch community which netflix told me was only available on the ad free service. \n\nHowever as soon as i switched it tells me community isn't available.  I know I need it to watch It's always sunny which should drop soon so I'm not too mad, but wondering what other films and shows are available on the higher priced service. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj57fc/just_switched_to_standard_from_ad_supported_uk/"
    },
    {
        "id": "1mhzsi2",
        "author": "Friendxx",
        "title": "K POP Demon Hunters is INCREDIBLE!",
        "content": "I’m an adult male and I never listen to K POP or watch animation, yet I’m totally hooked on this movie, I’ve seen it like three times already. I got the sound track playing on my Spotify every day, such a catchy song, Golden, is amazing. Everyone I know is totally hooked on this movie. Sony did an incredible job with this movie. Glad it’s on Netflix and I can watch it anytime I want!",
        "upvotes": 385,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1mhzsi2/k_pop_demon_hunters_is_incredible/"
    },
    {
        "id": "1mivxh6",
        "author": "youdontgetityet",
        "title": "i’m starting to get the hype…",
        "content": "i normally stray away from mainstream shows because most of the time they’re cringey, predictable, or downright stupid. i finally gave in and watched the summer i turned pretty, i hate to say how much i loved it. i was SOOOO engrossed with the characters and i binged it in just one night. have i been wrong all this time?!? WHAT HAVE I MISSED? someone pls recommend your favorite mainstream shows!!!",
        "upvotes": 3,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1mivxh6/im_starting_to_get_the_hype/"
    },
    {
        "id": "1mjenup",
        "author": "InflamedNodes",
        "title": "Removing gaming ads from the browser?",
        "content": "How do I remove these stupid gaming advertising on my PC firefox browser access which I will literally never use or access or care about? it's so weird. Is there an option in netflix, or do i need to download a firefox addon? I'm paying a subscription, I don't' want stupid ads for stupid phone games I'm not even using because I'm on my computer, so it doesn't even make sense. Repeat again I'm paying for this service, not for ads. \n\nhttps://preview.redd.it/lsublzbqdghf1.png?width=3512&amp;format=png&amp;auto=webp&amp;s=a6a1e34c1188c169b1ffe13c9f45b3e44ef2eb0a\n\n  \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjenup/removing_gaming_ads_from_the_browser/"
    },
    {
        "id": "1mj0oco",
        "author": "Cor3nd",
        "title": "Ghosts s02?",
        "content": "I recently watched the series Ghosts on Netflix and really enjoyed it. The characters and story were great, and the tone was both funny and touching. Does anyone know if there’s a season 2 planned or in production? I’d love to see what happens next. S01 was in 2022. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj0oco/ghosts_s02/"
    },
    {
        "id": "1mjc0jy",
        "author": "Longjumping_Land_977",
        "title": "Major update on Amy Bradley case as man claims he ‘rented her from adult site’ recently",
        "content": "",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1mjc0jy/major_update_on_amy_bradley_case_as_man_claims_he/"
    },
    {
        "id": "1mj6ep9",
        "author": "139nn1_si3",
        "title": "Is riverdle worth watching???",
        "content": "I’m only deciding to watch this because Camila Mendes is my fav actress. But I saw the trailer and I don’t feel like I’m gonna like it cuz I’m not really into oh people die what a mystery kind of thing lol. A saw that they have so many seasons there might be other situations as well right? So without the spoilers tell me what kind of story it is😊",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mj6ep9/is_riverdle_worth_watching/"
    },
    {
        "id": "1mis6et",
        "author": "Lostmyoldname1111",
        "title": "My Oxford Year",
        "content": "Stumbled on My Oxford Year and so far, so good. I’m particularly enjoying that the male lead is the actor that played young King George in the Queen Charlotte mini-series. Looks like it’s going to be decent.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mis6et/my_oxford_year/"
    },
    {
        "id": "1mixn9w",
        "author": "Lonely_Holiday9034",
        "title": "Bad Sport",
        "content": "Okay I just started watching this show and it’s so good!! Although I knew to some extent sports (basically anything) can be rigged, it’s crazy how greed can really ruin your life even when you have it all. Has anyone else watched it? If so, what are your thoughts/ favorite episodes? I watched Hoop Schemes (basketball) Gold War (figure skating) and Need for Weed (racing) so far.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mixn9w/bad_sport/"
    },
    {
        "id": "1mj7tks",
        "author": "TimesandSundayTimes",
        "title": "Wednesday is back – but is the second series worth watching?",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mj7tks/wednesday_is_back_but_is_the_second_series_worth/"
    }
]