[
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 4945,
        "comments": 866,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pyrt29",
        "author": "SanderSo47",
        "title": "December 26-28 Box Office Recap – 'Avatar: Fire and Ash' crosses $760M worldwide on its second weekend. 'Marty Supreme' opens with a great $27M on its first four days, A24's second best ever debut. 'Anaconda' and 'Song Sung Blue' open solidly with $23.6M and $12.4M, respectively.",
        "content": "https://preview.redd.it/wygzklyid6ag1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=23b048a1a740aec7190835df598197ffeee82c7a\n\n2025 came to an end with a very lucrative post-Christmas weekend.\n\n***Avatar: Fire and Ash*** easily held the top spot for a second weekend, while holdovers had a very strong weekend. The biggest newcomer was A24's ***Marty Supreme***, which over-performed projections and posted the studio's second biggest ever debut. ***Anaconda*** and ***Song Sung Blue*** followed suit, as both had solid debuts as well.\n\nThe Top 10 earned a combined $170.6 million this weekend. That's up 7.1% from last year, when ***Sonic the Hedgehog 3*** repeated at #1.\n\nEasily holding on to #1, ***Avatar: Fire and Ash*** added $64 million this weekend. That represents a very light 28.2% drop, which is better than ***The Way of Water*** (52.8%). But that's not a great comp; ***The Way of Water*** didn't have Christmas Day till its second Sunday, while ***Fire and Ash*** is already in the post-Christmas slot.\n\nThrough 10 days, ***Fire and Ash*** has cleared $217.6 million domestically. It's currently $44 million behind ***The Way of Water*** through the same point. Given that that film was barely starting its Christmas run, that gap will continue to widen. For instance, its third weekend was slightly higher than its second weekend, and it's unlikely ***Fire and Ash*** can replicate that. Right now, ***Fire and Ash*** should reach $500 million domestically.\n\nOf all holdovers, ***Zootopia 2*** benefitted the most. It jumped 34.7% for a $20 million weekend. That's higher than ***Moana 2***'s fifth weekend jump. The film has amassed $321 million, and it could surpass the original's domestic gross as early as next week.\n\nA24's ***Marty Supreme*** expanded to 2,668 theaters and grossed a great $17.7 million ($27 million four-day). This is A24's second biggest ever debut, behind ***Civil War*** ($25.5 million). The debut is also higher than Timothée Chalamet's previous Christmas title, ***A Complete Unknown*** ($11.6 million).\n\nConsidering this is A24's most expensive title ($60-$70 million), this is a pretty great start. There was the challenge of winning over audiences with a ping-pong sports drama; sports films are often successful, but there aren't many ping-pong films. What helped is that A24 did a fantastic job with marketing, selling the film as more than just a sports film, instead showcasing it as a \"quest to be the greatest to ever exist.\"\n\nBut the real credit has to be Chalamet. A very popular star, this was his biggest gamble so far. ***Dune*** and ***Wonka*** were IP films, and ***A Complete Unknown*** was a Bob Dylan biopic. ***Marty Supreme*** is a completely original film, sold entirely on him. And as you can see, it worked; 50% of the audience reportedly watched the film because of Chalamet. The cherry on top was the universal acclaim it garnered: 95% on RT, and 88 on Metacritic are some of the year's best reviews.\n\nAccording to A24, 57% of the audience was male, and 63% was 25 and over. Highly popular with Gen Z: 66% of the audience was in the 18-34 demographic. They gave it a \"B+\" on CinemaScore, which is fine for an adult drama. It's A24's second best grade. With huge Oscar buzz on the horizon and with a weak January ahead, ***Marty Supreme*** should enjoy some great legs. Don't be surprised if it can reach $80 million domestically. If it gets there, it'll become A24's highest grossing film.\n\n***The Housemaid*** dipped just 19% on its second weekend, earning $15.4 million this weekend. Through 10 days, the film has earned $46.4 million, and there's a strong possibility that it could reach $100 million domestically.\n\nIn fifth place, Sony's ***Anaconda*** debuted with $14.5 million ($23.6 million four-day) in 3,509 theaters. This is below the 1997 film's debut ($16.6 million) and slightly ahead of ***The Hunt for the Blood Orchid*** ($12.6 million). Adjusted for inflation, the new version sold less tickets than either film.\n\nGiven its low $45 million budget, this is a very good debut. Especially given the film's bizarre premise: two friends who grew up with the original ***Anaconda*** and proceeding to reboot it, only to be chased by a real anaconda. It's one thing to reboot a horror film, but it's very different to retool it as a comedy (even if the original 1997 is a hilarious film by itself). \n\nTo give it a chance to succeed, Sony gave it the prime Christmas date, and got two comedy names in Jack Black and Paul Rudd to lead the film. Turns out all audiences needed was \"Jack Black and Paul Rudd getting chased by a large snake.\" Reviews were mixed (51% on RT), but those were actually the best in the franchise. By this point, you pretty much know what you're gonna get with this. I mean, the trailer used Sir Mix-A-Lot's chorus to \"Baby Got Back\".\n\nAccording to Sony, 53% of the audience was male. They gave it a \"B\" on CinemaScore, a so-so grade for a comedy, but better than the original's \"B–\". It should hold well over the coming weeks; right now, ***Anaconda*** should reach $70 million domestically. Not a bad performance for a horror comedy.\n\nAngel Studios' ***David*** dipped 42.5%, adding $12.5 million. That's quite a rough drop, considering the great word of mouth and Christmas corridor. But it seems like the film's audience was more limited than anticipated. Through 10 days, it has made $49.5 million, and it looks like it will finish with a little below $100 million.\n\nIn seventh place, ***The SpongeBob Movie: Search for SquarePants*** eased 28.3%, adding $11.2 million this weekend. Through 10 days, it has amassed $38.1 million, and will probably end its run with a little above $70 million domestically.\n\nIn eighth place, Focus Features' ***Song Sung Blue*** debuted with $7.6 million ($12 million four-day) in 2,578 theaters. The debut is below last year's other music drama ***A Complete Unknown***, although that had a more iconic figure than in ***Song Sung Blue***.\n\nIt's hard to ask for much better numbers. The film's selling point is Neil Diamond's music, but it's not a Diamond biopic. Instead, it follows Mike and Claire Sardina, who performed as the Neil Diamond tribute band Lightning &amp; Thunder. Getting known names like Hugh Jackman and Kate Hudson is a plus, but it's still a limited audience. At the very least, the positive reviews (75% on RT) helped attract audiences over the past days.\n\nAccording to Focus Features, 61% of the audience was female, and a massive 94% was 25 and over. It skewed old, with 48% of the audience 55 and over. They gave it a great \"A\" on CinemaScore, suggesting strong word of mouth. Right now, look for ***Song Sung Blue*** to finish with around $35 million.\n\nAfter its very weak drops, ***Wicked: For Good*** got some help from the holidays. It jumped 8.2% for a $5.2 million weekend. That takes its domestic total to $331.6 million.\n\nRounding out the Top 10 was ***Five Nights at Freddy's 2*** with $4.4 million. It dipped 42.5%, tying for the steepest drop in the Top 10, indicating that it won't benefit much from the holidays. The film's domestic total stands at $118.9 million, and it looks like the film will tap out with less than $130 million.\n\nNeon released Park Chan-wook's new film ***No Other Choice*** on Christmas Day in 13 theaters. It earned $312,687 ($625,656 four-day), which translates to a solid $24,053 per-theater average. With some awards buzz and critical acclaim on its side, the film will continue expanding in the next few weeks.\n\nSearchlight expanded Bradley Cooper's ***Is This Thing On?*** to 33 theaters, earning $203,000. It will continue playing in limited release before a wide expansion in mid January.\n\nSpeaking of Searchlight, they also launched the buzzy title ***The Testament of Ann Lee*** in 4 theaters. It earned a modest $71,000 ($111,000 four-day), which is a middling $17,750 per-theater average. The film will continue expanding, but given its poor performance in many awards circles (and also missing practically all of the announced Oscar shortlist categories), it seems like it will struggle to reach audiences.\n\nMUBI also released Jim Jarmusch's new film ***Father Mother Sister Brother*** in 4 theaters, earning $48,395 ($94,971 five-day) for a weak $12,099 per-theater average.\n\n#**OVERSEAS**\n\n***Avatar: Fire and Ash*** added a strong $181.2 million overseas, taking its worldwide total to $760.4 million after two weeks. It could reach the billion mark as early as next week. The best markets are China ($99.6M), France ($54.4M), Germany ($43.1M), Korea ($32.1M) and the UK ($27.7M). Based on its holds, it should reach $1.7 billion by the end of its run.\n\n***Zootopia 2*** is not done with its run. It added $67.9 million, taking its worldwide total to a fantastic $1.420 billion. There's two big stories here: it broke the $1 billion mark overseas, the first Hollywood title to break it this year. But perhaps the most insane record: in China (where it has earned a colossal $561 million), the film crossed 100 million tickets. It's the first Hollywood title to reach 100 million tickets in a single country since ***Titanic***. The best markets are China ($561.1M), France ($55.9M), Japan ($52.2M), Korea ($49.1M) and Germany ($34M). Given that it still has a lot of gas left, this might reach $1.7 billion worldwide.\n\n***The SpongeBob Movie: Search for SquarePants*** began its international run with a good $22.1 million, taking its worldwide total to $60.2 million. Its best debuts were in the UK ($3.9M), Mexico ($2.7M), Germany ($2.6M), France ($1.8M) and Israel ($1.7M). Given that it still has some markets left and very little competition, this film should be set for a solid run through January.\n\n***Anaconda*** debuted with $20 million overseas, for a $43.6 million worldwide debut. Its best debuts were in Australia ($2.4M), Mexico ($2.1M), the UK ($1.7M), Germany ($1.2M) and Brazil ($1M). This is easily hitting $100 million worldwide, and could get to up to $170 million.\n\n***The Housemaid*** also started its international run with a pretty good $18.5 million, taking its worldwide total to $64.9 million.\n\nWith $4.3 million overseas, ***Wicked: For Good*** has finally crossed $500 million worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**ANNOUNCEMENT**\n\nThis was posted earlier than usual because Actuals could be delayed due to the holidays. Even then, the difference is very minimal. Next week, it'll return to the usual Weekend Actuals.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 396,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p2Z__IEiPHRcgxa0lrfNzH6P_ooAXZdwg3DR9fzy2a0.png?auto=webp&amp;s=b7f3128bf65032c209d64bf6255bbe908c27b2e8"
        },
        "permalink": "/r/movies/comments/1pyrt29/december_2628_box_office_recap_avatar_fire_and/"
    },
    {
        "id": "1pz1nuu",
        "author": "BunyipPouch",
        "title": "Idris Elba receives Knighthood: The actor is being recognized for his contributions to film &amp; television, alongside his charity work.",
        "content": "",
        "upvotes": 11874,
        "comments": 410,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wHjbOXVowrBIMRrvyrBAqDqNz5-X-vLARBnP74yRwcc.jpeg?auto=webp&amp;s=d3fc4b2df99974b8cc448d04961bca4c55b04cb5"
        },
        "permalink": "/r/movies/comments/1pz1nuu/idris_elba_receives_knighthood_the_actor_is_being/"
    },
    {
        "id": "1pz4tbq",
        "author": "MarvelsGrantMan136",
        "title": "‘I’m Chevy Chase, and You’re Not’ Director on Going Toe-to-Toe With Chevy, the ‘Community’ Cast Turning Down Interviews and the Doc Being a Hard Watch For the Chase Family",
        "content": "",
        "upvotes": 2409,
        "comments": 381,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5vDIvT4N2Ly7rEGA9A61U5L1uJbwnplHZvZSMBtR9xg.jpeg?auto=webp&amp;s=b4f8c97426da6b6d105d8f795b345a6ea200b979"
        },
        "permalink": "/r/movies/comments/1pz4tbq/im_chevy_chase_and_youre_not_director_on_going/"
    },
    {
        "id": "1pyzcjq",
        "author": "Boulderboldef",
        "title": "Funniest line in the Naked Gun remake?",
        "content": "Funniest line from Naked Gun? My vote goes to the scene where Beth is asking Frank how his wife passed. \n\nFrank: “Great. Fifty yards easy. Arm like a cannon”. \n\n Beth : “She sounds like a saint.”\n\nFrank: “Or maybe a Bronco or 49er. We would have been happy with any team, really. Anyone but the Browns.”",
        "upvotes": 4626,
        "comments": 549,
        "media": null,
        "permalink": "/r/movies/comments/1pyzcjq/funniest_line_in_the_naked_gun_remake/"
    },
    {
        "id": "1pz46u2",
        "author": "Bennett1984",
        "title": "Ryan Coogler Details Original Vision For 'Black Panther 2' Script",
        "content": "",
        "upvotes": 1144,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lU31SGP3932Y1vFifnGLXOak_oDJH3Eg0zpgzWZcobQ.jpeg?auto=webp&amp;s=4d9f82f70596e4fe33e4c45127d336826ffffac5"
        },
        "permalink": "/r/movies/comments/1pz46u2/ryan_coogler_details_original_vision_for_black/"
    },
    {
        "id": "1pz3rtv",
        "author": "MAHHockey",
        "title": "In Groundhog Day (1993), Bill Murray is awoken every day by his alarm clock playing \"I Got You Babe\" (1965). The same gag in a movie made today would be a song from 1997. What song would it be?",
        "content": "Occurred to me the other night when my wife and I were talking about the first album we ever bought as kids. I laughingly admitted mine were Kriss Kross and Ace of Base. She had a good laugh, and tried to remember the lyrics to \"Jump Jump.\" I tried to remind her by bringing it up on Spotify and she emphatically stopped me (No! Please no! I don't need that song stuck in my head all week!). So I joked I was going to secretly make it her alarm clock music. It then reminded of the gag from Groundhog day and got me thinking that \"Jump Jump\" would actually be an older song to someone now than \"I Got You Babe\" was to Bill Murray in Groundhog Day. And then it reminded me of the cruel march of time... But I digress...\n\nIf Groundhog Day were remade today (please don't Mr Hollywood producer person), what song would our protagonist be waking up to every morning?\n\nEdit Edit: Lotsa folks getting hung up on the exact year difference. Not too concerned about the exact year difference. Just a similarly old song for today would work.\n\nEdit: Some of my favorites listed so far:\n\nSpice Girls - Wannabe. Just opening every day with \"Yoooooo I'll tell ya what I want!\" would be hilarious\n\nSmash Mouth - All Star. Ditto: \"SOoooommmeBODY Once told me...\"\n\nSmashing Pumpkins - Today. How poetic\n\nChumbawumba - Tubthumping\n\nLen - Steal My Sunshine\n\nWho Let The Dogs Out\n\nBittersweet Symphony\n\nGreen Day - Basketcase\n\nSheryl Crow - Every Day Is A Winding Road\n\nBare Naked Ladies - One Week. Starting every day with \"YIIIIITsss beeeen ONE WEEK!\"\n\nCher - Believe. Nice reference to the original.\n\nCeline Dion - My Heart Will Go One. Fits the sappiness and relevance of I Got You Babe.\n\n4 Non Blondes - What's Up.\n\nCardigans - Love Fool\n\nRembrants - I'll Be There For You.",
        "upvotes": 1148,
        "comments": 617,
        "media": null,
        "permalink": "/r/movies/comments/1pz3rtv/in_groundhog_day_1993_bill_murray_is_awoken_every/"
    },
    {
        "id": "1pyqwqz",
        "author": "MarvelsGrantMan136",
        "title": "The Movie Theater Comeback That Wasn’t: Why 2025 Was Such a Dud for Struggling Cinemas",
        "content": "",
        "upvotes": 4641,
        "comments": 1855,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w04ZV6TRqNUnPrXm8QBAr0lB-zlYQr7jG4njRkX5_4U.jpeg?auto=webp&amp;s=6a45fdfef480be725128d9549d5dde606f8a8909"
        },
        "permalink": "/r/movies/comments/1pyqwqz/the_movie_theater_comeback_that_wasnt_why_2025/"
    },
    {
        "id": "1pz5n4k",
        "author": "likaachikaa",
        "title": "What is the most obvious, cringe product placement you’ve seen in a movie?",
        "content": "there are a lot of bad product placements in movies out there. i can name quite a few off the top of my head. but i want to know the cringiest, most over the top product placement ads that took you right out of an immersive movie. \n\nthe biggest one that comes to mind for me is Brad Pitt drinking a Pepsi in “World War Z”.",
        "upvotes": 371,
        "comments": 887,
        "media": null,
        "permalink": "/r/movies/comments/1pz5n4k/what_is_the_most_obvious_cringe_product_placement/"
    },
    {
        "id": "1pz5urd",
        "author": "shurimalonelybird",
        "title": "What films will change my life, destroy my soul, etc. like Arrival (2016) did?",
        "content": "I’m looking for movies that really get under your skin in the best possible way. The kind that sticks with you for days. Movies that hit really, really hard, but in a good way. Maybe change how you see things. But I'm not after nihilistic shock value. Like, I love The Mist’s ending and it's quite impactful, but I want films that leave something positive or clarifying, not bleak stuff.",
        "upvotes": 251,
        "comments": 374,
        "media": null,
        "permalink": "/r/movies/comments/1pz5urd/what_films_will_change_my_life_destroy_my_soul/"
    },
    {
        "id": "1pz7x0g",
        "author": "ss_tall_toby_yt",
        "title": "Should they bring back movie intermissions",
        "content": "I went to see Avatar Fire and Ash or whatever it’s called (the third Avatar movie) the other day with a friend of mine and that movie went for 3 hours and she and I were both busting to take a leak but we didn’t leave until the end of the movie because we didn’t wanna miss anything.\n\nI have a few old movies at home that have intermissions but they don’t go for 3 hours \n\nSo what do you’s think should they bring them back ",
        "upvotes": 105,
        "comments": 220,
        "media": null,
        "permalink": "/r/movies/comments/1pz7x0g/should_they_bring_back_movie_intermissions/"
    },
    {
        "id": "1pyvm2t",
        "author": "GelatoBravado",
        "title": "Award winning actors/actresses that you’re not impressed with?",
        "content": "I’ll start. Mark Ruffalo. \n\nIn every single one of his films I’ve seen, I never see the character he’s playing. I see only Mark Ruffalo pretending to be the character, emoting the character’s emotions. \n\nHis mannerisms, voice, demeanour etc in real life always bleed into his characters, dominating his expression of the characters. \n\nI most recently watched Poor Things and Collateral. His mainstream movies I’ve seen include the MCU movies.\n\nEdit: Responding to some of the comments here. I actually think Collateral is one of his better work where he almost disappears into his character, but the performance is still relatively uneven throughout the movie. I’d watched Zodiac as well and I can’t remember him at all. That probably means I find that he’s neither good nor terrible in it.\n\nI’ll check out some of his other works mentioned in the comments. ",
        "upvotes": 411,
        "comments": 988,
        "media": null,
        "permalink": "/r/movies/comments/1pyvm2t/award_winning_actorsactresses_that_youre_not/"
    },
    {
        "id": "1pyu0sy",
        "author": "girafa",
        "title": "Birdman or (The Unexpected Virtue of Ignorance) dir. Alejandro G. Iñárritu. 2014. Michael Keaton and Ed Norton rehearse for the first time.",
        "content": "",
        "upvotes": 470,
        "comments": 80,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/slavkz2bs6ag1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pyu0sy/birdman_or_the_unexpected_virtue_of_ignorance_dir/"
    },
    {
        "id": "1pyvgza",
        "author": "tylerthe-theatre",
        "title": "The Most-Anticipated Films of 2026",
        "content": "",
        "upvotes": 391,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IhhXc0cf9oeIz6o0vuEUNr_SAEgbOQNxoj1gyqFUE0A.jpeg?auto=webp&amp;s=0ccd673b1cdbebc8aa68ab29c3c40aa9cda31299"
        },
        "permalink": "/r/movies/comments/1pyvgza/the_mostanticipated_films_of_2026/"
    },
    {
        "id": "1pyllja",
        "author": "AporiaParadox",
        "title": "Movies that portrayed a reality that was reflective of the time, but now seem unbelievable",
        "content": "As the saying goes, the past is a foreign country, and as such movies from the past can also seem like a foreign country. Movies usually try to reflect the reality of the time they're made in, but something that seemed normal in the past can seem unbelievable to modern audiences even if they're aware of the historical context.\n\nFor example, I recently rewatched White Christmas, and the song [\"What can you do with a General\"?](https://www.youtube.com/watch?v=D0rRe9gmFC4&amp;list=RDD0rRe9gmFC4&amp;start_radio=1) and the whole plot point about the retired general always seemed strange to me. The premise is that normal soldiers returning from WWII had better employment prospects than retired generals, with the general now running a failing inn while all of his former subordinates are doing very well. In modern times, this seems completely alien. Nowadays enlisted persons have a much harder time finding a decent job or even any job at all after their military service, especially if they lack a proper education/useful transferable skills or they have health problems, while high-ranking officers have a very easy time getting a good job thanks to their education and connections. I am frankly not even sure if the whole thing about retired WWII generals having a hard time finding a job was true, but it is definitely true that WWII veterans had a much easier time after their service than soldiers in later wars.\n\nAnd on that note, pretty much any old movie where a father with his own income in a job that isn't even that prestigious can provide for a whole family with a nice house that he owns. This is now a fantasy to anyone thinking of starting a family.\n\nSo what other then contemporary historical realities depicted in movies seem strange now?",
        "upvotes": 1206,
        "comments": 572,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aTfW3qZ31bKmCTzJiwnXuNbkANzlpPKX-hvWa41SdSM.jpeg?auto=webp&amp;s=7089854510d46413265e78e3cd95bee6fa9775fc"
        },
        "permalink": "/r/movies/comments/1pyllja/movies_that_portrayed_a_reality_that_was/"
    },
    {
        "id": "1pz9dwg",
        "author": "funny_lego_hazman",
        "title": "Hot Take: Hackers is a super fun movie I could rewatch continuously, for days on end.",
        "content": "Yeah, I said it.\n\n  \nI love Hackers (1995). It's the embodiment of 90s cult classic cinema. Super cheesy, campy, and never takes itself too seriously. The dialogue is so weird too. The aesthetic and characters are super cool too, even though they're kinda odd.  \n\n  \nI also love how the tagline says \"their only crime is curiosity\", when they commit actual crimes throughout the movie.\n\n  \n(P.S. Proud owner of the Shout Factory! Blu-Ray of Hackers. Great menu and bonus features).\n\n  \n",
        "upvotes": 57,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1pz9dwg/hot_take_hackers_is_a_super_fun_movie_i_could/"
    },
    {
        "id": "1pzd321",
        "author": "AssociateLittle1487",
        "title": "Disney's embarrassing AI-generated Star Wars video of scrambled-up animals was the opening salvo in a year full of AI humiliation",
        "content": "",
        "upvotes": 33,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/onmbDPY39lRzOGOyeI5TdNojuSeoEwDPNk5sBfLC9hY.png?auto=webp&amp;s=6dad779986a8fad20b26753e6e61e197a252e34e"
        },
        "permalink": "/r/movies/comments/1pzd321/disneys_embarrassing_aigenerated_star_wars_video/"
    },
    {
        "id": "1pyxinw",
        "author": "BunyipPouch",
        "title": "‘One Battle After Another,’ ‘Frankenstein,’ ‘Weapons,’ ‘Wicked: For Good’ and ‘Sinners’ Lead Make-Up Artists and Hair Stylists Guild Nominations",
        "content": "",
        "upvotes": 229,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/19i6U0FoaygV7eytNMIuZPL6RDusT0nhWE3dkiJmWwk.jpeg?auto=webp&amp;s=0551b88c15b06695e21c3f6bc89eca06b123dc03"
        },
        "permalink": "/r/movies/comments/1pyxinw/one_battle_after_another_frankenstein_weapons/"
    },
    {
        "id": "1pyxoiw",
        "author": "Tugboat47",
        "title": "Rose Byrne's Closet Picks | Criterion Collection",
        "content": "",
        "upvotes": 199,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fFM6hrr--pPLYxBaclPhX4byE1dOrQuyPZZWwKrqNf4.jpeg?auto=webp&amp;s=a0591dd235f7b83595c446fc0d372e855c91ad54"
        },
        "permalink": "/r/movies/comments/1pyxoiw/rose_byrnes_closet_picks_criterion_collection/"
    },
    {
        "id": "1pye9he",
        "author": "TheKittyPie",
        "title": "Are there any films that take place in real time?",
        "content": "Films are generally 1.5-3 hours long. When you think about it there have been many stories or incidents throughout history which took place in just a few hours so it had me wondering, are there any film stories that are told in “real time” meaning for example the story starts at 8am and ends at 9:45am with plot in between? \n\nI know it’s been done in TV, for example Adolescence is pretty much shot in real time with hardly any cuts so you feel like you’re there.\nI know there have been films shot in “one shot” but they sometimes still time skip ",
        "upvotes": 2228,
        "comments": 1291,
        "media": null,
        "permalink": "/r/movies/comments/1pye9he/are_there_any_films_that_take_place_in_real_time/"
    },
    {
        "id": "1pz7stw",
        "author": "Xenraf",
        "title": "Are there any primarily Non-English speaking films that take place in America?",
        "content": "It is said that the USA's biggest import is film, and in those films we Americans/ and Brits commonly visit other countries (Bond, Mission: Impossible, Bourne, even such things as Eat,Pray,Love), BUT has there ever been a film where non- English speakers come here to film a movie? \nA comedy about a French man who inherits a cattle ranch in Montana? \nA Norwegian drama about two sisters  going on a road trip across America to fulfill their grandfather's dying wish to give his dog tags to his old army buddy?\nI know the world speaks English and we don't generally speak any other languages so that is a big reason, but I couldn't think of films where a foreign film was made in the USA.",
        "upvotes": 34,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1pz7stw/are_there_any_primarily_nonenglish_speaking_films/"
    },
    {
        "id": "1pyt5p9",
        "author": "Fit-Profit8197",
        "title": "Zack Snyder could become one of our great exploitation directors if he embraced his strengths and weaknesses",
        "content": "Snyder is talented... but it's very domain based talent and storytelling/taste are not his strengths. So him seeing himself as an epic auteur hasn't worked out well.\n\nAs a pulp stylist he really delivered - with strong and exploitative material that played to his strengths - in Dawn of the Dead and 300 where I think most directors would flounder. And nothing about his narrative and thematic flounders of the past 16 years suggest he's lost *this* aspect of his flair - he's still an incredible stylist.\n\nHe's a 21st century Frank Fazetta - but in time. He's also about as much of a storyteller. If he embraces that rather than trying to deconstruct and reconstruct epics with full creative control, he could turn into one of the all time great pulp directors. Like, if he had directed PRIMITIVE WAR, that would have been rad. Or imagine a Zack Snyder COCAINE BEAR. Or VFW. They'd be unreal.\n\nI think this is why he's so divisive - his fans cannot see why people don't get no other director can deliver in the ways he can on an unimaginably large scale (Nolan and Cameron, as directors, also see and are in awe of this talent), and his detractors cannot get past his appalling instincts with story and theme while tackling thematically and narratively ambitious material.\n\nIf Snyder spent the rest of his career doing stuff like Joe Carnahan scripts instead of trying to become the next Lucas/Nolan, he would absolutely kill it. Cheap high concept exploitation Snyder would carve out an unimpeachable niche all of his own.",
        "upvotes": 124,
        "comments": 241,
        "media": null,
        "permalink": "/r/movies/comments/1pyt5p9/zack_snyder_could_become_one_of_our_great/"
    },
    {
        "id": "1pyyvuy",
        "author": "SlowExperience",
        "title": "No Other Choice is SO GOOD",
        "content": "I came to Reddit after watching the movie and was surprised that no one is talking about this? I've only seen The Handmaiden, so I knew Park Chan-Wook was good, but WOW, this movie is absolutely fantastic. There are so many little golden trinkets of fantasticness, so many little clever transitions, editing choices, framings, details that elevate this movie into something really really special. Also, it has what is probably my favourite scene in a movie that I've seen in a long time (the loud music one).\n\nAnd other than the craft level, the actual plot of the movie was also really good!! I loved the weird way this movie simultaneously critiques capitalism and the actions of the narrator (everybody keeps on saying that they have no other choice, even though the movie (cleverly, comedically) often points out that they do have at least *some* semblance of choice,\n\nThere's so much more I could gush about with this movie (the acting, the ending montage, the whole dynamic between the MC and his strangely supportive wife, the cello playing, the humor, but wow--super reccommend this movie! ",
        "upvotes": 63,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1pyyvuy/no_other_choice_is_so_good/"
    },
    {
        "id": "1py8f5j",
        "author": "bell-town",
        "title": "In an alternate universe Alfonso Cuarón directed the rest of the Harry Potter series and the Battle of Hogwarts looked like the war scenes in Children of Men.",
        "content": "I rewatched the Prisoner of Azkaban last night and it's amazing how much better it is than all the other films in the series. Goblet of Fire was such a step down.\n\nThe last two movies even had a plot (somewhat) similar to Children of Men. An underground group meeting in secret. A smaller group fleeing to complete the mission themselves. Hiding from a corrupt and oppressive government. Navigating an active war zone in some of the final scenes.\n\nI still enjoy the rest of the movies but Cuarón would have been better suited and produced something amazing rather than serviceable.\n\nIt could have been like Paddington 2 - genuinely great filmmaking from a genre you wouldn't expect.",
        "upvotes": 2224,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1py8f5j/in_an_alternate_universe_alfonso_cuarón_directed/"
    },
    {
        "id": "1pyn39z",
        "author": "thegamewarrior",
        "title": "What Are the Most Recognizable Movie/TV ‘Photographs’",
        "content": "I’m looking to do some decorations in my living room for the first time in my life. My family has never been big on taking photographs, but I would like to put up what we have framed and it would just be a little bare. \n\nI was thinking about framing a collection of popular movie and television photographs, and have them around our normal photos. Not screenshots or frames from the film, but where the characters in the scene were actually posing for a photo. \n\n The first three that came to mind were Laura Palmer from Twin Peaks, the ‘erased from existence’ photograph from Back to the Future as well as the photo of Doc and Marty in front of the clock in the old west. \n\nAre there any big ‘photos’ that I should have?",
        "upvotes": 116,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1pyn39z/what_are_the_most_recognizable_movietv_photographs/"
    },
    {
        "id": "1pysupt",
        "author": "MrPuroresu42",
        "title": "Gary Oldman as Sid Vicious - MY WAY (Sid &amp; Nancy, 1986, directed by Alex Cox)",
        "content": "",
        "upvotes": 56,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PUcgxBjEtAV79sprPzGJaQi67ymFQCMUA8n61nTDzMU.jpeg?auto=webp&amp;s=7a797fe12aa578eb4a1a108d22dc43a002eca48f"
        },
        "permalink": "/r/movies/comments/1pysupt/gary_oldman_as_sid_vicious_my_way_sid_nancy_1986/"
    },
    {
        "id": "1pynxvu",
        "author": "browniebiscuitchildr",
        "title": "What’s a horror movie that manages to work with a surprising lack of gore?",
        "content": "My first vote is the original Texas Chainsaw Massacre which, if you consider the title, is shocking as hell. I mean, with a title like that, you’d expect a bloodbath, right? But no! It’s surprisingly bloodless. The most red you’re ever going to see is when Sally escapes by breaking through that window and gets cut up to shit. ",
        "upvotes": 94,
        "comments": 172,
        "media": null,
        "permalink": "/r/movies/comments/1pynxvu/whats_a_horror_movie_that_manages_to_work_with_a/"
    },
    {
        "id": "1pz6s1i",
        "author": "swadezy",
        "title": "What’s a movie that you don’t want to watch a second time but would love to experience it for a first time again?",
        "content": "Just watched Warfare and holy hell that movie presents such a unique level of intensity. The sound design is so immersive. When it is silent, all you want  is some of type sound to happen. When they finally turn the sounds on you instantly start begging for it to be turned off. It is such a surreal experience that I’d recommend anyone to see. But I would not want to go through that again",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1pz6s1i/whats_a_movie_that_you_dont_want_to_watch_a/"
    },
    {
        "id": "1pxzub6",
        "author": "Amaruq93",
        "title": "\"Street Fighter II: The Animated Movie\" (1994, directed by Gisaburō Sugii) - Chun-Li vs Vega, one of the film's many fight sequences that were choreographed by K-1 Kickboxing founder Kazuyoshi Ishii and professional fighter Andy Hug.",
        "content": "",
        "upvotes": 2614,
        "comments": 308,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0c33papqvz9g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pxzub6/street_fighter_ii_the_animated_movie_1994/"
    },
    {
        "id": "1py8a0i",
        "author": "Wonder-Lad-2Mad",
        "title": "Actors who excel in playing assholes?",
        "content": "I finished watching Wake Up Deadman, this is the second Josh Brolin movie I've seen this year where he plays an asshole, the other being the dad from Weapons. He was great in Wake Up Dead Man. Monsignor Wicks is a fucking hilarious character.\n\n\nIt's just got me thinking that Brolin gets type cast a little bit for playing gruff assholes, hardasses, tough guys. No matter if if's a villain or a hero. And of course he excels at it. He's good. He has a mean mug and he knows how to act surly. Personally I think he would have been a dream casting for oldman Bruce Wayne if there ever was a TDKR adaptation.\n\n\nWho else has made a career out of playing intense, surly asshole?",
        "upvotes": 800,
        "comments": 1315,
        "media": null,
        "permalink": "/r/movies/comments/1py8a0i/actors_who_excel_in_playing_assholes/"
    }
]