[
    {
        "id": "1gopnv6",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 482,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gopnv6/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1dvcui6",
        "author": "SuperYumYum4",
        "title": "Join Our Official Real Madrid Discord Server! 🎉",
        "content": "Hello, Madridistas!\n\nAre you a die-hard Real Madrid fan looking for a place to connect with fellow supporters, discuss matches, share the latest news, and celebrate our team's victories? Look no further! We are thrilled to invite you to join the official Real Madrid Discord server, affiliated with r/RealMadrid!\n\nWhat you can expect: \n\n⚽ **Live Match Discussions:** Share the highs and lows of every game with passionate fans from around the world. \n\n📰 **Latest News and Updates:** Be the first to know about transfers, injuries, and everything happening at the Bernabéu. \n\n💬 **Engaging Conversations:** From tactical analyses to legendary moments, dive into discussions that fuel your Madridista spirit. \n\n🔗 **Exclusive Content:** Access to special channels, giveaways, activities, and much more!\n\nWhether you're celebrating our 16th Champions League title or reminiscing about the days of Raúl and Zidane, our Discord server is the perfect place for every Real Madrid fan and visitors from other clubs!\n\nJoin us now and be a part of the ultimate Real Madrid community! Click the link below to get started:\n\n👉 [Join the Official Real Madrid Discord Server](https://discord.com/invite/syH7yen)\n\n¡Hala Madrid y nada más! 🏆 ",
        "upvotes": 20,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u4l1xNtCIW0FXA4Dnno3EQjSvqnclQ211LYfuSKPxlI.jpg?auto=webp&amp;s=973ac16b1aa2a38aa87296bed6c7a4e2e55d90e2"
        },
        "permalink": "/r/realmadrid/comments/1dvcui6/join_our_official_real_madrid_discord_server/"
    },
    {
        "id": "1gpuz3q",
        "author": "hHjJj68",
        "title": "Legendary moment still feels like it was just yesterday 🔙",
        "content": "",
        "upvotes": 203,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4dsiu3hu8j0e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1gpuz3q/legendary_moment_still_feels_like_it_was_just/"
    },
    {
        "id": "1gps8zo",
        "author": "CuteAction1698",
        "title": "(La Fábrica) Marc Cucalón, forced to say goodbye to soccer at the age of 19 due to a bacteria",
        "content": "Marc Cucalón (19 years old) has had to live the most bitter face of the soccer world. The midfielder from Aragon, considered by many as one of the great pearls of La Fábrica, suffered a serious knee injury on September 6, 2022 that has ended up forcing him to hang up his boots 796 days later. \"I didn't know how to start this letter. So I will do so by saying THANK YOU to everyone. From the bottom of my heart. For all the support you have given me during all this time. I arrived at the Real Madrid youth academy in the summer of 2016 as a child with a backpack full of dreams and I have been very, very happy,\" begins his heartbreaking letter.\n\n[https://www.marca.com/futbol/real-madrid/2024/11/12/marc-cucalon-obligado-decir-adios-futbol-19-anos-culpa-bacteria-sabia-empezar-carta.html](https://www.marca.com/futbol/real-madrid/2024/11/12/marc-cucalon-obligado-decir-adios-futbol-19-anos-culpa-bacteria-sabia-empezar-carta.html)",
        "upvotes": 233,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ne3xqBByhC6JpywAZESmEHzktOjWfSSv24Z2iOp8N_E.jpg?auto=webp&amp;s=54a0d1ba1ece209616962402afcf1511bb2ba785"
        },
        "permalink": "/r/realmadrid/comments/1gps8zo/la_fábrica_marc_cucalón_forced_to_say_goodbye_to/"
    },
    {
        "id": "1gpn4ri",
        "author": "200kAndHomeless",
        "title": "Real Madrid step up talks to sign William Saliba ",
        "content": "It's reported that Florentino Perez has already made contact with Salibas entourage regarding a move to Madrid this January.\n\nI find this deal highly unlikely in January but definitely something to consider in the summer.\n\nArsenal trying to sign Saliba to a new deal \n\nWhat are your thoughts? Is saliba the right player? Is January feasible or is this a summer move ? ",
        "upvotes": 258,
        "comments": 138,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gpn4ri/real_madrid_step_up_talks_to_sign_william_saliba/"
    },
    {
        "id": "1gp5adh",
        "author": "Theme_Severe",
        "title": "Jude's laughter reaction to vini's celebration. we missed the lads like this",
        "content": "",
        "upvotes": 3022,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2rqum2v6nc0e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1gp5adh/judes_laughter_reaction_to_vinis_celebration_we/"
    },
    {
        "id": "1gpgw2q",
        "author": "Ok-Breakfast1",
        "title": "Can Trent Alexander-Arnold Replace Dani Carvajal? - Scouting Report",
        "content": "",
        "upvotes": 145,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jr_RlK3ueGUatofcxVx4sb3m7PwKLFjk1q9ca5oVraQ.jpg?auto=webp&amp;s=2ba7756d77a4d5206cf1a5e773b0861ccca9fb6e"
        },
        "permalink": "/r/realmadrid/comments/1gpgw2q/can_trent_alexanderarnold_replace_dani_carvajal/"
    },
    {
        "id": "1gpwdva",
        "author": "ManuMora98",
        "title": "[Basket] Big win against Virtus Bologna 98-86 after a great second half in Sergio Llull's 1100th game with Real Madrid. ",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DBI-8CAb7zz4ei6DyfllSqs8ljwMQ82wokYMVpPUK58.jpg?auto=webp&amp;s=a9d0a647ad0d2602c82406a2865863bb4895079a"
        },
        "permalink": "/r/realmadrid/comments/1gpwdva/basket_big_win_against_virtus_bologna_9886_after/"
    },
    {
        "id": "1gor5ww",
        "author": "Warsame_Jr",
        "title": "Vinicius is on fire this year.",
        "content": "I think he will finish top of the list at end of the year, that is if lewa doesn't go absolutely crazy for the remainder of the year. ",
        "upvotes": 1662,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kv4adzbko90e1.jpeg?auto=webp&amp;s=4ec0194bcaadfae1d8edc5eb7bf7a97755d7e1d8"
        },
        "permalink": "/r/realmadrid/comments/1gor5ww/vinicius_is_on_fire_this_year/"
    },
    {
        "id": "1gomwd0",
        "author": "Ambashe",
        "title": "Sergio Ramos Running To Bernabéu ",
        "content": "Sergio Ramos posted this video on his Instagram account at the same moment Militao was injured.\n",
        "upvotes": 2058,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/khoq6ea0780e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1gomwd0/sergio_ramos_running_to_bernabéu/"
    },
    {
        "id": "1goqsco",
        "author": "TimothyX7",
        "title": "🚨⚠️ Real Madrid expect Rodrygo to be out for the next 5-6 weeks with his new injury, including rehab to be 100% fit.",
        "content": "",
        "upvotes": 684,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OyjkmSyNEClERfnEyWgm9Tb4NhZFj4Pb2_F7fS9vM3M.jpg?auto=webp&amp;s=aaee0466b3e606e8408bdeec74935cc2af2ba082"
        },
        "permalink": "/r/realmadrid/comments/1goqsco/real_madrid_expect_rodrygo_to_be_out_for_the_next/"
    },
    {
        "id": "1goqq85",
        "author": "yus508",
        "title": "What I Learnt Going to Watch Real Madrid",
        "content": "I thought I’d share what I Iearnt when buying tickets to see Real Madrid play if you’re coming from abroad. When I was doing my research, I found some information a bit hard to find, and some of the information on this sub is outdated. \n\n1. Tickets only go on sale a few days before the game.\n\n2. On the website, for the game you’re going to, they’ll release the times that tickets go on sale about 10-12 days before the game under *Mas Informacion/More Information*.\n\n3. I didn’t get a Madridista premium membership and I still got tickets. From what I can gather, it’s not much help, but ymmv. Especially as the chances of getting a ticket seem to be higher the longer you wait.\n\n4. There is no ticket or box office at the stadium, which I found really surprising. I think it is terrible for fans as it favours touts, resellers and bots. I asked at the stadium club shop, the tour ticket office, and at the club shop in the city. Every time, I was directed to one place: online. Which is great when the website is so terrible.\n\n5. When tickets do go on sale, just like the best football teams you’re gonna need three P’s: **Patience, Persistence, and Pressing** the same buttons over and over and over again.\n\n6. This is how the process went for me: Press “buy tickets” &gt; Enter a queue &gt; Es tu turno &gt; Select how many tickets you want &gt; Select a stand that has availability &gt; Select a section that has availability &gt; Ticket isn’t actually available &gt; Get sent back to select how many tickets you want &gt; Repeat this process as tickets randomly appear and disappear all over the stadium.\n\n7. New tickets are always popping up, so if you see them dwindling and can’t get one, save your sanity and come back later.\n\n8. I didn’t get tickets the day they went on sale or the day after. I got them about 10 pm on the third day after trying constantly. I don’t know this for certain, but I’d say that being in Spain helps because the website you access was different when I got to Madrid than it was when I tried at home. I tried a VPN and that didn’t work.\n\n9. It’s hard to get seats together. One of the things I think helped was switching from trying to get two tickets to one ticket. Then, after getting one, I went back through the process and got another fairly quickly. In the end, my friend and I were sat in different sections, but at least we had tickets.\n\n10. I’m from the UK and didn’t have an issue with my card because we have 3D Secure payments, which seems to be the issue with US cards.\n\n11. The night before the game, I decided to have another look and found it much easier to get a ticket. The process above still occurred, but with a much higher success rate (even some in the same section). This might be because all the tickets that season ticket holders aren’t using had finally been added to the website, but that’s just my guess. Also, strangely, the UI had changed slightly.\n\n12. The morning of the game, around 9am (kick off at 2pm), I looked *again* and found tickets in some pretty desirable locations actually. Then I checked back at around 11/12pm and nada. I couldn't even get in to see what tickets were available because it sent me to a different screen. I kept checking until I entered the stadium around 10 mins before kick off and it stayed the same. \n\n13. If you’ve been stuck in the ticket selection carousel long enough to question your life choices, it pays off in the end. Watching Real Madrid at the new Bernabeu stadium is amazing, and even more impressive than I thought it would be.\n\n\n**A final thing to note**: This is all based on my experience trying to get tickets for the game against Osasuna, so obviously not one of the more in-demand games. If you’re trying to get tickets for, say, El Clasico or AC Milan, I imagine you’ll have a much different experience—likely ending with a visit to StubHub after calling your loan advisor.\n\n\nI hope this helps someone. Overall it is a frustrating experience, but so worth it in the end! ",
        "upvotes": 193,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1goqq85/what_i_learnt_going_to_watch_real_madrid/"
    },
    {
        "id": "1goqvxf",
        "author": "Endlessly-Blonde",
        "title": "What’s the point in even having Vallejo in the squad if he’s completely unusable? We have all these defensive injuries, yet he’s not even mentioned as an option to play.",
        "content": "Everytime we all speak about options for us to use in defense, Vallejos name is NEVER mentioned. It’s almost like he’s not even considered a Real Madrid player, even though he is one. \n\nNow I understand why that is, because he’s absolutely horrendous, and probably isn’t even a La Liga standard player, let alone Real Madrid standard, but if we’re not gunna use him at all this season (especially after conceding 2 vs Alaves when he made his only appearance) then what’s the point in him taking up a space in the squad? Why not just terminate his contract, pay him off and then give that spot to a defender in the academy? Surely giving the opportunity to a young defender is a much better idea than having someone get paid to simply warm the bench. It’s pointless",
        "upvotes": 142,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1goqvxf/whats_the_point_in_even_having_vallejo_in_the/"
    },
    {
        "id": "1gow14h",
        "author": "arastumudgal",
        "title": "Want to watch full match replays of 2016/17 season",
        "content": "\nPreferably UCL Knockouts. One of the most iconic seasons for CR7, the match against Bayern, Atletico, and the Juve final. My favourite season of ours. \nPlease help me out if you have any sources/links! Found a site called “footballia.eu” but it had spanish commentary. I would be grateful if you could link some with english commentary preferably. \nThanks!",
        "upvotes": 41,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gow14h/want_to_watch_full_match_replays_of_201617_season/"
    },
    {
        "id": "1gojoft",
        "author": "chui77",
        "title": "[Post Match Survey] Real Madrid 4-0 Osasuna",
        "content": "",
        "upvotes": 242,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gojoft/post_match_survey_real_madrid_40_osasuna/"
    },
    {
        "id": "1gob4s9",
        "author": "markievegeta",
        "title": "Third kit wanker 🩶🩶🩶",
        "content": "This is my favourite non white kit since the purple kit. I love that they did a shoe in the same colour way. ",
        "upvotes": 322,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gob4s9/third_kit_wanker/"
    },
    {
        "id": "1goadkp",
        "author": "Live-Craft1592",
        "title": "Mbappe's current problem",
        "content": "The reason Mbappé doesn’t fit well so far is that he lacks Real Madrid’s intense work rate. Almost every player in the starting XI had to earn their spot, often starting from the bench. Vini proved himself to be worthy of the No. 7 shirt and a starting role after four years. Rodrygo is playing out of position and still doesn’t have guaranteed minutes. Both Vini and Rodrigo chase the ball back when they lose it. Last season, Kroos and Modrić rarely played 90 minutes despite being here for 12-14 years. Arda and Endrick are constantly playing 5-15 minutes only or not coming on at all. They still make relentless runs, and press because they know they’ll earn a spot in 1-2 years. Camavinga, Tchouaméni, and Modrić—no one gets 90 minutes or plays in their preferred position by default; they’re always working for it. Players like Bellingham and Valverde constantly play 90 minutes because they’ve already proven themselves. It’s clear their work rate is exceptional. Lunin was a fantastic keeper last season, but didn’t play in the finals. Joselu gave his all, but we didn’t keep him. Literally everyone has worked hard to earn the starting XI except mbappe.\n\nAll our players are constantly pressing; even in 2022, Benzema pressed when he lost the ball. In addition to that, all our attackers—along with Bellingham—have expert positioning. (Just look at the goals vs. Osasuna: Bellingham and Vini’s final goal should have been Mbappé’s, but he didn’t make the run.) They find space and position themselves; they don’t just wait for the ball. But Mbappé, \"King of France,\" was constantly receiving passes at PSG and for France, where he didn’t have to press or find space. That’s why he’s not used to it. He expects players to constantly pass to him. When he loses the ball, he drops his head and doesn’t press. \n\nHe has Ronaldo’s arrogance, but Ronaldo was manageable because he delivered results and still made runs. Mbappé, on the other hand, is a roadblock for us. I think Ancelotti should instruct him to start positioning himself better, pressing and making those runs, or reduce his minutes and give Endrick, Arda, and Bellingham a chance to play in the ST/CAM roles. He’s problem is that he’s basically the president’s son.",
        "upvotes": 275,
        "comments": 112,
        "media": null,
        "permalink": "/r/realmadrid/comments/1goadkp/mbappes_current_problem/"
    },
    {
        "id": "1god2mp",
        "author": "blueXwho",
        "title": "What's with all the negativity after a comfortable win?",
        "content": "We played a good game against Osasuna, Vinicius showed why he's the best of the world, Bellingham back to his false 9 runs, Asencio was unexpectedly great, and Ancelotti finally gave minutes to Endrick and Güler.\n\nIt looks like they did discuss problems and were more dynamic and focused. It was not an easy game and they were really serious about it. So why is everyone stuck in the pre-match hate? Seriously, try to enjoy the team.\n\nThis sub is just filled with rant after rant, constant posts about \"what's wrong with Mbappé\", talking about sacking Ancelotti, and talking about Florentino Pérez as if he were the worst president in the history of the club.\n\nYes, there have been mistakes. Yes, it would be great to have two world-class RB and 6 elite CB, but that's not how the market works and the locker room has been amazing thanks to consistency. Last season everyone was criticizing the board for not buying this guy or that guy, but we ended up having a great season. Now, we see that Ancelotti has plan A, B, and C for unfortunate events, like this series of injuries. No club, other than those with unlimited resources, can plan for 4 long injuries in defense.\n\nI thought we were all here to support our club, not to trash it as if we were supporting other teams.\n\nYes, criticizing is good, but the number of hate posts is insane.\n\nHala Madrid!",
        "upvotes": 112,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1god2mp/whats_with_all_the_negativity_after_a_comfortable/"
    },
    {
        "id": "1gocfh2",
        "author": "BandKidFloz",
        "title": "Get Behind The Team!",
        "content": "Since the start of the season I think we’ve all been disappointed with the team. None of our players bar a few have even had the right attitude in games. \n\nNow if we don’t win anything this season. I can live with it. With all the injuries and lack of personnel, if we went and won anything it would be overachieving all things considered. \n\nEven with all of that… we’re still only 6 points behind Barcelona in the league with a game in hand 🤔\n\nThey’re not amazing, we saw that when we played them. This Barcelona team is very beatable, not just for us but for everyone. And they lost today 🙏🏾\n\nI genuinely believe that if we fix the attitude within the dressing room, and Carlo rotates more with youth (He is forced to at this point) we still have a good chance of winning something. I think at this point we’re forced to sign a new defender in January, as well as promoting AT LEAST one Castilla player in addition to Asencio. Otherwise it would be an insult to players like Rudiger who just don’t get a break. \n\nWhen you think back to seasons like 19/20, it’s possible. So we as fans need to believe it’s possible too. ",
        "upvotes": 85,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gocfh2/get_behind_the_team/"
    },
    {
        "id": "1go41ty",
        "author": "Icy-Designer7103",
        "title": "There's only CB I could see the board pursing in the January window...",
        "content": "Let's be realistic for a moment, unless Perez makes some record-breaking crazy offer, every scenario of Saliba, Romero, Bastoni, VVD etc. for the Winter transfer window is completely unrealistic. There's a chance we might pursue some of these player in the summer, but no big team would want to sell their star defender in the middle of the season and some of these players also won't want to leave, out of respect for their teams.\n\nSergio Ramos for 6 months is something we would all love to see as fans, but I doubt Perez is on the same boat, considering their past. And from what I've seen, there's no other decent free agent CB available.\n\nThere's one team in the UCL that has underperformed a lot by their standards (even worse than us, lol), that's RB Leipzig, with 0 points in 4 games. In the remaining 4 they have to face Inter, Aston Villa, Sporting Lisbon and Sturm Graz, so there's very realistic chance they won't even manage to qualify for the play-offs. This means no European football for Leipzig after the league phase.\n\nThis might be a good opportunity for us to try to convince Castello Lukeba, their starting CB, to join in January. We offer him an almost guaranteed starting spot in the best club in the world and (most likely) UCL football in the second half of the season. Lukeba is French and 21 years old, sounds like a pretty realistic signing based on our policy. He is also left footed.The only problem is that he has a MV of 40m and he just renewed his contract, so even a 50-60m offer might get rejected. And I don't think Perez is very happy to spend that money, but he HAS TO do something at this point.\n\nDespite Leipzig's poor form in the UCL, they have the best defense in the Bundesliga, with only 5 goals conceded so far. His Fotmob average is 7.29, Whoscored is 7.02. There are already some rumors about him and for me, he looks like the most realistic option, if we're to actually sign someone in a couple of months.\n\n**EDIT**: Title \"There's only ONE CB\"",
        "upvotes": 198,
        "comments": 111,
        "media": null,
        "permalink": "/r/realmadrid/comments/1go41ty/theres_only_cb_i_could_see_the_board_pursing_in/"
    },
    {
        "id": "1gnyrzj",
        "author": "Midtharefaikh",
        "title": "Ramos' (possible) hint at wanting to come back home to Madrid...👀",
        "content": "https://preview.redd.it/ymvlp6fp820e1.png?width=974&amp;format=png&amp;auto=webp&amp;s=43e38766fb3f448a337be1e40062a9edee5473b6\n\nMaybe I am reading too much into this. \n\nBut I genuinely can't think of a reason why he would have liked this post except to signal that he wants to return to Real Madrid. \n\nThis can be an excellent transfer for us, as everyone has been saying that we need to get him back, also since he is free and close to retirement he can be the perfect temporary CB we need until we sign someone, or Alaba and Militao get back to the pitch.\n\nWhat do you guys think?",
        "upvotes": 395,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1gnyrzj/ramos_possible_hint_at_wanting_to_come_back_home/"
    },
    {
        "id": "1go24a9",
        "author": "oaleebih",
        "title": "I saw you posting here Real Madrid creator kits so here are some of mine (I couldn't find all, this I made for myself way back when I was playing PES 21, description in images)",
        "content": "",
        "upvotes": 122,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1go24a9/i_saw_you_posting_here_real_madrid_creator_kits/"
    }
]