[
    {
        "id": "1j8ru02",
        "author": "RadDayAMA",
        "title": "Hi /r/movies! I'm Bill Allen, lead actor of the 1986 cult-classic sports film 'RAD'. It was recently restored &amp; remastered in 4K and is coming back to theaters on March 21st for RAD DAY 2025, on top of the physical release. Ask me anything!",
        "content": "",
        "upvotes": 216,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n2wudfesj2oe1.png?auto=webp&amp;s=6bf62c9b7b9229f5503f4691d700c422930c946f"
        },
        "permalink": "/r/movies/comments/1j8ru02/hi_rmovies_im_bill_allen_lead_actor_of_the_1986/"
    },
    {
        "id": "1j8q17g",
        "author": "FangAMA-Richard",
        "title": "Hey everyone. My name is Richard Burgin and I'm an indie filmmaker. I'm here to talk about my first feature film, the psychological body horror movie FANG (2022). I'm here with screenwriter Sean Sullivan who worked with me on THE SLAUGHTER BROTHERS DIME CIRCUS (2025). Ask us anything!",
        "content": "",
        "upvotes": 42,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j3e45q9942oe1.png?auto=webp&amp;s=eec9b77d05c7f8d7e9e6f8c3f65f0a80464c932d"
        },
        "permalink": "/r/movies/comments/1j8q17g/hey_everyone_my_name_is_richard_burgin_and_im_an/"
    },
    {
        "id": "1j8rpx1",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'Deep Cover' Starring Bryce Dallas Howard, Orlando Bloom &amp; Nick Mohammed - Three improv actors are hired by the police to help stage low-level stings. Their instinct to ‘always say yes’ without breaking character leads them deep inside the London criminal underworld.",
        "content": "",
        "upvotes": 2574,
        "comments": 278,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xicgz3vdj2oe1.jpeg?auto=webp&amp;s=ee2f76e1f40118dea14042bcc1222542fca71ffa"
        },
        "permalink": "/r/movies/comments/1j8rpx1/first_images_from_deep_cover_starring_bryce/"
    },
    {
        "id": "1j89i8c",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Jack Quaid &amp; Jeffrey Dean Morgan in 'Neighborhood Watch' - Simon, a man grappling with mental illness, becomes convinced that he has witnessed an abduction. When the police refuse to believe him, he reluctantly seeks the help of his neighbor, a retired security guard.",
        "content": "",
        "upvotes": 6507,
        "comments": 341,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ywpmpmwjgxne1.jpeg?auto=webp&amp;s=7628ffa1a5d266d7d123a3edd53e771a63f78627"
        },
        "permalink": "/r/movies/comments/1j89i8c/first_images_of_jack_quaid_jeffrey_dean_morgan_in/"
    },
    {
        "id": "1j8dgrr",
        "author": "BitchPancake",
        "title": "HBO Max’s platform ruins the ending of My Neighbor Totoro",
        "content": "I’m sure I’m not the first person to bring up that it’s annoying that the streaming services have all decided that the second the credits roll on a movie, that the movie’s image should immediately become a smaller box that they shove in the corner. But in the case of My Neighbor Totoro I believe it ruins one of my favorite moments in any movie. \n\nSPOILER BELOW\n\nInstead of seeing the incredibly touching moment of the Mom returning home from the hospital with her children Satsuki and Mei leaping to hug her….HBO Max has decided that instead it should be a bunch of little boxes trying to get me to click on another program to watch. \n\nI guess this just scores 1 more point for the superiority of physical media but it still shouldn’t be this way. ",
        "upvotes": 2068,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1j8dgrr/hbo_maxs_platform_ruins_the_ending_of_my_neighbor/"
    },
    {
        "id": "1j8cgv5",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana’ Trial Ends in Win for Disney as Company Is Cleared of Copyright Infringement",
        "content": "",
        "upvotes": 1905,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/50Eg4XTXKPVELmb8EnhhK58eCzxwhrd3ZS23CleqipQ.jpg?auto=webp&amp;s=6aae70a8b6046a56d01ca3f24264773e383e882c"
        },
        "permalink": "/r/movies/comments/1j8cgv5/moana_trial_ends_in_win_for_disney_as_company_is/"
    },
    {
        "id": "1j8tys9",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'The Uninvited' - Starring Elizabeth Reaser, Walton Goggins and Pedro Pascal",
        "content": "",
        "upvotes": 82,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g6df62qw03oe1.jpeg?auto=webp&amp;s=fa286ba5df6720cef95c393ad9b40335dcd42da8"
        },
        "permalink": "/r/movies/comments/1j8tys9/official_poster_for_the_uninvited_starring/"
    },
    {
        "id": "1j8gx1q",
        "author": "Odd_Advance_6438",
        "title": "In Snowpiercer, whats the reason for the guards cutting the fish before that one fight scene? Also, are they blindfolded",
        "content": "Great movie. Really love the shot of them gutting the fish before the fight, but I’m not sure what it really means. Is the fish poisonous? Is it to show that they can afford to waste resources that the back of the train would die for? Is it just an intimidation tactic? I’m guessing it’s just the last one, as it is an unsettling image, but it just seems kind of random",
        "upvotes": 773,
        "comments": 103,
        "media": null,
        "permalink": "/r/movies/comments/1j8gx1q/in_snowpiercer_whats_the_reason_for_the_guards/"
    },
    {
        "id": "1j8e1wm",
        "author": "novocainemovie",
        "title": "Hi, I’m Jack Quaid, from the upcoming movie NOVOCAINE and you might also know me as one of The Boys. AMA!",
        "content": "Hey Reddit! Jack Quaid here.\n\nYou’ve seen me as Hughie from “The Boys,” Richie from ‘Scream’ and most recently Josh from ‘Companion.’\n\nI’m excited to chat with you guys about my new movie ‘Novocaine’ where I play Nathan Caine, who feels no pain and goes on a batshit insane journey for love.\n\nIt’s hilarious, it’s gory, it’s somehow… romantic? There’s tons of bonkers fight scenes and it’s just an overall good time – can’t wait for you guys to check it out in theaters this weekend.\n\nI’ll be back on March 12 at 12:30pm ET / 9:30am PT to answer your questions!\n\nhttps://preview.redd.it/gfb67mkrfyne1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=240208d607cf45ed78b7687ebeff4b3ecbc096e0\n\n",
        "upvotes": 915,
        "comments": 599,
        "media": null,
        "permalink": "/r/movies/comments/1j8e1wm/hi_im_jack_quaid_from_the_upcoming_movie/"
    },
    {
        "id": "1j8amms",
        "author": "SanderSo47",
        "title": "March 7-9 Box Office Recap: 'Mickey 17' flops with an underwhelming $19 million domestically and a weak $53.3 worldwide total, against a $118 million budget. 'Ne Zha 2' crosses $2 billion in China.",
        "content": "https://preview.redd.it/aofa0t30pxne1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=367e3fc800286c66b0f76329f8703a94f53e9972\n\nIt was a very weak start for the month of March.\n\nWith incredibly weak competition, Bong Joon-ho's ***Mickey 17*** topped the box office, but it still proved to be the latest sci-fi flop at the box office. There were 3 other wide releases, all of which flopped as well. Needless to say, it was brutal.\n\nThe Top 10 earned a combined $49.2 million this weekend. That's an awful 62.4% drop from last year, when ***Kung Fu Panda 4*** topped the box office. This weekend is also barely up from last week, when there was just one wide release.\n\nOpening at #1, WB's ***Mickey 17*** flopped with just $19 million in 3,807 theaters. These numbers are eerily similar to the box office failures of other sci-fi films like ***Jupiter Ascending*** ($18.3 million), ***Ad Astra*** ($19 million), and ***The Creator*** ($14 million). The only comfort is that it was Bong Joon-ho's biggest debut, but that's not saying much considering his prior films all opened in limited release. And it cost more than all his films ($118 million).\n\nThe failure of ***Mickey 17*** isn't surprising. There's a risk in opening a new sci-fi film, citing the failure of the previously mentioned titles. Even though ***Mickey 17*** is based on a book, it was treated as an original title anyway. So the film's disappointing numbers are another hit at the argument that audiences crave for new and original films.\n\nBong is popular with the cinephile audience; there was enormous interest in seeing what he would do after the colossal success of ***Parasite***. But it's been 5 years since that film won Best Picture, and it appears that the public moved on. This film was originally set for March 2024, but it faced many delays. WB reportedly spent $80 million in marketing the film, and while it properly sells the film, many were taken aback by the film's humor and tone. Even though this is consistent with Bong's films, perhaps the audience was expecting something more serious, as sci-fi comedies are very niche. \n\nThis also brings up the topic of star power. Robert Pattinson is definitely popular, thanks to his roles in franchises like ***Harry Potter***, ***Twilight*** and ***The Batman***. But the thing is that his roles as leading man in non-IPs have not translated to box office success. Most of his films have been limited releases, and his last box office hit besides the three previously mentioned was ***Water for Elephants***, which came out back in 2011. This is not something exclusive to Pattinson, given that a lot of actors have struggled to open original titles. Reviews were positive (78% on RT), but not strong enough to convince those skeptical.\n\nAccording to Warner Bros., 65% of the audience was male and 71% was 25 and over. They gave it a middling \"B\" on CinemaScore, which is neither bad nor great. There's a strong chance ***Mickey 17*** could be front-loaded, given that its Thursday previews ($2.5 million) should've guaranteed a $20+ million debut and it fell far short of it. For now, a $50 million domestic total is likely for ***Mickey 17***, marking the latest box office misfire for WB.\n\nAfter topping the box office for three weekends, ***Captain America: Brave New World*** had to go to second place. It dropped 44%, adding $8.3 million this weekend. That's a fine drop, although it would've been ideal if it happened far sooner. Through almost one month, the film has earned $176.4 million, and it should get close to $200 million. Better than its second weekend suggested, but still not really a win.\n\nIn third place, Focus Features' ***Last Breath*** dropped 48%, adding $4 million this weekend. Through ten days, the film has amassed $14.5 million so far, and it should finish with over $20 million by the end of its run.\n\nIn fourth place, Neon's ***The Monkey*** eased 39% this weekend, adding $3.9 million this weekend. The film has earned $31 million domestically, and it has already passed ***I, Tonya*** ($30 million) to become Neon's third highest film ever.\n\n***Paddington in Peru*** had its best drop yet. It eased just 18% this weekend, adding $3.7 million. The film has earned $36.8 million, and it should close with around $45 million domestically.\n\nDreamWorks' ***Dog Man*** dipped a light 20%, earning $3.3 million this weekend. The film's domestic total stands at $88.6 million so far, and it's fighting to hit the $100 million milestone.\n\nAfter earning 5 Oscar wins, Best Picture winner ***Anora*** got expanded to 1,938 theaters. The film earned $1.8 million, taking its domestic total to $18.3 million. Quite impressive, considering it has been on digital platforms since December.\n\n***Mufasa*** refuses to leave the Top 10. It eased just 16% this weekend, adding $1.6 million. With this, it has crossed $250 million domestically.\n\nAngel Studios also opened ***Rule Breakers*** in 2,044 theaters, but it flopped with just $1.5 million. That's one of the worst debuts for a film playing at over 2,000 theaters, and translates to a very poor $736 per-theater average. Even with an \"A\" on CinemaScore, this film will disappear quickly from theaters.\n\nRounding up the Top 10 was another flop. It was Paul W.S. Anderson's new film, ***In the Lost Lands***, which debuted with a meager $1 million in 1,370 theaters. That's Anderson's worst debut ever, even below ***Monster Hunter*** ($2 million), which came out during terrible conditions in December 2020. Expect this to fade quickly.\n\nWhat's worse than 3 wide releases flopping? 4 wide releases flopping. Viva Pictures released ***Night of the Zoopocalypse*** into 1,400 theaters, but it earned just $804,370 this weekend. Pathetic.\n\n#**OVERSEAS**\n\n***Mickey 17*** also made its appearance worldwide, but it was very unimpressive. The film debuted with $24.5 million overseas; adding its South Korean numbers from last week, the film has earned a weak $53.3 million worldwide. It had very soft debuts in France ($2.9M), the UK ($2.7M), Germany ($1.3M) and Mexico ($1.3M). Its biggest market, unsurprisingly, is South Korea with $14.6 million so far. With these numbers, it's clear ***Mickey 17*** won't be a box office success.\n\n***Captain America: Brave New World*** has added $9.2 million overseas, taking its worldwide numbers to $371 million. The best markets are the UK ($21.2M), Mexico ($14.5M), China ($14.3M), France ($12.8M) and South Korea ($11.2M). The film might actually cross $400 million, although it's still far from breaking even.\n\n***Bridget Jones: Mad About the Boy*** added $7.3 million, allowing it to cross $103.8 million in the overseas markets. Its best marekts are the UK ($51.1M), Australia ($8.6M), Netherlands ($5M), Poland ($4.8M) and Germany ($4.1M). \n\nBack in China, ***Ne Zha 2*** made history by crossing $2 billion in the country. In the process, it already passed ***Avengers: Infinity War*** to become the sixth highest grossing film worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Conclave* | Oct/25 | Focus Features | $6,601,995 | $32,580,655 | $104,360,856 | $20M\n\n- ***Conclave*** has ended its run with a fantastic $104 million worldwide. That's a great result for an adult drama, and a sign that there's an audience for films like this. Whether you like the film or not, it's great that a film like this could find an audience instead of being sent to straight-to-streaming.\n\n#**THIS WEEKEND**\n\nWe've got three wide releases this weekend, and there's a strong chance that there won't be a single film hitting $10 million this weekend.\n\nThe first is Paramount's action comedy ***Novocaine***, which stars Jack Quaid as a bank executive with the inability to feel pain who goes out to rescue his coworker after she is taken hostage by a group of bank robbers. The film has already screened for critics, and reviews are quite solid (89% on RT). A possible sleeper hit?\n\nThe other release is Steven Soderbergh's newest film, Focus Features' ***Black Bag***. It stars Cate Blanchett, Michael Fassbender, Marisa Abela, Tom Burke, Naomie Harris, Regé-Jean Page, and Pierce Brosnan, and follows an intelligence agent who suspect his wife might be a traitor. Soderbergh is coming off ***Presence***, which made just $9.2 million, becoming one of his lowest grossing titles. Focus has emphasized action and intrigue, and the reviews are currently on fire (91% on RT), so this should have no problem in opening far higher.\n\nFinally, there's ***The Day the Earth Blew Up: A Looney Tunes Movie***. In a twist of fate, WB is not handling this movie, deciding to sell it off instead. The distributor is Ketchup Entertainment, a recent company that hasn't had box office success in the past few years. And it's unlikely this movie changes that trajectory.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 1217,
        "comments": 343,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JntJ454MJR_NTiWB_oGmLMDoHowxLWtQz7VTEY2-1Lw.png?auto=webp&amp;s=af42676cf7ec7a4a4da134981ca08c914b8abda5"
        },
        "permalink": "/r/movies/comments/1j8amms/march_79_box_office_recap_mickey_17_flops_with_an/"
    },
    {
        "id": "1j843kx",
        "author": "MarvelsGrantMan136",
        "title": "'Harry Potter' Actor Simon Fisher-Becker Dies at 63 (Played Hufflepuff Ghost, The Fat Friar)",
        "content": "",
        "upvotes": 2496,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O9USAutCex1M49D10KJbKRoquH1_Sya1UxfXhH_5b7I.jpg?auto=webp&amp;s=2772289a4cd687fa91487d53dba778a10dcb4dad"
        },
        "permalink": "/r/movies/comments/1j843kx/harry_potter_actor_simon_fisherbecker_dies_at_63/"
    },
    {
        "id": "1j8gy22",
        "author": "LarryKeene",
        "title": "What’s a movie that will have you laughing from beginning to finish?",
        "content": "Films that made you double over laughing - the laughter when you can’t catch your breath and your eyes tear up.\n\nNow i’m not asking what are the best comedy movies for you or which movie has the best comedy. \n\nJust which movies made you laugh the most out of all comedy movies.\n\nEven when you think of the film now, you giggle. Stuff like The Jerk, Napoleon Dynamite, and more.",
        "upvotes": 409,
        "comments": 1691,
        "media": null,
        "permalink": "/r/movies/comments/1j8gy22/whats_a_movie_that_will_have_you_laughing_from/"
    },
    {
        "id": "1j8dmub",
        "author": "WanderingBear42",
        "title": "Oscar worthy performances in Oscar phobic movies?",
        "content": "When I say Oscar phobic, I don't mean the movie is bad - I'm basically talking about the opposite of Oscar bait. \n\nThe kind of movies that the Academy will just never recognize for acting awards - often these can be in the action, comedy, horror and sci-fi genres with a few notable exceptions.\n\nLast year, a good example I saw mentioned a lot was Naomi Scott in Smile 2 - it's a good film but an absolutely outstanding lead performance and Scott doesn't really get her dues because it's a horror sequel and not catered towards the Academy. \n\nI was inspired to ask the question after rewatching 10 Cloverfield Lane with John Goodman tonight. \n\nSo, what are some other examples?",
        "upvotes": 624,
        "comments": 610,
        "media": null,
        "permalink": "/r/movies/comments/1j8dmub/oscar_worthy_performances_in_oscar_phobic_movies/"
    },
    {
        "id": "1j8rmcw",
        "author": "indiewire",
        "title": "Gael Garcia Bernal Almost Quit Acting Before 'Y Tu Mama Tambien'",
        "content": "",
        "upvotes": 45,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0waERFxhfYjhK63txpEqG5nHsTTmwTTo_HjR6Dm8H4w.jpg?auto=webp&amp;s=64bf94920bdf550d1451b7e1a8e3750726332b6d"
        },
        "permalink": "/r/movies/comments/1j8rmcw/gael_garcia_bernal_almost_quit_acting_before_y_tu/"
    },
    {
        "id": "1j7ygpx",
        "author": "AgentSkidMarks",
        "title": "The New Literalism Plaguing Today’s Biggest Movies - The New Yorker",
        "content": "",
        "upvotes": 4369,
        "comments": 1344,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rwgNbYRy0HW0mbMiuvfG6DBbSNATMnzONdukjcAEHZg.jpg?auto=webp&amp;s=53b2c2085adbf49672bee9aaf019170113c6914a"
        },
        "permalink": "/r/movies/comments/1j7ygpx/the_new_literalism_plaguing_todays_biggest_movies/"
    },
    {
        "id": "1j8u9x4",
        "author": "NoCulture3505",
        "title": "Gareth Evans Teases 'HAVOC', New Image of Tom Hardy Revealed",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1ZE6_yhHik1CHXJCgmBfbzMAVh07Veiy-U491xTq3zM.jpg?auto=webp&amp;s=26a23ccb59a1718faa0346b898f067e303dae16f"
        },
        "permalink": "/r/movies/comments/1j8u9x4/gareth_evans_teases_havoc_new_image_of_tom_hardy/"
    },
    {
        "id": "1j8iblv",
        "author": "OrganicTransFat",
        "title": "In Bruges",
        "content": "Ok.  Big movie buff.   I have a nice home theater, over 600 Blu Rays, 4k’s and Blu Ray 3d’s and over 300 Vudu and Prime streams.   And I truly enjoy most genres of movies.  In fact, I would consider myself somewhat a cinephile (I know that sounds quite douchey but whatever). \n\nJust felt like I had to post that I can’t believe how long I’ve slept on In Bruges.   Read the reviews and have heard about how good this movie is for years but just never felt the “pull” to actually sit down and watch this movie. \n\nWell, wife and kid are out of town and sat down to watch something.  Was just casually flipping through all the streaming services and stumbled upon In Bruges on Peacock and thought “what the hell”.  \n\nAnd wow. \n\nWhat a movie.  Sooooo well written and the chemistry between Farrell and Gleason seems so genuine (almost as good as Crowe and Gosling in The Nice Guys).  \n\nNot going to go into some long winded exposition about character arcs and development.\n\nEven through I’m really late to the party, just wanted to show my love for this flick and strongly suggest to anyone that was sitting ion the fence like I was to sit down and watch this movie. \n\nI don’t think you will be disappointed. ",
        "upvotes": 226,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1j8iblv/in_bruges/"
    },
    {
        "id": "1j8sr3y",
        "author": "JCDU",
        "title": "The Chase (1994) - stupid but fun",
        "content": "I remember catching this on TV years ago and thought I'd check it out, TL;DR it's a fun dumb action comedy very much of the mid-90's.\n\n&gt;Jack Hammond is sentenced to life in prison, but manages to escape. To get away from the police he takes a girl as hostage and drives off in her car. The girl happens to be the only daughter of one of the richest men in the state. In a while the car chase is being broadcast live on every TV-channel.\n\nCharlie Sheen is the main guy, Kristy Swanson is his hostage, Henry Rollins is a meat-head police officer giving chase with a \"Real cops\" TV crew in the back seat and a slightly less gung-ho partner, and there's cameos from Anthony Keidis, Flea, Ron Jeremy, and Cary Elwes.\n\nThe plot and setup is basic but at least reasonably original as these things go, Jack is having a bad day and it keeps getting worse, he makes mistakes and things go wrong, he's very much a regular guy - this is noticeable compared to now when he'd be cast like one of the characters from Fast &amp; Furious, flawless, buff, and able to outrun everyone. He's not glorified, he doesn't have a particularly tragic backstory, he admits he's messed up.\n\nTV is very much a part of the commentary here - the cops who give chase happen to have a reality TV crew in the car with them and we get to see them asking questions of the cops, getting in the way, and snippets of their footage. Then you get the TV news crews who start following and sensationalising the chase, taking ever riskier and more extreme measures to get a scoop and putting their own spin on the situation - it's not exactly *Network* but it's a cut above what you'd expect for a dumb car chase movie.\n\nRollins appears to be having great fun playing the worst sort of cop, and the difference between his character and his partner is gradually drawn out as things progress - there's a great bit of dialogue where the TV producer asks Rollins if he ever killed anyone.\n\nThis feels like one for the MTV generation, it's flashy action but they are picking up on the (then) relatively new phenomena of rolling TV news and reality TV and how they twist things, it's interesting enough and the movie would be really dull without it.\n\nThere's a lot of stuff you have to ignore - much like any modern action movie really - just go with it and don't question it too much and worry about the laws of physics or probability later.\n\nYes it's cheesy and low/mid-budget, they had the money for a few big stunts and beyond that it's a lot of fast cuts of them swerving around a bit on California streets, again by modern standards it's a bit tame but overall an entertaining 90 minutes.\n\nAlso the post-credits scene is one of the best things I've ever seen, I won't spoil it.",
        "upvotes": 24,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1j8sr3y/the_chase_1994_stupid_but_fun/"
    },
    {
        "id": "1j8cjo3",
        "author": "Unodatmawnbraunch555",
        "title": "Ricky stanicky",
        "content": "I just watched this movie and it’s honestly fucking awesome , I seen a few wee one minute clips of it on YouTube and it seemed interesting enough from the premise watched it there and honestly it’s hilarious I wasn’t expecting to enjoy it as much as I did I don’t really check out comedy movies now cause most seem wank to me but this one is genuinely funny I just want to know the general consensus, it kinda reminds me of that movie game night as in I didn’t think I’d enjoy it as much as I did you know ",
        "upvotes": 281,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1j8cjo3/ricky_stanicky/"
    },
    {
        "id": "1j81nc2",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Mike Flanagan's 'The Life of Chuck' - A life-affirming, genre-bending story based on Stephen King's novella about three chapters in the life of an ordinary man named Charles Krantz",
        "content": "",
        "upvotes": 1085,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5k5jwxcmuvne1.jpeg?auto=webp&amp;s=2170fe34d5f5785bc586e771cf70163ad70c423c"
        },
        "permalink": "/r/movies/comments/1j81nc2/official_poster_for_mike_flanagans_the_life_of/"
    },
    {
        "id": "1j8920e",
        "author": "KillerCroc1234567",
        "title": "‘Landman’ Breakout Michelle Randolph And Jimmy Tatro Join ‘Scream 7’",
        "content": "",
        "upvotes": 293,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ePIbw5DLhrGrPqz7qpd0E-AmXp9frZ_okQysZDapH4Y.jpg?auto=webp&amp;s=55398a418e71f4998a8b91d43ee531d9fae7ce74"
        },
        "permalink": "/r/movies/comments/1j8920e/landman_breakout_michelle_randolph_and_jimmy/"
    },
    {
        "id": "1j7tlue",
        "author": "Robemilak",
        "title": "Matthew McConaughey on Returning to Acting After a Six-Year Hiatus With ‘The Rivals of Amziah King’ and Why His Season of ‘True Detective’ Is the Best",
        "content": "",
        "upvotes": 3100,
        "comments": 300,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yq7fpcJv0JE_W134zsVYSecIB5ivxhLm7e3g4HPht3s.jpg?auto=webp&amp;s=1ed10ac5736b98dcb3c65fc3c4ddfaf75ead5842"
        },
        "permalink": "/r/movies/comments/1j7tlue/matthew_mcconaughey_on_returning_to_acting_after/"
    },
    {
        "id": "1j8thtw",
        "author": "SecretMuffin6289",
        "title": "Which movie has the most realistic dream sequence?",
        "content": "I was always interested in psychology, specifically dreams since I was a little kid. I always love when movies show Dream sequences. The worst movie in the world, a 0/10 could have a dream sequence and I would give it at least a 1/10 for including it. Off the top of my head my favorite dream sequence is Brazil, there are segments that make no sense and you never see again, like that monster made out of the road that tries grabbing the main character. What are your favorites?",
        "upvotes": 9,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1j8thtw/which_movie_has_the_most_realistic_dream_sequence/"
    },
    {
        "id": "1j88g1q",
        "author": "TheBlackSwarm",
        "title": "‘Home’: Martin Scorsese &amp; Leonardo DiCaprio Reuniting For Marilynne Robinson Adaptation At Apple",
        "content": "",
        "upvotes": 266,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JukeuFQcvh-V9zX6yEwTK6340OkJJO1btbPfKEe52p4.jpg?auto=webp&amp;s=29e2cd05cb53142ee9b1a14d20eff314a9945bae"
        },
        "permalink": "/r/movies/comments/1j88g1q/home_martin_scorsese_leonardo_dicaprio_reuniting/"
    },
    {
        "id": "1j8flwh",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Bill Allen - Tuesday 3/11 at 2:00 PM ET - Lead actor of the 1986 cult-classic RAD",
        "content": "",
        "upvotes": 94,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l73vep9ityne1.png?auto=webp&amp;s=1edb2d78a655ebc0c10d7264e2a1d9eb38bd3255"
        },
        "permalink": "/r/movies/comments/1j8flwh/amaqa_announcement_bill_allen_tuesday_311_at_200/"
    },
    {
        "id": "1j7y1b2",
        "author": "AporiaParadox",
        "title": "Characters who ended up being deleted entirely in the final cut",
        "content": "Deleted scenes are a common thing in movies, but not as common is when an entire character is cut out and every single scene they were meant to be in is removed or edited. The actor still got paid at least, but all of their efforts were for naught.\n\nFor example, all of Christopher Lee's scenes as Saruman were left out of the Return of the King theatrical cut, meaning his character never got any closure. Christopher Lee was understandably not happy about that. Fortunately his scenes were restored in the Extended Edition.\n\nPeeves the Poltergeist from the books was meant to be in the first Harry Potter movie played by Ril Mayall, but his scenes were cut, never even shown on the DVD release, and he never appeared in any of the sequels either. He did still pop up in the videogame adaptations though.\n\nSo what other notable cases are there of entirely cut characters?",
        "upvotes": 940,
        "comments": 745,
        "media": null,
        "permalink": "/r/movies/comments/1j7y1b2/characters_who_ended_up_being_deleted_entirely_in/"
    },
    {
        "id": "1j83nqc",
        "author": "AdSpecialist6598",
        "title": "What is your favorite actor making fun of themselves movie?",
        "content": "My favorite is Jason Statam in Spy because while he's playing the same character, he's always plays he's also taking the piss out of himself as it were. His bit about having to pretend to be Obama still has me laughing out loud mostly because plays it completely serious and straight. He has such great comedic timing in that film, and it would be great to see him do more comedy films.",
        "upvotes": 389,
        "comments": 336,
        "media": null,
        "permalink": "/r/movies/comments/1j83nqc/what_is_your_favorite_actor_making_fun_of/"
    },
    {
        "id": "1j8razy",
        "author": "iakgk",
        "title": "Which movie character's life would you like to experience, even just once?",
        "content": "I've always been captivated by Hirayama from Perfect Days. His minimalist lifestyle—immersing himself in nature photography, delving into books, cherishing a tight-knit circle of friends, and exploring the city on his bicycle—resonates deeply with me. In our hectic, often chaotic world, his way of living feels like a breath of fresh air, offering a serene escape from the noise. 😌\n\nI'm curious, is there a movie character whose life you'd love to step into, even if just for a moment?\n\n",
        "upvotes": 7,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1j8razy/which_movie_characters_life_would_you_like_to/"
    },
    {
        "id": "1j8m6qr",
        "author": "Robemilak",
        "title": "Simon Rex and Natalie Lind to Star in Campy Horror Comedy Produced by Kenan Thompson and Johnny Ryan Jr. (EXCLUSIVE)",
        "content": "",
        "upvotes": 20,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EFsq5n3Ga3JmqGyrOxZQOcqDZYAnD4eV7v_NFlvAhSc.jpg?auto=webp&amp;s=0a75ef554bc80cdc4b994d95efc9bdb2d2a937b3"
        },
        "permalink": "/r/movies/comments/1j8m6qr/simon_rex_and_natalie_lind_to_star_in_campy/"
    },
    {
        "id": "1j831ak",
        "author": "Zhukov-74",
        "title": "Creator to Creator: Neil Druckmann (The Last of Us) &amp; Alex Garland (28 Years Later)",
        "content": "",
        "upvotes": 329,
        "comments": 198,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8OJ715F4XWvnbRQJ6JbaE8SirWsngoKv7FoRBs9Mfsw.jpg?auto=webp&amp;s=96dae18381bfbbb2b3d085398028df5241957a02"
        },
        "permalink": "/r/movies/comments/1j831ak/creator_to_creator_neil_druckmann_the_last_of_us/"
    },
    {
        "id": "1j7wl12",
        "author": "NewMonitor9684",
        "title": "What is the most controversial film you have ever watched?",
        "content": "*In the Realm of the Senses* (1976) is a controversial film directed by Nagisa Ōshima, based on the true story of Sada Abe, a woman whose obsessive relationship with her lover led to a shocking crime in 1930s Japan. The film explores themes of passion, power, and sexuality, pushing boundaries with its explicit content and challenging societal norms. Its raw depiction of human desire and taboo subjects has made it both acclaimed and polarizing.",
        "upvotes": 790,
        "comments": 916,
        "media": null,
        "permalink": "/r/movies/comments/1j7wl12/what_is_the_most_controversial_film_you_have_ever/"
    },
    {
        "id": "1j8b59c",
        "author": "NoCulture3505",
        "title": "Margot Robbie and Colin Farrell’s ‘A Big Bold Beautiful Journey’ Delayed From May to September 19th",
        "content": "",
        "upvotes": 109,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gi2MOIL8YzLLjhmYr-CMhEp5ljOdJYdGNnI59XWUhYk.jpg?auto=webp&amp;s=faef9d985bcfa388f28570c524695b76a6b13429"
        },
        "permalink": "/r/movies/comments/1j8b59c/margot_robbie_and_colin_farrells_a_big_bold/"
    }
]