[
    {
        "id": "1jthmnj",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 26,
        "comments": 3023,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jthmnj/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1juof2n",
        "author": "soccer-stats",
        "title": "Post Match Stats: Arsenal vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1juof2n)",
        "upvotes": 203,
        "comments": 1670,
        "media": null,
        "permalink": "/r/realmadrid/comments/1juof2n/post_match_stats_arsenal_vs_real_madrid/"
    },
    {
        "id": "1jvq7uo",
        "author": "AbunRoman",
        "title": "Remember, 90 minutes in the Bernabeu is a VERY LONG time. HALA MADRID",
        "content": "",
        "upvotes": 285,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvq7uo/remember_90_minutes_in_the_bernabeu_is_a_very/"
    },
    {
        "id": "1jv2cd0",
        "author": "Ecstatic-Light-3699",
        "title": "Nahh Seriously WHAT THE F*CK",
        "content": "",
        "upvotes": 7513,
        "comments": 293,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p534in9rbste1.jpeg?auto=webp&amp;s=c05d9b6ae3362c09720f34eec46df43cdf2f5203"
        },
        "permalink": "/r/realmadrid/comments/1jv2cd0/nahh_seriously_what_the_fck/"
    },
    {
        "id": "1jvqvrm",
        "author": "Ok-Fold6928",
        "title": "Win or Lose, Don Carlo is a Legend of the Highest Order",
        "content": "Maybe it's time for a change, but a manager who has won 3 out of 5 UCLs and reached the semi-finals in all five with us deserves a respectful farewell.\n\nIt's crazy how some people think Carlo is an idiot and Pep is a genius—meanwhile, Pep loses the UCL year after year, despite having the most balanced and stacked squad, plus a free hand to sign almost any player he wants.\n\nCarlo Ancelotti gave us everything he had. Maybe it's not enough anymore—but hearing fans talk about him like he's the most useless piece of trash is just heartbreaking. Some people are truly ungrateful, entitled, lowlifes, and it's sad to see.\n\nAnd the irony is, for most of them if they saw him in real life, they'd be begging him for a selfie just so they could show it off to their friends and feel better about their lives.\n\nShow some dignity and grace. If you're upset because your friends are trolling you, grow up already. Did you really think you were going to win everything for the rest of your life? You're watching sports—sometimes you win, sometimes you lose. Most people learn that by the age of five.\n\nI think the man is doing his best. And if his best is no longer enough, we part ways respectfully. There's no need to insult him",
        "upvotes": 138,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k1cxr9w3zxte1.jpeg?auto=webp&amp;s=8cf33a38a6f949323afa4abe4aea0dd1ed2daf2b"
        },
        "permalink": "/r/realmadrid/comments/1jvqvrm/win_or_lose_don_carlo_is_a_legend_of_the_highest/"
    },
    {
        "id": "1jverty",
        "author": "supplementarytables",
        "title": "Camavinga on Instagram",
        "content": "",
        "upvotes": 760,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4blgc7ed4vte1.png?auto=webp&amp;s=ca34740724349f901d49bc0e44e247855690460f"
        },
        "permalink": "/r/realmadrid/comments/1jverty/camavinga_on_instagram/"
    },
    {
        "id": "1jvjfru",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to club legend Roberto Carlos da Silva Rocha🇧🇷",
        "content": "",
        "upvotes": 184,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvjfru/happy_birthday_to_club_legend_roberto_carlos_da/"
    },
    {
        "id": "1jv2ma9",
        "author": "Immediate-Drink2196",
        "title": "Just gonna leave this here",
        "content": "Let's all drown our sorrows next week, when it's all over. \n\n\nThat is if it's all over.... ",
        "upvotes": 1747,
        "comments": 306,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4xt3w889fste1.jpeg?auto=webp&amp;s=1cc238e9befe440e055b226f3408f8fe564f8d26"
        },
        "permalink": "/r/realmadrid/comments/1jv2ma9/just_gonna_leave_this_here/"
    },
    {
        "id": "1jvb4me",
        "author": "Ready_Ad_1353",
        "title": "Thibaut Courtois on Rice's 2 goals: \"For the 1st goal, I could have put an extra man in. But I thought Rice wouldn't get as much curl on it. I take responsibility for that. For the 2nd goal, it's absolutely perfect. They were unnecessary fouls by some [Alaba &amp; Bellingham], when there was no danger\"",
        "content": "",
        "upvotes": 508,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7k327qfydute1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvb4me/thibaut_courtois_on_rices_2_goals_for_the_1st/"
    },
    {
        "id": "1jv617e",
        "author": "NRaw27",
        "title": "Bro knows something we don’t",
        "content": "",
        "upvotes": 936,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ht46s33xbtte1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv617e/bro_knows_something_we_dont/"
    },
    {
        "id": "1jv32xc",
        "author": "divyanshu_01",
        "title": "90 minutes in Bernabeu is a very long time. Hala Madrid y nada más",
        "content": "",
        "upvotes": 914,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e99bw9cgkste1.jpeg?auto=webp&amp;s=cf2fa1c0f7575b7ae646a326701d32e58870ee23"
        },
        "permalink": "/r/realmadrid/comments/1jv32xc/90_minutes_in_bernabeu_is_a_very_long_time_hala/"
    },
    {
        "id": "1jvq8bc",
        "author": "Ok-Fold6928",
        "title": "Fifteen times and counting",
        "content": "",
        "upvotes": 32,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xhp9422cyxte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvq8bc/fifteen_times_and_counting/"
    },
    {
        "id": "1jvmupi",
        "author": "Different_Craft5237",
        "title": "The board dealt us a shit hand, and expected the manager to pull a rabbit out of his hat, for the 2nd year straight.",
        "content": "Could Carlo had better managed the team this season. Yes, maybe be more rigid in terms of discipline, tactics, game subs. But my god, you're telling me the same manager who just 1 season ago, won the double with 2Ls all season all of a sudden forgot how to coach ? Come on now people, let's not be this naive.\n\nAll wee needed to do in the summer of 2024 was make 4 transfers to plug in for the departures and maybe 1 extra.\n\n\\- Kroos leaving meant we had to get another CM/CDM who's is actually similar. No need for yet another tall, physical lad like Tchouameni. Someone with a Kimmich/Zubimendi kind of profile. A guy who may not be the most physical, or defensively sound, but can dictate our tempo.\n\n\\- Nacho left. It still blows my mind on why he didn't pay the extra money for Yoro. Counting on Alaba and Militao to return especially with how insane this season's schedule is was a foolish gamble. And thank god we somehow found Asencio to promote.\n\n\\- Joselu left. Instead of replacing him with literally any no name #9. Didn't need to be Kane or Lewandowski level. Any tall guy who with experience would've worked. Instead they give us a unproven 5\"6 prospect. I can understand, Kane being old, a huge transfer fee would not make sense, but ffs. Sorloth after scoring that quadruple against us, we should've signed him immediately knowing Joselu was leaving. He would've gel with the squad 1000x better.\n\n\\- Carvajal getting old. This one has been a problem since like 2018. Carvajal having no actual backup. We always see the moment he's injured, the team struggled, cause we then had no natural RB. These cracks used to be partially covered by Nacho, but he left too. So now we got stuck with a RW having to play there. No fault of LV, but he's just not a RB. Period.\n\n\\- WE DID NOT NEED MBAPPE. As phenomenal of a talent as he may be, he was NEVER what that team needed, especially after seeing Vinicius progressing so much. What would've been better ? a pacey left footed winger. Yes, we have Guler but the kid has zero pace and is more of a CAM. \n\n  \nLast year, we got dealt the same shit hand after Benzema left. Carlo begged for them to sign Kane. Instead, they gave him Jude. What does he do ? He switches our formation entirely to accommodate for it. Having Jude playing as false 9 due to his eye for goal. People like to say \"It's Jude's individual brilliance in the 1st half of the season...\" As if Jude was a CDM scoring all his goals from 30 yards longshots. Meanwhile, Carlo was the one who set up the tactics to put the lad in those positions in the first place. \n\nLast year, the team even through early injuries from Courtois, Alaba, Militao, we still had balance and variety.  If the front two did not work, sub one out and bring Joselu. Now we have a tall guy to cross to, which made our attacks much more dynamic. \n\nPeople like to remember the 2016-2017 team for being \"stacked\" but the reality is the team was just so balanced and deep. Zidane could literally play 3 diff formations at will with 3 distinct tactics. Not just because he's a top manager but because he had the personnel to do so.\n\n\\- 433 : with KCM and BBC in front\n\n\\- 41212 : with Isco at CAM and Benzema - CR7 up top (sometimes even Morata - CR7)\n\n\\- 442 : with young Asencio and Vazquez at wings cause they can track back more.\n\nUltimately we can put as much blame on Ancelotti as we want, but making him a scapegoat and letting the board get away with their shit squad planning scoot free is so naive. Cause no matter how much some of you will hate to admit it, bring any other of these so called tactical managers here and give him the same hand our board gave Carlo and he's failing too. \n\nPeople are glazing Flick, he already told Laporta he wants Nico Williams, and their board is probably cooking their books as we speak to make the transfer happen. Pep after Rodri got injured, and KDB and some of his CBs, the City board 200M in the winter transfer. Our managers ask for players, get told to fuckoff X-Y-Z galactico we don't even need at that time is coming, deal with it. And when the unbalanced team fails, the only head rolling is the manager's, of course.\n\nAnyways, Carlo is leaving at the end of the season most likely. And even if for some weird reason, he's not sacked or wtv, if the board does not properly address all the gaping holes in this squad, I'd resign, just like Zidane. Cause him too was made to be the fall guy meanwhile every time he requested a transfer they told him to fuck off. People all want Xabi to come, me too. But if the board does not adjust they way they plan their squad, they'll just set him up for failure and sabotage him just like they did with Zidane and Ancelotti.\n\nPeople are worried about Ancelotti, I'm more worried about the broad committing the same sequence of mistakes they made in the 00s when they let Makelele leave in order to bring Beckham cause $$$$. And then proceeded to make every manager the scapegoat by sacking them when in reality it was a team balance issue solely on them.",
        "upvotes": 44,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvmupi/the_board_dealt_us_a_shit_hand_and_expected_the/"
    },
    {
        "id": "1jvpub1",
        "author": "Danickcoolman",
        "title": "Probably an uncomfortable conversation.",
        "content": "I want to have a conversation with all of you about Ancelotti, but I also want to speak about Real Madrid as a unit. I’ve seen us play since the beginning of the season and I’ve seen a lot of people on this subreddit say that “if you want Ancelotti to leave, then you’re ungrateful” when in reality I think that having such an opinion about the Don is not being ungrateful, it’s a matter of looking at what he’s doing with this team on a weekly basis and coming to the inevitable realization that Ancelotti cannot continue as Madrid manager. \n\nFirst of all, I believe that we should all thank Ancelotti for what he has done with Madrid. We were in an awful place coming into the 21/22 season and we finished with a champions league, a super copa and LaLiga. But the unfortunate truth is that a lot of this success comes down to individual brillance. Now, before you start saying that it isn’t, we need to make something clear. There is individual brillance in a well organized team with a coach that has a tactic in mind like for example Flick’s Barca and Lamine Yamal and there’s individual brillance in a non cohesive unit, so Ancelotti’s Madrid. If you watch the games every week instead of basing your opinions on rating apps, you will immediately notice that the problem with this Madrid team is that there is no cohesion, we are playing without an identity, a game plan or crucial tactics. I believe that when a team loses, the manager AND the players are at fault, but the manager has a lot of responsibility because he sets up his team in the way that he wants them to play and implements tactics to make his players better. \n\nThe game versus Arsenal demonstrates what a manager with a tactical vision can do against the other that has no idea what is going on anymore. It’s time to actually wake up guys, seriously. We get outplayed by the likes of Sociedad, Espanyol, Betis, a Milan side who lost 3-1 to Liverpool, Dortmund, Valencia at home, Barcelona, Bilbao and even Lille. Has there been a single game against a big team that Real Madrid won this season while looking good? And before you say Dortmund or even Manchester City, no they do not count. Dortmund was a reaction by the players where the individuality came out and Vini managed to score that hattrick and that Manchester City side is a horrendous team who is worse than us so us being slightly better than them was in our favor. The rest, humiliation after humiliation. It’s something that has been happening with Ancelotti’s Madrid but the simple fact that he has been winning titles is enough to blind the eyes of the masses so that people calling themselves Madrid fans will callout other fans ungrateful for wanting the manager to leave when **everyone** who watches the games can see that there’s nothing going on with this team anymore. He changes the formation every time, going from a 4-4-2 to a 4-3-3 to a 4-2-3-1, he refuses to put obvious starters over very average players who show week in and week out that they do not have the level to play for this club anymore and he doesn’t want to play Arda Guler or Bobby in matches where we need creativity and someone willing to press, someone willing to make runs in behind and contribute to the team. Everyone knows that David Alaba and Lucas Vazquez do not have the level to play for this club anymore but Ancelotti still wants to deploy the both of them as his fullbacks? Did he not see the disasterclass of Alaba against Sociedad who was about to score a hattrick of own goals? Did he not realize for the entirety of the season that any winger with a decent amount of dribbling skills can beat Vazquez and that he leaves huge gaps in behind, making it easier for the team to counterattack? It’s been the same thing with Ancelotti since the beginning of this season, he refuses to use simple logic and goes with his reasoning even though it’s obvious that it won’t work. A lot of criticism that Ancelotti gets is deserved and the majority of the time, it’s coming from Madridistas that want this team to succeed but aren’t deluded because their team wins games then and there. We do not play well and that’s undeniable.\n\nBut Ancelotti is not going to be the only point of my critique. Like I said, when a team loses, the players and the manager will be blamed and this team, almost none of them can escape what’s next. Courtois is the only one that I can’t criticize because he has saved this team and Ancelotti so many times that he very much deserves to be called a Real Madrid legend. Lucas Vazquez needs to respect himself and leave this club at the end of the season because he’s a liability in defence. Offensively, he still has his game IQ so he knows when to make a pass, when to make a run or when to cross, but defensively it’s catastrophic. He gets too high on the pitch but can’t run back so it lets the opposition team a lot of space to counter, he can’t mark his man in set pieces and he gets beaten by nearly anyone in a 1v1. When I mean anyone, he was getting beaten by Pachuca’s wingers in the Intercontinental cup final, guys that up to that competition, no one knew about. Out of the 9 goals Barcelona scored against us in the two matches, **five** of them comes from Lucas Vazquez’s side, so clearly even Flick knows that he is our weakest point in defence. Rüdiger this season has been really poor and Alaba at LB is a topic that I will not discuss anymore, Modric is too old to be starting in physically intense matches like these and the Fantastic Four showed once again why it’s not working out. It won’t work out because Ancelotti puts Bellingham as a LWB to help Alaba against Saka, the same thing that he did against Barcelona but on a lesser scale and you can even use the heat maps to justify this point. Vinicius has been in a really poor form recently, Rodrygo is downright non existent and Mbappe is the only one trying to do something right now.\n\nYou can agree or disagree with me, but I stand by what I say. This team needs a new project, a new manager who’ll give the team an identity with a tactical vision and it also needs help from Perez and the board. It’s nice to have stars in one team, but when you refuse to see the truth and think that Madrid will always win in the end even after such poor performances every week, you need to start asking yourselves the good questions. Even if we somehow win against Arsenal, do not be fooled and forget the entire season.",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvpub1/probably_an_uncomfortable_conversation/"
    },
    {
        "id": "1jv4csk",
        "author": "Ecakk",
        "title": "I miss this kind of tight space passing play…",
        "content": "The player we have now are all pacey.. but lacking in counter attack aspect.. idk what changes like both era seems like they have pace but the BBC one also have very good ball control as compared to today front 3…. Sad. I cant believe I actually fell asleep for the first time watching a madrid games in my whole life since supporting this club.",
        "upvotes": 515,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9ejvd1e8xste1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv4csk/i_miss_this_kind_of_tight_space_passing_play/"
    },
    {
        "id": "1junsb3",
        "author": "TheGhost5322",
        "title": "Bro no way, I'm not even mad",
        "content": "",
        "upvotes": 9486,
        "comments": 408,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pvf5aexj8ote1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1junsb3/bro_no_way_im_not_even_mad/"
    },
    {
        "id": "1jvas39",
        "author": "Ok-Fold6928",
        "title": "You don’t need logic. Believing is enough",
        "content": "",
        "upvotes": 163,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9s68c3kabute1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvas39/you_dont_need_logic_believing_is_enough/"
    },
    {
        "id": "1jv0spw",
        "author": "AestheticEvan23",
        "title": "Who need a superhero when you have CR7",
        "content": "Vini jnr Kylian Mbappé Rodrygo Goes Bellingham Jude take some notes",
        "upvotes": 733,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nb7plzjirrte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv0spw/who_need_a_superhero_when_you_have_cr7/"
    },
    {
        "id": "1jv5f0t",
        "author": "Negreiras-lawyer",
        "title": "Some of the key plays our current squad is missing.",
        "content": "If Arnold is still joining us we will still need a midfielder with great passing and vision",
        "upvotes": 299,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oqr4s05t6tte1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv5f0t/some_of_the_key_plays_our_current_squad_is_missing/"
    },
    {
        "id": "1jv813k",
        "author": "Messmers",
        "title": "Champions League 24/25 most meters ran as forwards",
        "content": "",
        "upvotes": 193,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gm2kibmbrtte1.jpeg?auto=webp&amp;s=495d7265b943a25aaf3eda8db72190edcdbf3ffc"
        },
        "permalink": "/r/realmadrid/comments/1jv813k/champions_league_2425_most_meters_ran_as_forwards/"
    },
    {
        "id": "1juzm3i",
        "author": "senormadridista9248",
        "title": "Pretty much every Madridista after the game to Kyky and Vini",
        "content": "",
        "upvotes": 977,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hv48rtwxarte1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1juzm3i/pretty_much_every_madridista_after_the_game_to/"
    },
    {
        "id": "1jv0drb",
        "author": "Messi_1812",
        "title": "Mbappe still got it, what about you?",
        "content": "",
        "upvotes": 581,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/670a6e95mrte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv0drb/mbappe_still_got_it_what_about_you/"
    },
    {
        "id": "1juxifi",
        "author": "z1nc0r3",
        "title": "If we are to sink, we sink together",
        "content": "",
        "upvotes": 877,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vx4u5lxdmqte1.jpeg?auto=webp&amp;s=c55b08e41bd53c45b359b0c30604c8b9e34449fe"
        },
        "permalink": "/r/realmadrid/comments/1juxifi/if_we_are_to_sink_we_sink_together/"
    },
    {
        "id": "1jvb8ji",
        "author": "Ready_Ad_1353",
        "title": "Jude Bellingham believes Real Madrid can come back in the second leg against Arsenal: “One place where crazy things happen is our house. Anything can happen at the Bernabeu.”",
        "content": "",
        "upvotes": 78,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TzuTK5n_70TLYebrn0wY8PbYRbVMiof0008ccbJFxvc.jpg?auto=webp&amp;s=ccaf8944312bc3c501a920391f1a579e69e552cc"
        },
        "permalink": "/r/realmadrid/comments/1jvb8ji/jude_bellingham_believes_real_madrid_can_come/"
    },
    {
        "id": "1jv1cq4",
        "author": "Annual-Astronaut3345",
        "title": "Visual representation of what Madrid have to do in the second leg against Arsenal to go through.",
        "content": "",
        "upvotes": 282,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c6rplhwczrte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv1cq4/visual_representation_of_what_madrid_have_to_do/"
    },
    {
        "id": "1jvj0b0",
        "author": "Scary-Tomatillo9788",
        "title": "One early goal will change the second league",
        "content": "Football is not only about gameplay but also about confidence and momentum. We lost all the momentum after the first goal yesterday. What I feel is our team will play attacking with bernabau behind the team and if we can get one goal in early 15 mins the game will be fun to watch. It is hard to overcome but early goal can disrupt the opponent as well. Like how Man city and Chelsea changed from world class team to mediocre teams due to 1-2  goals with in short span. ",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvj0b0/one_early_goal_will_change_the_second_league/"
    },
    {
        "id": "1jvfxu9",
        "author": "charbeld",
        "title": "Maybe this time it won’t happen",
        "content": "We all watched the same game yesterday, we all felt the same frustration again and again and again.\n\nYes we have actually done it before, and with fashion actually, but the team we watched yesterday, and against Barcelona and against Valencia isn’t capable of doing this unless a major shift happens.\n\nIt’s been weeks now with Vini, he tries to dribble, gets blocked, he tries to run, loses the ball, he tries to send a crucial pass, intercepted. Him losing last year’s Ballon d’or and realising that this year it’s also lost since Mbappe has become the star, has gotten to him. And to be honest, who wouldn’t feel the same were we in his shoes? \n\nI’m all for Ancelotti out but not now. At the end of the season we let him go and hopefully get Xabi Alonso. Yesterday’s tactic was horrible to say the least, we played shit throughout the game and then when it became 2-0 we started the subs? Alaba was beaten left and right, why not sub him after the first goal? Why not at the start of the second half? We played a very bad first half and we all hoped “Well no way we would play that bad in the second half!”. But we felt it, Ancelotti must’ve felt it. Why keep him for so late and your team is getting pounded with missed chances?\n\nWhy not sub Brahim early on? The team clearly had a bad attacking first half, Bellingham was trying to make runs from the inside but it was impossible to get the ball to him. Why not sub in a player with technical skills and has played the EPL early on? Why keep Vini for so long on the pitch? \n\nYes Mbappe tried to create some chances but rarely did we get to the goal. \n\nWhat about defence? We are so lucky to have Ascensio and Courtois (A great successor for the Saint) protecting us from near goal situations. And yes, the game could’ve held more goals for Arsenal had it not been for those 2. No comment on Valverde, the guy has been giving blood every game of the season. Rudiger was good also. Maybe defence was ironically the best piece from yesterday. Yes, the freekicks were beautiful yesterday but just as Courtois said, given unnecessarily.\n\nThe same people whom we need to carry us (not just play well) next week are the same ones who let us down yesterday and have been letting us down for the past few games for whatever reason are expected to do a 180 in the second leg and bring out the best performance of the past 2-3 years, a feat, which -although has happened before- seems a bit too hopeful. Maybe we won’t need a complete team performance, maybe Rodrigo plays a superb game and carries us, but we have to end the game with at least a 3 goals difference. Meaning we HAVE to try our best not to concede a goal. And watching yesterday’s game, while ignoring the 2 freekicks, I can’t see it too impossible for Arsenal to score, especially since we will be on our toes the whole 90 mins and with some spaces in the back. Add to the mix Ancelotti trying the same tactics or maybe coming up with a crazy stupid plan for the second leg, would make me not so hopeful for the next game. \n\nI have been a fan for the past 18 years, I have witnessed the greatest comebacks in football being achieved by our guys, and I hope like all of us to watch a game that would remind the world who is Real Madrid in the UCL in case someone forgot, but this time I am not seeing it.",
        "upvotes": 33,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvfxu9/maybe_this_time_it_wont_happen/"
    },
    {
        "id": "1jv7549",
        "author": "Ill-Improvement-8670",
        "title": "Came across this video in our 3-3 last season against Man City, look how we defended for our lives. Wish we still did this",
        "content": "",
        "upvotes": 84,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cping7nkktte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv7549/came_across_this_video_in_our_33_last_season/"
    },
    {
        "id": "1jv6hnd",
        "author": "Specialist-Reply8884",
        "title": "Let’s face it. We have no playmakers since Kroos left.",
        "content": "The game last night wasn’t really a surprise. We’ve seen the same scenario play out, with competitive teams this season. The reason for it is we don’t have a midfield maestro, except the 2 games where Ceballos played good, then he got injured. You can see it in the transitions from the midfield to the offense. That’s what makes the offense what it is. We’ve seen our wingers drop because of it. This season they have been forced to be creative, and you can only do so much. We need Bellingham to move out of CAM, and assume this role. He’s the only visionary in our midfield unfortunately, except Modric for 15 minutes of the games, due to his age. Valverde is a box to box, so I’m not sure why we are reliant on him to do that type of work. Offenses need key midfielders that make key passes, if we don’t have that we don’t have a team. That role isn’t just to find solutions in the offensive end. It also creates value in terms of moving pressure from the opposition on our defense. Brahim can play a hybrid CM because he can create spaces and dribble. (we did it with DiMaria in 2014), but we need the coaching staff to see this. Our offense outside of Mbappe looks like Man utd’s and it’s scary. ",
        "upvotes": 88,
        "comments": 108,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jv6hnd/lets_face_it_we_have_no_playmakers_since_kroos/"
    },
    {
        "id": "1jv7x1u",
        "author": "lost-innocence",
        "title": "Bellingham with carlo at the sidelines?",
        "content": "",
        "upvotes": 65,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mca4ypxiqtte1.jpeg?auto=webp&amp;s=898b4a556a88722b63a682cf26f827f96c79b08b"
        },
        "permalink": "/r/realmadrid/comments/1jv7x1u/bellingham_with_carlo_at_the_sidelines/"
    },
    {
        "id": "1jvrbkb",
        "author": "Equivalent_Card_0",
        "title": "What needs to be done in order for us to qualify in the second leg",
        "content": "I want to start by saying that realistically i think our changes of overturning the result from the first leg are very low based on how the team performed this season, but my heart remembers all the times we were against the odds and we somehow managed to turn things over.\n\nSo what do you think needs to be done in the second leg in order for us to qualify. I’ll start:\n\n1. Fran Garcia needs to start instead of Alaba. This will give us someone that can run and keep up with Saka and also Jude won’t be needed to cover on the defesive end for Alaba on every possession.\n\n2. Rodrygo needs to start on the left and Brahim on the right with Mbappe on the center. I love Vini to death, but right now he’s not what the team needs. Rodrygo’s link up play and the fact that he’s not fixed demonstrating that he is the rightfully Ballon D’Or might be the key to a deadly combination with Mbappe. \n\n3. Honestly i don’t think Arsenal will come on the Bernabeu to defend even though that will be the best way for them to make sure they qualify based on how we struggled to attack low block defenses this season. They want to show the world that they are team that can compete and needs to be respected, and this might be our ace in the sleeve. They showed glimpses of lacking chemistry on the defensive end without Gabriel, so we need to take advantage of those. The main idea that should be in everybody’s mind needs to be “no stupid fouls, no free kicks”, they know this is their strenght so they will look to obtain as many as they can. Force them to shoot or pass sideways. \n\nI want to hear your thoughts on this. ",
        "upvotes": 4,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvrbkb/what_needs_to_be_done_in_order_for_us_to_qualify/"
    },
    {
        "id": "1juz01t",
        "author": "megamimo1991",
        "title": "Starting to appreciate nature too, Hala Madrid",
        "content": "",
        "upvotes": 346,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w9b7befs3rte1.jpeg?auto=webp&amp;s=aba2b3b3580cb6ce4a497e584d2a2276ddd3dbc5"
        },
        "permalink": "/r/realmadrid/comments/1juz01t/starting_to_appreciate_nature_too_hala_madrid/"
    }
]