[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o80g60",
        "author": "AbbiAbbiDoo",
        "title": "Vi è già capitato di prendere il bus con guida autonoma senza conducente? Com'è stata l'esperienza? Pensate cambierà in meglio o in peggio il trasporto pubblico torinese?",
        "content": "",
        "upvotes": 26,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/68v6b66omfvf1.png?auto=webp&amp;s=ce25dfb29ffaf0a30baed26493bf1769d7673058"
        },
        "permalink": "/r/torino/comments/1o80g60/vi_è_già_capitato_di_prendere_il_bus_con_guida/"
    },
    {
        "id": "1o8b28e",
        "author": "Greedy_Ad_5299",
        "title": "Favoritismo in un concorso pubblico Piemonte",
        "content": "Ieri ho fatto l’esame orale per la posizione di assistente sociale comunale in Piemonte, avevo ottenuto un ottimo punteggio allo scritto essendo una tra le prime. All’orale sono andata benissimo mentre altre due ragazze abbastanza male. Peccato che mi è stato assegnato il punteggio minimo per essere comunque idonea ma a loro il massimo nonostante totale assenza di risposte e continui suggerimenti della commissione. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o8b28e/favoritismo_in_un_concorso_pubblico_piemonte/"
    },
    {
        "id": "1o87eq0",
        "author": "Organic-Log9485",
        "title": "Just moved to Torino, need advice",
        "content": "As the title says, I just moved to Torino for several months and don't speak Italian yet. I am 28 years old and my apartment is in Cenisia. I would need some help with settling in and since I don't have any friends here I'm turning my hopes to internet strangers. So I have some questions:\n\n1. How do I get internet in my apartment? I had a look online and wanted to use Fastweb but they require italian phone number, is there any way to get internet connection without getting an italian number? If no, what is the cheapest provider? I will use SIM card from my home country so I only need it to be able to setup my internet so the cheapest possible option will be enough.\n\n2. I will need to travel to work to Rivoli, where do I go to buy monthly pass for public transport? What do I need to bring?\n\n3. Is Cenisia safe? I am thinking about bringing my car here next time I go home and wonder if it is safe to park on the streets with foreign license plate or not. If not I might have to look for a garage to rent but that means more expenses.\n\n4. Where is the best place to buy home essentials like pillows, blankets, mattress covers, etc..\n\n5. Where could I buy some cheap furniture, I'm fine with buying used, I'm just wondering if there is a cheaper way to get some than ikea.\n\nThanks a lot for any help and advice\n ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o87eq0/just_moved_to_torino_need_advice/"
    },
    {
        "id": "1o84v8s",
        "author": "Kokabiele",
        "title": "Aiuto affitto Torino",
        "content": "Buongiorno a tutti sto attualmente cercando affitto a Torino per motivi lavorativi (avrò un contratto a tempo indeterminato) spero che qualcuno possa aiutarmi in questa mia ricerca, inoltre mi sono imbattuto in certe \"agenzie\" che non si dichiarano tali ma più come dei mediatori che richiedono dei soldi per poter essere messi in contatto con il proprietario, volevo sapere se sono tutte truffe o se alcune di queste realtà sono davvero funzionali",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o84v8s/aiuto_affitto_torino/"
    },
    {
        "id": "1o8bj7s",
        "author": "pizza-ai-funghi",
        "title": "Mezzi pubblici la sera",
        "content": "Settimana prossima sarò a Torino per un paio di giorni. Arriverò in stazione Torino Porta Nuova intorno alle 22 e dovrò raggiungere l'albergo in zona Stadio Juventus. \nNon conosco per niente la città, ho visto che a quell'ora la metropolitana sarà già chiusa. Ho visto che c'è un bus sostitutivo, é affidabile? Sapete darmi soluzioni migliori, o é meglio prendere direttamente un taxi?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o8bj7s/mezzi_pubblici_la_sera/"
    },
    {
        "id": "1o8ap20",
        "author": "guigbd",
        "title": "Events for Expat students in Turin",
        "content": "Hey pirates!\n\nSome of you already know me, but for those who don’t — here’s a quick intro. I’m one of the organizers at **TripMatch**, where we host events, workshops, and fun activities for newly arrived students.\n\n\n\nNext week, on **October 23rd**, we’re organizing an event designed to help students who are finishing or have just finished their studies find a job. We know it’s not easy to stand out among the hundreds of new graduates each year.\n\n\n\nThat’s where **personal branding** comes into play — it’s the authentic and consistent perception of who you are and the value you bring, and it’s what makes you stand out in a world where people choose *who you are* before *what you do*. It’s the key to making your résumé rise above the hundreds that companies receive every day.\n\n\n\nWe’ve invited **Mattia Morgut** to lead a workshop on how to leverage **AI** to build your personal brand on **LinkedIn**.\n\nThe event will be divided into three parts: an introductory theory session, a hands-on practice session where we’ll apply what we’ve learned together, and finally, an **Italian-style aperitivo**, because learning is great — but so are relaxed moments shared together.\n\n\n\nYou’ll find all the event links in the first comment!\n\nHope to see many of you there.\n\n\n\nSee you soon!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o8ap20/events_for_expat_students_in_turin/"
    },
    {
        "id": "1o7z3ld",
        "author": "redproteico",
        "title": "Pareri su isef di piazza Bernini",
        "content": "Come da titolo, ci passo spesso e ho sempre notato il centro isef in piazza Bernini e dato che al momento cerco palestre in zona san paolo/cit turin mi chiedevo come fosse realmente all'interno, perché non conosco nessuno che lo ha frequentato.\nSarei interessato alla sala pesi o al limite al training boxe se ben strutturato, però sul sito non riesco a capire i prezzi e se può convenire o meno?\n\nQualcuno di voi saprebbe darmi qualche info a proposito?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o7z3ld/pareri_su_isef_di_piazza_bernini/"
    },
    {
        "id": "1o7bqyy",
        "author": "Iaco_V8",
        "title": "Qualcuno di voi sa cosa sono questi \"cerchi di vetro\" in via Pietro Micca?",
        "content": "Passo spesso sotto i portici di via Pietro Micca e noto che molti bambini saltano sopra questi cerchi di vetro per divertimento. \nOra sono curioso di sapere cosa siano esattamente",
        "upvotes": 62,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y05iouwg7avf1.jpeg?auto=webp&amp;s=deee826dcf109ba813be2c74e0777913377b8ec2"
        },
        "permalink": "/r/torino/comments/1o7bqyy/qualcuno_di_voi_sa_cosa_sono_questi_cerchi_di/"
    },
    {
        "id": "1o83wdx",
        "author": "illumence",
        "title": "Hiking near Torino in late October",
        "content": "Hello everyone! I'm visiting Turin from October 28 to November 2 and would love to do some hiking. I’m looking for scenic trails with mountain views, reachable by train or bus from Turin (1–1.5 hours away). Ideally, they should be short (up to 10–12 km) and doable in late October/early November. Thanks in advance!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o83wdx/hiking_near_torino_in_late_october/"
    },
    {
        "id": "1o83fg6",
        "author": "BoldJaguar99",
        "title": "Tessera BIP GTT",
        "content": "Salve a tutti,  \ndovrei acquistare la tessera BIP per sottoscrivere un abbonamento mensile. Non risiedo a Torino e, da quanto ho capito, l’unico modo per ottenerla è recarmi presso il Centro Servizi Clienti GTT di Porta Nuova.\n\nAlcune domande: \n\n1. Sarà disponibile davvero dopo 3 gg lavorativi? Dovrei salire per un giorno a Torino settimana prossima, e vorrei sapere se acquistandola oggi sarà disponibile davvero per mercoledì circa.\n2. Bisogna prendere appuntamento o è sufficiente presentarsi direttamente al centro? Sul sito dice senza appuntamento, ma non so se fidarmi.\n\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1o83fg6/tessera_bip_gtt/"
    },
    {
        "id": "1o83al6",
        "author": "rinorii1",
        "title": "Torino Visit Once Again",
        "content": "Hi guys, I am planning to visit Torino around December (beginning), and this will be my third time visiting in 2 years. My visit will be short, around 2 days (weekend,) but just looking for anything fun or any good places I have missed visiting.\n\nI have been around mostly all the museums in the city, visited Superga and Venaria, so I would love any new recommendations. The only museum I have missed is Officina della Scrittura, but it looks like it's closed on weekends.\n\nSince it is around Christmas time, maybe there is a new activity to do. Though just wandering around the city is totally okay, as I love Torino.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o83al6/torino_visit_once_again/"
    },
    {
        "id": "1o7pxiz",
        "author": "sugar_kookie",
        "title": "Redditors di Torino, ma una camera ad ore no?",
        "content": "Vi prego qualcuno me ne consigli una a bassi prezzi pls :)",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o7pxiz/redditors_di_torino_ma_una_camera_ad_ore_no/"
    },
    {
        "id": "1o7fftl",
        "author": "Feeling_Smile7869",
        "title": "Opinions about areas in Torino",
        "content": "Hi everybody! I’m planning to buy an apartment and move to Torino. It seems that most of the apartments within my budget are located in Lucento area (Corso Toscana / Via Borgaro  area) or in Borgata Vittoria area bordering Lucento. What are your opinions / experiences about this area (safety, demographics, facilities)?",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o7fftl/opinions_about_areas_in_torino/"
    },
    {
        "id": "1o758xb",
        "author": "Bruno_Barbiere",
        "title": "Ma è vero che la situazione al Bar Casablanca è diventata così ingestibile? Qualcuno ha avuto esperienze lì?",
        "content": "",
        "upvotes": 20,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ygzhan2ci8vf1.jpeg?auto=webp&amp;s=8b8d46044ec724abc4bf2fb856b97ac6ad6c5845"
        },
        "permalink": "/r/torino/comments/1o758xb/ma_è_vero_che_la_situazione_al_bar_casablanca_è/"
    },
    {
        "id": "1o7cuqe",
        "author": "not-a-bot_maybe",
        "title": "aiuto psicologico",
        "content": "ciao a tutti, account fake per motivi di privacy personale, volevo chiedere se qualcuno ha qualche esperienza o informazione sullo Sportello di Ascolto Psicologico Torino, Circoscrizione 7.\nQualsiasi indicazione su come muovermi, sul funzionamento, su come vi siete trovati... sarà ben accetta.\n\nSono in un periodo davvero difficile e preferirei non chiedere ai miei genitori di pagare per uno psicologo, non abbiamo quel tipo di rapporto, quindi pensavo a questa opzione gratuita.\nRingrazio in anticipo chi mi saprà dare qualsiasi consiglio :)\n\nps sono maggiorenne, non dovrebbero quindi esserci problemi a mantenere l'anonimato. ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o7cuqe/aiuto_psicologico/"
    },
    {
        "id": "1o7phnh",
        "author": "Desperate-Place-8121",
        "title": "in cerca di amicizie",
        "content": "avete consigli?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o7phnh/in_cerca_di_amicizie/"
    },
    {
        "id": "1o7o3n8",
        "author": "Civil_Fee_5229",
        "title": "Barbiere specializzato in tagli per gente con alopecia o capelli diradati?",
        "content": "Buonasera, stavo cercando un barbiere che fosse specializzato in tagli di capelli per persone con i capelli diradati. Ho già provato altri barbieri ma sono stati finiti male perciò volevo sapere se qualcuno conosce un bel posto dove andare",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o7o3n8/barbiere_specializzato_in_tagli_per_gente_con/"
    },
    {
        "id": "1o7hq42",
        "author": "lordmax10",
        "title": "Crosspost: Laboratorio di scrittura narrativa a Torino – ogni giovedì sera alla Cascina Roffranca",
        "content": "📚 Se sei a Torino e hai voglia di scrivere, questo è per te.  \nHai sempre voluto scrivere, ma ti manca la spinta giusta?  \nI corsi di scrittura costano troppo?  \nHai bisogno di avere un momento per te e dove coltivare nuove idee?  \n  \n🎯 **Per chi è?** Per chi scrive già, per chi vuole iniziare, per chi cerca un appuntamento settimanale per coltivare la propria voce. Nessun livello richiesto, solo voglia di esserci.  \n  \n📍 **Dove:** Cascina Roccafranca, via Rubino, Torino  \n🕘 **Quando:** ogni giovedì, 21:00–22:30  \n📅 **Periodo:** dal 16 ottobre 2025 a giugno 2026  \n✍️ **Formato:** workshop pratico, partecipativo, con esercizi e confronto  \nCosto: 8 euro a incontro, il primo gratuito  \n  \n📬 **Posti limitati.** Nel senso che l'aula studio della Cascina Roccafranca non è enorme.  \nSe ti interessa, vieni in Cascina Roccafranca e chiedi alla reception.  \n  \nStruttura ideale (e variabile):  \n- 20 minuti dedicati alle tecniche narrative.  \n- 60 minuti per scrivere insieme, lasciando spazio alla creatività.  \n- 10 minuti o più di confronto.  \n    \n- Ambiente accogliente, aperto a tutti i livelli  \n- Da giovedì 16 ottobre a giugno  \n  \n  \nVuoi conoscere i dettagli o scoprire come funziona?  \n👉 https://tinyurl.com/Roccafranca2025\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gi96w2THxU_1hFxVvNiNRF1oR2e6Ie9On9xCWwLH120.png?auto=webp&amp;s=1b12e469be76a505e12cff570fad99209b9678cc"
        },
        "permalink": "/r/torino/comments/1o7hq42/crosspost_laboratorio_di_scrittura_narrativa_a/"
    },
    {
        "id": "1o7mmdm",
        "author": "sp00kygh0sty",
        "title": "Leone candies",
        "content": "Where can I find a large selection of Leone candies close to the city centre? The factory is kinda out of the way from our planned activities. I’ve seen a handful of flavors here and there at random stores but I want to get lots of different ones ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o7mmdm/leone_candies/"
    },
    {
        "id": "1o7ml3k",
        "author": "Sorry_Carrot7537",
        "title": "Nuovo a Torino, cerco amicizie",
        "content": "Buonasera a tutti, ieri mi sono trasferito qui a Torino e mi piacerebbe conoscere nuove persone, ho qualche conoscenza ma nulla di che, ho 20 anni e diverso hobby tra cui il calisthenics, mi reputo una persona abbastanza socievole, e nulla se qualcuno avesse voglia di fare una nuova amicizia che mi scriva pure!!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o7ml3k/nuovo_a_torino_cerco_amicizie/"
    },
    {
        "id": "1o74s6o",
        "author": "bumby104",
        "title": "Spot intimi in città",
        "content": "Ciao ragazzi, vivo da poco in città e avrei bisogno di sapere quali sono i migliori posti tranquilli in cui stare con una ragazza in intimità, grazie mille!",
        "upvotes": 10,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1o74s6o/spot_intimi_in_città/"
    },
    {
        "id": "1o7lgau",
        "author": "mangecan92",
        "title": "Comprare casa in cui sono in affitto. Cosa faccio?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o7lgau/comprare_casa_in_cui_sono_in_affitto_cosa_faccio/"
    },
    {
        "id": "1o7bus2",
        "author": "Senzanima2",
        "title": "Consiglio tecnico PC a Torino per riparazione cerniera notebook Acer",
        "content": "Ciao a tutti 👋\n\nSto cercando un consiglio su come muovermi per riparare la cerniera dello schermo del mio notebook Acer Extensa 15 EX215-51-577DE, acquistato su Amazon nel 2020.\n\nLa cerniera destra fa troppo attrito, tanto che, aprendolo, si è staccata la sede filettata delle tre viti che la fissano. La parte esterna in plastica che copre la cerniera sembra invece integra.\n\nAvevo già inviato questo PC in assistenza quando era ancora in garanzia, per lo stesso problema alla cerniera sinistra, quindi credo sia un punto debole del modello.\n\nHo visto che online i ricambi costano indicativamente:\n\n* cerniera: circa 10 €\n* cover esterna: circa 40–50 €\n\nMi chiedevo:\n* conoscete qualche tecnico o laboratorio affidabile su Torino che faccia questo tipo di riparazioni (cerniere / scocche notebook)?\n* secondo voi, quanto sarebbe un prezzo onesto per la manodopera (smontaggio schermo, sostituzione cerniera e sistemazione cover)?\n\nGrazie mille in anticipo a chi risponderà 🙏",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o7bus2/consiglio_tecnico_pc_a_torino_per_riparazione/"
    },
    {
        "id": "1o76ryg",
        "author": "Lale_banane",
        "title": "Bancarella Orecchini Gran Balon",
        "content": "Ciao!  \nDomenica sono andata al gran balon e ho trovato una bancarella davvero particolare che vendeva orecchini e collane con parti del corpo scolpite.  \nErano davvero delle mini opere d'arte indossabili.\n\nPurtroppo avevo il cellulare scarico e non ho potuto scannerizzare il qr code che portava alla pagina di instagram della persona che li realizzava e adesso non riesco a trovarla.  \nQualcuno saprebbe dirmi come si chiami l'artista e/o la sua pagina instagram? Grazie ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o76ryg/bancarella_orecchini_gran_balon/"
    },
    {
        "id": "1o7a5fc",
        "author": "alistairalbani",
        "title": "Tavoli da ping-pong a Torino",
        "content": "Salve, vivo in via Barnaba Panizza e ho un amico in via svizzera, vorremmo trovare una zona dove giocare a ping-pong su un tavolo libero, abbiamo racchette e palline nostre. Attualmente giochiamo al Politecnico dato che è l'area più a metà per entrambi. Qualcuno saprebbe consigliarmi un posto più comodo? Grazie",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o7a5fc/tavoli_da_pingpong_a_torino/"
    },
    {
        "id": "1o78g5a",
        "author": "bookbookitaita5",
        "title": "Torino e d'intorni. Ragazze, mia sorella si sposa e cerca disperatamente un vestito \"diverso\". \"Elfico\" come dice sempre lei o da \"favola dei boschi\"...",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/70lq4ejyc9vf1.jpeg?auto=webp&amp;s=a7f74d3683908076197830dac792c1170f825788"
        },
        "permalink": "/r/torino/comments/1o78g5a/torino_e_dintorni_ragazze_mia_sorella_si_sposa_e/"
    },
    {
        "id": "1o77p50",
        "author": "Ugabugacugabuga",
        "title": "Are there any indoor volleyball courts here in Torino",
        "content": "Me and a friend are here for an internship and we’re looking for any indoor courts so we can  play do you guys have any tips or suggestions on how and where we could play?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o77p50/are_there_any_indoor_volleyball_courts_here_in/"
    },
    {
        "id": "1o76unp",
        "author": "esluisge",
        "title": "Amici per andare in palestra",
        "content": "Ciao a tutti, faccio questo post perche pensavo di iscrivermi alla FitActive di Corso Svizzera ma non conosco nessuno con cui andare e non sono mai andato seriamente in palestra per cui vorrei andare con qualcuno che mi guida un attimo su come si fanno gli esercizi. Mi piacerebbe anche trovare amici con cui fumarmi le j",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o76unp/amici_per_andare_in_palestra/"
    }
]