[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j31tc7",
        "author": "Certain_Passion1630",
        "title": "Why did Suits get so much more hype than White Collar?",
        "content": "Maybe this is a popular take I wasn’t aware of, but I started watching Suits 1-2 years ago when it seemed like everyone was talking about it. \n\nI just finished season 1 of White Collar, and all the character dynamics are basically the same: the genius criminal (Neal and Mike), the experienced mentor (Peter and Harvey), the quirky ally (Moz and Louis), and the smart woman behind the scenes keeping everyone levelheaded (Elizabeth and Donna). \n\nThen I looked and White Collar came out 2 years before Suits. I don’t know how popular the shows were when they first aired, but Suits was in the Netflix top 10 for weeks and I just happened to see White Collar one day while scrolling through shows. ",
        "upvotes": 94,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tc7/why_did_suits_get_so_much_more_hype_than_white/"
    },
    {
        "id": "1j34j3w",
        "author": "Independent-Dark-910",
        "title": "Just lost my account",
        "content": "Hey everyone, I need to vent about something wild that just happened. I went to fire up Netflix on my TV last night, only to see my account was signed out. Weird, right? I figured it was a glitch, so I tried logging back in—bam, denied. Okay, no biggie, I’ll reset my password. Except when I tried, Netflix hit me with “no account exists” for my email. This is an account I’ve had for over five years.\n\nAt this point, I’m thinking, “Oh great, I’ve been hacked.” So I call Netflix support to sort it out. I’m assuming five years of payment history tied to my card, watch history, all that jazz would make it obvious I’m the real owner. The rep I talked to was nice enough—she even admitted she could see the new email on the account looked fraudulent (some random string of letters and numbers). But then she drops the bomb: there’s nothing she can do. Apparently, because the email got changed, I’m locked out for good unless I want the whole account wiped. Years of watchlists, recommendations, and profiles? Gone.\n\nLuckily, my Netflix password was unique, so this won’t spiral into other accounts getting compromised. Still, it stings to lose it like that. I’m just baffled they couldn’t verify me with all the data they have—payment records, IP addresses, something! The only option they gave was to nuke the account and start fresh. I get that security protocols exist for a reason, but this feels like punishing the victim instead of the hacker.\n\nHas anyone else dealt with this? Did I miss some secret way to reclaim it? Or am I just stuck rebuilding my Netflix life from scratch?",
        "upvotes": 48,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1j34j3w/just_lost_my_account/"
    },
    {
        "id": "1j3e25m",
        "author": "Sudden_Pop_2279",
        "title": "Jurassic World Chaos Theory Season 3 Gets April 2025 Release Date on Netflix; Know When and How to Watch",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3e25m/jurassic_world_chaos_theory_season_3_gets_april/"
    },
    {
        "id": "1j2ot14",
        "author": "FuturismDotCom",
        "title": "Netflix Is Using AI Upscaling on a 1980s Sitcom and the Results Are Horrific",
        "content": "",
        "upvotes": 273,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ot14/netflix_is_using_ai_upscaling_on_a_1980s_sitcom/"
    },
    {
        "id": "1j3ergl",
        "author": "ImpossiblePeak1722",
        "title": "With love, Megan",
        "content": "I can't seem to ignore, but the energy between Michael and Meghan in the kitchen is just off. Why she does not maintain eye contact, she keeps looking down while talking.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ergl/with_love_megan/"
    },
    {
        "id": "1j3co3v",
        "author": "RebelGrin",
        "title": "Love Rats - show about romantic scams",
        "content": "What the fuck am I watching? I am screaming at the screen on how gullible they are, next minute I just have tears from laughter.\n\n90% of these people who get scammed is because they behave like gold diggers. Just like the tinder swindler victims. Rich guy likes them, and they lick their lips by the thought of having a relationship with them, which blinds them for the obvious scam. They are promised riches and instead get scammed out of all their money and more. All by the promise of living a rich life, in an expensive house in an exotic location.\n\nAnd then the glaring red flags being ignored. Like this woman who's bank accounts were frozen as the bank told her the transactions were flagged as fraud. She wouldn't have it and told the bank to unfreeze the accounts, and kept sending money to her love rat. Friends were screaming at her to stop it but no, this was true love.\n\nThen the woman with the guy telling her his daughter had died. She then finds out he is a scammer because he told her she was stupid for getting scammed by him. He then makes up with her and scams her out of even more money. HOW?!\n\nThe woman who flew to Sri Lanka to meet up with a hotel bus boy, ended up being proposed to and  then ended up at the dudes parents in a metal shed and no one spoke English. She then gets confused into marriage and flies home, sells her house, takes early retirement, sends funds to build a house in Sri Lanka and when she arrives nothing is finished. Guy then asks for 31,000 pound for  a second hand hi-ace van, which she pays. And is now no longer even talking to her. She then finds postcards from another woman he is married to. Oh my word. \n\nThe woman who broke up with her husband because he cheated on her, but after the divorce kept him on to do her books and defrauded her in the process.\n\nThe woman who was talking to a guy online, didn't really go anywhere, he was rude to her, she cut if off, but he then send her a screenshot of an investment. And she immediately had her head turned, fell for the fake investment app, and got scammed out of 50,000$. LOL\n\nThe woman who met a millionaire, guy was in Dubai for business, but she ended up sending him money because his GB bank account were frozen. She asked him if there was no else who can lend him money. He literally said, yes if I need a million pounds, but not for these small amounts. LOOOOOOL\n\netc et etc.\n\nYou cannot be this stupid. Sorry.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3co3v/love_rats_show_about_romantic_scams/"
    },
    {
        "id": "1j3engk",
        "author": "thequietbookworm",
        "title": "Cannot download Netflix episodes/movies to Windows laptop - alternatives??",
        "content": "As we all know the issue of Netflix removing the download button for episodes on Windows PCs (meaning that we cannot watch Netflix offline anymore during long flights for instance), does someone know an alternative? \n\nA legal website offering movies which I can download on my laptop would be great.\nScreen mirroring from phone to PC also doesn‘t really solve the issue, because why on earth would I want to use my phone for that long unnecessarily just to screen what used to be a built-in function of Netflix on PCs…?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j3engk/cannot_download_netflix_episodesmovies_to_windows/"
    },
    {
        "id": "1j39k2e",
        "author": "syris_JesusLovesU",
        "title": "Creeped Out (Side Show: Part 2 episode)",
        "content": "The animal edits in this episode are hilariously horrible. Like they went on google and then inserted the image lol. When the monkeys were about to take Zephaniah, it didn’t even show what happened. The bad edits are just funny lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j39k2e/creeped_out_side_show_part_2_episode/"
    },
    {
        "id": "1j38p0n",
        "author": "MSLogan07",
        "title": "Good news for WWE fans in Pakistan",
        "content": "I contacted to live agent of Netflix and asked about WWE programming on Netflix Pakistan. and they said it will be shown live and replays too in Pakistan. Good news for us. Also, Wrestlemania coming on April 1 on Netflix Pakistan.\n\nThank God. Finally Sony doesn't have rights for our region and we can watch it live too.\n\n[Wrestlemania Coming on April 1 on Netflix Pakistan](https://preview.redd.it/h77ggbypvnme1.jpg?width=927&amp;format=pjpg&amp;auto=webp&amp;s=dbbb61c0e0ff0e757b1ef73541608e3700e754fc)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j38p0n/good_news_for_wwe_fans_in_pakistan/"
    },
    {
        "id": "1j2jsij",
        "author": "MysteriousDelay6266",
        "title": "The Electric State | Final Trailer | Netflix",
        "content": "",
        "upvotes": 52,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jsij/the_electric_state_final_trailer_netflix/"
    },
    {
        "id": "1j375p7",
        "author": "P80overGlock",
        "title": "Need help finding an old tv show",
        "content": "It was a long time ago I would say like 2015-16 it was show about a city with random people around the city that had some type of power and their where people that had to defeat them when they use their powers to commit crimes\nPlease help me find it thank u 🙏 ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j375p7/need_help_finding_an_old_tv_show/"
    },
    {
        "id": "1j36kwd",
        "author": "jokur07",
        "title": "how do i fix this issue?",
        "content": "https://preview.redd.it/nbbf8szrzmme1.png?width=994&amp;format=png&amp;auto=webp&amp;s=fa655105d342742762575b9323addd41667ee9de\n\nits so annoying when this happen and i cant watch netflix anymore, im a premium netflix user and we only have 5 members using and in the premium account it says we can only add 6 members on it, and this sht been bugging me lately and also i dont have any extra members \n\nhttps://preview.redd.it/9ezwjwb70nme1.png?width=1158&amp;format=png&amp;auto=webp&amp;s=86e33498edabe23f37cccebc18b3ac71d92d7ea1\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j36kwd/how_do_i_fix_this_issue/"
    },
    {
        "id": "1j2yv2n",
        "author": "Lullaby_of_Broadway",
        "title": "Looking for a certain true crime documentary that had animation",
        "content": "Looking for a true crime documentary I saw on Netflix about a teenage murder. What set it apart was that to hide each kids identity they animated them. Does anybody know?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j2yv2n/looking_for_a_certain_true_crime_documentary_that/"
    },
    {
        "id": "1j31tue",
        "author": "Substantial-Area9201",
        "title": "Medusa trailer language spoken",
        "content": "Which language was it? Sounds like Spanish, unfortunately I'm not familiar enough with other languages to know for sure that it is Spanish and if so which Spanish specifically ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tue/medusa_trailer_language_spoken/"
    },
    {
        "id": "1j2zcqa",
        "author": "overpower84",
        "title": "Start live events from the begining",
        "content": "There needs to be a way to start live events from the beging BEFORE you start playback \n\n(I know you can click \"start from begining\" AFTER you start playback of the event) but they need to add the ability to start from the beginning BEFORE you start a currently running event.\n\n(I've got Roku stick+ if the option is available on other platforms)\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2zcqa/start_live_events_from_the_begining/"
    },
    {
        "id": "1j2f9a3",
        "author": "SphincterRelaxer",
        "title": "What Jennifer did",
        "content": "This documentary is crazy. A bit of spoiler here but Jesus Christ I feel for her. What horrible parents. What they did to her when she was obviously suffering under all that pressure is beyond cruel . They didn’t treat her like their child, how could they been so strict and cold is beyond me. I know what she did is horrid but I can’t really judge her. Poor kid ",
        "upvotes": 30,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1j2f9a3/what_jennifer_did/"
    },
    {
        "id": "1j2mg69",
        "author": "Illustrious_Gear_471",
        "title": "Zero Day TV Show Classified Folder Actually Unclassified",
        "content": "In S1E2, 4 minutes and 42 seconds before the end, a folder is shown for a top secret government program known as Proteus. However, on this TOP SECRET folder is a sticker that says “U//FOUO” which literally means UNCLASSIFIED, for official use only. I thought this was funny and wanted to share.",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2mg69/zero_day_tv_show_classified_folder_actually/"
    },
    {
        "id": "1j2sv9c",
        "author": "rachiepants2017",
        "title": "Did anyone else love Elite? Danna Paola's latest interview makes me want to rewatch!",
        "content": "",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j2sv9c/did_anyone_else_love_elite_danna_paolas_latest/"
    },
    {
        "id": "1j2zgmu",
        "author": "Shoddy-Scallion-4903",
        "title": "College interview",
        "content": "Hi everybody, For my studies, I have to write a thesis on business models in video streaming platforms. I’d be really happy if someone working in this field could spare a few minutes for a quick chat. Thanks so much!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2zgmu/college_interview/"
    },
    {
        "id": "1j39oyx",
        "author": "srathnal",
        "title": "Anyone else notice the price increase?",
        "content": "Personally, I am cancelling my membership. It is more expensive that every other streaming service I have. $17.99 … too much. \n\nNote: I’m also canceling all of them that have started including commercials in addition to the monthly amounts I pay. They act like they are the only entertainment game in town. \n\nHello Tubi/Freestream/Pluto…",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j39oyx/anyone_else_notice_the_price_increase/"
    },
    {
        "id": "1j2ync6",
        "author": "johdd435",
        "title": "Not showing shows on one profile",
        "content": "My family has 3 profiles and i was trying to watch raw but on my profile it wasn’t showing up neither was the walking dead which i was watching earlier. I checked the other profiles and they showed both shows. Is there any way to fix this.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ync6/not_showing_shows_on_one_profile/"
    },
    {
        "id": "1j37621",
        "author": "ellissabain",
        "title": "Here's a closer look at Gabby Petito's family's adorable matching tattoos",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j37621/heres_a_closer_look_at_gabby_petitos_familys/"
    },
    {
        "id": "1j29utw",
        "author": "hiatitae",
        "title": "I want to watch the credits, why am I now not allowed to?",
        "content": "",
        "upvotes": 45,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p8s0k1tyceme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j29utw/i_want_to_watch_the_credits_why_am_i_now_not/"
    },
    {
        "id": "1j2r1on",
        "author": "chocpretzel",
        "title": "Question about Cassandra (German series)",
        "content": "Hi everyone,\n\nso I just finished the new series and I was wondering, after the car accident, Cassandra seems to shut down completely, hence the daughter is forgotten in the house, no?   \nBut how did the robot get back into the house, when the new family is moving in? Who moved her and how did that person know where to move her? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j2r1on/question_about_cassandra_german_series/"
    },
    {
        "id": "1j2qoor",
        "author": "Midgar918",
        "title": "Static on Brooklyn 99",
        "content": "Watching this show and only this show I'm getting fuzzy static like I'm watching it on a vcr tape from 1995.\n\nRunning Netflix on an Xbox X. Wondering of its like this for anyone else and if it is the source material. Like I said its only this show. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2qoor/static_on_brooklyn_99/"
    },
    {
        "id": "1j2uu1t",
        "author": "AW5542",
        "title": "Can’t wait movies because I have the ad version?",
        "content": "I’m trying to watch some movies but a lot of the movies I’m trying to watch, like Black Hawk Down, aren’t supported on the ad version of Netflix. Had no idea this plan had less movies. When did this start?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j2uu1t/cant_wait_movies_because_i_have_the_ad_version/"
    },
    {
        "id": "1j2jy6h",
        "author": "S4v1r1enCh0r4k",
        "title": "'The Electric State: Kid Cosmo' Prequel Game To Follow Film's Release On Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jy6h/the_electric_state_kid_cosmo_prequel_game_to/"
    },
    {
        "id": "1j27a3d",
        "author": "SnooTomatoes7723",
        "title": "Is it worth to watch 1899 even tho it got cancelled? | Or similar shows like From and Lost?",
        "content": "Hey, I finished the show \"From\" which is a horror mystery, and I heard that 1899 should have a similar vibe. But people said it is not worth starting the show because it ends on a cliffhänger and the second season got cancelled, so I would be just mad after watching it. Do you think it is still worth it, and more importantly, do you have recommendations for shows like From or Lost?",
        "upvotes": 29,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1j27a3d/is_it_worth_to_watch_1899_even_tho_it_got/"
    },
    {
        "id": "1j2rg20",
        "author": "V_DataNerd",
        "title": "Is Kaiju no. 8 available in Netflix us?",
        "content": "I am traveling and I noticed that I can stream the show on Netflix. I will be back home soon and I want to continue watching it. So I want to know I can continue watching it on Netflix.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j2rg20/is_kaiju_no_8_available_in_netflix_us/"
    },
    {
        "id": "1j3483q",
        "author": "vampiricwitch_",
        "title": "Is the script to La Dolce Villa AI generated?",
        "content": "Silly argument, and its not that serious but... is it? I'm no cinephile, I probably couldn't name a single director (well known or otherwise) but what the hell the script is bad. Not just bad, because a bad script isn't uncommon in random movies. \n\nIt literally sounds like chat-gpt, AI generated nonsense/garbage. It's cheesy, full of generic-sounding fluff/filler dialogue to get that pesky exposition out of the way, full of what stinks like recycled \"witty\" dialogue, almost like a disney channel kid's TV sitcom, except its a fully serious movie. I'm genuinely curious. \n\nDid anyone else watch it? I've long since clicked off, but let me know if this is the vibe you got. It says it came out 2025, so at this point I am fully willing to believe they sent an idea into Chatgpt and gave the actors the cheesiest, most generic-sounding lines ever known. It literally sounds like generic garbage. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j3483q/is_the_script_to_la_dolce_villa_ai_generated/"
    }
]