[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 47,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qxut7s",
        "author": "Fit-Significance8580",
        "title": "Netflix has gone to crap and I’m tired of pretending like it hasn’t",
        "content": "I remember when Netflix was the streaming service. You paid like $4.99 a month, there were ZERO commercials, and the library was stacked with actually good movies and TV shows. You could scroll for 10 minutes and still feel excited about what to watch.\n\nNow?\n\nWe’re paying more than double that (for the cheapest plan), getting slapped with ads, and somehow the selection has gotten worse instead of better.\n\nHow does that even make sense?\n\nEvery time I open Netflix now, it’s the same recycled “Top 10” list, half-finished original series that get canceled after one season, or movies that look like they were made for a middle school media class. If you do find something decent, congrats — it’ll probably be gone next month due to “licensing issues.”\n\nMeanwhile:\n\n\t•\tPrices keep going up\n\n\t•\tPassword sharing gets cracked down on\n\n\t•\tAds are creeping in like we didn’t specifically pay to avoid cable\n\nAt this point Netflix feels less like a premium streaming service and more like cable TV with an app and worse content.\n\nI honestly miss when Netflix felt fun instead of frustrating. Now I spend more time scrolling than actually watching anything — and half the time I just close the app.\n\nIs it just me, or did Netflix completely lose what made it great in the first place?",
        "upvotes": 162,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1qxut7s/netflix_has_gone_to_crap_and_im_tired_of/"
    },
    {
        "id": "1qxhvh4",
        "author": "Longjumping_Land_977",
        "title": "Lucy Letby is on extreme safety watch in prison as she’s mocked by inmates over Netflix doc",
        "content": "",
        "upvotes": 431,
        "comments": 223,
        "media": null,
        "permalink": "/r/netflix/comments/1qxhvh4/lucy_letby_is_on_extreme_safety_watch_in_prison/"
    },
    {
        "id": "1qxcey9",
        "author": "bmurphy0396",
        "title": "sick and tired of the household rule",
        "content": "like i’m so fucking done with this let me be a college student in peace bro. it’s so annoying that i can’t watch netflix bc im away from home for months at a time like my bad let me travel 14 hours to be on the same wifi so that i can watch the thing we pay for. its just so fucking greedy and infuriating to me.",
        "upvotes": 529,
        "comments": 235,
        "media": null,
        "permalink": "/r/netflix/comments/1qxcey9/sick_and_tired_of_the_household_rule/"
    },
    {
        "id": "1qx0vhm",
        "author": "My_immortal_7",
        "title": "The audacity to use AI in Netflix",
        "content": "Just finished the Netflix doc “The Investigation of Lucy Letby” \n\nLiked the story and the doc overall, but half the interviews were AI generated! It was so weird and cringe, especially when the AI got emotional.. like wtf 😂 how am i gonna get emotional watching a morphing face with an AI voice? I really hope they don’t normalize this AI slop in Netflix ",
        "upvotes": 249,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1qx0vhm/the_audacity_to_use_ai_in_netflix/"
    },
    {
        "id": "1qxkq97",
        "author": "AgreeableDance8535",
        "title": "Lucy Letby Doc thoughts?",
        "content": "Just finished watching this and I have to say, quite the controversial take! Some of my opinions may be slightly biased here BUT I don’t think she did it… or at least for the most part. I do believe that nursing wards can be quite a cliquey area like mentioned earlier in the documentary. You’d be surprised but I do feel clinical and laboratory environments can be more toxic than you’d imagine. The stress, the grief and maybe the overall mental work these staff perform brings out the worst in them. I believe the ward may have been understaffed, there may have been mistakes made by other nurses in the unit and ultimately Lucy was the scapegoat for them.\n\nOn top of this, I think the documentary also had A LOT of loopholes. Where was CCTV evidence in all of this? Were there not other staff and nurses present during these cases? If so where are their interviews or testimonies? I don’t know, I felt there was a lot missing to really analyse this properly as a viewer as well. I do think Lucy is a bit sketch, some of her comments and her behaviour is odd but I also believe nurse units can be extremely toxic and there is a very good chance they used her as a scapegoat.\n\nWhat’s everyone’s thoughts?",
        "upvotes": 9,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1qxkq97/lucy_letby_doc_thoughts/"
    },
    {
        "id": "1qy1i4j",
        "author": "Michigangirl34",
        "title": "Why don’t netflix games don’t work on all of my tvs?",
        "content": "For some reason the tv in the basement doesn’t have Netflix games on it. But it is the same tv that I have in the living room and bed room. Is there a way to fix it? My kids woul love to have games on that tv! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qy1i4j/why_dont_netflix_games_dont_work_on_all_of_my_tvs/"
    },
    {
        "id": "1qxzdev",
        "author": "royoclarito",
        "title": "Any suggestions for similar shows like the ones listed below.",
        "content": "I love crime-related and mafia shows like The Sopranos, Snowfall, and The Mayor of Kensington. Even though those shows aren’t on Netflix, I just made a Netflix account and I’m looking for recommendations in the same style. I enjoy stories with intense crime, powerful characters, and complex worlds where loyalty, betrayal, and family play a big role.\n\nNow that I’m on Netflix, I want to know what shows or movies I should watch next if I like gritty dramas with criminal empires and deep character development. I’m especially interested in series that focus on crime bosses, drug trades, gangs, or undercover stories — anything that gives the same kind of tension and world-building as the shows I already love.\n\nCan you suggest crime or mafia-style Netflix titles that would be a good fit for someone who enjoys dark, character-driven stories with moral complexity?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qxzdev/any_suggestions_for_similar_shows_like_the_ones/"
    },
    {
        "id": "1qxwbzc",
        "author": "momandcrohnie",
        "title": "Lust and yearning",
        "content": "I need recommendations for shows or a movie that is full of lust, love, yearning, etc.  💯 smut and romance.  I’m in that kinda mood 😏\n\nDoesn’t matter which era or decade ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qxwbzc/lust_and_yearning/"
    },
    {
        "id": "1qx0erq",
        "author": "Embarrassed-Glove423",
        "title": "Black Summer",
        "content": "In my personal opinion black summer is the best zombie apocalypse show out there. Everything is so real, it's exactly how a person would behave if they are in a real life situation, kudos to the makers. Not sure why Netflix cancelled S3, it's such a bummer 😞",
        "upvotes": 67,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qx0erq/black_summer/"
    },
    {
        "id": "1qx2prs",
        "author": "Less_Manufacturer218",
        "title": "Southland, the best show",
        "content": "Anybody else watch Southland for the first time when it came onto Netflix recently?\n\nThe easiest show I’ve ever watched, just wish there was a lot more of it.\n\nCan’t believe it was canceled. Maybe it’ll get a re-boot if it does well on Netflix ",
        "upvotes": 35,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qx2prs/southland_the_best_show/"
    },
    {
        "id": "1qxpmlu",
        "author": "Locket-The-Possesor",
        "title": "“Restricted due to ads” but not actually?",
        "content": "I just upgraded my netflix plan from ad supported to standard, as there were many movies I wished to watch that were blocked by licensing restrictions. However, after doing so, the films still show the same “Remind me” screen but with the line about “Licensing restrictions” removed. I didn’t see anything about it being locked for my country either.\n\nAm I missing something? I searched online but couldn’t find anything that matched what I’m seeing. Any info would be appreciated! Feeling a little bit like I got scammed lol, but I could just be misunderstanding or the payment needs to roll over.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qxpmlu/restricted_due_to_ads_but_not_actually/"
    },
    {
        "id": "1qxptz9",
        "author": "El3m3nTor7",
        "title": "Foreign shows without subtitles",
        "content": "Is there a way to get these subtitle writers to actually include ALL voice? \nWatching \"El Rey\" a show about singer Vicente Fernandes and I'm not speaking Spanish and all his songs is without subtitles like it's not meant to be understood.\nCan you imagine watching the show about Freddy Mercury and in every song his voice turns alien and every meaning of his words becomes gibberish? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qxptz9/foreign_shows_without_subtitles/"
    },
    {
        "id": "1qx84rj",
        "author": "jalapenos10",
        "title": "Startup is back!",
        "content": "Startup is back on Netflix!!!\n\nMaybe people already knew this but I was so excited to see start up back!! I haven’t watched it since like.. 2020? 2021? And I only saw it once - have been dying for a rewatch. Very excited! ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qx84rj/startup_is_back/"
    },
    {
        "id": "1qxbays",
        "author": "bbqporklomein",
        "title": "Left-Handed Girl",
        "content": "Just watched Left-Handed Girl on Netflix and really enjoyed it. Doesn’t seem to be discussed much. This movie is the solo directorial debut of Shih-Ching Tsou. She’s been a longtime collaborator of Sean Baker and this movie definitely has a similar feel to The Florida Project. It’s about a single mom and her two girls struggling to start a new life in Taipei. It’s told through the eyes of the youngest daughter, the titular left-handed girl. It was mostly shot on location in a night market and the movie captures the vibrant energy of the location with great immediacy. \n\nWould love to discuss the \\*twist\\* and the clues that were foreshadowed. Major spoiler warning for upcoming thread. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qxbays/lefthanded_girl/"
    },
    {
        "id": "1qwsldk",
        "author": "Lucariusssss96",
        "title": "Any series or movies like THE OA?",
        "content": "Helloo as you guys know the OA was cancelled 😭 I just recently watched it and I AM HOOKED!! I need more shows or movies like this. \n\nAny recommendations? Thank you so much!! :)",
        "upvotes": 17,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qwsldk/any_series_or_movies_like_the_oa/"
    },
    {
        "id": "1qx2cab",
        "author": "joe102938",
        "title": "Can't watch Venom: The Last Dance on ad supported Netflix. Quick reminder that Netflix sucks now.",
        "content": "And they don't even tell you before signing up that it's unavailable on ad supported plans. So you go to watch a movie, see it's only on Netflix, sign up to Netflix to watch it, then Netflix is just like \"Nope, give us more money.\"\n\nI despise Netflix today. ",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qx2cab/cant_watch_venom_the_last_dance_on_ad_supported/"
    },
    {
        "id": "1qwguht",
        "author": "cristrawberry",
        "title": "Is Bridgerton Season 4 Basically the Perfect Live-Action Cinderella?",
        "content": "Can we talk about how Bridgerton Season 4 feels like the perfect live-action take on Cinderella?\n\nThe parallels are stunning—fairytale romance, quiet longing, and that signature Bridgerton drama layered on top. Every scene feels cinematic, every moment intentional. It’s classic magic with a modern glow-up, and honestly, some of Bridgerton’s most beautiful storytelling yet.\n\nWhat do you think this season will end with?\n",
        "upvotes": 20,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qwguht/is_bridgerton_season_4_basically_the_perfect/"
    },
    {
        "id": "1qx3ovb",
        "author": "Kitchen_Turnover5299",
        "title": "am i going crazy or was law and order svu added and removed the same day?",
        "content": "earlier today, i saw that law and order svu was recently added onto netflix (im located in the us) and now that i am checking law and order along with several other shows i saw that were added are now gone too? i’m so confused😭",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qx3ovb/am_i_going_crazy_or_was_law_and_order_svu_added/"
    },
    {
        "id": "1qw0rl1",
        "author": "godfire_dragneel",
        "title": "The Queen's Gambit",
        "content": "Ngl, when this came out, what, 1 or 2 years ago I didn't think it'll be this good. I mean sure, as a chess player myself I thought it'll be interesting but nothing much. I thought it'll be something like, idk, someone inventing the Queen's Gambit and using it against other players and publishing it yada yada yada.\n\nI didn't have high hopes for this. Fortunately, today I took myself to go and watch it. Glad I did.\n\nWhen watching, I genuinely thought that it'll overwhelm it's viewers with chess technicalities but thankfully no. It blends the thrill of playing with personal drama and so all. Chef's kiss, the best way they could've done it.\n\nThe realities of child prodigies and the 'curses' it comes with it was beautiful portrayed as well.\n\nTruly a masterpiece.",
        "upvotes": 115,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1qw0rl1/the_queens_gambit/"
    },
    {
        "id": "1qvyp7y",
        "author": "BrandNew84rt",
        "title": "When will Netflix stop suggesting series I saw",
        "content": "Does anyone have any idea why the algorhythm and ai is so bad apart from they want us to scroll through all the content.... My god I cannot appreciate the lack of intelligence in the UI.... and why would I want to 'revisit' a series of 8 seasons three weeks later? I don't have dementia 😂🤓 \n\n ",
        "upvotes": 135,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qvyp7y/when_will_netflix_stop_suggesting_series_i_saw/"
    },
    {
        "id": "1qwqn52",
        "author": "FrostingGrouchy4944",
        "title": "7 seconds tv show",
        "content": "I know it’s not a recent show but i just watched it and it’s so haunting and I’m so sad and mad about how it ended even though realistic it leaves someone feeling sick with injustice. I need to talk to people about it! The ending with Brenton on a bike with the sky and how we finally see him, it’s just so poetic -an amazing director. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qwqn52/7_seconds_tv_show/"
    },
    {
        "id": "1qwlv11",
        "author": "watermelonornot",
        "title": "Need something new to watch",
        "content": "Hi guys, I am in need of a new series. Waiting for the new episodes of bridgerton, good doctor, the rookie, high potential and 911 Nashville. I need something to watch while I eat. 🙈😂 Otherwise University becomes unbearable",
        "upvotes": 4,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qwlv11/need_something_new_to_watch/"
    },
    {
        "id": "1qvm1df",
        "author": "rubythieves",
        "title": "Lucy Letby - sources ‘digitally anonymised’",
        "content": "I’ve just started watching this documentary and one of the parents who lost their newborn appears as ‘digitally anonymised’ - essentially, an almost perfectly human-like AI figure appears on screen and tells her story (presumably her voice would have been altered too.)\n\nI find this a little creepy but also interesting for the future of this genre - true crime, documentaries about political resistance or secret organisations etc often need witnesses or sources to appear as dark silhouettes with electronically altered voices. Now they can appear as very realistic AI avatars. Is this a good thing or a bad thing?",
        "upvotes": 372,
        "comments": 310,
        "media": null,
        "permalink": "/r/netflix/comments/1qvm1df/lucy_letby_sources_digitally_anonymised/"
    },
    {
        "id": "1qx3knm",
        "author": "Large-Cardiologist54",
        "title": "Why am I like this at night 😭📺",
        "content": "I ate dinner.\n\nAte three cookies.\n\nGot comfortable.\n\nGot up for more snacks.\n\nSomewhere in there I lost my eyebrows. \n\nAnd I’m STILL scrolling 😭Please tell me it’s not just me.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qx3knm/why_am_i_like_this_at_night/"
    },
    {
        "id": "1qwr5mk",
        "author": "Prior_Recipe_5999",
        "title": "When Netflix ends up with the canceled cw shows",
        "content": "what do you guys think the odds are that Netflix revives some of the cancelled cw shows cuz historically those always did very well on Netflix that was where most of those shows views came from",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qwr5mk/when_netflix_ends_up_with_the_canceled_cw_shows/"
    },
    {
        "id": "1qvwr0a",
        "author": "Climbing13",
        "title": "What did you think of The OA?",
        "content": "I’m a sucker for time travel shows so after finishing Dark I was looking for another.\n\nI kinda of want another season of The OA lol. It grabbed me in and I got invested. Ended up finishing it pretty quickly. I enjoyed that not everything was told  right away so there was actual mystery throughout the show. \n\nI feel like a lot of stuff nowadays has no mystery and every scene goes by so fast. I liked that the show didn’t feel rushed, but ended up finishing on a high note with more questions. \n\nA few things were kinda weird , but I think in some ways it’s what made it a great show for me. ",
        "upvotes": 31,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qvwr0a/what_did_you_think_of_the_oa/"
    },
    {
        "id": "1qx2jk4",
        "author": "Fuzzy_Proof_3438",
        "title": "Why Doesn’t Netflix Have a Comment Section Like YouTube?",
        "content": "spend a lot of time on YouTube, and honestly, I often enjoy reading the comments as much as watching the video. Seeing what others think, catching details I missed, and discussing specific moments makes the whole experience more engaging.\n\nDoes anyone else feel like Netflix (and other streaming platforms) should have a similar feature? Imagine being able to comment on scenes with timestamps, discuss theories, react to plot twists in real time, or see what others noticed at the exact moment you’re watching.\n\nI know there’s always the risk of spoilers, but maybe it could be optional or filtered.",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qx2jk4/why_doesnt_netflix_have_a_comment_section_like/"
    },
    {
        "id": "1qwn9ap",
        "author": "NaturalCarob1460",
        "title": "Mobile downloads",
        "content": "Is there any way to watch mobile downloads from the phone itself or is it a netflix download thing where it's downloaded on netflix and I can only watch it on netflix?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qwn9ap/mobile_downloads/"
    }
]