[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pm0zc2",
        "author": "Fit_Possession_5545",
        "title": "The Beast in Me",
        "content": "Claire Danes in The Beast in Me is such a good actor. The lighting, the musical scoring, the characters all complemented the plot. Never a boring moment.\n\nMust watch.",
        "upvotes": 88,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0zc2/the_beast_in_me/"
    },
    {
        "id": "1plvc58",
        "author": "Less_Manufacturer218",
        "title": "Wake Up Dead Man, I really liked it!",
        "content": "It’s a very entertaining movie with a lot of underlying messages. The characters were great in their roles. The whole movie has a fantasy aspect to it that is also great and keeps you engaged!",
        "upvotes": 66,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1plvc58/wake_up_dead_man_i_really_liked_it/"
    },
    {
        "id": "1plbq9a",
        "author": "arkelangel",
        "title": "I'm done.",
        "content": "I'm done. Years of subscriptions. Netflix has decided to remove casting. My tvs using chrome cast. I don't have a Netflix ap on my tv. I don't want to buy a new tv. I want to be able to cast when I go to friends houses, or when I'm in a hotel. Like.... This was a great feature. Netflix isn't useful to be if i can't watch it on my tv. I'm just so frustrated. I know it isn't customer services fault but omg ....",
        "upvotes": 1029,
        "comments": 201,
        "media": null,
        "permalink": "/r/netflix/comments/1plbq9a/im_done/"
    },
    {
        "id": "1plwvm6",
        "author": "Jumpy-Weekend-1223",
        "title": "Why is the volume so inconsistent when watching Netflix",
        "content": "most of the dialogue is barely audible, but during intense scenes the volume suddenly becomes extremely loud...the awful volume swings is just diagusting\n",
        "upvotes": 35,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1plwvm6/why_is_the_volume_so_inconsistent_when_watching/"
    },
    {
        "id": "1pm0rj2",
        "author": "Wonderful_ion",
        "title": "What should I watch that is of substance on Netflix?",
        "content": "I’m open to either a show or a film and pretty flexible about genre. Curious what you’d recommend.\n\nThe last three I watched were Before Sunrise, The Talented Mr. Ripley, and The Virgin Suicides. All three had that very ’90s sense of longing and identity, more atmospheric than plot-driven, and they really lingered after.",
        "upvotes": 15,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0rj2/what_should_i_watch_that_is_of_substance_on/"
    },
    {
        "id": "1pm4ihj",
        "author": "Business_Prune_7638",
        "title": "Any good shows on Netflix?",
        "content": "I don’t have a certain genre as long as it’s good I really been into shows like beast in me, stranger things, and Ginny and Georgia. I like teen high school typa shows or like good thrillers been waiting for the new stranger things episodes to drop. ",
        "upvotes": 4,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pm4ihj/any_good_shows_on_netflix/"
    },
    {
        "id": "1plx28l",
        "author": "missmightberight",
        "title": "Hjem til jul / Christmas at home season 3",
        "content": "Who’s seen the new season? What do you guys think about it?\n\nI looove it and hope there’ll be a hundred more seasons. No better series to start Christmas time. 🥹\n\nGosh I still hope Jonas and Johanne end up together, their chemistry is just different. 😭",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1plx28l/hjem_til_jul_christmas_at_home_season_3/"
    },
    {
        "id": "1pm62xb",
        "author": "EverythingElse42",
        "title": "What's on your Netflix+ watch list.",
        "content": "After the merger, what will you be watching first from the new content.\n\nOnce (and if) the purchase goes through and the content gets incorporated into Netflix (or Netflix +)\n\nWhat is going on your watch list?\n\nI look forward to...\n\n\nSuccession.\n\nThe last of us. \n\nVeep\n\nWestworld \n\n",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pm62xb/whats_on_your_netflix_watch_list/"
    },
    {
        "id": "1pm6682",
        "author": "Past_Armadillo2398",
        "title": "How long will the 2025 Christmas NFL games be available for replay on Netflix?",
        "content": "I know for 2024, Netflix supposedly let the games be available for replay 3 hours after they ended. But I cannot find any specific information for 2025. I am guessing it will be the same, but I am trying to find out for sure so I can plan around X-Mas commitments. Thanks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pm6682/how_long_will_the_2025_christmas_nfl_games_be/"
    },
    {
        "id": "1plwohc",
        "author": "MrMrsPotts",
        "title": "Netflix is really really annoying now",
        "content": "I signed up for the ad version of Netflix. I tried to use it on my TV  but it apparently it is unusable on my model of TV! I have to pay twice as much for the ad free version. So I thought I would cast it from my phone. The ad version doesn't you caat either! So there is no way for me to watch Netflix even though I am paying for it.",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1plwohc/netflix_is_really_really_annoying_now/"
    },
    {
        "id": "1plk7x8",
        "author": "him1230292939",
        "title": "Netflix can now do whatever they want.",
        "content": "Just watching the new 'Man vs Baby' and starting to realise the sheer amount of product placement they use, from Android ads to deliveroo. This isn't all. Stranger things also included the most out of place gatorade ad. It used to be very subtle, similar to pretty much every movie but now it looks like they are playing monopoly in real life, caring about profit over quality of production.",
        "upvotes": 25,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1plk7x8/netflix_can_now_do_whatever_they_want/"
    },
    {
        "id": "1pm63wf",
        "author": "UniqueRide3156",
        "title": "For anybody experiencing titles skipping the screen with the description and playing immediately",
        "content": "I think I have figured the issue out. Use a browser to login to Netflix and go to your setting and turn off the test new features toggle. Then kindly message Netflix and tell them how awful this “new feature” is",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pm63wf/for_anybody_experiencing_titles_skipping_the/"
    },
    {
        "id": "1pl7nz3",
        "author": "Impressive_Gain_3385",
        "title": "I'm having a hard time finding a good show to watch, can you recommend some?",
        "content": "I have watched breaking bad, game of thrones, sopranos, stranger things, narcos, are there any other good ones? I have tried watching a couple of shows but some of them are just difficult to watch like mindhunter for some reason I just had a hard time getting through it especially the first two episodes I just stopped it. I started watching dark and I just couldn't get through the show after the first two episodes due to the translation of English for the German actors that are provided.",
        "upvotes": 201,
        "comments": 662,
        "media": null,
        "permalink": "/r/netflix/comments/1pl7nz3/im_having_a_hard_time_finding_a_good_show_to/"
    },
    {
        "id": "1pm56z4",
        "author": "Greenman1279",
        "title": "Ripple",
        "content": "I ran out of things to watch and I came across Ripple.  I like that it's in NY and I like Frankie Faison.  I've watched about five episodes.  I have two problems with it.  First, I can't believe that after Kris left London for NY she never tried calling her father on the phone?  And, why are there still parking meters on the streets?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pm56z4/ripple/"
    },
    {
        "id": "1pm0r3q",
        "author": "hardknox_",
        "title": "Did everyone lose the \"Show\" screen?",
        "content": "A while back Netflix started skipping the Show/Movie info screen where you could read about the plot and play a trailer and now jumps directly from the home page to playing the show/movie. Anyone else?\n\nNetflix on Nvidia Shield.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pm0r3q/did_everyone_lose_the_show_screen/"
    },
    {
        "id": "1pltvnu",
        "author": "nooutlaw4me",
        "title": "The Walking Dead",
        "content": "I had started watching this a few years ago, but then stopped. Is it worth starting over? Is Netflix planning on taking it down? I am just wondering because I don’t wanna be caught up in a rush to finish it if they’re going to take it down.",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pltvnu/the_walking_dead/"
    },
    {
        "id": "1pluive",
        "author": "OpeningJazzlike1555",
        "title": "Release on hard copy.",
        "content": "Am I the only one who wants Netflix to drop some if not all of their original content on Blu-ray or DVDs. I would give them all my money and still pay for the streaming subscription. Please Netflix make my dreams come true and empty my bank account. ",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pluive/release_on_hard_copy/"
    },
    {
        "id": "1pl4920",
        "author": "MainEntrance7413",
        "title": "Wake up dead man is absolutely Cinema loved every second of it ✋🏽😤🤚🏽",
        "content": "What a stellar ensemble cast and god damn, that camerawork and cinematography were magnificent. I've gotta say, this is the best one out of the three. A true masterpiece in the crime-thriller-mystery genre.\n\nDaniel Craig has aged like fine wine.The whole thing had me on the edge of my seat. Brilliantly written, gracefully directed, mysteriously told, perfectly casted, visually mastered, and carried by haunting, atmospheric music that gave the film its entire atmosphere.\n\nOverall... just wow. What a movie.",
        "upvotes": 167,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1pl4920/wake_up_dead_man_is_absolutely_cinema_loved_every/"
    },
    {
        "id": "1plrqty",
        "author": "Independent-Bowl6466",
        "title": "Just finished \"The watcher\".",
        "content": "Is The Watcher every previous owner? Dean drops a letter in the finale does this mean ex-owners like him/Roger become the next Watcher in a cycle? What do you think?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1plrqty/just_finished_the_watcher/"
    },
    {
        "id": "1pkz0r3",
        "author": "dailymail",
        "title": "Netflix cancels Billionaires' Bunker just three months after release on the streaming platform",
        "content": "",
        "upvotes": 248,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1pkz0r3/netflix_cancels_billionaires_bunker_just_three/"
    },
    {
        "id": "1pli3wo",
        "author": "Justere1",
        "title": "Somebody Feed Phil",
        "content": "Started this show this week and can't get enough of it, its Phil Rosenthal (creator of Everybody Loves Raymond). He jets around the world experiencing different cities around the world with a comedic bent. Absolutely brilliant. \n\nJust a reccomendation! What do you think?",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pli3wo/somebody_feed_phil/"
    },
    {
        "id": "1pluh3b",
        "author": "thosewhocannetworkd",
        "title": "The Hunters - No subtitles during German spoken parts?",
        "content": "Watching The Hunters and it’s driving me crazy that there are no subtitles during the German spoken flashback sequences.  If I turn on Subtitles in English under Netflix settings, it subtitles the English spoken parts and still has no subtitles at all during the German spoken parts!  What am I doing wrong?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pluh3b/the_hunters_no_subtitles_during_german_spoken/"
    },
    {
        "id": "1plx0bk",
        "author": "Top_Childhood_362",
        "title": "Wake Up, Dead Man - It's Review Time",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1plx0bk/wake_up_dead_man_its_review_time/"
    },
    {
        "id": "1pl1j5n",
        "author": "ComradeRedsky",
        "title": "Mr Mercedes",
        "content": "Worth starting this, anyone got opinion on this, have to say looks promising, I'm sure it's been out a while, just noticed it's showing up. Looks right up my street. ",
        "upvotes": 37,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1pl1j5n/mr_mercedes/"
    },
    {
        "id": "1pkwtbw",
        "author": "mr_the_boilermaker",
        "title": "What's with the non-stop music in documentaries?",
        "content": "I almost had to turn off the Charlie Sheen doc because of the annoying, non-stop background music. \n\nI DID turn off the hunt for Bin Laden doc because of the annoying, non-stop background music. \n\n  \nNetflix documentary film makers, pump the brakes on the music! It makes these shows unwatchable!\n\n/rant",
        "upvotes": 56,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pkwtbw/whats_with_the_nonstop_music_in_documentaries/"
    },
    {
        "id": "1plaojf",
        "author": "According_Time5120",
        "title": "Netflix Drops New Crypto Comedy About Forgotten Bitcoin Password Worth $35 Million Stash",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1plaojf/netflix_drops_new_crypto_comedy_about_forgotten/"
    },
    {
        "id": "1pks9y4",
        "author": "T00dd",
        "title": "All The Classic Star Trek TV Shows To Exit Netflix Globally In January",
        "content": "",
        "upvotes": 57,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pks9y4/all_the_classic_star_trek_tv_shows_to_exit/"
    },
    {
        "id": "1plstky",
        "author": "Pity_you",
        "title": "Peacemaker",
        "content": "Do I need to watch before starting peacemaker. Because when I download and watch 1st ep. It seems like story came from other series or movie. If so please let me know!",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1plstky/peacemaker/"
    }
]