[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j7ji2j",
        "author": "WhileZestyclose2413",
        "title": "Any feel good happy shows to watch on Netflix?",
        "content": "I struggle with depression and anxiety and I was looking for a happy and feel good show to watch to help me wind down and relax. Nothing too old please. ",
        "upvotes": 105,
        "comments": 205,
        "media": null,
        "permalink": "/r/netflix/comments/1j7ji2j/any_feel_good_happy_shows_to_watch_on_netflix/"
    },
    {
        "id": "1j7okbt",
        "author": "Odd-Network-3005",
        "title": "Tell me 8 shows that you liked too much",
        "content": "From netflix\n\n🙂 mines in no specific order:\n\n1)a series of unfortunate events\n2)the oa\n3)arcane\n4)The order\n5)archive 81\n6)dark\n7)death love robots season 3\n8)my name (korean)\n\n",
        "upvotes": 14,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okbt/tell_me_8_shows_that_you_liked_too_much/"
    },
    {
        "id": "1j7mxfx",
        "author": "questionsfordays22",
        "title": "HELP ME FIND NAME OF THIS SHOW",
        "content": "A man was framed for stealing documents or evidence, when he went to jail he tried figuring out what happened. He then connected with someone that was able to fake his death. He then pretended to be the nephew of a mob boss and killed everyone that was involved in framing him. \n\nHis wife was trying to figure out who wanted to frame her husband (she thinks he’s really dead). \n\nThe husbands best friend tries making a move on the wife and she turns him down and says she still in love and not over her husband…\n\nIt was a foreign Netflix limited series ",
        "upvotes": 19,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1j7mxfx/help_me_find_name_of_this_show/"
    },
    {
        "id": "1j77itb",
        "author": "Janawham_Blamiston",
        "title": "Is there any way to have Netflix not infect every profile with the actions of another?",
        "content": "My wife and I decided to check out that show Too Hot To Handle on Netflix, just for shits and giggles, we had made a new profile just for that. Well, our 12 year old went to use Netflix on her own profile, and the recommendations are all filled with different regional versions of the show, and shows that are similar.\n\nShe obviously didn't watch, and it's not like she's a little child who can't see an image of a woman in a bikini. But the point is, we were on our own profile, so why is Netflix recommending it on other profiles as well? What's the point of having separate profiles if they're going to leak into other ones?",
        "upvotes": 60,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j77itb/is_there_any_way_to_have_netflix_not_infect_every/"
    },
    {
        "id": "1j7tyvg",
        "author": "Robemilak",
        "title": "'You' Superfan Cardi B Teases the Trailer for the Series's Fifth and Final Season",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j7tyvg/you_superfan_cardi_b_teases_the_trailer_for_the/"
    },
    {
        "id": "1j7n4kj",
        "author": "Alan_Stamm",
        "title": "'Asura:' A Series About Nothing, This Time From Japan",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7n4kj/asura_a_series_about_nothing_this_time_from_japan/"
    },
    {
        "id": "1j7hsyx",
        "author": "Leading-Bug-Bite",
        "title": "Delicious (Movie)",
        "content": "The movie redefined the concept of \"eat the rich\" and brought it to this age.\n\nThe movie slowly showed the pressing dangers to the wealthy, when the many \"peasants\" realize there's just a few of the rich which they can literally eat. The wealthy are treated as beasts for slaughter. A plague that must be dealt with.\n\nIt was a brilliant movie with mild foreshadowing. \n\nUltimately, it was a gentle nudge to the common folk to remember that the many will always outnumber the few. The many are everywhere and the few are helplessly stuck. ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j7hsyx/delicious_movie/"
    },
    {
        "id": "1j7okkc",
        "author": "characterarcforth",
        "title": "Ad supported plan",
        "content": "Does anyone have the ad supported plan and if so, is it much different from the Ad free plan? Kinda want to save money and switch but the aspect of having some shows locked behind a paywall doesn’t sound good. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okkc/ad_supported_plan/"
    },
    {
        "id": "1j6ukux",
        "author": "Mountain-Match2942",
        "title": "Tell me when a movie is subbed or dubbed",
        "content": "Is anyone else annoyed that the Netflix description of a show or movie never tells us the language it's in and whether it's dubbed or gas subtitles? Or maybe I'm just not seeing it? I usually have to play the show to find out. I don't mind having non-English language shows suggested to me. I just want to know what it is before I start watching.",
        "upvotes": 133,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1j6ukux/tell_me_when_a_movie_is_subbed_or_dubbed/"
    },
    {
        "id": "1j7rwvd",
        "author": "dishant_thapa",
        "title": "Jennifer Lopez teases Netflix project amid 'fury' over Ben Affleck and Jennifer Garner’s post-divorce bond",
        "content": "Jennifer Lopez is making a grand return to romantic comedies with Office Romance, her upcoming Netflix film.\n\nFans are thrilled, especially after hits like Maid in Manhattan and Marry Me. However, her big career news comes amid reports of her frustration over recent photos of her ex-husband, Ben Affleck, looking close with Jennifer Garner. \n\nWhile some sources claim she’s upset, others insist she’s too focused on her new movie to care. Meanwhile, Affleck and Garner remain friendly co-parents. \n\nRead the full article at We Got This Covered!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j7rwvd/jennifer_lopez_teases_netflix_project_amid_fury/"
    },
    {
        "id": "1j6x0qn",
        "author": "latrallyidk",
        "title": "Any way around “your device isn’t part of the Netflix household”?",
        "content": "I started college and moved literally 25 minutes away from my parents and now I can’t watch Netflix on our joint account anymore (which I pay for half of). What can I do? I tried calling but they just ran me around in circles for an hour.",
        "upvotes": 86,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1j6x0qn/any_way_around_your_device_isnt_part_of_the/"
    },
    {
        "id": "1j6qb67",
        "author": "Whysoclumsy",
        "title": "Netflix's subscription fee is RIDICULOUSLY high, what new, high quality, entertaining shows justifies this pricing?",
        "content": "As per title.\n\nFor me, it feels like the prices and the quantity released are going up, the quality is the lowest of the low. Most of the shows i see being released are at BEST The CW qualities.\n\nMaybe i wanna add something as well, a show that might have solid longevity where it won't be cancelled after 2 seasons.\n\n\nNot even interested in Netflix movies, they don't even try to make good ones. Documentaries aren't my thing anymore when I realize a lot of it contains blatant misinformation with added dramatic effects (just a personal thing for me)",
        "upvotes": 220,
        "comments": 218,
        "media": null,
        "permalink": "/r/netflix/comments/1j6qb67/netflixs_subscription_fee_is_ridiculously_high/"
    },
    {
        "id": "1j7mkwb",
        "author": "OkReturn2071",
        "title": "Netflix Australia: can u watch drive to survive on ad supported plan?",
        "content": "Really only signing up to watch this, but nothing much else. Thus  paying $8 but aud seems ok whereas $18 is a bit much. I might find other things to watch, but nothing comes to mind.\n\nSo yeah anyone on ad supported can confirm?\n\nGuess I can always sign up on the cheapest plan then upgrade if its mot available. I did a google search and they didn't mention id not listed.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7mkwb/netflix_australia_can_u_watch_drive_to_survive_on/"
    },
    {
        "id": "1j7agxr",
        "author": "brqinrot",
        "title": "is there a page for movies you cant remember the name of??",
        "content": "the main part:\n\na bunch of mysterious crimes follow to someone dying, the first is someone dying in a bathtub and the second is getting hung. the police find a note in the deceased person's body in the bathtub, which helps lead them to find the killer. i remember it being placed in a winter setting as well??? i watched this movie a few years ago but i literally cant remember the name LOL. i just remember it was on netflix (i think).",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j7agxr/is_there_a_page_for_movies_you_cant_remember_the/"
    },
    {
        "id": "1j7jlt5",
        "author": "AsparagusSea9382",
        "title": "Got a weird error code and there’s nothing on the site?",
        "content": "I keep trying to watch my show and kept getting NSURL1200 but once I got home and connected to the Wi-Fi I got (NSURL:1102;CM:12660;). I’m super confused so if anyone knows anything I’d appreciate it.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j7jlt5/got_a_weird_error_code_and_theres_nothing_on_the/"
    },
    {
        "id": "1j7ftem",
        "author": "-wemakinit",
        "title": "720p on Edge. Please help!",
        "content": "Hi. It used to be fine and idk why but now even with edge I don't think I'm getting a good quality out of Netflix. I can see visible artifacts throughout the video. I checked logging in chrome to compare and there is no difference in the video quality. Edge is supposed to stream Netflix in full resolution, right? Then why is it capping out at 720p for me? Is there any work around to it? Please help!!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j7ftem/720p_on_edge_please_help/"
    },
    {
        "id": "1j71yfn",
        "author": "youremomgay420",
        "title": "Netflix consistently crashing on my iPhone",
        "content": "I have no idea when or how this started, but in trying to start Netflix on my phone, it crashes on start up every single time. It doesn’t even consider the app to have been opened, as I cannot force close it like you can other apps. \n\nI’ve watched it on my phone within the last week, and for some reason it has now decided to no longer work. I’ve deleted and reinstalled the app, restarted my phone, neither have worked. I can’t even watch it on the internet browser as it just goes to a page that forces you to go to the app or manage account info. After even more troubleshooting, I have deleted the app and restarted my phone, no fix. Restarted my phone and left it off for ~5 minutes, no fix.\n\nHas anyone else had this problem? Does anyone know any fixes? Help would be much appreciated. \n\nEdit: after dealing with 3 agents, no amount of troubleshooting has resolved the issue. Clearing cookies from my browser, cookies from Netflix itself, nothing will work. I’m going to open a ticket tomorrow and will keep this post up in case anyone has a similar issue\n\nEdit 2: there’s an update for Netflix now, fixed the issue. Guess it was a bug. ",
        "upvotes": 10,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1j71yfn/netflix_consistently_crashing_on_my_iphone/"
    },
    {
        "id": "1j7b097",
        "author": "FeelingFun5100",
        "title": "Netflix Preview Club: Survey Ended Unexpectedly",
        "content": "I misinterpreted a question about technical problems; after I provided information about a line in the movie that was difficult to hear/understand, the survey ended. By answering that question it was assumed that I could not watch the film when, in fact, I watched the whole movie and would love to offer feedback. \n\nIs there any way that I can be sent a new link to the survey?\n\nWill this prevent me from being invited to future screenings?\n\n  \nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7b097/netflix_preview_club_survey_ended_unexpectedly/"
    },
    {
        "id": "1j7akts",
        "author": "prettyflvckkoo",
        "title": "Ähnliche Serien wie Doppelhaushälfte",
        "content": "Ich bin gerade auf die Serie gestoßen und wollte mal fragen ob jemand so ähnliche Serien auf Deutsch kennt sowas in Richtung Discounter sowas in die Art mag ich an deutschen Humor oder diese eine Serie da auf Amazon Prime Victor macht’s ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7akts/ähnliche_serien_wie_doppelhaushälfte/"
    },
    {
        "id": "1j7etjp",
        "author": "StatementLonely5626",
        "title": "I cannot find any of the shows i want",
        "content": "I recently made a netflix account. \nToday cannot find ANY of the shows i was watching. It is making so mad! \nToday i was watching gossip girl and my laptop shut down while watching because it got low on battery. When i opened my laptop i went to my netflix account and tried to continue watching but i couldn’t. \nI then tried to search some other series like \nAvatar The Last airbender \nSuits \nThen some other real estate shows. \nAnd i cannot find any of these. I dont understand why this happened! \nI need help. \nIf anyone can help me please do. \nI already tried to log in and out. And delete the app on my phone ect. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j7etjp/i_cannot_find_any_of_the_shows_i_want/"
    },
    {
        "id": "1j6arrx",
        "author": "JemJemIsHerName",
        "title": "Apple Cider Vinegar- holy crap!",
        "content": "I’m not sure if I’m late to this but oh my god. This may be one of the best shows I’ve seen in a long time. I hate it, I love it, I’m angry, I’m sad. It’s giving the “Inventing Anna” energy but with much higher stakes. A fake cure to cancer that probably killed a lot of people and is still in line with the fake “cures” we see today for medically curable stuff. It’s so fascinating and infuriating at the same time. I love this show, I hate this happened. I love it’s being put out there. I haven’t been so angry/interested in a show in a long time. 9/10 I would recommend! ",
        "upvotes": 369,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1j6arrx/apple_cider_vinegar_holy_crap/"
    },
    {
        "id": "1j77o6d",
        "author": "tomyom",
        "title": "Netflix Windows App stutters, but only in fullscreen.",
        "content": "Recently built a new PC, added a 4K display to my existing 2K one and saw the only way to get 4k Netflix on PC was with the Microsoft Store windows app. Downloaded this, used the Ctrl + Alt + Shift + Q trick to see the stats and was excited to see it streaming at beautiful 4K. Once I went full screen I then noticed consistent stuttering, but strangely if I come out of fullscreen and play it in window (even maximised) it doesn't stutter at all.\n\nEndless reddit/googling has lead me to try the following, none of which worked:\n\n\\- Disabled HAGS (made no difference)  \n\\- Disabled AMD Freesync (wasn't enabled in the first place, tried enabling, disabling, no difference)  \n\\- Referenced against other programs, YouTube 4K stream no issue, VLC 4K media playback no issue. Issue seems isolated to Netflix alone.\n\nFor reference specs are 9800X3D, 9070XT, 32GB DDR5, 2TB M.2. This is literally a fresh build with all latest drivers installed, thinking possibly:\n\n\\- As the GPU only launched a couple days ago maybe the drivers are so new this is a bug?  \n\\- I run a 4K 60Hz (on HDMI) and a 2K 165Hz (on DP) as my monitors (the 2k being my primary for gaming etc) I've read there's issue with windows and different Hz monitors, but I feel like I've gone down an endless rabbit hole of things it could be related too including HDCP? Any other ideas? I can watch maximised as a workaround for now, just really strange that the stutter only happens when it's fullscreened (as I understand it the windows app is built on edge so maybe related to that too?)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j77o6d/netflix_windows_app_stutters_but_only_in/"
    },
    {
        "id": "1j6d75c",
        "author": "Legitimate_Ad3625",
        "title": "‘THE ELECTRIC STATE’ debuts with 10% on Rotten Tomatoes - Now becomes The Russo Brothers’ lowest rated film ever",
        "content": "",
        "upvotes": 165,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1j6d75c/the_electric_state_debuts_with_10_on_rotten/"
    },
    {
        "id": "1j6upv9",
        "author": "indiewire",
        "title": "Jenna Ortega On Working With Lady Gaga In ‘Wednesday’: ‘You Never Know What to Expect From Her’",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j6upv9/jenna_ortega_on_working_with_lady_gaga_in/"
    },
    {
        "id": "1j73fjg",
        "author": "Funny_Actuator_947",
        "title": "Are you able to watch the Mindy project on Canadian Netflix",
        "content": "Okay so I don’t have the premium plan, I have the ad plan and it says I can’t watch the Mindy project unless I upgrade. Those on premium subscription in Canada, are you able to watch it? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j73fjg/are_you_able_to_watch_the_mindy_project_on/"
    },
    {
        "id": "1j6zyh1",
        "author": "Solid_Name_7847",
        "title": "Fish out of water shows?",
        "content": "So if anyone’s seen Supernatural, I mean characters like Castiel. Alien, strange, socially awkward people learning how to “human.”\n\nI already know about and have watched Resident Alien, but does Netflix have anything else? The only other one I can think of is like the Justice League cartoon series (which is also on Netflix) because J’onn J’onzz also fits that character type.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j6zyh1/fish_out_of_water_shows/"
    },
    {
        "id": "1j72aty",
        "author": "No_Dust2551",
        "title": "College Project on netflix customer retention (please help out)",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j72aty/college_project_on_netflix_customer_retention/"
    },
    {
        "id": "1j79ieo",
        "author": "HALdron1988",
        "title": "Do you think Netflix is taking steps at making an AI Agent to be a Guide for us humans?",
        "content": "It seems we have been having a lot of talk about AI Agents and Manus just got released by a Chinese Startup.\n\n It made me think about the many conversations with people I have had and even own family members that find online streaming service content itself can throw people off balance because it is so much. Netflix was vocal about making a TV channel that was cultivated for people to offset the enormity some find with the catalogue, and as it keeps on expanding, it might become worse for people who have this feeling.\n\n  \nWhich then means an AI Agent would be perfect for the streaming services because you could just tell it to find the best movies of an actress or whatever genre you were feeling, and then it could go and search through the huge catalogue for you :D",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j79ieo/do_you_think_netflix_is_taking_steps_at_making_an/"
    },
    {
        "id": "1j5yp2g",
        "author": "Dependent-Arm-7443",
        "title": "With Love, Meghan is Actually Good",
        "content": "I know Meghan Markle gets a lot of hate, but honestly, I actually liked her show. It feels like people dismiss it because of who she is, rather than judging it fairly. If you actually watch it with an open mind, it’s enjoyable in its own right. As someone who watches lots of lifestyle/ cooking shows, she actually uses lots of good cooking/ home making techniques. She has a warm, calming presence that makes it easy to watch. The cinematography, the food, the storytelling—it’s well-produced and enjoyable. I mean she is exploring something she loves – She clearly enjoys what she’s doing, and I respect that.\n\nAnd let’s be real—of course, she’s not filming in her own house. Security risks aside, most food and lifestyle shows aren’t filmed in the host’s actual home. People are just looking for things to criticize.\n\nShe’s trying her hand at something new, something she clearly loves. Why is that such a crime? Not everything has to be groundbreaking—sometimes, it’s just about making something enjoyable.\n\nIf it’s not your thing, that’s totally fine, but hating for the sake of hating is just unnecessary. Anyone else actually like the show?",
        "upvotes": 507,
        "comments": 488,
        "media": null,
        "permalink": "/r/netflix/comments/1j5yp2g/with_love_meghan_is_actually_good/"
    },
    {
        "id": "1j62d09",
        "author": "CommercialAlert158",
        "title": "Gabby Petito Documentary",
        "content": "I am watching episode one of this horrible story 😔 there are so many mistakes made on all accounts. Just to start with in the first episode when the police stopped them and spent time with them to figure out what was going on. Why would they put Him in the Hotel room and have the young girl (Gabby) sleep in her car? I know this is a minor question considering this being a horrible story but it just shocked me? Anyone have any ideas on this?",
        "upvotes": 273,
        "comments": 269,
        "media": null,
        "permalink": "/r/netflix/comments/1j62d09/gabby_petito_documentary/"
    }
]