[
    {
        "id": "1pp9som",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: CF Talavera de La Reina vs Real Madrid | Copa del Rey 25/26",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pp9som)",
        "upvotes": 152,
        "comments": 348,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pp9som/postmatch_thread_cf_talavera_de_la_reina_vs_real/"
    },
    {
        "id": "1pn4mth",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 14,
        "comments": 1550,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pn4mth/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ppnxkk",
        "author": "Ready_Ad_1353",
        "title": "Andriy Lunin save against Talavera 90+3'",
        "content": "",
        "upvotes": 485,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ljlh9qqi0y7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ppnxkk/andriy_lunin_save_against_talavera_903/"
    },
    {
        "id": "1ppoodq",
        "author": "More-Judgment-9253",
        "title": "Endrick vs CF Talavera de la Reina",
        "content": "I'm sorry but alonso is actually a criminal for what he's done with endrick, even carlo didn't treat him this badly. Franco was out for a whole month and endrick still didn't get any chances. Gonzalo or franco should be the ones going on loan, not him. This is a generational talent and yet he's on the bench for brahim diaz😂. I'm sorry but alonso's a liar, he talked about having rotations and a hierarchy yet he watched brahim and franco offer absolutely nothing for the past 6 months and still didn't give endrick a chance, not even once. This is genuinely one of the dumbest things I've ever witnessed at this club",
        "upvotes": 391,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ofp5sx407y7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ppoodq/endrick_vs_cf_talavera_de_la_reina/"
    },
    {
        "id": "1ppvv3t",
        "author": "o6ohunter",
        "title": "Kylian Mbappé is running riot in Madrid",
        "content": "",
        "upvotes": 89,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pugkqx9utz7g1.jpeg?auto=webp&amp;s=eac1dc7d95b6312616ca58acc3997543b383014c"
        },
        "permalink": "/r/realmadrid/comments/1ppvv3t/kylian_mbappé_is_running_riot_in_madrid/"
    },
    {
        "id": "1ppppne",
        "author": "Ready_Ad_1353",
        "title": "Most Chances created in LaLiga",
        "content": "",
        "upvotes": 159,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n30nk3tuiy7g1.jpeg?auto=webp&amp;s=d29d2ea15e1bb2785e3b46b0ab3426cfb71cdbb3"
        },
        "permalink": "/r/realmadrid/comments/1ppppne/most_chances_created_in_laliga/"
    },
    {
        "id": "1ppmd9p",
        "author": "AlekhineAl",
        "title": "Bellingham’s decision making is absurd here. So many options to pass the ball, 90th minute on the clock, well ahead on the scorecard, player well outside the box and Lunin’s positioning is on point. WHY Snatch defeat from the jaws of the victory?",
        "content": "",
        "upvotes": 227,
        "comments": 143,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g6cmh3d9ix7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ppmd9p/bellinghams_decision_making_is_absurd_here_so/"
    },
    {
        "id": "1ppgrzw",
        "author": "Charybd1ss",
        "title": "Andriy Lunin : \"I don't like any of the goals I've conceded at all, they're not inevitable. In the few matches I play, I would obviously like to help the team more. I'm speechless about Mbappe, but FIRST help the team win trophies and then individual ones.\"",
        "content": "",
        "upvotes": 598,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8t3uak5tuv7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ppgrzw/andriy_lunin_i_dont_like_any_of_the_goals_ive/"
    },
    {
        "id": "1pprhmi",
        "author": "Critical-Remove-1878",
        "title": "Did we REALLY need to buy Franco Mastantuono this season?",
        "content": "First of all, I'm not saying this to \"hate\" on the kid. I think he is a talented youngster and he has the potential to be a great player. He had some good performances earlier in the season as well.\n\nThe problem is that his skillset isn't suitable for the RW position. He doesn't have the extreme pace and 1v1 dribbling required to be a touchline winger like Vini and he certainly doesn't have the shooting boots to be your typical inverted winger. He is yet another creative attacking midfielder, yet another player in our squad who can, on paper, play RW, but he isn't an actual RW (like Rodrygo, Arda, Endrick, Valverde etc). \n\nHis best position is AM, a position covered by a 22 year and a 20 year old. And soon, maybe buy another 21 year old, who happens to be a top 3 player in Serie A. There's a huge debate in our fanbase if two of them can co-exist in the same line-up, so all four of them being in the same squad makes no sense imo.\n\nTo make the analogy, our current squad compared to 16/17 feels like having no Kroos/Modric, 2 Casemiros, 2-3 Kovacics and 3-4 Iscos (in terms of style, not quality). \n\nThe club knew that Jude was still gonna play games as an AM, that Arda will develop and that Nico Paz had a great season and he might return sooner or later, so I struggle to see how buying Mastantuono for 50m suits our squad, even long-term?\n\n* Either our scouting department sucks and they assumed Franco actually has RW qualities and they never saw him play\n* OR our board sucks and we just bought yet another expensive South American teenager, just to block other teams from buying him (why didn't we buy Estevao then? Much more suitable to our squad).\n\nIn any case: good prospect, bad transfer, in terms of useability to our squad.\n\nAgain, I'm NOT saying Franco is a bad player or that he doesn't have the potential to be amazing in the future. I just don't see the point of buying our... 4th U-22 AM for 50m when we desperately need defenders and a deep lying playmaker. It seems like some of our transfers just happen, without any sort of planning. No team has succeeded with 3 LWs, 4 AMs and 5 physical midfielders.",
        "upvotes": 89,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pprhmi/did_we_really_need_to_buy_franco_mastantuono_this/"
    },
    {
        "id": "1pplsb8",
        "author": "TheFeatherDiaries",
        "title": "Güler's creativity, Free-Kicks and Range of passing vs Talavera",
        "content": "",
        "upvotes": 227,
        "comments": 88,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0yxgkf4zax7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pplsb8/gülers_creativity_freekicks_and_range_of_passing/"
    },
    {
        "id": "1ppjbwz",
        "author": "Hisense_Sports1",
        "title": "Mbappé is one goal away from Cristiano Ronaldo’s all-time Real Madrid calendar-year record",
        "content": "After scoring a brace against Talavera in the Copa del Rey, Kylian Mbappé has now scored **65 goals** in 2025 for club and country, with 58 for Real Madrid and 7 for France. Among French players, only Just Fontaine in 1958 (66 goals) scored more goals in a single calendar year for a top-five-league club and the national team than Mbappé’s 65. His 58 goals for Real Madrid put him just one goal behind Cristiano Ronaldo’s club record of 59 goals set in 2013. According to the schedule, Real Madrid will host Sevilla on December 21, giving Mbappé his final chance in 2025 to break Cristiano’s legendary calendar-year club scoring record. Can he do it? How historic would it be if he does?",
        "upvotes": 347,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ppjbwz/mbappé_is_one_goal_away_from_cristiano_ronaldos/"
    },
    {
        "id": "1ppt2db",
        "author": "bmudallal",
        "title": "Opinions on the latest Marca interview with ex-RM nutritionist Itziar Gonzalez",
        "content": "Hi folk,\nHas anybody read the latest Marca interview with ex-Madrid nutritionist Itziar Gonzalez about her struggles at the club?\nHere’s a balanced take on the Marca piece/interview with ex-Real Madrid nutritionist Itziar González — the one generating a lot of buzz today:\nItziar González, who previously worked successfully with players like Dani Carvajal and Rodrygo, gave a long interview to Marca detailing her experience at Real Madrid and saying she was subject to workplace harassment by the club’s medical staff. \nShe alleges the medical department undermined her work, didn’t communicate with her, mocked her publicly (even in WhatsApp groups), served food contrary to her plans, and discouraged players from following her guidance. \nGonzález says that despite improvements in players’ condition when they followed her plans, the environment became hostile to the point that she ended up asking to leave and is now pursuing a legal complaint for harassment. ",
        "upvotes": 23,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ppt2db/opinions_on_the_latest_marca_interview_with_exrm/"
    },
    {
        "id": "1pp9n3o",
        "author": "Bingbong717",
        "title": "Cancel the Endrick loan",
        "content": "I genuinely think Endrick is way better than Brahim, Franco, Ceballos, Fran and even GG at this point. Such a shame he didn’t get a chance until CDR and the end of the year. His two passes to Mbappe were sublime and showed his quality compared to the players I named. He deserves a second shot imo, and send the others off",
        "upvotes": 452,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pp9n3o/cancel_the_endrick_loan/"
    },
    {
        "id": "1ppt4xx",
        "author": "Rare-Benefit-9441",
        "title": "Real Madrid vs Talavera",
        "content": "Many Real Madrid fan groups in Spanish want to sell the entire team because of the difficult finish against Talavera de la Reina, and honestly, I think they are overreacting. The team has to work, yes, there are aspects to improve, obviously, but compare the results of other teams: Barcelona struggled to score against Guadalajara, Atlético drew 3-2, Villarreal, third in the league, lost to Racing, and many teams have been eliminated from the first division. I can understand the frustration, but it seems like they only started watching soccer yesterday. The first round of the Copa del Rey is like that, and it's the game of a lifetime for smaller clubs. We shouldn't overreact. Real Madrid has a lot of work to do, yes, but they're not going to sell the whole team because they conceded two goals in the round of 32 of the Copa del Rey, thanks Lunin por saving us, there is a great gap to be improved. \n\n",
        "upvotes": 19,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ppt4xx/real_madrid_vs_talavera/"
    },
    {
        "id": "1pp988q",
        "author": "No-Independent2522",
        "title": "Kylian Mbappe makes it 3-0",
        "content": "",
        "upvotes": 348,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7t384lxa5u7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pp988q/kylian_mbappe_makes_it_30/"
    },
    {
        "id": "1ppbj3e",
        "author": "taos__v",
        "title": "Current situation at the club",
        "content": "",
        "upvotes": 233,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i71n47cbmu7g1.jpeg?auto=webp&amp;s=f7902e9a5221c6b1a9e1e1ed2e3547c578d82b1f"
        },
        "permalink": "/r/realmadrid/comments/1ppbj3e/current_situation_at_the_club/"
    },
    {
        "id": "1povngk",
        "author": "Emergency-Hornet-594",
        "title": "🚨🇪🇸 Sergio Ramos played against Barça for a third-division Spanish club? This is Borja Díaz, a Guadalajara player, who looks exactly like Sergio Ramos. He played against Barcelona in the Copa del Rey yesterday 😅🤯",
        "content": "",
        "upvotes": 1335,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/id93oje5gr7g1.jpeg?auto=webp&amp;s=dd3a80fa787b7fdcbe220fa84e5c9309d7f38216"
        },
        "permalink": "/r/realmadrid/comments/1povngk/sergio_ramos_played_against_barça_for_a/"
    },
    {
        "id": "1ppn192",
        "author": "Ancient_Medium_5746",
        "title": "We forget our payments FC",
        "content": "Dont you just love paying for ref reports to not use them? Oh yes, you bet you do, top off my head and its Aloe gel, how and why do they even defend this.\nValverde and Enrique both did not recieve any sort of indication about any reports existing during there tenure, yet this absolute lot says “valverde said that its completely normal to get reports!”, yes it is but its not normal to pay 7 million for the ones you couldn’t use and the fact that they paid for them using offshore banking AND they even misplaced them because, uh oopsies dasies im a billion dollar franchise so i will throw money around because why not 😂",
        "upvotes": 29,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w79sdbzaqx7g1.jpeg?auto=webp&amp;s=7d8953eff279a1ffe27b3d9a2bba20dbedf409b9"
        },
        "permalink": "/r/realmadrid/comments/1ppn192/we_forget_our_payments_fc/"
    },
    {
        "id": "1ppdt50",
        "author": "CheemFactorSG",
        "title": "I hope Asencio becomes the new Nacho",
        "content": "This post may age horribly, but: academy product + minimal complaints + fiery, aggressive attitude on the pitch when called upon + can play multiple positions in the backline = reminds me of Nacho.\n\nLike Nacho, Ascensio isn't the greatest CB, and can presumably make only an OK L/R back in an emergency, but he seems to have the fighting spirit and pace that made Nacho able to come in and do a job when needed. Of course, Nacho eventually gained enough experience to become a very fine CB, but that was after a decade learning from the best.\n\nNacho is a horribly underrated player for RM, but players like him who are able to patiently wait and them come in across the backline are generally undervalued in the football world.",
        "upvotes": 53,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ppdt50/i_hope_asencio_becomes_the_new_nacho/"
    },
    {
        "id": "1povurp",
        "author": "BlazingFirey",
        "title": "\"Get this bum out of my club\" vs \"Starboy who can do no wrong\"",
        "content": "",
        "upvotes": 369,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7s1mzl71ir7g1.jpeg?auto=webp&amp;s=34565b4c59e40a622e86fcfd7fc6525a2b46d35b"
        },
        "permalink": "/r/realmadrid/comments/1povurp/get_this_bum_out_of_my_club_vs_starboy_who_can_do/"
    },
    {
        "id": "1ppplqg",
        "author": "Static_Final",
        "title": "[FEM] Real Madrid draw Paris FC in the WUCL knockout play offs",
        "content": "Real Madrid will need to take on Paris FC to continue in the champions league. We struggled against them and only salvaged a point in the dying seconds. After how we played last night we need to get more clinical in front of goal. \n\nShould we beat Paris FC, we will be up against Barcelona in the Quarter Finals.",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ppplqg/fem_real_madrid_draw_paris_fc_in_the_wucl/"
    },
    {
        "id": "1poyzy2",
        "author": "o6ohunter",
        "title": "It’s so funny seeing the meltdown from Barca fans over the FIFA Team of the Year",
        "content": "“Where’s Raphinha?!?” “Why no Raphinha?!” “Jude there but no Raphinha, Madrid PR is unbeatable”\n\nThey spent all that time and energy trolling Vini about the b’dOr just for their Brazillian to get snubbed lmao you can’t make this up. Maybe if you guys spent the year propping him up instead of Yamal, maybe he would’ve made it.",
        "upvotes": 185,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1poyzy2/its_so_funny_seeing_the_meltdown_from_barca_fans/"
    },
    {
        "id": "1pp4kz6",
        "author": "basilkurian247",
        "title": "📋✅ Our starting XI! 🆚 Talavera",
        "content": "",
        "upvotes": 94,
        "comments": 107,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pp4kz6/our_starting_xi_talavera/"
    },
    {
        "id": "1pp120j",
        "author": "de_lft",
        "title": "Real Madrid availability tracker 25/26",
        "content": "Copied the idea from someone and added some more (relevant?) things to it. I will probably update this monthly or something, incase you spot mistakes or have ideas on how to improve this please let me know (e.g. removing the minutes, using a different colour for subbed in/off etc)\n\nLight green = Played  \nDark green = Benched  \nYellow = Didn't travel with the team  \nOrange = Subbed off due to injury  \nRed = Injured  \nBlack = Playing for a different team \n\nSource: Transfermarkt and FotMob",
        "upvotes": 83,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e36bpmfxjs7g1.jpeg?auto=webp&amp;s=9e49499b390d2466bc1f618a428c530d3e8c7ee4"
        },
        "permalink": "/r/realmadrid/comments/1pp120j/real_madrid_availability_tracker_2526/"
    },
    {
        "id": "1pp2e40",
        "author": "scoreboard-app",
        "title": "Match Thread: CF Talavera de La Reina vs Real Madrid Live Score | Copa del Rey 25/26 | Dec 17, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pp2e40)",
        "upvotes": 61,
        "comments": 3031,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pp2e40/match_thread_cf_talavera_de_la_reina_vs_real/"
    },
    {
        "id": "1poso1z",
        "author": "TheFeatherDiaries",
        "title": "Xabi Alonso : '' Will field a competitive and reliable team against Talavera so we can advance .\"",
        "content": "",
        "upvotes": 119,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L-GM-wzEnZPNiKDoiJmRp1RIRbkVXj31OoTt7rQ9icE.jpeg?auto=webp&amp;s=88325a5c3be0750f39753267b3de4f7740d2f9a6"
        },
        "permalink": "/r/realmadrid/comments/1poso1z/xabi_alonso_will_field_a_competitive_and_reliable/"
    },
    {
        "id": "1poqw1a",
        "author": "feudballfiles",
        "title": "El Clasico Has Lost It's Edge",
        "content": "SOURCE (FULL DOCUMENTARY): https://youtu.be/-mMNac3IApw\nThe iconic Spanish football rivalry has lost its edge due to the departure of its superstars, who elevated the clash between the two giants to unprecedented heights. Without them, matches have become less frequent and intense, with other teams gaining prominence in Spanish football. Recent performances by both teams have been inconsistent, and off-field controversies, like the Negreira case, have added complexity to the rivalry. Although it still captivates audiences worldwide, it may take time to regain its former glory.",
        "upvotes": 143,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5a5h306vzp7g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1poqw1a/el_clasico_has_lost_its_edge/"
    },
    {
        "id": "1pp4jop",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Twente (away) | Women's CL Last Match Day",
        "content": "",
        "upvotes": 16,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k6syi02h8t7g1.jpeg?auto=webp&amp;s=c48fb85990b96cb4afd4c049979591d88e460757"
        },
        "permalink": "/r/realmadrid/comments/1pp4jop/fem_our_starting_xi_against_twente_away_womens_cl/"
    },
    {
        "id": "1poct93",
        "author": "IcefoxX5",
        "title": "Marcelo watches his son Enzo get subbed on for his first minutes for Castilla vs. Man City",
        "content": "",
        "upvotes": 686,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j1gmlv6lmm7g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1poct93/marcelo_watches_his_son_enzo_get_subbed_on_for/"
    },
    {
        "id": "1po8g9j",
        "author": "AlekhineAl",
        "title": "“Sir, here’s your worth 60,000 euros gift pack!”",
        "content": "",
        "upvotes": 793,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7s17m0cusl7g1.jpeg?auto=webp&amp;s=84de57124dc859d3e4e6d65eb29f66421b5cd907"
        },
        "permalink": "/r/realmadrid/comments/1po8g9j/sir_heres_your_worth_60000_euros_gift_pack/"
    }
]