[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1q4huk5",
        "author": "Mental_Plane6451",
        "title": "Situazione senzatetto",
        "content": "Ciao a tutti,\nSolo io ho notato sempre più persone che fuori dai supermercati chiedono cibo?\nNon chiedono neanche soldi ma direttamente pane e tonno. E i senzatetto sono sempre messi peggio, con piedi o denti marci\nSiccome non riesco a dirgli di no, ho fatto due chiacchiere con uno , mi ha detto che i dormitori sono pieni ed è difficine trovare posto. \n\nE niente volevo chiedere, se qualcuno ha conoscenza del mondo del volontariato, se mi sa dire di com'è la situazione a Torino, se mi sa dire come funziona per un senzatetto, e se è vero che si fa fatica a trovare posto per dormite o del cibo.",
        "upvotes": 33,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1q4huk5/situazione_senzatetto/"
    },
    {
        "id": "1q4n2jt",
        "author": "lebmont98",
        "title": "Intervento per cataratta🩺👁️",
        "content": "Ciao a tutti! \nDa un paio di giorni sto soffrendo di cataratta all’occhio destro. 👁️🚫\nVorrei chiedere per chi ci ha sofferto:\n- consigliate un intervento nel pubblico(asl oftalmico a Torino) o nel privato? \n- quello che mi preme di più: i COSTI per l’operazione? \n- ho letto che comprende anche la cura per l’eventuale miopia: ciò va ad incidere sui costi? Intendo dire, ho la possibilità di NON farmi curare la miopia perchè attualmente non dispongo di molti soldi?\nPurtroppo, né il mio medico di base né l’operatore per la prenotazione al CUP mi hanno saputo rispondere.🥲🤷🏻‍♂️\n\nVi ringrazio in anticipo per l’attenzione. 👋\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q4n2jt/intervento_per_cataratta/"
    },
    {
        "id": "1q4qfuf",
        "author": "wisefun22",
        "title": "Piscina Torino zona barriera?",
        "content": "Ciao a tutti/e\n\nMi sapete consigliare una bella piscina in Torino per rimettermi in forma quindi con qualche corso per adulti decente, e sopratttutto dove posso farmi la doccia nuda? non sopporto il divieto del costume. grazie",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q4qfuf/piscina_torino_zona_barriera/"
    },
    {
        "id": "1q3t5r5",
        "author": "ISO_Dreamer",
        "title": "Uno scatto dalla basilica di Superga",
        "content": "Ciao community! \nScatto molto frequentemente con la mia mirrorless, nella mia amata Torino.\nVorrei quindi presentarmi con una foto realizzata la scorsa settimana.",
        "upvotes": 185,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ac5yvc8oscbg1.jpeg?auto=webp&amp;s=3cd4e4185afb9291e12bbc119b9eb947b9b3a26b"
        },
        "permalink": "/r/torino/comments/1q3t5r5/uno_scatto_dalla_basilica_di_superga/"
    },
    {
        "id": "1q4iepm",
        "author": "SimoSian93",
        "title": "Uscite ShakeUp Torino 2k26",
        "content": "Queste sono le prime uscite del 2026 organizzate da ShakeUp Torino, il gruppo Whatsapp creato per fare nuove amicizie in città e provincia (senza secondi fini, senza doversi scrivere a chissà che, senza nulla di strano). Se siete interessati, volete unirvi al gruppo e magari già ad una di queste uscite, contattatemi qua in privato o meglio ancora seguite la pagina Instagram @shakeuptorino e contattatemi lì in DM ✌🏻😁",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k2b8gohleibg1.jpeg?auto=webp&amp;s=e089f27b07cb13bc17fb5ebd39616d45b59ea839"
        },
        "permalink": "/r/torino/comments/1q4iepm/uscite_shakeup_torino_2k26/"
    },
    {
        "id": "1q4jpgl",
        "author": "kit_kat1210",
        "title": "Dove imparare il tedesco a Torino",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q4jpgl/dove_imparare_il_tedesco_a_torino/"
    },
    {
        "id": "1q4m1s5",
        "author": "eclipsx-e",
        "title": "signore ambulante che vende orecchini",
        "content": "Circa un anno fa sono andata a torino (primavera 2025) e sotto i portici di piazza san carlo ho incontrato un signore con due grandi tele piene di orecchini STUPENDI. tra l’altro a un prezzo molto basso e la qualità fantastica. shout out a lui, e mi chiedevo se qualcun altro lo abbia mai incontrato e se è fisso a torino, con degli orari o dei giri. Io non sono di torino e non l’ho mai più incontrato, vado a torino occasionalmente e non ho avuto modo di “cercarlo”. quindi se qualcuno ha delle informazioni su di lui ne sarei davvero grata. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q4m1s5/signore_ambulante_che_vende_orecchini/"
    },
    {
        "id": "1q4h2h8",
        "author": "Pure-Meat4016",
        "title": "I want to develop my Italian, where can I find a good community?",
        "content": "I would like to hangout and also develop my Italian. Do you know any groups where I can do this?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q4h2h8/i_want_to_develop_my_italian_where_can_i_find_a/"
    },
    {
        "id": "1q4jfct",
        "author": "Conan5678",
        "title": "Amicizie per praticare 🇪🇸🇫🇷",
        "content": "Ciao, vivo a Torino e sto cercando nuove amicizie con cui praticare spagnolo e francese in modo informale, semplicemente chiacchierando e passando del tempo insieme. In francese ho circa un livello B1, mentre con lo spagnolo sono quasi all’inizio. Sono madrelingua italiano e rumeno, quindi se qualcuno ha piacere di praticare l’italiano posso dare volentieri una mano. Sono più da cose tranquille che da attività troppo movimentate. Se vi va, potete scrivermi in privato. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q4jfct/amicizie_per_praticare/"
    },
    {
        "id": "1q4icn8",
        "author": "siv_lab",
        "title": "Consigli su corsi sportivi",
        "content": "Ciao a tutta la community\n\nPer il 2026 avrei intenzione di iniziare qualche nuova attività per spezzare un po’ la solita routine casa-lavoro-palestra :)\n\nVorrei concentrarmi su (una delle) attività che mi incuriosiscono e che non ho mai praticato seriamente, in particolare:\n- Corso di tennis livello base per adulti\n- Corso di boxe livello base per adulti\n- Corso di go-kart livello base per adulti\n\nPreferibilmente orari serali (prima delle 18:00 per me è molto difficile), no particolari vincoli nel weekend, senza agonismo o pretese elevate, con prezzi non troppo elevati possibilmente :D\n\nZone a me comode (casa-lavoro): Lingotto, Mirafiori Sud, Borgo Filadelfia o Cenisia. Ma sono auto munito quindi non ho nessun problema nel muovermi un po’ ovunque. \n\n\nAvete consigli da darmi o esperienze dirette su questo tipo di corsi?\n\n\nGrazie in anticipo a chi vorrà condividere la propria esperienza!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q4icn8/consigli_su_corsi_sportivi/"
    },
    {
        "id": "1q4gejr",
        "author": "Full_Prize_8462",
        "title": "Looking for Gay Friends",
        "content": "Hi, I am a 25 year old male from the LGBTQ+ community. I am interested in making gay friends for conversation, friendship, and meaningful connection. Respect and comfort matter to me.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q4gejr/looking_for_gay_friends/"
    },
    {
        "id": "1q404x3",
        "author": "arminredditer",
        "title": "Luoghi simili ad un'aula studio per poter lavorare?",
        "content": "Stavo cercando un posto (o categoria di posti) a Torino per poter lavorare al PC, idealmente come in un'aula studio (non sono più studente da un pò, non so se posso effettivamente usare un'aula studio). Consigli?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q404x3/luoghi_simili_ad_unaula_studio_per_poter_lavorare/"
    },
    {
        "id": "1q3yhtl",
        "author": "consulent-finanziar",
        "title": "Nel caso passassi per Torino, cosa dovrei visitare assolutamente?",
        "content": "",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1q3yhtl/nel_caso_passassi_per_torino_cosa_dovrei_visitare/"
    },
    {
        "id": "1q417jz",
        "author": "HoustonsAwesome",
        "title": "Ho bisogno di babysitter per un settimana. Avete qualche consiglio?",
        "content": "Viaggerò a Torino per un settimana a Maggio con il mio bambino di due anni. Vorrei trovare un babysitter per tre ore ogni giorno. Conoscete chiunque? Parlo l’inglese ma solo  l’italiano è va bene. Sto imparando l’italiano. Grazie. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q417jz/ho_bisogno_di_babysitter_per_un_settimana_avete/"
    },
    {
        "id": "1q3ry79",
        "author": "insulaTropicalis",
        "title": "Colonia felina data alle fiamme a Nichelino",
        "content": "[https://www.quotidianopiemontese.it/2026/01/03/devastata-una-colonia-felina-a-nichelino/](https://www.quotidianopiemontese.it/2026/01/03/devastata-una-colonia-felina-a-nichelino/)\n\n[https://www.torinosud.it/animali/nichelino-colonia-felina-bruciata-capodanno-denuncia-33788](https://www.torinosud.it/animali/nichelino-colonia-felina-bruciata-capodanno-denuncia-33788)\n\nOgni aiuto è ben accetto. Non solo donazioni, ma anche aiutare a cercare i gatti ancora mancanti e a farli tornare a casa.",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/slKg32pNNfRNZ9VK8P1LQO1IuR3s7qYsNnwjRroO4HA.jpeg?auto=webp&amp;s=8b5894e688a745b4c3cf33b5cf7e899af9d71713"
        },
        "permalink": "/r/torino/comments/1q3ry79/colonia_felina_data_alle_fiamme_a_nichelino/"
    },
    {
        "id": "1q3yent",
        "author": "ConstructionAny6977",
        "title": "Posti dove studiare domani",
        "content": "Sapete se ci sono aule studio, bar comodi o simili aperti domani 5 gennaio?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q3yent/posti_dove_studiare_domani/"
    },
    {
        "id": "1q3wngg",
        "author": "JXS9981",
        "title": "Visiting Turin",
        "content": "Some Friends and I are visiting Turin in a couple of weeks. Are there any good places to watch English football? Some in our group are hoping to catch the Sunderland game on TV. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q3wngg/visiting_turin/"
    },
    {
        "id": "1q3n8mn",
        "author": "Max-Max00",
        "title": "People for language exchange 🇫🇷/🇮🇹",
        "content": "Hey everyone! \n\nI've been learning French for 3 months now and I'm looking for someone in Turin to practice conversation with.\n\n​I'm a native Italian speaker and also fluent in English, so I can help you with both in return. Whether you're a native French speaker or just another learner like me, let's get in touch!\n\n​Comment or DM me if you're interested in meeting up for a chat. If we're a decent number we can maybe also organise a group!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q3n8mn/people_for_language_exchange/"
    },
    {
        "id": "1q3v6a4",
        "author": "Atronem",
        "title": "Buono DOUGLAS in vendita – 200€ per 160",
        "content": "Zona Torino o Provincia di Cuneo\n\nBuongiorno a tutti,\nSpero di trovarti bene.\n\nMi è stato regalato un buono DOUGLAS da 200€ per il giorno della mia laurea.\n\nLo vendo a 160€ poiché preferisco avere i contanti.\n\nConsegna a mano in zona oppure invio digitale.\n\nGrazie e buona giornata!\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q3v6a4/buono_douglas_in_vendita_200_per_160/"
    },
    {
        "id": "1q3tgak",
        "author": "KindheartednessRich1",
        "title": "Quanto avete speso per la vostra festa di laurea?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q3tgak/quanto_avete_speso_per_la_vostra_festa_di_laurea/"
    },
    {
        "id": "1q3t3w6",
        "author": "Lovelydayinbaltimore",
        "title": "C-Print (stampa cromogenica) a Torino?",
        "content": "qualcuno conosce una tipografia a Torino che sia specializzata in stampa foto in maniera professionale destinata alla fine art? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q3t3w6/cprint_stampa_cromogenica_a_torino/"
    },
    {
        "id": "1q3q64h",
        "author": "Dapper_Location_6257",
        "title": "Studiare insieme a Torino",
        "content": "Mi devo preparare a superare esame OCF, sono di Torino e vorrei condividere con qualcuno queste settimane di studio intenso. Mi farebbe piacere incontrare qualcuno con cui poter studiare e concentrarmi e nel frattempo conoscere anche nuove persone anche con necessità di studio di altro tipo. Sarebbe bello creare un gruppo o organizzarsi. Fatemi sapere :) ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q3q64h/studiare_insieme_a_torino/"
    },
    {
        "id": "1q31czp",
        "author": "Extension-One-2771",
        "title": "Collana rubato dal collo",
        "content": "Ciao! \n\nC'era capodanno e purtroppo qualche cazzi mi hanno rubato una collana dal mio nonno. Eravamo in gruppo, ognuno l'ha visto e dopo cera una persecuzione di quasi un kilometro. Ho preso una giaccia di una persona ma dopo l'ho lasciato su terra, perché volevo essere più pronto. I carabinieri hanno visto tutto, ma fatto niente, anche la polizia civile... Ho già fatto un annuncio dalla polizia, ma mi sembra che non fanno niente... Ho fatto qualche ricerca da solo e trovato una telecamera di Bistrot Torino che ha filmato tutto. Purtroppo il capo non mi può fare vedere la video, solo la polizia. So il tempo esatto, che le cose devono visibile su video ma non posso fare assolutamente niente... volevo andare a la polizia oggi per dirlo questa cosa di telecamera, ma loro hanno detto che devo andare ai carabinieri ---&gt; loro hanno detto che questo è il lavoro dalla polizia... 🥁🙏\n\nSono molto triste e un anche arrabbiato ai officiali. Scusate il mio italiano brutto, sono dalla Germania e faccio un tirocinio qua. Tanta grazie a tutti torinesi e torinese, generalmente la gente è molto molto simpatica in questa città!!\n\nCosa posso fare? Grazie per il vostro aiuto!! 🙃\n\n",
        "upvotes": 31,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1q31czp/collana_rubato_dal_collo/"
    },
    {
        "id": "1q3xfm7",
        "author": "Effective_Hall_7659",
        "title": "Can someone hook me up",
        "content": "Coming to Turin 9. 10. of january if anybody knows anyone who can hook me up with some grass dm me!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q3xfm7/can_someone_hook_me_up/"
    },
    {
        "id": "1q30e6i",
        "author": "daccia",
        "title": "Sale per feste",
        "content": "sto organizzando un compleanno e sono puntualmente finito con troppi invitati per lo spazio che ho a casa\nsapete di qualche salone/stanza in affitto per una 40ina di persone e possibilmente con un budget limitato? \ngrazieeee",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1q30e6i/sale_per_feste/"
    },
    {
        "id": "1q37u6f",
        "author": "External_Junket_1413",
        "title": "Weight lifting",
        "content": "Hey all! I’m relocating to Torino with my wife in March. Hoping someone might have a recommendation for a good gym. Looking for the most diverse selection of free and assisted weights. Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q37u6f/weight_lifting/"
    },
    {
        "id": "1q2vg3q",
        "author": "Imaginary-Ice623",
        "title": "Sacra di San Michele",
        "content": "Hello. I'm visiting Torino tomorrow and I want to visit the Sacra San Michele, although I hadn't planned it. Does anybody know how I can get there? Apparently the train and navetta from Avignana is not available in January. Could I get a taxi from Avignana or are there local busses that take you. Thanks in advance.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1q2vg3q/sacra_di_san_michele/"
    },
    {
        "id": "1q30c6k",
        "author": "Then-Task-6796",
        "title": "Parcheggio vicino al centro per visitare la città",
        "content": "Ciao .\n\nDomani sarò a Torino per visitare la città, mi chiedevo quale parcheggio a pagamento mi consigliate per visitare la città, l’ideale sarebbe poterlo raggiungere facilmente (senza dover girare in vietate strette del centro città) ed essere abbastanza vicini al centro per andare a piedi! Meglio se un parcheggio moderno (non quei sotterranei nei palazzi con rampe improbabili e curve a gomito perché ho una macchina lunga e ingombrante)grazie!  ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1q30c6k/parcheggio_vicino_al_centro_per_visitare_la_città/"
    }
]