[
    {
        "id": "1lx8haf",
        "author": "InventionAMA",
        "title": "Hey r/movies! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional, experimental feature film INVENTION, that's now streaming on Mubi. You might also know Callie from La La Land, Alien: Covenant, Blair Witch, Under the Silver Lake, The Endless. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional feature INVENTION which riffs on real circumstances to explore the relationship between fantasy and grief -- both in personal life and how it reflects externally in America today. The film deals with weird medicine, losing dads and the emotional logic of conspiracy theory against the bucolic, literary backdrop of the Berkshires in the fall.\n\nSynopsis: In the aftermath of a conspiracy-minded father’s unexpected death, his daughter receives his patent for an experimental healing device. Featuring archive from actress Callie Hernandez's actual late father, INVENTION explores the process of grieving a complicated parent, and the filmmaking itself becomes a part of the process.\n\nTrailer: [https://www.youtube.com/watch?v=TFtolT9DE6M](https://www.youtube.com/watch?v=TFtolT9DE6M)\n\nWatch on MUBI: [https://mubi.com/en/us/films/invention-2024](https://mubi.com/en/us/films/invention-2024)\n\nAsk us anything! Back at 3 PM ET to answer questions.\n\nBios:\n\nCourtney Stephens is a writer/director of four features and numerous short films. Terra Femme, composed of amateur travel footage shot by women in the early 20th century, was a New York Times critic’s pick and has toured widely as a live performance. The American Sector (with Pacho Velez) follows slabs of the Berlin Wall installed around the US. John Lilly and the Earth Coincidence Control Office (with Michael Almereyda) explores the life of psychedelics pioneer John C. Lilly. Her films have been exhibited at MoMA, The National Gallery of Art, The Barbican, Walker Art Center, and film festivals including the Berlinale, Locarno, Rotterdam, Viennale, New Directors/New Films, Visions Du Réel, Thessaloniki, IDFA, BAFICI, True/False, Hong Kong, and the New York Film Festival. She is the recipient of a Guggenheim Fellowship, a Fulbright Scholarship, and grants from the Sloan Foundation and the Foundation for Contemporary Art.\n\nCallie Hernandez is an actress, writer and filmmaker. Her first film was Terrence Malick’s Song to Song followed by a decade of work as an actress. She is known for Ridley Scott's Alien: Covenant, Damien Chazelle's La La Land, A24’s Under the Silver Lake, HBO Max's The Flight Attendant, and Pete Ohs’ JETHICA. Upcoming work includes: Rachel Sennott’s Untitled Comedy Series, Albert Birney’s OBEX and James N. Kienitz Wilkins’ The Misconceived. In 2023, she founded an in-house film studio which yiel",
        "upvotes": 26,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4102icaa9cf1.png?auto=webp&amp;s=8014786121eba690da8caeb2eac2d9c1bf0223b7"
        },
        "permalink": "/r/movies/comments/1lx8haf/hey_rmovies_were_courtney_stephens_and_callie/"
    },
    {
        "id": "1lwhf9p",
        "author": "FMarryKillAMA",
        "title": "Hi r/movies. Laura Murphy here. Director of the new comedy-thriller F*** MARRY KILL- which is now streaming everywhere and stars Lucy Hale &amp; Virginia Gardner. I've also directed GirlCode, Awkwafina is Nora From Queens, Cursed Friends. Ask me anything!",
        "content": "Hi reddit,\n\nI'm Laura Murphy, director of **F\\*\\*\\* Marry Kill**, now streaming everywhere (and recently released on Hulu). Here to answer your questions.\n\n*Here's the trailer:*\n\n[https://www.youtube.com/watch?v=9hxuNfoWNs0](https://www.youtube.com/watch?v=9hxuNfoWNs0)\n\n*Synopsis:*\n\nThrust into the dating app world by her best friends, true-crime junkie Eva Vaugh suddenly finds herself at the center of a real murder case. As new details come to light, she soon realizes that one of the three men she's dating could be the infamous Swipe Right Killer.\n\n*Cast:*\n\n* Lucy Hale\n* Virginia Gardner\n* Brooke Nevin\n\nAsk me anything! I'm back at 5 PM ET tomorrow (Friday 7/11) to answer your questions!",
        "upvotes": 28,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oy1e35fqr2cf1.png?auto=webp&amp;s=f07167761a185658e39e9db6666dd859fec93980"
        },
        "permalink": "/r/movies/comments/1lwhf9p/hi_rmovies_laura_murphy_here_director_of_the_new/"
    },
    {
        "id": "1lx94qe",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson",
        "content": "",
        "upvotes": 27332,
        "comments": 1055,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucgxqrj4f9cf1.jpeg?auto=webp&amp;s=e70feeea4ff4c5da7daca9bc2fa77edadc14e29e"
        },
        "permalink": "/r/movies/comments/1lx94qe/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lxk6jj",
        "author": "MarvelsGrantMan136",
        "title": "Bryan Cranston Addresses ‘Lone Wolf’ Troubles, Vows Not To Film Or Promote Movie Until Every Cast And Crew Member Is Paid Back In Full",
        "content": "",
        "upvotes": 2417,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n9XgMhGqDDl7Fp6XSMyvs-OeHqwiYUAGhak_iZm92CI.jpeg?auto=webp&amp;s=a0fbc8223daa852206e06336e4cb5cfc7f37c4af"
        },
        "permalink": "/r/movies/comments/1lxk6jj/bryan_cranston_addresses_lone_wolf_troubles_vows/"
    },
    {
        "id": "1lxcgsm",
        "author": "BunyipPouch",
        "title": "Leonardo DiCaprio’s ‘We Are Guardians’ Documentary Raises $1 Million for Rainforest Preservation Ahead of Theatrical Run - The films is touring nationally and spotlights efforts by Indigenous leaders to protect the Brazilian Amazon amid invasion and deforestation.",
        "content": "",
        "upvotes": 1480,
        "comments": 312,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ayrBSbiKAo7_yRufXmofGeeuTqzztYgt6GKdk1x1Xoc.jpeg?auto=webp&amp;s=e908adec79eae5992239dbba02c54759fb23ac55"
        },
        "permalink": "/r/movies/comments/1lxcgsm/leonardo_dicaprios_we_are_guardians_documentary/"
    },
    {
        "id": "1lxkdj5",
        "author": "MiserableSnow",
        "title": "California’s Expanded Tax Credit Now Covers Animation",
        "content": "",
        "upvotes": 297,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/puAm1GASoXbXAO1tHU6M43-VDwgTw1prLNOXwgegQao.jpeg?auto=webp&amp;s=19dc9195a23a38af31f65f25880d91f7fdee688f"
        },
        "permalink": "/r/movies/comments/1lxkdj5/californias_expanded_tax_credit_now_covers/"
    },
    {
        "id": "1lxhuin",
        "author": "MarvelsGrantMan136",
        "title": "Legendary Is Mulling Acquisition of Lionsgate Studios",
        "content": "",
        "upvotes": 350,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8fZoEDywEHURXmsEsEG8ngfqGijqtkolKQIC1Y4rP00.jpeg?auto=webp&amp;s=1cc82c4c60454c22dc813bcadb6d223cce0ff14d"
        },
        "permalink": "/r/movies/comments/1lxhuin/legendary_is_mulling_acquisition_of_lionsgate/"
    },
    {
        "id": "1lxk0aw",
        "author": "CresidentBob",
        "title": "What random joke in a movie makes you crack up every single time you watch it?",
        "content": "For me it’s this scene in Blazing Saddles\n\nhttps://youtu.be/SkKVLGO9Wjc?si=_GUTFCVsLZD8TwK3\n\nIt’s so damn funny. The whole town is getting destroyed and all this guy is worried about is his suit getting muddy. The more I think about it the funnier it is. Classic Mel Brooks joke but for some reason I laugh so hard every time. ",
        "upvotes": 257,
        "comments": 764,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KyNJtRdufEHpXmwHUqzUmac2EyQOs2ax-qUn--8gptY.jpeg?auto=webp&amp;s=706f5944018a6923ab9a58d9ab595a8b9fe021cc"
        },
        "permalink": "/r/movies/comments/1lxk0aw/what_random_joke_in_a_movie_makes_you_crack_up/"
    },
    {
        "id": "1lx753c",
        "author": "Conscious-Quarter423",
        "title": "Mr. Landau shares some profound insights in this interview with The Actors Studio.",
        "content": "",
        "upvotes": 517,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ifgorsx509cf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lx753c/mr_landau_shares_some_profound_insights_in_this/"
    },
    {
        "id": "1lxeq89",
        "author": "dvorakoa",
        "title": "What are some films where you can tell everyone had fun on set?",
        "content": "Just watched Walk Hard: The Dewey Cox Story and I could tell everyone enjoyed themselves filming this movie. John C. Reilly even said he learned to play guitar and wrote many of the songs for the film out of pure desire to create. You don't get that kind of input if someone doesn't care and is just there for a paycheck.\n\nSo what are some other examples of movies where you can FEEL everyone from the crew to the actors *cared* and that passion is palpable on screen. Not just comedy/light hearted movies either. When watching the Revenant I was like 'you don't get up at 5am in freezing tempratures for months just for the hell of it. These guys must truly LOVE what they do'.",
        "upvotes": 127,
        "comments": 203,
        "media": null,
        "permalink": "/r/movies/comments/1lxeq89/what_are_some_films_where_you_can_tell_everyone/"
    },
    {
        "id": "1lx4e8d",
        "author": "Fun_Molasses5215",
        "title": "Drag Race stars reveal all their A Star Is Born scenes were originally completely cut before Lady Gaga personally intervened",
        "content": "",
        "upvotes": 479,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p7lMK2JB68JX8YBTKc0hHaupA71BrsfvAA0s0mYqlBQ.png?auto=webp&amp;s=93af44f7e52fe7fc52ee9c904b35757862d69d65"
        },
        "permalink": "/r/movies/comments/1lx4e8d/drag_race_stars_reveal_all_their_a_star_is_born/"
    },
    {
        "id": "1lxcbtg",
        "author": "NoCulture3505",
        "title": "Comic-Con 2025 Schedule: ‘Star Trek,’ the Toxic Avenger and George Lucas’ First-Ever Appearance",
        "content": "",
        "upvotes": 163,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wHxwMOo-9DXDagU-j7fTX_kwmV6r0cDUtE4er9_VtWY.png?auto=webp&amp;s=86c77c4615e023474a89cf42fa37f645beace4c2"
        },
        "permalink": "/r/movies/comments/1lxcbtg/comiccon_2025_schedule_star_trek_the_toxic/"
    },
    {
        "id": "1lwutny",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Superman (2025) [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/hs20GGGIZ6wg)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/hs20GGGIZ6wg)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**\nSuperman (David Corenswet) returns as a fully formed hero, dropping into an international crisis where his actions—like stopping a dangerous global conflict—spark both admiration and controversy. As he confronts Lex Luthor’s schemes and defends democratic values, Lois Lane (Rachel Brosnahan) investigates deeper political tensions. The film also features cameos from Guy Gardner (Nathan Fillion), Hawkgirl (Isabela Merced), Mister Terrific (Edi Gathegi), and Metamorpho (Anthony Carrigan), all leading up to a broader DC Universe introduction.\n\n**Director**\nJames Gunn\n\n**Writer**\nJames Gunn\n\n**Cast**\n\n* David Corenswet as Clark Kent / Superman\n* Rachel Brosnahan as Lois Lane\n* Nicholas Hoult as Lex Luthor\n* Nathan Fillion as Guy Gardner / Green Lantern\n* Isabela Merced as Kendra Saunders / Hawkgirl\n* Edi Gathegi as Michael Holt / Mister Terrific\n* Anthony Carrigan as Rex Mason / Metamorpho\n* Skyler Gisondo as Jimmy Olsen\n* Sara Sampaio as Eve Teschmacher\n* María Gabriela de Faría as Angela Spica / The Engineer\n* Wendell Pierce as Perry White\n* Alan Tudyk, Pruitt Taylor Vince, Neva Howell, and others in supporting roles\n\n**Rotten Tomatoes**: [83%](https://www.rottentomatoes.com/m/superman_2025)\n\n**Metacritic**: [68](https://www.metacritic.com/movie/superman-2025/)\n\n**VOD**\nIn theaters July 11, 2025\n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=uhUht6vAsMY)\n\n---",
        "upvotes": 2649,
        "comments": 4585,
        "media": null,
        "permalink": "/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/"
    },
    {
        "id": "1lwezvl",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Ethan Coen's 'Honey Don't' - The film follows a lesbian private detective who investigates a questionable church and its leader.",
        "content": "",
        "upvotes": 14373,
        "comments": 988,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q46m3mrja2cf1.jpeg?auto=webp&amp;s=fcbaafdb1b6caabc30b3a6aef78e67d84e7a500e"
        },
        "permalink": "/r/movies/comments/1lwezvl/official_poster_for_ethan_coens_honey_dont_the/"
    },
    {
        "id": "1lwunjn",
        "author": "These_Feed_2616",
        "title": "Who’s an actor that you don’t think is a good actor at all, that you really liked in one specific role or two?",
        "content": "You never liked them in any film except for one or two? For me, it’s Mark Wahlberg. I really don’t think he’s a good actor at all, everything I’ve seen him in, he’s been terrible, Flight Risk, The Happening, Planet Of The Apes etc. however sometimes he gets typecast in a role that just works for him, and for me, that film is The Departed, he genuinely worked well in that film, and if that was the only film I saw him in, I would think he’s a great actor.",
        "upvotes": 1223,
        "comments": 2094,
        "media": null,
        "permalink": "/r/movies/comments/1lwunjn/whos_an_actor_that_you_dont_think_is_a_good_actor/"
    },
    {
        "id": "1lwz2s7",
        "author": "Intelligent_Barber47",
        "title": "Sunshine (2007) is fucking amazing.",
        "content": "This movie is just plain fun. Cillian Murphy kills it as kappa, our main protagonist. So many cool ideas for a film in this genre like the viewing room where we see a man get cooked alive by the sun. The space craft they're in has one of the coolest designs I've ever seen in a space/scifi film. Personally, I fully believe that the film stuck the landing as well. However the shaky cam at the end is nauseating and there's a certain bit towards the end that I rolled my eyes at. But other than that I really don't have very many other complaints this shit rocks. \n\nIf you haven't seen Sunshine and you're a fan of scifi I highly highly recommend it. This is one of the greatest films to get high to as well if you partake. I was in awe during multiple scenes on my first watch after smoking a bowl. Don't go in expecting a super realistic and grounded space film. Just go in expecting a fun ass movie and you won't be dissapointed. ",
        "upvotes": 552,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1lwz2s7/sunshine_2007_is_fucking_amazing/"
    },
    {
        "id": "1lx1ecp",
        "author": "Snowcap2120",
        "title": "What’s your favorite performance where a celebrity plays “themselves,” but a hyperbolic/caricatured version?",
        "content": "Some of my faves are LeBron James in Trainwreck and John Malkovich in Being John Malkovich. Dennis Quaid made me laugh in Strays. Bruce Willis in Ocean’s 12? For movies in particular it’s a difficult parameter, there are plenty of examples in television but movie options are kinda slim, I’m running out of filler words…I dunno, how would y’all get to the 300-character post limit?",
        "upvotes": 341,
        "comments": 388,
        "media": null,
        "permalink": "/r/movies/comments/1lx1ecp/whats_your_favorite_performance_where_a_celebrity/"
    },
    {
        "id": "1lxnwk9",
        "author": "ExistingMarzipan2422",
        "title": "What is the most “bro” movie of all time?",
        "content": "I am going on a bachelor party soon (something chill like cabin in the woods kind of vibe) and the group wants to have a movie night. Someone suggested ‘Gladiator’ stating “that’s just a bro movie”; this inspired me to ask the question….\n\nWhat is the most “bro” movie of all time? \n\nFor me, I was thinking maybe Saving Private Ryan but would love to hear what the community thinks.\n\nCheers!\n\n",
        "upvotes": 15,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1lxnwk9/what_is_the_most_bro_movie_of_all_time/"
    },
    {
        "id": "1lx2luw",
        "author": "DarlingLuna",
        "title": "What movie is the greatest testament to the power of a director?",
        "content": "90% of the time if I love a movie, I attribute it to the screenplay even more than I do to the direction. The same goes for whenever I hate a movie. What movie, in your opinion, is a testament to the power of a director to elevate the quality of a movie? In other words, a movie that would be nowhere near as good if it were the exact same screenplay in the hands of a far less skilled director. Fire away your recommendations!",
        "upvotes": 212,
        "comments": 256,
        "media": null,
        "permalink": "/r/movies/comments/1lx2luw/what_movie_is_the_greatest_testament_to_the_power/"
    },
    {
        "id": "1lwutxk",
        "author": "LiteraryBoner",
        "title": "Official Throwback Discussion - Scary Movie [SPOILERS]",
        "content": "# As an ongoing project, in 2025 /r/movies will be posting Throwback Discussion threads weekly for the movies that came out this same weekend 25 years ago. As a reminder, Official Discussion threads are for discussing the movie and not for meta sub discussion. \n\n---\n\n**Summary**\nA group of high school students becomes the target of a mysterious killer just one year after they accidentally killed a man and covered it up. A parody of popular horror films of the '90s—especially *Scream* and *I Know What You Did Last Summer*—*Scary Movie* skewers genre tropes with absurd humor, raunchy gags, and pop culture mayhem.\n\n**Director**\nKeenen Ivory Wayans\n\n**Writers**\nShawn Wayans, Marlon Wayans, Buddy Johnson, Phil Beauman, Jason Friedberg, Aaron Seltzer\n\n**Cast**\n\n* Anna Faris as Cindy Campbell\n* Jon Abrahams as Bobby Prinze\n* Shannon Elizabeth as Buffy Gilmore\n* Regina Hall as Brenda Meeks\n* Marlon Wayans as Shorty Meeks\n* Shawn Wayans as Ray Wilkins\n* Lochlyn Munro as Greg Phillippe\n* Dave Sheridan as Doofy Gilmore\n* Cheri Oteri as Gail Hailstorm\n* Kurt Fuller as Sheriff\n* Carmen Electra as Drew Decker\n\n**Rotten Tomatoes**: [53%](https://www.rottentomatoes.com/m/scary_movie)\n**Metacritic**: [48](https://www.metacritic.com/movie/scary-movie)\n\n**VOD**\nAvailable to stream or rent on Prime Video, Apple TV, and other major platforms.\n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=VuNfdQZlkfE)\n\n---",
        "upvotes": 736,
        "comments": 321,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_0kCQ7D7khTLBvKUqPcciR8AyYYTUSQhfSiiljtUnk8.jpeg?auto=webp&amp;s=506ecf8c6a8d3bae61e03217cf83eff0413930d2"
        },
        "permalink": "/r/movies/comments/1lwutxk/official_throwback_discussion_scary_movie_spoilers/"
    },
    {
        "id": "1lxczj7",
        "author": "bostoncrabsandwich",
        "title": "Fight Night: The classic, endless fistfight of John Carpenter's THEY LIVE",
        "content": "",
        "upvotes": 40,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FHy5GyR1pp6y4oviAQjnv1mKUMYJ6Y-gxZolTT2fgfA.jpeg?auto=webp&amp;s=7eda30fbc54d1f21b3176dd85fd95bc2fd5d3e3e"
        },
        "permalink": "/r/movies/comments/1lxczj7/fight_night_the_classic_endless_fistfight_of_john/"
    },
    {
        "id": "1lx5lo9",
        "author": "theironcat",
        "title": "What movie had a terrible trailer but turned out to be amazing?",
        "content": "I’ve skipped so many movies because the trailers made them look bad or cheesy, only to find out later they were actually great. \n\nLike if found the *Edge of Tomorrow* trailer a bit bland and confusing trailer. But the movie turned out to be a clever, action-packed sci-fi gem. What movie had a terrible or misleading trailer but turned out to be amazing once you watched it?",
        "upvotes": 101,
        "comments": 183,
        "media": null,
        "permalink": "/r/movies/comments/1lx5lo9/what_movie_had_a_terrible_trailer_but_turned_out/"
    },
    {
        "id": "1lx8242",
        "author": "Project_Rees",
        "title": "What's the most impressive role shift?",
        "content": "Roles that usually comedic actors play serious characters, vice versa. Or impressive different sexual orientation, different age, gender, different accents/country?\n\nThe one that immediately springs to mind is Robin Williams in One Hour Photo. Such a change to his style and a truly haunting character.",
        "upvotes": 57,
        "comments": 142,
        "media": null,
        "permalink": "/r/movies/comments/1lx8242/whats_the_most_impressive_role_shift/"
    },
    {
        "id": "1lwx1y1",
        "author": "yojoono",
        "title": "Lost in Space (1998) Official 4K Trailer",
        "content": "",
        "upvotes": 361,
        "comments": 172,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/leey81b_T1KRfYJ_uN_Y9uzojk8ZrjaodaSpxm_2sTk.jpeg?auto=webp&amp;s=aecd56536ed2a1d8563e23c4732e7fc5b6ddb18b"
        },
        "permalink": "/r/movies/comments/1lwx1y1/lost_in_space_1998_official_4k_trailer/"
    },
    {
        "id": "1lx7nqh",
        "author": "NoCulture3505",
        "title": "Dianne Wiest &amp; Stockard Channing Returning For ‘Practical Magic 2’; Lee Pace, Maisie Williams, Xolo Maridueña And Solly Mcleod Also Set",
        "content": "",
        "upvotes": 52,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6vr38LLX_h-l0RpY6v5nZNk6b1KKa7k7uHpkYV1QwGQ.jpeg?auto=webp&amp;s=0ea58d464fc1c640a5c899669680ddfadaa8e500"
        },
        "permalink": "/r/movies/comments/1lx7nqh/dianne_wiest_stockard_channing_returning_for/"
    },
    {
        "id": "1lx4wp7",
        "author": "sonorosan",
        "title": "the locations of Perfect days by Wim Wenders",
        "content": "This is a very interesting walk. Wim Wenders did a great job choosing the locations for the movie but while I was watching I thought that the whole Japan is a such interesting place. Every corner could be a perfect frame for a movie. Really love it",
        "upvotes": 72,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/arI5S2CzmWRpWdc9HTPZbsNFaJuYD-QG0Pt58II3dJY.jpeg?auto=webp&amp;s=254a380aa93737847e2944fce15976e9e909dbd1"
        },
        "permalink": "/r/movies/comments/1lx4wp7/the_locations_of_perfect_days_by_wim_wenders/"
    },
    {
        "id": "1lwou9h",
        "author": "MarvelsGrantMan136",
        "title": "Guy Ritchie Exits Amazon MGM Studios ‘Road House 2’",
        "content": "",
        "upvotes": 874,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jwKrm2mywnPSQlGFMXGCMu5UIHBqWbbrxYl0HnClePE.jpeg?auto=webp&amp;s=3ce50feac146452d0cfcea201ec4af81e480ac79"
        },
        "permalink": "/r/movies/comments/1lwou9h/guy_ritchie_exits_amazon_mgm_studios_road_house_2/"
    },
    {
        "id": "1lwgic4",
        "author": "MarvelsGrantMan136",
        "title": "'Pokemon' Voice Actor James Carter Cathcart Dies at 71; Cathcart Was the Voice of Professor Oak, Gary Oak and Team Rocket's James &amp; Meowth",
        "content": "",
        "upvotes": 2286,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/brq3CIC5exlEjXlcJdSUO04Gz2rd6EhgDve9USMG6rQ.jpeg?auto=webp&amp;s=88bc7f5febdfc50c57bf5a185deaa6c279c6c4ea"
        },
        "permalink": "/r/movies/comments/1lwgic4/pokemon_voice_actor_james_carter_cathcart_dies_at/"
    },
    {
        "id": "1lwxkve",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nick Offerman - Thursday 7/17 at 3:00 PM ET - Actor in 'Parks and Recreation', 'Civil War', 'The Last of Us', 'Mission Impossible: The Final Reckoning', 'Dumb Money', 'Devs', 'Dicks: The Musical', 'Sovereign', 'The Founder', and lots more.",
        "content": "",
        "upvotes": 196,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/07ihyrpr86cf1.png?auto=webp&amp;s=0d55b58af7a8595ec4865a5bc934a78c68161b47"
        },
        "permalink": "/r/movies/comments/1lwxkve/amaqa_announcement_nick_offerman_thursday_717_at/"
    },
    {
        "id": "1lwpxyz",
        "author": "MarvelsGrantMan136",
        "title": "Brendan Fraser Dramedy ‘Rental Family’ Sets November 21 Release at Searchlight",
        "content": "",
        "upvotes": 537,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/18gx2PJBVKPgPE2l4b2i41uoOjrZz3CyBNGenmVgc9c.jpeg?auto=webp&amp;s=e52b81e3576679c0b3c33aaf2c4bd73e364b2c62"
        },
        "permalink": "/r/movies/comments/1lwpxyz/brendan_fraser_dramedy_rental_family_sets/"
    },
    {
        "id": "1lxh2dz",
        "author": "KillerCroc1234567",
        "title": "Esmé Creed-Miles Joins Daisy Edgar-Jones in ‘Sense and Sensibility’ as Marianne",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G0s58Ctl7opn71khMMZr11NGcV2BpD3yVfSZ_kdrZww.jpeg?auto=webp&amp;s=33d9b150397dae882086e02b80c98bc9441c350d"
        },
        "permalink": "/r/movies/comments/1lxh2dz/esmé_creedmiles_joins_daisy_edgarjones_in_sense/"
    },
    {
        "id": "1lxc580",
        "author": "Low_Insurance_1603",
        "title": "Might be wrong sub but what are some great Football movies to watch before pre-season starts?",
        "content": "\nExcited that the kickoff to the 2025 NFL Season is less than a couple months away. What are some football movies I could watch before the season starts. I’m actually interested in those football movies that are a great watch but might be underrated. But I’m open to all suggestions although I’ve likely seen the popular titles.",
        "upvotes": 12,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1lxc580/might_be_wrong_sub_but_what_are_some_great/"
    }
]