[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 37,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mfcfh4",
        "author": "SoftPois0n",
        "title": "‘Fubar’ Canceled By Netflix After 2 Seasons",
        "content": "",
        "upvotes": 56,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1mfcfh4/fubar_canceled_by_netflix_after_2_seasons/"
    },
    {
        "id": "1mfapqn",
        "author": "cieje",
        "title": "the best phrase on Netflix? \"limit series\"",
        "content": "I'd much rather know beforehand that a show will intentionally have an actual ending, than hoping Netflix decides to renew something.\n\nI was really hoping the contract from the WGA strikes would've included a requirement that a certain % of contacts were multi-year or something. having the writers worried about getting renewed all the time leads to bad writing. and unfinished plots.\n\nedit well, \"limited series\" I'm sure you get it.",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mfapqn/the_best_phrase_on_netflix_limit_series/"
    },
    {
        "id": "1mep55y",
        "author": "Cynthiaaxxxx",
        "title": "A show you stumbled upon with zero expectations but ended up loving",
        "content": "There are times you just press play on something random and then boom, you’re hooked. Wondering what Netflix series or movie took you by surprise in a good way.",
        "upvotes": 313,
        "comments": 986,
        "media": null,
        "permalink": "/r/netflix/comments/1mep55y/a_show_you_stumbled_upon_with_zero_expectations/"
    },
    {
        "id": "1mf3pz6",
        "author": "Careless_Leg_6513",
        "title": "My Oxford Year",
        "content": "Sooo. What is with the guy having a secret disease hiding in every gig he works at, first bridgerton, now this. Lol\nAnd Sofia needs to do some other roles. I feel like all of her movies are kind of the same. The damsel in distress and ends up saving the whole tribe. ",
        "upvotes": 18,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3pz6/my_oxford_year/"
    },
    {
        "id": "1mf3cl8",
        "author": "PTsarC",
        "title": "“Too much” was total shite",
        "content": "Here I was thinking it would be a funny “eat pray love” kinda show. With selflove and healing in the spotlight. The type of show you want to see when you’re just feeling down and you need some sort of boost of empowering. \n\nJessica is not too much, she is just childish. Plus, what’s up with the constant sexscene’s? Almost a porn for teens if you tell me. ",
        "upvotes": 14,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1mf3cl8/too_much_was_total_shite/"
    },
    {
        "id": "1mf41nk",
        "author": "Chinawhite777",
        "title": "Good recommendation if you are a geek like me and like swords and magic (Shadow and Bone)",
        "content": "In my opinion very well written. I don't know if it is underrated. But only found it after ChatGPT recommended series to me. It is luckily not one of those fake series which don't seem natural. This one seems pretty high quality to me.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf41nk/good_recommendation_if_you_are_a_geek_like_me_and/"
    },
    {
        "id": "1mfeap9",
        "author": "An_Obese_American",
        "title": "New update",
        "content": "Are there still categories I can find? I used to go to the categories, and then standup comedy. I feel like a boomer already, why do they update what’s not broken. I scrolled all the way down, and found things like “athletic teen shows”, why is that a category. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfeap9/new_update/"
    },
    {
        "id": "1mfd63x",
        "author": "Beatroot_lover",
        "title": "Netflix isn't loading",
        "content": "Okay so I was tryna watch mlp so ofc I open Netflix on my laptop. Problem is nothings loading. I only seeike the top bar with home, TV shows... Etc. Everything else like on the screen is blank. I go check it in my phone and Netflix works perfectly in there. So idk what's going on. I would try to log out but j can't press anything. I've also tried turning My laptop on and off again. And the problem isn't with wifi since everythjng else works. Perfectly. Also if it helps I'm using Opera gx",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mfd63x/netflix_isnt_loading/"
    },
    {
        "id": "1meq56g",
        "author": "rohanad1986",
        "title": "'Emily in Paris' actor says he was devastated after being 'fired' from show: 'A tragedy'",
        "content": "",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1meq56g/emily_in_paris_actor_says_he_was_devastated_after/"
    },
    {
        "id": "1mfa8v4",
        "author": "Dolly9019",
        "title": "Adolescence episode 1",
        "content": "I've avoided content about this show as much as possible, so please no spoilers.\n\nQ1. Is it realistic that there would be armed police at the arrest of a 13year old who was in bed at home?\n\nQ2. Why do they same his name so much? E.g. Jamie I'm just going to ask you some questions. Is that OK Jamie? Is it to kind of 'ground' him?\n\nDuring the arrest and when he is first being processed, they use a language and phrases that aren't part of everyday conversation. I was surprised Jamie said he understood. When the officer was telling him about his detention, I was lost 🙈",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mfa8v4/adolescence_episode_1/"
    },
    {
        "id": "1mf5ulx",
        "author": "indiewire",
        "title": "Best New Movies on Netflix August 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf5ulx/best_new_movies_on_netflix_august_2025/"
    },
    {
        "id": "1mestl5",
        "author": "Entrepreneur-ecom",
        "title": "Help Test My Netflix Straw! [Survey]",
        "content": "Hi All, \n\nPlease help me make a decision.!\n\nI made a hands-free illuminated straw for binge-watching in bed. \n\nhttps://forms.gle/9MMSdVPDwWJfx53j7. \n\nFeedback on design and pricing welcome!\n\n\nThanks!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mestl5/help_test_my_netflix_straw_survey/"
    },
    {
        "id": "1mfbbrk",
        "author": "Kevy-Em",
        "title": "Will there be a roast this year?",
        "content": "Last year the Tom Brady roast did so well, I'm hoping there will be another one this year, I'm really hoping Adam Sandler or Eminem will be the next celebrity",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mfbbrk/will_there_be_a_roast_this_year/"
    },
    {
        "id": "1mf0z97",
        "author": "Warm_Wear_1495",
        "title": "Ad glitches make watching certain scenes technically impossible",
        "content": "Once netflix started forcing ads ive had this issue anytime an ad comes up:\nThe video freezes, stutters, glitches then the ad plays. Once it ends, the video glitches and freezes and stutters then SKIPS FORWARD the video im watching by 15 seconds. If I try to rewind w the skip 10 second button it launches me before the ad, then glitches and brings me back to where it skips forward. I cant even drag the time to during the physical ad, it just glitches me forward. I have missed so many scenes because of this issue, anybody else have this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf0z97/ad_glitches_make_watching_certain_scenes/"
    },
    {
        "id": "1mel55u",
        "author": "Cobydraws19",
        "title": "AWFUL Tooth Drilling Wednesday Ad",
        "content": "I listen to podcasts while I’m at work &amp; I need to talk about this fucking Netflix ad for “Wednesday” that I heard yesterday. \n\nIt goes: “Hi I’m Wednesday Adams blah blah here’s a recording I had made of my root canal” and then like 10-15 seconds of EARSPLITTING TOOTH DRILLING SOUNDS, followed by “Wednesday season 2, only on Netflix”. \n\nI IMMEDIATELY clamped my lips over my teeth. \n\nI shouldn’t even have to justify why this is a visceral and physically uncomfortable concept for an ad, but I’m at work in the shipping industry, on 10 foot ladders with my hands literally full. I can’t skip it. \n\n“Wednesday morbid hehe” I DONT WANT THAT SHIT UP IN MY EARBUDS! My teeth HURT!!\n\nI want this off air IMMEDIATELY. Reaching out to the other victims of this ad lol",
        "upvotes": 12,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mel55u/awful_tooth_drilling_wednesday_ad/"
    },
    {
        "id": "1mebxal",
        "author": "RCAPU",
        "title": "Hunting Wives and Wigs",
        "content": "Just finished watching the first season. It was entertaining. However I could not get over the wigs on Margo and Callie. They were so bad. If they get a season 2, I hope they fix that. Totally distracting.",
        "upvotes": 29,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mebxal/hunting_wives_and_wigs/"
    },
    {
        "id": "1mex77b",
        "author": "DreamOn2020",
        "title": "Scandal hits differently after a second watch",
        "content": "13 years ago I watched Shonda Rhimes’ Scandal for the drama and salaciousness, but the political side of the show always went over my head. Boy, does it hit differently now! I don’t think I even bothered to finish the series but now I’m engrossed because I understand exactly what’s happening, all the terminology, each character’s job, the lies, the deceit, the fixes, and it feels scary-real. Is this just a work of fiction or was it clever foreshadowing?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mex77b/scandal_hits_differently_after_a_second_watch/"
    },
    {
        "id": "1mfceke",
        "author": "Powerful_Gate_4871",
        "title": "Am i tripping or Malin akerman in The Hunting Wives looks like a older Lana del rey",
        "content": "Okay, hear me out. I might be spiraling a little here but I SWEAR I’m not alone. I just started watching The Hunting Wives, and the second Malin Åkerman stepped on screen I had to pause and rewatch her entrance like three times because I genuinely thought Lana Del Rey had gone full method actress and snuck into a limited series for fun.\n\nLike seriously, THE VIBE IS UNCANNY.\n\nIt’s not just the bone structure (though, let’s talk about that flawless symmetry and those cheekbones that could slice glass). It’s the whole ethereal, vintage glamor-meets-smoldering-siren aesthetic. Malin is channeling ultra soft-focus noir queen energy, and that’s LDR’s entire brand. The pouty lips? Check. The dreamy bedroom eyes that look like they’ve seen a thousand tragedies and three failed love affairs? Double check. That effortless blend of elegance and danger? Like… are you kidding me.\n\nEven the styling in The Hunting Wives is doing some heavy lifting in this comparison. The hair is big, brushed out, and retro glam. The wardrobe? Draped in silk and southern charm, with that “I may look like I bake pies but I’ve definitely buried secrets in the backyard” energy. It’s basically Born to Die era Lana meets Chemtrails Over the Country Club if it were a thriller.\n\nAnd don’t even get me started on the voice. Malin’s got that low, honey-dipped register that feels like it should be narrating an Old Hollywood murder ballad. Tell me she couldn’t say “my baby’s in the bar with his dandelion wine” and make it sound like a threat and a lullaby.\n\nI don’t know if this is brilliant casting, a weird timeline crossover, or my brain just doing somersaults—but I’m not letting this one go. Malin Åkerman = future Lana Del Rey. You heard it here first. Someone cast them as mother and daughter in a twisted psychological thriller IMMEDIATELY.\n\nAnyone else see it or am I losing it?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mfceke/am_i_tripping_or_malin_akerman_in_the_hunting/"
    },
    {
        "id": "1mdzg0u",
        "author": "Emondm24",
        "title": "Happy Gilmore 2 thoughts",
        "content": "I enjoyed it.  I quite enjoyed the video game like golf challenge during the last twenty minutes, it had the nice kind of the screw ball comedy that fits in this kind of world.  I liked seeing Ben Stiller return, the MJF and Becky roles, Haley Joel Osment having a key role.  He had the beard in his small role in the Boys so I knew who he was.  Didn’t like Shooters face turn.  Paying homage to the ones no longer with us was respectful.",
        "upvotes": 61,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1mdzg0u/happy_gilmore_2_thoughts/"
    },
    {
        "id": "1mesp6a",
        "author": "EngineeringHopeful12",
        "title": "Resurrect The Lazarus Project!",
        "content": "How in the bloody hell was this riveting series canceled after one season?  C'mon Netflix...Do Better!!  The series keeps me on the edge of my seat and according to spoilers that I refused to watch ahead of time stated that Netflix Execs chose to not renew the series and effectively end the series on a freakin Cliffhanger.  Ughhhhhhjhhhh",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mesp6a/resurrect_the_lazarus_project/"
    },
    {
        "id": "1mf7bk3",
        "author": "Ok-Lychee-2155",
        "title": "Sure Happy Gilmore 2 wasn't that funny but man that storyline sucked",
        "content": "Sorry for another HG2 post...\n\nSo it didn't need to be hilarious and honestly my humour expectations were pretty low. The storyline expectations and what they'd do with all the characters though, was much higher. \n\nThe Maxi Golf concept was really good and current with Liv Golf but the execution was so damn bad.\n\nAll it needed to be was Shooter and Gilmore teaming up with 2-3 of the cameo golfers (probably Scheffler and fuck if it could've been Tiger, or even Daly!) and having playoff with other actual golfers, or actors who seemed like golfers, in a more grounded maxi/standard golf playoff. The first half being Gilmore actually getting good at golf again and being courted along with Tiger and Shooter to bring back fan favourites.\n\nAlso, this might be a stretch, but Stiller could've quietly brought back White Goodman from Dodgeball and been the man behind Maxi golf. Vanessa didn't need to be dead, the motivation to \"save golf\" was enough.\n\nI expected that as it was a sequel to something which is one of the most quoted comedies of all time to be bigger in scale but it overall looked really cheap, and the scale actually felt smaller than the first movie.\n\nAlso - it's one of the most quoted and rewatched movie of all time, why did they have to literally replay the old jokes?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mf7bk3/sure_happy_gilmore_2_wasnt_that_funny_but_man/"
    },
    {
        "id": "1me4jux",
        "author": "sassyblondechik",
        "title": "Just finished Hightown 10/10",
        "content": "Here’s my beef with Hightown. It’s an amazing series—messy, dramatic, nonstop entertainment—but that ending? Come on. Starz really did fans dirty. They canceled it, apparently because they couldn’t afford it, even though the show brought in huge viewership numbers. Make it make sense. So many unresolved storylines, it felt like they just walked off set mid-scene. I genuinely hope now that Netflix has picked it up, a 4th season is in the works. It deserves one. We deserve one. I’m honestly kind of mad about it.\n\nNow maybe this is a dumb question, but it’s been bugging me: why did the show seem more focused on who killed Jorge  than on Frankie himself—who, let’s be real, was a full-blown murderer? He’s out of prison again and somehow they still couldn’t charge him with anything? That was beyond frustrating. I get that the writers probably wanted to push Ray to kill him in the end, but still—it felt like everyone was just shrugging off Frankie’s entire rap sheet.\n\nIt’s such a great show, but man, that ending left me with more questions than closure.",
        "upvotes": 15,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1me4jux/just_finished_hightown_1010/"
    },
    {
        "id": "1meojjg",
        "author": "FlyMarines45",
        "title": "Netflix “Accidentally” Adding Extra Member",
        "content": "Recently got charged for an extra member fee. Deleted obsolete profiles on my account…tried to login while traveling and got prohibited from accessing my account unless I activated extra member fee.\n\nCalled support and they exclaimed that an extra member fee of $6.99 was “accidentally” added.\n\nJust a heads up.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1meojjg/netflix_accidentally_adding_extra_member/"
    },
    {
        "id": "1me0xur",
        "author": "FeelingMyOats",
        "title": "Help - Teleparty extension issues (not syncing)",
        "content": "I'm not sure if the Teleparty extension is having issues right now or not, but basically I've been trying to watch a show with my friend and we've been using Teleparty a lot over the past month or two with no issues. But today, we're both experiencing the weirdest thing. I tried to create a session, but the link is noticeably shorter than usual and doesn't include the show title in it. I thought that would be fine, but when she opened the link, it just played on its own and refuses to sync. Then she tried to create the session, but the same thing happened to her too.\n\nIt's so weird because it shows in the chat log whenever one of us joins or pauses/plays and whatnot, but it's playing two separate instances. If I play, it's still paused for her, and vice versa. It's refusing to sync, and this has never happened before until today. Has anyone else experienced this? Is there a possible fix, or maybe it'll just randomly fix itself after a time? Thanks.\n\nEDIT: Lots of people in the replies experiencing the same thing, so hopefully they fix it soon.",
        "upvotes": 19,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1me0xur/help_teleparty_extension_issues_not_syncing/"
    },
    {
        "id": "1mdw287",
        "author": "Imaginary_Increase47",
        "title": "The Residence could had been much better!!",
        "content": "I binge-watched *The Residence* last night—well, kind of binge-watched. I went through episodes 1–4 and then skipped straight to the final episode (I'll explain why in a bit).\n\nThe first episode setup was great: a murder in the White House during a chaotic state dinner, and the best detective is brought in to solve the case. With so many characters, each with different responsibilities and motives, the plot seemed like it had potential for some interesting twists.\n\nBut as I watched the next few episodes, there were a few things I couldn't get out of my head:\n\n1. There’s a subtle jabs from Mrs. Cupps about how it’s all men everywhere, etc throughout. I enjoy watching shows and movies with strong female characters—but lines like that feel like they’re just pandering to the audience. Minor thing, but it stood out.\n2. The obsession with birds. I get that someone can be fixated on certain things (I am too), but there’s a bird analogy for *everything*. For every new discovery, there is a bird analogy being made. I mean after a while, it started feeling more like a way to stretch out the runtime than meaningful symbolism.\n3. Pacing. This is my biggest gripe. Things really dragged. Honestly, after episode 4, I jumped straight to the final episode—and I still understood what happened and how the investigation played out, since it all gets recapped in that last 1.5-hour episode.\n\nNow, I’ll say this: the characters and the subtle humor were genuinely great. But if the pacing had been tighter, and each episode trimmed down to around 30–40 minutes, the whole 8-episode series would’ve felt a lot more coherent and engaging.   \n  \nEdit: Surprised it got Emmy nomination.",
        "upvotes": 36,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1mdw287/the_residence_could_had_been_much_better/"
    },
    {
        "id": "1mdimu9",
        "author": "Nebberlantis",
        "title": "What should they make the next Trainwreck about?",
        "content": "I recently watched the new one based off Storm Area 51, and I’ve been loving these past documentaries on the Poop Cruise, Project X, Astroworld and especially Woodstock ‘99.\n\nSo here’s my question: If you could suggest a topic for Trainwreck to cover in their next documentary, what would it be?",
        "upvotes": 110,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1mdimu9/what_should_they_make_the_next_trainwreck_about/"
    },
    {
        "id": "1meg2yj",
        "author": "Glass_Asparagus_5166",
        "title": "Happy Gilmore 2",
        "content": "I’m pretty nostalgic for the first one. I wasn’t born when it came out but it still used to be one of my favourite movies. This one started out strong, the first 30-45 minutes were pretty good, and happy is still a really funny character, but then it completely fell off. For some reason they decided to bring back every single side character from the original and redo every single joke and gag. Some parts of it feel like a remake and I really didn’t like how they kept playing clips from the original. On top of that the villains and the ending were really stupid. I’d probably rate this movie a 5/10, but that’s just my opinion I guess.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1meg2yj/happy_gilmore_2/"
    },
    {
        "id": "1mepy49",
        "author": "Reading-person",
        "title": "Paid to watch Netflix",
        "content": "Anyone know if that’s actually legit? I’ve seen so many ads for it lately, and if we *actually* can get paid to watch and review shows and movies that seems like a good way to make some extra cash. But is it just a scam? ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mepy49/paid_to_watch_netflix/"
    },
    {
        "id": "1mefleg",
        "author": "PermissionSoggy891",
        "title": "Netflix only plays at 720p on Edge",
        "content": "Trying to watch a movie, and it only plays at 720p despite my account settings demanding that it play at the \"highest possible quality\". I've also done what was suggested in this thread: [Netflix only plays at 720p : r/edge](https://www.reddit.com/r/edge/comments/pmcz0p/netflix_only_plays_at_720p/), and it still refuses to do anything other than 720p\n\nMy PC isn't the issue, it has i7 10700k and RTX 4070, so is there a way for me to force Netflix to play at 1080p or am I better off just cancelling?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mefleg/netflix_only_plays_at_720p_on_edge/"
    },
    {
        "id": "1medghv",
        "author": "Denizeri24",
        "title": "4K on PC problem",
        "content": "Hello,\n\n  \nI bought UHD plan from Netflix but I can't watch 4K on PC.\n\n  \nI'm using latest Windows 11 and latest Microsoft Edge. Normally I have extensions on Edge but I disabled all anyway still I can't watch 4K. I bought HEVC video extension from Microsoft Store but not worked.\n\n  \nI have Nvidia 5080 and 4K monitor, windows scaling is %100, Windows res is 3840x2160. Also my monitors supports HDR10.\n\n  \nI don't see Ultra HD or HDR image on movies, only Dolby Atmos image. When I do CTRL + SHIFT + ALT + Q result is;\n\n[qvoVFIN.png (2492×1524)](https://i.imgur.com/qvoVFIN.png)\n\n  \nI enabled Widevine and PlayReady DRM from edge://flags. Hardware acc is enabled from Edge Settings.\n\n  \nedge://gpu result is;\n\n[ZDWQwCw.png (2661×986)](https://i.imgur.com/ZDWQwCw.png)\n\n  \nIs that normal? before PWA Netflix, I can able watch 4K on UWP Netflix app but they removed UWP..",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1medghv/4k_on_pc_problem/"
    }
]