[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 504,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jw6j2p",
        "author": "Longjumping_Land_977",
        "title": "All the creepy Google searches found on Long Island killer suspect Rex Heuermann’s computer",
        "content": "",
        "upvotes": 113,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1jw6j2p/all_the_creepy_google_searches_found_on_long/"
    },
    {
        "id": "1jvui64",
        "author": "ConceptAble4425",
        "title": "Really disturbed after watching Kidfluencing and the entire Piper story",
        "content": "Okay so first of all, whatever Piper and these other kids went through is really horrible and vile and disgusting. No child should ever go through that and be exposed to such sexual content at such an young age. Specially all the SA allegations.\n\nWhat Tiffany is doing is wrong and how is she getting away with all this?? Why didn’t these parents file a criminal complaint against her if she SA’d your child? \n\nThese parents who filed the lawsuit settled as soon as they got the money. Throughout the series them and the kids keep on saying they are worried for Piper and they wanna save her but, they stopped the fight when a settlement came. Shouldn’t they have continued the case till Tiffany was held accountable by the court? Like why would you wanna make money of this too? \n\nFor anyone’s child who had being SA’d, the better thing would be to see the person who did this face justice rather than take money and forget it. I’m baffled by it. \n\nWhy can’t the law enforcement look into this and investigate all these claims and get the people responsible for this accountable? ",
        "upvotes": 112,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1jvui64/really_disturbed_after_watching_kidfluencing_and/"
    },
    {
        "id": "1jw06em",
        "author": "intelerks",
        "title": "Brad Pitt’s Plan B might return with season 2 of hit Netflix drama ‘Adolescence’",
        "content": "After shaking viewers to their core, Adolescence may be coming back for a second round. Brad Pitt’s production company, Plan B, is reportedly in early talks with director Philip Barantini and the creative team to explore where the story could go next.\n\n",
        "upvotes": 42,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1jw06em/brad_pitts_plan_b_might_return_with_season_2_of/"
    },
    {
        "id": "1jvvl5i",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix’s Hit Sci-Fi Series '3 Body Problem' to Film Seasons 2 &amp; 3 Back-To-Back",
        "content": "",
        "upvotes": 54,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1jvvl5i/netflixs_hit_scifi_series_3_body_problem_to_film/"
    },
    {
        "id": "1jvzcqq",
        "author": "Somethingman_121224",
        "title": "'Devil May Cry' Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 30,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jvzcqq/devil_may_cry_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1jw85uk",
        "author": "Plane-Cloud-5837",
        "title": "Interesting from Rashida Jones on Black Mirror episode one: \"So I bet it’ll be debated whether or not she actually had the agency to make that decision and how much of it was her\"",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw85uk/interesting_from_rashida_jones_on_black_mirror/"
    },
    {
        "id": "1jvve0w",
        "author": "Pogrebnik",
        "title": "‘Black Mirror’ Season 7 Reviews Are Out, Critics Call It the Best in Years",
        "content": "",
        "upvotes": 29,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jvve0w/black_mirror_season_7_reviews_are_out_critics/"
    },
    {
        "id": "1jw9tdf",
        "author": "takeanapwme",
        "title": "Black mirror ep. 1",
        "content": "Is it just me, or did anyone else find the ads hilarious? They made me laugh so much because the way she talks is so realistic lol I don’t know how she was able to film those scenes without laughing",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jw9tdf/black_mirror_ep_1/"
    },
    {
        "id": "1jw18ub",
        "author": "GrueneWiese",
        "title": "Netflix only advertises one thing to me: the game Cozy Grove ... and it's slowly driving me crazy",
        "content": "I have a very strange problem. For several months now, Netflix has been advertising the game “Cozy Grove” as the big teaser on the mainpage. It's not really a problem, but it's the only one I see. Netflix doesn't suggest any series, movies or anything else that might interest me via the big banner, but only Cozy Grove. And it's gradually starting to annoy me.\n\nI've already logged in and out, deleted cookies and website data on my computer ... but it remains.\n\n",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jw18ub/netflix_only_advertises_one_thing_to_me_the_game/"
    },
    {
        "id": "1jwegwd",
        "author": "jessicalorentis",
        "title": "I am so over Netflix’s bs.",
        "content": "Honestly makes me so mad and absolutely devastated. I began a journey of watching 1-2 season shows. They are mind blowingly amazing. Midnight club? Best thing I watched in a while. Welcome to Eden? Amazing thriller like so many amazing plottwists and such a great series. Dead Boy detectives? Such a cool concept and imo so well made. Julie and the Phantoms? The music is literally still playing in my head I mean Unsaid Emily is so beautiful and I am a punk fan through and through. Do yall wanna know what these and many other amazing, well written, new concepts, great acting and just overall new and interesting shows have in common? THEYRE ALL CANCELLED. ALL OF THEM. CANCELLED. WHY? “NoT eNoUgH vIeWeRs” SHUT UP. Tell me why I can’t get any closure but Big Mouth gets another 50 season, why Riverdale could go on as long as it did and why so many shows can go on for 5199362 season with 5% if the viewers (thag being 5) are actual fans and the rest are hate watching? Im so over the money hungry sob Netflix headquarters or wherever they make these decisions. And I say that as someone who LIKED Riverdale and watched Big Mouth. Like Im not asking for 5 more seasons, honestly you don’t even have to give me 1 more season just like a closing episode or a closing movie or ANYTHING. Im so over this, Im so over all these uncreative a$$holes using actually talented people for one season shows while they let bored out of their mind zombie writers bring out as many chatgpt shows as they want. Don’t even get me started about Disney Im going on another rant in that sub. Every ounce of originality is being grabbed at the neck and suffocated in that industry because it doesn’t have as many viewers as the $hit reality tv shows. I MEAN THERES LIKE 8 COUNTRIES VERSIONS OF LOVE IS BLIND WHO EVEN IS WATCHING THOSE",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jwegwd/i_am_so_over_netflixs_bs/"
    },
    {
        "id": "1jvgcsa",
        "author": "Ester_LoverGirl",
        "title": "Who watched the Kidfluencing documentary ??",
        "content": "This doc was so good but so horrible too.\n\nHow is that girl still doing videos, as if nothing happened ?????????\n\nWe need to protect children at all cost.\n\n\nThis was so sad to watch.",
        "upvotes": 164,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1jvgcsa/who_watched_the_kidfluencing_documentary/"
    },
    {
        "id": "1jw41kf",
        "author": "indiewire",
        "title": "Emma Corrin, Jack Lowden, and Olivia Colman to Star in Netflix’s ‘Pride and Prejudice’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw41kf/emma_corrin_jack_lowden_and_olivia_colman_to_star/"
    },
    {
        "id": "1jw3i9z",
        "author": "bshaw21",
        "title": "How does Netflix Household work on Mobile devices?",
        "content": "How can you log into netflix on any network that isn’t your “household” network?\n\nFor example, on my phone either on a different network OR on my mobile data I get the household pop up. Is it even possible to watch netflix on a mobile device outside of your house anymore?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jw3i9z/how_does_netflix_household_work_on_mobile_devices/"
    },
    {
        "id": "1jw9cma",
        "author": "WhyAmIHereExactlyHM",
        "title": "Can't access 'more episodes' on xbox netflix?",
        "content": "When I click on 'more episodes', I get an error message. For context, I can watch an episode of something as long as it's the one on 'play episode' or 'resume episode'. Everything else on my console also works fine. I've already turned my console off and on again, signed out and back in, turned my console off at the wall and left it for about an half an hour, and uninstalled and reinstalled netflix. Any ideas are helpful.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw9cma/cant_access_more_episodes_on_xbox_netflix/"
    },
    {
        "id": "1jwdq4d",
        "author": "Affectionate_Yam4221",
        "title": "10 Shows To Watch if You Love ‘Adolescence’",
        "content": "When I watched the show, I first thought of Defending Jacob.\n\nWhat about you guys?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwdq4d/10_shows_to_watch_if_you_love_adolescence/"
    },
    {
        "id": "1jw8fqt",
        "author": "OctaviaCordoba206",
        "title": "Best Atmos/Vision content? (April 2025)",
        "content": "Looking to see what content there is available on the top tier service, so I can test out my Dolby Atmos and Vision setup.\n\nI see the tag on several of the films and shows but never know if it's actually making full use of Vision and/or Atmos? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jw8fqt/best_atmosvision_content_april_2025/"
    },
    {
        "id": "1jw2iji",
        "author": "Somethingman_121224",
        "title": "Emma Corrin, Jack Lowden, Olivia Colman to Star in Netflix's 'Pride and Prejudice'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw2iji/emma_corrin_jack_lowden_olivia_colman_to_star_in/"
    },
    {
        "id": "1jvvdni",
        "author": "Alan_Stamm",
        "title": "'Black Mirror' Season 7 Review: Tech Drama Has Maudlin Lows and Grisly Highs [Variety]",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvvdni/black_mirror_season_7_review_tech_drama_has/"
    },
    {
        "id": "1jv9157",
        "author": "Interesting_Fan_3096",
        "title": "Million Dollar Secret Winner",
        "content": "This is one of the best reality game shows in Netflix. I was hooked from the beginning.\n\nThere were plenty of times I wanted to scream at the contestants, “why don’t you tell them this…” to convince them you’re not the millionaire, but they end up getting emotional, defensive and raising voices. I learnt that getting defensive like your “life” is on the line can be a truth / honestly signal instead of a signal for deceit. It happened every time in the game (eg Chris, Jaimi) \n\nFor example, Jaimi was twice a suspect. One for voting Lydia and telling the truth. (Sam and Sydnee lied so they wouldn’t be targets) No one believed Jaimi. To me, if I was the millionaire (or not), I would lie about voting Lydia because it instantly puts a target on my back because that was the clue. Jaimi admitted to voting Lydia. So it was obvious she was telling the truth! If you were worried of being caught, you would lie.\n\nStill, no one believed Jaimi. When they found out from the clue that she wasn’t the millionaire, Jaimi could have used that as proof to the group for the next time they suspect her.\n\nAgain, when she was the suspected millionaire, everyone thought it’s her because she told Sam to having two sisters (clue) and everyone refused to believe that another person would conceal it or lie about it. They would always target truth tellers (eg Jaimi or Corey in this case) When Jaimi was in the chopping block, again, she just screamed and cried to defend herself which we already know does not change people’s minds.She could have used the last time she was suspected as proof that she was telling the truth (eg Last time you didnt believe me, and you found out I was telling the truth. This is a game of deception, someone is lying. Anyone who has been honest has been an easy target and has been pinned as the millionaire)\n\n Next, I feel terribly bad for Corey in a way. I don’t think he would ever be able to trust anyone after this show. Lol but in a way, he was naive and his intuition was off throughout the show. He always suspected easy targets instead of thinking deeper (if I was the millionaire, how would I act?) this was missing from him throughout so in a way he was easily manipulated by Cara.\n\nFinally, I feel conflicted about Cara winning because she wasn’t that exciting to watch. But by the end of episode 6, I had a feeling she would win or at least play big in the finale. Why? Because she flew under the radar, everyone trusted her, and she actively kept information about herself hidden. She chose not to share. Her intuition was correct almost all of the time too (Sam was asking info about her sisters because she knew she had the clue, Corey and Sam would vote Sydnee out, Sydnee had immunity, Corey took her box etc) She played the game so very well because of her intuition but I so wanted the winners to either be Sydnee or Sam. They just actively played the game and revealed just enough, but because they were threats that put them in everyone’s radars to be voted off either way! \n\nSam was correct most of time but her emotions got in the way in which she trusted Cara. She kept saying she didn’t have it in her to think Cara would even ever be the millionaire because she wouldn’t let herself go there - that Cara is capable of deceit. This was Sam’s downfall and toxic trait lol Had she kept people at bay and not let her emotions cloud her I believe she would have won. Corey was the same but Corey was off throughout lol \n\nI wonder how they are and what they think about how they were all duped as Sydnee would put it.\n\n\n",
        "upvotes": 126,
        "comments": 349,
        "media": null,
        "permalink": "/r/netflix/comments/1jv9157/million_dollar_secret_winner/"
    },
    {
        "id": "1jw8leh",
        "author": "ZoeDeMeul",
        "title": "issue with sound",
        "content": "Hello,\n\nI recently bought a set of speakers (2.0) that i would like to connect to my smart tv via optical cable.   \nEverything works but there is a significant difference in sound quality between netflix and spotify or youtube. I cannot select a 5.1 audio option in the settings, but i suspect i might still not be getting 2.0 audio. Is this possible? Can i somehow change the audio settings?\n\nThank you very much",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw8leh/issue_with_sound/"
    },
    {
        "id": "1jv4s11",
        "author": "Alan_Stamm",
        "title": "'Bad Influence: The Dark Side of Kidfluencing' review – nothing about this shocking tale feels OK",
        "content": "",
        "upvotes": 155,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1jv4s11/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1jvq1hu",
        "author": "nomnomsquirrel",
        "title": "Collider:  ’The Old Guard 2’ Director Teases Explosive Action and a Time Jump for the Sequel",
        "content": "I have been following what little news there has been about the sequel since it was (mostly) filmed in summer 2022, but I admit, the only clues I've seen about a time jump is different hairstyles. Still excited! The Old Guard is one of my fave Netflix originals.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvq1hu/collider_the_old_guard_2_director_teases/"
    },
    {
        "id": "1jvss3k",
        "author": "Atlast_2091",
        "title": "Resident Playbook | Official Clip | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvss3k/resident_playbook_official_clip_netflix/"
    },
    {
        "id": "1jw70q1",
        "author": "Aggressive-Willow-54",
        "title": "Adolescence",
        "content": "Does anyone know if Adolescence will be a continuing series with a different story line each time? I would love to see what they come up with. Haunting!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jw70q1/adolescence/"
    },
    {
        "id": "1jvsptm",
        "author": "[deleted]",
        "title": "Have Netflix &amp; Co. changed the rules of the game for Europe?",
        "content": "Over the past 10-15 years, it seems that European productions, both in cinema and television, have been gaining increasing visibility on a global scale. Whereas it once appeared that everything had to go through Hollywood, now a German, Spanish, or Italian series can become an international success.\n\nI believe this is partly due to streaming platforms. Netflix, Prime, Disney+, and others have made the world more “multipolar,” even in cinema. Productions are happening everywhere, not just in Los Angeles, and audiences have become much more open to stories told in other languages.\n\nI think of titles like Dark (Germany), La Casa de Papel (Spain), Lupin (France), Suburra (Italy), 1899, The Rain, etc. But also more recent works like Cassandra from Germany, or Adolescence (UK), which has just been released and is already topping the charts on Netflix. And even though it’s a few years old, Zerocalcare’s Strappare lungo i bordi has had a strong impact, even outside of Italy.\n\nSo, do you think this is just a passing trend, or is European cinema truly experiencing a golden age?",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jvsptm/have_netflix_co_changed_the_rules_of_the_game_for/"
    },
    {
        "id": "1jw55xu",
        "author": "AzSaltRiverRat",
        "title": "Customer Service - Horrible!",
        "content": "Dear Netflix,\n\n May we please have Customer Service rep's that can understand, can speak and able to write in English when your customers in the US are in need of assistance? I wasted an hour with this person in live chat. They could not understand the issue at hand, then they were about to cancel my account when I **never** **mentioned a thing about cancelling my account.** I've been with Netflix since 2012 and this was absolutely ridiculous today.\n\n  \nAll I was trying to tell this person is that Netflix charged my CC again when my subscription is being billed &amp; paid through T-Mobile.\n\nHere are just some of the excerpts from their chat to me...copied directly from the Netflix transcript e-mail. How do you make sense of this...\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n**Netflix Rep (Live Chat):**\n\n\\- Yes as checking with your concern please be rest assured and need to worry as checking March 26 your partner payment has started and ended on april 8 2025 okay wait.\n\n\\- Kindly please check the billing details and let me know once will be in the chat! Yeah thankyou please check the email and tell me\n\n\\- Have you checked the billing details in that there is partner payment ended on april 8 from T\\_Mobile\n\n\\- Okay as charged with your back up card be rest assured I am on immediate cancel and provide you the refund Okay I will issue the refund by as checking as you have been charged I can cancel the account and refund you the money is that okay?\n\n\\- But here I cannot see it is been charged with your back up card only and with 24.99 USD.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jw55xu/customer_service_horrible/"
    },
    {
        "id": "1jv7nlj",
        "author": "S4v1r1enCh0r4k",
        "title": "Jack Lowden Tipped for Mr. Darcy Role in Netflix's Upcoming 'Pride and Prejudice' Series",
        "content": "",
        "upvotes": 22,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jv7nlj/jack_lowden_tipped_for_mr_darcy_role_in_netflixs/"
    },
    {
        "id": "1jvp9of",
        "author": "Sk8er_Infinity",
        "title": "Looking for similar shows!",
        "content": "I recently watched “Elves: Secrets of Elvendale” and “Skull Island” on Netflix. Both are animated shows, and are drawn similarly to “Voltron: Legendary Defender”. Does anyone know any shows with this same animation-style or storylines? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvp9of/looking_for_similar_shows/"
    },
    {
        "id": "1jvrexc",
        "author": "AfonsoBucco",
        "title": "Any news about speed control to come back?",
        "content": "Yep, like 1.5x or 2.0x you have in many platforms.\n\nI know artists/creators don't like that. But so... they could stop doing lazy telenovelas. I'm not from TikTok generation I have no problem to watch a 3 hours good movie. But when the movie is just half good I want to do this faster.  \n  \nIt's sad it's not available in a service I pay for. I can do that easily in videos I have the archive downloaded. But I have a worse experience paying for a service.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jvrexc/any_news_about_speed_control_to_come_back/"
    },
    {
        "id": "1jvra9h",
        "author": "shira21",
        "title": "Playback speed control on app speeds up when fingers are on the screen",
        "content": "My toddler will sometimes watch something on Netflix on my phone. She will be holding the phone and her fingers will trigger the speed control to make the video play at 1.5x speed. Is there anyway to turn off this feature so the video doesn't speed up just by her holding the phone and having a her fingers on the screen? Thanks ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jvra9h/playback_speed_control_on_app_speeds_up_when/"
    }
]