[
    {
        "id": "1ii86we",
        "author": "Finian_mbappe",
        "title": "Pre-Match Thread: Leganes vs Real Madrid",
        "content": "Since mods forgot to post pre-match thread, i decided to step in.",
        "upvotes": 124,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i339gb2h6bhe1.jpeg?auto=webp&amp;s=46ae6d019508a8c456db33b79e7bba287b9bc4c0"
        },
        "permalink": "/r/realmadrid/comments/1ii86we/prematch_thread_leganes_vs_real_madrid/"
    },
    {
        "id": "1igml0a",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 980,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igml0a/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1iiaj7o",
        "author": "SubjectTumbleweed216",
        "title": "[marca] West Ham came for Endrick during the winter market. Refused by both Real Madrid and Endrick.",
        "content": "",
        "upvotes": 223,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sIqdVzIvu_ey4Y5QDJV9dX2yJjv8mr2xd6PGTcDWKXo.jpg?auto=webp&amp;s=6326d116eaa70b60de94f2432ad12874ead6865e"
        },
        "permalink": "/r/realmadrid/comments/1iiaj7o/marca_west_ham_came_for_endrick_during_the_winter/"
    },
    {
        "id": "1ii43ty",
        "author": "Witty53",
        "title": "Scenes against man city",
        "content": "",
        "upvotes": 800,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ensyzxs1o9he1.jpeg?auto=webp&amp;s=f4d92a58ba4724397da7f0e481e6d1f252202520"
        },
        "permalink": "/r/realmadrid/comments/1ii43ty/scenes_against_man_city/"
    },
    {
        "id": "1ihvffc",
        "author": "Dany130",
        "title": "Real Madrid congratulates Cristiano Ronaldo his 40th Birthday",
        "content": "",
        "upvotes": 3278,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cg7zeowwe7he1.jpeg?auto=webp&amp;s=71dc2c57c459a05eae0e8486edbe92a71e9e43a7"
        },
        "permalink": "/r/realmadrid/comments/1ihvffc/real_madrid_congratulates_cristiano_ronaldo_his/"
    },
    {
        "id": "1ii4xhv",
        "author": "77SidVid77",
        "title": "Real Madrid is currently #1 in UEFA 5 year club coefficient ranking",
        "content": "",
        "upvotes": 280,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jnuinq5oy9he1.png?auto=webp&amp;s=31f493784313ba0e566f5474a773d924b202c53a"
        },
        "permalink": "/r/realmadrid/comments/1ii4xhv/real_madrid_is_currently_1_in_uefa_5_year_club/"
    },
    {
        "id": "1ii3jiv",
        "author": "Different_Craft5237",
        "title": "People never really think things through when asking why the club does not make moves in the Winter transfer",
        "content": "I'm gonna try to make this as simple as possible by changing the perspective one second and considering the combinations between these 2 elements :\n\n\\- Title contender vs Mid Table (or below) teams\n\n\\- Key starters vs bench (or rotation) players\n\n**Scenario 1:  We want to loan a key starter from a title contender team**\n\nNow why dafuq would any team in their right mind give up any key player while playing for trophies. That's never gonna happen. So we can already forget that.\n\n**Scenario 2:  We want to loan a bench player from a title contender team**\n\nOkay, yes these may be players that they can dispose of, but why would they want to help you strengthen your squad if they're likely competing against you (domestically or continentally).\n\n**Scenario 3:  We want to loan a key starter from a mid table team**\n\nAlso not gonna happen. Think about it, why would I loan you a guy who's having a stellar season for me and is helping my club finish higher in the league tables than usual (thus securing more revenue) right in the middle of the season ? Also, this player who's an X-factor for me, probably will get less minutes at your club (Real Madrid), which will kill his momentum and hype. So once he gets back from loan, his resell value will have taken a massive hit.\n\n*Imagine if Jovic went on loan in January 6 months before we bought him. He would have been exposed, and no way any sane club would pay the 80M we paid.*\n\nSo no, again, these types of players don't get loaned. If you want them, you're gonna pay a nice premium like City just did for Marmoush, cause Frankfurt's performance won't be the same going forward and they made sure City paid upfront for the upcoming $$ losses.\n\n**Scenario 4:  We want to loan a bench player from a mid table team**\n\nNow why the hell would we do that. Unless we want to end up with Mariano and Vallejo 2.0.\n\n\n\nSo you see where I'm trying to go here. \n\nHowever, there is one final scenario not mentioned, but the stars have to align.\n\n**Scenario 5:  A key starter from a title contender team falling off with the current coach and forces a move**\n\nThis is the only time when a club like Real Madrid could actually consider a loan move. Cause the player in cases like this did not become shit, he just did not fit the manager's plans/system anymore. But the player is still serviceable. And in situations like this, the loan actually makes everyone happy. The manager no longer has locker room drama, the players gets playtime, the new club gets a player who can help them. And bonus, once the players comes back from loan, his value didn't tank, cause he actually showed his quality at the club he was loaned to, unlike if he had stayed at his original club and rot on the bench. But again, the stars have to align for such players to be available when you need them.\n\nUltimately, the football world is not just Real Madrid being the main protagonist and everyone else being some retarded NPC. Teams have ambitions too. It does not have to be as high as ours, but they  have goals nonetheless, and they won't shoot themselves in the foot cause Real Madrid came knocking on the door, regardless of their status. So if you really want their player that bad, you gonna have to pay up. Which won't happen since Flo is not an idiot and we're not backed by PL and oil money.",
        "upvotes": 54,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ii3jiv/people_never_really_think_things_through_when/"
    },
    {
        "id": "1ihqzy9",
        "author": "NoPartyGuy",
        "title": "Florentino Perez with Tommy Vercetti",
        "content": "",
        "upvotes": 302,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dpbskyk6i6he1.jpeg?auto=webp&amp;s=de043131e2406fa2bbed638c4685d244c76153dd"
        },
        "permalink": "/r/realmadrid/comments/1ihqzy9/florentino_perez_with_tommy_vercetti/"
    },
    {
        "id": "1ihih25",
        "author": "10Core56",
        "title": "Siiuuuuu with Nvidia",
        "content": "Some stuff you can make with the new AI. We need some robot defenders.\n",
        "upvotes": 692,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vkkkbjiwq4he1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihih25/siiuuuuu_with_nvidia/"
    },
    {
        "id": "1iiditp",
        "author": "UhhhhhNoThanks",
        "title": "Can i buy a Raúl Asencio shirt anywhere?",
        "content": "Hi everyone.\n\nSince the season started, i've really enjoyed Asencio's performances, and i've been wondering if i can buy an official Asencio shirt with the number 35 on the back.\n\nI've been looking at different websites that only has one with the number 5, so do i have to get a custom print, or are there any place that has it printed?\n\nThanks in advance",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiditp/can_i_buy_a_raúl_asencio_shirt_anywhere/"
    },
    {
        "id": "1ii2cr1",
        "author": "Next-Cardiologist838",
        "title": "Alphonso Davies extends till 2030",
        "content": "Alphonso Davies extends his contract till 2030\n\nIt’s been no secret that we had perused an interest in Davies so now that he has extended his contract for 5 more years what is our long term plan for LB/LWB if Xabi comes in.\n\nDo we try bring back Gutierrez from Girona. Or Theo from AC Milan. Alvaro from Benfica could be a cheap option but I don’t see him being a long term starter. I can’t lie Gvardiol would also be sick but is probably unrealistic.\n\nPersonally Gutierrez would be my pick but what are your thoughts ",
        "upvotes": 37,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ii2cr1/alphonso_davies_extends_till_2030/"
    },
    {
        "id": "1ihm54v",
        "author": "Aladeen911MF",
        "title": "Ofc Everyone is injured",
        "content": "As of now 4th Feb, Rudiger, Miitao, Alaba, Carvajal are injured in defence\n\nMbappe has a bruise in calf possibly from that **Yellow** card challenge, Jude got a knock, so both will not play tomorrow, Camavinga has a muscle injury in the biceps femoris of his left leg,  Vini is not training on field with the team and may or may not start tomorrow\n\nOther than academy players and youngsters like Endrick, Arda we have Rodrygo, Brahim Diaz in attack and Our Labour Fede, Underrated Ceballos, about to be 40 Modric, Horrible form Tchouameni in midfield and Goat Vasquez for RB, Innocent Fran and Mendiddy for LB and JESUS VALLEJO for CB (you can also count Raul Asencio here and not in academy players).\n\nAncelotti said we are in an \"emergency situtation\" and I am sure he still doesn't like rotations, We don't sign anyone in Winter trasnfers but he have to play 2nd place Atletico, Man city for QUALIFYING to RO16 and infact *17 matches from 4Jan to 26Feb that's 17 in 52 days*, **one match every 3days 1Hr 24 Mins 42 sec** including 90 game time, stoppage time, travel time and everythingtime ffs",
        "upvotes": 275,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihm54v/ofc_everyone_is_injured/"
    },
    {
        "id": "1ihs4dq",
        "author": "CuteAction1698",
        "title": "Apparently this is going to be our squad list for tomorrow. Just look at that defense, it's actually unbelievable.",
        "content": "",
        "upvotes": 127,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n040pAt6XVf64QSYiVrAS_6B5zIfdshen5nhCFR3qxo.jpg?auto=webp&amp;s=c482d1b669954db209ba2597d61ae7a6097bb9cd"
        },
        "permalink": "/r/realmadrid/comments/1ihs4dq/apparently_this_is_going_to_be_our_squad_list_for/"
    },
    {
        "id": "1ihhjrg",
        "author": "SubjectTumbleweed216",
        "title": "[marca] Alaba was set to start tomorrow alongside Asencio to test the duo before the Atletico and City games. However, with his injury, Madrid are forced to start Asencio and Tchouameni, with no other choice possible",
        "content": "",
        "upvotes": 389,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MXNK2QAJ0pmp4674MuS1S6QPoKAfzqvLgcbR93cHnNk.jpg?auto=webp&amp;s=483c985e2cb59122b7e4832eca991aac4e32092e"
        },
        "permalink": "/r/realmadrid/comments/1ihhjrg/marca_alaba_was_set_to_start_tomorrow_alongside/"
    },
    {
        "id": "1ihbo26",
        "author": "Total_Escape_9778",
        "title": "Even Carlo was telling Ceballos to pass the ball to Vini while he was free, but both him and Fran were loading it to the right flank instead...",
        "content": "",
        "upvotes": 1188,
        "comments": 201,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/snnsffodi2he1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihbo26/even_carlo_was_telling_ceballos_to_pass_the_ball/"
    },
    {
        "id": "1iheqkg",
        "author": "TheBiasedSportsLover",
        "title": "Cristiano Ronaldo: \"I'm the most complete footballer ever. I head well, I take set pieces well, I shoot well with my left foot, I'm fast &amp; strong, I jump. I respect if someone would prefer Messi, Pele or Maradona, But to say that CR7 isn't complete is a lie. I don't see anyone better than me\"",
        "content": "",
        "upvotes": 557,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zNpeVUMp0mlrdyTppZ3K8sxZwCB9MjIOcET_3q6eVO8.jpg?auto=webp&amp;s=e56e07bdaaf8ee95734b2ed0d54349a2ef70feed"
        },
        "permalink": "/r/realmadrid/comments/1iheqkg/cristiano_ronaldo_im_the_most_complete_footballer/"
    },
    {
        "id": "1ihqwb5",
        "author": "ManuMora98",
        "title": "[FEM] Real Sociedad 1 - 4 Real Madrid | Lucía 71'; Bruun 5', 27', OG 69', Alba 84' | Important win to leave the 3rd qualified comfortably 11 points behind, and position ourselves \"just\" 5 behind Barça after their lost this weekend",
        "content": "",
        "upvotes": 89,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/17ks8gvlh6he1.jpeg?auto=webp&amp;s=9dad00e0e458088a2892af2f471be6aea28267ea"
        },
        "permalink": "/r/realmadrid/comments/1ihqwb5/fem_real_sociedad_1_4_real_madrid_lucía_71_bruun/"
    },
    {
        "id": "1ihlevd",
        "author": "BrunoBenjamenta",
        "title": "When did you become a Real Madrid fan?",
        "content": "I'm old as fuck, so for me was in the eighties, when I was a child and felt in love with la \"quinta del Buitre\", the \"remontadas\" in the UEFA Cup and so. What is your story? Did you follow your family tradition or did you break it? There was a special match or moment that made you a madridista for life?",
        "upvotes": 148,
        "comments": 296,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihlevd/when_did_you_become_a_real_madrid_fan/"
    },
    {
        "id": "1iheg3y",
        "author": "fauxselection42",
        "title": "David Alaba diagnosed with an injury to the adductor in his left leg",
        "content": "",
        "upvotes": 424,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aloQaUuYbKpsUR7YBuBxNRmtXeXz4ScGOzxFnEQNbVQ.jpg?auto=webp&amp;s=66cdf9425482679cd64997bb7d2566cbfcea7e93"
        },
        "permalink": "/r/realmadrid/comments/1iheg3y/david_alaba_diagnosed_with_an_injury_to_the/"
    },
    {
        "id": "1ihuqeb",
        "author": "Happy-Particular4412",
        "title": "My best Madrid Team so far",
        "content": "",
        "upvotes": 34,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s0fjvi3i97he1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihuqeb/my_best_madrid_team_so_far/"
    },
    {
        "id": "1ihl0o9",
        "author": "ace-s",
        "title": "The squad depth issues could have been avoided a long time ago, under Carlo a young Valverde would have never gotten any chances",
        "content": "Hear me out,\n\nAlot of the other top teams in Europe have been able to integrate their Youth players into their their starting team, except us.\n\nAncelloti's demands for the club to sign players to increase our squad depth is UNREALISTIC. Players like Asensio, Nico Paz, Ramon and many others have been in our Youth team for years. The integration should have started years ago, players like Ramon and Asensio should have been given solid minutes last year so that they have been ready to start this year.\n\nWe honestly wasted years of youth squad integration because Carlo only likes to play his fav. 14-15 players.\n\nThe players are there, our Youth System is as strong as ANY other team.\n\nI hate to say it but look at Barcelona, They have created gems out of their youth. couple of years ago even their most loyal fan did not know half of these starting players are. Look at them now, almsot their entire team is from their Youth Squad. Yamal, Cubarasi, Balde, Pedri, Gavi...etc.\n\n\\------------------------------------------\n\nSolution to long term injuries should ALWAYS be from the Youth System, It is Ancelloti's failure to not integrate our youth team.\n\nTop players like Militao, Alaba, Rudiger are still on the club's payroll. Expecting to sign a worldclass CB on a long contract is not realistic. \n\nAsensio has shown he can be a Main team material, we probably have couple of more players like that.\n\nOur youth players have been scouted by the very best, they deserve a chance. It is crazy that a player like Fortea forces himself to leave the club cuz he knows he wont get a chance here.",
        "upvotes": 90,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihl0o9/the_squad_depth_issues_could_have_been_avoided_a/"
    },
    {
        "id": "1ihbp9t",
        "author": "Damned_chicken",
        "title": "He couldve played more",
        "content": "",
        "upvotes": 505,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xunvo5cui2he1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihbp9t/he_couldve_played_more/"
    },
    {
        "id": "1ihcrqc",
        "author": "ImaginaryPoet_300",
        "title": "The season might be going down. But me knowing we are Real Freaking Madrid and can never be ruled out when it push comes to shove 🐼",
        "content": "Lots of negativity in this sub right now. People pointing fingers left, right and centre. Most of the criticism is deserved : The President, the Board, the Manager and the Players. (The Refs!)\n\nBut as fans let’s take a deep breath and just calm down. Look at the bigger picture. We just won the UCL last season. Our Team is young and FULL of world class potential and except a few positions we are set for a solid Decade!\n\nThis season has been terrible by Real standards but still we’re 1st in the league and are alive in the CDR and somehow surviving in the UCL. \n\nJust reminding when Real has its back against the wall, they find a way to dig themselves out of the hole. \n\nAs a fan, I might be sad, angry or elated depending on the situation of each match day. But I know full well that I can relax 😌 knowing that we, Real Madrid will give it our everything and even if we go down, it won’t be without putting up a fight. \n\nHalamadrid 💟",
        "upvotes": 274,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p7m3fatww2he1.jpeg?auto=webp&amp;s=746fe6e578bab3571ab6a9b3b76f50720d846fb7"
        },
        "permalink": "/r/realmadrid/comments/1ihcrqc/the_season_might_be_going_down_but_me_knowing_we/"
    },
    {
        "id": "1iheu0y",
        "author": "Sneijder4BallondOr",
        "title": "Raúl goal against Real Sociedad [Sep 13, 1997]",
        "content": "",
        "upvotes": 152,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nu2utw9to3he1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iheu0y/raúl_goal_against_real_sociedad_sep_13_1997/"
    },
    {
        "id": "1ihbuf0",
        "author": "InformationPast1030",
        "title": "Good old days - 2015",
        "content": "U",
        "upvotes": 296,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9a90pi5mk2he1.jpeg?auto=webp&amp;s=82a92636d40ded4746bfbd98a89ebbadde959da9"
        },
        "permalink": "/r/realmadrid/comments/1ihbuf0/good_old_days_2015/"
    },
    {
        "id": "1ihhe2w",
        "author": "Maldo963",
        "title": "This is beyond aggravating and ridiculous.",
        "content": "With the news that Alaba is now injured our only CB options are Asencio and Vallejo, this club is building so much revenue and trying to get richer and richer each day as we play worse and worse as each matchday goes by, never been so upset and disappointed as a Real Madrid fan, not even the 18/19 season had me in this much disbelief, our squad depth us non existent, got no tactics and we play horrendous football, even Espanyol who beat us play better than us or at least have an idea of play somewhat, Perez splash the cash on Saliba or any top CB, bring back Miguel or better yet go for Theo since Davies will not come at the end most likely, go for Zubimendi sign Xabi Alonso or Zidane as coach next season, we want major changes we demand good football, we demand winning every major title, and I especially don’t want Barca and Atletico to humiliate us every season and laugh at us like a laughing stock we are now, mark my words if this team signs nobody next season and Carlo stays and keeps playing his boys Vazquez and Tchouameni in defense and keep playinh this atrocious football we will see new lows next season we will probably miss out on qualifying for Champions League positions. ",
        "upvotes": 72,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihhe2w/this_is_beyond_aggravating_and_ridiculous/"
    },
    {
        "id": "1igyng1",
        "author": "Masterguru147",
        "title": "12 years ago Ronaldo scored every team in La Liga even his own",
        "content": "He scored against 20 teams in La LiGa, even Messi couldn’t do it\nGOAT 🐐 for the reason 😂😂",
        "upvotes": 1423,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fmudae2jezge1.jpeg?auto=webp&amp;s=db9df171202b86f9f58e62f75eb7a3f69fb70d0f"
        },
        "permalink": "/r/realmadrid/comments/1igyng1/12_years_ago_ronaldo_scored_every_team_in_la_liga/"
    },
    {
        "id": "1ihmbgq",
        "author": "ManuMora98",
        "title": "[FEM] Our Starting XI against Real Sociedad (away) | Liga F Match Day 11 (Postponed match)",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8nxn4h0kk5he1.jpeg?auto=webp&amp;s=b3b57fada76a1d59827c238c489f2d471c5fb90a"
        },
        "permalink": "/r/realmadrid/comments/1ihmbgq/fem_our_starting_xi_against_real_sociedad_away/"
    },
    {
        "id": "1ih46in",
        "author": "nicootimee",
        "title": "Real Madrid has been hacked",
        "content": "",
        "upvotes": 531,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0cpclaoj0he1.jpeg?auto=webp&amp;s=609837f10f4464c078e2831e1c4d4371dd45d0d9"
        },
        "permalink": "/r/realmadrid/comments/1ih46in/real_madrid_has_been_hacked/"
    },
    {
        "id": "1iha0mq",
        "author": "SubjectTumbleweed216",
        "title": "Cristiano Ronaldo full interview (full transcript in body): “Real Madrid is the biggest and best club in the world”, “At Real Madrid I missed a penalty and locked myself in the room.”, “My son really likes Mbappe, Bellingham, Camavinga”",
        "content": "Full transcript: \n\nCristiano Ronaldo: \n“At Real Madrid, for example, I remember when I missed a chance or a penalty I would be so angry with myself. I didn't allow myself to make mistakes. I would go to bed without dinner, and talk to myself, wondering why I shot to the right or to the left. I don't regret being like that.\n\nEverything that happens on the field, stays on the field. I can't get home with my football problems with my family. But at first it was very difficult. I missed an opportunity or penalty and I locked myself in my room and talked to myself. I was sick.\n\nMbappé is fast, powerful, he has speed… He can’t wait in the box. He has to stay out and appear. If I did it, can’t Mbappé do it? Real Madrid have to protect him.\n\nVinícius should have won the Ballon d'Or, but I'm not surprised, there is no credibility, I was very disappointed, he deserved it.\n\nJude Bellingham reminds me a lot of Zidane, he has some Zidane elements. He will give a lot to Madrid, because he will be a star.\n\nI like the fact that Real Madrid fans miss me. My home is Spain, I played for Madrid for many years, it was where I was happiest. Real Madrid was always in my heart.\n\nMy son Mateo really likes Bellingham, Camavinga, Mbappé.\n\nI achieved beautiful things at Madrid and people don’t forget that, that makes me happy.\n\nI respect Perez, he is a trustworthy president and a serious person, and he treated me well. We won many titles with him, and I respect him a lot.\n\nI loved playing in the Camp Nou. They booed me, they insulted me, and I LOVED that.\n\nYou may prefer Pele, Messi, Maradona, I understand and respect that.\n\nI have a very good relationship with Messi, I was his translator at some awards ceremonies.\n\nAt one point I was at Sporting and I managed to go to Barcelona, ​​they wanted to sign me.”\n\nIt didn't happen, because they wanted to sign me the following year and United came and signed me.\n\nI enjoyed scoring goals more at the Camp Nou than at the Santiago Bernabéu. When you are warming up and they are already whistling at you, that’s what I love. That’s the best part of football for me.”\n\nMadrid - Barcelona atmosphere and the relationship with Messi?\n\nCristiano Ronaldo:\n\n“It was a historic rivalry, Madrid-Barcelona, ​​Cristiano-Messi, Ramos-Pique.\n\nIt was very nice I had a very good relationship with Messi and I once translated it into some awards and all that before the ceremony started He has always treated me well and I hope we see our numbers again, but I find it very difficult”\n\n“I appreciate and respect Florentino, I speak to him sometimes and I don't rule out coming back one day when I finish my career and do something great.”\n\n“I left Real Madrid because I wanted a new chapter.\n\nIn the negotiations phase when I was leaving Real Madrid, Florentino did not behave well with me. I understood that, because that is always his style.\n\nI told Perez about it, he accepted, but later he tried to come back, and there was no going back for me, because I had given my word to Juventus.”\n\n“I'm happy people still remember that I did important and beautiful things and that's why people don't forget when you leave a mark.”\n\n“Spain is my homeland, my children were born there, and I will always have Real Madrid in my heart.”\n\n“I really like Carlo Ancelotti, he is an amazing person, we have won a lot of things together.”\n",
        "upvotes": 198,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x0v7AoWWUBiikUcVEZUCl4CTEMbYwcnDqihk4c2u0VQ.jpg?auto=webp&amp;s=b3f9dba0133991c18fd72b556601e2ccb18f98ab"
        },
        "permalink": "/r/realmadrid/comments/1iha0mq/cristiano_ronaldo_full_interview_full_transcript/"
    },
    {
        "id": "1ihcbhy",
        "author": "kefhen",
        "title": "Saldo de expulsiones en Liga - Siglo XXI",
        "content": "",
        "upvotes": 113,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yfptnqupq2he1.jpeg?auto=webp&amp;s=8bfdbccd68f00965be24c97ae79f1065f7abd8b0"
        },
        "permalink": "/r/realmadrid/comments/1ihcbhy/saldo_de_expulsiones_en_liga_siglo_xxi/"
    },
    {
        "id": "1ihouoz",
        "author": "ManuMora98",
        "title": "Real Sociedad W 0 - [2] Real Madrid W | Signe Bruun brace 26' (Weir assist)",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gw6zeRcPnrognr6sbEVUqMKP7s8nOoHAaJOjX4O4h2Q.jpg?auto=webp&amp;s=36d963b25655f60e1ceab29a1afdba33c14b1f9e"
        },
        "permalink": "/r/realmadrid/comments/1ihouoz/real_sociedad_w_0_2_real_madrid_w_signe_bruun/"
    }
]