[
    {
        "id": "1nekeg4",
        "author": "lionsgate",
        "title": "Hi /r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today. Ask me anything!",
        "content": "Hi r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today and also stars Cooper Hoffman, David Jonsson, Charlie Plummer, Ben Wang, Mark Hamill, and Judy Greer.  \n\nYou might also know me from things like Manifest, God Is A Bullet, Ransom Canyon, and Pretty Little Liars: The Perfectionists. Here to answer your questions!\n\nTrailer: \n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\nSynopsis:\n\nFrom the highly anticipated adaptation of master storyteller Stephen King’s first-written novel, and Francis Lawrence, the visionary director of The Hunger Games franchise films (Catching Fire, Mockingjay – Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes), comes THE LONG WALK, an intense, chilling, and emotional thriller that challenges audiences to confront a haunting question: how far could you go?\n\nOut in theaters today.\n\nAsk me anything! Back tomorrow Friday 9/12 at 12:00 PM ET to answer your questions.",
        "upvotes": 178,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wyz6nv6bmlof1.png?auto=webp&amp;s=f693f5d1d583890b80b7dbbb830d97d2f923dbb1"
        },
        "permalink": "/r/movies/comments/1nekeg4/hi_rmovies_im_garrett_wareing_actor_in_lionsgates/"
    },
    {
        "id": "1nf38wo",
        "author": "TheThreesomeAMA",
        "title": "Hey /r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!",
        "content": "Hey r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!\n\nMy credits:\n\n[https://www.imdb.com/name/nm1029961/](https://www.imdb.com/name/nm1029961/)\n\nMore information about the film:\n\n**Official Trailer:**\n\n[https://youtu.be/Mafhm2\\_5Pzc](https://youtu.be/Mafhm2_5Pzc)\n\n* Directed by Chad Hartigan - Written by Ethan Ogilby\n* Starring Zoey Deutch, Jonah Hauer-King, Ruby Cruz, Jaboukie Young-White, Josh Segarra, Robert Longstreet, Arden Myrin, Kristin Slaysman, Allan McLeod, and Julia Sweeney\n\n&gt;An impulsive night leads to a wild threesome between Olivia (Zoey Deutch), Connor (Jonah Hauer-King), and Jenny (Ruby Cruz), leaving both women facing unexpected consequences, thrusting all three into the raw and beautifully messy chaos of adulthood.\n\nOut now in theaters! Ask me anything I'll be back at 3 PM ET today (Friday 9/12) to answer your questions.\n\n",
        "upvotes": 54,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cufizw27jqof1.png?auto=webp&amp;s=bad2315869f069f5f47524beafd7a70585644ebc"
        },
        "permalink": "/r/movies/comments/1nf38wo/hey_rmovies_im_chad_hartigan_director_of_the/"
    },
    {
        "id": "1ng6s29",
        "author": "MarvelsGrantMan136",
        "title": "Ice Cube Says He Shot His ‘War of the Worlds’ Scenes in 15 Days Without the Director or Other Actors",
        "content": "",
        "upvotes": 19449,
        "comments": 1189,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rVrRAw0k3j2rptO-AUoaXwXDT7xYMjVIFfsY2KPJExs.jpeg?auto=webp&amp;s=f5737ece3ace9be4e37848b7774830344a010487"
        },
        "permalink": "/r/movies/comments/1ng6s29/ice_cube_says_he_shot_his_war_of_the_worlds/"
    },
    {
        "id": "1ngfqqt",
        "author": "LadyDirtyMartini",
        "title": "What film opened your eyes to what good acting really is?",
        "content": "For a very long time, I never understood \"good\" acting or what made a good actor. My parents love Tom Hanks, and I remember them obsessing over his performance in \"Cast Away\" and \"Captain Phillips\".\n\nBut, I finally watched \"Monster\" (2003) a few years ago in high school and was completely gagged by Charlize Theron's performance. Her Oscar win was the \"ah ha\" moment for me. I mean... her acting and transformation was SHOCKING and incredibly enjoyable to watch on screen.\n\nAnyone else experience this with other actors/actresses?\n\nEdit: Just thought of another performance that gagged me. Javier Bardem in “No Country for Old Men” was extraordinary.",
        "upvotes": 362,
        "comments": 614,
        "media": null,
        "permalink": "/r/movies/comments/1ngfqqt/what_film_opened_your_eyes_to_what_good_acting/"
    },
    {
        "id": "1ng37sl",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Slasher Trash' - A deep dive into the dark waters of obscure, low-budget slasher films.",
        "content": "",
        "upvotes": 1309,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uyhj45gauyof1.jpeg?auto=webp&amp;s=dcc3e72e9372c44d2b92a399ffeab286c4b337db"
        },
        "permalink": "/r/movies/comments/1ng37sl/first_poster_for_documentary_slasher_trash_a_deep/"
    },
    {
        "id": "1ngi7z2",
        "author": "HazelsWarren",
        "title": "30 years later, \"Now and Then\" holds up as a testament to girlhood",
        "content": "This is such a solid movie about girlhood and its influence on messy, complicated adulthood. I first saw this movie when I was the age of the younger cast (the \"Then\" group), and now I'm closer in age to the \"Now\" cast. Everything resonated about their reunion in their thirties -- from the awkward conversations, the guilt of not being around each other often, and then the hospital scene with the baby delivery. The back-and-forth narrative really holds up in showing how the girls' last summer before they drifted apart really planted seeds for their complicated adult lives: \n\n* Chrissy (Ashleigh Ashton Moore, Rita Wilson), the most cautious and naive of the friends but also curious about 'the birds and the bees,' is the one who doesn't leave the neighborhood and marries her high school sweetheart. She's also the first of the friends to have a baby;\n* Teeny (Thora Birch, Melanie Griffith) is obsessed with movies and her body image; she later becomes a celebrated actress who experiments with breast augmentation; \n* Samantha (Gaby Hoffmann, Demi Moore) goes through it - her parents divorce, she almost drowns, her interest in the occult gets sidelined during their last seance scene. She finds refuge in science fiction writing, but struggles with being vulnerable; \n* Roberta (Christina Ricci, Rosie O'Donnell) is still grieving her mother's death; as an ob-gyn, older Roberta helps shepherd her best friend (Chrissy) safely into motherhood. Both Ricci and O'Donnell said the character was initially written as a lesbian, but some of the context was written out last minute due to test audience feedback--  however, it would have been compelling to keep the queer context in for the character, considering her 1970s arc (taping her chest, pretending to drown to see if her friends would perform CPR, disinterest in Devon Sawa for most of the movie, etc). \n\nI know Christina Ricci is now in Yellowjackets (which is also about a 90s group of girls in a back-and-forth timeline, but add cannibalism) but I could seriously see \"Now and Then\" being the premise for a limited series -- think \"This is Us\" crossed with \"Big Little Lies.\" ",
        "upvotes": 145,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1ngi7z2/30_years_later_now_and_then_holds_up_as_a/"
    },
    {
        "id": "1ng2qd2",
        "author": "Muhaisin35",
        "title": "30 years later, does Jurassic Park still hold up as “movie perfection”?",
        "content": "Rewatching it, the suspense, sense of discovery, and sheer wonder still feel unmatched, even after all these years. Personally, I think Dr. Grant is the soul of the film, his mix of awe, fear, and responsibility captures the heart of the story for me. But I’m curious, which character do you think truly made the movie unforgettable and left the biggest impact?",
        "upvotes": 1185,
        "comments": 537,
        "media": null,
        "permalink": "/r/movies/comments/1ng2qd2/30_years_later_does_jurassic_park_still_hold_up/"
    },
    {
        "id": "1ng6lpu",
        "author": "indiewire",
        "title": "Michael Shannon on Finally Getting His Big Courtroom Drama with ‘Nuremberg,’ His Next R.E.M. Tour, and Playing Bill Parcells",
        "content": "",
        "upvotes": 545,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CmZp0Ef5sFpo2iMMzu0oZdM-i7cf8jYOieS85on4jC4.jpeg?auto=webp&amp;s=3803382d963c4a722e05e36494b1b9ff7411ccb4"
        },
        "permalink": "/r/movies/comments/1ng6lpu/michael_shannon_on_finally_getting_his_big/"
    },
    {
        "id": "1ngffsm",
        "author": "uncre8tv",
        "title": "Your favorite \"the movie is better than the book\" films?",
        "content": "Favorite has to be Drive. Not a terrible book but very cheap dimestore novel feeling. Lots of action, shaky plot, cool guy not aloof guy protagonist, and the kid played a much bigger role (not a good thing).\n\nI was really surprised at how bad the Bourne books were (mid-century \"machismo\" that is alternatively silly and disgusting), and have always heard that The Godfather books were pulpy dreck. \n\nSo - what's your favorite movie that improved on the book?",
        "upvotes": 151,
        "comments": 535,
        "media": null,
        "permalink": "/r/movies/comments/1ngffsm/your_favorite_the_movie_is_better_than_the_book/"
    },
    {
        "id": "1ng6o62",
        "author": "CoolBDPhenom03",
        "title": "What’s something you only learned after watching a movie with subtitles?",
        "content": "An example would be like in “UP” where the golden retriever is named DUG, not Doug as I initially thought. The short that came out after the film is how I noticed the actual spelling, before I happened to rewatch with subtitles. \n\nThat’s less pivotal to the plot, but I’m sure you can think of better ones. \n\nGenerally, I don’t watch with subtitles unless it’s a foreign language film, since they can spoil details, like a specific character or if the timing is slightly early. \n\n",
        "upvotes": 505,
        "comments": 262,
        "media": null,
        "permalink": "/r/movies/comments/1ng6o62/whats_something_you_only_learned_after_watching_a/"
    },
    {
        "id": "1ng2sp9",
        "author": "MarvelsGrantMan136",
        "title": "‘Practical Magic 2’, Starring Nicole Kidman and Sandra Bullock, Wraps Filming",
        "content": "",
        "upvotes": 651,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nXRi6MveTVrjugwUhIMt_K0VwSBm8Vd__MlSViYMRhw.jpeg?auto=webp&amp;s=6b4cce4c623a4f7a75ea5f0e04290b4efd6c62e8"
        },
        "permalink": "/r/movies/comments/1ng2sp9/practical_magic_2_starring_nicole_kidman_and/"
    },
    {
        "id": "1ngcay4",
        "author": "EuphoricButterflyy",
        "title": "‘Ryan’s Daughter’ (1970)- Major Doryan in state of Shell Shock scene",
        "content": "",
        "upvotes": 184,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ze946ojtq0pf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngcay4/ryans_daughter_1970_major_doryan_in_state_of/"
    },
    {
        "id": "1nfifo2",
        "author": "MarvelsGrantMan136",
        "title": "‘Lord of the Rings’ star Sean Astin elected SAG-AFTRA president",
        "content": "",
        "upvotes": 51393,
        "comments": 934,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0Bl8CwgY7p8epppNOD7olsfTosyDZHFVUs3OL8ch7ZU.jpeg?auto=webp&amp;s=c375785f77acf06cf7c3721606dc1cdda8763010"
        },
        "permalink": "/r/movies/comments/1nfifo2/lord_of_the_rings_star_sean_astin_elected/"
    },
    {
        "id": "1ngeifg",
        "author": "ofthedappersort",
        "title": "Horror-Comedy That Really Does Both?",
        "content": "What is a horror-comedy that truly embodies both genres? I know there are a lot of \"horror-comedies\" where it's basically just a comedy but there happen to be monsters or whatever. I fail to think of any movies that are basically horror movies with a couple jokes thrown in but I'm sure they exist. Anyways, what are some movies you feel are truly a real blend of both horror and comedy?",
        "upvotes": 98,
        "comments": 430,
        "media": null,
        "permalink": "/r/movies/comments/1ngeifg/horrorcomedy_that_really_does_both/"
    },
    {
        "id": "1ngg764",
        "author": "EuphoricButterflyy",
        "title": "‘Hustlers’ (2019)… Destiny sees Ramona for the 1st time",
        "content": "",
        "upvotes": 61,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i24z7t6pp1pf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngg764/hustlers_2019_destiny_sees_ramona_for_the_1st_time/"
    },
    {
        "id": "1nft1ki",
        "author": "il_biciclista",
        "title": "What are the weirdest big-budget movies ever made?",
        "content": "\nThe weirdest one I know of is *Batman Returns*. It had a budget of $50 Million in 1992, which would be about $117 Million in today’s dollars. Most of the imagery is deliberately offputting. The penguin murders children and shoves a whole dead fish into his mouth. Catwoman dresses in BDSM gear. Back when superhero movies were primarily for kids, Tim Burton made one that was not for kids. \n\nHas anybody made a weirder movie at that scale? \n",
        "upvotes": 672,
        "comments": 477,
        "media": null,
        "permalink": "/r/movies/comments/1nft1ki/what_are_the_weirdest_bigbudget_movies_ever_made/"
    },
    {
        "id": "1ngay3i",
        "author": "tmamone",
        "title": "Do movie studios not advertise movies as much as they used to?",
        "content": "When my parents told me they saw the new \"Downton Abbey\" movie today, I responded, \"Wait, there's a new Downton Abbey movie out? When the hell did this happen? This is literally the first time I'm hearing about this.\" And it's true; prior to today, I hadn't seen a single advertisement for it anywhere. In fact, this is something I'm seeing more frequently nowadays; I'll hear about a movie that just came out in theaters that I didn't even know was coming out.\n\nIt was way different back in the '90s when I was a kid. I pretty much knew EVERY movie that was coming out and when it was coming out because I would see tons of ads on TV and in the paper in the months leading up to its release. This was especially true for Disney; when \"The Lion King\" came out in 1994, you literally couldn't go ANYWHERE without seeing it advertised. If you turned on the radio, there was Elton John singing \"Can You Feel the Love Tonight.\" If you went to Toys 'R' Us, there would be Lion King toys EVERYWHERE. If you wanted to get a chocolate bar, there you'd find a special Lion King Nestle bar (I can still taste them).\n\nFast forward to 2025 and I find out there's a new Disney movie through an Alex Meyers video. Literally no advertisement or buzz leading up to its release.\n\nSo what's going on here? Did the streaming age and/or COVID change the way studios advertise upcoming movies? Or do algorithms only show us ads for movies they think we want to see?",
        "upvotes": 54,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1ngay3i/do_movie_studios_not_advertise_movies_as_much_as/"
    },
    {
        "id": "1ngac7e",
        "author": "infinitemonkeytyping",
        "title": "What are some examples of bad corporate propaganda?",
        "content": "With the recent release of War of the World's, which is clear propaganda for Amazon, and social media companies, like Facebook and Twitter, at a time when all three have very low reputation due to ties with Trump, what are some other examples of bad propaganda dressed as a movie.\n\nThe most obvious example would be United Passions, which was a FIFA produced propaganda film about about themselves (not about soccer, but the FIFA organisation), which got released just as the biggest bribery scandal broke.\n\nI'm not talking about bad product placement (e.g. Mac &amp; Me), but one where a corporate entity is made to be a hero, trying to rehabilitate their reputation.",
        "upvotes": 60,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1ngac7e/what_are_some_examples_of_bad_corporate_propaganda/"
    },
    {
        "id": "1ngiro8",
        "author": "Videowulff",
        "title": "Don Bluth - what specific things stand out to you the most about his iconic art style?",
        "content": "Foe me, it is movement. His characters have a ton of movement. Every part of their bodies (and clothing) move so beautifully and fluid. When you see Fievel scramble around, every limb, every digit, is moving and scrambling with what feels like more frames than other movies. Like there is a lot less smearing between frames it feels. \n\nThis goes double for their faces. The mouths especially. Don's characters seem to move their mouths, jaws, and tongues more than other characters. You'd see them licking their lips, sticking tongues out a lot, see the tongues moving as they talk and eunciate (spelling) and the lower lip curls (which I always associate with his style) during specifoc syllables. \n\nWhat do you associate when you think of his art style? \n\n",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1ngiro8/don_bluth_what_specific_things_stand_out_to_you/"
    },
    {
        "id": "1ng5sd8",
        "author": "JonasSharra",
        "title": "What's the best film I've never seen?",
        "content": "I'm a mid 80s kid who worked at blockbuster and a mom and pop video store. Fancied himself a film buff and a future filmaker. Had blockbuster and Netflix subscriptions simultaneously for back catalogue stuff. Dove into films as a way to one up people because I was so much better. Fell in love with my wife during a late night game of 6 degrees where we would both name a random actor/ress and the fastest to connect movies between the two the winner. Told my wife I loved her on Oscar night 2004. Trailed off watching films as the young kids came. Owned thousands of DVDs and bluerays, had to sell nearly all of them over the years during lean times. Some of them still hurt, others were easy to let go of. Stoped being a douche, or at least that flavor of douche. Got into fantasy books instead of films and haven't seen much recently - not to say nothing. Still a bit of a film snob. Given my description of myself, and not a single actual film Ive seen, recommend me the best film I've never seen. Bonus points if it's accessible to stream.",
        "upvotes": 74,
        "comments": 343,
        "media": null,
        "permalink": "/r/movies/comments/1ng5sd8/whats_the_best_film_ive_never_seen/"
    },
    {
        "id": "1ng98nd",
        "author": "EuphoricButterflyy",
        "title": "“Gia” (1998)- Gia Carangi’s final conversation with Linda",
        "content": "",
        "upvotes": 48,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/v2tkrteb20pf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ng98nd/gia_1998_gia_carangis_final_conversation_with/"
    },
    {
        "id": "1ngg64y",
        "author": "atlantacharlie",
        "title": "What are your thoughts on Minority Report?",
        "content": "It seems so ahead of its time - the core premise of Minority Report is a thought-provoking conflict between fate and free will, explored through the use of \"precogs\"—genetically mutated psychics who foresee murders before they happen. This futuristic concept has become a cautionary tale for modern discussions surrounding artificial intelligence, particularly the use of predictive AI in law enforcement and surveillance",
        "upvotes": 10,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1ngg64y/what_are_your_thoughts_on_minority_report/"
    },
    {
        "id": "1nfv9yv",
        "author": "Scire1208",
        "title": "Did John Ottoman win the Oscar for Bohemian Rhapsody because he salvaged the troubled Production?",
        "content": "In 2019 Bohemian Rhapsody's John Ottman won the Academy Award for best editing, while the Film is [known for its editing breaking even basic rules and being very confusing](https://www.youtube.com/watch?v=4dn8Fd0TYek).\n\nNow this has been confusing me for a long time and strengthend my belief that the oscars are mostly arbitrary, but I have recently stumbled upon the following Video. Here the Bullets &amp; Blockbusters alleges, that [John Ottoman was rewarded for salvaging a troubled production](https://youtu.be/eNtviFf3y0w?si=uyqWnBXxqmmjQ5u-&amp;t=518) and not for flawless editing.\n\nIs there any merit to this claim? I struggled to find any other source alleging this.",
        "upvotes": 201,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2XCgpkJPprOf_Z64JdqhTYIrNad2sZ5SCOPYXCquSHY.jpeg?auto=webp&amp;s=4d8b1211df93b0472295f150491d6fa2cdd6af22"
        },
        "permalink": "/r/movies/comments/1nfv9yv/did_john_ottoman_win_the_oscar_for_bohemian/"
    },
    {
        "id": "1ng2fz7",
        "author": "Saint_Gut-Free",
        "title": "The Night Before The Battle, The Soldiers Sing | Glory",
        "content": "",
        "upvotes": 67,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9Fp6DTG_XkSxjQe9Mj2b4PDn7pLivY7TlCKyeXZ5Q8s.jpeg?auto=webp&amp;s=a7dd0e001f5b694ea171481102d79df2ec6209bf"
        },
        "permalink": "/r/movies/comments/1ng2fz7/the_night_before_the_battle_the_soldiers_sing/"
    },
    {
        "id": "1nfxb8b",
        "author": "tk_woods",
        "title": "What movie twist shocked you the most?",
        "content": "I’m not talking about the best twist, or the most clever or well-crafted one. I’m talking about a twist that you absolutely did not see coming. It doesn’t have to make sense, and it can even be kind of dumb—but when you first saw it, you were genuinely shocked.\n\nFor me, that would be Saw. Thinking back, the twist is a little silly and far-fetched, but when I first saw it, my jaw was on the floor for a solid five minutes.",
        "upvotes": 127,
        "comments": 495,
        "media": null,
        "permalink": "/r/movies/comments/1nfxb8b/what_movie_twist_shocked_you_the_most/"
    },
    {
        "id": "1nf2qie",
        "author": "MarvelsGrantMan136",
        "title": "‘Super Mario Bros. 2’ Officially Titled ‘Super Mario Galaxy Movie’",
        "content": "",
        "upvotes": 14852,
        "comments": 1069,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wtisdC4MGnn2Tmp733r3fgSNJkFerkACkvXYUxeZ2Yo.jpeg?auto=webp&amp;s=0403423a6c08f541003c2083fc6b06d6473ac848"
        },
        "permalink": "/r/movies/comments/1nf2qie/super_mario_bros_2_officially_titled_super_mario/"
    },
    {
        "id": "1nfdoqf",
        "author": "EuphoricButterflyy",
        "title": "‘Queen of the Damned’ (2002)- Akasha destroys the bar scene",
        "content": "",
        "upvotes": 2604,
        "comments": 318,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9qp2l6dclsof1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nfdoqf/queen_of_the_damned_2002_akasha_destroys_the_bar/"
    },
    {
        "id": "1nfyu7f",
        "author": "HeStoleMyBalloons",
        "title": "Rob Reiner Breaks Down His Best Shots From The Princess Bride, Spinal Tap and More | My Best Shots",
        "content": "",
        "upvotes": 87,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ek58kYjpvjT5qWerJPx57BGN-jVOSxYZxT19JKYrLK8.jpeg?auto=webp&amp;s=c6a678a4743e791d9c25344098c497c99aee655e"
        },
        "permalink": "/r/movies/comments/1nfyu7f/rob_reiner_breaks_down_his_best_shots_from_the/"
    },
    {
        "id": "1ngltxa",
        "author": "squirreltime22",
        "title": "The Gorge",
        "content": "Just watched this movie, i thought it was super fun but honestly would love too see both of these actors, Miles Teller &amp; Anya Jov, in a Horror/Thriller sci-fi.\n\nI know that's kind of what this movie is but I think both actors would do great in something that truly feels like your stranded with no options.\n\nThe Gorge is an interesting concept but I feel like its too feel good, like they could've done more.\n\nThey could do something great with a movie with interstellar/gravity vibes but stuck on a spaceship/planet with something moving to take them out.\n\nAt the same time battling elements of isolation, obviously space, and some form of scary antagonist that keeps you on the edge of sanity...\n\nRant over.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ngltxa/the_gorge/"
    },
    {
        "id": "1ngi97u",
        "author": "West_West_313",
        "title": "Full metal jacket",
        "content": "Rewatching this masterpiece after a long time and I remember the first part going HARD ending with Private Pyle’s conplete breakdown and murder/suicide. But damn, dude, I do not remember it being this intense. 45m30s is basically the transition from boot camp to vietnam and I’m over here (having watched the movie a few times over the years) actually gasping before the transition lmao! I love movies and there are a few I rewatch fairly frequently, but goddamn this one holds up so well!!",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1ngi97u/full_metal_jacket/"
    },
    {
        "id": "1nf2zv6",
        "author": "MarvelsGrantMan136",
        "title": "Official Teaser Poster for 'The Super Mario Galaxy Movie'",
        "content": "",
        "upvotes": 5623,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vngfzpo2iqof1.jpeg?auto=webp&amp;s=4e158b2fff78ea78598e55b6e540e83d455ce542"
        },
        "permalink": "/r/movies/comments/1nf2zv6/official_teaser_poster_for_the_super_mario_galaxy/"
    },
    {
        "id": "1ng265g",
        "author": "IDCJ1234",
        "title": "Looking for movies with an angry and bitter tone.",
        "content": "Movies that don't sugar coat or disnify the real world, shows you how much the world is a cruel place and you're a cog in the machine, or people/characters being the most angriest, shittiest human beings imaginable.\n\nBoy that sounded depressing but I'm just a guy looking for some movies to watch in these times.",
        "upvotes": 35,
        "comments": 217,
        "media": null,
        "permalink": "/r/movies/comments/1ng265g/looking_for_movies_with_an_angry_and_bitter_tone/"
    }
]