[
    {
        "id": "1jitr3y",
        "author": "TheAssessmentAMA",
        "title": "Hi Reddit–  I’m Fleur Fortuné, the director of THE ASSESSMENT, starring Elizabeth Olsen, Alicia Vikander &amp; Himesh Patel – in theaters now from Magnolia Pictures. Ask Me Anything!",
        "content": "Hi r/movies – I'm Fleur Fortuné, the director of THE ASSESSMENT, in theaters now from Magnolia Pictures. Starring Alicia Vikander, Elizabeth Olsen, Himesh Patel, and Minnie Driver,  the film had its World Premiere at TIFF 2024, and played at the Zurich Film Festival, BFI London Film Festival, and more. The film is my feature directorial debut, but I've been directing music videos (like some for Skrillex, Drake, Pharrell Williams, and Travis Scott), commercials, and shorts until now. More on the film:\n\nTHE ASSESSMENT follows Mia (Olsen) and Aaryan (Patel), a successful couple who hope to become parents in a near future where resources are extremely limited and the government keeps firm control over reproduction. They are assigned an assessor named Virginia (Vikander), who moves into their home for seven days to evaluate whether they deserve to move forward in their parenting journey. What Mia and Aaryan are hoping is a routine test quickly unravels into a psychological nightmare, forcing them to question the very foundations of their society and what it truly means to be human.\n\nTHE ASSESSMENT is now in theaters, and you can check out screenings in your area here: \n\n[https://www.theassessmentmovie.com/movie/the-assessment/book-now](https://www.theassessmentmovie.com/movie/the-assessment/book-now)\n\nOfficial Trailer:\n\n[https://youtu.be/bYmELiSalx0](https://youtu.be/bYmELiSalx0)\n\nTalk to you all later! Back at 1:15 PM today to answer any questions.\n\n",
        "upvotes": 116,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qtt4lxkdrnqe1.png?auto=webp&amp;s=259793575f199a0a3f4d1b7c27480775a54ba966"
        },
        "permalink": "/r/movies/comments/1jitr3y/hi_reddit_im_fleur_fortuné_the_director_of_the/"
    },
    {
        "id": "1jj2j39",
        "author": "SanderSo47",
        "title": "March 21-23 Box Office Recap: It was another terrible weekend, as 'Snow White' flopped with an awful $85.3 million worldwide, against a $270 million budget. Meanwhile, 'The Alto Knights' also flopped with just $3.1 million domestically.",
        "content": "https://preview.redd.it/t9od7mdwgpqe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=8dbdf627ab9d7355869c0772f7334f9c0b3a6c65\n\nAnother brutal weekend at the box office.\n\nDespite topping the box office, ***Snow White*** massively flopped in its opening weekend, indicating it was a bad apple after all. But that wasn't the only flop this weekend. WB also released ***The Alto Knights***, and it had one of the worst debuts for a film playing at over 2,500 theaters. Oh and there was also the long-delayed debut of ***Magazine Dreams***, which unsurprisingly tanked in 815 theaters.\n\nThe Top 10 earned a combined $68.5 million this weekend. That's off a rough 30.3% from last year, when ***Ghostbusters: Frozen Empire*** topped the box office.\n\nDebuting in first place, ***Snow White*** flopped with just $42.2 million in 4,200 theaters. This debut is lower than the live-action ***Dumbo*** remake ($45.9 million), coincidentally another adaptation of a very old Disney property. It's so far off from other recent films like ***The Little Mermaid*** ($95.5M), ***Maleficent*** ($69.4M), and ***Cinderella*** ($67.8M).\n\nThe bad news don't stop there. These numbers are eerily similar to the debut of ***The Marvels*** ($46.1 million), which also had a similar budget to ***Snow White*** ($270 million). So yep, ***Snow White*** is performing right on par with one of the biggest flops in movie history.\n\nWhile Disney has had success with their live-action remakes, there's always that black sheep that deviates from the formula and that's the case with ***Snow White***. The film had a similar case to ***Dumbo***, in that the original films are very old (the original ***Snow White*** is 88 years old and ***Dumbo*** is 84 years old). While the public is aware of these films and know they're iconic, perhaps their popularity hasn't been as big as other animated films like ***The Lion King***, ***Aladdin*** or ***Beauty and the Beast***.\n\nIt didn't help that ***Snow White*** has been done to death for the past decades. So it falls into the same problem as other stories like ***Robin Hood***, ***The Three Musketeers***, or ***Sherlock Holmes***, in that the public can recognize them but that doesn't mean they'll watch everything with them. Of course, some hit bigger than others. In 2012, ***Snow White and the Huntsman***, a dark reimagining, made almost $400 million worldwide. Simply put, the Disney remake didn't offer much to differentiate itself from other adaptations.\n\nAlright, now we have to address two big problems with the film, which are main factors for its performance. The first involves the Seven Dwarfs, which are, obviously, pivotal to the story. Back in 2022, Peter Dinklage expressed his frustration with the film, deeming it a \"backward story\". So Disney decided to simply... make the Dwarfs with CGI instead of casting actors with dwarfism. And the design used for the film simply looks... awful. Even though Dinklage faced backlash for his comment, it was Disney who made the decision to listen and act upon it. But that's not everything.\n\nRachel Zegler has been the subject of media attention since 2022, when she made comments joking about the Prince and Snow White's characterization in the original film. These comments have been in the eye of the public for the past years, drawing negative attention to the remake. Gal Gadot didn't escape criticism either; not just for her perceived lack of acting range, but because of her Israel support. Whether you agree or not with everything just mentioned, it's clear the general audience wasn't content in the slightest with anything.\n\nSo that's basically it. It's a simply a factor of so many decisions that went awry, as well as an incredibly high $270 million budget. Disney knew this, which is why they scaled back on the premieres and press junkets for the film. Add in very weak reviews (44% on RT), and the film has already lost so many people.\n\nAccording to Disney, 68% of the audience was female and 47% was in the 18-34 demographic. Even though it's a family film, only 15% of the audience was 17 and under. So kids were pretty much not interested in the film.\n\nThe long term prospects for ***Snow White*** don't look great. It received a lukewarm \"B+\" on CinemaScore, which is worse than any of the Disney live-action remakes, and suggests word of mouth will only be a bit better than its reviews. With competition like ***A Minecraft Movie*** coming up, ***Snow White*** is unlikely to leg out and it's set to be one of the lowest Disney remakes. For now, a domestic total around $110 million is likely. Which means it will make less money than ***Snow White and the Seven Dwarfs*** ($184.9 million) and that's not even adjuste for inflation! Another failure for Disney this year.\n\nSteven Soderbergh's ***Black Bag*** kept the second place spot, earning $4.2 million this weekend. That's a good 44% drop from last weekend, although its numbers are still way too small to make it look notable. Through 10 days, the film has earned $14.7 million, and it will finish with over $20 million domestically.\n\n***Captain America: Brave New World*** may have weak word of mouth, but the very lack of competition is working wonders. The film eased just 29%, adding $4 million this weekend. That took its domestic total to $192 million.\n\nAfter topping the box office last week, ***Novocaine*** felt a gut punch this weekend. The film dropped a very rough 58%, earning $3.6 million this weekend and falling to fourth place. That's just brutal, although it's a better drop than Jack Quaid's previous film, ***Companion***, which collapsed 67.7% (but ***Companion*** faced the Super Bowl in its second weekend). Through 10 days, the film has earned a meager $15.6 million, and won't make it much further than $20 million, especially with three wide releases coming up this weekend.\n\nWith the loss of PLF screens, ***Mickey 17*** suffered another rough drop this weekend. It dropped 51% and added $3.6 million this weekend. The film has earned a very weak $40 million, and with the film hitting PVOD tomorrow, it will continue falling. For now, it should finish with around $45 million domestically.\n\nIt's not until sixth place where we find the other newcomer, WB's ***The Alto Knights***. Debuting in 2,651 theaters, the film flopped with a horrific $3.1 million this weekend. That's one of Robert De Niro's worst debuts as leading man, as well as the 26th worst debut for a film playing at over 2,500 theaters.\n\nThe film achieved some notoriety, given that it was the first film greenlit by David Zaslav when he joined Warner Bros. Discovery back in 2022. But there were already signs that the film would struggle. For starters, director Barry Levinson had a very successful career... but that peaked in the 90s. His films in the 21st century have been flopping across the board, suggesting he might not deliver the quality he once commanded. Not to mention that gangster films haven't fared well in the past few years.\n\nThere's also the very weird decision to cast Robert De Niro in the roles of both Vito Genovese and Frank Costello, even though they are not twins nor anything. WB has also moved the release date, and the first trailer didn't premiere till two months ago, which is a very short release window for a major film. And despite the amount of names attached, reviews were very poor (39% on RT). The film simply couldn't overcome the \"been there, done that\" feeling that plagued other gangster films.\n\nAccording to WB, 58% of the audience was male. Unsurprisingly, it skewed massively old; 77% of the audience was 35 and over, and 33% over 55. They gave it a middling \"B\" on CinemaScore, which is simply not good for its long-term prospects. With many new releases coming up, ***The Alto Knights*** will disappear quickly from theaters. It would be a surprise if it finished anywhere close to $10 million.\n\n***The Day the Earth Blew Up: A Looney Tunes Movie*** added $1.8 million this weekend. That's a 41% drop, which isn't bad, but it's kinda rough for an animated film. Through 10 days, the film has earned just $6.5 million so far. Despite these low numbers, Ketchup looks content with its performance, given that they are currently bidding $50 million to acquire ***Coyote vs. Acme***.\n\nIn eighth place, Neon's ***The Monkey*** eased 39%, adding $1.5 million. That takes its domestic total to $37.8 million.\n\nIn ninth place, DreamWorks' ***Dog Man*** dropped 42% and added $1.4 million this weekend. The film has amassed $95.6 million and it's on its last legs to hit the $100 million milestone.\n\nRounding up the Top 10 was ***The Last Supper***, which added $1.3 million this weekend. That's off 51% from last week, which is a very bad drop for a Christian drama. Through 10 days, the film has earned $5.3 million so far.\n\n2 years after its debut in Sundance, ***Magazine Dreams*** has finally hit theaters. Released by Briarcliff in 815 theaters, the film tanked with just $701,365 this weekend. This shouldn't be a surprise to anyone; you really expect the public to pay a ticket for a film with Jonathan Majors?  \n\nRLJ Entertainment also released ***Ash*** in 1,136 theaters, but the film flopped with a terrible $689,144. Expect it to fade quickly.\n\n#**OVERSEAS**\n\n***Snow White*** led the overseas box office, yet its numbers were far below the most pessimistic scenario. It debuted with a very weak $43.1 million overseas, for a terrible $85.3 million worldwide debut. Wow, not even hitting $100 million is pathetic. The film had very weak numbers in the UK ($5.1M), Mexico ($4.1M), Italy ($4M), France ($3M) and Spain ($2.6M). With a debut this soft, you can count on something: the film is not making it to $300 million worldwide, and $250 million could be in danger if it collapses. As mentioned, this cost $270 million. Big, big failure.\n\n***Mickey 17*** added $8.7 million this weekend, taking its worldwide numbers to $109.8 million. The best markets are South Korea ($19.6M), UK ($7.5M), France ($6.8M), Germany ($3.6M) and Mexico ($3.3M).\n\n***Captain America: Brave New World*** added $3.1 million, allowing the film to cross $200 million worldwide. The best markets are the UK ($22.5M), Mexico ($16M), China ($14.4M), France ($14M) and Korea ($11.4M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Love Hurts* | Feb/7 | Universal | $5,800,440 | $15,683,090 | $17,561,938 | $18M\n\n- Well, it truly lived up to its title. ***Love Hurts*** has ended its run with a very poor $17 million, below its already low $18 million. While Ke Huy Quan is in the middle of a return to films, this was an offer he was better off turning down. He reportedly accepted the role after Steven Spielberg convinced him. Ouch.\n\n#**THIS WEEKEND**\n\nThere's three wide releases this weekend. And while ***Snow White*** will probably continue at the top spot, one film will fight to be as close as possible.\n\nThat film is Amazon MGM's ***A Working Man***, starring Jason Statham. The plot is... come on, you watch a Jason Statham film for the plot? What's important is that it's action, that's it. Statham is a very reliable name, with his latest film, ***The Beekeeper***, earning over $150 million worldwide last year. \n\nThere's also the release of A24's ***Death of a Unicorn***, which stars Paul Rudd and Jenna Ortega as a father and daughter who accidentally hit and kill a unicorn, causing them to be hunted down by its parents. Despite a promising premise, reviews out of SXSW aren't glowing (currently at a middling 64% on RT).\n\nThe other release is Universal/Blumhouse's ***The Woman in the Yard***, which follows a family that sees a strange woman, dressed in all black, staying in their yard. Blumhouse is currently not at its best; their previous film, ***Wolf Man***, was one of their few box office flops. With a very generic premise and lack of buzz, it'd be a surprise if this film got close to $10 million this weekend.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 405,
        "comments": 201,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pi-uj-bf5vpFW0cy3BAfQMiafvW_SBzWcqr_4YALda8.png?auto=webp&amp;s=3271e95b62f00bb481bbe7e1d4a734381663dc91"
        },
        "permalink": "/r/movies/comments/1jj2j39/march_2123_box_office_recap_it_was_another/"
    },
    {
        "id": "1jiw7cm",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tony Todd in 'Final Destination Bloodlines', His Final Film Role",
        "content": "",
        "upvotes": 7201,
        "comments": 300,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cxcsmfqs8oqe1.jpeg?auto=webp&amp;s=b86a30f6e2c204df6daf6f18eb38ea1d9583393e"
        },
        "permalink": "/r/movies/comments/1jiw7cm/first_image_of_tony_todd_in_final_destination/"
    },
    {
        "id": "1jj55jz",
        "author": "crome66",
        "title": "Jellyfish Pictures, Animation Producer Of 'Dog Man,' Shuts Down Amid Industry Crisis",
        "content": "",
        "upvotes": 1014,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fRTaWLaFyT1MMCbUOQjh8hqK7YObSsjmZ6-G8b1nbE0.jpg?auto=webp&amp;s=69ca9b79f16573ef4786a848c43784c8a1100fba"
        },
        "permalink": "/r/movies/comments/1jj55jz/jellyfish_pictures_animation_producer_of_dog_man/"
    },
    {
        "id": "1jisip5",
        "author": "RVarki",
        "title": "Seth Rogen doesn't get enough credit for the sheer volume of decent to high-quality movies and shows he's made",
        "content": "Seth Rogen has been a major figure in the film industry for almost two decades now, and in that time, a lot has been said about him, his abilities, the type of movies he makes and more recently, his political values\n\nThe one thing I've rarely seen people discuss is his insane record in terms of well made [movies and shows ](https://www.rottentomatoes.com/celebrity/sethrogen)(both as a performer and producer)\n\nJust in the past few years, he has acted in movies like Dumb Money, Fablemans, Long Shot and American Pickle, while producing TMNT:Mutant Mayhem, Joy Ride, Good Boys and Blockers. That's without talking about his hit-making run in the mid 2000s to mid 2010s, or his TV show resume, which is arguably even more impressive (he's literally about to come out with a show that has near-universal critical acclaim pre-release)\n\nUnlike other leading men who have a lot of well regarded stuff in their filmography, Rogen isn't really playing a numbers game. The man hasn't really been in a whole lot, it's just that a large portion of what he does do, is some version of good\n\n",
        "upvotes": 5235,
        "comments": 608,
        "media": null,
        "permalink": "/r/movies/comments/1jisip5/seth_rogen_doesnt_get_enough_credit_for_the_sheer/"
    },
    {
        "id": "1jiq8x5",
        "author": "BunyipPouch",
        "title": "First Image from Dystopian-Thriller 'The School Duel' - Starring Oscar Nunez ('The Office') and Kelsey Darragh - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 5946,
        "comments": 702,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bh672p4svmqe1.jpeg?auto=webp&amp;s=8c35292babaf0dc81e909626f1aa8a8200fa3b14"
        },
        "permalink": "/r/movies/comments/1jiq8x5/first_image_from_dystopianthriller_the_school/"
    },
    {
        "id": "1jiz14c",
        "author": "bluemonday239",
        "title": "No Other Land co-director attacked by settlers and arrested by the Israeli army",
        "content": "",
        "upvotes": 1778,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OXQYlMpysJcB3uOBddbYgfAvXcmSboRx9QuBb5Oykh4.jpg?auto=webp&amp;s=8da393b7b1c7178097ad15c9621ebf75bfc8d0e1"
        },
        "permalink": "/r/movies/comments/1jiz14c/no_other_land_codirector_attacked_by_settlers_and/"
    },
    {
        "id": "1jiq3v9",
        "author": "DemiFiendRSA",
        "title": "New Official Poster for A24's 'Death of a Unicorn'",
        "content": "",
        "upvotes": 3931,
        "comments": 214,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aii8z6miymqe1.jpeg?auto=webp&amp;s=6e668a4ee68ffb54db98d6171335b7816b84b514"
        },
        "permalink": "/r/movies/comments/1jiq3v9/new_official_poster_for_a24s_death_of_a_unicorn/"
    },
    {
        "id": "1jj65wc",
        "author": "Alternative-Cake-833",
        "title": "Intermissions Are Standard in India — Even Filmmakers Can't Stop Them",
        "content": "",
        "upvotes": 420,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iR7HGARx_bWU5s4hXNMv_WoWFbSOd3Wo0m5LdF8Fkfo.jpg?auto=webp&amp;s=2a5de5523a0dc1069ef44fadc5946576b86ea832"
        },
        "permalink": "/r/movies/comments/1jj65wc/intermissions_are_standard_in_india_even/"
    },
    {
        "id": "1jjbsk3",
        "author": "purelyinvesting",
        "title": "What’s the Best Movie Twist You Never Saw Coming?",
        "content": "There are plot twists, and then there are *those* plot twists. The kind that make you sit in silence during the credits, questioning everything you just watched. The ones that make you want to immediately rewatch the movie just to catch all the hints you missed.\n\nFor me, *The Sixth Sense* was a game-changer. The way the twist recontextualized the entire movie was genius—I had to pick my jaw up off the floor. Then there’s *Fight Club*, which completely shattered my perception of what I had just seen. The unreliable narrator trope had never hit me that hard before.\n\nAnd don’t even get me started on *The Prestige*. That final reveal still lives rent-free in my head. The moment you realize just how far Borden and Angier went for their craft? Chilling.\n\nWhat’s a movie twist that absolutely blew your mind? The kind that made you rethink everything as soon as the credits rolled?",
        "upvotes": 142,
        "comments": 429,
        "media": null,
        "permalink": "/r/movies/comments/1jjbsk3/whats_the_best_movie_twist_you_never_saw_coming/"
    },
    {
        "id": "1jj4e6c",
        "author": "_BestThingEver_",
        "title": "First Official Poster for The Storm Queen (2026)",
        "content": "",
        "upvotes": 379,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a3393efwupqe1.jpeg?auto=webp&amp;s=16779c1455d54527510a36347a1c132355706359"
        },
        "permalink": "/r/movies/comments/1jj4e6c/first_official_poster_for_the_storm_queen_2026/"
    },
    {
        "id": "1jjapgs",
        "author": "ShaunisntDead",
        "title": "The Deer Hunter is devastating and I haven't seen another film quite like it",
        "content": "This has been one of my favorite films since I was 18 years old, it hit me at just the right age I think. I love this movie. I don't find it slow at all. I love the pace of the opening and the wedding sequence. It feels like a documentary. It gives us time to get comfortable with the characters as real human beings, not just movie characters. The acting is so naturalistic. Every scene in Clariton feels very much like an Altman ensemble film with its wandering camera, overlapping dialogue and the very naturally realistic acting style. The characters aren't given big monolgues to express themselves, they do it all in a look. Character interaction and quick expressive moments build the characters and their stories without pandering to the audience. It's an exceptionally subtle piece of filmmaking. The fact that Michael and Nick are in love with the same woman is pretty clearly set up in the wedding sequence. Nick is very often framed with a stuffed deers head on the wall, foreshadowing his death by \"one shot\" later in the \n\n\nThe film deals with so many themes that are crystallized in the famous POW sequence. The gambling over death defying acts of masculinity is set up earlier in the film with Michael and Nick gambling over the car race. Their focus on guns and the 'one shot' philosophy is set up during the deer hunting sequence. The idea of never leaving a friend behind is set up when they jokingly leave John the bartender on the side of the road when driving to hunt the deer. Michael's use of a flamethrower is set up in the opening scene when he's making steel in the hellish factory. The death of SPOILERS Nicky is foreshadowed by his repeated framing with a stuffed deers head and a photo of JFK.\n\nThere is quite a bit more subtle foreshadowing and callbacks throughout the film but I'll stop here. It's a very subtle, emotional, beautifully atmospheric small town epic. It feels like a novel that gets better on repeat viewings. ",
        "upvotes": 129,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1jjapgs/the_deer_hunter_is_devastating_and_i_havent_seen/"
    },
    {
        "id": "1jj7jdz",
        "author": "mildOrWILD65",
        "title": "Jack Reacher 2012",
        "content": "Top edit:\n\nBegin edit:  I have never read any of the books. I totally understand all the comments respecting the books. I have not read any of them. My observation on the first movie stands by itself in a vacuum. End edit\n\n\nI'm not a huge Tom Cruise fan, he's done some good films, shadowed by his involvement with Scientology, but whatever. He's a decent actor.\n\nI was channel surfing and came across this first Jack Reacher movie. So, first of all, I don't understand the criticism that he wasn't this huge muscle-bound macho guy. He played the role well and was a good fit for it, I thought.\n\nMost of all, holy Hell! This was a great movie. A solid thriller with a well-thought mystery behind the premise. There was enough action to keep it moving along, without going over the top, and only one car chase scene, which had a funny conclusion. That's Pittsburgh for you!\n\nI'd watch it again and if you haven't, it's worthwhile.",
        "upvotes": 204,
        "comments": 191,
        "media": null,
        "permalink": "/r/movies/comments/1jj7jdz/jack_reacher_2012/"
    },
    {
        "id": "1jj1tgj",
        "author": "MarvelsGrantMan136",
        "title": "‘Saw XI’ Removed From Lionsgate Calendar as ‘Strangers: Chapter 2’ Takes Its Slot (September 26)",
        "content": "",
        "upvotes": 191,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wg5FZ5G-ggyMOOOyajmNJBqJ6YNqUOGOVKW7lXuudno.jpg?auto=webp&amp;s=bd8be2e00657bd8285aad164d3b27abb6824e20e"
        },
        "permalink": "/r/movies/comments/1jj1tgj/saw_xi_removed_from_lionsgate_calendar_as/"
    },
    {
        "id": "1jiu6yn",
        "author": "NoCulture3505",
        "title": "Apple Officially Lands UFO-Disclosure Project From Joseph Kosinski And Jerry Bruckheimer",
        "content": "",
        "upvotes": 349,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AfbAub5iR1Jc7lnOY-Zc0qB8SAJCOQGrhJyyOdvxbbw.jpg?auto=webp&amp;s=f810cc46d00339c7db418030f586c79f4f7b1ccb"
        },
        "permalink": "/r/movies/comments/1jiu6yn/apple_officially_lands_ufodisclosure_project_from/"
    },
    {
        "id": "1jj8n2x",
        "author": "KillerCroc1234567",
        "title": "‘Street Fighter’ Removed From Sony Release Calendar, ‘Beneath the Storm’ Shifts to July 2026 and Renamed ‘Shiver’",
        "content": "",
        "upvotes": 58,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NzVIElAVSV821cFEHB9tuFroRW57u3cRxExUnO_TSqo.jpg?auto=webp&amp;s=bd4d985f70972a7f51481d1e84f72110565a00e7"
        },
        "permalink": "/r/movies/comments/1jj8n2x/street_fighter_removed_from_sony_release_calendar/"
    },
    {
        "id": "1jivohk",
        "author": "MarvelsGrantMan136",
        "title": "Nicholas Hoult To Star In Bank Heist Movie From Amazon MGM Studios With David Leitch Directing",
        "content": "",
        "upvotes": 245,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hq68tCKHNOifREmo1_2R4TTRThiFDbbUeDyIW62nMqk.jpg?auto=webp&amp;s=e0f3ded3cdde1a46e3492fc324891f3e572eefd2"
        },
        "permalink": "/r/movies/comments/1jivohk/nicholas_hoult_to_star_in_bank_heist_movie_from/"
    },
    {
        "id": "1jik8bc",
        "author": "BenTheDiamondback",
        "title": "Could “Hot Rod” be the Best Movie Ever Made? No. But Yes. Probably.",
        "content": "I came late to this movie. Years late. A decade even. My daughter knew we loved “Popstar: Never Stop Never Stopping” thus, she said, we should love “Hot Rod.” \n\nBruh.\n\nI never laugh during an initial viewing of a comedy. Don’t know why, but any comedy I see the first time, it might elicit a chuckle here or there, maybe a chortle or a slight guffaw, but that’s about it. “Hot Rod” had me cackling the first time I watched it, and every time I’ve watched it since, I still laugh hard.\n\nSo unbelievably quotable… “Cool beans,” “BABE, WAIT, BABE!” “Yoo-hoo shitheads, I found this bag of fireworks in the men's restroom. Would you guys like to light them off?” “Let me join your crewwwWWW?” “I’ve been drinking green tea all goddamn day!” “You guys, the bathroom here is nuts!” “Ultimate punch!” “Pussyyyyyyyyyy…” “I’m Rod and I like to party.” “I said you look shitty! Goodnight, Denise!”\n\nPerfect soundtrack! Effing EUROPE songs throughout. The “You’re The Voice” montage! We know the story takes place in the age of the internet, but when? It’s timeless, sorta. 80s glam metal songs with earnest lyrics, clothes vehicles and houses that could put you in any of the last five decades. \n\nStill cannot believe this movie even exists. Thank god it does. With all of the frightened studio execs unwilling to take risks on anything because audiences are unpredictable and unreliable, for Paramount to basically go, “OK idiots, here’s $25 million, go make a movie,” it’s baffling to me. It’s also a shame this movie is still not as well known as it deserves. I would have thought, y’know, long tail rules, “Hot Rod” would have made its money back by now.\n\nI’m dropping this here for appreciation of a damn funny movie that deserves more viewers.",
        "upvotes": 1443,
        "comments": 426,
        "media": null,
        "permalink": "/r/movies/comments/1jik8bc/could_hot_rod_be_the_best_movie_ever_made_no_but/"
    },
    {
        "id": "1jj2yw6",
        "author": "Sisiwakanamaru",
        "title": "Dolby and Christie to Launch New Dolby Vision Projector in Effort To Expand Premium Theater Locations",
        "content": "",
        "upvotes": 76,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r8KSUtdPD8Mo6e4ZldQLGYEBNpuXvF8rRgbm5sBldvI.jpg?auto=webp&amp;s=24c2f11a08c23a9fc9c5ae1480bd5a81ea4f81cd"
        },
        "permalink": "/r/movies/comments/1jj2yw6/dolby_and_christie_to_launch_new_dolby_vision/"
    },
    {
        "id": "1jjf5p6",
        "author": "GadMraz",
        "title": "Jude Law as Putin on the set of the movie \"The Kremlin Wizard\"",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s49vu74wxsqe1.jpeg?auto=webp&amp;s=a62b1014cfc8604b4b3b9b55a00824e74115ccff"
        },
        "permalink": "/r/movies/comments/1jjf5p6/jude_law_as_putin_on_the_set_of_the_movie_the/"
    },
    {
        "id": "1jj4roc",
        "author": "thebradmoshpit",
        "title": "Pavements | Official Trailer",
        "content": "",
        "upvotes": 52,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7dSpj0FZmwAVTvCgE_2sUG9hSWgz8TYPB-iZfg7qJZc.jpg?auto=webp&amp;s=fbbbb575de31b139301c913a5732958fb158c0c0"
        },
        "permalink": "/r/movies/comments/1jj4roc/pavements_official_trailer/"
    },
    {
        "id": "1jiw6le",
        "author": "Task_Force-191",
        "title": "Hans Zimmer’s Closet Picks",
        "content": "",
        "upvotes": 136,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YgRQCTsqtKUZcARq8Qxi06XmHqo-rtAZLKGJgCpzSCc.jpg?auto=webp&amp;s=9d22602a3627be47d8a8465c9e1d2f9ec36c4e32"
        },
        "permalink": "/r/movies/comments/1jiw6le/hans_zimmers_closet_picks/"
    },
    {
        "id": "1jipz3u",
        "author": "Tall_Ant9568",
        "title": "What is the saddest or most emotionally jarring scene you’ve ever seen in science fiction?",
        "content": "Some contenders for me: \n\nThe Death of Boromir (LOTR)\n\nThe flute episode of Star Trek TNG\n(The Inner Light)\nSeason 5 Episode 25\n\nThe death of Cedric in Harry Potter\n\nThe end scene of Armageddon where Harry gives his last speech to his daughter:\n\n\nHarry Stamper: I know it baby. But there won't be anything to be scared of soon. Gracie, I want you to know that AJ saved us. He did. I want you to tell Chick, that I couldn't have done it without him. None of it. I want you to take care of AJ. And I wish I could be there to walk you down the aisle, but I'll... I'll look in on you from time to time, okay honey? I love you Grace.\n\n\nKingdom hearts where the world is breaking apart and it’s playing ‘Please don’t walk away’ and Sora tries to grab Kairi’s hand.\n\nEdit for: Science fiction or fantasy ",
        "upvotes": 273,
        "comments": 911,
        "media": null,
        "permalink": "/r/movies/comments/1jipz3u/what_is_the_saddest_or_most_emotionally_jarring/"
    },
    {
        "id": "1jit3br",
        "author": "NoCulture3505",
        "title": "Jack Reynor Boards Lee Cronin’s ‘The Mummy’ For Atomic Monster &amp; Blumhouse",
        "content": "",
        "upvotes": 155,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h20YXoOzmlPnRZd0rnrc2hxE2n0DUPQj8Co4WujAmS0.jpg?auto=webp&amp;s=bc82b69f22dff8f1f7f002bf5d22dd674b779a98"
        },
        "permalink": "/r/movies/comments/1jit3br/jack_reynor_boards_lee_cronins_the_mummy_for/"
    },
    {
        "id": "1jirixr",
        "author": "Coolnave",
        "title": "\"Flow\" - How the Cat-Whale dynamic resonated with me after my mom's suicide",
        "content": "I finally watched Flow yesterday at one of the last screenings here in France, and feel so spoken to. As someone who has lost a lot of people these past few years and felt responsible for the actions of others, the theme of people entering and leaving your life during their own journey gave me a lot of parallels.\n\nBut the Cat's relationship to the Whale really resonated with me, in my heart before I could explain it. I first saw this dynamic as a \"help where you can and accept when you can't\" moral:\n\n&gt;The Whale saving the Cat, while literally lifesaving for the Cat was just a bit of effort on the Whale's part, maybe just an afterthought in its day. However, this situation could only be manufactured through the absurd scenario of the flood, where Whale just happened to have the skills needed to help. When the flood ends, the Cat is the only one with the skills/intelligence to get the rope out of the tree and help save the animals on the boat. When the Cat finds the Whale again -beached in a forest, another absurd scenario-, there is nothing he can do other than comfort the Whale while it dies. We aren't all built with the right tools for every scenario, and some problems are beyond our means, we are not able to save everyone, even if that person had previously saved us and we feel indebted to them. A very stoic moral that preaches forgiving yourself.\n\nBut I couldn't figure out why it was so powerful to me, so I went for a walk under the nighttime drizzle after the movie. I then realized that I saw the Cat &amp; Whale's relationship as that of me and my mother, who lost her battle with bipolar disorder almost 2 years ago. \n\n&gt;In addition to saving the Cat, the Whale was following the boat, serving as a source of comfort in a sea of danger. If something goes terribly wrong, the Whale would be there to save the Cat again. My mother, and most people's parents, was that source of comfort, and it's thanks to her that I am alive today, simply by virtue of being her child. She followed my boat as I sailed through the troubled waters of divorced parents, being moved as a child to a country whose language I did not speak, and through any other challenges in my life.\n\n&gt;I have spent the past 2 years guilting myself since I found her dead. With a better son, she would still be alive -despite the fact that I had already stopped 2 of her attempts and was the only thing left giving her joy in life-. And while that may be partly true simply due to the butterfly effect, for the most part, I have to accept that the external circumstances (bipolar disorder &amp; suicidal / a beached whale in the middle of the forest) were far too overwhelming. \n\nIf I watched \"Flow\" and could \"forgive\" the Cat for not being able to save the Whale, then I have to forgive myself for not being able to save my mom.",
        "upvotes": 151,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1jirixr/flow_how_the_catwhale_dynamic_resonated_with_me/"
    },
    {
        "id": "1jjbjy7",
        "author": "kahnkahn0227",
        "title": "What are the movies or quotes related to Regret that have changed your view of the world or life?",
        "content": "Regarding \"regret,\" I've recently realized something. When watching movies before, I used to get so deeply immersive that I'd silently mutter to myself: \"Why did he do that? He'll regret it, what happens next?\" I noticed my grandmother does the same - I inherited this mindset from her, constantly regretting even the smallest things in life. But while rewatching some films recently, something suddenly hit me. Especially in “The Butterfly Effect”, where Evan tried to eliminate regrets by changing the past, but fell into a more tragic cycle. The mother's final advice is: \"Some things are better left forgotten.\" This has started shifting my perspective. I should keep moving forward instead of always regretting the facts that cannot be changed. Some regrets have to become regrets as they are to truly define life.",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jjbjy7/what_are_the_movies_or_quotes_related_to_regret/"
    },
    {
        "id": "1jj8kvn",
        "author": "Kangarou",
        "title": "Locked (2025)",
        "content": "Saw the movie today, didn't see an official thread for its discussion.\n\n[Here's a wiki link](https://en.wikipedia.org/wiki/Locked_(film))\n\n[Here's its Rotten Tomatoes page](https://www.rottentomatoes.com/m/locked)\n\nQuick synopsis: a man turns his car into a booby trap that locks-in the next person attempting to steal from it. That next person is a petty thief ironically looking to fleece items for a car repair. Torture of both the psychological and physical nature ensues.\n\nI enjoyed it overall. Keeps good tension overall, and the characterization is solid. Skarsgard puts on a good performance, which is good since he's 90% of the screentime. It's also bloodier than I expected, like the movie is one really elaborate test from the Saw franchise. It gets somewhat political, with \"William\" the car owner being a bundle of Conservative talking points, but his actions establish him as the bigger villain overall even if you agree with his ideology (and I don't think you're supposed to, anyway. Some parts of his statements come off as plain wrong, and he gets called out by Eddie for being a psychopath). \n\nDid you see the movie? Thoughts or comments?",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jj8kvn/locked_2025/"
    },
    {
        "id": "1jifdgh",
        "author": "MrGittz",
        "title": "The one Disney animated film that BEGGED to be made into a franchise/series but never did? THE GREAT MOUSE DETECTIVE. Oh how I wish we could’ve had more adventures with Basil of Baker Street",
        "content": "I know everyone always goes on about the Little Mermaid, Beauty &amp; The Beast, Aladdin etc. (&amp; those are wonderful films)\n\nBut for me? 1986’s “The Great Mouse Detective” is the **PERFECT** animated Disney film. I love practically every frame. The music, the voice acting &amp; animation? It’s wonderfully charming. Disney doing Victorian era London is always special &amp; atmospheric. \n\nFor those who don’t know the premise? It’s simple. What if Sherlock Holmes…was a mouse. Solving mice crimes. All while living in mouse hole tucked away in actual human Sherlock Holmes address of Baker Street\n\nThis movie was completed in that sweet spot where Disney had yet to make the switch to digital coloring(aka digital Ink &amp; paint aka the CAPS system) and so this film has that warmth &amp; charm that was a little bit lost when the conversion was made circa the early 1990s. It does have a very early CGI sequence in an animated film, the terrific Big Ben Clock climax. (The gears were created digitally and then traced over, not actually rendered out to film or composited digitally)\n\nSo what makes the film so special? The characters. The characters! I know this isn’t technically “Sherlock Holmes” BUT if it were, this would be my favourite rendition of the great detective. \n\nLike all great Sherlock adaptations it’s the Sherlock/Watson relationship that is the true measure of success and this movie takes the cake. David Q Dawson is our Watson stand in, he’s a caring albeit clumsy mouse, compared to Basil’s man(er..mouse) of action. They just have terrific chemistry. You buy them as friends instantly. \n\nAnd it’s this reason more adventure were needed. I don’t care in what form. Straight to video, animated series or legit theatrical sequel. So long as the same voice actors were used? Give me more! But alas, it was not meant to be. After Little Mermaid and the rest become huge cultural juggernauts, there was no more room for the relatively modest successful fare like The Great Mouse Detective. And we are all the poorer for it. Also unlike most those other films, this isn’t a musical. There’s one scene where characters break out in song. And it’s great.\n\n\nI’ve often wondered if Disney would do the same “live action” remake route befallen to so many of the animated films. Maybe in time but you’ll never do better than Vincent Price as Ratigan, Barrie Ingham as Basil and Val Bettin as Dawson. RIP.\n\nAnd that score by Henry Mancini? Now that’s a theme! Remember when we had memorable musical themes? \n\nSo? For those who haven’t had the pleasure or for those who have &amp; haven’t had the pleasure in awhile, go check out The Great Mouse Detective, bask in its charm, warmth, heart and splendor. \n\nThis movie deserved to be a franchise.",
        "upvotes": 1331,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1jifdgh/the_one_disney_animated_film_that_begged_to_be/"
    },
    {
        "id": "1jje2e5",
        "author": "Van_Can_Man",
        "title": "Late 90s, Mid-Aughts Classics That I Feel Like Deserve More Acclaim (add yours)",
        "content": "Brick, Push, The Faculty, Mystery Men, Mirrormask (modern acknowledgment that NG is apparently a shitty guy), there are probably others but it’s late as I post this and I’m a bit ragged. \n\nI lived in Hollywood around this time and there was an interesting vibe for a hot minute for indie visions. \n\nSo anyway I’m curious what other films y’all think are overlooked awesomeness even if they perhaps weren’t fully manicured. ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1jje2e5/late_90s_midaughts_classics_that_i_feel_like/"
    },
    {
        "id": "1jivm9m",
        "author": "TheBlackSwarm",
        "title": "Clown in a Cornfield | Official Trailer | In theaters May 9",
        "content": "",
        "upvotes": 64,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VQQsB7Mm839aExLCDSlnOcLhtaqu7PWiuh2xzFxqxgE.jpg?auto=webp&amp;s=d8b6bbe24936b1be19ba24c3f15c806fa77edd0a"
        },
        "permalink": "/r/movies/comments/1jivm9m/clown_in_a_cornfield_official_trailer_in_theaters/"
    },
    {
        "id": "1jigwf0",
        "author": "UNAMANZANA",
        "title": "My biggest problem with the Terrifier movies is that they’re honestly kind of boring.",
        "content": "Not in the “too slow” kind of way. More-so in the fact that each kill scene just keeps going and going and going. It gets to the point where it’s not even suspenseful; you watch and you just know that Art is going to do some gratuitous shit. Honestly, these movies would be a whole lot more enjoyable if each kill scene was like two minutes shorter. ",
        "upvotes": 826,
        "comments": 238,
        "media": null,
        "permalink": "/r/movies/comments/1jigwf0/my_biggest_problem_with_the_terrifier_movies_is/"
    },
    {
        "id": "1jjdyrg",
        "author": "manav_yantra",
        "title": "I Watched Je, Tu, Il, Elle (1974) – I, You, He, She\"",
        "content": "So, I watched this movie last night and really liked it. The thing I liked the most was the creative aspect of it.\n\nThe initial part is just our director/actress, Chantal Akerman, sitting in her room—lonely and depressed. She has just gone through a breakup and is having a hard time coping. Her apartment is empty; we can assume it’s because her partner has moved out with their things. She tries moving things around, maybe just to make the room feel a little less empty. She is completely lost in sadness and loneliness—just staying in her room, writing letters, rewriting them, writing again, and reading them over and over. She keeps binging on sugar straight from the bag, maybe because she craves that sweetness.\n\nIt’s just so captivating. There’s no noise, no distractions—just her and the void in that room. And yet, you keep watching.\n\nThen comes the narration part—absolutely loved it. The first arc was the best. The arc with the truck driver was good too, but I preferred the first part the most. Then comes the final arc, where our protagonist goes to her ex’s house. You can see that they both still crave each other. We don’t know the reason for their breakup, so let’s not get into that. But yeah, they still want each other—yet something holds them back.\n\nHer ex lets her stay for the night, and then we get the 15-minute-long sex scene. And that scene is iconic because you can feel how much they crave each other. The way they grab each other—it’s like they just want to become one.\n\nAnd yeah, after that, as expected, our protagonist leaves early in the morning, and the movie ends.\n\nI have only watched two works by Chantal Akerman so far, and I’ve liked both of them—especially the creative aspects. I’ll definitely check out more of her films now.\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jjdyrg/i_watched_je_tu_il_elle_1974_i_you_he_she/"
    }
]