[
    {
        "id": "1h17exz",
        "author": "ChandlerAndIsaiah",
        "title": "Hi /r/movies! We're Chandler Levack &amp; Isaiah Lehtinen, director and lead actor of I LIKE MOVIES, a Canadian coming-of-age comedy-drama about a young cinephile working in a video rental store. It premiered at TIFF in 2022 and it's now available to watch in the US! Ask us anything.\n",
        "content": "",
        "upvotes": 135,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3c6c5g82ug3e1.jpeg?auto=webp&amp;s=aa5e31cd04a3f9b3158949b20b8f4b168c07c9d1"
        },
        "permalink": "/r/movies/comments/1h17exz/hi_rmovies_were_chandler_levack_isaiah_lehtinen/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 40,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h330ci",
        "author": "Bennett1984",
        "title": "Robert Downey Jr., Mickey Rourke, Demi Moore and the Great Hollywood Comeback Performances",
        "content": "",
        "upvotes": 1755,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOIjNJkceH1NAhXSkox7ROcsoFkUubMOXaglACGcva8.jpg?auto=webp&amp;s=4f955233d1c910bffa01f48ead81e8f8843f6281"
        },
        "permalink": "/r/movies/comments/1h330ci/robert_downey_jr_mickey_rourke_demi_moore_and_the/"
    },
    {
        "id": "1h32fqx",
        "author": "fungobat",
        "title": "The Professional - 30 Year Anniversary 4K Restoration - Official Trailer",
        "content": "",
        "upvotes": 1353,
        "comments": 331,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vZkkjiDs9z03gYQ2AtphhwTAXSvkxJjub_lZS1desB8.jpg?auto=webp&amp;s=2a81674d42a9e932a498c76bd435cce7127ad597"
        },
        "permalink": "/r/movies/comments/1h32fqx/the_professional_30_year_anniversary_4k/"
    },
    {
        "id": "1h2n6jj",
        "author": "herewego199209",
        "title": "The death of R rated comedies or even comedies in general that get wide releases never made sense to me. In the 2000s those comedies were made relatively cheaply, IE Superbad was made for 20 million and made well over $170 million. You'd think studios would love this.",
        "content": "I don't get why we don't have more rated R comedies or even romantic or sex comedies anymore. The one romantic comedy that they marketed really well recently and made a shit ton of money was Anyone but you and that movie was made for $25 and made $225 million. I don't get the excuse that comedies don't  make a lot of money overseas or that blu-rays don't sell anymore. ",
        "upvotes": 13608,
        "comments": 2118,
        "media": null,
        "permalink": "/r/movies/comments/1h2n6jj/the_death_of_r_rated_comedies_or_even_comedies_in/"
    },
    {
        "id": "1h3f28t",
        "author": "Odd_Advance_6438",
        "title": "I loved the little things in the Substance that makes Dennis Quaid’s character extra gross.",
        "content": "Specifically the way he ate the shrimp and the fact that he never washes his hands.\n\nPretty great performance relative to how little screentime he has. He plays an incredibly sleazy, misogynistic, douchey tv show executive. However, I like the less crazy things about him that add to what a creep he is. The way he eats the shrimp was pretty gross, which is impressive in a movie that’s full of so many disgusting moments. I didn’t even notice the bathroom thing until someone pointed it out, but it really emphasizes how dirty he is both figuratively and literally",
        "upvotes": 87,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1h3f28t/i_loved_the_little_things_in_the_substance_that/"
    },
    {
        "id": "1h3fv4e",
        "author": "LosIsosceles",
        "title": "\"Hundreds of Beavers\" review: This bizarre movie about beavers is a clarion call for human creativity in the age of AI",
        "content": "Reposting with movie title in the header. ",
        "upvotes": 76,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZSMVMENVMcY80gwE889Ogj75YPogDrbzeCVt8I5WJNA.jpg?auto=webp&amp;s=06ed4251d6c7d6ed2938f3b80e59b9ad9aa66146"
        },
        "permalink": "/r/movies/comments/1h3fv4e/hundreds_of_beavers_review_this_bizarre_movie/"
    },
    {
        "id": "1h3awx1",
        "author": "Strawb3rryflowers",
        "title": " Which role(s) do you think Leonardo Dicaprio should have gotten an Oscar for instead of The Revenant? ",
        "content": "I've never seen The Revenant (edit not saying he didn't deserve that win since i've obviously haven't seen it, i'm simply asking those of you who did see it) anyway, in my opinion Leo should have definitely gotten an Oscar for his roles in What's Eating Gilbert Grape and Django Unchained. I've recently watched Django Unchained again and he was really briliant in it.\n\nHe was obviously also great in The Departed, Catch Me If You Can, Revolutionary Road, etc but those are his stand-out performances in my personal opinion\n\nedit: not sure why some people want to argue with me and are downvoting this? I can still think he deserved Oscar wins for his other roles, especially because him not winning an Oscar for so long became a meme for the longest, his smirk when he finally won for The Revenant at the Oscars said everything. ",
        "upvotes": 168,
        "comments": 338,
        "media": null,
        "permalink": "/r/movies/comments/1h3awx1/which_roles_do_you_think_leonardo_dicaprio_should/"
    },
    {
        "id": "1h3cike",
        "author": "Business_Ad_6816",
        "title": "Paul Bettany. Seriously",
        "content": "I just finished watching Journey's End, a lesser known WW1 drama. Truly a masterpiece, and Paul Bettany is just so good in it. I was left in awe by Sam Claflin and Paul Bettanys acting, but especially Bettany. \n\nI always knew Bettany was good, but damn. He blew me away in Journey's End. If you haven't seen it, I highly recommend it. ",
        "upvotes": 86,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1h3cike/paul_bettany_seriously/"
    },
    {
        "id": "1h3bchy",
        "author": "aucunautrefeu",
        "title": "Which movie influenced you to make a decision in your life after watching it",
        "content": "Is there a movie you’ve seen that moved you so profoundly that it actually impacted your personal life and influenced you to make a change or decision? If so, what aspect about the film influenced it?\n\nFor me it was the being buried alive monologue in I Saw the TV Glow. I went back to the theaters three days in a row and sobbed in the theater each time. I have never felt more seen or exposed by a film in my life. After that; I started unmasking more around people in my life.\n\n",
        "upvotes": 99,
        "comments": 258,
        "media": null,
        "permalink": "/r/movies/comments/1h3bchy/which_movie_influenced_you_to_make_a_decision_in/"
    },
    {
        "id": "1h3dn4i",
        "author": "Rebel_bass",
        "title": "I had no idea that Kevin Smith and Scott Mosier produced Good Will Hunting ",
        "content": "Digging deep this weekend for good movies that I haven't seen for a while, saw their names pop up in the opening credits. No wonder Affleck and Damon are still showing up for Smith all these decades later. \n\nAny other Hollywood connections like this you guys can think of, where relations spanning so many years have shaped the face of cinema?",
        "upvotes": 60,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1h3dn4i/i_had_no_idea_that_kevin_smith_and_scott_mosier/"
    },
    {
        "id": "1h2u90n",
        "author": "Scherzoh",
        "title": "Why are some directors put into \"movie jail\" when a movie bombs, but others are allowed to have multiple failures over the course of their careers?",
        "content": "Jonathan Frakes was placed into 'movie jail' following the failure of Clockstoppers. Meanwhile a filmmaker like Ridley Scott has a few movies that have failed to make money at the box office but is still allowed projects with massive budgets.\n\nThis is not a dig at Ridley specifically, I am simply curious.\n\nEdit: Yes, I know these are two wildly different directors, both in fame and talent.  Frakes was my example because he's the first person I heard use the term 'movie jail.' It could be any director who has had a failure, but also some success.",
        "upvotes": 1718,
        "comments": 504,
        "media": null,
        "permalink": "/r/movies/comments/1h2u90n/why_are_some_directors_put_into_movie_jail_when_a/"
    },
    {
        "id": "1h2lv4j",
        "author": "onlyididntsayfudge",
        "title": "After rewatching Inception my opinion on the ending has now changed forever",
        "content": "I always believed that Leo was actually awake at the end. Nolan just showed us the spinning top as it was about to topple over before cutting to black and ending the movie. \n\nAfter rewatching the movie for who knows how many times I fully believe now that Leo is still dreaming. \n\n1. Nolan never showed us the top falling over which I understand was to keep the audiences guessing but…\n\n2. Every time Leo sees his kids in his mind in his dreams throughout the movie, they are wearing the exact same clothes. Which means he is remembering a memory of them. At the end of the movie when he comes back to his kids, they are wearing the same. fucking. clothes. And they haven’t aged at all. \n\nAnyway that’s where I’m leaning now - he’s still dreaming. \n\nEdit: I’m loving the discussions! After reading all your comments I appear to be wrong - Leo’s kids in the end were not wearing the exact same clothes. Check out the [Differences in clothing](https://images.app.goo.gl/EJ4dezvGqa6Uxgf8A) that I found by googling it. I seemed to have gotten ahead of myself on this one. \n\nI’ve also heard about the wedding ring being a totem, which I can totally agree with. \n\nI will say this - after reading the discussions, I started thinking about the wife died in the movie. She died by falling off a ledge. Gravity took her down. Gravity was also a big component/the kick to wake the team up at the end. So now I’m even more curious! Is Leo dreaming because he still has not experienced his gravity drop in “the real world.” Hmmm 🤔 ",
        "upvotes": 5318,
        "comments": 734,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mQ-PoKhA8Aer8be5I7KbShk4ZC3ftZtJCfP925zrNB0.jpg?auto=webp&amp;s=0054626cbbc684d5e96696a9ab15ce38dc239f6b"
        },
        "permalink": "/r/movies/comments/1h2lv4j/after_rewatching_inception_my_opinion_on_the/"
    },
    {
        "id": "1h34ecp",
        "author": "keepfighting90",
        "title": "Rebel Ridge is a damn good thriller - reminiscent of a modern-day 'Rambo'",
        "content": "Just caught Jeremy Saulnier's newest flick, Rebel Ridge, on Netflix. I'm a big fan of his, and consider Blue Ruin and Green Room to be 2 of the best thrillers in the last 10-15 years. Hold the Dark was just ok but I was still excited to check this one, since I love the first Rambo and this seemed to be in the mold of that classic \"stoic badass strolls into small town and gets into it with corrupt lawmen\" narrative. \n\nThis is a much more restrained, and lower-key movie than the trailers make it seem. It's really more of a slow burn thriller as opposed to an action movie, and it does an amazing job of slowly building the suspense and elevating the stakes so that whenever the rare action scenes do pop up, they feel like they have impact and meaning. \n\nThe film is carried hard by Aaron Pierre, and his performance is honestly enough to justify watching it. I've never seen him in anything before but after this, I'm definitely going to be keeping an eye on any future projects (I know he's going to John Stewart in the Lanterns show, which I'm pretty hyped about). He has movie star levels of presence and charisma and most importantly, he is built like a fucking *tank* and completely sells the badass ex-Marine character who can kick anyone's ass around him. \n\nWhat I loved about how the movie approached the narrative is that Terry is constantly trying to defuse the situation. This isn't some Dwayne Johnson action blockbuster or John Wick power fantasy where the hero just demolishes everyone without any effort. Terry consciously goes out of his way to avoid violence - loved the little touches where he unloads guns in tense situations. It's just too bad that these fools keep asking for it, so when he has  no choice but to put a beatdown of these corrupt asshole cops, it's immensely satisfying. The action scenes are really well done, keeping the fight choreography grounded and realistic, showing how Terry uses his technique and size to quickly put guys down.\n\nThe story felt pretty timely too, dealing with asset forfeiture laws, and Don Johnson and Emory Cohen are both great as the primary antagonists. Nice supporting turns from AnnaSophia Robb and David Denman as well.\n\nThis is the kind of thriller I feel like we don't get much of anymore, one that feels refreshingly adult, grounded and keeping the stakes personal and intimate. Highly recommend.",
        "upvotes": 283,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1h34ecp/rebel_ridge_is_a_damn_good_thriller_reminiscent/"
    },
    {
        "id": "1h32ppc",
        "author": "MakeItSo978",
        "title": "What’s one film you still can’t decide if it’s good or not? ",
        "content": "For me it’s Watchmen, I’ve watched this movie like 10 times. Every time I watch it my opinion changes on it. I just watched it tonight, and I think it’s not very good. There is a lot of things I like about it you could even say love. But I just notice something new that bothers me. Just curious about your opinion? ",
        "upvotes": 339,
        "comments": 786,
        "media": null,
        "permalink": "/r/movies/comments/1h32ppc/whats_one_film_you_still_cant_decide_if_its_good/"
    },
    {
        "id": "1h2w6kq",
        "author": "Ginger_Jesus",
        "title": "What made \"Napoleon Dynamite\" work and \"Gentlemen Broncos\" not?",
        "content": "They were written by the same people and has the same...style? I am not a very good critic, and while I do consider Napoleon Dynamite the better movie, I didn't hate Gentlemen Broncos, I was curious why one did so well and the other flopped so hard when they seem like similar movies with similar comedic beats. For what it's worth, my buddy and I quote Gentlemen Broncos much more then Napoleon Dynamite, at the very least it wasn't a forgettable movie, and there's value in that I think.",
        "upvotes": 638,
        "comments": 365,
        "media": null,
        "permalink": "/r/movies/comments/1h2w6kq/what_made_napoleon_dynamite_work_and_gentlemen/"
    },
    {
        "id": "1h2zedx",
        "author": "ThingsAreAfoot",
        "title": "Monologues where someone tells a full story.  ",
        "content": "I recently rewatched Gangs of New York and for all of DDL’s theatricality in various performances, he can be beautifully subtle: \n\nhttps://youtu.be/h8U3slXNy10\n\nThat’s the scene where he slowly describes to Leo’s character Amsterdam, basically, his life story. What he’s all about, how he’s managed to survive. \n\nAnother scene like that is the famous Jaws scene with Robert Shaw where he talks about his encounter with sharks as a WW2 soldier after his ship the USS Indianapolis was sunk in shark-infested waters: \n\nhttps://youtu.be/u9S41Kplsbs\n\nAnother one of the most famous is Marlon Brando in Apocalypse Now, relaying his visions and experiences of horror in war - the disturbing aftermath after he and his group inoculate a village - and using that to justify and rationalize his own brutality:\n\nhttps://youtu.be/mPPGMNOLaMw\n\nIn all of those cases the actors are so good you feel like they’re retelling a genuine memory, you can almost even see it in their eyes. \n\nWhat are some other similar ones? 4-5 minute (or however long) monologues where the actors and the writing are so good the scene just transfixes and transports you, and you can so easily visualize everything. ",
        "upvotes": 331,
        "comments": 237,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ism9mKaoycI6v05uRx922lHPqVPzjYBMnsHUagYtXiA.jpg?auto=webp&amp;s=607b9b9f8ca0992d960071a6f7b6f773e6929f43"
        },
        "permalink": "/r/movies/comments/1h2zedx/monologues_where_someone_tells_a_full_story/"
    },
    {
        "id": "1h2ww9d",
        "author": "Plenty-Spell-3404",
        "title": "Be sure to see Misery if you haven't seen it yet.",
        "content": "**PLOT:** Annie Wilkes (Kathy Bates), Sheldon’s number one fan, rescues the author from the scene of a car accident. The former nurse takes care of him in her remote house, but becomes irate when she discovers that the author has killed Misery off in his latest book. Annie keeps Sheldon prisoner while forcing him to write a book that brings Misery back to life.\n\n**REVIEW:** It's simply brilliant! One of the finest psychological horror films I have ever seen, very much in the league of classics like Psycho and The Shining. Kathy Bates is simply awesome! Must must watch if you are a psychological thriller fan.",
        "upvotes": 309,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1h2ww9d/be_sure_to_see_misery_if_you_havent_seen_it_yet/"
    },
    {
        "id": "1h2yblt",
        "author": "KillerCroc1234567",
        "title": "Adam Somner, Oscar-Nominated Assistant Director and Producer, Dies at 57",
        "content": "",
        "upvotes": 221,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qzimZKn7fZI1jC6ZtwovwN3cjcC3CXiwoe67o4fVrvM.jpg?auto=webp&amp;s=2487536c50786948e7ea6af729e613844bf32953"
        },
        "permalink": "/r/movies/comments/1h2yblt/adam_somner_oscarnominated_assistant_director_and/"
    },
    {
        "id": "1h2ivu4",
        "author": "Sisiwakanamaru",
        "title": "'Prisoners:' The perfect Thanksgiving movie to turn into that panic spin",
        "content": "",
        "upvotes": 2120,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gjiNjaTDrveQ5LdaFGUr627QVljnq5Kxik2yTH4amVI.jpg?auto=webp&amp;s=ad7f7bb3434da6b3406c249a85e668450946ae40"
        },
        "permalink": "/r/movies/comments/1h2ivu4/prisoners_the_perfect_thanksgiving_movie_to_turn/"
    },
    {
        "id": "1h2sxjf",
        "author": "MiserableSnow",
        "title": "Lupin The IIIrd The Movie | Special Teaser Trailer",
        "content": "",
        "upvotes": 439,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MbVHwCEL0GKy6xIXvUnJieB0kOjbCoWtDthflcNs5Mo.jpg?auto=webp&amp;s=5a3d06f0a0db97230b7bf3b8dd4899c341699a4d"
        },
        "permalink": "/r/movies/comments/1h2sxjf/lupin_the_iiird_the_movie_special_teaser_trailer/"
    },
    {
        "id": "1h3ekkm",
        "author": "Logical_Access_8868",
        "title": "The first omen was way better than i expected it to be ",
        "content": "Finally got around to watch it after hearing a lot of praise. \nFirst of all, it is an unneeded cashgrab prequel to a well known horror classic, that's a fact. Second, the plot was a bit ridiculous.\n\nBut man, the cinematography was absolutely amazing! It's like they accidentally hired a talented director and the movie ended up being pretty good! The meh plot was saved by the great old school direction and good performance from the main lead. The two \"birthing\" scenes were absolutely horrific, i'm surprised they went that far.\n\nHonestly, Arkasha Stevenson is a name i'll keep on my radar, if she managed to make a nice film out of such a soulless corporate project i'm very excited what she can do with better original scripts.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1h3ekkm/the_first_omen_was_way_better_than_i_expected_it/"
    },
    {
        "id": "1h3eqe9",
        "author": "herequeerandgreat",
        "title": "movies of 2025 that you may not be aware are being made",
        "content": "night of the zoopocalypse\n\nclive barker and animation aren't two things that you would usually associate with each other. nevertheless, such a combination has come to pass with the end result being night of the zoopocalypse. executive produced by barker and based on a concept by him, the film takes place at a zoo that is hit by a meteor. eventually, a virus emerges from the meteor, turning most of the animal inhabitants into zombie like mutants. it's up to a small group of non infected animals to combat this threat. david harbour and gabbi kosmidis lead a cast that also includes kids in the hall alumni scott thompson and mandalorian alumni paul sun hyung lee. the film is set to release on march 7th.\n\ngrendel\n\njohn gardner's 1971 novel grendel tells the story of the titular monster before his confrontation with beowulf, the novel was acclaimed and is often considered to be one of the best novels of the 70s. and it seems that the jim henson company agrees as they will be producing a feature film adaptation. the film will be live action and will be directed by robert D krzykowski, who is most famous for the man who killed hitler and then bigfoot. academy award winner jeff bridges will voice the titular monster, dave bautista will play beowulf, and bryan cranson will play king hrothgar. given the involvement of the jim henson company, it's also highly likely that most, if not all, of the effects in the movie will be done practical and the monsters will be portrayed by puppets.\n\nhigh and low\n\nwhen it comes to remakes, spike lee doesn't have the best luck, if his remake of oldboy is anything to go off of. however, maybe he'll have better luck with his upcoming remake of akira kuroasawa's high and low. often considered to be one of kuroasawa's best movies, high and low tells the story of a businessman who is given a few hours to pay the ransom of his chauffeur's son's kidnapper. it seems like lee thinks that the movie is in need of a modern update since he has said that this remake will be his next project. lee will team up with denzel washington for the sixth time. the rest of the cast will include iifenesh hadera, jeffrey wright, ice spice, ASAP rocky, dean winters, michael potts, and john douglas thompson. while no concrete release date has been given, it is expected to arrive in the spring of 2025 and will be released theaterically before going onto apple tv+.\n\nthe long walk\n\nin addition to being one of the most famous authors ever, stephen king is often the most frequently adapted. his work has been adapted into movies, tv, and other forms. however, one novel of his that has yet to be adapted is the long walk. set in a dystopian america, the long walk focuses on an annual walking contest. however, as should be expected from a king penned story, things quickly go badly. the film adaptation will be directed by francis lawrence, who you may know from constantine, i am legend, and the hunger games sequels. cooper hoffman will lead a cast that includes the likes of charlie plummer, mark hamill, and judy greer. filming began in july of 2024 and ended in september. no offical release date has been given yet but, if post production goes smoothly, we could probably expect it at some point next year.\n\nthe lost bus\n\n\"A bus driver has to navigate a bus carrying children and their teacher to safety through the 2018 camp fire, which became the deadliest fire in California history.\" this is the wikipedia plot synopsis for paul greengrass's upcoming movie the lost bus. while a movie about a bus may not seem very interesting, a good storyteller can make any story interesting. matthew mcconaughey will star as kevin mccay, the driver of the titular bus. best supporting actress nominee america ferrera will also play a supporting role as mary ludwig, a schoolteacher. the film will be produced by both jason blum of blumhouse and jamie lee curtis. here's hoping that this movie stays in the right lane. \n\neddington\n\nari aster is one of the most unique directors currently working. despite only having 3 feature films to his name at the moment, he is quickly establishing himself as a creative force to be reckoned with. and it seems that, in his newest film eddington, aster plans to take audiences to the wild west. directed, written, and co produced by aster, eddington will tell the story of a small town sheriff with high aspirations. after starring in aster's previous movie beau is afraid, academy award winner joaquin phoenix will reunite with the director. the supporting cast is nothing to sneer at as the film will star the likes of pedro pascal, emma stone, austin butler, luke grimes, deirdre o connell(an actress who is no stranger to bizzare movies), micheal ward, and clifton collins jr. the film is described as a black comedy.\n\nthe battle of baktan cross\n\nwhen it comes to paul thomas anderson, you never know what to expect. one minute, he's directing grand historical epics. the next, he's directing coming of age comedy dramas. and it seems that he's entering the crime genre with his newest film the battle of baktan cross. while there is no plot synopsis at the moment, the film is described as a crime drama thriller. leonardo dicaprio will lead a cast that includes regina hall, sean penn, alana haim, and benicio del toro. the film will also be anderson's first film to be released in IMAX. the battle of baktan cross will release on august 8th.\n\nwildwoods\n\nwildwoods will be laika studio's first film since 2019's missing link as well as the studio's first film of the 2020s. and while missing link was a pretty major departure from the studio's usual fare, wildwoods seems like it will be a return to form. described as a stop motion animated dark horror fantasy adventure film, wildwoods will tell the story two best friends who enter a magical forest after the girl's baby brother is kidnapped by cows. the film will star peyton elizabeth lee and jacob tremblay as the two leads. the supporting cast will consist of carey mulligan, mahershala ali, awkwafina, angela bassett, jake johnson, charlie day, jemaine clement, tom waits, and richard E grant. and that's just the talent in the cast. kubo and the two strings director travis knight will serve as director, reuniting with two strings composer dario marianelli. oscar nominated cinematographer caleb deschanel will make his animation debut as the film's cinematographer.\n\nthe phoenician scheme\n\nleave it to wes anderson to make espionage funny. his upcoming film the phoenician scheme is an espionage comedy drama that was written by anderson and roman coppola. though the plot is unknown at the moment, the film's cast is known and, par for the course for an anderson film, the cast is full of famous actors. benicio del toro, michael cera, bill murray, riz ahmed, tom hanks, benedict cumberbatch, scarlett johansson, rupert friend, willem dafoe, and bryan cranston. production began in march and ended in june.\n\nwake up dead man a knives out mystery\n\nknives out and glass onion were both very well recieved murder mystery stories and fans have been eager to see what benoit blanc would get up to next. well, next year, we may have our answer. the next film in the beniot blanc film series is entitled wake up dead man a knives out mystery. rian johnson will once again serve as writer and director with daniel craig once again playing everyone's favorite southern detective. and like the other films in the series, there is a stacked supporting cast. josh o connor, glenn close, josh brolin, mila kunis, jeremy renner, kerry washington, andrew scott, cailee spaeny, daryl mccormick, and thomas haden church. while the plot is unknown at the moment, if the previous two movies are anything to go by, it will be a compelling mystery that will inherently need to be rewatched.",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1h3eqe9/movies_of_2025_that_you_may_not_be_aware_are/"
    },
    {
        "id": "1h2zqer",
        "author": "NoCulture3505",
        "title": "‘The Last Showgirl’: Read The Screenplay That Pamela Anderson Waited Her Entire Career For",
        "content": "",
        "upvotes": 84,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qFF9RxY568Jtm9XQ8nVgTWRBdtgo3XcTqoq8myeA08M.jpg?auto=webp&amp;s=65386fca02afb3f3eadea118134f4286c2995a9d"
        },
        "permalink": "/r/movies/comments/1h2zqer/the_last_showgirl_read_the_screenplay_that_pamela/"
    },
    {
        "id": "1h3158q",
        "author": "BunyipPouch",
        "title": "New Poster for Absurdist-Comedy 'Universal Language' - Canada's Official Oscar Submission - Received Critical Acclaim at Cannes &amp; TIFF - Two women find frozen cash, try to retrieve it. A tour guide leads tourists around Winnipeg sites. A man quits his job and visits his mother.",
        "content": "",
        "upvotes": 53,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s2zzcw42xx3e1.jpeg?auto=webp&amp;s=a0037178d71a13ecae18490f99d901bc9d5b2f10"
        },
        "permalink": "/r/movies/comments/1h3158q/new_poster_for_absurdistcomedy_universal_language/"
    },
    {
        "id": "1h2qg7w",
        "author": "OutlandishnessNice82",
        "title": "Brave Movie 2025",
        "content": "Hi all, I wanted to share a project with you that I’m deeply involved in and very proud of! The article just dropped today and shooting starts next summer. ‘Brave’ will be the first feature film shot on Choctaw nation land and the tribe are deeply involved with the production. Cannot wait to be able to help bring this fantastic story to the screen 😊 \n\nhttps://www.hollywoodreporter.com/movies/movie-features/brave-choctaw-nation-film-amber-midthunder-dallas-goldtooth-1236071582/",
        "upvotes": 215,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WFaPbcJxgnP9fPJ9jVycCHAEhi0OZYZWPakAk5Qq14k.jpg?auto=webp&amp;s=8ca2916a71a48947db02e9156d7f93812b549c82"
        },
        "permalink": "/r/movies/comments/1h2qg7w/brave_movie_2025/"
    },
    {
        "id": "1h2mzxh",
        "author": "noshoes77",
        "title": "My Neighbor Totoro screenings have started! ",
        "content": "If you’re like me and have never seen it on the big screen, here is your chance! ",
        "upvotes": 266,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1h2mzxh/my_neighbor_totoro_screenings_have_started/"
    },
    {
        "id": "1h2r1cn",
        "author": "airpipeline",
        "title": "What great classic films should definitely never have a sequel?",
        "content": "\nWhich classic films would genuinely NOT benefit from a sequel, and WHY?   (Unless it’s obvious to all, might you tell us WHY you offer your answer?) \n\nThese days, many (almost all) movies are made with a sequel or trilogy in mind. Even if the story ends with the destruction of the galaxy, there’s always room for that follow-up (and the potential for additional ca$h). \n\nIn the past, movies were not created with this mindset.  Which movies are notably Not sequel ready?  In other words and in a roundabout way, how have sequels affected the quality of the movies being made today?\n\nIn my thinking, _Groundhog Day_ is a good example.  The story is completely wrapped up by the end.  No sequel necessary or wanted.  ",
        "upvotes": 114,
        "comments": 524,
        "media": null,
        "permalink": "/r/movies/comments/1h2r1cn/what_great_classic_films_should_definitely_never/"
    },
    {
        "id": "1h3ekcb",
        "author": "indiewire",
        "title": "IndieWire's Barnes and Noble Criterion Sale Guide",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xn7JWf62eM6CE8y8b_8dmRPc1J86-DdQXfhhfVpuLnk.jpg?auto=webp&amp;s=68920c9133e78b0a544cdf5ce239027879d45f6a"
        },
        "permalink": "/r/movies/comments/1h3ekcb/indiewires_barnes_and_noble_criterion_sale_guide/"
    },
    {
        "id": "1h2ytgb",
        "author": "New-Length-8099",
        "title": "Go Your Own Way: Billy Wilder and the Fine Art of Independent Cinema",
        "content": "",
        "upvotes": 35,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O2iHpRJb9kSKyptEzV4Dlv3-lpmiz1ETqO2zGpDQZYA.jpg?auto=webp&amp;s=165321558c6f8cf9ec83c62e2d7d1c728ec071d3"
        },
        "permalink": "/r/movies/comments/1h2ytgb/go_your_own_way_billy_wilder_and_the_fine_art_of/"
    },
    {
        "id": "1h36d5h",
        "author": "ReelDMC",
        "title": "Blue Thunder (1983) Warren Oates Dialogue Question - Seriously, What the Hell is this Supposed to Mean? ",
        "content": "Recently rewatched Blue Thunder after not seeing it for 30+ years, have been on a bit of a tear for Dan O’bannon written films.  His work definitely has a juvenile, often sex-themed angle (Lifeforce, Alien) but I happen to be a huge fan of Return of the Living Dead, so he gets a lifetime pass for me personally.\n\nBut many of his films contain bizarre dialogue, and Blue Thunder might be the weirdest.  “I wouldn’t fly with Murphy for a bull that pissed Jack Daniels,” or “this baby fires four thousand rounds per minute, which is a shitstorm in anybody’s language.”  But the weirdest of all is when Captain Braddock (the great Warren Oates) calls Murphy back to duty and says they “just came up with a hot mince pie under each arm.”\n\nHas any normal human ever spoken this line before?  What the Hell does it even mean?  I assume it’s bad, but I went so far as to look up the ingredients of mine pie – why mince?  Why is it hot?  Why under the armpits?\n\nI did try to search this, I could not find an answer, somebody please provide me with an answer/perspective.",
        "upvotes": 8,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1h36d5h/blue_thunder_1983_warren_oates_dialogue_question/"
    },
    {
        "id": "1h2zlnz",
        "author": "Purple-Acanthisitta8",
        "title": "The Strangers Chapter 1 did something incredible.",
        "content": "This movie is so bad that in the middle of movie I’m making this post, I don’t care who gets killed or who doesn’t, the acting is atrocious and that couple chemistry is pointless and blend. Nothing and no quality to redeem this movie but yet it’s a massive success when it comes down to box office.\n\nOn a budget of almost 9 million it made close to 48 million, let’s say advertising costed them another 9 million so let’s just say total production and cost for advertisers and miscellaneous stuff costed this movie $20 million. Still they made 28 million profit and we not including 4K blu ray sales.\n\nI don’t know how they did it but good for them.",
        "upvotes": 23,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1h2zlnz/the_strangers_chapter_1_did_something_incredible/"
    }
]