[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1gy3jzd",
        "author": "SteamPaz",
        "title": "Venere su Via Roma",
        "content": "",
        "upvotes": 69,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ausi38miho2e1.jpeg?auto=webp&amp;s=d0cea1c108d1df5d6bd33f298fa535ebe4f4cef1"
        },
        "permalink": "/r/torino/comments/1gy3jzd/venere_su_via_roma/"
    },
    {
        "id": "1gy1aym",
        "author": "Gintokoz",
        "title": "NON E' POSSIBILE",
        "content": "Ogni volta che si deve organizzare un uscita tra amici (siamo tutti studenti), sono sempre lontano da tutta la movida o da qualsiasi locale tranquillo. Qualcuno che vuole fare nuove amicizie? Sono M29, vicino a zona Bengasi. :D",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1gy1aym/non_e_possibile/"
    },
    {
        "id": "1gxu6km",
        "author": "FriendlyRaisin3789",
        "title": "Tech expats in Torino",
        "content": "Hey guys, after 20 years around the world, having lived in the US, Australia, UK, Dubai, Spain and a bunch of other countries/cities, my family and I are considering settling in Torino.\n\nReason being, we love Italy and Torino seems to have it all.\n\nWe don't have office jobs, so any city would do. Still, we are semi-sold on this beautiful city. And we speak perfect Italian, so culture and language is not an issue.\n\nI'd love to know if there are immigrants who went through a similar journey.\n\nHow do you find living in Torino in terms of making friends, networking with like minded peers, kindness / openness of people and overall city vibe?\n\nIt's be amazing if you could mention the city where you relocated from, to keep the comparison in context.\n\nThanks and I look forward to reading about your experience!",
        "upvotes": 16,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gxu6km/tech_expats_in_torino/"
    },
    {
        "id": "1gxzqi1",
        "author": "KatmaRita",
        "title": "Sending postcards",
        "content": "I am leaving Turin tomorrow and wondering if anyone knows if I can mail postcards from the Turin airport. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gxzqi1/sending_postcards/"
    },
    {
        "id": "1gxbv48",
        "author": "signordado",
        "title": "Side quest: toret ",
        "content": "É da un anno che ho iniziato la quest personale: bevi da tutti i toret della cittá, al momento sto tenendo traccia della cosa a mente ma dubito il mio potentissimo cervello sia all'altezza del compito, per questa ragione chiederei a voi popolo dell'internet consiglio su modi pratici e comodi per \"mettere la spunta\" a ciascuno dei suddetti erogatori idrici dopo essermici rifocillato. \n\nGrazie a tutti in anticipo.\n\nPs: non intendo vandalizzare o scrivere sui toret, vorrei una mappa, conosco i love toret ma non mi sembra  ci sia modo di mettere delle note",
        "upvotes": 22,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gxbv48/side_quest_toret/"
    },
    {
        "id": "1gxcxxn",
        "author": "SpamNThePowerItHolds",
        "title": "Mi consigliate qualche parrucchiere bravo a Torino?",
        "content": "Ciao! Mi sono trasferita a Torino ad aprile e da un mesetto cercavo qualche bravo parrucchiere che potesse sistemarmi il mio solito taglio shag. La scorsa settimana ho prenotato in questo salone che comunque aveva delle buone recensioni su google e mercoledì ho tagliato i capelli, ma onestamente è stata una delle esperienze peggiori della mia vita.  \nHo cercato di essere più chiara possibile nella descrizione del taglio ma nulla, sono uscita da lì e vi giuro che mi sembrava che non mi avessero proprio tagliato i capelli se non le punte e la frangia, per non parlare poi della piega... Me ne hanno fatta una che descriverei come \"da principessa\" quando ne avevo chiesta una molto mossa, che sembrasse disordinata o spettinata. Vi risparmio gli altri dettagli ma ci sono rimasta abbastanza male perchè non mi era mai successo che mi facessero un taglio così tanto diverso da quello che desideravo.\n\nQuindi ritorno alla domanda: avete qualche suggerimento per un bravo parrucchiere che faccia tagli anche un po' \"alternativi\", perchè sperimentare non mi dispiacerebbe affatto ma mi dovrei fidare. Grazie mille in anticipo a tutti!",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gxcxxn/mi_consigliate_qualche_parrucchiere_bravo_a_torino/"
    },
    {
        "id": "1gxk2w4",
        "author": "albertot011",
        "title": "Fioraio ",
        "content": "Qualcuno saprebbe  consigliarmi un fioraio valido ma economico? Meglio se in zona Aurora o Vanchiglia. Grazie ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gxk2w4/fioraio/"
    },
    {
        "id": "1gxhmnx",
        "author": "drogba3325",
        "title": "Hiking spots accessible by public transport",
        "content": "Hello guys, does any of you know hiking trials accessible by public transport from torino? Preferably begginer/moderate level. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gxhmnx/hiking_spots_accessible_by_public_transport/"
    },
    {
        "id": "1gx8dia",
        "author": "_L_-",
        "title": "Torino Film Festival ",
        "content": "Qualcuno è stato gli anni scorsi? So che inizia questo weekend ma volevo capire oltre alle proiezioni di film cosa comprendesse, ci sono conferenze o altro? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gx8dia/torino_film_festival/"
    },
    {
        "id": "1gxcanu",
        "author": "Fabulous-Election826",
        "title": "Amicizie&amp;Conoscenze",
        "content": "Consiglio questa community su reddit per chi volesse trovare persone  \n[https://www.reddit.com/r/AmicizieConoscenze/](https://www.reddit.com/r/AmicizieConoscenze/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gxcanu/amicizieconoscenze/"
    },
    {
        "id": "1gx3io6",
        "author": "infinis_",
        "title": "Bus a corsa limitata?",
        "content": "Sono un'avida frequentatrice della linea 18 in direzione Barriera di Milano e premetto che mi sono trasferita qui da poco. Succede spesso che, salendo sul bus e arrivando alla fermata di Molinette Ovest, l'autista dica: 'Bus a corsa limitata, dovete scendere!' Tornando quindi in deposito e lasciando tutti i passeggeri a piedi ad aspettare il bus successivo.\nNon mi sembra che questa variazione della corsa venga mai indicata da nessuna parte sui segnali del bus, quindi cos’è questa storia?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1gx3io6/bus_a_corsa_limitata/"
    },
    {
        "id": "1gxdvgh",
        "author": "Dreskii88",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1gxdvgh/removed_by_reddit/"
    },
    {
        "id": "1gwrml4",
        "author": "ivlia-x",
        "title": "Quanto costa il pedaggio Torino - Orio al serio?",
        "content": "Ciao a tutti_e,\n\nin dicembre dovrò andare a prendere mia madre dall’aeroporto di Bergamo. Cerco le soluzioni per arrivarci ma da ciò che vedo l’opzione migliore sarà semplicemente prendere la macchina… Qualcuno sa quanto costa il pedaggio? \n\nNon sono italiana, non ho il telepass etc - chiedo in anticipio per prepararmi se necessario",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gwrml4/quanto_costa_il_pedaggio_torino_orio_al_serio/"
    },
    {
        "id": "1gwgqri",
        "author": "Own_Set_3018",
        "title": "Concerti metal e rock",
        "content": "Ciao\nSto cercando una compagnia per concerti Metal-Punk. \nSono un ragazzo di 23 anni e mi sono trasferito a Torino per studiare.",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1gwgqri/concerti_metal_e_rock/"
    },
    {
        "id": "1gwlgeh",
        "author": "SonKagito",
        "title": "Wine at the airport",
        "content": "Hi everyone\nI was considering bringing back to my country some wine from Turin, but i do not have the information whether there is a possiblity to buy wine after the security check-in, or what is the maximum limit if i can bring them through the security.\nI checked some rules but wanted more clarification...\nThank you in advance",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gwlgeh/wine_at_the_airport/"
    },
    {
        "id": "1gvn3aw",
        "author": "The_Minis13",
        "title": "Chiamata polizia di stato o possibile truffa?",
        "content": "Ho ricevuto una chiamata sconosciuta al mio telefono lavorativo (numero presente online). La tipa si identifica come appartenente alla polizia di stato. Mi chiedo se sono la dottoressa tizia. Rispondo di si. Dopo io chiedo: \"mi perdoni, ma perchè un poliziotto mi chiama con lo sconosciuto\", lei blatera qualcosa e dice \"E una linea internet questa!\". Mi stacca il telefono in faccia . Nosense\n\nChiamo la polizia, segnalo la cosa per capire...e mi hanno detto che effettivamente loro chiamano anche con lo sconosciuto. Ma rispondo all'operatrice \"ma un suo collega staccherebbe mai il telefono in faccia ad una persona prima di procedere con la comunicazione?\". Mi dice di no, ma non sa che rispondere\n\n  \nA sto punto suppongo sia una truffa, o datemi voi una spiegazione.  \nHo ricevuto 7 giorni prima una chiamata sempre sconosciuta ma lavorando non ho potuto rispondere",
        "upvotes": 20,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1gvn3aw/chiamata_polizia_di_stato_o_possibile_truffa/"
    },
    {
        "id": "1gv9ssp",
        "author": "DioGormita",
        "title": "San Salvario by night",
        "content": "Ore 23, negli alberghi inizia il turno di notte, mentre già si abbassano le serrande dei ristoranti in un freddo martedì di novembre. L'Uomo Birillo non si vede in giro da un po', ma non mancano certo gli eventi degni di nota o le solite bizzarrie tra via Nizza e via Principe Tommaso.\n\nCosa raccontano in questa fredda notte i sussurri di San Salvario? ",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gv9ssp/san_salvario_by_night/"
    },
    {
        "id": "1gvo31v",
        "author": "Own_Lead_3053",
        "title": "PARCHEGGIO LINGOTTO ",
        "content": "Ciao, dovrei lavorare tutto il pomeriggio all'Oval di Lingotto tramite un contratto a chiamata. Solo che vengo da fuori Torino e dovrei andare in macchina, qualcuno mi sa consigliare un parcheggio gratuito in zona? Grazie mille",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gvo31v/parcheggio_lingotto/"
    },
    {
        "id": "1gvphry",
        "author": "Professional_Media23",
        "title": "T-red e semaforo lampeggiante",
        "content": "Sapete se le telecamere funzionano lo stesso, con semaforo giallo lampeggiante? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gvphry/tred_e_semaforo_lampeggiante/"
    },
    {
        "id": "1gvjqr9",
        "author": "FriendlyRaisin3789",
        "title": "Asili e scuole internazionali in città",
        "content": "Ciao a tutti. Stiamo pensando seriamente di trasferirci a Torino, poiché ci piace molto la città.\n\nSiamo italo-americani e ci piacerebbe se la nostra figlia di 3 anni andasse in una scuola internazionale.\n\nHo trovato un paio di scuole interessanti, come WINS, però un po' sono lontane dal centro e non raggiungibili a piedi.\n\nPoiché vivremo in zona centro, sapreste consigliarmi qualche scuola internazionale al centro?\n\nGrazie mille ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gvjqr9/asili_e_scuole_internazionali_in_città/"
    },
    {
        "id": "1gv9r6r",
        "author": "mar538",
        "title": "Qualcuno interessato a praticare MMA o arti marziali all’aperto a Torino? ",
        "content": "Ciao a tutti,\nsto cercando persone interessate a praticare MMA o altre arti marziali in un parco qui a Torino. Non sono esperto, ma vorrei imparare, e penso che allenarsi in compagnia possa essere divertente e motivante.\n\nL’idea è di organizzare sessioni all’aperto per esercitarci insieme, magari provando tecniche di base, esercizi fisici o anche solo condividendo qualche consiglio. Va bene qualsiasi livello di esperienza, anche se siete principianti o semplicemente curiosi di provare.\n\nUn posto comodo potrebbe essere il Parco Ruffini, ma sono aperto anche ad altre proposte se avete preferenze.\n\nSe qualcuno è interessato, possiamo accordarci su un luogo e orari che vadano bene per tutti. Fatemi sapere nei commenti o in DM!\n\nA presto :)\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gv9r6r/qualcuno_interessato_a_praticare_mma_o_arti/"
    },
    {
        "id": "1gv5ulm",
        "author": "Sorry_Carrot7537",
        "title": "Cerco qualcun* per uscire ",
        "content": "ciao, non sono di Torino ma ci vengo spesso e a breve mi ci trasferisco credo definitivamente, cercavo qualcun* con cui stringere amicizia, ho 19 anni e chiaramente ho diversi interessi come ad esempio lo sport, e boh nulla ",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1gv5ulm/cerco_qualcun_per_uscire/"
    },
    {
        "id": "1gv4g0n",
        "author": "SaltMusician8619",
        "title": "Torino to Sacra San Michele",
        "content": "Hi everyone. I'm in Turin for a few days with my mother and we are thinking about going to the Sacra San Michele. Do people have ideas on the easiest way to get there? I see there's a train, is that the best?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1gv4g0n/torino_to_sacra_san_michele/"
    },
    {
        "id": "1guwceo",
        "author": "Professional_Law28",
        "title": "Fischio fastidioso zona metro Racconigi - help",
        "content": "Da circa una settimana c'è un rumore/fischio ad alte frequenze fastidiosissimo tra la stazione Racconigi della metro e l'inizio di corso Svizzera. All'inizio durava solo un paio d'ore nel tardo pomeriggio mentre dalle 22 di ieri sera non si è più fermato. In casa si sente poco ma comunque fastidioso mentre appena si esce fuori ti buca il cervello. Stiamo diventando letteralmente matti, specialmente questa notte è stato un incubo, verso le due mi sono dovuto mettere le cuffie antirumore da lavoro per dormire. Qualcuno sa da dove potrebbe provenire? Si può contattare qualcuno? ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1guwceo/fischio_fastidioso_zona_metro_racconigi_help/"
    },
    {
        "id": "1gvbd6g",
        "author": "Alarmed_Lawyer400",
        "title": "Conoscete agenzie che fanno casting per fotomodelli/modelli?",
        "content": "Un lavoro è un lavoro e avrò bisogno di soldi a breve,  conosco amici in altre città che con qualche chiamata si mettono via un po' di soldini (nulla di che ma non si buttano via), ma non mi hanno saputo consigliare per Torino.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gvbd6g/conoscete_agenzie_che_fanno_casting_per/"
    },
    {
        "id": "1guzgi0",
        "author": "CollapseOverflow",
        "title": "Cerco una band per suonare",
        "content": "Ciao a tutti,\n\nSono arrivato da poco a Torino e ~~sto cercando un appartamento~~ to cercando un gruppo con cui suonare per divertirmi dopo il lavoro. Suono il trombone e ho già suonato in brass band, in una big band jazz, in un'orchestra sinfonica e in un gruppo funk (abbiamo fatto qualche concerto). \n\nSapete se c'è un sito web dove posso cercare band che cercano musicisti? Oppure se conoscete qualcuno, per favore mandatemi un PM. Grazie mille!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1guzgi0/cerco_una_band_per_suonare/"
    },
    {
        "id": "1gv6ijv",
        "author": "fableafy_fr",
        "title": "Consigli discoteche?",
        "content": "Ciao a tutti! Sapreste consigliarmi delle discoteche a Torino? io e il mio gruppo di amici veniamo dalla provincia di Cuneo, da noi ci sono poche discoteche e quelle poche che ci sono sono invivibili. Dopo un periodo passato ad evitare le discoteche come la peste vogliamo riprovare a buttarci, secondo voi quali sono le discoteche in cui ci si può davvero divertire a Torino?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gv6ijv/consigli_discoteche/"
    },
    {
        "id": "1gv1gsb",
        "author": "TheLastRedcoat",
        "title": "Looking for Ferrero Pasticceria ",
        "content": "Hi all,\n\nI'll be visiting Turin for a few days next week with my girlfriend, and was wondering if anyone knew where the original Pasticcerie of the Ferrero family were in the city specifically? I know it's silly, but I thought it might be fun to take her there (as she loves history and Nutella, and should be something a little different from the Museo Egizio and Palazzo Reale that we'll see earlier in the day).\n\nI know the one from 1934 was near Porta Nuova, and the one from 1940 is on the Via Sant'Anselmo, but I can't find any specific location info; can anyone help me track down where they are specifically?\n\nGrazie a mille in anticipo!",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1gv1gsb/looking_for_ferrero_pasticceria/"
    },
    {
        "id": "1guw35p",
        "author": "sipprots",
        "title": "C'è qualche casa disponibile a Givoletto?",
        "content": "Ciao a tutti!  \nSto cercando una casa in affitto che abbia accesso al comune di Givoletto.  \nAvete qualche indicazione?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1guw35p/cè_qualche_casa_disponibile_a_givoletto/"
    },
    {
        "id": "1gvaqig",
        "author": "Creepy-Prior9882",
        "title": "Contatti con la malavita ",
        "content": "Account throwaway\nCari amici torinesi e non, ho un caro amico che ha bisogno di soldi.\nHa provato a chiedere ad amici, parenti, carte di credito, finanziamenti e tutto ciò che esiste di legale, senza esito posito. \nLui \"lavora\", vuole chiedere soldi ad uno strozzino, ma comunque può tranquillamente permettersi di pagare interessi da usuraio, e sarebbe un grado di restituire tutto in 1/2 mesi.\nGli ho regalato i miei risparmi per evitare che si metta nei casini, ma non basta. \nPurtroppo è testardo, provo a giocare d'anticipo per  capire dove potrebbe andare a chiedere questi soldi prima che lo faccia veramente lui.. idee?\n\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gvaqig/contatti_con_la_malavita/"
    }
]