[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 122,
        "comments": 5776,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gzvczt",
        "author": "dailymail",
        "title": "Netflix children's movie that 'teaches kids divorce is ok' is panned by parents",
        "content": "",
        "upvotes": 271,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1gzvczt/netflix_childrens_movie_that_teaches_kids_divorce/"
    },
    {
        "id": "1gzm3oh",
        "author": "IrishStarUS",
        "title": "JonBenét Ramsey's dad vows to hold on until killer caught - as police 'wait for him to die' amid new Netflix doc",
        "content": "",
        "upvotes": 281,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1gzm3oh/jonbenet_ramseys_dad_vows_to_hold_on_until_killer/"
    },
    {
        "id": "1gzzdyf",
        "author": "Alan_Stamm",
        "title": "Anthony Jeselnik is back with his first new special in five years, 'Bones and All'",
        "content": "",
        "upvotes": 36,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gzzdyf/anthony_jeselnik_is_back_with_his_first_new/"
    },
    {
        "id": "1gzi47u",
        "author": "techfinpro",
        "title": "Ted Danson’s New Series ‘A Man On The Inside’ from ‘The Good Place’ Creator Michael Schur Debuts at Number 1 on Netflix",
        "content": "",
        "upvotes": 96,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1gzi47u/ted_dansons_new_series_a_man_on_the_inside_from/"
    },
    {
        "id": "1gzx8f4",
        "author": "kgbking",
        "title": "Thoughts on the Recent Netflix Content? I am Disappointed",
        "content": "I feel like there are thousands of Superhero and Murder / Crime movies, but other than these the content is drying up. \n\nI am into the dramas, and the recent content of the dramas is a bit weak as of recent. I feel like Netflix is losing its well-roundedness and merely catering disproportionately to whatever is in vogue. \n\nWhat are your thoughts on this?",
        "upvotes": 16,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1gzx8f4/thoughts_on_the_recent_netflix_content_i_am/"
    },
    {
        "id": "1gzr53d",
        "author": "localprincessjaaeli",
        "title": "The Lincoln lawyer ",
        "content": "Fantastic crime series, both seasons are good always keeps you on the edge, shot very well ,little nonsense all business, recommend watching it totally,let me know your thoughts if anyone has seen ",
        "upvotes": 11,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1gzr53d/the_lincoln_lawyer/"
    },
    {
        "id": "1h002vs",
        "author": "AdStrict9981",
        "title": "Well, that checks out..",
        "content": "https://preview.redd.it/iam1jrphg53e1.png?width=618&amp;format=png&amp;auto=webp&amp;s=84fcaf68c01f4fd5bca78604b97d00cf4b3ad696\n\nHad to repost at first but as I was looking for my next nature documentary to binge, I came across this contradiction. Thought it was funny so I decided to post it",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h002vs/well_that_checks_out/"
    },
    {
        "id": "1gzsf6z",
        "author": "Flafaduce",
        "title": "thanks netflix",
        "content": "yall are great, i was really looking forward to watching resident alien but apparently i can’t have nice things and you decide to remove shows without telling anyone!",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gzsf6z/thanks_netflix/"
    },
    {
        "id": "1h04p1w",
        "author": "Necessarii_Change913",
        "title": "ADs Crashing App",
        "content": "Every time an ad begins it causes my tv to freeze momentarily, and then kicks me all the way out to my Home Screen, only to have to open Netflix again. It just took me 3 attempts to get through one ad. I’ve seen others mention this on Reddit before dating back to at least a year or so ago. Is anyone else still experiencing this like me? How has Netflix not been forced to fix this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h04p1w/ads_crashing_app/"
    },
    {
        "id": "1gzmuzr",
        "author": "WesHarrison",
        "title": "Harlan Coben’s New Netflix Series ‘Missing You’ Drops Trailer After Runaway Success Of ‘Fool Me Once’",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzmuzr/harlan_cobens_new_netflix_series_missing_you/"
    },
    {
        "id": "1gzwc8f",
        "author": "Similar_Diver9558",
        "title": "Just In: Menendez brothers will stay in prison until at least next year",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzwc8f/just_in_menendez_brothers_will_stay_in_prison/"
    },
    {
        "id": "1h01305",
        "author": "F_enx",
        "title": "Gift card",
        "content": "I’ve bought a gift card but it’s from another country and when i try to redeem the code it says invalid code, is there any solution for this issue?\n\n\n*If anyone from UAE please let me know ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h01305/gift_card/"
    },
    {
        "id": "1gzeqm3",
        "author": "aBlastFromTheArse",
        "title": "Pantheon",
        "content": "Any love for the show around here?\nI don't watch a lot of animated shows/anime but this show is absolutely blowing me away. \nThe information about season 2 seems very confusing. Looks like it was created but only released in certain parts of the world? \nCan anyone confirm if season 1 wraps everything up before I get to the end? ",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gzeqm3/pantheon/"
    },
    {
        "id": "1gzxat0",
        "author": "kgbking",
        "title": "Children of the Church Steps",
        "content": "This was an excellent show! Highly recommended.\n\nThe writer does an amazing job of giving the viewer a glimpse into the journeys of the various characters by displaying their histories, dreams, aspirations, desires, and hopes, feelings, etc. This allows the view to resonate and identify with the various characters; however, the writer also depicts both the violence and flaws of the characters and also the multiple forms of violence that these characters are subjected to and struggle against.\n\nThe beautiful humanization of those who are neglected, marginalized, and societally abandoned depicted by the series really allows the viewer to feel the full weight of the tragic and horrific final massacre.\n\nNetflix needs to continue employing such great writers and needs to keep producing content that grapples with such important and heavy themes.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzxat0/children_of_the_church_steps/"
    },
    {
        "id": "1gzwhsu",
        "author": "SwarupMondol",
        "title": "Can't Log in to Netflix on My Laptop – Need Help!",
        "content": "Hey everyone,I’ve been trying to log in to Netflix on my laptop, but it’s just not working. I’ve double-checked my email and password, and they’re correct. I can log in on my phone without any issues, so I’m not sure what’s going wrong.\n\nAlso I reseted my password. I can log in only in my mobile phone.In laptop Netflix is  saying incorrect password in browser &amp; app.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzwhsu/cant_log_in_to_netflix_on_my_laptop_need_help/"
    },
    {
        "id": "1gzuyl6",
        "author": "Hexside-Witch",
        "title": "Action Pack Season 3 | Original Release for Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzuyl6/action_pack_season_3_original_release_for_netflix/"
    },
    {
        "id": "1gzu5v8",
        "author": "thepotatotwin",
        "title": "Survey on Streaming Habits - Participants Needed!",
        "content": "Hi everyone,\n\nI’m researching viewer habits on streaming services like Netflix, Amazon Prime Video, and Disney+. I'm looking for data on what shows/movies you watch, favorite genres, and viewing times for a school project, I would really appreciate your help!\n\n**Who can participate?**\n\n* Anyone who uses streaming services.\n* All age groups and backgrounds.\n\n**Privacy:** All responses are anonymous.\n\n**Survey Link:** [https://forms.gle/69PEweKLcwNrQnDeA](https://forms.gle/69PEweKLcwNrQnDeA)\n\nThanks for your help!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzu5v8/survey_on_streaming_habits_participants_needed/"
    },
    {
        "id": "1h01dff",
        "author": "Notoriously_So",
        "title": "Finishing up cancelled shows",
        "content": "Why wont Netflix finish up some of their most popular cancelled shows? They still hold the rights to a massive amount of shows that ends in 2-3 seasons, and many of them on a cliffhanger ending aswell. Having a special or movie to tie up some of their cancelled shows should be a no-brainer.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h01dff/finishing_up_cancelled_shows/"
    },
    {
        "id": "1gzrqb7",
        "author": "Adventurous_Lake807",
        "title": "New medical drama Pulse",
        "content": "Netflix announced a promising new medical drama way back in February called Pulse. It supposedly wrapped filming in July. \n\nAnyone have any idea on when it may come out? I haven’t been able to find an update on it. The cast is great \n\nI’ve only been able to see that it may arrive early 2025. Not sure if that’s true or not ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzrqb7/new_medical_drama_pulse/"
    },
    {
        "id": "1gzw79a",
        "author": "Ratboyirl",
        "title": "I think my account was stolen. I tried the Netflix support portal and found it be beyond useless- what do I do?",
        "content": "As the title states, I got an email that my information and then email was changed - google says my email has not been accessed? \n\nI cannot log in, and I'm worried about the integrity of my account. Support is useless. Contacting them does not seem to work or be possible? What do I do?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gzw79a/i_think_my_account_was_stolen_i_tried_the_netflix/"
    },
    {
        "id": "1gzveml",
        "author": "x-_-lux-_-x",
        "title": "Captain Fall - i am so angry ",
        "content": "I just finished watching the animated comedy-not-so-comic Captain Fall and found myself so angry when, hunting down every possible hint of a second season in the making, i found out that not only it will never be renewed for such, but that it's been cancelled mid first season. What the fuck, why all the good shows get cancelled and never get a decent, decorous end? It might be one of my new favorite cartoons and realizing that i will never get to know what happens to Jonathan or how to the things that happened in the last episode that has aired will be sorted out. That's horrible ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzveml/captain_fall_i_am_so_angry/"
    },
    {
        "id": "1gzv6ba",
        "author": "pizzaprotector31",
        "title": "Does Jeselnik’s “Bones and All” come out tonight at midnight?",
        "content": "Wondering if Anthony Jeselnik’s new Netflix special comes out at midnight; it’s announced to release on November 26 (tomorrow), does that mean that tonight nov.25 as soon as the clock hits 00:00 it’s out, or does it come out sometime during the day tomorrow? I’m so excited to watch it, but I have too much work tomorrow night so I’d like to stay up past midnight tonight to watch it.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1gzv6ba/does_jeselniks_bones_and_all_come_out_tonight_at/"
    },
    {
        "id": "1gzju2e",
        "author": "anonymous231722",
        "title": "Must watch Netflix series!! ",
        "content": "I have watched : stranger Things, Money heist, GOT, Sex education, Wednesday. \nRecently I watched Alice in borderland and pretty much liked it. \nCan you all suggest some more good series to watch. \n",
        "upvotes": 2,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1gzju2e/must_watch_netflix_series/"
    },
    {
        "id": "1gzopzw",
        "author": "Downtown_Middle859",
        "title": "4+ New Movies Coming to Netflix (USA) in December 2024",
        "content": "1. **The Six Triple Eight (December 20)**\n2. **Carry-On (December 13)**\n3. **Maria (December 11)**\n4. **Camp Crasher (December 6)**\n\n[More.](https://www.cinemablind.com/new-movies-on-netflix-december-2024/)\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzopzw/4_new_movies_coming_to_netflix_usa_in_december/"
    },
    {
        "id": "1gznbhs",
        "author": "Senegal47",
        "title": "Need replacement show",
        "content": "I'm currently in the third and final season of The Lincoln Lawyer. I need something of that caliber to replace it when I'm done: no gory violence, explicit sex or excessive bad language. Something \"calm\" like The Lincoln Lawyer, preferably drama (no comedies or dramedies), but suspense wouldn't be bad. ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gznbhs/need_replacement_show/"
    },
    {
        "id": "1gzzbfx",
        "author": "ThunderbirdRider",
        "title": "WTF is going on Netflix?  Going blank on me and bouncing me back to the main menu",
        "content": " I tried repeatedly to watch (continue watching, I was already on the 3rd show) Man Inside and it kept going blank on me, bouncing me back to the main menu and forcing me to log in again.  And no, there was no problem with my internet connection because I gave up and switched to Apple TV+ and that worked",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gzzbfx/wtf_is_going_on_netflix_going_blank_on_me_and/"
    },
    {
        "id": "1h02h8k",
        "author": "waff64",
        "title": "Guys is netflix really gonna we lost our human and battle kitty?",
        "content": "So is all interactive netflix shows gonna be removed. [I got this information from him.](https://www.youtube.com/watch?v=CvQdFv8V8vc&amp;t=383s) I wish I could edit tiles since I made a mistake.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h02h8k/guys_is_netflix_really_gonna_we_lost_our_human/"
    },
    {
        "id": "1gyhqsm",
        "author": "waseijin",
        "title": "They killed a Goat in a japanese reality show",
        "content": "There is a reality show in Japan called \"Ai no Sato\".\nIn Season 2, they brought a miniature goat into an old, rotting house with no vet or specialist.\nAfter a month outside on a cold winter night, with little or no food, the miniature goat died.\nIt's unbelievable, absurd, and unrealistic.\nJapanese production company are terrible, but for Netflix to approve this and release the show is crazy.\nI contacted support and cancelled my subscription.\nI can't believe they would kill animals like this.\nI'm so angry rn...",
        "upvotes": 500,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1gyhqsm/they_killed_a_goat_in_a_japanese_reality_show/"
    },
    {
        "id": "1gzmd7c",
        "author": "cylemmulo",
        "title": "Whenever an ad plays it wrecks the bitrate on android",
        "content": "I've got an android tablet, and sadly the stupid tmobile ad plan. It's not a huge deal normally, but when i'm streaming now, and an ad plays, it reduces the bitrate to a blurry mess, then when it goes back to the video it's stuck at that horrible blurry bitrate and never gets better until I force close the app and re-open it. Even it I exit the show and re-enter it the bitrate stands.\n\nIDK how they screw things up this bad with ads.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gzmd7c/whenever_an_ad_plays_it_wrecks_the_bitrate_on/"
    },
    {
        "id": "1gzg0b2",
        "author": "Bapposaurus",
        "title": "Netflix problems",
        "content": "Netflix keeps causing my monitors to turn on and off repeatedly unless I go to another tab it happens because my graphics acceleration is turned on, but when I turn it off the resolution drops to 540p or 480p which is wild. I know it's not my internet because I have gigabit, and not my pc because it's relatively good, I just can't figure out what the problem is",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gzg0b2/netflix_problems/"
    }
]