[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 42,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qj4ic6",
        "author": "-deetjay-",
        "title": "Red Dead Redemption passes 3.3m Netflix downloads while paid game struggles past 10k",
        "content": "",
        "upvotes": 95,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qj4ic6/red_dead_redemption_passes_33m_netflix_downloads/"
    },
    {
        "id": "1qj43us",
        "author": "Mundane_Main_9616",
        "title": "Need calming shows.",
        "content": "I need to find a new show that is slightly funny, with very little drama, but still exciting enough to pay attention to in short bursts. I have ADHD and other issues that keep me from paying good attention to TV. So I really don't want something that I have to pay a lot of attention to to understand. I don't like competition shows because of the drama. I need something chill, to not work myself up. I usually can't find a show and sit in silence and it causes racing thoughts or doom scrolling. Any recommendations would be greatly appreciated. ",
        "upvotes": 45,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1qj43us/need_calming_shows/"
    },
    {
        "id": "1qjfmvv",
        "author": "bludhavengabagool",
        "title": "KPop Demon Hunters notches up one more Netflix record before Oscar season kicks into full swing",
        "content": "\"The movie was not just the biggest movie of 2025 for Netflix, but it eclipsed any potential competition from the likes of Happy Gilmore 2 or Guillermo del Toro’s Frankenstein.\" -full article [here](https://www.thepopverse.com/movies-kpop-demon-hunters-dominated-netflix-2025-happy-gilmore-2-frankenstein)",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qjfmvv/kpop_demon_hunters_notches_up_one_more_netflix/"
    },
    {
        "id": "1qi6xr5",
        "author": "Fun_Molasses5215",
        "title": "Queer Eye's Karamo claims he's felt 'mentally and emotionally abused for years' as he pulls out of press for upcoming season over fear of his co-stars 'bullying' him",
        "content": "",
        "upvotes": 535,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1qi6xr5/queer_eyes_karamo_claims_hes_felt_mentally_and/"
    },
    {
        "id": "1qjhalk",
        "author": "StyleNew1328",
        "title": "Is that Caroline Polachek's vocal being used in the new Elizabeth Smart documentary on Netflix?",
        "content": "It is exactly the vocal during the quieter/break down part of Desire, I Want to Turn Into You\n\nPlease tell me I am not the only one thinking this! It sounds 1-1 exact!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qjhalk/is_that_caroline_polacheks_vocal_being_used_in/"
    },
    {
        "id": "1qjfapm",
        "author": "cjmarquez",
        "title": "Issues playing shows",
        "content": "I've been having issues in my Samsung TV and Roku playing movies or series, the video will just not load or will play for a bit then stuck at 25% spinning forever.\n\nI've been having this problem since October 2025 or so, I've tried everything, resetting to factory my tv and Roku, created a new profile, restart the app, reinstall, nothing seems to work.\n\nHave anyone been in this situation and managed to solve it? it's unwatchable I may cancel my subscription.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qjfapm/issues_playing_shows/"
    },
    {
        "id": "1qjbt5z",
        "author": "fairplanet",
        "title": "Why are the subtitles so goofy",
        "content": "So on a chromecast 4th gen i watch with english subtitles since it can be hard to understand it for me some times but when turning it on its really goofy looking\nLike not just in normal sentence format but diagonally and everything",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qjbt5z/why_are_the_subtitles_so_goofy/"
    },
    {
        "id": "1qjarq0",
        "author": "kingcolbe",
        "title": "Universal on Netflix",
        "content": "With honey don’t coming to Netflix on February 3rd and Megan 2.0 coming next week is it safe to assume they probably found a way to get out of that Prime Video a couple years early",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qjarq0/universal_on_netflix/"
    },
    {
        "id": "1qj98id",
        "author": "HamHamHam2315",
        "title": "Anyone try to watch Pulp Fiction on Netflix recently? I just tried, and the picture quality is unwatchable.",
        "content": "I checked my network settings, restarted my router, restarted the Netflix Roku app (twice), checked for updates, and still the picture quality looks like I'm watching it on a VHS copy of a VHS copy of a VHS copy. And it's only Pulp Fiction. Every other thing I just watched was in pristine 4K HD, as expected.\n\nAnybody else have this happen with Pulp Fiction?\n\nEDIT: It's perfectly fine on my phone. So it's only on my Roku TV, and only Pulp Fiction. Interesting.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qj98id/anyone_try_to_watch_pulp_fiction_on_netflix/"
    },
    {
        "id": "1qj8ucv",
        "author": "Timewilltell755",
        "title": "Is the Skyscraper live event real or are there precautions we don’t know about?",
        "content": "It’s will probably bring in huge ratings but I can’t believe there aren’t any precautions. Is there something Netflix has to sign be absolved of all liability?  ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qj8ucv/is_the_skyscraper_live_event_real_or_are_there/"
    },
    {
        "id": "1qie9lh",
        "author": "obviouslyapparant",
        "title": "Does anyone else struggle with over the top background music?",
        "content": "Has anyone else noticed the increased presence of over the top background music? I not only struggle to hear the dialogue but I find it so distracting that I’ve had to turn a few programmes off because if it. It’s not even adding anything to the programme itself (I mostly watch documentaries) and it’s not subtle.\n\nI’ve tried changing the audio settings but it’s not helped. It’s not just Netflix recently but it’s the main culprit. ",
        "upvotes": 54,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qie9lh/does_anyone_else_struggle_with_over_the_top/"
    },
    {
        "id": "1qj71yy",
        "author": "St1na_",
        "title": "It removed my shows only on my phone and laptop?",
        "content": "I was watching Better Call Saul when I noticed my laptops keyboard brightness wasn't working so I downloaded \"hp hotkey keyboard \" and when i went on netflix the show was suddenly gone? then I entered netflix on my phone and it wouldn't show up there either, but when it use my mobile data it works... does anyone know what to do? it also wont let me watch breaking bad only el camino.\n\nif someone knows what error this is please help me.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qj71yy/it_removed_my_shows_only_on_my_phone_and_laptop/"
    },
    {
        "id": "1qidygb",
        "author": "-deetjay-",
        "title": "Netflix beats revenue estimates as subscribers reach 325 million",
        "content": "",
        "upvotes": 59,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qidygb/netflix_beats_revenue_estimates_as_subscribers/"
    },
    {
        "id": "1qizb6q",
        "author": "Eonster",
        "title": "His &amp; Hers Questions",
        "content": "Just finished watching His &amp; Hers, and while it was enjoyable, there are some things that I am left wondering/ confused about.  \nI also realize it's an imperfect crime miniseries and you sort of just have to enjoy it for what it is, but would love to know if anyone else has thoughts or answers on any of the below points.\n\n1. What was Lexy’s plan at the house if she wasn’t the killer? Did she think Anna was the killer? Was she just upset and defending her husband who had been locked out? Fighting Anna because she slept with Richard? There seem to be a variety of motives here, but if Lexy was not the real killer, the whole scene seemed odd – particularly when Richard had all the tools and materials for kidnappings, etc. laid out on the table.\n2. When Zoe corners Jack in his office, what was she going to say to him about Anna not being what Jack thought she was? Seemed like a loaded and odd thing to say once you see how the 16th birthday secret actually played out. Could be Zoe trying to deflect or misdirect Jack because of her own guilt around that event?\n3. Why/ how would Anna marry the brother of someone who sat by and encouraged her assault? It seems like the trauma of the assault caused her to memory hole the events a bit (she doesn't mention her own assault when recounting the tale to Jack), but it still seems far-fetched.\n\nThere are plenty more questions I have, but these ones – particularly #1 – are sticking with me the most.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qizb6q/his_hers_questions/"
    },
    {
        "id": "1qi4iq9",
        "author": "jtsm1th01",
        "title": "Spoiler Ad DURING the Show Itself!",
        "content": "I started watching Stranger Things Season 1 Episode 1 with my son who had never seen the show before and in the first few minutes, a Verizon ad airs with Stranger Things spoilers! In the ad, characters literally explain key scenes to each other, spoiling the show we're ACTIVELY watching!?\n\nWhat a terrible decision by Netflix to not prevent this type of thing. I had to yell at my son to close his eyes while scrambling to hit the mute button so it wouldn't ruin the show. I know he's late to the party, but he's just now old enough to watch the show and was so excited to start it.\n\nAiring trailers for future seasons which spoil unwatched seasons is bad enough, but this seems like a new level of disregard. If nothing else, can't they put it some type of setting to disable these types of things?",
        "upvotes": 78,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1qi4iq9/spoiler_ad_during_the_show_itself/"
    },
    {
        "id": "1qid230",
        "author": "_fastcompany",
        "title": "How Netflix brought interactive voting to ‘Star Search’",
        "content": "On January 20, Netflix is bringing back the popular talent competition *Star Search*, with a twist: For the first time in its history, Netflix will let its audience decide the outcome of a show with live voting. However, unlike how shows have done this in the past, audiences won’t have to send text messages or call a special number to make their votes count. Instead, viewers will vote with their TV’s remote control, or right within the Netflix app if they watch the show on their phones.\n\nNetflix hopes that this level of simplicity will help to make live programs like *Star Search* a lot more exciting, and offer its audience a chance to experience shared watercooler moments that tend to be missing from today’s world of hyper-personalized streaming. “You can influence the outcome \\[together with\\] everyone at the same time,” says Netflix member product VP Elmar Nubbemeyer. “You’re part of the Zeitgeist at that moment.”\n\nTo bring real-time voting to *Star Search*, Netflix relied on work it previously did for interactive narrative shows. It also snuck voting tests into David Chang’s Netflix show, and showed focus groups segments from two fake shows it cooked up for testing purposes.  The company even built internal tools that will help it to repurpose live voting and polling for other live events and shows in the future.\n\n“We are planning more of these types of moments,” says Netflix product designer Navin Iyengar. “*Star Search* is really the big unveiling of it.”\n\nWhen *Star Search* debuts Tuesday evening, viewers will have two distinct opportunities to make their voices heard. Once a singer or comedian is done with their performance, a graphic will pop up on screen, encouraging each viewer to give it a rating ranging from one to five stars. “We knew early on that giving a star rating as an interaction was really important,” says Iyengar. “It’s core to the *Star Search* IP.”\n\nLater on, they’ll also get the chance to choose their personal champion of the night out of four choices presented next to each other on screen. Each voting graphic will remain on screen for about 60 seconds, and the show’s host—Anthony Anderson, best known for the ABC sitcom *Blackish*—will respond to the incoming vote tally in real time.\n\nIt’s the first time Netflix has done real-time voting like this, but the company has been experimenting with getting viewers more actively involved for almost a decade. In 2017, the streaming service released its first interactive TV shows, which prompted viewers to choose their own adventure through branched narratives. In one scene of “Bandersnatch,” an interactive episode of the dystopian sci-fi show *Black Mirror*, the viewer has to decide whether the main character should take his medication by pressing left or right buttons on their remote control, with different choices leading to vastly varying outcomes. \n\n[Read more on Fast Company.](https://www.fastcompany.com/91477533/how-netflix-brought-interactive-voting-to-star-search)",
        "upvotes": 18,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qid230/how_netflix_brought_interactive_voting_to_star/"
    },
    {
        "id": "1qim219",
        "author": "CantFindUsername400",
        "title": "Shows/ movies like adolescence, when they see us, Chernobyl etc.",
        "content": "I loved the above shows. Netflix recommendations aren't that great, unbelievable is good but not as much as adolescence. open to new recommendations. I absolutely loved Chernobyl.",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qim219/shows_movies_like_adolescence_when_they_see_us/"
    },
    {
        "id": "1qhybb7",
        "author": "unicorn540",
        "title": "Keira Knightley and Ambika Mod spotted filming for series two of Black Doves",
        "content": "The two actors were filming outside St Mary le Strand",
        "upvotes": 73,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qhybb7/keira_knightley_and_ambika_mod_spotted_filming/"
    },
    {
        "id": "1qioptp",
        "author": "oldrain21",
        "title": "Seven Dials, Agatha Christie - Blurry Background",
        "content": "I’m watching the first episode of Seven Dials (Agatha Christie) and I have a question:\n\nSo far (halfway through the episode), almost all the backgrounds around the characters look slightly blurred or out of focus (I’m not sure of the correct term), and it’s starting to bother me a bit.\n\nHere’s my question (extremely silly, but I don’t know the answer): is this actually part of the filming, or is it a problem with my web browser?\n\nAt the moment, I can’t test it on other devices.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qioptp/seven_dials_agatha_christie_blurry_background/"
    },
    {
        "id": "1qin1y9",
        "author": "ninibean482",
        "title": "Restore Netflix's Details/More Info page",
        "content": "I've been a loyal Netflix user since nearly the beginning, and throughout these years, I've consistently relied on the platform's Details/More Info page. This feature allowed me to read descriptions, check ratings and captions, confirm runtimes, and select the right episode to watch. However, with Netflix's recent design change, many titles now play automatically when you click on them, without allowing us to view these crucial details first. This shift not only disrupts our viewing experience but also raises several significant concerns.\n\nFirstly, the removal of the Details/More Info page undermines accessibility. Users with hearing or vision impairments, or those who prefer certain languages, have been left without immediate access to critical information such as available captions or language options. This change diminishes the inclusive spirit Netflix formerly championed.\n\nFurthermore, for parents, the inability to preview content poses a risk. Without being able to assess content suitability via ratings, parents may inadvertently expose their children to inappropriate material.\n\nAdditionally, for those on limited data plans, it's essential to preview content details to ensure their data is used wisely. Confirming that a show is appropriate and worth watching before it begins streaming is no longer straightforward, leading to possible unnecessary data consumption.\n\nCan we please ask Netflix to restore the Details/More Info page? At the very least, create a customizable account setting allowing users to choose whether to automatically play content or to view details first would greatly enhance user experience and satisfaction.\n\nThis request aims to improve the service for all users and underscore Netflix's commitment to accessibility, family safety, and user choice. Please feel free to weigh in… anyone else annoyed?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qin1y9/restore_netflixs_detailsmore_info_page/"
    },
    {
        "id": "1qiqwwb",
        "author": "Limp-Helicopter-5819",
        "title": "[THE WALTER BOYS] Mi visión para T3 y T4: \"Sanación primero, luego amor\" (Y más desarrollo para TODOS)",
        "content": "Hola a todos, #TeamCole y #TeamAlex (y #TeamJackie sobre todo).\n\nAcabo de terminar la T2 y, aunque me encantó, me quedé con una sensación fuerte: si esta serie quiere ser memorable y no otro cliché adolescente, necesita darle tiempo a sus personajes para SANAR. Y no solo a los del triángulo.\n\nSiento que Jackie ama a Cole, pero le aterra perder el control. Con Alex hay confianza y cariño, pero no esa pasión abrumadora. Y ahora Alex actúa como \"rebelde\", pero claramente es una coraza por el dolor.\n\nMi sueño (y quizás el de muchos) sería esta estructura:\n\n· Temporada 3: \"La Sanación\"\n      Que no gire solo en torno a \"¿a quién elige Jackie?\". Sino en sanar a toda la familia Walters y su círculo:\n  · Jackie, Cole y Alex (como describí arriba, cada uno con su terapia y crecimiento personal).\n  · Los hermanos Walters: Profundizar en Will y su sordera, en Danny y su amor por el arte, en Lee y su búsqueda de identidad. Que dejen de ser decoración.\n  · Las amistades: Darle arco a Skylar, a Nathan y hasta a Kiley. Que sus relaciones tengan peso.\n  · Los adultos: Que la mamá Walter y la tía tengan sus propias historias de superación.\n· Temporada 4: \"La Construcción\"\n      SOLO entonces, con personajes enteros, podrían explorarse relaciones saludables.\n  · Un posible reencuentro Jackie-Cole sería desde la plenitud, no desde el trauma.\n  · Alex merecería encontrar su propia felicidad, con alguien que lo elija desde el día 1.\n  · Podríamos ver relaciones sólidas entre los hermanos, amistades que perduran y, en general, un \"después\" feliz y creíble para todos.\n\n¿Por qué?\nPorque Colorado y los Walters son un ECOSISTEMA, no solo un escenario. Su sanación debe ser colectiva. Esto le daría una profundidad increíble a la serie y haría que el viaje de Jackie, Cole y Alex se sienta parte de algo más grande y real.\n\nSé que Netflix ama los finales rápidos, pero... ¿no sería más poderoso y satisfactorio? ¿Apoyarían una temporada de \"sanación\" que desarrolle a TODOS, incluso si retrasa el \"endgame\" principal?\n\nCompartan sus ideas. Ojalá los escritores vean que hay fans que queremos un mundo entero, no sólo un triángulo.\n\n#TheWalterBoys #MiVidaConLosChicosWalters #TeamCole #TeamAlex #Netflix",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qiqwwb/the_walter_boys_mi_visión_para_t3_y_t4_sanación/"
    },
    {
        "id": "1qiqvdf",
        "author": "Limp-Helicopter-5819",
        "title": "[THE WALTER BOYS] My vision for S3 and S4: \"Healing first, then love\" (And more development for EVERYONE)",
        "content": "Hey everyone, #TeamCole and #TeamAlex (and most importantly, #TeamJackie).\n\nJust finished S2 and, while I loved it, I was left with a strong feeling: if this show wants to be memorable and not just another teen cliché, it needs to give its characters time to HEAL. And not just the love triangle.\n\nI feel Jackie loves Cole, but she's terrified of losing control. With Alex, there's trust and affection, but not that overwhelming passion. And now Alex is acting \"rebellious,\" but it's clearly armor for his pain.\n\nMy dream (and maybe many of yours) would be this structure:\n\n· Season 3: \"The Healing\"\n      Not centered solely on \"Who will Jackie choose?\" But on healing the entire Walter family and their circle:\n  · Jackie, Cole, and Alex (as described above, each with their therapy and personal growth).\n  · The Walter Siblings: Deepen Will's journey with deafness, Danny's passion for art, Lee's search for identity. Let them stop being background decor.\n  · The Friends: Give Skylar, Nathan, and even Kiley proper story arcs. Let their relationships have weight.\n  · The Adults: Let Mom Walter and Aunt have their own stories of moving on.\n· Season 4: \"The Building\"\n      ONLY then, with whole characters, could healthy relationships be explored.\n  · A potential Jackie-Cole reunion would come from a place of wholeness, not trauma.\n  · Alex would deserve to find his own happiness, with someone who chooses him from day one.\n  · We could see solid sibling bonds, lasting friendships, and an overall believable and happy \"after\" for everyone.\n\nWhy?\nBecause Colorado and the Walters are an ECOSYSTEM, not just a backdrop. Their healing should be collective. This would give the series incredible depth and make Jackie, Cole, and Alex's journey feel part of something bigger and real.\n\nI know Netflix loves quick endings, but... wouldn't this be more powerful and satisfying? Would you support a \"healing\" season that develops EVERYONE, even if it delays the main \"endgame\"?\n\nShare your thoughts. I hope the writers see that there are fans who want a whole world, not just a love triangle.\n\n#TheWalterBoys #Netflix #TeamCole #TeamAlex",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qiqvdf/the_walter_boys_my_vision_for_s3_and_s4_healing/"
    },
    {
        "id": "1qibszf",
        "author": "Mr_Perfectly_UnFine",
        "title": "Rom com recommendation",
        "content": "So I love romcoms like While you were sleeping, pretty woman, the Proposal etc. \n\nI have seen People you meet on vacation and loved it. Any similar movies you can recommend?",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qibszf/rom_com_recommendation/"
    },
    {
        "id": "1qia0l4",
        "author": "its35degreesout",
        "title": "Southland",
        "content": "Not really a \"question,\" but in a way it is: how long has Southland been available on Netflix? They have just recently started promoting it on my feed, and I am happy to see the series is now available, since before cutting the cable cord that was one of my favorite cop shows. It used a number of storytelling devices which at the time felt new to me, and had a real, gritty flavor. We are planning to watch it as soon as we are done with the series we are watching now! Highly recommend. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qia0l4/southland/"
    },
    {
        "id": "1qionlp",
        "author": "Striker_EZ",
        "title": "Creating an account with one IP address and going back home to a different IP address",
        "content": "I’m currently away from home right now (at the in-laws while training for an internship) and got hooked on a Netflix show my in-laws started watching while I was trying to do schoolwork. I would love to make a poor decision and stay up late and watch just one more episode. But they’ve already gone to bed, and I can’t sit out in the living room and watch it as they keep their bedroom door open to let the cats roam in and out. I don’t have my own Netflix account yet, but I do have a free one year subscription I haven’t activated yet. If I activate it here, will I run into problems when I get back home and try to use a different WiFi?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qionlp/creating_an_account_with_one_ip_address_and_going/"
    },
    {
        "id": "1qidkep",
        "author": "AstralKatOfficial",
        "title": "This might be an odd question but is the \"Still Watching Netflix\" youtube channel an official one from netflix?",
        "content": "I've seen a few videos from that channel pop up in my feed and it seems to be like a behind the scenes channel which to be fair the channel description does mention, but I always get apprehensive about these kinds of channels if they aren't official. I love watching behind the scenes stuff so I'd like to know if it's an official channel owned by netflix or if its just some rando uploading clips from other places",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qidkep/this_might_be_an_odd_question_but_is_the_still/"
    },
    {
        "id": "1qim5ik",
        "author": "MidgardDragon",
        "title": "Suddenly streaming quality issues on a single episode of a single show",
        "content": "We switched back from Kids profile and my wife resumed an episode of The Following. The quality dropped to where there is static and fuzz and artifacts all over the episode. No other show I've tried to play has this problem. No other streaming service has a problem. And this episode of this show in Netflix has the same problem on any network and any device. The hell?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qim5ik/suddenly_streaming_quality_issues_on_a_single/"
    },
    {
        "id": "1qim5af",
        "author": "VesnaKostic",
        "title": "Favorite whodonit tv show, which makes you a true detective and I want the resolution to exceed my wildest imagination. I watched Behind her eyes and His&amp;Hers.",
        "content": "\n\nI want a show that will turn me into HERCULES POUIR. I also want to argue and argue with my husband over the course of the series about who is the GUILTY. My favorite TV show is Tabula Rasa (2017), and the second place is The Watcher, but also everything about Coben. SUGGESTIONS PLEASE, I want to feel like an OBSESSIVE DETECTIVE",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qim5af/favorite_whodonit_tv_show_which_makes_you_a_true/"
    }
]