[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hguwkt",
        "author": "GaleSTRIK3",
        "title": "La Palma Was Absolutely Ridiculous ",
        "content": "I NEED to know the math behind this wave because there is no way in hell anyone on that plane is in one piece",
        "upvotes": 249,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1hguwkt/la_palma_was_absolutely_ridiculous/"
    },
    {
        "id": "1hh1ulu",
        "author": "Pogrebnik",
        "title": "The Russo Brothers Unleash Sci-Fi Magic in the First Trailer for Netflix's 'The Electric State'",
        "content": "",
        "upvotes": 35,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1ulu/the_russo_brothers_unleash_scifi_magic_in_the/"
    },
    {
        "id": "1hgjpkg",
        "author": "Alan_Stamm",
        "title": "'Carry-On' Review: Decent Airport Thriller [streaming now]",
        "content": "",
        "upvotes": 138,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1hgjpkg/carryon_review_decent_airport_thriller_streaming/"
    },
    {
        "id": "1hh1m15",
        "author": "baranun",
        "title": "Don't Look Up",
        "content": "Great movie!\n\nI REALLY hope there won't be a giant asteroid coming towards earth in the next 4 years and turn this movie from dark comedy to humanities last documentary.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1m15/dont_look_up/"
    },
    {
        "id": "1hglzk1",
        "author": "Andoppy18",
        "title": "How Mindhunter’s Marketing Won Critics and True Crime Junkies — But Missed a Mass Audience",
        "content": "",
        "upvotes": 49,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hglzk1/how_mindhunters_marketing_won_critics_and_true/"
    },
    {
        "id": "1hh52rd",
        "author": "MrPink0612152504",
        "title": "All she needed was the love he gave",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fsdptsfttm7e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hh52rd/all_she_needed_was_the_love_he_gave/"
    },
    {
        "id": "1hh05lz",
        "author": "TechnologyEconomy858",
        "title": "TV error nw-4-7. AND iPhone won't cast thru screen mirror or Netflix app. Does cast thru Chromecast from Pixel",
        "content": "I am stumped.  My wife and I share a Netflix standard account.  She has an iPhone. I have a Pixel.  And we have a 10y/o Sony Bravia TV that is connected via LAN cable to our network.  The TV software is up to date.  The TV has a Chromecast dongle and an Apple TV 'dongle'.  Login functionality has gone waaaaaayy downhill almost across the board and I don't know why.  Not sure if we have one problem or more than one problem.  We didn't change anything.\n\nNetflix app works fine on both our phones.\n\nNetflix will cast to the TV just fine from my phone from within the Netflix app.\n\nNetflix will not cast from her iPhone via screen mirror or from the Netflix app.  When she tries to screen mirror Netflix, it won't let her choose our TV...the device selection is blank.  She can screen mirror all other apps to the TV just fine, so this is only a Netflix issue.\n\nWe tried accessing Netflix from within the Apple TV interface.  She scanned the QR with her phone.  Her phone said she was all set while the Apple TV interface said it had trouble signing her in, Code 113.  Why the mismatch?\n\nNetflix will not start on the TV.  It tries to, then gives an error code nw-4-7.  I've reset the TV Internet content, run the Netflix diagnostics (\"Netflix server 2...nw-4-7\"), reset the Netflix app on the TV, cleared Netflix account cache via online instructions and done everything I can access from within the Netflix app,,the Netflix app on the TV and anything else within the TV ...all to no avail.  I updated our wifi mesh software.   Every other TV app works fine, and we have no trouble with computers or our phones on our wifi.  All network things have been turned off and on to reset.  No connectivity issues were found in TV self diagnostics.\n\nI don't even mind buying a new TV (😂) but based on our symptoms I don't think that will fix the issue.  \n\nThoughts from the group?  Please and thank you 🙂 Happy holidays! ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hh05lz/tv_error_nw47_and_iphone_wont_cast_thru_screen/"
    },
    {
        "id": "1hh4bsc",
        "author": "FakenFrugenFrokkels",
        "title": "Star Trek TNG, Voyager, Enterprise",
        "content": "Hello Netflix Sub I just discovered! I’ve noticed these titles recently showing back up on my app. Is anyone else seeing this? I’m posting because I get an error message any time I try to play them. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh4bsc/star_trek_tng_voyager_enterprise/"
    },
    {
        "id": "1hh439z",
        "author": "MovieGuyTravis",
        "title": "New Trailer for The Electric State with Millie Bobby Brown",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh439z/new_trailer_for_the_electric_state_with_millie/"
    },
    {
        "id": "1hgf38t",
        "author": "Njbryan13",
        "title": "La Palma",
        "content": "Is the worst show I’ve ever loved to watch the whole thing of. Omg is the show horrible but lord knows I had to watch it from beginning until the end because of how horribly great it was done. Wtf. ",
        "upvotes": 65,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1hgf38t/la_palma/"
    },
    {
        "id": "1hg765b",
        "author": "Whobitmyname",
        "title": "Netflix’s One Piece Season 2 Reportedly Wraps Filming",
        "content": "",
        "upvotes": 228,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hg765b/netflixs_one_piece_season_2_reportedly_wraps/"
    },
    {
        "id": "1hgtarz",
        "author": "Zealouscat_94",
        "title": "Carry On",
        "content": "I just watched this movie and something that I wonder about is what happened to the woman with the blue hair? It seemed apparent that she was in on the scheme as well but nothing seemed to happen to her.",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hgtarz/carry_on/"
    },
    {
        "id": "1hgwze9",
        "author": "ACunit41guy",
        "title": "Netflix glitch, it stopped listing shows that I was watching up until last week, like it thinks I am in another country.",
        "content": "I live in the US and have only ever watched content from my netflix account here in my home. For some reason Netflix seems to think I am in another country, as in it has stopped showing results for shows that I know are available in the US. Any ideas on what could be happening?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hgwze9/netflix_glitch_it_stopped_listing_shows_that_i/"
    },
    {
        "id": "1hgqgjq",
        "author": "beansrgud12343",
        "title": "Soul crushing animated shows",
        "content": "I need some really heart breaking animed show recommendations, I’ve already watched arcane and edgerunners and I want to know more shows similar to them",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hgqgjq/soul_crushing_animated_shows/"
    },
    {
        "id": "1hgu9rs",
        "author": "playdesegaymes",
        "title": "Auto Play Volume too Loud",
        "content": "Sometimes I watch Netflix on my PC and i have many things going at once Everything has different volumes and i have my system volume set about 35% of the way. Literally every program lets me designate the volume that i would like Discord lets you literally adjust individual people volume in call. \n\n  \nNetflix however you can adjust the volume of what you are watching but when you mouse over something it blasts you with the loudest preview ever. I like the preview but is it too much to ask for a universal volume setting for netflix. It can't be that hard. I'm sure a junior dev could whip something up in 30 mins. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgu9rs/auto_play_volume_too_loud/"
    },
    {
        "id": "1hfoujk",
        "author": "anonRedd",
        "title": "'A Man On The Inside' Renewed For Season 2 By Netflix",
        "content": "",
        "upvotes": 652,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1hfoujk/a_man_on_the_inside_renewed_for_season_2_by/"
    },
    {
        "id": "1hgtrbm",
        "author": "herenowjal",
        "title": "New Netflix disaster series is based on chilling hypothesis of what could actually happen to the world",
        "content": "",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hgtrbm/new_netflix_disaster_series_is_based_on_chilling/"
    },
    {
        "id": "1hgefoi",
        "author": "VerGuy",
        "title": "Guy Ritchie Expands 'The Gentlemen' Universe to Include 'Wife &amp; Dog' [All]",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hgefoi/guy_ritchie_expands_the_gentlemen_universe_to/"
    },
    {
        "id": "1hh02ag",
        "author": "jujubee198",
        "title": "Shills ",
        "content": "La Palma was the worst thing to see tv and Netflix shills are trying to make it Reddit relatable hecking pupperino. Are you guys really falling for “it was the worst thing I’ve ever seen but I couldn’t pull my eyes away”? Learn basic advertising please ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh02ag/shills/"
    },
    {
        "id": "1hghzzu",
        "author": "Kongopop",
        "title": "Question about extra members",
        "content": "I have standard.  I want to add my father who is in a different house.  Does the extra member still count towards using the \"only 2\" screens on Netflix at a time rule?  I b guessing that's how it works just want the answer ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hghzzu/question_about_extra_members/"
    },
    {
        "id": "1hgrtx2",
        "author": "Abc_123013",
        "title": "Netflix question ",
        "content": "At some point will Netflix still show the movies/shows that don’t allow ads to be seen? In case my question is confusing what I’m trying to say is I have Netflix with Ads and would like to see It Ends With Us but I have it with a Ads and therefore I cannot watch it, is this temporary?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hgrtx2/netflix_question/"
    },
    {
        "id": "1hgf3rn",
        "author": "BunyipPouch",
        "title": "Tyler Nilson and Michael Schwartz, the co-directors and co-writers of 'Peanut Butter Falcon' (currently on Netflix) are doing an AMA/Q&amp;A in /r/movies today Tuesday 12/17. It's live now, with answers at 7 PM ET.",
        "content": "https://i.imgur.com/ulgqSr8.jpeg\n\nTyler Nilson and Michael Schwartz, the co-directors and co-writers of 'Peanut Butter Falcon' (currently on Netflix) are doing an AMA/Q&amp;A in /r/movies today Tuesday 12/17. It's live now, with answers at 7 PM ET.\n\nIt's here for anyone interested:\n\nhttps://www.reddit.com/r/netflix/comments/1hgf1e4/tyler_nilson_and_michael_schwartz_the_codirectors/",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgf3rn/tyler_nilson_and_michael_schwartz_the_codirectors/"
    },
    {
        "id": "1hgghri",
        "author": "Additional-Active-40",
        "title": "Something wrong with my subtitle fonts. ",
        "content": "I tried changing the font from the normal 'block' font to the 'casual' font, but when I restart and check my Netflix, it comes out as another type of font. I don't know why it's happening. \n\n[This is the font that shows up](https://preview.redd.it/7byppej96g7e1.png?width=539&amp;format=png&amp;auto=webp&amp;s=9f4a15c91953b37b39595a68f3a255d7ae5abf3a)\n\n[This is the settings that I put in](https://preview.redd.it/4hgye0rd6g7e1.png?width=729&amp;format=png&amp;auto=webp&amp;s=a1f4a95737ef726ba222cad4e4344ef0b517951a)\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgghri/something_wrong_with_my_subtitle_fonts/"
    },
    {
        "id": "1hg1ssi",
        "author": "Coastal_Tide",
        "title": "Tv shows to binge to dissociate from my mom’s terminal illness? ",
        "content": "My mom recently received a terminal diagnosis  and I am not ok. \n\nLooking for shows to watch that DO NOT focus on death or mother / daughter relationships. (No greys anatomy or Gilmore girls)\n\nRecent shows that helped: sex lives of college girls and inventing Ana. \n\nPrevious shows I loved: OITNB, PLL, gossip girl, once an upon a time, XO kitty, heart stopper, you, Emily in Paris. \n\nBonus points for lesbian content ",
        "upvotes": 22,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1hg1ssi/tv_shows_to_binge_to_dissociate_from_my_moms/"
    },
    {
        "id": "1hg9vyk",
        "author": "Individual_Fact8159",
        "title": "Bunk'd thoughts ",
        "content": "How do you like the Bunk’d series? I enjoy it. I know it's a spinoff from Jessie. I also love that show, but it has lots of development and ask, and it’s getting lots of hate \n\nThoughts ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hg9vyk/bunkd_thoughts/"
    },
    {
        "id": "1hfyjzs",
        "author": "Lucky-bottom",
        "title": "Kings of Tupelo vs Tiger King",
        "content": "I just watched Kings of Tupelo and holy shit, my brain is still tweaking. WTF did I just watch? Are there any normal people in Tupelo?? \n\nAnyway, Kings of Tupelo vs Tiger King - which one takes the cake of WTF for you? ",
        "upvotes": 30,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hfyjzs/kings_of_tupelo_vs_tiger_king/"
    },
    {
        "id": "1hg5xky",
        "author": "Robemilak",
        "title": "Netflix Releases Trailer for Japanese Drama Remake ‘Asura’",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hg5xky/netflix_releases_trailer_for_japanese_drama/"
    },
    {
        "id": "1hg67sa",
        "author": "ellie04jane",
        "title": "Netflix Work Culture - Experimentation Team",
        "content": "I’m currently working as a Data Analyst in Experimentation and A/B testing. While I’ve enjoyed my work, I’m not entirely happy with my current pay ($120K). For context, I have a master’s degree in Data Science from Tier 1 US University and over 10 years of experience spanning data analysis, software development, and analytics.\n\nI’m considering applying to Netflix, particularly in their Experimentation team, as I’ve heard they offer competitive salaries and challenging work. However, I want to understand more about their work culture, especially from people who’ve worked or currently work there.\n\nI’ve read about Netflix’s emphasis on “freedom and responsibility” and radical candor, which sounds appealing but also potentially intense. I thrive in high-performance environments but would like to avoid a culture similar to Amazon’s (which I’ve heard can be cutthroat and overly demanding).\n\nIf you’ve worked in Netflix’s Experimentation team, could you share:\n\n1. What’s the day-to-day work like?\n2. How’s the work-life balance?\n3. Are teams collaborative or highly competitive?\n4. What are the best and most challenging aspects of the culture?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hg67sa/netflix_work_culture_experimentation_team/"
    },
    {
        "id": "1hfou2k",
        "author": "Cheersscar",
        "title": "Can someone explain why Netflix originals leave the service?",
        "content": "I don't get it.  Why are some Netflix original shows leaving the service? Don't Netflix own this content? Worth more to license them elsewhere?  Disney style lock it in a box? What's the story?",
        "upvotes": 49,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1hfou2k/can_someone_explain_why_netflix_originals_leave/"
    },
    {
        "id": "1hg4fwm",
        "author": "iloveowls23",
        "title": "Apple TV App Keeps Logging Me Out",
        "content": "So I debated about posting here about this, but unfortunately Netflix Customer Service has offered absolutely no solution and they don’t seem to care at all about this.\n\nMy Apple TV 4K (latest iteration) and 4K 1st Gen both keep logging me out of my user account and Netflix only says “they have no issue reported about this” which is like saying nothing, basically.\n\nI’ve been using the same network, I live alone, I’m using a Premium account and have never shared my account with anyone else, also I never turn off my devices. In fact, I turned off both App &amp; System updates and this keeps happening still. I wonder if this has happened (is happening) to anyone else?\n\nI understand that they’re cracking down on shared accounts, accounts being used outside of the primary residence (which has proved quite flawed recently), but this is a new low for me. It’s rendering my account almost unusable at this point. I also use Disney, Max, Prime, Apple TV+ and Paramount and have yet to encounter this problem with either one of those.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hg4fwm/apple_tv_app_keeps_logging_me_out/"
    }
]