[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1patdun",
        "author": "f41ryb0n3s777",
        "title": "Removed a movie while i was watching it",
        "content": "Honestly just sharing it cus it’s funny but a little annoyed by it too. I was watching “Now You See Me 2” and i paused it for like 5 minutes to take a pee break. I come back and turn on the movie and it says title not available. I just brush it off as a typical Netflix glitch and refresh the page to see THAT THEY REMOVED THE MOVIE OFF THE WEBSITE 😭😭😭 REALLY NETFLIX\n",
        "upvotes": 273,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1patdun/removed_a_movie_while_i_was_watching_it/"
    },
    {
        "id": "1pb1uzy",
        "author": "jaeldawn",
        "title": "Netflix Security Policies Related to Email",
        "content": "Today I learned that if you know the email address that someone uses for their Netflix account, all you have to do is call customer service to have it changed, and they will.   \n  \nTwice today, my ex-husband called customer service and had them change my Netflix account to his email and phone number. I have had this Netflix account in my email, phone number, and paid by me for years, and all he had to do was ask, and they did it. I called to ask them how I can prevent this from happening, and their solution - Change it to an email that no one knows. I asked why they can't just set up verification before it is changed, or make a note that only I am the one that can make changes to my account. They didn't have an answer for me. Two-step verification or some kind of added security should be the right solution for this.",
        "upvotes": 26,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pb1uzy/netflix_security_policies_related_to_email/"
    },
    {
        "id": "1patbpk",
        "author": "StunningComment6064",
        "title": "True crime",
        "content": "Which is the best Netflix TV show based on true crimes? Which one do you recommend, or which one has stayed in your memory even today after you watched it?",
        "upvotes": 28,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1patbpk/true_crime/"
    },
    {
        "id": "1pb5snp",
        "author": "grahamalondis",
        "title": "Anyone else unable to stream particular episodes of Stranger Things S5 in 4K?",
        "content": "I'm on a wired connection at about 100 Mbps and I've tested it multiple times. Other seasons of Stranger Things, the trailers, and even the first episode of season 5 stream in 4K no problem. But for some reason episodes 2 and 3 (haven't checked 4) are only streaming 1080 and look like they're on a DVD from 2007. Like the bit rate of the video won't go beyond 1.87 Mbps while the episodes that play normally are above 12mbps. Awful.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5snp/anyone_else_unable_to_stream_particular_episodes/"
    },
    {
        "id": "1pb0za5",
        "author": "GuineaPKilledMe",
        "title": "I really wish they'd bring Hoops back",
        "content": "Ever since it released in 2020 it's been my comfort show. I don't know why it was so universally disliked. It's funny and silly and personally I enjoy how they go overboard with vulgarity. Apparently the reason it was cancelled after one season was due to the vulgarity, but why even allow season 1 then? \n\nUgh I miss Ben :(",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb0za5/i_really_wish_theyd_bring_hoops_back/"
    },
    {
        "id": "1pb5edr",
        "author": "harpreetthind",
        "title": "Question",
        "content": "Looking for movie recommendations already watched good girls watching Wednesday and finished watching\nThe haunting of Hill House what does everybody else recommend watching?\nThanks",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5edr/question/"
    },
    {
        "id": "1pan4i2",
        "author": "Remarkable-Slide-750",
        "title": "Stranger things season 5! What’s your thoughts?",
        "content": "I loved season 5! I had low expectations because it’s hard for a show to keep me engaged after season 3 and the fact so much time has passed between seasons but I think season 5 was carefully orchestrated! The characters weren’t overly exaggerated, the storyline had a lot of hooks so you’re not just waiting for that “one” thing to happen, and the relatable symbolizations of inner battles we all good through. I say bravo for keeping season 5 evolved while maintaining a steady baseline story! ",
        "upvotes": 23,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1pan4i2/stranger_things_season_5_whats_your_thoughts/"
    },
    {
        "id": "1p9vc1e",
        "author": "Affectionate_Key7206",
        "title": "The stranger things aren't strange anymore",
        "content": "I know a lot of people are gonna come for me, but it's just my opinion. And don't get me wrong, this show will *always* have a special place in my heart, but it's clear that it's outgrown itself.\n\nThe 80s appeal no longer really has its charm, the kids are no longer kids, and most importantly, the stranger things aren't strange anymore. The unknown is what makes something unsettling. When you begin to spell out all the aspects, it doesn't have that eerie feeling anymore. This show has over-explained its lore to the point where it's very convoluted and no longer uncanny. The whole point of the Upside Down was the unknown, another world that's beyond human comprehension. All of that goes away when you reveal that it's just some guy who's been pulling the strings since the first season. Not only is it overly detailed, but it's also been the same thing for nearly a decade now. The monsters were creepy at first, but now we've seen it a hundred times, so it doesn't have that effect anymore.\n\nI rewatched seasons 1 and 2, and it's honestly crazy how much the show has detached from itself. If somebody watches season 1 and then watches the first episode of season 5 right after, they would be completely baffled. Remember when this show was just about a boy who went missing? And the characters have so much plot armor. I love how the demogorgon slaughters the background characters almost instantly, but when it comes to our protagonists, it stands and screams, so they always run away. Not to mention, the dialogue is also really bizarre, lots of exposition dumps, etc.\n\nThere's a lot more I could say, but I don't want this to be too long. I just needed to voice my thoughts somewhere cause anytime you complain on TikTok or the ST subreddit, you just get attacked lol. But I'm glad others are enjoying it. I wonder if it will be one of those shows with an ending that's divisive among fans.",
        "upvotes": 1289,
        "comments": 443,
        "media": null,
        "permalink": "/r/netflix/comments/1p9vc1e/the_stranger_things_arent_strange_anymore/"
    },
    {
        "id": "1pb6nl0",
        "author": "Successful-Break-585",
        "title": "Rust Valley restorers missing after S3",
        "content": "I am trying to watch Rust valley restorers on Netflix in India and can only find episodes upto S3 nothing after that. Where can I find remaining episodes?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb6nl0/rust_valley_restorers_missing_after_s3/"
    },
    {
        "id": "1pavdny",
        "author": "Notoriously_So",
        "title": "New Layout",
        "content": "I don't know if this is a beta thing or whatever, but the new Netflix layout on Chromecast and TV is pure garbage. The icons are way too big and it's basically impossible to navigate. Why can't they just leave things how they were before?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pavdny/new_layout/"
    },
    {
        "id": "1palmyi",
        "author": "Texanlivinglife",
        "title": "Sweet Magnolia's",
        "content": "Perfect day for binge watching. I love Sweet Magnolia's but, I'm having a hard time finding anything like it. I'm really not watching Christmas movies. Recommendations please and thanks.",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1palmyi/sweet_magnolias/"
    },
    {
        "id": "1pb32mv",
        "author": "Outofcontexttacoboi",
        "title": "Netflix extra member slot not working",
        "content": "Whenever my partner tries to sign up with an extra member slot on Netflix it completely kicks me out of the household, she has tried on her phone and tv and for some reason every time she signs in it signs her into her phone only and then kicks me out of the household but I'm paying for the extra slot and the actual subscription. What does she need to do set up? We tried signing into the slot with password, qr code, and link but the extra slot never gets used. What is the step by step process to fully set up the extra member slot?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pb32mv/netflix_extra_member_slot_not_working/"
    },
    {
        "id": "1pa32qj",
        "author": "Samurai_Geezer",
        "title": "Why is it so difficult to just watch the credits after the movie is done",
        "content": "I do not want a commercial right after an emotional ending of a movie, I want to think about it a bit more, pay respects to the people who made it, check out if that one actor I vaguely recognized was really the one I thought it was. Now I have to scroll through the entire movie just to get back to the credits that was automatically skipped. Goddamnit ",
        "upvotes": 176,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1pa32qj/why_is_it_so_difficult_to_just_watch_the_credits/"
    },
    {
        "id": "1pb01bn",
        "author": "cherri_blossoms235",
        "title": "Someone please tell me I'm not the only one who is dealing with this",
        "content": "Please tell me I'm not the only one dealing with post-series depression from the series, \"The Dragon Prince\"\n\nI cannot even think about this series without being reminded that I finished it and there is going to be no more episodes or seasons (which ends with me sobbing for 5 minutes)\n\nI literally have never dealt with something like this before. Never cried during sad movies, nothing like that. (All my friends call me emotionless) \n\nSo how does a kids show pull with my heartstrings this bad?? \n\nPlease, someone tell me I'm not the only one dealing with this because otherwise I'm going to have to believe I'm going crazy.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pb01bn/someone_please_tell_me_im_not_the_only_one_who_is/"
    },
    {
        "id": "1pb47ue",
        "author": "Notoriously_So",
        "title": "Top and bottom black bars",
        "content": "Why do most shows on Netflix show top and bottom black bars when streaming on TV, when most other streaming services don't do this? Is there a setting to remove them?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pb47ue/top_and_bottom_black_bars/"
    },
    {
        "id": "1paqznm",
        "author": "luckyywallflower",
        "title": "True Crime Docus",
        "content": "Are there other true crime documentaries that are the same format (use only bodycam footage, interviews) or same vibe with THE PERFECT NEIGHBOR?\n\nReally loved that docu. I understand the hype.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1paqznm/true_crime_docus/"
    },
    {
        "id": "1pastl6",
        "author": "PropertySuspicious35",
        "title": "Trying to watch a downloaded episode but it tells me I’ve reached the end of the download.",
        "content": "Netflix says my episode is fully downloaded (phone with checkmark symbol), but then 20 minutes in it says that I have reached the end of the downloaded portion. This is the first time it’s ever happened after 5+ years of downloading downloading stuff on Netflix.  How can I fix this? Why is Netflix lying to me about what I have downloaded?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pastl6/trying_to_watch_a_downloaded_episode_but_it_tells/"
    },
    {
        "id": "1pauypl",
        "author": "fortycreeker",
        "title": "Issues watching on browser",
        "content": "I've been trying to resolve an issue with watching on my laptop. Simply put, the video will not play, just gives the spinning red circle and no error message. \n\nI've tried deleting my cache, updating my drivers, switching browsers (chrome, edge), reconnecting to my wifi and restarting my computer, but nothing seems to fix it. When I restart, it will work for a few minutes before stopping again. Youtube and all other video services seem to work fine, and as far as I can tell there are no outages. \n\nHas anyone had any issues like this before?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pauypl/issues_watching_on_browser/"
    },
    {
        "id": "1pa74qg",
        "author": "ahnonymous_",
        "title": "Stranger Things S5 - Part 2 released on Dec 26th? Seriously?",
        "content": "I am so annoyed Netflix did this. I wouldn't have even minded if they released each episode weekly but an entire month between episodes? Are you kidding?\n\nI assume they're doing this to keep subscriptions into the new year but honestly, this has made me want to cancel my subscription more than anything. ",
        "upvotes": 31,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1pa74qg/stranger_things_s5_part_2_released_on_dec_26th/"
    },
    {
        "id": "1pb78ut",
        "author": "bbmoonkie",
        "title": "Claire Danes overacting in The Beast In Me",
        "content": "Anyone else notice that Claire Danes must have recently  learned how to make her chin and bottom lip quiver for the show?  She  did it in virtually every damn  scene in the show. Some of the scenes it was done so unnecessarily. It started annoying me a couple of episodes in, yet I thought it would surely stop at some point.  We get it Claire, you're trying to act sad. It can be done without the bottom lip thing. Just something I found a little annoying in the show. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pb78ut/claire_danes_overacting_in_the_beast_in_me/"
    },
    {
        "id": "1papd8t",
        "author": "Betafish_Blue",
        "title": "Buffering",
        "content": "The day before Thanksgiving our Netflix worked perfectly fine. Ever since then it starts to buffer about 10-20 minutes into what we’re watching. It will buffer for a few minutes, and then say it can’t play the title at this time. We aren’t having this issue with any other streaming service (Prime, Hulu, Disney). Our Firestick is newer (bought within the last 6 months), and we don’t have any internet issues. Is anyone else having this issue?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1papd8t/buffering/"
    },
    {
        "id": "1palplt",
        "author": "ThomasThePizzaMan",
        "title": "Please help, Netflix Puzzle shows emojis when you win, what do they mean?",
        "content": "Stupid question… I’ve been playing Netflix Puzzle and every time I finish a level, the game shows a set of emojis at the end of the win screen. Some of them look random or out of order, and I can’t tell if they’re supposed to represent my performance, a mood, hints, difficulty, or just something decorative for fun. I’m wondering if anyone knows what these ending emojis actually mean. Is there a pattern or scoring system behind them? Or is it just visual flair? Bonza, Jigsaw, Crossover, Sudoku, Starstruck, Waywords, Shapes, and Keysmash. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1palplt/please_help_netflix_puzzle_shows_emojis_when_you/"
    },
    {
        "id": "1paaxql",
        "author": "anonymouszod",
        "title": "Not connected to home internet",
        "content": "We’re in college and use my father in laws Netflix account, for the last few years we’ve just simply taken home our console whenever we go back and use it on the home wifi then when we come back to college it works great. We just did this same thing (same process and everything which included starting/watching a show on it) and it still blocks us (this goes for Disney+ too). Any idea on why or how to fix it??",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1paaxql/not_connected_to_home_internet/"
    },
    {
        "id": "1pac2fm",
        "author": "DataPollution",
        "title": "Stranger Thing - only in HDR instead of Dolby Vision (LG G1)",
        "content": "Hi. I just rejoined Netflix and signed up and tried to watch stranger thing. My question is why does it use HDR while in the description it does say Dolby Vision on my LG G1 tv. Other shows and movies does work with Dolby Vision. Am I missing something here. \n\n\nPS: I use the netflix app and yes it is latest version. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pac2fm/stranger_thing_only_in_hdr_instead_of_dolby/"
    },
    {
        "id": "1paxx26",
        "author": "x-si",
        "title": "Netflix are removing friends and the big bang theory!",
        "content": "Not sure if this is UK only but it just popped up that the both of them are going to be removed on the 30th of December, I don’t understand why they would remove these two as they are extremely big shows. Any more info would be appreciated ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1paxx26/netflix_are_removing_friends_and_the_big_bang/"
    },
    {
        "id": "1paus06",
        "author": "Notoriously_So",
        "title": "Stranger Things Season 5 Episodes",
        "content": "How many posts or comments online have you seen where someone thinks Season 5 is ONLY 4 EPISODES??? Isn't that weird, that someone would think that and not consider they split the season to get more subscribers to pay up?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1paus06/stranger_things_season_5_episodes/"
    },
    {
        "id": "1parwdd",
        "author": "Successful-Train2998",
        "title": "Changing lines?",
        "content": "I sware some of the lines of films are different than they were before, has anyone else noticed this perhaps? I was recently rewatching some films that I've watched before and I am positive it is the exact same film but some of the lines are a bit different",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1parwdd/changing_lines/"
    },
    {
        "id": "1paixeq",
        "author": "Ttalgi-gongju",
        "title": "Triple Charged On My 1st Subscription",
        "content": "I got my new subscription to Netflix and upon checking my online bank account, I got triple charged. I immediately contacted chat support and mentioned that I should be getting the charged amount by 24-48 hours. I subscribed last November 28 at 10:20PM, I am just anxious since I’m still not getting the charged amount back and it has been 48 hours. \n\nDid anyone experienced this on their first time subscribing to Netflix? Can I have a little help here? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1paixeq/triple_charged_on_my_1st_subscription/"
    },
    {
        "id": "1pa4b2k",
        "author": "Virtual-Breadfruit96",
        "title": "help with freezing",
        "content": "my netflix freezes every 5 minutes or so. I am on a laptop (dell xps 16 9640) and cannot figure out why it keeps on freezing. When i watch movies or shows on other websites, it works fine. But when I am on either the netflix app or the website, my video freezes very often and the only way to fix it is to close the browser/app and then reopen. Can anyone help? ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pa4b2k/help_with_freezing/"
    }
]