[
    {
        "id": "1jqhxlo",
        "author": "TheParenting-AMA",
        "title": "Hey /r/movies! I’m Craig Johnson, director of THE PARENTING starring Brian Cox, Lisa Kudrow, Parker Posey, Dean Norris, Edie Falco and others. Out now on MAX. My other films include THE SKELETON TWINS with Bill Hader and Kristin Wiig, ALEX STRANGELOVE, WILSON and TRUE ADOLESCENTS. Ask me anything!",
        "content": "",
        "upvotes": 9,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kqp80n59cmse1.png?auto=webp&amp;s=33e6a290224dcc06c26a1ebfa41cdcf18946e14a"
        },
        "permalink": "/r/movies/comments/1jqhxlo/hey_rmovies_im_craig_johnson_director_of_the/"
    },
    {
        "id": "1jqlds2",
        "author": "MarvelsGrantMan136",
        "title": "Armie Hammer Thriller ‘Dark Knight’ Getting New Title Following Chat With Warner Bros., Renamed 'Citizen Vigilante'",
        "content": "",
        "upvotes": 674,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s8loS11Fv7oo25hYhDRzNMkqVz853tiOqa4mXtQA_cM.jpg?auto=webp&amp;s=3f14754b02de08663fe2449591cd832bd3c19329"
        },
        "permalink": "/r/movies/comments/1jqlds2/armie_hammer_thriller_dark_knight_getting_new/"
    },
    {
        "id": "1jqil80",
        "author": "miguelrgabriel23",
        "title": "What movies were saved by studio interference, that most people don't realize?",
        "content": "Hey there. So I have recently done a post in this subreddit asking about movies that were ruined by studio interference and meddling.\nAnd I got a comment saying that the opposite isn't talked about enough.\nIt got me thinking what are some movies that were saved by studio interference/meddling.\nThe best examples I found of studio interference making a movie better were:\nPredator (1987) The Studio insisted that the movie did not have enough gun fight scenes. As a result, McTiernan added the scene where the team looses it shoot their guns off into the jungle in every direction.\n\nApocalypse Now (1979) The studio insisted that Francis Ford Coppola, reduce the run time by an hour. So he edited out a number of scenes. If you have ever seen Redux you know how good of an idea it was.\n\nThe Warriors (1979): The studio made Walter Hill remove the comic book panels that he had originally put in the movie. The director’s cut reinstates the comic-book scenes that Hill wanted and they just don't work.\n\nAlien (1979) The studio (producers Walter Hill and David Giler) added in the character of Ash, which original co-writer Dan O’Bannon felt was a completely unnecessary addition. If They Hadn’t Stepped In: We wouldn’t have had Ash, which means we potentially wouldn’t have had the whole Weyland-Yutari conspiracy plot.\n\nSo with these examples out of the way, does anyone have any other examples of movies being saved like this?",
        "upvotes": 547,
        "comments": 389,
        "media": null,
        "permalink": "/r/movies/comments/1jqil80/what_movies_were_saved_by_studio_interference/"
    },
    {
        "id": "1jq4ufp",
        "author": "KindBig6714",
        "title": "Shia LaBeouf Handed a Stranger a Camera, Then Unraveled Before His Eyes - New Documentary",
        "content": "",
        "upvotes": 4776,
        "comments": 713,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1Vn6AsbRhaMk8ANiHKkuVkt3i85Ui9_zcNm5GuT81g0.jpg?auto=webp&amp;s=2e8013d34f9676be3c25f7131ed5e5a93b92e6ab"
        },
        "permalink": "/r/movies/comments/1jq4ufp/shia_labeouf_handed_a_stranger_a_camera_then/"
    },
    {
        "id": "1jqkpl8",
        "author": "Comic_Book_Reader",
        "title": "M3GAN 2.0 Official Trailer",
        "content": "",
        "upvotes": 299,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d6HvnCmn6yiKz3Wkp7js5lUXD1vV8NTbJpxIorsN3RY.jpg?auto=webp&amp;s=412ca67ea18edcd03b49ac1297fa0e6e63a092e2"
        },
        "permalink": "/r/movies/comments/1jqkpl8/m3gan_20_official_trailer/"
    },
    {
        "id": "1jqii90",
        "author": "Polyglotpen",
        "title": "Which movie had you completely hooked until the ending ruined everything?",
        "content": "You know that feeling when you’re watching a movie, loving the plot, the characters, the buildup and then BAM, the ending hits, and it’s so bad it makes you regret the whole experience.\n\nFor me, it was The mist. Everything about it was amazing, but that final twist felt like a slap in the face. I couldn’t believe they went that route. I really wanted them to wait for few minutes.\n\nI would love to hear the same from all of you. So that I can intentionally avoid those and save my time.",
        "upvotes": 217,
        "comments": 1376,
        "media": null,
        "permalink": "/r/movies/comments/1jqii90/which_movie_had_you_completely_hooked_until_the/"
    },
    {
        "id": "1jqj7m6",
        "author": "MarvelsGrantMan136",
        "title": "The Accountant 2 | Official Trailer 2",
        "content": "",
        "upvotes": 187,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w3woxkzdg9jC6mzem1c-HvCX9ep-vPONZQEst0Ogwg8.jpg?auto=webp&amp;s=004e185e27c6f2efbc748cbee3fe23093ee0f503"
        },
        "permalink": "/r/movies/comments/1jqj7m6/the_accountant_2_official_trailer_2/"
    },
    {
        "id": "1jps8le",
        "author": "SanderSo47",
        "title": "Official Poster for 'Nobody 2'",
        "content": "",
        "upvotes": 6398,
        "comments": 244,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w9l3xt7w2gse1.jpeg?auto=webp&amp;s=dd8417791c10febd3c4956ac854e97388166f91c"
        },
        "permalink": "/r/movies/comments/1jps8le/official_poster_for_nobody_2/"
    },
    {
        "id": "1jqmdbn",
        "author": "legovelt",
        "title": "Val Kilmer on the “Kiss Kiss Bang Bang” DVD commentary",
        "content": "RIP Val Kilmer. This is one of my favorite commentary tracks. Makes me think how perfect he would have been in today’s podcast world.",
        "upvotes": 72,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vqT9Y9KGs58WF6YHmy8jGBfc2iXjgRKk_SFwrnM-g9s.jpg?auto=webp&amp;s=ce2331231b584381b4163a400ec4b30b3aad34e4"
        },
        "permalink": "/r/movies/comments/1jqmdbn/val_kilmer_on_the_kiss_kiss_bang_bang_dvd/"
    },
    {
        "id": "1jqjcep",
        "author": "indiewire",
        "title": "Val Kilmer’s 10 Greatest Performances: ‘Top Gun,’ ‘Heat,’ and More",
        "content": "",
        "upvotes": 98,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LyGjBfn2tPoNlxgXrgthY_SOqwKFhDb3zfZ4Yp5rGFo.jpg?auto=webp&amp;s=4e0df3f0f25751fa3eaad85670e8257b71d030ca"
        },
        "permalink": "/r/movies/comments/1jqjcep/val_kilmers_10_greatest_performances_top_gun_heat/"
    },
    {
        "id": "1jqlv9q",
        "author": "AdSuccessful1154",
        "title": "\"Worst\" movie you defend to the death?",
        "content": "I don't mean defend in a \"so bad its good\" way i mean defend in a \"you're all misunderstanding this masterpiece\" kind of way.\n\nFor me its AVP Requiem.\n\nAnd i'll tell you why.\n\nYes, maybe the lighting was bad but i was watching it on my PC so i never experienced the theater viewing, but i think all of the characters were well characterized, their dynamics well explored. I've heard people complain that we never hear what the main character did to go to jail or why he was friends with the sherrif, but i honestly think there's nothing wrong with that, we don't need to know, the movie does a great job of simply showing that although this guy has a rough past, he very clearly has a very very long relationship with the sherrif, by him getting home from jail it shows him as being bold.\n\nThe predalien and the aliens in the movie were extremely intimidating, it seemed like all of the characters, except for Wolf, were completely powerless. The predalien looked awesome as well, so that's a plus.\n\nThe movie is also EXTREMELY ballsy in it's edginess, i can't think of many other cheesy action movies for mainstream audiences that kill children and has pregnant women die in horrific ways. Not to mention the attractive love interest being absolutely massacred? I can't think of a single one of the copy-cat summer blockbusters that did that.\n\nIt's one of my favorite Alien/Predator movies, maybe a tier below, well, Alien and Predator lol\n\nSo yeah, thats mine, whats yours?",
        "upvotes": 60,
        "comments": 482,
        "media": null,
        "permalink": "/r/movies/comments/1jqlv9q/worst_movie_you_defend_to_the_death/"
    },
    {
        "id": "1jqkwo4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'M3GAN 2.0'",
        "content": "",
        "upvotes": 64,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qbrrult4ymse1.jpeg?auto=webp&amp;s=553099392349dd11012670f68423a5f70860e1ad"
        },
        "permalink": "/r/movies/comments/1jqkwo4/official_poster_for_m3gan_20/"
    },
    {
        "id": "1jqb3n9",
        "author": "Own_Conversation3511",
        "title": "What movie will you stop everything to watch, no matter what point it is at?",
        "content": "As the title states. What movie will you pause everything to watch, no matter what point it is at? Even just the last 5 minutes will cause you to stop whatever you are doing and finish the film?  \n\nMy list is as follows:\n\nThis Is Spinal Tap\n\nBram Stoker's Dracula\n\nBest In Show\n\nBig Trouble In Little China\n\nMonty Python's Holy Grail\n\nRocky",
        "upvotes": 257,
        "comments": 687,
        "media": null,
        "permalink": "/r/movies/comments/1jqb3n9/what_movie_will_you_stop_everything_to_watch_no/"
    },
    {
        "id": "1jq3aq2",
        "author": "MarvelsGrantMan136",
        "title": "'How to Train Your Dragon 2' Live-Action Movie Set for June 11, 2027",
        "content": "",
        "upvotes": 575,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uLXS91R4qa0S2cDDXIqScUn01y5XdNxZN8iemFBjcYM.jpg?auto=webp&amp;s=0c29671deb7abaaedc8bbf8e7639f778f61e702b"
        },
        "permalink": "/r/movies/comments/1jq3aq2/how_to_train_your_dragon_2_liveaction_movie_set/"
    },
    {
        "id": "1jpwpq1",
        "author": "ChiefLeef22",
        "title": "'A Minecraft Movie' - Review Thread",
        "content": "*A mysterious portal pulls four misfits into the Overworld, a bizarre, cubic wonderland that thrives on imagination. To get back home, they'll have to master the terrain while embarking on a magical quest with an unexpected crafter named Steve.*\n\n**Rotten Tomatoes:** [51%](https://www.rottentomatoes.com/m/a_minecraft_movie)\n\n**Metacritic:** [48/100](https://www.metacritic.com/movie/a-minecraft-movie/)\n\nSome Reviews:\n\n[The National - William Mullaly](https://www.thenationalnews.com/arts-culture/2025/04/02/a-minecraft-movie-review/) \\- 3/5\n\n&gt;While many bad films are made with love, sequels, spinoffs and big-budget adaptations often make the artform feel inert because they are produced with so little heart that they might as well have been generated by AI. But here's the thing: I actually liked *A Minecraft Movie*. I'm as surprised as you are. This is not a disaster. Not by a mile. In fact, for most of its duration, it's downright charming and, in parts, had me laughing out loud.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/a-minecraft-movie-review-jason-momoa-jack-black-1236352502/)\n\n&gt;Watching “A Minecraft Movie,” we’re always aware that the story is something that’s been grafted onto the world, and that we don’t have much of a dramatic stake in it — that it’s just the film’s way of cobbling together something that “works.” (Which, in its way, is very Minecraft.) Some of this is amusing, but like the rest of “A Minecraft Movie” it never feels like it matters. Yet it’s no insult to say that, in this case, that’s actually true to the spirit of a video game that turns life into a blockhead version of itself.\n\n[The Hollywood Reporter - Lovia Gyrakye](https://www.hollywoodreporter.com/movies/movie-reviews/a-minecraft-movie-review-jason-momoa-jack-black-1236179043/)\n\n&gt;The most disappointing aspect of *A Minecraft Movie*, directed by the husband-wife duo who go by Jared Hess (*Napoleon Dynamite*, *Nacho Libre*), isn’t that it’s born out of an existing IP. We live in a world of low-effort reboots, unnecessary remakes and movies operating as extensions of corporate brands. Another one of these gluttonous projects is hardly surprising. What makes *A Minecraft Movie* so dispiriting is how it fails to spark the imagination, betraying a core tenet of the game on which it’s based. \n\n[The Wrap - Michael Ordona](https://www.thewrap.com/minecraft-movie-review-jason-momoa-jack-black/)\n\n&gt;The most accurate summation of “A Minecraft Movie” is probably “It is what it is.” It’s what it’s supposed to be. It probably won’t dig up many new converts to the game, but should strike box-office silver, at least. (And fans, be sure to stick around for two credits scenes – especially the second one.)\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/a-minecraft-movie-review-1235112484/) \\- C\n\n&gt;It’s a real credit to Black’s irrepressibly unique comic energy that “A Minecraft Movie” never feels quite as hypocritical as it should. Either disastrously ill-suited for its message about how money is the enemy of joy, or immaculately *well*\\-suited for its message about much harder it is to build things than it is to destroy them, Hess’ film can’t help but feel like its very existence is an affront to the creative freedom that has allowed “Minecraft” to become such a vital form of self-exploration for kids around the world (even Warner Bros.’ choice to call it “A Minecraft Movie\\*”\\* as opposed to “The Minecraft Movie” implies a spectrum of different concepts, despite the reality of a business that can only imagine this one). But Black — whatever his charms, and regardless of how well they’re deployed here — is a living testament to the idea that people can still thrive by staying true to their own expression. If not in this world, then perhaps in one of their own design. \n\n[IGN - Jesse Hassenger](https://www.ign.com/articles/a-minecraft-movie-review-jack-black-jason-momoa?utm_source=instagram,threads,twitter) \\- 6/10\n\n&gt;For a big-studio adaptation of a massively popular video-game, A Minecraft Movie lets a surprising amount of its director’s personality shine through. Napoleon Dynamite’s Jared Hess manages to fit some laugh-out-loud silliness into his Overworld saga before surrendering to the obligations of CG-driven fantasy adventure. Thematically, A Minecraft Movie offers a pat world-is-what-you-make-it lesson, but Jack Black and Jason Momoa in particular sell it with a lot of comic enthusiasm.\n\n[AV Club - Jacob Oller](https://www.avclub.com/a-minecraft-movie-review)\n\n&gt;One could rightfully question pretty much all of *A Minecraft Movie*, a formulaic template ornamented with surrealism. Some moments bear the scribbled signature of a filmmaker with offbeat passions. These are quickly plastered over by the hotel artwork of a four-quadrant IP extravaganza—and even the by-the-numbers sequences seem jumbled, out of order, or repeated. Yet, there’s something fitting about this film’s contradictions. *Minecraft* is fertile ground for innovation and exploitation. It’s adaptable, limited mostly by those playing it. One can build something personal, copy something mass produced, or attempt to tweak one with the other. Those behind *A Minecraft Movie* saw infinite possibilities laid out before them and—unlike another adaptation of a popular building pastime, *The Lego Movie*—opted for the one that’s been made a thousand times before.\n\n[New York Post - Johnny Oleksinski](https://nypost.com/2025/04/02/entertainment/a-minecraft-movie-review-idiotic-video-game-film-stomps-on-your-brain/?utm_medium=social&amp;utm_source=twitter&amp;utm_campaign=nypost) \\- 1/4\n\n&gt;Your noggin will certainly be done in by Steve and Garrett (Momoa) flying through the air in a risque position suggesting a sex act. Really, “A Minecraft Movie” a 101-minute lobotomy. Put that on the poster. For the uninitiated, the Overworld — I’m pretty sure — is a pixelated place where a player can erect buildings, create tools and design weapons out of blocks. The rules are unclear, as the filmmakers picked silliness over storytelling. Stacking cubes would not, at first glance, seem like a strong plot to hang an action-adventure film on, however “The Lego Movie” did so with cleverness, heart and humor. Trust me: “The Lego Movie” is “Lawrence of Arabia” next to “Minecraft.”\n\n[Next Best Picture](https://www.rottentomatoes.com/critics/source/3046) \\- [Giovanni Lago](https://www.rottentomatoes.com/critics/giovanni-lago) \\- 3/10\n\n&gt;There’s a world where “A Minecraft Movie” actually backs the idealism of creativity, which it so proudly boasts in its barebones story. Maybe if the film were animated, it could’ve played far better to the concept of endless possibilities and allowed for a far more visually dazzling spectacle. Inherently, maybe it would never even be possible, as the idea of creativity can only be celebrated as little as possible when it’s given the parameters of being in such a lazy ip scrape of the barrel as this. There used to be a time when a majority of children’s films were made with such care and intention. Now it seems all you need is buzzwords, celebrities, and “Avengers: Endgame” clap-inducing moments, all of which “A Minecraft Movie” has, unlike a soul, which at least the game feels like it possesses.\n\n[The Daily Beast](https://www.rottentomatoes.com/critics/source/2345) \\- [Nick Schager](https://www.rottentomatoes.com/critics/nick-schager)\n\n&gt;So sloppy is *A Minecraft Movie* that it can’t keep track of its various concerns, highlighted by a mirthless subplot—in which Jennifer Coolidge’s vice principal picks up and woos an Overworld resident who’s traveled to our universe—that it basically drops around the midway point. Buried deep within Hess’ wannabe blockbuster is a message about how creativity is cool and, thus, so too are outcasts. Yet nothing about this hodgepodge fits together. *Minecraft* enthusiasts will be pleased by the film’s various nods to its multiplatform predecessor. Nonetheless, shouting out isn’t the same thing as faithfully celebrating and translating, and those with no experience assembling towers, villages, and weapons in Mojang Studios’ sandbox will undoubtedly find it all scattershot and wearisome. It’s proof that you can build it, but that doesn’t mean anyone—much less newbies—will come.",
        "upvotes": 1130,
        "comments": 712,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6Pjs7Cqle-EGiUebrJPCHrMFWAoasMruxSX6EY15Uks.jpg?auto=webp&amp;s=439cd1be6cdaf1696517dd19916913ef71bc3616"
        },
        "permalink": "/r/movies/comments/1jpwpq1/a_minecraft_movie_review_thread/"
    },
    {
        "id": "1jqjxxy",
        "author": "NoCulture3505",
        "title": "David Mamet Releasing Shia LaBeouf Prison Drama ‘Henry Johnson’ This Spring",
        "content": "",
        "upvotes": 30,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SIIBI702-zw5QvFFviMQCuDC3jCfLNkkeqKjdKFTDGI.jpg?auto=webp&amp;s=f30330316b4cab769c39809f488dec87e7ec6b1b"
        },
        "permalink": "/r/movies/comments/1jqjxxy/david_mamet_releasing_shia_labeouf_prison_drama/"
    },
    {
        "id": "1jpfon5",
        "author": "dndplosion913",
        "title": "Val Kilmer, Film Star Who Played Batman and Jim Morrison, Dies at 65",
        "content": "",
        "upvotes": 54706,
        "comments": 4143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gor9-nfOKZf2nJFZXZj23QgPxHptXKZK1cRDPejEe5Q.jpg?auto=webp&amp;s=1e7807335a434eeb0676c0504565d78b6f6bb3cd"
        },
        "permalink": "/r/movies/comments/1jpfon5/val_kilmer_film_star_who_played_batman_and_jim/"
    },
    {
        "id": "1jq3wvh",
        "author": "MarvelsGrantMan136",
        "title": "Five Nights at Freddy's 2 | Official Teaser Trailer",
        "content": "",
        "upvotes": 345,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cz5VsHmVyvdei0ZWcYUToh-z2xEYASwza_CgH00rHzM.jpg?auto=webp&amp;s=7a667d8ca7deb731aa827c4ee2146a696ff622a4"
        },
        "permalink": "/r/movies/comments/1jq3wvh/five_nights_at_freddys_2_official_teaser_trailer/"
    },
    {
        "id": "1jpxc8m",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Thunderbolts*",
        "content": "",
        "upvotes": 590,
        "comments": 272,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/36yrxrix2hse1.jpeg?auto=webp&amp;s=7028527849d9007b24480ada270b0b00436a274e"
        },
        "permalink": "/r/movies/comments/1jpxc8m/new_character_posters_for_thunderbolts/"
    },
    {
        "id": "1jq0rka",
        "author": "MarvelsGrantMan136",
        "title": "Dwayne Johnson &amp; Benny Safdie A24 Mark Kerr MMA Biopic ‘The Smashing Machine’ Sets October 3 Release Date",
        "content": "",
        "upvotes": 345,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0KmvMS_VNsna1-JK_4Rw07DGRp-KkHDIm8yBvD4Ro1k.jpg?auto=webp&amp;s=9854d982ff19fe1e5d98094c7d96eb95b2326a03"
        },
        "permalink": "/r/movies/comments/1jq0rka/dwayne_johnson_benny_safdie_a24_mark_kerr_mma/"
    },
    {
        "id": "1jpnzde",
        "author": "Comic_Book_Reader",
        "title": "Fountain of Youth — Official Trailer | Apple TV+",
        "content": "",
        "upvotes": 1546,
        "comments": 442,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7cFNcOHr1s41hUhEOggaLf4pxxjslCZ822gc4kxtulQ.jpg?auto=webp&amp;s=93963c85841da7da96bd4efdf0b187cbe172af7b"
        },
        "permalink": "/r/movies/comments/1jpnzde/fountain_of_youth_official_trailer_apple_tv/"
    },
    {
        "id": "1jpz7hx",
        "author": "JeffRyan1",
        "title": "What's the LEAST IMAX-worthy film you ended up seeing on an IMAX screen",
        "content": "I watched Jason Statham's Wrath of Man, a serviceable crime thriller, but since it was the only new movie out that week it got the IMAX glow-up. There's no need to see this movie on an epic scale; it's not Lawrence of Arabia. \n\nThere are weird politics about what gets into IMAX and what doesn't, and how many weeks each release stays. Ignoring all that, sometimes you watch DUNE and get your money's worth of audio and image...and sometimes you watch ANNABELLE COMES HOME.\n\nThis doesn't have to do with a film's quality, or even budget. I watched FREE SOLO on IMAX and I think one day's catering budget for a Marvel movie cost more than that. But my hands have never sweated more.\n\nSo what's the least epic-scale, $900-million-budget, Hansy Zimmery, blockbuster film you've watched on the IMAX screen?",
        "upvotes": 246,
        "comments": 369,
        "media": null,
        "permalink": "/r/movies/comments/1jpz7hx/whats_the_least_imaxworthy_film_you_ended_up/"
    },
    {
        "id": "1jpny7s",
        "author": "NimdokBennyandAM",
        "title": "The Ballad of Buster Scruggs is an absolute delight.",
        "content": "I rewatched this movie for the first time in a while yesterday and was reminded of how much damn fun this movie is. Each part of the anthology has something else going on it, and carries the energy through, which is hard to do in a collection type work like this.\n\n\n\nAnthology pieces invite comparison, and I think the short pieces collected here work well together.\n\n\n\nStandout moments for me:\n\n\n1. Steven Root chasing James Franco down in a homemade suit of armor as Franco tries to shoot him. \"PAN SHOT.\"\n\n\n2. Everything in Meal Ticket. Neeson plays such a convincing sleazebag. This one packs a punch.\n\n\n\n3. Tom Waits in the one about the prospector hunting for gold. The land itself is a character here. I could watch him work in the wilderness all day.\n\n\n\n4. Every. Dang. Second. of the Oregon Trail love tragedy. The stuff about her brother's dog, named President Pierce, holds a special spot in my heart. \"President Pierce is a nervous creature, and excited by animals larger than himself.\" \"Almost all animals are larger than President Pierce.\"\n\n\n\n5. The last sketch is the only one that doesn't pack quite a punch, and whose ending is telegraphed early on, but watching Tyne Daly and Brendan Gleeson play off one another in the coach is pretty great.\n\n\n\n\nI think this movie deserved more notice than it got, celebrated in some circles though it was.",
        "upvotes": 810,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1jpny7s/the_ballad_of_buster_scruggs_is_an_absolute/"
    },
    {
        "id": "1jpbodv",
        "author": "CheezTips",
        "title": "US movie theaters urge 45-day 'baseline' before films hit streaming",
        "content": "",
        "upvotes": 8396,
        "comments": 1236,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jrNnWqv_xSYKMqShqEF_vz4tB2DOXFbIHUvAP85BgaA.jpg?auto=webp&amp;s=9c7d527bd0beaf9bcad2eb6b73c523ee9e4aab57"
        },
        "permalink": "/r/movies/comments/1jpbodv/us_movie_theaters_urge_45day_baseline_before/"
    },
    {
        "id": "1jpqa1o",
        "author": "vampyrewithsuntan",
        "title": "'The Boys' stars Jack Quaid, Jeffrey Dean Morgan reunite in 'Neighborhood Watch' trailer (exclusive)",
        "content": "",
        "upvotes": 524,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7DJHu7osFaCYWBoaUEhLDoUQkjZCDX8Zx9Jcft1PD_E.jpg?auto=webp&amp;s=3c7ffc1b9ceb0dabd9c9692ed17360edf6812380"
        },
        "permalink": "/r/movies/comments/1jpqa1o/the_boys_stars_jack_quaid_jeffrey_dean_morgan/"
    },
    {
        "id": "1jqm1fy",
        "author": "Bullingdon1973",
        "title": "Long, wide-ranging interview with David Ayer in which he talks about how the fallout from SUICIDE SQUAD made him rethink his career. Also says 'the Ayer Cut' is 'pretty much a finished film.'",
        "content": "",
        "upvotes": 8,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MsMsdF1Ieh4Dp3dO-03fHPE9rdxCoKx35ui92emVCwo.jpg?auto=webp&amp;s=9b13c12e435de49f0b20771e9310a177b29363c4"
        },
        "permalink": "/r/movies/comments/1jqm1fy/long_wideranging_interview_with_david_ayer_in/"
    },
    {
        "id": "1jq6zcb",
        "author": "citizen-weiner",
        "title": "My friends and I spent 3 years making this movie and just released it on Tubi! Please check out the trailer and let me know what you think. It's a comedy called \"Citizen Weiner\"",
        "content": "",
        "upvotes": 56,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JW_cm1O4kONq9v5LKXBLebw8FQ96FU88KZV9BvenZW0.jpg?auto=webp&amp;s=87edb342b563fd26f3203f107876c2cf606dcbd5"
        },
        "permalink": "/r/movies/comments/1jq6zcb/my_friends_and_i_spent_3_years_making_this_movie/"
    },
    {
        "id": "1jpzq5w",
        "author": "KillerCroc1234567",
        "title": "Ron Howard’s TIFF Thriller ‘Eden’ Acquired By Vertical For August 22nd U.S. Theatrical Release",
        "content": "",
        "upvotes": 143,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jkZ892HSZd7eMkXKL6oCvl7paVxwVzvfZsWmF5TVaSM.jpg?auto=webp&amp;s=34dbac942e6b2d058535fd93be8d64e5d90478f5"
        },
        "permalink": "/r/movies/comments/1jpzq5w/ron_howards_tiff_thriller_eden_acquired_by/"
    },
    {
        "id": "1jptarr",
        "author": "mattbozle",
        "title": "PRIMITIVE WAR | OFFICIAL TRAILER 2025",
        "content": "",
        "upvotes": 285,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kEh9AdG5_dPX1YcJ6XI5Lv-Ye99pmiSie2okjz844lM.jpg?auto=webp&amp;s=9c13a99e6e4427abf3942f29026e72a9b7be0c2f"
        },
        "permalink": "/r/movies/comments/1jptarr/primitive_war_official_trailer_2025/"
    },
    {
        "id": "1jpzect",
        "author": "Gato1980",
        "title": "Sketch | Official Trailer | Tony Hale, D'Arcy Carden",
        "content": "",
        "upvotes": 131,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kJqEUwDgNpJBt9ivPtfdTxbN8DmYyxqeC9YSX1TrftQ.jpg?auto=webp&amp;s=f1bf6bed0bfcf44c2569c2f1752e55861bd22b1c"
        },
        "permalink": "/r/movies/comments/1jpzect/sketch_official_trailer_tony_hale_darcy_carden/"
    },
    {
        "id": "1jq0bur",
        "author": "Martipar",
        "title": "What films were you surprised to find out flopped on release?",
        "content": "I was recently reminded that Highlander, one of my favourite films, was a flop. I was not very surprised as not everything I love is popular but one that did surprise me was Battle of Britain. Battle of Britain is superb, the budget is clearly on show, it has a stellar cast, it covers all aspects of the war and has the same attitude as other films of the same era. \n\nHowever it came out when anti-war sentiment was at an all time high and it flopped hard, I have seen figures stating it took no more than £100,000 when it was released at the cinema. It is also historically important as some of the budget was spent on restoring WW2 aircraft that had been left to rot. \n\n  \nWhat films have you seen and loved that ended up not making much money, if at all? ",
        "upvotes": 109,
        "comments": 389,
        "media": null,
        "permalink": "/r/movies/comments/1jq0bur/what_films_were_you_surprised_to_find_out_flopped/"
    }
]