[
    {
        "id": "1jhc2nt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Fleur Fortune - Monday 3/24 at 1:00 PM ET - Director of 'The Assessment', a sci-fi thriller starring Elizabeth Olsen, Alicia Vikander, and Himesh Patel that's currently out in theaters.",
        "content": "",
        "upvotes": 19,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f0shlyv5l9qe1.png?auto=webp&amp;s=a99290459142358256f49bd02110ad67f40c30dd"
        },
        "permalink": "/r/movies/comments/1jhc2nt/amaqa_announcement_fleur_fortune_monday_324_at/"
    },
    {
        "id": "1jg5yxw",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Snow White / The Alto Knights)",
        "content": "[Snow White](https://old.reddit.com/r/movies/comments/1jg5wz4/official_discussion_snow_white_2025_spoilers/?)\n\n[The Alto Knights](https://old.reddit.com/r/movies/comments/1jg5x0l/official_discussion_the_alto_knights_spoilers/?)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jg5yxw/official_discussion_megathread_snow_white_the/"
    },
    {
        "id": "1jifdgh",
        "author": "MrGittz",
        "title": "The one Disney animated film that BEGGED to be made into a franchise/series but never did? THE GREAT MOUSE DETECTIVE. Oh how I wish we could’ve had more adventures with Basil of Baker Street",
        "content": "I know everyone always goes on about the Little Mermaid, Beauty &amp; The Beast, Aladdin etc. (&amp; those are wonderful films)\n\nBut for me? 1986’s “The Great Mouse Detective” is the **PERFECT** animated Disney film. I love practically every frame. The music, the voice acting &amp; animation? It’s wonderfully charming. Disney doing Victorian era London is always special &amp; atmospheric. \n\nFor those who don’t know the premise? It’s simple. What if Sherlock Holmes…was a mouse. Solving mice crimes. All while living in mouse hole tucked away in actual human Sherlock Holmes address of Baker Street\n\nThis movie was completed in that sweet spot where Disney had yet to make the switch to digital coloring(aka digital Ink &amp; paint aka the CAPS system) and so this film has that warmth &amp; charm that was a little bit lost when the conversion was made circa the early 1990s. It does have a very early CGI sequence in an animated film, the terrific Big Ben Clock climax. (The gears were created digitally and then traced over, not actually rendered out to film or composited digitally)\n\nSo what makes the film so special? The characters. The characters! I know this isn’t technically “Sherlock Holmes” BUT if it were, this would be my favourite rendition of the great detective. \n\nLike all great Sherlock adaptations it’s the Sherlock/Watson relationship that is the true measure of success and this movie takes the cake. David Q Dawson is our Watson stand in, he’s a caring albeit clumsy mouse, compared to Basil’s man(er..mouse) of action. They just have terrific chemistry. You buy them as friends instantly. \n\nAnd it’s this reason more adventure were needed. I don’t care in what form. Straight to video, animated series or legit theatrical sequel. So long as the same voice actors were used? Give me more! But alas, it was not meant to be. After Little Mermaid and the rest become huge cultural juggernauts, there was no more room for the relatively modest successful fare like The Great Mouse Detective. And we are all the poorer for it. Also unlike most those other films, this isn’t a musical. There’s one scene where characters break out in song. And it’s great.\n\n\nI’ve often wondered if Disney would do the same “live action” remake route befallen to so many of the animated films. Maybe in time but you’ll never do better than Vincent Price as Ratigan, Barrie Ingham as Basil and Val Bettin as Dawson. RIP.\n\nAnd that score by Henry Mancini? Now that’s a theme! Remember when we had memorable musical themes? \n\nSo? For those who haven’t had the pleasure or for those who have &amp; haven’t had the pleasure in awhile, go check out The Great Mouse Detective, bask in its charm, warmth, heart and splendor. \n\nThis movie deserved to be a franchise.",
        "upvotes": 732,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1jifdgh/the_one_disney_animated_film_that_begged_to_be/"
    },
    {
        "id": "1ji3sln",
        "author": "AnonRetro",
        "title": "Rick Moranis Talk About Props from Honey, I Shrunk The Kids",
        "content": "",
        "upvotes": 2624,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zrFtn0VSsBoUYs0Pjn2pb-BsKaVQyIkiYSwcyXLkpeU.jpg?auto=webp&amp;s=84e3c5390b664f4d43e8e602e5a127cebe65fd20"
        },
        "permalink": "/r/movies/comments/1ji3sln/rick_moranis_talk_about_props_from_honey_i_shrunk/"
    },
    {
        "id": "1ji260v",
        "author": "Bennett1984",
        "title": "Green Room, Bone Tomahawk, The Witch, and the Must-See Films of 2015",
        "content": "",
        "upvotes": 2517,
        "comments": 358,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m2aLA_5mFGPmBo9hnrJoRskJB_SDlx6fYq-oq02-dm4.jpg?auto=webp&amp;s=9452e5adb031c834599bd45ff8cccb38486ad9a6"
        },
        "permalink": "/r/movies/comments/1ji260v/green_room_bone_tomahawk_the_witch_and_the/"
    },
    {
        "id": "1jigwf0",
        "author": "UNAMANZANA",
        "title": "My biggest problem with the Terrifier movies is that they’re honestly kind of boring.",
        "content": "Not in the “too slow” kind of way. More-so in the fact that each kill scene just keeps going and going and going. It gets to the point where it’s not even suspenseful; you watch and you just know that Art is going to do some gratuitous shit. Honestly, these movies would be a whole lot more enjoyable if each kill scene was like two minutes shorter. ",
        "upvotes": 320,
        "comments": 99,
        "media": null,
        "permalink": "/r/movies/comments/1jigwf0/my_biggest_problem_with_the_terrifier_movies_is/"
    },
    {
        "id": "1ji3lys",
        "author": "BunyipPouch",
        "title": "New Poster for 'Freaky Tales' - Starring Pedro Pascal, Ben Mendelsohn, Jay Ellis, and Angus Cloud - An NBA star, a corrupt cop, a female rap duo, teenage punks, neo-Nazis, and a debt collector embark on a collision course in 1987 Oakland, California.",
        "content": "",
        "upvotes": 1779,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cdye1apixgqe1.jpeg?auto=webp&amp;s=e511e2e35052b8bf44f9724739461c40e50467cb"
        },
        "permalink": "/r/movies/comments/1ji3lys/new_poster_for_freaky_tales_starring_pedro_pascal/"
    },
    {
        "id": "1jik8bc",
        "author": "BenTheDiamondback",
        "title": "Could “Hot Rod” be the Best Movie Ever Made? No. But Yes. Probably.",
        "content": "I came late to this movie. Years late. A decade even. My daughter knew we loved “Popstar: Never Stop Never Stopping” thus, she said, we should love “Hot Rod.” \n\nBruh.\n\nI never laugh during an initial viewing of a comedy. Don’t know why, but any comedy I see the first time, it might elicit a chuckle here or there, maybe a chortle or a slight guffaw, but that’s about it. “Hot Rod” had me cackling the first time I watched it, and every time I’ve watched it since, I still laugh hard.\n\nSo unbelievably quotable… “Cool beans,” “BABE, WAIT, BABE!” “Yoo-hoo shitheads, I found this bag of fireworks in the men's restroom. Would you guys like to light them off?” “Let me join your crewwwWWW?” “I’ve been drinking green tea all goddamn day!” “You guys, the bathroom here is nuts!” “Ultimate punch!” “Pussyyyyyyyyyy…” “I’m Rod and I like to party.” “I said you look shitty! Goodnight, Denise!”\n\nPerfect soundtrack! Effing EUROPE songs throughout. The “You’re The Voice” montage! We know the story takes place in the age of the internet, but when? It’s timeless, sorta. 80s glam metal songs with earnest lyrics, clothes vehicles and houses that could put you in any of the last five decades. \n\nStill cannot believe this movie even exists. Thank god it does. With all of the frightened studio execs unwilling to take risks on anything because audiences are unpredictable and unreliable, for Paramount to basically go, “OK idiots, here’s $25 million, go make a movie,” it’s baffling to me. It’s also a shame this movie is still not as well known as it deserves. I would have thought, y’know, long tail rules, “Hot Rod” would have made its money back by now.\n\nI’m dropping this here for appreciation of a damn funny movie that deserves more viewers.",
        "upvotes": 144,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1jik8bc/could_hot_rod_be_the_best_movie_ever_made_no_but/"
    },
    {
        "id": "1ji60c8",
        "author": "e8odie",
        "title": "What are some instances of actors doing a complete joke take that ended up getting used in the final film?",
        "content": "For this I'm not really thinking of improv takes for comedy films, but I guess that can fit. But just recently I've seen multiple actors/directors talking about a take that was originally just meant to be funny but ended up getting used in the final product. Examples:\n\n- **A Real Pain**: after tour guide James is saying a heartfelt thank you and goodbye to Benji and just turns and nonchalantly and flatly tells David thanks. James' actor has said that that was just meant to be funny and even Jess Eisenberg originally though the take was \"ruined\" but ended up loving it and using it.\n\n- **Leon the Professional**: Gary Oldman dramatically yelling \"EVERYONE!\" was one of a couple takes that he intentionally was overdoing to make Luc Besson laugh. Turns out he liked it enough to use it in the final film.\n\n- **Severance**: TV obviously, but in the most recent episode when Mr. Milchick delivers a letter to a character and then abruptly sprints away, Tramell Tilman has said he just did that to be funny and didn't think it would be used.\n\nWhat are some more famous or interesting examples?\n\n---\n\n**EDIT**: To emphasize, I'm not necessarily interested in \"just\" improvised scenes/lines here, but specifically a delivery or take where the actor themselves thinks it's ridiculous or a joke or unusable that I'm interested in.",
        "upvotes": 856,
        "comments": 413,
        "media": null,
        "permalink": "/r/movies/comments/1ji60c8/what_are_some_instances_of_actors_doing_a/"
    },
    {
        "id": "1ji7vlm",
        "author": "mayukhdas1999",
        "title": "First Image from 'TORNADO' - 1790s Britain. A Japanese puppeteer's daughter, Tornado gets caught up with a criminal gang when their show crosses paths with them. In an attempt to create a new life for herself, she seizes the opportunity to steal the gold from their most recent heist",
        "content": "",
        "upvotes": 621,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8jlfsg9hshqe1.jpeg?auto=webp&amp;s=7dafb1a522a54b2cf8801f0bf8c6c5a63cd7fb8e"
        },
        "permalink": "/r/movies/comments/1ji7vlm/first_image_from_tornado_1790s_britain_a_japanese/"
    },
    {
        "id": "1ji2x7y",
        "author": "dafones",
        "title": "CinemaStix: Yep, I Cry Every Time (A Knight's Tale)",
        "content": "",
        "upvotes": 842,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/66-4981uWCvMD13vNz2G-YWCLkXbyT-rm6qoROyuUsA.jpg?auto=webp&amp;s=467808dc617f254e1528485b091e93e7b0299db9"
        },
        "permalink": "/r/movies/comments/1ji2x7y/cinemastix_yep_i_cry_every_time_a_knights_tale/"
    },
    {
        "id": "1ji2pqo",
        "author": "BrandonStRandy1993",
        "title": "Which movie has the funniest plot?",
        "content": "My vote goes to Hot Rod. The entire plot of the movie is Rod trying to raise money for his stepdad’s heart transplant so he can save his life and then kick his ass. Throw in Will Arnett and the scene where Rod falls down the hill for an hour and you’ve got one of the funniest movies of the 2000s. Which other movies are immediately funnier when you just think about the basic plot? ",
        "upvotes": 528,
        "comments": 320,
        "media": null,
        "permalink": "/r/movies/comments/1ji2pqo/which_movie_has_the_funniest_plot/"
    },
    {
        "id": "1ji0nd1",
        "author": "pilofication",
        "title": "are there any movies, where at the end, you realize you’ve been rooting for the bad guy",
        "content": "this is a silly question, but i watched a youtube video the other day and this guy was just playing a game with his friends that he made, and he set it up to make them look like they were heros savint the world and killing bad guys, but at the end they realize they saw it all wrong and they were actually good people. idk, just had a random thought and figured id ask here",
        "upvotes": 602,
        "comments": 836,
        "media": null,
        "permalink": "/r/movies/comments/1ji0nd1/are_there_any_movies_where_at_the_end_you_realize/"
    },
    {
        "id": "1ji7hfp",
        "author": "babythot12",
        "title": "shitty movies/so bad it’s good recommendations please",
        "content": "\nHi everyone, \n\nSo my friend and I have decided to instead watch movies in the cinema that are shitty/so bad that they are actually funny.  the worst movies the world of film has to offer. The last we watched was flight risk which we found hilariously bad. \n\nDoes anyone have any recommendations like this  for this last year or or this or other years or can you please point to how I can find movies like this. ",
        "upvotes": 191,
        "comments": 1066,
        "media": null,
        "permalink": "/r/movies/comments/1ji7hfp/shitty_moviesso_bad_its_good_recommendations/"
    },
    {
        "id": "1jhwu9j",
        "author": "zanerands",
        "title": "Event Horizon",
        "content": "I watched event horizon about 1.5 years ago now I I think about the movie atleast once a week. It was a little bit goofy at times but the premise was really intriguing. Please for the love of god somebody create a prequel. It needs one immediately. I need one immediately lmao. Those scenes of the crew before them was super intense and grotesque but interesting nonetheless.",
        "upvotes": 900,
        "comments": 333,
        "media": null,
        "permalink": "/r/movies/comments/1jhwu9j/event_horizon/"
    },
    {
        "id": "1jiikut",
        "author": "WerdNerd88",
        "title": "Legionnaire (1998) Jean-Claude Van Damme's best movie?",
        "content": "Trailer 1: https://youtu.be/CTDsj3Z9yK4?si=XfBMZcPvnjwZhAAV\n\nTrailer 2: https://youtu.be/kqL3ocjaAQY?si=PxffoHFw3rxYvo3Q\n\nIt's on Tubi because all of his movies seem to be on there.\n\nI like to think he was trying to make his own version of Indiana Jones. Especially with that beginning. It was the club scene from Temple of Doom. But instead he made, what I like to believe, is the origin story to Rick O'Connell from The Mummy.",
        "upvotes": 36,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M9T8H2_FoX3H8RfzSOeoDpffqsMQVjW1UgY3y4PhmQM.jpg?auto=webp&amp;s=6082461c8aba1bf596f737d829d891ceab363106"
        },
        "permalink": "/r/movies/comments/1jiikut/legionnaire_1998_jeanclaude_van_dammes_best_movie/"
    },
    {
        "id": "1jifv0b",
        "author": "dtrav001",
        "title": "Saw the Providence RI premier of the new documentary \"Secret Mall Apartment\" last night — in the mall where it happened!",
        "content": "Pretty surreal, to be sitting at the very spot where, a few hundred feet away, all this took place — a real mental time warp! The film was an unexpected delight, not just a chronicle of this remarkable story, but also a 20-year history of the city's development, gentrification and still-thriving arts scene.\n\nWe got to meet Jeremy Workman, the director, and also (get this) Michael Townsend, the artist who engendered the project, who had been permanently banned from the mall, and just that very day was finally let back in!\n\nTownsend and his friends documented the process with an old-school video camera, over years, so you got to see the whole story develop. Hauling in a thousand pounds of cinder blocks to build a wall, couches, an enormous credenza from the Salvation Army, right past security — madness. (Townsend even said they had wood flooring and a water tank for showers and washing waiting there, but couldn't get it installed before they got busted!)\n\nCan't recommend this film too highly, what a surprise, I'm still giggling to myself about it! It's in national release now … if you can get to where it's playing, I think it's well worth seeing.",
        "upvotes": 51,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1jifv0b/saw_the_providence_ri_premier_of_the_new/"
    },
    {
        "id": "1ji9z4m",
        "author": "Federal_Bonus_2099",
        "title": "🔥 ‘Mississippi Burning’ 🔥",
        "content": "A fantastic cast, and an ode to Gene Hackman’s brilliance. \n\nThis movie should be revisited for both its art and its message.\n\n“If you want to see the future, look at the past”. We should not ignore the actions being taken today by the minority, and remind ourselves of the horrors we have taken steps to abandon. \n\nA progressive and powerful movie from the 90’s. \n\nEdit: as corrected, released in 1988",
        "upvotes": 96,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1ji9z4m/mississippi_burning/"
    },
    {
        "id": "1jiixv9",
        "author": "NewMode8949",
        "title": "films with bad experiences on set?",
        "content": "Usually when actors do a press tour they praise their cast and crew and the incredible expirience it was to work at the set. Either about how much fun it was or the lasting friendships they made. But are there films that actors openly stated to have an uncomfortable set experience? Like collectively, the process of filming was grueling and unpleasant. Whether it was because of a difficult location or other complications. And during interviews this is a known fact, that although the movie and cast relations are good, the process was not a great experience? ",
        "upvotes": 22,
        "comments": 82,
        "media": null,
        "permalink": "/r/movies/comments/1jiixv9/films_with_bad_experiences_on_set/"
    },
    {
        "id": "1ji4b70",
        "author": "JonasKahnwald11",
        "title": "Audrey's Children (2025) | Official Trailer | In Theaters March 28",
        "content": "",
        "upvotes": 152,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MwNCRGFs93fX7SYCpBp_p_lu4yx8h-ktb0sYqNlZHII.jpg?auto=webp&amp;s=e3286429309d40e4b8d76f704446b0d69c5bf930"
        },
        "permalink": "/r/movies/comments/1ji4b70/audreys_children_2025_official_trailer_in/"
    },
    {
        "id": "1jidudb",
        "author": "Pancake_muncher",
        "title": "Martin Scorsese's \"Alice Doesn't Live Here Anymore.\" I don't know why this isn't talked about, because it's really funny and Ellen Burstyn gives a great comedic performance.",
        "content": "I never heard of this movie before and learned this is the only Martin Scorsese movie with a solo female lead. So I thought maybe Martin made this as some quick work between Mean Streets and Taxi Driver. I expected this to be a forgotten flop like New York New York or some form of oscar bait that no one talks about.\n\nTo my big surprise, it's great. I absolutely enjoyed every minute of it. I love the cast of characters and the fun journey of Alice and her son (he's hilarious) going on a road trip to pursuit her singing career. It's somewhat realistic with some domestic abuse scenes, but the overall tone is light and gentle when it comes to the main story where you can feel the love between Alice and her son while she struggles to make her way. You got a stacked cast with Ellen Burstyn as the lead, Kris Kristofferson, Harvey Keitel, Diane Ladd, and Jodie Foster making an appearance. It's really funny and a very interesting portrait of a woman in the 1970s figuring out her life after her husband passes. I can kind of see it like a 90s version of Nomadland, but this is more of a slice of life comedy than a introspective drama. \n\nI don't know why this isn't talked about when it comes to Scorsese movies. Maybe it just doesn't have the deep subject matter or the intensity of his gritty body of work, but it doesn't make it shallow or lacking an emotional core. I think the most memorable image in this movie is Ellen Burstyn holding a forced grin when working as a waitress and she gets embarrassed by the other waiters. Just a great moment.\n\nRandom thoughts\n\n* I can see why Ellen Burstyn won an oscar for this. Doing this and The Exorcist back to back blows my mind with how she has great range.\n* This movie doesn't have a single moment where I thought Scorsese was on hard drugs\n* the actor who played Alice's son grew up to work as an engineer. Good to know!\n* I couldn't find a blu-ray release, so the DVD makes the movie look kinda ancient and the colors don't seem to pop off as they should.\n* Criterion, please give this a blu-ray release.\n* \"A Jack Job in a paperSack, Get off my back!\"",
        "upvotes": 35,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1jidudb/martin_scorseses_alice_doesnt_live_here_anymore_i/"
    },
    {
        "id": "1jhvotz",
        "author": "MaxProwes",
        "title": "I rewatched The 6th Day (2000) and it honestly feels like a spiritual sequel to Total Recall in many ways, creepy doll humor is something straight from Verhoeven's film. People should check it out if they didn't",
        "content": "",
        "upvotes": 487,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pWhHNLzHxnn1rGlOVW8gQCx_DAA-Uvz61sBBAyeB4Vo.jpg?auto=webp&amp;s=da50d03eee6192ee473b7df5201afb95a6f270dd"
        },
        "permalink": "/r/movies/comments/1jhvotz/i_rewatched_the_6th_day_2000_and_it_honestly/"
    },
    {
        "id": "1jhe4ax",
        "author": "Bullingdon1973",
        "title": "LEAVING NEVERLAND, the 2019 Michael Jackson documentary that shook the world, has effectively vanished after HBO-MAX removed it due to a non-disparagement clause",
        "content": "",
        "upvotes": 8863,
        "comments": 1303,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VTrZrCBVxvqn7hfdABWA1RVBlxTjYZSICLwIexO4xak.jpg?auto=webp&amp;s=822dc94998183c946c57e0bdcd6d7e9ecf7b1f4c"
        },
        "permalink": "/r/movies/comments/1jhe4ax/leaving_neverland_the_2019_michael_jackson/"
    },
    {
        "id": "1jibnh7",
        "author": "Sweaty-Ad6122",
        "title": "Need more sick and twisted movie suggestions",
        "content": "I’m trying to figure out this genres name but I love movies that are physiological thriller/drama/unsettling. Some of my top favorite movies are saltburn, poor things, blink twice, and midsommar. I’m not into horror but I love aspects of weird creepiness, like the kind of thing you dwell on for weeks and still can’t quite get it. Does anyone know what to call this genre? Kinds of kindness is on my list but any others with this type of vibe?",
        "upvotes": 30,
        "comments": 242,
        "media": null,
        "permalink": "/r/movies/comments/1jibnh7/need_more_sick_and_twisted_movie_suggestions/"
    },
    {
        "id": "1jiljot",
        "author": "RevelryByNight",
        "title": "Authentic depictions of a man in love",
        "content": "I know it's a broad generalization. But I'm curious to hear from the menfolk here about which films, in both writing and acting, nailed the experience of a man falling in love ideally in a grounded, adult way. What about it felt authentic or resonated with you?\n\nFemale characters in “male” genres are often rightfully ridiculed for being obvious male fantasies, whereas male characters in romcoms and romantic dramas are often obvious male fantasies.\n\nSo what romantic heroes feel like real dudes to you?\n",
        "upvotes": 4,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1jiljot/authentic_depictions_of_a_man_in_love/"
    },
    {
        "id": "1ji5hu0",
        "author": "tangledapart",
        "title": "What movie would you wanna watch again not knowing the ending?",
        "content": "I just finished watching David Fincher’s The Game and a line of dialogue inspired this post. At some wealthy people private club, Michael Douglas and two other gentleman are sitting in wingback chairs, drinking their scotch, and engaged in conversation. Douglas brings up he overheard one of these men mention something about “CRS”. The two men share a glance. Then one of them says, “You know, I envy you. I wish I could go back and do it for the first time, all over again.” \n\nSo yeah. ironically enough, I’d say The Game would be my number one experience “all over again” flick. Oh! The movie doesn’t have to have a trick ending.",
        "upvotes": 48,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1ji5hu0/what_movie_would_you_wanna_watch_again_not/"
    },
    {
        "id": "1jiatt6",
        "author": "Super-Cry5047",
        "title": "Best Horror Movie Kills",
        "content": "I want your favourites. The franchise, the film and the scene. \n\nMy two big contenders are when Freddy Kruger, in Elm Street 3, comes alive as a marionette and makes a puppet out of a dude, using his tendons as puppet strings. Then he walks the dude off a roof. \n\nThe other is when Jason, in Jason Takes Manhattan, has a rooftop boxing match with a pro boxer. Jason throws one punch the whole fight and that punch knocks the guys head off and down into a dumpster. \n\nLet me know what tickles your fancy! ",
        "upvotes": 22,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1jiatt6/best_horror_movie_kills/"
    },
    {
        "id": "1jijo2o",
        "author": "PrettyNewt4930",
        "title": "Tyler Perry’s duplicity vs older films.",
        "content": "Just finished watching and the only redeemable thing about this movie is Kat Graham. The twist with Kevin was predictable. He was acting like he didn’t care about Rodney’s death while his partner Caleb was so broken up about it. I also felt like it was quite obvious that he was shifting the blame onto Caleb and I couldn’t understand why no one brought up that Kevin was the one to yell out “Gun,” the entire movie except maybe once. \n\nI thought Tony’s friendship with Kevin was a little weird and suspicious because if I was friends with someone who had been involved in a shooting like that and didn’t seem to care, I would have serious concerns about being friends with them. That said, it was mildly surprising that Tony was also one of the ones behind everything, however, knowing that makes his interactions with Kevin make more sense. If Tyler Perry wanted to make it obvious that Kevin was a piece of shit, he succeeded. \n\nTo touch on Fela: I found her grief over Rodney to be incredibly underwhelming (especially after finding out Rodney was cheating), and after watching the ending it makes so much sense why. After the four month time jump I was almost certain she was involved because who wins 15 mil and falls off the face of the earth from their only friend who was supposed to be her rock? \n\nIn summary: I did not like the movie at all. While I enjoy Kat’s performance, I felt she could’ve done better. The entire story was rushed, the ending sucked, and the only thing that could’ve made it better was if Tony double crossed Kevin. I really hoped he would but alas, he was a piece of shit too.\n\nI don’t know about anyone else, but I feel like Tyler Perry’s movies used to be good. I don’t know what happened over the years but they’ve gotten to be subpar. Movies like I can do bad all by myself, Diary of a mad black woman, and Why did I get married were a few of the ones I thought were pretty good. This one was absolute hot garbage. Anyone else agree? ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jijo2o/tyler_perrys_duplicity_vs_older_films/"
    },
    {
        "id": "1jhwafz",
        "author": "Infamous-Charity3930",
        "title": "Ginger Snaps 4K Restoration(unofficial)",
        "content": "",
        "upvotes": 116,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jc8nzLXI3LLNq82ntabbpD26xEW-qm031BF3I664h7A.jpg?auto=webp&amp;s=f26e3873e6821badca601b90a126fc3cba4a0814"
        },
        "permalink": "/r/movies/comments/1jhwafz/ginger_snaps_4k_restorationunofficial/"
    },
    {
        "id": "1jidoi7",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Peter Cattaneo - Wednesday 3/26 at 2:00 PM ET - Oscar-nominated director of 'The Full Monty', 'The Penguin Lessons', 'The Rocker', and 'Military Wives'",
        "content": "",
        "upvotes": 9,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fp3wdsob3jqe1.png?auto=webp&amp;s=181c99d956be8d2c69df0213bb92f6fb9156f2f8"
        },
        "permalink": "/r/movies/comments/1jidoi7/amaqa_announcement_peter_cattaneo_wednesday_326/"
    },
    {
        "id": "1jhg34z",
        "author": "ChiefLeef22",
        "title": "'Erin Brockovich' at 25 - revisiting Soderbergh's feelgood, earnest, old-fashioned Hollywood A-list vehicle",
        "content": "",
        "upvotes": 1764,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BhSI07bFby6-01Ac784nRBxkEsSNQUCVWdAi0Ik-qO8.jpg?auto=webp&amp;s=b6c69bdc32fc5fe32cd29fab1399bd7ae8ee32e6"
        },
        "permalink": "/r/movies/comments/1jhg34z/erin_brockovich_at_25_revisiting_soderberghs/"
    },
    {
        "id": "1ji8i9v",
        "author": "Forsaken_Walk6008",
        "title": "Fast paced movies",
        "content": "Could you recommend films that are fast-paced—not fast in the sense of being action-packed, but fast in their pacing and editing? For example, I recently watched Babylon and was struck by its incredible speed. I’m looking for that Kind of film, Also can be movies of comedias that have fast paced and have an enormous speed.",
        "upvotes": 16,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1ji8i9v/fast_paced_movies/"
    }
]