[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1l2155q",
        "author": "troppyjacgkberry8",
        "title": "Parco Dora (Torino)",
        "content": "",
        "upvotes": 46,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lGQ0Li_8PTyXEC6_FWmwwiZPDqoae7qyw_DXzA9mbx0.jpg?auto=webp&amp;s=828d7cd56dd3349ac0c92750ff7a976da44fadf6"
        },
        "permalink": "/r/torino/comments/1l2155q/parco_dora_torino/"
    },
    {
        "id": "1l24dag",
        "author": "Benzinazero",
        "title": "Chieri (Torino), La psicoeconomia di 100Torri interpreta male il problema dei parcheggi, perché non tiene conto della geometria: ogni posto auto richiede 25 mq",
        "content": "# A Chieri, un comune di 36.000 abitanti della città metropolitana di Torino, hanno aumentato i prezzi dei parcheggi. [Il quotidiano online 100Torri presenta la cosa come un’ingiustizia](https://www.100torri.it/2025/05/29/parcheggi-a-chieri-ecco-perche-laumento-dei-prezzi-e-un-autogol/), in un lungo e articolato ragionamento che chiama in causa la psicoeconomia.\n\nC’è un piccolo problema: **nei centri storici lo spazio è** ***prezioso*** **e** ***limitato*****.**\n\nL’articolo parte dal presupposto che il parcheggio, gratis o a basso prezzo, sia un *ovvio diritto* e che l’auto sia l’*unico veicolo possibile* per muoversi in una città.\n\nIn queste premesse ci sono due errori:\n\n1. *Il parcheggio non è un diritto*, particolarmente dove lo spazio è limitato;\n2. *L’auto non è l’unico veicolo possibile:* ci sono anche mezzi pubblici, bicicletta, andare a piedi, e l’intermodalità, la combinazione di tutti questi. L’auto privata, che è solo *uno* dei diversi mezzi di trasporto e spostamento, e non è detto che si debba usare in esclusiva.\n\nIl motivo per cui il parcheggio a pagamento **non è** un’ingiustizia è molto semplice, anche deriva da un problema che l’industria dell’auto e molti automobilisti negano o rimuovono:\n\n**L’automobile in città è ingombrante.**\n\nLetteralmente, è impossibile consentire a tutti gli automobilisti che vorrebbero entrare in un centro storico italiano di farlo con l’automobile, e di parcheggiare dove e quando vogliono, gratis o a basso prezzo.\n\nIn campagna con l’auto si va e si parcheggia dove si vuole. In città, no, non è possibile.\n\nPer un motivo semplicissimo e verificabile geometricamente: **per parcheggiare un’auto occore lo spazio fisico.**\n\nRealizzare un posto auto in un parcheggio a raso richiede 25 metri quadri: 12,5 per il posto auto vero e proprio, 12,5 per gli spazi di manovra, per poter aprire le portiere, per entrare e uscire dall’auto e per entrare e uscire dal parcheggio.\n\nLungo un marciapiede bastano 10 mq (2×5 metri) perché le portiere si aprono usando lo spazio della strada e del marciapiede. Però lungo il marciapiede ci stanno al massimo dieci auto ogni 50 metri, qualcuna in più se sono tutte Smart, Citroën Ami o Fiat Topolino.\n\nIn una via lunga un km si possono parcheggiare teoricamente 200 auto per lato (se è abbastanza larga), ma in realtà molte meno perché ci sono i passi carrabili, gli incroci, i passaggi pedonali e altri spazi dove le auto non possono parcheggiare.\n\nNei parcheggi a raso, negli autosilo, nei parcheggi sotterranei, di riffa o di raffa occorrono 25 metri quadri per ciascuna auto che vogliamo parcheggiare: **occorre un ettaro di spazio per parcheggiare 400 automobili.** Non abbastanza per consentire a tutti di arrivare in auto.\n\nQuanto vale, quanto costa un ettaro di spazio in un centro storico?\n\nAltro dettaglio di cui l’analisi [*psicoeconomica* di 100Torri ](https://www.100torri.it/2025/05/29/parcheggi-a-chieri-ecco-perche-laumento-dei-prezzi-e-un-autogol/)non tiene conto: **le auto private stanno parcheggiate circa il 95% del tempo.**\n\n\\[Un’auto che viene usata *due ore* al giorno per andare e tornare dal lavoro, *un’ora* per andare a fare la spesa il sabato e *un’ora* per andare a mangiare dalla suocera la domenica **sta parcheggiata 156 ore alla settimana**. Ovvero: 8% del tempo in movimento, 92% del tempo parcheggiata. Ed è un’auto che viene usata parecchio. La classica auto che si usa per le vacanze e per andare a fare la spesa viene usata molto meno. \\]\n\nQuindi: più automobilisti vogliono entrare nel centro storico di Chieri, più auto dovranno essere parcheggiate, con una grande sproporzione fra tragitto e tempo di parcheggio: *10 minuti* per arrivare in auto dalla periferia al centro, *due ore* di parcheggio per fare due passi, prendere un caffè, comprare qualcosa. 10 minuti di tragitto, 120 minuti di parcheggio: un rapporto 1:12. Più auto arrivano e più problemi di parcheggio ci saranno.\n\nÈ evidente a chiunque sappia fare due conti che, siccome lo spazio è limitato, non tutti possono parcheggiare in centro.\n\nQuindi, psicoeconomia o no, è inevitabile il fatto che le risorse *limitate* abbiano un *costo*.\n\nFar pagare il parcheggio contribuirà a diminuire il traffico e a ottimizzarlo, come è dimostrato da anni di studi, perché chi non vuole pagare parcheggerà lontano e farà quattro passi a piedi, oppure userà i mezzi pubblici o la bici. Chi invece ha assoluto bisogno dell’auto cercherà di abbreviare la sosta per pagare meno.\n\nL’unica maniera per ridurre il traffico non è né fare parcheggi né offrirli gratis o a basso prezzo ma è: *potenziare i mezzi pubblici, migliorare i marciapiedi e fare piste ciclabili ben collegate fra loro*. In questo modo chi può usa mezzi alternativi, e chi ha assolutamente bisogno della macchina trova meno traffico e ha meno problemi di parcheggio.\n\n# Qui due proposte per migliorare i parcheggi:\n\n1. **Stabilire il giusto prezzo per il parcheggio in strada.** Una tariffa troppo bassa incoraggia l’uso dell’auto anche a chi non ne ha realmente bisogno, allungando la durata della sosta media, con posti auto sempre occupati. La tariffa giusta – che con l’adeguata tecnologia può essere modificata dinamicamente in base a ora di punta, stagione, giorno della settimana – è quella per cui restano sempre almeno un paio di posti liberi in ogni isolato, in modo che l’automobilista che arrriva trovi sempre parcheggio. Spiegazione dell’apparente paradosso: se la tariffa è troppo bassa, la durata media della sosta si allunga, e più persone penseranno di usare l’auto; se la tariffa è adeguata, chi non vuole pagare parcheggerà più lontano oppure userà altri mezzi; chi è disposto a pagare cercherà comunque di abbreviare il tempo di sosta, quindi ci saranno sempre dei posti liberi. Facile regola: se il parcheggio è a pagamento ma i posti sono spesso tutti occupati, la tariffa è troppo bassa.\n2. **Dedicare gli introiti dei parcheggi per migliorare i servizi pubblici e l’arredo urbano del quartiere.** In questo modo, se vedono migliori mezzi pubblici, marciapiedi più ordinati, nuove fioriere e arredi urbani, residenti e commercianti saranno più favorevoli ai parcheggi a pagamento nella loro strada perché in questo modo i posti auto a pagamento finanzieranno le migliorie di quella particolare strada e di quel particolare quartiere.\n\n**Nei centri storici e nelle aree ad alto traffico, la convivenza di parcheggi gratis e parcheggi a pagamento nella stessa strada e nello stesso quartiere invece aumenta il traffico:** l’automobilista girerà a vuoto per cercare un posto gratis, e si rassegnerà a parcheggiare a pagamento solo dopo qualche minuto e qualche km di ricerca.\n\n# Cosa succede ad aumentare la tariffa dei parcheggi?\n\nPer quel che riguarda cosa succede aumentando i prezzi dei parcheggi, i ricercatori dell’Università di Dublino hanno intervistato 1.000 persone prima e dopo un incremento dei prezzi del parcheggio del 50%. Ecco i risultati:\n\n* È aumentata la quota di utenti di classe media\n* La durata media della sosta è **calata del 17%**\n* Le soste **sopra le tre ore sono calate del 39%**\n* Le soste di **una o due ore sono aumentate del 32%**\n* È **diminuito** il numero di minuti necessari per trovare un posto libero\n* È **aumentato** il numero di **donne** utenti perché è più facile trovare posto libero\n* È **diminuita** la quota di utenti molto benestanti, perché anche loro cercano di abbreviare le soste per pagare meno\n\nNella maggior parte dei casi chi ha la necessità di arrivare in auto in centro, con prezzi un po’ più alti trova più facilmente posto e complessivamente può anche spendere una cifra uguale o minore a prima, semplicemente sostando di meno e rendendo più rapida la sua commissione.\n\nL’esperienza dimostra che le principali obiezioni sono superate:\n\n1. **~~Con i prezzi alti parcheggiano solo i benestanti.~~** In realtà ricchi e poveri preferiscono tutti pagare il parcheggio il meno possibile. Se la tariffa è giusta (ovvero NON troppo bassa) la maggior parte degli automobilisti abbrevia la sosta per pagare meno, e quando può evita di usare l’auto, preferendo i mezzi alternativi. Se invece il parcheggio è gratis o a basso prezzo, chi trova posto se ne approfitta.\n2. **~~Non tutti possono parcheggiare lontano gratis e camminare fino in centro~~**~~.~~ Esistono molte altre possibilità: prima di tutto chi non è in grado di camminare spesso non è in grado neanche di guidare. Può essere accompagnato in centro, e poi l’accompagnatore va a parcheggiare oppure torna a prenderlo più tardi. Nel caso di disabili che sono in grado di guidare, esistono le apposite agevolazioni a loro riservate e quindi il problema non si pone.\n3. **~~In centro storico c’è l’ospedale e tanti servizi essenziali.~~** I centri storici non sono immensi: sono stati costruiti quando tutti andavano a piedi, percorrerli in lungo e in largo a piedi non è difficile per la maggior parte delle persone. I disabili che non sono in grado di camminare invece hanno le agevolazioni citate nel punto precedente.\n4. **~~Basterebbe gestire la sosta con la zona disco.~~** Il disco orario è molto rigido nell’applicazione e consente facili contraffazioni. *Rigidità*: si possono prevedere soste di durata unica, o solo mezzora, o solo un’ora o solo due ore, per esempio: una misura unica per tutti. Mezzora è troppo poco, due ore sono troppe, eccetera. *Facili contraffazioni*: soprattutto nel caso di sosta consentita per un tempo di un’ora o due, è facile andare ad aggiornare il disco orario per guadagnare altro tempo di sosta.\n\nChi obietta al costo del parcheggio o non vuole spendere può ricorrere a una delle numerose alternative possibili:\n\n* Parcheggiare più lontano, gratis, e fare una passeggiata a piedi\n* Usare i mezzi pubblici\n* Fare carpooling per suddividere il costo del parcheggio\n* Usare il taxi\n* Usare la bicicletta\n* Andare a piedi\n* Chiedere un passaggio a un amico che magari transita di lì ma va altrove\n* Usare una combinazione delle soluzioni sopra\n\nInsomma, sarebbe bello avere il parcheggio gratuito per tutti nei centri storici. Ma non c’è fisicamente lo spazio. E questo comporta necessariamente parcheggi a pagamento e mezzi alternativi. Come fanno in tutta Europa. ◆\n\nLa ricerca viene riportata da Donald Shoup nel suo libro ‘The High Cost of Free Parking’.",
        "upvotes": 17,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_kuMxZCN7o8Ywckml2GUpM_wFBZ7cdSEYXE8SmKVL_M.jpg?auto=webp&amp;s=6f05572edd604b4e343f4e8590199a9c0476a7db"
        },
        "permalink": "/r/torino/comments/1l24dag/chieri_torino_la_psicoeconomia_di_100torri/"
    },
    {
        "id": "1l25jao",
        "author": "ayriyn92",
        "title": "Piccole/medie aziende IT a Torino",
        "content": "Come da titolo cerco piccole e medie aziende che operano in ambito IT a Torino. Sono una software test manager che negli ultimi anni ha sempre lavorato in grandi aziende (&gt;10000 dipendenti) e vorrei tornare a realtà più piccole. Qualcuno di voi ha esperienze in aziende più \"a misura d'uomo\" qui in zona? Avete la possibilità di lavorare in smart? Se avete avuto esperienze sia in grandi che piccole aziende e avete voglia di darmi le vostre considerazioni e valutazioni al riguardo, sono molto apprezzate. Al momento mi sento totalmente sopraffatta dalle dinamiche corporate (ambiente tossico, poca possibilità di crescita, ritmi di lavoro assurdi e pressione costante etc) e vorrei cambiare a favore di più serenità, ma forse potete darmi qualche ulteriore spunto di riflessione. Al momento ho una RAL di 42k, con 3 giorni di smart a settimana, CCNL bancario e nonostante non cerchi necessariamente un grande salto di retribuzione, non posso permettermi di scendere sotto la mia retribuzione attuale. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l25jao/piccolemedie_aziende_it_a_torino/"
    },
    {
        "id": "1l277qi",
        "author": "SprtizTime",
        "title": "Looking for people interested in startups in Turin",
        "content": "I hope this is okay to post. I am not selling anything, not posting any job offer, or promoting anything. I would just like to know if it's possible to find people with professional experience interested in startups, entrepreneurship. I have been to some events like GDG and to OGR but no luck there.\n\nWhat I am looking precisely is people interested in building startups, again I am not selling anything, not offering a job or promoting anything I just want to connect with people, grab a coffee, a beer and exchange ideas. If this is not the objective of the community, that's ok. I will look somewhere else.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l277qi/looking_for_people_interested_in_startups_in_turin/"
    },
    {
        "id": "1l1mpom",
        "author": "Siculo_torinese",
        "title": "M35 - Siciliano a torino, cercasi nuove conoscenze",
        "content": "Ciao a tutti sono un siciliano che vive a Torino e cerco semplici chiacchiere e conoscenze a Torino... Mi piace divertirmi, parlare e divertirm... se volete chiacchierare, aggiungetemi qui e poi in caso scambiamoci TG. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l1mpom/m35_siciliano_a_torino_cercasi_nuove_conoscenze/"
    },
    {
        "id": "1l1ksjl",
        "author": "FSR79",
        "title": "Lavaggio bici",
        "content": "Qualcuno conosce un posto, tipo i lavaggio auto self service, ma per le bici?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l1ksjl/lavaggio_bici/"
    },
    {
        "id": "1l1kikb",
        "author": "Icy-Mirror2649",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l1kikb/removed_by_reddit/"
    },
    {
        "id": "1l1kcol",
        "author": "desanctiss",
        "title": "Palestre a Torino multi servizi",
        "content": "Ciao a tutti!  \nMi piacerebbe iniziare ad allenarmi seriamente in palestra. Sono sempre stato abbastanza attivo e ora che mi sono stabilito a Torino vorrei riprendere con costanza.\n\nCerco una palestra ben attrezzata, preferibilmente con servizi extra come sauna, piscina, corsi ecc. Vivendo in  Aurora ma lavorando in centro, sono abbastanza flessibile sulle zone ma, una cosa per me importante è che non sia sempre suuuper affollata.\n\nNon ho un budget rigido e sono disposto a spendere se la palestra ne vale la pena, ma chiaramente non voglio farmi fregare.\n\nAvete consigli o esperienze da condividere?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l1kcol/palestre_a_torino_multi_servizi/"
    },
    {
        "id": "1l1bj4x",
        "author": "hugoisbest",
        "title": "Centro scambi per video giochi",
        "content": "Allora, io possiedo una Nintendo 2ds, e ce l’ho fin dall’elementari. Di recente ho ripreso a giocarci. Ho notato però che ho due copie di Super Mario 3D world, o almeno penso che si chiami cosi, vorrei trovare un posto (preferibilmente in centro) dove potrei scambiare o vendere la schedina in più.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l1bj4x/centro_scambi_per_video_giochi/"
    },
    {
        "id": "1l0jl5a",
        "author": "maschera84",
        "title": "Com'era Torino nel 2009?",
        "content": "Credits: QuartaRete",
        "upvotes": 166,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k2gpbjvnv94f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1l0jl5a/comera_torino_nel_2009/"
    },
    {
        "id": "1l1erfh",
        "author": "ahahfilip",
        "title": "Sabbiatura telaio bici a torino",
        "content": "Ciao a tutti! Mi chiedevo se qualcuno conoscesse un restauratore, o azienda specializzata, che fornisce la sabbiatura del telaio della bici.  \nVorrei riverniciarla da solo in casa ma vorrei evitare di perdere tempo a scartavetrare la vernice o dover ricorrere al clorometano.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1l1erfh/sabbiatura_telaio_bici_a_torino/"
    },
    {
        "id": "1l1hzgf",
        "author": "HolidayScallion8502",
        "title": "tabacchi aperto a torino oggi 2 giugno zona San salvarlo?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l1hzgf/tabacchi_aperto_a_torino_oggi_2_giugno_zona_san/"
    },
    {
        "id": "1l1jcdl",
        "author": "Internal_Associate45",
        "title": "Furry a torino",
        "content": "Si lo so imbarazzante.\n\nCerco persone di communità, per fare conoscenze in zona.\n\n:3",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l1jcdl/furry_a_torino/"
    },
    {
        "id": "1l0n2fe",
        "author": "Electrical-Theory-28",
        "title": "Perché vivete ancora a Torino e cosa vi piace di questa città?",
        "content": "Sto pensando di trasferirmi a Torino e sono curioso di sapere cosa pensa la gente del posto della città. Perché vivete ancora a Torino e cosa vi piace di questa città? Cosa vi tiene qui in questa città?",
        "upvotes": 15,
        "comments": 50,
        "media": null,
        "permalink": "/r/torino/comments/1l0n2fe/perché_vivete_ancora_a_torino_e_cosa_vi_piace_di/"
    },
    {
        "id": "1l0pqf6",
        "author": "L_Onorevole_Nullazzo",
        "title": "Ritorno a Torino dopo diversi anni",
        "content": "Quali sono i luoghi più interessanti per un giovane 30enne la sera? Manco da diversi anni, non saprei dove andare se non nei soliti San Salvario, Piazza Vitto ecc.\n\nAnni fa frequentavo la Comala, è ancora attiva?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l0pqf6/ritorno_a_torino_dopo_diversi_anni/"
    },
    {
        "id": "1l0pp2t",
        "author": "Norand87",
        "title": "Circoli/gruppi/corsi/meetup",
        "content": "Ciao a tutti,\nLeggo spesso post di persone, soprattutto non torinesi, che cercano amicizie con cui condividere interessi (tramite app, gruppi Telegram ecc.).\nMi unisco anch’io chiedendo se conoscete circoli, corsi, gruppi abbastanza consolidati o eventi ricorrenti legati a vari ambiti: teatro, sport, cultura, volontariato, trekking e chi più ne ha più ne metta!\n(Su cucina e language exchange ho visto che ce ne sono già diversi).\nQualsiasi consiglio è ben accetto:-)\nGrazie!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l0pp2t/circoligruppicorsimeetup/"
    },
    {
        "id": "1l0o284",
        "author": "Financial_Error7968",
        "title": "Posto per studiare in estate",
        "content": "Buongiorno a tutti, volevo chiedervi di consigliarmi qualche posto per studiare a Torino con questo caldo tremendo. Esistono delle aule studio o biblioteche con aria condizionata ?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l0o284/posto_per_studiare_in_estate/"
    },
    {
        "id": "1l0lo2k",
        "author": "Earl_gabri",
        "title": "Un consiglio per un abito/completo da uomo su Torino?",
        "content": "",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1l0lo2k/un_consiglio_per_un_abitocompleto_da_uomo_su/"
    },
    {
        "id": "1l0sikq",
        "author": "PietroQuerini",
        "title": "Insegnante di chitarra che parli inglese?",
        "content": "Can anyone recommend an Englihs speaking guitar teacher in Turin? I found a guy who seemed perfect on Superprof website, but then discovered you need to subscribe just to even message which seems insane. I need an individual teacher as I am looking for lessons around work hours. Thanks in advance for any recommendations.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1l0sikq/insegnante_di_chitarra_che_parli_inglese/"
    },
    {
        "id": "1l099fr",
        "author": "DagorDraugOBasileus",
        "title": "Qualcunə al buio a Torino ovest come il sottoscritto?",
        "content": "",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1l099fr/qualcunə_al_buio_a_torino_ovest_come_il/"
    },
    {
        "id": "1l019ez",
        "author": "Electrical-Theory-28",
        "title": "I luoghi preferiti a Torino?",
        "content": "Quali sono i suoi luoghi preferiti a Torino? Dove vi piace tornare più volte? Può essere un ristorante, un parco o una piazza, qualsiasi cosa. È molto interessante dove i torinesi amano trascorrere il loro tempo!",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1l019ez/i_luoghi_preferiti_a_torino/"
    },
    {
        "id": "1l0hskm",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1l0hskm/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l00x8w",
        "author": "Any_Tomorrow6171",
        "title": "Riviste usate per collage",
        "content": "Ciao, qualcuno saprebbe dove posso trovare vecchie riviste da cui poter ritagliare immagini? Regalate o a bassissimo prezzo, mi servirebbero per un'attività con bambini e bambine. Grazie !",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1l00x8w/riviste_usate_per_collage/"
    },
    {
        "id": "1kzqp08",
        "author": "nonneui42",
        "title": "Help su cosa fare questa sera",
        "content": "Sono a torino da poche settimane vorrei tirarmi fuori di casa stasera avete proposte interessanti io penso che sto pomeriggio verso sera mi farò un giro al Valentino ma oltre a questo non ho molte idee ",
        "upvotes": 8,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1kzqp08/help_su_cosa_fare_questa_sera/"
    },
    {
        "id": "1kz478f",
        "author": "_pigreco_",
        "title": "torinocronaca",
        "content": "https://torinocronaca.it/sondaggi/cronaca/513938/chi-haucciso-chiara-poggi-alberto-stasi-e-colpevole-o-innocente-e-andrea-sempio.html\npenso che lo schifo che mi provoca torino cronaca sia difficile da scrivere a parole, se domani chiudesse bottega offro la colazione a tutta torino \n",
        "upvotes": 186,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4lbfmnv48x3f1.jpeg?auto=webp&amp;s=eb5d922a1ccfc8c43047776d61db8cb7e6416988"
        },
        "permalink": "/r/torino/comments/1kz478f/torinocronaca/"
    },
    {
        "id": "1l01xbp",
        "author": "AdIndividual2665",
        "title": "Conoscenza",
        "content": "Qualcuno con cui chattare in privato? M, f",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1l01xbp/conoscenza/"
    },
    {
        "id": "1kzpnn9",
        "author": "Logeybearbro",
        "title": "Champions League final",
        "content": "Ciao a tutti, stiamo visitando Torino per il festival “Jazz is Dead”, oggi è la finale di Champions League, ci sono buoni consigli per i luoghi per guardare la partita? Sono solo pub irlandesi?\n\nVorrei guardare il calcio da qualche parte come un locale, anche con del buon vino!\n\nGrazie in anticipo!!! 🙏",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kzpnn9/champions_league_final/"
    },
    {
        "id": "1kyeok7",
        "author": "Spiritual_Cake_9127",
        "title": "Average Torino Experience",
        "content": "",
        "upvotes": 776,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s71yuqiqup3f1.jpeg?auto=webp&amp;s=1cc068d1c84e73130691a6ae93ae08ad3368e7ba"
        },
        "permalink": "/r/torino/comments/1kyeok7/average_torino_experience/"
    },
    {
        "id": "1kzf4wc",
        "author": "JeramiDeng",
        "title": "Table tennis?",
        "content": "Is there any place where People play table tennis casually in torino? Like you just come in and there is good chance u can find som1 to play against",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kzf4wc/table_tennis/"
    },
    {
        "id": "1kz45gr",
        "author": "jackedpic",
        "title": "Where to test for STD in Torino",
        "content": "I tried calling the CEMUSS but it says phone number out of service… any recommendations ? Thanks ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kz45gr/where_to_test_for_std_in_torino/"
    }
]