[
    {
        "id": "1qgdunw",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - Mérida AD | Primera Federación, Matchday 20",
        "content": "#FT: CASTILLA 1:1 MÉRIDA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Álvaro García 14'\n\n1:1 Dani Yáñez 37'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos - the start of the era of Julian López de Lerma, hopefully it will last longer than Arbeloa's and be even more successful\n\n⚽ 14' - goal for Mérida - stupid and risky pass by Fran in the buildup to Cestero, he goes to the ground way to easily and Álvaro can snatch possession and finish past Fran for the very unnecessary 0:1\n\n⚽ 37' - GOLLLL DEL CASTILLA - cross from the left by Diego Aguado, and Loren Zúñiga can get at the end of it - his touch rebounds to Dani Yáñez, who quickly runs for the open ball and finishes for the equaliser \n\nHT - half time in a very disputed and physical match - after conceding an unnecessary goal early on, Castilla slowly but surely started to impose themselves and have been generating danger before half time\n\n46' - second half underway\n\n56' - Manuel Ángel gets brought down in the box, looked like a clear penalty - then Yáñez' volley shot is saved by the keeper\n\n59' - after a challenge, the penalty is not given\n\n🔄 74' - Leiva and Pol Fortuny for Thiago Pitarch and Dani Yáñez\n\n🔄 82' - Mesonero and Álvaro Gines come in for Palacios and Loren\n\nFT - an aggressive and competitive Castilla get their 2nd draw of the season, ending their streak of 7 home wins in a row. In a disputed match that was decided by small details, the team didn't manage to create any moments of high attacking pressure on their opponents in the second half. They remain 4th, 2 points into the playoff zone and 15 points behind dominant leaders Tenerife\n\n\n&amp;#x200B;\n\n**Kickoff:** 18:15 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Francisco Ortega Herrera\n\n**Competition:** Primera Federación, Grupo 1, Matchday 20\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas ‘Valde’, Joan Martínez, David Jiménez - Jorge Cestero, Manuel Ángel, Thiago Pitarch (74' Pol Fortuny) - César Palacios (82' Dani Mesonero), Loren Zúñiga (82' Álvaro Ginés), Dani Yáñez (74' Álvaro Leiva) \n\nBench: Guille Súnico (GK), Jesús Fortea, Lamini Fati, Mario Rivas, Cristian David, Bruno Iglesias. \n\nUnavailable: Manu Serrano (injury), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Julián López de Lerma\n\n&amp;#x200B;\n\n**Castilla last five matches:** WDLWL\n\n**1ª RFEF stats:** 4th | 31pt | 10-1-8 | 25:25\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgdunw/match_thread_real_madrid_castilla_mérida_ad/"
    },
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 27,
        "comments": 9175,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qgkkdk",
        "author": "dark4403",
        "title": "BRAHIM DIAZ HAS MISSED THE PENALTY!",
        "content": "",
        "upvotes": 2316,
        "comments": 319,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cq5aea7ic6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgkkdk/brahim_diaz_has_missed_the_penalty/"
    },
    {
        "id": "1qgmc69",
        "author": "Messmers",
        "title": "Endrick vs Brest - Man Of The Match",
        "content": "",
        "upvotes": 1625,
        "comments": 212,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ducnn1x6p6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgmc69/endrick_vs_brest_man_of_the_match/"
    },
    {
        "id": "1qgvi3j",
        "author": "Charybd1ss",
        "title": "many Madrid fans were telling me Endrick couldn't play as a right winger?",
        "content": "",
        "upvotes": 324,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1kfv7lamr8eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgvi3j/many_madrid_fans_were_telling_me_endrick_couldnt/"
    },
    {
        "id": "1qgmb4i",
        "author": "No-Independent2522",
        "title": "Brahim Diaz in tears while getting his golden boot award",
        "content": "",
        "upvotes": 801,
        "comments": 84,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ayftckj1p6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgmb4i/brahim_diaz_in_tears_while_getting_his_golden/"
    },
    {
        "id": "1qgpma5",
        "author": "soldier101br",
        "title": "Endrick debut on ligue 1: 1 Assist,1 Man of the Match",
        "content": "",
        "upvotes": 426,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgpma5/endrick_debut_on_ligue_1_1_assist1_man_of_the/"
    },
    {
        "id": "1qgn2cy",
        "author": "JakGrealish",
        "title": "Trent's reaction to Brahim's miss 🤣",
        "content": "",
        "upvotes": 442,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wzlenl6fu6eg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgn2cy/trents_reaction_to_brahims_miss/"
    },
    {
        "id": "1qglsua",
        "author": "No-Obligation1336",
        "title": "I am not sure how Brahim Diaz will recover.",
        "content": "By now he's trending and being COOKED online for that horrible decision to paneka a penalty at the end of normal time to win his nation the AFCON for the first time in 50 years...Right at Mendy.\n\nThen they went on to lose the final 1-0 to Senegal.\n\nHe will be remembered as that last moment. Not about the superb tournament he had being the best player and top scorer. None of that matters because he chose to take the biggest gamble a player could take in that moment.\n\nWOW, I FEEL FOR HIM. He will NEVER live this down either, jeez...",
        "upvotes": 309,
        "comments": 173,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qglsua/i_am_not_sure_how_brahim_diaz_will_recover/"
    },
    {
        "id": "1qg8q8a",
        "author": "AlekhineAl",
        "title": "Bernabeu was an absolute nightmare yesterday. Incredible scenes!",
        "content": "",
        "upvotes": 1135,
        "comments": 173,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lzf06gj024eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg8q8a/bernabeu_was_an_absolute_nightmare_yesterday/"
    },
    {
        "id": "1qgdkh9",
        "author": "ContextDry9672",
        "title": "Players wishing good luck to Brahim in the final.",
        "content": "",
        "upvotes": 461,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2w5x3nvg05eg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgdkh9/players_wishing_good_luck_to_brahim_in_the_final/"
    },
    {
        "id": "1qgmx0w",
        "author": "patwildel",
        "title": "I don't know why some certain divas and board don't get it the point of our frustration",
        "content": "\"If you only applaud us in glory, but you disappear in defeat, you were NEVER one of us.\" LIE\n\nThis is Raul Asencio last match getting applaud by Bernabéu after defending the badge by honor as it should be.\n\nReal Madrid fanbase will call out you in a heartbeat when they feel players or the board tarnishing the badge with shame. \n\nIt doesn't matter if you're Florentino Perez, Vini Jr. Mbappe, Bellingham etc.\n\nLike the great Santiago Bernabéu said \"The Real Madrid shirt is white. It can get dirty with mud, sweat, and even blood, but never of shame,\"\n\nThat is the statement should lived by.",
        "upvotes": 138,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8lq6gvect6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgmx0w/i_dont_know_why_some_certain_divas_and_board_dont/"
    },
    {
        "id": "1qgg077",
        "author": "dark4403",
        "title": "Vinicius was devastated in the locker room tunnel...",
        "content": "",
        "upvotes": 208,
        "comments": 228,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/reqkbfolg5eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgg077/vinicius_was_devastated_in_the_locker_room_tunnel/"
    },
    {
        "id": "1qgabw3",
        "author": "No-Independent2522",
        "title": "Militao turns 28 🎉 Happy Birthday 🎂",
        "content": "",
        "upvotes": 370,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0c33bcp5e4eg1.jpeg?auto=webp&amp;s=60ec60abfcda62e30aa100bda835e2436a919051"
        },
        "permalink": "/r/realmadrid/comments/1qgabw3/militao_turns_28_happy_birthday/"
    },
    {
        "id": "1qgcdue",
        "author": "vil727",
        "title": "How are rival fans saying THIS isn't a penalty?",
        "content": "",
        "upvotes": 261,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zbyufjxls4eg1.jpeg?auto=webp&amp;s=744d63236cde1ca81ff4acb21aa3c6c0fce8c50d"
        },
        "permalink": "/r/realmadrid/comments/1qgcdue/how_are_rival_fans_saying_this_isnt_a_penalty/"
    },
    {
        "id": "1qg9b03",
        "author": "Ready_Ad_1353",
        "title": "Jose Mourinho when asked about a possible return to Real Madrid: “Don’t count me on for soap operas, There are good soap operas, but they are very long.” “If you miss 1 or 2 episodes, you lose track, Don’t count me on for soap operas, because I don’t watch soap operas.",
        "content": "",
        "upvotes": 371,
        "comments": 34,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u91uri2h64eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg9b03/jose_mourinho_when_asked_about_a_possible_return/"
    },
    {
        "id": "1qgn7le",
        "author": "Reasonable-Award2365",
        "title": "Play Endrick on the RW Once he Comes Back from Loan",
        "content": "I saw today’s highlights of Endrick and I have to say that he might be better playing as a RW than a striker.\n\nHe has so much pace and physicality that is much needed for that position. Meanwhile we got Franco who just cuts inside and then passes backwards.\n\nFranco is still young but I truly believe that Madrid loaned out the wrong guy.\n\nHopefully when Endrick does come back he will get minutes playing on the RW since the striker position is occupied and doesn’t seem like vini will be subbed off any time soon with the new manager.",
        "upvotes": 61,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgn7le/play_endrick_on_the_rw_once_he_comes_back_from/"
    },
    {
        "id": "1qgmblx",
        "author": "Agreeable-Stage-6896",
        "title": "Barcelona dropped points. Could this season have been saved?",
        "content": "One week ago we sacked Xabi Alonso after a close 3-2 defeat in the Supercopa against Barcelona. Not only were we riddled with injuries, but also finished that match lacking any natural centerbacks. At the end of the match we had numerous chances to equalise, not to mention that his Real Madrid side had beaten Barcelona less than 3 months ago. Providing the only victory against Barcelona in the six last encounters, while showcasing their capability and grit.\n\nUpon that decision, we lost in the Copa del Rey to a second division team and initiated yet another rebuild in the middle of the year. It seems the board gave up on this season and the league for no apparent reason, yet Barcelona dropped points today…\n\nWould Xabi truly have lost in the Copa del Rey? Would he not be able to recover from a 1 point deficit in the league against Barcelona? With every passing day, I can’t help but question this decision more and more",
        "upvotes": 67,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgmblx/barcelona_dropped_points_could_this_season_have/"
    },
    {
        "id": "1qgaaok",
        "author": "DoriOli",
        "title": "Keeping our promises ⭐️",
        "content": "",
        "upvotes": 215,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lx4rllrsd4eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgaaok/keeping_our_promises/"
    },
    {
        "id": "1qfqobv",
        "author": "AbuElKess",
        "title": "Real Madrid beat Schalke 5-4 on aggregate in the 14/15 UCL RO16. Ronaldo scored 3 and got 1 assist. Madrid lost the 2nd leg 4-3 at home. Ronaldo scored 2. He stood at the centre of Bernabèu and listened to the boos.",
        "content": "",
        "upvotes": 3292,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kf4uyo7pizdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qfqobv/real_madrid_beat_schalke_54_on_aggregate_in_the/"
    },
    {
        "id": "1qg9mef",
        "author": "kenstarfighter1",
        "title": "Breaking: How Laporta conned Florentino Perez",
        "content": "&gt;The reason Joan Laporta is Barcelona's president today is DIRECTLY THANKS to Florentino Perez! During Barcelona's elections, Florentino directly called the Sabadell Bank, as Joan Laporta needed to deposit €124.6M into Barcelona's accounts and he didn't have it. Sabadell were very reluctant at first, because Barca were in a financial crisis and couldn't guarantee payment, but it was Florentino Perez that kept insisting so much that the bank ended up approving the payment. The reason Florentino did this is because he considered Laporta a Super League ally at the time, however, Barcelona have now left the Super League.\n\n&gt;Joan Laporta pushed for a change to Sports Laws in 2022. Spanish law used to say that boards in football clubs needed to deposit 15% of the club's budget in cash. Laporta was worried that he would start losing his own money and properties because of this law, so he asked for the law to change. Florentino Perez saw Laporta as his Super League ally, so he backed Laporta's request and also pushed for the law to be changed in Spanish Congress. With the law changed, and Barca's team rebuilt, Barcelona then left the left Super League and negotiated a return to UEFA\n\nThis is from El Confidencial. Basically, Barca's rise from the ashes, including their last 2 league titles, are thanks to Perez. \n\nOur squad planning and on field issues are on thing, but this right here is something else. This alone is ground for termination imo. ",
        "upvotes": 149,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qg9mef/breaking_how_laporta_conned_florentino_perez/"
    },
    {
        "id": "1qgbp7c",
        "author": "Violet_Kitty_room319",
        "title": "Jude Bellingham Vs Xabi Alonso",
        "content": "I can't fathom why Jude is getting so much shit from fans over Xabi's sacking, even after [the statement](https://www.reddit.com/r/realmadrid/comments/1qbzwlz/jude_bellingham_calling_out_reports_that_he_had/) he put out. Valverde &amp; Vini had both made their feelings clear (to varying degrees) whilst Bellingham remained professional throughout. We have seen nothing negative, he's played where asked without complaint &amp; spoken highly of Xabi repeatedly. But the athletic said otherwise (without actually stating what Jude's issue was exactly) so that holds more weight? \n\nFor some reason fans have sided with the media over a player who has repeatedly expressed his love for &amp; shown respect to the club, whilst consistently working hard on the pitch. Even when he has an average game you can still see the effort he makes, how he gets frustrated with himself. For him to be booed like that over other players all because of 'reports' is fucked up. I can see how Vini made a rod for his back but Jude didn't.   \n  \nBe fickle in your support all you want but at least know the facts. Here are a few things Jude has said about Xabi:  \n\"*I’m still learning and I want to be better everyday, I still want to know more tactically about the game and he gives me a great chance of doing that with his knowledge of the game*\".   \n  \n\"*It's a good win, still not perfect, but the coaches' ideas are amazing, and we want to keep going.*\"   \n  \n\"*The manager's been great, I've personally got a great relationship with him, a lot of the lads do as well*\".  \n  \nOn his youtube (via his app) he said the opinion of the coach matters most to him (after teammates &amp; fans).  \n  \nOn RMTV's piece for his 100th game he said \"*It's different because every game I feel fortunate to be able to tactically analyze how I've played.*\" **He said this long before there was any talk of players not wanting to do video analysis.**  \n  \nBoth Xabi &amp; Jude said they talked everyday. In one of Xabi's press conferences he implied he had helped Jude with personal stuff (this was around the time there was news of his parents splitting &amp; the england noise), Jude also acknowledged that the season under Xabi was far from a disaster in the press conference he did for the super cup.   \n  \nI know people will trot out the usual 'PR' jab, but compare his words to how others spoke, a lot of what he said he didn't need to when you look at the full quotes. I think Jude made himself clear if you have the ability to comprehend.  \n   \nIn November in a press conference Xabi said \"*I have very good communication with Jude, a very good relationship. He's a lad who is already a world class player. but he has that hunger to improve, that desire to learn, to become more efficient with the huge potential he has. I love those kinds of players who have that curiosity &amp; take the initiative to come and ask \"what can we do better?*\" Does that sound like Jude was dismissive?  \n  \nI know posting this here is probably pissing in the wind but it needed to be said. Until something real comes out that proves otherwise I'll choose to believe Bellingham over the media &amp; bots.",
        "upvotes": 112,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgbp7c/jude_bellingham_vs_xabi_alonso/"
    },
    {
        "id": "1qgdcy7",
        "author": "asensia-kopfschmerz",
        "title": "Real Madrid's set-piece specialist Jesús Rueda has been relieved of his duties but remains at the club in another role as an analyst/assistant.",
        "content": "",
        "upvotes": 84,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgdcy7/real_madrids_setpiece_specialist_jesús_rueda_has/"
    },
    {
        "id": "1qfzxxd",
        "author": "TeacherNo8591",
        "title": "If the players are 'sad' about the whistles, wait until they hear how we feel about them forcing out a generational coach.",
        "content": "I saw the reports saying the board and players are \"surprised and disappointed\" by the whistles today. Honestly, it’s hilarious. They are surprised by the whistles, but were they surprised when they forced a generational coach like Xabi Alonso out?\n\nPeople love to call international fans \"glory hunters,\" but I’m here in Asia region waking up at 2:00 AM every single week to watch this mess. I don’t watch for the \"glory\" of the past, I watch because I love this club. But right now, the club doesn’t feel like it loves the fans back.\n\nHere is the reality the board needs to hear:\n\n• No Player is Above the Club: We watched a group of players create a mess, undermine a world-class coach, and ultimately get him sacked. Instead of holding the players accountable, the board backed them and is now trying to \"discipline\" the fans for reacting.\n\n• The \"Whistle\" is our Voice: If the board thinks they can use security cameras to monitor the Grada and stop the booing, they’ve lost the plot. The Bernabéu whistles because we demand excellence. If you don't want to be whistled, show the effort on the pitch.\n\n• We are willing to suffer, but not like this: Every club has bad seasons. We can handle losing if the team fights. What we can’t handle is a board that protects \"untouchable\" stars while threatening the fans who actually pay (and wake up at 2 AM) to support them.\n\nStop being \"disappointed\" in the stands and start being disappointed in the locker room. The badge comes first. Always.",
        "upvotes": 622,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qfzxxd/if_the_players_are_sad_about_the_whistles_wait/"
    },
    {
        "id": "1qfvrcg",
        "author": "O333O",
        "title": "Best win percentage: Xabi Alonso",
        "content": "Thought this was interesting. Per last decade and who knows how it would have continued but on paper he really didn’t do bad at all. I don’t understand why you bring a coach in with a vision and then not allow him to do his thing. Give it time, understand that the divas in the dressing room will need to adjust but let’s see the vision in its entirety ",
        "upvotes": 833,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a7zsthb8m0eg1.jpeg?auto=webp&amp;s=830c94bbadd9afea2c65c82d8c1116371f2d4a5e"
        },
        "permalink": "/r/realmadrid/comments/1qfvrcg/best_win_percentage_xabi_alonso/"
    },
    {
        "id": "1qg8xmh",
        "author": "No-Independent2522",
        "title": "Anas Laghrari, a powerful financier without an official role, has become Florentino Pérez’s closest adviser. He is increasingly mentioned as a future candidate for chief executive officer in a new commercial structure the club intends to establish.",
        "content": "",
        "upvotes": 81,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdmQWHGZ6IJVak6e3tnSB2LknBQWbn0Xwoh4Lte8cxE.jpeg?auto=webp&amp;s=2bf5714dcdd93424e126aa4dd073b49073bab3fe"
        },
        "permalink": "/r/realmadrid/comments/1qg8xmh/anas_laghrari_a_powerful_financier_without_an/"
    },
    {
        "id": "1qfrpm8",
        "author": "asensia-kopfschmerz",
        "title": "Sadness, surprise and disappointment among the Real Madrid players and management after the historic booing at the Bernabéu. Neither the club nor the players expected such a protest from their fans. What happened against Levante has generated sadness, surprise, and disappointment.",
        "content": "",
        "upvotes": 956,
        "comments": 179,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kll60YTvc89_w-xeg9tRyyU1ngqHnSe4j9Pqx3PGKnA.jpeg?auto=webp&amp;s=ed0232dc1def167d974bd7a62fd7f512d57e0d7f"
        },
        "permalink": "/r/realmadrid/comments/1qfrpm8/sadness_surprise_and_disappointment_among_the/"
    },
    {
        "id": "1qg4tpf",
        "author": "Bunchdawg",
        "title": "You guys will watch one of the best coaches in the world say this but pretend you know better",
        "content": "",
        "upvotes": 121,
        "comments": 109,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/glzo0k3yz2eg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qg4tpf/you_guys_will_watch_one_of_the_best_coaches_in/"
    },
    {
        "id": "1qgigrt",
        "author": "ManuMora98",
        "title": "[Basket] Big win against 2nd qualified Valencia 94-79 after a great reaction from the team, being 9-24 down in the 1st quarter but dominating the rest of the game",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7wljc5h7x5eg1.jpeg?auto=webp&amp;s=b83e9dc1c1827570d7d1b30bba2c84e6d7f59b00"
        },
        "permalink": "/r/realmadrid/comments/1qgigrt/basket_big_win_against_2nd_qualified_valencia/"
    },
    {
        "id": "1qg1jcp",
        "author": "asensia-kopfschmerz",
        "title": "At the start of the match, the rest of the stadium protested when the Grada fans, the club’s organised fan group located behind one of the goals, cheered on the team. In the final minutes, the Grada fans chanted the new coach’s name, with some boos in response.",
        "content": "",
        "upvotes": 149,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TNLi489ZSWoWlo7DzTEjMKqCIjjEyISD-Rnq_gqcxAY.jpeg?auto=webp&amp;s=94b3c8e431c79413e8f686bedab4738a6fe3f8ea"
        },
        "permalink": "/r/realmadrid/comments/1qg1jcp/at_the_start_of_the_match_the_rest_of_the_stadium/"
    }
]