[
    {
        "id": "1jm0dan",
        "author": "netflix",
        "title": "[ANNOUNCEMENT] Official r/movies Competition! Director Gareth Evans (THE RAID) announces poster contest (with prizes!) and AMA to celebrate the release of Netflix's HAVOC (starring Tom Hardy) on April 25th.",
        "content": "",
        "upvotes": 38,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n8jr81g2sgre1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jm0dan/announcement_official_rmovies_competition/"
    },
    {
        "id": "1jlkg77",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Death of a Unicorn / The Working Man / The Woman in the Yard / Magazine Dreams / Ash / O'Dessa) and introducing Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Death of a Unicorn](https://www.reddit.com/r/movies/comments/1jlkd7q/official_discussion_death_of_a_unicorn_spoilers/?)\n\n[The Working Man](https://www.reddit.com/r/movies/comments/1jlkdcp/official_discussion_the_working_man_spoilers/?)\n\n[The Woman in the Yard](https://www.reddit.com/r/movies/comments/1jlkdi0/official_discussion_the_woman_in_the_yard_spoilers/?)\n\n[Magazine Dreams](https://www.reddit.com/r/movies/comments/1jlkdma/official_discussion_magazine_dreams_spoilers/?)\n\n[Ash](https://www.reddit.com/r/movies/comments/1jlkdp3/official_discussion_ash_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Erin Brockovich](https://www.reddit.com/r/movies/comments/1jlke90/official_throwback_discussion_erin_brockovich/?)\n\n[Final Destination](https://www.reddit.com/r/movies/comments/1jlked9/official_throwback_discussion_final_destination/?)\n\n[Romeo Must Die](https://www.reddit.com/r/movies/comments/1jlkeg0/official_throwback_discussion_romeo_must_die/?)\n\n# Still in Theaters\n\n[Snow White (2025)](https://www.reddit.com/r/movies/s/zHwZaVwVDH)\n\n[Alto Knights](https://www.reddit.com/r/movies/s/Xvz6dM0MZP)\n\n[Novocaine](https://old.reddit.com/r/movies/comments/1jat4d0/official_discussion_novocaine_spoilers/?)\n\n[Black Bag](https://old.reddit.com/r/movies/comments/1jat4fj/official_discussion_black_bag_spoilers/?)\n\n[Mickey 17](https://www.reddit.com/r/movies/comments/1j5dv2d/official_discussion_mickey_17_spoilers/?)\n\n\n# On Streaming\n\n[O'Dessa](https://www.reddit.com/r/movies/comments/1jlkdu3/official_discussion_odessa_spoilers/?)\n\n[The Electric State](https://old.reddit.com/r/movies/comments/1jbkncc/official_discussion_the_electric_state_spoilers/?)\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)",
        "upvotes": 29,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jlkg77/official_discussion_megathread_death_of_a_unicorn/"
    },
    {
        "id": "1jmxzmv",
        "author": "Bennett1984",
        "title": "Dark City receives new 4K restoration from Arrow",
        "content": "",
        "upvotes": 1197,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xyEA_zjKKFd-HSERsjCIWmRwtF2PgcRpq7XmR5iLK08.jpg?auto=webp&amp;s=f2dc19bdd23120b752121f9150b4075355ad1c2c"
        },
        "permalink": "/r/movies/comments/1jmxzmv/dark_city_receives_new_4k_restoration_from_arrow/"
    },
    {
        "id": "1jmyzmj",
        "author": "MarvelsGrantMan136",
        "title": "Bruce Glover, the Villainous Mr. Wint in 'James Bond' Movie ‘Diamonds Are Forever,’ Dies at 92",
        "content": "",
        "upvotes": 663,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EkMI9sgKPJYwZ92Fo2qbubbgjEA51XqrLUJSWQuauJI.jpg?auto=webp&amp;s=e5a56aefee44bd69cf1b32c09f2204acb511907f"
        },
        "permalink": "/r/movies/comments/1jmyzmj/bruce_glover_the_villainous_mr_wint_in_james_bond/"
    },
    {
        "id": "1jmikp3",
        "author": "Funendra",
        "title": "This Studio Ghibli AI trend is an utter insult to the studio and anime/cinema in general.",
        "content": "What's up with these AI Ghibli pics recently? Wherever I go, I just cannot escape it. Being a guy who loves the cinematic art in any form, seeing this trend getting this scale of traction is simply sad. I have profound respect for the studio and I  was amazed by their work when I discovered movies like Castle in The Sky, Grave of the Fireflies, Spirited away, etc. And when I got to know how these movies are made and how much manual effort it takes to produce them, my appreciation only increased. But here comes some AI tool that can replicate this in a matter of minutes. This is no less than a slap on the faces of artists who spend hours imagining and creating something like this. \n\nI am not against AI, or advancements it is making. But there must be a limit to this. You can cut a fruit as well as stab someone with a kitchen knife. Right now, it is the latter happening with the use of AI tools just for cheap social media points. Sad state of affairs.\n\nWhat do you think? Do you guys like his trend? ",
        "upvotes": 30984,
        "comments": 4862,
        "media": null,
        "permalink": "/r/movies/comments/1jmikp3/this_studio_ghibli_ai_trend_is_an_utter_insult_to/"
    },
    {
        "id": "1jmq5v7",
        "author": "Newreverb",
        "title": "Were movie starting times irrelevant decades ago?",
        "content": "My 85-year old father swears that when he was a kid (1940s to 1950s) everyone just went to the movies at random times and started watching the main feature whenever, even in the middle.  Then when it was over they'd stay, watch the opening cartoons, then watch the feature film up to the point they arrived.  My mom and I tease him about this and say surely it was never really a thing but he swears that's the way it was done back then.  Anyone heard of or experienced this? ",
        "upvotes": 1483,
        "comments": 283,
        "media": null,
        "permalink": "/r/movies/comments/1jmq5v7/were_movie_starting_times_irrelevant_decades_ago/"
    },
    {
        "id": "1jmurh9",
        "author": "Snakebird11",
        "title": "BASEketball: Squeak is the MVP",
        "content": "The first scene of pro Baseketball, we see Coop blow the Denslow Cup. He gets psyched out so bad that he falls forward, and barely makes it in the direction of the rim. Squeak made his shot right before to bring Coop to the plate with a chance to walk off Denslow Cup 4. \n\nSqueak gets roasted nonstop the entire movie. He cannot be psyched out. He gets more fucked up shit said to him than anyone by far. He lives and plays with the best psych-out artists in the league. On the surface he seems like a nervous wreck, but he's the most clutch shooter on the team. He also psychs out Tuttle to beat the LA Riots to clinch a playoff spot.\n\nSqueak always protects Joey's heroic image of Coop, even though Coop is a complete asshole to him. It's all about the kid. He tells Joey that Coop is a major dude, while not pursuing the girl at the bar. Coop falls asleep at the plate, throws the 3rd homerun over the garage, and almost kills Joey at the hospital. Before that, Coop and Remer spend Joey's whole day with the team fighting over Jenna. \n\nSqueak is a leader. With Denslow Cup 5 slipping away and the team getting blown out, It is Squeak who rallies the team on the Mulakalaka balance board of trust, while dressed as a pineapple. Remer doesn't even try, while Coop merely sucks until then. Once again, Squeak never misses. In fact, the only shot Squeak misses the entire movie is when he's not even playing, and doesn't know the rules yet.\n\nSqueak puts himself in scoring position in the Denslow Cup 5 game so many times, he collapses from running the bases. He then scores the tying run on the game winning shot. Only then, with the championship won, does Squeak engage with the girl from the bar.\n\nCoop is overwhelmed and out of his element as the player/owner. He gets distracted with the ownership of the team on the line by chasing Jenna instead of maintaining the Beers franchise and trying to make the playoffs. He flies to Calcutta to deal with his clothing line scandal and barely makes it back in time for the big game.\n\nRemer is the team cancer. When he doesn't get his way, he pouts. He cares way more about money and status than winning. He actively colludes with the Dallas owner to begin turning the league into everything it was meant not to be. He basically gives up on the team on anal-probe night, dragging the rest of the team down. Only Squeak isn't pissed off about not controlling the team they aren't the owner of.\n\nSqueak \"Little Bitch\" Scholari. MVP of the Milwaukee Beers, and Denslow Cup champion.",
        "upvotes": 669,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1jmurh9/baseketball_squeak_is_the_mvp/"
    },
    {
        "id": "1jmvxre",
        "author": "Jormungand1342",
        "title": "What single movie from a series is the worst to watch out of order?",
        "content": "A friend hasn't seen a lot of \"classic\" movies. Indiana jones, Back to the Future, Ghost Busters, etc. \n\nHe decided to take it upon himself and watch some of them. In the worst way possible. \n\nHis first Ghostbusters? Frozen Empire. \n\nHis first Indiana Jones? Dial of Destiny\n\nSo this brought up a question for our friend group. Which is the worst movie of a series to watch without seeing the rest. My answer was Back to the Future III. \n\n  \n",
        "upvotes": 376,
        "comments": 396,
        "media": null,
        "permalink": "/r/movies/comments/1jmvxre/what_single_movie_from_a_series_is_the_worst_to/"
    },
    {
        "id": "1jmx1o0",
        "author": "StarPhished",
        "title": "Home Movies: The Princess Bride",
        "content": "This was made during COVID but I just discovered it today and thought it was cool so thought I'd sure if anyone else missed it.\n\nActors re-creating The Princess Bride on their smartphones.",
        "upvotes": 250,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/am2m274or2XkXXK3wnqEx2X9F-JbOxlo_uQMeFCth6c.jpg?auto=webp&amp;s=73b4925c30aa9ecfd52017fdab17025747eb1956"
        },
        "permalink": "/r/movies/comments/1jmx1o0/home_movies_the_princess_bride/"
    },
    {
        "id": "1jmxnhy",
        "author": "GeneralDry6217",
        "title": "What Movies Have The Vibe of 'We're Getting the Band Back Together!\"",
        "content": "What films are like we’re getting the band back together or have the vibe of “we have one summer to change the world” or “we’re going on a trip that’ll the change our lives” or “We have one week to save this town!/ We have One Week to put on the biggest show this town has ever seen!” I always hear those phrases often used ironically or like in a laughing manner but now I’m curious as to what movies are like that because I’m not sure I’ve watched many movies like that haha",
        "upvotes": 192,
        "comments": 408,
        "media": null,
        "permalink": "/r/movies/comments/1jmxnhy/what_movies_have_the_vibe_of_were_getting_the/"
    },
    {
        "id": "1jn1zj4",
        "author": "Sisiwakanamaru",
        "title": "Documentary ‘Number One on the Call Sheet,’ About the History of Black Hollywood, Aims to be a ‘Blueprint for Generations to Come’",
        "content": "",
        "upvotes": 78,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aqoX6Gd5LeSUfnVJUoKedT3GuHgZRjLxUOOdlOTRjis.jpg?auto=webp&amp;s=fe9b9c4cb92d8340b3dbe31059c1b63f32aabb9b"
        },
        "permalink": "/r/movies/comments/1jn1zj4/documentary_number_one_on_the_call_sheet_about/"
    },
    {
        "id": "1jmxdij",
        "author": "Dylan_Gio",
        "title": "Tiny Toons: How I Spent My Vacation (1992)- A hilarious movie that holds up to adult viewing.",
        "content": "I hadn't seen this movie since at least 1995, and feeling nostalgic, I gave it a watch. And I gotta say... Wow. It is still just as funny as I remembered... funnier, in fact. \n\nThe references and jokes it makes are WILD for a kids show. If you grew up in the 90s or 80s, I would recommend giving this another shot if it's been a while.",
        "upvotes": 130,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1jmxdij/tiny_toons_how_i_spent_my_vacation_1992_a/"
    },
    {
        "id": "1jmipcl",
        "author": "JonasKahnwald11",
        "title": "Poster for 'Gunslingers' - Starring Stephen Dorff, Heather Graham and Nicolas Cage",
        "content": "",
        "upvotes": 837,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/llfvwgimmlre1.jpeg?auto=webp&amp;s=57358559664eaa5e458f4f4d96e0c034926a0763"
        },
        "permalink": "/r/movies/comments/1jmipcl/poster_for_gunslingers_starring_stephen_dorff/"
    },
    {
        "id": "1jn7fun",
        "author": "firebirdone",
        "title": "The best feel good moment in cinema history?  What's your submission?",
        "content": "I am so curious to hear what Redditors have to say on this.  \nFor me, it's the 1978 Superman helicopter rescue scene.  \nRemember, at the time in 1978, we had never seen CGI.  \n\nMoreover, we were the first to hear the Superman theme song as he is introduced to us.\n\n  \n[https://youtu.be/jVM-pSD0QlI?si=MksmdAOA-0ecX\\_2h&amp;t=164](https://youtu.be/jVM-pSD0QlI?si=MksmdAOA-0ecX_2h&amp;t=164)",
        "upvotes": 12,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tUPnc3HE13nIIcpZrVkqwkdJZRLaX9xIIgKex4343FI.jpg?auto=webp&amp;s=d4b9c2af6f4efee55d1f049ba3943665c51aae90"
        },
        "permalink": "/r/movies/comments/1jn7fun/the_best_feel_good_moment_in_cinema_history_whats/"
    },
    {
        "id": "1jn7ybt",
        "author": "Ancient_Table_9822",
        "title": "Mickey17 was an amazing watch",
        "content": "I loved the movie so much here are a few things that I loved about it \n\nI loved \n\n\n-that I had no idea where the movie was headed even after watching the trailers.\n\n\n- Robert Pattinson's character, whether he was being crazy or just a loser with no spine\n\n\n-that Mikey was still beloved by most of the crew mates and that people always treated him kindly (besides the jerkwads in the chowhall and the scientist and his so called \"friend\") \n\n\n-that mickey was loved by nasha and the relationship they had was amazing. \n\n\n-that each mickey was different and that mickey 18 seemed to be the one that finally grew a spine and got tired of it all. \n\n\n-that even tho Kenneth and Ylfa were in charge they couldn't be tyrants and still had someone in power above them that was secretly watching.\n\n\n-the natives to the planet were sentient and liked mickey. \n\n\nI could make more points lol but I'd like to know your thoughts on the movie ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jn7ybt/mickey17_was_an_amazing_watch/"
    },
    {
        "id": "1jmeuan",
        "author": "farmsfarts",
        "title": "The movie “IF” is perhaps the worst movie I’ve ever watched the whole way through.",
        "content": "I watched the whole thing because my daughter thought the purple monster was cute and so I rented it off Amazon for $7. She’s 8 years old. We watched it together and both hated it, I could not believe how ham-fisted and boring it was, so fake, cheesy, falsely sentimental. My daughter and I love magical movies, The Princess Bride, stuff like that, this was complete garbage. I kept quiet outside of the occasional derisive snicker but my daughter begged me to turn it off, I said no I paid for it we must suffer through it. AWFUL. ",
        "upvotes": 1450,
        "comments": 583,
        "media": null,
        "permalink": "/r/movies/comments/1jmeuan/the_movie_if_is_perhaps_the_worst_movie_ive_ever/"
    },
    {
        "id": "1jmh5r1",
        "author": "accidentalzero",
        "title": "What movie wasn't about what you thought it was about?",
        "content": "Watched The Devil Wears Prada last night having never seen it before. I always thought this was a film in which Meryl Streep literally played the devil and so was a bit surprised to discover this wasn't the case. (In fairness i did always wonder why the devil would be editing a fashion magazine but figured it'd be explained) \n\nAnyone else watched a film thinking they knew what it was about only to discover they must have picked it up wrong?",
        "upvotes": 801,
        "comments": 1445,
        "media": null,
        "permalink": "/r/movies/comments/1jmh5r1/what_movie_wasnt_about_what_you_thought_it_was/"
    },
    {
        "id": "1jmsn17",
        "author": "AggravatingShow2028",
        "title": "What’s a movie cliche that you’re most tired of seeing?",
        "content": "I’m soooo tired of the cliche where the main character-often female- solves a crime that the police can’t.\n\nShe finds a phone number that leads to this long lost relative of the missing person who happens to remember an address that the main character drives to only to find a vhs of the antagonist leaving riddles and saying “don’t call the police”. Then she selfishly puts everyone in danger, and speeding (again, where are the cops) down the highway-they never stop for gas either. All in all the main character becomes the sole detective to solve their problem along with some random 50 year old cold case that hundreds of trained detectives couldn’t do.\n\nAt this point, why not just have a vigilante task force and forgo the PD altogether.\n",
        "upvotes": 104,
        "comments": 998,
        "media": null,
        "permalink": "/r/movies/comments/1jmsn17/whats_a_movie_cliche_that_youre_most_tired_of/"
    },
    {
        "id": "1jmpqkp",
        "author": "Forsaken_Walk6008",
        "title": "Movies that depicts urban decay and marginality of New York in the 70s",
        "content": "Yooo people, im watching Right now a lot of documentaries about the story of New York and i think súper interesting the period of the 70s to 90s that shows a completely different New York in comparison with now, im looking of a film that depicts that time with all that it entails Drugs, Slums, High rate of crime that type of film from New York im  looking exactly",
        "upvotes": 157,
        "comments": 351,
        "media": null,
        "permalink": "/r/movies/comments/1jmpqkp/movies_that_depicts_urban_decay_and_marginality/"
    },
    {
        "id": "1jmhcmi",
        "author": "Danielnrg",
        "title": "The World's End became way more relevant than I initially gave it credit for",
        "content": "This movie came out over 10 years ago; I don't think I have to litigate its quality to anyone here. \n\nI originally saw this movie in 2014, a couple years after it released. I figured, it's no match for Shaun of the Dead, which I grew up watching from when I was 10, and not as clever as Hot Fuzz. It was just a lukewarm movie that I got a handful of laughs out of. \n\nIt wasn't until I entered adulthood that I realized how much this movie spoke to who I am as a person. It laid bare my inadequacies far clearer than any media I have ever viewed.\n\nI think the vast majority of viewers see Gary King as a pitiful character. Some may have even known someone like him. \n\nOne thing that has always struck me about this movie in later years is that it felt like it was talking directly to me in its plot points and characters.\n\nGary King is not just a fictional character. He's me. I've never felt more affinity for a fictional character than hearing Gary's monologue towards the end of the film. \n\n\"That was supposed to be the beginning of my life. All that promise and fucking optimism. It was a big lie. Nothing happened.\"\n\nFuck, man. I watched this shit for the first time when I was a sophomore in high school, out of obligation for Shaun and Fuzz at the time. I had no idea it would go on to describe an essential part of who I was for 10 years. \n\nI like to think that most people empathize with Gary here, but some of us really are that fucking pathetic to hold on to our \"glory days\" all these years later. For some of us, it really was all we ever had.\n\nIt never got better than that night.",
        "upvotes": 629,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1jmhcmi/the_worlds_end_became_way_more_relevant_than_i/"
    },
    {
        "id": "1jn71xw",
        "author": "Impossible-Bet-1738",
        "title": "Movies that could have been great if only for some editing",
        "content": "I was in another thread where someone mentioned the movie Click and goddammit that movie could have been amazing. All the pieces were there, all the actors, the story, the tenderness and pain. And the movie survives (only just) because of all that but with maybe 15 minutes of great editing, we could have had the next It's a Wonderful Life. Screw sequels and remakes; I wish we could go back and edit and rerelease movies that have just slightly missed their mark. \n\nI have more examples but man oh man Click gets me fired up lol. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1jn71xw/movies_that_could_have_been_great_if_only_for/"
    },
    {
        "id": "1jmn1w2",
        "author": "MarvelsGrantMan136",
        "title": "'How to Train Your Dragon' at 15: The Story Behind the Dazzling Animated Children’s Fantasy",
        "content": "",
        "upvotes": 183,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3jlnubQzER4fNPAXza91W8HVWZ3s2Yz16e3Cs6thfdk.jpg?auto=webp&amp;s=7f95bda7b8dd57bf6385352c82f2a30b40db15e3"
        },
        "permalink": "/r/movies/comments/1jmn1w2/how_to_train_your_dragon_at_15_the_story_behind/"
    },
    {
        "id": "1jn7k8q",
        "author": "exophrine",
        "title": "‘Texas Chainsaw Massacre’ Rights Up for Grabs, Sending Hollywood Foaming",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xAtcGu6NEMKy9JElOdyd_R8ALXGUuXS9f991NPqKTdo.jpg?auto=webp&amp;s=f2897d1b03e10026903bd3e4320fd6d0fce563a4"
        },
        "permalink": "/r/movies/comments/1jn7k8q/texas_chainsaw_massacre_rights_up_for_grabs/"
    },
    {
        "id": "1jmv9ww",
        "author": "Impressive_Tea_7715",
        "title": "Just re-watched Wargames (I saw it at the theater when it came out, and countless times after)",
        "content": "Aside from always getting goose bumps and some tears at the end (\"Strange game. The only winning move is not to play\"), I also realized something I never thought about: the way Falken looks at David in the last several minutes of the movie is the way only a proud father looks at his son. So David is meant to be what Joshua could have been, hadn't he died prematurely. ",
        "upvotes": 41,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1jmv9ww/just_rewatched_wargames_i_saw_it_at_the_theater/"
    },
    {
        "id": "1jmyihe",
        "author": "clemoh",
        "title": "What movies do you rewatch because of exceptional Sound Design?",
        "content": "I find myself watching Saving Private Ryan from time to time almost exclusively for the opening 45 minutes because of how incredible it sounds in Surround. What other films have great Sound Design and what do you like about it? Are there certain scenes or shots that have more impact because of the consideration to the quality, accuracy, even Foley?",
        "upvotes": 20,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1jmyihe/what_movies_do_you_rewatch_because_of_exceptional/"
    },
    {
        "id": "1jmz4tn",
        "author": "ClaimNo7901",
        "title": "Kayako and Toshio in the background moments",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cDMycWQxaThqZmhkMWDWcL2uy0qkL4px9HqImV-6x_N8NrsAbBGkvtOdAnAW.png?auto=webp&amp;s=6ae0eff7eaae8f1ad529d85b0cc9d257c9f7b276"
        },
        "permalink": "/r/movies/comments/1jmz4tn/kayako_and_toshio_in_the_background_moments/"
    },
    {
        "id": "1jmlw9q",
        "author": "veganbell",
        "title": "Movies like 'The Man from Earth' (2007)?",
        "content": "I just finished watching The Man from Earth (2007) and absolutely loved it. It’s a low-budget film, incredibly dialogue-heavy, and almost the entire story unfolds in a single room (and with a cast I am not familiar with).\n\nYet, despite all that, it never once feels boring.  \n\nWhich got me curious—are there any other hidden gem movies like this?",
        "upvotes": 109,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1jmlw9q/movies_like_the_man_from_earth_2007/"
    },
    {
        "id": "1jn4s26",
        "author": "spencerisabella",
        "title": "ashley and halley in the florida project",
        "content": "just rewatched the florida project and i’ve seen halley get a lot of criticism for not punishing moonee for setting fire to the condos but ashley never tells halley what happened? do we think halley is just playing dumb or does she genuinely not know? and besides that why would ashley not tell her like i’m confused what the logic is there? i know this movie has been around for quite some time and maybe i’m just dumb and didn’t get it bc i’ve never seen anyone else talking about this but it’s just something i’ve been thinking about since rewatching and i’d like to hear everyone’s thoughts",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jn4s26/ashley_and_halley_in_the_florida_project/"
    },
    {
        "id": "1jmwpo0",
        "author": "All_Hale_sqwidward",
        "title": "Nocturnal animals still haunts me",
        "content": "I don't know if this is the right sub to post this, so I'm sorry of I'm violating any rules, but I figured I'll get the best advices from people who also saw it, and I hoped I'll find them in this sub. \n\nI watched this film like 2 years ago, and seriously, it still hunts me. It was worse then any horror film I ever watched, precisely because it had no ghosts or monsters or demons. It was purely the realty of the world we live in, portrayed in a haunting,  grotesque manner.\n\n It just keeps popping up in my thoughts. What the father went through, how the mother and child died, that highway scene... everything was so uncomfortable to watch. I keep imaging how it will feel to loose the people I love the most in such a cruel way. I keep imagining how the father felt, as he watched his family taken, how the mother and daughter felt, knowing they are going to die... \n\nAnd the scene were they find their bodies, just slumped together, naked and raped on some moth-eaten couch in a junk yard. Their lifeless eyes... it was horrible. \n\nI recognize the film is a masterpiece, but I so wish I never watched it.\n\n",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jmwpo0/nocturnal_animals_still_haunts_me/"
    },
    {
        "id": "1jn2egw",
        "author": "Elldyer88",
        "title": "What cartoon movie was this?",
        "content": "No idea why but for some reason Ive recently had a memory resurface of a cartoon movie I saw a few times as a really yoing kid and I can't for the life of me remember what it was called or what the overall plot was, just a particular scene.\n\nThe setting was aladdin-esque but the palace had some magic or something to it for protection until someone stole 3 golden orbs or something to turn the palace dark and stormy.\n\nI have no idea why I've remembered this recently but it's driving me insane that I can't figure out what it was. I think it released around that time the movie where the cartoon dinosaurs lived in modern times in NYC.\n\nVery random and obscure I know but if anyone remembers let me know please 😂",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1jn2egw/what_cartoon_movie_was_this/"
    },
    {
        "id": "1jlup5j",
        "author": "DemiFiendRSA",
        "title": "‘Legend of Zelda’ Film Sets March 2027 Theatrical Release From Sony Pictures",
        "content": "",
        "upvotes": 7053,
        "comments": 1472,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZLCaz_ITXP9ZzNJoILekFvAkAhTenar9JnKQBCn2O5g.jpg?auto=webp&amp;s=68f7a5649a14d32ed8ddbf3267b667ed279d0d69"
        },
        "permalink": "/r/movies/comments/1jlup5j/legend_of_zelda_film_sets_march_2027_theatrical/"
    },
    {
        "id": "1jm6n8e",
        "author": "Acrobatic-Put1998",
        "title": "Exit 8 game movie trailer",
        "content": "",
        "upvotes": 881,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/87zz6lbe4ire1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jm6n8e/exit_8_game_movie_trailer/"
    }
]