[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 41,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 14,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q6x6pd",
        "author": "superfroolous",
        "title": "I'm...so...done",
        "content": "Travel for work and this household thing is exhausting. Just venting like a child but good grief Netflix has literally gone from  hero when we started in 2007 to villain in 2026. Going outside to touch grass.",
        "upvotes": 84,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1q6x6pd/imsodone/"
    },
    {
        "id": "1q6m0fa",
        "author": "Stormin_333",
        "title": "Torture is the new gunfight in so many shows.",
        "content": "Why has torture become so prevalent in media in recent years?  It is constant.  Sometimes less graphic than other times, but every show eventually at least has somebody tied to a chair and punched over and over.  Some really lean in on it and get graphic.\n\nGross\n",
        "upvotes": 213,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1q6m0fa/torture_is_the_new_gunfight_in_so_many_shows/"
    },
    {
        "id": "1q6pv44",
        "author": "Thissuxxors",
        "title": "The Gabby Petito case - I really need to stop watching these crime docs",
        "content": "They're just so ridiculously sad, I asked myself why do I watch them. I said I would not watch another one after that Netflix documentary about that pos who wanted to leave his wife for another woman and offed his kids. That one really haunted me.\n\nI didn't think this one would get to me as much as it did. What a beautiful soul Gabby was. I honestly have no idea what she saw in that ugly pos. And her think she thought she was lucky that he wanted her was ludicrous, he is the one that was lucky to have her. I don't understand how you can do that to someone who loved you that much even when you were being a piece of shit that you are and she still wanted to spend her life with him.\n\nSorry, I have to vent. This was such a difficult watch.",
        "upvotes": 73,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1q6pv44/the_gabby_petito_case_i_really_need_to_stop/"
    },
    {
        "id": "1q6xmhu",
        "author": "michelob81",
        "title": "Members only Palm Beach",
        "content": "Watching the Palm Beach show and honestly I've never been so happy to be working class. Don't get me wrong I'd love to drive those cars and eat that food but I'd prefer to do it with human beings. Palm Beach looks like a luxurious corner of hell on earth. What a pack of flippin demons.",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1q6xmhu/members_only_palm_beach/"
    },
    {
        "id": "1q6vlbr",
        "author": "RiverRose91",
        "title": "Unlocked: A Jail Experiment Season 2",
        "content": "It's just come out and it has been wild. I could totally tell by episode 3 that Irish is a huge manipulator and sending Woody to do his dirty work. I agree stealing is a really big no no and the new guy should have maybe got punishment, but he was withdrawing and not in his right mind.\n\nAny kind of open pod situation even these mini pods can be rife with exploitation and theft, so I understand why it's such a big deal. Anyways.... I didn't see another post on season 2 for redditors to discuss, so here it is! ",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q6vlbr/unlocked_a_jail_experiment_season_2/"
    },
    {
        "id": "1q6sp89",
        "author": "CrochetEnthusiast9",
        "title": "Sean Combs Documentary",
        "content": "The amount of people dead in connection with P. Diddy is absolutely insane! \n50 months for all of that it's even more insane! \nThis guy has too much power! ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q6sp89/sean_combs_documentary/"
    },
    {
        "id": "1q6locr",
        "author": "Cohoney",
        "title": "Frieren is not for everyone?",
        "content": "Half of my friends and some of my family are not able to see nor search for Frieren on Netflix.\nI have contacted support, they only have excuses and no solutions..\n(I love the show, I can see it on my account)\n",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q6locr/frieren_is_not_for_everyone/"
    },
    {
        "id": "1q6ytix",
        "author": "Otherwise-Primary319",
        "title": "You’re meaning to tell me, that all the hype was legit just about the year preview?😂",
        "content": "That makes a ton of sense but I was expecting something larger I guess, not even just a stranger things secret episode but I guess I (and some others) just got a bit took far ahead of ourselves. They had been hinting towards todays date and I thought like a new series or something but I was dead wrong😂 Glad we get to see a preview for the year though ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6ytix/youre_meaning_to_tell_me_that_all_the_hype_was/"
    },
    {
        "id": "1q6y93t",
        "author": "Bulky-Farmer-201",
        "title": "Liar series review",
        "content": "Would you recommend liar series? Is it similar with run away by harlan coben that has multiple stressful unpredictable plot twists? Would like something similar to that series ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6y93t/liar_series_review/"
    },
    {
        "id": "1q6sizt",
        "author": "anonymous36758",
        "title": "dropping and starting new shows",
        "content": "i’m not sure how i used to binge shows one after another, nowadays i will start a show then start another and start another &amp; i end up having 20 currently watching shows. idk what to do. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q6sizt/dropping_and_starting_new_shows/"
    },
    {
        "id": "1q6w9t2",
        "author": "Salted_Caramel777",
        "title": "Binge worthy series &amp; show",
        "content": "please recommend me very very good show with a lot of twist, plot and mind blowing. maybe thriller/suspense\n\nfor shows &amp; movies i really like: all mike flanagan shows, all nolan movies, genres like that\n\nsomething that i will never get tired of clicking the next episode",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q6w9t2/binge_worthy_series_show/"
    },
    {
        "id": "1q63mfd",
        "author": "Extension-Fall-4286",
        "title": "A House of Dynamite",
        "content": "WTF is up with the ending?!!! Who the hell writes a screenplay that shows the same story through several characters point of view and builds to the climax for each viewpoint and then just says “ Fuck it, roll credits….?!!!!” No answers, no decision being made…..nothing!! I understand the concept of leaving an ending open for interpretation by the audience, and as much as I hated the way The Sopranos ended, it was obvious that they were leaving their options open for sequels or whatever, but to just build, build, build to an ending from every point of view with absolutely zero closure or at the very least, a final decision by the President whether or not to even respond to an imminent nuclear bombing of Chicago???? DISAPPOINTING!!!!\n\nSorry, just finished the movie and screamed at the screen and needed to vent to the masses of Reddit. I should get my emotions in check 😂😂😂\n\nHope you all just chose to watch some stand up comedy tonight and go to bed with humor on your brain!! 💯 ",
        "upvotes": 43,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1q63mfd/a_house_of_dynamite/"
    },
    {
        "id": "1q6ub1x",
        "author": "skullcat1",
        "title": "Nitpick: Does anyone get \"flash frames\" on their stream?",
        "content": "Resubscribed to Netflix after a break. Been loving catching up on my favorite franchises, recent film releases, and beloved comfort show (I Think You Should Leave, looking at you).\n\nOne quirk I'm having that I haven't seen before is that occasionally I'm getting what video editors call \"flash frames\". \n\nWatching fine for a while, and then there's one blink of a different scene, but it's gone before you can register it. Not like a cool Fight Club \"one frame of porn\", just some little gremlin in the stream. \n\nI've watched a bunch of movies and shows, so it's not particular to one encode/show/movie, it's definitely across the stream. \n\nFwiw, I'm watching through Fios and have top tier bandwidth. \n\nAgain this is a nit, just a quick \"blip\", but it keeps happening. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6ub1x/nitpick_does_anyone_get_flash_frames_on_their/"
    },
    {
        "id": "1q6swf8",
        "author": "NoEmployer9676",
        "title": "Anyone else have color instability ?",
        "content": "Sometimes when I watch Netflix, the color are weirdly changing during a scene, somekind of calibration problem\n\nI noticed it only happens when I am on a streaming plateform like Netflix or Disney +, not when I watch TV, no when I watch a blu ray or play video games \n\nAnd when it happens, I got the feeling it is only during Netflix originals like right now when I watch Stranger Things never in others shows like B99 or movies on the platforms \n\nDoes anyone else have that problem as well ? Where does it came from ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6swf8/anyone_else_have_color_instability/"
    },
    {
        "id": "1q6ipya",
        "author": "wannabejoanie",
        "title": "Anyone else having these issues in the android app?",
        "content": "I've been having this issue in my Netflix app on my android phone. My husband, who uses the same account on the same kind of phone, just a different profile, says he doesn't have this issue. \n\nIf I'm going between two or more shows, series or movies, (for example, there's a certain show I watch with my daughter together that's on my profile, but not on hers because she's got a kids profile, but sometimes I want do watch like, stranger things or something in between)\n\nEven if I've completely exited out of all apps, I'll select the second in line of \"recently watched\" and it won't take me to stranger things, it'll take me to like, an episode and a half back of the show i was watching with my kid. It's *so annoying* and as far as I know I have the most recent updates on all my systems and apps, this has gone on for long enough I've had multiple apps and systems updates. \n\nWe both have a galaxy s22+. He says he doesn't have this issue but it's almost constant for me. \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q6ipya/anyone_else_having_these_issues_in_the_android_app/"
    },
    {
        "id": "1q5j88c",
        "author": "FarScheme4636",
        "title": "Run Away - Harlan Coban - TERRIBLE",
        "content": "DONT READ UNTIL YOUVE FINISHED IT\n\nSorry but I keep searching for people’s opinion’s on this show and it’s always mostly positive - I’m so confused!! This was one of this worst series. First of all, why was the daughter not a suspect for the police as she was the last person who saw him dead? There was also NO chemistry between the detectives and that sex storyline was so unnecessary?! Also why would they drag out the whole storyline just to say the daughter killed Aaron?   And then reveal it was the mum? Cornelius said that a few episodes ago too! Also the music.. the acting.. it was TERRIBLE. I don’t understand how people thought this was good? 60K for a dealer to tell james nesbitt that his daughter was seen on the bus… WHY did the detectives not find out that info from the missing persons report?!? Did they even bother looking for her?!? Honestly I’m raging. The whole show was STUPID!!! Plus why does everyone have a gun in the UK!!!!!!! The percentage of gun violence in the UK is 5%.. FIVE PERCENT\n\nAND ANOTHER THING WHY DID THE PARENTS GO TO THE DRUG DEN AND THE MUM GET HERSELF SHOT IF SHE KNEW WHERE THE DAUGHTER WAS AND WHO KILLED AARON… it makes NO SENSE!!!!!!!",
        "upvotes": 177,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1q5j88c/run_away_harlan_coban_terrible/"
    },
    {
        "id": "1q6rq7n",
        "author": "TheListenerCanon",
        "title": "The comparison between Dark and Stranger Things!",
        "content": "So, so far, I've seen the first 5 episodes of Dark (eg. first half of S1), so please no spoilers outside of that. Or at the very least put the spoiler tags.\n\nThat being said, I so far think this it's better than ST at it's best (eg. S1) and maybe one of the best shows I've seen. I realize I need more to see but it's that good.   \n  \nHowever, I don't get the comparison. Outside of being sci-fi shows on Netflix, they're not the same thing. One is an arthouse-like TV show that's not meant to be appeal to wide audience. The other isn't, well at, least past S1. To me, it's like comparing a Tarkovsky movie to a  MCU movie!\n\nDoes anyone else feel that way?",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1q6rq7n/the_comparison_between_dark_and_stranger_things/"
    },
    {
        "id": "1q6kanj",
        "author": "hmmmindeed778",
        "title": "Has anyone else watched Absentia!",
        "content": "I’ve never heard anyone talk about it. While finding it fairly redundant and unrealistic I didn’t mind the show. Just curious as to what you all felt about it! ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1q6kanj/has_anyone_else_watched_absentia/"
    },
    {
        "id": "1q648ch",
        "author": "Glass-Sea9665",
        "title": "What is the best show on Netflix I should be watching?",
        "content": "I’ve watched some shows on Netflix, the best ones were definitely Breaking Bad, Prison break, Power etc…I saw a couple of episodes of Ozark but didn’t continue. At the moment I got on my list Vikings, Ozark, Peaky Blinders, Bloodline, Dexter, Top boy..\nI don’t know which one to pick, so I would need some recommendations ",
        "upvotes": 9,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1q648ch/what_is_the_best_show_on_netflix_i_should_be/"
    },
    {
        "id": "1q6h4eu",
        "author": "Practical_Event9278",
        "title": "Help, I can’t access Netflix on my Samsung TV",
        "content": "\nI’m having an issue with Netflix on my Samsung TV. The app opens and I can select my profile, but after that nothing works. I can’t click on any shows, menus, or navigate further. The screen seems frozen, but the TV remote itself works normally in other apps.\n\nI’ve already tried restarting the TV, reopening the Netflix app, and checking my internet connection, but the problem persists. Has anyone experienced something similar or knows how to fix this? Any help would be appreciated.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q6h4eu/help_i_cant_access_netflix_on_my_samsung_tv/"
    },
    {
        "id": "1q6qvd9",
        "author": "NickjuSkeith",
        "title": "Netflix asking for a second payment in order to enter the account.",
        "content": "I paid the monthly subscription on the 18th of December (directly through netflix) yet now I can't access my account in any device because apparently I have to pay... again.   \nIt has only been for a few days, I initially paid because the subscription did end, and after that I had service for about 2 weeks and a half.   \nDoes anyone know what to do in this case? I've tried uninstalling and reinstalling the app on TV, computer and phone but nothing changes. It doesn't reject the account but says I need to pay.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q6qvd9/netflix_asking_for_a_second_payment_in_order_to/"
    },
    {
        "id": "1q6gmy6",
        "author": "lydocia",
        "title": "Absentia season 1 was okay. Should I continue watching?",
        "content": "I didn't *really* like the season 1 ending, and the first episode of season 2 seems... forced? so far.\n\n**To anyone here who watched Absentia in full, is it worth continuing?**",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1q6gmy6/absentia_season_1_was_okay_should_i_continue/"
    },
    {
        "id": "1q5ze9x",
        "author": "BlundeRuss",
        "title": "Spoiler: Run Away - why does Paige’s mum take her husband to the estate looking for Paige?!",
        "content": "She knows who killed Aaron and she knows where Paige is. Seems ridiculous to end up in a drug dealer’s basement getting shot for no reason. Have I missed something? ",
        "upvotes": 11,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1q5ze9x/spoiler_run_away_why_does_paiges_mum_take_her/"
    },
    {
        "id": "1q612n3",
        "author": "Timewilltell755",
        "title": "I just couldn’t with the first episode of Run Away. Is it worth it?",
        "content": "\nFirst let’s talk about stupid decisions.  They have a daughter at home and a son in college but decide to go right to the crime scene and down to some hidden tunnel to meet a drug dealer to ask about there drug addicted daughter and risk getting killed?   In most cases you just don’t go visit a drug dealer and let them know you know he is a drug dealer and not get shot.    \n\nAnd on a shallow note all the flashback clips are annoying.  ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q612n3/i_just_couldnt_with_the_first_episode_of_run_away/"
    },
    {
        "id": "1q6bu2i",
        "author": "Spotter24o5",
        "title": "How do i watch ninjago in english from season 7 onwards it wont work?",
        "content": "I had season 1-6 in english and now it will just show german everywhere Prime video its the same just that the season there are also payed for and netflux has them free",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q6bu2i/how_do_i_watch_ninjago_in_english_from_season_7/"
    },
    {
        "id": "1q6izpe",
        "author": "IamWangHuning",
        "title": "When will Netflix fix their IPv6 region detection bug",
        "content": "Only displays Netflix original shows when using IPv6 network on one specific profile. Occurs once every 1 month and they will never fix it. I had this problem for over half a year and finally found the root cause. I turned off IPv6 on my router and it immediately resolved the problem. (I test tried disabling IPv6 on my desktop PC, while connecting to same home Wifi and the PC is displaying shows normally while the Apple TV is not, both connected to the same external internet IP)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q6izpe/when_will_netflix_fix_their_ipv6_region_detection/"
    },
    {
        "id": "1q5z88u",
        "author": "jordanthebard",
        "title": "Weird wording in the new Seven Dials Trailer description on Youtube",
        "content": "I just watched the new Seven Dials trailer on YouTube. In the description, it begins with \"In this timeless mystery by the re-invented Queen of Crime.\" Now, I could understand if it said something like \"A re-invention of the Queen of Crime's classic mystery.\" But, a re-invention of the queen of crime? Like, do they think there was some Christie 2.0 running around, writing mysteries? Or is it more likely Netflix has pushed its copywriters to use AI to generate descriptions, and this is the result?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5z88u/weird_wording_in_the_new_seven_dials_trailer/"
    },
    {
        "id": "1q5x97p",
        "author": "TheyCallMeBullet",
        "title": "In the Harlan Corbin series, Run Away, in episode 7 in the log cabin",
        "content": "“What’s Miss Marple here told him” that scene was filmed at the edge of Marple, is this an  unintentional Easter egg or coincidence? What are the odds they reference a detective while also filming in Marple/Marple Bridge",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q5x97p/in_the_harlan_corbin_series_run_away_in_episode_7/"
    }
]