[
    {
        "id": "1lodmvc",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Ed Begley Jr - Tuesday 7/1 at 4:00 PM ET - Actor in 'Best In Show', 'This Is Spinal Tap', 'Batman Forever', 'Strange Darling', 'Pineapple Express', 'St. Elsewhere', 'Living with Ed', 'A Mighty Wind', 'The Accidental Tourist', 'An Officer and a Gentlemen', and lots more.",
        "content": "",
        "upvotes": 346,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/so37fopfn3af1.png?auto=webp&amp;s=e6e0053339b0b42c40111f987317980cc542b36b"
        },
        "permalink": "/r/movies/comments/1lodmvc/amaqa_announcement_ed_begley_jr_tuesday_71_at_400/"
    },
    {
        "id": "1lol21t",
        "author": "SanderSo47",
        "title": "June 27-29 Box Office Recap – 'F1' opens with a pretty great $146M worldwide, the biggest debut for Apple. However, 'M3GAN 2.0' underwhelms, collapsing 66% from the original. '28 Years Later' passes $100M worldwide, but it collapses 67% domestically.",
        "content": "https://preview.redd.it/qcksu3ur25af1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=af4217769c08e8330668d85d3bda65242e65e3de\n\nPassing all projections, ***F1*** over-performed with over $140 million worldwide, easily becoming Apple's biggest ever debut at the box office. But the weekend's other newcomer, ***M3GAN 2.0***, had an incredibly disappointing debut, achieving just one third of the original's debut.\n\nThe Top 10 earned a combined $122.7 million this weekend. That's down 16.5% from last year, when ***Inside Out 2*** held the top spot from ***A Quiet Place: Day One*** and ***Horizon: An American Saga – Chapter 1***.\n\nDebuting on #1, Warner Bros/Apple's ***F1*** earned a pretty good $57 million from 3,661 theaters. That's easily Apple's biggest debut at the box office, more than doubling the debuts of ***Killers of the Flower Moon*** ($23.2 million) and ***Napoleon*** ($20.6 million). It's also Brad Pitt's second biggest debut as leading man, just behind ***World War Z*** ($66.4 million).\n\nHow did it get here when other Apple films couldn't open that high? Simply put, it's a film that emphasized what everyone wants in a blockbuster, especially car racing: high-octane racing sequences. It didn't matter that the story is very by-the-numbers and one that you've seen before. You're here for those sequences, and the marketing has done a very great job in getting audiences interested. And given what director Joseph Kosinski achieved with ***Top Gun: Maverick***, looks like he nailed that kind of action.\n\nWB and Apple mounted a very extensive marketing campaign, including releasing the very first trailer one year ago. Among the tactics included multiple sponsorships from famous brands (which helped the film recover $40 million already), and appearances in real-life venues to promote it. They also highlighted the use of IMAX, and it looks like it worked; IMAX contributed to $12.8 million of the weekend (23%), while all IMAX and PLF screens amounted to 58% of the weekend's gross. Along with some pretty great reviews (83% on RT), audiences were ready to experience Formula One like never before.\n\nAccording to Warner Bros., 62% of the audience was male, and 53% was 35 and over. Something interesting: while the film was aimed towards older audiences, its biggest demo turned out to be Gen Z; 29% of the audience was 13-24. Considering there's always multiple articles on how young audiences aren't interested in movies, this is a very promising stat.\n\nAudiences gave ***F1*** a great \"A\" on CinemaScore, which indicates word of mouth will be quite strong. No doubt, there's impact from July blockbusters coming up, but ***F1*** could hold its own against them. For example, in a shock, the film actually has two weeks of IMAX access, taking them all from ***Jurassic World Rebirth***. For now, ***F1*** should finish its race with $165 million domestically. And it could go higher.\n\n***How to Train Your Dragon*** dropped 46%, adding $19.5 million this weekend. Considering this and last week's drop, it doesn't look like the film is holding as well as it should. The film has crossed $200 million domestically, and it will finish with around $250 million.\n\nIn third place, Pixar's ***Elio*** added $10.4 million this weekend. That's a very weak 50% drop, which is one of Pixar's worst. In contrast, ***Elemental*** dropped just 37.7% on its second weekend. Animated films usually drop 40% or less, which means ***Elio*** is not connecting with audiences despite the positive word of mouth. Through 10 days, the film has earned a poor $41.9 million domestically. With more competition on its way, it's unlikely it can hold to screens for a long time. There's a strong chance it finishes below ***Onward*** ($61 million) and becomes the lowest grossing Pixar title if it keeps dropping like this.\n\nDebuting on the fourth spot (crazy, right?), ***M3GAN 2.0*** debuted with a very disappointing $10.2 million in 3,122 theaters. That's a horrible 66% drop from the original ***M3GAN*** ($30.4 million), which is one of the steepest for a sequel. Hell, the opening weekend is even below the original's opening day. And it somehow managed to open below Blumhouse's recent flop ***Wolf Man*** ($10.8 million).\n\nThis is an astonishingly bad debut. After all, Blumhouse increased the budget from $12 million to $25 million for the sequel, and this is all it could do? Not to mention a very extensive marketing campaign; it even had a Super Bowl slot. But ***M3GAN*** was one of Blumhouse's biggest hits, how could the sequel fall this much?\n\nTiming is everything, and while the sequel arrived just 2 years after the original, moving it from an empty January to the competitive June was probably not a good idea. It had to compete with some big blockbusters, and horror audiences were probably saving money for ***28 Years Later***. Well, \"horror\", cause it's unlikely ***M3GAN*** falls in the same category as ***Years*** or ***Final Destination: Bloodlines*** or the upcoming ***I Know What You Did Last Summer***. Why the asterisk?\n\nThe original ***M3GAN*** was sold as a horror, but with some campy added, and that contributed to its success at the box office and social media. But the sequel chose to go on an entirely different route: it's a sci-fi action comedy. It leans on how stupid and ridiculous this whole thing is, pretty much dropping the horror. Now, it's not rare for horror films to shift genres within sequels (***Alien*** to ***Aliens*** is a pretty good example). But it's still not as common. While one can praise that they didn't rehash the same plot as the original, the film also lost horror fans who weren't on board with the film's new tone. After all, the tagline is \"that bitch vs. that bitch\". The original film was also a hit with critics (93% on RT), while the sequel earned polarizing reactions (58% on RT).\n\nIt also truly feels like Blumhouse's brand has taken a dive in the past year. 2024 was quite rough; a few successes, but not a single film reached $100 million at the box office. But 2025 was even worse: ***Wolf Man*** and ***The Woman in the Yard*** flopped at the box office, which was simply unbelievable considering their very low budgets. And ***Drop*** only broke even at best. And now the sequel to one of its biggest hits was pretty much rejected. Once the kings of profitable horror, it looks like audiences are losing interest when the Blumhouse card shows up.\n\nAccording to Universal, 53% of the audience was female, and 68% was 25 and over. They gave it an okay \"B+\" on CinemaScore, which is actually higher than the original ***M3GAN*** (\"B\"). An explanation for that may be that those uninterested in the tone shift skipped the film; if you bought a ticket for the sequel, you knew exactly what you were getting. It's very unlikely ***M3GAN 2.0*** holds well, and it's pretty much guaranteed to finish below the original's opening weekend. Right now, a $25 million total is likely. Blumhouse really needs to consider what's going on.\n\nIn fifth place, ***28 Years Later*** earned $9.7 million this weekend. That's a horrible 67% drop from last week, although it's not entirely surprising, considering the film's mixed word of mouth. Through 10 days, the film has amassed $50.4 million, already passing all the previous films in the franchise, but it looks like it won't make it much further than $60 million domestically. Its legs are proving to be very, very short.\n\n***Lilo &amp; Stitch*** eased just 29% and grossed $6.8 million. The film's domestic total stands at $400 million, and it's set to finish with around $415-$420 million domestically.\n\n***Mission: Impossible – The Final Reckoning*** eased 36% and added $4.1 million this weekend. The film has amassed $186 million so far.\n\n***Materialists*** had quite a rough drop on its third weekend. It dropped 53%, earning $2.9 million. The film has crossed $30 million domestically, and it has a few more millions left.\n\nIt doesn't look like ***Ballerina*** will ever have a sub 50% drop. The film once again fell 51%, earning just $2.1 million. It has earned a meager $55 million, and getting to $60 million will be a struggle.\n\nRounding out the Top 10 is another disappointment, ***Karate Kid: Legends***. The film once again fell a rough 59% and made just $960,702 this weekend. It has earned $51.5 million, and it doesn't have much gas left in the tank.\n\n***Final Destination: Bloodlines*** dropped 49% and added $956,014. That takes its domestic total to $136.7 million.\n\n***The Phoenician Scheme*** appears like it's disappearing quickly. It dropped 52% for a $692,260 weekend. With $17.8 million, it's struggling to hit the $20 million milestone.\n\nNeon's ***The Life of Chuck*** is also nearing the end of its run. It collapsed a poor 62% and made just $379,676 this weekend. With a mediocre $5.6 million so far, it's capping out with a little over $6 million.\n\n#**OVERSEAS**\n\n***F1*** may have over-performed domestically, but the real money for this film is outside America.\n\n***F1*** debuted with a great $146 million worldwide, which is Brad Pitt's biggest ever debut. The best debuts were in the UK ($9.2M), China ($9M), Mexico ($6.7M), France ($5.4M) Australia ($5M), South Korea ($3.7M), Germany ($3.4M), India ($2.8M), Japan ($2.8M), UAE ($2.7M), Italy ($2.4M), and Spain ($2.3M). It remains to be seen how the upcoming blockbusters could impact its performance, but for now, the film definitely should hit $400 million worldwide. Apple should definitely be pleased with the results, and you can bet they will now release Joseph Kosinski's UFO thriller in theaters now. It feels pretty much guaranteed.\n\n***How to Train Your Dragon*** added $32.7 million overseas, for a $456 million worldwide total. The best markets are China ($31.1M), Mexico ($30M), the UK ($21.8M), Brazil ($15M) and South Korea ($11.4M). Like the domestic market, the drops aren't as strong as expected. It should still hit $600 million worldwide, but it's still not guaranteed.\n\n***28 Years Later*** added $13.7 million overseas, taking its worldwide total to $103.1 million. That's a rough drop, but at least it's better than its domestic freefall. It's already the highest grossing film in the franchise, although it definitely feels like it's dropping faster than expected. It's very unlikely it can get to $150 million worldwide, raising so many questions over whatever Sony plans to do with ***The Bone Temple*** and the third film in this trilogy.\n\n***Elio*** continues showing no signs of life, as it earned just $11.2 million overseas, for an anemic $72 million worldwide total. The best markets are South Korea ($3M), France ($2.9M), UK ($2.9M), China ($2.7M) and Mexico ($2.3M), all of which are very weak numbers. There's not many major markets left, so unless Japan pulls a miracle run in August, this film could miss $150 million worldwide. Which means it will go down as one of the biggest flops of the year. Damn.\n\nBut ***M3GAN 2.0*** had it even worse outside America. The film crashed with a poor $6.8 million overseas, for a very weak $17 million worldwide debut. It had a very soft debut in Mexico ($1.2M), followed by a non-presence in practically every other market. Even though the film cost $25 million, the rule of thumb doesn't work with low-budget films in Blumhouse, given those have higher expenses in marketing. Given that the film will struggle in hitting $50 million worldwide, ***M3GAN 2.0*** is officially a flop.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nIt's dino time.\n\nYep, ***Jurassic World Rebirth*** is making its way to theaters (on Wednesday, not Friday). With a new cast (Scarlett Johansson, Mahershala Ali, Jonathan Bailey, Rupert Friend, Manuel Garcia-Rulfo, and Ed Skrein), it hopes to continue the winning streak that this franchise achieved. After all, despite their reputation, all the ***Jurassic World*** films hit $1 billion. But it's also true that there's a downward trajectory ($1.6B &gt; $1.3B &gt; $1.0B), and it's very likely this film will continue the drops. Reviews are quite mediocre so far, and there's some big competition on theaters. But then again, never underestimate the power of dinosaurs.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 127,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/457vqSbsU8YuKcSW1_EFh-rf-tkmmnbYUtedhj4Ih5w.png?auto=webp&amp;s=42a950c24c19f3b348512f23d49dbdd4cd277590"
        },
        "permalink": "/r/movies/comments/1lol21t/june_2729_box_office_recap_f1_opens_with_a_pretty/"
    },
    {
        "id": "1loaxem",
        "author": "MoviesMod",
        "title": "Project Hail Mary - Official Trailer (fair warning, it reveals way too much according to a lot of users)",
        "content": "",
        "upvotes": 5037,
        "comments": 1049,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DNij_KXMqEq44ilvf3N8C0zHxUzmORjt98hrEkIM6g.jpeg?auto=webp&amp;s=4662b771d0351cdc0e96e724924456ae417459fa"
        },
        "permalink": "/r/movies/comments/1loaxem/project_hail_mary_official_trailer_fair_warning/"
    },
    {
        "id": "1lojvuk",
        "author": "MarvelsGrantMan136",
        "title": "Inside Elio’s Catastrophic Path: America Ferrera’s Exit, Director Change and Erasure of Queer Themes",
        "content": "",
        "upvotes": 1454,
        "comments": 504,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/43Wj_tT9XrXaV_sBCJQVIJ9Syt6Wt7ZG__uwUqTDKq0.jpeg?auto=webp&amp;s=12c89ed806b56ef01142910a07b77e9b60355733"
        },
        "permalink": "/r/movies/comments/1lojvuk/inside_elios_catastrophic_path_america_ferreras/"
    },
    {
        "id": "1lo5w4k",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Project Hail Mary'",
        "content": "",
        "upvotes": 8326,
        "comments": 1036,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a6spfz2u22af1.jpeg?auto=webp&amp;s=1a9b30b80de57fa2a56b852b3b4e47b0c2cda5b8"
        },
        "permalink": "/r/movies/comments/1lo5w4k/new_poster_for_project_hail_mary/"
    },
    {
        "id": "1loh2lq",
        "author": "NoCulture3505",
        "title": "Sinners | Black American Sign Language Official Trailer | Max",
        "content": "",
        "upvotes": 1645,
        "comments": 360,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K9iJj6I7PL1UJB4nrPD9lo0aJyufpHirOuci3Sn65tA.jpeg?auto=webp&amp;s=0385ca7a973cfa1b532aac7ab89b3bc829c72a72"
        },
        "permalink": "/r/movies/comments/1loh2lq/sinners_black_american_sign_language_official/"
    },
    {
        "id": "1lonyu9",
        "author": "SwarleymonLives",
        "title": "What weird thing did you learn from a movie?",
        "content": "So I was just shaving and realized I mostly learned to shave from a scene in Lethal Weapon 3. Neither my dad or step-dad really needed to shave as my hairy mess of a face comes entirely from my mom's side of the family.\n\n\nSo, Danny Glover teaching his movie kid (who I share a name with) pretty much is how I learned to shave. Which I think is bizarre. \n\n\nSo what stuff have you learned from a movie that you think is an odd source of knowledge?",
        "upvotes": 437,
        "comments": 419,
        "media": null,
        "permalink": "/r/movies/comments/1lonyu9/what_weird_thing_did_you_learn_from_a_movie/"
    },
    {
        "id": "1lo2i14",
        "author": "PyroxCrymson",
        "title": "AMC Theaters Now Warns Moviegoers About Lengthy Previews Before Films Start",
        "content": "",
        "upvotes": 8950,
        "comments": 1580,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iy6ZO_n6_gn008gOu0l_BgRvDVnoEAs9jEpPUUli6es.jpeg?auto=webp&amp;s=83d2664e5c58babcb3aff19afc1ff7c29ddde0ed"
        },
        "permalink": "/r/movies/comments/1lo2i14/amc_theaters_now_warns_moviegoers_about_lengthy/"
    },
    {
        "id": "1lo9v7t",
        "author": "MarvelsGrantMan136",
        "title": "New Image from Dan Trachtenberg's 'Predator: Badlands'",
        "content": "",
        "upvotes": 2301,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bmt9x1ilx2af1.jpeg?auto=webp&amp;s=aa6c289df8c400721eb9ce9ff6f5b3d7936e15b7"
        },
        "permalink": "/r/movies/comments/1lo9v7t/new_image_from_dan_trachtenbergs_predator_badlands/"
    },
    {
        "id": "1lo9xf4",
        "author": "JannTosh70",
        "title": "'Apollo 13' at 30: the space movie where scientists have the right stuff too",
        "content": "",
        "upvotes": 2195,
        "comments": 159,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3fRSFHYZVYBgKABUUncvPXfLZ18K2bPvtFKSNaAnWnQ.jpeg?auto=webp&amp;s=243334e68f9c799b5fe32678082469f0ac40941b"
        },
        "permalink": "/r/movies/comments/1lo9xf4/apollo_13_at_30_the_space_movie_where_scientists/"
    },
    {
        "id": "1lodk5z",
        "author": "Accomplished-Law-652",
        "title": "Who's an actor you thought had stopped working but in fact they're just doing a lot of work that you never see?",
        "content": "I thought Alicia Silverstone had mostly dropped out of acting, whether by choice or because she couldn't find work. My daughter has recently entered the tween stage and I've come to find out that Silverstone plays the mom in basically every tween IP- Diary of a Wimpy Kid, Babysitter's Club, and probably others. She's working plenty, just in places I would never see. There must be several examples of this sort of thing.",
        "upvotes": 1370,
        "comments": 468,
        "media": null,
        "permalink": "/r/movies/comments/1lodk5z/whos_an_actor_you_thought_had_stopped_working_but/"
    },
    {
        "id": "1lorp63",
        "author": "BunyipPouch",
        "title": "Poster for the 35th Anniversary Theatrical Re-Release of 1990's 'Teenage Mutant Ninja Turtles' - Will include a featurette that has never-before-seen footage, extended deleted scenes, director commentary, and behind-the-scenes extras.",
        "content": "",
        "upvotes": 210,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g3ym8dj2o6af1.jpeg?auto=webp&amp;s=429a6c02e6f048d787ffe7b8bbf326d6972b435c"
        },
        "permalink": "/r/movies/comments/1lorp63/poster_for_the_35th_anniversary_theatrical/"
    },
    {
        "id": "1lool8f",
        "author": "movie5short",
        "title": "Poster for Dark Nuns (2025)",
        "content": "",
        "upvotes": 313,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7goojnh0w5af1.jpeg?auto=webp&amp;s=8f1e5e7187347e39cae34a66bf04f7f7aace087b"
        },
        "permalink": "/r/movies/comments/1lool8f/poster_for_dark_nuns_2025/"
    },
    {
        "id": "1lojck2",
        "author": "BoFlix",
        "title": "Nick Offerman on why he \"had to\" do 'SOVEREIGN' after reading the script",
        "content": "",
        "upvotes": 573,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/t5kjz-n1AS5c5FoWu4ljDXWRNIlr3IuJtV0aF9vsfsc.jpeg?auto=webp&amp;s=6c90d8de69ccf3e88f988f0d5c015b4caffdec68"
        },
        "permalink": "/r/movies/comments/1lojck2/nick_offerman_on_why_he_had_to_do_sovereign_after/"
    },
    {
        "id": "1lobb20",
        "author": "SanderSo47",
        "title": "'Jurassic World Rebirth' Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/jurassic_world_rebirth): 56% (89 reviews) with 6.00 in average rating\n\n[Metacritic](https://www.metacritic.com/movie/jurassic-world-rebirth/): 53/100 (38 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; The blend of physical locations with sets and digital imagery is seamless and the CG work on the creatures is first-rate, notably so in the scary climactic stretch when the lumbering D. Rex joins the fray. Edwards clearly is a devoted Spielberg fan, embedding subtle homages throughout, notably in the open water sequences that recall Jaws. Jurassic World Rebirth is unlikely to top anyone’s ranked franchise list. But longtime fans (count me among them) should have a blast.\n\n-[David Rooney, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/jurassic-world-rebirth-review-scarlett-johansson-1236302373/)\n\n&gt; Scenes between Ella and her potentially ill-advised pet, along with tender moments involving several other species, introduce a surprising counter-argument to the earlier “Jurassic” movies: namely, that they have a right to exist. But entertaining as it can be at times, stripped of the silliness that tainted the second trilogy, “Rebirth” doesn’t necessarily make the same case for itself. The movie offers an updated version of the same basic ride Spielberg offered 32 years earlier, and yet, it hardly feels essential to the series’ overall mythology, nor does it signal where the franchise could be headed.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/jurassic-world-rebirth-review-1236443872/)\n\n&gt; Needless to say, “Rebirth” doesn’t do itself any favors by so frequently harkening back to the original. Bad as some of the previous sequels have been, none of them have been so eager to measure themselves against Spielberg’s masterpiece. Nothing in this movie is quite as maddening as the second trilogy’s attempt to make audiences invest in a specific Velociraptor (though Edwards half-heartedly tries to sweeten us on an adorable baby Aquilops named Dolores), but the extent to which this franchise is just fending off its own extinction has never been more obvious than it is in during the “Rebirth” sequence that pays homage to the kitchen encounter from the first movie. The “Jurassic” sequels were bad enough when they made an effort to evolve — they’re even less worth seeing now that they already come pre-fossilized.\n\n-[David Ehrlich, IndieWire](https://www.indiewire.com/criticism/movies/jurassic-world-rebirth-review-1235135932/): C–\n\n&gt; There’s a disappointing amount of “same old thing” to Jurassic World Rebirth. Scarlett Johansson, Mahershala Ali, and the rest of the cast are intriguing and sympathetic throughout, but Gareth Edwards doesn’t quite recapture his signature flair for grand-scale visuals nor does David Koepp find the magic of his original Jurassic Park screenplay, opting to follow that movie’s structure as more of a remix than a rebirth.\n\n-[Clint Gage, IGN](https://www.ign.com/articles/jurassic-world-rebirth-review-scarlett-johansson-mahershala-ali): 5.0 out of 10 \"mediocre\"\n\n&gt; So why the hell does this feel so generic, so by-the-numbers, so instantly forgettable? The whole thing resembles the blockbuster version of a readymade, assembled from various, recognizable spare parts and elevated only by virtue of its name. Fans and completists may still get giddy over a ScarJo vs. Dinos showdown, and you should never underestimate the power of giant, toothy jaws chomping down on poor, hapless humans. But long before the big showstopping climax, you’ll start to understand why the movie’s jaded public became bored by what once seemed thrilling and unique. Subtitling this Rebirth seems to have been an act of extreme optimism.\n\n-[David Fear, Rolling Stone](https://www.rollingstone.com/tv-movies/tv-movie-reviews/jurassic-world-rebirth-review-scarlett-johansson-1235372435/)\n\n&gt; This new Jurassic adventure isn’t doing anything so very different from the earlier successful models, perhaps, and I could have done without its outrageous brand synergy product placement for certain brands of chocolate bar. But it feels relaxed and sure-footed in its Spielberg pastiche, its big dino-jeopardy moments and its deployment of thrills and laughs. Maybe the series can’t and shouldn’t go on for ever: we need new and original ideas. This one would be great to go out on.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/jun/30/jurassic-world-rebirth-review-scarlett-johansson-runs-show-as-near-extinct-franchise-roars-back-to-life): 4/5\n\n&gt; “Jurassic” has to live with setting a high bar, of course — the original film revolutionized the industry, a status that “Rebirth” is all too aware of, as seen in its meta theme of dinosaurs becoming old news to a jaded populace. Yet just because cheeseburgers are now available anywhere doesn’t mean that they can’t be damn tasty. “Jurassic Park Rebirth” is just a well made cheeseburger, and whether that’s filling and interesting enough is up to your own appetite. \n\n-[Bill Bria, The Wrap](https://www.thewrap.com/jurassic-world-rebirth-review/)\n\n&gt; “Science is for all of us, not just for some of us,” Dr. Loomis tells Zora, advocating for their work to have a more noble purpose than lining their pockets. That aspirational notion has always sat at the heart of the Jurassic Park films. Jurassic Park Rebirth is one of the more successful and satisfying entries in the franchise precisely because it, uh, finds a way to keep Loomis’ mantra close, foregrounding the film’s sense of wonder above a mere blatant cash grab.\n\n-[Maureen Lee Lenker, Entertainment Weekly](https://ew.com/jurassic-park-rebirth-review-scarlett-johansson-jonathan-bailey-help-franchise-roar-back-11763036): B+\n\n&gt; It might sound like a challenge to believe these humans would sign up to visit a forbidden jungle for guaranteed encounters with truly frightening and gigantic creatures out of another time in order to essentially get blood samples, but if you are game to go with that premise a good time will be had for all. If there is to be an eighth installment, count me in.\n\n-[Pete Hammond, Deadline](https://deadline.com/2025/06/jurassic-world-rebirth-review-scarlett-johansson-spielberg-1236445462/)\n\n&gt; This is a monster-adventure movie, with passages that recall Jaws and King Kong; maybe not the most original influences, but certainly not shabby ones. In its fusion of Edwards’ craft with characters who aren’t thunderously stupid or unlikable, this is the best Jurassic movie in ages – in part because it works so comfortably as an ooh/ahh/run/scream monster movie.\n\n-[Paste](https://www.pastemagazine.com/movies/gareth-edwards/jurassic-world-rebirth-scarlett-johansson-mahershala-ali-gareth-edwards-dinosaurs): 7.0\n\n&gt; “Jurassic World: Rebirth” is a very imperfect film. On one hand, it seems to be recycling every successful character trope and set piece from the franchise, which may be considered lazy and uninspiring, but it is still captivating. Even in its faults, the objective of a “Jurassic Park” film is to scare, thrill, and amaze its audience, and this film does that in its set pieces.\n\n-[Lauren LaMagna, Next Best Picture](https://nextbestpicture.com/jurassic-world-rebirth/)\n\n&gt; There are worse exercises in IP-extension out there in the marketplace. But it is hard to imagine what possible basis there could be for an eighth Jurassic film. We’ve overused the extra-island trope; we’ve done dinos invading the mainland a couple times now. We’ve seen enough long necks poking up from the grass. We’ve seen too many T-rexes thundering after their prey. Now even the oceans have been exhausted. I suppose they could send some dinosaurs to space next time, where no one can hear them roar. But that wouldn’t really make much of a difference: the sound barely registers anymore.\n\n-[Richard Lawson, Vanity Fair](https://www.vanityfair.com/hollywood/story/jurassic-world-rebirth-review)\n\n&gt; To his credit, Edwards immediately injects \"Rebirth\" with a sense of stakes and tension that the entirety of the previous trilogy struggled to depict. But every time the plot kicks in again and writer David Koepp's script goes through the motions of a standard \"Jurassic\" movie, those dizzying peaks soon begin to flatten out into overgrown valleys. For those simply hoping for a watchable movie on the heels of the disastrous \"Dominion,\" your wish has been granted with a safe rehash punctuated by a handful of genuine thrills. For everyone else curious about whether this was the ticket to teaching old dinos new tricks? The inherent limits of the \"Jurassic\" IP are as glaring as ever.\n\n-[Jeremy Mathai, /FILM](https://www.slashfilm.com/1899528/jurassic-world-rebirth-movie-review/): 5.5/10\n\n&gt; And there are some sporadic joys here in the clever sight gags, the sleight of hand, the bait and switch. These moments remind us of the mindless summertime excitement the “Jurassic” movies have long provided, albeit with diminishing returns. But that giant footprint just isn’t as imposing as it used to be. \n\n-[Christy Lemire, RogerEbert.com](https://www.rogerebert.com/reviews/jurassic-world-rebirth-scarlett-johannsson-movie-review-2025): 2/4\n\n&gt; Worst of all, this hoary adventure story is rendered soulless by the blatant product placement: Henry crunching on Altoids, Reuben scolding Xavier for eating too many of their bags of Doritos, and Isabella feeding Twizzlers to her little dino friend. After a while, you may wonder if the entire film was subsidized by the snack food industry. Rebirth even goes so far as setting its final action scene in a long-abandoned but still fully stocked convenience store. How meta: a franchise trying to distract us from how past its sell-by date it is with expired potato chips.\n\n-[Derek Smith, Slant Magazine](https://www.slantmagazine.com/film/jurassic-world-rebirth-review-scarlett-johansson-jonathan-bailey-gareth-edwards/): 1.5/4\n\n&gt; Audiences may not have run out of enthusiasm for what the Jurassic Worlds are selling, or at least they haven’t yet, but the people tasked with making them sure are out of ideas.\n\n-[Alison Willmore, Vulture](https://www.vulture.com/article/review-jurassic-world-rebirth-makes-dinosaur-carnage-dull.html) \n\n____________________________________________________________________________________________\n\n**PLOT**\n\nFive years after the events of *Jurassic World Dominion*, the planet's ecology has proven largely inhospitable to dinosaurs. Those remaining exist in isolated equatorial environments with climates resembling the one in which they once thrived. The three most colossal creatures within that tropical biosphere hold the key to a drug that will bring miraculous life-saving benefits to humankind.\n\n**DIRECTOR** \n\nGareth Edwards\n\n**WRITER**\n\nDavid Koepp\n\n**MUSIC**\n\nAlexandre Desplat\n\n**CINEMATOGRAPHY**\n\nJohn Mathieson\n\n**EDITOR**\n\nJabez Olssen\n\n**RELEASE DATE** \n\nJuly 2, 2025\n\n**RUNTIME**\n\n133 minutes\n\n**BUDGET**\n\n$180 million\n\n**STARRING**\n\n- Scarlett Johansson as Zora Bennett\n\n- Mahershala Ali as Duncan Kincaid\n\n- Jonathan Bailey as Dr. Henry Loomis\n\n- Rupert Friend as Martin Krebs\n\n- Manuel Garcia-Rulfo as Reuben Delgado\n\n- Luna Blaise as Teresa Delgado\n\n- David Iacono as Xavier Dobbs\n\n- Audrina Miranda as Isabella Delgado\n\n- Ed Skrein as Bobby Atwater",
        "upvotes": 1048,
        "comments": 628,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gJ1x-u_SQ__tWNxJIYzoqiuQA51YyYQ6LLJYtAiGlu0.jpeg?auto=webp&amp;s=7b78496758cbb3f559b03c04a7e149def1b95024"
        },
        "permalink": "/r/movies/comments/1lobb20/jurassic_world_rebirth_review_thread/"
    },
    {
        "id": "1lo8ehb",
        "author": "NoCulture3505",
        "title": "Teenage Mutant Ninja Turtles 35th Anniversary Re-Release Official Trailer",
        "content": "",
        "upvotes": 1267,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mSsfiQehATrYBUxjQqMVewFwSHhTlXi7aAUNOu1qReY.jpeg?auto=webp&amp;s=a7737e187e7af5ca60e08962b5f1945cd0fefd03"
        },
        "permalink": "/r/movies/comments/1lo8ehb/teenage_mutant_ninja_turtles_35th_anniversary/"
    },
    {
        "id": "1lodoa0",
        "author": "exophrine",
        "title": "The Importance of Being Ernest | Jim Varney documentary",
        "content": "",
        "upvotes": 623,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IaFHqu1qouyvulElnbZLlRjezjh-h3a0V9WCs5NSzN4.jpeg?auto=webp&amp;s=e380843b0c340036194d3df29dc8dedd46591ca8"
        },
        "permalink": "/r/movies/comments/1lodoa0/the_importance_of_being_ernest_jim_varney/"
    },
    {
        "id": "1lov4t4",
        "author": "heromat21",
        "title": "What’s a movie you thought would flop but ended up being a massive hit?",
        "content": "I’ve been thinking about how some films totally defy expectations. For me, I was sure *The Lego Movie* would bomb, but it turned into a huge deal. I can't bet against any movie now. \n\nWhat’s a movie you bet against that surprised you with its success? Bonus points if you can figure out why it worked, although it did!",
        "upvotes": 39,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1lov4t4/whats_a_movie_you_thought_would_flop_but_ended_up/"
    },
    {
        "id": "1lobero",
        "author": "SanderSo47",
        "title": "‘The Devil Wears Prada 2’: Kenneth Branagh Joins With Meryl Streep, Anne Hathaway, Emily Blunt &amp; Stanley Tucci Officially Back",
        "content": "",
        "upvotes": 557,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nHFZJ3Qz7_gpyBbAYZ3RkByhnyGKLvhW1jDEB_BAEU4.jpeg?auto=webp&amp;s=adc693cf574181c911b36c06180658cc7e9b7140"
        },
        "permalink": "/r/movies/comments/1lobero/the_devil_wears_prada_2_kenneth_branagh_joins/"
    },
    {
        "id": "1lobb7a",
        "author": "ProfessionalLevel908",
        "title": "\"elephant 2003\" has the saddest death in a film ive ever seen.",
        "content": "(heavy spoilers) elephant 2003 is a thriller drama that centers around the 1999 columbine shooting. the film follows the victims and perpetrators lives the day before and during the day of the shooting. i dont know why but a character that really stuck with me was michelle. shes shy and barely talks to anyone during the whole movie, shes a good normal person like every other victim in the film. shes the first one to get shot when alex and eric storm the bulding with guns. she hears a shotgun being loaded behind her she turns around and says: \"Hey you gu-\" and gets cut off by a rifle blast and her death is the only reason why people even know she ever existed as she was a person in real life aswell. the film horrifyingly shows how anyones life can be cutoff in a snap of fingers for no reason at all. the second i saw them eric and alex enter the library my stomach dropped becouse i realized every character expect john is gonna die, including her. its fucking depressing.",
        "upvotes": 482,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1lobb7a/elephant_2003_has_the_saddest_death_in_a_film_ive/"
    },
    {
        "id": "1lo8dfl",
        "author": "DemiFiendRSA",
        "title": "Teenage Mutant Ninja Turtles: The Original Movie to Get 35th Anniversary Theatrical Re-Release on August 17 and 20",
        "content": "",
        "upvotes": 630,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lRUZLZtibw110g2WLoZvVaUy71RkHGjc3M2MOdL2yYw.jpeg?auto=webp&amp;s=7652d8a6a81ae0f7c0bc15e505ec4340534f8f16"
        },
        "permalink": "/r/movies/comments/1lo8dfl/teenage_mutant_ninja_turtles_the_original_movie/"
    },
    {
        "id": "1lolpii",
        "author": "ilovefantasybookss",
        "title": "A forgotten film with phenomenal cast: Stardust",
        "content": "\nSo fantastical, whimsical and beautiful to watch! The entire case was great, setting was a beautiful and loved the unique story. Wish they still made movies like this! Michelle Pfeiffer was so gorgeous and Robert De Niro was great! It had over a 60 million budget, but its box office wasn’t that great and I never hear anyone talk about it.",
        "upvotes": 102,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1lolpii/a_forgotten_film_with_phenomenal_cast_stardust/"
    },
    {
        "id": "1lotq45",
        "author": "tokwamann",
        "title": "In Praise of Character Acting (Actors Who Aren't A-Listers or Leads but Whose Characters are Just as Important)",
        "content": "",
        "upvotes": 26,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gXIIVC6qyPhxI_SDuhQIOfCUXsVMW3NRt5W2BzyWqLg.jpeg?auto=webp&amp;s=febf13b3bd5ba297af6dbfcdac0f2b204600d7e5"
        },
        "permalink": "/r/movies/comments/1lotq45/in_praise_of_character_acting_actors_who_arent/"
    },
    {
        "id": "1lobcc7",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Roofman' - True story of Jeffrey Manchester (Channing Tatum), a charming armed robber who makes an elaborate escape from prison and takes refuge in a Toys \"R\" Us",
        "content": "",
        "upvotes": 219,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ykuzbhjr73af1.jpeg?auto=webp&amp;s=6e24106a77598724a30cf9d514ba02939ecc7478"
        },
        "permalink": "/r/movies/comments/1lobcc7/official_poster_for_roofman_true_story_of_jeffrey/"
    },
    {
        "id": "1loonov",
        "author": "TT_Slider",
        "title": "The Grizzly Man (2005)",
        "content": "After reading through many posts about the best documentaries out there, I found that a common denominator between these threads was Herzog's \"The Grizzly Man\". After reading through the synopsis, it was settled. I mean, I've always had a liking for the American wilderness, and a documentary about a guy who spent 13 summers in Alaska \"protecting\" bears and giving speeches at schools in order to educate young people about these animals sounded like it'd be right up my alley. \n\nAnd indeed it was, just not in the way I expected. The movie starts with Herzog exploring the site where Timothy and his girlfriend were tragically killed by a bear, alongside Timothy's friend and pilot, who by the way, seems to be the only sane person amongst Timothy's friends. Everyone else seemed like they were on drugs, especially the coroner and his ex-girlfriend, and don't even get me started on his parents. The moment I got a look into the inside of their house and it's fucking filled to the brim with little cute bears my jaw dropped, David Lynch in his prime could not have come up with that. His father, while being asked about his death and odd behavior seems very proud and adamant about the time he caught Timothy smoking weed but quickly reprimanded him, which I found absurdly hilarious, I mean what the actual fuck, we're talking about your child's violent and painful death here.\n\nAnyway, soon after the scene where Herzog explores the site for the first time, you get some interviews with locals who are asked what they think about Timothy, and the answer is pretty clear cut; everyone, almost unanimously, thought he was a moron, and that he had no idea what he was doing, and hell, maybe he got what was coming to him. Having walked into this movie with the idea that Timothy was some sort of \"unsung hero\" of grizzly bears, I thought these comments were quite unsavoury, and that maybe they were just ignorant to what Timothy was really doing out there.\n\nI was WRONG. It blows my fucking mind that someone like Timothy lived to see 13 summers in the Alaskan wilderness. What we get to see is an hour and a half of the biggest dork that has probably walked those plains. This is genuinely one of the funniest movies I've ever seen.\n\nOne scene sticks out to me: the bear fight. Timothy watches silently while two bears hash it out over a female grizzly roaming nearby. I was expecting histerics from Timothy's part, yet, what we get, is a moment absolutely singular in time, that no comedy can ever expect to match. The defeated bear is laying belly down on the sand, paws spread out, trying to catch his breath after getting absolutely stomped, while Timothy is crouching down in the foreground, giving him a detailed explanation of what went wrong in the fight, what he should've done, and how Timothy himself would never fight like that for a girl, no matter how pretty of a grizzly she may be. \n\nNo one I know has ever even heard of this documentary, and I just needed to talk about it with someone. It's some of the most surreal cinema I've ever seen put together, and the fact that this is a DOCUMENTARY only accentuates that. I'd love to hear what you have to say about it!",
        "upvotes": 39,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1loonov/the_grizzly_man_2005/"
    },
    {
        "id": "1loh4d2",
        "author": "Diligent_Night602",
        "title": "Penn Badgley, Meghann Fahy to Star in Romantic Comedy ‘You Deserve Each Other’ for Amazon MGM (Exclusive)",
        "content": "",
        "upvotes": 97,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bRzbXaUXfePcGMjJoPpWQ4DHrtmGQhw4MsaJKkH0r34.jpeg?auto=webp&amp;s=cd7a3ed5c71d1a1f2cf002725d5caa412388daec"
        },
        "permalink": "/r/movies/comments/1loh4d2/penn_badgley_meghann_fahy_to_star_in_romantic/"
    },
    {
        "id": "1lnzzsr",
        "author": "steviewemyss",
        "title": "Where does Brad Pitt rank among the true acting greats?",
        "content": "Having just come out of seeing Brad Pitt in F1 and really enjoying it, I realised that I’ve seen far more Brad Pitt movies than any other actor or actress. It makes me feel like he’s my favourite actor just by volume of his movies I’ve seen and thought he was great in, however for some reason it feels like a cheesy pick to say he’s my favourite actor compared to the other greats. Do you think he deserves to be considered in that upper echelon of legendary actors, or is he just a Hollywood name? \n\nEdit: I agree with what a lot of the comments are saying that he is a great actor, but bigger movie star. And that despite having gotten his Oscar, he still lacks his magnum opus. ",
        "upvotes": 1158,
        "comments": 1101,
        "media": null,
        "permalink": "/r/movies/comments/1lnzzsr/where_does_brad_pitt_rank_among_the_true_acting/"
    },
    {
        "id": "1lo6fj0",
        "author": "NoCulture3505",
        "title": "New Poster for \"Downton Abbey: The Grand Finale\"",
        "content": "",
        "upvotes": 273,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9teodt2j72af1.jpeg?auto=webp&amp;s=9fd4e502ce8f6fdc4cb9221bf788fb8329f69bc5"
        },
        "permalink": "/r/movies/comments/1lo6fj0/new_poster_for_downton_abbey_the_grand_finale/"
    },
    {
        "id": "1low8xr",
        "author": "d8lce",
        "title": "Lilya 4 ever",
        "content": "Just watched Lilya 4 ever as a 16 year old girl, and wow ive never felt so grateful for the life I live today. It’s opened my eyes to the brutal world of human trafficking, and the little boy broke my heart. Movies about human trafficking especially of minors leave me teary eyed the most such as “The sound of freedom“ but this felt like a faucet being opened in my tear ducts. Just wow. No comments",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1low8xr/lilya_4_ever/"
    },
    {
        "id": "1lo9ueg",
        "author": "darth_vader39",
        "title": "‘Sinners’ and ‘The Studio’ Among Nominations for  Location Managers Guild International Awards",
        "content": "",
        "upvotes": 162,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_RLSYHZHoRUGlFMOQYTgQDXg6sHnVIjLC4dqNjFfaWc.jpeg?auto=webp&amp;s=abd98551f37ac43d9d58d247162d46dd08a9eb5c"
        },
        "permalink": "/r/movies/comments/1lo9ueg/sinners_and_the_studio_among_nominations_for/"
    },
    {
        "id": "1loh83a",
        "author": "Pjoernrachzarck",
        "title": "What happened to actress Marissa Marcel? Immortality (2022) is a fascinating experiment for film enthusiasts, lost media scavengers, and mystery fans.",
        "content": "https://i.imgur.com/nQHUoVo.jpeg \n\nNobody ever saw [Ambrosio](https://m.imdb.com/title/tt15173592/?ref_=nm_flmg_job_1_cdt_t_4) (1968), [Minsky](https://m.imdb.com/title/tt15251038/) (1970) or [Two of Everything](https://m.imdb.com/title/tt15471536/) (1999).\n\nThree movies starting ‘Marissa Marcel’ (Manon Gage), all exploring the exploitation of the muse by the artist, none were ever released. Marcel disappeared, as did her director, and all three movies are believed to have been lost.\n\n‘Immortality’ is a movie essay masquerading as a video game, in which you assume the role of an editor, digging through rediscovered footage of all three movies, shot in the style of their respective eras of filmmaking. You get access to the ‘raw material’ - before and after cuts were supposed to be made. There’s some behind the scenes material too, some televised bits, a few private moments shot by the ‘actors’ - and maybe something else lurking inbetween the frames.\n\nThis movie / puzzle / interactive fiction hybrid came and went, it certainly passed me by, and there doesn’t appear to be a /r/movies thread about it. The shot a huge amount of material, and you can examine a shot, finding thematic or visual links to other shots, which in a surreal and disjointed manner slowly reveals not just three very different movies, but a whole range of stories - in front and behind the camera - that, in the end, are just one story.\n\nhttps://youtu.be/mXWQjefdbko?si=46hidt8bEA4mGigU\n\nThis kind of thing is certainly not for everyone, but man. It’s such a unique way to do ‘movies!’ and while its not without acclaim, I think it deserves a larger audience than it currently has.",
        "upvotes": 60,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NC4724-fg8V4F2pDXWbsX6i8tHiW0iIgaY7w7ZbBNIM.jpeg?auto=webp&amp;s=cdb8a0ef4ad8f8c6373c013124a85ae935fcbaca"
        },
        "permalink": "/r/movies/comments/1loh83a/what_happened_to_actress_marissa_marcel/"
    },
    {
        "id": "1lnifp6",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Uma Thurman in ‘The Old Guard 2’",
        "content": "",
        "upvotes": 9634,
        "comments": 1043,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/apuneu8n4w9f1.jpeg?auto=webp&amp;s=2b1cbb8346e8453b9f8298d5e7edd04e1450d794"
        },
        "permalink": "/r/movies/comments/1lnifp6/new_poster_for_uma_thurman_in_the_old_guard_2/"
    }
]