[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jkqcdb",
        "author": "RevolutionaryRip2504",
        "title": "I don't think the show adolescence is vilifying men",
        "content": "  \nThere’s been a lot of debate about whether *Adolescence* demonizes men and masculinity. But is that really the case? Here’s what the show *actually* explores:\n \n- It critiques toxic environments, not men themselves. The series stars Jamie Miller a 13 year old boy who is arrested for the murder of Katie Leonard. But Adolescence doesn’t portray Jamie as inherently violent, he became this way due to loneliness, suppressing emotions, and exposure to harmful online spaces. ([Time](https://time.com/7267884/adolescence-netflix-explained/?utm_source=chatgpt.com))\n\n- Jamie struggles with emotional repression, something many young boys face due to societal expectations. For me the show is more about how important it is for young boys to learn how to manage their emotions and be vulnerable so they do not become violent like Jamie. ([News.com.au](https://www.news.com.au/lifestyle/real-life/news-life/casual-brutality-hidden-meaning-behind-adolescence-emojis/news-story/a8d7e4d2dbf8260f48e2af5c4c9a0858?utm_source=chatgpt.com))\n\n- Jamie’s exposure to incel forums and online radicalization is a key theme. The show critiques these dangerous spaces, not men in general. Just like we discuss unrealistic beauty standards for women, Adolescence examines toxic influences affecting young men.\n\nAt its core, *Adolescence* isn’t about vilifying men—it’s about understanding the challenges they face. Instead of rejecting its message, let’s ask: How can we better support young boys before they reach a breaking point?",
        "upvotes": 53,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1jkqcdb/i_dont_think_the_show_adolescence_is_vilifying_men/"
    },
    {
        "id": "1jkiost",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Orders Live-Action Scooby-Doo Origin Series",
        "content": "",
        "upvotes": 47,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jkiost/netflix_orders_liveaction_scoobydoo_origin_series/"
    },
    {
        "id": "1jkglwg",
        "author": "asurangonne",
        "title": "What would happen after the ending of Adolescence according to UK laws?",
        "content": "After bawling at the ending. (the aurora song was unfair too seriously)  \nI got curious to know what would happen to J after he pleads guilty?\n\nI googled and it seems for first degree murder, its life in prison for 15 and up, but J should be 13 when he committed the crime.\n\nIs he as good as dead to the millers? Because the ending really felt that way too in some sense.",
        "upvotes": 43,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1jkglwg/what_would_happen_after_the_ending_of_adolescence/"
    },
    {
        "id": "1jkpmmc",
        "author": "KMaior",
        "title": "Psychology behind Adolescence Episode 3",
        "content": "I have no competences in psychology. If you have it please answer this sub and let’s talk about the psychologist in adolescence episode 3\n\n•\t⁠Do you think she did a good job? \n•\t⁠Can you explain why she acted like that?maybe give me examples about specific moments of the episode, like why she bring chocolate and sandwich? Why she started with such questions like father, sexuality? Was she trying to make him confess or just trying to delineate his psychological profile? \n•\t⁠What do you see in the kid about his reactions and answers?\n\nNo need to answer these specific questions i made. Just say whatever comes in your mind.\n\nIn my opinion, but i repeat that i have no competences in this field, I see the psychologist a bit inexperienced in some moments (maybe is done on purpose for cinematic reasons). I think she was way too emotionally involved and some times gave him the opportunity of taking too much space and to attack her\n\nBy the way… the kid is a phenomenal actor.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkpmmc/psychology_behind_adolescence_episode_3/"
    },
    {
        "id": "1jk3yr3",
        "author": "greasypancakes69",
        "title": "Adolescence - How was Jamie created?",
        "content": "I’ve been going through the subreddit and I’m seeing a lot of comments about how the problem isn’t psychological but rather sociological, whereas my take is that it’s an intersection between the two…\n\nKindly share your thoughts and opinions, but to me it seems obvious that this kid has traits/behaviours that line up so well with Antisocial Personality Disorder, and I say this as someone who has both extensively studied and had very close people to me with this disorder. If anything I tried to find signs that contradicted my original analysis and I really couldn’t find many.\n\nThe entire third episode characterised it so well, down to the body language of the psychologist as she was trying to make her assessment of him. Then the fourth episode gave a lot of context as to how he was raised – negligent parents, *possibly* a narcissistic father – on top of the bullying and rampant insecurities, I could go on…\n\nFor those who work in mental health and related fields, themselves have ASPD or have experiences with people who do… Like am I off base here?",
        "upvotes": 24,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3yr3/adolescence_how_was_jamie_created/"
    },
    {
        "id": "1jjjsmn",
        "author": "Somethingman_121224",
        "title": "'Adolescence' Becomes First-Ever Streaming Show to Top British T.V. Ratings",
        "content": "",
        "upvotes": 397,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjsmn/adolescence_becomes_firstever_streaming_show_to/"
    },
    {
        "id": "1jko9a6",
        "author": "Extrivio24",
        "title": "Shows appearing in different regions?",
        "content": "In my binge watching phase of Prison Break however I’ve noticed that I can watch Prison Break at work in Central London, but when I’m at home (outside of London) Prison Break gives me an error that’s it’s outside of my region? Is that really a thing where I can’t watch a show when I’m not in London?\n\nNot just Prison Break either - happens for a few shows and movies.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jko9a6/shows_appearing_in_different_regions/"
    },
    {
        "id": "1jkn81b",
        "author": "tinuz84",
        "title": "Move extra member profile back to main account?",
        "content": "So I recently added the “extra member” option to my account, and moved my friends profile to that extra member seat. We quickly found out that with a “extra member” account you can’t add a Kids profile to it, which my friend needs for her family. \n\nI want to move her profile to my main account, so I can later move that profile to my friends full account which she is going to make in nearby future. In the account settings I have the option to remove the “extra member” with my friends profile attached to it, but I don’t see how I can move the profile back to my main account. Does anyone know if that is even possible? Or is this profile forever locked a “extra member” seat in my account?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkn81b/move_extra_member_profile_back_to_main_account/"
    },
    {
        "id": "1jklgdk",
        "author": "indiewire",
        "title": "Every ‘Black Mirror’ Episode, Ranked",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jklgdk/every_black_mirror_episode_ranked/"
    },
    {
        "id": "1jjsevm",
        "author": "Junior_Apartment6388",
        "title": "Has everyone seen how they filmed the van scene in Adolescence! It looks so bizarre there’s literally a guy sitting on top of the van driving it",
        "content": "",
        "upvotes": 84,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jjsevm/has_everyone_seen_how_they_filmed_the_van_scene/"
    },
    {
        "id": "1jk7jg7",
        "author": "DCorvid_Art",
        "title": "Is Wolf King any good?",
        "content": "So I remember a fair bit of hype when it was first announced then nothing for years. It's been out for like 5 days now and I haven't seen a single person talk about it and my twitter is 99.5% animation stuff.\nSome 19 year old swede made a 13 second animatic and I heard about it the next day, Wolf King came out and literally nobody is talking about it. Is it bad? Is it good?",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jk7jg7/is_wolf_king_any_good/"
    },
    {
        "id": "1jk3ahd",
        "author": "__SummerSky",
        "title": "Has anyone watched Con Mum?",
        "content": "I thought it was a pretty interesting documentary! I feel so sorry for Graham and how he found out who his mom really was and how it destroyed all aspects of his life.\n\nWhat are your thoughts?",
        "upvotes": 17,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3ahd/has_anyone_watched_con_mum/"
    },
    {
        "id": "1jjwghy",
        "author": "mez1337",
        "title": "Dear Netflix, Belgium is not France Lite",
        "content": "Here I am, browsing Netflix with my partner, and I see multiple animé shows we could watch. She gets excited for Demon Slayer, I put it on and... It's Japanese dubbed. No problem, I'll just put on subtitl--There's only French subtitles. And Japanese subtitles.  \nUhh... Well that sucks. I'm pretty decent at holding conversations in french but I'm not so good at speed reading it. And my gf doesn't understand french at all.\n\nWell fine, I'll just put on Frieren. I watched it already, and was pretty hyped to see it on the homepage, and now I can watch it with her-- It's japanese dubs with french subs only.  \nFml alright I'll just try Konosuba--  \nYeah guess what. French subs only.\n\nI don't know if you realize this, Netflix, but 60% of Belgians have dutch/flemish as their native language. That's what we call a \\~**majority\\~**.  \n  \nSo why do I get the feeling Netflix is only catering to the francophones? Is it because we Belgians are almost always depicted as french-speakers in American movies and shows?  \nOr is Netflix not able to afford the rights to dutch subtitles? We would even settle for English subtitles ffs.",
        "upvotes": 42,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jjwghy/dear_netflix_belgium_is_not_france_lite/"
    },
    {
        "id": "1jkd0w0",
        "author": "Junior_Apartment6388",
        "title": "Wow an actual PVC door specialist had to fit a new door 12 times for Adolescence after the actors rammed it down in each take",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkd0w0/wow_an_actual_pvc_door_specialist_had_to_fit_a/"
    },
    {
        "id": "1jk85em",
        "author": "GGZoey11",
        "title": "Need suggestions.",
        "content": "I finished watching Adolescence  and was blown away. Does anyone have a suggestion for something similar? I love docusiries, and quirky movies. A Dark Song is my favorite \"horror \" movies. I like psychologically stimulating and tenseness. \nNow I watch a Lot of Netflix. I can only afford that and youtube.  So I might have seen a lot of suggestions.  But please throw a couple my way. Thanks ❤️ ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jk85em/need_suggestions/"
    },
    {
        "id": "1jke5z2",
        "author": "Cartapouille",
        "title": "Dolby Atmos with Android TV Benq X500i projector",
        "content": "Greetings guys,\n\n  \nSo I have the premium plan and a 4k projector with Android TV. And it's hooked to a Denon avr x1800h through eARC. ANd Netlfix proposes me 4k content, but never atmos, only 5.1 . It's getting frustrating, as from my Windows PC I get Atmos sound from the Netflix app (and receiver display Atmos on the front screen), buuuuuut no 4k as the app is crap.\n\nANd yes passthrough is selected on the projector, as well as eARC. Seems the Android TV app just refuses to see I can play Atmos. \n\nAny idea? Or should I never receive the 4k and Atmos at the same time because you can never win in this life? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jke5z2/dolby_atmos_with_android_tv_benq_x500i_projector/"
    },
    {
        "id": "1jke00k",
        "author": "Fun-Ad9428",
        "title": "An Idea of a New Reality Show",
        "content": "What if instead of perfect match, it’s different reality with all the villains of each reality show. Not a mix of genuine people like they do but straight villians from each reality show.\n Then instead of just dating but a mix with trust and genuine challenges. Like the mole or survivor type of way. Where they do need to form bonds to survive but have options to back stab their partner and etc ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jke00k/an_idea_of_a_new_reality_show/"
    },
    {
        "id": "1jjjvnw",
        "author": "BackgroundAvocado224",
        "title": "Con Mum",
        "content": "Dare I say the only person I feel sorry for is Peng and the other couple. Why on earth would you spend £300K on a mum who hasn’t been in your life for 45 years abandoning your partner and child for her. \n\nDare I also say Dionne is actually a successful business woman - she sure knows how to run a scam. ",
        "upvotes": 97,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjvnw/con_mum/"
    },
    {
        "id": "1jkbzd5",
        "author": "Ready-Airline-3178",
        "title": "Can I select HDR10+ over Dolby Vision?",
        "content": "Hey! On my Android TV that supports both HDR10+ and Dolby Vision, HDR10+ usually looks better than Dolby. Now that Netflix supports both, is there a way for me to kind of disable Dolby and having HDR10+ prefered whenever it is possible \nBest regards ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkbzd5/can_i_select_hdr10_over_dolby_vision/"
    },
    {
        "id": "1jk9ckt",
        "author": "Visual_Conference144",
        "title": "Can you use old icons?",
        "content": "Hey guys the heading says everything. Is there still a way to use old netflix icons that have been deleted? I lost my old demogorgon icon and i would really like to have it back but its gone on the offfical way",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jk9ckt/can_you_use_old_icons/"
    },
    {
        "id": "1jjyzvl",
        "author": "Complete_Ranger_4261",
        "title": "Con Mum",
        "content": "1.&gt;!spoilers!&lt; His mum abandons him age 2\n2. His dad abuses him throughout his childhood \n3. His mum comes back into his life 45 years later to emotionally and financially abuse him\n4. His wife abandons him and takes his only child half way across the world to NZ\n\nWhat the actual f??? I just hope he makes a shit load of money from the free advertising for his business now. Then he can pay the debts - fly out to see his son regularly so it becomes routine for father and son - find a woman who will support and love him even when things are hard. \n\nRespect to his friends who are his true family❤️ &gt;!spoilers!&lt;",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jjyzvl/con_mum/"
    },
    {
        "id": "1jkhi4q",
        "author": "elbandito999",
        "title": "Adolescence plot hole?",
        "content": "&gt;!Can someone explain to me how it would be possible for the police to a) identify Katie's body b) obtain numerous CCTV images and c) work out who Jamie was from them, then d) obtain permission and organise numerous armed police to arrest Jamie, all in one night between 10pm and 6am??!&lt;",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1jkhi4q/adolescence_plot_hole/"
    },
    {
        "id": "1jkbk7e",
        "author": "Atlast_2091",
        "title": "MSN | Cancelled or renewed series? Tulsa King, Severance, House of David and more!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkbk7e/msn_cancelled_or_renewed_series_tulsa_king/"
    },
    {
        "id": "1jk53ao",
        "author": "punchingbannanna",
        "title": "i need something new to watch!",
        "content": "I've been trying to find something new to watch on Netflix but I always feel like I've exhausted all the good and interesting series. Now fortunately I started watching a series which at first I thought was something for children the way it was, and i wasn't interested at all to watch it. But without anything else to watch i said, oh what the heck it won't hurt an episode. I'm not going to lie, the first episode was pretty crappy, but as the second episode started, I started to love this series.I'm now on season 3 in two days, at this rate I'll finish it tomorrow, which I hate to do because then I'll be back to nothing to watch... if anyone has any ideas of what I could watch I'd be happy, i want to hear y'all your favorite shows that might start the flame in my heart too again.",
        "upvotes": 0,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1jk53ao/i_need_something_new_to_watch/"
    },
    {
        "id": "1jk7x74",
        "author": "Ok-Veterinarian5879",
        "title": "Till how many days shall I have access to Netflix after my expiration of subscription plan?",
        "content": "After my Netflix subscription expires, how long will I still have access to the content? As of March 2025, what is the grace period for watching movies and shows on Netflix after the payment has been missed or the subscription lapses? \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jk7x74/till_how_many_days_shall_i_have_access_to_netflix/"
    },
    {
        "id": "1jjri2i",
        "author": "_zyx_716",
        "title": "Trying to see if the with ads plan is worth it?",
        "content": "I want to know how bad the ads can get. I've been looking here on Reddit and on Google but everything I see is very mixed with some people saying they barely get any and some people saying they get a lot of them. If the ads are atrocious then it isn't really worth getting but if they aren't too bad I'd like to replace my Amazon subscription.",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jjri2i/trying_to_see_if_the_with_ads_plan_is_worth_it/"
    },
    {
        "id": "1jjn4f3",
        "author": "scarletwitchmoon",
        "title": "The Residence. I enjoyed it for the most part.",
        "content": "I guessed the killer by episode&gt;!2!&lt;. Don't worry; I won't spoil or even hint. I just wasn't shocked at all. I have thoughts of who it could have been instead or the kind of motive I'd have preferred, but I won't share that either.\n\nMy only criticism is that the episodes should have been shorter. There were scenes that were longwinded and convoluted due to the length. It could have been 10-12 quick episodes instead of 8 super long ones. A minor nitpick I had is that the piano music they played sometimes was too similar to Only Murders in the Building. The piano music made sense because the characters in OMITB lived in an apartment where they used the elevator.\n\nOn a positive note, I thought the performances were all phenomenal. I absolutely loved Cordelia Cupp as a detective. I do wish the show had been set up for future seasons. She was very compelling as a lead.\n\n\\*\\*Updated to hide which episode I guessed the killer by in case that counts as a spoiler.\n\n**What other murder mystery shows/movies have you seen?**\n\nI've Watched:\n\n* Psych\n* Monk\n* CLUE\n* How To Get Away With Murder\n* Only Murders in the Building\n* Murder Mystery &amp; Murder Mystery 2\n* Knives Out\n* Murder on the Orient Express\n* Sherlock Holmes (the movies and the show)",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jjn4f3/the_residence_i_enjoyed_it_for_the_most_part/"
    },
    {
        "id": "1jk337k",
        "author": "Massaro316",
        "title": "60 FPS Sports",
        "content": "I'm a big sports fan (WWE, NFL ETC.) and since Netflix diving more into this, I'm trying to figure out why some devices do different things when it comes to frame rate. Watching sports in 59.940 (60 FPS) compared to 29.970 (30 FPS) is like night and day for me (I'm a stickler for it).   Seems like apple and fire tv play the best with this.  59.940 will just work and looks great.  Android and windows, not so much.  On android, I have a Lenovo Yoga Tab 13. Windows, I have tried all the browsers and also the windows store app and still get 29.970.  Any other app or video streaming site lets you pick but Netflix doesnt allow you to choose and it makes no sense.  Does anyone understand why or how to make it work?  If someone has proof that it actually works on windows, please show me and what you are using cause it is getting on my nerves, lol. Thanks in advance.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jk337k/60_fps_sports/"
    },
    {
        "id": "1jjxfcr",
        "author": "TarugoKing",
        "title": "Frieren: Beyond Journey's End Anime",
        "content": "The anime started slow for me so I was watching the first few episodes on and off. Don't know what happened but somewhere along the way, I got hooked and finished all 28 episodes over the weekend. What a great series this is for me. You go through a somewhat emotional journey with flashbacks that ties up everything all together. Deep story, great character development, battle scenes were fantastic as well. This is a worth a watch!\n\nAdding that I usually watch anime in cc. However, I find the voice dubbing of Frieren (the character) so soothing. Monotone, lack emotions or detached in some way and slow to interpret human emotions. Matches her personality.\n\n\n\n\n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjxfcr/frieren_beyond_journeys_end_anime/"
    },
    {
        "id": "1jjvt2t",
        "author": "Smurfritow",
        "title": "Has anyone found any remotely good fix for the low bitrate?",
        "content": "I've read multiple post also complaining about the low bitrate, but the latest I found is 4 months old, thatswhy Im coping for a solution. \n\nIts so bad for me I can barely read what is written at the beginning of the movie (e.g. Created by...\" etc.). I have Full HD plan and a set up that is ridiculously overqualified for watching movies (High end PC as well as very good and stable Wifi), but still it feels like i permanently have to watch in 480p.\n\nI also changed my Profile setting to prefer \"High\" Graphics. Still nothing.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjvt2t/has_anyone_found_any_remotely_good_fix_for_the/"
    }
]