[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 695,
        "comments": 5155,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nwfelp",
        "author": "InsaneCookies21",
        "title": "Just to put this in perspective. Breaking Bad had 62 episodes in 5 1/2 years.",
        "content": "While Stranger Things will have 20 FEWER episodes at 42 in 9 1/2 years... absolutely ridiculous. So in nearly double the time, Stranger Things produced two-thirds the amount of content.",
        "upvotes": 141,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1nwfelp/just_to_put_this_in_perspective_breaking_bad_had/"
    },
    {
        "id": "1nwcu16",
        "author": "SmartStar65",
        "title": "Elon Musk Doubles Down On Netflix-Bashing Over Trans Cartoon Character Park'",
        "content": "",
        "upvotes": 133,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1nwcu16/elon_musk_doubles_down_on_netflixbashing_over/"
    },
    {
        "id": "1nwbl5v",
        "author": "pogonotomy_lover",
        "title": "I liked Wayward and I don't understand the criticism",
        "content": "The series premiered exactly a week ago, I watched it, and I enjoyed it. I didn't once think the actors were bad, a criticism I've seen a couple of times in reddit discussions. I was also very surprised by how they managed to make the dialogue between Leila and Abbie sound realistic and natural compared to how they've made teenagers speak in other Netflix shows, and I appreciated that.\n\nI definitely have no experience in entertainment criticism or analysis; the only way I judge whether the acting was good or bad is how much I believe the actors, and therefore how much I can focus on the plot. This is, of course, very subjective, but the only time I felt a little disconnected from the plot was with Abbie's father. I didn't fully believe his character's outburst or his overall persona, but I don't think he had more than 15 minutes of screen time, and I don't consider it \"bad\" acting—just less compelling. I truly don’t think this show had \"bad actors\". \n\nI think most of the criticism I’ve read comes from people that aren’t the show's target audience, which, from my perspective, seems to stem from their personal biases against queer people or from not connecting with or relating to the show's theme, which is intergenerational trauma and how it can cause children, teens, and eventually adults to feel the weight of their parents' unresolved grief or trauma, resulting in deep guilt and a sense of being \"bad kids\", even before they’ve developed a moral compass or an integral sense of self. \n\nAs for the protagonist, I can’t thank Mae Martin enough for the representation they gave the trans community in this series. I’ll save that aspect of this review for another subreddit though, as I have read very ignorant and rude comments regarding Mae Martin’s character, Alex, and I hope to minimize that aspect of the discussion in this post. \n\nI think the show does an incredible job of showing that there are no \"bad kids,\" but rather they are a direct result of their environment and the extremes parents or families go to in order to \"cope\" with their children, rather than working on themselves or simply trying to connect with them from a place of love, understanding, and empathy. I think all parents should go to therapy at least a few times, which I recognize is a statement that stems from and leads to something much deeper from a historical, sociopolitical, and evolutionary perspective. But, I think many parents should have gone to therapy before having children, and the series does a great job of taking that feeling and amplifying it to a psychological thriller level, while also depicting the dangers of retreats, programs, and poorly researched and unethical therapeutic methods for minors.\n\nOne of Sydney Topliffe's (Abbie) lines from Episode 1, \"When you had kids, what the f\\*\\*\\* did you imagine it would be like?\" that she says to her dad in an outburst, really struck me. I think it captures the incomprehension and frustration that so many children and teenagers feel: \"Why did my parents even have kids?\" Meaning, \"Why did this person or these people bring me into the world only to make me feel every day that they wish they hadn't?\" or “Did they create an idea or expectation of children and family, if any, in their heads that I'm not living up to, or do they simply not like me as a person?” Even though it could never be the kid’s fault truly, they are made to feel as though it is. Another line that captures this sentiment is Toni Collete's (Evelyn) line in Episode 7: \"Birth is... nonconsensual.\" \n\nI've also seen criticism that there are plot holes. I finished the series today, and I can't say with complete certainty that I found any plot holes per se, but I did feel that some things were left “up in the air”. For example, I think some character's subplots felt a bit rushed; it would have been interesting to know more about many of them (e.g., Riley and Maurice), but I also understand that it's a miniseries and covers topics that could give much more screen time in order for them to thrive.\n\nAs for the toads (I think cane toads), I do think they're simply symbolic. They're an invasive species that has taken over the town, and in one way or another, they're everywhere, just like Evelyn. Depending on the culture, they also represent different things, such as fertility and abundance, transformation and rebirth, healing and purification, among others (Logan, 2024). All of the articles I found about toad and frog symbolism can be closely associated with the series, including those that presented a negative and evil interpretation of frogs and toads, as most of the characters have different or opposite perspectives of Evelyn, many having both throughout the series and their character's development. Also, I'm sure the show implies that the toads have a role in the making of the drug used on the graduates, which isn't so far fetched in a science-y fiction way as there are psychedelic amphybians. The fact that the phase is called \"The Leap\", is probably also a play on the fact that frogs jump or \"leap\" from one place to another. I also think it could symbolize the term \"leapfrog\", which according to Cambridge Dictionary, can also be used as a verb to describe: \"to improve your position by going past other people quickly or by missing out some stages\". Maybe this could be interpreted as wanting to heal and become your new self with Evelyn's drug quickly, without going through a much longer process of healing and learning to live with your trauma, by facing your past, yourself and others, but that could just be a personal interpretation.\n\nI also read some reviews that said the series dragged on too long, something I personally disagree with. I think almost every aspect of the series contributed to the plot and deserves analysis from an entertainment perspective, but also from a psychological one. If anything, I sometimes felt it was fast paced and I hope they decide to renew for a second season.\n\nIn the future, I would love to rewatch this series with even more attention to detail, as I thoroughly enjoyed it and believe it has incredible potential, I hope Mae Martin takes up more production and acting roles as well.",
        "upvotes": 26,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1nwbl5v/i_liked_wayward_and_i_dont_understand_the/"
    },
    {
        "id": "1nwk2h5",
        "author": "Ember_Grove20",
        "title": "What’s the first show or movie you ever watched on Netflix?",
        "content": "I was just thinking about how long I’ve been using Netflix and realized I honestly can’t remember what the very first thing I watched was. Now I’m curious if anyone here actually remembers theirs. What was your very first Netflix watch, and do you still think about it?",
        "upvotes": 7,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1nwk2h5/whats_the_first_show_or_movie_you_ever_watched_on/"
    },
    {
        "id": "1nw0no9",
        "author": "asdfghanjkl",
        "title": "thoughts on Wayward",
        "content": "here's mine: it could've been a 2-hour movie.\n\nloose ends, plot holes, has so much potential but the plot is struggling and scrambling. I thought the acting was great (especially Toni's and all the Tall Pines Academy kid(?) actors), however the flow was a bit too draggy. I sat through the whole thing and binged without any skips, but I wished I did, or at least watched it in a faster speed. I saw a lot of people having so many questions after watching, and I get it. I feel the same way too, and how I truly wish it could've been a movie instead. not the best series, but it's dragging me to watch it enough even though with a very loose thread. interesting concept though!",
        "upvotes": 40,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1nw0no9/thoughts_on_wayward/"
    },
    {
        "id": "1nweex3",
        "author": "National-Poet-9165",
        "title": "Dark hits completely different on the second watch.",
        "content": "https://preview.redd.it/2j34fra29rsf1.png?width=480&amp;format=png&amp;auto=webp&amp;s=74fa63368f29e7da0c24f7f37531da3ae8544d18\n\nThe first time through, my brain was just in survival mode trying to keep up with who’s who. On my rewatch, it feels like a completely new show, I catch so many subtle details and emotional setups that flew over my head before.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nweex3/dark_hits_completely_different_on_the_second_watch/"
    },
    {
        "id": "1nwkwvk",
        "author": "pocketrob",
        "title": "Billionaire's Bunker Inconsistency",
        "content": "When Asia is playing her sister's phone videos, and they show a shot of her and Max... Does anyone else get the urge to shout at the screen: Who's filming them?! 😂",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwkwvk/billionaires_bunker_inconsistency/"
    },
    {
        "id": "1nwes3c",
        "author": "Turbulent_Pipe_2391",
        "title": "need recommendations for dual subtitles and larger font",
        "content": "hi, total newbie to netflix. literally installed it to learn another language by watching movies. do you have any good recommendations to display subtitles in two different languages? what about showing the subtitles in a larger font (I know that netflix allows to change font, but the largest is still not enough because I'm sitting far from the screen and the screen is not big)\n\nwould be great if the recommended browser extensions were free",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwes3c/need_recommendations_for_dual_subtitles_and/"
    },
    {
        "id": "1nwjxvp",
        "author": "laurlu",
        "title": "Netflix on Roku TV",
        "content": "Is anyone else’s Netflix App on their Roku TV absolutely horrible? I don’t know if it’s my tv getting old or what, but the Netflix app is god awful. It’s extremely quiet compared to the rest of my streaming services, it glitches out if I try to pause/fast forward/rewind, it will literally make my tv crash back to the main menu. And if it makes my TV freeze, it takes like 10 minutes for the app to close out and take me back to my home screen. None of the other streaming apps do this on my Roku tv so that’s why I’m thinking it’s a Netflix-only issue. I’m so annoyed!!!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwjxvp/netflix_on_roku_tv/"
    },
    {
        "id": "1nw215d",
        "author": "Significant-Fun-4235",
        "title": "Please dont make this a trend for all non-US shows!!!",
        "content": "*Processing img 71tjd244wosf1...*\n\nI swear I was already pissed when Squid Game America was announced, but to even see someone is actually thinking about an Alice in Borderland spinoff is baffling! If this happens, maybe the future will show us Stranger Things China, Wednesday Korea, or Bridgerton South Africa. ",
        "upvotes": 10,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1nw215d/please_dont_make_this_a_trend_for_all_nonus_shows/"
    },
    {
        "id": "1nvncdg",
        "author": "lil_sass-a-frass",
        "title": "Wayward was addictive. Kept me hooked throughout.",
        "content": "Admit I thought it was gonna be boring during the first episode but really had me guessing and almost watched the whole series in one sitting just to see what was next. Sometimes Netflix hits good with with a show like that. Was a bit disappointed that the ending did not turn out how I expected! Definitely made it even more thought provoking though.. ",
        "upvotes": 91,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1nvncdg/wayward_was_addictive_kept_me_hooked_throughout/"
    },
    {
        "id": "1nvnqx2",
        "author": "lil_sass-a-frass",
        "title": "Unpopular opinion: House of Guinness was shite.",
        "content": "Script, screenplay and directing all seemed really lacklustre . Almost like a Bridgerton version of peaky blinders. Everything about the lady from cloonboo, the fenians, raffertys fake accent, even the affair with him and Anne (the cat thing was just cringe) and Arthur’s secret.  It all just felt so fake, put on and farcical to be believed.  Like the titanic love story or something. They could have done it so much better but it just fell so flat to me. ",
        "upvotes": 70,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1nvnqx2/unpopular_opinion_house_of_guinness_was_shite/"
    },
    {
        "id": "1nwhjq3",
        "author": "mooman413",
        "title": "List of available movies/shows available anywhere?",
        "content": "Is there a way to see a list of all the movies on Netflix or are the only movies/series available just on my login screen?  For example, if I'm not in the mood for any of the shows that pop up my home screen, is there a master list I can surf through to find something I'm in the mood for?  Not necessarily the search function because often I don't know what I want to watch until I see the title.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwhjq3/list_of_available_moviesshows_available_anywhere/"
    },
    {
        "id": "1nvumgb",
        "author": "daniellim1121",
        "title": "Alice in Borderland Season 3 Summary in 3 Photod",
        "content": "",
        "upvotes": 21,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nvumgb/alice_in_borderland_season_3_summary_in_3_photod/"
    },
    {
        "id": "1nw97nh",
        "author": "WallT73",
        "title": "iOS26 and sound sync off?",
        "content": "Anyone has any info on either what to do or something official from Netflix about problem with sound sync (I have an iPhone 15 plus) after upgrade to iOS26 ? ... It's super annoying",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nw97nh/ios26_and_sound_sync_off/"
    },
    {
        "id": "1nwkdgd",
        "author": "Beaudoiin",
        "title": "Netflix cutting portions of film",
        "content": "I have watched several movies and shows where there is about 2 to 5 seconds that appear cut right before the movie switches scenes. Almost as if at each chapter you would see on a DVD version looses a few seconds before it cuts to the next.\nIt's cutting mid sentences. I have seen it in dozens of movies! Not just like rated and unrated versions, it's even when nothing seemingly important is happening. If I rewind it, it does the same teeming at the same moment! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwkdgd/netflix_cutting_portions_of_film/"
    },
    {
        "id": "1nw892h",
        "author": "TheWrestlingGod_2004",
        "title": "I need help finding the ID for a show",
        "content": "I was looking through the viewing activity when I saw one of the shows I watched was gone. I know Netflix will remove shows so I try to see what was removed but I couldn't check. I did get it's ID number: 70176308. If someone here can help me, thank. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nw892h/i_need_help_finding_the_id_for_a_show/"
    },
    {
        "id": "1nwj18g",
        "author": "Therian_alexis",
        "title": "This is the type of stuff on Netflix that pmo.",
        "content": "won’t let me leave, won’t let me refresh, and just won’t work",
        "upvotes": 0,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5e5t86km5ssf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nwj18g/this_is_the_type_of_stuff_on_netflix_that_pmo/"
    },
    {
        "id": "1nvydju",
        "author": "mgepark",
        "title": "Angela - new series",
        "content": "I binged it in under one day and thought it was great. Veronica Sanchez put in a great performance. 6 fast moving episodes. Thank you Netflix for another great series. ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nvydju/angela_new_series/"
    },
    {
        "id": "1nwazsg",
        "author": "notyouratul",
        "title": "Is it me or the subtitle of new series on Netflix hard to read?",
        "content": "I mean I all the new series or movies, the subtitle are pails, not pure white. It's hard to read.\n\nBut when I watch old series/movies, It's pure white.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nwazsg/is_it_me_or_the_subtitle_of_new_series_on_netflix/"
    },
    {
        "id": "1nvd7wl",
        "author": "Quick_Dot_9660",
        "title": "How did Haunting of Hill House not get nominated for an Emmy?",
        "content": "I'm rewatching (halloween season) and this is one of the most awe inspiring TV shows I've ever come across and according to IMDB it picked up some Saturn awards and  MTV awards is there a reason it would not have been nominated for anything more? ",
        "upvotes": 66,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1nvd7wl/how_did_haunting_of_hill_house_not_get_nominated/"
    },
    {
        "id": "1nw5m0w",
        "author": "Minimum-Pianist3642",
        "title": "Back to back is on netflix !?",
        "content": "No links lol",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xie6a68pmpsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nw5m0w/back_to_back_is_on_netflix/"
    },
    {
        "id": "1nw2ra7",
        "author": "ZackBumm2",
        "title": "No consistent 1080p stream on Netflix: Why thier streaming quality sucks.",
        "content": "Hi,\nNetflix streaming quality sucks. Yes, they have lower bitrate on their streams than competitiors, but i am talking about resolution. It's just inconsistent, what shows or episodes in a series are 1080p, and which are not.\n\nI have the standard plan and watching on the built-in Netflix App on LG TV (WebOS) and can also watch over the Fire TV Stick 4K 2nd Gen. Both can stream up to 4K, and are not limited like streaming on PC (except Edge?). On both devices i have the same result. For example, some episodes of \"Outlander\" are just streamed in 720p, others in 1080p. And on the movie side, \"Ready Player One\" would just play in 720p, no matter what i do. You can't tell me, that Netflix just got a low quality copy of that movie?! And yes, my network speed is more than capable.\n\nI understand, that some shows are not streamed in 1080p, if the movie/series itself is old and of bad quality. For example, Deep Space Nine wouldn't look much better in Full HD, because of the quality of the orginal scan.\n\nBut it seems, that Netflix just favor their own \"Original\" content, that is shown pretty much all the time in good quality. They just don't care, and obviously a lot of people don't care either (Well, if you just watch on your Smartphone or Tablet, you wouldn't mind it so much).\n\nIf you want streaming quality, Netflix is just cheap, because even Big Bang Theory has bad quality (720p and no high bitrate), it's only getting better in the later seasons. Disney Plus on the other hand has on the same series a whole other watching experience (there is much difference in the first seasons, it looks pretty much if it is a different scan).\n\nDo you know other examples like that?\n\nSo i think the problem is on the Netflix side, can't think of anything than writing to their support, live with it or just cancel.\n\nPS: Feel free to discuss. If there is some technical explanation for this, i'm glad to hear about it.\n\nIf the topic doesn't fit here, just remove it another community.\n\nPSS: Typo in the topic, i'm a non-native speaker, but don't know how to edit it.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nw2ra7/no_consistent_1080p_stream_on_netflix_why_thier/"
    },
    {
        "id": "1nvd1j7",
        "author": "Individual-Flatworm7",
        "title": "What on earth is happening to Netflix UK??!",
        "content": "Honestly I’m so mad I won’t lie. For the last like 30 mins I’ve been looking for something worth watching because EVERYTHING has been removed. For example, I was halfway through the vampire diaries and was watching it last night, today it’s gone. I wanted to watch a studio ghibli film, they’re all gone. What is going on and why is everything good being taken off? ",
        "upvotes": 35,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1nvd1j7/what_on_earth_is_happening_to_netflix_uk/"
    },
    {
        "id": "1nwhvw5",
        "author": "Far_Nobody4967",
        "title": "What do YOU think happened to Amy Lee Bradley? I just watched the documentary :(",
        "content": "I STRONGLY believe that she was trafficked and that the guy everyone called \"Yellow\" was in on it. I mean his own daughter even said that she thought he was in on it?? The kicker or why I think she was trafficked is because multiple years after her disappearence the family was sent INNAPROPRIATE PICS OF HER. There is no doubt in my mind that it was Amy in those innaporpirate pics. But let me know what all of you think?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nwhvw5/what_do_you_think_happened_to_amy_lee_bradley_i/"
    },
    {
        "id": "1nv1czx",
        "author": "EclipseTheStars",
        "title": "If Netflix *ISNT* Releasing Seasons All-At-Once, Why Not Do Weekly Episodes Instead??",
        "content": "EDIT : I think posters are vastly missing the point that weekly episodic lasts JUST AS LONG as bi-monthly \"chunking\". The argument that \"chunking\" keeps more viewers couldn't be farther from the truth because 8 weeks is 8 weeks no matter what way you slice it up. Also, I do not advocate for weekly episodic. I am, however, stating the lesser of 2 evils. As you were ...\n\n\n\nJust found out that Stranger Things 5 will be airing 4 episodes in November, 3 in December, and 1 in January for \"viewer retention.\"\n\nWhy don't they just start on Thanksgiving with weekly episodes that go throw 3 core holidays? Thanksgiving, Christmas, and New Years?\n\nPeople talk about it on social media, share their opinions, sometimes it's on talk shows, Game Of Thrones did this best, I don't know why Netflix doesn't do this. WEDNESDAY was the same.\n\n\\---------------------------------------------\n\nTL;DR\n\nObviously, just give me the entire season all at once. The premise is that they \\*DONT\\* do that anymore. And honestly, splitting up the seasons of these shows a few episodes MONTHS apart is so much worse than week-by-week episodes for a few months sraight.\n\nAlso, people tend not to give a @#$% anymore after binge watching half the season and then having to wait another month for the rest. Am I only in this way of thinking?",
        "upvotes": 102,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1czx/if_netflix_isnt_releasing_seasons_allatonce_why/"
    },
    {
        "id": "1nvx8uk",
        "author": "Lucky_Advantage9768",
        "title": "The netflix search has become slower!",
        "content": "Its kinda annoying recently, given I was used to the fast catalogue search without any AI in netflix. But now with so called AI the search is slow, and when you search for something out of catalogue thats when you feel it the most. \n\nHas anyone else felt the same. I really need old Netflix search back. Btw this is in netflix app.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nvx8uk/the_netflix_search_has_become_slower/"
    },
    {
        "id": "1nw9w0o",
        "author": "Silly-Landscape535",
        "title": "Netflix bringed the old tv ui back",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nw9w0o/netflix_bringed_the_old_tv_ui_back/"
    }
]