[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p3tqwo",
        "author": "TheDreamingMind",
        "title": "La GTT è la cosa peggiore che esista",
        "content": "Ho pagato per 6 anni (di servizio osceno) l’abbonamento Under 26 a oltre 200€. A partire da Novembre, non essendo più Under 26, ho deciso di andare avanti a biglietti singoli usando l’app. Bene, l’app fa schifo tanto quanto la GTT. Due biglietti ho fatto. Il primo, nonostante il pagamento sia avvenuto, non è stato rilasciato. Ironicamente, per il viaggio di andata la linea si è fermata senza apparente motivo e ci hanno fatto scendere (a metà percorso per me). Al ritorno, semplicemente non è proprio passata la linea. Per il secondo biglietto, l’app si è rifiutata di farmi convalidare o auto convalidare. I controllori salgono, controllano pure che il biglietto sia stato acquistato e mi fanno comunque la multa per non ho convalidato. A nulla sono servite le spiegazioni con annesse dimostrazioni. 37€ mi hanno fottuto. Io ho pagato ma ho già fatto reclamo, consapevole che forse non servirà a niente, sperando che qualcuno mi dia speranza. La GTT deve esplodere adesso.",
        "upvotes": 26,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1p3tqwo/la_gtt_è_la_cosa_peggiore_che_esista/"
    },
    {
        "id": "1p3r1j2",
        "author": "Mindless-Set-8993",
        "title": "Enjoy abbandona Torino?",
        "content": "Stamattina alle 7,30 cercavo una Enjoy in zona centro, e questa era la situazione. 16 auto in tutta la città, di cui nessuna nella parte est della città.\nÈ così da alcune settimane almeno.\nÈ in corso un disimpegno totale di Enjoy dal sistema di car-sharing a Torino? \nNon credo che il sistema sia redditizio con sole 16 vetture, quindi ho l'impressione che sia un servizio residuale (lasciamo in giro quel che resta del parco auto, in attesa che si fermi da sé per qualche motivo e senza procedere a sostituzioni).\nQualcuno ne sa di più?\nGrazie!",
        "upvotes": 28,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m2m6qogxns2g1.jpeg?auto=webp&amp;s=f7c3d3dcbbd8d11b54a2b1bac9e3a92066fe0cb5"
        },
        "permalink": "/r/torino/comments/1p3r1j2/enjoy_abbandona_torino/"
    },
    {
        "id": "1p3vbcv",
        "author": "alessiotucci",
        "title": "Campo di pallacanestro (aperto o al chiuso) 🏀",
        "content": "Ciao a tutti, \n\nSapete quali sono i  campetti migliori di Torino per fare due tiri ogni tanto?\nE se ci sono quelli al chiuso, quanto costa affittarli?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p3vbcv/campo_di_pallacanestro_aperto_o_al_chiuso/"
    },
    {
        "id": "1p3ujwz",
        "author": "Cloud_Of_Thoughts452",
        "title": "Consigli Affitto Torino",
        "content": "Ciao a tutti,\n\nM30, avrei bisogno di qualche consiglio per trovare affitto a Torino per 1 o 2 anni.   \n\n\nQual è il periodo migliore ?   \nQual è il budget per un mono/bilocale ? nelle varie zone ? Zona San Paolo ?  \nInvece una stanza singola ?\n\nAvete altri consigli o raccomandazioni ?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p3ujwz/consigli_affitto_torino/"
    },
    {
        "id": "1p3tiz4",
        "author": "Aggressive-Bunch-202",
        "title": "Cerco un salone da parrucchiere o barbiere autentico per girare un documentario",
        "content": "Ciao a tutti,\n\nSto cercando un salone da barbiere o un parrucchiere autentico nella vostra città per un piccolo shooting semi-documentaristico. Non serve che sia bello o di design: cerco soprattutto un luogo con una vera anima, un’atmosfera di quartiere, persone interessanti da incontrare e magari da intervistare. L’idea è di catturare un momento reale, caldo e vivo, in un posto autentico e con carattere.\nSe avete qualche consiglio o un luogo in mente, sono tutto orecchi. Grazie! 🙏",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p3tiz4/cerco_un_salone_da_parrucchiere_o_barbiere/"
    },
    {
        "id": "1p3y04x",
        "author": "_Giulio_Cesare",
        "title": "Botte e minacce a un professore, “sei un pedofilo”: arrestato Don Alì, il “re dei maranza”",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gd6d0WXTyTEhcSXB5CGc0rnUrTSslly_fIWYbADy19o.jpeg?auto=webp&amp;s=51f1cb6f9793992d178f7f7fb04a67af59121825"
        },
        "permalink": "/r/torino/comments/1p3y04x/botte_e_minacce_a_un_professore_sei_un_pedofilo/"
    },
    {
        "id": "1p32skj",
        "author": "hemaybefede",
        "title": "La sola Madrid ha più km di metropolitana che l'intera Italia",
        "content": "Per quelli che: \"ma Torino ha una metro fantastica, siamo già fortunati così...\".",
        "upvotes": 86,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ydpfc9s5l2g1.png?auto=webp&amp;s=ed3ba23fb4da0a0fa1be025b4c20622baa298f7d"
        },
        "permalink": "/r/torino/comments/1p32skj/la_sola_madrid_ha_più_km_di_metropolitana_che/"
    },
    {
        "id": "1p3sjoy",
        "author": "FutureVirtual6811",
        "title": "Sending an Envelope by Post at Turin",
        "content": "Guys I’m new in Turin and I have a tiny question. I have to send an envelope to an address in Milano but where do I go? Dhl or some other shipping company? I want to be able to track my shipment and get notifications to my mail/phone if it arrived etc. Thanks for all the help.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p3sjoy/sending_an_envelope_by_post_at_turin/"
    },
    {
        "id": "1p2zutz",
        "author": "daccia",
        "title": "Richieste bizzarre: dove posso trovare una campana per pecore?",
        "content": "Ho un compleanno in arrivo e verrà regalata una pecora, quindi giustamente vorrei trovare una campana degna per la nuova queen, ma a Torino non ho proprio idea di dove potrei mai trovare qualcosa del genere, ogni consiglio è ben accetto!",
        "upvotes": 49,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/27xbnkwzcm2g1.jpeg?auto=webp&amp;s=d11e4909c1470c4473023ff3a17ce1eb85ab2368"
        },
        "permalink": "/r/torino/comments/1p2zutz/richieste_bizzarre_dove_posso_trovare_una_campana/"
    },
    {
        "id": "1p37khe",
        "author": "Effect-Imaginary",
        "title": "Devo regalare parecchi Gianduiotti (e dolci simili), cosa mi consigliate per avere un buon rapporto qualità prezzo?",
        "content": "Non sono un sommelier del cioccolato &amp; co, ma a spanne mi sembra brutto portare cose della lindt.\n\nMagari comprare direttamente da cioccolaterie locali.\n\n\nNon vorrei svenarmi da ghigo.\n\nPer adesso ho solo adocchiato i negozi di dolciumi a porta palazzo, quelli sotto la tettoia. Sono troppo commerciali e troppo poco piemontesi? \n\nA memoria vendevano anche lindt,  ma di sicuro ci sono altre marche.\n\nEdit: alla fine opterò per la qualità sopra la quantità, grazie per i consigli. \n\nCalcagno \n\nCroci\n\nSperandri\n\nGobino\n\nCaffarel\n\nGuido Castagna\n\nZiccat\n\nLa Perla",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1p37khe/devo_regalare_parecchi_gianduiotti_e_dolci_simili/"
    },
    {
        "id": "1p3p19i",
        "author": "Mattringmecc",
        "title": "Metro con biglietto gtt to move",
        "content": "Buongiorno a tutti, ho fatto un abbonamento per 72 ore tramite l'app GTT to move. Il mio cellulare però essendo un po' vecchiotto non ha l'nfc quindi nell'autobus procedo con l'auto convalida ma se volessi prendere la metro? Ci sono i tornelli? Come si fa in quel caso? Ho visto che il biglietto ha un codice QR code, è possibile fare scannerizzare quello al tornello? Grazie a chi risponderà ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p3p19i/metro_con_biglietto_gtt_to_move/"
    },
    {
        "id": "1p3fgxg",
        "author": "Imaginary_Hour6285",
        "title": "Qualcuno di voi in cosa è stato discriminato in base alla propria provenienza?",
        "content": "P",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1p3fgxg/qualcuno_di_voi_in_cosa_è_stato_discriminato_in/"
    },
    {
        "id": "1p3lmby",
        "author": "Le_Moulin_Italien",
        "title": "Student Job",
        "content": "Hi!\n\nThis is a random question but what are realistic opportunities for student job for someone who\nwho\n\n○speaks french (c1), italian(b2) and english (c2)\n○loves cooking and baking with some experience in italian dishes (it will never reach your nonna's but it is honest to god)\n\nTo find job in Torino?\nWhat would the salary be?\n\n-Many thanks at advance!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p3lmby/student_job/"
    },
    {
        "id": "1p35el2",
        "author": "glorious-ahole",
        "title": "Things to do other than drinking after 8pm",
        "content": "I am going out with a friend tomorrow and I was wondering what can we do ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p35el2/things_to_do_other_than_drinking_after_8pm/"
    },
    {
        "id": "1p2tgwu",
        "author": "Powerful-Ostrich-120",
        "title": "Stellantis, a Mirafiori 400 nuovi lavoratori per la Fiat 500: non accadeva dagli anni '90",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cHAfJIUPx3EgsITC5QfJu_wNDCfmk4y1cmYEnng3ELY.jpeg?auto=webp&amp;s=f8108675d55a3884c1cacee82607b2559a39ac86"
        },
        "permalink": "/r/torino/comments/1p2tgwu/stellantis_a_mirafiori_400_nuovi_lavoratori_per/"
    },
    {
        "id": "1p2t268",
        "author": "zanard1",
        "title": "disperazione",
        "content": "Premessa: ho scaricato Reddit da poco, quindi spero di star impostando tutto nel modo giusto.\nSalve gente, sono uno studente universitario toscano di 21 anni alle prese, in modo abbastanza disperato, con il tentativo di crearmi un minimo di amicizie qui a Torino. Sono arrivato da un mese preciso e per ora nada. Anche all’università risulta molto più difficile di quanto pensassi.\nQuindi… nel caso esistesse qualche essere umano che ha voglia di fare due chiacchiere dal vivo e provare a fare amicizia, si manifesti. A questo punto provo pure Reddit, non ho altre idee. Poi se la cosa può risultare utile, menzionerei qualche mio interesse giusto per facilitare la cosa come la lettura in generale, testi classici in special modo, cultura pop e musica, tanta musica, special modo indie pop, cantautorato italiano vecchia scuola, rap sulla base di truceboys, in THE panchine ecc. mi farebbe piacere perché ahimè qua sento un po’ di solitudine e sarebbe bello poter alternare lo studio con un po’ di vita sociale. ",
        "upvotes": 13,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1p2t268/disperazione/"
    },
    {
        "id": "1p35fa5",
        "author": "loukasm99",
        "title": "Opinioni su monolocale zona Barca",
        "content": "Tra poco mi trasferirò a Torino e non conosco bene i quartieri migliori in cui vivere, che non siano centro e limitrofi. Mi hanno sconsigliato Barriera, per cui siccome dovrei lavorare nei paraggi di Barca, stavo pensando proprio a Barca.\n\nSarebbe una buona idea andare a vivere lì? Per me un buon quartiere è un quartiere che non sia eccessivamente isolato rispetto al centro e che vi si possa camminare in modo abbastanza tranquillo la sera. Porterei l'auto con me e cercherei un appartamento con box auto.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p35fa5/opinioni_su_monolocale_zona_barca/"
    },
    {
        "id": "1p2x106",
        "author": "ema0897",
        "title": "Gruppi Pokémon Torino?",
        "content": "Sto cercando gruppi per compravendita e scambi di carte Pokémon a Torino,  su whatsapp o telegram.\nQualche idea?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p2x106/gruppi_pokémon_torino/"
    },
    {
        "id": "1p321zt",
        "author": "Criofire",
        "title": "GTT e abbonamenti",
        "content": "Scusate la domanda magari non adattissima ma qualcuno sa per caso se dovessi acquistare l’abbonamento per il parcheggio in piazza San Carlo (sotterraneo) come accedo? Ho provato a chiedere al sevizio clienti ma mi hanno rifilato una riposta automatica… un mio amico ha fatto il settimanale ed è finito col pagare anche il biglietto. Grazie in anticipo! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p321zt/gtt_e_abbonamenti/"
    },
    {
        "id": "1p2su2l",
        "author": "gabrycat28",
        "title": "Orfano del sushi \"Crudo\" del Lingotto, alternative?",
        "content": "A mani bassissime il miglior sushi che abbia mai mangiato e anche ad un ottimo prezzo, poi ritrovato in vacanza a Rimini e a andato a Piacenza solo per lui. Quali alternative di sushi all you can eat a Torino ci sono? Provato Yoshi sushi, Rise, Mik, sushisound, taiyo sushi, Gari ma nulla che si avvicini minimamente al Crudo. Qualche consiglio? ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p2su2l/orfano_del_sushi_crudo_del_lingotto_alternative/"
    },
    {
        "id": "1p2urk3",
        "author": "Floofs-In-Space",
        "title": "Ordering a cab",
        "content": "Hi, I’m staying in Sassi and flying out of town on Saturday at noon. I’ve never taken a taxi before. I was going to reserve one until I realized that a flight delay would be sucky. \n\nI also learned that I can order one on Uber, and a taxi would come. \n\nAny tips or things I should know?\n\nEven if it’s, “Dude, you’re overthinking this. Order it and it will come in 15 minutes or less.”\n\nGrazie.\n\nUPDATE: I ordered the taxi from Uber. It took about 15-20 to arrive. It was more expensive than the app adversite, which was 25 - 40something euro. \n\nIt was 74 euro before the 10% discount. The 18-minute ride was 66.50. ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1p2urk3/ordering_a_cab/"
    },
    {
        "id": "1p2fies",
        "author": "Effect-Imaginary",
        "title": "Miglior ristorante cinese?",
        "content": "edit: Grazie mille, intanto mi scrivo giù questi!",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1p2fies/miglior_ristorante_cinese/"
    },
    {
        "id": "1p2xz72",
        "author": "yotama9",
        "title": "Una domanda strana: qualcuno conosco un negozio ebraico?",
        "content": "Cerco candele per Hanukkah. Qualcuno conosco un negozio? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p2xz72/una_domanda_strana_qualcuno_conosco_un_negozio/"
    },
    {
        "id": "1p23qlv",
        "author": "rightedo",
        "title": "Esiste qualcuno che davvero lavora in full remote a Torino? Quali aziende lo permettono ancora?",
        "content": "Ciao,\n\nCome da titolo mi chiedo se ancora esistono aziende che permettano di lavorare totalmente da casa.\n\nIo sono il solito ingegnere laureato al Poli, lavoro in consulenza per una azienda X e purtroppo sono vincolato ad andare in presenza. Ammetto di coprire un ruolo che fatica a conciliarsi con posizioni full remote, ma sarei tranquillamente disposto ad accettare posizioni entry level. Semplicemente non ce la faccio più a fare il pendolare tutti i giorni per dover poi stare seduto in un open space senza avere nulla da fare la maggior parte del tempo. \n\nVorrei raccogliere una lista di aziende dove l'ambiente di lavoro è sensibile alla qualità della vita e sappia giudicare gli effettivi risultati (perchè secondo me redigere documenti è la stessa cosa se fatto in presenza o a casa, l'importante è che il lavoro sia fatto).\n\nMi chiedo inoltre se esistono luoghi (anche virtuali) dove è possibile creare network con persone che lavorano in questo modo. Perchè non sto ricevendo feedback dai moltissimi annunci a cui contiuno a candidarmi, e pensavo di farmi notare con candidature spontanee provando a raggiungere direttamente le aziende.\n\n ",
        "upvotes": 8,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1p23qlv/esiste_qualcuno_che_davvero_lavora_in_full_remote/"
    },
    {
        "id": "1p20ef9",
        "author": "SimoSian93",
        "title": "Perchè unirsi a gruppi Meetup a caso?",
        "content": "Ho un quesito per tutti voi, che è anche un mezzo sfogo. Gestisco su Whatsapp un gruppo di \"meetup\" in cui ognuno puó organizzare uscite di qualunque tipo, quando vuole, ovunque a Torino o provincia. L'ho pubblicizzato qua e si sono unite almeno una ventina di persone, ma di queste almeno 16/17 poi non si son mai fatte vive e almeno una decina nemmeno presentate. Ecco, la domanda è: perché unirsi ad un gruppo di uscite per poi nemmeno presentarsi o PROVARE ad uscire? 😅 ",
        "upvotes": 9,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1p20ef9/perchè_unirsi_a_gruppi_meetup_a_caso/"
    },
    {
        "id": "1p1i0dm",
        "author": "maschera84",
        "title": "Meloni + Trump in via Lagrange",
        "content": "",
        "upvotes": 128,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5mli1ujfr92g1.jpeg?auto=webp&amp;s=6b03b3b13da2c1fbd18523539fa9cf158e1f88de"
        },
        "permalink": "/r/torino/comments/1p1i0dm/meloni_trump_in_via_lagrange/"
    },
    {
        "id": "1p1vahl",
        "author": "Clan57",
        "title": "Aperitivo @ My Place - Saturday 22, 18:00",
        "content": "Hello! \n\nI am fairly new to the city, and have been attending some expat meetings to try to form a social circle. I will invite those that I have met so far to my home on Saturday for aperitivo. If you would like to join, and bring friends, then leave comment or send me a DM. \n\n  \nThe address is close to Monte Grappa, but I will share it directly with those interested.\n\n  \nThank you!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p1vahl/aperitivo_my_place_saturday_22_1800/"
    },
    {
        "id": "1p23cw3",
        "author": "FutureVirtual6811",
        "title": "Piemonte BIP Transportation Card",
        "content": "Guys if I order a brand new card to my hotels address, would it arrive until monday do you think? (I’m currently outside of Torino)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p23cw3/piemonte_bip_transportation_card/"
    }
]