[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1raq9l7",
        "author": "enoughtodo67",
        "title": "Trovare un gruppo di amici?",
        "content": "Ciao! \nMa è possibile trovare un gruppo di amici sulla ventina, in cui includere un ragazzo molto timido ma con tanta voglia di avere amicizie?☺️",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1raq9l7/trovare_un_gruppo_di_amici/"
    },
    {
        "id": "1rb3oyh",
        "author": "TostVolante",
        "title": "Locali per metal dal vivo",
        "content": "ciaoo! Sono nuovo a Torino e cercavo di capire se ci sono locali dove si esibiscono band metal (doom in particolare) anche poco conosciute, o posti che fanno musica dal vivo di ogni tipo e in passato hanno invitato band metal. \n\nAnche pagine che pubblicizzano eventi così su Torino sono apprezzate!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rb3oyh/locali_per_metal_dal_vivo/"
    },
    {
        "id": "1rb2rxd",
        "author": "QualityLazy",
        "title": "Digital SAT for UniTO",
        "content": "Ciao. I am currently studying in University of Messina and planning on transferring to university of Turin by reapplying as a freshmen. Since that, I need to take the SAT exam, what I have been currently preparing for. I am very curious of the average SAT score of the 2025/26 year’s applicants. If any Unito Business and Management program student is reading this rn, please, tell me what was your score that got you in the university 🙏",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rb2rxd/digital_sat_for_unito/"
    },
    {
        "id": "1rb1h29",
        "author": "Erleyx",
        "title": "Need a place to stay for one night (willing to pay)",
        "content": "Hey everyone,\n\nI’m in a tough situation right now and was unexpectedly kicked out by my parents today. I’m looking for a safe place to stay just for one night while I figure things out.\n\nI’m respectful, clean, and can pay for the stay. I don’t need much, just somewhere safe to sleep. If anyone is willing to help or can point me toward a safe option, I’d really appreciate it.\n\nPlease DM me if you can help. Thank you.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1rb1h29/need_a_place_to_stay_for_one_night_willing_to_pay/"
    },
    {
        "id": "1rb03a3",
        "author": "Fit-Chemist5054",
        "title": "val chisone e germanasca",
        "content": "Ciao Reddit,\n\nc'è qualcuno che abita o frequenta la val chisone\\\\germanasca?\n\nDa Pinerolo a Sestriere passando chiaramente anche per Prali.\n\nVolevo confrontarmi, io amo questa valle ma al contempo è difficile poterci vivere\\\\lavorare, non ci sono attrazioni per la vita quotidiana, attività da svolgere né aziende abbastanza strutturate da permettere sicurezza e continuità lavorativa.\n\nMi piacerebbe mi deste il vostro parere e sentire idee su cosa si potrebbe fare per cercare di avere una valle più viva e con un'economia che permette di poterci vivere senza fare 100km al giorno per scendere in città.\n\nAd esempio mi chiedo perché non nascano aziende manifatturiere, luoghi per fare sport, perché non venga riutilizzato il palazzo delle olimpiadi per creare attività, perché non ci siano maggiori luoghi di aggregazione o per fare sport.\n\nCome gestite l'assenza di queste strutture\n\nCome gestite il lavoro?\n\nQuali sono le cose che più mancano secondo voi?\n\nSe possibile non vorrei innescare polemiche, quanto più cercare di tirare fuori argomenti costruttivi.\n\nGrazie a chi avrà voglia di rispondere ed argomentare.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rb03a3/val_chisone_e_germanasca/"
    },
    {
        "id": "1rayvto",
        "author": "Different_Yam8152",
        "title": "Offro Petsitting a Torino",
        "content": "Ciao! Volevo cercare un modo per offrire petsitting a cani e gatti, visto che al momento non posso avere animali. Vorrei curare animali a un prezzo irrisorio oppure se c'è qualche posto in cui fare volontariato. Conoscete qualche realtà/persona che cerca?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rayvto/offro_petsitting_a_torino/"
    },
    {
        "id": "1raoa5b",
        "author": "Ms_Stregatta1890",
        "title": "Bilance pesapersone a Torino",
        "content": "Ciao, è una domanda un po' inusuale, spero che qualcuno sappia rispondermi.\n\nCerco un posto (farmacia, centro commerciale o altro) dove sia presente una bilancia pesapersone, di quelle che rilasciano lo scontrino con tutti i dati di peso, altezza ecc.\n\nSto seguendo un percorso di dimagrimento con una nutrizionista, ed ho notato che le bilance che ho  in casa riportano sempre un peso diverso da quello registrato, al massimo mezz'ora dopo, nello studio della nutrizionista. So che il peso varia anche di ora in ora, ma qui parliamo di chili di differenza, non grammi... So che basterebbe provare a ritirarle, ma sono del tipo elettronico che va ora e credo che sia proprio un loro difetto. Potrei comprarne un'altra, ma temo lo stesso problema.\n\nVivo a Torino nord, quindi sarebbe top se ce ne fossero da queste parti, ma posso recarmi ovunque in città, nel caso.\n\nGrazie mille!",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1raoa5b/bilance_pesapersone_a_torino/"
    },
    {
        "id": "1ravfau",
        "author": "GodAmIBored",
        "title": "Cene con mistero a torino/dintorni?",
        "content": "Buongiorno a tutti, volevo chiedere se qualcuno qui avesse esperienza/consigli per una evento cena con mistero, che vorrei regalare a una parente. La parente in questione è vegetariana, ma a parte quello mi pare ci siano diversi posti in città che organizzano cose simili, e se qualcuno avesse un parere imparziale su uno di loro, lo apprezzerei molto. Temo di pigliarmi una stangata sui denti con una truffa o un servizio scadente. grazie mille in anticipo!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ravfau/cene_con_mistero_a_torinodintorni/"
    },
    {
        "id": "1rav2r7",
        "author": "Sharews",
        "title": "Tatuatore consigli",
        "content": "Hello, mi sono trasferito da poco e cerco un buon tatuatore, vorrei fare qualcosa stile concept minimal ma ancora da progettare. Consigli? Possibilmente non uno con liste d’attesa infinite (anche se potrei valutarlo se è davvero bravo) dato che vorrei farlo nei prossimi mesi\n\nThanksss",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rav2r7/tatuatore_consigli/"
    },
    {
        "id": "1rapbid",
        "author": "EducationalTicket458",
        "title": "serate",
        "content": "Sono a Torino da circa 3 mesi per studio M22 e purtroppo non ho ancora avuto l'opportunità di fare serata con qualcuno che ne avesse genuinamente voglia, mi va bene un po' di tutto ma assolutamente no techno/elettonica. se vi va sentiamoci ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1rapbid/serate/"
    },
    {
        "id": "1rau3t1",
        "author": "GearBrilliant1924",
        "title": "Pane buono!",
        "content": "Ciao a tutti.\nMi consigliate un panificio, che secondo voi, vende del buon pane.\nRiferimento zona/e: Torino sud, ma anche  Comuni limitrofi tipo Nichelino/Beinasco.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rau3t1/pane_buono/"
    },
    {
        "id": "1rasxnm",
        "author": "Salty-Dragonfruit-",
        "title": "English speaking friend",
        "content": "Ciao tutti. I’ve been living in Turin for a short time, and I don’t know how to speak much Italian yet, but my English is good. I’m looking for an Italian friend who can speak English. We can do a language exchange together.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1rasxnm/english_speaking_friend/"
    },
    {
        "id": "1rarfyr",
        "author": "Project-PhoenX",
        "title": "Sviluppatore mobile (iOS/Android)",
        "content": "Ciao!\n\nSto lavorando a un progetto \"early-stage\" in ambito mobilità urbana e vorrei costruire un MVP mobile. Voglio precisare che non voglio offrire attività \"a ticket\" ma l'intento, se l'MVP piace è di andare avanti in modo più strutturato. Cerco quindi qualcuno, nell'area torinese, che voglia crederci e che sia disposto a scommettere assieme a me per costruire qualcosa di interessante.\n\nSe interessati, contattatemi.  \nCiao",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rarfyr/sviluppatore_mobile_iosandroid/"
    },
    {
        "id": "1raquzz",
        "author": "nicco_lo",
        "title": "Migliori zone per vivere a San Salvario?",
        "content": "Ciao a tutti, io e la mia ragazza cerchiamo un trilocale in zona Crocetta/Cenisia/San Salvario. Sappiamo che a San Salvario ci sono zone migliori e zone peggiori, sapreste dirci quali sono quelle da evitare? Grazie mille",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1raquzz/migliori_zone_per_vivere_a_san_salvario/"
    },
    {
        "id": "1raq1by",
        "author": "blckapodemus",
        "title": "Lingue e letterature moderne (L-11) o Lingue e culture dell'Asia e dell'Africa (dipartimento umanistico) Unito",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1raq1by/lingue_e_letterature_moderne_l11_o_lingue_e/"
    },
    {
        "id": "1r9rosv",
        "author": "ProfessionalIcy306",
        "title": "Qualche azione per aiutare il Comala?",
        "content": "Ormai lo saprete, il Comala chiude il perchè e il come ve lo lascio spiegare a chi ha creato questa realtà \nhttps://www.instagram.com/reel/DU886JCEg6C/?igsh=aDVsZ2sxeG03ZWto\n\nCosì come vi lascio qualche link utile per capire che tipo di associazione prenderà il suo posto.\n\nhttps://radioblackout.org/podcast/macerie-su-macerie-podcast-29-4-24-storia-e-storie-del-terzo-settore-il-caso-di-almaterra-ed-eufemia/\n\nhttps://torinocronaca.it/news/torino/533911/sfruttamento-nel-terzo-settore-prima-udienza-della-causa-contro-escape4change.html\n\nhttps://www.rainews.it/tgr/piemonte/video/2024/04/torino-lavoro-terzo-settore-assemblea-polo-900-f8763505-b3b8-469b-b20b-4b99e95f10d5.html\n\nhttps://napolimonitor.it/uno-sgombero-per-via-amministrativa-la-vicenda-di-comala-a-torino/\n\nVi lascio anche la mail del presidente dell'associazione per esprimere pacatamente i vostri dubbi e rispondere a eventuali vostre contestazioni pasquale.lanni@eufemia.eu. \n\nMa ora veniamo a noi. Che fare per aiutare il Comala? \nSono certo organizzeranno manifestazioni a suo favore, ma nel frattempo? Beh nel frattempo rompiamo loro i coglioni.\n\nA iniziare dalla circoscrizione 3 che è la responsabile del bando.\n\nhttps://decentramento.comune.torino.it/circoscrizione3/amministrazione/uffici/segreteria-presidenza\n\nChi può (soprattutto i residenti) chiami, prenda appuntamento, protesti. Chi non può mandi loro una mail per far sapere loro il nostro disappunto.\n\nMa non solo:\n\nPer contattare il Sindaco di Torino, Stefano Lo Russo, è possibile inviare una e-mail alle caselle istituzionali stefano.lorusso@comune.torino.it o sindaco.lorusso@comune.torino.it\n\nFatelo. Se siete elettori PD comunicategli la vostra intenzione di votare chiunque altro. Se non siete elettori PD... fatelo comunque.\n\nhttps://c.org/8WxZJjxTds c'è anche questa petizione su change\n\nSe avete altre idee o conoscete altre informazioni che possono essere utili aggiungetele e le integrerò nel post. Non lasciamo morire il Comala.\n\n",
        "upvotes": 102,
        "comments": 84,
        "media": null,
        "permalink": "/r/torino/comments/1r9rosv/qualche_azione_per_aiutare_il_comala/"
    },
    {
        "id": "1rabmvk",
        "author": "Embarrassed_Voice852",
        "title": "I want to start a new life",
        "content": "Hello everyone sorry for the long post I'll jeep it as short as i can.So I am 27 years old in Greece.I want to gather money and move in Torino in December.My plan is to give til i in may 2027 for automotive engineer.Thing is i must also survive so I will bartend.I have 6,5 years experience as a waiter and 2,5 years experience as a bartender.I am starting now learning basic Italian and lessons will be a big hit in my budget.I would be really grateful if anyone here can help me.My plan is to land a job while simultaneously finding a decent house to rent with my gf.If anyone here knows where i should search for a job that they won't mind that I don't soeak fluent italian yet or if anyone wants to help with other informations i would really appreciate it.Thanks",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1rabmvk/i_want_to_start_a_new_life/"
    },
    {
        "id": "1ra7bw7",
        "author": "aranor01",
        "title": "Pedalata Easy Riders",
        "content": "Form di iscrizione e info:  https://docs.google.com/forms/d/e/1FAIpQLSfZh3iv3docef67hcdRLWcN1aO5AMykSWtMkvYdKYEOdWHqMQ/viewform",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ra7bw7/pedalata_easy_riders/"
    },
    {
        "id": "1r9q1sp",
        "author": "Ko_tatsu",
        "title": "Situazione Comala: le parole del presidente Andrea Pino",
        "content": "Tutta l'amarezza e lo scoramento della situazione sono concentrati in questo video.\n\nÈ una vergogna ed è l'ennesimo insopportabile affronto di una città che tutto vuole essere tranne che a misura di giovane. \n\nIo credo che per chiunque sia di Torino questo modus operandi di gestire il potere da parte del PD non sia assolutamente nuovo. Tra poco inizierà lo scaricamento della patata bollente agonistico con il sindaco che dà la colpa alla circoscrizione che dà la colpa ai tecnici che al mercato mio padre comprò. \n\nÈ necessario che noi giovani e cittadini mettiamo alle strette la politica per quello che è successo. Ora aspetteremo il ricorso, ma una mobilitazione è d'obbligo. ",
        "upvotes": 61,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1r9q1sp/situazione_comala_le_parole_del_presidente_andrea/"
    },
    {
        "id": "1r9syx8",
        "author": "VecchioDiM3rd1955",
        "title": "Ciao Supermarket",
        "content": "Lo scorso weekend il Supermarket in via Madonna di Campagna ha chiuso.\n\nIo lo frequentavo ai tempi della lira ed era una discoteca carina, poi i giri sono cambiati. Mi son detto un giorno o l'altro di farci un giro. Poi ho letto che stava per chiudere e quindi sono andato.\n\nOra non so come fosse nelle altre serate, ma era pieno, c'era tanta gente, selezione musicale particolare. A vedere le ultime serate uno si domanda come mai abbian deciso di chiudere.\n\nMa poi una risposta me la son data. La zona e' periferica, se uno vuole andare li' con i mezzi pubblici o torna in taxi o fa chiusura e prende il primo 77 del mattino. Se uno va in macchina come ho fatto io al bar prende succhi e bicchieri d'acqua.\n\nL'altro problema che c'era e' mi sa la demografia. Per me va benissimo se sono tutti della GenX e qualche Xennial, ancor meglio dato che non c'erano truzzimaranzatamarri. Ma d'altra parte non c'erano i giovani, o comunque persone sotto i trenta. \n\nE questo mi fa supporre che poca gente alla fine andasse li`.\n\nso benissimo che alla fine sono anche io parte del problema, ma ormai sono vecchio, e B52 ed Angeli azzurri meglio lasciarli perdere, e se poi uno deve guidare alcool proprio nulla.\n\nPero' avessi saputo prima che in quel locale alla fine la situazione era carina magari ci sarei andato prima.",
        "upvotes": 23,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1r9syx8/ciao_supermarket/"
    },
    {
        "id": "1r9aknb",
        "author": "Frads01",
        "title": "alternative al comala?",
        "content": "è abbastanza scontato che con la nuova gestione diventerà una bella merda in pieno stile milanese.\n\ndetto questo, sapete se siano rimasti ancora degli spazi di incontro simili, dove si respiri un po' di naturalezza e si possa socializzare senza dover per forza fatturare con uno spritz in mano? oltre ai classici centri sociali \"a rischio\" tipo el paso o il gabrio, per citarne alcuni.\n\np.s. ovviamente tutta la mia solidarietà va agli ex-gestori e a chi ha collaborato con loro. se state leggendo, grazie per tutto ciò che avete fatto in questi anni. ❤️",
        "upvotes": 68,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1r9aknb/alternative_al_comala/"
    },
    {
        "id": "1r93amf",
        "author": "Gheebss",
        "title": "Il Comala chiude ma io no",
        "content": "Ragazzi non vi preoccupate, se mi cercate sarò a ubriacarmi come un matto davanti ai cancelli del comala ogni venerdì e sabato per il resto dei pochi giorni che mi rimangono su questa terra.\n\nProject C\n\n",
        "upvotes": 82,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y7QYPM7TXxACcnsGWq_uGFl4-ZWpXFV8PX0BTcjX_mA.jpeg?auto=webp&amp;s=602f252f76845a6e0d695d45800d3c52707708d6"
        },
        "permalink": "/r/torino/comments/1r93amf/il_comala_chiude_ma_io_no/"
    },
    {
        "id": "1r9y02l",
        "author": "Infamous_Award7847",
        "title": "Cerco terreno agricolo",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r9y02l/cerco_terreno_agricolo/"
    },
    {
        "id": "1r8zya5",
        "author": "nickname1917",
        "title": "Dopo Sinner...il nulla",
        "content": "Sono passati due mesi dalla fine delle ATP e Piazza d'Armi è ancora in questo stato: una bella fetta di parco è inaccessibile e trascurata.\n\nDobbiamo aspettare il ritorno di Sinner per renderla ancora più inaccessibile ma bella agli occhi dei turisti?\n\nIo posso capire che ormai si viva per quelle due settimane ma non è corretto nei confronti dei torinesi che pagano le tasse e che non hanno ritorni diretti (e forse neppure indiretti) dalle ATP lasciare le aree verdi in quello stato.\n\nhttps://preview.redd.it/yu1g8q3ijgkg1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=ef4569989908ec1b8d51a04533b1c5f977df8f24\n\nhttps://preview.redd.it/w6md8hhjjgkg1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=a96bc89a98213f155f50a52ad2b38108625aa0d5",
        "upvotes": 50,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r8zya5/dopo_sinneril_nulla/"
    },
    {
        "id": "1r8s3l0",
        "author": "lokumbu",
        "title": "Could someone help me in turino :(",
        "content": "Forgot my new airpods in the plane yesterday and they popped up in turino. Is there anyone who'd like to go on a mission for me? Or any other ideas?",
        "upvotes": 93,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wpdfvromdekg1.jpeg?auto=webp&amp;s=a58e86deac47a8e28454909ff0fea3f626c53790"
        },
        "permalink": "/r/torino/comments/1r8s3l0/could_someone_help_me_in_turino/"
    },
    {
        "id": "1r9a82n",
        "author": "Feeling-Conflict3214",
        "title": "Vivere in Via Borgo Dora, fattibile?",
        "content": "Mi chiedevo se per una ragazza sui 30 (quindi vita da lavoratrice) come possa essere vivere lì. Ho visto una casa e sono andata appositamente di sera (18.45/19).\n\nLa zona è proprio dove si trovano i locali e le bancarelle ed è molto carino quel tratto di strada, ho visto anche delle signore portare tranquillamente a spasso i cani, c’era ancora via vai, per il resto i locali e i negozi già chiusi\n\nMa considerando tutte le circostanze di vita quotidiana:\n\n\\- quando arriveranno le belle serate, sarebbe sicuro rientrare anche alle 22/23 da sola in sicurezza?\n\n\\- nelle commissioni quotidiane, spesa e giri vari, bisognerebbe davvero stare sempre allerta?\n\nNon avendo la patente e non uscendo più di un paio di volte a settimana, ho un budget mensile per il taxi, oppure ogni tanto mi riporta a casa un amico, in alternativa dovrei preoccuparmi?\n\nIl casinò è la movida non mi preoccupano, più che altro le tratte da e per casa.\n\nQualcuno ha avuto esperienza di inquilino in zona?\n\nAggiornamento: il problema è che per raggiungere via borgo Dora bisogna necessariamente passare per porta palazzo o corso Giulio Cesare, ci sono alternative?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r9a82n/vivere_in_via_borgo_dora_fattibile/"
    },
    {
        "id": "1r8zxcj",
        "author": "Diecinavetta",
        "title": "Comala Torino: Pd querela Pino dopo il bando perso. Sinistra divisa su Askatasuna - La Stampa",
        "content": "Torino sta cambiando volto e sta cercando di diventare una piccola Milano, a pagare il prezzo sono i luoghi di aggregazione giovanile storici della città. Paradossalmente ci si aspetterebbe questi interventi da un amministratore di centrodestra e invece...",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r8zxcj/comala_torino_pd_querela_pino_dopo_il_bando_perso/"
    },
    {
        "id": "1r9d8it",
        "author": "AfraidAd2805",
        "title": "Corsi serali artistici",
        "content": "buongiorno a tutti,\n\nsapete se ci sono corsi/attività o altri serali a Torino?\n\nSarei interessata in particolare a corsi di disegno o pittura, però anche semplici incontri andrebbero bene, è più per tornare a disegnare e intanto fare anche amicizia.\n\nHo 28 anni e sono da poco in città, ho pensato fosse un ottimo modo per integrarmi ma accetto consigli.\n\ngrazie a tutti",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r9d8it/corsi_serali_artistici/"
    }
]