[
    {
        "id": "1jc5dnt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Ana de Armas - Thursday 5/15 at 12:00 PM ET - Star of Ballerina, Knives Out, Blonde, Blade Runner 2049, No Time To Die, Ghosted, The Gray Man, Deep Water",
        "content": "",
        "upvotes": 453,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ml59cp306xoe1.png?auto=webp&amp;s=87978abf99e5d5093cea308eac8d21af24e0ee3f"
        },
        "permalink": "/r/movies/comments/1jc5dnt/amaqa_announcement_ana_de_armas_thursday_515_at/"
    },
    {
        "id": "1jc3g7s",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Kelly Marie Tran - Monday 3/17 at 1:00 PM ET - Star of Raya and the Last Dragon, The Croods: A New Age, Control Freak, Star Wars: The Last Jedi, The Wedding Banquet",
        "content": "",
        "upvotes": 45,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7kkdptrnqwoe1.png?auto=webp&amp;s=1f6b3afd76013a178178305ad471b16e98131c7c"
        },
        "permalink": "/r/movies/comments/1jc3g7s/amaqa_announcement_kelly_marie_tran_monday_317_at/"
    },
    {
        "id": "1jc1ifd",
        "author": "BunyipPouch",
        "title": "First Poster for 'Neighborhood Watch' - Starring Jack Quaid &amp; Jeffrey Dean Morgan - When a mentally ill young man witnesses an abduction and the police refuse to believe him, he reluctantly turns to his next door neighbor- a bitter, retired security guard- to help him find the missing woman.",
        "content": "",
        "upvotes": 1723,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oa1vq485bwoe1.jpeg?auto=webp&amp;s=0e5cc4c3ef6abf9489f41d99c67a39fddb77b61d"
        },
        "permalink": "/r/movies/comments/1jc1ifd/first_poster_for_neighborhood_watch_starring_jack/"
    },
    {
        "id": "1jc8t7z",
        "author": "OneFirefighter1233",
        "title": "12 angry men Is the most interesting movie i've ever watched",
        "content": "Hi, so first and foremost i know it's one of the greatest movies ever made, well i didnt know It until Yesterday when i watched the movie, i only knew that It was a good film and i wanted to Watch It.\n\nIt's incredible that a movie made 60+ years ago and shot mainly in One room, with 90% of the script which Is characters talking to each Other, sits as the most interesting movie i've ever watched in my life. \n\nListen, i'm not a cinephile and i dont know really nothing about cinema, i watched some movies but forgot most of them, i only care for the plot and what Is going on, if that movie keeps me interested Is good, if not i move on, and this movie Is the best thing i've ever watched, and i'm not exaggerating.\n\nI didnt find something in my life that hooked me so much and i recommend everyone to at least give a try if you didnt watch it",
        "upvotes": 178,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1jc8t7z/12_angry_men_is_the_most_interesting_movie_ive/"
    },
    {
        "id": "1jc50kh",
        "author": "Drakhanfeyr",
        "title": "Alien Romulus - WOW!",
        "content": "I was in high school when the first Alien movie came out, I've seen all of them and I love the series.  Decades later, I thought I might not enjoy Alien Romulus. Boy was I wrong. This film has new, younger characters who are believable and (mostly) likeable, a well-written story, interesting subplots/ back stories which don't detract from the main storyline, a new artificial life character who is different from any we have seen before, plus some tub-thumping one-liners which pay homage to Ripley. This is probably the second best movie of the entire franchise, after Aliens.",
        "upvotes": 230,
        "comments": 244,
        "media": null,
        "permalink": "/r/movies/comments/1jc50kh/alien_romulus_wow/"
    },
    {
        "id": "1jc3qga",
        "author": "soviet_turd",
        "title": "the use of color in \"Her\" is just genius",
        "content": "I'll begin by saying that this movie is absolutely one of the most beautiful films ive ever seen. The bright colors (red, orange, yellow and green) have such an impact on the vibe of the film. With that said, Theo wears ALOT of red and orange colors. Similarly, the OS1 primary color is a bright orange which matches his shirt in the posted frame. Colors like red and pink symbolize love, and In this case, the start of Theodore and Samanthas romantic journey. Theodore continues to wear these bright orange/red shirts during the \"Honeymoon phase\" (as Theodore calls it) of their relationship. It signifies a healthy beginning to true love.\n\nHowever, as we dive into the issues that Theo and Sam face, he wears more neutral colors such as pale blue and white. When Sams prostitute shows up, Theo is wearing a white shirt. In this moment Theo is extremely uncomfortable, as he is being asked to have sex with someone hes never met by his computer girlfriend. This ultimately causes a pretty deep split between the two, probably the biggest we see in the whole movie aside from the breakup.\n\nAlthough It is a pretty obvious detail, the color usage is a very nice touch in my opinion. I love that colors symbolize the strength and status of Theo and Sams relationship as the movie plays on.\n\nhttps://preview.redd.it/6vmtsjj4twoe1.jpg?width=1064&amp;format=pjpg&amp;auto=webp&amp;s=9c0480a652ffe064fcd40d642c62d3100348a651\n\n",
        "upvotes": 207,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1jc3qga/the_use_of_color_in_her_is_just_genius/"
    },
    {
        "id": "1jbus8b",
        "author": "Scarpine1985",
        "title": "Question about Rampart (2011) staring Woody Harrelson (delicate issue discussed)",
        "content": "Is the implication that Woody's character has molested his daughters? The film seems to drop oblique hints, but does not address it directly:\n\n- In the opening scene, he has an uncomfortable conversation with the lady cop asking if her daddy ever \"disciplined\" her.\n\n- He has a very weird family dynamic where he has fathered each daughter by two sisters, and they all live together. The younger daughter is even a bit confused by this and ask if she's the product of incest.\n\n- The older daughter despises him and becomes very upset whenever he touches her.\n\n- There's a scene where he invites the younger daughter to watch TV with him instead of doing homework, and says \"we won't yell mom.\" He sits on the couch with his arm around her, and the camera lingers on him as he looks at her.\n\n- In the scene where the daughters visit him in the hotel room, he says \"I've never hurt you\" and the you ger daughter becomes upset to the point where she can't even speak and the older daughter rushes her out.\n\nIs this what the film was implying?",
        "upvotes": 629,
        "comments": 216,
        "media": null,
        "permalink": "/r/movies/comments/1jbus8b/question_about_rampart_2011_staring_woody/"
    },
    {
        "id": "1jc02a4",
        "author": "Buffalo_wing_eater",
        "title": "Really enjoyed watching L.A. Confidential",
        "content": "The film excels in every aspect to make a good film about police and investigating. Although I was not well-acquainted with the film prior to viewing, the title struck a chord with me, and I was thoroughly impressed throughout. It is arguably one of the finest, if not the best, police investigation films I have ever encountered.",
        "upvotes": 284,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1jc02a4/really_enjoyed_watching_la_confidential/"
    },
    {
        "id": "1jbtddq",
        "author": "sp0rkah0lic",
        "title": "Rewatching The Royal Tenenbaums and crying at the end",
        "content": "Yeah I'm drunk. Yeah I've seen it 20 times . Maybe some AI auto mod will flag me. But I don't care. I\"ve loved this movie for 20 years. It's basically perfect. I watched Crimson Tide and Enemy of the State tonight too. RIP Gene you're amazing and we will never forget you. He died saving all of us from a sinking battleship and idgaf what CNN says. ",
        "upvotes": 538,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1jbtddq/rewatching_the_royal_tenenbaums_and_crying_at_the/"
    },
    {
        "id": "1jc8h2y",
        "author": "dimestorepublishing",
        "title": "\"The Last Witch Hunter\" A terrible movie that I loved",
        "content": "Okay, so yes, this is a bad movie, B movie all the way, was not stunning, was not amazing, but damn it dude, I had a blast watching this, like, Vin Disel doing all his most Vin Diseliest things, stupid plot, totally ridiculous, for some reason Michael Cane is in this thing. \n\nI did some research and found out that, much like Riddick, this movie was based on one of Vin's DnD characters. Like, all us dorks out there who play table top think \"Man a movie about my character would be so awesome,\" and spoiler, no, it would be stupid, and we have proof of that BECAUSE THERES A GUY OUT THERE NAMED VIN DISEL WHO SOMEHOW GOT ENOUGH MONEY TO MAKE MOVIES BASED ON HIS CHARACTERS and they're terrible, but they're so FUCKING fun!\n\nThe entire movie is tropes, EVERY scene, is a trope, its kind of amazing, I had a blast watching this 4/5 would recommend.",
        "upvotes": 58,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1jc8h2y/the_last_witch_hunter_a_terrible_movie_that_i/"
    },
    {
        "id": "1jbdmzg",
        "author": "MarvelsGrantMan136",
        "title": "New ‘Starship Troopers’ Movie in the Works from ‘District 9’ Filmmaker Neill Blomkamp",
        "content": "",
        "upvotes": 9102,
        "comments": 1000,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Tw9WB0JXhuexfEQgFQ4nNh0q2Qa6w4OTY4L9JJZoS3I.jpg?auto=webp&amp;s=b9585ec2082066cb9910c00fb3981f4bd30dcc4b"
        },
        "permalink": "/r/movies/comments/1jbdmzg/new_starship_troopers_movie_in_the_works_from/"
    },
    {
        "id": "1jc5gqy",
        "author": "Calzonieman",
        "title": "I saw 3 billboards outside Ebbing Missouri when it came out, but just rewatched it again and came away far more impressed.",
        "content": "I must have been preoccupied, or in a crappy mood or something the first time, because while I didn't dislike it, I didn't remember being overly impressed.\n\nThis time, I was fully focused and came away giving it a 9+stars.\n\nI've always enjoyed Francis McDormand and Woody Harrelson, and I've always though Sam Rockwell was totally underrated, but the performances of Peter Dinklage was a role that I'd never seen him play, and was amazing. I don't remember John Hawkes being in this, and he's superb in every role he plays.\n\nAnyway, I'd recommend anyone checking this out again, or definitely catch it if you've never seen it before.",
        "upvotes": 77,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1jc5gqy/i_saw_3_billboards_outside_ebbing_missouri_when/"
    },
    {
        "id": "1jc2q5l",
        "author": "Sergio_Ro",
        "title": "Name a bad or painfully mediocre movie with a surprisingly good ending",
        "content": "I’ll start, and to clarify, by ending I don’t mean an entire third act, but rather just the final 5-10 minutes or so that for some reason prove way more enjoyable than what the movie was letting on might happen.\n\nMy pick is Death Note.\n\nI feel as though the source material would have been enough to make a great movie, but instead we ended up with this Final Destination doppelgänger. So many things didn’t land right, and yet I thoroughly enjoyed the ending, how it came together, the music they used to set the mood and LaKeith Stanfield’s performance.",
        "upvotes": 92,
        "comments": 371,
        "media": null,
        "permalink": "/r/movies/comments/1jc2q5l/name_a_bad_or_painfully_mediocre_movie_with_a/"
    },
    {
        "id": "1jb7ge4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Freakier Friday'",
        "content": "",
        "upvotes": 12880,
        "comments": 1186,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gc5ivwt7iooe1.jpeg?auto=webp&amp;s=b6aef256d3f81533d63c513ca841ea93554708a7"
        },
        "permalink": "/r/movies/comments/1jb7ge4/official_poster_for_freakier_friday/"
    },
    {
        "id": "1jbty2j",
        "author": "Pooseygeuse",
        "title": "Rare 1980 Japanese Documentary feat. Interviews With Stanley &amp; Vivian Kubrick &amp; Ending Explanations for 2001 &amp; The Shining (skip to 49:50 for those)",
        "content": "",
        "upvotes": 153,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1COZFtd-PN3nD9gpjTHBhF4JWZz1yokTxTnkl-LjkQc.jpg?auto=webp&amp;s=5a029f740c324d43963a287b3448cea9389cbe02"
        },
        "permalink": "/r/movies/comments/1jbty2j/rare_1980_japanese_documentary_feat_interviews/"
    },
    {
        "id": "1jc1njw",
        "author": "IndyO1975",
        "title": "Passing It On…",
        "content": "I was 7 when I saw E.T. THE EXTRA-TERRESTRIAL in the cinema for the first time. \n\nMy dad took me down to the Cinerama Dome in Hollywood and I remember we waited in a long line. A VERY long line. \n\nMy grandmother had taken me to see RAIDERS the year before at the Mann’s Chinese and the film had terrified and exhilarated me, but at 6, I’d spent a good portion of the film peeking through my grandmother’s fingers as she covered my eyes with her hand. That would not be the case with E.T. - though I recall the beginning was a bit scary for me. \n\nI was immersed in the film almost immediately and by the end I was sobbing when I thought (spoiler alert for a 43 year-old film) E.T. had died, elated when he came back to life and crying all over again when it was time for E.T. to return home. \n\nI saw the film easily a dozen times in the theater. Back then movies would play for 6, 8 or even 9 months. And then Universal rereleased it. My grandmother would take me almost every weekend to see it at the Edward’s El Toro Cinema. It was, for a long time, the only thing I wanted to do when I’d visit her. It’s no wonder the film was the highest-grossing of all time for eleven years (a record it held until Spielberg's own JURASSIC PARK surpassed it in 1993). \n\nCut to 2024 and a friend found a beautifully illustrated children’s book of the film and bought it for me. I read the book to my 4 year-old who loved the pictures and became fascinated by it in storybook form. In retrospect, I wish I’d waited to read it to him, but the book doesn’t include a lot of what’s in the film and, of course, can never reach the level of emotion. \n\nI had planned to wait until my son was 7 and, based on my experience, the critical age to be absorbed emotionally by the brilliance of Spielberg, the stunning performance of young Henry Thomas as ‘Elliott,’ the supporting cast and the sheer overwhelming genius of John Williams’ score… but having loved the book so much, he kept asking to see the movie so, tonight, I finally pulled out the 4K disc, shut off all the lights and turned up the surround. \n\nI was not disappointed. Even knowing many of the beats from the film, my son was completely transported - to the point that, during the scenes with the doctors, he turned to me and was legitimately worried that this was where the storybook and the film would diverge. His eyes were watery and he asked, “wait, Dada, he’s not really dying is he? …Is he?!”\n\nBy the end, I was reduced to a puddle again (there is no faster way to connect me with my inner 7 year-old than to put that film on or play that score) and my 5 year-old watched in rapt attention, weeping as E.T. and Elliott said their goodbyes. \n\nAs the credits rolled he looked at me, wiped his eyes and smiled. He said, “Dada I loved it.” And then, a moment later, said, “now I can watch it anytime.”\n\nThanks for reading if you did. \n\n\n\nIf you didn’t: Tldr: Showed my kid E.T for the first time. It played perfectly. \n\n\nWhat was a film that knocked you out that you got to share with someone in your life who had never seen it (a friend, a family member, whoever)? How did they react to it and what was that experience like for you, re-experiencing it with someone?\n\n\n\n\n\n",
        "upvotes": 38,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jc1njw/passing_it_on/"
    },
    {
        "id": "1jbfagc",
        "author": "InviteAromatic6124",
        "title": "What moments in movies made you think \"why did they have a baby/child?!\"",
        "content": "I watched \"A Quiet Place\" not long ago and I know why the couple decided to have another baby (to replace the one who they lost), but my god what were they thinking having an extreme noise-maker when they're being hunted by aliens that are sensitive to sound?! Plus, why would they want to have a baby in a potential world where death is at every corner?\n\nAny time a couple has a baby in a film where there is an apocalypse going on I ask the same question.",
        "upvotes": 1621,
        "comments": 533,
        "media": null,
        "permalink": "/r/movies/comments/1jbfagc/what_moments_in_movies_made_you_think_why_did/"
    },
    {
        "id": "1jbmhdw",
        "author": "Voodoo_Shark",
        "title": "No, WB Didn’t “Favor” This Looney Tunes Movie Over Coyote vs. Acme—They Abandoned Both. But One Survived.",
        "content": "It would be easy to assume that *The Day the Earth Blew Up* is the movie Warner Bros. chose to support while *Coyote vs. Acme* was the one they tossed aside. That narrative would almost make sense—one was buried for a tax write-off, and the other actually made it to theaters. But that’s not the real story.\n\n[It’s not an either-or situation, it’s a ‘WB screwed over both, but one got out situation.](https://preview.redd.it/ulcjmuo6zroe1.png?width=1500&amp;format=png&amp;auto=webp&amp;s=674172cb353bf0ae70941c17a6762cf12424eb6b)\n\nThe truth is, WB abandoned **both** movies. They didn’t choose The Day the Earth Blew Up over Coyote vs. Acme—they just happened to **sell this one off to Ketchup Entertainment like a piece of scrap they had no use for.** If Ketchup hadn’t stepped in to save it, WB wouldn’t have cared whether it ever saw the light of day. This isn’t a case of Warner Bros. picking one Looney Tunes project over another. It’s a case of an independent distributor **giving a damn when WB didn’t**.\n\nYou can still be angry about what happened to *Coyote vs. Acme*. You can still hate that WB is gutting its animation division and treating finished films like tax loopholes. But here’s what makes *The Day the Earth Blew Up* different: **it got out.** And because it got out, we have a rare chance to show WB that selling off Looney Tunes was a mistake.\n\n**Warner Bros. doesn’t make a single dime from this movie—they sold it off and walked away.**\n\nThis isn’t just another nostalgia cash-in. It’s a full-length, **hand-drawn, theatrical Looney Tunes feature**, something we haven’t seen in decades. And on top of that, it’s weird in the best way—a mix of slapstick, sci-fi horror, and classic comedy, with Daffy and Porky thrown into a surreal alien invasion. Critics are loving it, and audiences who’ve actually seen it are too. But because WB threw it away, **Ketchup doesn’t have a marketing budget to let people know what it even is.** If you haven’t heard much about it, that’s not the movie’s fault—that’s just the reality of being saved at the last minute by a distributor that doesn’t have billions to spend on ads.\n\n**Because this movie didn’t get the massive marketing push of a major studio release, strong word of mouth is the only way it can reach the audience that would truly appreciate it.**\n\nSupporting this movie doesn’t mean you’re “picking” it over *Coyote vs. Acme*. It just means you’re giving a discarded Looney Tunes movie a chance to prove that WB was wrong to sell it off in the first place. Theaters are where we get to make that statement. Streaming will come later, and people will eventually discover it there—but if this movie succeeds in theaters, it sends a clear message that Looney Tunes *still belongs on the big screen*.\n\nIf you were looking for the fastest way to tell David Zaslav to go screw himself, this is it.\n\n",
        "upvotes": 518,
        "comments": 102,
        "media": null,
        "permalink": "/r/movies/comments/1jbmhdw/no_wb_didnt_favor_this_looney_tunes_movie_over/"
    },
    {
        "id": "1jc8eph",
        "author": "herequeerandgreat",
        "title": "i'm excited for the adventure time movie.",
        "content": "one of my all time favorite tv shows is adventure time. it's easily one of my top 10 favorite tv shows of all time. i love the characters, the writing, the animation, the humor, the surprisingly complex plot, the voice acting, the action, the everything! it's so fucking amazing! i've also enjoyed the distant lands and fionna and cake spin offs.\n\nin june of last year(a few days before my birthday which was a nice little bonus), it was confirmed that an adventure time movie was in development. as you can imagine, this made me quite happy. what made me even more excited was the fact that adam muto, patrick mchale, and rebecca sugar would be returning to work on the movie.\n\nwe still don't know what the plot is going to be or if it will even feature finn and jake. however, i'm eagerly anticipating this movie. bonus points if it's going to be in theaters.",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jc8eph/im_excited_for_the_adventure_time_movie/"
    },
    {
        "id": "1jc8q8i",
        "author": "Bladeandbarrel711",
        "title": "Happiness (1998) Todd Solondz",
        "content": "I think this is either one of the best movies I have ever seen or one of the biggest cringe-fests I have ever witnessed but can't stop watching.  Jon Lovitz. Ben Gazzara. Jared Harris with a flawless Ruski accent Philip Seymour Hoffman plays himself perfectly. Lara Flynn Boyle. Yassssss.\n\nI am so confused I watched Life During Wartime and Welcome to the Dollhouse today to make sure this wasn't a fluke.\n\n\"I just want to be alone\"\n\n",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1jc8q8i/happiness_1998_todd_solondz/"
    },
    {
        "id": "1jb9a6k",
        "author": "These_Feed_2616",
        "title": "“Office Space” is the most relatable movie of all time",
        "content": "This movie nails the miserable mundane life on an office worker (and any job really) it’s hilarious and also kinda sad because of how accurate it is. Everything depicted in terms of a job in this film has happened to me, the traffic in the morning, the annoying co workers, the passive aggressive boss who you can clearly tell is trying to be sarcastic and piss you off, the annoying soul sucking phrases (“sounds like a case of the Monday’s”) and if you screw up, you have 3 different people telling you the same shit within the span of 10 minutes and you have to just suck it up and take it, unfortunately as long as these jobs exist, this film will remain timeless. The second half of this film is just as great at the first because it shows all the things that YOU WANT to do but can’t because you’ll get fired, Mike Judge really nailed the realism of jobs, and it’s one of my all time favorite comedies, however it can also be called a documentary😂",
        "upvotes": 2773,
        "comments": 328,
        "media": null,
        "permalink": "/r/movies/comments/1jb9a6k/office_space_is_the_most_relatable_movie_of_all/"
    },
    {
        "id": "1jbzw9w",
        "author": "theatlantic",
        "title": "“Eephus” review, by David Sims",
        "content": "",
        "upvotes": 35,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7xOVTOUgFIPTuDr2Qae04txL-yeFWhMAuUiFDHpdIxM.jpg?auto=webp&amp;s=1879994f77a86a05991aeb9aad2e02fe33b37591"
        },
        "permalink": "/r/movies/comments/1jbzw9w/eephus_review_by_david_sims/"
    },
    {
        "id": "1jc4yhe",
        "author": "UltimaGabe",
        "title": "I have a question for anyone familiar with Highlander (1986) and its sequels. How is the katana so old?",
        "content": "(I tried going to /r/highlander to post this question, but it appears submissions are restricted for whatever reason.)\n\nSomething in this movie is confusing me. When Ramirez is telling Connor why he has to leave his wife, he explains that his last wife's father was named Masamune, and made his katana around 600 BCE. Later in the movie, it's brought up that the katana's metal is in fact dated back to around 600 BCE, but it's also brought up that this is very strange, considering Japanese katanas weren't made like that until the middle ages. (And this lines up with history; Goro Masamune was indeed a real Japanese swordsmith, but he lived around 1300 CE.) The reason Brenda is so invested in figuring out this case is because finding that sword would be like (as she says it) finding a 747 from a thousand years before the Wright brothers were born.\n\nThis is all very intriguing, but it never really gets touched on again (in the first movie at least, correct me if it's explained in later movies). How did Ramirez get a folded katana from nearly two thousand years before katanas were ever folded? For a moment I thought maybe the movie was implying that Goro Masamune was an immortal (hence why he would be around for two thousand years, still making katanas the same way he learned in his youth) but that can't be since Ramirez was married to his daughter.\n\nDoes this ever get explained? It seems very weird to bring up a huge mystery like that and then never touch on it again. It would have been easy to just have Ramirez say he got the sword a couple hundred years ago (Brenda would surely still be interested in a one-of-a-kind katana made by the legendary swordsmith Masamune) but they make a very deliberate point of how it was made in such an anachronistic fashion.",
        "upvotes": 16,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1jc4yhe/i_have_a_question_for_anyone_familiar_with/"
    },
    {
        "id": "1jbxj35",
        "author": "cmcsed9",
        "title": "German trailer for “The Assessment” - Alicia Vikander, Elizabeth Olsen &amp; Himesh Patel",
        "content": "",
        "upvotes": 37,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xnslvSbIZgushtM66_uhNoBsRUHv8FtEaQ1vLSENy3I.jpg?auto=webp&amp;s=bac7630d23e203d4867888381d46a8d90a1074dd"
        },
        "permalink": "/r/movies/comments/1jbxj35/german_trailer_for_the_assessment_alicia_vikander/"
    },
    {
        "id": "1jbxwgk",
        "author": "n00biwankan00bi",
        "title": "What are your “unofficial” movie quotes with your friends?",
        "content": "Movies have those memorable lines that you can share with strangers that land with a 99% success rate.\n\nBut what about those films you’ve watched dozens of times and the one friend just gets your obscure reference?\n\nTake for example Billy Madison. I say “Don’t tell me my business devil whoman!” And usually people get it. \n\nBut I can quote “Gee I can’t wait to go to hike.. school” to my buddy and he will instantly get it. \n\nDoesn’t have to be comedy but I’d love to hear others!",
        "upvotes": 36,
        "comments": 255,
        "media": null,
        "permalink": "/r/movies/comments/1jbxwgk/what_are_your_unofficial_movie_quotes_with_your/"
    },
    {
        "id": "1jca70y",
        "author": "HughJManschitt",
        "title": "Anybody's parents let them pick out movies to watch they thought were \"family friendly\" but turned out to not be?",
        "content": "Mine was \"A Perfect World\" starring Kevin Costner and Clint Eastwood. It came out in 1993, and I'm pretty sure I was closer to 7-8 when I watched it. The reason my mother let me pick it out (from a VHS RENTAL STORE, GASP HOW ANTIQUATED) was because it had a kid in a ghost face costume on it walking with a guy she must have assumed was his father (Costner).\n\n  \nNah, this was about a pair of murderers who break out of prison and kidnap said kid, kind of a road movie with Eastwood as the Texas Ranger chief who is chasing them. It's worth a watch, it's a decent movie directed by Eastwood however as a kid it was scary to me. The ending is a gut punch too, was one of my first \"anti-hero\" sad movies. \n\nAnyway, anybody else got stories like this?",
        "upvotes": 6,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1jca70y/anybodys_parents_let_them_pick_out_movies_to/"
    },
    {
        "id": "1jbicwz",
        "author": "Pooseygeuse",
        "title": "Barry Lyndon - Kubrick's finest movie",
        "content": "",
        "upvotes": 536,
        "comments": 133,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rw6LklmuibMc7QMXwooaUCKNf4r7WBV57Fx1DFwlTww.jpg?auto=webp&amp;s=7bcf544ea3ed59bab6430a0e5201e1ca21489811"
        },
        "permalink": "/r/movies/comments/1jbicwz/barry_lyndon_kubricks_finest_movie/"
    },
    {
        "id": "1jc7ji2",
        "author": "gilette_bayonete",
        "title": "Karl Otto Alberty appreciation post",
        "content": "I know you guys know this guy's face, lol he pretty much played every German WW2 soldier antagonist during the 60's from The Great Escape to Kelly's Heroes, although in KH he turned out to be more of a good guy. He played the German who escorts Big X played by Richard Attenborough off of the prison camp to be executed at the end. \n\nI always felt that this guy didn't get the credit he deserved for playing a German soldier so much during controversial times, not even that long after WW2 ended. Great Escape was shot in 63', not even 20 years after the war was over. \n\nIt wasn't cool back then to play a German and Karl Otto Alberty knocked it out of the park everytime. Do yourselves a favor and check this man out. \n\nEdited: typos\n\n\n",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1jc7ji2/karl_otto_alberty_appreciation_post/"
    },
    {
        "id": "1jb667r",
        "author": "MarvelsGrantMan136",
        "title": "Official Teaser Poster for the 'Toxic Avenger' Reboot Starring Peter Dinklage",
        "content": "",
        "upvotes": 2036,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/balpwq5g8ooe1.jpeg?auto=webp&amp;s=57aed767cf60b74dfc60a1cd22fae677856937e6"
        },
        "permalink": "/r/movies/comments/1jb667r/official_teaser_poster_for_the_toxic_avenger/"
    },
    {
        "id": "1jbzing",
        "author": "Quick_Drink_8381",
        "title": "what does the famous line in pride and prejudice (2005) mean",
        "content": "i'm talking about the dialogue between mr. darcy and elizabeth bennet, when he says \"my good opinion, once lost, is lost forever\" and she replies \"oh dear, i cannot tease you about that. what a shame, for i dearly love to laugh.\" i've always took it literally, expecting that she simply means verbatim that she doesn't want to lose his good opinion because she loves to tease people. but people's reaction to this line by her is almost like she's referring to something else at the same time, kind of like taking a dig at him? but i can't really understand what she's talking about. ",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1jbzing/what_does_the_famous_line_in_pride_and_prejudice/"
    },
    {
        "id": "1jc93hd",
        "author": "Pooseygeuse",
        "title": "Pink Flamingos (1972) - Eggman!",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7mmb9lOXcxjLJxcV-so3wpa-Ucxfm_chDKSEiCxAUaE.jpg?auto=webp&amp;s=57bfa6c2bcaa32fb7aac04e002ecf8604f5aece0"
        },
        "permalink": "/r/movies/comments/1jc93hd/pink_flamingos_1972_eggman/"
    },
    {
        "id": "1jb9o0c",
        "author": "ChiefLeef22",
        "title": "David Lynch, the Cast of ‘Twin Peaks’ and Her Lifelong Friends Are Paying Tribute to the Beloved Log Lady in a Documentary About Her Life 'I Know Catherine, The Log Lady', including how Lynch and Co. raced against her rapidly progressing lung cancer to involve her in 'Twin Peaks: The Return'",
        "content": "",
        "upvotes": 989,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Y7zPKhjHgEpbrkain2jA7zJnYY9bRJOZmO87lcCHvvw.jpg?auto=webp&amp;s=636af49771f1e795d20158cf9f0b7115e80cc86b"
        },
        "permalink": "/r/movies/comments/1jb9o0c/david_lynch_the_cast_of_twin_peaks_and_her/"
    }
]