[
    {
        "id": "1j2jmou",
        "author": "theatlantic",
        "title": "Hi! We’re Shirley Li and David Sims, staff writers at The Atlantic, where we cover culture and Hollywood. We watched the Oscars last night to see which events at the awards show can tell us about the future of the industry—and whether any films snagged an upset. Ask us anything!",
        "content": "",
        "upvotes": 153,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p30kmcwmghme1.jpeg?auto=webp&amp;s=137db712ab8b507063c04ac21a1101312b0186c5"
        },
        "permalink": "/r/movies/comments/1j2jmou/hi_were_shirley_li_and_david_sims_staff_writers/"
    },
    {
        "id": "1j2xbfx",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Tuesday 3/4 at 3:00 PM ET for a live AMA/Q&amp;A with Cutter Hodierne, the writer-director of heist-thriller 'Cold Wallet' - A team of Redditors lose everything after a cryptocurrency scam. This leads them to plot to kidnap the \"financial influencer\" who screwed them over.",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/77sgf2uwbkme1.jpeg?auto=webp&amp;s=51c4340007fcece02a30ed64ba872d25ff56a79a"
        },
        "permalink": "/r/movies/comments/1j2xbfx/join_us_tomorrow_tuesday_34_at_300_pm_et_for_a/"
    },
    {
        "id": "1j2zpvd",
        "author": "MarvelsGrantMan136",
        "title": "Oscars Hit 18.1 Million Viewers, Down 7% From Last Year",
        "content": "",
        "upvotes": 4095,
        "comments": 849,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/urAcLJ0-GLUZN5Dyw7dpZewLO5zzbWbaGHkCcMnXeTg.jpg?auto=webp&amp;s=e29e47281433551349ed395ab5a2dd480a289b77"
        },
        "permalink": "/r/movies/comments/1j2zpvd/oscars_hit_181_million_viewers_down_7_from_last/"
    },
    {
        "id": "1j32rrn",
        "author": "gaporter",
        "title": "Michelle Trachtenberg, Shannen Doherty, Tony Todd Among Those Omitted From Oscars In Memoriam Segment",
        "content": "",
        "upvotes": 1866,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/65wwYCPiIxkD8EIWLU4chm3juxNsnXxrMVDHn07mqD4.jpg?auto=webp&amp;s=0193f46fd07411682f37d7b0f8dd7166555e1ce2"
        },
        "permalink": "/r/movies/comments/1j32rrn/michelle_trachtenberg_shannen_doherty_tony_todd/"
    },
    {
        "id": "1j2r7x7",
        "author": "Stormy8888",
        "title": "'Ne Zha 2' Surpasses $2-Billion Mark, Becomes First Animated Film to Do So",
        "content": "",
        "upvotes": 6686,
        "comments": 1190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IjAGJh05sPtqfnedgChrrOo6w46DP65mE09nq9gu9Ss.jpg?auto=webp&amp;s=6a13440317bd685cb54a7b487f1065008b31015c"
        },
        "permalink": "/r/movies/comments/1j2r7x7/ne_zha_2_surpasses_2billion_mark_becomes_first/"
    },
    {
        "id": "1j31gwy",
        "author": "Agreeable-Self3235",
        "title": "Rewatching \"The Pianist\". It's still shocking how casual the atrocities are.",
        "content": "I haven't watched this in many years, but decided to do a re-watch since Brody won again last night. I remembered the brutal parts of the movie, but I didn't remember how casually it all starts. The family is living their lives trying to go on like everything is okay. Szpilman keeps playing the piano as bombs fall outside of the studio. He is flirting with the girl who came to see him. There's the normal sibling banter going on. Then the food starts get scarcer. The neighbors get killed. The ghetto is a rumor that becomes true. Everything starts so small, but then his entire family gets put on the train. It's so sad and so scary to see the world change so quickly- to see people lose everything.\n\nEdit: I intentionally did not bring up America because I did not want a bunch of MAGAts spewing their hate. But, whatever, let them do what they will.\n\nAs an American, when I learned about the Holocaust as a child, I remember wondering how \"regular\" people could let that happen? I wondered why the good Germans let the bad Germans start doing bad things? Why didn't they stop them? Why the Jewish people \"go along\" with it? Why didn't they fight? \n\nAs an adult watching this again, I connect so much with the desperation to hold on to normalcy. When everything you hold to be true is being upended, you so badly want to believe that \"things can't get that bad\". because if you do, how do you keep living your life? I know what's happening right now. I cannot convey the level of hopelessness you feel to watch you country's leader openly align with a murderous dictator.\n\nI am worried. I am scared. I am angry. The people who voted for our current regime are my neighbors, co-workers, and former friends. The \"bad guys\" live next door. They fly their hate flags high. My friends and I are so overwhelmed by the barrage of changes, by the geopolitical horror show, and by the impacts this will have globally for decades to come. We are the ones being targeted by this government: queer folks, immigrants, non-Christians. We are also the ones who work in our communities providing what's needed without bias to who needs it. Now we need all of you- Americans or not. Please keep calling out this regime. Please keep boy-cutting our products and tourism. Please remember that there are many of us who voted against this, who are living our lives every day promoting the values that we want to see in our country. We cannot do it alone. It's horrifying. It's depressing. We need you to carry us when we feel like we're breaking so we can keep finding the strength to resist. ",
        "upvotes": 1044,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1j31gwy/rewatching_the_pianist_its_still_shocking_how/"
    },
    {
        "id": "1j2oiw7",
        "author": "Both_Sherbert3394",
        "title": "'School of Rock' aged shockingly well for an early 2000's comedy",
        "content": "I rewatched this not that long ago, and even though I know it's pretty standard to watch comedies from this era and see a lot of things that are like 'wow that didn't age well' (even if it's still an otherwise funny movie), but rewatching this, I was surprised at how the overall messaging and way it depicts these characters felt a lot more fair and interesting than a lot of other films from that era.\n\nParticularly, the scene where Jack Black takes the principal out to get drinks and we see a totally different side of her, as well as when we see the barrage of parents harassing her and suddenly we totally get a sense of how this kind of pressure could lead to someone becoming like this. I feel like the trope of 'the stuffy old mean teacher lady' has been a comedy thing for about as long as there have been movies set in schools, but this one just flips it on its head in a way that really stood out to me.\n\nIt also does a really good job at avoiding the overly cartoony cliche ending of \"oh, but look what they learned! it's totally fine!\" I mean, yes, it does that somewhat with the very ending over the credits, but the parents are still very rightfully furious that this random stranger has been with their kids, and the movie treats it more like how I expect people would react to it in real life. It's a tiny thing, but just giving these elements (such as the principal or the parents reactions) a little more believability and less cartoonish one dimensionality really adds to it.\n\nI'm also glad they never did a sequel, because there's absolutely no reason to, although now that I've said that I'm assuming we'll see a headline that it's been greenlit within the next two days.",
        "upvotes": 5742,
        "comments": 472,
        "media": null,
        "permalink": "/r/movies/comments/1j2oiw7/school_of_rock_aged_shockingly_well_for_an_early/"
    },
    {
        "id": "1j2tqie",
        "author": "pantherfanalex",
        "title": "Elijah Wood explaining why, if he could remove ANY one movie from cinema history, it would be Tim Burton's \"Charlie and the Chocolate Factory\" (timestamp 45:00)",
        "content": "",
        "upvotes": 1853,
        "comments": 263,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x_zNtenqDVRpZd54XzHU1zQaFtjaR4jay_wRsfWN8m4.jpg?auto=webp&amp;s=5e7cdef867f48de0bbb3faac8be3e31ec1ad0e1d"
        },
        "permalink": "/r/movies/comments/1j2tqie/elijah_wood_explaining_why_if_he_could_remove_any/"
    },
    {
        "id": "1j311xx",
        "author": "progamer2277",
        "title": "Why don't they make many movies about the Korean War in the US but they do about the Vietnam War?",
        "content": "Note, I'm not trying to politicize the post or raise propaganda, but I find it curious that the Vietnam War has more movies, and the Korean war no, Does anyone know why?, And it's funny because even in video games this topic is a bit forgotten, is there some political reason?, Even slightly more forgotten wars like the Spanish-American or Philippine-American wars have a few more productions,Are people not interested in the subject just like WW1, WW2 or Vietnam? What do you think?",
        "upvotes": 556,
        "comments": 332,
        "media": null,
        "permalink": "/r/movies/comments/1j311xx/why_dont_they_make_many_movies_about_the_korean/"
    },
    {
        "id": "1j2h08o",
        "author": "NikNola2020",
        "title": "Juno is totally different as an adult",
        "content": "I recently watched Juno for the first time since I was about 13 or 14. I was in junior high I believe when the movie first released, and seeing it as an adult really blew my mind. The creators somehow perfectly captured the awkward and intense feelings of not being a kid, but not quite an adult yet either. \n\nFirst note, Mark was a massive creep and weirdo. Kissing a teenage girl when you’re an adult is creepy and gross all on its own. Then you throw in that SHE WAS CARRYING THEIR ADOPTIVE CHILD. What the actual fuck! What a disgusting pathetic man. Watching the scene when he took Juno to the basement to show her the comic of a pregnant super hero was so disgusting. Their relationship in general was coming off very grooming, then he was seducing a pregnant 16 year old girl who was extremely vulnerable. In my young teenage mind, I thought Vanessa was such a wet blanket, suppressing his creative side and making him and Juno both feel like losers. In reality, she was a saint who should have kicked him to the curb way sooner. He deserved no grace. I cannot imagine my partner not only cheating on me, but cheating with a teenager. And not just a teenager, a pregnant teenager who is carrying my adoptive son. Vanessa was such a great person and didn’t deserve anything that pathetic excuse of a man put her through. \n\nSecond note, Juno(and company) is extremely immature and the creators did a great job of showcasing it. I love her quirkiness, but the way she did not understand why it was inappropriate to be popping up at Mark and Vanessa’s house was very telling. There are two sides to that coin, because she may have known it was inappropriate but was too young and naive to see the long term outcome of the situation. She definitely didn’t understand why a man of his age shouldn’t be chumming it up with her. In fact, she seemed to enjoy the fact that he was even giving her attention at all. It helped that he liked the same things, so in her mind it was confirming she was cool. It just shows exactly how immature she was, unable to look past your own bubble to see the rest of your life. \n\nOn another note, it was implied that she and Bleaker were way better friends than what we saw in the movie. It seemed that they were hanging out everyday, had all the same interests and hobbies. But, when Juno came up pregnant Bleaker fell off the map. He never seemed pressed when she would stop and say hey, but he did absolutely nothing to try and help her in the situation. He also didn’t understand why it hurt her so much he was taking someone else to a dance. At that point in the plot, we really got to see how the normally confident and abrasive Juno was becoming self conscious and confused by the weight of her feelings. Highlighting how juvenile everyone was, while dealing with such a serious situation was just top tier writing. The whole movie did such a great job of capturing exactly how it feels to be 16. Too old for childhood, but nowhere near an adult yet. Even though every single 16 year old in the world thinks they’re an adult. It takes growing up to realize exactly how childish you still are at that age. \n\nI do think it’s worth mentioning how great of parents her dad and Bren were. Bren was her step mom and they didn’t seem particularly close, but she didn’t hesitate when it came to Juno. Of the jump, she was getting her to a doctor, coming to her defense when needed, and making sure she had everything she needed. And her father, who was obviously uncomfortable with emotional bridges with his teenaged daughter, made sure she knew she was loved. The scene of her in hospital after giving birth brought tears to my eyes. \n\nAs a whole, the movie is great. I’m not sure what category you could out this movie in, but they somehow captured a vibe of nostalgia I didn’t know I was missing. And just to bring it in again, we should all beat Marks ass if we ever happened to see his character out in the real world. \n\n*Edit Note: \n\npeople are being gross about Elliot Page being in the movie. Elliot is an amazing actor and their gender at any point in their life has absolutely NOTHING to do with the character of Juno. I’m referring to Juno as she/her, not Elliot. You’re weird if you care about someone else’s gender enough to be a dick about it. No one cares what you think. Elliot is happy and that’s all that’s important. Keep your weird ass comments to yourself if you’ve got something nasty to say. You’re the weird one if you can’t just simply respect what a person wants for their own autonomy. We support LGBTQ+ on this post! ",
        "upvotes": 5326,
        "comments": 427,
        "media": null,
        "permalink": "/r/movies/comments/1j2h08o/juno_is_totally_different_as_an_adult/"
    },
    {
        "id": "1j2nu6c",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for A24's 'Death of a Unicorn'",
        "content": "",
        "upvotes": 1043,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m2n4eo8zcime1.png?auto=webp&amp;s=0798f06a4581a393dbaaf8a2e35275b68630a5cd"
        },
        "permalink": "/r/movies/comments/1j2nu6c/new_poster_for_a24s_death_of_a_unicorn/"
    },
    {
        "id": "1j29pq0",
        "author": "MarvelsGrantMan136",
        "title": "2025 Oscar Winners: 'Anora' Wins Best Picture &amp; Director; Adrien Brody, Mikey Madison, Kieran Culkin, &amp; Zoe Saldaña Win Acting Awards (Full Winners List)",
        "content": "",
        "upvotes": 13851,
        "comments": 3705,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q4loOQf3crB6dcmKhBngvBwKzG2fqxP5Tb9y-ivBcek.jpg?auto=webp&amp;s=92b7926fc390d559487c5a070d911d73208c1e14"
        },
        "permalink": "/r/movies/comments/1j29pq0/2025_oscar_winners_anora_wins_best_picture/"
    },
    {
        "id": "1j2wfk8",
        "author": "Puzzled-Tap8042",
        "title": "Oscars Explore New TV Home After ABC Exclusive Negotiating Window Ends",
        "content": "",
        "upvotes": 251,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dpiulg54iZinRH9x8rTwdWHw420S7tpr78TfReGEXRg.jpg?auto=webp&amp;s=74d6dbaf5f0161f6b94a10fb2a52d3ac3abe438c"
        },
        "permalink": "/r/movies/comments/1j2wfk8/oscars_explore_new_tv_home_after_abc_exclusive/"
    },
    {
        "id": "1j2yrgi",
        "author": "elevenatexi",
        "title": "What is the best club scene from a movie?",
        "content": "Many movies have a scene or two that take place in a club or where the protagonists are meeting  someone and adjourn to a back room or are being  chased thru as part of an action sequence.\n\nI am wanting to know which movies have the very best of these scenes. Where the music and the lights are on point, the architecture and mood are captivating, and the crowd is lively and attractive.\n\n\n\n\n\n",
        "upvotes": 131,
        "comments": 448,
        "media": null,
        "permalink": "/r/movies/comments/1j2yrgi/what_is_the_best_club_scene_from_a_movie/"
    },
    {
        "id": "1j2rb6s",
        "author": "NoCulture3505",
        "title": "Disney Hires Former Warner Bros. Executive Andrew Cripps as Head of Theatrical Distribution",
        "content": "",
        "upvotes": 225,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fgmv6nbgRlM0IwJF8N6MxUsH0jp3v2rTeXgw1JLZf2U.jpg?auto=webp&amp;s=f0c04dd3825c24fafd70546e87919ea53a54fff5"
        },
        "permalink": "/r/movies/comments/1j2rb6s/disney_hires_former_warner_bros_executive_andrew/"
    },
    {
        "id": "1j2qxmk",
        "author": "LazerDude99",
        "title": "Would you rather be trapped in Groundhog Day or the Truman show?",
        "content": "I was having a discussion with some coworkers today about this and it’s actually kind of interesting \n\nBecause on the one hand in the Truman show you’re living in the world where everything around you is fake nothing in your life is real but every day there’s new adventures and new things happening and unlike Truman, you might not even figure out that everything is fake so to you, life would be normal, but you would still feel an unease, because people would act very strange around you. It’s possible you would figure it out and make an escape but it’s also possible that wouldn’t happen.\n\nOn the other hand in Groundhog Day, it’s really the opposite because in the Truman show everyone else knows what’s happening and you don’t but in Groundhog Day, you’re the only one who knows that the day is repeating over and over again, you’re the only one that can comprehend what is really happening in a lot of ways you’re the only one who is real, and there would be benefits as Bill Murray’s character found out you could live every day and have no consequences life would have limited things that you could do and you would live in a world where no new things would come into existence, you couldn’t have any real meaningful relationship, I guess if you’re already married or dating your partner would just relive the day with you but conversation would never blossom, and you would eventually know what everybody is going to say…\n\nThe other problem is that you might never figure out the perfect day to end the loop\n\n\nBoth scenarios there’s a possibility of escape but neither is a guarantee…\n\nSo if you have the choice, which one would you choose?\n",
        "upvotes": 214,
        "comments": 349,
        "media": null,
        "permalink": "/r/movies/comments/1j2qxmk/would_you_rather_be_trapped_in_groundhog_day_or/"
    },
    {
        "id": "1j2jw2d",
        "author": "CrusherWillis",
        "title": "Will Conclave bring back the PG rated adult drama?",
        "content": "In recent years, the PG rating has been reserved almost exclusively for family fare from animation to faith based pictures. But now, Conclave has become a critical and financial success as a PG rated drama for grown ups, a genre which has seen few hits since the dawn of the PG13 rating. So will Conclave be the start of a new generation of films like Out of Africa and Driving Miss Daisy (PG rated Oscar winning dramas from the post PG13 era) or is it just an outlier?",
        "upvotes": 465,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1j2jw2d/will_conclave_bring_back_the_pg_rated_adult_drama/"
    },
    {
        "id": "1j2ne17",
        "author": "eggflip1020",
        "title": "Prisoners (2013) Who the hell was David Dasmalchian?",
        "content": "Spoilers for a 15 year old movie. I understand that Melissa Leo was the abductor and that Paul Dano was a freak and a weirdo but he kind of didn’t do anything, but who the hell was David Dasmalchian? He was like the random weirdo in the movie, went to the department store and was buying kids clothes, then he gets arrested and managed to shoot himself. What the hell was his involvement, if any? I still don’t get that. \n\nI know it’s the Oscars hangover today, but this occurred to me and I still have no idea who the hell he was. ",
        "upvotes": 275,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1j2ne17/prisoners_2013_who_the_hell_was_david_dasmalchian/"
    },
    {
        "id": "1j2xkk8",
        "author": "chrisscan456",
        "title": "Is Cocktail (1988) “so bad, it’s good” or just bad?",
        "content": "I personally love the movie but it is very flawed. Unlikable hero, poorly paced, bad dialogue, etc. Where I go back and forth on is if these flaws throw the movie into the guilty pleasure category or is it objectively bad and liking it means you have poor tastes? Cruise himself has said it's it his crowning jewel. ",
        "upvotes": 71,
        "comments": 175,
        "media": null,
        "permalink": "/r/movies/comments/1j2xkk8/is_cocktail_1988_so_bad_its_good_or_just_bad/"
    },
    {
        "id": "1j2h3xw",
        "author": "MaxProwes",
        "title": "I rewatched Escape From LA (1996) and honestly shocked how well it aged despite some dodgy CGI, John Carpenter was always ahead of the curve and people appreciate it only years later",
        "content": "",
        "upvotes": 612,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sx4vD0KE03NgyIg_kT141LaGLK5IBMr1chf6pat_H38.jpg?auto=webp&amp;s=2121c80141b5ca7ef103a91f1da9fab45ae46b53"
        },
        "permalink": "/r/movies/comments/1j2h3xw/i_rewatched_escape_from_la_1996_and_honestly/"
    },
    {
        "id": "1j28v96",
        "author": "twinbloodtalons",
        "title": "Conan O' Brien's Monologue To Open The 97th Oscars",
        "content": "",
        "upvotes": 3332,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RBFwPRZCm-OxsrBkIJSAhj_MIr3QqZX2V4seyiadzqc.jpg?auto=webp&amp;s=c2d575213332d7363fcb11ec479a455d333b03d6"
        },
        "permalink": "/r/movies/comments/1j28v96/conan_o_briens_monologue_to_open_the_97th_oscars/"
    },
    {
        "id": "1j30cv8",
        "author": "Naive-Care-4072",
        "title": "Need movies that will inspire me to live again",
        "content": "I am currently going through a tough time in my life after going through so much pain and trauma and have no will to do anything and no will to live life. Please recommend a movie that will inspire me that life is beautiful and will inspire me to live again. It doesn’t need to be a happy movie, it can be an emotional one as long as I will feel inspired again in the end. \n",
        "upvotes": 40,
        "comments": 129,
        "media": null,
        "permalink": "/r/movies/comments/1j30cv8/need_movies_that_will_inspire_me_to_live_again/"
    },
    {
        "id": "1j2zdbz",
        "author": "Garizard1",
        "title": "Are there great films based on bad books?",
        "content": "I was recently thinking why do Stephen King's books usually make great films, and concluded it probably helps that the books themselves are great (along with having the right director, screen writer etc.). Then I was wondering, are there any films that were great (popular, critically acclaimed etc.) but based on books that were considered bad? I know things are subjective and what some consider bad isn't the case for everyone, but are there books that were considered UNIVERSALLY crap that somehow made a good film?\n\nThis isn't exactly one of those posts about films that are better than the books they were based on, but taking it further that the books themselves were terrible to begin with. E.g. Fight Club is usually the \"go-to \" for a film that was better than the book, but Fight Club the book was still a success. I'm looking for \"how the hell did someone turn this crappy book into this amazing film?\".\n\nJust curious if there even is one.",
        "upvotes": 42,
        "comments": 356,
        "media": null,
        "permalink": "/r/movies/comments/1j2zdbz/are_there_great_films_based_on_bad_books/"
    },
    {
        "id": "1j2to1a",
        "author": "supercavemanindeed",
        "title": "What’s the best sneaking sequence of all time?",
        "content": "Not action. Sneaking. I suppose any kind of spy movie or thriller of some sort. I just wonder what movie has the most suspenseful and engaging sneaking sequence of all time. People often talk about best car chase or best fight but what about just sneaking around? Who was the best ninja? Thanks in advance. ",
        "upvotes": 94,
        "comments": 258,
        "media": null,
        "permalink": "/r/movies/comments/1j2to1a/whats_the_best_sneaking_sequence_of_all_time/"
    },
    {
        "id": "1j2xc5d",
        "author": "mrjohnnymac18",
        "title": "James McAvoy Talks Directorial Debut 'California Schemin'",
        "content": "",
        "upvotes": 50,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kcF4OyhJTmBwpLX8cOOpHgLGsd7vuRrUDmIwTM9_i74.jpg?auto=webp&amp;s=7794d9a19bf9be7773a95b43f8f73a6741acbc19"
        },
        "permalink": "/r/movies/comments/1j2xc5d/james_mcavoy_talks_directorial_debut_california/"
    },
    {
        "id": "1j2szt9",
        "author": "mcurotto",
        "title": "Op-Ed from Steven Soderbergh’s brother on the biggest “Best Actress” upset in history",
        "content": "Steven Soderbergh’s brother writes about the time Steven made him watch three movies, one of which ended up taking the award for Best Actress in 1951. It’s an interesting article. And fun to learn that Soderbergh was such a fan of old films as a kid (not surprising, of course). Regarding the Best Actress upset—Do you agree? Does this trump the convo about last night’s upset? Love that he brings it back to 1951 , putting the Anora/Substance upset into context. ",
        "upvotes": 65,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8cqfR-Ymb5fHbWALO6r3NQTI_L4RiuxIm_ZNdh2YJfk.jpg?auto=webp&amp;s=0e3b7c45803de257483d13316b52bdaafa550c85"
        },
        "permalink": "/r/movies/comments/1j2szt9/oped_from_steven_soderberghs_brother_on_the/"
    },
    {
        "id": "1j30s1f",
        "author": "jamescurtis29",
        "title": "There are three soundtrack albums to the movie Dick Tracy and not a single one of them has all 5 of Stephen Sondheim's songs from the movie",
        "content": "While the score was written by Danny Elfman, Stephen Sondheim was brought in to write 5 songs for the movie. They are excellent songs.\n\nThe three soundtrack albums:\n1) Danny Elfman's orchestral score \n2) Madonna's I'm Breathless which contains three of Sondheim's songs from the film re-recorded for the album.\n3) Dick Tracy (Original Score) contains songs inspired by the film. Half of them are apparently used in the film but none of them are Sondheim's.\n\nI know one can just find these on YouTube, but given all the merchandising they did for the movie, including 3 soundtrack albums, a tie-in novel, a tie-in graphic novel, a video game, a McDonald's promotional tie-in and a line of 14 action figures, you'd think one of the soundtracks would have, well, the songs from the film.",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1j30s1f/there_are_three_soundtrack_albums_to_the_movie/"
    },
    {
        "id": "1j2rdt8",
        "author": "Upbeat-Sir-2288",
        "title": "Robert Pattinson &amp; Bong Joon-Ho Talk Mickey 17, Future Roles &amp; Guilty Pleasures",
        "content": "",
        "upvotes": 55,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S11rZbBeS-h8sfs-I6m8twzlyXdo9k7v-tlLfTuD0SU.jpg?auto=webp&amp;s=d42d29f227e98611ce87c916ad160d87c1e712e8"
        },
        "permalink": "/r/movies/comments/1j2rdt8/robert_pattinson_bong_joonho_talk_mickey_17/"
    },
    {
        "id": "1j2tcmd",
        "author": "LunchyPete",
        "title": "Phoebe Waller-Bridge to Narrate and Produce ‘Octopus!’ Two-Part Documentary for Amazon Prime Video",
        "content": "",
        "upvotes": 38,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xbzbP-_5mVIQPYtbb3l14aEoZRbAVtjI7c33p6MP_Ko.jpg?auto=webp&amp;s=713c412c21c27c4ca3e1be4f0ef1eed345b0594c"
        },
        "permalink": "/r/movies/comments/1j2tcmd/phoebe_wallerbridge_to_narrate_and_produce/"
    },
    {
        "id": "1j2lzgf",
        "author": "Comic_Book_Reader",
        "title": "The Woman In The Yard | Official Trailer 2",
        "content": "",
        "upvotes": 91,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0FYmf9_elr6jWN8vjuddYENyFusV-wl29I8sUcWPKrs.jpg?auto=webp&amp;s=1a43e5983949966657b16fe24c4176078c11acfb"
        },
        "permalink": "/r/movies/comments/1j2lzgf/the_woman_in_the_yard_official_trailer_2/"
    },
    {
        "id": "1j2aec8",
        "author": "RegularGuyy",
        "title": "How would you rank the Oscar best picture winners from the past 10 years?",
        "content": "These are the winners of best picture from the past 10 years. How would you rank these movies from 1-10 from best to worst?\n\nAlternate question: if these 10 movies were all released in 2024, which one do you think would have won the Academy Award for best picture? \n\n2024: Anora \n\n2023: Oppenheimer\n\n2022: Everything Everywhere All at Once\n\n2021: CODA\n\n2020: Nomadland\n\n2019: Parasite\n\n2018: Green Book\n\n2017: The Shape of Water\n\n2016: Moonlight\n\n2015: Spotlight\n\n2014: Birdman",
        "upvotes": 785,
        "comments": 941,
        "media": null,
        "permalink": "/r/movies/comments/1j2aec8/how_would_you_rank_the_oscar_best_picture_winners/"
    },
    {
        "id": "1j30l10",
        "author": "boytisoy",
        "title": "Which band or singer did you become a fan of because you heard their song in a movie?",
        "content": "For band, Queen singing Princes of the Universe in the Highlander movie. IMO, its in contention for being their best song. It perfectly reflects the concept of immortal warriors battling for ultimate power. The epic and grandiose tone fits the film's narrative of ancient battles and timeless conflict. Freddy Mercury has such a godly singing voice. As for specific singer, Shirley Bassey in Goldfinger. She did great singing the intros to Diamonds are Forever and Moonraker but this is her best work. Hard to describe but her voice and tone just fit so perfectly in a spy film franchise. Seeing her sing it again decades later in 2011 was amazing. Her voice aged like fine wine; fuller and deeper. Thanks to my dad, not only did I get into James Bond films, I got introduced to so many old song artists that honestly I would never have sought out on my own.",
        "upvotes": 12,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1j30l10/which_band_or_singer_did_you_become_a_fan_of/"
    }
]