[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jo7gh8",
        "author": "Pogrebnik",
        "title": "Meryl Streep Is in Talks to Join Greta Gerwig's 'Narnia' Series in Central Role",
        "content": "",
        "upvotes": 41,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jo7gh8/meryl_streep_is_in_talks_to_join_greta_gerwigs/"
    },
    {
        "id": "1jo5pen",
        "author": "womanmuchmissed",
        "title": "Survival of the thickest",
        "content": "Older millennial stylist trying to live her fashion dreams in New York. She and her two best friends are in periods of growth in their personal and professional lives. This is a coming of age story but for seasoned adults. The characters are in their 30s, mature and talented but still trying to find their footing. \n\nIf you liked Sex in the City, Girlfriends, Gossip Girl, Entourage, The Game, RHONY, RHOBH, Friends, How I Met Your Mother or any other show about adult friends in the big city, then this show is for you!!!",
        "upvotes": 51,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5pen/survival_of_the_thickest/"
    },
    {
        "id": "1jonklp",
        "author": "Cena_Beana",
        "title": "can someone recommend me a show that hasn’t been canceled/is finished",
        "content": "I just finished Good Girls to find out that it left on a really interesting cliffhanger and it was canceled 💔\nI am so disappointed every time I watch a show and I look up if there’s gonna be a next season and news flash ITS ALWAYS CANCELLED, im open to any recommendations please helpppp ",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jonklp/can_someone_recommend_me_a_show_that_hasnt_been/"
    },
    {
        "id": "1joqis7",
        "author": "Loose_Clock609",
        "title": "Gone Girls: The Long Island Serial Killer' - Are the cops morons or just in on it?",
        "content": "Why was the docuseries made? We literally learned nothing new about the case or the victims. \n\nI don't believe the cops are this incompetent. It's impossible for any police department this large to be so stupid. With all the technology we have available, how are these cases still so unsolved or at least identify the victims. Either a cop did it or some rich guys with kinks pay them to look the other way\n \nIt's definitely more than one killer in the area. I wouldn't go from burlap sacks to dismemberment to just random dumpings... Rex isn't the only killer. \n\nI thought the documentary would answer big questions like, who are the other victims? Who is the baby? Who was the male? Nope...\n\nAnd if I hear the journalist says she's shocked again... \n\n ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1joqis7/gone_girls_the_long_island_serial_killer_are_the/"
    },
    {
        "id": "1joqfkr",
        "author": "Salt-Lake5807",
        "title": "I just finished the Adolescence",
        "content": "As a father of a boy and a daughter (both under 12yr) this serie really hit me hard. Especially third third and the fourth episode. Jamie being interviewed by the therapist was something I've never seen before. You can feel the rage and anger the boy is holding inside of himself. The acting was just perfect.\n\nThe final episode blew me away. When Jamie called and said that he's gonna plea guilty I just stopped breathing. The reactions of the parents and the sister were so real and heartfelt. \n\nI started to cry at the end of the final episode when Lisa (sister) came and said \"Jamie is ours\".  As the dad went to Jamie's room I was blubbering. I'm still weeping as I'm writing this.\n\nNever ever has a movie or a serie made me feel so much. Made me think about my own kids and the world they're living. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1joqfkr/i_just_finished_the_adolescence/"
    },
    {
        "id": "1joq985",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1joq985/cancelled_shows/"
    },
    {
        "id": "1jo5dnk",
        "author": "LushCharm91",
        "title": "'Black Mirror' Season 7 Trailer: Six New Episode Titles Revealed",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5dnk/black_mirror_season_7_trailer_six_new_episode/"
    },
    {
        "id": "1joquq0",
        "author": "ctrolaltdelete",
        "title": "On Payment Plans",
        "content": "Does anyone on here know what happens if you upgrade to a higher payment plan when your previous plan ha already been paid for? Like do you add the difference or do they make you pay it in full? (I hope this makes sense I don't know how to phrase this better😭)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joquq0/on_payment_plans/"
    },
    {
        "id": "1jonn0x",
        "author": "Certain_Passion1630",
        "title": "Just finished White Collar and I highly recommend",
        "content": "One of the best shows I’ve seen in a while. If you didn’t see my other post, it is very similar to Suits…but better (imo). The closest thing I can think of to compare them is Law and Order vs SVU. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jonn0x/just_finished_white_collar_and_i_highly_recommend/"
    },
    {
        "id": "1joe47u",
        "author": "MythicMythness",
        "title": "Million Dollar Secret: hot takes only",
        "content": "Is it the casting? The editing? Or is it just the nature of the game itself? Not sure, but these folks just don’t come across as very likable. \n\nAnyone else have any hot takes on this newest Netflix game show? \n\n**I’m not trying to soapbox here. I’m not saying they are or aren’t actually likable — they just don’t come across as likable. They’d probably be lovely to stand next to in a line and gab about whatever with. Lol",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1joe47u/million_dollar_secret_hot_takes_only/"
    },
    {
        "id": "1joq9f8",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joq9f8/cancelled_shows/"
    },
    {
        "id": "1jopubo",
        "author": "SelfAmbitious",
        "title": "EGO,JEALOUSY AND HATE Wwe Raw Review (1/4/25)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jopubo/egojealousy_and_hate_wwe_raw_review_1425/"
    },
    {
        "id": "1jogcqn",
        "author": "Damienisok",
        "title": "Show or movies that are a similar vibe to Locke and key?",
        "content": "Locke and key is one of those shows I thought I wouldn't like but actually turned out good, I really liked the element of the people not having magical powers themselves but their powers instead being a certain object, that was a really big part of what I liked about Locke and key.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jogcqn/show_or_movies_that_are_a_similar_vibe_to_locke/"
    },
    {
        "id": "1jopn6g",
        "author": "Witty-Rabbit-8225",
        "title": "Adolescence/Cultural Norms",
        "content": "I found this series compelling as we explore toxic masculinity and even facets of sociopathy.  As we engage in the content, I can’t help but observe the correlation between violent tendencies towards women and normative porn/social media culture.  We are beginning to see scientific research that observes the net negatives of porn culture and attitudes towards women.  In the series we see a child exposed to explicit images of his peer juxtaposed to images readily available in mass (hard core) and likely heavily edited and surgically enhanced on the internet. \n\nThe main character communicates his dissatisfaction with her (a child’s) breasts.  He called her “flat” as if to describe an object.  As a woman, this is a cultural norm which has pushed in industry.  We are nearly lead to empathize with a murderer who effectively manipulate his own therapist, demonstrated violence, and even sought the destruction of professionalism and empathy for his own gain.  You see a small boy on the unfortunate end of bullying who reacts disproportionately much like his expectations of breasts.  Perhaps this child was also a victim?  \n\nWe are attempting to uncover the true criminals when the evidence is all around us.  Women as objects, exposing children to graphic sexual content, access to social media for children, normalizing violent behavior, and complex misogyny.  As a mother of a 13 year old, social media is off limits and quite honestly never requested.  I’m protecting my kids at all costs because my daughter will NEVER be treated as an object as long as we live.  This show should be a sobering reminder that work isn’t done.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jopn6g/adolescencecultural_norms/"
    },
    {
        "id": "1joorus",
        "author": "Wolffe359",
        "title": "I keep randomly losing most of my shows",
        "content": "Ok so I'm in Australia and have been using netflix since like 2018 at this point and this is the first proper issue I've come across. I like to watch lots of anime and house m.d but lately every now and then I go into netflix and it doesn't have most of the shows in watching but then the next day it does? So when frieren came on to netflix I was crazy happy and I watched the first couple episodes but then it wasn't there the next day but it was there the day after?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joorus/i_keep_randomly_losing_most_of_my_shows/"
    },
    {
        "id": "1jo3ie2",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Releases New Teaser for ‘The Eternaut’",
        "content": "",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jo3ie2/netflix_releases_new_teaser_for_the_eternaut/"
    },
    {
        "id": "1jns3i1",
        "author": "lydocia",
        "title": "Any series on Netflix that just leave you feeling really bad?",
        "content": "Looking for recommendations for series that just leave you feeling awful, like truly gut-wrenching, depressing, based-on-true-events kind of shows. The kind that aren’t just sad but actually make you sit in silence for a while after an episode ends, just processing everything.\n\nI’m talking about shows that cover real-world tragedies, injustices, or historical events in a way that really sticks with you. Stories that aren’t just entertainment but actually make you think about how messed up the world can be. I know *Dopesick* and *Apple Cider Vinegar* fall into this category, but I’m sure there are plenty of others out there.\n\nIdeally, I’d like something available on Netflix, but if there’s something really good on another platform, I’d still be interested in hearing about it. I just want something that’s powerful, disturbing, and leaves an impact.\n\nAny recommendations? Would love to hear what shows have left you completely drained after watching.",
        "upvotes": 166,
        "comments": 568,
        "media": null,
        "permalink": "/r/netflix/comments/1jns3i1/any_series_on_netflix_that_just_leave_you_feeling/"
    },
    {
        "id": "1jonhok",
        "author": "404-san",
        "title": "Question from a new user about email changes in different accounts",
        "content": "This question arose in my mind when I was going to enter the email address in a Netflix game, but as I don't know my brother's password (he was the one who paid) I thought about changing the password and email address, but there could also be a risk in changing his account as well.\n\n\n(What a stupid question, I would appreciate it if some mod would delete it if they could see it)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jonhok/question_from_a_new_user_about_email_changes_in/"
    },
    {
        "id": "1joa4sb",
        "author": "Connorb08",
        "title": "Best Watch Party Option in 2025?",
        "content": "Looking for Watch Party apps/plugins that actually work.  Everyone I try breaks or wont sync properly.  What are you using these days?\n\nI have tried Teleparty, Watch2gether, Rave and some sketchy ones.  Not looking for discord or zoom.  Its 2025 and I still cant watch with my GF with ease.  Someone get on this!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joa4sb/best_watch_party_option_in_2025/"
    },
    {
        "id": "1jo23hr",
        "author": "Alan_Stamm",
        "title": "'Gone Girls: The Long Island Serial Killer' [Review]",
        "content": "",
        "upvotes": 17,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jo23hr/gone_girls_the_long_island_serial_killer_review/"
    },
    {
        "id": "1joeuvk",
        "author": "Rbsadie",
        "title": "Don't Come Home",
        "content": "Has anyone else been watching this Thai horror series? I'm really itching to discuss the ending.\n\nSPOILER: \n\nThe time travel aspect left me scratching my head. How on earth did that ending explain the paradox of the mother-daughter switch? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1joeuvk/dont_come_home/"
    },
    {
        "id": "1jo5cvo",
        "author": "Somethingman_121224",
        "title": "Britt Lower, Milo Ventimiglia, Logan Browning and Erin Richards Have Joined the Cast of Netflix's New Harlan Coben Series",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jo5cvo/britt_lower_milo_ventimiglia_logan_browning_and/"
    },
    {
        "id": "1jo4nxc",
        "author": "MysteriousDelay6266",
        "title": "The Eternaut | Official Trailer | Netflix | APRIL 30",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo4nxc/the_eternaut_official_trailer_netflix_april_30/"
    },
    {
        "id": "1jo252r",
        "author": "Alan_Stamm",
        "title": "'Gone Girls:' Three Things We Learned From Netflix’s New Long Island Serial Killer Doc",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo252r/gone_girls_three_things_we_learned_from_netflixs/"
    },
    {
        "id": "1jo24hn",
        "author": "Alan_Stamm",
        "title": "The Story Behind 'Gone Girls: The Long Island Serial Killer'",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo24hn/the_story_behind_gone_girls_the_long_island/"
    },
    {
        "id": "1joet2t",
        "author": "AvatarAntonia",
        "title": "When I log onto or go back to the tab on Netflix",
        "content": "When I do either of those things, for some reason, for 2 weeks or so now it will auto play the top show/game without me clicking on it. I click carefully, but it always happens. Not sure how I can get it to stop.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1joet2t/when_i_log_onto_or_go_back_to_the_tab_on_netflix/"
    },
    {
        "id": "1jo8rlq",
        "author": "evila_elf",
        "title": "Netflix Preview Club - Do we all see the same movies?",
        "content": "I was wondering if we all see the same stuff, or if there is a A group and a B group.\n\nJust got a movie last week. And before that, a series a little over a month before that. Normally get something every two months at the longest.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jo8rlq/netflix_preview_club_do_we_all_see_the_same_movies/"
    },
    {
        "id": "1jonasp",
        "author": "CestQuoiLeFuck",
        "title": "What were your takeaways about the criminal justice system from Adolescence?",
        "content": "Obviously, there were many cool things about Adolescence like the acting (which was AMAZING) and the continuous shooting style (which was interesting). But I'm interested in what kind of thoughts/musings the show sparked for people about crime, punishment, nature vs nurture, etc.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jonasp/what_were_your_takeaways_about_the_criminal/"
    },
    {
        "id": "1jocret",
        "author": "hereinthedarkness",
        "title": "Change main profile for household?",
        "content": "Hey,\n\nI moved out of my parents' house a while ago, and now I was hit with the \"this device is not part of the household\" message on my TV.\n\nSince I'm the only one no longer living in that household, vs the three remaining members of my family, I was just going to add my own profile as a non-household member with extra payment. The problem is that I'm the account owner, the one who pays for it, and the one whose profile is set as the main profile. Because of this, it won't let me select my own profile to give access to from a different location, only the rest of my family members.\n\nI did some googling, and realized I likely only have the following options, neither of which are satisfying to me:\n\n\\- I make a new account using profile transfer, change email and payment info of the existing account to my parents' -&gt; not great, because then I'll have to pay more for my own account vs just adding the extra cost for one person, PLUS the cheapest option doesn't even come with good quality  \n\\- My family makes a new account for themselves using profile transfer -&gt; same issue where I end up paying more than with the extra member option  \n\\- I make a new profile for myself on the existing account which I add as the non-household member -&gt; I'll lose my viewing history doing this  \n\\- I make a new account, transfer my profile to it, transfer it back to the existing account as a non-household member, cancel the new account -&gt; very convoluted way of doing it, but possibly the best outcome?\n\nSo if anyone can tell me about another option (ideally how to change the main profile, though from my research so far I'm not very hopeful that's actually possible), that would be very much appreciated because I'm already paying half a fortune for this subscription and I'd very much like to actually *use it.*\n\nThanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jocret/change_main_profile_for_household/"
    },
    {
        "id": "1jocihc",
        "author": "mrkinkybilly",
        "title": "La Palma series review on Netflix",
        "content": "This 4 part series about the volcano on La Palma and part of it falling into the Atlantic Ocean and causing a tsunami ~ well it started off really interesting and got me watching it, episode 2-3 were also okey but the last one, episode 4 = shocking and so so rubbish, was like it was rushed and is so unbelievable. Shame really as was pretty good ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jocihc/la_palma_series_review_on_netflix/"
    }
]