[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p0xovx",
        "author": "Rednit69",
        "title": "Why so dark?",
        "content": "Is it just me or is anyone else tired of intentionally darkly lit movies and or series? I get the intent is to create a mood but so many new shows have gone too far. I.E. Frankenstein, Black Rabbit etc. Thoughts?",
        "upvotes": 34,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1p0xovx/why_so_dark/"
    },
    {
        "id": "1p01zjb",
        "author": "am3142",
        "title": "It’s So Refreshing to See Claire Danes’ Real Face on “The Beast In Me.”",
        "content": "Hey y’all, I just want to say how refreshing it is to see a real face, like Claire Danes’ in this latest series. NO SPOILERS! I am only on the second episode. I love that (it seems at least) she has not done any fillers, botox, or other procedures. I love that she can be fully expressive, she can fully emote, and be comfortable as a woman who is growing and aging. No shade to actresses who do get cosmetic work, the pressure to look young and beautiful all the time must be immense. I was wondering if you noticed how expressive she is as Aggie Wiggs, and if you too felt it refreshing to see a woman in all of her glory take space with her aging face in this show.",
        "upvotes": 1677,
        "comments": 216,
        "media": null,
        "permalink": "/r/netflix/comments/1p01zjb/its_so_refreshing_to_see_claire_danes_real_face/"
    },
    {
        "id": "1p0f4ky",
        "author": "Perfect_Category_907",
        "title": "My opinion on dark",
        "content": "Words are not enough to define the greatness of this show as a Mind-Bending horror mystery crime drama thriller series which encapsulates the sufferings of many people out there &amp; also answers our one of the most intriguing mysteries of our childhood while exploring the real meaning of life through the perfectly fitting Quotes in our life. There are so many subtle references that I can't even tell them all. This is such a show which will always go above your expectations, no matter how much you expect, you just need to re-watch it to realise this. One single watch is never enough. DARK IS AN EPITOME OF PERFECTION. Never believe\nanything else.",
        "upvotes": 67,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p0f4ky/my_opinion_on_dark/"
    },
    {
        "id": "1p0qfly",
        "author": "Helpful-Leadership58",
        "title": "Is Netflix down?",
        "content": "I have internet access, I can go on YouTube or Amazon prime video or play online games, but Netflix isn't working it seems. Any other cases out there? \n\n* Already restarted my router connection for 30 seconds, cleared the flushed DNS on CMD and restarted my computer. Any ideas? ",
        "upvotes": 14,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1p0qfly/is_netflix_down/"
    },
    {
        "id": "1p0nyj3",
        "author": "SSSnowBell",
        "title": "Not only is Netflix getting rid of Supernatural, but also Archer, The 100, and how I Met Your Mother. It's like I'm being targeted specifically!!",
        "content": "No way in hell I'm paying the ever-increasing subscription after they butcher my bingeables. Like literally, is there a more expensive streaming service than Netflix? I'm so done with Netflix come December...",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1p0nyj3/not_only_is_netflix_getting_rid_of_supernatural/"
    },
    {
        "id": "1p1121y",
        "author": "omricn",
        "title": "Dolby Vision suddenly not working on Netflix (but works everywhere else)",
        "content": "Hey everyone, wondering if anyone else is seeing this:\n\nUp until a few days ago, Netflix played Dolby Vision perfectly on my setup. Now something weird is happening — titles say they’re in Dolby Vision on the info page, but when I start playback, the popup only shows Dolby Atmos, and the actual video is clearly SDR/HDR10, not DV.\n\nA few notes:\n\t•\tMy hardware setup is fine — Dolby Vision still works perfectly on Plex and other apps on the same device.\n\t•\tI’m using a Chromecast with Google TV + LG OLED (CS4), unchanged settings.\n\t•\tFor testing, I even forced the Chromecast to output DV only, and then Netflix played in DV — but that isn’t a real solution since it breaks other content.\n\t•\tThis literally started overnight. No changes on my end.\n\nFeels like either a Netflix app issue on Chromecast or some kind of profile/handshake bug on Netflix’s side.\n\nIs anyone else seeing this? Any recent Netflix app updates on Chromecast that could explain it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1121y/dolby_vision_suddenly_not_working_on_netflix_but/"
    },
    {
        "id": "1p0m5bd",
        "author": "SplitNational2929",
        "title": "Why One School Just Banned Netflix’s KPop Demon Hunters Songs",
        "content": "",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p0m5bd/why_one_school_just_banned_netflixs_kpop_demon/"
    },
    {
        "id": "1ozrj44",
        "author": "RiskAndReason",
        "title": "What’s the LAST thing you watched on Netflix?",
        "content": "Curious what everyone’s been watching lately.   \nWhat was the last movie or show you finished on Netflix, did it live up to the hype, and is it something you’d recommend to others here? ",
        "upvotes": 582,
        "comments": 2053,
        "media": null,
        "permalink": "/r/netflix/comments/1ozrj44/whats_the_last_thing_you_watched_on_netflix/"
    },
    {
        "id": "1p0tk8e",
        "author": "BimmerTex",
        "title": "Netflix on Apple TV",
        "content": "Anyone have pixelated issues when watching some content on the Netflix app in Apple TV device?  The same show on the Netflix app in other device, or the one in my television’s OS has no issues, looks so much better.  ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p0tk8e/netflix_on_apple_tv/"
    },
    {
        "id": "1p0vemd",
        "author": "Ok-Anxiety9059",
        "title": "GIVE ME REALITY SHOW SUGGESTIONS PLS!",
        "content": "EDIT: TYSM FOR THE SUGGESTIONS IVE ADDED A TON ON MY LIST!\n\n\n\nI just finished watching “Million Dollar Secret” and “The Trust” which are two reality show competitions on netflix (they were so entertaining) and I want to watch another reality tv show. Mind you these were the first ones I’ve ever seen being somebody who doesn’t gravitate towards reality tv on the regular.\n\nCan y’all give me some suggestions of shows that aren’t very obviously staged and even if they are they’re entertaining?",
        "upvotes": 2,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p0vemd/give_me_reality_show_suggestions_pls/"
    },
    {
        "id": "1p0p9bi",
        "author": "Alex_Spencer12",
        "title": "Metal Lords question",
        "content": "So, in the movie it is never stated any of the main character ages or if they are freshman, sophomore, junior or senior. \n\nThing is, Hunter apparently has tattoos that are supposed to be permanent ink tattoos in-universe. Does this make them all seniors going 18 with the exception of Hunter, who must be at least 18 to get that tattoos? \n\nI wanna know your opinions on this because this is a detail that has been stuck in my mind since my rewatch a few days ago. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p0p9bi/metal_lords_question/"
    },
    {
        "id": "1p0x72a",
        "author": "FLcitizen",
        "title": "Sequels to David Fincher’s Girl with the Dragon Tattoo?",
        "content": "Since David Fincher has done a lot with Netflix figured I’d figure I bring this up. \n\nI’m a huge fan of David Fincher’s film, I’m also a huge fan of the three books by Stieg Larsson.  I also love Swedish noir.\n\nI feel like it would be popular if David Fincher directed the sequels with the original cast, yes it’s 14 years old but I think everyone in the cast looks good and it could be cool to have them back. \n\nThey could film the second and third books back to back. The two books are basically one story instead of separate story like the first book. All the books after the third are not written by Stieg Larsson. \n\nNetflix could promote the first movie on their main page for two weeks before the other sequels come out for people new to the story. \n\nThe 2011 version of The Girl with the Dragon Tattoo earned a worldwide box office gross of approximately $239.4 million against a $90 million budget. The film grossed $102.5 million domestically and $136.9 million internationally\n\nRotten Tomatoes 86% \nImdb 7.8\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p0x72a/sequels_to_david_finchers_girl_with_the_dragon/"
    },
    {
        "id": "1p0s148",
        "author": "SoftwareTypical2089",
        "title": "Netflix not loading?",
        "content": "Im trying to use my Netflix on my laptop, and it kept saying browsing error. On my phone, it won't load the show/movie. It works on my bfs PS5, so im confused. I tried downloading it on my laptop and it doesn't work like that either. I restarted my laptop and nothing. \n\nPlease help. I wanna watch movies with my bf please",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p0s148/netflix_not_loading/"
    },
    {
        "id": "1p0fe80",
        "author": "MCJennings",
        "title": "Can I hide content based on type or tags?",
        "content": "Netflix has categories of content such as Movies, Shows, and Games. Is it possible to hide one or more categories from my Home feed so that I'm not consistently seeing content that I don't have any interest in? \n\nLikewise, there's tags for Netflix content (EX: Drama, Fantasy, Anime, Horror, etc.). Is it possible to filter out one or more tags to not appear in any of my feeds? \n\nI realize that there's an algorithm that's supposed to curate my feed to my preferences, but it fails to do so. If there's an alternate APK where I can still legally pay for Netflix but stream with a modified Netflix APK that doesn't include the content I dislike then that'd be a great solution. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p0fe80/can_i_hide_content_based_on_type_or_tags/"
    },
    {
        "id": "1p0x4yd",
        "author": "Ok-Anxiety9059",
        "title": "BRING BACK THE GOOD PLACE!",
        "content": "I really want to try “Opening up netflix to find a show to rewatch and seeing The Good Place back” frozen yogurt 😩\n\n  \nAlso why did netflix remove The Good Place anyways?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p0x4yd/bring_back_the_good_place/"
    },
    {
        "id": "1p0ibcl",
        "author": "Prize_Statistician15",
        "title": "Netflix production guidelines pertaining to shots and framing",
        "content": "Several years ago, I read an article about Netflix having certain guidelines for what kind of shots it prefers in productions made for its platform. I don't remember much of the article, except that it seemed Netflix preferred middle shots and frowned on extreme closeups or panoramic distance shots. \n\nI've tried to look this up, but can't find anything about it. I did find Netflix guidelines for equipment, but that's all. Was the original article I read misinformed? Did Netflix have certain guidelines a few years ago, but abandoned them since? Any information would be helpful.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p0ibcl/netflix_production_guidelines_pertaining_to_shots/"
    },
    {
        "id": "1p0iiz8",
        "author": "punknatanke",
        "title": "Запитую про My list",
        "content": "Вітаю. Розділ My list в застосунку Netflix на Android TV тепер залишився виключно у вигляді рядка й неможливо його розгорнути на увесь екран, як було раніше?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p0iiz8/запитую_про_my_list/"
    },
    {
        "id": "1p02k0j",
        "author": "Ms_Chessnudt",
        "title": "What Did Jack Do?",
        "content": "Not really here to say much except that this might have been the best thing I've ever seen in my whole life. Seriously if you haven't watched it, it's a short film by David Lynch, maybe the last thing he did, somewhere between 12 - 17 minutes... If you are an Eraserhead person, you will definitely love this if you haven't already seen it. \nRecently I heard someone say that art is dead. David Lynch might be dead, but he left a reminder that art is, indeed, very much alive.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p02k0j/what_did_jack_do/"
    },
    {
        "id": "1oztriy",
        "author": "bottlecoco",
        "title": "Which is the best long comedy show on Netflix for nonstop laughter?",
        "content": "I’m looking for a long comedy series on Netflix that I can watch while eating or during small breaks. The goal is simple: laugh as hard as humanly possible.\n\nPlease suggest shows that are all hits, no misses — the kind that will genuinely make me burst out laughing. No slow burners, no “it gets better after a few episodes” types. Just pure comedy gold from the start.\n\nWhat do you recommend?",
        "upvotes": 32,
        "comments": 140,
        "media": null,
        "permalink": "/r/netflix/comments/1oztriy/which_is_the_best_long_comedy_show_on_netflix_for/"
    },
    {
        "id": "1ozwz9m",
        "author": "fbutterfield96",
        "title": "Netflix Bid for Warner Bros. Raises Antitrust Concerns, GOP Rep. Says: Streamer ‘Wields Unequaled Market Power’",
        "content": "",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ozwz9m/netflix_bid_for_warner_bros_raises_antitrust/"
    },
    {
        "id": "1p0bjgt",
        "author": "Strange_Artist_6563",
        "title": "Stranger Things Season 5 Preview: The Final Arc Begins",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p0bjgt/stranger_things_season_5_preview_the_final_arc/"
    },
    {
        "id": "1p0gdas",
        "author": "misterpopculture",
        "title": "First Look at Neil Patrick Harris’ New Game Show “What’s in the Box?” Coming To Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p0gdas/first_look_at_neil_patrick_harris_new_game_show/"
    },
    {
        "id": "1p09qoj",
        "author": "MosquitoSmasher",
        "title": "I tried gaming on my TV, not impressed",
        "content": " I booted up Netflix on my Sony A95K and it notified me that Lego Party is available and I decided to give that a try.\n\nThis is streaming but I expected a lot more from the video quality, it’s not great at all and I tried with both WiFi and LAN. And unfortunately a physical controller doesn’t work with Netflix TV app, so you use your phone as controller and the delay is very noticeable.\n\nSeems I’m gonna have to buy that game for my Xbox if I want it. I’ll try some other games but it probably will be the same quality for video and input delay. Expected better. I tried Stadia a few years ago and that was worlds better in every regard.\n\nIt's very doubtful that it's my internet connection because I have 1100 Mbps download / 100 Mbps upload. Could it be the TV? I mean this TV ain't no slouch. It's not my plan either because I have the 4K plan.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p09qoj/i_tried_gaming_on_my_tv_not_impressed/"
    },
    {
        "id": "1ozrejd",
        "author": "Expert-Chicken6519",
        "title": "Is There A \"Leaving Soon\" Section Yet?",
        "content": "Why is there no Leaving Soon section on Netflix, or is there? I don't see one on my Apple TV device's app. I should not have to search in Google for what's leaving soon in my Watch List.",
        "upvotes": 16,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ozrejd/is_there_a_leaving_soon_section_yet/"
    },
    {
        "id": "1ozv18h",
        "author": "Zebitty",
        "title": "Rating system question",
        "content": "At the end of a movie Netflix asks me \"Loved it\", \"Liked it\", \"Not for me\"\n\nLet's say I'm a sci-fi fan and I 'rate' a sci-fi movie \"Not for me\" because the movie was garbage, will Netflix be less likely to suggest other Sci-fi movies in future?\n\nIs there a way of saying that a specific movie was bad without Netflix thinking I don't like sci-fi in general?",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ozv18h/rating_system_question/"
    },
    {
        "id": "1oztdcv",
        "author": "spaceyastro",
        "title": "Series recommendations for 10 hour flight",
        "content": "Hello! I have a long 10 hour flight coming up and am open to any series recommendations on Netflix. Want to download a bunch of content in case the inflight entertainment doesn’t hold up. I’m pretty open to all genres except true crime - I get kind of spooked. Thanks! ",
        "upvotes": 11,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1oztdcv/series_recommendations_for_10_hour_flight/"
    },
    {
        "id": "1ozj2ly",
        "author": "Sufficient-Curve2951",
        "title": "The Beast in Me",
        "content": "Don't you think the 'supposedly' ideal and small-town setting is getting too monotonous for crime thrillers these days? Same closely knit society and a crime that disrupts its 'harmony'. I have just started watching The Beast in Me but the Oyster Bay setting feels too similar and overdone!\n\n  \n[https://www.soapcentral.com/shows/where-the-beast-me-take-place-setting-netflix-series-explored](https://www.soapcentral.com/shows/where-the-beast-me-take-place-setting-netflix-series-explored)",
        "upvotes": 20,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1ozj2ly/the_beast_in_me/"
    },
    {
        "id": "1oz7258",
        "author": "Upbeat-Meringue-6401",
        "title": "Thoughts on The Beast in Me? (SPOILERS)",
        "content": "I just binged all the episodes of The Beast in Me and I loved it. Claire Danes did an amazing job and Matthew Rhys's faces scared the shit outta me. I love a show that has me yelling at my TV. I would like to take this opportunity to list a few of the people in this show who pissed me off.\n\n1. Abbott - Why would you approach someone who you know is a pysopath and serial killer pretty much, all alone, with one weapon? I knew as soon as he followed him he was gonna die, smh. It was so upsetting.\n\n2. Marvin - I completely understand him wanting to help his son and being in denial about how sick he really was, but he was constantly having to clean up Nile's messes. His legacy was also constantly at risk because of Nile's recklessness, but he just kept helping him over and over again. I know that's his son, but I would have called the police on him asap.\n\n3. Shelley - Was anyone else annoyed by Shelley? Why would you be mad at your ex wife for not being able to forgive the man who was driving drunk and caused a crash that killed your child?? And then to blame Aggie for his suicide to her face when she came to you telling you that she thinks Teddy was murdered. Obviously Aggie wasn't 100% in the right for doing things like throwing the brick through his window, but I can understand her anger. Also, having to see him constantly, knowing that he was never punished must have been hell. It's like they all made her out to be the crazy one for being angry.\n\nNile - Obviously he pissed me off cuz his impulse control was dog shit, and he was a terrible person all around, but he made a really good villain. I think a good villain makes the best stories.\n\nHow did ya'll feel?",
        "upvotes": 86,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1oz7258/thoughts_on_the_beast_in_me_spoilers/"
    }
]