[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q1rl8k",
        "author": "GuineaPKilledMe",
        "title": "Dave Chappelle - The Unstoppable",
        "content": "I have never seen something so unfunny in a long time. Genuinely what happened to this dude?? I mean I know what happened, but all he does it spew bitterness and hate.\n\nHe immediately came out preaching and ranting. Idek when he's actually telling jokes because all he does is go on and on about how he can't do this and can't do that. What a whiny baby.\n\nI used to love his standup specials. I just cannot believe that almost ten years later this man can absolutely not let anything go. I turned it off twenty minutes in without cracking as much as a smile.\n\nEdit: Some of y'all are so far up Dave Chappelle's ass that you're sending me Reddit Care alerts. You are a absolute pathetic loser to do that. Please grow up and choose to use those when someone is actually in dire need of help. I do not need help because I find your favorite comedian to be a bitter old man who rants at the clouds.",
        "upvotes": 439,
        "comments": 233,
        "media": null,
        "permalink": "/r/netflix/comments/1q1rl8k/dave_chappelle_the_unstoppable/"
    },
    {
        "id": "1q17wlz",
        "author": "Boring_Ant_1677",
        "title": "Gaten Matarazzo: “I don’t think I ever really want to put Stranger Things behind me”",
        "content": "",
        "upvotes": 1560,
        "comments": 226,
        "media": null,
        "permalink": "/r/netflix/comments/1q17wlz/gaten_matarazzo_i_dont_think_i_ever_really_want/"
    },
    {
        "id": "1q20n8a",
        "author": "emanuele94",
        "title": "Questions about Stranger Things",
        "content": "* Why does Vecna need to open four gates in season four, but then in season five he changes his plan and needs twelve children?\n* Why does Vecna need twelve children on his side to bring the Abyss to Earth?\n* Why does Vecna wait years before acting directly?\n* Why, in the Abyss during the final showdown, are there no other creatures present (demogorgons, demodogs, demobats, etc.) besides the Mind Flayer? Did they join him spontaneously (as if that were a good strategy…)? Were they all in the Upside Down? Were they all dead? Who knows!\n* Why do the military, once they learn about the “beanstalk” plan, do nothing to stop it?\n* Why does Vecna, once he learns about the “beanstalk” plan (through Kali’s memories), do nothing to stop it?\n* Why is Mike's mother able to move freely through the hospital with a gas tank and hide it in one of the dryers without any demogorgon noticing?\n* Why, once Eleven disappears, do the military decide to abandon the town and all the protagonists as if nothing had happened? Nancy and Hopper should at least end up in prison for manslaughter. Instead, Hopper gets his job as sheriff back and even thinks about advancing his career.\n* Why is a huge creature like the Mind Flayer unable to kill the protagonists in the final confrontation (with legs as big as an apartment building, which everyone easily dodges with a roll)? And how do the protagonists manage to climb to the top of a canyon so quickly?\n* Why, all of a sudden, is everyone able to enter and exit the Upside Down without needing to use an oxygen mask anymore?\n* Why isn’t Max blind once she wakes up from her coma?\n* Why is Joyce involved in very dangerous missions and plans, despite not having a real active role most of the time and without making a significant contribution?\n* Why do the characters think it’s a good idea to stop and talk and deepen their relationships in the middle of very intense action?\n* Why do gravity, air, sound, etc. work normally in the Abyss just like on Earth? Very convenient for playing “space explorers” that way!\n* Why is Vecna able to activate remote mind control over Hopper?\n* Why does Vecna kill following “ritual” patterns instead of attacking en masse?\n* Why is Eleven able to defeat 001 as a child but not as an adult (at least initially)?\n* Why doesn’t Vecna immediately eliminate Eleven when he has the chance?\n* Why does Henry receive an interdimensional stone with black dust and turn into a murderous madman?\n* Why does the Mind Flayer change shape and strategy every season? If its goal is to infest Earth, it had plenty of opportunities to do so (and couldn’t it have the demogorgons carry stones with black dust to possess other people, as it did with Henry)?\n* Why does no one in Hawkins, besides the protagonists, wonder what is going on? No one comes up with conspiracy theories?\n* What does the rest of the world think about Hawkins? Doesn’t anyone have friends or relatives outside the town? What does the government do? Doesn’t any outside journalist investigate?\n* Why do kids always manage to figure everything out before scientists and the military?\n* Why do parents tolerate such long absences and/or so easily accept absurd or incomplete explanations?\n* Why is the Abyss “frozen” on the day Will disappeared?\n* Why, despite having survived, does Will attract no interest from the military? (There must surely be surveillance footage showing him fighting off demogorgons.)\n* Why don’t the demogorgons in the dryer room hear the music Lucas plays to save Max?\n* Why does no one seem to notice the gigantic walls surrounding the Upside Down before season five? Excluding Dr. Brenner, judging by the notes he wrote and then forgot in the Upside Down lab: when did he produce them? And why is there no trace of this information in the real Hawkins lab?\n* Why is Eleven even able to generate wormholes? It has been confirmed that she accidentally created the Upside Down in 1983.\n* Why is Eleven able to hurl people into other dimensions? She was the one who threw Henry/001 into Dimension X/the Abyss.\n* Why is Dimension X/the Abyss the only dimension that tries to interfere with Hawkins?\n* Why is Suzie no longer mentioned? Why aren’t Robin and Vickie included in the finale? Why are unresolved subplots left behind?\n* Why does the fate of characters like Dr. Kay remain ambiguous?\n* Why does Nancy suddenly appear skilled with firearms, with no explanation or prior training?\n* Why do demogorgons shift from being intelligent predators to almost stupid monsters, depending on the circumstances and the characters involved in a given scene?\n* Why do the disappearance of dozens of people, numerous deaths, and the presence of gigantic monsters not lead to serious investigations or the intervention of the press or the FBI?\n* Why, in season five, do the vines no longer have any significance, when up through season four simply touching them disturbed the hive mind?\n* Why do the characters constantly seem on the verge of dying but then survive (after a few seconds, a few episodes, or from one season to the next: Hopper, Nancy and Jonathan, Steve, Eleven)?\n* Why did Vecna specifically take control of Will in season one and not other kids?\n* Why does the wormhole show only Hawkins in the Upside Down?\n* Why are the Russians no longer seen or heard from? Why don’t they spy on operations in Hawkins anymore, considering that even kids can manage to do so with the help of a high school physics teacher?\n* Why doesn’t Vecna constantly have an army at his disposal, and why doesn’t he use it to its full extent?\n* Why does Max manage to graduate despite having missed almost two years of school?\n* Why do Joyce and Hopper never talk about Henry, despite having gone to school with him?\n* Why does every season have to “reset” the world as if nothing had happened before?\n* Why is Vecna not mentioned at all in the early seasons?\n* Why does this series handle certain narrative turning points in such a slapdash, “whatever works” way?",
        "upvotes": 6,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1q20n8a/questions_about_stranger_things/"
    },
    {
        "id": "1q16vhz",
        "author": "Zedaso",
        "title": "Stranger things finale, big moments and big questions. I can't stop thinking about what WASN'T in the finale.",
        "content": "This is far longer than expected. I'll put a TL;DR at the bottom.\n\nOverall, I enjoyed the finale, have to say Jamie as Henry/Vecna stood out, he absolutely killed it. There were a lot of amazing moments, but I can't shake the feeling that a lot was missing, it even felt rushed in some places and I'm left with a lot of questions.\n\nWe saw zero demogorgons, demodogs or demobats in the finale, weird from a show that started with the demogorgon. \n\nWe didn't see the \"army\" Vecna showed Nancy in Season 4 and she talked about. I remember her speech: \"Vecna showed me so many terrible things. This giant creature with a gaping mouth, and this creature wasn't alone, there was so many monsters. An army, and they were coming into Hawkins. Into our homes.\" \n\nVecna had no defence, yet he knew Eleven and the gang would be coming, he even saw into her mind, he knew all their plans.\n\nThe military did nothing to the gang and just let them go after the crimes they committed, murdering their soldiers etc? They even let Hopper who had a fight with Dr. Kay become chief of police again?\n\nVecna was impaled and decapitated, the mind flayer was shot and burned yet Will felt nothing when he was right there? What happened to the hive mind? Not long before the big fight we see him reacting to when Henry felt pain from his memory of being shot in the cave as a kid. I thought he would have been seriously hurt or even killed being right near the hive mind when they were attacking the mind flayer and Vecna.\n\nVecna and the mind flayer were these otherwordly eldritch horrors with god-like powers and they were defeated so easily with not much loss for the gang.\n\nThis part is a bit too sci-fi for me and I love this sort of stuff, I'm just not smart enough to understand it, but: The whole blowing up the wormhole at the lab with the C4 at the dark matter seemed off. It completely wipes out all of the upside down, and probably the other dimension, but leaves Hawkins at the gate completely fine where we see \"Eleven\" standing to be killed? Would it not have also wiped out Hawkins, or at least done some damage?\n\nI understand the idea behind the Eleven ending, it was a smart idea in theory, but I don't think they pulled it off too well. Maybe I missed something, but she was right next to Mike in the truck right as they exit the gate, all of the El-Jammers were pointed at her and normally she's crippled and can't do anything but she manages to then escape the truck and get to the gate. Maybe it was an illusion like Mike later says, but she wasn't at the truck part from what I can see, and then how did Mike know about Kali? He never met her. He never witnessed what happened to her.\n\nThere was an 18 month time skip before Mike plays D&amp;D with the gang and tells them about El? Why do Hopper and Joyce not get told anything?\n\nFinally, where is Suzie? I thought Dustin and Suzie were together, we didn't see her at all. Also Vickie? Wasn't Robin going to take Vickie out?\n\nHonestly, not trying to hate on the finale, I love Stranger Things, but as mentioned I was left with a lot of questions. I'm interested in how others interpreted all this or if anyone can explain any of it.\n\n  \n**TL;DR:**  \nI enjoyed the finale, but it felt rushed and oddly incomplete. Key things set up earlier never paid off (no demogorgons/monster army, no real Vecna defence, hive mind inconsistencies with Will). Vecna and the Mind Flayer felt underpowered for supposedly god-like threats. The military’s response made no sense, the wormhole/C4 resolution felt inconsistent, and the Eleven ending was confusing (illusion logic, Kali reference, escape). Several characters/subplots (Suzie, Vickie, Hopper/Joyce learning about El) were just dropped. I love Stranger Things, but the finale left me with more questions than answers and I’m curious how others interpreted it.\n\n",
        "upvotes": 355,
        "comments": 256,
        "media": null,
        "permalink": "/r/netflix/comments/1q16vhz/stranger_things_finale_big_moments_and_big/"
    },
    {
        "id": "1q21v0e",
        "author": "Particular_Cow_9302",
        "title": "Joyce Byers",
        "content": "I gained interest in Stranger Things because of Wynona Forever (millennial thangs) and stayed for the story. And although Joyce was sidelined for most of the seasons, the real ones remember that she was the first to crack the code on the Upside Down—ABCD… I’m very glad that the Duffer Brothers gave this younger generation a chance to appreciate such a beloved actress. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q21v0e/joyce_byers/"
    },
    {
        "id": "1q1h7an",
        "author": "Few-Consequence2702",
        "title": "Personally",
        "content": "I loved Stranger Things. Sure, it had its imperfections, but it was such an incredible ride. The second half of the finale hit hard. The flashbacks - the nostalgia. The glimpses of the future for each of the characters we grew to love and connect with. I’m sad. I’ll miss it. Thank you Duffers! Over &amp; Out ",
        "upvotes": 62,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q1h7an/personally/"
    },
    {
        "id": "1q1bvke",
        "author": "pjand08",
        "title": "Finally Stranger things ended...",
        "content": "After being a fan of this show for almost 6 years, today it all concluded. I have followed every leak and made different theories, and it was all worth it. NGL, the final season, had its flaws, but in the end, everything was completed beautifully. Today, I am feeling very empty. I am not able to rewatch the finale, I am not able to express my feelings, and today I am very sad, and with the end of Stranger Things, now there is no other series left that I am as excited about as I was for Stranger Things. Truly the end of an era....",
        "upvotes": 113,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1q1bvke/finally_stranger_things_ended/"
    },
    {
        "id": "1q1gbmp",
        "author": "Dry_Philosophy_6825",
        "title": "Stranger Things has officially ended — or… has it?",
        "content": "(Spoiler alert)  \nWhen you look at the series through the lens of Dungeons &amp; Dragons, the ending of Season 5 does not feel final. It feels less like the closing of a story and more like a party reaching the end of a campaign while the world around them keeps breathing.\n\nStart with the Mind Flayer. In Dungeons &amp; Dragons it is not a god and not a cosmic ruler. It is one aberration among many, dangerous but not ultimate. The important detail is that it existed long before Henry entered Dimension X. Vecna did not create it and never truly commanded all of it. He only shaped a fragment, the way someone might force smoke into the shape of a spider. Even if that fragment was defeated, the deeper intelligence remains. It was already there before Henry and it will continue after him.\n\nFrom there, Dimension X becomes easier to interpret. In D&amp;D, the Far Realm is not a parallel universe. It sits outside reality and leaks into it only when reality cracks. It is ancient, hostile to reason, impossible to conquer in any permanent sense. Its beings are not merely evil. They are alien in ways the mind cannot safely hold. Dimension X behaves in the same way. That suggests it may not be the true source of horror, but rather a fissure, a place where something far larger presses through. The Upside Down is then not the enemy itself, but the distorted echo of what lives beyond.\n\nVecna fits into this structure. In myth and in D&amp;D lore, he is terrifying, but he exists inside a chain of command. If he falls, the machine does not stop. Someone else assumes the role. That is why Eddie Munson becomes such an intriguing figure. He died in the enemy’s realm. His body was never recovered. He carried fear, guilt and unfinished purpose. Legends and campaigns are full of such characters, pulled back into the fight, not because they choose evil, but because something stronger claims them.\n\nThe experiments surrounding Kali point to the same unfinished world. Dr. K did not work on only one subject. Several women received her blood. That leaves the possibility of children with powers that remain unseen, unstable, unpredictable. Some of them may become protectors. Others may be consumed. A few might be taken by the same forces that shaped the Mind Flayer.\n\nThe creatures of the Upside Down also do not simply vanish. The Demodogs seen in such numbers in earlier seasons behave like an army that waits for new orders. They retreat, recover and emerge again when called.\n\nAnd then there is Will. He carries something the others do not. His connection to the Hive Mind has never been completely broken. In stories and in campaigns, there is always one character who leaves the battlefield changed forever. That mark does not fade. It becomes a thread the enemy can tug on.\n\nThe final image of the show quietly reinforces all of this. Children gather around a Dungeons &amp; Dragons table and begin to play, while the original group ages into mentors, guardians and witnesses. One generation finishes its chapter. Another one sits down, opens the rulebook and starts rolling.\n\nPerhaps Stranger Things did not truly end. Perhaps only one party reached the final session, while the greater campaign continues, waiting for whoever is brave or foolish enough to take the next seat at the table.",
        "upvotes": 52,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1q1gbmp/stranger_things_has_officially_ended_or_has_it/"
    },
    {
        "id": "1q1vvza",
        "author": "Admirable-Abrocoma16",
        "title": "Where Did My Demogorgons Go? Stranger things Finale episode",
        "content": "So I just finished the Stranger Things finale and… excuse me, but did the Duffers accidentally misplace the Demogorgons in the Upside Down lost‑and‑found?  \n\n- Season 1: Demogorgon terrorizes Hawkins, eats Barb, becomes the face of nightmares.  \n- Season 2: Demo‑dogs everywhere, Will coughing up slugs, chaos.  \n- Season 3: Russians literally import a Demogorgon like it’s a Costco bulk item.  \n- Season 4: Hopper fights one bare‑chested with a sword like he’s auditioning for Conan the Barbarian.  \n- Season 5 finale: Not. Even. One. Cameo.  \n\nLike… Vecna gets his Shakespearean villain monologue, the Mind Flayer gets lore upgrades, but the OG monster? Vanished. No goodbye wave, no “thanks for the trauma,” not even a background shot.  \n\nI feel robbed. At least give me a single Demogorgon dissolving dramatically when the Upside Down collapses. Instead, it’s like Hawkins collectively forgot their first abusive ex. ",
        "upvotes": 4,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q1vvza/where_did_my_demogorgons_go_stranger_things/"
    },
    {
        "id": "1q22wy8",
        "author": "Confident-Bad-2239",
        "title": "No more hawkins and it's beautiful people 😭",
        "content": "Hawkins in peace finally. MEWLDMNSJRJH+++ Thanks :)🥹.\n\n\nThe fact that stranger things ended has traumatized me,and I can't accept it's over. A fantasy world hits harder in the  brain 🫠.After Harry Potter I get this weird feeling but this time it last longer than I thought it'll be.\n\n\nBut yeah it teached me something, as a filmmaker and as well as a human I learned a lot from the seris and I am truly grateful to exist in a time period where I can experience these emotions,these situations and these characters💖🥺. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q22wy8/no_more_hawkins_and_its_beautiful_people/"
    },
    {
        "id": "1q22won",
        "author": "Prestigious-Play8863",
        "title": "Everyone who finished the Stranger Things finale, did it feel… off?",
        "content": "Everyone who finished the Stranger Things finale, did it feel… off?\n\nWatched it yesterday and I’m still sitting with it. Not angry, not impressed, just oddly underwhelmed. \n\nFeels like there was so much build-up for something that didn’t fully hit emotionally.\n\nAm I alone in this or did it leave you feeling the same way?\n\nHere's a detailed review -\nhttps://medium.com/@fbgmb/i-watched-the-stranger-things-finale-and-wait-thats-it-3ebde2924f9e",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q22won/everyone_who_finished_the_stranger_things_finale/"
    },
    {
        "id": "1q22v9h",
        "author": "MyRice_MyDal",
        "title": "Why Idli Kadai Dubbing so bad ?",
        "content": "I just finished watching Idli Kadai. The Hindi dubbing was so bad that I couldn’t continue. I had to change the audio and watch it with subtitles.\n\nIs it only me, or did others feel the same? I don’t understand why they make such poor dubbing. And the songs were even worse.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q22v9h/why_idli_kadai_dubbing_so_bad/"
    },
    {
        "id": "1q1mmnc",
        "author": "krullhammer",
        "title": "The man in the high castle",
        "content": "Is this show coming to Netflix or not because of the mgm content deal with Netflix that I read on online along with other shows from mgm and the James Bond series of movies ",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q1mmnc/the_man_in_the_high_castle/"
    },
    {
        "id": "1q1671g",
        "author": "OdiseoX2",
        "title": "Regarding Kali in Stranger things (spoilers)",
        "content": "I just feel they did Kali’s character dirty this season. The only two reasons i can think of that they brought her back was to kill someone so they wouldn’t have to kill anyone from the main group, and to close the gap about what happened to her after the show ended. ",
        "upvotes": 85,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q1671g/regarding_kali_in_stranger_things_spoilers/"
    },
    {
        "id": "1q20gen",
        "author": "GoodSoup231",
        "title": "Removed Netflix TV game",
        "content": "So a while back I played this game on Netflix and I don’t remember the name. I remember it was Castlevania inspired and you had to clear out different towers to progress. You could get lots of abilities and it was pretty fun, but now, it’s gone. Is there any way to still play this game",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q20gen/removed_netflix_tv_game/"
    },
    {
        "id": "1q200oz",
        "author": "Flaky-flaky",
        "title": "Family plan extra member devices",
        "content": "TLDR: I am an extra member on my parents premium family plan (live on my own). Is there any way to watch Netflix on my Smart TV that does not involve uninstalling the app from my phone?\n\nFor context:\n\nAFAIK an extra member can only use one device *simultaneously.* My expectation was that this would still allow me to alter between watching on tv (app or cast) and phone (as long as I’m not using both devices simultaneously).\n\nHowever, my Netflix app does not show my chromecast (apparently chromecast support was removed in a recent update) but I also cannot stream to my tv directly as it requires me to log into the tv app (2nd device).\n\nI tried closing the phone app, and logging into the tv app afterwards to see if I could watch on the tv directly, but again I couldn’t(device not registered to plan). Is this an error or do you actually have to permanently choose between phone/tv if you’re an extra member?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q200oz/family_plan_extra_member_devices/"
    },
    {
        "id": "1q1xrqr",
        "author": "Right_Education_5842",
        "title": "Suggest me web series",
        "content": "Suggest me web series similar to breaking bad or Ozark or better call Saul. Something like bojack horseman or simpson will work for me. There has to be something which is at same level.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1xrqr/suggest_me_web_series/"
    },
    {
        "id": "1q1hpr0",
        "author": "Miserable-Bother-572",
        "title": "Run Away",
        "content": "I have just finished Run Away, a new mini series based on Harlan Coben's book. Generally, I have enjoyed it, it is his typical misery story with a few plot twists, shocks and red harrings. Perfect for a lazy day. What I do mind are some loose ends. Did someone else finish it and wants to share an opinion?",
        "upvotes": 11,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1q1hpr0/run_away/"
    },
    {
        "id": "1q0xodo",
        "author": "Naive_Fee258",
        "title": "Thoughts on the Stranger Things final episode?",
        "content": "Thoughts/concerns/questions\n\nThe ending was amazing and Holly was my favorite character this season!!\n\nI don't have a favorite season I like them all for different reasons but I think the final  ending was 🤯🤯.\n\nA lot of people were divided about this season.",
        "upvotes": 184,
        "comments": 688,
        "media": null,
        "permalink": "/r/netflix/comments/1q0xodo/thoughts_on_the_stranger_things_final_episode/"
    },
    {
        "id": "1q1vorz",
        "author": "Open_Tap_6280",
        "title": "Proxy?",
        "content": "Hi everyone i can’t use my netflix today for some reason. I’ll attach a picture if i can below or in the comment section. Maybe someone knows how to fix this? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q1vorz/proxy/"
    },
    {
        "id": "1q1nl4q",
        "author": "Meegz-8366",
        "title": "Has anyone watched “members only” Palm beach on Netflix?",
        "content": "So with all the chaos of the past year I just happened upon this show &amp; decided to watch it in its entirety. My takeaway was that the people on that show were very much living in a fantasy reality. Everyone is fake towards each other and mar-a-Lago came up a million times. It was fairly sad to see how people decided that if you weren’t living in a certain place they weren’t worthy as a human being. I also saw how very much a melting pot Palm Beach is. It’s hilarious to see what we’ve been going through in the past year of “immigrants are not wanted here” when some of the richest people around immigrated to the U.S. a lot of the  architecture in Palm Beach is Spanish inspired! The people all are super tan. Just reminds me how much hypocrisy is the biggest theme these days. The whole show was an ode to that.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q1nl4q/has_anyone_watched_members_only_palm_beach_on/"
    },
    {
        "id": "1q1uz6c",
        "author": "Exotic-Major6438",
        "title": "Did the makers ran out of story in ST s5",
        "content": "Why do I feel like duffers brothers ran out of plot. Like they had it till s4 and ran out of story in S5. Cause the stark difference between 4 and 5 is just immense. Honestly S5 didn't do the justice. It was wholesome but didn't match the intensity and frequency of s4. The scene in s4 where max is running from vecna , the monologue of henry/001 \"humans are unique type of pest\" , the depth of story in s4 was insane. S4 did so much justice and was worth it. But finale was a total downgrade from lazy dialogues to missing characters.",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q1uz6c/did_the_makers_ran_out_of_story_in_st_s5/"
    },
    {
        "id": "1q1m0c6",
        "author": "Wild_Description8052",
        "title": "Jamie Campbell Bower",
        "content": "THE MAN THAT YOU ARE!\n\nWhile there were things I didn’t enjoy about season 5 of stranger things - he was a welcome acting masterclass! This show has some good acting but wow he absolutely smashed this role, especially last season!! I doubt he will but I would love to see some sort of award for it because he had me captivated!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1m0c6/jamie_campbell_bower/"
    },
    {
        "id": "1q1x4gp",
        "author": "Ahsabtq",
        "title": "A Fresh Take on Mike and Eleven’s Reunion: A New Spin-Off Idea!",
        "content": "Hello Stranger Things Fans!\nI’m excited to share a spin-off concept I’ve been working on, focused on Mike Wheeler and Eleven’s reunion. Most fans have hoped to see them come together again, and my idea is to continue their story in a unique and thoughtful way.\nIn this spin-off, we’ll dive into how Mike reflects on their past and how their reunion unfolds in a fresh narrative. It’s not just about reuniting them on screen, but exploring their bond in a new, introspective manner.\nI’d love to hear your thoughts and see if this concept excites you as much as it does me!\nLooking forward to your feedback!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q1x4gp/a_fresh_take_on_mike_and_elevens_reunion_a_new/"
    },
    {
        "id": "1q1t1mc",
        "author": "DrownMeInSalsaPlease",
        "title": "Another ticked off customer",
        "content": "I wanted to watch netflix on my break. Netflix says no because my phone is on roaming data that means i’m on some magically different device or something.\n\nSo every 14 days i have to ask for a code for access.\n\nI work 80 hrs. My mother works 80 hrs. We live in the same house. I pay for internet. She pays for netflix.\n\nWhich my mother is asleep at that hour.\n\nI can’t wait for them to open up clinics where we can implant chips that blur our vision on the screen if we dont have a separate plan and happen to look at a netflix.\n\nDystopian nightmare.\n\nI’m done. These companies have gotten too much ego.",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q1t1mc/another_ticked_off_customer/"
    },
    {
        "id": "1q1zdf3",
        "author": "whatever-that-takes",
        "title": "Stranger things S5",
        "content": "Is it just me or someone else also found the first episode of season 5 boring?\n\nI liked the previous seasons and now that whole season 5 is out, I wanted to watch it. I watched a recap video of previous seasons to remember again what had happened and watched 1st episode of new season. Somehow I found it really boring without anything interesting happening in there. \n\nIs the whole season like this or it gets better? I don’t wanna waste my time just to finish the series for the sake of finishing it. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q1zdf3/stranger_things_s5/"
    },
    {
        "id": "1q1jskj",
        "author": "isnotacrayon",
        "title": "Physical: Welcome to Mongolia missing episodes?",
        "content": "I thought this show was supposed to be four total episodes, and the last two were meant to drop on 12/30, but they have not yet. Does anyone know why this could be?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q1jskj/physical_welcome_to_mongolia_missing_episodes/"
    },
    {
        "id": "1q15rk9",
        "author": "OriginalRequirement6",
        "title": "Members Only: Palm Beach",
        "content": "Gale is a racist uneducated xenophobe. I don't care about anyone's opinions of Romina but the fact that this woman couldn't understand her country of origin (kept saying Pakistan instead of Uzbekistan) THREE TIMES, criticized her cultural way of eating and then said in interviews she needs to go back to her country is wild. Like this is straight up xenophobic.",
        "upvotes": 24,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q15rk9/members_only_palm_beach/"
    }
]