[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 101,
        "comments": 311,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mlvmcg",
        "author": "Old-Word6338",
        "title": "Does anyone else not like the Wednesday series on Netflix?",
        "content": "I’ve always been a big Addams Family fan, so when Netflix announced the Wednesday series, I was super excited. I didn’t expect it to be exactly like the old Addams Family. I knew it would have its own twist, but it just feels off.\n\nI honestly didn’t like the acting. It looks weird and unnatural, not in the charming, spooky Addams Family way, but in a “this doesn’t feel believable” way. The makeup doesn’t look good either, and instead of adding to the atmosphere, it makes the characters look kind of awkward.\n\nThe plot also feels too childish, like it’s trying to be edgy but still ends up being a teen drama without much depth. The detective/thriller angle is actually a good idea in theory, but the execution feels… meh.\n\nIt’s below the quality I usually expect from Netflix’s big series, and it’s disappointing because it could have been amazing.\n\nIs it just me? Or did anyone else go in with high hopes and come out feeling… meh?",
        "upvotes": 411,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1mlvmcg/does_anyone_else_not_like_the_wednesday_series_on/"
    },
    {
        "id": "1mm45d5",
        "author": "Tall_Eye4062",
        "title": "The quality of Netflix's documentaries has been dropping.",
        "content": "Considering their recent price hike, documentaries should be getting better, not worse. Jerry Springer: Fights, Camera, Action was only 2 episodes and was super surface-level. They didn't even mention Steve, who was a big part of the show. Then you have Surviving Black Hawk Down, a 3 episode documentary that had Army Rangers using full auto M16A2s (The A2 doesn't have auto, just semi and burst). The 2001 movie did a better job of telling the story than the documentary.",
        "upvotes": 87,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1mm45d5/the_quality_of_netflixs_documentaries_has_been/"
    },
    {
        "id": "1mm6j7j",
        "author": "ToonAdventure",
        "title": "ONE PIECE: Season 2 | First Look | Netflix",
        "content": "",
        "upvotes": 33,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm6j7j/one_piece_season_2_first_look_netflix/"
    },
    {
        "id": "1mmivc4",
        "author": "cooconnor",
        "title": "What is a show I should binge that was originally released between 2000 and 2010?",
        "content": "I’m home with a new baby and I like this decade of shows released.   Have done a LOST rewatch and ER in the last year.  Many seasons/ep’s is fine!  Even shows that started before 2000 but went into this decade are worthy of recommendation. Thank you! ",
        "upvotes": 4,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1mmivc4/what_is_a_show_i_should_binge_that_was_originally/"
    },
    {
        "id": "1mme9qo",
        "author": "Longjumping_Land_977",
        "title": "Brad Bradley has shared details of all the tips the family has had since Amy Bradley Is Missing came out",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mme9qo/brad_bradley_has_shared_details_of_all_the_tips/"
    },
    {
        "id": "1mlxagw",
        "author": "Cool_Bath_77",
        "title": "PLEASE add a \"leaving soon\" section",
        "content": "Does anyone believe they would benefit from a \"leaving soon\" section added to the Netflix app?\nMy watchlist is so long and I am sure I miss out on watching titles because of them getting removed. If they added a \"leaving soon\" section to my watchlist (similar to Hulu's \"expiring\"), I would definitely always start on their app before watching something on my TV. If they added \"leaving soon\" for all the titles leaving Netflix, I probably would not watch any other app! \nWhat are your thoughts on this? Do you ever think how great it would be to have a \"leaving soon\" section added to the app or to the filter on the Netflix Mobile app?",
        "upvotes": 86,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1mlxagw/please_add_a_leaving_soon_section/"
    },
    {
        "id": "1mllxlr",
        "author": "Legitimate_Ad3625",
        "title": "As Stephen Colbert Signs Off For Summer Hiatus, He Says: “Netflix, Call Me I’m Available In June”",
        "content": "",
        "upvotes": 392,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1mllxlr/as_stephen_colbert_signs_off_for_summer_hiatus_he/"
    },
    {
        "id": "1mm88x2",
        "author": "Top-Three-USA",
        "title": "Netflix Renews Live-Action “One Piece” for Season 3; Drops First Look at Season 2",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mm88x2/netflix_renews_liveaction_one_piece_for_season_3/"
    },
    {
        "id": "1mmdldp",
        "author": "Exciting_Event_7024",
        "title": "Did Netflix just get more expensive in Australia",
        "content": "",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mmdldp/did_netflix_just_get_more_expensive_in_australia/"
    },
    {
        "id": "1mmldno",
        "author": "ProfessionalNews2399",
        "title": "Why is my subtitles like this even though they were working before",
        "content": "They were working last episode and now they changed to that color and google was no help at. And I tried everything resetting it closing the app I’m on PlayStation btw ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zk0z6rlxm7if1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mmldno/why_is_my_subtitles_like_this_even_though_they/"
    },
    {
        "id": "1mmig6r",
        "author": "cynicalspinster21",
        "title": "Renewed my subscription and need suggestions.",
        "content": "Hi All, as the title suggests I recently renewed my netflix subscription after a year and need suggestions on what to watch.\n\nMy favorite genre is Thriller, mystery, adventure, comedy,romcom. Not a big fan of heavy dramas but comedy with a hint of drama is also great.\n\nAlso I am a binge watcher type and some of the  shows I loved in the past: Derry Girls, Travelers, \nBlacklist, Dark and all the usual cult comedies.\n\nPlease suggest some of your recent favorites as I have mostly watched all the cult classics.Thanks.\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mmig6r/renewed_my_subscription_and_need_suggestions/"
    },
    {
        "id": "1mmke6o",
        "author": "blueberrman2",
        "title": "Netflix what the fuck",
        "content": "Ok so I was just going to pick movie to watch on netflix and suddenly the only shows and movies shown on the app are netflix originals, besides a few exceptions. I searches up a bunch of movies and TV shows that were available as of YESTERDAY who had no leaving soon banner. Can anyone tell wtf is going bc I'm gonna CRASH TF OUT.",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wfci3gz3f7if1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mmke6o/netflix_what_the_fuck/"
    },
    {
        "id": "1mmiy9l",
        "author": "TheMirrorUS",
        "title": "Jennifer Lopez's marriage history as hit movie arrives on Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mmiy9l/jennifer_lopezs_marriage_history_as_hit_movie/"
    },
    {
        "id": "1mlmo7a",
        "author": "ysleez",
        "title": "Unbelievable- Netflix mini series, most underrated true crime series",
        "content": "If you love shows like Mindhunter, slow paced true crime show with a lot of emotions, I'm sure you'll love this. The story really gets you to feel how upset and helpless Marie (Kaitlyn Dever) gets and it's a great performance by her as well. But you have to hold your patience, there's some unnecessary stuff tho.",
        "upvotes": 55,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmo7a/unbelievable_netflix_mini_series_most_underrated/"
    },
    {
        "id": "1mmj3r0",
        "author": "Realistic-Bread-9544",
        "title": "Wednesday",
        "content": "\n\nWhat do you guys think about the first part of season 2 for this show? Personally, I feel like it’s been quite an interesting ride so far. The plot seems to have picked up in pace compared to season 1, and there’s a lot more tension and drama building up between the characters. I’ve noticed that the writing feels sharper, and some of the storylines are finally starting to pay off after being set up earlier in the series. The new characters they introduced have also brought fresh energy and unexpected twists, which keep things exciting. Of course, there are still a few moments where the pacing slows down, but overall, it feels like the show is heading in a strong direction. I’m curious to hear whether you think the changes have improved the series or if you prefer the way season 1 unfolded.\n",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2dxt7vkz57if1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mmj3r0/wednesday/"
    },
    {
        "id": "1mm7wxz",
        "author": "CauliflowerHuman7318",
        "title": "Netflix (on windows laptop) keeps rewinding on its own every 30 seconds, please help",
        "content": "As stated, Netflix keeps rewinding every 30 seconds, and I can't seem to fix it. I've tried uninstalling and reinstalling the app and lowering the frame rate, but neither of those things worked. Because I am using a Windows laptop, the app opens through edge as a website rather than an actual application, so I'm thinking maybe it has something do with Microsoft Edge. If anyone has any solutions, please let me know what I can do to fix this problem!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm7wxz/netflix_on_windows_laptop_keeps_rewinding_on_its/"
    },
    {
        "id": "1mm1b43",
        "author": "HieronymusGER",
        "title": "Looking for dumb shows like Hack my home or Instant Dream Home",
        "content": "Cant stop rewatching those shows to save my life...Is it cake kinda hits the same spot for me. Does anyone else have similar recommendations? Disney Plus or Amazon Prime are also fine",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm1b43/looking_for_dumb_shows_like_hack_my_home_or/"
    },
    {
        "id": "1mmbb9e",
        "author": "FitAbalone736",
        "title": "Is Wednesday Season 2 good and worth watching?",
        "content": "\nTell me without spoilers please. I watched the first season and enjoyed it. It wasn’t like the best show ever but I enjoyed it enough to finish it. I liked all the plot twists and turns. Just wanted to get some insight from people who have seen this new season of Wednesday. Also feel free to add a brief synopsis of the plot in your comment without spoiling it please.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mmbb9e/is_wednesday_season_2_good_and_worth_watching/"
    },
    {
        "id": "1mlwzik",
        "author": "Saladee_7",
        "title": "My life with the Walter boys",
        "content": "Just watched the first episode of this show. I’ve been avoiding it for the longest because I’m already exhausted with a certain other show with a similar plot (there are many shows with a similar plot). I’m tired of high school shows in general if I’m being honest. Anyways…I randomly started watching episode one and so far this has been everything I’ve feared. This show is basic, vanilla, run-of-the-mill love triangle, cringe, stiff, predictable, most boring thing ever. This show is for 14 year olds. I couldn’t even get through the first episode and this show is getting a whole other season?! Thaaaaats crazy. ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mlwzik/my_life_with_the_walter_boys/"
    },
    {
        "id": "1mm42i4",
        "author": "Claumered",
        "title": "K-Pop Demon Hunters in the wild",
        "content": "I was out at a restaurant with my parents and all of a sudden I hear ‘Soda Pop’ being played through the restaurant speakers. It’s crazy how mainstream this movie has become.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm42i4/kpop_demon_hunters_in_the_wild/"
    },
    {
        "id": "1mm8zfl",
        "author": "Upstairs_Road_9908",
        "title": "Netflix has been loading so much this week.",
        "content": "Hi everyone!\n\nJust want to ask if anyone’s netflix screen has been buffering nonstop lately.\n\nWe just want to watch some shows but it is hard to access it lately.\n\nWe hope we can ask for help about it or just want to see if anyone is having the same problem as we do.\n\nThanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mm8zfl/netflix_has_been_loading_so_much_this_week/"
    },
    {
        "id": "1mm7i9q",
        "author": "enw2",
        "title": "Missed opportunity? First Happy Gilmore not on Netflix",
        "content": "Happy Gilmore 2 was huge for Netflix, why didn’t they think to continue paying for the streaming rights to the first Happy Gilmore? It left Netflix July 31st… 5 days after the sequel premiered. What gives? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mm7i9q/missed_opportunity_first_happy_gilmore_not_on/"
    },
    {
        "id": "1mlelak",
        "author": "Narrow_Tomorrow_7971",
        "title": "just finished apple cider vinegar",
        "content": "okay wait i need someone to talk to about this show. i had personally never heard of belle gibson (im american and not really into the health side and i was in middle school when all that happened) but i was instantly hooked. and idk i have a couple things. i do feel sympathetic for belle because its obvious she never really got love in her life and no one deserves that, but the way she went about finding it is insane. the fact that clive stayed with her when the whole time i was like babe youre too cute for this please leave her. and millas whole arc was insane and i really enjoyed this show overall and would love to hear everyones thoughts &lt;3",
        "upvotes": 78,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1mlelak/just_finished_apple_cider_vinegar/"
    },
    {
        "id": "1mm6kti",
        "author": "After-Foundation4185",
        "title": "Taco Boys - Your idol",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm6kti/taco_boys_your_idol/"
    },
    {
        "id": "1mmh999",
        "author": "Wild-Commission-9077",
        "title": "The four seasons just finished them all. (Spoiler alert)",
        "content": "[The four seasons] is the series title...\n\n\n\n\n\n\n\n\n\n\n\nI should say the author had no idea how to concile or end the conflict in any usual complicated conversation or a series of ordinary events way, so they exploded the house,( was okay until then) and made dan thought clode was dead(was understandable till this), and made kate nearly dead. And really killed nick. More over, those two left couples relationship is unequal either. Idk what is clode's job, and i think kate take care of too much things alone. Pregnancy, i dont mind, but i am not sure if theres more for the series to show us. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mmh999/the_four_seasons_just_finished_them_all_spoiler/"
    },
    {
        "id": "1mltu2p",
        "author": "skylarkills69",
        "title": "the show “secrets we keep”",
        "content": "Dude this was so crazy and shocking, then i watched the glass dome and was more shocked. \nThese shoes are binge worthy. I was hooked on my tv screen for a while, the plot twists and jumpscares were intense. \n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mltu2p/the_show_secrets_we_keep/"
    },
    {
        "id": "1mloyoq",
        "author": "refdeser",
        "title": "Stolen : Heist of the Century",
        "content": "Just finished watching, this is exactly how I imagine a vault robbery would play out in real life. Kudos to the police officers for catching the criminals and following every clue they left behind.\n\n**spoiler**\n\nI believe this could have been the perfect crime if they had handled the rubbish differently by burning it all, so the police couldn’t follow their trail. But it happened the way it did, so all the time spent planning the robbery ended up going to waste, I guess.\n\nAt the end, Leonardo Notarbartolo still insists that he wasn’t the mastermind of the crime, but just one of the gang. What’s your opinion on this? Was he really just following the gang’s lead, or was he actually the one in charge? I still believe he’s a genius for hiding the fact that he was the mastermind. \n\nWhat happened to Agim, the police officer, in 2015, when he was found in possession of illicit diamonds is truly devastating. I believe he fell in with the wrong crowd and got caught red-handed. I hope he’s living a better life now.\n",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mloyoq/stolen_heist_of_the_century/"
    },
    {
        "id": "1mmf4m1",
        "author": "dexter2516",
        "title": "[Discussion] Dark isn’t just a show — it’s Netflix’s crown jewel",
        "content": "Just finished watching Dark on Netflix for the second time, and I’m convinced — it’s not just a show, it’s a masterpiece. The writing, the timelines, the mind-bending twists… every detail feels like it was carved with precision.\n\nIt’s rare to see a series so perfectly balanced between complexity and emotion. Shows like this don’t come around often — honestly, it might take decades for Netflix (or anyone) to deliver something this ambitious and flawless again.\n\nIf you haven’t seen it yet, watch it. If you have, I’d love to hear how long it took you to recover from that ending.\nAnd for those who’ve seen it — what’s the closest thing to Dark you’ve found on Netflix?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mmf4m1/discussion_dark_isnt_just_a_show_its_netflixs/"
    },
    {
        "id": "1mm86vp",
        "author": "pixie-kitten-",
        "title": "Netflix - PiP on iPhone",
        "content": "I know that some time in the past Netflix decided to block PiP on iPhones for those with the ads included version.  Has anyone found a way around this?  I usually watch while doing other things on my phone, so this obviously creates an issue for me.\n\nI get Netflix with ads for free with my cell phone contract, so I don’t want to upgrade if it can be avoided.\n\nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm86vp/netflix_pip_on_iphone/"
    },
    {
        "id": "1mm3jn6",
        "author": "DelicateBanshee",
        "title": "Second location issues",
        "content": "I pay for Netflix for myself and my dad, who lives at a separate location, I am paying the fee for a second location, but every time I try to watch Netflix I have to say I’m the primary household, and then my dad has to do the same thing when he wants to watch. Essentially kicking the other person out. \n\nI wouldn’t mind so much if I didn’t have to log in on my back up email account every time either of us try to watch something to confirm it’s actually my account. \n\nDoes anyone know what I am doing wrong? I know it’s something but I am annoyed I’m paying for the extra location and it’s essentially wasted money. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mm3jn6/second_location_issues/"
    }
]