[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pbh03p",
        "author": "Dangerous_Bite_7601",
        "title": "Pareri Lingotto",
        "content": "Buongiorno, lavoro nella provincia sud di torino ed attualmente ci vivo ma per questioni di vita sociale ecc sto valutando trasferimento zona lingotto (via nizza fermata Spezia circa). Parei sulla zona? Malfamato? Alto rischio furti in casa? Rischio smembramento dopo il tramonto? Aggiungo che so essere una zona abbastanza periferica però mi è comodo per il tragitto poi verso il lavoro.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pbh03p/pareri_lingotto/"
    },
    {
        "id": "1pbc9vm",
        "author": "alexsimi",
        "title": "Satsumaimo o patata dolce giapponese: dove trovarla?",
        "content": "Sto cercando la patata dolce giapponese o “satsumaimo”, l’ho mangiata solo una volta e me la sto ancora sognando. Cercando nei supermercati, anche quelli “di nicchia” come il Banco Fresco, si trova solo quella americana arancione. Quella giapponese è viola dentro e bianca fuori, qualcuno la compra o l’ha vista in giro e saprebbe indicarmi dove trovarla? Anche mercati va bene. ",
        "upvotes": 4,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/am33npmycl4g1.jpeg?auto=webp&amp;s=0c795546772737e069ebea3b290cc09b9a6038f7"
        },
        "permalink": "/r/torino/comments/1pbc9vm/satsumaimo_o_patata_dolce_giapponese_dove_trovarla/"
    },
    {
        "id": "1pbchog",
        "author": "BrightMud165",
        "title": "Mi consigliate uno psicologo a Torino che faccia anche EMDR?",
        "content": "Ho perso un anno e mezzo con uno psicologo che non è stato in grado di aiutarmi. Soldi buttati. Ora sono alla ricerca di uno psicologo che faccia (preferibilmente) CBT e (soprattutto) EMDR.\nAvete aualcuno da consigliarmi?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pbchog/mi_consigliate_uno_psicologo_a_torino_che_faccia/"
    },
    {
        "id": "1pbeis8",
        "author": "yhk266",
        "title": "Indoor Basketball Runs",
        "content": "Ciao tutti,\n\nFatemi sapere se vi piacerebbe giocare a basket ogni settimana alle 2000 a Torino. Coperta e meglio per i vostri ginocchi. \n\nHey everyone,\n\nLet me know if anyone is interested in playing basketball weekly at 08:00 PM in Turin. Indoor runs.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pbeis8/indoor_basketball_runs/"
    },
    {
        "id": "1pasq3m",
        "author": "agoodboy9999",
        "title": "Cercasi disadattati",
        "content": "Salve abito nelle zone torinesi e cerco persone con cui fare amicizia o magari anche avere delle relazioni. Ho 28 anni e adoro i casi umani come me. Se vi garbano videogiochi, film e fumetti andremo sicuramente d'accordo. Inoltre se andate in psicoterapia come il sottoscritto possiamo passare il tempo a overthinkare sulle nostre vite. ",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pasq3m/cercasi_disadattati/"
    },
    {
        "id": "1pbcliw",
        "author": "Wrong_County_6738",
        "title": "RETTILI TORINO",
        "content": "Ciao ragazzi, ci riprovo...    \nCerco appassionati di rettili a Torino con cui fare due chiacchiere e magari scambiare qualche ISOPOD ecc ... Grazie ciao!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pbcliw/rettili_torino/"
    },
    {
        "id": "1pbc3ak",
        "author": "francoislechampi",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti :) \nMi rendo conto che questo è l'ennesimo post del genere qui, ma ci provo anch'io: sono un ragazzo di 22 anni, studente a Torino, che avrebbe piacere a conoscer nuove persone, in tutta tranquillità, magari per un caffè o qualcosa di simile ogni tanto. Mi piace moltissimo leggere, ma anche ascoltar musica, parlare di attualità... Un po' la qualunque, insomma.\nFatemi sapere :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pbc3ak/nuove_amicizie/"
    },
    {
        "id": "1pbad5m",
        "author": "enricoscarsi",
        "title": "Proprietari di case vacanza a Torino: quanto contano le foto per le prenotazioni online?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pbad5m/proprietari_di_case_vacanza_a_torino_quanto/"
    },
    {
        "id": "1pb9omy",
        "author": "Lindanineteen84",
        "title": "C'è qualcuno con il patentino fitosanitario a Torino?",
        "content": "Mi servono informazioni da chi ce l'ha già.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pb9omy/cè_qualcuno_con_il_patentino_fitosanitario_a/"
    },
    {
        "id": "1pb62zt",
        "author": "Sadebbasta",
        "title": "Orange Torino",
        "content": "Ciao ragazzi sto cercando una gymsis o gymbro con cui andare in palestra e allenarsi insieme e magari anche fare amicizia. Qualcuno va alla Orange di Collegno o di Via Cercenasco? ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pb62zt/orange_torino/"
    },
    {
        "id": "1pascoq",
        "author": "Dense-Knee547",
        "title": "Che zona evitare?",
        "content": "Ciao ragazzi volevo chiedervi a una persona che si dovesse trasferire a Torino e un budget basso 600/650€ e inoltre avendo una macchina penso che dovrò stare un quartieri esterni per trovare parcheggi gratuiti senza disco orario quale zona non consigliereste? E come mai la Consigliate?",
        "upvotes": 9,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1pascoq/che_zona_evitare/"
    },
    {
        "id": "1pay0yu",
        "author": "Micc5758",
        "title": "Valdocco?",
        "content": "Ciao a tutti, a breve mi trasferisco in zona valdocco. Cosa ne pensate? Avete esperienze? Zona via Maria ausiliatrice/Via Salerno. Mi sembra tattica per zone centrali come quadrilatero, ma mi hanno detto che via Cigna/ Corso Principe Odone sono abbastanza degradate. Grazie ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pay0yu/valdocco/"
    },
    {
        "id": "1pag5et",
        "author": "Civil-Youth3719",
        "title": "Torinesi, cosa ne pensate della nuova pubblicità della Fiat 500?",
        "content": "Premesso che io non sono di Torino ma frequento la città; mi è capitato di recente di vedere questo spot in tv e mi chiedevo che effetto potesse fare su un torinese, nutrito come immagino nel mito della Fiat (?), visto quanto lo spot mette l'immaginario della città e del passato Fiat in primo piano.\n\nhttps://youtu.be/56TeK3qn9YU?si=rm7DhwewSh_vU14E",
        "upvotes": 12,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/exFV7JiArZQ_7feIlfN1fIMxtk_qbmhrEnbKxc1fVeA.jpeg?auto=webp&amp;s=1be14c2c573ddd895ebfadeecef93d4e6c0e25d8"
        },
        "permalink": "/r/torino/comments/1pag5et/torinesi_cosa_ne_pensate_della_nuova_pubblicità/"
    },
    {
        "id": "1paphy7",
        "author": "grovio8888",
        "title": "Cercasi Alimentare/Rosticceria di buon livello",
        "content": "Ciao Torino! \n\nHo un folto numero di ospiti in arrivo da fuori città e volevo trovare una rosticceria o alimentare di buon livello (meglio ancora se di tradizione piemontese) da cui ordinare un po di cibo pronto per sfamare tutti.\n\nAvete qualche posto da consigliare?\n\nGrazie in anticipo \n\nEdit: zona ideale Crocetta/San Salvario o Santa Rita",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1paphy7/cercasi_alimentarerosticceria_di_buon_livello/"
    },
    {
        "id": "1pan7a2",
        "author": "atyahoosp",
        "title": "Euroleague Basketball club night?",
        "content": "Ciao!\n\nVivo a Torino da un annetto e sarei molto felice di conoscere amiche e amici appassionati di basket Eurolega, per guardare insieme le partite infrasettimanali e socializzare.\n\nSpero interessi a qualcuno!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pan7a2/euroleague_basketball_club_night/"
    },
    {
        "id": "1pao7a5",
        "author": "sardoabroad93",
        "title": "Consigli su catenaccio Bici",
        "content": "Ciao a tutti, vi chiedo un parere per quanto riguarda acquisto catenaccio antifurto per bici. Qui a Torino rubano bici molto facilmente e volevo capire quale tra questi è in più difficile da tagliare.\n Allego due foto ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pao7a5/consigli_su_catenaccio_bici/"
    },
    {
        "id": "1pafl9o",
        "author": "FutureVirtual6811",
        "title": "First Residence Permit Application",
        "content": "Hi everybody. I’m a new student at Turin and I have a question. I have applied for my first residence permit and my fingerprinting appointment is in spring. Currently it says “In istruttoria” (I think it means application in process which means waiting for appointment but correct me if I’m wrong) at my immigration portal page. My situation is this: For various reasons, I decided to stay at my home country this school semester and I’m entering Italy to enter exams once in 1-2 months and then returning. I’m not sure what I will do next semester and while my current situation isn’t clear but I’m worried if the fact that I’m mostly out of Italy while still continuing my studies by entering exams would be a issue that would cause my first application to get rejected? Does anyone know anybody with a similar situation, and what are your experiences? Keep in mind that I have a valid multi entry visa that will stay valid even after the potential date I receive my permit in 6-7 months.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pafl9o/first_residence_permit_application/"
    },
    {
        "id": "1pado43",
        "author": "Fickle-Fondant-2641",
        "title": "Anyone going to Kiko Loureiro in Turin?",
        "content": "Is anyone here planning to hit the Kiko Loureiro concert in Turin? thought it’d be cool to link up with some other fans. If you’re down, drop a comment or DM 🤘🔥\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pado43/anyone_going_to_kiko_loureiro_in_turin/"
    },
    {
        "id": "1pa3urp",
        "author": "Virtual_Aide_7330",
        "title": "Com'è Cenisia?",
        "content": "In particolare via Capriolo? Tranquilla? Com'è collegata al centro e alle università? Grazie mille!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pa3urp/comè_cenisia/"
    },
    {
        "id": "1pa0vze",
        "author": "Spirited_Currency_30",
        "title": "Panettone buoni/particolari a Torino",
        "content": "Ciaoo. Vorrei chiedere se qualcosa sa dei posti che ne hanno dei panettoni particolari o mega buoni.\n\nCioè io non so fare la differenza tra quello della coop e quello dal mercatò. Però lo voglio prendere come regalo. E se ne ha il pistacchio ancora meglio ",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1pa0vze/panettone_buoniparticolari_a_torino/"
    },
    {
        "id": "1p9i3wc",
        "author": "Dry_Temporary_384",
        "title": "A Torino è assolutamente la norma che le macchine parcheggino sulle strisce pedonali, che si può fare?",
        "content": "Onestamente mi sono stufata di dover attraversare in mezzo alla strada perchè puntualmente c'è una macchina sulle strisce pedonali. Un cittadino cosa può fare per segnalare tutte queste macchine?",
        "upvotes": 23,
        "comments": 43,
        "media": null,
        "permalink": "/r/torino/comments/1p9i3wc/a_torino_è_assolutamente_la_norma_che_le_macchine/"
    },
    {
        "id": "1p9z4gj",
        "author": "terli01",
        "title": "Andare a vivere in zona Italia61",
        "content": "Ciao a tutti, sto cercando casa da acquistare e ne ho trovata una che potrebbe piacermi in zona Italia61, a 5 minuti a piedi dalla metro. Nonostante io sia di Torino non conosco per nulla questa zona perché ho sempre abitato in zona Torino nord, vorrei avere qualche opinione da parte di chi ci vive, la casa che ho trovato si trova in via passo buole e visitando la zona di giorno mi è sembrata ok. La cosa che mi attrae molto è la vicinanza della metro, inoltre credo che la futura costruzione del parco della salute potrebbe aiutare a riqualificare ulteriormente la zona e ad aumentarne il valore degli immobili. In generale consigliereste di abitare in questa zona? Meglio o peggio di zone come piazza massaua? I prezzi sono più o meno simili ma per questioni lavorative mi verrebbe più comodo stare in zona Torino sud vicino alla metro. La sera è tranquilla o dovrò avere paura di tornare a casa? Ci sono punti squallidi o tutto sommato è una zona che va bene?",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1p9z4gj/andare_a_vivere_in_zona_italia61/"
    },
    {
        "id": "1p9yv5d",
        "author": "taesub",
        "title": "Consigli parrucchiere",
        "content": "Ciao, sono una ragazza di 22 che studia qua a Torino e vorrei andare da un parrucchiere. Nello specifico, sarei interessata a fare il trattamento di nanoplastia. Mi chiedevo se qualcuno avesse un salone da consigliarmi che sia affidabile e non folle per quanto riguarda i prezzi. So che posso cercare online ma purtroppo non mi fido completamente delle recensioni su Google rischiando che siano bot. Grazie mille ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p9yv5d/consigli_parrucchiere/"
    },
    {
        "id": "1p9n8ce",
        "author": "Marnan98",
        "title": "Per chi volesse o avesse bisogno di fare conoscenze e fare attività variegate",
        "content": "Ciao a tutti, leggendo molti post di ragazze e ragazzi che dicono di voler conoscere qualcuno o che si sono trasferiti da poco, volevo farne uno di logica opposta. Sono un ragazzo di 27 anni di Torino, di giorno lavoro e la sera mi piace uscire, sia con gli amici (ragazze e ragazzi della mia età grossomodo), sia conoscere gente nuova. Le attività spaziano da una tranquilla serata giochi in locali apposta, ad eventi più strutturati e carini, ad aperitivi e cene, a disco vere e proprie. Ce n’è per tutti i gusti in pratica! Se qualcuno fosse interessato me lo può far sapere ed organizziamo molto volentieri. Ci sono un sacco di posti belli ed un sacco di attività carine ed interessanti che si possono fare! ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p9n8ce/per_chi_volesse_o_avesse_bisogno_di_fare/"
    },
    {
        "id": "1p9lg8f",
        "author": "Geek4Etenity",
        "title": "Moving to Turin for studies, looking to get some info on general prices",
        "content": "Hi, I'm moving to Turin soon for an internship. I'm looking for some help with budgeting. I keep finding wildly different numbers around for grocery prices. Some say 400-600 per month, other websites say 150-200 per month. Can someone please let me know how much things cost there and what the best stores are to shop at on a budget? Thanks in advance!",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1p9lg8f/moving_to_turin_for_studies_looking_to_get_some/"
    },
    {
        "id": "1p8u4jw",
        "author": "Majestic-Pain-7230",
        "title": "25, mi piacerebbe conoscere nuove persone",
        "content": "-Sì, so che siete stanchi di questi post\n\n-Sì, ci sono persone che hanno difficoltà ad avere amicizie anche in una città così grande \n\n-No, non riesco a fare amicizie con persone che incontro durante attività. Le persone vogliono fare attività e poi farsi i cazzi propri con amicizie che già hanno e non sono bravo a disturbare sconosciuti.\n\nChiariti questi punti…piacere sono un ragazzo di 25 anni che vive a Torino da qualche anno, zona nord che purtroppo non è collegata benissimo e questo non ha aiutato particolarmente la mia vita sociale dal momento che lavoro anche full time.\n\n Ho interessi molto diversi tra loro, mi piace leggere molto, principalmente filosofia e thriller, seguo diversi manga giapponesi e gioco spesso ai videogiochi, ma ho anche interessi sportivi come il basket e le arti marziali che pratico. \nNon cerco niente di complesso se non persone con cui passare del tempo a bere qualcosa e parlare di tanti argomenti diversi, quindi se qualcuno è alla ricerca di conoscenze come me si faccia pure avanti, grazie per aver letto fin qui \n\n\n",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p8u4jw/25_mi_piacerebbe_conoscere_nuove_persone/"
    },
    {
        "id": "1p8yrhi",
        "author": "AfraidAd2805",
        "title": "è percorribile la corsia dei taxi a Torino Lingotto (stazione) ?",
        "content": "",
        "upvotes": 8,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xusgjm8rv04g1.png?auto=webp&amp;s=88b0edc60a2e8cfcdca460904ab687a65609a8bd"
        },
        "permalink": "/r/torino/comments/1p8yrhi/è_percorribile_la_corsia_dei_taxi_a_torino/"
    },
    {
        "id": "1p8ux3i",
        "author": "vamphorse",
        "title": "Flying into Turin? Get the right side window for an awesome view of the city.",
        "content": "If you know the city, you can distinguish pretty much every major landmark. Pista lingotto, Mole Antonelliana, Valentino, Porta Nuova and Porta Susa, Superga, all major Piazze...  Cool both by day and night.  \n\nOn the other hand, if you take the left window, you'll have a nice view of the Alps.\n\nSource: my experience from countless landings on the city. Not once has the plane taken a different approach to Caselle Airport. My guess is the Alps make it so that the wind direction is constant (?).",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1p8ux3i/flying_into_turin_get_the_right_side_window_for/"
    }
]