[
    {
        "id": "1lerg9a",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Celine Song - Friday 6/20 at 1:00 PM ET - Oscar-Nominated Director and Writer of A24's 'Past Lives' and 'Materialists'",
        "content": "",
        "upvotes": 117,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kllusxuruq7f1.png?auto=webp&amp;s=d341eb7e7ee2cb970be7cb498b045e56a3381e48"
        },
        "permalink": "/r/movies/comments/1lerg9a/amaqa_announcement_celine_song_friday_620_at_100/"
    },
    {
        "id": "1lar390",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (The Life of Chuck, Materialists, How to Train Your Dragon, Echo Valley, Straw, Deep Cover) and Throwback Discussions (Gone In 60 Seconds)",
        "content": "**New In Theaters**:\n\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Gone In 60 Seconds](https://www.reddit.com/r/movies/comments/1la4c94/official_throwback_discussion_gone_in_60_seconds/)\n\n**Still In Theaters**:\n\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n* [Dangerous Animals](https://old.reddit.com/r/movies/comments/1l4gwso/official_discussion_dangerous_animals_spoilers/?)\n* [Karate Kid: Legends](https://old.reddit.com/r/movies/comments/1kyson2/official_discussion_karate_kid_legends_spoilers/?)\n* [Bring Her Back](https://old.reddit.com/r/movies/comments/1kysoob/official_discussion_bring_her_back_spoilers/?)\n* [Tornado](https://old.reddit.com/r/movies/comments/1kysore/official_discussion_tornado_spoilers/?)\n* [Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n* [Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n* [Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n* [Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n**New On Streaming:**\n\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/) \n* [Straw](https://www.reddit.com/r/movies/comments/1lar0h7/official_discussion_straw/)\n* [Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n* [Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n* [Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)",
        "upvotes": 26,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1lar390/official_discussion_megathread_the_life_of_chuck/"
    },
    {
        "id": "1lesfjc",
        "author": "ChiefLeef22",
        "title": "'28 Years Later' - Review Thread",
        "content": "Director: Danny Boyle\n\nCast: Jodie Comer; Aaron Taylor-Johnson; Ralph Fiennes; Alfie Williams\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/28_years_later)\n\n**Metacritic:** [82/100](https://www.metacritic.com/movie/28-years-later/)\n\nSome Reviews:\n\n[Manila Bulletin - Philip Cu Unjieng](https://mb.com.ph/2025/06/18/the-28-legacy-continues-a-review-of-28-years-later)\n\n&gt;What’s nice to note is how Boyle has cast consummate actors in this film, the type who could read off a label of canned sardines and still find depth, emotion, and spark in the delivery of those lines. Initially, it seems that Taylor-Johnson will be doing the heavy lifting. Still, it merely misleads us, as the narrative then focuses on Jodie Comer’s Isla and onto Fiennes’ Dr. Kelson. I want to give a special shout-out to the young actor Alfie Williams. He is the one carrying the whole film, and this is his first feature film work, having previously done a TV series. Boyle teases out an excellent performance from the lad, and I won’t be surprised if many film reviewers in the forthcoming week will single him out as being the best thing in this film. And what’s impressive is how he manages this with the three heavyweight thespians who are on board.There’s the horror and the suspense as a given for this cult franchise, but look out for the human drama and the emotional impact. It’s Boyle and Garland elevating the film, and rising above its genre.\n\n[AwardsWatch - Erik Anderson](https://awardswatch.com/28-years-later-review-danny-boyles-iphone-shot-zombie-sequel-is-audacious-disjointed-and-bewildering-b/) \\- 'B'\n\n&gt;Most of the time, *28 Years Later* is frequently begging to be rejected by general audiences, even as it courts the admiration of longtime fans, who may nonetheless find themselves put off by the film’s turn toward unearned emotion, its relatively meager expansion of this universe, and its occasionally jarring tonal shifts. (The abrupt sequel-teasing stinger feels like it’s from an entirely different strain of the zombie subgenre.) Much like the virus at the series’ center, it’s a film whose DNA is constantly mutating, resulting in an inconceivable host subject—one that is both corrosive and something of a marvel.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/06/28-years-later-review-danny-boyle-jodie-comer-zombie-horror-1236436839/)\n\n&gt;Most threequels tend to go bigger, but *28 Years Later* bucks that trend by going smaller, eventually becoming a chamber piece about a boy trying to hold onto his mother. It still delivers shocks, even if the sometimes over-zealous editing distracts from Anthony Dod Mantle’s painterly cinematography\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/28-years-later-review-jodie-comer-aaron-taylor-johnson-1236294541/)\n\n&gt;One of the chief rewards of *28 Years Later* is that it never feels like a cynical attempt to revisit proven material merely for commercial reasons. Instead, the filmmakers appear to have returned to a story whose allegorical commentary on today’s grim political landscape seems more relevant than ever. Intriguing narrative building blocks put in place for future installments mean they can’t come fast enough.\n\n[NextBestPicture - Josh Parham](https://nextbestpicture.com/28-years-later/) \\- 7/10\n\n&gt;Boyle’s exuberant filmmaking and Garland’s incisive script sometimes clash when forced to muddle through laborious exercises that feel borrowed from the previous films anyway. It’s a scenario that reminds me of Ridley Scott’s “Prometheus” and “Alien: Covenant,” two films with intriguing ideas that struggled to fashion them within the framework of the established franchise. Perhaps the continuation will find more clever avenues to explore further and enrich this text. As is, what is left is imperfect but still an enthralling return into a dark but provocative world.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/28-years-later-review-1235133645/) \\- 'B+'\n\n&gt;While Boyle isn’t lofty enough to suggest that the infected are beautiful creatures who deserve God’s love or whatever (this is still a movie about wild-eyed naked zombies, after all, and its empathy for them only goes so far), “28 Years Later” effectively uses the tropes of its genre to insist that the line between a tragedy and a statistic is thinner than we think, and more permeable than we realize. The magic of the placenta, indeed. \n\n[Rolling Stone - David Fear](https://www.rollingstone.com/tv-movies/tv-movie-reviews/28-years-later-review-danny-boyle-1235353364/)\n\n&gt;Taken on its own, however, Boyle and Garland’s trip back to this hellscape makes the most of casting a jaundiced, bloodshot eye at our current moment. Their inaugural imagining of a world torn asunder surfed the post-millennial fear that modern society wasn’t equipped to handle something truly catastrophic. This new movie is blessed with the knowledge that something always rises from the ashes, but that the risk of regressing back to some fabricated mythology of a Golden Age, complete with *Henry V* film clips and St. George’s flags, is there on the surface as well. If postapocalyptic entertainment has taught us anything, it’s that the walking dead aren’t always the gravest threat. It’s those who sacrifice their soul and sense of empathy that you have to watch out for.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/28-years-later-review-danny-boyle/)\n\n&gt;For now, though, “28 Years Later” stands on its own — or at least, as its own temporary capper on this multi-decade series — and it stands tall. The filmmakers haven’t redefined the zombie genre, but they’ve refocused their own culturally significant riff into a lush, fascinating epic that has way more to say about being human than it does about (re-)killing the dead.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/28-years-later-review-1236435361/)\n\n&gt;Where the original film tapped into society’s collective fear of infection, its decades-later follow-up (which undoes any developments implied by “28 Weeks Later” with an opening chyron that explains the Rage virus “was driven back from continental Europe”) zeroes in on two even most primal anxieties: fear of death and fear of the other. To which you might well ask, aren’t all horror movies about surviving an unknown threat of some kind? Yes, but few have assumed the psychic toll taken by such violence quite so effectively as “28 Years Later,” which has been conceived as the start of a new trilogy, but towers on its own merits (part two, subtitled “The Bone Temple,” is already in the can and expected next January).",
        "upvotes": 2509,
        "comments": 481,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_kOOIuTo1rVcfa-MtVh0MDHmhqKB_4DqOunXAInL7rU.jpeg?auto=webp&amp;s=1ee730cc813ea0bf7037a2a06930ab70904b2553"
        },
        "permalink": "/r/movies/comments/1lesfjc/28_years_later_review_thread/"
    },
    {
        "id": "1lekuy3",
        "author": "TylerFortier_Photo",
        "title": "James Cameron's The Abyss Pulled From Disney+ in the UK Because of Banned 'Rat Abuse' Scene - IGN",
        "content": "&gt;James Cameron’s beloved sci-fi film [The Abyss](https://www.ign.com/movies/the-abyss) **has been removed from Disney+ in the UK due to the inclusion of a banned scene.**\n\n&gt;The original version of the 1989 film **includes a scene in which a rat is dunked into a vat of fluorocarbon liquid — and a real rat** ***was*** **used in production**. The rodent is believed to have survived, but **that didn’t stop groups like charity The Royal Society for the Prevention of Cruelty to Animals (RSPCA) from taking steps to have the scene removed 36 years ago.**\n\n&gt;The scene was **subsequently cut by the British Board of Film Classification (BBFC) under the Cinematograph Films (Animals) Act 1937, which means it must be cut for any theatrical use**. The BBFC **also cut the scene under the Video Recordings Act 1984, meaning it must not be included on releases on formats such as Blu-Ray and DVD. Similarly, the scene should also not be aired on traditional TV in the UK.**\n\n&gt;Despite this, a **version of the film that included the banned scene was added to Disney+ a few months ago in April**. In response, the RSPCA called out what it described **as a \"loophole\" that enabled the banned rat scene to make it onto Disney+ in the UK, pointing out that streaming platforms are not bound by the same standards as film releases in cinema, DVD, or on traditional television.**",
        "upvotes": 5522,
        "comments": 980,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GMBzDK9xFLlYU1HQA8hZ-nRYvQSXuuArSGtjawoHui8.jpeg?auto=webp&amp;s=510f193641a96eb1a6349a8537bbf27c57f42e15"
        },
        "permalink": "/r/movies/comments/1lekuy3/james_camerons_the_abyss_pulled_from_disney_in/"
    },
    {
        "id": "1lepn3p",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Russell Crowe as Hermann Goring in James Vanderbilt's 'Nuremberg' - Chronicles the true story of the eponymous trials held by the Allies against the defeated Nazi regime.",
        "content": "",
        "upvotes": 2241,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a86vh7jwhq7f1.jpeg?auto=webp&amp;s=e658ed38b4c17d6dca298bd1ef68c87a708da27f"
        },
        "permalink": "/r/movies/comments/1lepn3p/new_image_of_russell_crowe_as_hermann_goring_in/"
    },
    {
        "id": "1lex5b7",
        "author": "Legalize_Canada",
        "title": "What's the worst case you've seen of a trailer spoiling a movie?",
        "content": "The latest Alien film is guilty of this. Multiple character deaths shown in the trailers. And not just quick jump cuts or shots where you can't see their faces. Clearly shown character deaths in the trailer. \n\nI've gotten to where I don't even watch trailers anywhere. I would rather avoid spoilers and go in blind. ",
        "upvotes": 515,
        "comments": 632,
        "media": null,
        "permalink": "/r/movies/comments/1lex5b7/whats_the_worst_case_youve_seen_of_a_trailer/"
    },
    {
        "id": "1lep0p9",
        "author": "BunyipPouch",
        "title": "Francis Ford Coppola‘s epic 'Megalopolis' will be touring six cities this summer accompanied by the five-time Oscar winning filmmaker who’ll be holding a live discussion and Q&amp;A alongside the film screening.",
        "content": "",
        "upvotes": 1370,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kqf3DUfqRx0DK97QI1wVhK31GDF6Dd7YDhMN76x5AR4.jpeg?auto=webp&amp;s=862d240e585e36f02e17f631581a88e542820a5d"
        },
        "permalink": "/r/movies/comments/1lep0p9/francis_ford_coppolas_epic_megalopolis_will_be/"
    },
    {
        "id": "1lei130",
        "author": "parallelogramm3r",
        "title": "Demolition Man",
        "content": "I’m rewatching this, it’s probably been 10 years since I’ve seen it. It’s got a pretty mediocre rating on IMDB but I think it is peak 1990’s action movie stuff along with movies like The Rock and Con Air.   \n\nA lot of the futuristic sci-fi elements have aged pretty well and it’s just a fun, well-made action movie.  \n\nBut what I really want to know is how you would use the three seashells.\n",
        "upvotes": 2909,
        "comments": 860,
        "media": null,
        "permalink": "/r/movies/comments/1lei130/demolition_man/"
    },
    {
        "id": "1lex5lx",
        "author": "ggroover97",
        "title": "How PG Became Hollywood’s Hottest Rating",
        "content": "",
        "upvotes": 377,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BeHoZyChPFjJxzZu3ODP3WNGa1CipjjyGm50_3jxFC4.jpeg?auto=webp&amp;s=4f7f3324aa93012c99b1fa4552dff6d6a2860ac0"
        },
        "permalink": "/r/movies/comments/1lex5lx/how_pg_became_hollywoods_hottest_rating/"
    },
    {
        "id": "1lexbg4",
        "author": "MarvelsGrantMan136",
        "title": "‘Dragon’s Lair’: James Bobin in Talks to Direct Video Game Adaptation for Ryan Reynolds, Netflix",
        "content": "",
        "upvotes": 267,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k49gz-x1GDfgSOP2Dz813cRLdlVMjxTkgoowFDJQfSg.jpeg?auto=webp&amp;s=a8f48358e70d3466d7e8b9c09514181fc25629c6"
        },
        "permalink": "/r/movies/comments/1lexbg4/dragons_lair_james_bobin_in_talks_to_direct_video/"
    },
    {
        "id": "1leq1g8",
        "author": "MrGittz",
        "title": "Ghostbusters 2 has always had the “It’s kid friendlier” label but I always found it WAY more frightening. As a kid Vigo was nightmare fuel. The subway scene? The Bathtub? The slime?",
        "content": "I’m not going to sit here and say the sequel is a better film. It’s awesome, but it’s not overall better. The climax is far too rushed. But I do find it scarier. GB1 has the Dana gets possessed scene. That’s as scary as things get. Ghostbusters 2? Let me introduce you to my boy Vigo The Carpathian. Died at 105 years old. Didn’t die of old age either, he was poisoned, shot, stabbed, hung, disembowelled &amp; drawn &amp; quartered. His last words, just before his head died was “Death is but a door, time but a window, I’ll be back”. Holy crap this guy terrified me as a kid. When he leaves the painting, his snarls, his face? His freaky voice? And that’s all before his final form which is holy shiiiit scary. When his face does that twisty thing? I wonder how they did that before CGI. \n\nThe movie also has a Subway sequence where decapitated heads on pikes appear after Vigo calls out Winston’s name in the dark like a racist ass. Of course he picked Winston. \n\nThen we get the bathtub scene. Oh man. This shit traumatized me. Everytime I saw water running out of a faucet I was convinced mood slime was going to come out and get me.  \n\nMy grandma also had a mink coat and everytime I saw this thing, I poked it wondering if mink heads weren’t going to pop out and bite me. \n\nAnd I don’t think the first film has a sequence as intense as the dark room scene when Ray and Egon are looking at pictures of Vigo and his pictures spontaneously combust while Ray and Egon get locked in. We don’t see Egon or Ray ever panicked as much as they are in that sequence.\n\nHonestly? I don’t think anyone’s gotten Ghostbusters right since the second film. All these sequels and reboots, they just don’t have that secret sauce(the cast &amp; Ivan Reitman as director).  \n\nAs a kid, I had no conception Ghostbusters was suppose to be a comedy. I remember seeing it in the comedy section of our local video store and thinking “are these people insane? Comedy?” Of course as we grow we began to understand the dry sarcasm and jokes. \n\nBut somewhere, maybe because they don’t smoke or swear as much, the sequel got labeled as more kid friendly and I don’t think that’s true.",
        "upvotes": 663,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1leq1g8/ghostbusters_2_has_always_had_the_its_kid/"
    },
    {
        "id": "1leu2f7",
        "author": "Savings-Whole-6517",
        "title": "The Gentleman is severely underrated. A gem in a saturated year (2019)",
        "content": "Just rewatched this movie alone in silence at home (recommended ). It’s definitely a film that loses a bunch its nuances when watched with others, it’s like you can’t fully absorb their characters with distractions. \n\nI’m so glad that I had knee surgery and got bored enough to rewatch.\n\nColin Ferrall and Hugh Grant in god mode. McConaughey gave the perfect “Lion” signature role. Best of all was the unassuming and unique acting chops in Charlie Hunnam. Everyone gave this script their best and it shows \n\nAnyone else have a similar experience with this film?\n\nP.S. yes I know it’s a Guy Richie film but that doesn’t make it automatically a great picture, it’s underrated ",
        "upvotes": 289,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1leu2f7/the_gentleman_is_severely_underrated_a_gem_in_a/"
    },
    {
        "id": "1ler03n",
        "author": "NoCulture3505",
        "title": "Blumhouse Buys ‘Saw’ Stake From Twisted Pictures",
        "content": "",
        "upvotes": 350,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/26LAHa1_XJNIYQ6YDtz6QoprqT5mhMqL_hCBv0U-OT8.jpeg?auto=webp&amp;s=d646390ec66ae408a1b19ef20d27c470f26a9958"
        },
        "permalink": "/r/movies/comments/1ler03n/blumhouse_buys_saw_stake_from_twisted_pictures/"
    },
    {
        "id": "1lefb01",
        "author": "MarvelsGrantMan136",
        "title": "Springsteen: Deliver Me From Nowhere | Official Trailer",
        "content": "",
        "upvotes": 1188,
        "comments": 389,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bK8DBcaSltwNwtz65rqy3UR-FgdQLvPkbMDnnZ924Ug.jpeg?auto=webp&amp;s=8b32036310edfb89ef998da1da82843805f3a1ee"
        },
        "permalink": "/r/movies/comments/1lefb01/springsteen_deliver_me_from_nowhere_official/"
    },
    {
        "id": "1lezaii",
        "author": "West_Conclusion_1239",
        "title": "The Elephant Man by David Lynch. John Hurt should have been an Oscar winner.",
        "content": "Just watched The Elephant Man by David Lynch, what a powerful, beautiful, and moving film.\n\nJohn Hurt was incredible in it, i simply believed him, every look, every glance, every word.\n\nIt wasn't just a gimmick, he became John Merrick.\n\nIn any other year in which he wasn't against Robert DeNiro in Raging Bull, he would and should have easily won the Oscar, and it would have been one of the most deserved Oscar wins ever.\n\nI think it's one of the greatest male performances of all time, and it's deeply undertalked compared to others.\n\nDo you agree?\n\n",
        "upvotes": 79,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1lezaii/the_elephant_man_by_david_lynch_john_hurt_should/"
    },
    {
        "id": "1lensnb",
        "author": "Saraleb1",
        "title": "Top movies to go into 'blind'",
        "content": "Ive seen thousands of movies and before watching I've usually had the general premise in my head...\n\nBut what film(s) would you suggest that someone goes in blind.. practically no knowledge other than the title and possibly who is starring.\n\nCould be for different reasons like a complete switch in genre (eg From dusk till dawn).. or mindbending twist (eg Sixth Sense)... or general wtaf (eg Bone tomahawk)\n\nNothing too recent... films people should have generally watched by now but if you think its niche feel free to leave out spoilers ",
        "upvotes": 316,
        "comments": 1040,
        "media": null,
        "permalink": "/r/movies/comments/1lensnb/top_movies_to_go_into_blind/"
    },
    {
        "id": "1lexlsi",
        "author": "Informal-Neck8905",
        "title": "Movies you can never see again.",
        "content": "What are some movies you just can never stomach to watch again.  Clockwork Orange (though the power desensitization is relevant).  Requiem for a Dream afterwards I watched cartoons for hours!!! I can’t understand what a person can gain from the movie other than “drugs are bad, therapist can be dangerous, and seek help when the tv starts to talk TO you”",
        "upvotes": 77,
        "comments": 390,
        "media": null,
        "permalink": "/r/movies/comments/1lexlsi/movies_you_can_never_see_again/"
    },
    {
        "id": "1leyarp",
        "author": "New_Strike_1770",
        "title": "Singin’ In The Rain: 10/10",
        "content": "Just caught this movie last week on a flight. I’d heard about the film for the longest time, and was quite fond of its title track from A Clockwork Orange. Anyways, Singin’ In The Rain rocked my world. Everything was immaculate and immensely entertaining from performances, script and cinematography.\n\nI’m not a fan of musicals at all, but Singin’ In The Rain masterfully knew how to not overstay its welcome with the song and dance bits. Although seeing Gene Kelly, Donald O’Connor and Debbie Reynolds tap dance and choreograph their way around the set was magnetizing. I got the feeling that humans were cut from a different cloth in those days and took the word “entertainment” very seriously. \n\nMost surprising was just how hilarious the movie was. Very witty and not a single dull second in its 1hr43min run time. My eyes were glued to the back of the airplane seat. Singin’ In The Rain was as close to movie magic as it gets for me, and I’ve watched too many movies to count. It immediately made it into my top 10. Whether you’re a 4 year old or 84, Singin’ In The Rain will make you smile. ",
        "upvotes": 60,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1leyarp/singin_in_the_rain_1010/"
    },
    {
        "id": "1lelz4p",
        "author": "BunyipPouch",
        "title": "First Image for the Tom and Jerry 85th Anniversary Film 'Tom &amp; Jerry: Forbidden Compass' - Tom and Jerry accidentally travel through a time portal at a museum and must face mysterious forces together.",
        "content": "",
        "upvotes": 256,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jbwibsncsp7f1.jpeg?auto=webp&amp;s=c7b2fb8a4ad71d5982fb352d33d60370f83f4d88"
        },
        "permalink": "/r/movies/comments/1lelz4p/first_image_for_the_tom_and_jerry_85th/"
    },
    {
        "id": "1lel398",
        "author": "MaxRichter_Enjoyer",
        "title": "Things To Do In Denver When You're Dead (1995) - trailer. Andy Garcia, Christopher Walken Gabrielle Anwar and a bunch of others. Trailer music is straight up awful, but the movie fucking rocks.",
        "content": "",
        "upvotes": 210,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CH_849aIz8zLI1ACZpNxaPi45KotvgxBIbz0eySFtBc.jpeg?auto=webp&amp;s=5fc689e59913a8fb96857f6bfa38bb12335cc276"
        },
        "permalink": "/r/movies/comments/1lel398/things_to_do_in_denver_when_youre_dead_1995/"
    },
    {
        "id": "1ler1yc",
        "author": "SanderSo47",
        "title": "Cory Michael Smith To Topline Jeremy Saulnier’s Halloween-Set Fugitive Thriller ‘October’ For A24",
        "content": "",
        "upvotes": 96,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DF8VpMhyMBEur7jnqAWcik4dr0PUHmbaX4W1TrzkJUE.jpeg?auto=webp&amp;s=dc75f5bc4d5f65eebc3971b9767c2a0b8ffd9b3a"
        },
        "permalink": "/r/movies/comments/1ler1yc/cory_michael_smith_to_topline_jeremy_saulniers/"
    },
    {
        "id": "1leq3yl",
        "author": "indiewire",
        "title": "A New Blu-ray Collection Opens the Warner Bros. Animation Vault — and Finds 50 Treasures Inside",
        "content": "",
        "upvotes": 102,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qYagUaHcSb0u_GKcgUTyuDomGZYb_UpBcQBL_4dsBxM.jpeg?auto=webp&amp;s=9377c3e1bebddf1e445d9e4dcbc0bda5c57dc9f2"
        },
        "permalink": "/r/movies/comments/1leq3yl/a_new_bluray_collection_opens_the_warner_bros/"
    },
    {
        "id": "1lefcmo",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Springsteen: Deliver Me from Nowhere' Starring Jeremy Allen White",
        "content": "",
        "upvotes": 384,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nn91qtqveo7f1.jpeg?auto=webp&amp;s=6ecd72350b760c1b116f6fee9b6e652b8d19d0b4"
        },
        "permalink": "/r/movies/comments/1lefcmo/official_poster_for_springsteen_deliver_me_from/"
    },
    {
        "id": "1levgdj",
        "author": "tamago1120",
        "title": "Which animated film has a powerful soundtrack that’s often overlooked?",
        "content": "I'll go first: Anastasia\n\nAnastasia's soundtrack is a mix of Broadway vibes, strong emotions, and hauntingly beautiful music. It honestly deserves to be up there with The Lion King and Beauty and the Beast, but it gets overlooked - not because it's lacking, but mostly because of branding sincd it is not originally a Disney film.",
        "upvotes": 51,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1levgdj/which_animated_film_has_a_powerful_soundtrack/"
    },
    {
        "id": "1le9uhu",
        "author": "KarKrush",
        "title": "A work-copy of the \"Lost\" Jerry Lewis film \"The day the clown cried\" has now been sold.",
        "content": "A quick AI translate from Swedish television:\n\n**\"After the Revelation: Hans Crispin Has Sold the Legendary Jerry Lewis Film**  \nUpdated yesterday at 22:31, Published yesterday at 10:03\n\n– I received a modest sum, says Hans Crispin to Kulturnyheterna. But I can't tell who bought \"The Day the Clown Cried.\"\n\nHans Crispin's pirate copy of the legendary Jerry Lewis film is the only known complete version.\n\nSwedish actor and TV personality Hans Crispin recently revealed to the magazine Icon that in 1980 he stole a film reel of the legendary Jerry Lewis film \"The Day the Clown Cried\" and made a pirated copy, which he has kept for 45 years.\n\nAfter that, he also invited SVT Kulturnyheterna to view the film.\n\nThe news gained international attention and was covered by Newsweek and Vulture, among others.\n\n**Only Known Copy**  \nThe film, which is about a clown in Auschwitz during the Holocaust, has never been publicly shown and is considered a \"holy grail\" for film enthusiasts. It has long been regarded as lost; the copy Crispin has is the only known version with intact editing and sound.\n\nHans Crispin, who at the time worked copying porn films to VHS at Europafilm, stole the film along with a co-conspirator and kept it in secret for decades.\n\nIn the Kulturnyheterna interview a few weeks ago, he said he was now done with the secret and ready to pass it on to the next generation. And he has done so.\n\n– I have sold it. For a modest sum. I can't reveal more. They came here and watched it. They made an offer. I accepted it, signed a paper, and promised not to tell anything more.\n\n**\"You're not supposed to do that\"**  \nWhen asked how he feels about having sold something he in a \"Jönssonligan-like\" scheme stole and pirated so long ago, he responds that he has reflected on it over the years.\n\n– Yes, I stole it. I did. And I've thought about it — you're not supposed to do that. That's how it is. But I really wanted to preserve it. And I looked up the statute of limitations a long time ago. Two years. And the rights to this film are so tangled that no one really knows who has rights to this copy.\n\n**How does it feel now, that your big secret is out?**\n\n– A bit empty, actually. I mean, I can't watch the film anymore. I’ve always been able to before. Or show it to someone. You and Caroline Hainer were the last to see \"The Day the Clown Cried\" at my place.\n\nKulturnyheterna's freelance critic Caroline Hainer shared the story of Hans Crispin in the magazine Icon. However, she believes that the film will likely be accessible to a wider audience in the future.\n\n– Of course, there are financial interests. Jerry Lewis was one of the biggest comedians in the US in the 1950s. I guess it has fallen into the hands of someone who wants to distribute it. I would say there’s a risk that the public might see it. It’s a bad film.\"\n\nSource: [Hans ”Jönssonligan-kupp” blev en världsnyhet – nu har han sålt den legendariska filmen | SVT Nyheter](https://www.svt.se/kultur/efter-avslojandet-hans-crispin-har-salt-den-legendariska-filmen)",
        "upvotes": 934,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L4KnnhB7EgYVWwU0ZPljCspIOFDKWNDFZ3xElcuu4w0.jpeg?auto=webp&amp;s=1c77b5642ad4729342d9d71dcc06d1dba7a24d16"
        },
        "permalink": "/r/movies/comments/1le9uhu/a_workcopy_of_the_lost_jerry_lewis_film_the_day/"
    },
    {
        "id": "1lejdmp",
        "author": "KillerCroc1234567",
        "title": "Kathryn Bigelow’s ‘A House of Dynamite’ Sets October 24th Release on Netflix",
        "content": "",
        "upvotes": 165,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P32kUNatoAKqbPogGysstpQQCvKw2P1KMGoYEHAdE0k.jpeg?auto=webp&amp;s=52a57df051b7a207bec252484e6c259071e99de1"
        },
        "permalink": "/r/movies/comments/1lejdmp/kathryn_bigelows_a_house_of_dynamite_sets_october/"
    },
    {
        "id": "1lexy5o",
        "author": "rehapeda",
        "title": "Neil's wealth after prison in Heat (1995)",
        "content": "Correct me if I'm wrong, but by the movie's first heist (the truck robbery), Neil already seemed wealthy enough to buy gear and a nice suit and have a nice apartment (though not much furniture, it looked upper-class). With that kind of wealth it seems easy enough to just sock away in stable investments and live modestly until you can figure out legal ways to make a lot of money (no risk of blood, bars, or concrete anyway).\n\nI don't remember much said about his wealth before or after prison, but it seems if you get busted robbing a lot of money from a heist, you're not gonna keep it if it's found, and could possibly lose anything already owned to pay restitution.\n\nSo, is there anything known about Neil's wealth during the truck heist planning? Is it just leftover from whatever he had and could keep since before prison? Or did he get out and do small jobs to build himself up? I don't know how relevant it even is, but I imagine a big heist is gonna cost a lot of... \"investment\".",
        "upvotes": 27,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1lexy5o/neils_wealth_after_prison_in_heat_1995/"
    },
    {
        "id": "1ldwikw",
        "author": "MarvelsGrantMan136",
        "title": "‘Harold &amp; Kumar’ Getting New Sequel as ‘Cobra Kai’ Creators Ink Deal to Write, Direct",
        "content": "",
        "upvotes": 5145,
        "comments": 352,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lu8enQOUGUNQDoleTNk8JDdIrxmUrbfcdozgvjap5pc.jpeg?auto=webp&amp;s=f47962a49b18ea5172fd48d20c1eb8e2eeb4baee"
        },
        "permalink": "/r/movies/comments/1ldwikw/harold_kumar_getting_new_sequel_as_cobra_kai/"
    },
    {
        "id": "1lenmoj",
        "author": "MarvelsGrantMan136",
        "title": "Village Roadshow Entertainment Group’s Film Library Acquired By Alcon For $417M+; Titles Include 'Mad Max: Fury Road', the 'Ocean’s Eleven' Series, 'The Matrix' Trilogy and More",
        "content": "",
        "upvotes": 75,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LlInDrJ4hRIXh_qAUW2VpdwFgWC36Z1gnSQoL5BTdaE.jpeg?auto=webp&amp;s=e6ad6aaf01b05fe4425bfefa6807f5ef526f9868"
        },
        "permalink": "/r/movies/comments/1lenmoj/village_roadshow_entertainment_groups_film/"
    },
    {
        "id": "1lf4l4w",
        "author": "sidroy81",
        "title": "Umrao Jaan - 4K Restored Trailer",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/430zfM4pgCoQr1em2iU3Yf-JDsStdgdBG5JnRtZmuUM.jpeg?auto=webp&amp;s=e435a4d87d6da0c113e147e7d914082773425c17"
        },
        "permalink": "/r/movies/comments/1lf4l4w/umrao_jaan_4k_restored_trailer/"
    },
    {
        "id": "1lf5ngn",
        "author": "tothewindsor",
        "title": "Lilo &amp; Stitch (2002) director, Chris Sanders, on how he became the voice of Stitch and his thoughts on the live action Lilo &amp; Stitch (2025) remake",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VVblT4TjLGXDeTHCMGm-Z3LgH6dzbasxzVmIsYYdKG4.jpeg?auto=webp&amp;s=bd7c6ceaa4ba6c6523ebce947a936331702468de"
        },
        "permalink": "/r/movies/comments/1lf5ngn/lilo_stitch_2002_director_chris_sanders_on_how_he/"
    },
    {
        "id": "1leaszn",
        "author": "confibulator",
        "title": "Gary Oldman explains Tiptoes",
        "content": "",
        "upvotes": 394,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/92HdhZLR8H30QwigMIq8EJab3AvVtxh8I9jrdGC3B3c.jpeg?auto=webp&amp;s=3f7cdad31ebb2298ba471d6e725bc918bb0e07f3"
        },
        "permalink": "/r/movies/comments/1leaszn/gary_oldman_explains_tiptoes/"
    }
]