[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 18,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kdesan",
        "author": "haugs91",
        "title": "Santa Clarita Diet - Please",
        "content": "Next to Mindhunter, this has gotta be the biggest tragedy of a canceled series that should’ve continued. \n\nEverything about this show is comedically amazing and I wish it would get rebooted haha. Thoughts?! ",
        "upvotes": 97,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kdesan/santa_clarita_diet_please/"
    },
    {
        "id": "1kd9j3t",
        "author": "rushdisciple",
        "title": "The Four Seasons",
        "content": "Haven't seen a proper discussion thread about this show so I thought I would make one. \nI really liked this a lot, it took me an episode or 2 to get on its wavelength but I laughed my ass off pretty much the whole time, even though I had to watch some of it through my fingers. I couldn't really relate to any of the characters but with the humour and the chemistry between the cast/characters it didn't really matter. The fact that the episodes were 30 minutes or so helps, I'm not sure if it could've been 45-50 minutes each. I had no problem binging it within a day. Highly recommended.\n",
        "upvotes": 66,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1kd9j3t/the_four_seasons/"
    },
    {
        "id": "1kd6cdj",
        "author": "Visible_Economics_79",
        "title": "Night Agent",
        "content": "How does everyone feel about season 2 of the night agent? I thought season 1 was good but quit on season 2 after the 2nd episode. Maybe it’s me but I feel like Gabriel Basso is terrible in it. ",
        "upvotes": 53,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1kd6cdj/night_agent/"
    },
    {
        "id": "1kdha5m",
        "author": "EldritchDWX",
        "title": "Help me find a TV show that was once on Netflix (probably cancelled).",
        "content": "I've been racking my brain and would love to watch it again. Of course, it was on Netflix. It was about a serial killer who had effectively retired and a cop who had been hunting the serial killer for some time (possibly retired also). The serial killer was somewhat of a local legend, I believe inspired by Gary Ridgeway (The Green River Killer). I believe the serial killer and the cop are neighbours.\n\nMost of the show involved general family drama and such, while our serial killer, let's call him \"Bob\" struggles to control his \"urges\" after being \"retired\" for some time. \n\nEventually, he gives in, and \"Bob\" commits further murders (I think). The first season ends when the cop, having been hunting \"Bob\" for decades, suddenly concludes that our guy, \"Bob\", his neighbour, is indeed the guy he's been looking for for some time. \n\nIn the final scene, our detective guy whispers in the serial killer's ear, \"I know\" or something like that. Which is basically where the finale ends.  \n\nI'm hoping there was a second conclusive season that I can watch. If not, I would love to watch that first season again. Thanks in advance!",
        "upvotes": 11,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kdha5m/help_me_find_a_tv_show_that_was_once_on_netflix/"
    },
    {
        "id": "1kdg4ld",
        "author": "thepurplethorn",
        "title": "Into the Fire: The lost daughter",
        "content": "I know i am late to the game, and this has probably discussed and posted so many times but I just watched it and I am not okay.\n\nI just wish this Brenda woman burns in hell where she belongs with her murderer … she is disguising, completely detached from reality .. i hate hate hate her \n\n\nedit: Can you please suggest something similar to watch? ",
        "upvotes": 12,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1kdg4ld/into_the_fire_the_lost_daughter/"
    },
    {
        "id": "1kdk4u9",
        "author": "meomeo118",
        "title": "The Four Season",
        "content": "Have anyone watched this yet? I def thought it is some white lotus play off but the show is def a roller coaster. Real about marriages and have representation of all couples ( except for races lol ) . It is a nice reminder to see that marriage is hard. Gay or not, divorced or moved on. I personally wish Anne would have more scenes for her own self. It is also a beautiful representation of a group of friends that keep in touch years to years, in different season of lifes.\n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kdk4u9/the_four_season/"
    },
    {
        "id": "1kdlbx5",
        "author": "Hopeful-Bee-4030",
        "title": "GOLD AND GREED",
        "content": "I just finished watching the documentary GOLD AND GREED (great documentary btw). I was surprised and caught off guard at the end when Justin revealed his very own treasure hunt. However, when watching the series, I did notice Justin adjusting the clock several times throughout his interviews. Does anyone have any information about this could possibly mean and if anyone else noticed any other clues hidden in the show? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdlbx5/gold_and_greed/"
    },
    {
        "id": "1kdlgsw",
        "author": "Hopeful-Bee-4030",
        "title": "Battle Camp",
        "content": "I just finished watching the game show Battle Camp on Netflix and I just wanted to come on here to read what people thought about the cast members (who did you like and dislike) and what you thought about the ending. The cast members really got on my nerves, expect Avori and Shubham (I really liked them and I wanted one of them to win). Also, I thought the ending was very anticlimactic. I think the show should have continued to have at least 2-3 players left in the end to battle it out. What did you think? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kdlgsw/battle_camp/"
    },
    {
        "id": "1kdn0k1",
        "author": "NotYourFlowers",
        "title": "Gypsy - I need answers",
        "content": "I decided to rewatch this show and I'm mad all over again at the fact that it got canceled after just 1 season and ending on a massive cliff hanger. I'm dying to know what s2 would've been.\n\nDoes anyone know of a good fanfic or something I can read to scratch this itch???\n\nI know this show is so old and relatively forgotten. But I just need something to fill this void lol.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdn0k1/gypsy_i_need_answers/"
    },
    {
        "id": "1kdmrxo",
        "author": "ZeusAlphaGreek",
        "title": "HDCP handshake issue resolution or black screen on large displays",
        "content": "those who are still facing the issue here is the quick guide here\n\n1. Nvidia Control Panel -&gt; Adjust desktop color settings -&gt; Content type reported to the display -&gt; Switch from \"Auto-select\" to \"Desktop Programs.\"\n\n2. change the scale to 125x if the monitor is large (21:9 or even more). \n\n3. in graphics set the GPU preference to NVIDIA here\n\n4. display resolution should be recommended here\n\n5. restart your device once done ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kdmrxo/hdcp_handshake_issue_resolution_or_black_screen/"
    },
    {
        "id": "1kdjnus",
        "author": "Cool-Ear4075",
        "title": "Mid 90's",
        "content": "is this part of the film or something, but the layout keeps getting decentered. You know how if you film upright and then put it into a software it'll be cropped with black sides because it's portrait mode, it keeps shifting around to the left and right, its fucking annoying, is it part of the film?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdjnus/mid_90s/"
    },
    {
        "id": "1kdbkgv",
        "author": "kamikaze-demon6",
        "title": "Code ui-800-3",
        "content": "Has anyone noticed that netflix gives an error with the code ui-800-3 more frequently recently?\n\nI'm on my fire stick and I've followed the steps of uninstalling the app and reinstalling and it doesn't work, I tried resetting my router and it still didn't work. I had to unplug my fire stick which logged me out, I logged back in and it worked for that day, the next day the same code came up again and I'm getting sick of having to unplug my fire stick and log back in all the time, does anyone have a fix?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kdbkgv/code_ui8003/"
    },
    {
        "id": "1kcoqjg",
        "author": "5862724",
        "title": "Why does this company hate single folk?",
        "content": "If ever Netflix wakes up and realizes single person households exist and want to pay for Netflix at a reasonable single screen rate, the longer Netflix treats us like trash, the longer it will take me to buy in.",
        "upvotes": 104,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1kcoqjg/why_does_this_company_hate_single_folk/"
    },
    {
        "id": "1kcubcl",
        "author": "latin0loco88",
        "title": "How GREAT is the new Asterix and Obelix mini-series on netflix?!",
        "content": "The new *Asterix &amp; Obelix: The Big Fight* mini-series on Netflix is a real treat. It’s a five-part animated adaptation of the classic comic, directed by Alain Chabat, what he's done with this series is genius!\n\nThis version stays true to the heart of the original while adding a fresh, modern touch. The humor is sharp, the animation is beautifully done, and the voice cast fits perfectly. The story follows Asterix and Obelix as they stand against the Roman forces, while their druid Getafix finds himself in trouble, struggling with memory loss that causes him to forget the magic potion recipe. Naturally, chaos follows.\n\nWatching this took me straight back to afternoons spent in the Hornsby library, pouring over Asterix comics, getting lost in their sharp wit and playful satire. Those stories always had a way of making the world seem a little brighter, balancing clever historical nods with lighthearted humor. No matter how many times I read them, they were a source of comfort and a guaranteed laugh.\n\nThis adaptation captures that timeless comic feel, and the jokes remain packed with satirical charm and modern pop culture references. Whether you’re revisiting a childhood favorite or discovering Asterix for the first time, this is well worth a watch—Alain and Netflix have done a fantastic job bringing these characters to life!\n\nNaturally, I think they've done a bangup job but these are just my thoughts but I'd love to hear what you think of the mini-series and if you think they should they bring out more. What do **you** think?\n\n[Asterix &amp; Obelix: The Big Fight - Season 1 Promo poster](https://preview.redd.it/9fzt5g5x7bye1.jpg?width=554&amp;format=pjpg&amp;auto=webp&amp;s=1ddae755e30e15e3da7f6110fc554f0e287e26ee)\n\n  \n",
        "upvotes": 24,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kcubcl/how_great_is_the_new_asterix_and_obelix/"
    },
    {
        "id": "1kd9nu7",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in May 2025",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kd9nu7/best_new_movies_streaming_on_netflix_in_may_2025/"
    },
    {
        "id": "1kd29z5",
        "author": "Pogrebnik",
        "title": "Over 70 new movies &amp; shows are landing on Netflix in May",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kd29z5/over_70_new_movies_shows_are_landing_on_netflix/"
    },
    {
        "id": "1kdb4e6",
        "author": "maxiedaniels",
        "title": "Can anyone properly explain the 'household' thing?",
        "content": "I've always shared my parents account for Netflix, and we live in different homes. There's no issue with a number of my devices - my main Apple TV is fine, my laptop is fine. However when I try and login using our bedroom Roku, i get a message about needing to change my household or allow temporary access.\n\nI'm confused because it works fine on the other devices.  \n1) If i remove old devices that aren't used on the Netflix account anymore, will this free up space? Or is it not letting ANY new devices on a network other than the main household network?\n\n2) Can we pay extra to allow for another household??",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kdb4e6/can_anyone_properly_explain_the_household_thing/"
    },
    {
        "id": "1kda8u0",
        "author": "MichaelWrites90",
        "title": "Dandadan closed captions missing?",
        "content": "For some reasons the English dub of Dandadan does not have closed captions on Netflix. Hulu and Crunchyroll have it, but on Netflix it's missing. All Netflix has is subtitles to the Japanese audio which does not match the English dub. Why is it missing specifically on Netflix and not on any of the other streaming services? Given Netflix's big push with closed captions I'd have expected it to be rectified, but it hasn't been. What are the chances this gets fixed before season 2 comes out in July?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kda8u0/dandadan_closed_captions_missing/"
    },
    {
        "id": "1kd9wku",
        "author": "Fluid_Block_1235",
        "title": "Netflix gift card",
        "content": "So I want to give someone a netflix subscription , how do gift card work? It may be dumb but i never used a gift card in my entire life.\n\nDoes it have a code you need to type somewhere in your netflix account? \nIf so where? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kd9wku/netflix_gift_card/"
    },
    {
        "id": "1kckm7l",
        "author": "Fragrant_Peanut_9661",
        "title": "The Eternaut",
        "content": "So I just finished this one on NF. Plz tell me some of you have watched it! I've really gotten into the apocalyptic shit lately, been reading a lot of similar books. This show is soooo cool. However, I do have a few questions after watching it. \n\n1. Where do they get gas for the vehicles?\n\n2. Wtf are those things?!?!?\n\n3. Is it aliens? Or not? \n\n4. Wtf is up with Clara? \n\nLet me know your thoughts on this show. I'm interested in hearing how many others liked it...and who else saw how easily this could really happen...",
        "upvotes": 54,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1kckm7l/the_eternaut/"
    },
    {
        "id": "1kd9cqs",
        "author": "S4v1r1enCh0r4k",
        "title": "Rian Johnson Talks 'Knives Out' Future Post-'Wake Up Dead Man'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kd9cqs/rian_johnson_talks_knives_out_future_postwake_up/"
    },
    {
        "id": "1kd4ggc",
        "author": "Romashoha",
        "title": "Simular Animation like LDR",
        "content": "I'm looking for a Netflix series that I saw a few years ago. I think each episode had its own story and they were all animated. The episode was very brutal and cruel. There was a higher species, I guess alien creatures that could control humans through eye contact. So humanity was enslaved and controlled. However, there was a group of people with certain helmets that prevented this control and fought against these creatures with weapons. I remember that it was very bloody and brutal at the beginning of the first scenes. I don't mean Love Death Robots, it's called something else but I can't find the name. Thanks in advance.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kd4ggc/simular_animation_like_ldr/"
    },
    {
        "id": "1kd3o67",
        "author": "Somethingman_121224",
        "title": "Netflix's 'Little House on the Prairie' Revival Has Just Found Its Laura Ingalls",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kd3o67/netflixs_little_house_on_the_prairie_revival_has/"
    },
    {
        "id": "1kctcw7",
        "author": "Difficult_Scratch_39",
        "title": "If you have seen Pokémon Horizons on Netflix, how are you liking the series so far?I’m on season 2, part 2, episode 2",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kctcw7/if_you_have_seen_pokémon_horizons_on_netflix_how/"
    },
    {
        "id": "1kd1nyi",
        "author": "Ok-Dimension-1790",
        "title": "Netflix account got hacked",
        "content": "My netflix account got hacked and the gmail had been changed, and i cannot log in on my netflix account to cancel subscription, my question is how do i cancel my subscription without access on netflix account?  \nand plus the subscription is linked on Gcash(A banking app here in Philippines).",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kd1nyi/netflix_account_got_hacked/"
    },
    {
        "id": "1kci1oh",
        "author": "Obversa",
        "title": "'School Spirits' Seasons 2-3 not coming to Netflix, Season 1 leaving in May 2025 as Paramount+ seeks to drive subscriptions to streaming service",
        "content": "",
        "upvotes": 21,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kci1oh/school_spirits_seasons_23_not_coming_to_netflix/"
    },
    {
        "id": "1kcw818",
        "author": "akooala",
        "title": "I honestly loved hoops",
        "content": "At first I definitely hated the show i genuinely hated Ben and I dreaded whenever he was on screen I almost shut the show off but I am telling you there are such funny fucking moments in the show it’s an entire fever dream, episodes 4 and 5 had me laughing way to fucking hard\n\nI really also love shitty characters that turn themselves around but Ben was just so fucking unlikable and sometimes you like him but most times you hate him. But in the end he’s still a character you love. And where the show ended it actually left me so bummed.\n\nI don’t think a lot of people liked this show but honestly it was a fucking banger in my eyes there are such golden jokes and I’m definitely glad I watched it.\n\nCould’ve been the shrooms too but I’m telling you episodes 4 and 5 hit",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kcw818/i_honestly_loved_hoops/"
    },
    {
        "id": "1kcw1o0",
        "author": "Sahri81",
        "title": "I want English subs but Netflix refuses to show that option",
        "content": "I'm watching Fullmetal Alchemist: Brotherhood but I could only choose between no subs, French and Dutch. I used to be able to pick English as an option as well but that doesn't seem possible anymore. I tried changing the language of my Apple TV as well as the region but Netflix refuses to show me the English option! Help?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kcw1o0/i_want_english_subs_but_netflix_refuses_to_show/"
    },
    {
        "id": "1kcw0vv",
        "author": "Fun-Pain609",
        "title": "how can i delete my card from netflix?",
        "content": "hey so i was thinking, can i delete my current card from netlix if i add a giftcard to the account? id really want to get my card out so i wont be charged after cancelling like ive already been done to twice🙄",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kcw0vv/how_can_i_delete_my_card_from_netflix/"
    },
    {
        "id": "1kcu4mo",
        "author": "Significant_Dirt544",
        "title": "Login on Windows11 machine via QR-Code",
        "content": "Hey guys,  \n  \nis there a way to log in on a Windows machine using a QR code, as is possible with a Smart TV?\n\nI was not able to find such possibility. Neither via Web nor App from the MSFT store. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kcu4mo/login_on_windows11_machine_via_qrcode/"
    }
]