[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1gvn3aw",
        "author": "The_Minis13",
        "title": "Chiamata polizia di stato o possibile truffa?",
        "content": "Ho ricevuto una chiamata sconosciuta al mio telefono lavorativo (numero presente online). La tipa si identifica come appartenente alla polizia di stato. Mi chiedo se sono la dottoressa tizia. Rispondo di si. Dopo io chiedo: \"mi perdoni, ma perchè un poliziotto mi chiama con lo sconosciuto\", lei blatera qualcosa e dice \"E una linea internet questa!\". Mi stacca il telefono in faccia . Nosense\n\nChiamo la polizia, segnalo la cosa per capire...e mi hanno detto che effettivamente loro chiamano anche con lo sconosciuto. Ma rispondo all'operatrice \"ma un suo collega staccherebbe mai il telefono in faccia ad una persona prima di procedere con la comunicazione?\". Mi dice di no, ma non sa che rispondere\n\n  \nA sto punto suppongo sia una truffa, o datemi voi una spiegazione.  \nHo ricevuto 7 giorni prima una chiamata sempre sconosciuta ma lavorando non ho potuto rispondere",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gvn3aw/chiamata_polizia_di_stato_o_possibile_truffa/"
    },
    {
        "id": "1gvphry",
        "author": "Professional_Media23",
        "title": "T-red e semaforo lampeggiante",
        "content": "Sapete se le telecamere funzionano lo stesso, con semaforo giallo lampeggiante? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gvphry/tred_e_semaforo_lampeggiante/"
    },
    {
        "id": "1gvo31v",
        "author": "Own_Lead_3053",
        "title": "PARCHEGGIO LINGOTTO ",
        "content": "Ciao, dovrei lavorare tutto il pomeriggio all'Oval di Lingotto tramite un contratto a chiamata. Solo che vengo da fuori Torino e dovrei andare in macchina, qualcuno mi sa consigliare un parcheggio gratuito in zona? Grazie mille",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gvo31v/parcheggio_lingotto/"
    },
    {
        "id": "1gv9ssp",
        "author": "DioGormita",
        "title": "San Salvario by night",
        "content": "Ore 23, negli alberghi inizia il turno di notte, mentre già si abbassano le serrande dei ristoranti in un freddo martedì di novembre. L'Uomo Birillo non si vede in giro da un po', ma non mancano certo gli eventi degni di nota o le solite bizzarrie tra via Nizza e via Principe Tommaso.\n\nCosa raccontano in questa fredda notte i sussurri di San Salvario? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gv9ssp/san_salvario_by_night/"
    },
    {
        "id": "1gvjqr9",
        "author": "FriendlyRaisin3789",
        "title": "Asili e scuole internazionali in città",
        "content": "Ciao a tutti. Stiamo pensando seriamente di trasferirci a Torino, poiché ci piace molto la città.\n\nSiamo italo-americani e ci piacerebbe se la nostra figlia di 3 anni andasse in una scuola internazionale.\n\nHo trovato un paio di scuole interessanti, come WINS, però un po' sono lontane dal centro e non raggiungibili a piedi.\n\nPoiché vivremo in zona centro, sapreste consigliarmi qualche scuola internazionale al centro?\n\nGrazie mille ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gvjqr9/asili_e_scuole_internazionali_in_città/"
    },
    {
        "id": "1gv9r6r",
        "author": "mar538",
        "title": "Qualcuno interessato a praticare MMA o arti marziali all’aperto a Torino? ",
        "content": "Ciao a tutti,\nsto cercando persone interessate a praticare MMA o altre arti marziali in un parco qui a Torino. Non sono esperto, ma vorrei imparare, e penso che allenarsi in compagnia possa essere divertente e motivante.\n\nL’idea è di organizzare sessioni all’aperto per esercitarci insieme, magari provando tecniche di base, esercizi fisici o anche solo condividendo qualche consiglio. Va bene qualsiasi livello di esperienza, anche se siete principianti o semplicemente curiosi di provare.\n\nUn posto comodo potrebbe essere il Parco Ruffini, ma sono aperto anche ad altre proposte se avete preferenze.\n\nSe qualcuno è interessato, possiamo accordarci su un luogo e orari che vadano bene per tutti. Fatemi sapere nei commenti o in DM!\n\nA presto :)\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gv9r6r/qualcuno_interessato_a_praticare_mma_o_arti/"
    },
    {
        "id": "1guwceo",
        "author": "Professional_Law28",
        "title": "Fischio fastidioso zona metro Racconigi - help",
        "content": "Da circa una settimana c'è un rumore/fischio ad alte frequenze fastidiosissimo tra la stazione Racconigi della metro e l'inizio di corso Svizzera. All'inizio durava solo un paio d'ore nel tardo pomeriggio mentre dalle 22 di ieri sera non si è più fermato. In casa si sente poco ma comunque fastidioso mentre appena si esce fuori ti buca il cervello. Stiamo diventando letteralmente matti, specialmente questa notte è stato un incubo, verso le due mi sono dovuto mettere le cuffie antirumore da lavoro per dormire. Qualcuno sa da dove potrebbe provenire? Si può contattare qualcuno? ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1guwceo/fischio_fastidioso_zona_metro_racconigi_help/"
    },
    {
        "id": "1gv4g0n",
        "author": "SaltMusician8619",
        "title": "Torino to Sacra San Michele",
        "content": "Hi everyone. I'm in Turin for a few days with my mother and we are thinking about going to the Sacra San Michele. Do people have ideas on the easiest way to get there? I see there's a train, is that the best?",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gv4g0n/torino_to_sacra_san_michele/"
    },
    {
        "id": "1gv6ijv",
        "author": "fableafy_fr",
        "title": "Consigli discoteche?",
        "content": "Ciao a tutti! Sapreste consigliarmi delle discoteche a Torino? io e il mio gruppo di amici veniamo dalla provincia di Cuneo, da noi ci sono poche discoteche e quelle poche che ci sono sono invivibili. Dopo un periodo passato ad evitare le discoteche come la peste vogliamo riprovare a buttarci, secondo voi quali sono le discoteche in cui ci si può davvero divertire a Torino?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gv6ijv/consigli_discoteche/"
    },
    {
        "id": "1gvbd6g",
        "author": "Alarmed_Lawyer400",
        "title": "Conoscete agenzie che fanno casting per fotomodelli/modelli?",
        "content": "Un lavoro è un lavoro e avrò bisogno di soldi a breve,  conosco amici in altre città che con qualche chiamata si mettono via un po' di soldini (nulla di che ma non si buttano via), ma non mi hanno saputo consigliare per Torino.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gvbd6g/conoscete_agenzie_che_fanno_casting_per/"
    },
    {
        "id": "1guzgi0",
        "author": "CollapseOverflow",
        "title": "Cerco una band per suonare",
        "content": "Ciao a tutti,\n\nSono arrivato da poco a Torino e ~~sto cercando un appartamento~~ to cercando un gruppo con cui suonare per divertirmi dopo il lavoro. Suono il trombone e ho già suonato in brass band, in una big band jazz, in un'orchestra sinfonica e in un gruppo funk (abbiamo fatto qualche concerto). \n\nSapete se c'è un sito web dove posso cercare band che cercano musicisti? Oppure se conoscete qualcuno, per favore mandatemi un PM. Grazie mille!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1guzgi0/cerco_una_band_per_suonare/"
    },
    {
        "id": "1gv5ulm",
        "author": "Sorry_Carrot7537",
        "title": "Cerco qualcun* per uscire ",
        "content": "ciao, non sono di Torino ma ci vengo spesso e a breve mi ci trasferisco credo definitivamente, cercavo qualcun* con cui stringere amicizia, ho 19 anni e chiaramente ho diversi interessi come ad esempio lo sport, e boh nulla ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1gv5ulm/cerco_qualcun_per_uscire/"
    },
    {
        "id": "1guw35p",
        "author": "sipprots",
        "title": "C'è qualche casa disponibile a Givoletto?",
        "content": "Ciao a tutti!  \nSto cercando una casa in affitto che abbia accesso al comune di Givoletto.  \nAvete qualche indicazione?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1guw35p/cè_qualche_casa_disponibile_a_givoletto/"
    },
    {
        "id": "1guu0g4",
        "author": "Living-Beat-9870",
        "title": "Anyone had this issue before?",
        "content": "I am converting my student permesso to attesa di occupazione and on my appoinment everything went good. Now I have this shown on the website and I am not really sure why or If I should get worried. Anyone experienced this in the past ? \n\nhttps://preview.redd.it/cz1beppj3u1e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=72e0cb110753cbd040b3852e6e2f336cd0dc6470\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1guu0g4/anyone_had_this_issue_before/"
    },
    {
        "id": "1gvaqig",
        "author": "Creepy-Prior9882",
        "title": "Contatti con la malavita ",
        "content": "Account throwaway\nCari amici torinesi e non, ho un caro amico che ha bisogno di soldi.\nHa provato a chiedere ad amici, parenti, carte di credito, finanziamenti e tutto ciò che esiste di legale, senza esito posito. \nLui \"lavora\", vuole chiedere soldi ad uno strozzino, ma comunque può tranquillamente permettersi di pagare interessi da usuraio, e sarebbe un grado di restituire tutto in 1/2 mesi.\nGli ho regalato i miei risparmi per evitare che si metta nei casini, ma non basta. \nPurtroppo è testardo, provo a giocare d'anticipo per  capire dove potrebbe andare a chiedere questi soldi prima che lo faccia veramente lui.. idee?\n\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gvaqig/contatti_con_la_malavita/"
    },
    {
        "id": "1gv1gsb",
        "author": "TheLastRedcoat",
        "title": "Looking for Ferrero Pasticceria ",
        "content": "Hi all,\n\nI'll be visiting Turin for a few days next week with my girlfriend, and was wondering if anyone knew where the original Pasticcerie of the Ferrero family were in the city specifically? I know it's silly, but I thought it might be fun to take her there (as she loves history and Nutella, and should be something a little different from the Museo Egizio and Palazzo Reale that we'll see earlier in the day).\n\nI know the one from 1934 was near Porta Nuova, and the one from 1940 is on the Via Sant'Anselmo, but I can't find any specific location info; can anyone help me track down where they are specifically?\n\nGrazie a mille in anticipo!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gv1gsb/looking_for_ferrero_pasticceria/"
    },
    {
        "id": "1gukzap",
        "author": "Fuzzy-Condition-1513",
        "title": "Ricerca abitazione condivisa",
        "content": "**Ciao a tutti!**  \nSono un cittadino italiano residente all'estero (M, 24 anni) e sto pensando di trasferirmi a Torino l'anno prossimo (fine maggio) per lavorare e magari studiare in seguito. Avete qualche suggerimento su piattaforme utili per trovare un'abitazione condivisa? All'inizio non sarebbe l'ideale per me affrontare un affitto da solo. Spero possiate aiutarmi. Grazie mille!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gukzap/ricerca_abitazione_condivisa/"
    },
    {
        "id": "1gu4ho6",
        "author": "Vast-Ad-9803",
        "title": "New friends in Turin",
        "content": "Alla ricercadi amici a Torino\n\nCiao! Mi chiamo Alex e ho 23 anni. Recentemente mi sono trasferito a Torino e sono alla ricerca di amici per uscire in città, andare in discoteca. Grazie e aspetto i vostri messaggi. My insta: @ciuhatalx",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gu4ho6/new_friends_in_turin/"
    },
    {
        "id": "1gtoxs1",
        "author": "_L_-",
        "title": "NON puoi dire di aver vissuto a Torino senza... ",
        "content": "Vivo a Torino da un paio d'anni e per lavoro potrei dovermi trasferire. \n\nChe cos'è che uno deve aver fatto per poter dire di aver abitato a Torino? \n\nBattute a parte sull'essere stati aggrediti in qualche zonaccia, e cose mega banali da turista a parte ",
        "upvotes": 27,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1gtoxs1/non_puoi_dire_di_aver_vissuto_a_torino_senza/"
    },
    {
        "id": "1gu6eqy",
        "author": "shydumpling_",
        "title": "Vendita carte pokemon Torino ",
        "content": "Ciao a tutti!\nHo da poco ritrovato alcune carte pokemon della collezione che avevo, sono in ottimo stato perché appena ne trovavo qualcuna che mi sembrava rara la mettevo nella custodia apposita.\nEcco vorrei venderle, ho fatto ricerche su internet ma il valore di ognuna delle carte varia su ogni sito.\nPer caso qualcuno di voi conosce un qualche posto in cui potrei portarle e venderle per il prezzo adatto?\nSono a Torino.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gu6eqy/vendita_carte_pokemon_torino/"
    },
    {
        "id": "1gtegop",
        "author": "elganksta",
        "title": "Escursioni da fare in un giorno ",
        "content": "Salve, dove potrei andare vicino a Torino per immergermi un po' in natura come in questi posti, facili da raggiungere per uno che non ha la macchina ? ",
        "upvotes": 41,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1gtegop/escursioni_da_fare_in_un_giorno/"
    },
    {
        "id": "1gudvxz",
        "author": "Alternative-Tip-3100",
        "title": "Free a Torino o boh",
        "content": "**OI**\nInsomma, dal banner già si vede, quindi non serve ribadire 1312 eccetera...\n\nMi aiutate a trovare qualche gruppo telegram per flyerTek? Perché ho cercato su telegram uno che conoscevo, ma ho visto che si è unito ad un altro gruppo di cui non riesco a capire il nome (diopo).\nFatemi sapere&lt;33",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gudvxz/free_a_torino_o_boh/"
    },
    {
        "id": "1gtekm5",
        "author": "elganksta",
        "title": "Negozi di abbigliamento old money style",
        "content": "Mi sapreste consigliare dei negozi in cui comprare vestiti del genere, magari non a un prezzo altissimo ( magari che abbiano prezzi scontati) o da dare un'occhiata adesso che ci sarà il black Friday?\n\nVoglio cambiare il mio stile quindi dovrei procurarmi tutto haha",
        "upvotes": 26,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/me9i06qy0h1e1.jpeg?auto=webp&amp;s=05a532f52e606d68e18edb3480b0aaf4dc05b23b"
        },
        "permalink": "/r/torino/comments/1gtekm5/negozi_di_abbigliamento_old_money_style/"
    },
    {
        "id": "1gtopcn",
        "author": "CatSitwoy",
        "title": "Esiste o è mai esistita la M.P.M di Torino?",
        "content": "Salve a tutti, mio padre mi ha regalato una affettatrice vintage di un'azienda di nome M.P.M., e le poche info che ho trovato riguardano la città in cui si dovrebbe trovare e che il nome significa Misure Pesi Macchine. Però non trovo niente di niente su questa azienda, se non che sia (fosse?) di Torino e nient'altro. Qualcuna in vendita, ma difficile fare una stima senza altre informazioni. Qualcuno conosce questa azienda perché ci lavorava un genitore o un nonno, o magari esiste tutt'ora (non credo)?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gtopcn/esiste_o_è_mai_esistita_la_mpm_di_torino/"
    },
    {
        "id": "1gtn51o",
        "author": "CycleGullible1761",
        "title": "In quale Palestra a Torino con piscina vi siete trovati meglio?",
        "content": "Ciao sto cercando una palestra vicino o nella zona in mezzo tra parco dora e cit turin, che abbia dei macchinari come si deve e dei corsi di nuoto verso le 6 e mezza di sera. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gtn51o/in_quale_palestra_a_torino_con_piscina_vi_siete/"
    },
    {
        "id": "1gtc7sx",
        "author": "reare0",
        "title": "Amicizia",
        "content": "Salve miei eventuali cari conoscenti, mi chiedevo se fosse ancora possibile instaurare nella modernità odierna delle amicizie che non siano solo in funzione del farsi compagnia. Sarà che mi sono tirato fuori dalle dinamiche di conoscenza per un bel po', ma ricordo che un tempo i rapporti si vivevano diversamente. C'era l'intento di concedersi all'altra persona per costruire un rapporto che valesse la pena; da quando l'utile ha preso così tanto il sopravvento?\n\nVivo a Torino da un anno, ho 23 anni, e riscontro il più delle volte quella barriera interpersonale che non offre la possibilità di andare oltre. Tante attività sociali compiute, ma dopo le quali manca l'impegno, la costanza, la voglia, la disponibilità emotiva, di costruire effettivamente un legame.\nTutto questo risulta essere piuttosto avvilente. \n\nAd ogni modo, qualora ci fosse qualcuno che abbia colto la stessa disfunzione strutturale, mi farebbe piacere approfondire.",
        "upvotes": 10,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1gtc7sx/amicizia/"
    },
    {
        "id": "1gtpv8q",
        "author": "Jolly_Track_1416",
        "title": "How do you get from Torino to Cervinia?",
        "content": "Hi, I'm looking to ski in Cervinia. The only bus I was able to find is at a very inconvenient time. Is anyone aware of any other options?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gtpv8q/how_do_you_get_from_torino_to_cervinia/"
    },
    {
        "id": "1gtbs43",
        "author": "Coccorocco1",
        "title": "Qualcuno esce ancora??",
        "content": "M 31, ho amici ma nessuno vuole fare più niente oltre che stare a casa…cerco persone con cui andare a bere, passeggiare, parlare, ecc.. se ancora esistono 😂😂\n\nMi piace stare con le persone, divertirsi, passeggiate in mezzo alla natura, collezionare ogni tipo di cosa 😁 e da qualche tempo vado in palestra vicino casa",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1gtbs43/qualcuno_esce_ancora/"
    },
    {
        "id": "1gtd128",
        "author": "diegomigoli361",
        "title": "TAGLIANDO SCOOTER 125",
        "content": "Ciao a tutti, da qualche mese ho comprato un people s 125. Di recente ha iniziato a fare un rumore strano che penso possa essere associato ad un relè delle frecce. \nInoltre, recentemente il motorino lo sento più “tirato” e credo sia proprio giunto l’ora di fare un bel tagliando. Qualche buon samaritano su Torino appassionato di scooter vorrebbe aiutarmi? Ho qualche conoscenza e vorrei apprendere meglio il funzionamento ed i processi sottostanti, infine, non vorrei distruggermi economicamente per un tagliando completo.\n\nNaturalmente aperitivo offerto 🙃",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gtd128/tagliando_scooter_125/"
    },
    {
        "id": "1gtc9g2",
        "author": "matbordaRnB",
        "title": "Certificato medico agonisti",
        "content": "Ciao\n\nConsigli per ottenere il certificato medico sportivo agonista a Torino? Nello specifico faccio kick boxing. L'ideale sarebbe in zona San Donato-Cit Turin, o vicino.\n\nGrazie!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gtc9g2/certificato_medico_agonisti/"
    }
]