[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oagjm6",
        "author": "Ok-Intention-4593",
        "title": "The Perfect Neighbor- where did Susan live before?",
        "content": "I just finished the perfect neighbor and it was horrifying. Susan was so consistently malignant and evil, it made me wonder where she lived before she moved to AJs neighborhood and if her prior neighbors have similar stories? Her next level insane behavior and repetitive but very similar lies (always fearing for her life, even as she is being placed under arrest) makes me think it’s not possible this HASN’T happened before? May she rot in prison, I’d bet my last dollar she’s terrorizing other inmates and guards daily. \nIf anyone knew her before I’d be curious to know your experience. I’m sad the law couldn’t have stopped this from happening but I don’t blame anyone but Susan. ",
        "upvotes": 48,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1oagjm6/the_perfect_neighbor_where_did_susan_live_before/"
    },
    {
        "id": "1oa17bq",
        "author": "chunkybonks",
        "title": "The Perfect Neighbor - Dr. Susan Lorincz",
        "content": "Umm excuse me. What exactly was this murderer a “doctor” of? She only referred to herself as a doctor once and nothing comes up when you search for it. Anyone know?",
        "upvotes": 374,
        "comments": 582,
        "media": null,
        "permalink": "/r/netflix/comments/1oa17bq/the_perfect_neighbor_dr_susan_lorincz/"
    },
    {
        "id": "1o9ypkn",
        "author": "jonnyson14",
        "title": "Boots is the best show on Netflix right now",
        "content": "If you haven't watched it you absolutely need to. I laughed, I cried, I got angry, it's absolutely brilliant. I stuck it on with no knowledge of what it was, I thought I was just in for a modern take on stripes. Instead I got treated to the most compelling show I've watched in years! I'm begging people to watch it so it gets a season 2! I need it in my veins.",
        "upvotes": 322,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ypkn/boots_is_the_best_show_on_netflix_right_now/"
    },
    {
        "id": "1oacifb",
        "author": "EitherSheepherder854",
        "title": "The Diplomat",
        "content": "I am so hooked on this show. I love the cast and I love the story.  Currently I am on season 3 and I do not want it to end . Has anyone watched this yet? \n",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1oacifb/the_diplomat/"
    },
    {
        "id": "1oaalgd",
        "author": "larrybirds",
        "title": "The Diplomat appreciation post",
        "content": "I’m on episode 4 of the new season, and I feel like this show is a level above many other Netflix originals — feels like could be Sunday night HBO. I know Netflix has had some (deserving) award show darlings recently (Baby Reindeer, Adolescence) but this show to me is like “The Crown” level of acting and quality. \n",
        "upvotes": 28,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oaalgd/the_diplomat_appreciation_post/"
    },
    {
        "id": "1oa85w7",
        "author": "fayzee98_____",
        "title": "The woman in cabin 10 movie",
        "content": "I have half a mind to delete Netflix at this point.  If you’re going to do a movie based on a book, at least have the major plots of the book, in the bloody movie!! \nThey not only changed the main character’s personality, they missed the whole plot of the burglary - the PTSD coupled with the alcohol she drank the first night, made her less and less believable. \nThe whole thing with the cigarettes instead of the mascara scenario - was so so stupid.\nI just can’t fathom this.  If they wanted to cut the story line to fit into a movie, they could have done the following instead:\n1. Make it into a limited SERIES, to actually address all the major plots and story lines of the book. Or \n2. Make the movie bloody long?? What’s wrong with that - they did that for Gone Girl, and that movie was just as great as the book.\n\nI can’t get over how bad this movie was.  Maybe because I had read the book legit a couple hours before watching - but it had such great potential!!!\n\nWhat a shame.\n",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1oa85w7/the_woman_in_cabin_10_movie/"
    },
    {
        "id": "1oa0bkf",
        "author": "schi__zoid",
        "title": "The Perfect Neighbor - it is really heartbreaking",
        "content": "What an ironic title. Losing someone close to you is one of the most difficult things, and it's even worse when the kids are still young. Luckily they seem to be well surrounded by their loved ones.\n\nChildren can be very noisy and annoying, THAT'S WHY THEY ARE CHILDREN. I felt sick when they showed Susan making a scene and refusing to just FKN stand up and go to jail. Very pathetic. ",
        "upvotes": 74,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1oa0bkf/the_perfect_neighbor_it_is_really_heartbreaking/"
    },
    {
        "id": "1oaget4",
        "author": "Funny-Cup-9416",
        "title": "Alright Reddit, please cure my boredom, what’s something absolutely worth watching right now?",
        "content": "I want to watch something really good doesn’t matter if it’s new or old, but please no fantasy or political stuff.\n\nI watch thrillers, drama, crime, emotional stories.\n\nWhat’s that one show or movie that you guys think i should be watching tonight. \n\nI’m doing a night shift, so even if it’s a Tv Show it’s okay to me.\n\nPs: Women in the Cabin 10 sucks one of the worst films i’ve ever seen on Netflix.",
        "upvotes": 7,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1oaget4/alright_reddit_please_cure_my_boredom_whats/"
    },
    {
        "id": "1oaibur",
        "author": "Negative-Industry944",
        "title": "Subtitles dropped in quality?",
        "content": "Has anyone else noticed the subtitles on Netflix have become unbelievably bad in the past week or so?\n\nI've been watching a few different shows, and the subtitles aren't matching the actual dialogue. They're essentially summarising what's being said, not transcribing it.\n\nIt's completely missing the nuance and accuracy of the conversations, and it's really frustrating. It's happening across multiple shows, so it doesn't seem to be a one-off problem.\n\nIt's really frustrating for me (and I don't have any hearing impairment), but it must be infinitely worse for anyone who is D/deaf or hard of hearing. I really hope they fix it soon.\n\nJust wondering if anybody else had noticed this? ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oaibur/subtitles_dropped_in_quality/"
    },
    {
        "id": "1oa4usj",
        "author": "Suspicious_Repeat706",
        "title": "Question about The perfect neighbor",
        "content": "Just finished the documentary and was wondering if anyone knew if they found the tablet in Susan’s house? After all that is why AJ went over, but there was no confirmation of her taking the tablet was true or not.",
        "upvotes": 23,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1oa4usj/question_about_the_perfect_neighbor/"
    },
    {
        "id": "1o9kmmk",
        "author": "Conscious-Can-5334",
        "title": "The Perfect Neighbor - thoughts?",
        "content": "This has me bawling. It’s so sad. Those poor children. That woman should have been arrested from the start. Why didn’t I hear about this in the news when it was happening? ",
        "upvotes": 394,
        "comments": 834,
        "media": null,
        "permalink": "/r/netflix/comments/1o9kmmk/the_perfect_neighbor_thoughts/"
    },
    {
        "id": "1o9mj78",
        "author": "sallymacsmack81",
        "title": "Victoria Beckham’s supposed ‘Victory’ - David Beckham has been subsidising my eyeliners.",
        "content": "The whole premise of the Victoria Beckham documentary was that she fought for 17 years to be taken seriously in fashion and build her brand, all for it to finally stabilise in 2023 after cumulative losses of -£69 million pounds, to post a triumphant profit. But the truth is she posted a EBITDA profit of around £2m pounds, but still an operating loss of -£2.9m. This year, she’s had to extend loans of £6.3m to keep it afloat. It’s not successful and hasn’t been, and if you can’t make a company generate a return in 17 years, after that much investment, it’s not going to magically start making a return. And for that £70 million investment to have meant anything, it needs to be able to generate more than that at some point, not just pay it back. Like who in god’s name pumps that much cash into something year after year, as an escalating commitment to failure, and then gets a documentary made about what a big success it is. I’m baffled! I own some of her eyeliners, and now I know David Beckham has partially subsidised them!",
        "upvotes": 213,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1o9mj78/victoria_beckhams_supposed_victory_david_beckham/"
    },
    {
        "id": "1oaeirf",
        "author": "EliMarketing",
        "title": "New Shows or Movies to watch?",
        "content": "Shows to watch on Netflix or HBO? I’m only interested in those 2 because I’m only paying for those two right now and they have no commercials. Normally I would ask CHAT GPT but my bestie has made it clear that’s bad for the environment so I cut myself off cold turkey. \n\nShows I liked:\nPeaky Blinders \nDerry Girls \nFranklin &amp; Bash \nHawaii 5-0\nGame of Thrones \nHouse of Dragon\nNCIS\nCriminal Minds \nCold Case \nThe Closer\nRizzoli &amp; Isles \nLaw &amp; Order \nBurn Notice \nCook of Castemar\nQueens Gambit \nNurse Jackie (I keep falling asleep) \nGreys Anatomy (Any season after Izzy just hasn’t kept my attention) \nOutlander (Season 1 shook me to my core, I’ve decided to never return) \nHalo (started it but kept falling asleep) \nThe Vampire Diaries and all its add ons (haven’t finished any of them. I’m entranced then I’m annoyed. I gave up) \nSuits (never finished, but I did google the ending) \n\nYeaaaaa…I’ve rewatched every single Quentin Tarantino film on Netflix 1,000+ times and I need some new material. There’s a lot more shows I did watch and love but I’m drawing blanks tbh. DC and Marvel shows don’t really keep me either. I just want to be excited about a show again 🥲. I can’t believe I’m saying this but…I’m tired of reading at the moment. And audio books count as reading. \n\n\n",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oaeirf/new_shows_or_movies_to_watch/"
    },
    {
        "id": "1oak5gd",
        "author": "OkShine5874",
        "title": "“Your device isn’t part of the Netflix Household for this account”SMART TV Workaround?",
        "content": "Hello there fellow Redditors, As described in the title above, is there any possible way and or workaround to bypass this through a smart TV? I know of the airplane mode \"hack\" through a mobile phone, but I have yet to see on for smart TV. Any help or feedback would be greatly appreciated. Thank you! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oak5gd/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1o9zos5",
        "author": "Routine-Asparagus-16",
        "title": "The Diplomat season 3 - Right off the rip",
        "content": "\"A Real Bible. Adult size. Written by Jesus\"\n\n\"Jesus did not write the Bible\"\n\nThe Diplomat Season 3 hasn’t missed a beat. I’m only on the first episode and already hooked. Hal is such a headache, never listens... but I do think he means well. The dynamic between Grace (the President) and Kate (the Ambassador) is fantastic.\n\nThe pacing’s great too. It moves fast but knows when to slow down, like that scene where Kate helps Grace in the bathroom with her shirt. I also love how the show lets the audience in on what’s really happening, even when the truth isn’t said outright... like during the visit with Margaret Roylin.\n\nAnd it’s funny! A political thriller with perfectly timed humor is exactly the escape I needed today.\n",
        "upvotes": 20,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o9zos5/the_diplomat_season_3_right_off_the_rip/"
    },
    {
        "id": "1oabcz1",
        "author": "Shopgirl_Mirabelle",
        "title": "The Perfect Neighbor question",
        "content": "I’m asking honestly because I don’t know. How could the police have prevented this? They (the neighbors) said she should have been in jail, but what would she have been charged with? What other things could have been done to prevent it?",
        "upvotes": 5,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1oabcz1/the_perfect_neighbor_question/"
    },
    {
        "id": "1oai1ap",
        "author": "HecubaMay",
        "title": "Did Netflix remove their trivia game/ anyone have any alternative suggestions?",
        "content": "My partner and I loved playing the Netflix trivia game on our TV; we liked that it was easy to do multiplayer and had a good range of questions. Sadly, I can’t find it on there anymore and have tried downloading a couple other trivia ones like trivia crack and the like but none of them have an good format for multiplayer or a big range of good questions. Does anyone know why they got rid of it or any good alternatives to the Netflix one to play on either smart tv (firestick) or iPhone? Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oai1ap/did_netflix_remove_their_trivia_game_anyone_have/"
    },
    {
        "id": "1oaar7o",
        "author": "GorgeousGarbageGal",
        "title": "Parents live separately and now no one can access the Netflix household",
        "content": "My parents got divorced about a year and a half ago. My dad kept the house and my three siblings, my mom, and I all moved out. The account was set up with his email on our old house’s wifi. But now, Netflix locks all of our devices out of the account except my dad’s. I don’t understand why I can’t use Netflix from a different house when we pay for a certain number of devices. Is there any way to fix this or is it always like this for family members who live in different houses?",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1oaar7o/parents_live_separately_and_now_no_one_can_access/"
    },
    {
        "id": "1oa32aq",
        "author": "Yassin_092",
        "title": "What to watch",
        "content": "I'm kinda new to series and netflix stuff and I can't decide what to series to start with\nI was thinking between those \nWednesday, breaking bad (season 2), the wire, dexter, house MD, the walking dead, chernobyl\nStranger things",
        "upvotes": 8,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1oa32aq/what_to_watch/"
    },
    {
        "id": "1oabznr",
        "author": "Jack_Of_Blades_",
        "title": "Disable Force Subtitles?",
        "content": "Hi all, does anyone know of a way to disable Forced Subtitles on the Netflix app on a Samsung TV?\n\nI'm trying to watch The Blacklist and every time someone speaks in a language other than English and we the viewer are supposed to understand what is said, The Blacklist has subtitles built into the video.\n\nHowever Netflix is transposing Forced Subtitles on top of these subtitles, making it extremely hard to read (having writing on top of writing).\n\nA strong example of this is S9E17 as a number of characters speak Spanish to each other. I want to understand what is being said without having to pause the video every time.\n\nIt's like nobody at Netflix even bothered to test if the subtitles were needed or causing any issues.\n\nAny help would be extremely appreciated.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oabznr/disable_force_subtitles/"
    },
    {
        "id": "1oag8y2",
        "author": "Hotgalkitty",
        "title": "The Perfect Neighbor - any civil suits?",
        "content": "Just got through watching and I am floored. I'm wondering if Ajika's family filed any civil suits against Susan? She had some resources that could be taken. Those children are going to need lifelong therapy and the loss of their mother is worth every dime she has in her possession.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oag8y2/the_perfect_neighbor_any_civil_suits/"
    },
    {
        "id": "1oaawzs",
        "author": "Wordplaii",
        "title": "Chestnut man",
        "content": "Is it just me or does nobody in this entire series know how to pull a trigger. Multiple times they could have caught him towards episode 5 and 6 and they just fail to pull the trigger. In the basement at the chestnut house on both Thulin and her partner multiple times. In front of the bmw when he has Thulin in the backseat. Dude doesnt even pull the trigger until the car is spearheading towards him. This made me so angry for so much of the ending. Its like both of Thulin and her partner think that a man who did multiple murders was just gonna surrender. And even when he failed to surrender they just stood there pointing there guns for 2 3 4 5 10 seconds ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oaawzs/chestnut_man/"
    },
    {
        "id": "1oa7juy",
        "author": "Previous-Boss-1480",
        "title": "wayward",
        "content": "how did everyone feel about wayward? I really liked it but also was so irritated by the ending I hate how Alex’s wife didn’t want to leave I feel like she wanted to be a leader of a new cult rather than Evelyn’s \nI hate how they used so much against Alex why would Laura his wife even take him there in the first place.. I wish Alex would have just ran in the end rather than staying I mean all the people that threaten to ruin his if he left was gone at the end? it was a great show just wish it would have ended differently .. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oa7juy/wayward/"
    },
    {
        "id": "1oacfd8",
        "author": "michaelwave2583",
        "title": "Netflix’s Shadowy Implementation of AI Upscaling",
        "content": "I rarely use streaming as I buy most of my movies on physical media at this point, but my girlfriend and I decided to watch Shrek 2 tonight and, since we don’t have it on disc, we had to watch it on Netflix. About 20 minutes in, I started picking up on some really weird haziness around the edges of characters moving. As the movie progressed, particles started looking extremely spotty, and I almost immediately clocked that it was AI upscaling. We use my girlfriend’s father’s Netflix and he pays for whatever the highest plan is, and it’s not like we have slow internet; our Apple TV, which we stream from, clocks consistent speeds at 400mbps. This movie should be streaming in at LEAST 1080p, maybe even 4K - and yes, I know, streaming bitrates are different across the board, but it has never looked THIS bad before. This is genuinely just embarrassing that a company as massive as Netflix is charging ~$30 a month for the equivalent of 720p streaming with upscaling so distracting it made the movie, which I adore, nearly unwatchable. This is completely and utterly repulsive. If you haven’t already, use your money elsewhere. Inexcusable.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oacfd8/netflixs_shadowy_implementation_of_ai_upscaling/"
    },
    {
        "id": "1oac2qo",
        "author": "KittyprydeX101",
        "title": "Wednesday",
        "content": "Please no one give me “ spoilers “ but I just watched episode 1 series 2 and I had to look up who played mort.             icia addams! It was still Catherine zeta-jones??!! She looks sooo different!!?? Or just me?? \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oac2qo/wednesday/"
    },
    {
        "id": "1oa2f2m",
        "author": "obeseelise",
        "title": "The Perfect Neighbor - Did Susan have the iPad?",
        "content": "Not sure if this was asked or addressed in the doc but did she have the iPad? Did she really take it? Obviously nothing justifies what she did but that would really be something if she stole the kids iPad and then did this. ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oa2f2m/the_perfect_neighbor_did_susan_have_the_ipad/"
    },
    {
        "id": "1oa3jjt",
        "author": "capercrohnie",
        "title": "Good News",
        "content": "Good News is a disaster black comedy movie by Byon Sung-Hyun. It is a Korean movie that is about a bunch of Japanese communists who hijack a plane and demand that it land in North Korea. It is really funny.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oa3jjt/good_news/"
    },
    {
        "id": "1o9fgki",
        "author": "Previous-Boss-1480",
        "title": "boots 🥾",
        "content": "is anyone else obsessed with boots!? I absolutely love the show finally finished last night and I wish it had more already lol! I’m so curious where did Sargent Sullivan go? I wonder if next season it’ll actually show them in “war” I have sooo many unanswered questions 😅 did anyone else love the show?? also like why did James kinda lead cam on that irritates me so bad I truly thought they would do good together .. also love cams progress I feel like he needed that camp more than the others \nsorry for the spiraling just need someone to talk to about it 🤣",
        "upvotes": 61,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1o9fgki/boots/"
    }
]