[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oh4o8i",
        "author": "mother_earth_13",
        "title": "Susan in “The Perfect Neighbor” premeditated the shooting, not Just a “fed-Up” old lady.",
        "content": "This started as a reply to a comment, but after seeing so many threads blaming the “permissive” parents or portraying Susan as a harassed senior defending her turf, I had to make it a post. The doc shows Susan’s actions were calculated, not reactive self-defense. \n\nI get the parental angle, I’d be extra vigilant too and would keep my kids away from someone like Susan with her cursing, petty aggressions and escalating beef. You never know what people are capable of so you should trust your instincts, but blaming the parents overlooks Susan’s premeditation.\n\nSusan told AJ’s kid to fetch his mom (knowing it’d bring AJ over), called 911 then shot AJ unarmed in under two minutes. Florida’s Stand Your Ground might cover perceived threats on your property, but why not wait for cops? Lock the door? Retreat inside? Aim non-lethally? The body cams, timelines and forensics scream intent, not fear.\n\nShe escalated from verbal abuse to physical by throwing skates and swinging umbrellas at AJ’s kid to provoke AJ. That’s baiting, not being “fed up.” Any parent would confront that. The trespassing and door-banging excuses ignore how Susan orchestrated it betting on the law to shield her.\n\nParents could’ve chosen differently in hindsight, but Susan had clear alternatives to killing. Someone that determined would’ve found a way regardless. \n\nAccountability’s on her.",
        "upvotes": 63,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oh4o8i/susan_in_the_perfect_neighbor_premeditated_the/"
    },
    {
        "id": "1ogz75a",
        "author": "Boring_Sand_206",
        "title": "Hidden gems please",
        "content": "I have been unemployed since forever (not for lack of trying!) so I have watched A LOT of Netflix. I think I've watched pretty much everything worth watching on there. Anyone have some hidden gem recommendations for me??",
        "upvotes": 128,
        "comments": 348,
        "media": null,
        "permalink": "/r/netflix/comments/1ogz75a/hidden_gems_please/"
    },
    {
        "id": "1ogo0q8",
        "author": "Newfie3",
        "title": "House of Dynamite - wholly unsatisfying (spoiler)",
        "content": "I should have known by the horrible deliberate camera-shaking that the movie was going to suck. There is no good reason for deliberate camera-shaking. Then the plot repeated itself from three or four perspectives. Then the movie just ended with zero resolution whatsoever. Sorry Netflix, this movie was a bomb, but not in a good way.",
        "upvotes": 197,
        "comments": 230,
        "media": null,
        "permalink": "/r/netflix/comments/1ogo0q8/house_of_dynamite_wholly_unsatisfying_spoiler/"
    },
    {
        "id": "1ogee04",
        "author": "Western_Quit_4966",
        "title": "Netflix doesn’t care about good writing anymore",
        "content": "The platform is full of shows with huge production value but terrible scripts. It’s all visuals and marketing, zero substance. People only praise it because it’s on Netflix. Who’s tired of this?",
        "upvotes": 305,
        "comments": 188,
        "media": null,
        "permalink": "/r/netflix/comments/1ogee04/netflix_doesnt_care_about_good_writing_anymore/"
    },
    {
        "id": "1oh7opm",
        "author": "bohemiangels",
        "title": "The Monster of Florence question [SPOILER]",
        "content": "So the show really seemed to suggest that Salvatore Vinci was tge monster. He had no alibis for any of the murders, one of 11 guns like the one used in the murders sold in his region belonged to his family member and was unaccounted for, his first wife died suspiciously… What I’m wondering is how much of his story that the series put forth was actually true/proven? Is there any public knowledge of his family/early life? Was he gay? Did he have a relationship with his first wife’s brother? Did he have a relationship with Stafano? Did he tell Stafano he killed his first wife and did Stefano make a statement to police about that eventually? And then recant that at Salvatore’s trial? Was he really married to someone who left him twice, each time lining up with a murder?\nThere seems to be a strong commentary about the homophobic, machismo, sexist culture at that place and time having fostered the misogyny of this psychopath. Almost like he learned from his father but also everything around him that he must dominate the women around him in order to be able to have relationships with men. As though women were such a threat to him that he hated them, murdered them and literally excised what made them female. The fact that his victims were  heterosexual couples having sex (except the one where they say one of the men was probably mistaken for a woman), further suggests that his motivation was borne of distain for a culture that accepted hetero sex and rejected gay sex. \nIt felt like a really strong assertion of that narrative to me but I wonder how much of it is actually true.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh7opm/the_monster_of_florence_question_spoiler/"
    },
    {
        "id": "1ogep7t",
        "author": "YeetMyM3at",
        "title": "Anyone else spend more time scrolling than actually watching?",
        "content": "I open Netflix planning to watch something, then end up scrolling for 30 minutes trying to pick a show.  \nBy the time I finally choose, I’m not even in the mood anymore.\n\nDoes anyone else do this, or is it just me?",
        "upvotes": 123,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1ogep7t/anyone_else_spend_more_time_scrolling_than/"
    },
    {
        "id": "1oh853p",
        "author": "bahama_llamas",
        "title": "Login refreshes blank",
        "content": "Hi I have a ASUS Rog Zephyrus G14 and every time I try to login into Netflix the screen just refreshes and I’m back at a blank login. No error code or anything. I’m on the same wifi as my other devices and they all login perfectly fine. \n\nI’ve cleared cookies, tried difference browsers, uninstalled resintalled the app and nothing is working. All my drivers and laptop are up to date. Has anyone else experienced this and know what to do? Please help!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh853p/login_refreshes_blank/"
    },
    {
        "id": "1oh7xql",
        "author": "443610",
        "title": "Last Samurai Standing - Official Trailer",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh7xql/last_samurai_standing_official_trailer/"
    },
    {
        "id": "1ogbg13",
        "author": "Short_Pin_6243",
        "title": "House of Dynamite was so close to being great",
        "content": "*Potential minor spoiler*\n\nJust watched the movie and I don’t think I’ve ever felt this way about a film before. Everything was right there to make a great film but they veered off so unnecessarily. \n\nAll the film needed to do was continue to build off the tension of the first act. It felt plausible yet unbelievable at the same time. It captured the complete panic that would take place. \n\nThen they had to switch perspectives…..twice. It completely took me out of the tense feeling of the first third. It sucks because it was completely unnecessary. ",
        "upvotes": 109,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1ogbg13/house_of_dynamite_was_so_close_to_being_great/"
    },
    {
        "id": "1og8tmv",
        "author": "liveoutdoor",
        "title": "I really hate Netflix at the moment.",
        "content": "As a pet/house sitter I am usually away from my house. I bring my own device to stream, so far tonight I have had to update my household, ener codes etc 5 times. Then the family back at home gets booted it is so ridiculous.\n\nJust a rant. ",
        "upvotes": 168,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1og8tmv/i_really_hate_netflix_at_the_moment/"
    },
    {
        "id": "1oh5agz",
        "author": "Ok_Percentage7257",
        "title": "Mo (season 3) (Spoilers about Season 1 and 2 mentioned while speculating season 3)",
        "content": "I am speculating Mo will be back. Season 3 will be on the West Bank or another Palestinian setting. We will likely witness the IDF in action on Mo and his family. Mo's romantic life will be pragmatic. Mo and Maria will want their marriage to be real because of their feelings towards each other. \n\nMo will continue to self-sabotage. The IDF won't be as patient as ICE. I think we will continue to see Mo lying to get out of sticky situations. Mo will lose more in Season 3. I assume there will be more drama. I also think it will be funny. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh5agz/mo_season_3_spoilers_about_season_1_and_2/"
    },
    {
        "id": "1oh5862",
        "author": "MichHitchSlap",
        "title": "House of Dynamite- Discussion",
        "content": "I am not interested in people complaining about the movie and how they did not like the ending! If you were the president, what would you have done?\n\nIf I’m the president and assuming Chicago just got destroyed…I can’t confirm who launched the attack and there are no other nukes in the air, I don’t nuke anyone. I investigate who launched the attack and notify the entire world  if one more nuke is shot at the U.S, America will launch every nuke in are arsenal across the globe\n\nCurious what everyone else would do?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oh5862/house_of_dynamite_discussion/"
    },
    {
        "id": "1oh50m4",
        "author": "iphone8vsiphonex",
        "title": "Let’s share House of dynamite alternative ending!",
        "content": "Sure - you can go to the route of “the message of the movie is to address the reality of our need to CONTINUE to reflect on the ethics of the existence of nuclear technology - just like unfinished ending of the movie” or whatever people may say to justify this unsatisfying ending. Artistic and insightful endings should feel artistic and insightful. This one, at least to me, just felt, uncomfortable. \n\nSo let’s start our own ending. What would be your alternative ending to this potentially wonderful movie?   ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oh50m4/lets_share_house_of_dynamite_alternative_ending/"
    },
    {
        "id": "1oh00o9",
        "author": "RemarkableLab433",
        "title": "Adhd thriller",
        "content": "I love shows high paced either super creepy or action and mystery but not slow with having adhd I can’t find a show settle in at all Want show u highly suggest will keep me hooked and engaged",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh00o9/adhd_thriller/"
    },
    {
        "id": "1oh3n9e",
        "author": "crocshock7",
        "title": "How does Yellowjackets s3 compare to 1-2? No spoilers pls.",
        "content": "This show had an interesting concept. I was immediately intrigued from the very first scene. But wasn’t that well done, unfortunately, but it was watchable. Season 2 was a boring chore. I really wish they leaned more into the horror and supernatural elements, but I guess this isn’t that kind of show.\n\nHow does season 3 compare? If it’s as much of a drag as season 2, I’m not going to bother continuing.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oh3n9e/how_does_yellowjackets_s3_compare_to_12_no/"
    },
    {
        "id": "1oh31xh",
        "author": "TicoNasty",
        "title": "House of Dynamite WH Press Secretary",
        "content": "Anybody notice the White House Press Secretary on House of Dynamite looks like an amalgamation of the last 3 press secretaries, Psaki, KJP, and Leavitt.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oh31xh/house_of_dynamite_wh_press_secretary/"
    },
    {
        "id": "1ogeycg",
        "author": "Leen88",
        "title": "Just finished a show and now I have that what do I watch next",
        "content": "I just finished my latest binge and now nothing else feels interesting.  \nI scroll for like 20 minutes but can’t commit to a new show.\n\nAnyone else get that empty feeling after finishing a really good series?",
        "upvotes": 24,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ogeycg/just_finished_a_show_and_now_i_have_that_what_do/"
    },
    {
        "id": "1ogomhe",
        "author": "Ok-Lingonberry5621",
        "title": "THE PERFECT NEIGHBOR EXTRA FAMILY INFO THAT MAY CHANGE THINGS??",
        "content": "i just watched the documentary and was hoping the family got proceeds for the kids college or the general recovery of the family\nthey didn’t.\nno money at alllll from netflix.\nthey can only receive donations from their gofundme",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogomhe/the_perfect_neighbor_extra_family_info_that_may/"
    },
    {
        "id": "1ogsjli",
        "author": "Halloween-Year-Round",
        "title": "Guillermo Del Toro's \"Frankenstein\" - A Visually Rich Masterpiece [Review]",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogsjli/guillermo_del_toros_frankenstein_a_visually_rich/"
    },
    {
        "id": "1ogypbc",
        "author": "chipkeymouse",
        "title": "Netflix only allowing 2 devices to stream at once now?",
        "content": "I could have sworn that they used to let 3 at once but now it stops me when a third person tries to stream. I don't remember this happening in the past. Was this a relatively new change or is there some issue with netflix?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ogypbc/netflix_only_allowing_2_devices_to_stream_at_once/"
    },
    {
        "id": "1ogfcyv",
        "author": "internettblob",
        "title": "Unpopular opinion: Boots does not need a second season",
        "content": "All of their comments on socials are people asking for a second season, and the actors have been vocal about wanting one as well. But as much as I loved all of the characters and wouldn’t be mad at seeing more things explored, I also feel like the show is already a complete story. Netflix has a tendency of milking things at the expense of quality, and I think we need to normalize leaving shows at one season and not dragging out projects just because we can. \n\nAs someone who was in the military, there’s something really special about boot camp and I think that specific setting was very vital to the storyline. You’re thrown into this new world, cross paths with all of these incredible people and DIs that completely change your life, and then you never see them again. Everyone gets separated for job training and then different assignments all over the world and moves on with their careers and lives. But there’s something so special about it while you’re there and it’s a memory you look back on forever. I think the show does an amazing job at capturing that, and it’s a complete story to me. \n\nIt would be really hard to keep the same characters when everybody would be in a different place. They would either need to find a new cast of people for wherever Cope ends up stationed or pan back and forth between all the current characters and their storylines. The GW storyline wouldn’t really work because they have job training and wouldn’t just get deployed straight to the conflict. \n\nSullivan ended up being dishonorably discharged (something he’s not getting around) so although he was a great character it would be hard to make him work in the story when he’s no longer a Marine. A lot of people didn’t like his ending but I think it was a really good depiction of someone living through the DADT era, and how it can eat you alive. He suppressed himself to that extent and it ended up not even being worth it, because the anger from all that suppression caused him to get kicked out anyway. It’s a complete arc, showing how damaging (and pretty ridiculous) these policies were and how they even caused the military to lose out on great soldiers. Perfect, model Marine with a silver star but ultimately gets kicked out just because he’s gay.\n\nI know the memoir this is based on covers many more years of Cope’s career beyond boot camp, so they could make it work if they wanted to. But I feel like it isn’t necessary and don’t really see it working without a significant dip in quality. There’s nothing worse than amazing shows being cheapened by weaker and weaker follow up seasons. Reminds me of Squid Game which had no business having a second and third season, the director himself said it was only because he needed money lol.",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ogfcyv/unpopular_opinion_boots_does_not_need_a_second/"
    },
    {
        "id": "1ofvchr",
        "author": "ShirtyManhole",
        "title": "Why do they shoot these shows in literal darkness?",
        "content": "Just finished The Black Rabbit. Really enjoyed it. Slow burn… two kids forged by a rough upbringing, bound together by brotherly love in a highly toxic way.\n\nBut why do they shoot half of these shows in literal darkness? I spent more time squinting at shadows than actually watching. At some points, it was more similar to listening to an audiobook than watching a show. I get that it’s moody, atmospheric, and dark for effect. However I feel I need military-grade night-vision goggles to follow the plot.",
        "upvotes": 163,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1ofvchr/why_do_they_shoot_these_shows_in_literal_darkness/"
    },
    {
        "id": "1ogs98f",
        "author": "MissMystery11",
        "title": "Top 4 of My Delusional Predictions:",
        "content": "1. Blue Eye Samurai Season 2 next spring and a teaser in Jan or Feb \n\n2. Next Arcane in Demacia or Noxus in 2027 \n\n3. Older Ga-yeong in American Squid Game getting revenge and teaming up with Inho \n\n4. Girl From Nowhere Season 3 in the earliest 2026",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogs98f/top_4_of_my_delusional_predictions/"
    },
    {
        "id": "1oh3fge",
        "author": "chewycookie_",
        "title": "Its a great show - recommend to watch",
        "content": "SHOW IS : NEVER I HAVE EVER\n love this show its makes me so emotional. Its a great blend of quirky, emotional, funny, sad, and wholesome. Im on season 1 episode 10 sobbing after they spread that dads ashes, you can really see how trauma can create deep wounds in people and they never get solved because of lack of communication.\n\nAnyways i love this show is so funny and easy to watch \n\nOH and the characters actually look the age. Paxton Hall Yoshida is so hot omg",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oh3fge/its_a_great_show_recommend_to_watch/"
    },
    {
        "id": "1ogq4vr",
        "author": "Honest_Conclusion538",
        "title": "Ewrly Netflix Pop up -Accidentally clicked away",
        "content": "I was on Netflix today on my tv and got a pop-up offer that said something about screening titles early. I instinctively clicked away but actually was interested.\n\nDoes anyone know what this is about or how I can opt in? \n\nNetflix customer support was no help. :(",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ogq4vr/ewrly_netflix_pop_up_accidentally_clicked_away/"
    },
    {
        "id": "1ogpzw5",
        "author": "That-Skin-1728",
        "title": "Suggest me thriller movies",
        "content": "Hey everyone! I’m in the mood for some intense, edge-of-the-seat thriller movies on Netflix and could really use your suggestions. I love films that keep you guessing till the very end — with smart plots, psychological twists, or a touch of mystery. I’ve already seen the big ones like Gone Girl, Prisoners, The Call, and The Girl with the Dragon Tattoo, so I’m hoping to discover some hidden gems or underrated thrillers that deserve more attention. I enjoy both slow-burn psychological thrillers and fast-paced crime mysteries — something gripping enough to binge in one sitting. If you know of any Netflix originals or international thrillers worth watching, drop them in the comments! Bonus points for unexpected endings or brilliant storytelling. What’s the best thriller you’ve seen lately that left you completely stunned? I’d love to make a weekend watchlist!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ogpzw5/suggest_me_thriller_movies/"
    },
    {
        "id": "1ogkguh",
        "author": "WeepingWings",
        "title": "Anyone else experiencing Netflix jumping all over the place",
        "content": "I'm not sure if this is because I've jumped all over before when watching \"Nailed It\" since some episodes I like more than others, but it like I would be watching S7E1 and then it jumps to S6E1, then S6E4...it aint playing the episodes in order and I'm not sure if anyone else experienced that kind of thing...if anyone have experienced this, were you able to fix the problem or is it like \"Netflix f\\*\\*ked up and we're stuck with this until they decide fix it, if they ever decide to fix it\" kind of deal...",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ogkguh/anyone_else_experiencing_netflix_jumping_all_over/"
    },
    {
        "id": "1ogpae7",
        "author": "That_One_Prog",
        "title": "I have a question for the \"Monster\" series: Would they be willing to do a season for another murderer who's still alive?",
        "content": "They did it for the brothers, but I feel like it didn't really matter since people don't like rich people anyway so it had a bit of a White Lotus vibe to it.\n\nI think a good subject would be the case of Darrell Brooks, not for his stunts in the courtroom but rather exploring the lives of Erika Patterson and the Waukesha victims of the attack to show how these people lived their lives before Darrell Brooks drove through the Waukesha Christmas Parade in his mother's Ford Escape and killed 6 people.\n\nYou could take a look into underprivileged communities via red-lining, which was the main focus of the defense's claim during sentencing, as long as you emphasize that what Darrell Brooks did represented a heavy outlier in the community and that might have been caught sooner if not for the fact that most of it happened at the time when we were dealing with the COVID-19 crisis.\n\nI think it would be interesting to see how the Monster series handles the COVID-19 crisis, they could make a whole episode about just that. Maybe show a person dying of Covid in a prison cell, I don't know, maybe the *true* monster was Covid-19 all along.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ogpae7/i_have_a_question_for_the_monster_series_would/"
    }
]