[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1ib3hq4",
        "author": "nullstuff",
        "title": "Ormea's loophole",
        "content": "",
        "upvotes": 157,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1bnwdjzxhfe1.jpeg?auto=webp&amp;s=3f44d7005fd50397c4d8633d1354fedfec2f5dad"
        },
        "permalink": "/r/torino/comments/1ib3hq4/ormeas_loophole/"
    },
    {
        "id": "1ib2mxg",
        "author": "James_Lovell",
        "title": "Conoscete supermercati che fanno acquistare gift card con i buoni pasto?",
        "content": "Conoscete supermercati a Torino che permettono di pagare le Gift card tipo di Amazon o zalando utilizzando i buoni pasto?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ib2mxg/conoscete_supermercati_che_fanno_acquistare_gift/"
    },
    {
        "id": "1ibdbvq",
        "author": "SimonRisso",
        "title": "Qual è il numero della tessera GTT",
        "content": "salve a tutti! sono uno studente universitario e sto cercando di chiedere il rimborso per l’abbonamento. Tra le cose richieste c’è il numero della tessera e non riesco a capire se sia quello sul retro o sul fronte della carta. Sapreste dirmi qual è quello utile? Grazie :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ibdbvq/qual_è_il_numero_della_tessera_gtt/"
    },
    {
        "id": "1ibabe6",
        "author": "GhostGirl_34",
        "title": "Negozio di active wear a Torino",
        "content": "Hey ragazzi sapete consigliarmi un negozio di active wear a Torino (non decathlon)?\n\nCerco magari qualche negozio che abbia vestiti da palestra o running con brand decenti",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ibabe6/negozio_di_active_wear_a_torino/"
    },
    {
        "id": "1ib5qcz",
        "author": "Alternative_Bat_6416",
        "title": "HELP: lavorare a Torino negli eventi musicali",
        "content": "ho bisogno del vostro aiuto per qualche consiglio su dove sbattere la testa (per evitare di sbatterla contro il muro).  \nSto cercando di cambiare vita e venire a Torino, ma la ricerca del lavoro è più complicata del previsto.  \nSto cercando lavoro nell'ambito di eventi musicali (organizzazione, comunicazione, promozione) e sto valutando le diverse proposte della città.  \nSapete indicarmi quali enti e/o organizzazioni possono fare al caso mio/quali contattare/cosa mi può essere d'aiuto? Qualsiasi consiglio è ben accetto, se siete sul pezzo nell'ambito per la realtà di Torino.  \nGracias &lt;333",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ib5qcz/help_lavorare_a_torino_negli_eventi_musicali/"
    },
    {
        "id": "1iaiyvu",
        "author": "tnndaboss1",
        "title": "Just moved into Torino as an American",
        "content": "Where do you guys suggest is the best place to network and meet new people. I’m in my early 20’s and just moved here alone. I don’t know anyone here xD. ",
        "upvotes": 16,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1iaiyvu/just_moved_into_torino_as_an_american/"
    },
    {
        "id": "1iadbpl",
        "author": "penoyixa",
        "title": "Chi èTEKIR ?",
        "content": "Vivo a Torino da quasi 3 anni e non sono ancora riuscito a capire chi sia Tekir. Non l'ho mai visto fare tag, ma ovunque vedo l'insegna. Qual è la leggenda su questo ragazzo?",
        "upvotes": 16,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7mikp6ps0cfe1.jpeg?auto=webp&amp;s=98ff20c255b06af87bc9d8a432c42396f9d49fc6"
        },
        "permalink": "/r/torino/comments/1iadbpl/chi_ètekir/"
    },
    {
        "id": "1iabnwq",
        "author": "Much-Cartoonist-9594",
        "title": "Questa zona è vivibile?",
        "content": "Ho trovato una bella casa in questa zona (accanto al parco) ma non sono sicuro della sicurezza di questa parte della città. ",
        "upvotes": 19,
        "comments": 61,
        "media": null,
        "permalink": "/r/torino/comments/1iabnwq/questa_zona_è_vivibile/"
    },
    {
        "id": "1iaaqkg",
        "author": "iannezluke79",
        "title": "Problematiche Mirafiori Sud",
        "content": "Vi prego aiutatemi a capire perché veramente faccio fatica.\nMa perché ogni volta che sento gente discutere delle zone di Torino (chiaccherando, sui social o in qualsiasi contesto) esce sempre che Mirafiori è una zona malfamata. Ci vivo da sempre e probabilmente non vedrò le problematiche ma io mi giro attorno e vedo solo vecchietti che fanno passeggiate.\nOkay, c'è Piazza Bengasi che sicuramente non è un bel posto per portare i nipotini a passeggio la sera però tolto quello cosa c'è di così assurdo?\nScusate il rant ma ho appena visto un TikTok di una ragazza che parlava dei peggiori quartieri di Torino e ovviamente ha menzionato Mirafiori e da lì mi è sorto il dubbio.",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1iaaqkg/problematiche_mirafiori_sud/"
    },
    {
        "id": "1i9z548",
        "author": "NightPuzzleheaded114",
        "title": "RANT GTT - Bici in autobus",
        "content": "Lavoro come rider e questa sera ho avuto la triste esperienza di bucare la ruota dietro della bici elettrica.\nSiccome ero in mezzo alla periferia rispetto a dove abito (fine zona San Paolo) ho pensato di salire sul primo bus che mi portasse in zona da me (Gran Madre).\nAspetto 10 minuti, arriva il 64 e l’autista mi ha detto che non potevo starci, io insistendo mostrandogli la bici con la ruota totalmente andata lo pregato di farmi stare.\nSto stronzo mi fa “eh ma se devo caricare un disabile”.\nMi ha lasciato sotto la pioggia, ad 1,30h di distanza a piedi quando il pullman era mezzo vuoto e se ci fosse stato bisogno di spazio sarei anche sceso.\nAuguro a questo infame di passare il doppio della mia disgrazia.\n\nP.s qualcuno è conoscenza se fosse possibile viaggiare su un pullman con la bici?\nAvrei anche potuto schiacciarla perché è un modello smontabile ",
        "upvotes": 22,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1i9z548/rant_gtt_bici_in_autobus/"
    },
    {
        "id": "1iavhv8",
        "author": "No-Ant-9038",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1iavhv8/removed_by_reddit/"
    },
    {
        "id": "1i99s1r",
        "author": "Available-Fee-9219",
        "title": "My photos of Torino",
        "content": "I'm a first year international student at Politecnico di Torino and here are few photos of Torino that I clicked so far. Shot on OnePlus 11r.",
        "upvotes": 1188,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1i99s1r/my_photos_of_torino/"
    },
    {
        "id": "1iaawr1",
        "author": "FirmPop4841",
        "title": "Analisi del Sangue",
        "content": "Buongiorno, mi sono da poco trasferito a Torino e cerco un buon laboratorio per fare le analisi del sangue.\nIo abito in zona Filadelfia/Lingotto ma posso spostarmi anche in zone Poi centrali.\nVorrei avere anche un'idea dei prezzi che ci sono qui per capire dove converrebbe andare a farle.\n\nVi ringrazio in anticipo ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1iaawr1/analisi_del_sangue/"
    },
    {
        "id": "1iadrk7",
        "author": "matbordaRnB",
        "title": "Targhetta citofono e buca lettere",
        "content": "Ciao\n\nConsigli su dove farmi fare le targhette in ottone per citofono e buca lettere?\n\nGrazie",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1iadrk7/targhetta_citofono_e_buca_lettere/"
    },
    {
        "id": "1iakgka",
        "author": "bestemmioduro",
        "title": "Quale quartiere scegliere?",
        "content": "Stavo valutando di trasferirmi a Torino, quali quartieri consigliate?\nSostanzialmente quello che mi interessa è che sia una zona tranquilla nella quale se tieni la finestra aperta d'estate non ti sembra di stare col divano in mezzo ad una strada per via del rumore delle auto, se i negozi/supermercati non sono vicini non è un grosso problema; fondamentale che ci siano pochi o che siano del tutto assenti immigrati africani o arabi.\nGrazie",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1iakgka/quale_quartiere_scegliere/"
    },
    {
        "id": "1i9zvt9",
        "author": "P0lpett0n3",
        "title": "Conoscete gruppi Whatsapp e Telegram per trekking in piemonte?",
        "content": "Conoscete gruppi Whatsapp e Telegram per trekking in piemonte?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i9zvt9/conoscete_gruppi_whatsapp_e_telegram_per_trekking/"
    },
    {
        "id": "1ia53zv",
        "author": "ohemb",
        "title": "Airport Caselle Bag Storage/check-in",
        "content": "Is it really true that there are no baggage storage options at the airport other than in the VIP lounges? We're a group arriving before noon for a late afternoon flight, and was thinking to store carry-on bags at the airport while visiting Turin. Either lockers or a manned storage point.\n\nAdditionally, how early would we be able to check in our hold baggage (big bags, skis boots etc) for the flight? We would check in about 5 hours prior to flight (12.30-&gt;17.30). We certainly don't want to take those with us to Torino city. Not interested in the 3rd party options (nannybag, radical, stowaway, etc) since it looks to be only in the city at train stations and cafes, and not at the airport. \n\nI ask here since Turin airport page is horrible to find proper info.\n\nThanks in advance!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ia53zv/airport_caselle_bag_storagecheckin/"
    },
    {
        "id": "1i9mltu",
        "author": "ivlia-x",
        "title": "Quale biglietto devo comprare per andare da Ikea?",
        "content": "Non voglio prendere la macchina. Vedo che ci arriva il pullman 32 ma non riesco a trovare le informazioni sulle zone extraurbane…. Sull’app GTT ci si possono comprare 10 tipi diversi di biglietto extraurbano, non so quale mi serve. Aiuto?\n\nHo l’abbonamento urbano ma da ciò che vedo non vale per questa tratta",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1i9mltu/quale_biglietto_devo_comprare_per_andare_da_ikea/"
    },
    {
        "id": "1i9t46x",
        "author": "CryingAlwaysCrying",
        "title": "Col Range Rover per assaltare la farmacia",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HDQEN8H2BLP-bh_oVByHSnK9oNHzVSZ5MjNO6p-8JG8.jpg?auto=webp&amp;s=8c5eefd6063fa276164aced7ff95a9fe6108527f"
        },
        "permalink": "/r/torino/comments/1i9t46x/col_range_rover_per_assaltare_la_farmacia/"
    },
    {
        "id": "1i9padm",
        "author": "jinx_1345",
        "title": "Mostra HR Giger",
        "content": "Ciao! Vorrei chiedere un'informazione: I biglietti per la mostra di Giger si possono prendere in loco oppure solo su ticket One? Se lo prendessi on-line il sito dà la disponibilità di acquistarlo open oppure nella data considerata con orario indicato alle 9:30 (ma dura tutto il giorno?)\nGrazie a chi risponderà ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i9padm/mostra_hr_giger/"
    },
    {
        "id": "1i9kpxu",
        "author": "nickname1917",
        "title": "Amiat e la raccolta porta a porta",
        "content": "Come va il servizio da voi?\n\nDa me ogni settimana qualcuno si dimentica di passare, ieri quelli della carta non sono passati, la scorsa settimana non sono passati quelli della plastica, la settimana prima quelli dell'indifferenziata.\n\nOgni volta il cortile si riempie di spazzatura e bisogna fare le segnalazioni per chiedere come mai non sono passati e se cortesemente possono passare senza aspettare la settimana successiva.\n\nMa perché se ci sono i giorni prestabiliti non effettuano la raccolta?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i9kpxu/amiat_e_la_raccolta_porta_a_porta/"
    },
    {
        "id": "1i9uy8w",
        "author": "DirectInteraction825",
        "title": "Zona Aurora Torino",
        "content": "Ciao a tutti, \nsono un ragazzo che ha appena iniziato a lavorare a Torino e ho appena trovato casa in zona Aurora, in particolare l'appartamento sarebbe in una traversa vicino al Rondò Forca Ovest. \nVorrei avere informazioni riguardo a quella zona, non sono pratico di Torino perché mi sono appena trasferito e leggendo in giro non parlano bene di Aurora.\nSe avete consigli sono ben accetti.",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1i9uy8w/zona_aurora_torino/"
    },
    {
        "id": "1i9la6w",
        "author": "barbax-7",
        "title": "Piazza Derna",
        "content": "Come valutereste la zona di Piazza Derna per alloggiare in hotel, una famiglia di 4 persone, con spostamenti serali verso il centro con il tram 4?",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1i9la6w/piazza_derna/"
    },
    {
        "id": "1i9l8gd",
        "author": "themasterwuz",
        "title": "Zona Parella",
        "content": "Ciao, questo è il mio primo post qua. Volevo chiedere informazioni circa la zona Parella, in particolare intorno a via Nicola Fabrizi. Ho trovato un appartamento che potrebbe fare per me.   \nHo visto che la metro è piuttosto vicina, quindi immagino i mezzi pubblici non siano un problema. Per quanto riguarda gli altri servizi, tipo supermercati e locali? Si tratta di un quartiere tranquillo? ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1i9l8gd/zona_parella/"
    },
    {
        "id": "1i9k30v",
        "author": "Coccorocco1",
        "title": "Consigli cenetta in montagna",
        "content": "Sto cercando un posto dove mangiare a cena stasera nei pressi di Torino ma in montagna, che sia accessibile con la macchina e che non costi mille milioni 😁",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1i9k30v/consigli_cenetta_in_montagna/"
    },
    {
        "id": "1i9ii6n",
        "author": "Alternative-Oil2330",
        "title": "Mappano - Torino",
        "content": "Ciao, a breve mi trasferirò vicino Mappano e avrei il bisogno di raggiungere Torino. Avevo pensato di lasciare la macchina alla stazione di Stura, c'è qualche zona tranquilla nelle vicinanze dove parcheggiare gratis? Il parcheggio del centro commerciale le Porte è sempre aperto?\nCome alternativa avevo pensato anche Falchera cap\n\nQualsiasi consiglio è ben accetto.\n\nGrazie a tutti",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1i9ii6n/mappano_torino/"
    },
    {
        "id": "1i9eosw",
        "author": "misturbusy",
        "title": "Changes to family reunification for work visa in 2025",
        "content": "I'm partially through the process of obtaining a digital nomad visa. And my wife and I are presented with a few routes to gaining her entry to IT as well. Sidenote: she is pregnant so we're trying to be cautious and weigh routes that are shorter and those with less risk.   \n  \nCurious if anyone has gone through any of the following in the New Year (I believe a law passed at the end of December that changed the process):   \n\\- \"Visa for family reasons\"  \n\\- Family reunification process when seeking permesso di soggiorno  \n\\- One spouse with a visa obtaining a Nulla Osta for the other spouse (if so, how long does this take in Torino?)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i9eosw/changes_to_family_reunification_for_work_visa_in/"
    },
    {
        "id": "1i96w2q",
        "author": "Altruistic-Cash7223",
        "title": "Food in Torino after midnight?",
        "content": "\n“Hi, we will be arriving at our Airbnb around midnight. Is there any chance we can find something to eat?”\n\nNear - The Queen Victoria Pub area",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i96w2q/food_in_torino_after_midnight/"
    },
    {
        "id": "1i94fk2",
        "author": "bora907",
        "title": "Erasmus",
        "content": "I will be in Torino in 8 days for Erasmus. Any advices? What should I expect? Is there any neighbourhoods I should avoid while choosing place to stay.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1i94fk2/erasmus/"
    },
    {
        "id": "1i8y394",
        "author": "cawalli",
        "title": "Billy cobham @ Torino jazz festival 2012",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w5i2drlrnyee1.jpeg?auto=webp&amp;s=981ff34ba051c14e0446344b03bc8f629cacc7de"
        },
        "permalink": "/r/torino/comments/1i8y394/billy_cobham_torino_jazz_festival_2012/"
    }
]