[
    {
        "id": "1lo3lzz",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 2196,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lo3lzz/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lbetgi",
        "author": "RM_Official_Thread",
        "title": "r/RealMadrid Reddit CWC Fantasy League and Prediction Bracket Challenge",
        "content": "FIFA Official app has 2 games going on for the CWC and it would be fun if we use both to determinate if you guys know as much football as you pretend to when  you're all arguing tactics in the sub and claiming you know how to fix the team and that Carlo had none.\n\n\\# Join the Fantasy League for this subreddit here:\n\n[https://play.fifa.com/fantasy/join-league/BDHSOJPY](https://play.fifa.com/fantasy/join-league/BDHSOJPY)\n\n\\# Join the Prediction bracket for this subreddit here:\n\n[https://play.fifa.com/bracket-predictor/join-league/60B7D21B](https://play.fifa.com/bracket-predictor/join-league/60B7D21B)\n\npost your bracket or fantasy team here to get people going.\n\nWinner of each will get a custom flair set to whatever you want (as long as its reasonable)",
        "upvotes": 21,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2IQgNCexcLebmnUV4r1PsoE08WHXZ9oOuLG1NvcOCg.png?auto=webp&amp;s=e5d92205c44c2e30bc741130b750be458855c060"
        },
        "permalink": "/r/realmadrid/comments/1lbetgi/rrealmadrid_reddit_cwc_fantasy_league_and/"
    },
    {
        "id": "1lrc37o",
        "author": "danny--12",
        "title": "Hoping you all will like this",
        "content": "",
        "upvotes": 281,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rlu7c8hs0taf1.jpeg?auto=webp&amp;s=c5e3beba47514045d5c2d0b6a8c873d068ef3702"
        },
        "permalink": "/r/realmadrid/comments/1lrc37o/hoping_you_all_will_like_this/"
    },
    {
        "id": "1lqwzua",
        "author": "Leekeew",
        "title": "Real Madrid holding a minute of silence ahead of their training session.",
        "content": "",
        "upvotes": 2008,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/799ij39lcpaf1.jpeg?auto=webp&amp;s=5fafb87b9321e17c9b426d35e7fae318957d78c4"
        },
        "permalink": "/r/realmadrid/comments/1lqwzua/real_madrid_holding_a_minute_of_silence_ahead_of/"
    },
    {
        "id": "1lra08q",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to club legend, our fourth highest top scorer, one of our greatest players and one of the greatest players in football history late Alfredo Stéfano Di Stéfano Laulhé 🇦🇷",
        "content": "",
        "upvotes": 182,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lra08q/happy_birthday_to_club_legend_our_fourth_highest/"
    },
    {
        "id": "1lrbror",
        "author": "Organic_Morning3584",
        "title": "Is Madrid going to keep the badge in the middle for UCL games too?",
        "content": "I wanted to get the jersey with the UCL badge and was wondering if Madrid will keep the badge in the middle cause I wanted a jersey without it.\n\n  \n",
        "upvotes": 69,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yxc5znlywsaf1.png?auto=webp&amp;s=fcddd27295c83b61f93c0196ad1b81620577b549"
        },
        "permalink": "/r/realmadrid/comments/1lrbror/is_madrid_going_to_keep_the_badge_in_the_middle/"
    },
    {
        "id": "1lqkmko",
        "author": "Kick1O1",
        "title": "Liverpool striker Diogo Jota and his brother have both passed away in a traffic accident. May his soul rest in peace.",
        "content": "",
        "upvotes": 2199,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ovXtSvx_hdUF-EJeKmCgTGCbaCG4PQUlqybuJEckpg.jpg?auto=webp&amp;s=58af4a3be17a1b2b645fc5c9bd3505ec2933ca6b"
        },
        "permalink": "/r/realmadrid/comments/1lqkmko/liverpool_striker_diogo_jota_and_his_brother_have/"
    },
    {
        "id": "1lqrn41",
        "author": "TimothyX7",
        "title": "[Mario Cortegana] Real Madrid and Xabi Alonso are open to Rodrygo leaving this summer. They have agreed the club will not stand in the player’s way if a suitable offer is made. Arsenal have held preliminary talks with Rodrygo's camp",
        "content": "",
        "upvotes": 616,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FtXkl4IKN90DExifLEWk2gA08OmcVROczRO328Q34zA.jpg?auto=webp&amp;s=de4534b86989dcb5bf63b200bad6b7b71ed16fc3"
        },
        "permalink": "/r/realmadrid/comments/1lqrn41/mario_cortegana_real_madrid_and_xabi_alonso_are/"
    },
    {
        "id": "1lqykb6",
        "author": "soccer_footballmania",
        "title": "PSG ready bid for unwanted Real Madrid ace Rodrygo",
        "content": "",
        "upvotes": 156,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqykb6/psg_ready_bid_for_unwanted_real_madrid_ace_rodrygo/"
    },
    {
        "id": "1lqsist",
        "author": "Stock-Entrepreneur79",
        "title": "I really don't want Rodrygo to leave my club",
        "content": "Man has given me so many beautiful moments to celebrate. The City game ,every-time he performs against them that derby goals,  that classico freekick that gave me hope, that Bayern game penalty he won, so many moments also he is young obviously he can improve. I know for a club like Madrid we don't work emotionally. But as a fan it will be a emotional day for me if Rodrygo  leaves Real Madrid. I might cry. What do you guys think??",
        "upvotes": 298,
        "comments": 98,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqsist/i_really_dont_want_rodrygo_to_leave_my_club/"
    },
    {
        "id": "1lr1ebp",
        "author": "PermissionAny3962",
        "title": "Do you guys think we can beat psg?",
        "content": "i know the time hasn’t come yet and we still need to beat dortmund and there’s a chance (low) they won’t beat bayern but do you guys genuinely think we can? i don’t ngl im just hoping the scoreline isn’t like the atleti or both inter games, i feel like the system isn’t yet fully implemented in the way that xabi wants it to be in order to face the really big guns but who knows we have valverde",
        "upvotes": 87,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lr1ebp/do_you_guys_think_we_can_beat_psg/"
    },
    {
        "id": "1lr44r2",
        "author": "Retarded_Me_",
        "title": "The successor for the number 10",
        "content": "As by the title, we all know that Luka's parting from us will leave the number 10 free, now then, I wanted to give my opinion on the options and ask y'all about your own personal preference.\n\nMbappe. Obviously Mbappe wears the 10 at the french national team, and obviously it fits him, from my point of view the one most likely to receive the number. Tho I do think that I'd eventually Vini will decide to leave us, Mbappe deserves the 7 too. \n\nArda. Arda is obviously the successor of Luka on the pitch, he's an incredible midfielder and obviously one of our biggest talents in this moment. He did wear the 10 at Fenerbache, taking it after Özil left them, and delivered. I quite doubt the board will give him the 10, as Mbappe probably is the more profitable choice, but Arda would be my personal decision.\n\nBellingham. I put Jude here just for the sake of it, but we clearly know his idol is Zizou, so the 5 is perfect for him, I just had to put him.\n\nMastantuno. Our new signing, I obviously doubt he'd get the 10, perhaps eventually, but not yet, tho, I must say, it would definitely be a big statement from the club, as obviously it would create a \"rivalry\" between him and Lamine, and obviously because the other Argentinan left footed prodigy that arrived to Spain a few years ago wore the 10 at Barça, but yeah, I doubt the board would do that,  I feel that Mastantuno will get the 17 after Lucas leaves.\n\nAnyway, so I hope you enjoyed my post, tell me who y'all think deserves the number 10, Hala Madrid. ",
        "upvotes": 27,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lr44r2/the_successor_for_the_number_10/"
    },
    {
        "id": "1lqmipo",
        "author": "OnePlateIdly",
        "title": "Comunicado Oficial: fallecimiento de Diogo Jota y de su hermano André Silva",
        "content": "",
        "upvotes": 293,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqmipo/comunicado_oficial_fallecimiento_de_diogo_jota_y/"
    },
    {
        "id": "1lqqagc",
        "author": "Vila-real",
        "title": "[OC] [Cristian Salvador] Rodrygo and Real Madrid: On Leaving What You Once Loved",
        "content": "When someone celebrates their birthday in Brazil, it is tradition to give the very first slice of cake to the person you love most. There many other traditions: pull their ears as many times as years he or she is turningalong with other songs and games; but the cake ritual is arguably the most important, and original, of all Brazilian birthday traditions. \n\nIn January 2011, at one of the many houses in the industrial and densely populated city of Osasco, in São Paulo, there was once a birthday party; a boy was turning ten. \n\nIf it had been appropriate, he would have probably, and happily, given the first slice of cake to a football club. More specifically, to Real Madrid.\n\nThe theme of the party was, after all, quite literally, “Rodrygo Real Madrid.”\n\nBrazilian winger Rodrygo has loved Real Madrid as long as he can remember. He hit all the marks of a kid infatuated with a soccer team.\n\nDreams of playing for said club, and an unshakeable drive to fulfill said dream–check. \n\nClub's jersey always on–check. \n\nWhen he became a professional soccer player, he delayed the final signature that would have had him join a European club just a tad longer, and that week, scored a hat-trick in nine minutes, in the hopes Los Blancos would make a call. \n\nDouble check.\n\nThe call happened, too.\n\nIn 2021, he declared his love for Real, anecdotes above included, in a letter at [The Players’ Tribune](https://www.theplayerstribune.com/posts/rodrygo-brazil-real-madrid-la-liga-soccer-world-cup). His dream had come true, he wrote. “I’m going to play for Real Madrid.”\n\nRodrygo happily speaks of how his affirmation came true. “Words have power. I’m living proof.” He spoke of his beginnings, the drive to get to the Madrid no matter what, and along with his father, how they had managed to achieved the impossible. \n\nAt one point, it all was in the air: a “Big European club” was interested; things were about to be put pen to paper. His father Eric told him to just \"wait a bit more\". Rodrygo did and tried, hard, to make one last statement. That weekend, he scored three goals  in nine minutes with Santos in a league win against Vitoria (5-2).\n\nPublications like Marca picked up the story, speaking about “[Barcelona target Rodrygo](https://www.marca.com/en/football/barcelona/2018/06/04/5b14fd58e5fdea002c8b461c.html)” and praising the phenomenal performance of “The new Neymar.” \n\nBy the end of the match, Real Madrid had called Eric, and had asked him if Rodrygo would be interested in joining the biggest club in the world–with Zinedine Zidane as manager. \n\nhttps://preview.redd.it/w2mcs71p0oaf1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=4f5a6e135cc81e51866b934472805e72cd4b8dfb\n\nThe answer, and the rest of it, is well known. The arrival, and after barely playing a handful of matches with the B team, the ramp-up to the first team. The trident with Karim Benzema and Vinicius Jr.\n\nTwo goals in two minutes--including that header, and the mayhem which ensued, against Manchester City in the Champions League semifinals.\n\nNow, over 250 matches with Real Madrid and two Champions League trophies, three Ligas and a Spanish Cup, and 33 matches with Brazil later, Rodrygo may be about to make what, to someone who had a Real Madrid-themed birthday at age ten, would be a devastating decision: leaving Real Madrid. Leave to grow; to develop. Leave to be in the World Cup next year under Ancelotti’s orders. \n\nThe numbers don’t lie: Rodrygo has just signed his worst goal-and-assists record since he became a starter for Real Madrid four years ago: 25 goals and assists in 53 matches. At any other club, this output could be seen as the result of a *robust* season.\n\nNot at Real Madrid. And not for Rodrygo, who at age 24, is expected to progressively grow in performance year after year. Especially with who is around him at club and national team level.\n\nRodrygo grew up under the shadow of two of the best attacking players of the past 10 years in the sport; Vinicius Jr., and Karim Benzema. Vinicius Jr. attracted so much attention–-and heat–that Rodrygo was allowed to grow at his own pace. \n\nThe lack of spotlight seemed to help. Although never a *constant* performer, Rodrygo has been crucial in key parts of the season for his club, especially in the Champions League, where he found the net 25 times in 64 matches–eight of those goals coming in quarterfinals or farther along. For contrast, he has played two and a half times as many La Liga matches (172) and only scored seven more goals (32).\n\nIt is no secret that Rodrygo is, much like Gareth Bale--another versatile player made right winger--a player who tends to show up in big matches. \n\nIt is also no secret that over the past six months, Rodrygo has been close to nonexistent for both the team, the scoresheet, and Ancelotti. The Brazilian winger has tallied one goal and four assists since February (counting the Club World Cup’s assist against Al-Hilal), and was subbed off at half time in the Spanish Cup against Barcelona, with the score 1-0 up for the Catalanes. \n\nThat was it for Rodrygo, who missed all five matches in May in La Liga, with Real playing for the trophy. He wasn’t in the list against Celta, with the club arguing the player had a fever. Ancelotti brushed off the questions in the press conference with a mysterious “[When a player isn’t well, they’re not well emotionally](https://sports.yahoo.com/article/carlo-ancelotti-explains-rodrygo-goes-130800669.html)” which left fans and casuals more confused, if anything. For the last four matches of the domestic competition, Rodrygo did not feature at all, including the [4-3 loss](https://www.espn.com/soccer/match/_/gameId/705002/real-madrid-barcelona) to Barcelona.\n\nIn the Club World Cup, Rodrygo featured in the first match against Al-Hilal. Even though he contributed to his team with an assist in the 1-1 tie, he was back on the bench after 64 minutes. In the third match of the group stages, he barely played 24 minutes. Fans and press both expect him not to be of relevance throughout the rest of the tournament.\n\nJust before the first match of the newly formatted competition, Real Madrid manager Xabi Alonso was equally [mysterious](https://www.cope.es/programas/tiempo-de-juego/noticias/rueda-prensa-xabi-alonso-real-madrid-17-20250617_3171419.html): “I know what happened with Rodrygo. I can’t tell all of it; he did not go with Brazil to reset his head. We have spoken, we have shared things with one another, and now we are going to put things into action.”\n\nThe Club World Cup is the end of a season which started with Mbappe as the new superstar, Vinicius Jr. continuing to take his preferred spot on the left, and rising talents like Arda Guler, Ibrahim Diaz and even Barcelona-born youth product Victor Munoz, pushing for a place in the starting eleven.\n\nThe list goes on, as Argentinean talent Franco Mastantuono, currently on vacation post-River Plate elimination in the same competition, will be joining Real’s preseason in July. \n\nThe problems pile up for the Brazilian. In the horizon, Xabi Alonso enters the scene, fresh off a  heroic German stint, and aiming to finally revolutionize the way in which Real Madrid plays, combines, and jumps at the opposition. \n\nhttps://preview.redd.it/30i1x54o0oaf1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=fa3ad242089207f8b1794759f22c0492663ddf19\n\nWhat Xabi may see in Rodrygo is not necessarily what Rodrygo may want him to see. The left winger, even playing out of position on the right, has an innate ability to find the best place to be for a pass which turns into a dangerous opportunity. He has a decent finish (even though he shoots–a lot, regularly in the Top 5 of La Liga on attempts), and is arguably more efficient than his teammates at bringing the ball from the midfield, and into the box. \n\nOverall, Rodrygo may be *more resourceful and balanced* than a player like Vinicius Jr., but he is less regularly impactful than many other players in the team, Vini included. To Xabi, Rodrygo may be a great number 13 player. \n\nThe problem is, Rodrygo has left that notion behind. Or at least he is trying to. \n\nIt is a fact that Rodrygo could be the best player he can be playing on the left, a position he had featured in since joining Santos at a very young age. That conversation however, with Vini and Mbappe on the team, is a nonstarter. The message from Anceliotti has also been clear: the Brazilian has played five times as many matches on the right, or up front, than in his natural position (43 vs 216). \n\nIt could also be argued that an attacking player with the two aforementioned players next to him would find less opportunities to score himself. That is one of the main obstacles Rodrygo has found; the inability to slap his own name on the corner flag and lift it as one of the top players at Real Madrid. \n\nThe team seemt to be aware of the situation, too. Jude Bellingham’s [comment ](https://en.as.com/soccer/bellinghams-message-to-rodrygo-only-the-fools-forget-the-r-n/)on social media earlier in the season points at a clear divide between the recognition Rodrygo gets, and what he deserves; a \"Only the fools forget the R\" comment from a colleague for the world to see speaks to a need to counterpoint the public perception of his performance. \n\nAs it is often the case in these kinds of situations, over the past several months, rumors have florished--of all kinds. Amongst them, on Rodrygo’s [mental health](https://as.com/futbol/videos/la-situacion-de-rodrygo-en-el-real-madrid-ni-problemas-de-salud-mental-ni-quiere-irse-v/) and whether he is able to feel at peace with his role in the team. And naturally, transfer rumors, more famously from Saudi Arabia and as of late from North London in England, where Arsenal are reportedly interested. Rodrygo speaks to how happy he is in Madrid, and mentions leaving the rest to his agent–his father.\n\nRegardless of how this all ends, his father probably does know better than anyone the needs of Rodrygo, who is now halfway through his 20s, and slowly but surely entering his prime. The roadmap seems clear: the kid who would walk around the streets of São Paulo with a Neymar mohawk and a Real Madrid jersey will need a club that will appreciate him, and beyond wages, understand he is, and can be, number one on the starting lineup.\n\nThat club will also have to play in Europe, as Rodrygo shines most when the continental floodlights are on; and ideally, it will have a few players he has a connection with, so important with Brazilian players moving to a new country. This was the case for Rodrygo with Real Madrid left-back Marcelo, who for him was “[like a dad](https://www.theplayerstribune.com/posts/rodrygo-brazil-real-madrid-la-liga-soccer-world-cup)”.\n\nAt Mikel Arteta’s club, centre back Gabriel Magalhaes, striker Gabriel Jesus and winger Gabriel Martinelli would prove a great foundation for Rodrygo to ease into in a hypothetical new life in London. Martin Ødegaard also knows him from his Real Madrid stint, back during COVID days. \n\nhttps://preview.redd.it/he45fl6n0oaf1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=47f4dd71b4bf25fd9a7a4f50b2c06e05d7c2367b\n\nAs the current Arsenal squad stands, Martinelli, an established feature on the left for the Gunners, would have to compete for the position with Rodrygo. However, the hypothetical exchange could prove to be a step up for Arsenal in performance, as the Arsenal winger has rendered 16 goals and assists in 3,564 minutes across all competitions this season and Rodrygo has managed 25 goals and assists in 3,448 minutes. Nine more goals and assists in 120 less minutes.\n\nIt is worth noting though, that Rodrygo has managed these numbers while playing on the right, but he is a natural left winger. The potential impact of Rodrygo, in his prime, in his preferred position, and encouraged to play there by his manager is something the player is surely keen to tap into.\n\nIn the meantime and as the situation evolves, Rodrygo features in a Powerade [ad ](https://www.youtube.com/watch?v=12N3lUYclM8&amp;ab_channel=Powerade)about mental health called \"My First Love\"; one where he speaks to his frst love being “Futsal” (indoor soccer), which he considers to be where his mind “Got quicker”, and a sport he considers the “Storm” which turned him into “lightning.”\n\nIn the topic of mental health, Rodrygo, like thousands of athletes demanded to perform no matter what they are going through personally, finds himself in a situation where it really isn’t option to speak to whether there is, or isn’t, any issues he is going through. Not without that inevitably turning into a conversation about whether he should continue to play for the giant stage Real Madrid is.\n\nIn the topic of love, and for the sake of the player, his club, his national team–Ancelotti’s future included–and the millions watching, It may very well be time for Rodrygo to make a change, give the slice of cake to someone else, and perhaps make a decision--one that may very well take him away from the club he has loved his entire life. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*No AI-generated or AI-supported content was used in this piece.*",
        "upvotes": 147,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9uo1dGe7xJDdMzynEdaBLtdulz-HuAQbGTQb8Q2kY-I.jpeg?auto=webp&amp;s=1c465446947bc72295e7b54e4d69e811e106ad49"
        },
        "permalink": "/r/realmadrid/comments/1lqqagc/oc_cristian_salvador_rodrygo_and_real_madrid_on/"
    },
    {
        "id": "1lr3hzm",
        "author": "Mazen_Madrid",
        "title": "Any events or pre game festivities in NY/NJ Saturday?",
        "content": "Hey, hitting the game vs Borussia Dortmund this upcoming Saturday. Will be my first ever long over due Madrid game and I would like to do it properly. Anyone know of any events or festivities at a Real Madrid bar in NY or NJ? I tried to search online but I could not find anything although I may not be searching in the best spot. Anything helps, happy to help organize something too! ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lr3hzm/any_events_or_pre_game_festivities_in_nynj/"
    },
    {
        "id": "1lpzzdb",
        "author": "Luffy710j",
        "title": "There are rumors that Jobe Bellingham is actually Jude Bellingham, and he's playing for two different clubs. He got two yellow cards just so he wouldn't have to play against himself and get exposed.",
        "content": "The fact that he chose to play for us over them man our goat 🐐 ",
        "upvotes": 3262,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/irai6bo0jhaf1.jpeg?auto=webp&amp;s=6d616c6b9f4ac2e6fd241e000fc7583d728fe44c"
        },
        "permalink": "/r/realmadrid/comments/1lpzzdb/there_are_rumors_that_jobe_bellingham_is_actually/"
    },
    {
        "id": "1lq9lr1",
        "author": "King_Sam-_-",
        "title": "Even during their official kit launch promotion they can't stop talking about us.",
        "content": "\"Barcelona has no dream, but an obsession: Real Madrid.\"",
        "upvotes": 755,
        "comments": 220,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iqaz9uwvgjaf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lq9lr1/even_during_their_official_kit_launch_promotion/"
    },
    {
        "id": "1lqvonr",
        "author": "ManuMora98",
        "title": "[Basket - Official] Sergio Scariolo is appointed as new coach",
        "content": "Real Madrid CF announces that Sergio Scariolo will be the coach of our basketball team for the next three seasons, until June 30, 2028.\n\nSergio Scariolo will lead Real Madrid after the participation of the Spanish basketball team in the Eurobasket in Cyprus, Finland, Poland and Latvia.\n\nSergio Scariolo, one of the most prestigious coaches in world basketball, arrives at Real Madrid after a brilliant career leading the Spanish team, where he has become the most successful coach in its history, with a total of eight medals: 5 gold (World Cup 2019, Eurobasket 2009, Eurobasket 2011, Eurobasket 2015 and Eurobasket 2022), 1 silver (London 2012 Olympic Games) and 2 bronze (Rio 2016 Olympic Games and Eurobasket 2017).\n\nNBA champion as an assistant coach with the Toronto Raptors in the 2018-19 season, he has 8 titles in his European record at the club level: 2 ACB Leagues, one of them with Real Madrid (1999-2000) and another with Unicaja; 1 Italian League with Scavolini; 2 Copas del Rey in Spain, one with Tau Cerámica and another with Unicaja; and 1 Eurocup and 2 Italian Super Cups with Virtus Bologna.",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqvonr/basket_official_sergio_scariolo_is_appointed_as/"
    },
    {
        "id": "1lqmik9",
        "author": "Friendly_Direction34",
        "title": "Valverde has played 70 matches this season",
        "content": "63 games for Real Madrid and 7 for Uruguay.\n\nLaliga - 36 matches. 3034 minutes\n\nChampions League - 14 matches. 1237 minutes\n\nCopa del Rey - 5 matches. 416 minutes\n\nClub World Cup - 4 matches. 344 minutes\n\nSupercopa - 2 matches. 165 minutes\n\nUEFA Super Cup - 1 match. 90 minutes\n\nIntercontinental Cup - 1 match. 90 minutes\n\n2026 WC Qualifying - 7 matches. 567 minutes\n\nTotal - 70 matches. 5943 minutes ",
        "upvotes": 74,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqmik9/valverde_has_played_70_matches_this_season/"
    },
    {
        "id": "1lqkexg",
        "author": "Ghost-Ripper",
        "title": "Our Boys charging on forward and getting ready",
        "content": "",
        "upvotes": 100,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w0rn5i1pemaf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lqkexg/our_boys_charging_on_forward_and_getting_ready/"
    },
    {
        "id": "1lqwasr",
        "author": "meredimaxim",
        "title": "Tips on how to get Modrić or Mbappé’s autograph at the Real Madrid vs Dortmund game?",
        "content": "Hi everyone,\n\nI’m a longtime Real Madrid fan—started supporting the club back in middle school around 2012, but I’ve only ever watched games on TV. Now I’m an international student at Cornell University, and I finally have the chance to attend my first Real Madrid match in person this Saturday against Dortmund.\n\nOver the years, I witnessed the primes of legends like Cristiano Ronaldo, Benzema, Bale… but one by one, they all left. Now Modrić is the only one from that golden era still standing—and it looks like he might be leaving soon to Milan too. I also just graduated this year, so this feels like a meaningful crossroads for me.\n\nIt would mean the world to me if I could get an autograph from Modrić or Mbappé. Any tips on how to make that happen? Best time, place, or strategies? I’d really appreciate any advice from fellow Madridistas!\n\nHala Madrid 💜\n",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqwasr/tips_on_how_to_get_modrić_or_mbappés_autograph_at/"
    },
    {
        "id": "1lqufas",
        "author": "ManuMora98",
        "title": "[Basket - Official] Coach Chus Mateo leaves Real Madrid",
        "content": "Real Madrid CF and Chus Mateo have agreed to end his time as coach of Real Madrid basketball.\n\nReal Madrid thanks Chus Mateo for his work and commitment during the three seasons in which he has led our team, in which he has won 6 titles: 1 European Cup, 2 Leagues, 1 Copa de Rey and 2 Spanish Super Cups. In addition, he was chosen as the best coach of the year in the 2023-2024 Euroleague.\n\nChus Mateo has always represented the values of our club in an exemplary way. Real Madrid wishes him and his family all the best in this new stage of his life.",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqufas/basket_official_coach_chus_mateo_leaves_real/"
    },
    {
        "id": "1lpycj9",
        "author": "megamimo1991",
        "title": "Madridistas watching tactical gameplay after years..",
        "content": "",
        "upvotes": 1819,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wq5mx6tl8haf1.jpeg?auto=webp&amp;s=0685bbe3ca44ef2d8237ad5df0c980d3f2028b03"
        },
        "permalink": "/r/realmadrid/comments/1lpycj9/madridistas_watching_tactical_gameplay_after_years/"
    },
    {
        "id": "1lqmjz0",
        "author": "bluefoxlive",
        "title": "65 years ago today in 1960 - Peñarol hosted Real Madrid in Montevideo for the inaugural edition of the Intercontinental Cup (0-0), the first officially recognized club world title match",
        "content": "Where it all began, the predecessor to the current Club World Cup.  \n  \n**Source:** In 2007 FIFA officially decreed that all Intercontinental Cup winners from 1960-2004 would be recognized as club world champions:   \n[https://www.thescore.com/news/1408193-fifa-recognises-all-winners-of-intercontinental-cup-as-club-world-champions](https://www.thescore.com/news/1408193-fifa-recognises-all-winners-of-intercontinental-cup-as-club-world-champions)",
        "upvotes": 43,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1vqys8ni3naf1.jpeg?auto=webp&amp;s=a31bf16ed2765f145a2912b9302bcdeb6021f0cd"
        },
        "permalink": "/r/realmadrid/comments/1lqmjz0/65_years_ago_today_in_1960_peñarol_hosted_real/"
    },
    {
        "id": "1lpvryz",
        "author": "Optimal_Lie7824",
        "title": "Arda and Fran balling under Xabi's new system, love it!",
        "content": "Nutmeg galore!",
        "upvotes": 1726,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uvwzr88lpgaf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lpvryz/arda_and_fran_balling_under_xabis_new_system_love/"
    },
    {
        "id": "1lpqv77",
        "author": "gethalaljada",
        "title": "Xabi, what are you feeding him?",
        "content": "",
        "upvotes": 3933,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x2ij89fhdfaf1.jpeg?auto=webp&amp;s=cbf7141f5d5385b80f01bd6e3b29feea5d7add65"
        },
        "permalink": "/r/realmadrid/comments/1lpqv77/xabi_what_are_you_feeding_him/"
    },
    {
        "id": "1lq02jp",
        "author": "TheLastR0N1N",
        "title": "Fran under Xabi Alonso",
        "content": "",
        "upvotes": 923,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ey40r55hkhaf1.jpeg?auto=webp&amp;s=afab3e02086ed4c6c34a1e4c69ceffe154726ce7"
        },
        "permalink": "/r/realmadrid/comments/1lq02jp/fran_under_xabi_alonso/"
    },
    {
        "id": "1lqtniv",
        "author": "Galactic_Ryder",
        "title": "New Organizational Chart of Real Madrid Basketball",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F7Dz9H0Jrv7Gi-iXF6c1CcQHUZbzUCfXagSHPxr4Xjc.jpg?auto=webp&amp;s=028e372f7d0e40d959e0443c604e13f20a0243ba"
        },
        "permalink": "/r/realmadrid/comments/1lqtniv/new_organizational_chart_of_real_madrid_basketball/"
    },
    {
        "id": "1lqa7hh",
        "author": "Spiritual-Fly5890",
        "title": "What’s going on with Rodrygo?",
        "content": "Went from a non negotiable starter under Ancelotti to not even a single minute now? Surely something is going behind the scenes. What does everyone think? If he’s leaving, where to? Damn this 300 character limit is hard to hit. Word word word word word word word word word word word word word word word word word word word word. ",
        "upvotes": 256,
        "comments": 130,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqa7hh/whats_going_on_with_rodrygo/"
    },
    {
        "id": "1lqa7xz",
        "author": "Enough-Possibility59",
        "title": "Thank you Fede and Raul Junior for making this game special !HALA Madrid !!",
        "content": "",
        "upvotes": 237,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6qm4usdxljaf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lqa7xz/thank_you_fede_and_raul_junior_for_making_this/"
    },
    {
        "id": "1lqjedg",
        "author": "Significant_Part_656",
        "title": "Should Madrid let go of rodrygo this summer ?",
        "content": "From what is reported , 80 million to 90 million euros sum will be needed to get rodrygo out of Madrid but this was few weeks ago ,cause dispite everything  he still would be the best winger available in market this summer but I hope we fetch as much money as possible. In my opinion a 85 million + 10 million would be a good deal , guessing clubs like arsenal and bayern are after him and bayern specially has a lot of money from writz failed transfer . What will be the best decision going forward, if it's to sell how much money the club so ask for ?",
        "upvotes": 40,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lqjedg/should_madrid_let_go_of_rodrygo_this_summer/"
    },
    {
        "id": "1lpurin",
        "author": "AestheticEvan23",
        "title": "Trent on ig under Dean Huijsen post",
        "content": "",
        "upvotes": 1189,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g76na3wjhgaf1.jpeg?auto=webp&amp;s=8c0773b5b0c8f99d3fe551554d2fcc0edb6e56fe"
        },
        "permalink": "/r/realmadrid/comments/1lpurin/trent_on_ig_under_dean_huijsen_post/"
    }
]