[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1on4nrc",
        "author": "moodyhippy",
        "title": "i watched Idiocracy for the first time today",
        "content": "after my coworker saw me pour electrolytes in my water and she quoted a line from the movie that i had no idea what she was talking about haha. i enjoyed it, i laughed a lot. kinda wild how on point it is - the ads everywhere, the stupidity, the love of violence. big yikes. ",
        "upvotes": 1567,
        "comments": 225,
        "media": null,
        "permalink": "/r/netflix/comments/1on4nrc/i_watched_idiocracy_for_the_first_time_today/"
    },
    {
        "id": "1oobnhv",
        "author": "Crowned_Toaster",
        "title": "Recommend your best dystopian movies.",
        "content": "I would like movies like Never Let Me Go, Paradise, or In Time. Any movie is generally fine as long as it's non-horror and no dogs die in said movies (we recently lost our dog).",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oobnhv/recommend_your_best_dystopian_movies/"
    },
    {
        "id": "1onmrka",
        "author": "rossfororder",
        "title": "Wayward",
        "content": "The show is initially a thriller about a bunch of kids in a school prison but it's so much more. I loved this show, one of the best I've seen in a long while.\n\nToni Collette as a cult leader is impossibly good. Created and starring Mae Martin.",
        "upvotes": 56,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1onmrka/wayward/"
    },
    {
        "id": "1oobl1n",
        "author": "Hackedbytotalripoff",
        "title": "Got hooked to the show \"Sinner\"",
        "content": "I have started watching the first season of Sinner. Oh boy,  I got hooked right away.   I was so intrigued by the storyline, the slow pace that provided background for each of the characters, and the acting.   It is a fantastic show, and it is going to keep me busy. Binge-watching it for a while.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oobl1n/got_hooked_to_the_show_sinner/"
    },
    {
        "id": "1oo0zzb",
        "author": "MusicSavesSouls",
        "title": "El Dorado : Everything the Nazis Hate",
        "content": "Has anyone seen this? It looks like it came out a few years ago, but it is so educational and amazing to watch. This happened almost a 100 years ago, and it is also going on today. The same bullsh\\*t and this was almost 100 years ago!! It makes me wish we would all evolve as humans and live peacefully together. If you hate someone, who is not bothering you or does nothing to affect your life in any way, you have a problem. I really enjoyed this film. Old archives from the Nazi days and a different subject than most Nazi movies. It is wild. I knew Nazis didn't like gay or trans people, but I didn't know to what extent they didn't like them. Now, trans are the enemy, again. Without getting too political, it really looks like we are repeating everything that happened in 1933.\n\nEdited to add: A chilling quote from Hitler, in this documentary. \"Homosexuality has to be combated at all costs, otherwise it will be the end of Germany, the end of the Germanic world.\"\n\nCan't we all learn from history?\n\nIf you want a thought-provoking film, I recommend this one!\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oo0zzb/el_dorado_everything_the_nazis_hate/"
    },
    {
        "id": "1ontlmr",
        "author": "Cooper_Inc",
        "title": "Almost finished Shameless US and looking for another series, ideally drama to binge next on Netflix. Some ideal criteria below",
        "content": "* Preferably 5+ seasons\n* Eps \\~45mins long\n* Drama ideally, but not into period dramas\n* Others I've loved are Mad Men, House of Cards, Luther\n* Edit to add also loved Animal Kingdom \n\nAny suggestions on what I can have lined up next?",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ontlmr/almost_finished_shameless_us_and_looking_for/"
    },
    {
        "id": "1onvccl",
        "author": "AnotherDarnDay",
        "title": "Merry Gentlemen",
        "content": "Yeah, I'm late to talking about this one, but I recently rewatched it... I dunno why but I get secondhand embarrassment from watching this movie, yet I kind of enjoy the gooey cheesy aspect of it. \n\nI was never big into Chad Michael Murray. I didn't watch one tree hill, I knew him as Tristen on Gilmore Girls but never liked him or his characters. But I'm finding I like him in the Hallmark type movies on GAF and of course Netflix movies. Maybe because I'm older I appreciate the bad acting on crappy made for TV movies.\n\nThis is probably one of the strangest movies for Netflix holidays... next to hot frosty.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onvccl/merry_gentlemen/"
    },
    {
        "id": "1oo47aq",
        "author": "ThEmOvIeGuY0069",
        "title": "Back to future",
        "content": "I really like the movie.. it’s a classic in my opinion, like a top 10 holidays film. BUT, hear me out.. is it really so good to get a 8.5 imdb. Just for comparison another classic Jurassic Park the original has a 8.2 imdb. It has a greater imdb score than freaking Dark Knight Rises, Revenant, The Wolf of Wall Street. I don’t think this score is justified.. thoughts??",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oo47aq/back_to_future/"
    },
    {
        "id": "1on93iz",
        "author": "missuniversearth",
        "title": "The Mother (2023) Netflix sad ending",
        "content": "Spoiler Ahead ⚠️\n\nJ Lo's character is so sad at the end and no matter what the haters say, her acting at the end and the makers really set that scene. Especially, with Kate Bush's song, there could have been no other better scene to compliment her song.\n\nSo fed up of this culture of adoptive parents being jerks. The adoptive mom is definitely one and it seems like she made J Lo keep her promise as she is very nonchalant and uninviting in that scene. Plus, in the reunion scene before when she and J Lo meet eyes and she is not even looking at her in spite of looking straight into her face. J Lo, on the other hand, nods while she proceeds to ignore her and hold their daughter tighter, especially when J Lo is pulling off, not giving a chance for the daughter to turn around and watch her leave.\n\nWhat are your thoughts? Would J Lo only observe her daughter and would they communicate only from a distance like in that scene?",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1on93iz/the_mother_2023_netflix_sad_ending/"
    },
    {
        "id": "1onx2q2",
        "author": "eggn00dles",
        "title": "Forced into 4k upgrade",
        "content": "Last couple of times I sign into Netflix, it tries to upgrade me to 4k. I decline.\n\nNow, it would not let me decline. I had to do the FREE upgrade to 4k.\n\nOf course what this actually does is change your membership to Premium, and you need to manually change it back.\n\nPretty sketchy move imo.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onx2q2/forced_into_4k_upgrade/"
    },
    {
        "id": "1onc23q",
        "author": "Sufficient-Curve2951",
        "title": "The Asset",
        "content": "Mystery lovers, is the recent Danish series worth watching?? I find the premise quite interesting and the fact that it does not kick start with a murder is exciting too!! But is it worth the time? This article has listed some solid points and I might tune in\n\n  \n[https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist](https://www.soapcentral.com/shows/5-reasons-netflix-s-the-asset-watchlist)",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1onc23q/the_asset/"
    },
    {
        "id": "1onpoi5",
        "author": "Glittering_duck7004",
        "title": "NW-4-8 ERROR (AUSTRALIA)",
        "content": "My 6/7 yo main tv with netflix installed as standard (can't un-install) has thrown this error message\nWe have factory reset the tv, wifi network\nOur 2nd tv connects with no issue as does our phones and all other streaming services work on the main tv\nNetflix were of no help,  I fear the tv is now too old to support the requirements \nCan anyone shed some light?\nTa!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onpoi5/nw48_error_australia/"
    },
    {
        "id": "1onon1o",
        "author": "Significant-Force671",
        "title": "Just finished ‘Mo’",
        "content": "The show has so many great characters and truly left me feeling appreciative for the exposure it gave me to Palestinian culture, but the character Mo himself became unwatchable in S2.\n\nMo only gets the wins he doesn’t deserve. It’s hard enough to sympathize with a character who suffers from problems they caused themselves, but it’s even harder when the character does basically nothing to redeem themselves before picking up a life changing win. The whole subplot of his relationship with Maria revolved around him being a terrible partner - always lying, always selfish, and only supportive until his own pride ruins whatever Maria had going on. And in the end, all it took was for him rage quit, blame her for all his misfortune, then walk back into a store and tell her “it’s okay” for all of his problems to be solved? Gimme a break.\n\nOn the flip side, every time he displays an ounce of character development and is on the cusp of getting a win he actually does deserve, he ruins it for himself by saying/doing something so unreasonable that it’s borderline insulting to the viewer. It made it impossible to root for the guy by the end of S2. \n\nFor the record, this isn’t something that bothers me in other shows where I the main protagonist is supposed to be dumb, pathetic, or simply a bad person. In the end, I just don’t think Mo himself was funny enough for me to excuse all of his character flaws. It was basically just Eastbound &amp; Down (one of my favorite shows btw) but without the main character being funny enough for me to be happy when he “redeems” himself. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onon1o/just_finished_mo/"
    },
    {
        "id": "1onojzw",
        "author": "borbloom",
        "title": "Breathless season 2!!",
        "content": "What are your thoughts? For me it's way better than season one, even thought there is a felling of rush, like there is not enought episodes to talk about all the problems they want to develope, which it's a shame because the majority of them are quite interesting. Hope there is a third season!!!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onojzw/breathless_season_2/"
    },
    {
        "id": "1ont89d",
        "author": "louminous23",
        "title": "xioami 12t volume",
        "content": "how do i make it louder? im on max settings but the sound is low even on blueetooth headphones. i xnt find any settings and checking the subtitles doesn't change it. do ihave to buy high plans?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ont89d/xioami_12t_volume/"
    },
    {
        "id": "1ond6tv",
        "author": "Notyouravgtiramisu",
        "title": "Need some recommendations",
        "content": "Hey girls and guys but mostly girls\nI want to watch a movie or series revolving around fake dating or fake arrangements... Wattpad kind \nI am really bored and want to watch something with slow burn , romance , with hot leads \nPlease give me some suggestions ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ond6tv/need_some_recommendations/"
    },
    {
        "id": "1omwbw9",
        "author": "Repulsive_Knee9258",
        "title": "Controversial but I don’t see the issue with Liam hemsworth as the Witcher",
        "content": "I’m just your average watcher, i don’t make reviews and I watch Netflix here and there in my spare time after work and then get on with my life. So  I just started season 4 of the Witcher and found out Henry Cavill left and Liam hemsworth is now the Witcher and so far so. I’m enjoying the show. Great suspense, great magic and action scenes. It’s decent, it keeps you entertained which is all I’m looking for. But the reviews? The craziest hate load I’ve seen in a while to a cast change. I honestly don’t get the hate, but yeah that’s all im g onna say.",
        "upvotes": 46,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1omwbw9/controversial_but_i_dont_see_the_issue_with_liam/"
    },
    {
        "id": "1onmjxx",
        "author": "Puzzleheaded_Cap9596",
        "title": "Is the show Younger down?",
        "content": "I was watching it an hour ago, now when I go to search for it, it says 'we do not have Younger\" and suggests other shows I might like. Is it down? When I search online it still says Younger is up on Netflix as it was put up about 10 months ago. Seems short to keep it up on Netflix for only 10 months. Anybody know?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onmjxx/is_the_show_younger_down/"
    },
    {
        "id": "1omywhy",
        "author": "Rannrann123",
        "title": "Looking for good episodic shows",
        "content": "Hey guys, I'm a busy college student who doesn't really have the time to keep up with shows that require you to remember what happened in previous episodes. What are some good episodic shows that I can just watch an episode or two of whenever I find myself with some spare time? Thanks :)",
        "upvotes": 29,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1omywhy/looking_for_good_episodic_shows/"
    },
    {
        "id": "1on6g9t",
        "author": "HeyMay0324",
        "title": "Boots!",
        "content": "Omg, I loved this show! I cried at the end. My brother was in the USMC and it brought back memories of going to his graduation on Parris Island. I thought the acting from the drill instructors was spot on.\n\nDid anyone else watch it?",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1on6g9t/boots/"
    },
    {
        "id": "1onx3lc",
        "author": "Dense-Issue-4372",
        "title": "Excuse you?!",
        "content": "HIMYM IS LEAVING ON DECEMBER 2nd?! I always rewatch! Where can I rewatch now?! This is so sad! I don’t own a dvd player so please don’t recommend that!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1onx3lc/excuse_you/"
    },
    {
        "id": "1onj28b",
        "author": "PHK-FL",
        "title": "Christmas Suggestions That are NOT Movies",
        "content": "Any suggestions for Christmas Netflix shows that are not movies?  Documentaries, decorating, anything except sappy movies and fireplaces.  I could go to Hallmark for free if I wanted that.",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1onj28b/christmas_suggestions_that_are_not_movies/"
    },
    {
        "id": "1oni5pi",
        "author": "Hot_Pepper_Jam",
        "title": "Is There A Fictional Horror Movie Using Home Front Door Footage On Netflix?",
        "content": "Hello r/netflix!\n\nIs anyone aware of a fictional horror movie recently released and added (or to be added) to Netflix that is either partially or entirely shot through a doorbell camera of this kind? I remember reading an article about a horror movie that used a doorbell camera perspective for shooting scenes but I can't find the name of the movie or the article anymore. IIRC the movie was shown at a film festival but I don't think it got a large theatrical release.\n\nI am aware of the documentary that just released on Netflix, \"The Perfect Neighbor\", but this movie was described as wholly fictional. I would appreciate any titles anyone can share this description bring to mind. \n\nThanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oni5pi/is_there_a_fictional_horror_movie_using_home/"
    },
    {
        "id": "1omc7i6",
        "author": "does_anyone_know_wtf",
        "title": "Netflix asking me if I’m still there- stop it",
        "content": "Sometimes I’ll turn on a show and literally like 20 minutes into it, It’ll ask if I’m still there. Yes, I’m still here and probably will be until I turn the tv off. Wtf is this about and why? Please just let me watch tv in peace without having to continuously tell them. It does not deter me in the SLIGHTEST. I just like background noise. But on a little bit of a creepier note, I’ve noticed just lately that it has popped up right when I walk away from the TV as if it’s watching my movements. Anyone else?",
        "upvotes": 401,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1omc7i6/netflix_asking_me_if_im_still_there_stop_it/"
    },
    {
        "id": "1ondblb",
        "author": "5leepyewa",
        "title": "I have memories about a show or series from when I was younger but can't find anything that matches.",
        "content": "it was adult show on Netflix around 2012-2016 was the timeline my memory was set. I remember 2 scenes and don't know if they are from the same show or not. one scene contains a man (any facial details are out the window) who came up to a big-ish computer screen. it was from my memory an open and/or wide building. \n\nThe 2nd scene contains a man in a forest, rain most likely because he was wet. he was a white male who had long hair like a female and a beard (I think). I can't remember but I'm pretty sure there's blood involved somewhere given the fact I know this show had guns and knifes involved. \n\nThe show from the 2nd scene I know wasn't in English because subtitles and voice didn't match up.\n\nI came to see if anyone has seen or heard of a show(s) with similar details or a scene with similar details",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ondblb/i_have_memories_about_a_show_or_series_from_when/"
    },
    {
        "id": "1ond85w",
        "author": "cPa3k",
        "title": "There is a problem connecting to Netflix. Please try again later. Error",
        "content": "(ipad) I keep getting the “There is a problem connecting to Netflix. Please try again later.” “There is a problem connecting to Netflix. Please try again later.” errors and every time I open the app the “No internet connection” red banner at the top appears. \n\nI literally can do anything or even switch profiles. On my TV and my PS5 everything works fine and every other app on my ipad works normally. Last week I had the same problem and deleting the app and reinstalling worked but now the errors are back and deleting and reinstalling isn’t a a good solution if I have to do it every few days. Anyone know why this keeps happening or how I could fix it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ond85w/there_is_a_problem_connecting_to_netflix_please/"
    },
    {
        "id": "1onanps",
        "author": "Klara_wooly",
        "title": "Evil dead rise",
        "content": "Evil dead rise is not available for Netflix india? OR  is it available for Netflix advanced? How come once shown shows are automatically vanishing from the list? Was there any prior notification before deleting it from the list of movies? I think not..\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1onanps/evil_dead_rise/"
    },
    {
        "id": "1omidrk",
        "author": "Miljkomax",
        "title": "Why is Netflix always so dark?",
        "content": "Noticed this earlier this year when I subscribed and watched the SciFi series Dark. Now I'm watching Black Rabbit during the day and all I can see is just fucking dust on my TV. This is literally unwatchable. \n\nThe brightness, contrast and everything else is at it's highest.\nIs there anything I can do to fix this?",
        "upvotes": 59,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1omidrk/why_is_netflix_always_so_dark/"
    }
]