[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 67,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hgbyi3",
        "author": "LosFrikis",
        "title": "Hey /r/movies! We’re Tyler Nilson and Michael Schwartz, writers/directors of LOS FRIKIS and PEANUT BUTTER FALCON! LOS FRIKIS is out 12/20 in LA+NY and 12/25 in other cities. Ask us anything!\n",
        "content": "",
        "upvotes": 50,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lnz131ri6f7e1.jpeg?auto=webp&amp;s=541a37cc1e59700c3a5f184c5086fd7ec0c3ac6e"
        },
        "permalink": "/r/movies/comments/1hgbyi3/hey_rmovies_were_tyler_nilson_and_michael/"
    },
    {
        "id": "1hpaj6c",
        "author": "Gato1980",
        "title": "Robert De Niro’s $1 billion Wildflower Studios, the world’s first vertical film studio and production soundstage in Queens, NY, is complete and already operational",
        "content": "",
        "upvotes": 9003,
        "comments": 570,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j9xB8Zx68285-ZMPznMHYZaZMmeUm1Rx4nktVVzT4yk.jpg?auto=webp&amp;s=6223e2d00b85c9034c9075530826596f17a2aed4"
        },
        "permalink": "/r/movies/comments/1hpaj6c/robert_de_niros_1_billion_wildflower_studios_the/"
    },
    {
        "id": "1hp017o",
        "author": "MarvelsGrantMan136",
        "title": "‘Wicked’ Overtakes ‘Mamma Mia!’ To Become No. 1 Stage Musical Adaptation Ever Worldwide",
        "content": "",
        "upvotes": 4665,
        "comments": 368,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xTyd-JjP9SqSPbqD35DgO-zB6ZE3k4cTOy0muCs7_7E.jpg?auto=webp&amp;s=2b34f87749fcf44781623ae25cef3078090eb366"
        },
        "permalink": "/r/movies/comments/1hp017o/wicked_overtakes_mamma_mia_to_become_no_1_stage/"
    },
    {
        "id": "1hpdh9u",
        "author": "gearwest11",
        "title": "I never realize how many serious blows the major movie industry dealt with in the 2010’s ",
        "content": "From the death of the video rental stores (especially with Blockbuster), to the Sony Pictures hack, to the rise of streaming and the misguided push from the major  studios by creating their own or rebranding one, to the Harvey Weinstein scandal which leads to the #Metoo movement, and the big blow of it all was the Disney/Fox merger resulting one less major studio to make movies and less variety now.\n\nAnd honestly those factors feel like the reasons why this decade so far as far as mainstream movies goes has been less than stellar. \n\nIt's sad too because there was a time a studio would greenlight a quirky comedy like Zombieland or Hot Tub Time Machine or the Oscar bait but crowd pleasing drama like Argo or The Martian. Now those kinds of movies are so far in between and mostly become Netflix filler even if the film is good it's buried by a cluttered algorithm. \n\n\n\n",
        "upvotes": 433,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1hpdh9u/i_never_realize_how_many_serious_blows_the_major/"
    },
    {
        "id": "1hp805m",
        "author": "DonkeyOT65",
        "title": "The best \" Brit playing an American \" accent or vice versa? ",
        "content": "Was watching Bullet Train tonight, not the first time I've seen it, but Brian Tyree Henry was the most convincing American actor portrayal of an English accent I've ever encountered. \n\nI was convinced he was British, only to Google him and find he is American. Brilliant accent and portrayal. \n\nWho else has done such a convincing Anglo/American or American/Anglo mastery of the respective accents? ",
        "upvotes": 940,
        "comments": 1619,
        "media": null,
        "permalink": "/r/movies/comments/1hp805m/the_best_brit_playing_an_american_accent_or_vice/"
    },
    {
        "id": "1hphh03",
        "author": "Front_Sugar4784",
        "title": "The (Good Will Hunting) “will leaving Skylar scene” is so devastating to me",
        "content": "I watched the movie for the first time today, decided to give it a shot. Great movie. The part in the scene that truly got to me is where Skylar starts crying after will reveals his dad put cigarettes out on him when he was younger. It all goes down hill from there as will says he doesn’t love her and she breaks down. Something about the scene makes it stick out like a sore thumb. It’s incredible, acting is crazy good. \n\n\nhttps://youtu.be/e4hXrrc8fA8?si=WqNx3YCfEwLuNiJH\n",
        "upvotes": 76,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bOyxqI1KEzyX6QdtKbT9VrMM9EPBBfgwdXvldcsCmKA.jpg?auto=webp&amp;s=80d729440a237d92873090b6ac6ad56e4b89bf0d"
        },
        "permalink": "/r/movies/comments/1hphh03/the_good_will_hunting_will_leaving_skylar_scene/"
    },
    {
        "id": "1hp50pt",
        "author": "Youngs-Nationwide",
        "title": "Which titular character has the least significant role?",
        "content": "Which titular character **that actually appears in the movie** has the least prominent overall role?\n\nTo qualify, the character must be a particular individual who can be uniquely identified by the movie's title AND must make at least one physical appearance on screen. Imaginary or metaphorical entities don't count.\n\nThe prominence of the role could be judged as a function of screen time, plot relevance or interpreted more loosely by how important they are to the theme or message.",
        "upvotes": 371,
        "comments": 498,
        "media": null,
        "permalink": "/r/movies/comments/1hp50pt/which_titular_character_has_the_least_significant/"
    },
    {
        "id": "1hp88h7",
        "author": "1ThousandDollarBill",
        "title": "I didn’t know Threat Level Midnight was largely based off of an actual movie, Sudden Death. ",
        "content": "Sudden Death is a ridiculous movie. At no point can you take it even remotely seriously. \n\nEarly on, Van Damme has his probably toughest fight in the entire movie against a 110 pound model in a mascot costume. \n\nVan Damme then spends the rest of the movie trying to save his kids who got caught up in a plot to kill the vice president along with every one else in the stadium. \n\nHe’s dodging machine gun fire from bad guys throughout the entire film while a very important hockey game is going on. \n\nHowever, Van Damme does find a way to make it on to the ice as goalie to make a very important goal save in the third period. He then signs “I love you” to his son in the stands. \n\nAfter watching Sudden Death I feel like Threat Level Midnight may be a more sane movie than what this movie was. ",
        "upvotes": 201,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1hp88h7/i_didnt_know_threat_level_midnight_was_largely/"
    },
    {
        "id": "1hpdpcr",
        "author": "homecinemad",
        "title": "Strange Darling is awesome, Willa Fitzgerald is incredible ",
        "content": "I will say nothing about the films style, structure, tone. I went in blind and it was very rewarding. It was expertly made and I'm so glad the Miramax hacks' plans to take over the film failed. This movie rocks.\n\nOnto Willa. I only know her from Reacher. She was fantastic. So many moments where I thought, I've never seen that before! One scene in particular, where she's fighting exhaustion, she was doing so much with her face and body, conveying so many whirling feels and sensations...I'm in awe.\n\nI hope the director makes more shit. This film is a 10/10 for me.",
        "upvotes": 52,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1hpdpcr/strange_darling_is_awesome_willa_fitzgerald_is/"
    },
    {
        "id": "1hoo1me",
        "author": "JannTosh50",
        "title": "20 Years Later, Lemony Snicket and Director Brad Silberling Look Back on A Series of Unfortunate Events",
        "content": "",
        "upvotes": 3378,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bimzJ_LEjWXrrunkJBimWlHATHxoPRmByHhijhzD5U0.jpg?auto=webp&amp;s=c6747ca5525c00573d8fabbbd5a72474594c0ebc"
        },
        "permalink": "/r/movies/comments/1hoo1me/20_years_later_lemony_snicket_and_director_brad/"
    },
    {
        "id": "1hp3u0a",
        "author": "indiewire",
        "title": "The Best Vampire Movies of All Time: 'Dracula,' 'Martin,' and More",
        "content": "",
        "upvotes": 185,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mTb1M2ISMTvS97QUoeieK4PM0PfyLtQ70ZlTV5j8E1o.jpg?auto=webp&amp;s=a8fce36f31920053bf3f08b9cec928c51bfd591c"
        },
        "permalink": "/r/movies/comments/1hp3u0a/the_best_vampire_movies_of_all_time_dracula/"
    },
    {
        "id": "1howd97",
        "author": "Mst3Kgf",
        "title": "It's easy to overlook given it's in a fun family-friendly animated comedy, but Hal/Titan in \"Megamind\" is actually a pretty scary concept for a supervillain.",
        "content": "Much like Syndrome in \"The Incredibles\", this character should easily work in a \"serious\" live-action superhero movie. And while Hal/Titan isn't portrayed as dangerous/evil as Syndrome is (he never tries to kidnap or kill children, at least not on camera), he's still a very disturbing concept, as in \"What if an incel type got superpowers?\" His behavior towards Roxanne was creepy from the start (the guy has a cutout of her over his bed with \"GOOD NIGHT HAL\" added to it, yikes), but once he gets superpowers, it just gets to another level. Especially once she gently turns him down, because then his sense of entitlement and rage at rejection causes him to go to some very dark places.\n\nThe sequence where he shows off his powers by taking her flying especially shows this off. The scene is of course a parody of the classic Superman and Lois flight sequence in the original film, but in that, Superman invites Lois to fly and after she accepts, he gently and gracefully takes her on the flight while always being mindful of her safety. Hal/Titan just grab Roxanne against her will and takes her flying around while constantly putting her in danger so he can \"save\" her. Because while Superman genuinely cares for and respects Lois as a person, to Hal/Titan, Roxanne is just an object he's owed. And once he doesn't get his prize, like a classic example of an incel, he can't fathom it (he's a nice guy AND he has powers now!) and he turns violent. You can also justifiably see how terrified Roxanne is of him on that scene alone; if he almost killed her trying to \"save\" her, she knows how much damage he could do if he was intentional about it.\n\n\"Megamind\" as a whole is an unexpectedly more complex and well-made film than many might expect (I can see why its reputation and popularity have grown in recent years), but having a genuinely unsettling villain concept is one of its best features. If Syndrome personifies toxic fanboy culture, Hal/Titan is the worst case scenario of the guy who won't take \"no\" for an answer.",
        "upvotes": 510,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1howd97/its_easy_to_overlook_given_its_in_a_fun/"
    },
    {
        "id": "1hozgds",
        "author": "Flat_Living_7415",
        "title": "Favorite Visually Stunning Films",
        "content": "Just finished watching Interstellar.  I’m not sure why it took me so long to get to it, but I really liked it.  Acting and story were great and the science aspect seemed pretty well thought out.  (I’m no scientist…)  It was, in parts, visually amazing.  What movies really took your breath away visually?  What are some of your favorite films strictly from a visual standpoint?",
        "upvotes": 259,
        "comments": 646,
        "media": null,
        "permalink": "/r/movies/comments/1hozgds/favorite_visually_stunning_films/"
    },
    {
        "id": "1hpbrvv",
        "author": "VirgoVenusLady",
        "title": "Re-watching a movie years later &amp; seeing how your perspective has changed (Spoilers)",
        "content": "When I was younger, my favorite movie on earth was The Parent Trap with Lindsey Lohan. Of course, watching it as a 7 year old I would wonder if I had a secret twin I’d meet at summer camp. As a kid, I would think about how cool it’d be to have a twin, what if I switched places with her, I wish I went to that summer camp, etc etc. Well, I’m aware we should re-read things &amp; re-watch things years later to see how our perspective has changed &amp; it was so wild to watch as an adult in my 30’s. I was curious about the Mom’s point of view. What if my ex husband was engaged, but my daughters wanted me to work things out? Would I have gone on the camping trip? Was that a plan to break them up? Would I have kissed him in the wine cellar? Also, the ending when he did come after her when that’s what she wanted before when younger, honestly made me cry because I was so happy for her. Just makes you think, thanks for reading!",
        "upvotes": 35,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1hpbrvv/rewatching_a_movie_years_later_seeing_how_your/"
    },
    {
        "id": "1hp5fta",
        "author": "EvergladesMiami",
        "title": "The Great Mouse Detective - Workprint Sample",
        "content": "",
        "upvotes": 79,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oDZSUv9Z8bEtpLdeLsQ8eRlLUeQpra_f-A6FxDpHAM.jpg?auto=webp&amp;s=faecb5ff808e5274b285a0cca03c5314932829b5"
        },
        "permalink": "/r/movies/comments/1hp5fta/the_great_mouse_detective_workprint_sample/"
    },
    {
        "id": "1hp7eqn",
        "author": "LemonLate",
        "title": "Call Me By Your Name Ripped My Heart Out",
        "content": "***spoilers***\n\n\nI somehow never got around to watching this movie, and now I can’t function. There’s nothing more brutal or beautiful than the way Elio repeats, “Because I wanted you to know.”\n\nI’ve learned that love isn’t supposed to make sense. It’s not always easy. Sometimes it’s butterflies and other times it’s an overbearing feeling of the weight of the world. The cast replicating the perfect depiction of what love *feels* like despite it being nearly impossible to replicate is impressive. \n\nThis film encapsulates the journey of falling in love so well. Is it all worth it? Are the short, beautiful memories of looking at the person you’re in love with worth the hours of agonizing pain when you’re not around them? Is the obsesssion normal? Is it all worth it in the end?\n\nIn the end when Mr. Perlman notices how sad Elio is, and tells him that what he had with Oliver was a truly special friendship, and eludes that he knows it was more than just that. He tells Elio not to cut himself off from his feelings to not feel grief because then you lose the ability to feel the kind of joy he felt with Oliver. He tells him about how he came close, but never had the kind of connection that they had. Mr. Perlman says,\n\n\n“We rip out so much of ourselves to be cured of things faster, that we go bankrupt by the age of thirty. And have less to offer each time we start with someone new. But to make yourself feel nothing so as not to feel anything? What a waste.”\n\n\nThe universal understanding for so many queer people with those heart shattering sentences. Those whose lives have been dictated and are unable to pursue their natural instincts. Their ability to love has been restricted, threatened. The decades of generations who have wasted their lives out of fear from our deeply rooted homophobic society. ",
        "upvotes": 59,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1hp7eqn/call_me_by_your_name_ripped_my_heart_out/"
    },
    {
        "id": "1hpc8br",
        "author": "Comprehensive-Fun47",
        "title": "Catch me up on the best movies of the year 2024",
        "content": "I've only watched a handful of movies this year that I think will be contenders come award season. I'm not specifically looking for films with Oscar buzz, but I want recommendations of films of that caliber.\n\nWhat were your favorites this year? What are the must-see movies? Tell me what to watch., including foreign films. \n\nMy faves this year were Challengers, Civil War, and Flow. I've seen Wicked and Dune 2, Emilia Pérez, Small Things Like These. Anora, A Complete Unknown, and Nightbitch are on my list.",
        "upvotes": 29,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1hpc8br/catch_me_up_on_the_best_movies_of_the_year_2024/"
    },
    {
        "id": "1hoq8wt",
        "author": "BearBearChooey",
        "title": "I forgot how great the 2000s comedies were ",
        "content": "I’ve been spending some of my time off around the holidays watching some 2000s comedies. Old school, Wedding Crashers, Dodgeball, Talladega Nights. Man they were all so good. Maybe it’s just the nostalgia in me, but I still laugh everytime I watch these and enjoy them so much on rewatch. \n\nWhat are some of your favorite 2000s comedies? ",
        "upvotes": 834,
        "comments": 376,
        "media": null,
        "permalink": "/r/movies/comments/1hoq8wt/i_forgot_how_great_the_2000s_comedies_were/"
    },
    {
        "id": "1hphsnk",
        "author": "Newboy001871",
        "title": "BlacKKKlansman (2018) has an AMAZING soundtrack",
        "content": "I just watched BlacKKKlansman for the first time the other day and thought it was a funny movie with a decent plot and message, but boy oh boy was the soundtrack AMAZING. I was getting eargasms the whole time watching that movie. Whenever the main theme would come on or Ron's theme I would get literal chills. That style of music with the electric guitar sounds sooo freaking good! If you haven't watched it I would recommend watching it just for the music. But if you'd rather not then at least go give it a listen on spotify. Terence Blanchard is a music genius I swear.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hphsnk/blackkklansman_2018_has_an_amazing_soundtrack/"
    },
    {
        "id": "1hphcsa",
        "author": "Suspicious_Lychee579",
        "title": "What zombie/disaster movies don’t put the focus on the characters in the movie?",
        "content": "I love monster movies, disaster movies, zombie movies, anything like that, and when I read reviews or discussions about them I almost always see praise toward the movie for focusing on humanity instead of the monster/disaster/etc. \n\nSo I’m curious, what movies in these genres don’t center humans? Have I just gotten lucky with not coming across one that doesn’t? Am I misunderstanding what they mean when they say that? \n\nBonus question, if there are movies that don’t center humans, are there any that do it well? It seems like it’s a negative so I’m curious if there’s ways to do it correctly. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1hphcsa/what_zombiedisaster_movies_dont_put_the_focus_on/"
    },
    {
        "id": "1hpbj8p",
        "author": "Ok-Alarm7257",
        "title": "Item 9",
        "content": "The Item 9 opening in Pineapple Express is one of the best comedic movie openings of the 2000s. I'm not a huge Seth Rogan and James Franco buddy film guy but the opening of this movie is forever etched in my mind. Bill Hader deserves all the credit for this, he was the perfect balance of wacky and whimsical that most stones can relate to. We sit around in the basements and back patios of the world smoking and joking, this scene optimized this feeling for me. Just an opinion but I'm willing to hear others thoughts",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1hpbj8p/item_9/"
    },
    {
        "id": "1ho6mzf",
        "author": "BunyipPouch",
        "title": "I saw 298 movies in theaters in 2024. Here is my full ranking.",
        "content": "Every year I try to go to the movies as much as possible. It’s my main hobby. I keep track of my thoughts/scores throughout the year, along with all of my ticket stubs. In theaters, I saw: 5 movies in 2015, 9 movies in 2016, 146 movies in 2017, 162 movies in 2018, 192 movies in 2019, 44 movies in 2020, 86 movies in 2021, 270 movies in 2022, 325 movies in 2023, and 298 movies this year. This doesn’t include rewatches, but those are pretty rare for me (7 this year). This is my 7th year doing this ranking on /r/movies. \n\nI have a subscription with AMC’s A-List, Regal’s Unlimited, and Cinemark’s MovieClub. I’m also a member of the Fort Lauderdale, Miami, and Toronto film societies. \n\nI attended 8 film festivals this year, for a total of 117 films. I attended 24 World Premieres, 11 North American Premieres, 7 US Premieres, 10 East Coast Premieres, 22 Southeast Premieres, 4 Canadian Premieres, and a few Florida/Georgia Premieres. \n\n96 of my screenings had cast and/or crew present for Q&amp;As/intros. \n\nI do these rankings and reviews/random thoughts for fun. It’s not meant to be taken super seriously. I just like movies, and I like ranking them.\n\n----------------------------------------------------------------------------------------------------------\n\n**Red Rooms** - 10/10 - The most gripping psychological-thriller since *The Girl with the Dragon Tattoo*.  Extremely disturbing and unsettling at times, but also stylish and sleek. The courtroom scenes and vampire-movie-like score stick with you for a long time. Juliette Gariépy puts in the best performance of anyone this year. There's so much amazing stuff happening with French-Canadian cinema recently and this is another great addition. Best movie of the year. One of the best movies of the past decade.\n\n**Dune: Part Two** - 9/10 - Sci-fi doesn't get much better than this. I have the seemingly-unpopular opinion that the first movie is better than the second, but both are near-perfect. Everything that can be said about Dune 1/2 has pretty much already been said. \n\n**Anora** - 9/10\n\n**Civil War** - 9/10\n\n**Nosferatu** - 9/10 - Gothic horror is so back. Lily-Rose Depp does things in this movie physically that I've never seen before on the big screen. Extremely impressed with her performance (and with Hoult/Dafoe/Skarsgard/Corrin as well). A great ensemble surrounded with perfect set design, direction, and cinematography. Loved the scenes in the castle that almost appeared black-and-white. Robert Eggers has not missed for me so far, and this is my favorite of his.\n\n**Challengers** - 9/10\n\n**Sing Sing** - 9/10 - Colman Domingo, give that man his Oscar [John Malkovich Rounders voice].\n\n**The Substance** - 9/10\n\n**You Are Not Alone** - 9/10 -\tPart La La Land, part Under the Skin, part Eternal Sunshine. A beautiful and hypnotic sci fi love story with a slight horror edge and with layers upon layers of metaphor.  It has a lot of interesting things to say about mid-20s loneliness/thoughts of suicide/love/etc.\n\n**Didi** - 9/10 -  I'm a sucker for coming-of-age dramas set in recent times. Give me more of this and mid90s-type movies pls.\n\n**The Order** - 8/10\n\n**We Live In Time**\t- 8/10 - I went in expecting heartbreak (which I got), but I didn’t expect how funny/sharp it would be. Florence and Andrew have 10/10 chemistry. Only thing keeping it from a higher score is the goofy Super Bowl of Food or whatever scene near the end. The scene at the beginning in the parking garage might be one of the most heart wrenching and well-acted scenes of the entire year. Top-tier score as well.\n\n**Love Lies Bleeding** - 8/10 - I would watch a 2-hour movie montage of Katy O'Brian working out beneath a highway underpass. A violent &amp; twisted mess of sweat/blood/sex/tears/ungodly bodily noises. A real wicked fun time.\n\n**The Goldman Case** - 8/10 - French courtroom dramas, so hot right now. An insanely smart and water-tight screenplay with engrossing performances. It reminded me a lot of Anatomy of a Fall then I realized the co-star (Arthur Harari) in this film is the co-writer of Anatomy.\n\n**The Beast** - 8/10 - A movie that's almost impossible to describe but I'll try: Dystopian-future-sci-fi, period-drama, modern-incel-breakin-thriller, all while staying completely original and beautiful. Extremely layered story and performances. Lea Seydoux and George MacKay are 2 of my favorite actors and they pulled this off with extreme precision and care. One of more harrowing final scenes of the year for sure. \n\n**Conclave** - 8/10\n\n**Saturday Night** - 8/10 - Frenetic, engaging, and a really fun time. Flies by. I wanted more. So much energy.\n\n**September 5** - 8/10\n\n**The Brutalist** - 8/10 - I have some problems with the ending, feels like it undid a lot of what was experienced, but otherwise an impressive monster of a movie. Brody and Pearce are outstanding.\n\n**Io Capitano** - 8/10\n\n**Fremont** - 8/10 - I love movies that flow like light poems, like Petite Maman or Journey to A Mother's Room. It was a very sweet and cozy. The psychiatry sessions in particular were hilarious, and the bit where the diners are reading their fortunes in the restaurants were perfect. One of my favorite lines of the year is when the old lady fortune cookie writer dies at her desk, and the boss says “she was getting too old to write about the future anyway”. The lead and Jeremy Allen White were only onscreen together but their chemistry was infectious\n\n**Seagrass** - 8/10\n\n**LaRoy, Texas** - 8/10 - A hilariously-dark Coen Brothers throwback with wonderful performances from Steve Zahn and John Magaro (who I was lucky enough to meet prior to the screening). It's bloody and smart, and that's a rare combination.\n\n**A Quiet Place: Day One** - 8/10\n\n**The Last Showgirl** - 8/10 - Apart from a few awkward line-deliveries and questionable dialogue in spots, this was a very lowkey, engaging drama with a career-best performances from Pamela Anderson and Dave Bautista. Very dreamy and light.\n\n**Friendship**\t- 8/10 - It's so fucking stupid. Absolutely no plot to speak of. There's no character development. It's barely even a movie. It's basically a 90-minute sketch. All that being said, it's so goddamn hilarious. Non-stop laughs. Most I've laughed since Red Rocket probably. It's a can't-miss for any Tim Robinson fan and a can't-miss for any fans of laughing. Kate Mara was the perfect foil character. \n\n**The Wild Robot** - 8/10 - Yes, I cried, what of it?\n\n**Relay** - 8/10 - A very solid, tight, throwback to the type of paranoid corporate-thrillers they don’t really make anymore. A super fun twist that I didn’t see coming at all, and a standout turn from Lily James. It slightly loses its way near the end.\n\n**Good One** - 8/10 - Familiar and lowkey, but with a dark edge that slowly reveals itself, and a superb breakout role from Lily Collias. Great debut film from director India Donaldson.\n\n**A Complete Unknown**\t- 8/10 - There's definitely a lack of plot but at the end of the day we all just want to see Bob Dylan's Greatest Hits performed by a generational talent in Timothee Chalamet and it definitely delivers in that aspect.\n\n**Midwives** - 8/10 - One of the more stressful movies I’ve seen in a while. My anxiety was through the roof, especially in the first half. It’s so realistic and graphic at times (and some of it *has* to be real, some birth scenes especially) that you almost get a sense that it’s a documentary. Totally nails the landing too, making you feel real anger/empathy about how Midwives are treated in France (and other places I assume).\n\n**Hellbent On Boogie** - 8/10\t\n\n**Alien: Romulus** - 8/10 - Put Cailee Spaeny in anything and I'll watch it.\n\n**Furiosa: A Mad Max Saga** - 8/10\t\n\n**The Old Oak** - 8/10 - British realism cinema at it's finest. Just another classic added to Ken Loach's resume.\n\n**Longlegs** - 8/10\t\n\n**Babygirl** - 8/10\t\n\n**One Life** - 8/10 - I'm not a huge movie-cryer but I was absolutely balling my eyes out near the \"moment\". You know it's coming and it's still hit. Impressive when a movie can do that. Last movie that hit me like that was probably Tori and Lokita, and before that Moonlight. This was up there in terms of tears. Did not really expect it going in. Devasting. Anthony Hopkins kills these types of roles, he has a way of showing bottled up regret/sadness that not many others can.\n\n**The Ministry of Ungentlemanly Warfare** - 8/10 - Over-the-top violent fun time. Totally ridiculous but it doesn't take itself seriously and that's what keeps it from veering into. Also, Eiza Gonzalez. That is all.\n\n**Strange Darling** - 8/10\n\n**Los Frikis** - 8/10\t\n\n**Suncoast** - 8/10\t\n\n**Drive-Away Dolls** - 8/10 - I want more unapologetically horny movies like this. Loved all of Beanie Feldstein's bits and the slow, sleep-deprived descent into madness of the henchmen especially. Not too sure abou the weird-cheap transitions and trippy scenes though.  \"You're a day late and a penis short\" and \"Suki that's your wall dildo!\" are two of the funniest lines of the year, within context. Give me more fast-paced 75-minute movies.\n\n**In A Violent Nature** - 8/10 -This made me feel physically nauseous several times, would strongly recommend. Some of the gnarliest kills I've ever seen on the big screen. \n\n**A Real Pain** - 8/10\n\n**Abigail**- 8/10 - As a French-Canadian, big shoutout to Kevin Durand for his on-point Quebecois accent. Also, \"Sammy, those are fucking onions\" was one of the best/funniest line deliveries of the year. Really entertaining gory vampire flick. Dan Stevens is straight up having a fun time this year and I'm enjoying it every time. Melissa Barrera is now competing with with Mia Goth and Samara Weaving as top Scream Queens.\n\n**Deadpool &amp; Wolverine** - 8/10\n\n**Bring Them Down** - 8/10 - I love me a slow-burn family feud drama that slowly snowballs into something dark and sinister. Christopher Abbott is one of my favorite working actors today and he does incredible work here, especially with the accent/Irish/body language. Disclaimer: Not recommended to people sensitive to animal violence/cruelty. There's a lot of that.\n\n**The Piano Lesson** - 8/10 - As far as Denzel Washington-produced, August Wilson adaptations are concerned, this is way above *Fences*. Felt less like a straight-up filmed play. The supernatural element and amazing Danielle Deadwyler performance (give her an Oscar soon pls) make this more layered and interesting. Bonus: I was sitting with/near the cast/crew for this one, 5-10 feet away from Denzel/Danielle/John David/Malcolm/Corey Hawkins/Ray Fisher/Michael Potts. Amazing experience.\n\n**Nickel Boys** - 8/10\n\n**Fresh Kills** - 8/10 - A really solid mob-drama told from the perspective of a mob boss' daughter, which I appreciated. It's rare you see this story from that angle. Emily Bader's scene with her dad near the end. Holy. Fucking. Shit.\n\n**Between The Temples** - 8/10 - Carol Kane was absolutely magnetic and a joy to watch in this, and Jason Schwartzman was her perfect endearing counter. Lovely movie, that makes you want to curl up into a ball and cringe to death near to end, in a good way. The most painful-to-watch family reunion/dinner since Shiva Baby. \n\n**Problemista** - 8/10 - I stand with Bank of America. Julio Torres is kind of a revelation in this. His facial expressions (and hilarious run-walk thing) are perfect. Absurd, funny, and sweet comedy with so much flair and uniqueness. Some fun little details that got good laughs out of me, like Tilda's character always having her phone light on. Chaotic in all of the right ways.\n\n**Sisterhood**\t- 8/10\n\n**Days of Happiness** - 8/10\n\n**The Apprentice** - 8/10 - It's not breaking any new ground but Sebastian Stan is a pleasure to watch transform into Trump as the movie goes on. Grimy and gross like the streets of New York in the 80s.\n\n**Wil** - 8/10\n\n**Naked Ambition: Bunny Yeager** - 8/10\n\n**Soul** - 8/10 - I didn't get to catch this during it's original run due to COVID so I'm glad it came back. My favorite Pixar movie in a little while.\n\n**Femme** - 8/10\t\n\n**I Saw the TV Glow** - 8/10 \n\n**Heretic** - 7/10 - A fun horror with sharp dialogue and an incredibly-hammy Hugh Grant performance.\n\n**Emilia Perez** - 7/10 - Some amazing musical numbers, especially the opener and \"El Mal\", and Zoe Saldana has an amazing performance where she carries the entire thing (Gomez and Gascon are getting lots of praise but I didn’t see it), but it just felt like it never fully came together to reach full potential.\n\n**Mountains** - 7/10 - A very small and warm movie about the very big and cold issue of gentrification and the real estate crisis in South Florida. Monica Sorelle is a director to watch for sure.\n\n**Skywalkers: A Love Story** - 7/10\t- Other than a few moments that seemed a bit scripted (mostly the relationship drama), this is the most thriller documentary since Free Solo.\n\n**Ghostlight** - 7/10\t\n\n**Shoshana** - 7/10 - Israeli true-life spy-thriller, a bit Bond-like. There's a few kills in here that are insanely brutal and the explosions/gunshots catch you by surprise. It had me jump a few times.\n\n**The Dead Don't Hurt** - 7/10- Extremely slow, don't go in expecting an action-packed Western, but Viggo has a really good eye for beautiful backgrounds and settings. Vicky Krieps is top-tier as always. This movie doesn't work without her. I like slow Westerns.\n\n**The Fall Guy** - 7/10\t\n\n**Thelma** - 7/10\t\n\n**Twisters** - 7/10 -Natural disaster flicks just work for me. Getting to look at Daisy Edgar-Jones for 2 hours never hurts as well.\n\n**Cuckoo** - 7/10 - Insanely impressive and physical performance from Hunter Schafer. Cool visual style and flair, but ultimately dragged down by a total clusterfuck of a plot. I was confused throughout. Hilarious German accent from Dan Stevens\n\n**Peak Season** - 7/10\t\n\n**Kneecap** - 7/10 - Some of the funniest one-liners of the year (\"Look who it is, Bone Thugz and no harmony\", \"I feel like I discovered the Beatles, if the Beatles were shit.\"). The whole RRAD storyline kept it from greatness though, that was a bit too goofy for its own good.\n\n**Wolfs** - 7/10 - I went in wanting Pitt/Clooney banter and that's exactly what I got.\n\n**Blink Twice** - 7/10\t\n\n**My Old Ass** - 7/10\t\n\n**Better Man** - 7/10\t\n\n**Nightbitch**\t- 7/10 - Your mom's favorite movie of 2024. The awful first trailer didn't do it justice, this was solid, it just doesn't get dark like you'd hope it would.\n\n**Out of Darkness**\t- 7/10 - Saw this during a Mystery Movie Monday and was pleasantly surprised. Pretty brutal, atmospheric, and violent. Some cool overhead shots and a nice score. One of the better Mystery Movies I've seen.\n\n**We Grown Now** - 7/10\t\n\n**The End We Start From** - 7/10\t\n\n**Kinds of Kindness** - 7/10 - Not the best Yorgos but deliciously-freaky and daring filmmaking nonetheless.\n\n**Babes** - 7/10\n\n**Fancy Dance** - 7/10\t\n\n**MaXXXine** - 7/10 - Definitely the weakest of the trilogy but still a solid slasher with a very interesting setting. Mia Goth has great moments like in the first two.\n\n**Horizon: An American Saga Chapter 1** - 7/10 - I don't care, the montage at the end was sick. I really hope Costner gets to fund as many of these as he wants.\n\n**Wicked - 7/10** - Pretty good, not great. Ariana Grande was the standout. There were only 2 songs that were really catchy though, wish there were more.\n\n**Juror #2** - 7/10\n\n**Fly Me to the Moon** - 7/10\t\n\n**The End** - 7/10 - Gorgeously-shot, super well acted, beautiful set design and production, but way too long and had no reason to be a musical. The songs were all exactly the same and pointless and there much so much time in between that you would forget it was even a musical. George MacKay kills it.\n\n**Being Maria** - 7/10\t\n\n**Cabrini** - 7/10 - Maybe a bit overlong but honestly not bad. Surprised it's from the same director as Sound of Freedom, it's quite a step up from that. Much larger and ambitious in scope, and the lead actress was really really great. It solidly panders to its intended audience but it’s well made enough that you can just gloss over the eye-rolling moments.\n\n**In the Land of Saints and Sinners** - 7/10 - The best Neeson action-flick in a while, so that's something. Kerry Condon as the big villain was awesome. Need more of her in stuff.\n\n**Y2K** - 7/10 - The single-funniest death scene of the year was the skateboard scene. Laughed so hard, made my night. Audience really dug this one too, good atmosphere. Fred Durst.\n\n**The Queen of My Dreams** - 7/10 - I was getting massive Deja Vu with The Persian Version last year. Extremely similar story and vibe, equally fun/honest/heartfelt.\n\n**Speak No Evil** - 7/10\t\n\n**Immaculate** - 7/10 - Sydney Sweeney stepping out of her comfort zone and doing a nun-horror is cool. Long take near the end was sick.\n\n**Gladiator II** - 7/10 - Doesn't hold a candle to the original but it was still an entertaining sandals &amp; swords story. Fred Hechinger is so awful in this though. Man, that took me out of it. \n\n**Back to Black** - 7/10 - This movie is conflicting. In a vacuum, ignoring Winehouse's actual story, it's a solid music-biopic carried by a powerhouse breakthrough performance from Marisa Abela and an amazing soundtrack (obviously). On the other hand, it's a disgusting whitewash by her estate to downplay her truly awful father. The fact that he had final approval over this movie, and will financially benefit from it, is just gross and hard to ignore. The 2015 documentary does a better job telling Amy's whole story in an emotional way, and that doc made my blood boil (and is one of my favorite docs ever). \n\n**Coup!** - 7/10\t\n\n**The Hypnosis** - 7/10\t\n\n**The Last Stop in Yuma County** - 7/10\t\n\n**Your Monster** - 7/10\n\n**Blitz** - 7/10 - The cartoonish villains and improbably scenarios the kid kept finding himself in took this down a notch for me. Could've been great, but it didn't quite get there. How much bad shit can happen to one kid in 24 hours? Find out with Blitz. On a technical level it had a lot going for it though.\n\n**In the Summers** - 7/10\t\n\n**Maria** - 7/10 - Jolie kills it and it looked gorgeous but a really big step down from Jackie/Spencer for Pablo Larrain, a big 'style over substance' movie and weirdly disrespectful to Jackie Kennedy as well for some odd reason. Very weird structure.\n\n**Lost Soulz** - 7/10\n\n**The Girls Are Alright** - 7/10\n\n**All We Imagine As Light** - 7/10 - With all the hype I was expecting to be blown away. It was good but kind of a let down.\n\n**Girls Will Be Girls** - 7/10\t\n\n**Ezra** - 7/10\n\n**Young Woman and the Sea** - 7/10 - An inspiring sports-biopic with a very old-school and authentic feel. The Remember the Titans of swimming movies. It hits all of the cliches and it's super cheesy, but in all of the right ways. It just works. Daisy Ridley was great, and as far as swimming movies are concerned, it's definitely ahead of Nyad.\n\n**Hundreds of Beavers** - 7/10 - It's funny and original, I just wish it was a bit shorter. Some of the bits definitely outstay their welcome after a while. I really like the grassroots campaign they've built around this movie though, everything from the independent theatrical showings to the support of physical media. A great success story for indie film this year.\n\n**The Idea of You** - 7/10\t\n\n**Crossing** - 7/10\n\n**Sleep** - 7/10\t\n\n**Monkey Man** - 7/10 - Solid action flick for the first and third acts, but dragged down by a super boring 2nd act (where it loses all of the momentum it built) and lots of sloppy/confusing editing, especially during chase sequences. Credit for the Terrence Malick-like flashback scenes with narration/sweeping music/shots of nature/etc, pretty cool to throw those into an action movie.\n\n**The Color Purple** - 7/10\t\n\n**The Damned** - 7/10 - You're hanging out with the soldiers on the frontier of the American Civil War and almost nothing happens for the entire runtime except you learn about the characters and their thoughts on life/god/religion/etc. I enjoyed it.\n\n**Mean Girls**\t- 7/10\t\n\n**Driving Madelaine** - 7/10\t\n\n**Late Night with the Devil** - 7/10\n\t\n**Snack Shack** - 7/10 - Aside from the needless death at the end that tries too hard to squeeze tears out of your eyeballs, I thought this was a fun, raunchy, summer-y throwback comedy. This would've been one of my favorites in middle school probably.\n\n**Beetlejuice Beetlejuice** - 7/10\t\n\n**Joker: Folie a Deux** - 7/10\t\n\n**The Outrun** - 7/10 - Less a compelling story and more a showcase on Saoirse Ronan's acting abilities. The camera basically doesn't move from her for a single second and she completely carries it. She's the best.\n\n**Flow** - 7/10\n\n**Black Box Diaries** - 7/10\t\n\n**Queer** - 7/10\n\n**The Return** - 7/10\t\n\n**New Life** - 7/10\t- I really respect a movie that can pull off a wild genre-switch halfway through the movie. Went in fully blind so it was totally unexpected. Also impressive this tiny movie could license Bob Dylan’s Like A Rolling Stone (played a few times).\n\n**Lisa Frankenstein** - 7/10  - The ultimate \"could've been truly great with a R rating\" movie.\n\n**Bob Marley: One Love** - 7/10 - It does just enough to keep it out of the Super Generic Biopic Genre and any movie that can squeeze a few tears out of me gets an extra point. Sorry, that's just the rules.\n\n**Kingdom of the Planet of the Apes** - 7/10\t\n\n**1992**- 7/10 - Other than Ray Liotta being written like a ridiculous cartoon villain and some eye-rolling dialogue issues, it actually was a pretty solid crime drama... and Tyrese Gibson was…good? (/r/brandnewsentence)\n\n**French Girl** - 7/10\t\n\n**The Peasants** - 7/10 - Visually impressive and a sick score, but a schmaltzy/melodramatic story kinda kept it from the next level.\n\n**The Monk and the Gun** - 7/10\t\n\n**Bad Boys: Ride or Die**\t- 6/10\t\n\n**Seven Blessings**\t- 6/10\n\n**Knox Goes Away** - 6/10 - Michael Keaton does his best and commits but the writing &amp; performance of every single side character brings the whole thing down a bit. The cop/ex-wife/son characters are bumbling, distractingly-dumb goofballs that keep the plot from ever grounding to reality, but it ultimately gets dark and violent enough to stay pretty entertaining. The script really could've used some more cleaning up.\n\n**Trap** - 6/10 - Listen I have a lot (*a lot*) of problems with this movie but Kid Cudi randomly showing up for 5 minutes and randomly delivering insane lines like \"“I specifically said i wanted honey suckle kombucha biiiiitchhhh” made the trip to the theater worth it.\n\n**Small Things Like These** - 6/10\t\n\n**Sometimes I Think About Dying** - 6/10\t\n\n**Kidnapped**\t- 6/10\t\n\n**Asphalt City** - 6/10 - Standout performance from Tye Sheridan but this leaned a bit too much into misery porn for my liking. Every single day is the absolute worst day on the job. Extremely stress-inducing first hour. Mike Tyson being cast as the medic chief was certainly a choice...and it worked somehow?\n\n**Eden**\t- 6/10 - Had trouble getting past the awful accents and the sinking feeling that this was missed potential. I was at the World Premiere for this and someone in the audience had a medical emergency, they had to pause the screening and turn the lights on while the person was carried out on people's shoulders. Jude Law/Sydney Sweeney/Ana de Armas/Ron Howard were all there wondering what was going on. Kind of a crazy situation.\n\n**Land of Bad** - 6/10\t\n\n**Unstoppable** - 6/10\t\n\n**Godzilla x Kong: The New Empire** - 6/10 - Skull Island's bland and less impressive/memorable little brother. Thumbs up for Baby Kong and the Rio de Janeiro destruction sequence, thumbs down for the lame story and unlimited amounts of annoying human characters.\n\n**Bad Shabbos** - 6/10\t\n\n**Inside Out 2** - 6/10\t\n\n**Firebrand** - 6/10\t\n\n**A Different Man** - 6/10 - I didn't connect to this as much as most people did. Sebastian Stan is great as usual but the whole thing didn't do much for me.\n\n**Love Me** - 6/10 - 10/10 for the attempt, 4/10 for the execution. There's a really good movie hidden in here somewhere, but there needed to be some cuts made to the animated portions of the film for sure.\n\n**Shell**\t- 6/10\n\n**Housekeeping for Beginners** - 6/10\t\n\n**Totem** - 6/10\n\n**The Fire Inside** - 6/10\t\n\n**Widow Clicquot**\t- 6/10 - This starts off really really really slow but then finds its footing late and ends on a solid note. Career-best performance from Haley Bennett, she really carries this.\n\n**Tuesday** - 6/10\t\n\n**Piece by Piece** - 6/10\t\n\n**The Cut** - 6/10 - Standout turns from Orlando Bloom and Caitriona Balfe, brought down by some weird editing choices. The neon-green hallucinations were a wild choice. I sat next to Katy Perry for this movie, AMA.\n\n**Memoir of a Snail** - 6/10\n\n**The Romano Twins** - 6/10\t\n\n**Mufasa: The Lion King** - 6/10\n\t\n**Film Geek** - 6/10\t\n\n**Self-Reliance** - 6/10 - Pretty cute movie with a few laughs, but the ending lost its focus and felt rushed. The Andy Samberg bits were great. I wanted more from the relationship with Anna Kendrick's character, feels like there was more to explore there. \"This an intervention.\" \"For me?\" \"No, we're just all facing the wrong direction.\"\n\n**Queen of the Ring** - 6/10\t\n\n**Coup de Chance**\t- 6/10 - It's nowhere near peak-Woody Allen but it's a passable return to form since Rifkin's Festival, Wonder Wheel, and A Rainy Day In New York (all 3 awful, with Rifkin's Festival being rock bottom for Allen's filmography). The one thing it was missing was humor. I can always trust an Allen film to at least have a few funny/witty lines (even the bad ones), but this was very cut and dry. Could've used a few more good lines.\n\n**Sasquatch Sunset** - 6/10 - I was excited for the premise and there's a few sweet/funny moments, but most of it ends up being mindless shitting/pissing/fucking. Credit for the unique idea and great views.\n\n**Bird**\t- 6/10 - One of the more disappointing films of the year. Even after the lukewarm reception at Cannes, I had super high hopes because I’m a huge Andrea Arnold fan, but the surrealism in this movie just didn’t work. It threw off the whole balance and wasn’t at all what I expected/wanted. Nikiya Adams and Barry Keoghan were both very solid, and the scene where the group sang Coldplay’s Yellow to the frog was amazing.\n\n**Omni Loop**- 6/10\t\n\n**Here**\t- 6/10 - A valiant attempt but ultimately kind of a hot mess. A few good moments keep it watchable. Some real uncanny valley shit in there too though.\n\n**Queen Rock Montreal** - 6/10\t\n\n**Turning Red** - 6/10\t\n\n**Scrambled** - 6/10\t\n\n**The Book of Clarence** -  6/10 - LaKeith Stanfield was great and committed as usual (although I don't like twin dual-roles), and James McAvoy and Cumberbatch chewing on scenery was fun, this movie had a lot of trouble figuring out what it wanted to be. I really wish it leaned more into the funny/satire and less into the serious Mel Gibson/Jim Caviezel-type biblical drama. Cool that a movie like this can be made/funded and released in theaters though.\n\n**Booger** - 6/10\t\n\n**Irena's Vow** - 6/10 - Great story, extremely generic period drama.\n\n**A Great Divide** - 6/10\t\n\n**Riff Raff** - 6/10 - A bit outdated and mean-spirited, this would've slapped in 2006, but Bill Murray and Pete Davidson as the incompetent mob assassins makes it worth a watch. \n\n**Rosalie** - 6/10\n\n**Skincare** - 6/10\t\n\n**Yellow Bus** - 6/10\n\t\n**Arcadian** - 6/10 - It's fine and stretches its tiny budget so its absolute limit but it's basically a Dollar Store A Quiet Place. The monster design and animation was hilariously-bad though, like an Asylum knock-off movie. I'm also now convinced that Nic Cage is contractually obligated to have his face smothered in fake blood for any movie.\n\n**Nutcrackers** - 6/10 \n\n**The Invisibles** - 6/10\n\t\n**Riley** -6/10\t\n\n**Rob Peace**\t- 6/10 - A well-shot movie with great direction and performance from the supporting characters (Mary J Blige and Chiwetel Ejiofor) completely dragged down by an awful lead performance by Jay Will. Also the script was a bit silly, they were trying way too hard to make him 100% infallible.\n\n**Christmas Eve in Miller's Point** - 6/10 - I liked the hectic atmosphere of the crazy Christmas family party that we've all been at, and the very scratchy look of the camera.\n\n**Rumours** - 6/10 - I can appreciate what Maddin was going for, and there's some moments that work (mostly with Cate Blanchett and Charles Dance, they were awesome), but overall surreal-absurd-fantasy-comedy like this just doesn't work for me.\n\n**Fallen Fruit** - 6/10\t\n\n**Birthrite** - 6/10\t\n\n**Crumb Catcher** - 6/10\t\n\n**Anselm** - 6/10\t\n\n**Scapegoat** - 6/10\t\n\n**Seeds** - 5/10 - There’s clearly heart and maybe a great movie in here somewhere, but it’s such a tonal mess that it’s hard to find anything to love.\n\n**Sujo** - 5/10\t\n\n**The Beekeeper** - 5/10 - This is the Rebel Moon of Jason Bourne movies. A few cool kills and classic Statham one-liners keep it from being a total loss, but it's not very good.\n\n**Unsung Hero** - 5/10\n\n**Jeanne du Barry**- 5/10\t\n\n**Treasure** - 5/10\n\n**A Sacrifice** - 5/10\t\n\n**The American Society of Magical Negroes** - 5/10 - All over the place and it gave a constant feeling of \"missed opportunity\" (a la Book of Clarence). Justice Smith is straight-up not a convincing lead. An-Li Bogan was the standout, and I saw her end twist coming from a mile away so I got that going for me which is nice.\n\n**La Syndicaliste** - 5/10\n\n**Sonic the Hedgehog 3** - 5/10\t\n\n**The Watchers** - 5/10\n\n**Borderlands** - 5/10 - Went in expecting a 1/10, got a 5/10. Nice. Life is all about the little wins.\n\n**Ghostbusters: Frozen Empire** - 5/10 - Just give this franchise a permanent rest. It wasn't awful in any particular way, but it was totally soulless and heartless. It felt like nobody really gave a shit except Kumail Nanjiani. Safe, sanitized, studio slop. They couldn't even fully commit to the one interesting thing (the gay ghost love story).\n\n**National Anthem** - 5/10\t\n\n**The 4:30 Movie**\t- 5/10 - Kevin Smith jerking himself off for 80 minutes. Would make a fun double-feature with *Snack Shack* though.\n\n**Universal Language** - 5/10 - This had a lot of hype of out Cannes and it's Canada's submission for the Oscars so I had a lot of hope, but it just didn't do much for me. Surreal-absurdism just isn't my cup of tea. The only real standout scene was the one with the Quebec democrat. A rare case of the Q&amp;A being more interesting than the movie itself.\n\n**Kraven the Hunter** - 5/10\t\n\n**Time Still Turns the Pages** - 5/10\t\n\n**Upgraded** - 5/10\t- Basically a Great Value The Devil Wears Prada. Good as rom-com-background-nois. Marissa Tomei is awful in this. One of the worst performances of the year.\n\n**Sound of Hope: The Story of Possum Trot** - 5/10\t\n\n**Out of Season** - 5/10\t\n\n**Miller's Girl** - 5/10\t\n\n**Latin for All** - 5/10\t\n\n**Argylle** - 5/10 - How a movie like The Creator can be made for $80M but something so awful-looking like this needs $200M blows my mind. \n\n**I.S.S.** - 5/10 - I love a good sandwich-making climax as much as the next guy, but what a painfully awkward ending. The first 25 minutes made me think something decent could be happening then it derails hard and never recovers. The worst thing to happen to the space program since Challenger.\n\n**Get Away** - 5/10\t\n\n**Brothers** - 5/10\t\n\n**Life's a Bitch** - 5/10 - France's (bad) answer to Yorgos Lanthimos. A dry, twisted, gross, weirdly-sexual, anthology film with a lot less nudity but a lot more dogs than Kinds of Kindness. Kinda loses its way comedically and becomes a chore after the first chapter.\n\n**Azrael** - 5/10\t\n\n**Monster Summer** - 5/10 - Like a G-rated IT, with Mel Gibson for some reason (?)\n\n**Kung Fu Panda 4** - 5/10\t\n\n**Garfield** - 5/10\n\nV**illains, Inc** - 5/10 - It had a certain cheap charm but an overwhelming sense of \"SNL Digital Short sketch stretched way too thin\".\n\n**Excursion** - 5/10\t\n\n**Sleeping Dogs** -  5/10\n\n**Notice to Quit** - 5/10 - The kid actor was really good but I'm just a bit over following an extremely unlikeable lead around doing shitty things to people.\n\n**Reunion** - 5/10\n\n**The Boy in the Woods**\t- 5/10\t\n\n**Paradise** - 5/10\t\n\n**Karaoke** - 5/10\t\n\n**It Ends With Us**\t- 5/10\t\n\n**Poolman** - 4/10 - The ugly, boring,  confused lovechild of Inherent Vice and Under the Silver Lake.\n\n**Avenue of the Giants** - 4/10\t\n\n**Arthur the King** - 4/10 - Marky Mark has really devolved as an actor honestly, really tough performance from him here. It's like he's completely forgotten how to convincingly deliver lines. Right from the GoPro scenes at the beginning I knew it was gonna be a rough time. This movie is like 85% exposition.\n\n**Janet Planet** - 4/10 - Bookended by 2 great scenes, but filled with mostly pointless garbage.\n\n**Dandelion**\t- 4/10\t\n\n**By the Stream** - 4/10\t- I enjoy Hong Sangsoo movies in very small doses. This dose was just way too big.\n\n**Venom: The Last Dance** - 4/10\t\n\n**Red One** - 4/10\t\n\n**Oh, Canada** - 4/10 - Dreadfully confusing, and Jacob Elordi puts in one of the worst performances of the year, but at least that Phosphorescent soundtrack kept me engaged. \n\n**Slingshot** - 4/10\t\n\n**Adios Buenos Aires** - 4/10\t\n\n**Humane** - 4/10\t\n\n**Some Other Woman** - 4/10\t\n\n**My Daughter, My Love** - 4/10\t\n\n**Madame Web** - 4/10 - Slop.\n\n**IF** - 4/10 - Not really for adults, not really for kids/teens. Who was this movie even for?...\n\n**Freud's Last Session** - 4/10\t\n\n**Werewolves** - 4/10 - So much lens flare. I am now blind.\n\n**Ramona at Midlife** - 4/10\t\n\n**The Last Front** - 4/10\t\n\n**My Penguin Friend** - 4/10\n\t\n**Augure** - 4/10\t\n\n**Which Brings Me To You** - 4/10 - Looking back over this ranking, I'm gonna be honest and say I have no idea what this was. Don't remember. To producers out there: please stop making your movie titles random vague sentences.\n\n**Mai** - 4/10\t\n\n**Meanwhile on Earth** - 4/10\t\n\n**Lizzie Lazarus** - 4/10\t\n\n**Or Something** - 4/10\t\n\n**The Way We Speak** - 4/10\t\n\n**Cult Killer** - 3/10 - Antonio Banderas shows up for like 5 minutes and then nopes the fuck out. Total paycheck movie.\n\n**The Feeling that the Time for Doing Something Has Passed** - 3/10 - There were some funny lines (especially the 9/11 dating profile bit) but this was so painfully dry and slow that I could never really connect. If desert-dry, awkward, deadpan delivery, with an absurd amount of BDSM-sex-stuff thrown in is your thing, you might find a few things to like. I could not.\n\n**Never Let Go** - 3/10\t\n\n**The Throwback** - 3/10\t\n\n**The City** - 3/10\t\n\n**Rats!**\t- 3/10 - This would've worked well as an edgy Youtube short in 2012.\n\n**The Best Christmas Pageant Ever** - 3/10\t\n\n**He Went That Way** - 3/10 - Half roadtrip comedy with a chimp, half brutal serial killer drama. Tonally all over the place. The kind of movie you'd expect Jacob Elordi to try to bury (a la Dicaprio with Don's Plum) and fire his agent over before it sees the light of way. Baffling decisions made by everyone here. \n\n**Megalopolis** - 2/10 - I went in expecting a mess but I was still not prepared for how bad this was. It’s Neil Breen with an unlimited budget. It felt like 6 hours. It looked so cheap and awful. A mix of Lifetime movie and a middle school play. I refuse to believe it’s bad on purpose for comedy. The only thing keeping this from a 1 is that Adam Driver/Coppola/Nathalie Emmanuel/Giancarlo Esposito were at my screening for Q&amp;A (god bless their sweet little souls for having to seriously promote this hot mess). \"What do you think of this boner I got right here?” is a line 85 year old Jon Voight actually says in a real movie in the year of our lord 2024. My therapist will hear about this.\n\n**A Boy Who Dreamt of Electricity** - 2/10\t\n\n**Isle of Hope** - 2/10 - Sometimes I wonder why I do this to myself.\n\n**Chosen Family** - 1/10\t- This was borderline unfinished and full-on embarrassing. The production value of a daytime soap opera mixed in with the sound editing of a local high school play. It's impressive how much filler (drone shots of surrounding neighborhood) can be squeezed into 84 minutes of movie. Sitting a few seats away from Heather Graham was a nice bonus (with Q&amp;A), but it couldn't come close to making up for this disaster.\n\n----------------------------------------------------------------------------------------------------------\n\n*Unranked (Re-Releases and/or TV Series):*\n\n**Dune** (Re-Release) - 10/10\n\n**Interstellar** (Re-Release) - 10/10\t\n\n**Ex Machina** (Re-Release) - 9/10\n\n**The Shawshank Redemption** (Re-Release) - 8/10\t\n\n**Bound** (Re-Release) - 8/10\n\n**Mr. &amp; Mrs. Smith Episodes 1 &amp; 2** (TV Series)\t- 7/10\n\t\n**Possession** (Re-Release) - 7/10\n\n**But I'm A Cheerleader** (Re-Release) - 7/10\n\n**The Acolyte Episodes 1 &amp; 2** (TV Series) - 6/10\n\t\n**Society** (Re-Release) - 6/10\n\n**Black Christmas** (Re-Release) - 6/10\n\n**Apples Never Fall Episode 1** (TV Series) - 6/10\t\n\n**Maniac Cop 2** (Re-Release- 6/10\n\n**The Room** (Re-Release) - 5/10\n\n**Cruel Intentions Episode 1** (TV Series)\t- 5/10\n\n**La Maquina Episode 1** (TV Series) - 4/10\n\n**After Annecy** (Short Film) - 3/10\n\n**Maniac** (Re-Release) - 3/10\n\n**Mother** (Re-Release) - 3/10\n\n----------------------------------------------------------------------------------------------------------\n\n**Stats:**\n\n**Multiple Viewings:**\n\n* Dune: Part Two (x2)\n* Babes (x2)\n* Deadpool &amp; Wolverine (x2)\n* Sing Sing (x2)\n* Back to Black (x2)\n* The Wild Robot (x2)\n* Anora (x2)\n\n**Theater Distribution by Venue/Chain:**\n\n* AMC - 96\n* Regal - 66\n* Silverspot - 18\n* Cinemark - 8\n* Landmark - 1\n* Other/Festival/Independent - 109 (Including: Arsht Center, Autonation IMAX, Cinema Paradiso, Classic Gateway, Coastal Creative, Coral Gables Art Cinema, Enzian Theater,  Hard Rock Ballroom, Koubek Center, TIFF Lightbox, Lucas Theater, Miami Theater Center, Movies of Delray, O'Cinema South Beach, Princess of Wales, Roy Thomson Hall, Royal Alexandra, Savor Cinema, SCAD Museum, Scotiabank, Tampa Theater, Trustees Theater)\n\n**Film Festivals Attended:**\n\n* Toronto International Film Festival - 30 Movies in 8 Days\n* Savannah SCAD Film Festival - 20 Movies in 8 Days\n* Miami Film Festival - 20 Movies and 1 TV Series in 10 Days\n* Florida Film Festival - 19 Movies in 6 Days\n* Miami Jewish Film Festival - 10 Movies in 7 Days\n* Popcorn Frights Film Festival - 7 Movies in 4 Days\n* Fort Lauderdale International Film Festival - 6 Movies in 4 Days\n* Gasparilla International Film Fstival - 5 Movies in 2 Days\n\n**Theater Visits by Month:**\n\nhttps://i.imgur.com/sKQYFp9.png\n\n* January: 32 \n* February: 17 \n* March: 27 \n* April: 54 \n* May: 18\n* June: 18\n* July: 12 \n* August: 24\n* September: 38 \n* October:  23\n* November: 22\n* December: 13\n\n**Theater Visits by Day of the Week:**\n\nhttps://i.imgur.com/xC7pt1S.png\n\n* Monday - 25\n* Tuesday - 23\n* Wednesday - 23\n* Thursday - 49\n* Friday - 64\n* Saturday - 67\n* Sunday - 47\n\n**Notable Missed Movies:**\n\nhttps://i.imgur.com/iPhOD5s.png\n\n**Cast/Crew/Filmmaker Q&amp;As/Appearances:**\n\n* Part 1 - https://i.imgur.com/a6JsfR0.png\n* Part 2 - https://i.imgur.com/YQIJZUl.png\n* Part 3 - https://i.imgur.com/9cyEkKY.png\n\n**Favorite Performances:** \n\nhttps://i.imgur.com/Sfv5OZB.png\n\n**Past Rankings:**\n \n* [2018 \\(162 Movies\\)](https://www.reddit.com/r/movies/comments/aavyrr/i_saw_162_movies_in_theaters_in_2018_here_is_my/)\n* [2019 \\(192 Movies\\)](https://www.reddit.com/r/movies/comments/eh71gy/i_saw_192_movies_in_theaters_in_2019_here_is_my/)\n* [2020 \\(44 Movies\\)](https://www.reddit.com/r/movies/comments/kp39ku/i_saw_44_movies_in_theaters_in_2020_here_is_my/)\n* [2021 \\(86 Movies\\)](https://www.reddit.com/r/movies/comments/ruaxif/i_saw_86_movies_in_theaters_in_2021_here_is_my/)\n* [2022 \\(270 Movies\\)](https://www.reddit.com/r/movies/comments/zzvg5y/i_saw_270_movies_in_theaters_in_2022_here_is_my/)\n* [2023 \\(325 Movies\\)](https://www.reddit.com/r/movies/comments/18v7k6g/i_saw_325_movies_in_theaters_in_2023_here_is_my/)",
        "upvotes": 7946,
        "comments": 1220,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TpHDe96i0cq0p2jFG-xOxlsmet47ocU7MWnaDY0WMgM.png?auto=webp&amp;s=e6f4c2327f93fceb1786131d2999f725c3141145"
        },
        "permalink": "/r/movies/comments/1ho6mzf/i_saw_298_movies_in_theaters_in_2024_here_is_my/"
    },
    {
        "id": "1hp7u9h",
        "author": "Billtheghost93",
        "title": "What do you all rate Frailty?",
        "content": "I was a young boy when i first saw this movie... close to around 10 or 11 years old. And man this movie has been stuck in my mind ever since ( 31 now ) Im curious what everyone thinks? Bill paxton was an amazing actor R.I.P \n\n  \n\" And if the devil doesn't like it he can sit on a tack, OUCH \" \n\n  \n9/10 MOVIE ",
        "upvotes": 17,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1hp7u9h/what_do_you_all_rate_frailty/"
    },
    {
        "id": "1holsvx",
        "author": "TheDarkAngel_2",
        "title": "The kissing booth 2 does not know how DDR works",
        "content": "I know people have already talked this movie into the ground, but I just watched it, I've been binging cheesy romcoms and holiday hallmark movies, laughing at them with my friend, then looking at reviews for them, and I haven't seen anyone mention this.\n\nThe movie sucks! But what bothered me the most was the fact that I don't think anyone in The Kissing Booth 2 actually knows how to play DDR (Dance Dance revolution). Marco did a flip on it? Later, he and Elle did something like the tango? They were off the panel—the game would not register any of it! And yet they got full accuracy??\n\nI get it's a romCOM, but this bothered me so much!\n\nDid this bother anyone else? Any thoughts?",
        "upvotes": 602,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1holsvx/the_kissing_booth_2_does_not_know_how_ddr_works/"
    },
    {
        "id": "1hpfixk",
        "author": "MasterOfShrugs",
        "title": "Top 5 Movies 2024 That You Watched Multiple Times at Movie Theatres",
        "content": "Thanks to my movies subscription, got to watch tonnes movies this year. My favs this year that I went twice at the movies theatres:\n\n1. Dune Part 2\n2. The Substance\n3. Anora\n4. The Challengers\n5. Strange Darling\n\nWatched Nosferatu last week, looking for IMAX ticket for tomorrow, so that will take out Strange Darling out of my list. \n\nWhat’s yours?",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1hpfixk/top_5_movies_2024_that_you_watched_multiple_times/"
    },
    {
        "id": "1hpeppr",
        "author": "bkat004",
        "title": "80s TV stars - especially Don Johnson",
        "content": "Don Johnson was, maybe, the biggest TV star of the 1980s and 1990s.  He led a few Action flicks in the 90s.  But soon fell off the radar and returned to Television in Network TV in lacklustre efforts.\n\nThen I saw him in Django Unchained in 2008\n\nAnd Eastbound and Down in 2010.  And Cold in July in 2014.  And Brawl in Cell Block 99 in 2017.  And then The Watchmen in 2019.  And recently in Rebel Ridge this year 2024\n\nI'm proud of his comeback.  He's an underrated yet reliable actor.\n\nHe maybe cast as the villain mostly, but let's not forget - he's not only good at it, but I can only wonder what other 80s actors could be having the success he's having now !\n\nI haven't seen Tom Selleck in ages.  I've seen David Hasselhoff here and there, but not to the extent that I've seen Don Johnson.  I'm glad Lee Majors is still with us, but also not to the extent Don Johnson is killing it right now.\n\nAnyway, that's all I wanted to say.  Thanks for reading.",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1hpeppr/80s_tv_stars_especially_don_johnson/"
    },
    {
        "id": "1hphpl8",
        "author": "NuGGGzGG",
        "title": "Best quotes.",
        "content": "I just finished watching Tombstone again for probably the 400th time.\n\nAnd I'm quite partial to westerns, but when the crew is surrounded and Doc roles up drunk and Clayton calls him out.\n\n&gt; You're so drunk, you can't hit nothin'. In fact, you're probably seeing double.\n\nDoc responds...\n\n&gt;   I have two guns, one for each of ya.\n\nThere are so many great quote from movies and this one too. Most people think of I'm your Huckleberry. But this one realllly nails the scene, Doc, and how loose they played it for so long.\n\nAny other great movie quotes that might not be the most famous but still capture the most?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hphpl8/best_quotes/"
    },
    {
        "id": "1homiqy",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Nightbitch [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/okgLNsLgdo4V)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/okgLNsLgdo4V)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nA woman pauses her career to be a stay-at-home mom, but soon her domesticity takes a surreal turn.\n\n**Director:**\n\nMarielle Heller\n\n**Writers:**\n\nMarielle Heller, Rachel Yoder\n\n**Cast:**\n\n* Amy Adams as Mother\n* Scoot McNairy as Husband\n* Arleigh Snowden as Son\n* Emmett Snowden as Son\n* Jessica Harper as Norma\n* Zoe Chao as Jen\n* Mary Holland as Miriam\n\n**Rotten Tomatoes:** [59%](https://www.rottentomatoes.com/m/nightbitch)\n\n**Metacritic:** [56](https://www.metacritic.com/movie/nightbitch/)\n\n**VOD:** Hulu/Disney+",
        "upvotes": 363,
        "comments": 167,
        "media": null,
        "permalink": "/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/"
    },
    {
        "id": "1hphd45",
        "author": "KrisBent",
        "title": "I Need to Downsize, Majorly!",
        "content": "I'm thinking of moving out of state. I've always been the type to own VHS / DVD / Bluray\nAnd physical books\n\nBut if I'm moving out of state in the next few years I'm thinking it might be time to turn my collection digital...\n\nThoughts on services to use if I do decide to make the switch? (I'm really trying to get away from Amazon, so anything other than Prime Video :))",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1hphd45/i_need_to_downsize_majorly/"
    },
    {
        "id": "1hph01w",
        "author": "knarf3",
        "title": "[📽️][🤔😆] Keeping It in Genre",
        "content": "Here are several of these genre continuity roles I've noticed for some actors:\n- **Adrien Brody** playing a `Nazi-surviving urbane Ashkenazi Jew` in _The Pianist_ (2002) and _The Brutalist_ (2024);\n- **Russell Crowe** starring in 2 recent `pulpy religious horror films`: _The Pope's Exorcist_ (2023) and _The Exorcism_ (2024); and\n- **Nicholas Hoult** moving up the social ladder in `Dracula media universe` from _Renfield_ (2023) to _Nosferatu_ (2024).",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hph01w/keeping_it_in_genre/"
    },
    {
        "id": "1hpd27g",
        "author": "coronavirus1416",
        "title": "Best foreign and indie films this year 2024",
        "content": "What are the best foreign and indie films of 2024? I usually make a list of my favorite movies each year and am wanting to watch more foreign and independent films this year. My favorite movies the last few years have been foreign and indie films (RRR, Godzilla minus one, etc) so Im worried that I’m missing out on great movies. Im open to hearing about movies from all genres and countries. As long as there are subtitles available for the movie where it is listed. \n\nI posted a similar post at the beginning of this year and am interested to see to what recommendations people have.  ",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1hpd27g/best_foreign_and_indie_films_this_year_2024/"
    }
]