[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1ljpxqa",
        "author": "_crisz",
        "title": "La gestione della GTT per il deflusso dall'evento di San Giovanni è stato indecoroso",
        "content": "Mi ha fatto molto ridere il sindaco che sale sul palco e vuole esportare Torino nel mondo, ci fa fare i sondaggi e tutto quanto e poi non è in grado di prevedere che 50.000 persone in centro storico dove non si può parcheggiare devono in qualche modo tornare a casa. L'evento è finito a mezzanotte e un quarto, e ovviamente nessuno ha pensato a rinforzare le linee adiacenti alla zona, così che una mandria sconfinata di persone ha dovuto correre per prendere le ultime corse di molte linee, e pensare che i mezzi erano talmente tanto pieni che quelli che erano dentro si lamentavano che li schiacciavano e quelli rimasti fuori che giustamente avevano anche loro diritto a tornare a casa, considerando anche che domani si lavora. E non tutti possono permettersi un taxi, che non siamo figli di milionari. Poi la metro la si poteva prendere solo da porta nuova, con ultima partenza all'una che sia mai che c'è qualcuno più lento e non riesce a correre abbastanza, in quel caso saranno fatti suoi. Ecco, visto che a nessuno importerà mai di questo servizio scadente che paghiamo a caro prezzo, sarebbe bello poter comunicare questa cosa nel sondaggio del nostro amato sindaco, se qualcuno riesce a recuperarli il QR code. Grazie ",
        "upvotes": 107,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1ljpxqa/la_gestione_della_gtt_per_il_deflusso_dallevento/"
    },
    {
        "id": "1ljzlrw",
        "author": "Lollodoro",
        "title": "GTT vaffanculo",
        "content": "Per qualche ragione l'app GTT ha smesso di funzionare. Avevo dei biglietti che ora non potrò usare. Ho dovuto prendere il giornaliero alle macchinette che ha un prezzo assurdo di 4,50. GTT vaffanculo ancora una volta",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ljzlrw/gtt_vaffanculo/"
    },
    {
        "id": "1ljxxws",
        "author": "Antevasin94",
        "title": "Ciclofficina zona San Donato",
        "content": "Ciao, popolo di biciclettari di Torino. È giunto il momento che anche io cambi sponda e mi arrenda all’uso delle due ruote (se non altro perchè la GTT negli ultimi tempi è diventata un po’ … inaffidabile, mettiamola così).\nSono andata da decathlon e mi hanno proposto una bici a 270€ che anche no (devo solo andarci in città la sera quando vado a fare aperitivo e so già che sarò troppo sbronza per poter andare in macchina)… mi sapreste consigliare qualche ciclofficina in zona san Donato in cui comprarne una di seconda mano a un prezzo sensato?\n\nPs: non consigliatemi il balon, il 99,999999% delle bici è rubata e vorrei evitare  ",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ljxxws/ciclofficina_zona_san_donato/"
    },
    {
        "id": "1ljevfv",
        "author": "JerryScotti97",
        "title": "Sono un noto buttafuori nei locali di Torino, accetto qualsiasi domanda.",
        "content": "Ciao ragazzi, volevo aprire un discorso sui vari locali nella città di Torino, sono curioso di sapere cosa ne pensate.\n\nSono nel mondo dei locali notturni da un paio di anni, ma mi ritengo un buttafuori 2.0...Ho visto vari miei colleghi lavorare in modo \"hold school\". \n\n  \nPremetto che la mansione da buttafuori è cambiato con il passare degli anni ( e in meglio).\n\n  \nSkill importante? \n\n  \nSono un atleta professionista di sport da combattimento. ( non specifico lo sport perché altrimenti non sarei più in anonimo.)",
        "upvotes": 43,
        "comments": 106,
        "media": null,
        "permalink": "/r/torino/comments/1ljevfv/sono_un_noto_buttafuori_nei_locali_di_torino/"
    },
    {
        "id": "1ljzi6b",
        "author": "Manuel7201",
        "title": "Posti per appartarsi",
        "content": "Ciao a tutti, specifico che non sono di Torino. Qualcuno saprebbe consigliarmi dei posti in cui potersi appartare con la propria ragazza (anche in macchina)?\nIdealmente sarebbe meglio non troppo fuori città.\nGrazie\n\n(Se è contro le regole del SUB chiedo scusa ai MOD)",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ljzi6b/posti_per_appartarsi/"
    },
    {
        "id": "1lj8ovy",
        "author": "mortified_penguin_00",
        "title": "Situazione invivibile in via Po",
        "content": "I senzatetto/richiedenti di elemosina e/o qualsiasi altra cosa stanno diventando particolarmente molesti\n\nQual è la vostra tattica per evitare rotture di cazzo?",
        "upvotes": 16,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1lj8ovy/situazione_invivibile_in_via_po/"
    },
    {
        "id": "1ljjtob",
        "author": "scemo_chi_legge123",
        "title": "ho trovato un abbonamento della GTT a terra, si tratta di un signore anziano (per privacy non mostro foto), cosa dovrei fare?",
        "content": "",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ljjtob/ho_trovato_un_abbonamento_della_gtt_a_terra_si/"
    },
    {
        "id": "1lj9b52",
        "author": "amicidilazzaro",
        "title": "Bagni, docce, barba, capelli e vestiario per i senzadimora a Torino",
        "content": "Bagni, docce, barba, capelli e vestiario per i senzadimora a Torino [https://www.amicidilazzaro.it/it/solidarieta/servizio-bagni-doccia-barba-e-capelli-a-torino-servizi-per-chi-e-in-difficolta/](https://www.amicidilazzaro.it/it/solidarieta/servizio-bagni-doccia-barba-e-capelli-a-torino-servizi-per-chi-e-in-difficolta/)",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lj9b52/bagni_docce_barba_capelli_e_vestiario_per_i/"
    },
    {
        "id": "1ljk6xm",
        "author": "Inside-Discipline359",
        "title": "Fuochi San Giovanni",
        "content": "Qualcuno sa se senza aver preso i biglietti si riescono a vedere i fuochi da un bel posto???",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ljk6xm/fuochi_san_giovanni/"
    },
    {
        "id": "1ljj578",
        "author": "Outrageous_Pea4161",
        "title": "Tattoo Torino",
        "content": "Domani me ne vado dopo quattro anni vissuti qui, in un raptus emozionale vorrei fare un tatuaggio senza vendermi un rene. Qualche posto economico e senza appuntamenti ( a parte taxi tatoo)? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ljj578/tattoo_torino/"
    },
    {
        "id": "1ljoub4",
        "author": "ShadowStrikeSP",
        "title": "Locale per cena di compleanno",
        "content": "Ciao a tutti, volevo chiedere un consiglio. Io non sono di Torino e venivo a Torino giovedì per andare a cena con la mia ragazza per il suo compleanno. Ho visto, girando su Internet, vari posti dove poter prenotare però sono molto indeciso. Mi consigliate qualche ristorantino carino dove andare per cena?  Possibilmente zona a Porta Susa o almeno il più vicino possibile, perché ci muoviamo solo con i mezzi.\nGrazie mille a tutti ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ljoub4/locale_per_cena_di_compleanno/"
    },
    {
        "id": "1ljo39i",
        "author": "initial_chris",
        "title": "Ancora black-out",
        "content": "Zona Vanchiglia / Regina Margherita da quasi un oretta buona sono senza corrente. Come è la situazione negli altri quartieri?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ljo39i/ancora_blackout/"
    },
    {
        "id": "1lixygh",
        "author": "Sea-Salt-3093",
        "title": "I media stanno esagerando la situazione Barriera oppure è davvero invivibile?",
        "content": "Condividereste con me qualche esperienza personale? Intendo dire, viverci o fare una passeggiata là è come vivere o camminare in un qualsiasi quartiere popolare o quartiere intorno alla stazione, o è peggio?  \n\nAnche nella mia città ci sono risse in stazione, ho assistito a scene particolari in zona stazione (es. Un mio amico davanti ai miei occhi è stato   accerchiato da persone che volevano vendergli della droga in maniera forzata mentre uno cercava di rubargli il portafoglio, oppure di notte c’è gente strana che basta non guardare negli occhi (la mia impressione è che sia così perché vogliono venderti droga e cercano di capire dallo sguardo chi sia interessato e comunicarlo in modo non verbale) , quando vado in bici ricevo catcalling “bella di mamma!” “Come ti chiami?” “Dove vai?”, e ci sono delle persone che dormono a terra e una volta una persona non reagiva più e si pensava fosse morta. Risse ma non spesso, qua non ci sono problemi di “bande”.\n\nQuello che volevo dire è che nonostante questi problemi, nessuno mi ha per esempio derubata dal nulla senza che me ne accorgessi, non ho mai visto un coltello per strada e se mi faccio i cazzi miei , tranne quando vado in bici per qualche motivo, nessuno mi rompe i coglioni. \n\nInvece là, tenendo comunque conto che è evidente ci sia del degrado, la situazione è davvero così pericolosa? Si rischia molto vivendo la? \n\nChiedo perché dai media sembra sia raro che qualche ragazza possa camminare la da sola o che qualcuno non abbia la costante paura che volino coltelli , ma vorrei capire se la situazione è più “ok c’è degrado e non è il massimo” o proprio di pericolo \n ",
        "upvotes": 22,
        "comments": 43,
        "media": null,
        "permalink": "/r/torino/comments/1lixygh/i_media_stanno_esagerando_la_situazione_barriera/"
    },
    {
        "id": "1lj84zc",
        "author": "chiaracau",
        "title": "Abbonamento GTT disoccupati",
        "content": "Ho fatto un abbonamento per disoccupati a fine marzo, periodo in cui ero disoccupata e risultavo iscritta a CPI.\nAdesso però non lo sono più (anche se in una condizione un po' precaria). L'abbonamento ha validità di un anno, in teoria, e continua a funzionare.\nQualcuno sa se dovrei passare dalla GTT a disattivarlo o se posso continuare a usarlo fino a scadenza?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lj84zc/abbonamento_gtt_disoccupati/"
    },
    {
        "id": "1lj5v0c",
        "author": "Lower-Artichoke4485",
        "title": "San Giovanni - posso andare ai Muri senza il biglietto per il concerto?",
        "content": "dalla cartina non si capisce una mazza..posso andare ai murazzi (per capirci dove c'erano tutti i locali storici) come si faceva una volta senza il biglietto del concerto? ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lj5v0c/san_giovanni_posso_andare_ai_muri_senza_il/"
    },
    {
        "id": "1lj2k5b",
        "author": "Defiant-Wishbone1345",
        "title": "any med students in torino?",
        "content": "hi, im looking for students studying medicine in English in the university of turin/torino, just to ask a question or two about the uni specifically. so if u go there id appreciate if you would comment or dm please, thank you, x",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lj2k5b/any_med_students_in_torino/"
    },
    {
        "id": "1liu699",
        "author": "rivka000",
        "title": "Caldo",
        "content": "Si squaglia ma che cazzo è",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1liu699/caldo/"
    },
    {
        "id": "1lj532c",
        "author": "maschera84",
        "title": "Mi consigliate una ditta per ristrutturazione appartamento?",
        "content": "Ciao ragazzi,\n\nHo preso un nuovo appartamento in città che ha bisogno però di una ristrutturazione. Purtroppo non conosco nessuno e sono così disperato da dover chiedere a Reddit. \n\nConoscete qualche piccola ditta che sia seria, onesta ed economicamente ragionevole (non voglio dire economica, altrimenti sembra che voglia la luna, ma magari!) a Torino città?\n\nGrazie mille in anticipo.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lj532c/mi_consigliate_una_ditta_per_ristrutturazione/"
    },
    {
        "id": "1likk5w",
        "author": "Muted_Company_8823",
        "title": "Aiuto gatto smarrito",
        "content": "Buonasera a tutti, non ho mai usato reddit quindi non so nemmeno se lo sto usando nel modo giusto, ma qualcuno mi potrebbe aiutare a diffondere l'annuncio di questo gatto smarrito questo sabato presso la facoltà di farmacia di Torino? La zona è proprio intorno al dipartimento di scienze mediche, e la gatta è stata vista l'ultima volta in una residenza per studenti in Via Ormea. Se qualcuno sapesse come raggiungere gruppi di studenti che vivono/studiano lì, magari sarebbe più facile avvistarla e recuperarla. E' molto spaventata. Grazie in ogni caso. \n\nhttps://preview.redd.it/bhcrsv99ap8f1.jpg?width=899&amp;format=pjpg&amp;auto=webp&amp;s=a91a0b0d571557b5bc0a86abe54098b74d1a3f7a\n\nIl post da condividere: [https://www.facebook.com/photo?fbid=31006853825580727&amp;set=a.468369753189202](https://www.facebook.com/photo?fbid=31006853825580727&amp;set=a.468369753189202)",
        "upvotes": 17,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1likk5w/aiuto_gatto_smarrito/"
    },
    {
        "id": "1lj30sp",
        "author": "macomaco-1",
        "title": "Quartieri dove comprare casa a Torino",
        "content": "Giorno a tutti, vorrei chiedere la vostra zona su quartieri tassativamente raggiunti dalla metro ( quindi la porzione del quartiere interessata tipo nizza millefonti o sansa) nei quali comprare casa. Sto valutando varie opzioni comode per una persona senza auto, quindi con servizi e locali raggiungibili comodamente a piedi (fino a 1-1,5km€). Sto cercando un quartiere vivo e se possibile sicuro, che non risenta della svalutazione immobiliare se possibile. Io attualmente abito in San Salvario, ma qui il mercato immobiliare è complicato, case mediamente costose e che vanno a ruba prima ancora di poterle vedere.\n\nGrazie in anticipo.\n",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lj30sp/quartieri_dove_comprare_casa_a_torino/"
    },
    {
        "id": "1limbl0",
        "author": "blunathan",
        "title": "10 anni di reddit e questo è forse il sub che seguo di più!",
        "content": "https://preview.redd.it/mg7p9c53mp8f1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=3f5e2cd877cfed94b7005d728c3e6b068d04636b\n\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1limbl0/10_anni_di_reddit_e_questo_è_forse_il_sub_che/"
    },
    {
        "id": "1lis2rh",
        "author": "Ok_Original_2861",
        "title": "Gamer a Torino",
        "content": "Qualche videogiocatore di Torino ? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lis2rh/gamer_a_torino/"
    },
    {
        "id": "1linx3f",
        "author": "deathofaeris9",
        "title": "Parade along Via Po",
        "content": "Hi, I am a tourist and witnessed a parade today. Didn’t find any information on it online. \n\nWould any kind soul be able to share what the parade was about? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1linx3f/parade_along_via_po/"
    },
    {
        "id": "1lihb6t",
        "author": "nickname1917",
        "title": "App per pagare sosta sulle strisce blu",
        "content": "ciao a tutti,\n\nfino ad ora ho usato l'app di Intesa Sanpaolo per pagare i parcheggi sulle strisce blu ma siccome era comoda dal 1 Luglio rimuovono questa funzionalità... avete alternative valide da consigliare?\n\nLa comodità maggiore era la possibilità di prolungare la sosta da remoto o interromperla e pagare solo l'effetivo utilizzo.\n\ngrazie",
        "upvotes": 5,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1lihb6t/app_per_pagare_sosta_sulle_strisce_blu/"
    },
    {
        "id": "1lialzu",
        "author": "Laepus_",
        "title": "Parco Dora pericoloso?",
        "content": "Buongiorno! \nPer motivi vari ed eventuali potrei dover andare qualche sera in settimana (orario 21:00-23:00) al parco Dora o lì nei paraggi.\nNon ho mai frequentato quella zona, non so se ci sono parcheggi, se per girarci da sola è effettivamente così pericolosa come dicono o se avete consigli da darmi.\n\nGrazie a chi si prenderà il tempo per rispondere ✨",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lialzu/parco_dora_pericoloso/"
    },
    {
        "id": "1li9y2d",
        "author": "Competitive_Pop_2345",
        "title": "Chi di voi verrà al Kappa Future Festival?",
        "content": "Cercavo qualche bella personcina con cui unirsi al famoso festival techno che si terrá il 4-5-6 luglio al Parco dora di Torino. Chi si aggrega mi dica! 💪🏻",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1li9y2d/chi_di_voi_verrà_al_kappa_future_festival/"
    },
    {
        "id": "1lie7jq",
        "author": "shibarama",
        "title": "Torino FC souvenirs/clothes?",
        "content": "Ciao a tutti!\n\nI'm about to leave Turin and I want to buy a official shirt or hoodie of Torino FC. Which store has the best prices and variety? \n\nSo far I've seen some stores that sells souvenirs: one in front of the stadium, another one near the city center and a Joma store near Philadelphia bus stop. Is there any other place that I should look at it? I just want fair prices.\n\nThanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lie7jq/torino_fc_souvenirsclothes/"
    },
    {
        "id": "1lhiqvd",
        "author": "Skizoid666",
        "title": "La Scuola Holden è come Scientology?",
        "content": "https://scrolloergodubito.substack.com/p/la-scuola-holden-e-la-filiera-della",
        "upvotes": 46,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yaAIK7T76kH_QlBBWe2j6RrVN4q4hVkcQ0msdA00cbY.jpeg?auto=webp&amp;s=ebb1f78153bfa8c3b46fc0a4bd54c123ea578b29"
        },
        "permalink": "/r/torino/comments/1lhiqvd/la_scuola_holden_è_come_scientology/"
    },
    {
        "id": "1lht5uz",
        "author": "blunathan",
        "title": "Torino by Magritte",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x6z3i2oyhi8f1.png?auto=webp&amp;s=3379241c12930bd338dcb2183b468b81fa90bc4a"
        },
        "permalink": "/r/torino/comments/1lht5uz/torino_by_magritte/"
    },
    {
        "id": "1lhqj9a",
        "author": "CallMeSaul1708",
        "title": "Uscita con una ragazza",
        "content": "Ciao a tutti, sono qui per chiedervi una mano, questa sera dovrei uscire con una ragazza che sta in zona Re Umberto (metro) ma non ho la più pallida idea di cosa fare, siccome non conosco per nulla la città. Mi chiedevo cosa potremmo fare in zone vicine, si era parlato anche del centro, lei ha proposto il cinema per poi tirarsi indietro siccome non è il miglior contesto per poter parlare. Grazie in anticipo🙏🏻",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1lhqj9a/uscita_con_una_ragazza/"
    }
]