[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p34ays",
        "author": "lockmasterg",
        "title": "Something new on main page",
        "content": "I cant be the only one. There's literally 1000s of movies and shows on Netflix. Why does my main page only show me the same 50-100 titles over and over. Most of what's there I've already seen and rated. There needs to be a refresh screen button or something.",
        "upvotes": 116,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1p34ays/something_new_on_main_page/"
    },
    {
        "id": "1p3fej2",
        "author": "THEMADLAD_2009",
        "title": "Should I watch boots?",
        "content": "I have seen a bit of it on tiktok and it looks like a pretty decent show.\nI don’t care about all the “pink marine” stuff\nI just want to know if it’s worth the watch.",
        "upvotes": 25,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1p3fej2/should_i_watch_boots/"
    },
    {
        "id": "1p3kre8",
        "author": "xTHUGGY_YETIx",
        "title": "Thanks netflix very much",
        "content": "Was halfway binge  watching star trek deep space nine and they had updated the app and now it's gone erase faced from the earth fml 😭 even star trek the next generation is gone my god whyyy ",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p3kre8/thanks_netflix_very_much/"
    },
    {
        "id": "1p3n305",
        "author": "No-Ability-2272",
        "title": "any shows/movies like last samurai standing?",
        "content": "im really into the whole samurai stuff and whatnot. Im kinda pissed off at the cliffhanger in last samurai standing lol.\n ive also watched rurouni kenshin and golden kamuy, i really like these types of movies and shows so if you guys have suggestions i would be extremely grateful! \nthank you!!",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p3n305/any_showsmovies_like_last_samurai_standing/"
    },
    {
        "id": "1p3izoz",
        "author": "Natali-Gessoli",
        "title": "Is it worth getting the no-ads version of Netflix?",
        "content": "Since the new Stranger Things season will be coming out soon, I was debating on whether I should get a Netflix account.\nI’m a college student so I am on a tight budget, and the idea of a $7.99 subscription caught my eye.\nHowever, idk how many ads there are and I am worried they are going to be a lot. I have also heard that not all shows and movies are available, but I’m not fully sure how much is available (like is it a 50/50 available ratio??)\nDoes anyone have this plan, and if so, do you think it’s worth it or should I spend the extra $10 a month for the full experience?",
        "upvotes": 7,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1p3izoz/is_it_worth_getting_the_noads_version_of_netflix/"
    },
    {
        "id": "1p35lrw",
        "author": "Front_Wade1725",
        "title": "Rewatching stranger things with my kids who have never seen it! So excited for the new season!",
        "content": "Anyone else rewatching and discovering anything new? We just finished season 3, my kids were so sad …. left. Who else is ready for season 5? Also thinking about doing a stranger things feast for them to watch the new episodes!",
        "upvotes": 37,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p35lrw/rewatching_stranger_things_with_my_kids_who_have/"
    },
    {
        "id": "1p3dkgd",
        "author": "ShinyBuizel22",
        "title": "What's a good K-Drama to recommend for a first timer?",
        "content": "So I hear Netflix is the place for K-Dramas (I mean, for an American audience, idk if other services have a similar library), but I also hear the genre pretty popular so I do want to see for myself. But yes I'm basically a newcomer, so I'm just curious what you'd recommend for a newcomer?",
        "upvotes": 14,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1p3dkgd/whats_a_good_kdrama_to_recommend_for_a_first_timer/"
    },
    {
        "id": "1p3k3t1",
        "author": "harpreetthind",
        "title": "Question",
        "content": "What scary movies or horror movies does everybody recommend watching on Netflix already watched Brooklyn Nine-Nine good girls, which probably won’t have a new season which sucks what does everyone recommend watching? Taking suggestions? Greatly appreciated. Thanks.",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p3k3t1/question/"
    },
    {
        "id": "1p3bnfy",
        "author": "EffectNumerous",
        "title": "i watched the black rabbit a couple of days ago",
        "content": "Yeah! this show is amazing! I was created with lots of imagination and creativity! I think there are 8 or 9 episodes and just finished episode 6 last night. i find myself bitting my nails from the suspense. i highly recommend it! great actors! ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3bnfy/i_watched_the_black_rabbit_a_couple_of_days_ago/"
    },
    {
        "id": "1p38nmp",
        "author": "Both-Patient-6193",
        "title": "Please suggest “Rewatch” worthy episodes of Black Mirror",
        "content": "I just feeling like rewatching few episodes of Black Mirror but can’t decide. Please suggest the best episodes you like which are worthy of rewatching.",
        "upvotes": 10,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1p38nmp/please_suggest_rewatch_worthy_episodes_of_black/"
    },
    {
        "id": "1p3hvan",
        "author": "guncotton",
        "title": "Info screen gone on Smart TV app?",
        "content": "Anyone else? There is no info screen anymore where you can read about a movie/watch a trailer.\n\nI click on a thumbnail and it just starts playing.\n\nJust noticed last night when searching for movies about alpinism. I got my list of search results, but it was all just thumbnails of the movies. I click one, it starts playing. There was no way to get to the info page, where I could read what the heck the movie was about. What kind of search results UX is this? I want to be able to read about the movie I just searched, not just start playing it from the cover photo alone.\n\nThen i noticed this was the case anywhere in the app, you click, it starts playing. In some areas there is a mini description under the thumbnail but not all.\n\nIs the info screen gone now?\n\nI'm on a Samsung 55\" smart tv.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3hvan/info_screen_gone_on_smart_tv_app/"
    },
    {
        "id": "1p3gt3c",
        "author": "feministacareers",
        "title": "The Tourist - vanished?",
        "content": "I was in the middle of Season 2, and it just disappeared. Usually shows that are leaving have a flag “leaving soon.” Does anyone have any idea what happened? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3gt3c/the_tourist_vanished/"
    },
    {
        "id": "1p3dk7l",
        "author": "RedditCitizenScore",
        "title": "Apple TV app logs out",
        "content": "I have to log in every single time I open the app.\n\nNo shared password\n\nI travel for work I used it on my Android TV stick when at hotels.\n\nHow does one fix this, it is just cancelling the only option",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3dk7l/apple_tv_app_logs_out/"
    },
    {
        "id": "1p2nbaj",
        "author": "RiseDelicious3556",
        "title": "This Is Going To Hurt",
        "content": "Ben Wishaw is excellent in this series. I hope it gets renewed by Netflix. This is the first medical  series that is somewhat realistic while also portraying good drama/comedy.   It's British, so it involves an NHS hospital setting background, but nonetheless realistic from my perspective as a former healthcare provider. Excellent acting, good story line. Bravo, netflix. \n\nNow if I could just find a good thriller series that doesn't jump the shark ",
        "upvotes": 36,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p2nbaj/this_is_going_to_hurt/"
    },
    {
        "id": "1p3c274",
        "author": "nicojpeg",
        "title": "netflix won’t play on TV. please help!!",
        "content": "hi! so i’m trying to airplay to my tv after 3 years of not turning it on. it gets stuck on this eternal searching loop on every app. i tried going straight to the netflix app but it won’t load either. it’s fully updated, has a good internet connection (literally next to the router). it’s a vizio smartcast, i can’t find the model but it was purchased 2018-2019 and its model name is D32-F1. it won’t load anything :(",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3c274/netflix_wont_play_on_tv_please_help/"
    },
    {
        "id": "1p2rvzy",
        "author": "Plane-Web-7158",
        "title": "Recommendations for tv-14 shows on Netflix?",
        "content": "I love any shows that are from the early 2000s. I watched Gilmore girls, Gossip Girl, Ginny and Goergia, How I Met Your Mother, Greys Anatomy, Brooklyn 99, xoxo kitty and I'm probably missing a few but I'll edit it if I remember. I don't like k-dramas. I'm not a big fan of Netflix shows (ex: Never have I Ever, xoxo kitty) but if it's really good then I might give it a try!",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p2rvzy/recommendations_for_tv14_shows_on_netflix/"
    },
    {
        "id": "1p347d5",
        "author": "Halloween-Year-Round",
        "title": "Visiting Netflix House Philadelphia &amp; \"Wednesday - Eve of the Outcasts\"",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p347d5/visiting_netflix_house_philadelphia_wednesday_eve/"
    },
    {
        "id": "1p2ucda",
        "author": "phunchurchgirl",
        "title": "Where did Netflix previews and trailers go?",
        "content": "I can no longer see previews of a show or movie in the  Netflix app on my TV. Things like \"More Like This\" or episode lists are only visible once the show has started.  Even the option to add something to your list has moved, forcing you to start something before being able to decide if you want to watch.  \n\nWhose poor idea was this and how do I make it stop?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p2ucda/where_did_netflix_previews_and_trailers_go/"
    },
    {
        "id": "1p33lsu",
        "author": "dudelovescak3",
        "title": "Profile transfer",
        "content": "I want to transfer a profile from my account to another profile on the same account, is that possible? When i go to profile transfer it says i cant transfer to the same account im logged into",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p33lsu/profile_transfer/"
    },
    {
        "id": "1p1suvv",
        "author": "chunkybonks",
        "title": "The Beast in Me - Matthew Rhys is perfection",
        "content": "I have been a huge fan of Matthew Rhys for years. Hello Brothers and Sisters and The Americans. He usually plays the good guy. What a departure this role was. His facial expressions alone are so telling. He definitely pulled off the suave sociopathic part hands down. \n\nNow Claire Danes was something else. I kept wishing she would have reined her face in at least 50%. It was just too much. Too much quivering. Too much warbling. Get it together woman. \n\nBrittany Snow is in everything these days. \n\nThis was one of the best Netflix original series in awhile. They’ve been pumping out a lot of junk lately. I was genuinely excited to hit play on the next episode and see how this all ended up. ",
        "upvotes": 561,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1p1suvv/the_beast_in_me_matthew_rhys_is_perfection/"
    },
    {
        "id": "1p3i654",
        "author": "1hate2choose4nick",
        "title": "Netflix Just Lost The Perfect Opportunity To Win The Streaming Wars For Good",
        "content": "Sometimes I wonder how so much incompetence is gathered in the management of Netflix. So glad I quit my subscription.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p3i654/netflix_just_lost_the_perfect_opportunity_to_win/"
    },
    {
        "id": "1p2oiri",
        "author": "LankyCheck9603",
        "title": "Shows and movies similar to Orphan Black or any thriller/mystery/sci-fi Thanks !",
        "content": "Just finished the entire series of Orphan Black and need some recs please and thanks! I like psychological thrillers , mysteries and suspense and shows and movies with plot twists ..... help me out y'all !!! Thank you !!!! ",
        "upvotes": 6,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1p2oiri/shows_and_movies_similar_to_orphan_black_or_any/"
    },
    {
        "id": "1p2w02t",
        "author": "Maleficent_Impact934",
        "title": "Download series in files.",
        "content": "Hello, today I saw that Netflix is removing my favorite series (Supernatural) from their library, and I wanted to know if anyone knows a way to download and store the episodes locally so I can watch them even after they remove it.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p2w02t/download_series_in_files/"
    },
    {
        "id": "1p2h5mj",
        "author": "Original2021",
        "title": "The Beast in Me has near perfect casting",
        "content": "Thiis how you cast a drama series! I’ve been a fan of Claire Danes since Homeland and Matthew Rhys since the Americans. They both carried the series for all episodes. I’m hoping Homeland comes back in some form as well.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p2h5mj/the_beast_in_me_has_near_perfect_casting/"
    },
    {
        "id": "1p2n4pm",
        "author": "Particular_Cow_9302",
        "title": "Don’t Look Up",
        "content": "One thing that isn’t talked about enough is Jennifer Lawrence’s and Leonardo DiCaprio’s chemistry in Don’t  Look Up. \n\nWhat was so great about it is their team dynamic. For example, Mindy allowed named the asteroid after her, Dibiask, and she always followed his lead in meetings. Then,  they share a mutual care for each other even when she’s erratic and he’s being a sleaze with the whole affair. I feel they conveyed a real “bud” relationship. I hope one day they can work together again. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p2n4pm/dont_look_up/"
    },
    {
        "id": "1p2ukve",
        "author": "grudig13",
        "title": "Profile transfers of extra member",
        "content": "Hello, I want to cancel my netflix subscription. I have one extra member on my account, who wants to keep his profile under a new account. Is it possible to convert the extra member into a full account (similar to the profile transfer option on the main account)? I only see the profiles of the main account and can‘t select the extra member when trying to make a profile transfer.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p2ukve/profile_transfers_of_extra_member/"
    },
    {
        "id": "1p1w5jd",
        "author": "TwlightPrincess",
        "title": "Looking for something not depressing to watch on Netflix",
        "content": "Any suggestions for something to watch that is not depressing on Netflix? Could be a show or movie. I’m depressed so I need to find something interesting, possibly funny just not depressing please",
        "upvotes": 82,
        "comments": 251,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5jd/looking_for_something_not_depressing_to_watch_on/"
    },
    {
        "id": "1p1uzt4",
        "author": "CheesecakeExotic5713",
        "title": "The beast in me",
        "content": "I finished the whole season in my 8 hour overnight shift 😭 i was so into it and honestly i kept flip flopping between Nile being guilty or not. I also keep seeing a lot of Aggie hate but i thought the role was played very well and i would also be freaking out is a presumed murderer brought me out to his “running path”",
        "upvotes": 91,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1p1uzt4/the_beast_in_me/"
    }
]