[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pdnga8",
        "author": "GuineaPKilledMe",
        "title": "Sean Combs: The Reckoning - The jurors that agreed to sit down for documentary are disgusting.",
        "content": "If every juror in Diddy's case truly felt the same way as those two they interviewed for the doc, no wonder Diddy only got away with 50 months.\n\nBoth of them seemed extremely biased. The male juror basically put all the blame on Cassie and showed absolutely no sympathy for her. He immediately gave me the creeps. Seems like he really didn't value women at all.\n\nThe woman was even worse. She couldn't even hide her delusional love for Diddy. You can tell she was jumping with joy every time how she explained how Diddy would make eye contact with the jurors. She's so delusional I wouldn't doubt if she thought he was making eye contact with only her.\n\nThose two were absolutely vile in their reasoning for only counting him with two charges.\n\nEdit: Sorry about the grammar error in the title. It was suppose to say \\*The documentary",
        "upvotes": 125,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnga8/sean_combs_the_reckoning_the_jurors_that_agreed/"
    },
    {
        "id": "1pdkhjy",
        "author": "Wayman52",
        "title": "Netflix is removing Lost, Supernatural and The 100 all in one month.",
        "content": "This is ridiculous, there's so much slop on this site now, maybe 1 in 10 shows (and that's being generous) is actually watchable, and they continually get rid of beloved movies and shows. They cancel good Netflix originals or just quietly never giving them a second season, why does anyone keep their subscription? ",
        "upvotes": 182,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkhjy/netflix_is_removing_lost_supernatural_and_the_100/"
    },
    {
        "id": "1pdosrd",
        "author": "leangreenmonkey",
        "title": "Thirty minutes into Wolf of Wall Street and now it’s unavailable to watch",
        "content": "Actually so unbelievable, I was thirty minutes into The Wolf of Wall Street on Netflix, left the app for a few minutes, came back - and now the movie is no longer available on Netflix and has the “remind me” alarm button. What the actual hell, this is never happened to me in the middle of watching a movie. Anybody else?",
        "upvotes": 26,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1pdosrd/thirty_minutes_into_wolf_of_wall_street_and_now/"
    },
    {
        "id": "1pden8k",
        "author": "brysonboompaul",
        "title": "Kalenna Harper Claims Diddy Was Awake 14 Days On Cocaine In Netflix Doc",
        "content": "",
        "upvotes": 31,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pden8k/kalenna_harper_claims_diddy_was_awake_14_days_on/"
    },
    {
        "id": "1pd5cy5",
        "author": "ohsoyouhunnii",
        "title": "The Beast in Me",
        "content": "I'm sitting here watching episode 6 &amp; I have been so annoyed at this show since the beginning &amp; am finally feeling the urge to tell someone. \n\nWhy am I annoyed might you ask? 1. because its such a slow burner &amp; 2. Aggie DOES NOT KNOW HOW TO SAY NO TO NILE. Its annoying as hell. Then the faces she makes, the stuttering every time she speaks to him—I'm aware that its acting but she is so bad &amp; needs to tell his weird ass NO. \n\n😆 I just needed to rant!",
        "upvotes": 83,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5cy5/the_beast_in_me/"
    },
    {
        "id": "1pdclni",
        "author": "dailymail",
        "title": "Love Is Blind's Alexa and Brennon Lemieux announce they are divorcing after four years of marriage and just one year after welcoming their daughter",
        "content": "",
        "upvotes": 30,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pdclni/love_is_blinds_alexa_and_brennon_lemieux_announce/"
    },
    {
        "id": "1pdeo6y",
        "author": "brysonboompaul",
        "title": "Gigolo Recalls Diddy Beating Up Cassie During Sex In New Netflix Doc",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdeo6y/gigolo_recalls_diddy_beating_up_cassie_during_sex/"
    },
    {
        "id": "1pdkqco",
        "author": "lifesyndrom",
        "title": "Am I the only one who can’t stand Shelley in The beast in me (mini-series)",
        "content": "So far I’m halfway through the show \n\n\n\nLike I get her frustration but she’s doing too much (and I’m not saying Aggie is perfect or anything) \n\n\n\nLike the way she’s judging Aggie about that guy who killed their son (forgot his name) how tf does she expect Aggie to move on ON TOP of the guy not getting any prison time????? I wouldn’t rest if someone recklessly killed my child via drunk driving and didn’t get any type of punishment. and he had the audacity to come to his grave…..I would’ve lost it \n\n\n\nAnd then she tries to blame Aggie for his “death” is beyond wild. I understand she moved on  but expecting Aggie to move on as easily as she did is crazy \n\n\nAnd when she got offered the gallery opportunity, I didn’t recall her calling Aggie to thank her…but when she lost it, she was so quick to call her and blame her. It’s like she’s only focusing on the bad things.\n\n\n\nOnce again I get her frustration in general but she’s doing too much in my opinion ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkqco/am_i_the_only_one_who_cant_stand_shelley_in_the/"
    },
    {
        "id": "1pd6pbo",
        "author": "JelliBabySkyyy",
        "title": "Sean Combs: The Jury",
        "content": "In my country, we don't use the jury system. Watching the interviews with the jury members really shocked me. They seemed so chuffed in their interviews. I was losing my mind!\nIs this normal? For people in jury system countries, are you guys comfortable putting your life in the hands of randos that didn't go to law school and are exposed to uneducated tik tok opinions?",
        "upvotes": 44,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6pbo/sean_combs_the_jury/"
    },
    {
        "id": "1pdu571",
        "author": "Fun_Smile3175",
        "title": "Why is Netflix not working on my TV after updating it?",
        "content": "I’m so frustrated because this happened right after I installed the latest system update for my Samsung smart TV—before the update, Netflix worked perfectly fine for years without a single glitch. Last night, my TV popped up a notification saying a software update was available, and I figured it would just fix some minor bugs, so I let it install while I grabbed dinner. When I came back and tried to open Netflix, the app either freezes on the loading screen with the red logo or crashes immediately back to the home screen.\n\nI’ve tried all the basic fixes I could think of first: restarted the TV three times (unplugging it for 30 seconds each time like some guides suggested), checked my Wi-Fi connection (it’s stable at 50 Mbps, and other streaming apps like Disney+ and Hulu work flawlessly on the same TV), and even updated the Netflix app itself through the TV’s app store—though it said it was already on the latest version. I also tried signing out of my Netflix account and signing back in, but I can’t even get to the login screen most of the time. When it does briefly load, there’s no error code shown, just a black screen before it closes.\n\nMy TV isn’t that old—got it in 2022—and it’s always been compatible with Netflix before the update. I checked Netflix’s status page and there’s no server outage reported in my area. I even tried clearing the app’s cache through the TV’s settings, but that didn’t help either. Has anyone else had this issue after updating their TV’s system? I’m not tech-savvy enough to mess with advanced settings, so any simple solutions or advice would be amazing",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdu571/why_is_netflix_not_working_on_my_tv_after/"
    },
    {
        "id": "1pdrsu1",
        "author": "undeadbirdo",
        "title": "Wolf of Wall Street Removed and Censored",
        "content": "Hi guys. I've seen a couple people post about how they were watching the Wolf of Wall Street and it suddenly refused to play with a \"title not available to watch instantly\" error. This happened to me too, so I used the chat feature to ask about it. I cant post the screenshots, but the agent said: \n\n\"About your concern regarding the title. I checked and confirmed that this title is not available in your location.\"\n\n\"Currently we do not have issue but can you send us a report regarding this title\"\n\n\"As I checked the title lists based in the US, this title is not seen meaning it's not available.\"\n\nI live in Texas, so im wondering if there's local laws that banned the movie or something like that. There are articles online from like 5 days ago saying it was coming back on the 1st of December, so i know im not crazy!\nAlso, what I was able to watch was censored in weird spots, and I know for a fact it wasn't like this a couple years ago. Does anyone else find this fishy??\n\nEDIT: The movie is back on Netflix, uncensored. False alarm everybody lmao",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pdrsu1/wolf_of_wall_street_removed_and_censored/"
    },
    {
        "id": "1pclmvl",
        "author": "BurgerNugget12",
        "title": "‘Stranger Things 5’ Opens With 59.6 Million Views, Netflix’s Biggest English-Language TV Debut Ever",
        "content": "",
        "upvotes": 649,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1pclmvl/stranger_things_5_opens_with_596_million_views/"
    },
    {
        "id": "1pctv6n",
        "author": "Glad-Ad-6240",
        "title": "sean combs the reckoning",
        "content": "This doc was put together so well. What really gets me is how he got so huge without much talent, just by attaching himself to other people’s success. Diddy has harmed a lot of people, but the part that blew my mind was the evidence pointing toward his involvement with Pac’s death. I honestly think he had something to do with both Biggie and Pac’s death and was jealous of both him and Biggie, like he created this whole “beef” to get rid of them. A 50-month sentence isn’t long enough.\n",
        "upvotes": 205,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1pctv6n/sean_combs_the_reckoning/"
    },
    {
        "id": "1pdupz6",
        "author": "NikkoMai",
        "title": "Netflix Facebook page",
        "content": "Am I the only one who gets this, when I click on the Facebook page for Netflix it takes me back in time to 2019 with the cover being The Crown and the last post also being from 2019? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pdupz6/netflix_facebook_page/"
    },
    {
        "id": "1pddrf7",
        "author": "Mucek121",
        "title": "What to watch next After Life or The Crown or House of Cards or Behind Her Eyes",
        "content": "My Mom looking to watch next show\n\nwhat should she watch next\n\nHow good are this shows ?\n\nAfter Life\n\nThe Crown\n\nHouse of Cards\n\nBehind Her Eyes\n\nor any other recommand\n\nThank you for answer",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pddrf7/what_to_watch_next_after_life_or_the_crown_or/"
    },
    {
        "id": "1pcw8wa",
        "author": "YaNiBBa",
        "title": "Wolf of Wall Street is censored now?",
        "content": "So Wolf of Wall Street is back on Netflix and I decided to watch it, yet again. But this time for whatever reason, it's censored with blurred out genitals which I've never seen on Netflix, especially when it wasn't censored before.\n\nUpdate: The censored version has now been replaced with the uncensored",
        "upvotes": 114,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1pcw8wa/wolf_of_wall_street_is_censored_now/"
    },
    {
        "id": "1pdfc3k",
        "author": "tomaz1989",
        "title": "What are the best shows to binge and finish?",
        "content": "I’ve noticed I would start on a show, stop, &amp; start on another one. I need a show that i won’t get bored of &amp; can watch it until it’s finished \n\nthanks",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pdfc3k/what_are_the_best_shows_to_binge_and_finish/"
    },
    {
        "id": "1pczyi7",
        "author": "huffpostuk",
        "title": "Netflix Defends Sean Combs Documentary After Diddy Brands Series 'Shameful'",
        "content": "",
        "upvotes": 34,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pczyi7/netflix_defends_sean_combs_documentary_after/"
    },
    {
        "id": "1pdqxwj",
        "author": "Ok-Work-3571",
        "title": "Netflix Not Working",
        "content": "I haven't had Netflix in months but decided to purchase the subscription again because of Stranger Things season 5, but after that I open the app or the on the browser the screen is just white and never loads. There are no texts or anything just a blank white screen how do I fix this. I tried updating my drivers, restarting my computer twice and even deleting and redownloading the app. I also tried downloading Netflix on my phone but the \"something went wrong\" shows up on the android Appstore when I search it up. Is Netflix just down or is it another issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdqxwj/netflix_not_working/"
    },
    {
        "id": "1pdp7tl",
        "author": "Medium_Film_1430",
        "title": "Wolf of Wall Street",
        "content": "I was just watching The Wolf of Wall Street on Netflix paused it for a bio break. Came back to the movie and it was no longer there!? Not even available on Netflix. WTH.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pdp7tl/wolf_of_wall_street/"
    },
    {
        "id": "1pdnm6x",
        "author": "lifeisahighway2023",
        "title": "Option to remove from viewing gone on my Sony TV",
        "content": "I have a Sony Bravia.  Recently it seems Netflix updated (i believe it is google platform) and now while I can still remove a show from \"My List\" it seems that if I have commenced viewing a tv show and decide I want to abandon it there is no way to remove it from \"Continue Watching\" anymore.\n\nIt used to be that you would go to Episode Details and it was one of the options in the list.  Now the option to remove from Continue Viewing is gone.\n\nAnother issue with the most recent update is that when scrolling shows and movies clicking on one brings you right into the show instead of seeing more detail.\n\nIt seems like every successive Netflix update it just gets worse and worse.  The show icons are huge, you can only do a horizontal scroll instead of a grid list, and so on.\n\nIf anyone knows the solution to fixing the issue of the lost \"remove from Continue Viewing\" it would be appreciated.\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnm6x/option_to_remove_from_viewing_gone_on_my_sony_tv/"
    },
    {
        "id": "1pdnev0",
        "author": "eddyy-_-",
        "title": "About production-time",
        "content": "I literally can't believe how so many people are not only personally mad, but also think it is objectively a fault / an issue that priority 1 Netflix productions (ST, Wednesday, etc.)  take 1-2 years per season. Take Stranger Things as an example. You get like 5-6 high end production movies per season. Makes 25-30 movies in total in a span of 9 years. Tell me how many franchises released 25 movies (that people actually are still eager to watch after like movie 20) in 9 years. The amount of sets, hours of acting, effects, editing, cutting, music and sound design is insane and honestly above some stuff that runs in cinemas. This isn't against those that are genuinely / personally sad or angry or that say that it's weird how the cast ages up, but against people that think there is an issue with production-time, while in reality Netflix original output is absolute insanity and I can't even begin to understand how this is possible (prolly money, but yeah xd). I also can understand (and personally think it is a neutral to good thing) why they split up seasons in the age of bingewatching, but that is a different discussion. \n\nI guess I will get a lot of hate for this, but it is just something I saw with Wednesday S2 and now with ST S5 that really confused me. If I am in the wrong or don't seem to grasp something, please let me know, but stay kind &lt;3",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnev0/about_productiontime/"
    },
    {
        "id": "1pdn4kh",
        "author": "Nichiw4",
        "title": "Issue with their new game",
        "content": "Having an issue with the Red Dead Redemption game, it keeps asking me to download the same 3.7GB of resources at the start, I have done so for about 3-4 times now and it almost always happens when I open the game ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdn4kh/issue_with_their_new_game/"
    },
    {
        "id": "1pdmvmx",
        "author": "Exotic-Internet-5470",
        "title": "Audio Issues, Audio gets better while playing game?",
        "content": "I’m having this problem with Netflix again where when I play the audio it sounds fine when it’s in MiniPlayer and in a game like wuthering waves but when I go full screen in Netflix the audio is noticeably worse. When it’s in MiniPlayer and in the game the sound is nice and feels like it’s around me. I’m using an iPad and AirPods btw.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdmvmx/audio_issues_audio_gets_better_while_playing_game/"
    },
    {
        "id": "1pdmryk",
        "author": "ChemistryKind3948",
        "title": "show recommendations",
        "content": "hi! i really enjoy shows on netflix but i can’t seem to find anything that really interest me! i like reality tv, fantasy, drama, etc. are there any shows similar to gossip girl, selling OC or just any shows over 3 seasons that you would recommend? \n\nthey don’t have to be anything like the ones mentioned just something you think other people would enjoy and should watch! ",
        "upvotes": 1,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pdmryk/show_recommendations/"
    },
    {
        "id": "1pdm0ny",
        "author": "Kkimp1955",
        "title": "Grantchester",
        "content": "Why are all of the closed captions from the 1st episode.. I would love to watch it.. but I am old and my hearing is not great.. especially with accents.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pdm0ny/grantchester/"
    },
    {
        "id": "1pdjwfx",
        "author": "MulchImpression081",
        "title": "Netflix Pricing Update Survey",
        "content": "Sorry to bother you, I'm a grad school student at Georgetown and I built a survey discussing different pricing options for Netflix.\n\nIf you have time, please check it out. Thanks! [https://forms.gle/SQ3qKGLER1FyVt8o6](https://forms.gle/SQ3qKGLER1FyVt8o6)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdjwfx/netflix_pricing_update_survey/"
    },
    {
        "id": "1pcu3uc",
        "author": "michelob81",
        "title": "Sean Combs the reckoning",
        "content": "Fantastic watch but surely 4 years in prison can't be the end of the story! The female jury member came across like she'd been on an interview for Pop idol instead of a court case. Puffy appeared to be demonic and should have received at another 2 years for his fixation with baby oil alone.",
        "upvotes": 33,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pcu3uc/sean_combs_the_reckoning/"
    }
]