[
    {
        "id": "1l4s5gh",
        "author": "SliceOfLifeAMA",
        "title": "Hi /r/movies, we're Matthew Salleh and Rose Tucker, the documentary filmmaking duo behind “Slice of Life: The American Dream. In Former Pizza Huts. ”We also made \"Barbecue\"\n(2017) and \"We Don't Deserve Dogs\" (2020) - Ask us anything!!",
        "content": "Hi /r/movies, we're Matthew Salleh and Rose Tucker, the documentary filmmaking duo behind\n\n“Slice of Life: The American Dream. In Former Pizza Huts.”We also made \"Barbecue\"\n\n(2017) and \"We Don't Deserve Dogs\" (2020) - Ask us anything!!\n\n\n\nWe’re Matthew Salleh and Rose Tucker, a two-person documentary team originally from\n\nAustralia, now based in the US. Our new documentary film, “Slice of Life: The American\n\nDream. In Former Pizza Huts.” was released online last week after touring the film festival\n\ncircuit the last 6 months.\n\n\n\nFor the film, we captured a portrait of America through businesses that operate out of\n\nthose iconic former Pizza Hut buildings. It’s our third feature documentary – we previously\n\nmade “Barbecue” (where we journeyed around the world looking at how communities\n\ngather by cooking meat over fire) and “We Don’t Deserve Dogs” (where we journeyed\n\naround the world looking at the relationship between humans and dogs). You might detect\n\na recurring theme in our films!\n\n\n\nWe do all this as a two-person team – Matt directs and shoots, Rose produces and does the\n\nsound, we do all the editing, sound mixing and post production out of our one bedroom\n\napartment, and we fund and distribute the films entirely ourselves. We’re also a couple\n\n(going on 19 years – since this question usually comes up pretty quickly).\n\nWe also readily admit that we work freelance (as corporate video editors) to make this\n\ndream job work. In fact, we were pretty much secretly ‘working from home’ for the entire\n\nproduction and release of this new film. We try to be very honest and open about how\n\ntough independent filmmaking can be, and are trying to remove the stigma around working\n\nthe second job when Hollywood doesn’t come calling. We’ve seen the highs and lows of\n\nthis biz – our first feature was sold to Netflix, our second film’s world premiere was\n\ncanceled in the first week of the pandemic...\n\n\n\nAsk us anything! About the new film, about the old films, about independent filmmaking,\n\nabout the grind of corporate video work, about how we got to meet and interview the\n\noriginal 91-year-old founder of Pizza Hut, about lenses and microphones, about anything!\n\nOh, and if you’re interested in seeing the new film, it’s available on Amazon Prime Video\n\nand also direct through our website – [sliceoflifedoc.com](http://sliceoflifedoc.com) . If you go to the site and click the\n\n‘Stream Now’ button, use the code FORMER to see the film for free (or the code PIZZA for\n\n50% off if the other code runs out).\n\n**SYNOPSIS**\n\nA contemporary portrait of America, observed within the walls of former Pizza Hut buildings\n\nacross the country. These nostalgic spaces hold memories of a bygone era, but through\n\nthe power of transformation, they provide something new and special for the communities\n\nthat continue to flow through them.\n\nFrom an LGBTQ+ church in Florida, to a karaoke bar in Texas, to a cannabis dispensary in\n\nrural Colorado, these modern-day portraits are paralleled with the origin story of Pizza Hut -\n\none of America's most iconic brands, and the two brothers who founded the company in\n\nWichita, Kansas in 1958.\n\n**TRAILER**: [https://youtu.be/alql\\_8UgJlI](https://youtu.be/alql_8UgJlI)\n\n**HOW TO WATCH**: the film is available now on Amazon Prime Video and direct via our\n\nwebsite [sliceoflifedoc.com](http://sliceoflifedoc.com)\n\nBack at 3 PM ET to answer your questions!\n\n",
        "upvotes": 14,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p8a57gn34b5f1.png?auto=webp&amp;s=ff2cba83eb81363cc6eab980d88798cfd101e939"
        },
        "permalink": "/r/movies/comments/1l4s5gh/hi_rmovies_were_matthew_salleh_and_rose_tucker/"
    },
    {
        "id": "1l4nz3f",
        "author": "ChiefLeef22",
        "title": "'Predator: Killer of Killers' - Review Thread",
        "content": "**Rotten Tomatoes:** [97%](https://www.rottentomatoes.com/m/predator_killer_of_killers)\n\n**Metacritic:** [80/100](https://www.metacritic.com/movie/predator-killer-of-killers/)\n\nSome Reviews:\n\n[Total Film - Amy West - 5/5](https://www.gamesradar.com/entertainment/sci-fi-movies/predator-killer-of-killers-review-great-characters-thrilling-action-and-gorgeous-arcane-esque-animation/)\n\n&gt;It's clear Wassung and Trachtenberg just get it. Somehow, they're able to push the sci-fi envelope and offer up fresh images and ideas the series has yet to see, while also appealing to diehard fans with Easter eggs (keeps your eyes peeled for a pistol in the final act and a franchise-first look at something fans have been dying to see realized since 1987), as well as cheeky teases of a connected universe and potential sequel, too. Before we get anything like that, though, the latter  is set to release the upcoming live-action flick Predator: Badlands, yet another take on the menacingly-mandibled meanies. After Prey, we had faith the series was in good hands. After Predator: Killer of Killers, we don't want anyone else getting their mitts on it.\n\n[The Hollywood Reporter - Frank Scheck](https://www.hollywoodreporter.com/movies/movie-reviews/predator-killer-of-killers-review-dan-trachtenbergs-animated-anthology-puts-an-inventive-spin-on-a-durable-franchise-1236247198/)\n\n&gt;Predator: Killer of Killers provides the non-stop action that the diehard fans crave. And no concession has been made to the animated format; the film easily earns its R rating with copious amounts of gruesome violence and bloody gore that should well sate viewers’ bloodthirsty tendencies. The animation takes a bit of getting used to, with its exaggerated, video game-style visuals, but it serves the material well.\n\n[The Guardian - Catherine Bray - 3/5](https://www.theguardian.com/film/2025/jun/05/predator-killer-of-killers-review-animated-anthology-of-arnies-old-antagonists)\n\n&gt;The only problem with this stuff is that you can’t help picturing how much more spectacular it would look in live action. The animation is all perfectly competent but it’s lacking a little something – that spark of life and ingenuity that can make even flawed animation so fascinating. There’s something quite slick about all this, almost to a fault. Was AI involved? We’ll probably never know, but it’s a problem that the suspicion has got inside the door.\n\n[TheWrap - William Bibbiani](https://www.thewrap.com/predator-killer-of-killers-review-hulu/)\n\n&gt;Dan Trachtenberg and Joshua Wassung’s animated “Predator” sequel takes a while to prove it’s more than just a demo reel of superficial badassery, but when it does, it’s involving and intense. It’s hard not to love at least a couple of these characters, who keep getting screwed over by their own propensity for violence. If you’re so deadly that monsters travel millions of light years just to try to murder you, you might have flown a little too close to the sun. You never see a Predator hunting the attendees at a needlepointing convention, that’s all I’m saying.",
        "upvotes": 1260,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E_IQQNUi6sOnOUj6NnnJ-mueFrdlf6R6XSKt_Yx4JyQ.jpg?auto=webp&amp;s=9b52c556583dd2f04f1abbae3a8038cad89a170f"
        },
        "permalink": "/r/movies/comments/1l4nz3f/predator_killer_of_killers_review_thread/"
    },
    {
        "id": "1l4qtgn",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie sounds stupid but is actually really good?",
        "content": "There’s certain movies that have you sold based on the plot summary alone and the movie turns out to be mediocre. I’m looking for the opposite, movies that sound stupid but are actually really good. \n\nIt gets mentioned all the time but ‘Sorry to Bother You’ comes to mind immediately. One of those movies most people would call stupid from the outside looking in, it’s actually pretty great though.",
        "upvotes": 569,
        "comments": 1140,
        "media": null,
        "permalink": "/r/movies/comments/1l4qtgn/what_movie_sounds_stupid_but_is_actually_really/"
    },
    {
        "id": "1l4cykx",
        "author": "MarvelsGrantMan136",
        "title": "Fede Alvarez’s ‘Alien: Romulus’ Sequel Begins Filming in October",
        "content": "",
        "upvotes": 6145,
        "comments": 510,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_cXyKo5sJEC-_RosOfjGxZZXkD4vvU6xP_ApNmGs15w.jpg?auto=webp&amp;s=47dffaece6d954ac799be372d6619b6c9ed05f97"
        },
        "permalink": "/r/movies/comments/1l4cykx/fede_alvarezs_alien_romulus_sequel_begins_filming/"
    },
    {
        "id": "1l4rrlt",
        "author": "Odd_Advance_6438",
        "title": "Chris Hemsworth as Dementus in Furiosa is one of my favorite villains of the last decade. Entertaining and charismatic, but also capable of horrible atrocities. There’s an underlying layer of pain to his actions. I hope we see him do more interesting roles in the future",
        "content": "Phenomenal movie with a lot of memorable scenes and characters, but the standout is obviously Dementus\n\nEven from a design standpoint, he’s very distinct. A cape made of a parachute, crooked nose, and the teddy bear on his armor. Also a super nasally and abrasive voice. I would say in terms of cruelty, he probably does the most fucked up things of any villain from the last few years, including to his own men\n\nWe know very little about his backstory other than that his family was killed early on in the wasteland, leaving him with only the teddy bear to remember them by. As a result, Dementus commits heinous acts just to feel something, anything. While it gives him an initial rush of adrenaline, we see how he has to do worse and worse things just to feel something, until it’s never enough. In his old age, he’s extra unhinged and obsessed with misery. In his “there is no hope!” speech, I kind of interpreted Dementus as being upset with the idea of other people finding solace in eachother.\n\nEarlier in the movie, he tries to become a twisted father figure to Furiosa and have her replace the family he lost, and seems genuinely hurt when she hates him (he lacks the self awareness to know she would obviously hate him for killing her mother)",
        "upvotes": 410,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1l4rrlt/chris_hemsworth_as_dementus_in_furiosa_is_one_of/"
    },
    {
        "id": "1l4skzr",
        "author": "Bullingdon1973",
        "title": "Casting directors can win Oscars now, but it’s a lost art",
        "content": "",
        "upvotes": 326,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jspfSG10UNKYQtBfj9uAuuuqvSU834R9s669rK1da1E.jpg?auto=webp&amp;s=1e3c4895f57d64888e71739a81a24d10f2568612"
        },
        "permalink": "/r/movies/comments/1l4skzr/casting_directors_can_win_oscars_now_but_its_a/"
    },
    {
        "id": "1l4w3sl",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Freakier Friday'",
        "content": "",
        "upvotes": 135,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qor9dhl3yb5f1.jpeg?auto=webp&amp;s=d50a70f0d01e92d5592f50111b94af1c48df7420"
        },
        "permalink": "/r/movies/comments/1l4w3sl/new_poster_for_freakier_friday/"
    },
    {
        "id": "1l4hpkw",
        "author": "skinnymatters",
        "title": "Scientists of Reddit, what are your favorite Sci-Fi films that are ‘accurate enough’ to not annoy you?",
        "content": "I’m watching Sunshine and (not a new opinion) while it’s spectacularly inventive and beautiful, it’s pretty far fetched scientifically. This only barely irks me, but I’m not an astrophysicist. So for cinephiles in the sciences, what is your threshold for suspension of disbelief, and what films fall in that ‘Goldilocks zone’?",
        "upvotes": 793,
        "comments": 510,
        "media": null,
        "permalink": "/r/movies/comments/1l4hpkw/scientists_of_reddit_what_are_your_favorite_scifi/"
    },
    {
        "id": "1l41w86",
        "author": "MarvelsGrantMan136",
        "title": "Guillermo del Toro’s ‘Frankenstein’ Rated “R” for Bloody Violence &amp; Grisly Images",
        "content": "",
        "upvotes": 6888,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7ZSeRwmk7ckCVwa-T-f0Ba7432hae2oXYEpcYGtdERA.jpg?auto=webp&amp;s=11f7ea31f2661a6449aca08bac3dda4ee0bdc200"
        },
        "permalink": "/r/movies/comments/1l41w86/guillermo_del_toros_frankenstein_rated_r_for/"
    },
    {
        "id": "1l4pma9",
        "author": "pragueplasm",
        "title": "Zach Cregger's Resident Evil movie to film in Prague this summer",
        "content": "",
        "upvotes": 149,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NnS7YEXPMDxAD1A2p2Wv5qDYNKPXRXPKGy3ZKcqYsDc.jpg?auto=webp&amp;s=fb4dc683c387d25bae82303a102f58894aee3f47"
        },
        "permalink": "/r/movies/comments/1l4pma9/zach_creggers_resident_evil_movie_to_film_in/"
    },
    {
        "id": "1l4f5w1",
        "author": "Amaruq93",
        "title": "George A. Romero’s daughter, ex-wife and widow are each working on movies rooted in his \"Zombie\" legacy, even as they wrestle with their memories and a contentious split",
        "content": "",
        "upvotes": 648,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hlq13ziZFMmyIIQmDSiiteFsUuYGNzQl9Do9-RJWOc0.jpg?auto=webp&amp;s=0dfae6b06cbb2e01c2a51f5698bb358788495100"
        },
        "permalink": "/r/movies/comments/1l4f5w1/george_a_romeros_daughter_exwife_and_widow_are/"
    },
    {
        "id": "1l4mevz",
        "author": "SiTheHandsomeGuy",
        "title": "What’s a movie that seemed “meh” the first time you watched it, but blew you away on a rewatch?",
        "content": "Some movies just hit differently the second time around. Maybe you weren’t in the right mood the first time, maybe you missed the deeper stuff, or maybe it just needed time to grow on you. For me, it was Blade Runner 2049. The first watch felt slow, but on a rewatch, the atmosphere, pacing, and emotional weight really landed now it’s one of my all-time favorites.",
        "upvotes": 180,
        "comments": 395,
        "media": null,
        "permalink": "/r/movies/comments/1l4mevz/whats_a_movie_that_seemed_meh_the_first_time_you/"
    },
    {
        "id": "1l3z4dw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Luc Besson's 'Dracula' Starring Caleb Landry Jones, Christoph Waltz &amp; Zoë Bleu",
        "content": "",
        "upvotes": 4566,
        "comments": 771,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y6hvmghq045f1.jpeg?auto=webp&amp;s=0020fde2949ad60327268cc27488b34edc10f33e"
        },
        "permalink": "/r/movies/comments/1l3z4dw/official_poster_for_luc_bessons_dracula_starring/"
    },
    {
        "id": "1l4v3yu",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the Documentary 'Blue Scuti: Tetris Crasher' - When 13-year-old Willis Gibson becomes the first person to beat Tetris, his life changes overnight.",
        "content": "",
        "upvotes": 42,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jxxb4fwmob5f1.jpeg?auto=webp&amp;s=dd3a731fd34d3a161220ab1861dfe492aef53175"
        },
        "permalink": "/r/movies/comments/1l4v3yu/official_poster_for_the_documentary_blue_scuti/"
    },
    {
        "id": "1l48j63",
        "author": "MarvelsGrantMan136",
        "title": "'Ready or Not: Here I Come' Wraps Filming, Sets April 10, 2026 Release",
        "content": "",
        "upvotes": 1078,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sinCeKoBVEQAXedX21jb8p7w6gXf4Ty7qlKA7d8qTh0.jpg?auto=webp&amp;s=96be1174d2eae393f0574ee50862a69ac5b57baa"
        },
        "permalink": "/r/movies/comments/1l48j63/ready_or_not_here_i_come_wraps_filming_sets_april/"
    },
    {
        "id": "1l49anx",
        "author": "mrjohnnymac18",
        "title": "Spider-Man 4 filming to take over Glasgow this summer",
        "content": "",
        "upvotes": 970,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BLb_TtOGIHRLq5y_sD3fmgSy4eW1dFWNrKp0g5PyzYY.jpg?auto=webp&amp;s=74467ab4c86715ece519559db587643374b9df8f"
        },
        "permalink": "/r/movies/comments/1l49anx/spiderman_4_filming_to_take_over_glasgow_this/"
    },
    {
        "id": "1l4c073",
        "author": "tomarnoldlovescoke",
        "title": "Ed Harris",
        "content": "38M, will be 39 in less than a month. For a few years now I have been revisiting or rediscovering movies that my dad and brother watched as kids that he rented for the weekend. I'm totally familiar with the cast of actors that I recall in that era but I had no idea that Ed Harris was like in Everything!! Every movie I watch, he's in it. I'm so stupid. Was he that huge? I profes my ignorance.",
        "upvotes": 637,
        "comments": 441,
        "media": null,
        "permalink": "/r/movies/comments/1l4c073/ed_harris/"
    },
    {
        "id": "1l4vvy6",
        "author": "Neo2199",
        "title": "Sylvester Stallone's First Movie 'Rebel' Gets Rerelease 50 Years Later: Originally titled ‘No Place to Hide’, the 1973 film was only sporadically released and later made the rounds on videocassette and television",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IsLVXQhecas4LM4hPMdiOFxy7xFcEavsN87T3tHJz_A.jpg?auto=webp&amp;s=e9bb68b0ffd0c6c31aac3d17c9844d811a0cd723"
        },
        "permalink": "/r/movies/comments/1l4vvy6/sylvester_stallones_first_movie_rebel_gets/"
    },
    {
        "id": "1l4gwpn",
        "author": "LiteraryBoner",
        "title": "Official Discussion - From the World of John Wick: Ballerina [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/gh5jt24s2NGH)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/gh5jt24s2NGH)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**\nSet between the events of *John Wick: Chapter 3 – Parabellum* and *Chapter 4*, *Ballerina* follows Eve Macarro, a ballerina-turned-assassin trained by the Ruska Roma. Driven by vengeance after her father's murder, Eve embarks on a relentless mission against the Chancellor, confronting a deadly town of killers in Hallstatt, Austria. Along her journey, she crosses paths with familiar faces from the John Wick universe, including John Wick himself.\n\n**Director**\nLen Wiseman \n\n**Writer**\nShay Hatten \n\n**Cast**\n\n* Ana de Armas as Eve Macarro\n* Anjelica Huston as The Director\n* Gabriel Byrne as The Chancellor\n* Lance Reddick as Charon\n* Norman Reedus as Daniel Pine\n* Ian McShane as Winston Scott\n* Keanu Reeves as John Wick\n* Catalina Sandino Moreno as Lena\n\n\n**Rotten Tomatoes**: [78%](https://www.rottentomatoes.com/m/ballerina_2024)\n\n**Metacritic**: [66](https://www.metacritic.com/movie/ballerina/)\n\n**VOD**\nAvailable in theaters and on premium VOD.\n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=u9RorU0EOi4)\n\n---",
        "upvotes": 225,
        "comments": 308,
        "media": null,
        "permalink": "/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/"
    },
    {
        "id": "1l4rtag",
        "author": "Deadstone16",
        "title": "What’s the best prequel?",
        "content": "Pretty much everyone groans and rolls their eyes when a prequel to a beloved, successful movie is made since the majority of the time they’re lifeless cashgrabs with nothing to say. But since there’s so many of them, there’s no way that they’re ALL disappointing or terrible.\n\nWhich ones rise to the top? Which ones will be remembered a a genuinely great cinematic experience?",
        "upvotes": 29,
        "comments": 203,
        "media": null,
        "permalink": "/r/movies/comments/1l4rtag/whats_the_best_prequel/"
    },
    {
        "id": "1l4bi03",
        "author": "prolelol",
        "title": "Enzo Staiola, who played Bruno in The Bicycle Thieves (1948), has passed away at the age of 85.",
        "content": "",
        "upvotes": 475,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VSYYmFaFkAwSDU57v0IR2WzvrCkBN9BNgdqELLNjMBo.jpg?auto=webp&amp;s=5e71c729b7a7679f022534d56df554c0fa8d3629"
        },
        "permalink": "/r/movies/comments/1l4bi03/enzo_staiola_who_played_bruno_in_the_bicycle/"
    },
    {
        "id": "1l4uv1j",
        "author": "theatlantic",
        "title": "The Phoenician Scheme review and Wes Anderson interview, by David Sims",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H-R6SqfGcHe7wN6tCulIL9OssS-DC8P5NcrGXwAccS4.jpg?auto=webp&amp;s=f560ff45e104821ef1b8383cd0f59d642c1c13a4"
        },
        "permalink": "/r/movies/comments/1l4uv1j/the_phoenician_scheme_review_and_wes_anderson/"
    },
    {
        "id": "1l4hmwz",
        "author": "BabymakerGspot",
        "title": "Companion Really Had A $10 Million Dollar Budget??",
        "content": "For a movie of such quality, im actually very surprised that people didn't like it as much.I was also surprised to hear about the 10 mill budget.  The acting was good, the story was well paced and structured well, the twists were also pretty good in my opinion. Its behind Sinner as the movie of the year for me. It understandable that people might even put it over Sinner!!",
        "upvotes": 110,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1l4hmwz/companion_really_had_a_10_million_dollar_budget/"
    },
    {
        "id": "1l44vrg",
        "author": "Apprehensive_Fly9352",
        "title": "Saoirse Ronan Stars in Talking Heads’ ‘Psycho Killer’ Music Video, Directed by Mike Mills: 'I was totally daunted'",
        "content": "",
        "upvotes": 558,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GbCPwNOwyuqPtAtOG-jGjwr95wIlC-c_THuPGnt-ZbE.jpg?auto=webp&amp;s=03b978fd2cec3710d5f28e85699807ed8388d359"
        },
        "permalink": "/r/movies/comments/1l44vrg/saoirse_ronan_stars_in_talking_heads_psycho/"
    },
    {
        "id": "1l3ybk3",
        "author": "brahbocop",
        "title": "Horror Icon Ken Foree Shares Plea to Preserve ‘Dawn of the Dead’ Mall",
        "content": "",
        "upvotes": 1232,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/16u8AU7-HhxD5zIhElSn03ueKGfOWxcK_j4RiuzChUE.jpg?auto=webp&amp;s=23f802e515eab8900107636267155bf9d827848a"
        },
        "permalink": "/r/movies/comments/1l3ybk3/horror_icon_ken_foree_shares_plea_to_preserve/"
    },
    {
        "id": "1l4w3z5",
        "author": "DemiFiendRSA",
        "title": "Freakier Friday | Official Trailer | In Theaters August 8",
        "content": "",
        "upvotes": 8,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xSXKeCX4IkU8AJa7l8kpFgMuXI802KQjxqXYMSZ683g.jpg?auto=webp&amp;s=1d0c77f251546d5ab4eb8268421d94b493325e0f"
        },
        "permalink": "/r/movies/comments/1l4w3z5/freakier_friday_official_trailer_in_theaters/"
    },
    {
        "id": "1l3xrki",
        "author": "DanTrachtenbergAMA",
        "title": "Hi /r/movies, I'm Dan Trachtenberg. I've directed PREY and 10 CLOVERFIELD LANE. My next film, PREDATOR: KILLER OF KILLERS, is out on Hulu June 6th and PREDATOR: BADLANDS (starring Elle Fanning) is out in theaters later this year. Ask me anything!",
        "content": "Hey r/movies, I'm Dan Trachtenberg. Here to answer your questions.\n\nI've directed PREY (starring Amber Midthunder) and 10 CLOVERFIELD LANE (starring Mary Elizabeth Winstead and John Goodman). My next film, PREDATOR: KILLER OF KILLERS, is out this week, and PREDATOR: BADLANDS is out later this year.\n\nOn the TV side, I've directed the pilot episode of THE BOYS, also episodes of BLACK MIRROR, STRANGER THINGS (upcoming), and THE LOST SYMBOL.\n\nPREDATOR: KILLER OF KILLERS:\n\nTrailer:\n\n[https://www.youtube.com/watch?v=fbddYji1F8s](https://www.youtube.com/watch?v=fbddYji1F8s)\n\nSynopsis:\n\nA Viking raider, a ninja in feudal Japan, and a World War II pilot encounter a fierce intergalactic hunter.\n\nOut June 6th on Hulu.\n\nAsk me anything! Back at 1 PM ET today to answer your questions.",
        "upvotes": 1176,
        "comments": 362,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q9kyq1sgp35f1.png?auto=webp&amp;s=4386ceb4c8efe76531092c582f9d0067b1b14400"
        },
        "permalink": "/r/movies/comments/1l3xrki/hi_rmovies_im_dan_trachtenberg_ive_directed_prey/"
    },
    {
        "id": "1l4gwrc",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Phoenecian Scheme [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/tcsZHMLSSGNu)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/tcsZHMLSSGNu)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n---\n\n**Summary**\nSet in 1950s Phoenicia, *The Phoenician Scheme* follows Zsa-Zsa Korda, a flamboyant industrialist and arms dealer, as he embarks on an ambitious infrastructure project. Facing assassination attempts and political intrigue, Korda enlists the help of his estranged daughter, Sister Liesl, a nun-in-training, and her tutor, Bjorn Lund, to navigate the complex web of international syndicates and personal redemption.\n\n**Director**\nWes Anderson\n\n**Writers**\nWes Anderson, Roman Coppola\n\n**Cast**\n\n* Benicio del Toro\n* Mia Threapleton \n* Michael Cera \n* Riz Ahmed\n* Tom Hanks\n* Bryan Cranston\n* Mathieu Amalric\n* Richard Ayoade\n* Jeffrey Wright\n* Scarlett Johansson\n\n**Rotten Tomatoes**: [78%](https://www.rottentomatoes.com/m/the_phoenician_scheme)\n\n**Metacritic**: [69](https://www.metacritic.com/movie/the-phoenician-scheme)\n\n**VOD**\nReleased in theaters on June 6th, 2025. \n\n**Trailer**\n[Watch here](https://www.youtube.com/watch?v=GEuMnPl2WI4)\n\n---",
        "upvotes": 88,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/"
    },
    {
        "id": "1l4u9yp",
        "author": "coachrx",
        "title": "Does any specific IRL event make you think of a particular movie every single time it happens?",
        "content": "Suffice it to say, I don't drop knives to the floor very often, but when when I do, I always think of that scene from Adventures in Babysitting.  I am an 80's kid, so it may just have been a very impressionable period, but there are others.  This happened just now, so I wanted to share and hopefully get some feedback.  Also, knife did not stick into my foot.",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1l4u9yp/does_any_specific_irl_event_make_you_think_of_a/"
    },
    {
        "id": "1l4egj1",
        "author": "TheGirlWithTheLove",
        "title": "My story with 127 Hours",
        "content": "I’m autistic and 127 Hours is not only my favorite movie, but it’s also my main special interest/fixation. My special interest with this film has lasted over fourteen years. I thought I would share my story.\n\nThe first time I watched 127 Hours was on April 25th, 2011. It was on a Monday night. I was 16. I checked out the dvd from the library. I didn’t think it would make a big impact on me. But after that first watch, something clicked for me and I felt like a changed person. It was life affirming. I was totally blown away. I knew I had to watch it again very soon. I ended up renting it the next weekend. I fell in love with this movie. I eventually bought the dvd. It was being played so much that I was worried it’d break, so I ended up buying a second dvd copy, which is actually still sealed! At some point later, I bought the Blu Ray copy, even though I didn’t have a Blu Ray player at the time.\n\nI came across this film during my sophomore year of high school. I started showing it to my friends. There was a time in my theater class in which I had to make a movie set with a box set. I ended up creating Blue John Canyon. I also bought a book of the script and I brought it with me to school every day. 127 Hours was becoming my favorite thing in the world.\n\nNot only was 127 Hours my main source for joy and comfort, but it left a positive impact on my life. Before I watched it for the first time, I was taking my life and loved ones for granted. I learned to appreciate them so much more. But it also helped me physically. I used to refuse to drink water. I’d be forced to drink it, and I’d take the tiniest sips. Thanks to the film focusing on how important water is, it became my go-to drink. It made me a hydro homie, if you will. One thing autistic people struggle with are how their bodies lack signals, like hunger, thirst, using the bathroom, etc. The movie made me become more aware of my body’s needs.\n\nThere was also a time in my life when I was very depressed. I turned to self harm and had suicidal thoughts. My breaking point was when I posted a goodbye post on Facebook. I thankfully got help. 127 Hours was one of the things that helped me get better. And I’m forever grateful for that.\n\nI also did some pretty cool things because of 127 Hours. I was never much of an outdoor person before, but it made me fall in love with it. Whenever I’m anywhere near the mountains, I feel most at peace. Utah has become my favorite state to visit. I love to hike out there. I also met James Franco in 2014. I told him how many times I watched it at the time (around 300), and he said, “That’s a lot of times.” I had my Blu Ray copy for him to sign. He drew a heart on it. I never met Aron Ralston or Danny Boyle, but I’d love to meet them both one day, especially Aron! I have a semi-tribute tattoo for 127 Hours on my right arm. It’s a mountain outline. Every time I look at it, I think about the movie and being by the mountains. It makes me happy.\n\nThe last year really took a turn for me, both in good and bad ways. I was diagnosed with a chronic illness late last year, but I dealt with the nearly unbearable symptoms all year. I was in so much pain. Whenever I was at my worst, I turned to 127 Hours for comfort it would almost always make me feel better. And then at some point, I started to share my love for it on Reddit, particularly on r/letterboxd. I’d talk about how many times I’ve seen it. I didn’t think I’d get many responses to whenever I’d post or comment, but they ended up getting a lot of attention. I would become known as the 127 Hours girl.\n\nThe best thing about being the 127 Hours girl is that I’ve made a positive impact on people. I like to post because I like to share my love for the film. I’ve gotten so many responses from other users that sharing my love makes them happy. I feel like making people happy is one of my life’s purposes. And I definitely feel like I’m accomplishing that.\n\nBut the most exciting thing happened last month. I made a Tik Tok about my story with the film in April. I decided to tag Searchlight Pictures to see if they’d watch it. I didn’t think much of it. A few weeks go by and I open Tik Tok. I got a few notifications. I didn’t think it was anything out of the ordinary. But then I saw that Searchlight Pictures liked, commented and sent me a dm! They wanted to send me some things. I was so excited and happy that I screamed and cried!  I was so anxious to see what they were going to send me! And then it finally arrived. They sent me some merch. They got me a dvd copy (probably because I mentioned in the Tik Tok how I got a second copy in case if the first one broke), a poster, a 127 Hours Nalgene water bottle, a carabiner with a couple keychains, a t shirt they had when the film was released that says “I kept my eyes open for 127 Hours”, and a very nice handwritten note. Getting them to notice how much I love 127 Hours was always something I had on my bucket list, but I always thought it would be unrealistic to accomplish. It was a dream come true. They went above and beyond.\n\nI don’t know how many times I’ve watched 127 Hours, but my guess is at least a thousand times. I’ve watched it over 100 times this year alone. I don’t watch the whole film every day, but the biggest part of my fixation is my favorite scene, which I watch several times a day every day. It’s one of the video message scenes. I can never exactly pinpoint why it’s my favorite part of the film, but it’s been that way since the beginning. I have sessions where I’d watch it. They’d usually last between 15 minutes-to a half hour each, but there have been times where I’d watch it for an hour straight. I love it so much.\n\nI think I covered all the bases. I’m very open to answering questions. So if you have any, feel free to let me know!\n\nXOXO, 127 Hours girl",
        "upvotes": 96,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1l4egj1/my_story_with_127_hours/"
    },
    {
        "id": "1l4f02s",
        "author": "Fickle-Winner-6549",
        "title": "The Mummy (1999)",
        "content": "What's not to love about this movie that stars Brendan Fraser, Rachel Weisz, and Arnold Vosloo. It's a supernatural action/adventure with humorous quotes; \"Hey Beni. It looks like I've got all the horses.\"\n\nFun fact: at least three actors from The Mummy have appeared on NCIS; Arnold Vosloo, Oded Fehr, and Erick Avari.",
        "upvotes": 88,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1l4f02s/the_mummy_1999/"
    }
]