[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 39,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ktwl7m",
        "author": "Creative-Ad-1363",
        "title": "Loudermilk is oddly comforting",
        "content": "Just discovered this hidden gem. It's been around for a few years.\nLoudermilk is an addiction counselor with a motley crew of devotees that attend his regular meetings in a catholic church.\n\nThe cast are mostly men, and there are some gross moments (doll episode).\n\nAnja Savcic is the only regular woman casted. They manage her presence nicely without being overly sexual, which I can appreciate. \n\nThe show also mingles comedy with hard topics such as living with disabilities, misogyny, and failure really well. \n\nI've rewatched it several times, especially when winding down at night or if there's nothing else to watch (skipping the doll episode). \n\nAnyone else find this show oddly comforting? ",
        "upvotes": 142,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ktwl7m/loudermilk_is_oddly_comforting/"
    },
    {
        "id": "1ktuex4",
        "author": "Beginning_Rich_8571",
        "title": "Is anyone tired of waiting for stranger things..",
        "content": "i literally started watching stranger things in 7th grade… I’m now a mother of a 1 year old and have been marred for 2 years 😭 like bout time stranger things come out my baby will be 2 going on 3 seems like. ",
        "upvotes": 57,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ktuex4/is_anyone_tired_of_waiting_for_stranger_things/"
    },
    {
        "id": "1ktdjr7",
        "author": "muffinpie90",
        "title": "Anyone else sick of the long wait between seasons and wish we had 22 episodes again?",
        "content": "Even 13-16 episodes would be better than 8. It's taken almost a decade to produce 42 episodes of Stranger Things... Why is this the norm? Kind of over it and it loses the momentum with these big breaks.",
        "upvotes": 710,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1ktdjr7/anyone_else_sick_of_the_long_wait_between_seasons/"
    },
    {
        "id": "1ktql04",
        "author": "strawberrycheescak",
        "title": "Anyone else unable to find anything good on Netflix?",
        "content": "I feel like ive watched all the interesting shows/movies on there and theres nothing good for me to watch. I live in Austria so its probably different depending on the person but I feel like its just the same types of shows/movies that show up that ive either watched or im not interested in (the crime shows/movies about someone going missing). Anyone else feel this way? I don’t really know how to find new shows on there or if there are any new ones I can watch. It feels like they’re just not releasing as good content anymore. ",
        "upvotes": 87,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1ktql04/anyone_else_unable_to_find_anything_good_on/"
    },
    {
        "id": "1ku2pob",
        "author": "Worldpeacee007",
        "title": "Opinion: The Untold series is losing its magic and the last two episodes have been awful",
        "content": "Just finished watching both the Liver King and Favre Untold Episodes.\n\n  \nWhile I enjoyed the \"Shooting Guards\" episode quite a bit, I cant help but be shocked by how awful the Liver King and Favre Episodes were.\n\nI am a huge fan of the series and the Way brothers work, but since they have handed off directorial duties to other filmmakers, I cant help but think the series is losing its juice. \n\nThe Liver King episode was one of the worst documentaries I think I have ever seen in my life and the Favre episode was a bit a mess. Not even the gorgeous soundtrack the series boasts and brilliant editing could save the two from being borderline unwatchable.\n\nI hope the Way brothers direct more episodes in the future because they are some of the most talented and exciting filmmakers at the moment.  \n\nJust a personal opinion of course",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ku2pob/opinion_the_untold_series_is_losing_its_magic_and/"
    },
    {
        "id": "1ku3ghs",
        "author": "okayfriday",
        "title": "What is the most mind-bending and / or edge-of-your-seat movie you've seen?",
        "content": "I've tried to elicit some recommendations by indicating the movies I've seen / liked, but the returns are not very targeted. Would love to hear about the movie(s) that have gripped you!!",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ku3ghs/what_is_the_most_mindbending_and_or/"
    },
    {
        "id": "1ku5i9m",
        "author": "aarplain",
        "title": "Goodfellas scene out of order",
        "content": "Goodfellas is one of my favorite movies of all time. I own a blu ray special edition and I’ve easily watched this movie 50-100 times. I watched it on Netflix tonight, because why not. I swear there is a sequence out of order. I watched it and immediately had to rewind because something triggered my brain. It’s the scene with the baby sitter who works for him moving drugs. It’s inserted during the Lufthansa heist scenes. It doesn’t make sense for it to be there and I thought it came later in the movie. Am I going crazy here?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ku5i9m/goodfellas_scene_out_of_order/"
    },
    {
        "id": "1kts0wy",
        "author": "volch-devz",
        "title": "WTF happened to Love Death Robots S4?",
        "content": "The animation this season is amazing as always, no complain there. But the writing...\n\n(Rant Begins) I still watch some episodes from the previous seasons over and over again out of love (Zima Blue is by far my favorite) but this season is just that... Animation. I felt such a void watching all 10 of them.\nThe Red Hot Chilli Peppers, amazing animation... But it's not even close to being my favorite band and what I am watching is just another video of song. The cat episode and the alien episode made me appreciate 3 robots and The Drowned Giant so much more. Night of the Mini Dead is fun and hilarious but Close Encounters in season 4 feels like fanfic. \nCompare How Zeke got Religion to The Secret War, or Shape Shifters to Spider Rose or The Screaming Tyrannosaur. \n\nAm I the only one who feels that Netflix exploits the popularity of a show all the way to oblivion? Sucking the very essence that made them original and creative till nothing remains? ",
        "upvotes": 31,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1kts0wy/wtf_happened_to_love_death_robots_s4/"
    },
    {
        "id": "1ku44pd",
        "author": "Unlucky-Zucchini-251",
        "title": "Poor bitrate on Netflix (Edge)",
        "content": "I’ve tried everything I can to resolve this issue but haven’t had success, so I would really appreciate any help or suggestions.\n\nThe issue I’m facing is that in Microsoft Edge, the bitrate and resolution of streaming titles don’t go above **1080p** and around **700 kbps**. This is despite the fact that my system and display support much higher quality — I’m using a **1600p OLED** panel with a **240Hz refresh rate** and **Dolby Vision** support.\n\nJust so you know, my system has an **RTX 4070** GPU and an **Intel Core Ultra 9 185H** processor, and I’m on the **Netflix Premium plan** that supports **Ultra HD playback**.\n\nInterestingly, on **Google Chrome**, the bitrate can reach up to **18,000 kbps** (18 Mbps) and **4K resolution**, even though Chrome itself is capped at 1080p in some cases. Still, the quality and bitrate are noticeably better on Chrome.\n\nHowever, I prefer using Microsoft Edge because **Chrome doesn’t support Dolby Vision**, and I’d like to take advantage of that feature while still getting the best possible bitrate and resolution.\n\nCould you help me figure out why Edge is limiting the quality and how I can unlock higher bitrate and resolution when streaming?\n\nThank you in advance!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ku44pd/poor_bitrate_on_netflix_edge/"
    },
    {
        "id": "1ku3511",
        "author": "_tytbs_",
        "title": "Are any of you watching/have watched Snack VS Chef?",
        "content": "I'm watching the show currently but I'm not sure if I want to complete watching it. So if someone does recommend watching this show completely and if the ending really is worth it, do let me know.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ku3511/are_any_of_you_watchinghave_watched_snack_vs_chef/"
    },
    {
        "id": "1ku6fnf",
        "author": "andrestrujillopulido",
        "title": "Nonnas (2025)",
        "content": "Hola, les dejo mi reseña sobre la película \"Nonnas\", por si interesa. Muchas Gracias",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ku6fnf/nonnas_2025/"
    },
    {
        "id": "1kthgvq",
        "author": "No_Corner1086",
        "title": "Thoughs on Sirens?",
        "content": "I’ve been marathoning it since yesterday. I finished it today and IDK. I kinda love it but I also kinda hate it. I feel like it has a really cool concept but it’s execution is shaky. What do you guys think? Have you seen Sirens yet? ",
        "upvotes": 35,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1kthgvq/thoughs_on_sirens/"
    },
    {
        "id": "1ktv0se",
        "author": "ConversationKey276",
        "title": "Anatomy of a Scandal",
        "content": "I just finished this show. Personally, I would've liked a second season to wrap it up, but I'm glad it wasn't needed. It was also nice to see Mary again (Downton Abbey).\n\n8/10 would recommend.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktv0se/anatomy_of_a_scandal/"
    },
    {
        "id": "1kt0qoi",
        "author": "Longjumping_Land_977",
        "title": "I watched A Deadly American Marriage over a week ago but I’m still thinking about it",
        "content": "",
        "upvotes": 309,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1kt0qoi/i_watched_a_deadly_american_marriage_over_a_week/"
    },
    {
        "id": "1ktrujd",
        "author": "KahKahFau",
        "title": "Has \"You\" been removed? (Netflix Germany)",
        "content": "So I've been watching the 5th season of You the past days. Today I turn on my Nerflix, go to Continue Watching and the series doesn't show up. It also doesn't show up in search.\n\nNow, I've checked online whether there were news or any type of information on the series being removed. However, I didn't find any. That brings me to making this post. \n\nCan any other Netflix Germany user confirm that the series is also gone on their account? ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ktrujd/has_you_been_removed_netflix_germany/"
    },
    {
        "id": "1ku0dfy",
        "author": "ImageEmergency4970",
        "title": "How did Sneaky Link find their cast?",
        "content": "Watching the new Sneaky Link show on Netflix where the show puts a bunch of singles into one villa, but every person has one “situationship” that joins the villa, but neither party knows they’d be in the same space. \n\nHow did they pull this off? Does anyone know what the casting process was like? I can’t understand how these people signed up for the show as well as their sneaky links, and neither party had a single clue? How did the casting team know who they were  having private relations with?????",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ku0dfy/how_did_sneaky_link_find_their_cast/"
    },
    {
        "id": "1ku060t",
        "author": "toystory4321",
        "title": "Heaven is a place on earth",
        "content": "For anyone that's seen the new Fear Street Prom Queen, does that song actually appear in the movie? If so, what scene? I know a lot of trailers feature songs that aren't actually in the movie",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ku060t/heaven_is_a_place_on_earth/"
    },
    {
        "id": "1ktju5f",
        "author": "ChindianIceQueen",
        "title": "Siren",
        "content": "What the hell did I even watch? Is anyone else mind boggled like I am? The ending felt lazy and illogical. Such amazing casts, somewhat gripping to a certain extent but completely lost me in the end. Does anyone feel the same ? ",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ktju5f/siren/"
    },
    {
        "id": "1ktqz4f",
        "author": "SplitNational2929",
        "title": "Creep 1 &amp; 2 are honestly two of the best horror movies I've watched on Netflix. So underrated!",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktqz4f/creep_1_2_are_honestly_two_of_the_best_horror/"
    },
    {
        "id": "1ktyr02",
        "author": "New_Witness5041",
        "title": "Why cant I see weak hero?",
        "content": "hey, so as the title suggests, I recently been interested by kdramas. However I cant see any of them on netflix even though apparently they should be there... Specifically bloodhounds and Weak hero? I dont really know why but I would be really grateful if someone could explain. \n\n  \nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktyr02/why_cant_i_see_weak_hero/"
    },
    {
        "id": "1ksssyk",
        "author": "theoriginalshabang1",
        "title": "Liver King. Wtf did I just watch? Lots of spoilers because shame on Netflix for giving this guy more of a voice",
        "content": "It’s new &amp; I had never heard of this guy so I watched it last night. Why is Netflix is giving this guy more notoriety and why do we elevate ‘influencers’ like this??\n\nToxic &amp; cliche grifter promoting an ‘All Meat Primal’ and ‘natural’ lifestyle gets caught using steroids… a surprise to no one with eyeballs.  He walks around in no shirt and shorts all the time. Seriously - in public, at conventions, multiple clips of podcasts interviews, a Piers Morgan interview… there is literally 1 scene in the entire thing where he is wearing a shirt. It’s cringy af to watch.\n\nHe makes a ton of money off of selling supplements and making videos that this diet is healthy and his physique is all due to meat &amp; supplements - so Buy Now! It’s terrible advice, in no way healthy and can seriously harm people! If he possesses any qualifications for giving diet advice, or knowledge to create a supplement line (other than working at GNC when he was a teen), they sure don’t mention it.\n\nHe goes from ‘f you! It’s none of your business if I take steroids’ to ‘I’ll just lie again’ to an unapologetic apology to his fans saying he has self esteem issues because his dad died when he was a kid and steroids help. 🙄 Then admitting that he has been stealing &amp; grifting since he was 16 - even printing counterfeit money at one point! \nDude…. if that is true, prolly shouldn’t admit that on a Netflix special…\n\nHe and his “queen” kill a bull and make their kids eat its testicles while per-formatively thanking his “bull brother” and Earth for his gifts like he’s a character in Avatar. Yup, raw bull testicles just out in the middle of a field, still warm.  I mean, I’m not into hunting - not that you can call this hunting because it was a lone bull standing in a field that someone else shot for him  - but I get that some people are. You should not be eating raw animal organs! EVER!!! And you certainly should not be feeding it to your kids! I guess if this guy brings on a new pandemic or the zombie apocalypse, he’ll just bicep curl his way out of it.\n\nAfter taking mushrooms, a shaman shows up (?) for a sweat lodge and he has to think of his next move while of the mean things Internet people said to him are dubbed over the scene… Not his responsibility or fraud or lies or how his business partners were also screwed over with his fraud. \n\nBut, don’t worry because he realizes he should be eating fruit too (which he thanks before eating) and his new business plan is to open 302 resorts where people can pay to live like him and his family. His 9 Pillar Belief System has become 10 Pillars because he’s not giving up steroids, but he’s definitely done grifting, right guys?",
        "upvotes": 428,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1ksssyk/liver_king_wtf_did_i_just_watch_lots_of_spoilers/"
    },
    {
        "id": "1kspv45",
        "author": "New-Talk3039",
        "title": "Just started Breaking Bad — how is it overall? (No spoilers please)",
        "content": "Hey everyone,\n\nI just started watching Breaking Bad for the first time and I'm a couple of episodes in. I’ve heard a ton of praise about it over the years, and finally decided to see what the hype is about. So far, it’s definitely got me intrigued.\n\nFor those who’ve watched the whole thing — how did you find the overall experience? Does it live up to the reputation it has? I’d love to hear your thoughts (but please, no spoilers — I’m going in fresh!).\n\nThanks!",
        "upvotes": 518,
        "comments": 1033,
        "media": null,
        "permalink": "/r/netflix/comments/1kspv45/just_started_breaking_bad_how_is_it_overall_no/"
    },
    {
        "id": "1ktv09s",
        "author": "THAToneGuy091901",
        "title": "Why isn’t my Netflix working",
        "content": "I’m trying to click on my profile and it’s not letting me do anything, but if I use other stuff I can like any other app I can use it like normal, but for some reason, Netflix isn’t letting me do anything",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ktv09s/why_isnt_my_netflix_working/"
    },
    {
        "id": "1kttyi0",
        "author": "Beelzabubbah",
        "title": "Constantine Sound Mixing",
        "content": "What's with the sound editing on the Constantine version that's playing on Netflix right now? The sound and dialogue is so low, I need to crank my volume up way past 11. Seriously to 75-80, where it's normally 45-50. \n\nNot wanting to suffer through the bad sound mix, I \"found\" an .mkv/mp4 version, and surprisingly it had the same problem. Don't know which is chicken and which is egg, I just wanted to watch a version that sounded good and not like pillows are covering my speakers. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kttyi0/constantine_sound_mixing/"
    },
    {
        "id": "1ktn9t6",
        "author": "kunebune",
        "title": "My Laptop isn't a part of my Netflix account?",
        "content": "Hi, I recently have had to start dealing with the crack down on password sharing. But I don't understand why I can't use Netflix on my laptop outside of my home. I can use it just fine at home, but when I take it to a friends house or to work it just refuses to let me watch anything. But my phone is fine, it lets me watch on that. I just don't understand how this works so if anyone could clarify that would be amazing",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ktn9t6/my_laptop_isnt_a_part_of_my_netflix_account/"
    },
    {
        "id": "1ktea2j",
        "author": "S4v1r1enCh0r4k",
        "title": "Josh Hartnett to Star in Netflix's New Sea Creature Thriller Set in Newfoundland",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ktea2j/josh_hartnett_to_star_in_netflixs_new_sea/"
    },
    {
        "id": "1ktnfvz",
        "author": "Boring_Ant_1677",
        "title": "Lizzy Greene talks about Ransom Canyon",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktnfvz/lizzy_greene_talks_about_ransom_canyon/"
    },
    {
        "id": "1ktn4pw",
        "author": "meowindeu",
        "title": "horror movie from NYT",
        "content": "1. Sharp Corner\n2. Frewaka\n3. Cutter’s Club\n4. The Moogai\n5. Fear Street: Prom Queen\n\nagree?\n\n[nyt link](https://www.nytimes.com/2025/05/23/movies/five-horror-movies-to-stream-now.html?smid=nytcore-ios-share&amp;referringSource=articleShare)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktn4pw/horror_movie_from_nyt/"
    },
    {
        "id": "1kt7ain",
        "author": "Big-Negotiation888",
        "title": "“You are not a part of the household” rant",
        "content": "I’ve seen people on here confused about why their devices “aren’t part of the household” - EVEN when they are literally in the same house!!\n\nBut I just wanted to rant about this for a second. People should be able to use their profile if a family member is paying for the subscription, and I know I’d let my family use their profiles on my account too if that were the case. I’ve seen people who move for military reasons complain, and I am in college out of state so it’s super frustrating to be kicked out of my family’s subscription.\n\nIt’s such an egregious cash grab as well as a petty attempt to discourage password sharing that affects people who aren’t even doing so that unfairly (ie children on their parents’ subscription). It’s a genius business decision and you almost have to give it to em—forcing people into paying for more individual plans just so they can watch makes Netflix wayyy more money—but it’s just sooooo frustrating. Anyone else?? I just had to rant 😭",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1kt7ain/you_are_not_a_part_of_the_household_rant/"
    },
    {
        "id": "1kt928m",
        "author": "PhantomOfTheNopera",
        "title": "Pantheon: This show is so good. How have I never heard about it before?",
        "content": "(I'm just four episodes in so NO SPOILERS PLEASE.)\n\nI'll admit I slept in this one too. It only turned up because I looked up _Blood of Zeus_ (stupid, cringey show) and I suppose the name sounds vaguely mythological?\n\nBut it's really well written sci-fi with great voice acting. Just two episodes in and I'm hooked. It's still blowing my mind that I've never heard of it so I think 'heavily underrated' fits here. \n\nEdit: Really hoping the quality doesn't decline but so far so good!\n\n",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kt928m/pantheon_this_show_is_so_good_how_have_i_never/"
    }
]