[
    {
        "id": "1j2jmou",
        "author": "theatlantic",
        "title": "Hi! We’re Shirley Li and David Sims, staff writers at The Atlantic, where we cover culture and Hollywood. We watched the Oscars last night to see which events at the awards show can tell us about the future of the industry—and whether any films snagged an upset. Ask us anything!",
        "content": "",
        "upvotes": 99,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p30kmcwmghme1.jpeg?auto=webp&amp;s=137db712ab8b507063c04ac21a1101312b0186c5"
        },
        "permalink": "/r/movies/comments/1j2jmou/hi_were_shirley_li_and_david_sims_staff_writers/"
    },
    {
        "id": "1j254r1",
        "author": "LiteraryBoner",
        "title": "Official Oscars Thread 2025",
        "content": "Welcome to the r/movies Official Oscar Thread. Some notes about tonight!\n\n- All Oscar related content posted to r/movies will be condensed to this thread.\n\n- This thread will be sorted by New, refresh often so you can see the most recent comments and join the conversation!\n\n- There will be a post Oscar discussion thread as well posted soon after the ceremony closes.\n\n---\n\n**Best Picture**\n\n- **Anora**\n\n- The Brutalist\n\n- A Complete Unknown\n\n- Conclave\n\n- Dune: Part Two\n\n- Emilia Perez\n\n- I'm Still Here\n\n- Nickel Boys\n\n- The Substance\n\n- Wicked\n\n**Best Actor in a Leading Role**\n\n- **Adrien Brody in The Brutalist**\n\n- Timothee Chalamet in A Complete Unknown\n\n- Colamn Domingo in Sing Sing\n\n- Ralph Fiennes in Conclave\n\n- Sebastian Stan in The Apprentice\n\n**Best Actress in a Leading Role**\n\n- Cynthia Erivo in Wicked\n\n- Karla Sofia Gascon in Emilia Perez\n\n- **Mikey Madison in Anora**\n\n- Demi Moore in The Substance\n\n- Fernanda Torres in I'm Still Here\n\n**Best Supporting Actor**\n\n- Yura Borisov in Anora\n\n- **Kieran Culkin in A Real Pain**\n\n- Edward Norton in A Complete Unknown\n\n- Guy Pearce in The Bruatlist\n\n- Jeremy Strong in The Apprentice\n\n**Best Actress in a Supporting Role**\n\n- Monica Barbaro in A Complete Unknown\n\n- Ariana Grande in Wicked\n\n- Felicity Jones in The Brutalist\n\n- Isabella Rossellini in Conclave\n\n- **Zoe Saldana in Emilia Perez**\n\n**Best Animated Feature**\n\n- **Flow**\n\n- Inside Out 2\n\n- Memoir of a Snail\n\n- Wallace &amp; Gromit: Vengeance Most Fowl\n\n- The Wild Robot\n\n**Best Cinematography**\n\n- **The Brutalist**\n\n- Dune: Part Two\n\n- Emilia Perez\n\n- Maria\n\n- Nosferatu\n\n**Best Directing**\n\n- **Sean Baker, Anora**\n\n- Brady Corbet, The Brutalist\n\n- James Mangold, A Complete Unknown\n\n- Jacques Audiard, Emilia Perez\n\n- Coralie Fargeat, The Substance\n\n**Best Original Score**\n\n- **The Brutalist**\n\n- Conclave\n\n- Emilia Perez\n\n- Wicked\n\n- The Wild Robot\n\n**Best Foreign Language Film**\n\n- **I'm Still Here, Brazil**\n\n- The Girl with the Needle, Denmark\n\n- Emilia Perez, France\n\n- The Seed of the Sacred Fig, Germany\n\n- Flow, Latvia\n\n\n**Best Original Screenplay**\n\n- **Anora**\n\n- The Brutalist\n\n- A Real Pain\n\n- September 5\n\n- The Substance\n\n**Best Adapted Screenplay**\n\n- A Complete Unknown\n\n- **Conclave**\n\n- Emilia Perez\n\n- Nickel Boys\n\n- Sing Sing\n\n---\n\n[Here is a full list of nominees. ](https://www.oscars.org/oscars/ceremonies/2025)\n\nThe ceremony is at 7:00pm EST on ABC",
        "upvotes": 1736,
        "comments": 17872,
        "media": null,
        "permalink": "/r/movies/comments/1j254r1/official_oscars_thread_2025/"
    },
    {
        "id": "1j29pq0",
        "author": "MarvelsGrantMan136",
        "title": "2025 Oscar Winners: 'Anora' Wins Best Picture &amp; Director; Adrien Brody, Mikey Madison, Kieran Culkin, &amp; Zoe Saldaña Win Acting Awards (Full Winners List)",
        "content": "",
        "upvotes": 11993,
        "comments": 3141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q4loOQf3crB6dcmKhBngvBwKzG2fqxP5Tb9y-ivBcek.jpg?auto=webp&amp;s=92b7926fc390d559487c5a070d911d73208c1e14"
        },
        "permalink": "/r/movies/comments/1j29pq0/2025_oscar_winners_anora_wins_best_picture/"
    },
    {
        "id": "1j2h08o",
        "author": "NikNola2020",
        "title": "Juno is totally different as an adult",
        "content": "I recently watched Juno for the first time since I was about 13 or 14. I was in junior high I believe when the movie first released, and seeing it as an adult really blew my mind. The creators somehow perfectly captured the awkward and intense feelings of not being a kid, but not quite an adult yet either. \n\nFirst note, Mark was a massive creep and weirdo. Kissing a teenage girl when you’re an adult is creepy and gross all on its own. Then you throw in that SHE WAS CARRYING THEIR ADOPTIVE CHILD. What the actual fuck! What a disgusting pathetic man. Watching the scene when he took Juno to the basement to show her the comic of a pregnant super hero was so disgusting. Their relationship in general was coming off very grooming, then he was seducing a pregnant 16 year old girl who was extremely vulnerable. In my young teenage mind, I thought Vanessa was such a wet blanket, suppressing his creative side and making him and Juno both feel like losers. In reality, she was a saint who should have kicked him to the curb way sooner. He deserved no grace. I cannot imagine my partner not only cheating on me, but cheating with a teenager. And not just a teenager, a pregnant teenager who is carrying my adoptive son. Vanessa was such a great person and didn’t deserve anything that pathetic excuse of a man put her through. \n\nSecond note, Juno(and company) is extremely immature and the creators did a great job of showcasing it. I love her quirkiness, but the way she did not understand why it was inappropriate to be popping up at Mark and Vanessa’s house was very telling. There are two sides to that coin, because she may have known it was inappropriate but was too young and naive to see the long term outcome of the situation. She definitely didn’t understand why a man of his age shouldn’t be chumming it up with her. In fact, she seemed to enjoy the fact that he was even giving her attention at all. It helped that he liked the same things, so in her mind it was confirming she was cool. It just shows exactly how immature she was, unable to look past your own bubble to see the rest of your life. \n\nOn another note, it was implied that she and Bleaker were way better friends than what we saw in the movie. It seemed that they were hanging out everyday, had all the same interests and hobbies. But, when Juno came up pregnant Bleaker fell off the map. He never seemed pressed when she would stop and say hey, but he did absolutely nothing to try and help her in the situation. He also didn’t understand why it hurt her so much he was taking someone else to a dance. At that point in the plot, we really got to see how the normally confident and abrasive Juno was becoming self conscious and confused by the weight of her feelings. Highlighting how juvenile everyone was, while dealing with such a serious situation was just top tier writing. The whole movie did such a great job of capturing exactly how it feels to be 16. Too old for childhood, but nowhere near an adult yet. Even though every single 16 year old in the world thinks they’re an adult. It takes growing up to realize exactly how childish you still are at that age. \n\nI do think it’s worth mentioning how great of parents her dad and Bren were. Bren was her step mom and they didn’t seem particularly close, but she didn’t hesitate when it came to Juno. Of the jump, she was getting her to a doctor, coming to her defense when needed, and making sure she had everything she needed. And her father, who was obviously uncomfortable with emotional bridges with his teenaged daughter, made sure she knew she was loved. The scene of her in hospital after giving birth brought tears to my eyes. \n\nAs a whole, the movie is great. I’m not sure what category you could out this movie in, but they somehow captured a vibe of nostalgia I didn’t know I was missing. And just to bring it in again, we should all beat Marks ass if we ever happened to see his character out in the real world. ",
        "upvotes": 1402,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1j2h08o/juno_is_totally_different_as_an_adult/"
    },
    {
        "id": "1j28v96",
        "author": "twinbloodtalons",
        "title": "Conan O' Brien's Monologue To Open The 97th Oscars",
        "content": "",
        "upvotes": 2893,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RBFwPRZCm-OxsrBkIJSAhj_MIr3QqZX2V4seyiadzqc.jpg?auto=webp&amp;s=c2d575213332d7363fcb11ec479a455d333b03d6"
        },
        "permalink": "/r/movies/comments/1j28v96/conan_o_briens_monologue_to_open_the_97th_oscars/"
    },
    {
        "id": "1j2loy1",
        "author": "xradx666",
        "title": "Movie theaters",
        "content": "Sean Baker is right. We should be watching new movies in a theater. But something else seems to have changed. Something that has impacted me a lot more than COVID... \n\nI opt out of watching a lot more movies now than ever in a theater because of the prevalence of people in the theater who should not be there. \n\nIt seems like there used to be a degree of self awareness and respect for the fact that you're in a room for a specific reason - to watch a movie. Not to talk. Not to look at your phone. Not for a running commentary on the movie. Not as a babysitter for your kids. \n\nI legit do not understand it. I've been more annoyed and walked out of more movies in the past 5 years than my entire life. Never because of the movie itself. But the people who are ruining the experience. And this is not the exception - this has become the norm.\n\nThere's also no winning. No solution. Say something and get in a fight - or worse? Miss part of the movie by complaining to the theater? \n\nThe best I can hope for is to pick a showtime when the theater is almost empty. ",
        "upvotes": 98,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1j2loy1/movie_theaters/"
    },
    {
        "id": "1j29w5l",
        "author": "LiteraryBoner",
        "title": "2025 Oscars Post Game Thread",
        "content": "Feel free to discuss the Oscars in hindsight here! Some surprises but many well deserved wins!\n\n# We love da movies! ",
        "upvotes": 680,
        "comments": 1048,
        "media": null,
        "permalink": "/r/movies/comments/1j29w5l/2025_oscars_post_game_thread/"
    },
    {
        "id": "1j2jw2d",
        "author": "CrusherWillis",
        "title": "Will Conclave bring back the PG rated adult drama?",
        "content": "In recent years, the PG rating has been reserved almost exclusively for family fare from animation to faith based pictures. But now, Conclave has become a critical and financial success as a PG rated drama for grown ups, a genre which has seen few hits since the dawn of the PG13 rating. So will Conclave be the start of a new generation of films like Out of Africa and Driving Miss Daisy (PG rated Oscar winning dramas from the post PG13 era) or is it just an outlier?",
        "upvotes": 89,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1j2jw2d/will_conclave_bring_back_the_pg_rated_adult_drama/"
    },
    {
        "id": "1j1txhm",
        "author": "Icy_Smoke_733",
        "title": "The Highest-Earning Actors Of 2024 - The Rock Tops the List with $88M, Followed by Ryan Reynolds ($85M), Kevin Hart ($81M), Jerry Seinfeld ($60M), And Hugh Jackman ($50M) - Including all earnings, film salaries, &amp; other forms of income.",
        "content": "",
        "upvotes": 6138,
        "comments": 1175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nMtZd62ygfqdkt6mXMPXtTovwCJqPrgqGaqY51z7bl0.jpg?auto=webp&amp;s=07f9e3030089ae8d8c9232d063837766a4ef33d1"
        },
        "permalink": "/r/movies/comments/1j1txhm/the_highestearning_actors_of_2024_the_rock_tops/"
    },
    {
        "id": "1j2h3xw",
        "author": "MaxProwes",
        "title": "I rewatched Escape From LA (1996) and honestly shocked how well it aged despite some dodgy CGI, John Carpenter was always ahead of the curve and people appreciate it only years later",
        "content": "",
        "upvotes": 135,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sx4vD0KE03NgyIg_kT141LaGLK5IBMr1chf6pat_H38.jpg?auto=webp&amp;s=2121c80141b5ca7ef103a91f1da9fab45ae46b53"
        },
        "permalink": "/r/movies/comments/1j2h3xw/i_rewatched_escape_from_la_1996_and_honestly/"
    },
    {
        "id": "1j2aec8",
        "author": "RegularGuyy",
        "title": "How would you rank the Oscar best picture winners from the past 10 years?",
        "content": "These are the winners of best picture from the past 10 years. How would you rank these movies from 1-10 from best to worst?\n\nAlternate question: if these 10 movies were all released in 2024, which one do you think would have won the Academy Award for best picture? \n\n2024: Anora \n\n2023: Oppenheimer\n\n2022: Everything Everywhere All at Once\n\n2021: CODA\n\n2020: Nomadland\n\n2019: Parasite\n\n2018: Green Book\n\n2017: The Shape of Water\n\n2016: Moonlight\n\n2015: Spotlight\n\n2014: Birdman",
        "upvotes": 543,
        "comments": 650,
        "media": null,
        "permalink": "/r/movies/comments/1j2aec8/how_would_you_rank_the_oscar_best_picture_winners/"
    },
    {
        "id": "1j20cxb",
        "author": "JannTosh50",
        "title": "The Sound of Music at 60: a flawed but enduring cultural touchpoint",
        "content": "",
        "upvotes": 2005,
        "comments": 407,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dE4b6L6SY8Fi5v5_zvxDskJJ12u6b24eTYlUW-4-hEU.jpg?auto=webp&amp;s=634a7deaa49d62b57cdf882a685606abfa1bde6e"
        },
        "permalink": "/r/movies/comments/1j20cxb/the_sound_of_music_at_60_a_flawed_but_enduring/"
    },
    {
        "id": "1j2fduq",
        "author": "GlobexCoporationMD",
        "title": "UK Oscars coverage - a studio of irrelevant party poopers.",
        "content": "I know Johnathan Ross used to present Film on BBC, but he looked like he could barely keep his eyes open mid-way through the show, his jokes were unfunny and all very mean spirited. Mariella Frostrup seemed to role her eyes savagely at anything she deemed unworthy, pointless or less noble than her own favourites. Jason Isaacs admitted he couldn't stand awards ceremonies. The only person seemingly happy to be there and offering some genuine thought behind her opinions was Elle Osili-Wood. \n\nIt was infuriating having to keep switching back to a studio full of grumpy whingers about what they didn't like. I would rather have just had ad breaks! Just don't put smug, highly critical old-farts together when trying to appeal to an awards show audience. ",
        "upvotes": 152,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1j2fduq/uk_oscars_coverage_a_studio_of_irrelevant_party/"
    },
    {
        "id": "1j2dhex",
        "author": "matt73132",
        "title": "Does anyone think the movie The Burbs was one of the most unique and oddly fascinating comedies ever made?",
        "content": "It has an endearing quality to it. After you've watched it one time, you don't think that much about it, but then it grows on you like a fungus. It reminds me of hanging out with everyone in my neighborhood when I was a kid. It was such an original idea for a comedy (you could also say it was a semi-dark comedy) and there hasn't been anything quite like it since.",
        "upvotes": 145,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1j2dhex/does_anyone_think_the_movie_the_burbs_was_one_of/"
    },
    {
        "id": "1j2hojp",
        "author": "processocivil42",
        "title": "Give I’m Still Here a chance",
        "content": "Now that the awards season is over, there’s something I’d like to vent about. While most of the discussion surrounding the Oscar-nominated movies revolved around the likes of Anora, The Brutalist, Conclave, and Emilia Perez, I couldn’t help but notice that I’m Still Here was overlooked by most moviegoers. For instance, Fernanda Torres, the lead actress of I’m Still Here, delivered a performance that was every bit as Oscar-caliber as anyone else’s. However, in the outcry over Mikey Madison’s victory, I struggled to see anyone mentioning her in the Oscar’s threads as a potential contender, especially compared to Demi Moore, who many people thought deserved the award (though Fernanda was my first choice).\n\nThe reason for this is simple: not many people bothered to watch I’m Still Here in the first place. And I’d like to encourage you to do just that. I’m biased, of course, as a Brazilian, but I’m Still Here tells a unique story (that of Eunice Paiva and her family) in a very special way (kudos to Walter Salles, who is a national treasure). I have yet to meet anyone—Brazilian or not—who watched the movie and didn’t like it. So, please, give it a chance! You won’t be disappointed.\n\nBTW, I’m not saying that I’m Still Here didn’t get any recognition at all. I read a couple of articles (NYT, for example) in which it was mentioned as a frontrunner for the Best Actress award. Furthermore, it won Brazil’s first Oscar with its Best International Feature award victory, and first Golden Globe with Fernanda Torres’ victory. I just felt, from what I could read here on Reddit and other social media platforms, that not many people were talking about it as much as I felt it deserved, given its quality vis-à-vis the other nominees.",
        "upvotes": 37,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1j2hojp/give_im_still_here_a_chance/"
    },
    {
        "id": "1j2lzgf",
        "author": "Comic_Book_Reader",
        "title": "The Woman In The Yard | Official Trailer 2",
        "content": "",
        "upvotes": 17,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0FYmf9_elr6jWN8vjuddYENyFusV-wl29I8sUcWPKrs.jpg?auto=webp&amp;s=1a43e5983949966657b16fe24c4176078c11acfb"
        },
        "permalink": "/r/movies/comments/1j2lzgf/the_woman_in_the_yard_official_trailer_2/"
    },
    {
        "id": "1j2mou6",
        "author": "Quick-Ad9335",
        "title": "At what point do they stop inviting you to the Oscars?",
        "content": "Is it a popularity or relevance thing? I assume that at some point they stopped inviting Corey Haim or Richard Grieco? Or did/does he still get invites but he just doesn't go? When (my beloved) Anna Clumsky retired did they stop sending her invites, but then restarted them when she resumed her career?\n\nIs it a fundamental difference thing? Did Jim Caviziel get invited? Or Mel Gibson?\n\nScandal? Did Woody Allen get an invitation? Has there been a standing invitation for Roman Polanski that he's just never used?\n\nI've always been curious and hopefully somebody knows.",
        "upvotes": 13,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1j2mou6/at_what_point_do_they_stop_inviting_you_to_the/"
    },
    {
        "id": "1j1y0ba",
        "author": "tripp1edubb1e",
        "title": "Secret Mall Apartment | Official Trailer HD",
        "content": "",
        "upvotes": 721,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/STAQ7uCLOSOBLrSSs1pSFe0n95hry6X2F4yNLXktC5Q.jpg?auto=webp&amp;s=03376b6b69b55615dceed85e526549a476405f16"
        },
        "permalink": "/r/movies/comments/1j1y0ba/secret_mall_apartment_official_trailer_hd/"
    },
    {
        "id": "1j2bhoq",
        "author": "erasrhed",
        "title": "Michael Shannon in Groundhog Day",
        "content": "This is a quick one.  I was watching Groundhog Day again for the millionth time, and this is the first time I noticed that Michael Shannon is the young newlywed. First he's in the diner, but I didn't notice it was him until the end when Phil gives him and his new wife tickets to WrestleMania. Crazy. He's so young!  Anyway, just thought people would be into the trivia tidbit. ",
        "upvotes": 92,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1j2bhoq/michael_shannon_in_groundhog_day/"
    },
    {
        "id": "1j2kltz",
        "author": "These_Feed_2616",
        "title": "The Shawshank Redemption",
        "content": "SPOILERS: I genuinely used to not understand the hype when I was younger and I only judged the film on a couple of clips and never saw the whole thing, I can now say that I was ignorant. I saw the film a bunch of times in the last few years in it’s entirety, and I grew to absolutely adore the film, it’s now in my top 10 of all time, everything about it, the whole idea of hope and believing that one day things will be better. Morgan Freeman’s narration is absolutely perfect and he has so much soul in his voice, they couldn’t have picked a better person for Red. The entire scene with Brooks’s monologue and him committing suicide after being in prison for 50+ years has brought a tear to my eye every time I see it. The setting, the acting, the characters, the message, it is all top notch, and the cherry on top is the ending. The ending is so satisfying, after all the misery and hardship, Andy and Red reuniting on the beach in Mexico. It is such a beautiful, touching film with so much soul in it, and it is one of those few films that is just perfect in every way. It is the perfect film to watch if you’re in a dark place in you’re life, watching Andy getting his life ruined, but never giving up and always relying on hope, to have it all pay off in the end, whenever I watch this, by the end of the film, I always feel happy to be alive, because of the hopeful message, this film is optimism personified. The Shawshank Redemption is a masterpiece, and I genuinely believe it should’ve won best picture in 1994!",
        "upvotes": 15,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1j2kltz/the_shawshank_redemption/"
    },
    {
        "id": "1j2bhph",
        "author": "KiloShotz",
        "title": "Watching Zero Day and I was thinking to myself, “man, Jesse Plemons is just killing it with movies”",
        "content": "Anyone else amazed by Jesse Plemons’ career? He’s been in so many incredible films, always delivering top-tier performances. It feels like he’s quietly becoming one of the great actors of our time. Is he underrated, or is he finally getting the recognition he deserves? What’s your favorite role of his?",
        "upvotes": 82,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1j2bhph/watching_zero_day_and_i_was_thinking_to_myself/"
    },
    {
        "id": "1j21bku",
        "author": "yanakozlova",
        "title": "What's a movie that you liked, but most other people seem to not like?",
        "content": "For me it would be \"Bright\", I honestly don't know why people hated it.\n\nIt hade the same vibe as \"Dark Blue\" but was a bit more digestible because of the fantasy elements.\n\nIt also was very ambitious and crossed two genres you would never think would work together.\n\nMuch better than other movies that tried crossing geners (I'm looking at you \"Cowboys and Aliens\").\n\nWhat exactly was it that people hated about it?",
        "upvotes": 196,
        "comments": 626,
        "media": null,
        "permalink": "/r/movies/comments/1j21bku/whats_a_movie_that_you_liked_but_most_other/"
    },
    {
        "id": "1j1zdzi",
        "author": "ThatOneCameo",
        "title": "Hard Boiled (Modern Trailer)",
        "content": "A cop who loses his partner in a shoot-out with gun smugglers goes on a mission to catch them. In order to get closer to the leaders of the ring he joins forces with an undercover cop who's working as a gangster hitman. They use all means of excessive force to find them. \n\nI have been in a John Woo mood lately, so I made this fan trailer for one of the best Hong Kong action films ever made. What’s your favorite Woo?",
        "upvotes": 196,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdp2uMMEYanP3hl6vkJUHwC6QgHt3btwHiyquPvKRcM.jpg?auto=webp&amp;s=efb85602ce7c301ddfc336c7136c79df62f88435"
        },
        "permalink": "/r/movies/comments/1j1zdzi/hard_boiled_modern_trailer/"
    },
    {
        "id": "1j1wvy6",
        "author": "AdSpecialist6598",
        "title": "What is your favorite actor going against type movie?",
        "content": "Mine is a film called Ocean's Heaven where Jet Li plays a struggling father who is trying to care for his mentally impaired son while battling a terminal illness. Jet Li plays a completely different character in a completely different movie for him, but he does a fantastic job. He  shows so much emotional depth and earnestness in his performance.",
        "upvotes": 262,
        "comments": 330,
        "media": null,
        "permalink": "/r/movies/comments/1j1wvy6/what_is_your_favorite_actor_going_against_type/"
    },
    {
        "id": "1j1rsxm",
        "author": "marchof34_",
        "title": "Like Tears in Rain | Trailer UK/US",
        "content": "",
        "upvotes": 381,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9FIGpJG5gwSBwPKlS8zoG7dmmOmACu2iAcLlnJYkQHw.jpg?auto=webp&amp;s=0505fc5737fe17aaec1e582e5685836461024142"
        },
        "permalink": "/r/movies/comments/1j1rsxm/like_tears_in_rain_trailer_ukus/"
    },
    {
        "id": "1j17tas",
        "author": "MarvelsGrantMan136",
        "title": "Harrison Ford drops out as presenter at 2025 Oscars after shingles diagnosis",
        "content": "",
        "upvotes": 16016,
        "comments": 671,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/omd8CskG_zMc72cfv5I4ayCTBUVFeBDXAtTM3t_u9do.jpg?auto=webp&amp;s=d294acf6d9fcb067f7464efb9f3534eea19daaab"
        },
        "permalink": "/r/movies/comments/1j17tas/harrison_ford_drops_out_as_presenter_at_2025/"
    },
    {
        "id": "1j2l3wa",
        "author": "mwoodruf99",
        "title": "History of the Cat in The Godfather Movie",
        "content": "Anyone who's seen The Godfather knows the famous **opening scene** when Don Corleone is holding the cat at his desk. *But, do you know anything about the cat?* \n\nHere's a few interesting facts: \n\n* Director **Francis Ford Coppola found the stray cat** in the Paramount movie lot during filming\n* There was **never a cat in the script**, and Coppola added it spontaneously to show Don VIto Corleone's soft side\n* The cat **purred so loudly**, it overpowered some of Brando's lines, and the scene had to be edited later\n\n**Marlon Brando** was happy to add the cat to the scene, as he was a huge cat person, once saying, *\"I live in my cat's house.\"* \n\nAnyway, I love the story of The [Godfather Cat](https://believemeow.com/brandos-cat-godfather-movie-scene/) because it shows how some of the best movie scenes are unplanned and improvised! ",
        "upvotes": 5,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KcgyIlBq5oBYxsOtPb9vg1iPxqPtJ6ycMZ5Xh9WG7A0.jpg?auto=webp&amp;s=06cf3fd258739b1d9ffcfcc23010521f2de41de8"
        },
        "permalink": "/r/movies/comments/1j2l3wa/history_of_the_cat_in_the_godfather_movie/"
    },
    {
        "id": "1j2bcgr",
        "author": "UnicornPancreas",
        "title": "Looking for romantic horror movies like \"Spring\"",
        "content": "I recently watched Spring, and I think it did a pretty good job of using the body horror/Lovecraft elements as a B plot, with the romance front and center. The majority of the film was getting to know the characters and their burgeoning relationship, with horror sprinkled in amidst it all.\n\nDoes anyone know of any other movies that do this well? I really like romance, and I really like horror (especially monster/body horror), so I'm hoping to dig deeper into this subgenre that squishes them together.",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1j2bcgr/looking_for_romantic_horror_movies_like_spring/"
    },
    {
        "id": "1j25582",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Game Thread",
        "content": "---\n\nWelcome to Oscar Bingo! This thread is for discussing anything related to Oscar Bingo, hosted by /r/movies and print-bingo.com. Discuss your game cards, official rulings, and generally anything Oscar Bingo related. Most importantly, have fun!\n\nIn case you missed it:\n\n#- [Game Card Generator](https://print-bingo.com/reddit/oscars2025.php)\n\n\n---\n\nHere are some official rules for tonight's game:\n\n- Official rulings on the more subjective answers will be posted in the comments by me. They are open for discussion but at the end of the day I have final say.\n\n- 5 in a row wins. Horizontal, vertical, or diagonal. None of this weird four corners bullshit.\n\n- /u/ me to ping me if you have a question. But also be aware, I'm multitasking this, the oscar thread, and getting fucked up.\n\n- If you win, be sure to yell \"BINGO\" as loud as you can wherever you are. If you want to post your winning gamecard and collect your modest karma, that would be cool too.\n\n- This is for fun. Don't take it too seriously and don't spend too much time arguing with official rulings. \n\n- This should go without saying, but only things shown on screen during the ceremony will count. No first hand accounts or background activities. Also, no pre-show. No one wants the game to be over before it begins!\n\n- [Here's last years game thread](https://old.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/)\n\n------\n\n\nHave fun and a big thanks to print-bingo.com helping make this fun and easy for everyone!",
        "upvotes": 43,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1j25582/oscar_bingo_xii_game_thread/"
    },
    {
        "id": "1j1gvxt",
        "author": "Geauxtoguy",
        "title": "What's the worst movie to win an Oscar?",
        "content": "I completely understand that a lot of award shows, especially the Oscar's, are mostly internal politics; and just because a movie wins an award doesn't necessarily mean it's actually a great film. \n\nI know a ton of movies that SHOULD have won an award, but I want to hear your thoughts on some of the worst movies that HAVE won at least one Oscar. ",
        "upvotes": 2154,
        "comments": 3134,
        "media": null,
        "permalink": "/r/movies/comments/1j1gvxt/whats_the_worst_movie_to_win_an_oscar/"
    },
    {
        "id": "1j1zgke",
        "author": "cannonhawk",
        "title": "Nyaight of the Living Cat",
        "content": "",
        "upvotes": 82,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/he-8xYyQBVYLlY7jyiVDmjy3Fgj_8Orr43wPq6Ij18Q.jpg?auto=webp&amp;s=a4d3caaaa7bc8f6aa3f009b6fe37634050a9dfaa"
        },
        "permalink": "/r/movies/comments/1j1zgke/nyaight_of_the_living_cat/"
    },
    {
        "id": "1j2lo0d",
        "author": "Substantial_Wave4934",
        "title": "Color movies you'd recommend watching in black and white",
        "content": "To be clear I'm not asking for your favorite black and white movies, but rather color movies that you think would look good in black and white. Perhaps it might improve the special effects, or maybe just change the feel or tone giving a fresh feel to an old classic.\n\nI know a handful of modern movies have a black and white version, like The Mist, Mad Max Fury Road, and Parasite. I think they were filmed with that intention in mind. But are there any movies that were never intended to be black and white but still could benefit from a viewing that way?",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1j2lo0d/color_movies_youd_recommend_watching_in_black_and/"
    }
]