[
    {
        "id": "1qgdlpp",
        "author": "SheepdogAMA",
        "title": "Hey r/movies! I’m Steven Grayhm (writer/director/producer/star) of the award-winning\nmovie SHEEPDOG—out in theaters now. SHEEPDOG addresses our current global\nmental health crisis, explores the physical and psychological repercussions of trauma\nfrom war with an uplifting message. Ask me anything!",
        "content": "Hey r/movies! I’m Steven Grayhm (writer/director/producer/star) of the award-winning movie SHEEPDOG—out in theaters now. SHEEPDOG addresses our current global mental health crisis, explores the physical and psychological repercussions of trauma from war with an uplifting message that focuses on Post Traumatic Growth (PTG).\n\n**Cast:** \n\n* Academy Award Nominee ® Virginia Madsen (Sideways)\n* Emmy Nominee ® Vondie Curtis Hall (The Recruit)\n* Tony Nominee ® Lilli Cooper (The First Snow of Fraggle Rock)\n* SAG Nominee ® Dominic Fumusa (Dexter: Resurrection)\n* HFA Nominee ® Matt Dallas (Kyle XY)\n* Steven Grayhm (The Five People You Meet in Heaven)\n\n**Distributor:** \n\nAllen Media Group\n\n**Release date:** \n\nJanuary 16th, 2026 (in theaters!)\n\n**Trailer:** \n\n[https://www.youtube.com/watch?v=Qx7LB1gpWL4\\&amp;amp;t=147s](https://www.youtube.com/watch?v=Qx7LB1gpWL4&amp;amp;t=147s)\n\n**Synopsis:**\n\nA decorated combat Veteran is court ordered into treatment when an ex-convict shows up on his doorstep and reveals that he must put himself back together again.\n\n  \nI'll be back tomorrow (Monday 1/19) at 3 PM ET to answer questions. Ask me anything!",
        "upvotes": 9,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y4e6xju705eg1.png?auto=webp&amp;s=0a5c5e3ff03c2ca0ddd9202b766765c18b4b68a0"
        },
        "permalink": "/r/movies/comments/1qgdlpp/hey_rmovies_im_steven_grayhm/"
    },
    {
        "id": "1qdihk3",
        "author": "SamRaimiAMA",
        "title": "Hey /r/movies! I'm Sam Raimi. Ask me anything!",
        "content": "Hey reddit. I'm Sam Raimi. You might know me as the director (and sometimes writer) of **The Evil Dead** Trilogy, the Tobey Maguire **Spider-Man** Trilogy, **Doctor Strange in the Multiverse of Madness**, **Drag Me To Hell**, **Darkman**, **A Simple Plan**, **For the Love of the Game**, **The Gift**, and other things. I've also produced and/or acted in a few things!\n\nI'm here today to answer your questions.\n\nMy new film, **SEND HELP**, is out in theaters January 30 via 20th Century Studios. It stars Rachel McAdams and Dylan O'Brien. More info:\n\n*Synopsis*:\n\n&gt;Two colleagues become stranded on a deserted island, the only survivors of a plane crash. On the island, they must overcome past grievances and work together to survive, but ultimately, it's an unsettling, darkly humorous battle of wills and wits to make it out alive. \n\n**SEND HELP** is directed by genre-bending visionary Sam Raimi and stars Oscar-nominee Rachel McAdams and Dylan O’Brien. The film is produced by Raimi and Zainab Azizi, executive produced by JJ Hook and written by Damian Shannon &amp; Mark Swift, with original music by Danny Elfman. The all-original darkly comedic psychological thriller from 20th Century Studios releases in theaters nationwide on January 30, 2026.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=R4wiXj9NmEE](https://www.youtube.com/watch?v=R4wiXj9NmEE)\n\n*“The Sam Raimi Experience” BTS Content Piece:*\n\n[https://www.youtube.com/watch?v=coCPLJMU4X0](https://www.youtube.com/watch?v=coCPLJMU4X0)\n\nAsk me anything! Back at 12 PM PT/3 PM ET to chat with you all.",
        "upvotes": 12790,
        "comments": 3569,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4g2u245didg1.jpeg?auto=webp&amp;s=cc13e141b90c183d0be8040f35c355ddf1105ded"
        },
        "permalink": "/r/movies/comments/1qdihk3/hey_rmovies_im_sam_raimi_ask_me_anything/"
    },
    {
        "id": "1qh08z5",
        "author": "DegTrader",
        "title": "We’ve reached the point where ‘Background CGI’ is more distracting than bad practical effects. Which modern movie was ruined for you by a ‘clean’ digital look?",
        "content": "just rewatched Fury Road (2015) and man... it’s still insane how much more \"real\" it feels than anything from the last 2 years.\n\nthen i see the stuff for the Minecraft movie and it’s just painful lol. u have jack black and jason mamoa standing in this weird fluorescent green screen sludge that looks so sharp it actually hurts my eyes. there’s no \"glue\" holding the actors to the world. everything is too clean.\n\nin fury road u can feel the grit. even the cgi was layered over actual dirt and metal. now we just get actors stuck in a \"Volume\" where the lighting on their faces never matches the sky. we traded texture for fidelity and it looks like crap.\n\nam i just getting old or do movies just look like digital sludge now?? i miss when movies felt dusty.",
        "upvotes": 2770,
        "comments": 601,
        "media": null,
        "permalink": "/r/movies/comments/1qh08z5/weve_reached_the_point_where_background_cgi_is/"
    },
    {
        "id": "1qh7ilt",
        "author": "Sirwired",
        "title": "Saw LOTR trilogy this past weekend... I don't think we'll be getting any films out of Peter Jackson any time soon",
        "content": "I watched the LOTR trilogy this past weekend, and as is pretty common with the Fathom Events, there was a little bit before the movie started.  This time it was a little off-the-cuff monologue by Peter Jackson.\n\nWow; I know it's been 25 years, but he looked... rough.  He was having a hard time keeping a train of thought going, and in the intro to ROTK, he mentioned that after the Hobbit movies were finished, his go-to Director of Photography died of a heart attack, and that caused to have a real lack of motivation to make more movies (besides documentaries from existing footage.) He was both personally affected by the death, and he wasn't looking forward to learning to collaborate with a new DP.\n\nI hope he's okay, and that this was just not a good day for him to film some obligatory chit-chat.\n\n(Though he did have some cute little anecdotes, like how when he would visit Christopher Lee in England, his wife would hand over a bottle of potent booze to the two of them before heading out for the evening, and they'd get hammered while Peter got to learn all kinds of interesting stuff about Christopher Lee's time in horror movies.)",
        "upvotes": 626,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1qh7ilt/saw_lotr_trilogy_this_past_weekend_i_dont_think/"
    },
    {
        "id": "1qgxcih",
        "author": "Opening-Lead5629",
        "title": "Sam McCurdy ('Game of Thrones', 'Shogun') is the cinematographer for DC's 'Man Of Tomorrow'",
        "content": "",
        "upvotes": 1182,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/31DQhxqlxuzeos54M8iK4gD4n2h4Wz4AQrswpSX_A0M.jpeg?auto=webp&amp;s=8b15e2380812632fd0fb876077fcdc1787d6c635"
        },
        "permalink": "/r/movies/comments/1qgxcih/sam_mccurdy_game_of_thrones_shogun_is_the/"
    },
    {
        "id": "1qgderu",
        "author": "AnnenbergTrojan",
        "title": "'Zootopia 2' Is Now Hollywood's Highest Grossing Animated Film Ever",
        "content": "",
        "upvotes": 6815,
        "comments": 491,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1fB2Fgm7bZf74KrmvKUBgGEziwq30T6TNF9ir3BEWE8.jpeg?auto=webp&amp;s=77b433a3931eb8f358357f252978055c622a0943"
        },
        "permalink": "/r/movies/comments/1qgderu/zootopia_2_is_now_hollywoods_highest_grossing/"
    },
    {
        "id": "1qh5ycc",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy 'Idiotka' - A disgraced fashion designer with a dangerously low credit score, Margarita (Anna Baryshnikov) enters a reality show with a six-figure cash prize to save her babushka's West Hollywood apartment.",
        "content": "",
        "upvotes": 102,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3wtlqrdlibeg1.jpeg?auto=webp&amp;s=71f340294d1aab43b0de6bfc7f276a2072a285fc"
        },
        "permalink": "/r/movies/comments/1qh5ycc/first_poster_for_comedy_idiotka_a_disgraced/"
    },
    {
        "id": "1qgaz2t",
        "author": "DemiFiendRSA",
        "title": "‘Marty Supreme’ Becomes A24’s Highest-Grossing Film Domestically With $80 Million",
        "content": "",
        "upvotes": 9512,
        "comments": 1015,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gq3tHwggetJ2tHhmUfPHu-fM0tuuDRans6zzBg8uDJk.jpeg?auto=webp&amp;s=d7e60e2a187bcf1d62083872e5aabb9fc2b66850"
        },
        "permalink": "/r/movies/comments/1qgaz2t/marty_supreme_becomes_a24s_highestgrossing_film/"
    },
    {
        "id": "1qh19zx",
        "author": "sensesalt",
        "title": "Universal Pictures’ Live-Action First-Window Deal With Netflix Begins a Year Early",
        "content": "",
        "upvotes": 139,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gb5HwP6Eq3DB5qRHOoQgNYB_VjDbtqVr-bpz5qVXWjs.jpeg?auto=webp&amp;s=6a11973c60850b191167e8447043c8a3a4512bb8"
        },
        "permalink": "/r/movies/comments/1qh19zx/universal_pictures_liveaction_firstwindow_deal/"
    },
    {
        "id": "1qghgc6",
        "author": "InvestigatorFull7520",
        "title": "Just finished The Prestige 2006 and my brain is broken (Full Spoilers)",
        "content": "Just finished The Prestige and damn my brain is spinning. I went in thinking it’s just two rival magicians trying to outsmart each other. But nah, this movie is way twisty..  \n\n\nThe biggest shock for me was Borden being two people. Alfred and Fallon were twins the whole time, living one life as one man. That’s why sometimes he is loving and sometimes cold. Sometimes he cares for his wife and sometimes he feels like a stranger. They literally destroyed their personal lives just to protect one magic trick. That’s crazy dedication.\nThen Angier… this part really messed me up. I thought he finally used a double. But no, Tesla’s machine was real. It was cloning him. Every single show, one Angier survives and the other one dies in the tank. He never even knows if he will be the man who lives or the man who drowns. He keeps killing himself again and again just to win. That is straight up disturbing.\n\nThen I realized the opening murder wasn’t even normal murder. Angier planned his own death to frame Borden. He sacrificed himself just to destroy his enemy. That’s how deep his obsession went.\nThe ending hurt. One Angier is drowning in the tank and the other is bleeding on the floor. No winners at all. Just two broken men who ruined their lives for obsession.",
        "upvotes": 2166,
        "comments": 411,
        "media": null,
        "permalink": "/r/movies/comments/1qghgc6/just_finished_the_prestige_2006_and_my_brain_is/"
    },
    {
        "id": "1qgpeo3",
        "author": "kryonik",
        "title": "Examples of anti-Chekhov's guns?",
        "content": "A rule of thumb for playwrights is that any significant story element introduced early in the play should have some sort of payoff before the play ends. If you introduce a gun in act one of a three act play, it better go off in act three or it was an extraneous detail that should be excised from the script. The same rule is often applied to movies as well.\n\nMy question is what examples of an anti-Chekhov gun are there: not just a plot device that has no payoff but a plot device that is introduced and subsequently works in a way antithetical to the way the movie explains. Basically how many movies lie to the audience.\n\nTwo examples come to mind: in Jurassic Park, it's shown early on that the t-rexes are so massive that their footsteps can be heard from far away and shake the ground but later in the climax, a T-Rex seemingly appears out of nowhere with no warning. In Ant Man, it's explained that items that are shrunk down maintain their mass, that's why a punch from a microscopic Ant Man packs the punch of a full grown adult yet we see later in the movie that Hank Pym is carrying around a shrunk down tank that should way thousands of pounds on a keychain.",
        "upvotes": 764,
        "comments": 500,
        "media": null,
        "permalink": "/r/movies/comments/1qgpeo3/examples_of_antichekhovs_guns/"
    },
    {
        "id": "1qgim05",
        "author": "MarvelsGrantMan136",
        "title": "‘The Lion King’ Co-Director Roger Allers Dies at 76",
        "content": "",
        "upvotes": 1763,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1qgim05/the_lion_king_codirector_roger_allers_dies_at_76/"
    },
    {
        "id": "1qgve4b",
        "author": "John_Snow80",
        "title": "Which film’s soundtrack or score is so essential that removing it would collapse the entire movie?",
        "content": "Beyond just “good music,” some films use soundtracks and scores as a narrative device or emotional guide, almost like a character. Think of scores that define the atmosphere, or soundtracks that advance the plot in place of dialogue.  \n\n\nExamples: \n\n*Baby Driver* (music syncs with action)\n\n*The Social Network* (score mirrors anxiety)\n\n*Guardians of the Galaxy* (mixtape as emotional backbone)\n\nHow does the music do more than just accompany scenes? Could the film have worked without it?",
        "upvotes": 267,
        "comments": 792,
        "media": null,
        "permalink": "/r/movies/comments/1qgve4b/which_films_soundtrack_or_score_is_so_essential/"
    },
    {
        "id": "1qgbfu2",
        "author": "flowersnifferrr",
        "title": "I don't understand the point of Disney live action remakes",
        "content": "The original films are always infinitely better, as the remakes lack in artistry, cohesion, imagination and execution. They're so grey and muddled. They're ugly, poorly adapted and so so GREY! \n\n\nIf they're not washing out the colors of what was once a vibrant animated feature, then they're completely missing the point of central story and character arcs. They also ruin the music!\n\n\nWhat's the point of engaging with these? What's the point of entertaining this kind of mediocrity in the industry, when the originals are available and always much better? \n\n\nEDIT: I miss integrity :/ \n\n\nEDIT 2: My first edit was a joke ",
        "upvotes": 3116,
        "comments": 1239,
        "media": null,
        "permalink": "/r/movies/comments/1qgbfu2/i_dont_understand_the_point_of_disney_live_action/"
    },
    {
        "id": "1qgqc70",
        "author": "KillerQ97",
        "title": "When someone mentions “DVD Special Features,” what is the FIRST one that pops into your head from yesteryear?",
        "content": "When someone mentions “DVD Special Features,” what is the FIRST one that pops into your head from yesteryear?\n\nFor me, it’s definitely \"The Lost Tape: Andy's Terrifying Last Days Revealed\" on the DAWN OF THE DEAD (2004) remake.  That 17 minutes just really stuck with me…\n\nFor me, it’s definitely \"The Lost Tape: Andy's Terrifying Last Days Revealed\" on the DAWN OF THE DEAD (2004) remake.  That 17 minutes just really stuck with me…",
        "upvotes": 457,
        "comments": 684,
        "media": null,
        "permalink": "/r/movies/comments/1qgqc70/when_someone_mentions_dvd_special_features_what/"
    },
    {
        "id": "1qgvpa8",
        "author": "-janusjanus-",
        "title": "Remember the first R-Rated movie you ever watched?",
        "content": "A friend’s cousin just watched his first “adult” movie, I mean his first R-rated movie, and it makes me chuckle that it happened to be The Wolf of Wall Street. Mostly because he’s the kind of guy who doesn't use swear words, and that movie is basically 99% profanity. I get the feeling it sort of expanded his vocabulary a little.\n\nHe asked me what the first R-rated movie I ever watched was, and I can’t remember for sure, but it was probably The Terminator. I definitely wasn’t old enough when I watched it. I have these really vivid memories of watching it with friends in some dark room, feeling both exhilarated and deeply anxious the entire time. That eye surgery scene was freaky, and the factory scene at the end when the Terminator is just a metal skeleton gave me nightmares.\n\nStill, I remember being so glad I’d seen it. I didn’t know movies could do that, could make you feel such intense fear, excitement, and awe. Just felt like some of a revelation. It was probably the first time I realized how powerful movies could be.\n\nHow about yoU?",
        "upvotes": 200,
        "comments": 862,
        "media": null,
        "permalink": "/r/movies/comments/1qgvpa8/remember_the_first_rrated_movie_you_ever_watched/"
    },
    {
        "id": "1qgvbdj",
        "author": "jurdan26",
        "title": "PACKED theater 🥹",
        "content": "hey y'all!! I wanted to share something really cool that happened today. I was just at the movie theater seeing Hamnet (it's AMAZING, highly recommend), and my little Cinemark was PACKED. idk if it's just MLK weekend or what, but my theater in the middle of nowhere Texas was absolutely TEEMING with life. Like I could barely get popcorn the lines were so long, and they had every single bloody cash register staffed with people. The theater itself for Hamnet was sold out. I've been to the theater nearly five times in the last two months, and each time, it only gets busier. \n\nAnyways, I just wanted to share something really positive, because it made me nearly cry I was so happy. art never does die, even when we're worried it will :)",
        "upvotes": 192,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1qgvbdj/packed_theater/"
    },
    {
        "id": "1qh7lxf",
        "author": "Gato1980",
        "title": "'Red, White &amp; Royal Blue' sequel begins production",
        "content": "",
        "upvotes": 26,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7DTPTcINLzC_WURJ6xvq3ABjX32HIQWvMaBT9xsMhZE.jpeg?auto=webp&amp;s=1874e37e09bafcce0438af5354517df1c8e18d55"
        },
        "permalink": "/r/movies/comments/1qh7lxf/red_white_royal_blue_sequel_begins_production/"
    },
    {
        "id": "1qgpyv9",
        "author": "Morgan-Moonscar",
        "title": "\"Ran\" 乱 (1985, Akira Kurosawa) - The death of Lady Kaede (Mieko Harada)",
        "content": "",
        "upvotes": 358,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jwK7_KdzJiePmRf_o8sH5FD913R22epWrNFlkfUbDCc.jpeg?auto=webp&amp;s=5b040870b36cd1b69e79e0dea69a93ccbe02c5e3"
        },
        "permalink": "/r/movies/comments/1qgpyv9/ran_乱_1985_akira_kurosawa_the_death_of_lady_kaede/"
    },
    {
        "id": "1qh1xnl",
        "author": "enemyofbadmovies",
        "title": "Director Hikari on the Audience Reception to ‘Rental Family’",
        "content": "",
        "upvotes": 49,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OOonuzVOfO23xO-_A9WiPFpzaoYRksLdjf_YKKyjjbk.jpeg?auto=webp&amp;s=b809d6058628265786edb702c7c4c2a923a79328"
        },
        "permalink": "/r/movies/comments/1qh1xnl/director_hikari_on_the_audience_reception_to/"
    },
    {
        "id": "1qglr4p",
        "author": "SanderSo47",
        "title": "Almost Famous (2000, dir. Cameron Crowe) – William Miller meets Lester Bangs.",
        "content": "",
        "upvotes": 424,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bi8c1aifk6eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qglr4p/almost_famous_2000_dir_cameron_crowe_william/"
    },
    {
        "id": "1qh70ve",
        "author": "bitchcraffft",
        "title": "The Life of Chuck detail",
        "content": "Watched The Life of Chuck last night and absolutely loved it. Mike Flanagan is one of my favorite directors and seeing him get to do something a bit different from his usual thing but that still had all his signature commentary on life/death was so cool.\n\nThere’s one detail I’ve been chewing on and I wanted to see what other people thought. At one point, Chuck’s grandfather Alfie brings up A Christmas Carol. It doesn’t seem like this would just be a random reference as most pieces of dialogue called back to something else in the movie. \n\nMy thought is: is each chapter one of the “visits from the spirits”, but told backwards? Starting with “yet to come” (the future he’s shown that shapes him to commit to living his life fully), the present, then the past? ",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1qh70ve/the_life_of_chuck_detail/"
    },
    {
        "id": "1qgd9af",
        "author": "4thGenTrombone",
        "title": "Who Framed Roger Rabbit is an all-time banger, but why are nearly no other live-action/hand-drawn hybrid films?",
        "content": "I get that production on this elite film was INSANE and basically no other hybrid film like that could match it. But why, in nearly 40 years, has nearly no studio greenlit something similar? Is it because Cool World bombed colossally? Literally the only examples I can think of after that are Looney Tunes: Back in Action, and the upcoming Coyote vs. Acme. (Space Jam doesn't really count in this way, it only has two scenes that blend 2D characters into a 3D world) I mean, sure, theatrical hand-drawn animation in the West is on life support, but  Coyote vs Acme had to be dragged out the doldrums to even be released!",
        "upvotes": 1036,
        "comments": 390,
        "media": null,
        "permalink": "/r/movies/comments/1qgd9af/who_framed_roger_rabbit_is_an_alltime_banger_but/"
    },
    {
        "id": "1qh2w3q",
        "author": "hurtfocker",
        "title": "Best movie with 1 actor playing two roles?",
        "content": "In recent years especially, actors are starring in more and more films wherein they play two or more roles. Alto Knights, Sinners, Mickey 17, etc. I used to think it was something only comedic actors would pursue since it requires suspending disbelief and it plays better when the characters are ridiculous: Mike Myers’ and Eddie Murphy’s works.\n\nBut when the acting is more dramatic it works too: Legend, Us. What’s your favorite from any genre? I’m voting Sinners.",
        "upvotes": 19,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1qh2w3q/best_movie_with_1_actor_playing_two_roles/"
    },
    {
        "id": "1qgtyyl",
        "author": "Benromaniac",
        "title": "'Mr. Nobody Against Putin' Review",
        "content": "",
        "upvotes": 76,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m6i5_OqMhVT7331QUFbkKpcrtfAu_HPdJWNSFSXx8Dk.jpeg?auto=webp&amp;s=ca41456c01fbcdd5e5d9a99a8d2cc6bd9bbf2277"
        },
        "permalink": "/r/movies/comments/1qgtyyl/mr_nobody_against_putin_review/"
    },
    {
        "id": "1qh6guu",
        "author": "DifferentMaize9794",
        "title": "Park Chan Wook talked about No Other Choice and Korean film industry",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ML3j62rmspJf9g45tcYhVGdFZrKWSVr5y1rR9h4AblU.jpeg?auto=webp&amp;s=515232df4e124c246ae770e38cb020da213903f9"
        },
        "permalink": "/r/movies/comments/1qh6guu/park_chan_wook_talked_about_no_other_choice_and/"
    },
    {
        "id": "1qgunic",
        "author": "btp_im_goin_in_dry",
        "title": "Dumb &amp; Dumber",
        "content": "I always felt like the relationship between Lloyd Christmas and Mary Swanson was set up for the audience to believe they would end up together, get married and her take his last name to become Mary Christmas... not exactly sure if having their names be prominent early on in thy film to fall into the Chekhov criteria though.",
        "upvotes": 34,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1qgunic/dumb_dumber/"
    },
    {
        "id": "1qh8hb0",
        "author": "bwermer",
        "title": "Queen of Chess | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PbUx6Yz__P9EhrieZxEUDvRqLRfWYdBBSmu7pAceiME.jpeg?auto=webp&amp;s=fa3373ee65e9f56753275f1f507e0743ec6995f6"
        },
        "permalink": "/r/movies/comments/1qh8hb0/queen_of_chess_official_trailer_netflix/"
    },
    {
        "id": "1qfmjhd",
        "author": "MarvelsGrantMan136",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the Plot Three or Four Times in the Dialogue Because Viewers are on Their Phones While They’re Watching",
        "content": "",
        "upvotes": 58795,
        "comments": 3957,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x4iP0OUZbExEaet_5zEh2w5OKmZizJ-8001d6mwAliM.jpeg?auto=webp&amp;s=cfcb82c0022152937a06e5091151531c5c2d1e3a"
        },
        "permalink": "/r/movies/comments/1qfmjhd/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qh8bln",
        "author": "BunyipPouch",
        "title": "François Ozon’s The Stranger’ &amp; Richard Linklater’s ‘Nouvelle Vague’ Scoop Top Prizes At France’s Lumière Awards – Full Winners List",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UMD6RVsnN3k3SWnuQQdt4jo1SKmwsQaMGzBGZL_V_Yo.jpeg?auto=webp&amp;s=c05c7bdbfb8bb0eb86312b98be735ac79918d65c"
        },
        "permalink": "/r/movies/comments/1qh8bln/françois_ozons_the_stranger_richard_linklaters/"
    }
]