[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 29,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mep55y",
        "author": "Cynthiaaxxxx",
        "title": "A show you stumbled upon with zero expectations but ended up loving",
        "content": "There are times you just press play on something random and then boom, you’re hooked. Wondering what Netflix series or movie took you by surprise in a good way.",
        "upvotes": 149,
        "comments": 549,
        "media": null,
        "permalink": "/r/netflix/comments/1mep55y/a_show_you_stumbled_upon_with_zero_expectations/"
    },
    {
        "id": "1meq56g",
        "author": "rohanad1986",
        "title": "'Emily in Paris' actor says he was devastated after being 'fired' from show: 'A tragedy'",
        "content": "",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1meq56g/emily_in_paris_actor_says_he_was_devastated_after/"
    },
    {
        "id": "1mf0z97",
        "author": "Warm_Wear_1495",
        "title": "Ad glitches make watching certain scenes technically impossible",
        "content": "Once netflix started forcing ads ive had this issue anytime an ad comes up:\nThe video freezes, stutters, glitches then the ad plays. Once it ends, the video glitches and freezes and stutters then SKIPS FORWARD the video im watching by 15 seconds. If I try to rewind w the skip 10 second button it launches me before the ad, then glitches and brings me back to where it skips forward. I cant even drag the time to during the physical ad, it just glitches me forward. I have missed so many scenes because of this issue, anybody else have this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mf0z97/ad_glitches_make_watching_certain_scenes/"
    },
    {
        "id": "1meyw4l",
        "author": "sypqys",
        "title": "Why am I receiving an email in addition to the notification on Android via the app? I don't want any emails (everything is unchecked, but I'm still receiving emails).",
        "content": "https://preview.redd.it/2uh6fz3lafgf1.png?width=805&amp;format=png&amp;auto=webp&amp;s=6e04578cbf9a705731679b888cea2d21fa952371\n\nHello,\n\n\n\nWhat can I do to only receive notifications for movies or series marked with a bell on Android via the app, and not also by email?\n\n\n\n\n\nThank you!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1meyw4l/why_am_i_receiving_an_email_in_addition_to_the/"
    },
    {
        "id": "1mel55u",
        "author": "Cobydraws19",
        "title": "AWFUL Tooth Drilling Wednesday Ad",
        "content": "I listen to podcasts while I’m at work &amp; I need to talk about this fucking Netflix ad for “Wednesday” that I heard yesterday. \n\nIt goes: “Hi I’m Wednesday Adams blah blah here’s a recording I had made of my root canal” and then like 10-15 seconds of EARSPLITTING TOOTH DRILLING SOUNDS, followed by “Wednesday season 2, only on Netflix”. \n\nI IMMEDIATELY clamped my lips over my teeth. \n\nI shouldn’t even have to justify why this is a visceral and physically uncomfortable concept for an ad, but I’m at work in the shipping industry, on 10 foot ladders with my hands literally full. I can’t skip it. \n\n“Wednesday morbid hehe” I DONT WANT THAT SHIT UP IN MY EARBUDS! My teeth HURT!!\n\nI want this off air IMMEDIATELY. Reaching out to the other victims of this ad lol",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mel55u/awful_tooth_drilling_wednesday_ad/"
    },
    {
        "id": "1mesp6a",
        "author": "EngineeringHopeful12",
        "title": "Resurrect The Lazarus Project!",
        "content": "How in the bloody hell was this riveting series canceled after one season?  C'mon Netflix...Do Better!!  The series keeps me on the edge of my seat and according to spoilers that I refused to watch ahead of time stated that Netflix Execs chose to not renew the series and effectively end the series on a freakin Cliffhanger.  Ughhhhhhjhhhh",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mesp6a/resurrect_the_lazarus_project/"
    },
    {
        "id": "1mebxal",
        "author": "RCAPU",
        "title": "Hunting Wives and Wigs",
        "content": "Just finished watching the first season. It was entertaining. However I could not get over the wigs on Margo and Callie. They were so bad. If they get a season 2, I hope they fix that. Totally distracting.",
        "upvotes": 24,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mebxal/hunting_wives_and_wigs/"
    },
    {
        "id": "1mestl5",
        "author": "Entrepreneur-ecom",
        "title": "Help Test My Netflix Straw! [Survey]",
        "content": "Hi All, \n\nPlease help me make a decision.!\n\nI made a hands-free illuminated straw for binge-watching in bed. \n\nhttps://forms.gle/9MMSdVPDwWJfx53j7. \n\nFeedback on design and pricing welcome!\n\n\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mestl5/help_test_my_netflix_straw_survey/"
    },
    {
        "id": "1mex77b",
        "author": "DreamOn2020",
        "title": "Scandal hits differently after a second watch",
        "content": "13 years ago I watched Shonda Rhimes’ Scandal for the drama and salaciousness, but the political side of the show always went over my head. Boy, does it hit differently now! I don’t think I even bothered to finish the series but now I’m engrossed because I understand exactly what’s happening, all the terminology, each character’s job, the lies, the deceit, the fixes, and it feels scary-real. Is this just a work of fiction or was it clever foreshadowing?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mex77b/scandal_hits_differently_after_a_second_watch/"
    },
    {
        "id": "1mdzg0u",
        "author": "Emondm24",
        "title": "Happy Gilmore 2 thoughts",
        "content": "I enjoyed it.  I quite enjoyed the video game like golf challenge during the last twenty minutes, it had the nice kind of the screw ball comedy that fits in this kind of world.  I liked seeing Ben Stiller return, the MJF and Becky roles, Haley Joel Osment having a key role.  He had the beard in his small role in the Boys so I knew who he was.  Didn’t like Shooters face turn.  Paying homage to the ones no longer with us was respectful.",
        "upvotes": 57,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1mdzg0u/happy_gilmore_2_thoughts/"
    },
    {
        "id": "1meojjg",
        "author": "FlyMarines45",
        "title": "Netflix “Accidentally” Adding Extra Member",
        "content": "Recently got charged for an extra member fee. Deleted obsolete profiles on my account…tried to login while traveling and got prohibited from accessing my account unless I activated extra member fee.\n\nCalled support and they exclaimed that an extra member fee of $6.99 was “accidentally” added.\n\nJust a heads up.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1meojjg/netflix_accidentally_adding_extra_member/"
    },
    {
        "id": "1me4jux",
        "author": "sassyblondechik",
        "title": "Just finished Hightown 10/10",
        "content": "Here’s my beef with Hightown. It’s an amazing series—messy, dramatic, nonstop entertainment—but that ending? Come on. Starz really did fans dirty. They canceled it, apparently because they couldn’t afford it, even though the show brought in huge viewership numbers. Make it make sense. So many unresolved storylines, it felt like they just walked off set mid-scene. I genuinely hope now that Netflix has picked it up, a 4th season is in the works. It deserves one. We deserve one. I’m honestly kind of mad about it.\n\nNow maybe this is a dumb question, but it’s been bugging me: why did the show seem more focused on who killed Jorge  than on Frankie himself—who, let’s be real, was a full-blown murderer? He’s out of prison again and somehow they still couldn’t charge him with anything? That was beyond frustrating. I get that the writers probably wanted to push Ray to kill him in the end, but still—it felt like everyone was just shrugging off Frankie’s entire rap sheet.\n\nIt’s such a great show, but man, that ending left me with more questions than closure.",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1me4jux/just_finished_hightown_1010/"
    },
    {
        "id": "1mdw287",
        "author": "Imaginary_Increase47",
        "title": "The Residence could had been much better!!",
        "content": "I binge-watched *The Residence* last night—well, kind of binge-watched. I went through episodes 1–4 and then skipped straight to the final episode (I'll explain why in a bit).\n\nThe first episode setup was great: a murder in the White House during a chaotic state dinner, and the best detective is brought in to solve the case. With so many characters, each with different responsibilities and motives, the plot seemed like it had potential for some interesting twists.\n\nBut as I watched the next few episodes, there were a few things I couldn't get out of my head:\n\n1. There’s a subtle jabs from Mrs. Cupps about how it’s all men everywhere, etc throughout. I enjoy watching shows and movies with strong female characters—but lines like that feel like they’re just pandering to the audience. Minor thing, but it stood out.\n2. The obsession with birds. I get that someone can be fixated on certain things (I am too), but there’s a bird analogy for *everything*. For every new discovery, there is a bird analogy being made. I mean after a while, it started feeling more like a way to stretch out the runtime than meaningful symbolism.\n3. Pacing. This is my biggest gripe. Things really dragged. Honestly, after episode 4, I jumped straight to the final episode—and I still understood what happened and how the investigation played out, since it all gets recapped in that last 1.5-hour episode.\n\nNow, I’ll say this: the characters and the subtle humor were genuinely great. But if the pacing had been tighter, and each episode trimmed down to around 30–40 minutes, the whole 8-episode series would’ve felt a lot more coherent and engaging.   \n  \nEdit: Surprised it got Emmy nomination.",
        "upvotes": 36,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mdw287/the_residence_could_had_been_much_better/"
    },
    {
        "id": "1me0xur",
        "author": "FeelingMyOats",
        "title": "Help - Teleparty extension issues (not syncing)",
        "content": "I'm not sure if the Teleparty extension is having issues right now or not, but basically I've been trying to watch a show with my friend and we've been using Teleparty a lot over the past month or two with no issues. But today, we're both experiencing the weirdest thing. I tried to create a session, but the link is noticeably shorter than usual and doesn't include the show title in it. I thought that would be fine, but when she opened the link, it just played on its own and refuses to sync. Then she tried to create the session, but the same thing happened to her too.\n\nIt's so weird because it shows in the chat log whenever one of us joins or pauses/plays and whatnot, but it's playing two separate instances. If I play, it's still paused for her, and vice versa. It's refusing to sync, and this has never happened before until today. Has anyone else experienced this? Is there a possible fix, or maybe it'll just randomly fix itself after a time? Thanks.\n\nEDIT: Lots of people in the replies experiencing the same thing, so hopefully they fix it soon.",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1me0xur/help_teleparty_extension_issues_not_syncing/"
    },
    {
        "id": "1meg2yj",
        "author": "Glass_Asparagus_5166",
        "title": "Happy Gilmore 2",
        "content": "I’m pretty nostalgic for the first one. I wasn’t born when it came out but it still used to be one of my favourite movies. This one started out strong, the first 30-45 minutes were pretty good, and happy is still a really funny character, but then it completely fell off. For some reason they decided to bring back every single side character from the original and redo every single joke and gag. Some parts of it feel like a remake and I really didn’t like how they kept playing clips from the original. On top of that the villains and the ending were really stupid. I’d probably rate this movie a 5/10, but that’s just my opinion I guess.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1meg2yj/happy_gilmore_2/"
    },
    {
        "id": "1mdimu9",
        "author": "Nebberlantis",
        "title": "What should they make the next Trainwreck about?",
        "content": "I recently watched the new one based off Storm Area 51, and I’ve been loving these past documentaries on the Poop Cruise, Project X, Astroworld and especially Woodstock ‘99.\n\nSo here’s my question: If you could suggest a topic for Trainwreck to cover in their next documentary, what would it be?",
        "upvotes": 110,
        "comments": 140,
        "media": null,
        "permalink": "/r/netflix/comments/1mdimu9/what_should_they_make_the_next_trainwreck_about/"
    },
    {
        "id": "1mepy49",
        "author": "Reading-person",
        "title": "Paid to watch Netflix",
        "content": "Anyone know if that’s actually legit? I’ve seen so many ads for it lately, and if we *actually* can get paid to watch and review shows and movies that seems like a good way to make some extra cash. But is it just a scam? ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mepy49/paid_to_watch_netflix/"
    },
    {
        "id": "1mefleg",
        "author": "PermissionSoggy891",
        "title": "Netflix only plays at 720p on Edge",
        "content": "Trying to watch a movie, and it only plays at 720p despite my account settings demanding that it play at the \"highest possible quality\". I've also done what was suggested in this thread: [Netflix only plays at 720p : r/edge](https://www.reddit.com/r/edge/comments/pmcz0p/netflix_only_plays_at_720p/), and it still refuses to do anything other than 720p\n\nMy PC isn't the issue, it has i7 10700k and RTX 4070, so is there a way for me to force Netflix to play at 1080p or am I better off just cancelling?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mefleg/netflix_only_plays_at_720p_on_edge/"
    },
    {
        "id": "1medghv",
        "author": "Denizeri24",
        "title": "4K on PC problem",
        "content": "Hello,\n\n  \nI bought UHD plan from Netflix but I can't watch 4K on PC.\n\n  \nI'm using latest Windows 11 and latest Microsoft Edge. Normally I have extensions on Edge but I disabled all anyway still I can't watch 4K. I bought HEVC video extension from Microsoft Store but not worked.\n\n  \nI have Nvidia 5080 and 4K monitor, windows scaling is %100, Windows res is 3840x2160. Also my monitors supports HDR10.\n\n  \nI don't see Ultra HD or HDR image on movies, only Dolby Atmos image. When I do CTRL + SHIFT + ALT + Q result is;\n\n[qvoVFIN.png (2492×1524)](https://i.imgur.com/qvoVFIN.png)\n\n  \nI enabled Widevine and PlayReady DRM from edge://flags. Hardware acc is enabled from Edge Settings.\n\n  \nedge://gpu result is;\n\n[ZDWQwCw.png (2661×986)](https://i.imgur.com/ZDWQwCw.png)\n\n  \nIs that normal? before PWA Netflix, I can able watch 4K on UWP Netflix app but they removed UWP..",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1medghv/4k_on_pc_problem/"
    },
    {
        "id": "1md80h5",
        "author": "leyy_pink1997",
        "title": "Just finished The Fall of the House of Usher — WHY did no one warn me it was this good?! 😱🔥",
        "content": "I went in thinking it would be another slow gothic horror, but damn—Mike Flanagan really cooked with this one. The visuals, the pacing, the way each episode was named after a Poe story… genius.\n\nAnd can we talk about Carla Gugino? She was terrifying and mesmerizing all at once. I haven’t binged something this fast in a while.\n\nAnyone else get Haunting of Hill House vibes but darker and more vicious? Curious if I should go for Midnight Mass next.\n\nWould love to hear your Flanagan rankings or any hidden gems on Netflix that are equally mind-blowing.\n",
        "upvotes": 179,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1md80h5/just_finished_the_fall_of_the_house_of_usher_why/"
    },
    {
        "id": "1me5qgu",
        "author": "epictetusdouglas",
        "title": "Blacklist on Netflix",
        "content": "Is the Blacklist included with the ads basic tier? BTW how are the ads now? Last year when I was subscribed they were not bad. But other services have been increasing the number and length of ads on their basic services.\n\nThanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1me5qgu/blacklist_on_netflix/"
    },
    {
        "id": "1md2mol",
        "author": "Sweaty-Toe-6211",
        "title": "Adam Sandler’s ‘Happy Gilmore 2’ Debuts to 46.7 Million Views, Biggest Netflix U.S. Film Opening Ever",
        "content": "",
        "upvotes": 240,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1md2mol/adam_sandlers_happy_gilmore_2_debuts_to_467/"
    },
    {
        "id": "1megsmb",
        "author": "BeckettWilderness",
        "title": "What to watch next??? Sirens, Greys Anatomy, Bones, You..",
        "content": "So all the shows in the title are shows my gf and I like - don’t care for most teeny shows (although we are young adults). We really liked (the beginning) of Sirens, loved the show You, binged Greys Anatomy but that got boring towards the end. Watched Feel Good and that was good. Looking for something suspenseful, thrilling, mystery but maybe not too much fantasy.. sexy a bit is okay.. just something dark, funny ",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1megsmb/what_to_watch_next_sirens_greys_anatomy_bones_you/"
    },
    {
        "id": "1mdxxx3",
        "author": "Blandiblub",
        "title": "UK: Has Friends changed certificate recently?",
        "content": "My daughter was watching Friends on her profile (up to 12s) and was up to about S5 when she told me it's disappeared from her Continue Watching list. \n\nIt's obviously on my own profile and I noticed it's a 15. That would never have been on her profile at all. Maybe it used to be 12 but has changed to a 15?\n\nLooking at the BBFC, it appears the only episode which has a 15 certificate is The One With The Free Porn. And she tells me she had already seen that episode on her profile and gone beyond that. \n\nAnyone else?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mdxxx3/uk_has_friends_changed_certificate_recently/"
    },
    {
        "id": "1meg56s",
        "author": "ProjectPerson17",
        "title": "Recruiting email: scam? From sender: talents@netflixcareerhighlights.com",
        "content": "I got a recruiting email for a role at Netflix.\n\nThe sender email address is: talents@netflixcareerhighlights.com which seems potentially sketchy. Now as I write it out, seems majorly sketchy.\n\nThe email does not otherwise seem sketchy whatsoever.\n\nThe role is relevant to my background and the email came to an account that is not widely circulated. I think it would have had to be found via LinkedIn recruiter tools.\n\nThere are no links in the email, and they ask for a reply to confirm interest and then say someone from the team will be in touch to schedule a call.\n\nI guess I know what to do (delete) but I’m secretly hoping it’s real, so figured I’d try here.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1meg56s/recruiting_email_scam_from_sender/"
    },
    {
        "id": "1me8ip1",
        "author": "BRAK3NN",
        "title": "cell phone netflix problem",
        "content": "On my Netflix cell phone there is a problem that in the upper right corner there is something that looks like lines, just there and I saw that it is a problem with the image because the caption above it does not lock nor do other applications ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1me8ip1/cell_phone_netflix_problem/"
    },
    {
        "id": "1md9nhk",
        "author": "Sudden_Pop_2279",
        "title": "'KPop Demon Hunters' becomes Netflix's most-watched original animated film",
        "content": "",
        "upvotes": 48,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1md9nhk/kpop_demon_hunters_becomes_netflixs_mostwatched/"
    },
    {
        "id": "1md2rio",
        "author": "dailystar_news",
        "title": "Netflix have confirmed full cast for Pride and Prejudice TV series - what do you think?",
        "content": "",
        "upvotes": 122,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dbcx9j3blzff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1md2rio/netflix_have_confirmed_full_cast_for_pride_and/"
    },
    {
        "id": "1mdvul2",
        "author": "Cooltwou",
        "title": "I have a question about WWE Content",
        "content": "Is WWE RAW from 2021 on Netflix because the last time I asked this someone else said it wasn’t on there and that has been a few months ago so I thought I would ask again ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mdvul2/i_have_a_question_about_wwe_content/"
    },
    {
        "id": "1mdvss7",
        "author": "ChiMara777",
        "title": "Is it normal for the Netflix app to play audio clips (no video) of various shows while you browse the app?",
        "content": "I just resubscribed to Netflix for the first time in a year. Whenever I am browsing the app on my iPad, audio clips of various shows (this appears to be shows that are in My List) will randomly play. There is no video to go along with the audio, and the audio is completely unrelated to anything on the screen. I’m not sure if this is a bug or a feature of the app?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mdvss7/is_it_normal_for_the_netflix_app_to_play_audio/"
    }
]