[
    {
        "id": "1myuw3q",
        "author": "lionsgate",
        "title": "Hey /r/movies, I’m Stephen King! Ask me anything about The Long Walk book or movie.",
        "content": "Hey r/movies, I’m Stephen King. You might know me from Stand By Me, It, or Shawshank Redemption, but my latest project is actually the first book I ever wrote. The Long Walk hits theaters on September 12. Ask me anything about the book or movie. \n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\n&gt;In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.\n\nIt stars Cooper Hoffman, David Jonsson, Ben Wang, Charlie Plummer, Roman Griffin Davis, Garrett Wareing, Joshua Odjick, Tut Nyuot, Mark Hamill, Judy Greer, and Josh Hamilton. \n\nI'll be back on Wednesday 8/27 at 12:00 PM ET to answer your questions.\n\n",
        "upvotes": 45573,
        "comments": 7447,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f0jbdlbzsvkf1.jpeg?auto=webp&amp;s=994a7d31fceff32a2f3fdb62f59b362dca6da8a7"
        },
        "permalink": "/r/movies/comments/1myuw3q/hey_rmovies_im_stephen_king_ask_me_anything_about/"
    },
    {
        "id": "1n1hwf8",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Elijah Wood - Thursday 8/28 at 3:00 PM ET - Actor in 'Lord of the Rings', 'The Toxic Avenger', 'Wilfred', 'Eternal Sunshine of the Spotless Mind', 'Dirk Gently's Holistic Detective Agency', and lots more.",
        "content": "",
        "upvotes": 80,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ac69k57whklf1.png?auto=webp&amp;s=d4fca40b7efd3574a23fa1a2745c25f118a1ab1c"
        },
        "permalink": "/r/movies/comments/1n1hwf8/amaqa_announcement_elijah_wood_thursday_828_at/"
    },
    {
        "id": "1n1gsac",
        "author": "BunyipPouch",
        "title": "Brad Pitt, Joaquin Phoenix, Jonathan Glazer Join Gaza Drama ‘The Voice of Hind Rajab’ as Executive Producers - It follows the killing of Hind Rajab, a five-year-old Palestinian girl who lived in the Gaza Strip and was killed by Israeli forces during the ongoing Israeli invasion of Gaza.",
        "content": "",
        "upvotes": 3972,
        "comments": 860,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pkkwxnA8F2Pse_DxGsnSUexn0E7eFCw-1F3sgbUY_Wo.jpeg?auto=webp&amp;s=770e88c9b5543d2ccdae3e93e29885b16f06d47e"
        },
        "permalink": "/r/movies/comments/1n1gsac/brad_pitt_joaquin_phoenix_jonathan_glazer_join/"
    },
    {
        "id": "1n1cyak",
        "author": "mpocFr",
        "title": "In Dune movies, it seems to me Paul never voluntarily touches water, and it makes total sense !",
        "content": "On Arrakis, water is both scarce and sacred, deeply tied to Fremen culture. I get the feeling Paul avoids it completely until he starts embracing his Fremen identity—he never drinks on screen, and when he does interact with it, it’s always symbolic (like the water of life).\n\nMeanwhile, the Harkonnens are shown drinking, sweating, bathing ;wasting water like it's nothing, highlights their disconnect Arrakis.\n\nI think that subtle contrast makes so much sense!",
        "upvotes": 1389,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1n1cyak/in_dune_movies_it_seems_to_me_paul_never/"
    },
    {
        "id": "1n1jhqg",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Yorgos Lanthimos’ ‘Bugonia' Starring Emma Stone &amp; Jesse Plemons - Two conspiracy-obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.",
        "content": "",
        "upvotes": 458,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/du8hq59cuklf1.jpeg?auto=webp&amp;s=e78dcaca955573780f4b471b779561d521807c77"
        },
        "permalink": "/r/movies/comments/1n1jhqg/official_poster_for_yorgos_lanthimos_bugonia/"
    },
    {
        "id": "1n1l5m7",
        "author": "SanderSo47",
        "title": "Darren Aronofsky's 'Caught Stealing' Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/caught_stealing): 83% (from 35 reviews) with 6.50 average rating\n\n[Metacritic](https://www.metacritic.com/movie/caught-stealing/): 69/100 (18 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; Despite all the bloody violence, there is a buoyant feel to the film. Matthew Libatique, Aronofsky’s constant and brilliant cinematographer, makes the city glittery bright outside and the look is vibrant even in the dingy bar. Caught Stealing is an anomaly, a dark soap bubble of an entertainment. And that weirdness makes this unlikely film sparkle.\n\n-[Caryn James, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/caught-stealing-review-austin-butler-darren-aronofsky-1236353041/)\n\n&gt; Mostly, the tension between the film’s increasingly dark story and its love of rudimentary gags — wouldn’t it be so funny if this guy who mostly subsists on booze physically couldn’t drink anymore? — doesn’t abate until the film’s final act. That’s when things click into place, when the big swings come together, and “Caught Stealing” nearly finds its way to (insert your favorite positive baseball metaphor here). A wild card? Not wild enough, really.\n\n-[Kate Erbland, IndieWire](https://www.indiewire.com/criticism/movies/caught-stealing-review-darren-aronofsky-austin-butler-1235147500/): C+\n\n&gt; “Caught Stealing” might feel like a break from the “Pi” director’s intensely subjective character portraits, which range from “The Wrestler” to “The Whale,” but in fact, Aronofsky brings us as close to Hank as he has to any of his other characters. For Butler, it’s not as flashy a role as the ones he played in “Elvis” or “Dune,” and yet, seeing the actor stripped down to his heather gray undies, his stardom is all but undeniable.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/caught-stealing-review-austin-butler-1236496926/)\n\n&gt; At one stage, Hank hits a few balls and instantly a crowd of people gather round, awed – and an old-timer tells him he has “one hell of a swing”. The film has it too.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/aug/27/caught-stealing-review-darren-aronofsky-mother-the-whale-baseball): 4/5\n\n&gt; Some part of Aronofsky may want to evoke the darkly funny mishaps of a vintage crime comedy, but something else keeps coaxing him halfway down dark alleyways, before the movie scrambles back into more comic-adjacent urgency. It’s that run-and-stop-short rhythm that makes Caught Stealing feel more like a fraught, imperfect recovery than a Requiem-style spiral into hell, and an unusually balanced New York portrait. The city of Aronofsky’s early career is neither a paradise lost to gentrification nor a metropolis of the damned. It’s just a bustling microcosm of a pitiless world with plenty of places to hide.\n\n-[Jesse Hassenger, The A.V. Club](https://www.avclub.com/caught-stealing-review): B\n\n&gt; For as much good as there is in \"Caught Stealing,\" there's never that moment where it somehow rises from good to great — but hey, that's okay. It's just good and stays good until the credits roll, which is more than enough. Not every new movie needs to be an event. Sometimes, you just want to watch a handsome guy try to get out of trouble while taking care of an ornery, fluffy cat. We could use more modern movies like \"Caught Stealing.\" \n\n-[Ryan Scott, /Film](https://www.slashfilm.com/1944676/caught-stealing-austin-butler-movie-review/): 7.5/10\n\n&gt; The result is a movie that’s very fun, but weirdly unambitious for Aronofsky. If any up-and-coming director made this movie, it’d be seen as a promising breakthrough. For the guy known for Requiem for a Dream, Black Swan, Mother! and The Whale, it feels like he’s slumming a bit. In a way, though, it’s refreshing to see an Aronofsky movie that, for once, isn’t bursting with more ideas than it can reasonably contain. It would still be nice in this instance to have a thematic through-line that wasn’t just based in nostalgia for a bygone New York. It’s doubtful Caught Stealing will make the same impression its director’s other films have. Fortunately, though, its rewatchability factor is just as high.\n\n-[Abby Olcese, Paste](https://www.pastemagazine.com/movies/caught-stealing/caught-stealing-review-darren-aronofsky-austin-butler-matt-smith-crime-plot): 7.5/10\n\n&gt; As much as the film is Aronofsky’s least characteristic to date, with its Guy Ritchie-esque rogues gallery of crooks and killers and Coen-esque bursts of wry violence, it’s Butler’s performance that makes it feel of a piece with the director’s other work. There are few filmmakers more interested in putting their characters in a vice grip, so as to bring them someplace where their physical traumas become a way for them to know themselves beyond the limits of the body.\n\n-[Rocco T. Thompson, Slant](https://www.slantmagazine.com/film/caught-stealing-review-austin-butler-darren-aronofsky/): 2.5/4\n\n&gt; It’s thin material for such an impressive cast to be working with, and even Butler, who’s made all the right choices post-Elvis when it comes to compelling and varied work, can’t really imagine Hank beyond the mould of tender-hearted victim. He takes all the beatings – and there are a lot of them, which is where Aronofsky’s taste for the brutal slips in – with a noble tear in his eye, haunted as he is by a traumatic accident in his youth that put an end to his baseball career.\n\n-[Clarisse Loughrey, The Independent](https://www.the-independent.com/arts-entertainment/films/reviews/caught-stealing-review-austin-butler-b2814868.html): 2/5\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nHank Thompson was a high-school baseball phenom who can't play anymore, but everything else is going okay. He's got a great girl, tends bar at a New York dive, and his favorite team is making an underdog run at the pennant. When his punk-rock neighbor Russ asks him to take care of his cat for a few days, Hank suddenly finds himself caught in the middle of a motley crew of threatening gangsters.\n\n**DIRECTOR** \n\nDarren Aronofsky\n\n**WRITER**\n\nCharlie Huston (based on his novel)\n\n**MUSIC**\n\nRob Simonsen\n\n**CINEMATOGRAPHY**\n\nMatthew Libatique\n\n**EDITOR**\n\nAndrew Weisblum\n\n**RELEASE DATE** \n\nAugust 29, 2025\n\n**RUNTIME**\n\n107 minutes\n\n**STARRING**\n\n- Austin Butler as Henry \"Hank\" Thompson\n\n- Regina King as Detective Roman\n\n- Zoë Kravitz as Yvonne\n\n- Matt Smith as Russ\n\n- Liev Schreiber as Lipa\n\n- Vincent D'Onofrio as Shmully\n\n- Griffin Dunne as Paul\n\n- Benito A Martínez Ocasio as Colorado\n\n- Carol Kane as Bubbe",
        "upvotes": 319,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e9H3YFyDEK-gCriTUn6wEtLz_itO2vEcTgQ7TEfQC-E.jpeg?auto=webp&amp;s=e9c7227f30b1b868ff571b410e747851ac1d0534"
        },
        "permalink": "/r/movies/comments/1n1l5m7/darren_aronofskys_caught_stealing_review_thread/"
    },
    {
        "id": "1n1jp9h",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Jude Law as Vladimir Putin in Olivier Assayas' 'The Wizard of the Kremlin' - The film charts the Russian leader’s ascent to power amid post-Soviet chaos, aided by versatile spin doctor Vadim Baranov (Paul Dano), a fictional character inspired by real-life fixer, Vladislav Sourkov",
        "content": "",
        "upvotes": 330,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/di08ev3rvklf1.jpeg?auto=webp&amp;s=1417625d308138753dc9a0542e01fd0a865bffb1"
        },
        "permalink": "/r/movies/comments/1n1jp9h/first_image_of_jude_law_as_vladimir_putin_in/"
    },
    {
        "id": "1n1idav",
        "author": "keepfighting90",
        "title": "Anyone else feel a little underwhelmed with Mission Impossible: The Final Reckoning?",
        "content": "Mission Impossible has long been one of the best, most consistent series of Hollywood blockbusters. The first \"trilogy\" was pretty solid, and the 2nd run of Ghost Protocol/Rogue Nation/Fallout is legitimately some of the greatest action movie filmmaking ever. Dead Reckoning was good enough but didn't really hit the same highs - although maybe COVID is to blame for that.\n\nI was pretty excited for Final Reckoning given that it's the closing chapter of this generally awesome series, and it's almost 3 hours long - couldn't wait to see all the amazing stunts and set pieces we'd be getting, considering this is the end and the amount of time Christopher Macquarrie has to play with.\n\nIn reality though, I was pretty underwhelmed with what the movie delivered. The pacing is seriously wonky - it starts off very slowly and the first 40-45 minutes is all exposition and flashbacks...but it also feels like it resolves way too quickly at the end. The editing seemed a little off too, with scenes jumping from one another with some rather choppy transitions.\n\nI'm somewhat mixed on the action set pieces we got. The 2 big ones - Ethan's exploration of the downed submarine and the aerial chase at the end - are both really good in a vacuum. The sub escape goes beyond even the level of disbelief you need for these movies though, especially near the end with Ethan swimming like 300m through freezing cold water without a gas mask. And the plane chase felt too reminiscent of the climax in Fallout although admittedly it was way more intense and edge of your seat with Tom Cruise hanging off the planes themselves. \n\nOutside of these 2 though, the movie felt oddly free of the excitement and intensity the MI series typically has. It's weird but it felt almost kind of small considering the stakes were end-of-the-world? Like it didn't really give off \"closing chapter\" vibes to me. And I actually think we could've done with one or two more big set pieces. They kinda did Gabriel dirty as the final big bad too. He was menacing and sinister in Dead Reckoning but he came off as a Looney Tunes cartoon villain here and &gt;!his death scene was ridiculous.!&lt;\n\nIt was still fairly enjoyable but maybe I just expected more considering the high bar movies 4-6 set, as well as this being the final chapter of the series.",
        "upvotes": 329,
        "comments": 375,
        "media": null,
        "permalink": "/r/movies/comments/1n1idav/anyone_else_feel_a_little_underwhelmed_with/"
    },
    {
        "id": "1n0ulu3",
        "author": "MarvelsGrantMan136",
        "title": "‘KPop Demon Hunters’ Is Netflix’s Most-Watched Movie Ever With 236 Million Views, Beating ‘Red Notice’",
        "content": "",
        "upvotes": 21173,
        "comments": 2174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KKBb_pchk089bp3Hxz0l6b5RJiWri6p90RJIc_TzgUc.jpeg?auto=webp&amp;s=68d8a1a2844cba5c599775111361b4c422514160"
        },
        "permalink": "/r/movies/comments/1n0ulu3/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    },
    {
        "id": "1n1aoni",
        "author": "omgitsdemi",
        "title": "I just need to cry — what movies will wreck me?",
        "content": "I lost my mum very suddenly in June, and honestly I think I just need a really good cry. Some days it feels like I’m holding everything in, and I’d love some movie recommendations that can help me let the emotions out. Doesn’t matter if it’s heartbreaking, bittersweet, or just quietly emotional — I just want something that will move me.\n\nWhat are the movies that always make you cry?\n",
        "upvotes": 696,
        "comments": 2088,
        "media": null,
        "permalink": "/r/movies/comments/1n1aoni/i_just_need_to_cry_what_movies_will_wreck_me/"
    },
    {
        "id": "1n1c73o",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Sisu: Road to Revenge’",
        "content": "",
        "upvotes": 475,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ij1kpyt45jlf1.jpeg?auto=webp&amp;s=315939102f22e745912b11579738c6857d100bba"
        },
        "permalink": "/r/movies/comments/1n1c73o/official_poster_for_sisu_road_to_revenge/"
    },
    {
        "id": "1n1hwaq",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Sisu: Road to Revenge'",
        "content": "",
        "upvotes": 168,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bpkblh1ejklf1.jpeg?auto=webp&amp;s=2104bec5fa95bd9a3dca48063588b2c53ed67dc8"
        },
        "permalink": "/r/movies/comments/1n1hwaq/new_poster_for_sisu_road_to_revenge/"
    },
    {
        "id": "1n1hvnx",
        "author": "MarvelsGrantMan136",
        "title": "Sisu: Road to Revenge - Exclusive Red Band Trailer",
        "content": "",
        "upvotes": 113,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b46kZ0p6sIRh7NKga5q9o7cb2r7-ShjT3n267DdiM90.jpeg?auto=webp&amp;s=6e7f9985e9d3f1693b9cd99de43fb9c533517635"
        },
        "permalink": "/r/movies/comments/1n1hvnx/sisu_road_to_revenge_exclusive_red_band_trailer/"
    },
    {
        "id": "1n0xtga",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Justin Long in 'Coyotes' - Trapped in their Hollywood Hills home, a family fights for survival when caught between a raging wildfire and a pack of savage coyotes",
        "content": "",
        "upvotes": 1758,
        "comments": 629,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a99u3mxlhflf1.jpeg?auto=webp&amp;s=28e20e066114b9b459b53828889cde366b7ca46e"
        },
        "permalink": "/r/movies/comments/1n0xtga/first_image_of_justin_long_in_coyotes_trapped_in/"
    },
    {
        "id": "1n11mus",
        "author": "MarvelsGrantMan136",
        "title": "‘KPop Demon Hunters’ Sequel Moving Ahead As Sony and Netflix Engage In Deal Talks",
        "content": "",
        "upvotes": 1081,
        "comments": 227,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2n10Zcx07pK16gxtSjWjB3Vv8pAt8anwvIJHVLilIcg.jpeg?auto=webp&amp;s=a0effaadff32c33df2b8e02aaf04be723ebda413"
        },
        "permalink": "/r/movies/comments/1n11mus/kpop_demon_hunters_sequel_moving_ahead_as_sony/"
    },
    {
        "id": "1n1a4gs",
        "author": "Caesar_Rising",
        "title": "What’s a joke or reference from a movie that you’ve just never understood?",
        "content": "Robin Hood: Men in Tights (1993).     \n\nI must have watched this a million times growing up and as I got older so many jokes started to make sense but there’s one line when Robin meets Will Scarlet and he introduces himself as “Will, Scarlet, O’hara…. We’re from Georgia”.     \n\nNow, until this very moment I thought he said “No arrow” not “O’Hara” but his IMDb listing has fixed that but I still don’t get why that’s a joke or what it references.      \n\nAnyone have an explanation and does anyone have an example of their own?     \n\nEdit: someone explained in the very first comment, don’t need more people saying Gone with the wind thanks",
        "upvotes": 261,
        "comments": 354,
        "media": null,
        "permalink": "/r/movies/comments/1n1a4gs/whats_a_joke_or_reference_from_a_movie_that_youve/"
    },
    {
        "id": "1n1jsts",
        "author": "KillerCroc1234567",
        "title": "Deathstalker - Exclusive Red Band Trailer (2025)",
        "content": "",
        "upvotes": 39,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/emz6-5T7xmW4EJiqvGWhio6yqNljwiOtAwawtiBGx8U.jpeg?auto=webp&amp;s=d8add09776b1bdcb9694fdfe1e3c99ac0308ff16"
        },
        "permalink": "/r/movies/comments/1n1jsts/deathstalker_exclusive_red_band_trailer_2025/"
    },
    {
        "id": "1n1lavs",
        "author": "KillerCroc1234567",
        "title": "Todd Haynes’ Previously Shuttered Gay Romance ‘De Noche’ Being Revived With Pedro Pascal Circling",
        "content": "",
        "upvotes": 27,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gLcDKZLKssqpihORqD0IPBdUcn3uJgkA_PkNZcn-NYU.jpeg?auto=webp&amp;s=a729114e29820f59b8be1623a785b523c6cb2918"
        },
        "permalink": "/r/movies/comments/1n1lavs/todd_haynes_previously_shuttered_gay_romance_de/"
    },
    {
        "id": "1n1he3w",
        "author": "iamchristian1129",
        "title": "Are there any Disney movies you can think of that have really messed-up storylines?",
        "content": "I feel like there’s one that many never think about, it’s The Parent Trap, I mean they met on a cruise ship, fell in love and got married in a week, then they both have twins, get a divorce and they each decide to take sole custody of their own daughters and they never mention to them that they are twins and the parents act like the other twin doesn’t exist so that they don’t have to see each other again",
        "upvotes": 40,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1n1he3w/are_there_any_disney_movies_you_can_think_of_that/"
    },
    {
        "id": "1n0zwm0",
        "author": "MarvelsGrantMan136",
        "title": "Return to Silent Hill - Official Teaser Trailer",
        "content": "",
        "upvotes": 554,
        "comments": 214,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KNXKs_urglk9dMX-FznR6FgCQb5zh_lfgkZqIPgXh_g.jpeg?auto=webp&amp;s=5ab9e416c3e652ee4aba203a83f21b491d06d517"
        },
        "permalink": "/r/movies/comments/1n0zwm0/return_to_silent_hill_official_teaser_trailer/"
    },
    {
        "id": "1n13tq1",
        "author": "2T2Reddit",
        "title": "Movie franchise where every installment was at least as good as the last.",
        "content": "Just as the title says. Which movie franchise (consisting of at least 3 installments) do you believe never had a downgrade or bad sequel? Everyone can probably agree there are tons of franchises that were ended by a terrible sequel or even ones that were considered a nominal box office success but were considered a disappointment against previous installments. What is your favorite franchise that just didn’t stop winning and why?",
        "upvotes": 287,
        "comments": 761,
        "media": null,
        "permalink": "/r/movies/comments/1n13tq1/movie_franchise_where_every_installment_was_at/"
    },
    {
        "id": "1n0o9lk",
        "author": "KillerCroc1234567",
        "title": "IS THIS THING ON? | Teaser Trailer | Searchlight Pictures",
        "content": "",
        "upvotes": 1864,
        "comments": 320,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WhmI0-BA7oQy8gCLko6xNqZEjZz3QVfXf-ne2hKKKt4.jpeg?auto=webp&amp;s=e33871488796bc6a673873484a5222f3901bf5d3"
        },
        "permalink": "/r/movies/comments/1n0o9lk/is_this_thing_on_teaser_trailer_searchlight/"
    },
    {
        "id": "1n1jys2",
        "author": "NoCulture3505",
        "title": "Official Poster for \"All of You\"",
        "content": "",
        "upvotes": 22,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qdjayqkfxklf1.jpeg?auto=webp&amp;s=a7d134a3e2f2de9ac856c180ddeaf43f3e93eb89"
        },
        "permalink": "/r/movies/comments/1n1jys2/official_poster_for_all_of_you/"
    },
    {
        "id": "1n0pup8",
        "author": "herequeerandgreat",
        "title": "famous movie plot holes that aren't actually plot holes",
        "content": "i'm sure that you've all heard about famous movie plot holes. some of them are legitimately plot holes but those aren't what this post is about. this post is about famous movie \"plot holes\" that actually have good explanations.\n\nwhat are some famous movie plot holes that actually aren't plot holes and you're tired of hearing people complain about?",
        "upvotes": 1474,
        "comments": 2769,
        "media": null,
        "permalink": "/r/movies/comments/1n0pup8/famous_movie_plot_holes_that_arent_actually_plot/"
    },
    {
        "id": "1n12b1d",
        "author": "zpattern",
        "title": "Why “To Live and Die in L.A.” Is the Gritty ’80s Crime Thriller Everyone’s Been Sleeping On",
        "content": "",
        "upvotes": 301,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e6zfQG3nBk3TFROhJiasZ_Ii64oNc-x3yiOh_ugp7Wc.jpeg?auto=webp&amp;s=5227e724510eec2d20c4a3ea68460963d5895198"
        },
        "permalink": "/r/movies/comments/1n12b1d/why_to_live_and_die_in_la_is_the_gritty_80s_crime/"
    },
    {
        "id": "1n1i755",
        "author": "DemiFiendRSA",
        "title": "As ‘The Dark Crystal’ Returns to Theaters on October 12 and 13, Brian Henson Shares Memories from the Epic Fantasy",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NzXvNaKXVomdnq4--uYNBUboIxmHyI0q49mLHT17ix8.jpeg?auto=webp&amp;s=682466bfe3352d14b7a87375072f9a02f094794f"
        },
        "permalink": "/r/movies/comments/1n1i755/as_the_dark_crystal_returns_to_theaters_on/"
    },
    {
        "id": "1n18s9m",
        "author": "TheScentOracle",
        "title": "Which movie’s ending hit you harder than you expected?",
        "content": "If I talk about the latest movie that I experienced this with, I would say it was when I watched ‘Arrival’ for the first time.\n\nWhile I did go in thinking it would be a cool sci fi about aliens and stuff..but that ending.. I was not ready for it.\n\nThe music, the visuals, the realisation…I just sat there in silence while the credits rolled. It wasn’t even “sad” in the usual sense, it was more like this deep emotional gut-punch about love, loss, and acceptance.\n\nIt honestly caught me off guard how hard it hit, and it stuck with me for days.\n\n",
        "upvotes": 106,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1n18s9m/which_movies_ending_hit_you_harder_than_you/"
    },
    {
        "id": "1n0qo7b",
        "author": "BunyipPouch",
        "title": "Hulu Lands Luigi Mangione Documentary from Oscar-Nominated Filmmaker Alex Gibney - He has previously made acclaimed documentaries about Enron, Scientology and Russian President Vladmiri Putin.",
        "content": "",
        "upvotes": 1076,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7EKVnG8LOjgwMCHYdQ5sEl042YQiMxdsnIKPXWBRbCE.jpeg?auto=webp&amp;s=9faeeec741892b2ecb1dfae5b2b62b030de12afb"
        },
        "permalink": "/r/movies/comments/1n0qo7b/hulu_lands_luigi_mangione_documentary_from/"
    },
    {
        "id": "1n1jiha",
        "author": "DoNotOpenAMA",
        "title": "Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!",
        "content": "Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!\n\n**Here's our trailer:**\n\n[https://www.youtube.com/watch?v=947I6zKNVfI](https://www.youtube.com/watch?v=947I6zKNVfI)\n\n**Synopsis:**\n\nAfter arguing with her parents a distraught teen opens an email promising acceptance, but what the message delivers infects the whole family.\n\nAsk us anything! We'll be back tomorrow Thursday 8/28 at 5 PM ET to answer any questions.\n\n",
        "upvotes": 16,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szcyjxphnklf1.png?auto=webp&amp;s=0d615076e913443dc6aa32c27b191d3db983c20f"
        },
        "permalink": "/r/movies/comments/1n1jiha/hey_rmovies_im_brian_filmmaker_of_do_not_open/"
    },
    {
        "id": "1n0oh22",
        "author": "saacer",
        "title": "Actual facts too unbelievable to be in a movie",
        "content": "What is a fact that was left out of a movie because it would have been too distracting or unbelievable for the audience?\n\nTo me is the advertisement and product endorsements by gladiators in the Roman Colosseum \n\nI really can't imagine this in the middle of the brutal fights to promote oils and other products...  What's yours? ",
        "upvotes": 1303,
        "comments": 713,
        "media": null,
        "permalink": "/r/movies/comments/1n0oh22/actual_facts_too_unbelievable_to_be_in_a_movie/"
    },
    {
        "id": "1n1jyfc",
        "author": "Euphoric_Sea9385",
        "title": "What songs are completely synonymous with a film? 💃🏻🕺🏻",
        "content": "You know those songs where the second you hear them, your brain instantly flashes to the movie. \n\nWhich songs instantly lock you into the film they came from? A few that come to mind are: \n\nStaying Alive (Bee Gees) - Saturday Night Fever.\n\nDanger Zone (Kenny Loggins) - Top Gun.\n\nUp Where We Belong (Joe Cocker &amp; Jennifer Warnes) - An Officer And A Gentleman.\n\nYou Could Be Mine (Guns n Roses) - Terminator 2. \n\n\n\n\n\n\n\n\n",
        "upvotes": 15,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1n1jyfc/what_songs_are_completely_synonymous_with_a_film/"
    },
    {
        "id": "1n1lph8",
        "author": "cyPersimmon9",
        "title": "When Roger Ebert spoke about the power of animation",
        "content": "It's a shame that so many people still deride the mdeium of animation. But Roger Ebert was ahead of his time. He said: \"Every time an animated film is successful, you have to read all over again about how animation isn't 'just for children' but 'for the whole family,' and 'even for adults going on their own.' No kidding!\"\n\n\nFrom his review of Miyazaki's Princess Mononoke: **\"I go to the movies for many reasons. Here is one of them. I want to see wondrous sights not available in the real world, in stories where myth and dreams are set free to play. Animation opens that possibility, because it is freed from gravity and the chains of the possible. Realistic films show the physical world; animation shows its essence. Animated films are not copies of 'real movies,' are not shadows of reality, but create a new existence in their own right.\"**",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1n1lph8/when_roger_ebert_spoke_about_the_power_of/"
    }
]