[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iuk9mq",
        "author": "Baby_0il04",
        "title": "Gabby petito body cam footage is making me so mad rn",
        "content": "I’m only one episode in but the way these cops are talking have me so mad rn. They’re claiming he’s a victim of abuse, when the call was about him hitting her, and the marks he has are scratches, which are defensive marks meaning she was defending herself from him. You don’t attack someone by scratching/clawing at them. Brian is laughing and stubbing over his words as he tries to defend himself. While she’s crying and blaming herself. It’s so obvious who’s the victim in this situation. (Maybe that’s hindsight talking but ugh it gets my blood boiling) \n\nSorry just had to rant here, cuz I have no one to talking to about it ",
        "upvotes": 318,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1iuk9mq/gabby_petito_body_cam_footage_is_making_me_so_mad/"
    },
    {
        "id": "1iublcq",
        "author": "Demons_Butterfly",
        "title": "I can't believe David Fincher is making Squid Game remake for Netflix rather than Mindhunter S3",
        "content": "are we missing something? who wants an American squid game? and David Fincher of all people shouldn't be wasted on it. Just own up and renew Mindhunter, It's a classic. There's lot of material left too. I cannot think of 3 netflix originals better than it. \n\nI am sorry i am ranting here but why do you think Fincher wants to make squid game? ",
        "upvotes": 376,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1iublcq/i_cant_believe_david_fincher_is_making_squid_game/"
    },
    {
        "id": "1iut84i",
        "author": "MysteriousDelay6266",
        "title": "Little Siberia | Official Clip | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iut84i/little_siberia_official_clip_netflix/"
    },
    {
        "id": "1iusnmm",
        "author": "Barnestownlife",
        "title": "One Hundred Years Of Solitude",
        "content": "I absolutely love this show; the long tracking shots, the colorful cinematography, and the music. Solid casting all around. I recap this show on my podcast. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iusnmm/one_hundred_years_of_solitude/"
    },
    {
        "id": "1iul7wh",
        "author": "Robemilak",
        "title": "‘Nobody Wants This’ Season 2 Casts Leighton Meester, Miles Fowler (EXCLUSIVE)",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iul7wh/nobody_wants_this_season_2_casts_leighton_meester/"
    },
    {
        "id": "1iuulq6",
        "author": "YellowstonerBand",
        "title": "Gabby Petito documentary BL photos from Aug 28th",
        "content": "Quick question for anyone that watched this.\n\nIn episode 2, the photos they retrieved from BL's phone. The one of just his right hand holding the elk antler (timestamp was 8:00). Is it just me, or does his hand look freshly bruised and swollen?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iuulq6/gabby_petito_documentary_bl_photos_from_aug_28th/"
    },
    {
        "id": "1iuu1ph",
        "author": "StrawberrySoyBoy",
        "title": "Why don’t streaming s revive like Netlfix have “Play Random Episode” or Queue features?",
        "content": "I’d love to be able to select a show—particularly a cartoon or sketch type show—and have it play a random episode.\n\nI’d also love a queue feature where I could make my own content blocks of media.\n\nAnyone else think these would be cool features?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iuu1ph/why_dont_streaming_s_revive_like_netlfix_have/"
    },
    {
        "id": "1iuszob",
        "author": "Beau_bell",
        "title": "Looking for Mexican TV Shows that are not drug cartel related, telenovela, or comedy",
        "content": "One example I thought was decent was Triptych, a thriller mystery about 3 sisters triplets alot like Orphan black. Worth a watch and the first season wrapped up pretty well and stands on it's own, almost seemed like a limited series.\n\nJust more stuff like this, thriller, mystery, sci-fi, fantasy, horror, adventure, etc anything like that I'm open to though.\n\n# \n\n# \n\n# ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iuszob/looking_for_mexican_tv_shows_that_are_not_drug/"
    },
    {
        "id": "1itynt2",
        "author": "S4v1r1enCh0r4k",
        "title": "IMAX CEO Richard Gelfond says he thinks that Netflix plans to make 8 Narnia movies",
        "content": "",
        "upvotes": 105,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1itynt2/imax_ceo_richard_gelfond_says_he_thinks_that/"
    },
    {
        "id": "1iu5itn",
        "author": "yahoonews",
        "title": "‘Extraction’ TV Series Starring Omar Sy Ordered at Netflix From Glen Mazzara, Russo Brothers",
        "content": "",
        "upvotes": 38,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1iu5itn/extraction_tv_series_starring_omar_sy_ordered_at/"
    },
    {
        "id": "1iu01pi",
        "author": "EthanWilliams_TG",
        "title": "Netflix Commits $1 Billion to Mexico’s Film Industry in Major 4-Year Investment",
        "content": "",
        "upvotes": 74,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1iu01pi/netflix_commits_1_billion_to_mexicos_film/"
    },
    {
        "id": "1it96ui",
        "author": "TheMirrorUS",
        "title": "Brian Laundrie’s parents shunned by Florida community over Gabby Petito’s murder following Netflix docuseries",
        "content": "",
        "upvotes": 3659,
        "comments": 724,
        "media": null,
        "permalink": "/r/netflix/comments/1it96ui/brian_laundries_parents_shunned_by_florida/"
    },
    {
        "id": "1iup5df",
        "author": "Sudden_Yak2275",
        "title": "Netflix Series",
        "content": "Is it only me, or does the Netflix series (The Recruit/Night Agent) depict security agencies as dummies? We all know the level of intelligence and the loads of data they have. I do not believe that those agencies would let a civilian into operations. Rose Larkin in The Night Agent is a bad depiction of the reputation of the famous cia. I know it is just fiction and all that. Still, as a watcher, I cannot get myself across the fact that the things they show on these series are insulting to our intelligence as viewers. In The Diplomat, the British prime minister speaks to the US Ambassador with much insolence. It has nothing to do with diplomacy norms.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iup5df/netflix_series/"
    },
    {
        "id": "1iuoxnu",
        "author": "Atlast_2091",
        "title": "The Life List | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iuoxnu/the_life_list_official_trailer_netflix/"
    },
    {
        "id": "1iunbd0",
        "author": "Womaninblack",
        "title": "Any movies or shows on Netflix where an investigator/criminal psychologist or something along those lines has a special connection to the serial killer they're hunting down? Like romantic, familial, an unexpected friend, or a strange understanding?",
        "content": "I'm looking for movies or series where some sort of investigator/criminologist is hunting down a serial killer, but develops a compelling, complex relationship, directly or having never met the killer their trying to catch.\n\nIf you've seen Riverdale, the dynamic between &gt;!Betty and her father!&lt; was really interesting to me.\n\nThank you!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iunbd0/any_movies_or_shows_on_netflix_where_an/"
    },
    {
        "id": "1iumx27",
        "author": "S4v1r1enCh0r4k",
        "title": "'Wolf King' dropped official trailer",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iumx27/wolf_king_dropped_official_trailer/"
    },
    {
        "id": "1itgt0k",
        "author": "ellissabain",
        "title": "In full: The chilling ‘burn after reading’ letter Brian Laundrie’s mum wrote to him",
        "content": "",
        "upvotes": 549,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1itgt0k/in_full_the_chilling_burn_after_reading_letter/"
    },
    {
        "id": "1iuqnph",
        "author": "culturadealgibeira",
        "title": "This new psychological thriller was the most anticipated on the platform",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iuqnph/this_new_psychological_thriller_was_the_most/"
    },
    {
        "id": "1iukke1",
        "author": "JohnnytheGreatX",
        "title": "Was my Account Hacked?",
        "content": "At around 7:30 PM tonight I was successfully using Netflix.  A few hours later I tried to use the app on my TV to watch a show, and I was logged out.  I tried to log in, and my password was not recognized.  I tried change my password and Netflix did not recognize either my phone number or email address.  I was able to look up my account by first and last name and credit card number, but Netflix sent a verification number to an email address I did not recognize.  WTF happened?  How do I fix this?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iukke1/was_my_account_hacked/"
    },
    {
        "id": "1iunnu8",
        "author": "Dangerous_Item5518",
        "title": "Watu waoge buana!!",
        "content": "Nimepanda mat tu saiii tena manzi ameiva anapita. Na smile nikimwona lakin akipita naskia uvundo ya senge. Saaii mat inanuka tu jasho. Na ni madem mostly. Boy naeza elewa lakin dem aiiiii...\n\nWatu waoge  buana muache mchezo!!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iunnu8/watu_waoge_buana/"
    },
    {
        "id": "1iuiy3f",
        "author": "Gokiburi-Sensei",
        "title": "How do I make the PC app quality looks passable. I'm trying to use the app on my PC and the image looks like shit.",
        "content": "I've had this similar problem with Hulu where where the image is fuzzy and terrible to look at as if they don't give a shit about about the PC app. I have 300mps download, connected with Ethernet, no other apps open, set to high quality, and no settings I touch make this picture worth paying a subscription for. Was wondering if anyone had any solutions.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iuiy3f/how_do_i_make_the_pc_app_quality_looks_passable/"
    },
    {
        "id": "1itnk0p",
        "author": "Debbie2801",
        "title": "Gabby Petito",
        "content": "I’m watching this atm and I have thoughts!\nObviously Brian’s parents were cautioned by their attorney not to speak to anyone. Not the police, not FBI, not Gabby’s family and certainly not the media. \n\nI feel this legal advice cost them a lot!\n\nFirstly - I believe it cost them their son - to a degree. If they had of spoken to police or FBI I believe he would have been taken in for questioning and possibly arrested or at least monitored very closely. Therefore not escaping so he could end his own life rather than face the consequences of his actions. \n\nSecondly - they lost their daughter. She has not communicated with them since Brian passed away. They never- according to her and her husband- confided in them. \n\nThirdly - their reputations in the community. People are angry at them. Blaming them for not assisting parents desperately trying to find their daughter. \n\nAnd finally financially - they had to pay Gabby’s parents a significant sum - not disclosed - from the settlement of the civil lawsuit. \n\nSo I guess I’m wondering - was it in fact sound legal advice?\nWhat are your thoughts? ",
        "upvotes": 120,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1itnk0p/gabby_petito/"
    },
    {
        "id": "1iumypj",
        "author": "Purple-Perception455",
        "title": "Gabby Petito Documentary",
        "content": "I found something interesting in this case. During the documentary, there footage of Brian showing Gabby how to shoot a gun while driving. And in his note he talks of how he was “merciful” when killing Gabby. But the autopsy reports say it was strangulation. If he was so merciful why wouldn’t he just shoot her like he did himself? I think it’s just another lie to fuel his. I also want to point out that almost every post on her instagram has the caption edited to include a long paragraph about their day and tags Brians account at least 5 times, while her original captions are typically an emoji or one word. And her last post was August 25th titled “Happy Halloween”. Um halloween isnt for 2 months?? and wouldnt that have been posted after her death? Just some of my thoughts. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iumypj/gabby_petito_documentary/"
    },
    {
        "id": "1iugr30",
        "author": "Dogpatch1966",
        "title": "Netflix: Alone Day 4 Mikey",
        "content": "I know this show is old but I just found it. Mikey just got lost and for some reason, it pissed me off so badly! These people are supposed to be survival experts and are making the dumbest mistakes in the very beginning of the show! I don’t know if anyone else feels this way or if he continues to act this way but I guess I will find out.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iugr30/netflix_alone_day_4_mikey/"
    },
    {
        "id": "1iu69lk",
        "author": "Beginning_While_7913",
        "title": "The Search For Instagram’s Worst Con Artist thoughts?",
        "content": "Just finished it and I feel like it had potential but I don’t know that we necessarily learned a whole lot from the family members which was disappointing because I thought it was going to be more focused on what happened that made her that way and her thought processes. i found it interesting when they theorized what her motives were. i also had thought there was deaths involved from people stopping treatments for these holistic methods so I was disappointed they didn’t touch on that. ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1iu69lk/the_search_for_instagrams_worst_con_artist/"
    },
    {
        "id": "1iu41v1",
        "author": "MysteriousDelay6266",
        "title": "Wolf King | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iu41v1/wolf_king_official_trailer_netflix/"
    },
    {
        "id": "1iue1ob",
        "author": "MysteriousDelay6266",
        "title": "When Life Gives You Tangerines | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iue1ob/when_life_gives_you_tangerines_official_trailer/"
    },
    {
        "id": "1itx0ki",
        "author": "SquareFroggo",
        "title": "What's the last sitcom you watched on Netflix?",
        "content": "\nThe last sitcom that I watched on Netflix was Friends. I watched it from season 1 to season 10 and I thought that it was an overall funny and interesting show to watch. My favorite character was Ross Geller. ",
        "upvotes": 9,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1itx0ki/whats_the_last_sitcom_you_watched_on_netflix/"
    },
    {
        "id": "1iucvdu",
        "author": "halleinwonderland186",
        "title": "Departure season 3 not on Netflix?",
        "content": "Hi, I'm new to this sub so not sure if anyone has asked this before... I've just finished seasons 1 and 2 of Departure, not realising there's a 3rd season. When I looked online I couldn't find anywhere to watch it in the uk (not even Amazon Prime, despite some articles saying it's available on there). Does anyone know if they're bringing season 3 to Netflix?\nTIA",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iucvdu/departure_season_3_not_on_netflix/"
    },
    {
        "id": "1itubw9",
        "author": "Adept-Sweet7825",
        "title": "'Zero Day' review: Robert De Niro's first TV series is unable to handle this political moment",
        "content": "",
        "upvotes": 14,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1itubw9/zero_day_review_robert_de_niros_first_tv_series/"
    }
]