[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 66,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1li2xbf",
        "author": "BarracudaJazzlike730",
        "title": "Forget the critics, Tires is extremely funny",
        "content": "Tires is a great show. Absolutely hilarious. I have no idea why the critics (look at metacritic) gave the show terrible reviews. It's like a mix of the office meets East Bound and Down. Am I alone in thinking this show is awesome? ",
        "upvotes": 50,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1li2xbf/forget_the_critics_tires_is_extremely_funny/"
    },
    {
        "id": "1lhqury",
        "author": "Afraid_Orange6762",
        "title": "3 body problem is one of the best sci-fi shows I’ve watched in a while",
        "content": "The show is beautiful. The cinematography, how the plot advances and how the characteristics of each person is introduced to the viewers in a very subtle but definitive way. I love the show and I hope to god that they don’t discontinue. I’ve never posted a review in my life but knowing Netflix and how they’ve cancelled a lot of the shows I was eagerly  waiting for, I just wanted to post my opinion on this subreddit so that even if there was a 0.01% chance that this post could make the show gain some traction I had to do it.",
        "upvotes": 115,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lhqury/3_body_problem_is_one_of_the_best_scifi_shows_ive/"
    },
    {
        "id": "1lhk6ah",
        "author": "moschino1837",
        "title": "What do you think is the best production Netflix has ever made?",
        "content": "Considering we’ve now had Netflix for 10+ years, what do you think is the highest quality production (film or TV show) that has been produced by Netflix, and why? ",
        "upvotes": 181,
        "comments": 359,
        "media": null,
        "permalink": "/r/netflix/comments/1lhk6ah/what_do_you_think_is_the_best_production_netflix/"
    },
    {
        "id": "1li3fww",
        "author": "LectureJaded1233",
        "title": "Is “The Waterfront” worth watching?",
        "content": "Thinking about starting “The Waterfront\" but haven't heard much about it. For those who've seen it, is it worth watching? Any quick thoughts or recommendations are appreciated!\nThanks!",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1li3fww/is_the_waterfront_worth_watching/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 406,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lhnz54",
        "author": "HurricaneLogic",
        "title": "The new format",
        "content": "This new format is absolutely awful. \n\nPreviously, all categories were in subcategories, to make it easy to navigate through. \n\nNow it's a jumbled mess, with everything thrown together. I have lost interest in watching, and am seriously considering canceling. ",
        "upvotes": 24,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnz54/the_new_format/"
    },
    {
        "id": "1lhs33k",
        "author": "Expensive-Energy-818",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "The first wife died of an asthma attack. It's possible to die of asthma as a non asthmatic. And the prosecutors was presenting is as if Janson had strangled her, with no marks on her neck. It's crazy because strangulation can be seen on the outside and not be seen on the outside but have a full on  impact from inside the neck. But what makes this whole case a mystery is that Tom ( the father) and Molly hade bearly any scratches or woundes on them. But parts of Jansons brain was out. If Molly really had been struggled there would have been injuries from inside the neck.He was much bigger and stronger. \n\n I don't believe ether that she was unconscious. Every woman pees while being nervous or it's something she looked up for her story.   \n\nI believe that it was all pre planned. She read about the first wife and made up a story that would fit. Intoxicated him weak and begun hitting him with the bat. Then shouted out so that the father could come up and help her finish the story. Why was there a whole brick in their bedroom?  And why was it so easy for the to hit him with it? Why was blood splattered on the backside of the door ? Was  Mollys mother on the other side the door, preventing him from running out? \n\nIf Tom was there while Janson was alive... he could have them stop the altercation and calm things down, run or even right then call 911 ? \n\nNOOOO ! Tom was an ex FBI agent. He knew how to save his daughter and work around the crime she hade committed. Tom was educating students on investigation after his job at FBI.  \n\nI feel sorry for them kids. Me, myself and I have also been manipulated as a child and used as a spokes person. I understand. They are grown now and can recall memory better.",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhs33k/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1lhynfp",
        "author": "PeskieBrucelle",
        "title": "Can we talk about kpop demon hunters?",
        "content": "When I first saw the title I was like, eh this is weird. However the animation caught my eye. With nothing else to watch I gave it a shot. \n\nI had to stop watching to go to an appointment but when I came back I restarted it to show my significant other and.... \n\nWow. Just wow. The animation was unique and hilarious the singers voices were beautiful and just, flawless. The music was catchy, the feels were Feely. As a kid who loved power puff girls it gave me that same thrill I had as a kid. I never really got into kpop I read some web toons but my significant other and I now get the appeal why these kpop teens love it. \n\nThe story was unique and authentically pleasing rich with culture and life and I need a plushy of that blue tiger with his bird friend. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhynfp/can_we_talk_about_kpop_demon_hunters/"
    },
    {
        "id": "1li4g0a",
        "author": "lendmeflight",
        "title": "How is this possible?",
        "content": "I’m sure I’m the idiot in this scenario and I’m prepared to accept that but I cannot think of a reason this could happen\n\nHere is the scenario. \n\nI am in the United States and my friend, also in the United States but a different time zone, has a different movie selection than I do. \n\nHow is this possible?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1li4g0a/how_is_this_possible/"
    },
    {
        "id": "1li4e6c",
        "author": "Fragrant_Peanut_9661",
        "title": "3 Body Problem",
        "content": "To whoever posted earlier about this show, THANK YOU! Based on that post, I decided to give it a rewatch. (I've already watched it once, when it first came out.) And now I remember why I loved it so much. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li4e6c/3_body_problem/"
    },
    {
        "id": "1li3rh4",
        "author": "17pounder",
        "title": "Language options not available?",
        "content": "I’m trying to watch ATLA in Polish, as I know the story and broad dialogue for immersion. I know that a Polish dub of the show exists and should be on Netflix. But changing my audio/language settings and location don’t appear to work, the only offer language is English. Is there a way to access the Polish version? I’m thinking to use this for a couple languages.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li3rh4/language_options_not_available/"
    },
    {
        "id": "1lhlw9e",
        "author": "NoCrew_Remote",
        "title": "Lockwood &amp; Co Cancelled [RANT]",
        "content": "Lockwood and Co got canceled after just 8 episodes. I don’t care what anyone says, that’s not a full season. That’s one third of a season. It barely had time to breathe before Netflix pulled the plug.\n\nThis is exactly why people are losing faith in Netflix. You finally make something with original IP, solid cast, great atmosphere, smart writing, and instead of giving it time to grow, you kill it off faster than a ghost hunt in episode one.\n\nMeanwhile, the most mind-numbing reality shows get renewed before the first season even finishes airing. Why? Because they’re cheap and easy and someone in a boardroom thinks short-term numbers matter more than actual storytelling.\n\nPeople keep asking why fans don’t get invested anymore. This is why. You give us something promising, with real potential, then yank it away like it never mattered.\n\nLockwood and Co deserved better. The actors deserved better. And honestly, the fans who actually stuck around and told people to watch it deserved better too.\n\nSo yeah, maybe it didn’t bring in Stranger Things numbers overnight, but maybe if you let your shows breathe instead of canceling everything that isn’t a viral hit in 24 hours, you’d have more to show for it.\n\nNetflix is out here ghosting its own content. Fitting for a ghost hunting show, I guess.",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlw9e/lockwood_co_cancelled_rant/"
    },
    {
        "id": "1li29u2",
        "author": "StoicSloth5",
        "title": "K-pop demon hunters jammies",
        "content": "Does anybody know where I could get polar bear jammies like the ones Mira wears in the movie? They look super cute and I wanna wear them. Am I gonna have to sew them myself or do they exist somewhere?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li29u2/kpop_demon_hunters_jammies/"
    },
    {
        "id": "1li25ov",
        "author": "MoonMonster55",
        "title": "Somewhere Between is a pretty good show",
        "content": "I thought the show had a pretty good story even if it was hard to follow at times. The acting was... Not good at times. Especially the lead actress moving around so much, but I don't have any critiques for anyone else. The dialogue was a bit cringe but it's 2017.\n\nI wish TV shows had epilogues or aftermath or something. Like what happened to Ruskin? Did he die with no consequences? Anything about the police? Was Cupcake really the only compromised one? Did Serena just get over her dad dying and Nico being her step dad? The DA was shot in the head and nbgaf? Logan, his brother and the governor's wife crash a plane and we can't see the aftermath? I know they live happily ever after, with a picnic in the forest they all almost died in but come on. \n\nEDIT: I know the whole fate thing, somebody had to die for one to live but HELLA people died. Logan said he'd kill himself before facing consequences, and he gets to die. Danny loses 10 years of his life, but Logan can't spend 1 day in a cell? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1li25ov/somewhere_between_is_a_pretty_good_show/"
    },
    {
        "id": "1li20c4",
        "author": "Jay_Jaxxson",
        "title": "What do Pogues and Kooks do for fun?",
        "content": "I'm planning a trip to Charleston and during my time there I want to visit some of the OBX film locations. \n\nI think it would be cool for the first day to do things around the area that Pogues would do such as boating, fishing, and maybe bar-hopping 🤔 \n\nOn the second day, I was thinking about doing things Kooks would do, like shopping downtown, golfing, and possibly scuba diving.\n\nWhat are all the things that Pogues and Kooks do for fun throughout the Outer Banks series, based on your memory?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li20c4/what_do_pogues_and_kooks_do_for_fun/"
    },
    {
        "id": "1li156r",
        "author": "Mindless-Nothing-109",
        "title": "Epic × Kpop Demon Hunters",
        "content": "Everytime I listened to GOLDEN, I always wondered why does it sound so familiar? I saw some people comparing it to \"I AM\" By IVE and I see the similarities! But the part that goes \"I'm done hidin, now im shining...\" always itched my brain because it sounded soooo familiar to something! And then yesterday my brain decided to sing this wherever that part comes up: \" Aphrodite, Can you guide me?\". ...It was this!! This is what sounded so similar!  For those who might not know its one of the cut songs Jorge made in Epic.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li156r/epic_kpop_demon_hunters/"
    },
    {
        "id": "1lho628",
        "author": "Round-Refrigerator99",
        "title": "I need a sequel to Kpop Demon Hunters NOW",
        "content": "That movie was so amazing it should've been playing in theaters. It's been a while since I saw a good Netflix film. People were not lying when they said it was a 10/10. The songs were amazing as well and I loved the characters",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lho628/i_need_a_sequel_to_kpop_demon_hunters_now/"
    },
    {
        "id": "1lhzpcg",
        "author": "OutlandishnessSea258",
        "title": "English subtitle disappeared all of a sudden",
        "content": "I’ve been watching Reply 1988 and have always used the English subtitles. It was there last weekend but when I checked yesterday the English subtitles were. Same with the previous and future episodes. Has anybody experienced this before? I tried closing the app but no luck.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhzpcg/english_subtitle_disappeared_all_of_a_sudden/"
    },
    {
        "id": "1lhvol3",
        "author": "NothingIsACoolHand",
        "title": "The Cast Of 'Sirens' On The Themes Of Class, Power, And Sisterhood",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhvol3/the_cast_of_sirens_on_the_themes_of_class_power/"
    },
    {
        "id": "1lhvgwd",
        "author": "_issio",
        "title": "Olympo pissed me off... a lot",
        "content": "In itself the series is “good” (a Spanish version of Tiny Pretty Liars), but it pissed me off. It's eight chapters of stress because the characters are softer than bread.\n\nAmaia is cast as the bad guy and I spent seven chapters wanting to pull my hair out because they were all more blind than a drunk at a party, and then in the eighth chapter they give you the typical “she does something bad because her mother is pressuring her” to make it seem like she has depth and that everything is rolling because the series is already over. Zoe doesn't understand shit, Roque even less and Cristian sucks.\n\nOlympo is almost a Russian mafia, when it's a copy of Adidas. The three enlightened Olympo think they are mafia bosses when you can see eighty kilometers away that they are scumbags, and the viewer knows it and has to see how all the characters wonder “what's going on”. Hell, we all know it except the main characters. It's a fucking tracksuit brand, not a multimillionaire company that's getting its ass licked so much (yes, I know that in real life sponsorships are key, but it's not that bad).\n\nThe performances themselves are decent (the best for me is Clara, she comes with experience and I'm glad she didn't stick with what she did in Through My Window), the cinematography is perfect and the soundtrack is meh. You can tell they tried to make another Élite and let's see how it turns out.\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lhvgwd/olympo_pissed_me_off_a_lot/"
    },
    {
        "id": "1lhj0fp",
        "author": "No-Opportunity-8964",
        "title": "KPop Demon Hunters could have worked as a Mini-Series",
        "content": "Yeah after watching the movie... I love it to bits! The music, the characters, I could instantly rewatch it again :D \n\nBut it also felt rushed. There is so much plot potential, but it seemed like they didn't really had the time to go in depth with the different characters.. \n\nWhile the Movie was good, I think it would have been better as a mini series, like with 5-6 Episodes. To give those deep plots more screentime.\n\nActually when I first heared about it I thought it would become an Anime like Series. \n\nWhat do you guys think? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhj0fp/kpop_demon_hunters_could_have_worked_as_a/"
    },
    {
        "id": "1lhlqic",
        "author": "Own-Conclusion-2973",
        "title": "Recommendation please",
        "content": "Recommend a show like pretty little liars. A little mystery, some high school romance, female friendship, family drama, visually pleasing, good fashion. \nI know the show sucked after a few seasons and the ending was bad but it was a good watch for so long. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlqic/recommendation_please/"
    },
    {
        "id": "1lhef2v",
        "author": "Creative-Ad-1363",
        "title": "Sweet Bobby",
        "content": "I'm re-watching Sweet Bobby and I'm still as shocked as the first time seeing it.\n\nWhat I'm seeing in the show this time around is how Kirat fell into an unverified fantasy so easily. We live in a romance obsessed culture, and some people will ignore hard facts and red flags to claim a relationship. Our obsession with romance is what makes women such easy victims to predatory personalities. \n\nMy hope is for women especially in marriage obsessed cultures, is to wake up and realize they're more worthy endeavors in life. It's so silly and I'm just so sooo sad for women like Kirat who are stigmatized for being single, and through their desperation are easily fooled.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhef2v/sweet_bobby/"
    },
    {
        "id": "1lhnjdt",
        "author": "Plastic-Cricket-7437",
        "title": "Just finished watching kho gaye hum Kahan",
        "content": "It's really good movie. Unique concept . No starcast but Ananya pandey is there . Don't worry she didn't drop a disaster class according to mee . If you really want to watch a new gen movie with something different. Definitely check that out ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnjdt/just_finished_watching_kho_gaye_hum_kahan/"
    },
    {
        "id": "1lhv7nj",
        "author": "AnotherMessyHuman",
        "title": "Controversial(?) review of Kpop Demon Hunters: are we just haters?",
        "content": "TLDR: Cool concept, great visuals, but everything else needed more time\n\nDISCLAIMER: Slight spoilers, honestly tho we guessed every single \"plot twist\" so do with that what ya will\n\nHi everyone,\nme and my housemates really wanted to love K-Pop Demon Hunters but..well, we didn't.\n\n(Background: I like Kpop, looove certain groups and songs, but I'm not a fan the way most ppl are, one of my housemates is definitely more of a fan, and the other is a big fan, but not to the extreme degrees that some get to)\n\nBelow is a review that covers all of our critiques:\n\nThe concept is super fun, a K-pop girl group who secretly hunt demons? Dope, make a whole series out of it and I'll eat it up. The animation is honestly amazing, sick character designs (although some stuff feels a bit dated but hey, still nice) and a cool overall vibe. The idea of having a demon boy band as their rivals was clever, and the music had solid beats (though the lyrics were a bit meh).\n\nBut beyond the surface, things kind of fall apart.\n\nThe story moves way too fast. There’s barely any time to get to know the characters, their pasts, or why they even care about each other. The relationships felt really shallow, and that goes for the &gt;!central romance!&lt; too. &gt;!It tried to do the enemies-to-lovers thing, but it didn’t land, mostly because sure, they \"hated\" each other but it didn't feel real, and the shift to romance felt rushed and bland.!&lt; No tension, no buildup, just...there.\n\n&gt;!The big sacrifice scene was supposed to be emotional!&lt; We found it kinda predictable and it didn’t hit at all. It felt like a forced “sad moment” the movie thought it needed, but there wasn’t enough character depth/story development to make it actually feel sad.\n\nOverall, the writing just didn’t do the concept justice. Dialogue was pretty basic, nothing that really stuck with us or made us feel something. And with how quickly everything moved, there just wasn’t enough time to explore the world, background stories, or the themes properly.\n\nSo yeah, awesome animation, great aesthetic, but the story needed way more time and heart. Had all the ingredients, just didn’t quite mix them quite right and was, honestly, undercooked and rushed.\n\nYet, going online, I see mostly super positive reviews, and it just feels like we're the only ones having much negative stuff to say.\n\nSo redditors, are we just haters?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhv7nj/controversial_review_of_kpop_demon_hunters_are_we/"
    },
    {
        "id": "1lhm5a1",
        "author": "chadderdeux",
        "title": "4k with DisplayPort on PC.",
        "content": "I have the app and a monitor to handle it. The HEVC is installed. I have heard that Netflix prefers HDMI, but I don't want to lose the extra frames when gaming. I am maxing out at 1080p with a premium account. Is there a solution to this? What's the deal? \n\nI run 4k 144hz on Windows 10 (soon to be 11, forever)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhm5a1/4k_with_displayport_on_pc/"
    },
    {
        "id": "1lhxig5",
        "author": "Affectionate_Yam4221",
        "title": "10 Underrated Netflix YA Shows With the Freshest Rotten Tomatoes Scores",
        "content": "I feel like they didn't mention some good ones like Elite, what do y'all think?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhxig5/10_underrated_netflix_ya_shows_with_the_freshest/"
    },
    {
        "id": "1lhsyad",
        "author": "Unease_Peanut",
        "title": "Can Netflix stop adding animes with one type of subtitle?",
        "content": "I'm getting kinda tired of seeing new animes get added and then finding out that there's only german or french subtitles. I'm dutch and can't read either language.\nWhy is there no English?!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhsyad/can_netflix_stop_adding_animes_with_one_type_of/"
    },
    {
        "id": "1lhgcl5",
        "author": "_AvgCanadianEh_",
        "title": "Audio Cutting Out",
        "content": "Ok well im gonna post this again since over 1k people looked at it but said nothing. There were even some down votes for no reason. I'm just asking a question and need a little help\n\nSo here is what I am using. LG C1 Oled smart TV. Got Netflix downloaded on it. And for audio, I have a pair of Sony Wireless Headphones connected through bluetooth to my tv\n\nMy issue is, everytime I watch Netflix with this exact set up, the audio always cuts out while whatever im watching keeps playing. Ive looked it up before and something about turning off 5.1 surround or something, but thats not even an option. the only options are subtitles and audio language. Thats all. I need to know why this is happening and if there is a fix please 🙏 😭",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhgcl5/audio_cutting_out/"
    },
    {
        "id": "1lhisqf",
        "author": "SnapSketchStudios",
        "title": "Intresting",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhisqf/intresting/"
    }
]