[
    {
        "id": "1igml0a",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 14,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igml0a/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ifhmji",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Espanyol - Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ifhmji)",
        "upvotes": 49,
        "comments": 804,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifhmji/post_match_thread_espanyol_real_madrid/"
    },
    {
        "id": "1ign2qx",
        "author": "dark4403",
        "title": "🗣️ Cristiano Ronaldo: \"Kylian Mbappé is not a striker, if I were at Real Madrid I would teach him to play as a forward\"",
        "content": "",
        "upvotes": 778,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9h66sas4uwge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ign2qx/cristiano_ronaldo_kylian_mbappé_is_not_a_striker/"
    },
    {
        "id": "1ignt5k",
        "author": "SubjectTumbleweed216",
        "title": "Cristiano Ronaldo: “I say to the Madrid fans, take care of Mbappe, take care of the young man. Protect him”",
        "content": "Full transcript:\n\nCristiano Ronaldo:\n\n“Take care of him, and I say to the Madrid fans, take care of the young man. He is very good and will go over the top. Madrid has to help him, protect him, and I have no doubt that he will give a lot of joy to the Real Madrid fans.”\n\n“I love him a lot because not only because of the history he had as a youngster where he loved Cristiano a lot and was his idol, but it is because I truly see him, I see him as a star and I think that he will give a lot of joy to Real Madrid.”",
        "upvotes": 445,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9exi2ubd2xge1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ignt5k/cristiano_ronaldo_i_say_to_the_madrid_fans_take/"
    },
    {
        "id": "1igqyko",
        "author": "I_did_it_4_Lemonz",
        "title": "Real Madrid- Espanyol referees punished.",
        "content": "",
        "upvotes": 186,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wp_zPcrtqtdlk02UntVZ538cHbc28O9fG9h5B3C_3CE.jpg?auto=webp&amp;s=350d9c0dd5282dc8708fad3429f2c9dbf16e2e84"
        },
        "permalink": "/r/realmadrid/comments/1igqyko/real_madrid_espanyol_referees_punished/"
    },
    {
        "id": "1igoalv",
        "author": "Inevitable_Sky398",
        "title": "Real Madrid on IG posted about the red card not given to Espanyol player for the horror tackle on Mbappé, thoughts ?",
        "content": "https://preview.redd.it/fseytit07xge1.png?width=2648&amp;format=png&amp;auto=webp&amp;s=0fd55dce1f5683729122519df8ace98b6cfaccb1\n\nI see in many comments that some of our fans are not happy with such a move. This is the first time I see the club doing something like this. The board must be furious after these decisions, it's not the first time the VAR is pretending to be asleep.. not only they turn blind eyes on these fouls, but the 2 times Mbappé was on side, yet the VAR checked only the frame AFTER the ball was passed and Mbappé is offside.. and this right here could have easily ended Mbappé's career. the tackle was horrible ! \n\nWhat are your thoughts on the club posting this ? ",
        "upvotes": 131,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igoalv/real_madrid_on_ig_posted_about_the_red_card_not/"
    },
    {
        "id": "1igs4v7",
        "author": "itsshpadoinkleday",
        "title": "RM is 7th team in top5 leagues when it comes to Points Per Game this season, despite dozens of injuries and holes in the squad.",
        "content": "",
        "upvotes": 60,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pnDGzYrHWH2n4AgRg7E-lvJAmjdJlDWzkQSqDRMndeY.png?auto=webp&amp;s=765cf8f2a6162306683f9457bf783ae761995578"
        },
        "permalink": "/r/realmadrid/comments/1igs4v7/rm_is_7th_team_in_top5_leagues_when_it_comes_to/"
    },
    {
        "id": "1igi30n",
        "author": "TheGhost5322",
        "title": "I'm sorry but this is funny 😭",
        "content": "",
        "upvotes": 209,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vefweh4j2vge1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1igi30n/im_sorry_but_this_is_funny/"
    },
    {
        "id": "1igp3d5",
        "author": "Accurate_Advance6903",
        "title": "The way we lost Rudiger is exactly the same as when we lost Vini after the Leganes game - sheer ignorance.",
        "content": "Seriously what is this next level clowning. First Carlo risks and got Vini injured by making him a play a full 90 against leganes after international break with no rest making him miss key games and now against espanyol Rudiger is the latest victim, which may be the killer blow that ends our season. He chose not to give Rudiger any rest AT ALL. \n\n",
        "upvotes": 43,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igp3d5/the_way_we_lost_rudiger_is_exactly_the_same_as/"
    },
    {
        "id": "1igtehd",
        "author": "chui77",
        "title": "[Post Match Survey Results] Real Madrid 0-1 Espanyol",
        "content": "",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igtehd/post_match_survey_results_real_madrid_01_espanyol/"
    },
    {
        "id": "1ig8o00",
        "author": "sntqst2",
        "title": "Do people think we can’t lose to Man City?",
        "content": "When I watch Man City games it seems a big part of their problem is that teams have learned to telegraph and break their typical passing patterns and positional play. Code is cracked.\n\nHowever, you don’t have to worry about Ancelotti studying your team and setting up for you or anything like that. He’s not exactly a “do your homework” type.\n\nThere is only one type of game Man City can win. And that is the game we will give them.\n\nThis sub is gonna be a very sad place to be on Feb 18th.",
        "upvotes": 139,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ig8o00/do_people_think_we_cant_lose_to_man_city/"
    },
    {
        "id": "1ig3uye",
        "author": "Accurate_Advance6903",
        "title": "If Arsenal could pump 5 inside guardiola and city, then how much could we ? 🤔",
        "content": "Serious question since clearly defending like last year isn’t an option. We have one of the most lethal attackers in the world in our frontline. Let’s face it city and pep are washed. It would be a shame if we don’t beat this city team. Absolutely no excuses. We are too good to be going out to this team. It’s going to be attack because defending is clearly not going to work out. Only Carlo can fuck this for us. We won’t have a better chance to pump city HARD. \n\nTime to end guardiolas city career. ",
        "upvotes": 229,
        "comments": 190,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ig3uye/if_arsenal_could_pump_5_inside_guardiola_and_city/"
    },
    {
        "id": "1ifrgqw",
        "author": "SubjectTumbleweed216",
        "title": "Courtois waiting for Rudiger to finish praying 🤍",
        "content": "",
        "upvotes": 1876,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7h418a3baoge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifrgqw/courtois_waiting_for_rudiger_to_finish_praying/"
    },
    {
        "id": "1ifrms8",
        "author": "Shan107",
        "title": "You guys ready for this legendary defence against City and Atleti??",
        "content": "Alvindi the best attacking LB in modern football \nSalaba the best young ball playing CB in the world \nTchouldini the epitome of positional awareness \nLucafu the most complete RB football has ever seen",
        "upvotes": 939,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vg2fp0ufcoge1.jpeg?auto=webp&amp;s=84fb353eb4357234ca1bcca45d815d742117e6f3"
        },
        "permalink": "/r/realmadrid/comments/1ifrms8/you_guys_ready_for_this_legendary_defence_against/"
    },
    {
        "id": "1igbt3a",
        "author": "Razorlance",
        "title": "Pipi Nakai - underrated Japanese La Fabrica talent with shades of Bellingham’s playing style",
        "content": "Anybody remember the clip where he impressed Marcelo with his skills?\n\nKid was quite hyped back then, had a few loan spells in the lower leagues. Superb technique but still needs to improve his physicality. He’s a big lad though now compared to when he took that pic with Marcelo- 6’0. Very elegant and graceful on the ball though, just like Jude.",
        "upvotes": 31,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l2clKqEPVKwuaFpniL2LGKTaLWtmSML0BL5GFzmQnN4.jpg?auto=webp&amp;s=6f5c6c77032abd3154e3f585ef56b03989592d75"
        },
        "permalink": "/r/realmadrid/comments/1igbt3a/pipi_nakai_underrated_japanese_la_fabrica_talent/"
    },
    {
        "id": "1ifywz8",
        "author": "ace-s",
        "title": "There were reports that Rudi was playing while experiencing pain, Carlo could have rotated against a relegation team",
        "content": "We are talking about one of the weakest teams in La Liga. Surely Asensio who IMO has not had a single bad performance and has been constantly praised game after the other could have started. He even played well AFTER Rudi got injured...\n\nGiven the chaotic schedule ahead of us, Carlo should have rotated even more players and players like Arda and Endrick should have started.\n\nwe have seen Barca field literally teenagers and has managed to turned 4-5 of them to world class players. We even have Ramon to play as CB\n\nForcing to field his \"best\" XI against a relegation team is a MANAGER issue imo.",
        "upvotes": 153,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifywz8/there_were_reports_that_rudi_was_playing_while/"
    },
    {
        "id": "1ifwltv",
        "author": "Pharaoh_AG",
        "title": "Got a signed Cristiano Ronaldo signed Real Madrid jersey",
        "content": "Beckett witnessed.",
        "upvotes": 173,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vbvjboph3qge1.jpeg?auto=webp&amp;s=6fd04642491a92bee2651421cb0d8bfea9ded866"
        },
        "permalink": "/r/realmadrid/comments/1ifwltv/got_a_signed_cristiano_ronaldo_signed_real_madrid/"
    },
    {
        "id": "1ifwn04",
        "author": "Lekanswanson",
        "title": "It seems everyone forgot Vini scored yesterday",
        "content": "I saw a lot of comments, some rightly deserved  about Vini not playing, well, how the team plays better without Vini and how Vini should have came off and I just want to say how wrong all those comments are.\n\nIt seems everyone forgot that Vini was the only player that actually had the ball in the back of the net yesterday but no one talks about Mbappe taking the bait and swinging at the defender (even though he was getting pulled), which made Vinis goal to be ruled out.\n\nAlso Mbappe lost the ball just as much as Vini and had so many bad touches. Was in a good position to pass and decided to shoot from a tight angle.\n\nHow come Vini gets all the hate when they were other players including Rodrygo who didn't really perform.\n\nMbappe should have came off at around 70 minutes and so should Bellingham for Arda and Endrick and Brahim came on for Rodrygo.\n\nAncelotti waited till it was too late and lost our momentum when we had them on the back foot but some people here will still be abusing and attacking other fans for having opinions when we can all see the same shit week in week out.\n\nAnd no Rudiger might have a hamstring because the manager barely fucking rotates and makes subs way too late every effing match. He will get praise for making Asencio \"better\" when in reality he's only force to play him because of injury. ",
        "upvotes": 151,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifwn04/it_seems_everyone_forgot_vini_scored_yesterday/"
    },
    {
        "id": "1igsaaw",
        "author": "MaxIamIonist",
        "title": "Copa del Rey contra el CD Leganés - Meet and Greet",
        "content": "Hola, Madridistas!\n\nI've seen a meet and greet done with Vinicius and Vallejo ahead of the Espanyol game. How can I attend one, where do they publish the information and is there one ahead of the game against Leganés?\n\nAny locations where the socios gather before the game in Leganés? I will be visiting and would love to hang around with other madridistas!\n\nHala Madrid!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igsaaw/copa_del_rey_contra_el_cd_leganés_meet_and_greet/"
    },
    {
        "id": "1igil32",
        "author": "Shan107",
        "title": "What are the signings you want next season??",
        "content": "This season so far has been mixed bags and while we have individually top players, we also lack balance in the team. \n\nFor example there's no cohesion in midfield and we lack a playmaker who can connect the team, play in pocket spaces and break lines with through balls.\n\nWe have average at best fullbacks and have an ageing defence as well as Militao who might not get back to previous level with back to back ACLs.\n\nThese are the signings I would go for if it was up to me.\n\n1. Wirtz - Xabi might become our next coach and who's the better option to be playmaker than his best player. Wirtz is arguably the best playmaker in the game right now and can bring much needed creativity to our midfield.\n\n2. TAA - Wish Hakimi was playing anywhere but PSG or James wasn't made of glasses. Trent is extraordinary with ball and although he isn't good defensively, he can give different dimension to our attack and spark some thing in often dead right sided attack.\n\n3. Huijsen - Everytime I watch him, he keeps impressing. Tall, young and ball playing defender who's Spanish on top of it. He can be the future of our defence.\n\n4. Miguel - With Davies most likely renewal at Bayern, our options are slim and need to spend more money elsewhere. Miguel can be cost effective yet a very good option.\n\nOnes to keep an eye on.\n1. Murillo - Has been a beast for Nottingham and with recent renewal, move is unlikely. He has potential to play for Madrid in coming years.\n\n2. Nico Paz - One of our own and has been very good for Como. Another season in serie A can do him well at this time though.\n\n3. Angelo Stiller - There's lack of quality deep lying playmakers among the youngsters right now. Stiller is one to look for among the few options out there and I won't be surprised if any big team moves for him soon.",
        "upvotes": 4,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igil32/what_are_the_signings_you_want_next_season/"
    },
    {
        "id": "1ifu8us",
        "author": "FuturisticLion37",
        "title": "Parte Médico de Rüdiger:",
        "content": "Following tests carried out on our player Antonio Rüdiger, he has been diagnosed with an injury to the femoral biceps of his right leg.\nHe is set to miss approximatively 20 days.",
        "upvotes": 208,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1ifu8us/parte_médico_de_rüdiger/"
    },
    {
        "id": "1ifpjbx",
        "author": "dark4403",
        "title": "Mbappé's reaction when he was asked about the brutal tackle he received.",
        "content": "",
        "upvotes": 507,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7bnm355uonge1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifpjbx/mbappés_reaction_when_he_was_asked_about_the/"
    },
    {
        "id": "1ig58fk",
        "author": "ManuMora98",
        "title": "[Basket] Win against Joventut to remain on top of the league tied with Unicaja, in a tough match that was tied into the 4th quarter, when we stepped up (28-15). 21pts for Musa, and debut of Dennis Smith Jr.",
        "content": "",
        "upvotes": 22,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2xcldab81sge1.jpeg?auto=webp&amp;s=6db8a65318e704c1d3c1cac5b105aa068fae0a3e"
        },
        "permalink": "/r/realmadrid/comments/1ig58fk/basket_win_against_joventut_to_remain_on_top_of/"
    },
    {
        "id": "1ifvmmq",
        "author": "mishhka1",
        "title": "Matching Real Madrid wallpapers i re-did :)",
        "content": "",
        "upvotes": 92,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifvmmq/matching_real_madrid_wallpapers_i_redid/"
    },
    {
        "id": "1ifib5g",
        "author": "BdBoss_777",
        "title": "Yes we should have played better but when the Negreira league is against you for 90 minutes you can’t really do much. Wtf  is the point of VAR honestly, what happened today is honestly unbelievable.",
        "content": "",
        "upvotes": 961,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i5l3kfcztlge1.jpeg?auto=webp&amp;s=c8e6fb6aa64ba34a0cd5014256536983dbbc086f"
        },
        "permalink": "/r/realmadrid/comments/1ifib5g/yes_we_should_have_played_better_but_when_the/"
    },
    {
        "id": "1ifh0v3",
        "author": "supplementarytables",
        "title": "61' Carlos Romero foul on Kylian Mbappé",
        "content": "",
        "upvotes": 937,
        "comments": 115,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b23q94lkjlge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifh0v3/61_carlos_romero_foul_on_kylian_mbappé/"
    },
    {
        "id": "1ifr7fg",
        "author": "LosBlancosSR4",
        "title": "Former Real Madrid Basketball Star (and Madridista) Traded to the Lakers in Blockbuster Trade",
        "content": "",
        "upvotes": 156,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/avf0NrbD6O2HHPGwYoLwMUYAkhXMoNBjUfAcpiDtLeU.jpg?auto=webp&amp;s=d3e10f321818b801eedce2cbc730c839a99356f5"
        },
        "permalink": "/r/realmadrid/comments/1ifr7fg/former_real_madrid_basketball_star_and_madridista/"
    },
    {
        "id": "1iffoem",
        "author": "Finian_mbappe",
        "title": "Espanyol's player was holding Mbappe by his neck to stop him from making a run before Mbappe pushed him away, but the VAR only reviewed the push not the choke hold.",
        "content": "",
        "upvotes": 942,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3w0dr61t8lge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iffoem/espanyols_player_was_holding_mbappe_by_his_neck/"
    },
    {
        "id": "1ifggj6",
        "author": "DonManjo",
        "title": "Not even a freekick for this challenge",
        "content": "",
        "upvotes": 578,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pcmh0a52flge1.jpeg?auto=webp&amp;s=8acb7f061f652bd9f51c0696e28c50f84de16e8a"
        },
        "permalink": "/r/realmadrid/comments/1ifggj6/not_even_a_freekick_for_this_challenge/"
    },
    {
        "id": "1ifpuwl",
        "author": "kaizar_Soze",
        "title": "The Board and Not Carlo Ancelotti Is Responsible For The Struggles And The Current Mess",
        "content": "\n\n\n\n\n\nI’m with Carlo on this. In just three years, he’s won two Champions League titles and a La Liga title, yet the club continues to treat him with a lack of respect. Last summer, he  asked for a replacement for Kroos, this is why we were linked to kimmich but the board rejected his request. Now, he’s once again pushing for reinforcements in midfield and at right-back this window, only to be turned down again. It’s unfortunate a manager  who has delivered so much success for this club is being undermined at every turn.\n\nTo make matters worse, every time the team loses a match, there’s immediate speculation in the media—often fueled by sources close to the board—about his job security. This kind of instability is unacceptable, especially when you compare it to how other top clubs operate. Take Guardiola, for example. When Manchester City lost five games in a row, there was never any  discussion about his future. Instead, the club backed him in the January transfer window, spending €200 million to strengthen the squad, and they’re now on the verge of signing another midfielder for €60 million.\n\nThis lack of respect for managers who has won a lot for the club is exactly why Zidane left. The board seems to take success for granted, failing to recognize that maintaining dominance requires consistent investment and trust in the manager’s vision. While players like Vazquez and Ceballos are valuable squad members, they’re not at the same level as Carvajal or Kroos. Expecting the team to perform at the highest level without addressing these gaps is unrealistic and unfair to both the manager and the players.\n\n",
        "upvotes": 109,
        "comments": 75,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifpuwl/the_board_and_not_carlo_ancelotti_is_responsible/"
    },
    {
        "id": "1ifydxj",
        "author": "kurumi-2508",
        "title": "Real madrid defence crisis",
        "content": "As we saw yesterday, Rüdiger got injured (bicep femoris) during the game which led us to defence crisis. \n\nOur team now has barely 2-3 proper defenders like alaba (just returned from the injury), Asencio (doing exceptional but is being benched) and Fran garcia (our only proper LB). \n\nWith the transfer window still open, the board can still buy a defender or get a defender on loan as Rüdiger is set to miss the Madrid derby and both the knockouts against city. \n\nA change in formation is required as we are always sticking to the 4-3-3 attacking or 4-2-3-1.\n\nI want to you guys to share your opinion on this and maybe find a solution.\n\n",
        "upvotes": 12,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifydxj/real_madrid_defence_crisis/"
    },
    {
        "id": "1ificz8",
        "author": "loadedhunter3003",
        "title": "How are you hating Vini for one not even that bad game where he was trying to make something when no one else was?",
        "content": "This is the most entitled fanbase I've seen cuz jesus christ, the number of games Vini has delivered and bailed us out there is no way people are asking to sell him to Saudi rn just cuz Rodrygo and Mbappe have suddenly found their form for the last few games. Same with Ancelotti out takes, I'm sorry but we have still won 2 ucls in 3 years under him, suffice to say I wanna give him another year and if he doesn't win both this year and next year then cool maybe it is time to let go. Plus Vini wasn't even bad today, he had some good dribbles and chances today, just couldn't get the finishing right. Whenever someone has successful dribbles such as Rodrygo today and Vini against Bayern last year, the fans praise them and say they are keeping true football alive when it is dying and yet as soon as they have one half bad game where they lose the ball a few times, the entire fanbase is ready to ship them off to another country. I can't.",
        "upvotes": 208,
        "comments": 136,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ificz8/how_are_you_hating_vini_for_one_not_even_that_bad/"
    }
]