[
    {
        "id": "1isoscl",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Wednesday 2/19 at 2:00 PM ET for an AMA/Q&amp;A with Simon West, director of 'Con Air', 'Lara Croft Tomb Raider', 'The Expendables 2', 'Old Guy', 'The Mechanic', Rick Astley's Never Gonna Give You Up music video, and more.",
        "content": "",
        "upvotes": 59,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/78nj1bznyyje1.png?auto=webp&amp;s=7b87fb8c9de12f5166c1550bb9715531a9f10fee"
        },
        "permalink": "/r/movies/comments/1isoscl/join_us_tomorrow_wednesday_219_at_200_pm_et_for/"
    },
    {
        "id": "1isqhrs",
        "author": "SanderSo47",
        "title": "February 14-17 Box Office Recap: 'Captain America: Brave New World' opens with almost $200 million worldwide, but poor word of mouth (\"B–\" on CinemaScore) suggests it will fall off quickly. Meanwhile, 'Ne Zha 2' passes 'Inside Out 2' to become the biggest animated film ever.",
        "content": "https://preview.redd.it/w0x4cvb8ezje1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=fa747c18c7aa51c3a31e2c98d37ffd334591251b\n\nWell, it could've been worse.\n\nUnsurprisingly, ***Captain America: Brave New World*** easily topped the box office with almost $200 million worldwide, even though its long-term prospects aren't looking good. ***Paddington in Peru*** also made its debut in the States, delivering a very solid debut.\n\nThe Chinese film ***Ne Zha 2*** also debuted in the States, delivering the best numbers for a Chinese film in 20 years. But the bigger story was in its home country; with $1.7 billion in the bank, the film has officially passed ***Inside Out 2*** to become the biggest animated film worldwide.\n\nThe Top 10 earned a combined $165.4 million this weekend. That's up a colossal 100% from last year, when ***Bob Marley: One Love*** got high, and ***Madame Web*** hit rock bottom.\n\nDebuting at #1, ***Captain America: Brave New World*** earned $89.8 million ($101 million four-day) in 4,105 theaters. Those numbers are obviously below ***Civil War*** ($179.1 million), but they're also below ***Winter Soldier*** ($95 million) despite 11 years of inflation. They're also below ***Quantumania*** ($106.1 million), which also opened on this date two years ago.\n\nGenerally speaking, this is an okay (but not great) debut. Having Anthony Mackie take the mantle of Captain America was always going to be tricky, so a decrease from the past two films was expected. And hey, it worked; if the audience wasn't interested, the film wouldn't have opened to over $80 million. \n\nTo boost the film, Marvel decided to add Red Hulk to the mix and casting Harrison Ford (replacing the late William Hurt). The whole marketing relied on selling both Sam Wilson and Red Hulk; even before a first trailer came out, McDonald's already spoiled Red Hulk's appearance in their menus back in March 2024. Despite that incident, it built awareness for the film, and got people to give the film a chance.\n\nAccording to Disney, 62% of the audience was male, and 49% was in the 18-34 demographic. Ford's presence clearly had an impact; 42% of the audience was 35 and over. It made this debut, despite scoring a very weak 50% on RT. It speaks volumes to Marvel's power that a film with mediocre response can open this high, but perhaps it's not a sign for its long-term prospects.\n\nSo why is this debut not considered great? Basically, it all comes down to the reception. Critics aren't fond of the film, but the audience even less so. Audiences gave ***Brave New World*** a poor \"B–\" on CinemaScore. That's not only the worst grade for an MCU film (even ***The Marvels*** and ***Quantumania*** got a \"B\"), but it's also below any DCEU film. That points to very poor word of mouth. Not surprising, considering the film relies on how much the average moviegoer remembers ***The Falcon and the Winter Soldier*** (if they ever watched it in the first place), and the fact that its centerpiece (Red Hulk) is far less than the marketing suggests.\n\nSo what's it gonna happen now? The one advantage is that competition is quite weak for the rest of the month, but the MCU has proven to be front-loaded. ***Black Panther: Wakanda Forever*** topped the box office for 5 weeks, had strong word of mouth and very weak competition, and it still finished with just a 2.50x multiplier. A proper comp should be ***Quantumania***, given that it had similar reception and opened on the same date. That had poor legs (2.02x multiplier), which would give ***Brave New World*** a $181 million domestic run. We'll see with that second weekend drop.\n\n***Paddington in Peru*** debuted with $12.7 million this weekend ($16 million four-day). That's still below the original's $18.9 million debut, but above the second film's $11 million.\n\nIt's hard to ask for better numbers here. The ***Paddington*** franchise has always been an international-heavy one (this film has already made $100 million overseas). Just look at the pattern; America represented just 30.5% of the first film's global run, and the second just 17.0%. Not to mention that this franchise is now 10 years old. So by this point, either you're in or just don't care.\n\nAccording to Sony, 52% of the audience was male and despite being marketed towards families, 32% of the audience was 25-34 (its biggest demo). They gave it a strong \"A\" on CinemaScore, which is the same grade as the previous films. With an empty corridor for family films, this should hold well. For now, a $50 million domestic total is likely for ***Paddington in Peru***.\n\nBoosted by its holiday and theme, ***Heart Eyes*** increased 19%, adding $9.8 million ($10.7 million four-day). That's one of the best holds for a wide release, but as mentioned, the holiday surely helped. The film has earned $22.4 million so far, and it should hit $30 million, even though its third weekend might see a larger-than-expected drop.\n\nIn fourth place, ***Dog Man*** eased 29% for a $9.7 million weekend ($13.3 million four-day). That's a recovery from its steep drop last week, although the holiday clearly boosted the weekend. For example, its Saturday was off a rough 49% from past Saturday. The film has amassed $70.4 million, but it's still up in the air if it will hit $100 million.\n\n***Ne Zha 2*** debuted in 660 theaters, where it over-performed projections with $7.2 million ($8.3 million four-day). This is the biggest debut for a Chinese film in North America since ***Hero*** ($17 million) back in 2004. Depending on how long it stays in wide release, it could have a healthy long run. But needless to say, it's not like it needs America to be a success anyway.\n\n***Mufasa*** continues showing legs. The film increased 6%, grossing $2.4 million this weekend. That takes its domestic total to $240.8 million.\n\nIn seventh place, ***Love Hurts*** was helped by Valentine's Day. It eased 28%, adding $4.1 million this weekend ($4.7 million four-day). The film has earned a meager $12.1 million, and with the holiday over, it's set to drop like a rock.\n\nSony's ***One of Them Days*** also increased this weekend. It jumped 4%, adding $2.9 million this weekend ($3.3 million four-day). The film has amassed $43.9 million, and it's gonna finish with close to $50 domestically, which is damn great for an R-rated comedy.\n\n***Companion*** is nearing the end of its run. After its second weekend drop, the film lost 2,223 theaters this weekend. Nevertheless, it still dipped 39%, adding $1.8 million this weekend ($2 million four-day). The film has earned $19 million domestically, and with the holiday over, it's set for another heavy drop next weekend.\n\nRounding up the Top 10 was the Indian film ***Chhaava***, which made $1.7 million ($2.1 million four-day) in 497 theaters.\n\nSony expanded ***Becoming Led Zeppelin*** into 1,039 theaters, although its wide release wasn't as strong as its exclusive IMAX run. It dipped 32%, adding $1.7 million this weekend.\n\n#**OVERSEAS**\n\n***Captain America: Brave New World*** was also the biggest film overseas. It debuted with $92.4 million, for a $193.4 million worldwide debut, although the overseas number is below the forecasts. The biggest debuts were in China ($10.5M), UK ($8.5M), Mexico ($6.6M), Korea ($5.6M) and France ($4.7M). Right now, all eyes are on the second weekend, for it will determine if the film can break even.\n\nWell, ***Ne Zha 2*** has made history. With $1.68 billion worldwide (basically just China), the film has passed ***Inside Out 2*** to become the highest animated film ever. You know what's crazier? Maoyan is projecting the film to end with $2.16 billion in China, which, if it gets there, would make it the No. 5 movie ever globally. Fascinating.\n\n***Bridget Jones: Mad About the Boy*** also made its global debut (unless you live in North America, where it was dumped on Peacock). The film debuted with $35.5 million in 70 markets, which is the biggest in the franchise. In the UK, it debuted with $14.2 million, which is a record for a rom-com. Other strong debuts were in Australia ($3.4M), Poland ($2.2M), Netherlands ($1.9M), and Spain ($1M). It will continue adding a few more markets, but you can take for certain that this is gonna be another profitable entry in the franchise.\n\n***Paddington in Peru*** added $7.3 million this weekend, and its worldwide total is now $131.8 million. The film still has Korea, Italy, Spain and Japan left. \n\nTwo Oscar contenders are hitting milestones. Both ***A Complete Unknown*** and ***Conclave*** have officially hit $100 million worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Kraven the Hunter* | Dec/13 | Sony | $11,001,109 | $25,026,310 | $61,987,172 | $110M\n\n- ***Kraven the Hunter*** has ended its run with a pathetic $61.9 million worldwide, far below its $110 million budget. Despite some promise that J.C. Chandor's presence could elevate the film, the film actually had the worst word-of-mouth of any of Sony's desperate attempts to build a Spider-Man universe, that somehow lacks Spider-Man himself. Even with the holidays, it crashed and died very quickly. RIP Spider-Manless Spider-Man Universe. You won't be missed. \n\n#**THIS WEEKEND**\n\nEven with ***Brave New World*** heading towards a steep drop, it doesn't have much competition for the top spot barring a last-minute surge.\n\nThe biggest release is Neon's new horror film ***The Monkey***, the latest film from Osgood Perkins. Perkins struck gold with ***Longlegs*** back in the summer, and Neon is mounting a very efficient marketing campaign. With some weak titles so far, perhaps this could be the year's first breakout horror.\n\nThere's another smaller release, and that is ***The Unbreakable Boy***, which stars... Zachary Levi. Considering he's coming off a huge losing streak, it's unlikely this can change things up.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 171,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_TL8xRNknrTcDQIy4LG6EWmdVuOto6LKtiO8B615J-o.png?auto=webp&amp;s=58ce24853b35548b5af8b0910a05ca6e3efbc0da"
        },
        "permalink": "/r/movies/comments/1isqhrs/february_1417_box_office_recap_captain_america/"
    },
    {
        "id": "1ishmwk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Bong Joon-Ho's 'Mickey 17'",
        "content": "",
        "upvotes": 3803,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mujv35p7jxje1.jpeg?auto=webp&amp;s=448f80076e3dd1177825e15e7b8d883d24399309"
        },
        "permalink": "/r/movies/comments/1ishmwk/new_poster_for_bong_joonhos_mickey_17/"
    },
    {
        "id": "1iscomv",
        "author": "whitemilkythighs",
        "title": "Chinese film Ne Zha 2 beats Inside Out 2 ($1.699 Billion) and becomes highest-grossing animated film of all time globally",
        "content": "",
        "upvotes": 8420,
        "comments": 1098,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TuWtLF2KJGQ6TLMMz9UZaJQwnGyOI5sajBJbhmQswig.jpg?auto=webp&amp;s=e23207a81fd2df0fe105a59169921727f65e8718"
        },
        "permalink": "/r/movies/comments/1iscomv/chinese_film_ne_zha_2_beats_inside_out_2_1699/"
    },
    {
        "id": "1isuv1r",
        "author": "OverHeat6321",
        "title": "What’s with the ketchup bottle twist in Goodfellas?",
        "content": "After they halfway kill Billy Bats, the crew stops off to pick up some supplies to bury him. During dinner with Tommy's mother at 2am, Jimmy twists a glass ketchup bottle on his meal. If I ever see these actual glass bottles at the store I'd get one and try it to see what happens. There's so many stories behind this masterpiece of a movie. There has to be a story about this. ",
        "upvotes": 491,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1isuv1r/whats_with_the_ketchup_bottle_twist_in_goodfellas/"
    },
    {
        "id": "1ish4ps",
        "author": "NoCulture3505",
        "title": "First Poster for 'Freaky Tales'",
        "content": "",
        "upvotes": 2377,
        "comments": 401,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rr9yreznfxje1.jpeg?auto=webp&amp;s=a918b2a2ce8de35c29d6dc515e988b4a4fc190b0"
        },
        "permalink": "/r/movies/comments/1ish4ps/first_poster_for_freaky_tales/"
    },
    {
        "id": "1issb7e",
        "author": "MarvelsGrantMan136",
        "title": "UFO Conspiracy Thriller From Joseph Kosinski, Jerry Bruckheimer Ignites Bidding War",
        "content": "",
        "upvotes": 381,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SEiTxesYyT5_osOrSmV5ITZ_Nc_Ub4cr3u_tRu-WXzo.jpg?auto=webp&amp;s=5add0b919a75327c8fb3c9ab0768c25682e6cb46"
        },
        "permalink": "/r/movies/comments/1issb7e/ufo_conspiracy_thriller_from_joseph_kosinski/"
    },
    {
        "id": "1isi34l",
        "author": "KillerCroc1234567",
        "title": "Mickey 17 - IMAX Poster",
        "content": "",
        "upvotes": 1397,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g1yvcyhemxje1.jpeg?auto=webp&amp;s=24207caef2721e7b6fc95708e0d99c7955e795f0"
        },
        "permalink": "/r/movies/comments/1isi34l/mickey_17_imax_poster/"
    },
    {
        "id": "1iso0ki",
        "author": "Psykpatient",
        "title": "Troy - Achilles vs Hector, original audio",
        "content": "",
        "upvotes": 589,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AUZ8ytkMnWDSeoQ_X32Q8P890w7YQkWbQRL-p1ImngU.jpg?auto=webp&amp;s=9f37c7e1dda192d25290ba1d6426f30366655590"
        },
        "permalink": "/r/movies/comments/1iso0ki/troy_achilles_vs_hector_original_audio/"
    },
    {
        "id": "1ishoy7",
        "author": "pineconeconspiracy",
        "title": "What are some of the lamest \"I'm a badass\" lines in cinema?",
        "content": "There are plenty of great ones - \"Do you feel lucky?\", \"Chew bubblegum.\" I want the worst. Lame, bland, cliche-ridden clunkers. A couple I can think of off the top of my head are Batman responding the Bane with \"I came here to stop you!\" Anything by Steven Segal. Most lines from Boba Fett in Boba Fett (I think at one point he even says \"I'm am the crime lord!\")",
        "upvotes": 1200,
        "comments": 1499,
        "media": null,
        "permalink": "/r/movies/comments/1ishoy7/what_are_some_of_the_lamest_im_a_badass_lines_in/"
    },
    {
        "id": "1isnft9",
        "author": "ChiefLeef22",
        "title": "Richard Linklater’s ‘Blue Moon’ Lights Up Berlin as Crowd Goes Wild for Ethan Hawke’s Unrecognizable Transformation Into Lorenz Hart",
        "content": "",
        "upvotes": 482,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JyYixw5I3nlpWn0GcTY9zNDG0tKX2R_onm3HBTUNCH8.jpg?auto=webp&amp;s=d7cfc0318fda045fbbed147fb605690db54fd8c3"
        },
        "permalink": "/r/movies/comments/1isnft9/richard_linklaters_blue_moon_lights_up_berlin_as/"
    },
    {
        "id": "1isjaj4",
        "author": "LirSkle",
        "title": "Freaky Tales (2025) Official Trailer - Pedro Pascal, Ben Mendelsohn, Jay Ellis, Normani",
        "content": "",
        "upvotes": 710,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GrpONB07VCZZWjcQJwf-JaZReZOm8JT3fOknyAm18RM.jpg?auto=webp&amp;s=7dbece4479ca78c086dbefe0384614625a60c881"
        },
        "permalink": "/r/movies/comments/1isjaj4/freaky_tales_2025_official_trailer_pedro_pascal/"
    },
    {
        "id": "1isj0a3",
        "author": "MarvelsGrantMan136",
        "title": "Steven Spielberg’s New Film Moves to June 2026, Daniels’ ‘Everything Everywhere’ Follow-Up Removed From Calendar",
        "content": "",
        "upvotes": 633,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HtnRlUH6k-YK6ec62ya4CUKypVMgVtkgOQJv2x7PNP8.jpg?auto=webp&amp;s=86f513ecada93b74aa0d9839bdc5f8698c814f6f"
        },
        "permalink": "/r/movies/comments/1isj0a3/steven_spielbergs_new_film_moves_to_june_2026/"
    },
    {
        "id": "1isz0k3",
        "author": "NChSh",
        "title": "\"Blue Streak\" is the perfect action movie to utilize a comedy star",
        "content": "If you look at the reviews for Martin Lawrence &amp; Luke Wilson's [Blue Streak](https://www.rottentomatoes.com/m/blue_streak), you will see a lot of bad critic reviews and pretty good but not amazing audience reviews.  It appears to be just a regular action/comedy.  I mean Martin's gotten some big success with the Bad Boys franchise, but most of what he does doesn't exactly have broad appeal.  From afar, this movie again seems like just some generic TNT at 3 pm movie.\n\nThe thing though is that it takes [Saves the Cat](https://www.amazon.com/Save-Last-Book-Screenwriting-Youll/dp/1932907009) to the absolute extreme.  Basically, the idea is you have your hero literally save a cat so that the audience likes them more for doing a heroic/cool act.  This movie's formula is a constant string of Saves the Cat scenes but they use Martin's comedy to carry each scene.  Like it has him in a heist where he's an expert safe cracker, then to a bizarre [pizza man](https://www.imdb.com/title/tt0181316/mediaviewer/rm475174912/?ref_=tt_ph_1_1) alias, to pretending to be a cop and pick pocketing Luke Wilson, to talking his way onto the police force, to finding a bunch of stolen hubcaps, to disarming Dave Chapelle as as a criminal in back-to-back-to-back scenes.  He's just an incredibly charismatic guy pulling off things in incredible ways.  You take the basic idea of a scene and then just let Martin freelance.  The \"stolen hubcaps\" scene is also a Chekhov's gun!\n\nI think that this is **the** blueprint for approaching an action movie where you have a comic star.  Just set them up to \"Save the Cat\" or do something bad ass over and over and over again and just let them cook.  Like shouldn't Martin be getting a salary or something?  The answer is who cares!  It takes away from the pacing.  They kind of address it...but not really.  I'd rather have him solving crimes every three minutes in imaginative ways instead of giving that kind of backstory.\n\nAlso having an almost A list actor in Luke Wilson act as straight man is no small part to the success of this movie.  I have to imagine he loved filming it too.  Anyway I recommend the living shit out of this movie, it's awesome",
        "upvotes": 58,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zuBZR2_ftRU4Eb7JxBpZd2sO_euyzcsiNHTOF-RS3GE.jpg?auto=webp&amp;s=569f87bb7c3f635294ac5ccdbcb7fdc593950708"
        },
        "permalink": "/r/movies/comments/1isz0k3/blue_streak_is_the_perfect_action_movie_to/"
    },
    {
        "id": "1iss7vx",
        "author": "Okilokijoki",
        "title": "North America and Oceania release poster for Nezha 2",
        "content": "",
        "upvotes": 166,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4gr120lorzje1.jpeg?auto=webp&amp;s=d898c0fa87bb9c323247bf58dfba0212270fffe5"
        },
        "permalink": "/r/movies/comments/1iss7vx/north_america_and_oceania_release_poster_for/"
    },
    {
        "id": "1isj7sl",
        "author": "Aside_Dish",
        "title": "What's a critically panned movie you stand by?",
        "content": "For me, it's The Rocker. Great cast, funny jokes, absurd, yet a great character arc all the same. Even has Pete Best in it (who inspired the story).\n\nSee this movie torn to shreds all the time, and personally, I don't get it. I think it's amazing, and can watch it over and over again!\n\nWhat about you guys?",
        "upvotes": 534,
        "comments": 1987,
        "media": null,
        "permalink": "/r/movies/comments/1isj7sl/whats_a_critically_panned_movie_you_stand_by/"
    },
    {
        "id": "1is7eib",
        "author": "Antoshi",
        "title": "'The Brutalist' Director Brady Corbet Says He Made No Money From the Film",
        "content": "",
        "upvotes": 2465,
        "comments": 354,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8WxJXQZ5KN6OZTjKmHYdTUJ1hdTDDdfcprwmxPOskGw.jpg?auto=webp&amp;s=909cd704a62466f5c5d48de2e33d14504bd8e560"
        },
        "permalink": "/r/movies/comments/1is7eib/the_brutalist_director_brady_corbet_says_he_made/"
    },
    {
        "id": "1ishz60",
        "author": "NoCulture3505",
        "title": "Chris Pine to Lead Texas Crime Thriller ‘Nowhere Fast’ From ‘Fargo’ Creator Noah Hawley; 30West, CAA, AGC Selling",
        "content": "",
        "upvotes": 407,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nW4xwLo3dLTztkw1r23iHJ0fWIkureZg7J9HfeT1VDg.jpg?auto=webp&amp;s=7b3ef835afb34a859e2a1c2631d1df86a45a67ea"
        },
        "permalink": "/r/movies/comments/1ishz60/chris_pine_to_lead_texas_crime_thriller_nowhere/"
    },
    {
        "id": "1iszgqg",
        "author": "Top_Cranberry_3254",
        "title": "Road House has turned into a must watch classic for me",
        "content": "Never thought the day would come when the \"so bad it's good\" Road House would become a must watch classic for me every time it's on, almost up there with Goodfellas and Jaws, but here I am.\n\nDespite all its flaws, I just can't change the channel any time I see it on the listing of movies on. I've seen it three times within the last week and doubt I'd not watch it if it happens to be on.\n\nOnly bona fide great films usually get to this level for me. Yet, here is Road House. I'm starting to question whether this is actually a great movie if it's that rewatchable. It's just so much FUN and has so many scenes that you look forward to watching. Is it time to lock Road House in as a legit 8/10 classic and override its poor reviews from when it came out once and for all?",
        "upvotes": 22,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1iszgqg/road_house_has_turned_into_a_must_watch_classic/"
    },
    {
        "id": "1isia3g",
        "author": "A_Lazko",
        "title": "Jack Palance, Oscar-winning Ukrainian-American cowboy was born Feb. 18, 1919",
        "content": "",
        "upvotes": 209,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/twLYMjmVKrxHVEPc8OJABs2Umy8AS0Fve97hDZetxP0.jpg?auto=webp&amp;s=31f23336036e3ade4d7a8278867cd2302cab8a84"
        },
        "permalink": "/r/movies/comments/1isia3g/jack_palance_oscarwinning_ukrainianamerican/"
    },
    {
        "id": "1isgwq3",
        "author": "KillerCroc1234567",
        "title": "‘Carry On’ Actor Julian Holloway Dies at 80 After Brief Illness",
        "content": "",
        "upvotes": 231,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0N47HBGZNeiV9ciLgVMo6l65_b6UVPnVKQRPLyDZ3kY.jpg?auto=webp&amp;s=d5861a827356b69063900885404a0b2f15190972"
        },
        "permalink": "/r/movies/comments/1isgwq3/carry_on_actor_julian_holloway_dies_at_80_after/"
    },
    {
        "id": "1iseztr",
        "author": "jimmyhoffasbrother",
        "title": "The Substance director Coralie Fargeat’s homemade Star Wars film from 1993 was posted in full on YouTube",
        "content": "",
        "upvotes": 230,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MP0QnPgAkUzwWuJU5fycazhgYZioqKSgYWoLlHUISTo.jpg?auto=webp&amp;s=d1b75c343fd85515685e8b80efc83edef12e3396"
        },
        "permalink": "/r/movies/comments/1iseztr/the_substance_director_coralie_fargeats_homemade/"
    },
    {
        "id": "1isdxas",
        "author": "Sisiwakanamaru",
        "title": "Steven He Leading Cast In Martial Arts Comedy ‘Kung Fu Deadly’, Filming Underway In Ireland",
        "content": "You may know him as \"Emotional Damage\" guy.",
        "upvotes": 248,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KOQKRw5bMCTS7Lkj-58GmMHEB214TvdPh3DTXKQqqOY.jpg?auto=webp&amp;s=dcc16e98ba3b6b976192630f67555c44771f4a09"
        },
        "permalink": "/r/movies/comments/1isdxas/steven_he_leading_cast_in_martial_arts_comedy/"
    },
    {
        "id": "1islezc",
        "author": "LilNello1",
        "title": "The Day The Earth Blew Up: A Looney Tunes Movie",
        "content": "",
        "upvotes": 95,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VJmrkm5G2nvGpoNz9sGyKRs2xzOQP-GJ3PthnBf4CRk.jpg?auto=webp&amp;s=f9cf2703adfb9daff63c12f3cbbbdc988c7f08ac"
        },
        "permalink": "/r/movies/comments/1islezc/the_day_the_earth_blew_up_a_looney_tunes_movie/"
    },
    {
        "id": "1is8zqk",
        "author": "SkintElvis",
        "title": "What are the most realistic fight scenes in movies?",
        "content": "What is the most realistic fight scene in a movie.  I’m not a fan of over choreographed fight scenes. Outside of the boxing ring most fights are a mess of flailing arms and missed swings.  My favorite from recent years is The Killer (2023) just raw and brutal. The stairwell fight in Saving Private Ryan (1998) also deserves a mention.  ",
        "upvotes": 607,
        "comments": 695,
        "media": null,
        "permalink": "/r/movies/comments/1is8zqk/what_are_the_most_realistic_fight_scenes_in_movies/"
    },
    {
        "id": "1irneiq",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Matt Damon as Odysseus in Christopher Nolan's 'The Odyssey'",
        "content": "",
        "upvotes": 60930,
        "comments": 4177,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ezcasqic4qje1.jpeg?auto=webp&amp;s=f138c9878c563cff6983c25f4b661296b44aa842"
        },
        "permalink": "/r/movies/comments/1irneiq/first_image_of_matt_damon_as_odysseus_in/"
    },
    {
        "id": "1isjexn",
        "author": "indiewire",
        "title": "Guillermo del Toro’s Favorite Movies: 56 Films the Director Wants You to See",
        "content": "",
        "upvotes": 97,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RPLIk4xi5LLw91mEVHtHSPIAzQ1bux5FwTAjbmaWINE.jpg?auto=webp&amp;s=0a9aaf67f009c6fab8ccd80188352e5bc414caf3"
        },
        "permalink": "/r/movies/comments/1isjexn/guillermo_del_toros_favorite_movies_56_films_the/"
    },
    {
        "id": "1isxsfa",
        "author": "randomvegasposts",
        "title": "What are your favorite scenes of all time?",
        "content": "I have a roaming top 10. \n\nIn no particular order:\n\nOpening - Inglorious Basterds -\nI could have done more - Schindlers List -\nBrick killed a guy - Anchorman -\nTiny dancer - Almost Famous -\nShallow - A Star is Born -\nEar - Reservoir Dogs -\nI know it was you - Godfather 2 -\nI drink your milkshake - There Will Be Blood -\nCoin flip - No Country For Old Men -\nI'm staying,  I'm finishing my coffee - Lebowski -\n\nWhat are your favorites? \n(Also feel free to disparage mine) \n\nI'm also typing right now because my last post got removed for not having 500 characters.  So I'm typing.  Typing.  I hope this is enough.  La la la.  \n\nRaindrops on roses and whiskers on kittens.... \n\nAre we at 500 yet? \n",
        "upvotes": 12,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1isxsfa/what_are_your_favorite_scenes_of_all_time/"
    },
    {
        "id": "1it0nus",
        "author": "momskillet",
        "title": "Anonymous Oscar Ballots as Voting Is Officially Closed: From ‘I Despised “The Substance”‘ to ‘Why is “Dune” Losing Best Picture?’",
        "content": "",
        "upvotes": 8,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bDmrMj1YPqcF6Ylpl8zFxwoybCBrcLrCQqeiCXSEj-g.jpg?auto=webp&amp;s=97128d732eadc4a3e8bc6fa22e4e9c4d222a74f0"
        },
        "permalink": "/r/movies/comments/1it0nus/anonymous_oscar_ballots_as_voting_is_officially/"
    },
    {
        "id": "1iso9ks",
        "author": "zerocool4406",
        "title": "What was the one movie you wanted to like, but were left disappointed by?",
        "content": "For me, it was Terminator 3. Both 1 and 2 are some of my favourite movies of all time, so when it came to going to the fully sold out cinema to watch it, my excitement was insatiable. But I left disappointed. Arnold was a bit too old for it. The \"jokes\" were cringe (talk to the hand - ugh). The characters flat, not likeable. The action scenes were good enough, but ultimately it didn't do it for me. Do you have any film that you wanted to like, but didn't? ",
        "upvotes": 44,
        "comments": 386,
        "media": null,
        "permalink": "/r/movies/comments/1iso9ks/what_was_the_one_movie_you_wanted_to_like_but/"
    },
    {
        "id": "1ishdvw",
        "author": "Itchy_Training_88",
        "title": "A moment of movie perfection, final showdown in The Good, the Bad, and The Ugly. So much story telling with very little dialogue and no over reliance on special effects. I miss this with today's movies.",
        "content": "",
        "upvotes": 102,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Tqv9YhXne9TqyhFp5TpvQbEPROWzKs1BinDuwQSOe3k.jpg?auto=webp&amp;s=2fbd523577609e5f57cc94016960fdcf6e20a85c"
        },
        "permalink": "/r/movies/comments/1ishdvw/a_moment_of_movie_perfection_final_showdown_in/"
    },
    {
        "id": "1isg5nb",
        "author": "Minute-Necessary2393",
        "title": "Paddington 2 is delightfully weird and charming and I love it.",
        "content": "Just finished watching *Paddington 2* and let me just say, I never thought the sequel being about Paddington trying to save up money to get a pop-up book for his aunt only to get caught up in a conspiracy involving said book being the key to a hidden circus performers treasure that gets him framed and in prison while his adopted family tries to uncover said conspiracy and who framed Paddington to clear his name while Paddington touches the hearts of all the inmates and guards at the prison that ends with Paddingtons aunt coming to visit in an extremely heartfelt ending and everyone getting a happy ending inlcuding even the villain was definitely NOT something on my bingo card...but in this case that's a good thing. Lol.\n\nFor real though, Paddington 2 is not only one of the best sequels of all time, but also one of the best films of all time (period) and now tied with Spider-verse as my favorite movie of 2018, and I mean it. \n\nPaul Kings directing and writing is top notch as always, being able to balance multiple tons while still making you feel warm and fuzzy instead, the characters are still beautifully and wonderfully written and very charming and likable, especially Paddington, his earnestness, honesty, and hopefully optimism shines through ten fold here, and while it has a lot of funny moments, the emotional/dramatic moments of the film land hard, like seriously, the ending had me crying.\n\nNot much else to say (that hasn't been already said) other then, i can't wait to see Paddington 3, and Hugh Grant and Brenden Gleeson are easily the best parts of the movie.",
        "upvotes": 92,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1isg5nb/paddington_2_is_delightfully_weird_and_charming/"
    }
]