[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kgojl3",
        "author": "Kagamid",
        "title": "Cassandra is actually very sad on the second watch",
        "content": "Cassandra was an interesting story that I couldn't help but wonder what happened next. By the time we get to the end, we get that bitter sweet ending. But I was curious on what I missed on the first watch knowing what I know now. I found that the story is actually very sad when you watch it a second time. It lets you see everything from Cassandra's perspective. In the past, the last thing that happens is Cassandra watches her son die and shorts out. Her daughter then starves to death in the room and 50 years past. When she wakes up, she first assumes the boy is Peter. She is obviously very hopeful that her last memory was wrong. But then she notices that it's not Peter and a new family is in her house. What's the first thing she does? She goes to the master bedroom and enters the closet to check on her daughter. You can see when she enters the room and when the wife looks, you can see the closet door close with no one else around. Cassandra went into the secret room. Now at this time the rest of the house starts coming on with an expressionless Cassandra. I believe at this point, the robot is mourning her daughter and losing her mind. You next see Cassandra standing by the pool where I believe she's thinking about killing herself and wondering if she can just fall in and end it. But then she sees the mouse and that's when you know she's gone crazy. She talks to it and runs it over. When the family wakes up, she's not acting like herself anymore. She's pretending to be a house servant for them so she can take over the family and replace the ones she lost. The rest of the story plays out as normal, but now you know where her madness comes from.\n\nI'm glad I took the time to watch it all. It was very interesting.",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kgojl3/cassandra_is_actually_very_sad_on_the_second_watch/"
    },
    {
        "id": "1kgq8t7",
        "author": "LawInside0",
        "title": "what’s your favorite series on netflix?",
        "content": "what’s your favorite series on netflix if you had to chose? its hard to chose one but i think my all time favorite would be orange is the new black. i love it. what about you? what is your favorite?",
        "upvotes": 7,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1kgq8t7/whats_your_favorite_series_on_netflix/"
    },
    {
        "id": "1kfvs35",
        "author": "RGBLEDWill",
        "title": "Netflix allows children to upgrade plans.",
        "content": "Got home and saw an email from Netflix saying my account had been upgraded to the $25 4K plan. Seems one of my kids got a prompt and upgraded (from their child account). Netflix support was like, “yep, they can do that.” Wild",
        "upvotes": 484,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvs35/netflix_allows_children_to_upgrade_plans/"
    },
    {
        "id": "1kgsafn",
        "author": "Fun_Molasses5215",
        "title": "Love on the Spectrum star Abbey has had her original song nominated for an Emmy by Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kgsafn/love_on_the_spectrum_star_abbey_has_had_her/"
    },
    {
        "id": "1kgc6yt",
        "author": "anonRedd",
        "title": "Fear Street: Prom Queen - streaming May 23!",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc6yt/fear_street_prom_queen_streaming_may_23/"
    },
    {
        "id": "1kgrif5",
        "author": "Gottaloveegos",
        "title": "Browser Login?",
        "content": "At work i used to be able to log into Netflix no problem up until a couple of months ago. Now any time i try to login (with correct email and pw), I get an error message that says \"Sorry, we are unable to complete that action now. Please try again later.\" Anyone know wtf or have a solution? Have tried several browsers, and no, i cant use the windows app as my work computer doesn't allow downloads of apps.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kgrif5/browser_login/"
    },
    {
        "id": "1kg37rw",
        "author": "Sweaty-Toe-6211",
        "title": "Rian Johnson: I Want Netflix to Put ‘Knives Out 3’ in ‘as Many Theaters for as Long as Possible’",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kg37rw/rian_johnson_i_want_netflix_to_put_knives_out_3/"
    },
    {
        "id": "1kgjsdu",
        "author": "-cherhorowitz-",
        "title": "Plan Changes Update?",
        "content": "When Netflix made the plan changes I opted out because the jump was crazy. There isn't enough content to make it worth it, and the way they went about it was a horrific user experience. \n\nI looked back at it today just to see, and the prices are just offensive for the amount of content they provide. I'm definitely not watching ads.\n\nHowever I'm curious how this has affected their market share and how many users they lost? I know they want ad users but was this an overall win for them?\n\nI haven't been paying much attention, but I was wondering what people think in this sub now that the new plans have been out for a while.\n\nI kinda miss my comfort show but not for $25 a month when every other platform is less with better content. \n\nThoughts? ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kgjsdu/plan_changes_update/"
    },
    {
        "id": "1kgcdmd",
        "author": "a_harkness666",
        "title": "netflix show recs please?",
        "content": "does anyone know some shows on netflix that dont have a boring beginning, but instead makes you interested from the 1st ep? i have a bad habit of putting shows down bc the first 3-4 eps are so boring. some shows that ive seen and loved: 3 body problem, you, cassandra, locke and key, sandman, ratched, umbrella academy, all of us are dead etc.",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kgcdmd/netflix_show_recs_please/"
    },
    {
        "id": "1kfzyg7",
        "author": "YankeeEchoTango1921",
        "title": "Did I just goof up or did netflix screw me?",
        "content": "I heard about Black Mirror, so I gave it a shot the other night.  Normally, when you start new shows, Netflix  starts the show at the very beginning at S1E1. However, unbeknownst to me, when  I hit play to start the \"NEW\" show, it started on \nS7E6 Common People. By the time I realized I was on S7E4 Hotel Reverie.\n\nDoes it matter, or should I go back to S1E1 and start over? \n",
        "upvotes": 34,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1kfzyg7/did_i_just_goof_up_or_did_netflix_screw_me/"
    },
    {
        "id": "1kg6zmu",
        "author": "MysteriousDelay6266",
        "title": "Dept. Q | Official Trailer | Netflix | MAY 29",
        "content": "# DEPT. Q\n\nFrom the writer and director of The Queen's Gambit, Matthew Goode stars as DCI Carl Morck - a brash, but brilliant detective leading a cold case unit in Edinburgh. DEPT. Q, a nine-part crime procedural series, coming **May 29th**.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kg6zmu/dept_q_official_trailer_netflix_may_29/"
    },
    {
        "id": "1kg2e28",
        "author": "Last_Ad1873",
        "title": "We bought a Torino to honor my best friend's late father. Months later, it was featured in \"The Eternauta\"",
        "content": "In December 2024, one of my best friends (Facu) lost his father, Roberto. Facu and I have always shared a deep passion for cars. After his father passed away, Facu told me he wanted to buy a Torino to restore—his dad had owned one years ago. Of course, I thought it was a fantastic idea and encouraged him to go for it.\n\nA few days later, he sent me a couple of really beat-up listings from Marketplace, and we ended up finding this one. We’re both from Villa Ballester, but I live in Villa Devoto now (Buenos Aires, AR)—and the car happened to be just a few blocks from my place. We went to see it, and the guy selling it mentioned something about the new series, but honestly, we didn’t pay much attention at the time—we thought it was just some random detail.\n\nA few months later, though, it became a big deal. Facu got a call from the show's production team asking him to bring the car to the premiere. Some automotive outlets like Motor1 also reached out to feature it. The car is beautiful, but the story behind it is even more meaningful. I contributed a few parts from my line of work (locks).\n\nIf you're interested, you can follow the restoration process on Instagram: @theclassicgarage_arg. it's in Spanish.",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kg2e28/we_bought_a_torino_to_honor_my_best_friends_late/"
    },
    {
        "id": "1kfxzgi",
        "author": "Working-Blueberry-18",
        "title": "Why is Netflix suggesting these terrible games (desktop specifically)?",
        "content": "I understand from other posts that some of the mobile games are actually pretty good, and they don't have any in-game purchases unlike many other mobile games.\n\nHOWEVER\n\nThe desktop (browser) game selection is extremely limited. I'm just seeing 14 games? They're all really horrible, and seem to be intended for a much younger audience (what made Netflix think I'd enjoy these based on my viewing history?). \n\nOne of the games was literally intended to help very young readers. Each level consists of walking on top of the text for a 1\\~3 sentences story, and interacting with a few of the words along the way.\n\nMost of what I tried (5-6) all seemed like something a 3rd year computer science student did for a project-class over a quarter. They're taking up the second row as well as the background feature at the top. Seems like a really poor landing page experience.",
        "upvotes": 32,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1kfxzgi/why_is_netflix_suggesting_these_terrible_games/"
    },
    {
        "id": "1kgkilz",
        "author": "heavenlystar105",
        "title": "Netflix household account issues",
        "content": "Hi guys, I was posting this because I keep having issues with my household on Netflix.I made an additional account/household so that it wouldn’t keep signing my dad out since we live in two different places. So when I made his account it is completely separate from my profile. So on his account, his TV/where he lives is the household. And on my account I am the household, but ever since I did that I’ve been having nonstop issues where he keeps getting signed out of Netflix every day, and I have to help sign them back in (he’s old and bad with tech), and now it keeps signing me out of my own account even though we’re part of two different households that I pay IDK $17.99 per month for my account and then an additional $7.99 for his account. How do I fix this because at this point I don’t see the point in paying the extra money if it won’t let us have two separate households. I’ll provide pictures below of what I mean.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kgkilz/netflix_household_account_issues/"
    },
    {
        "id": "1kgqa3x",
        "author": "Maleficent-Fish-4314",
        "title": "Dark…meh",
        "content": "I heard about this show due to its high ratings amongst audiences on IMDb. I decided to give it a go. I finished the show because it’s fairly short and because i kept thinking I’ll eventually like it and understand the hype. Unfortunately, I did not.\n\nThe thing that bothered me most about the show was its tone and pacing. Every single scene is very dramatic and slow. Every single one. Very tense music, long and deep stares, slow movement, a few lines of dialogue, followed by more very intense music and even longer stares and slower movements. I kept thinking ‘holy mother of god, not every scene needs to feel like it’s the most dramatic moment of the show’. In other words, very slow pacing and not enough tonal shifts.\n\nDid anyone else feel that way?\n\nSome of the character choices were odd and unbelievable. But I won’t go into those because it’s too nitpicky.",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kgqa3x/darkmeh/"
    },
    {
        "id": "1kgj832",
        "author": "Alexander_Crowe",
        "title": "I cant download much",
        "content": "Right now i only have 8 episodes of the office downloaded, i cant download another or one from a different show\n\nIts been strangely lacking for a while, even though their own site says they allow up to 100 downloads at once. I dont have the ad version",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kgj832/i_cant_download_much/"
    },
    {
        "id": "1kfz7u7",
        "author": "TA_loveafterdivorce",
        "title": "Keep getting “you’re not part of the household”",
        "content": "I typically use my phone to watch Netflix at work. For about 2 weeks (new phone), everything was fine. Suddenly, I got the “you’re not part of the X household” notification. Since it’s my husband’s email associated with the account, I didn’t try to get a code. The next day, I logged in to Netflix while at home using the WiFi. At work, I started watching a show and everything was working. I decided to change shows and the notification popped up again. I tried logging out and logging back in. But, I still get the same thing. What can I do??",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kfz7u7/keep_getting_youre_not_part_of_the_household/"
    },
    {
        "id": "1kgfphi",
        "author": "Human-Suggestion-994",
        "title": "By mistakenly clicked devices under basic plan while making a premium account and now even payment is not going.",
        "content": "So I was trying to make a Netflix account for the first time, want to create premium package account, when the option was showed to select devices I by mistakenly clicked the devices understand I think basic plan.\n I clicked premium package and when it showed to select devices I by mistakly  clicked devices under where it was written basic package and clicked next.\n\nIt's my first time creating a Netflix account and made this mistake.  While paying it charged me for premium account and when I tried to pay the payment app shows payment unsuccessful and my account is on hold, I tried twice to  pay but for some reason it's not happening and now I realised I did this mistake too.\n \nI will try to pay again tomorrow, by clicking update payment method through email but do I have any chance to select devices again? Could the payment be unsuccessful because I selected package and devices wrong?\n\nI'm really confused and don't know what to do.\n\n Is there some other subscription to create premium account and not directly? Any guidance is appreciated. Thanks in advance!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kgfphi/by_mistakenly_clicked_devices_under_basic_plan/"
    },
    {
        "id": "1kfomrn",
        "author": "Upstairs_Hat_9131",
        "title": "Turning Point: the Vietnam War",
        "content": "Has anyone else watched this? I just watched the first episode And Im amazed at how little I learned about it in school.\n\nAnybody seen it and see parallels similar things happening?",
        "upvotes": 30,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kfomrn/turning_point_the_vietnam_war/"
    },
    {
        "id": "1kf8hlf",
        "author": "Sweaty-Toe-6211",
        "title": "‘TRAIN TO BUSAN’ and its Sequel ‘PENINSULA’ are both now Streaming on Netflix",
        "content": "",
        "upvotes": 226,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1kf8hlf/train_to_busan_and_its_sequel_peninsula_are_both/"
    },
    {
        "id": "1kfi7cj",
        "author": "GburnsJournal_",
        "title": "Netflix's latest series dubbed 'the next Walking Dead meets The Last of Us'",
        "content": "What do yous think of the new Netflix show The Eternaut, that just came out last week ?? ",
        "upvotes": 56,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1kfi7cj/netflixs_latest_series_dubbed_the_next_walking/"
    },
    {
        "id": "1kg2o0u",
        "author": "solomon_77v",
        "title": "New to Netflix, looking for dark or high fantasy shows and movies",
        "content": "I’m interested in shows like dungeon meshi or anything DnD world theme (I haven’t played DnD just love the settings like it) and classical high/dark fantasy with dragons and elemental magic with staff as comfort watches or even stuff with innovative ideas but doesn’t leave the foundation ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kg2o0u/new_to_netflix_looking_for_dark_or_high_fantasy/"
    },
    {
        "id": "1kg21e0",
        "author": "Kalila_Matthews",
        "title": "Logout and account is gone?",
        "content": "The weirdest thing just happened to my partners Netflix account. Has this happened to anyone else?\n\nSo, we watch Netflix on the PS5 and went in to watch Netflix for the first time today (it was working fine yesterday) and it had logged him out. Weird, never had that before. Logged back in but, then it said finishing setting up your account.\n\nIt was the correct email, correct account but it looks like it’s just been wiped?! Payment information, details, literally everything. We were a week late on payment (but we have had late payment before but never anything like this happen).\n\nHas anyone else experienced this? \nAll out saved shows are gone 😭",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kg21e0/logout_and_account_is_gone/"
    },
    {
        "id": "1kg35g5",
        "author": "Ok_Loss8921",
        "title": "Netflix subtitle screen bug",
        "content": "Does anyone know how to actually fix this \n",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b7h2ijm3n5ze1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kg35g5/netflix_subtitle_screen_bug/"
    },
    {
        "id": "1kfupp4",
        "author": "MqAbillion",
        "title": "Four Seasons - decent but I hoped for more comedy",
        "content": "I did enjoy this show, but it wasn’t what I was hoping for. Some good laughs, but not enough. Liz Lemon, Michael Scott, Trudy Weigel, and Paul/Jenna? Come ON, that’s a comedic actor fever dream. \n\nI guess I expected more over the top comedy like 30 Rock/Reno911\n\nI’ll still watch anything with Tina Fey or Kerry Kenney cuz they are comedy goddesses, I guess I just wish they went more wacky with it ",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kfupp4/four_seasons_decent_but_i_hoped_for_more_comedy/"
    },
    {
        "id": "1kfbkny",
        "author": "Internal-Bed-3150",
        "title": "The Eternaut lands season 2 renewal on Netflix as show's future determined",
        "content": "",
        "upvotes": 58,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kfbkny/the_eternaut_lands_season_2_renewal_on_netflix_as/"
    },
    {
        "id": "1kfvdil",
        "author": "AnagnorisisForMe",
        "title": "The Seat",
        "content": "Really liked this movie on Mercedes new F1 driver Kimi Antonelli. To have gotten pole position in one of his first ever F1 races recently (Miami Grand Prix) is really impressive. I think he's got what it takes to win a driver's championship one day.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvdil/the_seat/"
    },
    {
        "id": "1kfsxs2",
        "author": "Purple-Suspect6214",
        "title": "the society: ending theories",
        "content": "the society: i know i’m a little late to the show, but i wanted to hear the best ending theories that you guys have… it’s a really good show, it’s a shame it was cut off like that ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kfsxs2/the_society_ending_theories/"
    },
    {
        "id": "1kfpkcc",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game: Season 3 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kfpkcc/squid_game_season_3_official_teaser_netflix/"
    },
    {
        "id": "1kfvwse",
        "author": "SnapDragon_2018",
        "title": "Netflix Watchlist/history glitches",
        "content": "Am I the only one who's Netflix glitches out and constantly doesn't save my place in the episode I was watching? Like for example I'm currently watching North of North and I'll be in the middle of episode 6, pause it, turn the TV off and go back to watch it the next day and it'll start me all over on episode 4 that I hadn't watched in days. Or for example ugly betty if I'm watching that and I go to Netflix to watch it, it won't even be in my watch history and I'll have to search it just to find it and watch it. Netflix is constantly doing this to me on all sorts of shows and movies on phones, laptops and TVs. I pay for Netflix but I have the cheapest tier with commercials. It makes me wonder if these glitches happen to make me try and upgrade?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvwse/netflix_watchlisthistory_glitches/"
    }
]