[
    {
        "id": "1phdbrn",
        "author": "PrehistoricPlanetAMA",
        "title": "Hi r/movies! We're the team responsible for bringing Apple TV’s Prehistoric Planet: Ice Age to life. We are Russell Dodgson (Production VFX Supervisor), Dorothy Ballarini (Framestore Creature Supervisor) and Darren Naish (Lead Scientific Consultant). Ask us anything!",
        "content": "Hi reddit.\n\nWe are the team responsible for bringing the megafauna of Apple TV’s **Prehistoric Planet: Ice Age** to life. We're Russell Dodgson (Production VFX Supervisor), Dorothy Ballarini (Framestore Creature Supervisor) and Darren Naish (Lead Scientific Consultant). We're here to answer your questions.\n\nIf you want to know more about us, here are our credentials:\n\n* Russell Dodgson (**His Dark Materials**, **Harry Potter and the Deathly Hallows Part 2**) : [https://www.imdb.com/name/nm4203233/](https://www.imdb.com/name/nm4203233/)\n* Dorothy Ballarini (**Wicked: For Good**, **Guardians of the Galaxy**): [https://www.imdb.com/name/nm4809197/](https://www.imdb.com/name/nm4809197/)\n* Darren Naish (**Alien Worlds**, **Prehistoric Planet**): [https://www.imdb.com/name/nm4595065/](https://www.imdb.com/name/nm4595065/)\n\nOur mission was to create the illusion that a modern natural history crew traveled back in time. This meant adhering to strict \"blue chip\" documentary standards—using long-lens photography, camera jitter, and heat haze to ground our CGI in reality.\n\nFrom an artistic and technical standpoint, we delivered over 1,250 4K shots featuring 69 scientifically accurate hero animals. This required intense collaboration to ensure every skeletal structure was fossil-accurate, alongside complex bi-directional simulations for fur interacting with deep snow, mud, and tar.\n\nWhether you’re interested in the bi-directional FX sims, the on-set puppeteering in extreme climates, or the paleontology behind the designs, Ask Us Anything!\n\nWe’ll be back tomorrow Tuesday, December 9th, at 1 PM ET/6 PM GMT to answer your questions.\n\nAsk away, we’re excited to talk all things prehistoric, icy and wonderfully complex!\n\n",
        "upvotes": 148,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/25craf1plz5g1.png?auto=webp&amp;s=6de17ea3ed18307763ad39111e467c73e77fc69c"
        },
        "permalink": "/r/movies/comments/1phdbrn/hi_rmovies_were_the_team_responsible_for_bringing/"
    },
    {
        "id": "1phruoc",
        "author": "SanderSo47",
        "title": "December 5-7 Box Office Recap – 'Five Nights at Freddy's 2' opens with a fantastic $64M domestically and $110.5M worldwide, the biggest post-Thanksgiving debut. 'Zootopia 2' crosses $900M worldwide in just two weeks. 'Wicked: For Good' crosses $400M worldwide, but it's dropping faster than expected.",
        "content": "https://preview.redd.it/8utucikcd26g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=ec7810bbb17a06607406abddeea9e01e4d9d5aae\n\nThe return of the animatronics propelled up some damn great business on the post-Thanksgiving weekend.\n\n***Five Nights at Freddy's 2*** topped the box office, delivering a fantastic debut that wasn't quite far off from the original's debut back in 2023. And while ***Zootopia 2*** had to drop to #2, it had a better-than-average drop for animation. But the real story, again, was overseas, where the film has already surpassed $900 million worldwide.\n\nThe Top 10 earned a combined $148.5 million this weekend. That's up 14.5% from last year, when ***Moana 2*** repeated at #1 thanks to very poor newcomers.\n\nDebuting in first place, Universal/Blumhouse's ***Five Nights at Freddy's 2*** opened with a fantastic $64 million in 3,412 theaters. This debut is just 20% off from the original film ($80 million), and it's Blumhouse's third highest debut, behind ***Freddy's*** and ***Halloween*** ($76 million). It's the second biggest debut for a horror this year, behind ***The Conjuring: Last Rites*** ($84 million). As an interesting stat, it broke the record set by ***The Last Samurai*** ($24 million) for the biggest post-Thanksgiving debut.\n\nReleasing a horror film in December is a strange move. Not like it never happens, just that it's quite uncommon. But having it open the post-Thanksgiving weekend was an interesting move. With Thanksgiving over, people move on to holiday shopping and get into the Christmas spirit. As such, studios have avoided releasing big movies in this weekend, and it's why the biggest debut was just $24 million. But Universal was confident that the demand for ***Freddy's 2*** would offset that perception. Whether it's the first weekend of December or the third weekend of October or any other weekend, the fans would still show up.\n\nUniversal did the wise move to not repeat the Peacock day-and-date release of the original, instead letting the film play exclusively in theaters. While it couldn't replicate the original's debut, that's mainly due to the novelty factor gone. The fact that it dropped just 20% shows that the demand is still high, regardless of the terrible reviews of the original film. Even if the second film somehow got worse reviews (11% on RT is brutal), Blumhouse will happily accept this success given their very poor year.\n\nAccording to Universal, 55% of the audience was male, and 77% of the audience was 25 and under. Unsurprisingly, its biggest demographic was Gen Z. Everything has paid off... except for the reception. Audiences gave ***Freddy's 2*** a \"B\" on CinemaScore, quite down from the original's \"A–\". That's not a bad grade for a horror film, but given that these films are more fan-driven than other horror films, that's a very concerning grade. It indicates that audiences didn't really like the film. Even with the holidays coming up, ***Freddy's 2*** will probably drop harsh like other front-loaded horror titles. Maybe not to the extent of the original (again, that wasn't exclusively playing in theaters), but it will fizzle out quickly. Right now, a total around $130 million domestically is likely for ***Freddy's 2***.\n\nIn second place, ***Zootopia 2*** added $43.4 million this weekend. That's a 57% drop, which is better than last year's ***Moana 2*** (63%), and only slightly harsher than ***Tangled*** (56%). Through 10 days, ***Zootopia 2*** has earned $220.9 million domestically. The film should absolutely continue holding well over the next few weeks, so look for this to finish with \n\n***Wicked: For Good*** had a rough second weekend drop, and yet the worst was yet to come on its third weekend. The film collapsed a horrible 72% (yes, 72%!), earning just $17.3 million this weekend. Even when films usually drop hard after Thanksgiving, this drop is far higher than usual. The film has earned $297.5 million domestically.\n\nIn contrast, the original ***Wicked*** dipped 55% on its third weekend, and its weekend ($36 million) is more than double. In fact, the film has officially lost ground against the first film. While ***For Good*** opened $35 million above the original, the film's domestic total is now $24.5 million behind that film through the same point. Given that it has lost all daillies after its opening weekend, that gap will continue growing. The film has no chance of reaching the original's $474 million run, but it will also miss $400 million domestically. Right now, ***Wicked: For Good*** might finish its run with a little above $350 million, indicating very weak legs.\n\nIn fourth place, GKids released ***Jujutsu Kaisen: Execution***, a compilation film, in 1,833 theaters, and it managed to open with $10 million. A solid result, but don't expect any legs for this one.\n\nLionsgate's ***Now You See Me: Now You Don't*** dropped 49%, adding $3.4 million this weekend. The film has amassed $55.3 million so far.\n\nLionsgate released Quentin Tarantino's ***Kill Bill: The Whole Bloody Affair***, a new version that combines the two films, in 1,198 theaters. Despite its massive 275-minute runtime, it earned a solid $3.4 million. Critics hailed the new version, and audiences gave it a rare \"A+\" on CinemaScore.\n\nA24 expanded ***Eternity*** to 2,386 theaters, and it really helped it land the weekend's best hold among wide releases. It eased just 14%, grossing $2.7 million. That takes its domestic total to $9.5 million, and it looks like it will finish with a little above $15 million. A pretty solid result.\n\nFocus Features expanded Chloé Zhao's ***Hamnet*** to 744 theaters, and it earned a solid $2.3 million. That took its domestic gross to $4.1 million, and it will get another expansion this week, in the wake of its 6 Golden Globe nominations.\n\nIn ninth place, the Indian film ***Dhurandhar*** debuted with $1.9 million in 391 theaters.\n\nRounding out the Top 10 was ***Predator: Badlands***. It dropped a steep 62% for a $1.8 million weekend. Its domestic total stands at $88.2 million.\n\nOutside the Top 10 was Sony's ***Merrily We Roll Along***, a pre-recorded version of the Broadway musical. Playing in 1,084 theaters, it earned $1.3 million this weekend.\n\nParamount's ***The Running Man*** ain't walking no more. It collapsed a steep 70%, earning just $1.1 million. The film has made a disappointing $36.5 million.\n\n#**OVERSEAS**\n\n***Zootopia 2*** added $219 million overseas, which was a pretty good 40% drop from last week. That took the film's worldwide total to a fantastic $917 million. It opened in Japan with $12.3 million, the second biggest debut for a Hollywood film, just behind ***Frozen 2***. Given that Disney's films are known for legging out, this is gonna have a great run in the country. In China, it over-performed projections and it has now reached $430 million, officially becoming the second biggest Hollywood title in the country, behind ***Avengers: Endgame***.\n\nThe film's best markets are China ($430.4M), France ($27.3M), Korea ($25.6M), Mexico ($18.6M) and Germany ($16.2M). With a great hold and very little animated competition, this film should continue holding well. In the next few days, it will cross the $1 billion milestone, and overtake ***Lilo &amp; Stitch*** as the biggest Hollywood film of the year.\n\n***Five Nights at Freddy's 2*** opened with $46.1 million overseas, for a $110.5 million worldwide debut. A pretty good debut, although the original film opened with $52.6 million overseas and $132.6 million worldwide back in 2023. The best debuts were in Mexico ($6.9M), the UK ($4.4M), Brazil ($3.2M), Spain ($2.9M), and Australia ($2.4M). Based on these patterns, the film should cross the $200 million worldwide without much problem.\n\n***Wicked: For Good*** is fizzling out both domestically and overseas. It dropped a rough 55%, earning just $13.4 million overseas. That takes its worldwide total to $440.9 million. The film's best markets are the UK ($49.4M), Australia ($16.2M), Germany ($8M), Korea ($6M) and Mexico ($6M). While it still has China and Japan left, it's clear that the film isn't fully connecting with audiences outside America. The film will now aim to finish its run with $550 million, over $200 million below the original. The film is now guaranteed to finish outside the year's Top 10 worldwide.\n\nWith $9 million, ***Now You See Me: Now You Don't*** has crossed $209 million worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle* | Sep/12 | Sony | $70,611,098 | $134,303,197 | $780,032,099 | $20M\n*Tron: Ares* | Oct/10 | Disney | $33,241,433 | $73,161,014 | $142,249,983 | $220M\n*Springsteen: Deliver Me from Nowhere* | Oct/24 | 20th Century Studios | $8,887,255 | $22,638,297 | $44,796,666 | $55M\n*Keeper* | Nov/7 | Neon | $2,527,627 | $4,200,167 | $4,905,839 | $6M\n\n- ***Demon Slayer: Kimetsu no Yaiba – The Movie: Infinity Castle*** has closed with an incredible $780 million worldwide. One of the year's biggest stories, it broke so many records, including the biggest Japanese film, the biggest foreign film in North America, and the biggest adult animation title. And remember, this is just Part 1. Just imagine what the sequels will do. \n\n- Here lies Jared Leto's leading man career. ***Tron: Ares*** has closed with a poor $73 million domestically and $142 million worlwide, not getting anywhere close to its $220 million budget. It managed to be the least attended film in the franchise, and now Jared Leto has another flop in his leading resume. Disney could've tried a proper sequel to ***Legacy*** but they canned it in 2015 because of ***Tomorrowland***. We'd like to say that this is the nail in the coffin for the franchise; while the previous two films were considered financial disappointments, ***Ares*** wasn't a disappointment, it was a disaster. Maybe this is the end of ***Tron*** as we know it.\n\n- Born to Run? I don't think so. ***Springsteen: Deliver Me from Nowhere*** closed with a mediocre $44 million worldwide, failing to recoup its $55 million budget. The Boss is definitely popular and beloved, but fans weren't particularly excited for a biopic, especially one with very middling reviews. It is what it is.\n\n- Neon's ***Keeper*** has closed with a bad $4.9 million worldwide. Osgood Perkins struck gold with ***Longlegs*** and ***The Monkey***, which are among Neon's highest grossing films. But ***Keeper*** lacked an interesting premise, and the divisive reception didn't help it (49% on RT and \"D+\" on CinemaScore). Perkins should watch out for his next film.\n\n#**THIS WEEKEND**\n\nThere's three films, none of which are expected to make anything remotely fantastic. After all, audiences are saving their money for ***Avatar*** next week.\n\nThe biggest release is 20th Century Studios' ***Ella McCay***, starring Emma Mackey as Ella McCay. It's James L. Brooks' first film in 15 years, after the colossal failure of ***How Do You Know***. That film cost $120 million but grossed just $48 million and was negatively received. ***Ella McCay*** won't flop that hard, given that it's unlikely it cost similarly to that, but its prospects aren't looking great. Trailers failed to make some buzz, and award prospects are unlikely. It's old to the old demo to show up.\n\nCineverse is also releasing ***Silent Night, Deadly Night***, a remake of the 1984 film. None of the films have been huge hits, they're much more niche than other franchises. Similar numbers to ***The Toxic Avenger*** should be expected.\n\nLionsgate is releasing Bryan Fuller's directorial debut ***Dust Bunny***, which stars Mads Mikkelsen (their second collaboration after ***Hannibal***), Sophie Sloan, Sheila Atim, David Dastmalchian, and Sigourney Weaver, and tells the story of an eight-year-old girl who asks her hitman neighbor to kill the monster under her bed. Like other Fuller vehicles, this has positive reviews on its side (93% on RT), but don't expect it to make a lot of money.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 78,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/seB9HTKDWEqjRKGKFj1huHnVym7xDdTTIAzGjRv2D9o.png?auto=webp&amp;s=4d8304ae75b3b51da6d1c2f45fb9e3b9920b870c"
        },
        "permalink": "/r/movies/comments/1phruoc/december_57_box_office_recap_five_nights_at/"
    },
    {
        "id": "1phuswn",
        "author": "MarvelsGrantMan136",
        "title": "James Van Der Beek Raises $47K for His Cancer Fight With ‘Dawson’s Creek’ &amp; ‘Varsity Blues’ Memorabilia Auction",
        "content": "",
        "upvotes": 2771,
        "comments": 264,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MRnsbphrk_l1edOvZq85PV16pIk0j8wblEGOBHub4i0.jpeg?auto=webp&amp;s=d2f8c1b06d4fb05e849b4cb3f2d29272a776dcdc"
        },
        "permalink": "/r/movies/comments/1phuswn/james_van_der_beek_raises_47k_for_his_cancer/"
    },
    {
        "id": "1phovqo",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Natalie Portman and Jenna Ortega in 'The Gallerist' - Follows a desperate gallerist who conspires to sell a dead guy at Art Basel Miami",
        "content": "[ Removed by Reddit in response to a copyright notice. ]",
        "upvotes": 3550,
        "comments": 208,
        "media": null,
        "permalink": "/r/movies/comments/1phovqo/first_image_of_natalie_portman_and_jenna_ortega/"
    },
    {
        "id": "1phdb89",
        "author": "MarvelsGrantMan136",
        "title": "Paramount Launches Hostile Bid for Warner Bros.",
        "content": "",
        "upvotes": 11542,
        "comments": 1827,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l8xDPXePXK2EG7Vkq79Bu8oimyWVcI7dwO4c57osYNw.jpeg?auto=webp&amp;s=98f2366049effca9ef9e8aeb6042629b10034cf3"
        },
        "permalink": "/r/movies/comments/1phdb89/paramount_launches_hostile_bid_for_warner_bros/"
    },
    {
        "id": "1phkfb1",
        "author": "chespiotta",
        "title": "Warner Bros. Discovery says it will \"carefully\" review Paramount Skydance's $30-per-share acquisition offer and issue a decision within 10 business days.",
        "content": "",
        "upvotes": 3722,
        "comments": 458,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e2HxzLmmovQxQuSMujjCawME-Bapd_TSNNRsRyfjKFA.jpeg?auto=webp&amp;s=58beba70e916775468b691c7db112f103fcb7928"
        },
        "permalink": "/r/movies/comments/1phkfb1/warner_bros_discovery_says_it_will_carefully/"
    },
    {
        "id": "1pi0ggd",
        "author": "iLikeSaints",
        "title": "Lord Of The Rings sets 25th anniversary cinema re-release for January 2026",
        "content": "",
        "upvotes": 287,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xSPPKi_clcoFtM454yMF3vgdLtypp6FIsIzz19tpZR0.jpeg?auto=webp&amp;s=8e65558c7e53b1c07dbb78eaa7c5bcd8bfe1ce70"
        },
        "permalink": "/r/movies/comments/1pi0ggd/lord_of_the_rings_sets_25th_anniversary_cinema/"
    },
    {
        "id": "1phr0mx",
        "author": "iwantUineedUohBBohBB",
        "title": "Letterboxd to Launch Movie Rental Digital Platform Later This Week",
        "content": "",
        "upvotes": 899,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FLK9GkCyKy7FWEMZeOPBzbuJi9_oDrluwJw85tW4gww.jpeg?auto=webp&amp;s=6cdc68bfff0287eb2b98173f2f38ce2ccbefeb21"
        },
        "permalink": "/r/movies/comments/1phr0mx/letterboxd_to_launch_movie_rental_digital/"
    },
    {
        "id": "1phiizd",
        "author": "BunyipPouch",
        "title": "Alexander Skarsgård to Star in Gothic Horror Film ‘The Wolf Will Tear Your Immaculate Hands’ from ‘The Northman’ Writer - Set in 1880s Pacific Northwest",
        "content": "",
        "upvotes": 2049,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EqNTaawMQ2vA797v1oCZ6Qa9Z7FtU4WKhCbIhc6Tir4.jpeg?auto=webp&amp;s=2628e2b62c156d91d8b6acb4df752efe57a2d3b1"
        },
        "permalink": "/r/movies/comments/1phiizd/alexander_skarsgård_to_star_in_gothic_horror_film/"
    },
    {
        "id": "1phdkb0",
        "author": "cmaia1503",
        "title": "Paul Dano Joins Cast of Florian Zeller’s Psychological Thriller ‘Bunker’",
        "content": "",
        "upvotes": 3083,
        "comments": 182,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5SxuaRXoau1IUb8VY6B2H3WxBAe0jR7ktSyJ5_iw8mw.jpeg?auto=webp&amp;s=c6a4466ea1e94c2fff899b1259e0948e8a3ed9ac"
        },
        "permalink": "/r/movies/comments/1phdkb0/paul_dano_joins_cast_of_florian_zellers/"
    },
    {
        "id": "1phl6uc",
        "author": "Task_Force-191",
        "title": "New Poster for Kenichiro Akimoto's ‘All You Need is Kill’",
        "content": "",
        "upvotes": 1216,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2s24py01416g1.jpeg?auto=webp&amp;s=8d59d69971ecac7cf471582e584b6182633e838e"
        },
        "permalink": "/r/movies/comments/1phl6uc/new_poster_for_kenichiro_akimotos_all_you_need_is/"
    },
    {
        "id": "1phnslr",
        "author": "BunyipPouch",
        "title": "Brendan Fraser &amp; Dwayne Johnson | Actors on Actors",
        "content": "",
        "upvotes": 711,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B_mg4xe24mqiBnF1ARQV_LfnhGMH8EzQZpNnwG7gF7Q.jpeg?auto=webp&amp;s=6dc4a8571660a3ef9bef3aa4f9ca00afe74d0b2d"
        },
        "permalink": "/r/movies/comments/1phnslr/brendan_fraser_dwayne_johnson_actors_on_actors/"
    },
    {
        "id": "1phvl9e",
        "author": "MaybeNotTooDay",
        "title": "Recent Christmas movies that aren't well known and didn't get the credit they deserve.",
        "content": "My pick is The Best Christmas Pageant Ever (2024). I stumbled on it last year and found it to be a fun to watch wholesome movie that never had me checking to see how much time was left until it finished. It's a bit cheesy but it is a family movie. It has some laughs and a good solid message. Everyone I've mentioned it to in real life has never heard of it and those who've I've convinced to watch it, liked it... or at least told me they did.",
        "upvotes": 172,
        "comments": 239,
        "media": null,
        "permalink": "/r/movies/comments/1phvl9e/recent_christmas_movies_that_arent_well_known_and/"
    },
    {
        "id": "1phl7bf",
        "author": "Task_Force-191",
        "title": "ALL YOU NEED IS KILL | Official Trailer - In Theatres January 16",
        "content": "",
        "upvotes": 594,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/99JSDC3xVg10BqFCmcqGM_2byNXwQXOiFA3YfnQYUBY.jpeg?auto=webp&amp;s=b23b39728aef53bc3f5779b5221f3fd581087c0c"
        },
        "permalink": "/r/movies/comments/1phl7bf/all_you_need_is_kill_official_trailer_in_theatres/"
    },
    {
        "id": "1phx4fm",
        "author": "stellifer_arts",
        "title": "The Crow (1994) directed by Alex Proyas, based on the comic by James O'Barr - Eric Draven (played by Brandon Lee) confronts Funboy. (explicit)",
        "content": "",
        "upvotes": 125,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lBXPVEz5ZmroTDutOJv1z34xLi7cpjxmI18afWcUfTU.jpeg?auto=webp&amp;s=bd7cb4f8f1bf8d40a63979ac665ae213c1caef03"
        },
        "permalink": "/r/movies/comments/1phx4fm/the_crow_1994_directed_by_alex_proyas_based_on/"
    },
    {
        "id": "1phloky",
        "author": "Bellikron",
        "title": "The X-Men movies may have the craziest chronology and arc of quality of any franchise",
        "content": "Many franchises start off with a couple of good entries before slowly declining over time.  Additionally, the franchises that go on a while sometimes get desperate and throw prequels, spinoffs, and reboots into the mix.  Sometimes they get super convoluted.  Halloween is a good example, with an unrelated spinoff for the 3rd film, two reboot movies, and three separate chains of installments that get retconned out of existence by the following installments.  Usually not many of these sequels or tangential films are good.  But putting all of these franchises to shame is X-Men, which has the wildest timeline and a completely unpredictable journey from good to bad. Going off of general consensus of how each film was received, we have:\n\nX-Men (1st film): Good\n\nX2 (Sequel): Good\n\nThe Last Stand (3rd film): Bad\n\nX-Men Origins Wolverine (Spinoff Solo Prequel): Real bad\n\nFirst Class (Prequel/Reboot): Good\n\nThe Wolverine (Loose Sequel to Spinoff Solo Prequel): Starts off good, becomes eh\n\nDays of Future Past (Sequel to Prequel/Reboot but also Time Travel Crossover with Original Trilogy): Real good\n\nDeadpool (Tangentially Related Spinoff Whose Place in the Continuity Is \"Whatever Is Funniest at the Moment\"): Good\n\nApocalypse (3rd Prequel/Reboot): Eh\n\nLogan (3rd Film of Loose Spinoff Solo Trilogy): The best one\n\nDeadpool 2 (Sequel to Tangentially Related Spinoff Whose Place in the Continuity Is \"Whatever Is Funniest at the Moment\"): Good\n\nDark Phoenix (4th Prequel/Reboot): Bad\n\nNew Mutants (Different Tangentially Related Spinoff/Reboot/Whatever This One was Supposed to Be): Real bad\n\nDeadpool and Wolverine (3rd film of Tangentially Related Spinoff Whose Place in the Continuity Is \"Whatever Is Funniest at the Moment\"/Multiverse Crossover with Protagonist of the Other Spinoff Solo Films Even Though He Died in the 3rd Film of Loose Spinoff Solo Trilogy and the Hugh Jackman Said He Was Done/Technically a Sequel to 3rd Film of Loose Spinoff Solo Trilogy Anyway/Multiverse Crossover and Continuity Merge with the Superhero Franchise that Will Be Taking Over this Franchise/Meta Post-Mortem and Emotional Closure of Not Only This Franchise but Other Superhero Movies from This Studio and Others, Including One that Never Got Made): Good\n\nThis doesn't even take into account the MCU crossovers (particularly the upcoming Doomsday) and the question of whether we ever actually return to the original trilogy's timeline at all due to continuity differences and the fact that Professor X keeps coming back to life between movies without explanation.\n\nIs there any other franchise that comes close?",
        "upvotes": 481,
        "comments": 219,
        "media": null,
        "permalink": "/r/movies/comments/1phloky/the_xmen_movies_may_have_the_craziest_chronology/"
    },
    {
        "id": "1pi2ar9",
        "author": "mayukhdas1999",
        "title": "First Image of Olivia Wilde &amp; Cooper Hoffman in Gregg Araki's erotic-thriller 'I WANT YOUR SEX'",
        "content": "&gt;When fresh-faced Elliot lands an exciting job for renowned artist, icon and provocateur Erika Tracy, his fantasies come true as Erika taps him to become her sexual muse. But Elliot soon finds himself out of his depth as Erika takes him on a journey more profound than he ever could have imagined, into a world of sex, obsession, power, betrayal and murder",
        "upvotes": 39,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fnqe7aok256g1.jpeg?auto=webp&amp;s=95a9bd0a55ea5c43aa5748a4d7bae50268ad2cc1"
        },
        "permalink": "/r/movies/comments/1pi2ar9/first_image_of_olivia_wilde_cooper_hoffman_in/"
    },
    {
        "id": "1phqj97",
        "author": "Metamew",
        "title": "Ted Sarandos Says Netflix-Warner Bros Deal Won't Kill Theatrical",
        "content": "Possibly good news if true that they'd use WB resources to keep releasing in theatres, though nothing was said about physical releases. ",
        "upvotes": 172,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fv_C984RnbOglnPhnH8Rp1qKJ3NuEdbs3bnF-K7d3zc.jpeg?auto=webp&amp;s=73d27a4555fff4dd638ab5e81444cb1a94192157"
        },
        "permalink": "/r/movies/comments/1phqj97/ted_sarandos_says_netflixwarner_bros_deal_wont/"
    },
    {
        "id": "1phrkm1",
        "author": "BiscuitWig2",
        "title": "I LOVE a good mindf*ck movie.",
        "content": "Just finished Sphere (1998) for the first time. I've been building up my digital movie collection a year at a time and watching the ones that sound interesting. Sphere was one of those movies. Add to the premise a stacked cast and it was a fun watch. I love movies that keep you guessing the entire time. Another one I think of is Oculus. I remember being pleasantly confused while watching it, but that's about it. Gonna have to rewatch it soon. Give me some recommendations if you know of any.",
        "upvotes": 147,
        "comments": 274,
        "media": null,
        "permalink": "/r/movies/comments/1phrkm1/i_love_a_good_mindfck_movie/"
    },
    {
        "id": "1phc60o",
        "author": "lawrencedun2002",
        "title": "Golden Globe Nominations 2026: Full List of Nominees",
        "content": "",
        "upvotes": 586,
        "comments": 411,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I_KjMc0slwprtsY70_7IDa_qiGfotZfJf-9Y-wIznZY.jpeg?auto=webp&amp;s=69703da6c59f2fd70e2718c3a846a206e1dbf39e"
        },
        "permalink": "/r/movies/comments/1phc60o/golden_globe_nominations_2026_full_list_of/"
    },
    {
        "id": "1phsrva",
        "author": "Enough_Ad4294",
        "title": "\"U Are the Universe\" is Ukraine’s first space sci-fi with only an €800k budget.",
        "content": "",
        "upvotes": 80,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nGxcx1hPzXr6OwBjuriZRoGiJ9htOs9a34GN4v-Xfq8.jpeg?auto=webp&amp;s=e96e8975f50a3077364aa2a33e19112d2b56bd48"
        },
        "permalink": "/r/movies/comments/1phsrva/u_are_the_universe_is_ukraines_first_space_scifi/"
    },
    {
        "id": "1phepgt",
        "author": "Raj_Valiant3011",
        "title": "Wagner Moura Becomes First Brazilian Male Actor Nominated in Lead Drama Category at Golden Globes",
        "content": "",
        "upvotes": 383,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TcIQj-L6rIPkOHvKaSDXn4awqEfYDnCc5-x1FJuhbd4.jpeg?auto=webp&amp;s=99bfda95052599917a34f8defcd6878e4f3ba2fb"
        },
        "permalink": "/r/movies/comments/1phepgt/wagner_moura_becomes_first_brazilian_male_actor/"
    },
    {
        "id": "1pgjr2e",
        "author": "netflix",
        "title": "Hi r/movies! I'm Shih-Ching Tsou, writer-director-producer of LEFT-HANDED GIRL and producer of THE FLORIDA PROJECT, RED ROCKET, STARLET, and TANGERINE. AMA!",
        "content": "Hi r/movies! I'm Shih-Ching Tsou, writer-director-producer of LEFT-HANDED GIRL, which premiered at Cannes and is out now on Netflix. It's Taiwan's entry for the 98th Academy Awards. I've also produced THE FLORIDA PROJECT, RED ROCKET, STARLET, and TANGERINE alongside Sean Baker. Ask me anything! See you here Monday at 12pm PST / 3pm EST. \n\nhttps://preview.redd.it/nthjjt8rls5g1.png?width=788&amp;format=png&amp;auto=webp&amp;s=5abde72c8eb10c71915bcd4ca133815c62adc982\n\n  \n",
        "upvotes": 166,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1pgjr2e/hi_rmovies_im_shihching_tsou/"
    },
    {
        "id": "1ph1asc",
        "author": "CerealAndBagel1991",
        "title": "Has there ever been an actor who’s trashed a co-star’s performance before a movie came out, but still encouraged folks to go see it?",
        "content": "This would be a PR nightmare which is why I imagine it hasn’t happened on a mainstream level\n\nBut has there been an actor who was interviewed about an upcoming release and they were talking about how great the film will be, why everyone should go see it, how much they enjoyed working on the piece, but then randomly and out of nowhere just started shitting on a co-star?\n\nLike “the film is great but (blank) was horrible. I think everyone will love them film and should go see it as long as they’re able to look past (blank)’s terrible performance ",
        "upvotes": 3166,
        "comments": 1404,
        "media": null,
        "permalink": "/r/movies/comments/1ph1asc/has_there_ever_been_an_actor_whos_trashed_a/"
    },
    {
        "id": "1phc23a",
        "author": "HiImWallaceShawn",
        "title": "Movies that end with the protagonist incarcerated? Bonus points if they start and end the film in prison.",
        "content": "I am having a hard time coming up with movies where the main character ends the film incarcerated. Currently I am only able to think of a few: Shot Caller from 2017 is one. Flight with Denzel in 2012 is another one that comes to mind. I am still struggling to think of any movies where the protagonist both starts and ends the film incarcerated. Any others anyone can think of?",
        "upvotes": 397,
        "comments": 651,
        "media": null,
        "permalink": "/r/movies/comments/1phc23a/movies_that_end_with_the_protagonist_incarcerated/"
    },
    {
        "id": "1phbyhz",
        "author": "YourChopperPilotTTV",
        "title": "Baby Driver (2017) Directed by Edgar Wright - Bellbottoms",
        "content": "&gt;!I love this opening to the film! It does an amazing job of setting the tone for the rest of the film and without giving much detail/information the audience becomes hooked!!&lt;",
        "upvotes": 344,
        "comments": 107,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vn1qd39cbz5g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1phbyhz/baby_driver_2017_directed_by_edgar_wright/"
    },
    {
        "id": "1ph0pe7",
        "author": "BunyipPouch",
        "title": "‘One Battle After Another’ Wins Best Film At Los Angeles Film Critics Association 2025 Awards",
        "content": "",
        "upvotes": 2366,
        "comments": 398,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vYA8PVw1gA3klpLK8czWp1Bk5wRim1dlnp2WUexatLg.jpeg?auto=webp&amp;s=8f4caa726c8e022f9b8124df2342dc291b63b346"
        },
        "permalink": "/r/movies/comments/1ph0pe7/one_battle_after_another_wins_best_film_at_los/"
    },
    {
        "id": "1pi0liy",
        "author": "cantfacemyname",
        "title": "Are there films that follow a (preferably happy) married couple through the years, showing how they grow and change?",
        "content": "I’m getting frustrated with films that end after two characters secure a relationship or marriage, I would like to see what happens after the “happily ever after.” I would love to see two (emotionally stable lol) people grow through different stages of life and figure out how to make it work. I don’t have a father please help :(",
        "upvotes": 13,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1pi0liy/are_there_films_that_follow_a_preferably_happy/"
    },
    {
        "id": "1pgsnon",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for ‘Anaconda’",
        "content": "",
        "upvotes": 6546,
        "comments": 946,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uy6bizb8du5g1.jpeg?auto=webp&amp;s=3b74b4e3179578743d217cc42be8d5b8c38af660"
        },
        "permalink": "/r/movies/comments/1pgsnon/new_character_posters_for_anaconda/"
    },
    {
        "id": "1phnfq5",
        "author": "5YNTH3T1K",
        "title": "What movie is a stand out best adaptation of a novel for you ?",
        "content": "TLDR :\n\nTake book . make movie. is there a movie that nails the book ?\n\n!!! - please make a note in your reply to alert the reader to a \"I liked the movie more than the book \" or something , as that's a bit off topic.  The topic is about the quality of the adaption, but wait AND then there is a point , raised quite early on, which shows the film to be Superior to the book, HECK !  ( I did not see that coming...) \n\nWe are looking for films that do the book justice !  ( all info is good though ! ) \n\nAhem: \n\nWithout thinking too deeply I would suggest this:\n\n[https://en.wikipedia.org/wiki/The\\_Andromeda\\_Strain\\_(film)](https://en.wikipedia.org/wiki/The_Andromeda_Strain_(film))\n\n( I chose this as I love SF and it's one of the most obvious good SF novel adaptations that can think of , I would be really interested in other films that are held in high regard due to the accurate adaption from book to film, regardless of genre. )\n\nA side discussion ( which is my pet peeve ) : script writers that change a book you love:  what was your reaction ?  Did they make it \"better\" or are you still mortally offended ?\n\nI love films. I love books. But the book to film translation is almost always terrible.  Hmm ?\n\n( No I am not crazy or AI. This is not an emergency. )\n\nI will say this though: I get quite cross when I see a very bad adaption of a really good novel. ...\n\nHave a nice day ! :- )",
        "upvotes": 66,
        "comments": 349,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KJ1HMtSvZiN9r5HHyEBlCFizUbhAPGZh9dFusErVFAg.jpeg?auto=webp&amp;s=55b570ae155dbf8acc83e1e5d02800af98948ea4"
        },
        "permalink": "/r/movies/comments/1phnfq5/what_movie_is_a_stand_out_best_adaptation_of_a/"
    }
]