[
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 4932,
        "comments": 866,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pvuj2g",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Marty Supreme / Anaconda (2025) / Song Sung Blue) plus Christmas release throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Marty Supreme](https://old.reddit.com/r/movies/comments/1pvu1u8/official_discussion_marty_supreme_spoilers/?sort=top)\n* [Anaconda (2025)](https://old.reddit.com/r/movies/comments/1pvu1vs/official_discussion_anaconda_2025_spoilers/?)\n* [Song Sung Blue](https://old.reddit.com/r/movies/comments/1pvu1wk/official_discussion_song_sung_blue_spoilers/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Cast Away](https://old.reddit.com/r/movies/comments/1pvu1y2/official_throwback_discussion_cast_away_spoilers/?)\n* [Miss Congeniality](https://old.reddit.com/r/movies/comments/1pvu1zg/official_throwback_discussion_miss_congeniality/?)\n* [The Family Man](https://old.reddit.com/r/movies/comments/1pvu21f/official_throwback_discussion_the_family_man/?)\n* [Dracula 2000](https://old.reddit.com/r/movies/comments/1pvu22n/official_throwback_discussion_dracula_2000/?)\n* [O Brother, Where Art Thou?](https://old.reddit.com/r/movies/comments/1pvu24c/official_throwback_discussion_o_brother_where_art/?)\n* [Finding Forrester](https://old.reddit.com/r/movies/comments/1pvu25p/official_throwback_discussion_finding_forrester/?)\n\n**Still In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pvuj2g/official_discussion_megathread_marty_supreme/"
    },
    {
        "id": "1pye9he",
        "author": "TheKittyPie",
        "title": "Are there any films that take place in real time?",
        "content": "Films are generally 1.5-3 hours long. When you think about it there have been many stories or incidents throughout history which took place in just a few hours so it had me wondering, are there any film stories that are told in “real time” meaning for example the story starts at 8am and ends at 9:45am with plot in between? \n\nI know it’s been done in TV, for example Adolescence is pretty much shot in real time with hardly any cuts so you feel like you’re there.\nI know there have been films shot in “one shot” but they sometimes still time skip ",
        "upvotes": 1522,
        "comments": 1009,
        "media": null,
        "permalink": "/r/movies/comments/1pye9he/are_there_any_films_that_take_place_in_real_time/"
    },
    {
        "id": "1pyllja",
        "author": "AporiaParadox",
        "title": "Movies that portrayed a reality that was reflective of the time, but now seem unbelievable",
        "content": "As the saying goes, the past is a foreign country, and as such movies from the past can also seem like a foreign country. Movies usually try to reflect the reality of the time they're made in, but something that seemed normal in the past can seem unbelievable to modern audiences even if they're aware of the historical context.\n\nFor example, I recently rewatched White Christmas, and the song [\"What can you do with a General\"?](https://www.youtube.com/watch?v=D0rRe9gmFC4&amp;list=RDD0rRe9gmFC4&amp;start_radio=1) and the whole plot point about the retired general always seemed strange to me. The premise is that normal soldiers returning from WWII had better employment prospects than retired generals, with the general now running a failing inn while all of his former subordinates are doing very well. In modern times, this seems completely alien. Nowadays enlisted persons have a much harder time finding a decent job or even any job at all after their military service, especially if they lack a proper education/useful transferable skills or they have health problems, while high-ranking officers have a very easy time getting a good job thanks to their education and connections. I am frankly not even sure if the whole thing about retired WWII generals having a hard time finding a job was true, but it is definitely true that WWII veterans had a much easier time after their service than soldiers in later wars.\n\nAnd on that note, pretty much any old movie where a father with his own income in a job that isn't even that prestigious can provide for a whole family with a nice house that he owns. This is now a fantasy to anyone thinking of starting a family.\n\nSo what other then contemporary historical realities depicted in movies seem strange now?",
        "upvotes": 273,
        "comments": 136,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aTfW3qZ31bKmCTzJiwnXuNbkANzlpPKX-hvWa41SdSM.jpeg?auto=webp&amp;s=7089854510d46413265e78e3cd95bee6fa9775fc"
        },
        "permalink": "/r/movies/comments/1pyllja/movies_that_portrayed_a_reality_that_was/"
    },
    {
        "id": "1py8f5j",
        "author": "bell-town",
        "title": "In an alternate universe Alfonso Cuarón directed the rest of the Harry Potter series and the Battle of Hogwarts looked like the war scenes in Children of Men.",
        "content": "I rewatched the Prisoner of Azkaban last night and it's amazing how much better it is than all the other films in the series. Goblet of Fire was such a step down.\n\nThe last two movies even had a plot (somewhat) similar to Children of Men. An underground group meeting in secret. A smaller group fleeing to complete the mission themselves. Hiding from a corrupt and oppressive government. Navigating an active war zone in some of the final scenes.\n\nI still enjoy the rest of the movies but Cuarón would have been better suited and produced something amazing rather than serviceable.\n\nIt could have been like Paddington 2 - genuinely great filmmaking from a genre you wouldn't expect.",
        "upvotes": 1986,
        "comments": 249,
        "media": null,
        "permalink": "/r/movies/comments/1py8f5j/in_an_alternate_universe_alfonso_cuarón_directed/"
    },
    {
        "id": "1pxzub6",
        "author": "Amaruq93",
        "title": "\"Street Fighter II: The Animated Movie\" (1994, directed by Gisaburō Sugii) - Chun-Li vs Vega, one of the film's many fight sequences that were choreographed by K-1 Kickboxing founder Kazuyoshi Ishii and professional fighter Andy Hug.",
        "content": "",
        "upvotes": 2284,
        "comments": 276,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0c33papqvz9g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pxzub6/street_fighter_ii_the_animated_movie_1994/"
    },
    {
        "id": "1py8a0i",
        "author": "Wonder-Lad-2Mad",
        "title": "Actors who excel in playing assholes?",
        "content": "I finished watching Wake Up Deadman, this is the second Josh Brolin movie I've seen this year where he plays an asshole, the other being the dad from Weapons. He was great in Wake Up Dead Man. Monsignor Wicks is a fucking hilarious character.\n\n\nIt's just got me thinking that Brolin gets type cast a little bit for playing gruff assholes, hardasses, tough guys. No matter if if's a villain or a hero. And of course he excels at it. He's good. He has a mean mug and he knows how to act surly. Personally I think he would have been a dream casting for oldman Bruce Wayne if there ever was a TDKR adaptation.\n\n\nWho else has made a career out of playing intense, surly asshole?",
        "upvotes": 687,
        "comments": 1189,
        "media": null,
        "permalink": "/r/movies/comments/1py8a0i/actors_who_excel_in_playing_assholes/"
    },
    {
        "id": "1pyn39z",
        "author": "thegamewarrior",
        "title": "What Are the Most Recognizable Movie/TV ‘Photographs’",
        "content": "I’m looking to do some decorations in my living room for the first time in my life. My family has never been big on taking photographs, but I would like to put up what we have framed and it would just be a little bare. \n\nI was thinking about framing a collection of popular movie and television photographs, and have them around our normal photos. Not screenshots or frames from the film, but where the characters in the scene were actually posing for a photo. \n\n The first three that came to mind were Laura Palmer from Twin Peaks, the ‘erased from existence’ photograph from Back to the Future as well as the photo of Doc and Marty in front of the clock in the old west. \n\nAre there any big ‘photos’ that I should have?",
        "upvotes": 62,
        "comments": 133,
        "media": null,
        "permalink": "/r/movies/comments/1pyn39z/what_are_the_most_recognizable_movietv_photographs/"
    },
    {
        "id": "1pxwyeh",
        "author": "BunyipPouch",
        "title": "End of an Era - The suburbs of Los Angeles are seeing a brutal wave of movie theaters shutting down to become luxury apartments. Following 2 other recent closures in the area, Calabasas' only remaining movie theater, the Regency Theater, is now gone for good.",
        "content": "",
        "upvotes": 2463,
        "comments": 463,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7nTq5l7lCY1ilIwwhTC4AG8htX733Liv89NvFPNjcwo.jpeg?auto=webp&amp;s=1896066b7ad2772f7b7798d8f5d17097aae4f1d1"
        },
        "permalink": "/r/movies/comments/1pxwyeh/end_of_an_era_the_suburbs_of_los_angeles_are/"
    },
    {
        "id": "1pynxvu",
        "author": "browniebiscuitchildr",
        "title": "What’s a horror movie that manages to work with a surprising lack of gore?",
        "content": "My first vote is the original Texas Chainsaw Massacre which, if you consider the title, is shocking as hell. I mean, with a title like that, you’d expect a bloodbath, right? But no! It’s surprisingly bloodless. The most red you’re ever going to see is when Sally escapes by breaking through that window and gets cut up to shit. ",
        "upvotes": 43,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1pynxvu/whats_a_horror_movie_that_manages_to_work_with_a/"
    },
    {
        "id": "1pyffkn",
        "author": "HCJohnson",
        "title": "Restrepo is the greatest war documentary ever.",
        "content": "That's it, that's the post, it's an uncomfortable documentary and a tale of a world we (at least me) lived though. It might even transcend just documentaries and be the greatest war movie ever. I have seen it at least twenty times and it still leaves me feeling emotional and uncomfortable, we should have never been there and it's very similar to Vietnam in that aspect.",
        "upvotes": 142,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1pyffkn/restrepo_is_the_greatest_war_documentary_ever/"
    },
    {
        "id": "1pxxpd0",
        "author": "AfraidoftheLark",
        "title": "Those who watched Home Alone for the millionth time this holiday: What did you discover and/or appreciate anew during your latest viewing?",
        "content": "There’s a brief shot where Kevin, having evaded the police after inadvertently stealing a toothbrush, crosses a bridge. Meanwhile, a train passes by underneath. The winter atmosphere here is precise, credible, bordering on the straightforwardness of B-roll documentary footage. (“Adventures in Babysitting,” the first film from director Chris Columbus, incorporates a similarly immersive winter atmosphere into the edges of its opening scenes.) The framing/composition of this shot is striking but also simple and unfussy, like most of the great images in Home Alone. It’s a long shot in which Kevin, free from the law but not from his own conscience, is dwarfed by the chilly December landscape. No one else is in sight, emphasizing the loneliness of the accidental shoplifter. \n\nI suddenly found this image very moving as a depiction of isolation: Kevin is clearly in over his head (at least at this point in the story) and missing his family. Somehow the shot had breezed by on countless other viewings, never prompting much thought on my part. But now it stopped me in my (train) tracks. I also pondered how much it might have cost to arrange for the train’s appearance for such a fleeting bit of interstitial footage (or maybe it was just a matter of taking advantage of the existing train schedule). At any rate, it was worth the effort — it provides a good capstone to the preceding chase scene, reestablishing the melancholy after the lively ice rink moment. \n\nI also noticed that, in 4K, the wool coat of Harry Lyme (Joe Pesci) has a sense of texture and dimensionality that it lacked in the VHS/television transfers of the 90s. (Not so surprising given the format, but interesting.) In fact, the movie’s aesthetic generally looks so authentic, lived-in, and fine-grained, especially in comparison to many contemporary films of a similarly commercial/family-centric ilk. Various settings and visuals in the film remain believable, just like the viewings in the old days. But now they are also richly nostalgic.  \n\nPut simply, they don’t make movies quite like this anymore. The visual design of the film isn’t necessarily overproduced or showy, but it’s so expertly presented and crafted. Paired with the film’s beautiful and openly sentimental tone, this makes for a very emotional yearly viewing experience. \n\nLastly, with each passing year I find myself appreciating more deeply just how much Roberts Blossom brings to this movie.",
        "upvotes": 1347,
        "comments": 921,
        "media": null,
        "permalink": "/r/movies/comments/1pxxpd0/those_who_watched_home_alone_for_the_millionth/"
    },
    {
        "id": "1py4tsu",
        "author": "BunyipPouch",
        "title": "Marilyn Granas, First Stand-In for Shirley Temple, Dies at 98",
        "content": "",
        "upvotes": 545,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cV6wEhIrjnReF91Zfmlp65uYNX3KN7oC8IFrIU5_O_Y.jpeg?auto=webp&amp;s=2762d4bd5afaf3dbc81a96b3f04c044bcc8de519"
        },
        "permalink": "/r/movies/comments/1py4tsu/marilyn_granas_first_standin_for_shirley_temple/"
    },
    {
        "id": "1pxnnoq",
        "author": "JeanMorel",
        "title": "RIP Brigitte Bardot (1934-2025)",
        "content": "The Brigitte Bardot Foundation announced on Sunday the death of the icon of 1950s femininity, film actress, singer, muse and inspiration to great artists, but also an animal rights advocate.\n\nShe was undoubtedly one of the greatest French and global stars, an icon of a generation, a symbol in her own way of the emancipation of women and sexual freedom: Brigitte Bardot passed away on Sunday, December 28, 2025, at the age of 91, her Foundation announced to AFP.\n\nBrigitte Bardot was [hospitalized in Toulon in November](https://www.franceinfo.fr/culture/cinema/brigitte-bardot/brigitte-bardot-rassure-sur-son-etat-de-sante-et-se-declare-en-convalescence_7649732.html) and underwent surgery. She was also hospitalized in January 2023 due to respiratory failure. An actress and singer known by her initials, \"BB\" was part of France's cultural heritage, but she also dedicated a large part of her life to animal rights.\n\nFrom the moment she appeared on the film scene, she revolutionized attitudes. Curves to die for, a sensual yet innocent way of moving… She would be the most beautiful woman in the world. Brigitte Bardot, the young woman from a privileged background in Paris, dreamed, like many little girls, of a career as a dancer. Very quickly, she became a model and landed her first role in \\* *Le Trou normand\\** alongside Bourvil.\n\nFrom then on, she was a force to be reckoned with, and much to her parents' dismay, Roger Vadim, then a young film assistant, became her mentor. A year later, at the Cannes Film Festival, the young actress caused a sensation on the Croisette, driving the photographers wild.\n\nBardot was already on par with the stars of the time. Kirk Douglas, captivated, tried to lure her to the United States. Behind the scenes, Vadim continued to mold her and finally obtained the right to marry her in 1952. She had just turned 18.\n\n*And God Created Woman* , the first film directed by her husband. She was 22 years old, and it was primarily in the United States that the film caused a scandal. \"And God created Bardot,\" the Americans say. France then embraced the myth of the young Frenchwoman. A global star was born.\n\nIt's 1958, and Bardot, now BB, is the embodiment of the free woman. A fashion phenomenon. An entire generation dresses, does their makeup, and styles their hair like her. Everything she touches turns to gold. And it's opposite Jean Gabin in the film \" *En cas de malheur\" (In Case of Emergency* ) that she will reveal her acting talents.\n\nIn 1960, she starred in her favorite film, *La Vérité* , directed by Henri-Georges Clouzot, a story of a crime of passion. It was then her foray into the New  Wave, with Jean-Luc Godard and Michel Piccoli, that would leave a lasting impression on film buffs. This was the legendary *Contempt* at the Villa Malaparte in Capri, and her famous line: *\"Can you see my backside in the mirror? -Yes. -Do you think my buttocks are pretty? -Yes... very.\"*\n\nMen came and went in Bardot's life  : Vadim, Trintignant, Charrier. Her second marriage to the latter ( [who died in September  2025](https://www.franceinfo.fr/culture/cinema/le-comedien-jacques-charrier-deuxieme-mari-de-brigitte-bardot-et-pere-de-son-fils-est-mort-a-l-age-de-88-ans_7474855.html) ) was short-lived, but she had a son with him, Nicolas, who was raised by his father. Bardot became the symbol of all French people as Marianne, before finding herself, towards the end of the 1960s, a new Pygmalion in Serge Gainsbourg.\n\n# The hysterical crowd at the 1967 Cannes Film Festival\n\nOn the occasion of the release of Louis Malle's *Viva Maria* , starring Jeanne Moreau, she said of her: *\"Watching her walk is like listening to great music.\"* A second marriage followed, this time to Gunter Sachs. The couple faced the hysterical crowds at the 1967 Cannes Film Festival. Brigitte Bardot could no longer bear the public life.  \n  \nA few unlikely films followed: *Les Novices* with Annie Girardot, *Les Pétroleuses* with Claudia Cardinale, *and Shalaco* with Sean Connery. From this period emerged only one charming comedy by Michel Deville, *L'Ours et la Poupée (The Bear and the Doll)* , where she finally played a tender character opposite Jean-Pierre Cassel. She finally worked under the direction of Nina Campanez and deflowered Francis Huster's character. When the film was released in 1973, no one yet knew it would be her last. She was 39 years old and wanted a change of pace.\n\nThe myth of the most beautiful woman in the world will continue to resonate in the annals of cinema. But it is elsewhere that she will play the role closest to her heart. It is now at La Madrague, in Saint-Tropez, surrounded by her dogs, that Brigitte Bardot is launching her new crusades for animal rights.\n\nIn 1977, she denounced the slaughter of baby seals. For the public, a new Bardot had just been born. A five-day trek across the Canadian polar ice caps led to a ban on the seal fur trade. But the media pressure was too intense, and BB was not yet taken seriously.\n\n# From the free woman to the conservative woman\n\nNine years later, she was selling personal belongings, jewelry, and memorabilia from her former profession. Three million francs were raised to fund her foundation and allow her to dedicate herself more fully to the protection of all oppressed animals. She also bequeathed her property to the foundation. From the abandonment of pets to animal experimentation, and even the hunting of turtledoves, she was involved in every fight. But, little by little, the free-spirited young woman of the 1950s gave way to an increasingly conservative, even reactionary, woman.\n\nBy marrying Bernard d'Ormale, an industrialist with ties to the National Front, she demonstrated her affinity for Jean-Marie Le Pen's ideas. The publication of her memoirs was surprising due to her aggressive, even racist, positions. This is also why she was convicted in 2003, following her statements about the slaughter of sheep during the Muslim festival of Eid al-Adha.\n\n*“Freedom is being yourself, even when it’s unsettling,”* proclaims Brigitte Bardot in the epigraph to her book, \\* *Mon BBcédaire\\* (Fayard Publishers)* , released on  October 1, 2025, in which she shares her views on the world. From the letter A for abandonment to the letter Z for zoo, Bardot writes a few lines on chosen words and the names of places or people she has known. In eroticism, the actress sees *“games of love where everything is permitted with imagination, unsettling perversity, and amorous mischief.”* The animal rights activist believes that France has *“become dull, sad, submissive, sick, damaged, ravaged, ordinary, vulgar…”* The right wing is the “ *only urgent remedy for France’s agony,”* adds the woman who has openly acknowledged her affinity with Marine Le  Pen  (National Rally).\n\nAs an actress, animal rights activist, and citizen, Bardot always spoke with the same freedom, even at the risk of causing a scandal. That's what we'll remember about her life.",
        "upvotes": 6550,
        "comments": 488,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TTAuuplnPGYq8XghDa4jlOcme0UvzI_veKh2wWWEKHc.jpeg?auto=webp&amp;s=dec55033a8c31a0539adade121871789551a26c9"
        },
        "permalink": "/r/movies/comments/1pxnnoq/rip_brigitte_bardot_19342025/"
    },
    {
        "id": "1pxuzaj",
        "author": "MarvelsGrantMan136",
        "title": "Simu Liu’s ‘Sleeping Dogs’ Movie Lands Director Timo Tjahjanto (‘The Night Comes for Us’, ‘Nobody 2’)",
        "content": "",
        "upvotes": 1693,
        "comments": 152,
        "media": null,
        "permalink": "/r/movies/comments/1pxuzaj/simu_lius_sleeping_dogs_movie_lands_director_timo/"
    },
    {
        "id": "1py17e1",
        "author": "TheBuzzTrack",
        "title": "Adam Savage learns about VistaVision filming cameras at Paramount Pictures",
        "content": "Adam Savage visits the archives at Paramount Pictures, where he and Joey Fameliused get to examine and learn about the history of VistaVision film cameras. Charlotte Barker, Paramount's Director of Film Restoration and Preservation, shows examples of this groundbreaking widescreen format and the inventive ways VistaVision used 35mm film. ",
        "upvotes": 672,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SUsbS_26S_wKjtsokxPmXUXtAM-NFCTssQrfi4j1gwU.jpeg?auto=webp&amp;s=60cabb72bc8448529e459848de63a18d13e9e7f3"
        },
        "permalink": "/r/movies/comments/1py17e1/adam_savage_learns_about_vistavision_filming/"
    },
    {
        "id": "1pxlpmq",
        "author": "WerewolfCurious1412",
        "title": "Why did all the Judd Apatow style films burn out so fast?",
        "content": "Knocked Up, 40 Year Old Virgin and one of my faves This is 40 burned bright, but for a very short amount of time. \n\nI’ve always enjoyed the raunchy comedy that was still filled with a lot of heart and characters you can relate to.\n\nJudd Apatow was the king, now you never hear his name spoken. \n\nAny theories as to why that might be? ",
        "upvotes": 6337,
        "comments": 1710,
        "media": null,
        "permalink": "/r/movies/comments/1pxlpmq/why_did_all_the_judd_apatow_style_films_burn_out/"
    },
    {
        "id": "1pybp8q",
        "author": "herewego199209",
        "title": "I know most producers can't use hindsight when casting, but after watching most of Eric Stoltz's performances, I cannot see him ever being Marty McFly in back to the future. Bob Zemeckis going back and getting Michael J Fox may be the biggest casting decision of all time in movies.",
        "content": "When you watch Back to the Future the CGI and  script are both outstanding and way ahead of its time, but man that movie  does not work unless they get the casting of Marty and Do Brown right and they absolutely nailed it. No other actors could play this roles, and,  it's up there for truly two of the most iconic performances of all time to me. I've seen small pieces of footage from Stoltz and it doesn't even look like the same character. ",
        "upvotes": 145,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1pybp8q/i_know_most_producers_cant_use_hindsight_when/"
    },
    {
        "id": "1pyhz3j",
        "author": "KyriakosCH",
        "title": "Which movie will Mickey Rourke be mostly remembered for?",
        "content": "[Angel Heart](https://preview.redd.it/x21vgqp134ag1.png?width=1287&amp;format=png&amp;auto=webp&amp;s=d739c022cba59b549ca06d568a01f05655e705d3)\n\nMy favorite of his - and likely my favorite movie in general - is Angel Heart. He certainly carries it. I think he deserved far better than he got as he clearly is a great actor and not the usual one-trick pony. I am sad that his life story was so tragic. Perhaps he will be more recognized after death - which is still unfair.",
        "upvotes": 49,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1pyhz3j/which_movie_will_mickey_rourke_be_mostly/"
    },
    {
        "id": "1py4v4v",
        "author": "talon007a",
        "title": "What are the greatest films with \"never made\" sequels?",
        "content": "I'm watching 'E.T. the Extra Terrestrial' and remembering there was a sequel idea. Thank God they never made it. Any other ideas that were better left unmade? There aren't many. 'Titanic 2'? Looking at the all time list and most had, or are, sequels. Hollywood doesn't leave much untouched. Not many were refused when you look at the top... 100!?",
        "upvotes": 319,
        "comments": 535,
        "media": null,
        "permalink": "/r/movies/comments/1py4v4v/what_are_the_greatest_films_with_never_made/"
    },
    {
        "id": "1py43r1",
        "author": "Dangerous-Visual1643",
        "title": "Just rewatched Deep Impact for first time in years. 90s disaster movies are everything",
        "content": "Saw Deep Impact was leaving Netflix tomorrow and decided to watch it because I watched it like 20 years ago. It was sooooo good.\n\nDisaster films have been my go-to for as long as I remember because of 90s disaster movies from my childhood.\n\nI enjoy all kinds of diaster movies including cheap syfy ones from 2010s, but 90s movies were something else.\n\nDeep impact, Armageddon, Outbreak, Twister, Dante's peek, Volcano etc....\n\nThe drama, action and last but not least the disasters themselves were so fascinating inaccurate as they may be.\n\nI developed a bit of a prepper mind as a child because of these movies, and frankly it was a blast. I checked out books from libraries about surviving in the wild in a deserted island, rainforest, north pole etc. Wanted to be a vocanologist, virologist for a while\n\nAnd the human drama! People say they are melodramatic, but people in real life are more melodramatic and is more realistic than people admit to themselves imho\n\nAs much as I love disaster movies that are more factual and cool that have been coming out since then, 90s disaster movies had something special and, should I say, more human.\n\nWatching Deep Impact made me want to talk about these 90s disaster films so much. People around me don't get my passion for these movies🥲\n\n",
        "upvotes": 210,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1py43r1/just_rewatched_deep_impact_for_first_time_in/"
    },
    {
        "id": "1py7jvj",
        "author": "browniebiscuitchildr",
        "title": "What’s the most quotable movie of all time?",
        "content": "Alright, I’m no movie buff. I’m no connoisseur. But from what I’ve watched, especially the stuff that’s near and dear to my heart, the quotability of Mean Girls genuinely needs to be studied.\n\nEveryone knows “fetch” and “get in, loser, we’re going shopping,” but even the lines that barely make sense and shouldn’t be funny or memorable on paper somehow just are.\n\n“Four for you, Glen Coco! You go, Glen Coco!”\n\n“Oh my God, Danny DeVito! I love your work!”",
        "upvotes": 131,
        "comments": 1167,
        "media": null,
        "permalink": "/r/movies/comments/1py7jvj/whats_the_most_quotable_movie_of_all_time/"
    },
    {
        "id": "1py60m3",
        "author": "PopCultureWeekly",
        "title": "What trailer was better than the movie itself?",
        "content": "I’m super curious to see what trailer got you all excited at how good it was, then you watched the movie and was like “Wtf???” \n\nWould love to hear what you guys were severely disappointed in. Mine would have to be Avatar 2. The trailer was incredible but I just didn’t really love the actual film. I was highly disappointed in it. \n\nWhat’s yours? ",
        "upvotes": 143,
        "comments": 708,
        "media": null,
        "permalink": "/r/movies/comments/1py60m3/what_trailer_was_better_than_the_movie_itself/"
    },
    {
        "id": "1py7zyh",
        "author": "Fit-Inflation-7693",
        "title": "Nacho Libre (2006)",
        "content": "I just re-watched this bad boy for the first time since I was 10. Still a phenomenal movie but I didn't expect to get emotional during the final match when the orphans show up for Nacho and it gave him the strength to defeat Ramses.He found his purpose and thats what truly gave him eagle powers! What a great follow-up movie to Napoleon Dynamite for Jared Hess. Bravo.",
        "upvotes": 88,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1py7zyh/nacho_libre_2006/"
    },
    {
        "id": "1pyb7nl",
        "author": "elohi-vlenidohv",
        "title": "Recommendations for good movies that could help teach a person about Western Cultural values?",
        "content": "I have a strange request. My family and I are originally from a non-western country but we were raised the Western values and live in a Western country. We have a new family member who is from our original culture, and is struggling to wrap their head around certain cultural values that clash with each other and as a result, is exhibiting some toxic tendencies in their relationship. They are otherwise a really lovely person. No matter how hard I’ve tried to talk to them about these opposing values, they don’t seem to get it. \n\nSo are there any good movies that I can show them, so that they can see that certain Western values such as independence in a relationship, the toxicity of co-dependent relationships, mix-gender friendships that do not threaten relationships, individual freedom, empowerment, and feminism — are actually good, and not evil incarnate like their culture has led them to believe. \n\nAm I making sense? ",
        "upvotes": 39,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1pyb7nl/recommendations_for_good_movies_that_could_help/"
    },
    {
        "id": "1py9ebx",
        "author": "CBSnews",
        "title": "\"Hail and farewell\": A tribute to those we lost in 2025",
        "content": "",
        "upvotes": 45,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uZAKDurvjXkHS1Co_AKRHfPEjIPpfojckaN7Q33kykg.jpeg?auto=webp&amp;s=319d39ecb6adcb7dbe92df8d2822a58a223b2675"
        },
        "permalink": "/r/movies/comments/1py9ebx/hail_and_farewell_a_tribute_to_those_we_lost_in/"
    },
    {
        "id": "1pyaa1o",
        "author": "Figaro90",
        "title": "Do you think Jonathan Brandis would have had a comeback?",
        "content": "So with all the actors that we loved growing up in the 90s, I have always wondered if we would  have seen a Brandis come back. His suicide was always pretty sad. According to his wiki, he had a role in Harts war that he was hoping would have been his comeback, but if you watch the clip on youtube, it's such a small role I'm not sure why he thought that (unless he had more scenes I haven't seen). Macaulay Culkin, Brenden Fraser, Ke Huay Quan, Ralph Macchio, etc. All of them had some sort of come back. ",
        "upvotes": 37,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1pyaa1o/do_you_think_jonathan_brandis_would_have_had_a/"
    },
    {
        "id": "1py0abw",
        "author": "ElectricalTitle9530",
        "title": "Any movies where the 1980s are the future?",
        "content": "I was thinking about Back to the Future where 2025 is the future while 1985 is the present and 1955 and 1885 is the past. \n\nBut is there a movie made prior to the 1980s that takes place in the \"future\" of the 1980s??\n\nI'm guessing one Twilight Zone episode does this. I'm not sure what time period The Jetsons took place in. \n\nBut I'm wondering what a 1950 film would imagine 1983 would look like.  Did anyone attempt to set a futuristic movie in the 1980s?\n\nI can't think of any future movies except The Time Machine or Planet of the Apes that were made prior to the 1980s. The concept was too daunting. \n\nEdit: Thanks for this link: https://en.wikipedia.org/wiki/List_of_films_set_in_the_future\n\nThe ones that stand out are 2001 space Odyssey, mad max, future world, the abyss. 1984",
        "upvotes": 124,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1py0abw/any_movies_where_the_1980s_are_the_future/"
    },
    {
        "id": "1pxeh0k",
        "author": "7216345",
        "title": "What’s the worst performance by an actor who’s usually very good?",
        "content": "There are a lot of bad movies where the actors themselves weren't to blame. For example, I think many marvel movies are quite formulaic, but the actors in them still did a great job (such as RDJ and Chris Evans). \n\nBut it must be the case that even good actors sometimes underperform. What are some movies where a usually good actor did a bad job acting?",
        "upvotes": 3327,
        "comments": 3067,
        "media": null,
        "permalink": "/r/movies/comments/1pxeh0k/whats_the_worst_performance_by_an_actor_whos/"
    },
    {
        "id": "1pyba61",
        "author": "Sad_Lawfulness9459",
        "title": "Help my sister and I figure out what movie we watched 😫",
        "content": "Answered✅ I'm Thinking of Ending Things \nWe've googled and wondered an insane amount of times over the last 4 years so thank y'all😭 \n\nIn 2020 or 2021 (it seemed fairly new is why i include the year) my sister and I watched a movie with some people that we talk about to this day but for the life of us we can't remember/ figure out what it was. \nHere's all we remember please comment any idea you may have of what it is: Boy brings girl home to meet parents they're odd but it's vague/ we can't remember why then the house melts or distorts or something we think and when they leave they come across a random ice cream shop during their drive through a snow storm but then there's also an old man who is a janitor or something at a high school who gets snowed in in his truck at some point. \n",
        "upvotes": 25,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1pyba61/help_my_sister_and_i_figure_out_what_movie_we/"
    }
]