[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oiuegs",
        "author": "Action_Jackson_777",
        "title": "A House of Dynamite…🤦🏻",
        "content": "What are we doing here honestly? When you really sit back and think about it, this was a movie about nothing. No it is not a psychological, open-ended thriller that is meant to leave you guessing and interpret your own meaning. We didn’t need that many angles, that many countdowns and that many different perspectives. To each their own but the entire time I was DYING to know who sent the missile and what the appropriate response would be. We were given none of this. It’s like eating your veggies expecting a steak will come later and then it never comes. I don’t know about you but a movie like this is essentially pointless if we don’t at least get some sort of simulation as to what would happen next. Not to mention, they never even actually confirmed or denied that the missile made impact! What?!? This movie was all suspense, all buildup and no drop. Disagree all you want, after all it’s just an opinion but this left me dissatisfied and disappointed. 👎🏻",
        "upvotes": 91,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1oiuegs/a_house_of_dynamite/"
    },
    {
        "id": "1oiku9t",
        "author": "Rich-Masterpiece-156",
        "title": "Why has the quality of the shows gone downhill so bad vs previous years?",
        "content": "The shows use to be amazing, Dark, House of Cards, Ozarks, You (first and second season) Narcos, Archive 81. Compare these shows to what's out in the past year. There is a massive difference. Not just my opinion look at IMDB scores. Add to the fact Stranger Things is on its last season. ",
        "upvotes": 70,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1oiku9t/why_has_the_quality_of_the_shows_gone_downhill_so/"
    },
    {
        "id": "1oiknua",
        "author": "Biskotos",
        "title": "Can we talk a bit about the ending of \"A House Of Dynamite\"?",
        "content": "The whole movie was very nerve-wracking and made me feel so anxious however the ending was super anti-climactic. If you have watched it yet, what do you think about ",
        "upvotes": 17,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1oiknua/can_we_talk_a_bit_about_the_ending_of_a_house_of/"
    },
    {
        "id": "1oin5nz",
        "author": "Training-Entry-743",
        "title": "Ray Romano Joins Netflix's 'Running Point' Season 2 In Recasting",
        "content": "",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oin5nz/ray_romano_joins_netflixs_running_point_season_2/"
    },
    {
        "id": "1oixkhh",
        "author": "SativaStrong",
        "title": "Billionaires' Bunker",
        "content": "I'm two episodes in and I can't be the only one. The acting of the film director and the Overseer lady's brother made me cringe more than I ever have from a higher budget show. They gave me the feeling that I was watching a couple guys trying too hard to impress their acting teacher. It breaks the illusion of the show for me everytime I see them.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oixkhh/billionaires_bunker/"
    },
    {
        "id": "1oiw3jb",
        "author": "Rough_Abrocoma_5663",
        "title": "Horror!",
        "content": "Me and my girlfriend need a good scary movie to watch! we don’t watch much of them but trying to get more into the Halloween vibes! Can you recommend your favorite horror movie on Netflix pls and thank you!!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oiw3jb/horror/"
    },
    {
        "id": "1oi9lg0",
        "author": "Task_Force-191",
        "title": "‘One Piece’ Season 2 Sets March Release Date, Drops First Look at Luffy on Drum Island",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oi9lg0/one_piece_season_2_sets_march_release_date_drops/"
    },
    {
        "id": "1oix9dj",
        "author": "nesting-doll",
        "title": "USA vs UK",
        "content": "Serious question: Considering that Netflix originated in the US and is a US based company, why are their offerings in their home market so rubbish while their catalog in the UK is brilliant?  Also, why, when I watch in the US, am I absolutely inundated by ads, while in Britain, with exactly the same service, I see no ads at all?  Seriously! I’m not taking the piss.  Is Netflix just putting two fingers up at their own?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oix9dj/usa_vs_uk/"
    },
    {
        "id": "1oipqim",
        "author": "PudzMom",
        "title": "Is Virgin River available on the Standard with ads plan?",
        "content": "I know the majority of you don't like the plans with ads, but I'm trying to save money and basically just want to see season 6 of Virgin River right now  ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oipqim/is_virgin_river_available_on_the_standard_with/"
    },
    {
        "id": "1oikcdk",
        "author": "ISh0uldNotDoThat",
        "title": "Just watched Perfect Neighbor. Can someone confirm if Susan indeed searched \"Stand Your Ground\" laws on Google *before* the shooting?",
        "content": "Title. The cops strongly imply that she did during the interrogation, but it's never confirmed. If she did, then to me, this makes the incident a clear cut case of premeditated murder, rather than one of manslaughter.",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1oikcdk/just_watched_perfect_neighbor_can_someone_confirm/"
    },
    {
        "id": "1oivs44",
        "author": "Electronic_Animal_32",
        "title": "Perfect Neighbor",
        "content": "I’ve mulling this over. How could the tragedy be prevented so many people did not help the situation. The police should've known that this was going on for too long and it needed to be resolved permanently with either with talking to with her or a warning or something. The parents should‘ve talked among themselves and decided to always have an adult out there with the kids. Maybe the landlord should've done something evicted her for harassing the neighborhood children. I don't think anyone did enough to prevent this.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oivs44/perfect_neighbor/"
    },
    {
        "id": "1oitrcz",
        "author": "Abandonedinternally",
        "title": "Baby bandito",
        "content": "Has anyone watched baby bandito? It is some fun but also has some of the weirdest storylines. I just need to know if anyone knows what panda did with the girl who took his money? They show him put his hand over her mouth and take her in episode 5 or 6 I believe but never anything after that. That plotline just disappeared.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oitrcz/baby_bandito/"
    },
    {
        "id": "1oilfzi",
        "author": "Nervous_Parsnip69",
        "title": "Issues when watching shows in full screen",
        "content": "Hey so for as long I can remember when I got my asus pg27ucdm I have been having issues watching any Netflix show in full screen,it keeps cutting of 3/4th of the video and I’m pulling my hair out trying to figure out why.\n(I’ll include a YT short showing my issue (was watching dahmer )\n\n(I hope btw I’m not breaking any rules)\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oilfzi/issues_when_watching_shows_in_full_screen/"
    },
    {
        "id": "1oi5546",
        "author": "wonhoppa",
        "title": "Physical: Asia - Discussion",
        "content": "\n\nAmong the competitors are world-renowned icons:\n\n* **Korea:** UFC trailblazer Dong-hyun “Stun Gun” Kim leads a powerhouse squad featuring Olympic gold medalist Yun Sung-bin, famed ssireum champion Kim Min-jae, Amotti (Physical: 100 Season 2 winner), Jang Eun-sil, and Choi Seung-yeon. \n* **Japan:** Yushin Okami, one of Asia’s most decorated MMA fighters.\n* **Australia:** Former UFC Middleweight Champion Robert “The Reaper” Whittaker.\n* **Philippines**: Boxing icon Manny Pacquiao, the only eight-division world champion in history.\n* **Thailand:** Muay Thai world champion Superbon.\n* **Mongolia:** Traditional wrestling star Orkhonbayar Bayarsaikhan.\n* **Türkiye:** Four-time oil wrestling champion Recep Kara.\n* **Indonesia:** Physique powerhouse I Igedz “Executioner”.",
        "upvotes": 12,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1oi5546/physical_asia_discussion/"
    },
    {
        "id": "1ohezqh",
        "author": "Virtual_Ad3412",
        "title": "A “House Of Dynamite “ has to be the worst produced film ever",
        "content": "If there is ever to be an award for worst film ever , look no further . Would never imagine such being released as a ‘film’ . There is no story , just anticipation from different points of view and movie accomplishes nothing, tells story of nothing , exposes nothing, results in nothing , accomplishes nothing . \n\nThe whole movie is literally is like 15mins of a war room on repeat for couple of hours . ",
        "upvotes": 477,
        "comments": 896,
        "media": null,
        "permalink": "/r/netflix/comments/1ohezqh/a_house_of_dynamite_has_to_be_the_worst_produced/"
    },
    {
        "id": "1oie444",
        "author": "Comfortable-Fan-607",
        "title": "Got a Netflix subscription, can’t change email",
        "content": "Basically I just got a subscription and I used the wrong email while making it. I want to change it but when I go to the account page to change it it keeps telling me “looks like something went wrong”. Idk what’s wrong with it. Pls help.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oie444/got_a_netflix_subscription_cant_change_email/"
    },
    {
        "id": "1oidtd0",
        "author": "Do_You_Pineapple_Bro",
        "title": "Unable to watch HoD",
        "content": "Is there something wrong with the system? I try to watch House of Dynamite, but it plays for like 5 seconds before saying \"Sorry, this title isn't available to be played immediately\", but everything else works perfectly fine.\n\nIt's not a parental lock or anything, it just doesn't want me to watch it...despite it being available",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oidtd0/unable_to_watch_hod/"
    },
    {
        "id": "1ohz669",
        "author": "Historical-Phrase106",
        "title": "Mob War has sent me on a deep dive…",
        "content": "I recently watched Mob War: Philadelphia, which lead me to Fear City… which lead me to Get Gotti and the Irishman… \nI just started The Sopranos:  two and a half decades after its debut… I’m way behind but I’m so glad to find captivating entertainment… ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ohz669/mob_war_has_sent_me_on_a_deep_dive/"
    },
    {
        "id": "1ohufij",
        "author": "Puzzleheaded-Web9066",
        "title": "Needing a new show!",
        "content": "I love finding a good series and then just going into essentially a portal 🔭. I cannot for the life of me find a new show to start and I’ve been trying for days. \n\nShows I love:\n\nCalifornication,\nGrey’s Anatomy,\nThe Wire,\n24,\nThe Morning Show, \nBetter Things,\nSchitt’s Creek,\nShameless, \nGIRLS (HBO),\nRunning Point,\nNobody Wants This,\nMistresses,\nRevenge,\nIndustry,\nAbbot Elementary,\nSuits,\nBig Sky,\nLincoln Lawyer \n\n\nI am not into sci-fi, horror or thrillers! HELPPP! Thank you! ",
        "upvotes": 19,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1ohufij/needing_a_new_show/"
    },
    {
        "id": "1ohhtte",
        "author": "ArtIsDead77_",
        "title": "House of Dynamite",
        "content": "I know there are handful of people on this sub who did not enjoy this film. \n\nI, however very much liked it. I loved the score, I loved the tension, and I loved the acting. \n\nI loved that the film was told through different characters point of view… It definitely was not a chronological narrative so to say which is fine because it’s a different style of story telling… (Babel). \n\nI know some people didn’t enjoy the ending (cliffhanger) but it’s up for interpretation. I think the Bomb went off and I think the audience not been informed of who launched the bomb also worked quite nicely. \n\nI think it’s okay if you don’t like it, and it’s okay if you do like it. So let’s stop shitting on other people’s opinions and quit trying to change their mind(s). \n\nI think the way how we watch media has changed. The rise of technology and acquiring information so quickly, has sort of shifted how we view movies. We want conclusions, we want information, we want the plot to be easy to follow, we want to know what exactly what happens. So it makes sense If there are a lot of people who are not really a fan of cliffhangers, which is OK. It’s just a different way of absorbing media.\n\n",
        "upvotes": 63,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhtte/house_of_dynamite/"
    },
    {
        "id": "1oh4o8i",
        "author": "mother_earth_13",
        "title": "Susan in “The Perfect Neighbor” premeditated the shooting, not Just a “fed-Up” old lady.",
        "content": "This started as a reply to a comment, but after seeing so many threads blaming the “permissive” parents or portraying Susan as a harassed senior defending her turf, I had to make it a post. The doc shows Susan’s actions were calculated, not reactive self-defense. \n\nI get the parental angle, I’d be extra vigilant too and would keep my kids away from someone like Susan with her cursing, petty aggressions and escalating beef. You never know what people are capable of so you should trust your instincts, but blaming the parents overlooks Susan’s premeditation.\n\nSusan told AJ’s kid to fetch his mom (knowing it’d bring AJ over), called 911 then shot AJ unarmed in under two minutes. Florida’s Stand Your Ground might cover perceived threats on your property, but why not wait for cops? Lock the door? Retreat inside? Aim non-lethally? The body cams, timelines and forensics scream intent, not fear.\n\nShe escalated from verbal abuse to physical by throwing skates and swinging umbrellas at AJ’s kid to provoke AJ. That’s baiting, not being “fed up.” Any parent would confront that. The trespassing and door-banging excuses ignore how Susan orchestrated it betting on the law to shield her.\n\nParents could’ve chosen differently in hindsight, but Susan had clear alternatives to killing. Someone that determined would’ve found a way regardless. \n\nAccountability’s on her.",
        "upvotes": 353,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1oh4o8i/susan_in_the_perfect_neighbor_premeditated_the/"
    },
    {
        "id": "1oi17ze",
        "author": "Prize-Track1335",
        "title": "I just watched Lost in Starlight",
        "content": "It's so beautiful, the animation, the futuristic style, the story... Could you recommend any hidden gems? Korean if possible. It's a 10/10 for me. I've seen most of Makoto Shinkai's work, but I suspect there are just as good directors that I might not know.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oi17ze/i_just_watched_lost_in_starlight/"
    },
    {
        "id": "1ohyxs1",
        "author": "dicedtomatoes55",
        "title": "'A House Of Dynamite' Would Have Worked Better As A Short Film. Hear Me Out.",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ohyxs1/a_house_of_dynamite_would_have_worked_better_as_a/"
    },
    {
        "id": "1ohwjdx",
        "author": "geemav",
        "title": "The problem with Animal Kingdom...",
        "content": "The acting is just so apparent! I'm trying not to be an overly harsh critic, I really do want to enjoy it, but just every moment from every character I'm reminded that they are *acting*. It feels like they are pretending... and in order for me to fall into a story I don't want to feel that way, I want to forget that I'm watching acting. You get what I mean? Does anyone else relate?",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ohwjdx/the_problem_with_animal_kingdom/"
    },
    {
        "id": "1ohrx7h",
        "author": "Other_Vegetable7640",
        "title": "‘Crash Bandicoot’ Animated Series in the Works at Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohrx7h/crash_bandicoot_animated_series_in_the_works_at/"
    },
    {
        "id": "1ogz75a",
        "author": "Boring_Sand_206",
        "title": "Hidden gems please",
        "content": "I have been unemployed since forever (not for lack of trying!) so I have watched A LOT of Netflix. I think I've watched pretty much everything worth watching on there. Anyone have some hidden gem recommendations for me??",
        "upvotes": 229,
        "comments": 557,
        "media": null,
        "permalink": "/r/netflix/comments/1ogz75a/hidden_gems_please/"
    },
    {
        "id": "1oi6trg",
        "author": "Notspcommonsense",
        "title": "How to find a bing buddy?",
        "content": "I simply cannot be watching supernatural alone. I need someone to hold me to it. How to find a show buddy? I know there’s people out there. Many shows I have a hard time watching because I get disinterested between plot points but if I’m watching with someone it feels tolerable. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oi6trg/how_to_find_a_bing_buddy/"
    },
    {
        "id": "1ohhaze",
        "author": "peoplemagazine",
        "title": "Joe Keery Officiates Friends' Wedding Dressed as His Stranger Things Character Steve Harrington",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhaze/joe_keery_officiates_friends_wedding_dressed_as/"
    }
]