[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1gzmerx",
        "author": "fenderfable",
        "title": "Ma perchè è così difficile trovare un appartamento a 500 euro?",
        "content": "Cioè è davvero troppo bassa questa cifra per un bilocale? Se sì, cosa differenzia Torino da Milano a questo punto?\n\nIo cerco da tre mesi, o la gente mi sfancula (sono un dipendente indeterminato con ccnl banche e assicurazioni) dicendomi che o l'hanno già affittata o sono in trattativa, altri non rispondono, altri 500 euro e 300 euro di spese condominiali, altri sono bellissimi appartamenti a barriera, e altri annunci sono di AP Madama o AffittoPrivato che sono quei fuffa truffa che ti chiedono 250 euro per mandarti dai proprietari e poi scompaiono rubandoti i soldi.\n\n  \nNon lo so, sono disperato, ho scritto in gruppi facebook anche per una stanza, niente.\n\nNon trovo niente.",
        "upvotes": 25,
        "comments": 41,
        "media": null,
        "permalink": "/r/torino/comments/1gzmerx/ma_perchè_è_così_difficile_trovare_un/"
    },
    {
        "id": "1gzqfe7",
        "author": "lore_mila_",
        "title": "Qualcuno ha partecipato a questo evento o simili? Consigliate?",
        "content": "",
        "upvotes": 7,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dwiyn59of33e1.jpeg?auto=webp&amp;s=c6954639504b9b1a728bcbaf3ef560f02db93023"
        },
        "permalink": "/r/torino/comments/1gzqfe7/qualcuno_ha_partecipato_a_questo_evento_o_simili/"
    },
    {
        "id": "1gzuicv",
        "author": "slight_choice_",
        "title": "Chi si ricorda la canzone \"Torino tropicale\" (~2019)??",
        "content": "Genere elettronica tipo house (mi sembra), l'avevo sentita all'ultima street parade di carnevale al valentino prima del covid (febbraio 2020). Era stata anche pubblicata online da qualcun* perché l'avevo riascoltata qualche volta, ma poi è completamente sparita da internet e ora è introvabile.\nMe la sono ricordata da poco ed era fighissima, che fine ha fatto?\nNon ricordo di chi fosse ma il testo era: \"Torino tropicale, chiudo gli occhi e vedo il mare\" &lt;3",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gzuicv/chi_si_ricorda_la_canzone_torino_tropicale_2019/"
    },
    {
        "id": "1gzwq4q",
        "author": "Odd-Refrigerator-755",
        "title": "Dentista convenzionato",
        "content": "Ciao! Sono nuovo a Torino. \nI denti del giudizio mi stanno spuntando e il dentista dell'ASL mi ha suggerito, prima di procedere con l'estrazione, di fare una panoramica dei denti in un centro convenzionato (all'ASL mi ha esplicitamente detto che ci avrei messo una vita). Stupidamente, non ho chiesto quali fossero. Ne conoscete qualcuno? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzwq4q/dentista_convenzionato/"
    },
    {
        "id": "1gzcpiz",
        "author": "itslilou",
        "title": "Dove posso avere una vista sulle Alpi senza un'auto?",
        "content": "Ciao! Le Alpi sono belle e innevate e vorrei trovare un posto con i mezzi pubblici accessibili per sedermi e guardarle. Hai qualche consiglio, forse alcuni parchi o aree casuali che hanno una vista aperta su di loro? Oltre alla Mole e al Parco Europa. Grazie!",
        "upvotes": 15,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1gzcpiz/dove_posso_avere_una_vista_sulle_alpi_senza_unauto/"
    },
    {
        "id": "1gzkekd",
        "author": "BlueLights420",
        "title": "Serate il giovedì sera",
        "content": "Ciao a tutt* 🫶🏻 come da titolo vorrei chiedere se esiste qualche serata carina a Torino dove andare a ballare il giovedì sera (se techno ancora meglio). Grazie ❤️ ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzkekd/serate_il_giovedì_sera/"
    },
    {
        "id": "1gzew4y",
        "author": "papafrancesco3611",
        "title": "Lavanderia cenisia",
        "content": "Ciao a tutti, qualcuno ha avuto qualche esperienza con qualche buona lavanderia per giubbotti (in piume)? Sono stato l’anno scorso in una a via Monginevro ma mi hanno restituito il cappotto in condizioni abbastanza pessime. Diciamo come zona in un raggio di un km dalla mcfit di corso Ferrucci (anche poco in più se ne vale la pena)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzew4y/lavanderia_cenisia/"
    },
    {
        "id": "1gz99c8",
        "author": "Over-Line-1269",
        "title": "Kappa Futur 2025",
        "content": "Looking for people to connect with that are going! I’m coming from Australia on my own and would love to link up with people! \nFemale, 35 years old 💃 ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gz99c8/kappa_futur_2025/"
    },
    {
        "id": "1gzg1gz",
        "author": "MaRwan_2079",
        "title": "Accommodation cost in torino",
        "content": "I want to go study in torino(as international student) \nSo Iam wondering what is the accommodation cost for student\n(Private room or shared room) in apartment in (city center or in the other areas)\n",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gzg1gz/accommodation_cost_in_torino/"
    },
    {
        "id": "1gzg7zm",
        "author": "Herofrancy",
        "title": "Torino Xmas comics",
        "content": "Da quello che so, esiste un'area 18+ al Torino comics. Per accedervi serve la carta d'identità?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gzg7zm/torino_xmas_comics/"
    },
    {
        "id": "1gzhhul",
        "author": "Sorry_Carrot7537",
        "title": "cerco gente con cui uscire ",
        "content": "innanzitutto buongiorno o buonasera, sono un ragazzo di 19 anni, sono siciliano e mi sono trasferito a Torino da poco, o comunque per il momento sono qui. Cercavo qualcuno con cui uscire, uomo o domna che sia non mi importa, l'importante è che sia una persona simpatica, ho diversi hobby uno dei tanti è lo sport, pratico calisthenics. ci sarebbero molte altre cose da sapere ma inutile che sprechi il mio tempo qui con migliaia di gente che leggerà il post e probabilmente non lo considererà neanche, quindi boh, se a qualcuno per caso andrebbe di conoscere nuova gente io sono più che disponibile. (avevo già fatto un post simile qualche giorno fa ma non è andato a buon fine, quindi ripropongo sperando vivamente di trovare qualcuno)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gzhhul/cerco_gente_con_cui_uscire/"
    },
    {
        "id": "1gz5k70",
        "author": "Agreeable-Program-68",
        "title": "Looking for a Badminton Partner!",
        "content": "\n\nHi everyone, I am an international student of Polito . I’m looking for a badminton partner to play with regularly. \nHere are some details:\n\n\t•\tLocation: Corso Re Umberto, 133\n\t•\tAvailability: weekends\n\t•\tEquipment: I have my own racket and shuttlecocks, but feel free to bring yours too!\n\nIf you’re interested in joining for some games, feel free to message me! \n\nLooking forward to hearing from you!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gz5k70/looking_for_a_badminton_partner/"
    },
    {
        "id": "1gzdig6",
        "author": "_L_-",
        "title": "Cercasi fotografo non professionista ",
        "content": "Cerco fotografo non professionista per dei ritratti in qualche zona bella di Torino. Banalmente vorrei foto per Instagram, LinkedIn, Tinder etc\n\nLasciate il vostro Instagram magari :) \n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gzdig6/cercasi_fotografo_non_professionista/"
    },
    {
        "id": "1gyxl6m",
        "author": "OwnUse9143",
        "title": "University of Turin",
        "content": "Hi What should we consider when applying to the University of Turin for a Bachelor's in Business and management? (Non-eu)\nAre they looking for something in particular?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gyxl6m/university_of_turin/"
    },
    {
        "id": "1gyo10j",
        "author": "Royal_Lime6493",
        "title": "Nuove Conoscenze",
        "content": "Ciao, M27 (ma me ne danno sempre 15) in zona Pozzo Strada. Cerco coetanei con interessi simili ai miei, ho proprio bisogno di una nuova comitiva. Non bevo ma un giro al bar non è fuori discussione. Nella vita faccio l'Illustratore Freelance e il traduttore di inglese. Da buon nerd mi interesso di film e videogiochi.\n\n",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gyo10j/nuove_conoscenze/"
    },
    {
        "id": "1gy3jzd",
        "author": "SteamPaz",
        "title": "Venere su Via Roma",
        "content": "",
        "upvotes": 127,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ausi38miho2e1.jpeg?auto=webp&amp;s=d0cea1c108d1df5d6bd33f298fa535ebe4f4cef1"
        },
        "permalink": "/r/torino/comments/1gy3jzd/venere_su_via_roma/"
    },
    {
        "id": "1gyt34s",
        "author": "opaco_",
        "title": "Dove comprare Tartufo Nero a Torino?",
        "content": "Conoscete qualche negozio che propone tartufo nero a buon prezzo pur essendo dentro Torino?\nGrazie",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gyt34s/dove_comprare_tartufo_nero_a_torino/"
    },
    {
        "id": "1gy1aym",
        "author": "Gintokoz",
        "title": "NON E' POSSIBILE",
        "content": "Ogni volta che si deve organizzare un uscita tra amici (siamo tutti studenti), sono sempre lontano da tutta la movida o da qualsiasi locale tranquillo. Qualcuno che vuole fare nuove amicizie? Sono M29, vicino a zona Bengasi. :D",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1gy1aym/non_e_possibile/"
    },
    {
        "id": "1gxu6km",
        "author": "FriendlyRaisin3789",
        "title": "Tech expats in Torino",
        "content": "Hey guys, after 20 years around the world, having lived in the US, Australia, UK, Dubai, Spain and a bunch of other countries/cities, my family and I are considering settling in Torino.\n\nReason being, we love Italy and Torino seems to have it all.\n\nWe don't have office jobs, so any city would do. Still, we are semi-sold on this beautiful city. And we speak perfect Italian, so culture and language is not an issue.\n\nI'd love to know if there are immigrants who went through a similar journey.\n\nHow do you find living in Torino in terms of making friends, networking with like minded peers, kindness / openness of people and overall city vibe?\n\nIt's be amazing if you could mention the city where you relocated from, to keep the comparison in context.\n\nThanks and I look forward to reading about your experience!",
        "upvotes": 19,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gxu6km/tech_expats_in_torino/"
    },
    {
        "id": "1gxzqi1",
        "author": "KatmaRita",
        "title": "Sending postcards",
        "content": "I am leaving Turin tomorrow and wondering if anyone knows if I can mail postcards from the Turin airport. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gxzqi1/sending_postcards/"
    },
    {
        "id": "1gxbv48",
        "author": "signordado",
        "title": "Side quest: toret ",
        "content": "É da un anno che ho iniziato la quest personale: bevi da tutti i toret della cittá, al momento sto tenendo traccia della cosa a mente ma dubito il mio potentissimo cervello sia all'altezza del compito, per questa ragione chiederei a voi popolo dell'internet consiglio su modi pratici e comodi per \"mettere la spunta\" a ciascuno dei suddetti erogatori idrici dopo essermici rifocillato. \n\nGrazie a tutti in anticipo.\n\nPs: non intendo vandalizzare o scrivere sui toret, vorrei una mappa, conosco i love toret ma non mi sembra  ci sia modo di mettere delle note",
        "upvotes": 25,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gxbv48/side_quest_toret/"
    },
    {
        "id": "1gxhmnx",
        "author": "drogba3325",
        "title": "Hiking spots accessible by public transport",
        "content": "Hello guys, does any of you know hiking trials accessible by public transport from torino? Preferably begginer/moderate level. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gxhmnx/hiking_spots_accessible_by_public_transport/"
    },
    {
        "id": "1gxcxxn",
        "author": "SpamNThePowerItHolds",
        "title": "Mi consigliate qualche parrucchiere bravo a Torino?",
        "content": "Ciao! Mi sono trasferita a Torino ad aprile e da un mesetto cercavo qualche bravo parrucchiere che potesse sistemarmi il mio solito taglio shag. La scorsa settimana ho prenotato in questo salone che comunque aveva delle buone recensioni su google e mercoledì ho tagliato i capelli, ma onestamente è stata una delle esperienze peggiori della mia vita.  \nHo cercato di essere più chiara possibile nella descrizione del taglio ma nulla, sono uscita da lì e vi giuro che mi sembrava che non mi avessero proprio tagliato i capelli se non le punte e la frangia, per non parlare poi della piega... Me ne hanno fatta una che descriverei come \"da principessa\" quando ne avevo chiesta una molto mossa, che sembrasse disordinata o spettinata. Vi risparmio gli altri dettagli ma ci sono rimasta abbastanza male perchè non mi era mai successo che mi facessero un taglio così tanto diverso da quello che desideravo.\n\nQuindi ritorno alla domanda: avete qualche suggerimento per un bravo parrucchiere che faccia tagli anche un po' \"alternativi\", perchè sperimentare non mi dispiacerebbe affatto ma mi dovrei fidare. Grazie mille in anticipo a tutti!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gxcxxn/mi_consigliate_qualche_parrucchiere_bravo_a_torino/"
    },
    {
        "id": "1gxk2w4",
        "author": "albertot011",
        "title": "Fioraio ",
        "content": "Qualcuno saprebbe  consigliarmi un fioraio valido ma economico? Meglio se in zona Aurora o Vanchiglia. Grazie ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gxk2w4/fioraio/"
    },
    {
        "id": "1gx8dia",
        "author": "_L_-",
        "title": "Torino Film Festival ",
        "content": "Qualcuno è stato gli anni scorsi? So che inizia questo weekend ma volevo capire oltre alle proiezioni di film cosa comprendesse, ci sono conferenze o altro? ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gx8dia/torino_film_festival/"
    },
    {
        "id": "1gxcanu",
        "author": "Fabulous-Election826",
        "title": "Amicizie&amp;Conoscenze",
        "content": "Consiglio questa community su reddit per chi volesse trovare persone  \n[https://www.reddit.com/r/AmicizieConoscenze/](https://www.reddit.com/r/AmicizieConoscenze/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gxcanu/amicizieconoscenze/"
    },
    {
        "id": "1gx3io6",
        "author": "infinis_",
        "title": "Bus a corsa limitata?",
        "content": "Sono un'avida frequentatrice della linea 18 in direzione Barriera di Milano e premetto che mi sono trasferita qui da poco. Succede spesso che, salendo sul bus e arrivando alla fermata di Molinette Ovest, l'autista dica: 'Bus a corsa limitata, dovete scendere!' Tornando quindi in deposito e lasciando tutti i passeggeri a piedi ad aspettare il bus successivo.\nNon mi sembra che questa variazione della corsa venga mai indicata da nessuna parte sui segnali del bus, quindi cos’è questa storia?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1gx3io6/bus_a_corsa_limitata/"
    },
    {
        "id": "1gxdvgh",
        "author": "Dreskii88",
        "title": "[ Removed by Reddit ]",
        "content": "[ Removed by Reddit on account of violating the [content policy](/help/contentpolicy). ]",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1gxdvgh/removed_by_reddit/"
    },
    {
        "id": "1gwrml4",
        "author": "ivlia-x",
        "title": "Quanto costa il pedaggio Torino - Orio al serio?",
        "content": "Ciao a tutti_e,\n\nin dicembre dovrò andare a prendere mia madre dall’aeroporto di Bergamo. Cerco le soluzioni per arrivarci ma da ciò che vedo l’opzione migliore sarà semplicemente prendere la macchina… Qualcuno sa quanto costa il pedaggio? \n\nNon sono italiana, non ho il telepass etc - chiedo in anticipio per prepararmi se necessario",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1gwrml4/quanto_costa_il_pedaggio_torino_orio_al_serio/"
    },
    {
        "id": "1gwgqri",
        "author": "Own_Set_3018",
        "title": "Concerti metal e rock",
        "content": "Ciao\nSto cercando una compagnia per concerti Metal-Punk. \nSono un ragazzo di 23 anni e mi sono trasferito a Torino per studiare.",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1gwgqri/concerti_metal_e_rock/"
    }
]