[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nmjxtr",
        "author": "eddz_",
        "title": "Edisu temporary accomadation requiring my credit card information to be emailed to them",
        "content": "Hello, I am planning to take edisu's temporary accomadation and in order to confirm they want me to email them my credit card information. Is it considered safe to do that? Has anyone tried it",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fr342xilhgqf1.jpeg?auto=webp&amp;s=92c78b86e43c742b952eb94103f8bc18e8fffb8b"
        },
        "permalink": "/r/torino/comments/1nmjxtr/edisu_temporary_accomadation_requiring_my_credit/"
    },
    {
        "id": "1nm5y8l",
        "author": "_L_-",
        "title": "Acqua della doccia di merda a Torino",
        "content": "Trovate anche voi che l'acqua di Torino sia pessima sui capelli? Li rende crespi e li indebolisce. Voi cosa usate per contrastarla?\n",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nm5y8l/acqua_della_doccia_di_merda_a_torino/"
    },
    {
        "id": "1nmh4dj",
        "author": "Peregrineperceiving7",
        "title": "Parcheggi zona Porta Susa",
        "content": "Ciao a tutti, avrei bisogno di un consiglio come da titolo - in settimana io e la mia famiglia (che siamo della cintura) dovremo andare fuori città e abbiamo il treno molto presto all andata e tardi al ritorno,rendendo l arrivare in stazione coi mezzi problematico. Qual è l opzione migliore e più economica per parcheggiare nei dintorni della stazione? Grazie infinite per l aiuto!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nmh4dj/parcheggi_zona_porta_susa/"
    },
    {
        "id": "1nm23w8",
        "author": "Demiurgo_-_",
        "title": "Classe energetica appartamento",
        "content": "Ciao a tutti, sono andato a vedere un appartamento perché interessato all’acquisto. Mi è stato detto che è in classe energetica D. Andando però a leggere il consumo annuale kW h/m3 trovo 177.8691 annui. Leggendo diverse tabelle di appartamenti analoghi trovo che questo consumo sia appartenente ad una classe G. Potete aiutarmi a capire perchè dicono sia in D? ",
        "upvotes": 5,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u49ifozifcqf1.jpeg?auto=webp&amp;s=83287817e866794d43be2aa411a4103a9adec191"
        },
        "permalink": "/r/torino/comments/1nm23w8/classe_energetica_appartamento/"
    },
    {
        "id": "1nm8epb",
        "author": "Frengo_17",
        "title": "Baretto",
        "content": "Ciao a tutti, avrei bisogno di un consiglio, conoscete qualche bar che ha della buona birra, grazie",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nm8epb/baretto/"
    },
    {
        "id": "1nmasdx",
        "author": "TurbulentDragon",
        "title": "Ritrovi per giovani?",
        "content": "Ciao a tutti sono un fuori sede. Vorrei trovare ritrovi per persone tra i 20-30 anni, o principalmente fatti da queste. In generale giovani adulti e giovani.\n\nMi interessano cose come il disegno o la scrittura di poesie o leggere libri (onestamente è da un buon po' che non leggo ma vorrei riniziare e un gruppo di lettura potrebbe aiutare). Va bene anche qualcosa di sportivo ma sono sempre stato imbranato negli sport. Sono aperto un po' a tutto.\n\nTuttavia cercando online ho trovato corsi in generale per maggiorenni ma popolati principalmente da 40-60enni, non ho nulla contro di loro ma ovviamente facciamo fatica a connetterci e vorrei conoscere altre persone della mia età. Ho 23 anni.\n\nNon devono per forza essere dei corsi strutturati come può essere un corso di lingua (non sto dicendo che non vanno bene), ma anche ritrovi organizzati (ad esempio come quelli di Giochi in Taverna al Comala o Conceria) o club tipo club del libro.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nmasdx/ritrovi_per_giovani/"
    },
    {
        "id": "1nm9kca",
        "author": "Due-Effect-1606",
        "title": "Zona CPR(via Mazzarello/DeSanctis)",
        "content": "Quest'area nel titolo è morta? Pochissime attività, il CPR da poco riaperto...che voi sappiate sono previste iniziative di riqualificazione? Sarebbe un investimento lungimirante(appartamento )o al contrario, la zona specifica perderà valore?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nm9kca/zona_cprvia_mazzarellodesanctis/"
    },
    {
        "id": "1nlecoh",
        "author": "Tullio_Ostello",
        "title": "Poche persone riconosceranno questo circolo culturale",
        "content": "",
        "upvotes": 85,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ghkvekmzj6qf1.jpeg?auto=webp&amp;s=7158e33a9022b40d5ea1d9e6309a69652a7b58a6"
        },
        "permalink": "/r/torino/comments/1nlecoh/poche_persone_riconosceranno_questo_circolo/"
    },
    {
        "id": "1nm2yu8",
        "author": "Intelligent-Bell-120",
        "title": "RAVE CALLING",
        "content": "Tra pochi giorni ,RAVE in arrivo  \nHardTechno / Hardcore / Industrial Techno🖤\n\nlocation: Centro Di Torino\n\nSe ti interessa 👉 scrivimi in DM per i dettagli.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nm2yu8/rave_calling/"
    },
    {
        "id": "1nlczq5",
        "author": "krasnyj",
        "title": "Ma cosa mi dici mai",
        "content": "(a me sembra vada pure più veloce ora che c'è il cantiere che prima, poi boh)",
        "upvotes": 82,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1c4jjsfja6qf1.png?auto=webp&amp;s=8f32982da22619766ab7c898b5bf5793d64890d3"
        },
        "permalink": "/r/torino/comments/1nlczq5/ma_cosa_mi_dici_mai/"
    },
    {
        "id": "1nm0sma",
        "author": "Capital_Specialist95",
        "title": "Nuove Amicizie",
        "content": "Salve a tutti. Mi presento, F18 dalla provincia di Torino. \n\nSono all'ultimo anno delle superiori, ma mi piacerebbe programmare al meglio il mio futuro universitario. \n\nNell'anno accademico 2026/2027 frequenterò la facoltà di Storia all'UniTo e mi piacerebbe conoscere ragazze e ragazzi da tutta Italia (non solo Piemonte) con le mie stesse intenzioni.   \nNessuno dei miei attuali compagni si iscriverà agli studi umanistici e vorrei evitare di trovarmi da sola. \n\nQualcosa in più sui miei interessi: \n\n\\- Adoro la Marvel (l'MCU e gli X-Men); mi piacerebbe un sacco poterci poi organizzare per andare a vedere Avengers: Doomsday a fine 2026 tutti assieme come gruppo.   \nInoltre, mi piacerebbe organizzare un viaggio dopo la Maturità per andare al San Diego Comic Con il prossimo luglio. \n\n\\- Mi piace scrivere, leggere e disegnare. \n\n\\- Sono appassionata di filosofia, storia dell'arte e letteratura oltre che a storia. \n\nSe siete interessati, mandatemi un DM!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nm0sma/nuove_amicizie/"
    },
    {
        "id": "1nlwri0",
        "author": "SamSamuele",
        "title": "Monopolio immobiliare a Torino é uno scambio?",
        "content": "Mi sono recato presso i loro uffici e mi hanno chiesto un acconto per far partire il servizio di ricerca. Qualcuno ha avuto esperienza con questa \"agenzia\"?. Vorrei solo sapere se rischio di perdere solo la caparra, se dovrò dargli obbligatoriamente il restante o se si tratta di persone che ti aiutano davvero a trovare alloggi a Torino.",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nlwri0/monopolio_immobiliare_a_torino_é_uno_scambio/"
    },
    {
        "id": "1nlzvcr",
        "author": "Feisty-Pack7472",
        "title": "Orario dei treni",
        "content": "Ciao! A dicembre andrò a Ceva per vedere i miei amici. Devo prenotare un treno per tornare a Torino o avere un'idea degli orari dei treni per la seconda metà di dicembre, dato che devo tornare a Torino da Ceva in treno intorno al 19/12. L'orario dei treni non è attualmente disponibile e mi chiedevo se qualcuno che conosce l'orario fosse a conoscenza di treni che andavano da Ceva a Torino in questo periodo negli anni precedenti. Grazie!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nlzvcr/orario_dei_treni/"
    },
    {
        "id": "1nlzmcs",
        "author": "Feisty-Pack7472",
        "title": "Train Schedule",
        "content": "Hello!\nI am travelling to Ceva to see my friends in December. I need to book a train back to Torino or have some idea of the train schedule in the later half of December as I have to return to Torino from Ceva via Train around the 19/12. The train schedule isn’t available currently and I was wondering if anyone familiar with the schedule is aware of trains running from Ceva to Torino during this time in prior years. \nThank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nlzmcs/train_schedule/"
    },
    {
        "id": "1nlfa08",
        "author": "mariopast",
        "title": "Suggerimenti per come sopravvivere a Torino dopo essere stati truffati",
        "content": "Tristemente oggi la mia ragazza è atterrata a Torino, dove sta per iniziare un semestre Erasmus, solo per scoprire che il monolocale che aveva affittato non esisteva, e che il video e il contratto erano completamente false.\n\nQual è secondo voi il modo migliore per trovare una stanza in affitto in questo pessimo periodo per cercare? Avete qualche consiglio su quale agenzia affidarsi?\n\nGrazie in anticipo!",
        "upvotes": 23,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1nlfa08/suggerimenti_per_come_sopravvivere_a_torino_dopo/"
    },
    {
        "id": "1nltoo0",
        "author": "OldPen9536",
        "title": "Al volo | combattimento",
        "content": "Qualcuno che in zona piazza Pitagora abbia voglia di fare Kali, Silat o un po di boxe.\n\nAlternativamente anche lotta grappling (ma che in quel caso abbia voglia di spiegarmi qualcosa perché non son capace)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nltoo0/al_volo_combattimento/"
    },
    {
        "id": "1nll0bh",
        "author": "revengefabri",
        "title": "Dove andare a vivere in affitto?",
        "content": "Ciao a tutti, ho vinto un concorso pubblico con sede a Torino (in corso belgio). Sto quindi valutando adesso tutta una serie di immobili per andare in fitto, dove mi consigliate e sconsigliate di cercare? Sono senza auto. Grazie mille.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1nll0bh/dove_andare_a_vivere_in_affitto/"
    },
    {
        "id": "1nl4u5z",
        "author": "ImpressedGuy95",
        "title": "Ristoranti e Piole",
        "content": "Sono a Torino da poco e a breve verranno a trovarmi dei parenti. Potete consigliarmi dei posti con cucina tipica in cui portarli a pranzo e cena? ",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nl4u5z/ristoranti_e_piole/"
    },
    {
        "id": "1nlcysf",
        "author": "Alvarorrdt",
        "title": "Bouldering Torino",
        "content": "**Hi everyone!**\n\nI just arrived in Torino two days ago and I'm living in the Vanchiglia area. I'm really into bouldering and was wondering if anyone could recommend a good bouldering gym nearby.\n\nIdeally, I’m looking for a place that has a younger crowd (I’m 22M) so I can hopefully meet some people around my age. Also, a gym that offers monthly subscriptions without breaking the bank would be great — I’m on a student budget.\n\nThanks in advance for any tips or recommendations!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nlcysf/bouldering_torino/"
    },
    {
        "id": "1nlc6xs",
        "author": "Pucemi",
        "title": "Salone dell’auto di Torino",
        "content": "Ciao avevo visto tempo fa che recentemente fanno il museo dell aluto su instagram (se volete vi giro il link per chi non abbia capito)\ne avevo visto una sfilata di auto esotiche e ho scoperto che la fanno sabato e l’orario pero non ho capito dove. Per caso qualcuno sa rispondere  ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nlc6xs/salone_dellauto_di_torino/"
    },
    {
        "id": "1nky1d3",
        "author": "FriendlyCrow97",
        "title": "Aiuto – davvero internet qui fa così schifo?",
        "content": "Ciao Torinesi! Sono un argentino appena sbarcato in questa bellissima città e c’è una cosa che non mi fa dormire: l’internet.\n\nSono arrivato un mese fa, affitto un bilocale in Crocetta e lavoro da remoto. L’affitto include le spese e pure INTERNET. Peccato che qui abbiamo un modem 5G che va talmente male che per le call di lavoro devo usare l’hotspot del telefono… una tragedia.\n\nIl proprietario dice che il palazzo è vecchissimo e che ha già provato a mettere la fibra, ma prima bisognerebbe fare un investimento gigante che nessun vicino vuole pagare.\n\nQuindi mi chiedo: è normale così a Torino o il padrone non vuole spendere per un internet decente?\n\nMi pare assurdo pensare che in una città grande non arrivi la fibra… e lo dico io che vengo dal “terzo mondo” eh! 😅",
        "upvotes": 11,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1nky1d3/aiuto_davvero_internet_qui_fa_così_schifo/"
    },
    {
        "id": "1nkz6q5",
        "author": "Murky_Giraffe8700",
        "title": "Quale sarà per te il nuovo quartiere in cui acquistare un immobile?",
        "content": "Ciao a tutti,\n\nsto valutando l’acquisto di un immobile alle fine di questo anno ma, **quale pensate sarà il prossimo quartiere in cui conviene comprare a Torino?**\n\nparlo sia in ottica investimento che come qualità della vita (servizi, collegamenti, atmosfera del quartiere)\n\nHo vissuto a Borgo Vittoria, ma è davvero isolato per quasi tutto e da tutto ed è quasi impossibile viverci senza auto (il GTT fa schifo) senza nemmeno menzionare Baldissera \n\nVoi dove puntereste oggi? Ho visto Campidoglio, Santa Rita, Lingotto",
        "upvotes": 8,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1nkz6q5/quale_sarà_per_te_il_nuovo_quartiere_in_cui/"
    },
    {
        "id": "1nl1j2u",
        "author": "NomeUtente86",
        "title": "Preparazione esame di Maturità come privatista",
        "content": "",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nl1j2u/preparazione_esame_di_maturità_come_privatista/"
    },
    {
        "id": "1nlazsk",
        "author": "Friendly-Army-7729",
        "title": "nuove conoscenze a TO💕",
        "content": "ciao, mi chiamo Alessio e sono gay. Studio a Torino ma sono della Toscana. Vorrei conoscere più gente qua a Torino e nei dintorni, se vi va scrivetemi senza problemi :)).",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nlazsk/nuove_conoscenze_a_to/"
    },
    {
        "id": "1nkyqwn",
        "author": "TheGoodC4t",
        "title": "Conoscenze e attività",
        "content": "Ciao a tutti.  \nHo 22 anni, studio Ingegneria Informatica al Politecnico di Torino ,vivo a Lingotto e sto cercando di ricominciare da zero dopo un periodo pesante: esami, ansia, solitudine.  \n\nVorrei conoscere persone vere, qualcuno con cui fare attività insieme. \n\nMi piacciono tante cose:  \n- Auto e moto: non riesco a stancarmene.\n- Musica: Rock/Pop/classica mentre guido, mangio, studio e dormo. Sempre.\n- Gatti:  Ne ho uno e non posso vivere senza \n- Simulatori di guida: Ho un setup base, mi piacerebbe condividere questa passione  \n- Giochi da tavola: di qualsiasi  tipo\n- Tennis e pallavolo :Giocavo a scuola, mi piacerebbe riprendere in modo leggero  \n \n\nSono molto estroverso ma non cerco discoteche o serate rumorose essendo astemio. Cerco luoghi tranquilli, gruppi piccoli, attività reali.  \n\nQualcuno sa dove posso trovare gente così a Torino?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkyqwn/conoscenze_e_attività/"
    },
    {
        "id": "1nl29sq",
        "author": "Floofs-In-Space",
        "title": "Banks with ATMs with high max withdrawal amounts",
        "content": "Hi, I read that most banks limit daily withdrawals to 250 - 500 euro. I'm using my Fidelity debit card and looking for take out 500 (or more), if possible.\n\nAny recommendations on banks that allow that?\n\nEDIT: I went to Unicredit. They let me take out 750 euro. They gave me a 1,500 euro option too, but I didn't try it. Thanks, all!",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nl29sq/banks_with_atms_with_high_max_withdrawal_amounts/"
    },
    {
        "id": "1nl0da6",
        "author": "BrightMud165",
        "title": "Birrificio Metzger",
        "content": "E' giusto una curiosità.\n\nOggi sono capitato per caso su questo [link](https://www.cibotoday.it/citta/torino/metzger-birra-riapertura-via-catania.html) dove parlano della riapertura dello storico birrificio e di una nuova birreria (che si chiamerà TONO). Proprio quest'estate sono capitato per la prima volta nel birrificio Metzger in via Catania e mi è sembrata una realtà più che avviata.\n\nPerché l'articolo parla di storica riapertura quando è già presente un birrificio/birreria?\n\nForse mi sono perso qualcosa",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w-dBDdepFuZv479FbbwOdMYnyMpifeNP4xfz_Dj9LeY.jpeg?auto=webp&amp;s=832b13d9d304a305c05ebc7f7a68a8bdb021ed1c"
        },
        "permalink": "/r/torino/comments/1nl0da6/birrificio_metzger/"
    },
    {
        "id": "1nkzu0i",
        "author": "Ill-War4026",
        "title": "Festa di Laurea a OTTOBRE 🎓",
        "content": "Ciao a tutti!  \nSto cercando un locale dove poter festeggiare la mia laurea con circa **40 persone**. Il mio budget è sui **20€** a persona, ma se riesco a spendere meno sarebbe ancora meglio!  \nAvete suggerimenti su locali che offrano un buon rapporto qualità-prezzo, magari con un menù fisso o una soluzione economica ma carina per un gruppo del genere?\n\nGrazie mille in anticipo per i consigli! 😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkzu0i/festa_di_laurea_a_ottobre/"
    },
    {
        "id": "1nkzmxg",
        "author": "OldPen9536",
        "title": "Acquisto Casa",
        "content": "Mi piacerebbe comprare casa.\n\nBudget 35k\n\nDistante un 30 minuti da Torino, vanno bene zone di montagna anche.\n\nLa cosa importante è che ci sia internet.\n\nHo visto diverse cose anche da ristrutturare… voi che zona mi consigliereste??",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1nkzmxg/acquisto_casa/"
    },
    {
        "id": "1nk1dri",
        "author": "Euphoric-Spare-2871",
        "title": "Vivere a Torino senza macchina: si può davvero?",
        "content": "Sto considerando di vendere l’auto, ma non so se sia fattibile. Mezzi pubblici, bici, monopattini, car sharing... secondo voi, si può vivere bene a Torino senza macchina? Anche girando di notte? In quali quartieri è più facile?",
        "upvotes": 119,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mef5hbh3gvpf1.jpeg?auto=webp&amp;s=d6c122533d134518d3336fe934cede08bc9809cc"
        },
        "permalink": "/r/torino/comments/1nk1dri/vivere_a_torino_senza_macchina_si_può_davvero/"
    }
]