[
    {
        "id": "1qb0tcv",
        "author": "creel_515",
        "title": "Comunicado Oficial: Xabi Alonso",
        "content": "",
        "upvotes": 244,
        "comments": 385,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JCimpryegy-WEiZaUulyoOkKN9ghk7CFwwDUqe0Anzg.jpeg?auto=webp&amp;s=16bb327fad782c4fef76561cb6511176a3160a11"
        },
        "permalink": "/r/realmadrid/comments/1qb0tcv/comunicado_oficial_xabi_alonso/"
    },
    {
        "id": "1qb105e",
        "author": "creel_515",
        "title": "Comunicado Oficial: Álvaro Arbeloa",
        "content": "",
        "upvotes": 36,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JCimpryegy-WEiZaUulyoOkKN9ghk7CFwwDUqe0Anzg.jpeg?auto=webp&amp;s=16bb327fad782c4fef76561cb6511176a3160a11"
        },
        "permalink": "/r/realmadrid/comments/1qb105e/comunicado_oficial_álvaro_arbeloa/"
    },
    {
        "id": "1qatcme",
        "author": "o6ohunter",
        "title": "The duel between Lamine Yamal and Kylian Mbappé",
        "content": "",
        "upvotes": 664,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pqzz862cuwcg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qatcme/the_duel_between_lamine_yamal_and_kylian_mbappé/"
    },
    {
        "id": "1qaso6g",
        "author": "carlospum",
        "title": "Florentino should allow this attitudes... We were the \"club señor\" this is not acceptable",
        "content": "This is not the real Madrid I know... This behavior is what other teams do, not my team, not Real Madrid\n\nI though mbappe was not like this... I hope someone explains him what is our club really and how we behave historically\n\nThis is the behavior Neymar, Pique, Jordi Alba etc always had. Wtf is wrong with the team???",
        "upvotes": 710,
        "comments": 317,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2yeo6wounwcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qaso6g/florentino_should_allow_this_attitudes_we_were/"
    },
    {
        "id": "1qav6ur",
        "author": "dark4403",
        "title": "You played your heart out, thank you Vini",
        "content": "",
        "upvotes": 387,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/09n9283j8xcg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qav6ur/you_played_your_heart_out_thank_you_vini/"
    },
    {
        "id": "1qarb5g",
        "author": "sadiq10mb",
        "title": "Why Xabi Alonso is not respected by our players?",
        "content": "Squad need to follow command from coach, right? But how come manager of the biggest club in the world get neglected like this. Why can't board give more authority to the manager. I don't imagine any player reacting like what Vini did when Zidane was our coach. \nBy limiting the power for the manager, I think the board is digging the grave for us.",
        "upvotes": 603,
        "comments": 237,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n8ot0qnr9wcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qarb5g/why_xabi_alonso_is_not_respected_by_our_players/"
    },
    {
        "id": "1qasebh",
        "author": "ZealousidealPiece511",
        "title": "My respect and love for this Man grows every time we play Barca..",
        "content": "Been watching from 2010, never been i so settled and calm for a el clasico expect for zindanes term as coach, \n\nWe Dominante europe and then when it comes to barca we look like school kids on pitch at times, not at all knowing what to do \n\nAnd i know what I am talking about, and many can resonate with it as well, he never humiliated us against Barca ..\n\nCause my expectations are always very low playing barca, more often then not they come out on Top tactically, and it's the same with \nEveryone expect Zidane...\n\nI wish and I and we get that comfort very soon .....",
        "upvotes": 357,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sliln9d4lwcg1.jpeg?auto=webp&amp;s=740fdd776fb5f369cc6607729fc879d96c41bb44"
        },
        "permalink": "/r/realmadrid/comments/1qasebh/my_respect_and_love_for_this_man_grows_every_time/"
    },
    {
        "id": "1qaswdt",
        "author": "iPeluche",
        "title": "Karim Benzema gave two advices to Perez yesterday : Sign a midfielder and trust Xabi Alonso",
        "content": "",
        "upvotes": 325,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaswdt/karim_benzema_gave_two_advices_to_perez_yesterday/"
    },
    {
        "id": "1qatwla",
        "author": "No-Independent2522",
        "title": "Diego Simeone: \"I’d like to apologize to Mr. Florentino Pérez &amp; Mr. Vini Jr. for what happened the other day. It was not right, and that’s why I’m apologizing.\"",
        "content": "",
        "upvotes": 255,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4sdqt1jdzwcg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qatwla/diego_simeone_id_like_to_apologize_to_mr/"
    },
    {
        "id": "1qax3km",
        "author": "Usorojnr",
        "title": "Our players reaction says it all",
        "content": "The players seem frustrated, they want more. I think fans should cut them some slack, they feel hurt too. Every vitriol should be targeted at the board and Perez. They are the number 1 reason we are in this predicament. \n\nWe have an unbalanced squad, our fitness for the past 3 seasons have been awful, and we keep going for unproven young players or free transfers and somehow still expect titles. We Fans deserve better. ",
        "upvotes": 155,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7pn0mfejnxcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qax3km/our_players_reaction_says_it_all/"
    },
    {
        "id": "1qal901",
        "author": "ToneEven7327",
        "title": "this is what i mean when i say they don’t know how to mark , why is he left with so much space",
        "content": "",
        "upvotes": 584,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x51bmxu9iucg1.jpeg?auto=webp&amp;s=aae2f093f177e4721b2972340583e1f47be0d63c"
        },
        "permalink": "/r/realmadrid/comments/1qal901/this_is_what_i_mean_when_i_say_they_dont_know_how/"
    },
    {
        "id": "1qa9gfv",
        "author": "Ready_Ad_1353",
        "title": "Vini’s amazing solo effort goal from the stands",
        "content": "",
        "upvotes": 1840,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/burouhow0scg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa9gfv/vinis_amazing_solo_effort_goal_from_the_stands/"
    },
    {
        "id": "1qar7ce",
        "author": "ch1nkkyy",
        "title": "Vini highlights against barca",
        "content": "",
        "upvotes": 121,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0hq1u8ch8wcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qar7ce/vini_highlights_against_barca/"
    },
    {
        "id": "1qa926j",
        "author": "No-Independent2522",
        "title": "Vini equalizes 1-1 Barcelona",
        "content": "",
        "upvotes": 1712,
        "comments": 148,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/68lcur9ayrcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa926j/vini_equalizes_11_barcelona/"
    },
    {
        "id": "1qaofzk",
        "author": "asensia-kopfschmerz",
        "title": "The Super Cup breathes new life into Xabi, who is now being asked to improve team's physical condition: Despite the defeat against Barcelona, ​​the manager's job is not in danger. It's a time for analysis and finding solutions to the team's problems.",
        "content": "Looks like Xabi won't be sacked after all. Two months in survival mode when a lot of team building could've been done.\n\n[José Félix Díaz](https://as.com/autor/jose-felix-diaz-fernandez/) is very very very close to Florentino.",
        "upvotes": 160,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6W39wYfL1PQHqnjaW19MG55H5jNrZ204nJT9ScGDl60.jpeg?auto=webp&amp;s=5be11d3116289be85b59fc498905f1a3cfb423ff"
        },
        "permalink": "/r/realmadrid/comments/1qaofzk/the_super_cup_breathes_new_life_into_xabi_who_is/"
    },
    {
        "id": "1qa96lb",
        "author": "No-Independent2522",
        "title": "Gonzalo garcia equalizes 2-2 Barcelona",
        "content": "",
        "upvotes": 1285,
        "comments": 103,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z1b8jyq4zrcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa96lb/gonzalo_garcia_equalizes_22_barcelona/"
    },
    {
        "id": "1qaqdia",
        "author": "partizano42",
        "title": "Real vs Barca midfield",
        "content": "The heatmap and passing statistics from yesterday's game clearly show that Barcelona was extremely superior when comparing Pedri to Bellingham, and Dejong to Camavinga.\n\nAlthough Real Madrid has the stronger and more athletic players, they were dominated by Barcelona's midfield. It clearly shows that football is still about ball control and how you use it The game reads.\n\nEven though everyone here in the sub is always talking about athletic players, yesterday we saw that players like Pedri They are superior. Because they think much faster and are more on top of things.\n\nOne should sell two of Bellingham, Valverde, Camavinga and Tchou and buy strong players instead.\n\nIt can also be seen that Arda had almost as many ball contacts in 20 minutes as Bellingham, Camavinga and Valverde. Furthermore, none of the three created any chances, while Ceballos and Arda each created a huge scoring opportunity in 20 minutes.\n\nHere too, it's clear that players who are on the ball and read the game are significantly superior.\n\nIf you want to beat big teams, you need more players like Pedri, Dejong, and Vitinha.\n\nWith athletic players, you won't achieve anything against PSG, Barca, and Arsenal.\n\nIt can be seen that Valverde, Bellongham, and Camavinga, despite their physical superiority, occupied far less space on the pitch than Pedri and Dejong. Looking at the heatmap, it's truly shocking how dominant they are.\n\nThere's no need to even discuss passing statistics when Arda and Ceballos have almost the same number of touches and create more chances in 20 minutes. If you now compare the passing statistics...Things get even worse for Real Madrid's midfielders with the addition of Pedri and Dejong.\n\nWe need two new, strong midfielders. And we need to let two go. Otherwise, we won't be able to strengthen our midfield.\n\nJust look at the statistics before the fanboys of the individual players come and insult them.",
        "upvotes": 90,
        "comments": 91,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaqdia/real_vs_barca_midfield/"
    },
    {
        "id": "1qaerbb",
        "author": "cyrusmancub",
        "title": "Madrid’s results in Xabi Alonso’s first 34 matches: 24 wins, 4 draws, 6 losses. Barça’s results in Hansi Flick’s first 34 matches: 24 wins, 4 draws, 6 losses.",
        "content": "",
        "upvotes": 433,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaerbb/madrids_results_in_xabi_alonsos_first_34_matches/"
    },
    {
        "id": "1qaanwi",
        "author": "Derindown",
        "title": "Endrick scores in his first appearance at Lyon",
        "content": "",
        "upvotes": 698,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaanwi/endrick_scores_in_his_first_appearance_at_lyon/"
    },
    {
        "id": "1qabwww",
        "author": "cyrusmancub",
        "title": "Xabi Alonso: “Vini asked me to sub him off. He had cramps.”",
        "content": "",
        "upvotes": 603,
        "comments": 110,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qabwww/xabi_alonso_vini_asked_me_to_sub_him_off_he_had/"
    },
    {
        "id": "1qak54x",
        "author": "ace-s",
        "title": "The fact that the club is still not willing to buy players that the manager needs is concerning for the club's future",
        "content": "I feel that Xabi had a great performance despite the loss. We are playing without a holding midfielder. We dont have a single player that can pass under pressure. \n\nIn the summer Xabi wanted a Zubimendi type of player, and he didnt get any. \n\n  \nCouple of days ago again it was reported that Xabi wants a midfielder and again the response was that no signings will be done in the winter market. \n\nThe club did not support Carlo. Now they are not supporting Xabi, eventually he will be sacked and the next manager will have to make due without the player he needs. ",
        "upvotes": 180,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qak54x/the_fact_that_the_club_is_still_not_willing_to/"
    },
    {
        "id": "1qa9arl",
        "author": "madrid57911",
        "title": "With his goal today, Vinicius becomes joint-all time Real Madrid top G/A provider in finals. Big-Game Player🔥🔥🔥",
        "content": "16 G/A total",
        "upvotes": 687,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ain3sjpuzrcg1.png?auto=webp&amp;s=087728fb6783d99fb115d23bbcc22d0241bfea62"
        },
        "permalink": "/r/realmadrid/comments/1qa9arl/with_his_goal_today_vinicius_becomes_jointall/"
    },
    {
        "id": "1qar4tm",
        "author": "Critical-Remove-1878",
        "title": "I can excuse the lack of quality/chemistry of the squad. But NOT the lack of passion.",
        "content": "Losing games, finals, Clasicos, going trophyless or underperforming are all part of the game. It's normal that we can't be perfect all the time and I totally get that.\n\nWhat annoys me the most is the lack of passion our current crop of players have in most games. Recent former legends like Cristiano, Ramos, Marcelo, Casemiro etc. weren't just world class footballers, they were also living and breathing for this shirt, or at least for the sport and winning. \n\nRonaldo absolutely hated to lose with every fiber of his being. When he was missing chances he was screaming angrily and was always pushing for more. Compare that to Vini. We have lost 5 Clasicos in the last 14 months (incl. 3 finals), yet he got the most annoyed in the one we actually won, because he was subbed off earlier than usual.\n\nOur players lack mentality and... cojones. We used to have defenders running at full speed and tackling, playing while bleeding and giving their all for the team (including Rudiger). Ramos, Pepe, Varane, Casemiro, Carvajal. Now you see Huijsen as our CB, always looking non-chalant and barely going for strong challenges. A 1.90m plus defender losing aerial duels... On Gonzalo's goal (2-2), Raphinha was jumping like crazy inside his goal and \"saved\" a header that was going in. I wonder when was the last time our attackers did anything similar.\n\nAnother example of lack of passion is our finishing. Re-watching yesterday's highlights: Vini (13'), Gonzalo (32'), Rodrygo (62') and Carreras (95') all had great shooting opportunities inside the box, yet they barely put any power, resulting in a shoot that looked more like a pass towards the GK hands. Just shoot the ball with power, Raphinha scored a deflected goal because he did exactly that.\n\nWhat sucks is that I don't expect any reaction from these group of players. It's been the same since last season and they never bounce back mentally, since the \"they're looking AC Milan with anger in their eyes\" bs. I've supported this team for 20 years and I've never felt more disconnected to a RM squad, feels like they (not everyone) care more about looking cool and earning the paycheck, rather than bleeding for the badge. ",
        "upvotes": 49,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qar4tm/i_can_excuse_the_lack_of_qualitychemistry_of_the/"
    },
    {
        "id": "1qaw8vb",
        "author": "Modo97",
        "title": "This is the worst defense I’ve ever seen for Real Madrid in my life.",
        "content": "I said from day one (before the start of the season) that signing Huijsen would not be enough to solve the team’s defensive problems, and that bringing in Trent Alexander-Arnold would add nothing to the squad except another name to the injury list. The Carreras signing, in my opinion, is the only one that truly solved a major issue — the left-back problem that has existed since Marcelo’s final seasons with the team.\n\nBut when it comes to centre-back, I’ve always stressed the importance of signing an additional top-class name alongside Huijsen. Rüdiger has been delivering poor performances since last season and is now struggling physically; Militão is completely finished due to injuries; Alaba can no longer be relied upon and is merely adding to the numbers in the club’s hospital; and Asensio is a shaky defender whose place should only be on the bench. And here we are, seeing last season’s scenario repeat itself. Tchouaméni has been forced to play as a centre-back, and we may even see Carreras or Mendy alongside him in the upcoming matches. Another season in which we end up changing players’ positions just to fill this gap.\n\nAs for the right-back position, you may laugh at what I’m about to say, but keeping Vázquez might have been slightly better than what we have now. Half of the season has already passed and we’ve lost our first trophy — where is Carvajal? And where is the new signing, Arnold? What have we actually gained from this signing so far? At the very least, Vázquez was always available to serve the team. Many of us doubted the likelihood of this signing being a success because we were aware of the player’s physical condition at Liverpool, and we all know that he is at Real Madrid only because it was a free transfer. I’m not questioning the player’s quality here, but what is the point of having a great player who doesn’t play?\n\nAnd here an important question must be raised: if the board is not going to support the coach, why doesn’t the coach turn to the academy players? What has been the role of Castilla in recent years? Alonso, and before him Ancelotti — years of changing players’ positions without turning to Castilla. A midfielder playing as a centre-back, a left-back playing as a centre-back, a midfielder playing as a right-back… fine, but for how long? Why don’t we take Gonzalo García as an example of the potential success of Castilla players?\n\nWhere is Joan Martínez, who was said to be a promising defender? I don’t think he would be worse than Alaba. Where is David Jiménez, who played in the cup match and stood out? Why do these players appear and then suddenly disappear? Wouldn’t having a player like him at right-back yesterday have been slightly better than bringing in Arda Güler just to replace Valverde?\n\n",
        "upvotes": 20,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaw8vb/this_is_the_worst_defense_ive_ever_seen_for_real/"
    },
    {
        "id": "1qa3sao",
        "author": "dark4403",
        "title": "Yesterday, Xabi Alonso said that Vinícius needed support, and today we've all decided that in the 7TH MINUTE we're going to chant his name 🥹🤍👏🏻",
        "content": "",
        "upvotes": 731,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nj656gx7zqcg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa3sao/yesterday_xabi_alonso_said_that_vinícius_needed/"
    },
    {
        "id": "1qada7o",
        "author": "TheFeatherDiaries",
        "title": "[Fotmob] With only 97 passes made in FIRST 52 minutes, having 24 percent possession, Real Madrid recorded the least amount of possession in a single half since 2010.",
        "content": "",
        "upvotes": 192,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zjlb1yfzqscg1.png?auto=webp&amp;s=5d9294e71fa2ebe472855b563d7cf32d4bf97b7f"
        },
        "permalink": "/r/realmadrid/comments/1qada7o/fotmob_with_only_97_passes_made_in_first_52/"
    },
    {
        "id": "1qaxdyc",
        "author": "Slowpokebread",
        "title": "Sorry but I think the team keeping Carvajal would be a mistake",
        "content": "I hope I am wrong, but for real.\n\nWe already got a full 25 men squad(Now 24 due to Endrick leaving) and Paz is returning. Other than Alaba and maybe Rudiger+Mendy. We only got 2 spots left.\n\nThe board didn't buy new defenders because Alaba, Carvajal and Mendy are still here. Sure they are all UCL winning veterans but their prime has past. Alaba has past his prime for sure. Mendy can't stop getting injured but we still extended the contract. Carvajal is 34 and just suffered big injury, he obviously will continue to drop and would not be a good sub to use. We are short of RB because he and TAA are keep getting injured.\n\nActually I don't think we should have kept him this season, we should have let he and Mendy go, then buy new fullbacks.",
        "upvotes": 7,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaxdyc/sorry_but_i_think_the_team_keeping_carvajal_would/"
    },
    {
        "id": "1qab4e3",
        "author": "RM_Official_Thread",
        "title": "Post Match Thread : Barcelona vs Real Madrid, Supercopa de España, Final",
        "content": "We lost.\n\n  \nOur subs were bad.",
        "upvotes": 231,
        "comments": 1081,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qab4e3/post_match_thread_barcelona_vs_real_madrid/"
    },
    {
        "id": "1qa9fui",
        "author": "Pallav_Pokhrel",
        "title": "Couldn't have written any better",
        "content": "",
        "upvotes": 259,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t32xup7t0scg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa9fui/couldnt_have_written_any_better/"
    },
    {
        "id": "1qasrs4",
        "author": "Lurtz11",
        "title": "Are we going the Chelsea route? Where are our senior players?",
        "content": "Something I don't see discussed often is the title, where are our senior players?\n\nI think the most important thing for us to get besides a playmaker is this, A SENIOR PLAYER.\n\nLook at Chelsea, they are crumbling under any pressured game because they got so many young \"prospects\" that have zero experience. We are going in the same direction. We are buying potential and not experience. Look at our players yesterday, and I don't mean this in a disrespectful way, I love our guys: \n\nG.Garcia = 21 years.\n\nCarreras = 22 years\n\nHuijsen = 20 years\n\nAscensio = 22 years\n\nBelli = 22 years\n\nCamaving = 23 years. \n\nOur oldest field player? Fede, at 27. (I know Courtois is 33, but field players now).\n\nVini, Tchou and Rodrygo = 25 years\n\nAnd what did we sub in? \n\nFranco = 18 years\n\nGuler = 20 years.\n\nA broken Alaba, Mbappe (prime years now, 27) and a broken Ceballos.\n\n  \nOut of all 15 on the field players yesterday, 8 are not even fucking 24 years old, in the biggest club in the world. \n\nIn football the peak performance is USUALLY around 26-30 years. How are we expected to do jack shit with such a young squad? \n\nEither we set the target now as a club and say \"hey, we are going to invest in young talent and rebuild with them, it will take some years, but they pay off will be good\", or we buy EXPERIENCED PLAYERS.\n\nWe can't be buying fucking 20 years old, putting them in the biggest team in the world that constantly plays against the best teams in the world and at the same time tell Xabi \"Btw, win or you are out\". \n\nI am all for buying potential, but we used to buy the best of the best players out there, not players that \"might be good\" in a few years. ",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qasrs4/are_we_going_the_chelsea_route_where_are_our/"
    }
]