[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 159,
        "comments": 564,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n20z4c",
        "author": "A-Dog22",
        "title": "Sony sold Netflix the rights to ‘KPop Demon Hunters’ in a pandemic-era safety play—and now it’s Netflix’s biggest movie ever",
        "content": "",
        "upvotes": 66,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n20z4c/sony_sold_netflix_the_rights_to_kpop_demon/"
    },
    {
        "id": "1n226i0",
        "author": "Street_Firefighter_7",
        "title": "The gabby petito story was removed off Netflix",
        "content": "I noticed that the movie is now removed after only being on the platform for less than 24 hrs. I paused it and came back to watch it and now it’s gone and I’m even getting errors whenever I click on the Netflix link for the movie. Anyone know why it was removed? ",
        "upvotes": 46,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1n226i0/the_gabby_petito_story_was_removed_off_netflix/"
    },
    {
        "id": "1n1t6ji",
        "author": "AztecTimber",
        "title": "I love foreign language shows and here are my favorites",
        "content": "Do you have any to add? I am particularly interested in German shows because I think it helps me speak it just a bit better. Plus I love the euro city settings. ",
        "upvotes": 75,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1n1t6ji/i_love_foreign_language_shows_and_here_are_my/"
    },
    {
        "id": "1n1krle",
        "author": "Glum_Reputation_9845",
        "title": "Rewatching The Social Dilemma and realizing it wasn’t even the half of it",
        "content": "When I first saw it, I thought it was shocking that apps manipulate us with notifications and algorithms. But the more I’ve learned since then, the scarier part isn’t just the manipulation and it's all about the data that's everywhere.  \n  \nYour phone number, your email, even your address history  all of it is floating around. The Social Dilemma scratched the surface because I feel it's much scarier real life. (that thing about what google knows about you is actually terrifying). I can’t help but think a real sequel would be less about screen addiction and more about how our entire identities are already being bought and sold in the background.  \n  \nHas anyone else felt that paranoia spike after realizing the real problem isn’t the apps on your phone, it’s the invisible network of companies that already own your information?",
        "upvotes": 55,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n1krle/rewatching_the_social_dilemma_and_realizing_it/"
    },
    {
        "id": "1n10zec",
        "author": "AverageCowboyCentaur",
        "title": "Anyone else having trouble navigating Netflix?",
        "content": "some shows work and some shows don't even load the episode grid. It's like they play from the preview. The whole service just seems to be melting down and degrading. anybody else?",
        "upvotes": 1007,
        "comments": 790,
        "media": null,
        "permalink": "/r/netflix/comments/1n10zec/anyone_else_having_trouble_navigating_netflix/"
    },
    {
        "id": "1n1to7o",
        "author": "PerformerAlert4654",
        "title": "Please help me find this Netflix series that was canceled",
        "content": "All I can remember is that there was three main characters and it was under the fantasy genre. It was two boys and a girl. One of the boys were black and is the main main character. I think their is magic involved and it was also a book series. It was canceled after only 1 season but i remember it being so good and wanting to read the book. I believe it had a rather long name as well?\n\nI am trying to remember more but I cant remember most of it.",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n1to7o/please_help_me_find_this_netflix_series_that_was/"
    },
    {
        "id": "1n1ek4n",
        "author": "AlittleupsetMax",
        "title": "How bad is Netflix new update",
        "content": "I am having problems with this service, besides the rate hikes and the inability to share, it seems like the actual service is having problems now.  The new home page isn’t very good.  After you browse for something, you have to go all the way to the top to search for what you were looking for.  Remember when they would pop a really anticipated movie on there?  Ahh the good ole days \n\nIs it still worth it?  I just finished Better Call Saul and I would say it was worth it for that show. Not too bad, it’s no Breaking Bad but what is?",
        "upvotes": 50,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ek4n/how_bad_is_netflix_new_update/"
    },
    {
        "id": "1n25oao",
        "author": "St3lla_0nR3dd1t",
        "title": "Does the Netflix algorithm suit you or do you have to search for good tv",
        "content": "https://www.theguardian.com/media/2025/aug/28/bland-easy-to-follow-for-fans-of-everything-what-has-the-netflix-algorithm-done-to-our-films\n\nIs it just me but do you get the feeling that Netflix films are not challenging enough and produced to a quota rather than to quality. \n\nWould you pay more for better films?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n25oao/does_the_netflix_algorithm_suit_you_or_do_you/"
    },
    {
        "id": "1n25aku",
        "author": "Nastia_dream",
        "title": "Is My life with Walter boys worth watching?",
        "content": "S2 comes out today (or already came out i didn’t check yet). Honestly all i’ve heard about this show is that it’s like ,,The summer i turned pretty’’ but from Netflix (I haven’t seen that other show, just saw clips and edits and decided it’s not for me). Also i mainly don’t watch teen shows anymore but sometimes i’d check something out from Netflix. Those who’ve seen this show, is it good enough to spend your time on watching or is it really like that other teen show from Amazon Prime ? So far the only reason i’ve been planning to check it out is because one of the main actresses was in Suits and i loved her in there. But other than that I don’t want to watch it if it’s just some cheesy drama with teen romance. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n25aku/is_my_life_with_walter_boys_worth_watching/"
    },
    {
        "id": "1n256r5",
        "author": "CharityOnly4533",
        "title": "I swear 2020-2021 animated shows CARRIED quarantine",
        "content": "You got shows like she-ra , Carmen Sandiago, kipo,hilda. Inside job for sure. Like bro those years were the best for animation on Netflix I’m sure there more that I’m blanking on but those were the promote ones. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n256r5/i_swear_20202021_animated_shows_carried_quarantine/"
    },
    {
        "id": "1n0unz1",
        "author": "ToonAdventure",
        "title": "'KPop Demon Hunters' Is Netflix's Most-Watched Movie in History",
        "content": "",
        "upvotes": 632,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1n0unz1/kpop_demon_hunters_is_netflixs_mostwatched_movie/"
    },
    {
        "id": "1n2486v",
        "author": "Logical-Confection98",
        "title": "Guys is it too late to rally for a new “I AM NOT OKAY WITH THIS” season still?",
        "content": "I love the series soooooo much and I watched it in 2021. It still leaves me in awe of everything, and it’s not talked about enough. I assume it takes very heavy notes from Carie, BUT NETFLIX RENEW IT PLEASE. \n\nThey already were going to if it wasn’t for Covid, no reason they couldn’t have brought it back after. Love that show",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n2486v/guys_is_it_too_late_to_rally_for_a_new_i_am_not/"
    },
    {
        "id": "1n233zu",
        "author": "lilnadsx",
        "title": "Petition to make a No Good Deed Spinoff...",
        "content": "... that features the two new couples moving into the neighborhood (Dennis &amp; Carla and Leslie &amp; Sarah) and maybe they solve some other random unsolved mystery or it's just more slice of life like Four Seasons... I just need to see more of all 4 of those characters!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n233zu/petition_to_make_a_no_good_deed_spinoff/"
    },
    {
        "id": "1n14day",
        "author": "TheGhostOfUncleBuck",
        "title": "Netflix is down 8/26 evening",
        "content": "Netflix say they are not experiencing any interruption. All is goo.\n\nNetflix also say they are experiencing a lot of inbound calls and chat support is longer than usual.\n\nHence, Netflix is DOWN.",
        "upvotes": 137,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1n14day/netflix_is_down_826_evening/"
    },
    {
        "id": "1n22his",
        "author": "ComplaintGeneral5574",
        "title": "Wednesday Season 2",
        "content": "I just wrapped up Wednesday Season 2. Was a pretty solid watch. The tone has that mix of weird and witty like from the first season. Feels a little more grounded this time. Jenna Ortega still has Wednesday’s vibe. Liked seeing those moments where she lets some emotion slip through.\n\nWhat stood out for me was the side characters. Enid especially had great moments. New supernatural element kept things interesting, too.\n\nVisually, it’s still got that dark and moody look. Though I must say, certain scenes stand out because of little pops of color.\n\nI enjoyed it. It didn’t feel like it dragged. Enough mystery to keep ppl guessing, but not confusing. That ending left me with questions though, so I’m curious what everyone else thinks about where they might take it next.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n22his/wednesday_season_2/"
    },
    {
        "id": "1n2252u",
        "author": "TwiggyCH",
        "title": "Issues with playback as an \"extra member\"",
        "content": "I was wondering if anyone else has been experiencing playback issues as an \"extra member\"? My brother is the primary account holder &amp; he added me as an extra member not too long ago &amp; I've been having REALLY bad playback issues.\n\nMostly, if I pause a show or movie &amp; leave it for anything from a few seconds to a couple minutes, the moment I hit play it freezes, I get the loading circle, it freezes again, it fast forwards, freezes, loads, &amp; then plays. This happens EVERY time. I have no other playback issues with any other streaming service JUST Netflix. \n\nIt works fine on my phone, just not my tv. (It's Hisense Roku tv if it makes a difference. And when signing up I did put \"tv\" as my primary source(?) for watching the app)\n\nWhen visiting my brother last month he still had my profile on his main account &amp; I used it to watch some movies &amp; his Netflix worked just fine.\n\nAny ideas as to why this happens? Has anyone else experienced this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n2252u/issues_with_playback_as_an_extra_member/"
    },
    {
        "id": "1n1xg7h",
        "author": "ItsLix",
        "title": "I can't watch Netflix on my PC at all",
        "content": "I've been using Opera GX and noticed I couldn't play Netflix due to error code O7702-1290. I can load the website and profiles, browse shows and pick out an episode to watch. But after trying to load for a little bit, it gives me that error code and I am unable to find out why or how to fix it. Every other device I try it on works fine and I can watch there, just not my PC for whatever reason. It worked in the past, I checked my history and I was able to use it as recently as last month, but now it just doesn't.\n\n  \nI've tried clearing my cookies, cache, all of my browser settings and history, tried opening it on Chrome, Edge, and even downloaded and tried the Netflix app from the Microsoft store, tried a fresh install, enabling experimental flags to see if it was an html5 issue, changed my DNS, allowing DRM content to be played through my browser settings, updated, deleted, and re-updated my Widevine component, shutdown and restarted my PC multiple times. Nothing.\n\n\n\nAbsolutely nothing is working to get it to play on my PC and I cannot figure out why. I'm at my wit's end with it since I've been trying on and off to fix it for a week now, and every other search I come across either tells me how to fix Error Code 1003 instead of 1290, or even how to fix it for Linux or Vivaldi users. Can I get any help at all as to how this can be fixed or even a clue into the right direction?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n1xg7h/i_cant_watch_netflix_on_my_pc_at_all/"
    },
    {
        "id": "1n219py",
        "author": "queenbiscuit311",
        "title": "Dandadan not showing up on netflix anymore?",
        "content": "I've been watching dandadan on netflix, but when i went in today it's just not there. I went to a link from my history and it says it's not availible in my country. The show is absolutely on netflix in the US, so I don't understand what's going on here. Anyone else with this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n219py/dandadan_not_showing_up_on_netflix_anymore/"
    },
    {
        "id": "1n1prw1",
        "author": "Fiestabean",
        "title": "I need romance anime recommendations",
        "content": "Yeah you heard me I’m unapologetically addicted to Romance anime and need some recommendations doesn’t have to be solely romance either it can be a shonen type with romance too. \n\n \n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n1prw1/i_need_romance_anime_recommendations/"
    },
    {
        "id": "1n12j61",
        "author": "ZoZleepy",
        "title": "Netflix Down (East Coast NY)",
        "content": "Anyone else having issues? \n\nApp isn't loading properly on Xbox or TV, glitching and shuddering\n\nThe new format looks like shit also, seems to be a whole mess\n",
        "upvotes": 117,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1n12j61/netflix_down_east_coast_ny/"
    },
    {
        "id": "1n1v8la",
        "author": "Single-Mechanic-9323",
        "title": "scary movie recs?",
        "content": "hey! my friends and i are up in a cabin in the woods in the mountains and are in the mood to watch a good scary movie tonight with as many jump scares as possible. preferably nothing demonic or anything of that nature, but still as scary as possible so lemme know 🙏",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n1v8la/scary_movie_recs/"
    },
    {
        "id": "1n11yvx",
        "author": "Personal-Director734",
        "title": "My Netflix in the tv isn’t showing any of the options to play the show",
        "content": "It’s showing the titles and everything, but when I click on one it’s only playing the lil ad in the corner and the name of the show, not any of the ‘play’ ‘similar titles’ etc etc and idk what’s wrong with it.",
        "upvotes": 96,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1n11yvx/my_netflix_in_the_tv_isnt_showing_any_of_the/"
    },
    {
        "id": "1n12y1z",
        "author": "condorre",
        "title": "Nothing to worry about, folks! (swipe)",
        "content": "",
        "upvotes": 80,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n12y1z/nothing_to_worry_about_folks_swipe/"
    },
    {
        "id": "1n1w4cr",
        "author": "New-Camel-1365",
        "title": "The Gabby Petito Story Dramatization",
        "content": "I’ve heard of the Gabby Petito story many times, first via the news when her “disappearance” was being investigated and throughout the years via true crime youtubers that would cover her story. \n\nFrom what I know, the new Gabby Petito dramatization seems to be accurate to what was being reported on. It’s a bit jarring seeing in “real time” the tendencies of an abuser where when it’s good, it’s good but when it’s bad it’s bad. \n\nWhat are your guys’ opinions on this movie? Do you believe it to be generally accurate, was some things overdramatized, etc?\n\nAlso, RIP to Gabby. She really did seem like a sweet girl who believed in the best of others and I hate when abusers like Brian take advantage of that. I’ve been there and thank my stars I didn’t cross paths with someone like Brian.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n1w4cr/the_gabby_petito_story_dramatization/"
    },
    {
        "id": "1n1zyq5",
        "author": "AccomplishedPut5175",
        "title": "Fantasy Football Ruined Our Lives!!!",
        "content": "watched this movie solely because it stars Giacomo Ferrara (Subbura), and what do I know, it's not worth watching in my opinion.\nActually, the movie is skip it :(",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n1zyq5/fantasy_football_ruined_our_lives/"
    },
    {
        "id": "1n0yvbo",
        "author": "Sudden_Pop_2279",
        "title": "Alice in Borderland: Season 3 | Main Trailer | Netflix",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1n0yvbo/alice_in_borderland_season_3_main_trailer_netflix/"
    },
    {
        "id": "1n1pj9x",
        "author": "Theycraveekelly",
        "title": "Recommendations",
        "content": "Hey, I know a lot of people post these so apologies in advance. \nThere’s a handful of shows that I’ve watch and liked so much that I binged everything and when it ended I felt like no other show could give me the feeling it gave me. Some of my favorites \nSupernatural\nGood girls\nDead to me\nThis is us\nParenthood\n\nI know these categories aren’t related and it’s kinda hard to find something related to these since they’re not really too similar. But these were all fun to watch and kept me hooked on it. \nI’ve tried watching 6 feet under but idk it’s not hitting the same",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n1pj9x/recommendations/"
    },
    {
        "id": "1n1j5jm",
        "author": "Pntrdm",
        "title": "Just watched 2019 IO and so disappointed.",
        "content": "This is one of that kind of stories I'm keen on the most, but unfortunately left me disappointed. In the first 7 minutes it seemed so promised, but as it kept going it was clear they don't give a f\\*\\*k about the extinction of Earth when it comes to directing. 95% of this is about 2 human left on here are talking about unnecessary nonsense, making a love/emotion interest to each other tho it's not what it should have been told about but exploring the Earth, investigate for more possible survived human while they searching for more evidence which supports their research to date in the hope that there is a way to save the Earth. So sad it turned out otherwise. I gave it 3 stars on IMDB due to the concept only, but the execution is more than awful.\n\nLet me know if there's more movies like this so I can avoid it.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n1j5jm/just_watched_2019_io_and_so_disappointed/"
    },
    {
        "id": "1n1ow5v",
        "author": "Away_Preparation7749",
        "title": "Volume",
        "content": "Hi can anyone please help me ever since the new interferes of  Netflix. I can barely hear when watching a movie or TV show. And I have the volume way up. Is there anyway to fix this? Thank you very much ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n1ow5v/volume/"
    },
    {
        "id": "1n20c6c",
        "author": "8MediocreMan8",
        "title": "What if Netflix had comments?",
        "content": "I was scrolling on tiktok and I thought, “You know what makes TikTok so much fun, is seeing people’s comments and the funny pictures.” Wouldn’t it be genius if streaming platforms like Netflix had comments on movies/tv shows? I’ll see clips of Squid Game on TikTok and the comments make it so funny and enjoyable. They could also be useful for people to discuss what they are watching, as if you are thinking about watching something but don’t know if it’s worth your time, you could just look at the comments. Maybe even timed comments would be great, people could discuss certain scenes while they happen. I’m going to start a steaming service that has a comment section now. I’ll see you guys when it goes out of business🫡",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1n20c6c/what_if_netflix_had_comments/"
    }
]