[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1py0rp2",
        "author": "Conan5678",
        "title": "A Torino da qualche anno, cerco nuove amicizie tranquille 🌿",
        "content": "Ciao!\nVivo a Torino da circa tre anni e mi piacerebbe conoscere nuove persone con cui far nascere un’amicizia genuina senza pretese.\n\nMi piacciono le cose semplici e rilassate: passeggiate, aperitivi, chiacchiere senza stress, musei, curiosare per la città e lasciarsi ispirare dal mondo intorno.\nHo anche un forte interesse per la natura, il folclore e l’esoterismo.\n\nPer me è fondamentale un clima aperto, rispettoso e sereno: cerco persone LGBT-friendly, tranquille e lontane da atteggiamenti omofobi o giudicanti.\n\nSe ti va di fare due passi, bere qualcosa o semplicemente scambiare due parole e vedere se nasce una bella amicizia, scrivimi pure 🌙",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1py0rp2/a_torino_da_qualche_anno_cerco_nuove_amicizie/"
    },
    {
        "id": "1py4ooo",
        "author": "AlternativeTea2226",
        "title": "Accompagnatrici A Torino Per Donne .",
        "content": "Ciao, spero di non essere fraintesa, sono una ragazza di 24 anni lesbica, dopo una lunga serie di inculate e tragedie nelle relazioni e dopo aver trovato tanta gente di merda ho preso una pausa dalla vita sentimentale e ho deciso di concentrarmi su me stessa e sul guarire anche da tutto questo . Peró, avvolte sento il bisogno di una presenza femminile, e mi sento sola, mi piacerebbe passare delle serate o delle occasioni o giornate con qualcuna (non sto cercando rapporti sessuali di nessun tipo, solo compagnia, massimo massimo coccole), possibilmente non eccessivamente piú grande di me, ma sui siti di incontri la situazione rischia di farsi seria, e io non voglio ritrovarmi coinvolta sentimentalmente ne coinvolgere qualcuno che magari si fa delle speranze, dopo tanti mesi di ricerche mi sono un po arresa e vorrei optare per un'accompagnatrice, ma non voglio una escort, voglio qualcuno che faccia l'accompagnatrice solo ed esclusivamente per donne, e che magari sia lei stessa lesbica, vorrei che la cosa fosse piacevole per entrambe e non una costrizione per l'altra persona, o sarei io la prima a sentirmi a disagio e a rifiutare . Sarebbe bello magari trovare qualcuno che cera la mia stessa cosa e lo farebbe gratis . Aiuti ? Di accompagnatrici per uomini c'è ne sono tante, neanche mezza per donne peró . Sto cercando su Torino massimo massimo Piemonte . Potete aiutare una povera lesbica col cuoricino spezzato che vuole compagnia ? Grazie in anticipo 😂 .",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1py4ooo/accompagnatrici_a_torino_per_donne/"
    },
    {
        "id": "1px78st",
        "author": "OnuzzoT",
        "title": "Oggi in visita, dalla Basilica di Superga!",
        "content": "",
        "upvotes": 463,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2k8fhn3wzs9g1.jpeg?auto=webp&amp;s=145c82f1614110aaf3eba8c4e79b140330a09f33"
        },
        "permalink": "/r/torino/comments/1px78st/oggi_in_visita_dalla_basilica_di_superga/"
    },
    {
        "id": "1pxnzdw",
        "author": "nickname1917",
        "title": "L'aria di Torino non si vede...",
        "content": "Questo tappetino è stato un mese su un un balcone...mi chiedo i nostri polmoni nel frattempo...\n\nhttps://preview.redd.it/18f5v97i6x9g1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=3cb9f45936738cab98ed5b199d3f37d054bc1b29\n\n",
        "upvotes": 22,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1pxnzdw/laria_di_torino_non_si_vede/"
    },
    {
        "id": "1py3zyo",
        "author": "republicflags",
        "title": "Prova palestre Orange",
        "content": "Qualcuno ha un codice invito per la prova gratuita delle palestre Orange ? Grazie",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1py3zyo/prova_palestre_orange/"
    },
    {
        "id": "1py855z",
        "author": "giakka1071",
        "title": "Borsa di studio postepay",
        "content": "Vorrei chiedere a chi lo sa dove si può usare. Io sto provando dappertutto e non funziona, c'è scritto che si dovrebbe poter utilizzare per acquisti online e non a patto che rispettino le categorie sulle quali puoi sfruttare questa borsa di studio. \nPer dire c'è anche intrattenimento: ho provato a comprare online un biglietto del cinema e non funziona.\n\nLo chiedo qui perché da quel che ho capito la fa il comune, credo e quindi magari qualcuno di Torino sa usarla. Mi scuso per questa domanda che mi sembra stupida ma davvero non so più come usarla e non vorrei sprecarla🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1py855z/borsa_di_studio_postepay/"
    },
    {
        "id": "1pwu9ej",
        "author": "raramoss",
        "title": "Incidente san salvario.",
        "content": "Buongiorno a tutti. \nSabato scorso, 20/12 alle 4 del mattino è successo un incidente in via saluzzo, n. 97 con la mia macchina e più tre che erano parcheggiate, sappiamo che il conducente era un’auto bianca con il tetto rosso, questa persona ha chiamato un carro atrezzi e è scapata, quindi non ha lasciato nessuno numero di telefono oppure targa. Qualcuno di voi ha visto qualcosa che possa aiutare?",
        "upvotes": 47,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kev1aexazp9g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1pwu9ej/incidente_san_salvario/"
    },
    {
        "id": "1pwyi35",
        "author": "Competitive-Sky712",
        "title": "Biglietto GTT. Come scopro se è usato o meno?",
        "content": "Ho trovato un biglietto nel portafoglio e non ricordo se lo ho già usato o meno. Qual è il modo più furbo per controllare se è ancora utilizzabile ovviamente senza salire su di un mezzo?",
        "upvotes": 20,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/54y550yi6r9g1.jpeg?auto=webp&amp;s=8fb6216de169a8d51aa780294b12b147c78d3752"
        },
        "permalink": "/r/torino/comments/1pwyi35/biglietto_gtt_come_scopro_se_è_usato_o_meno/"
    },
    {
        "id": "1pwzbqh",
        "author": "Beneficial_Koala_882",
        "title": "Waiting at Porta Nouva....",
        "content": "Hello guys , I hope everyone is having good vacations , I wanted to ask something , I have a flight from Turin airport on the morning of 9th January and I am currently in Savona, I have to look for suitable ways to come to airport, however I found a flixbus that takes me from genoa principe to turin porta nouva , having a 1:30 minutes stay at the porta nouva bus stand , I was wondering considering the weather conditions and safety purposes is it fine to book that bus or should i consider coming to Turin a night before , staying there at someone's place. Or are there any other options to commute before 8 in the morning from Savona or Genoa. \n\nLooking for answers , Thank you ",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1pwzbqh/waiting_at_porta_nouva/"
    },
    {
        "id": "1px7r9t",
        "author": "Glauco1",
        "title": "locali tranquilli aperti di notte",
        "content": "Salve a tutti! Ogni weekend il locale sotto casa mette la musica ad alto volume, disturbandomi. Volevo quindi sapere se esistessero bar o locali tranquilli in cui è possibile stare al chiuso (possibilmente anche fino all'una di notte) a leggere/studiare nei giorni di venerdì e sabato. Vanno bene anche posti tipo aule studio o biblioteche. Grazie mille a tutti!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1px7r9t/locali_tranquilli_aperti_di_notte/"
    },
    {
        "id": "1pwp7eg",
        "author": "Kernel_907",
        "title": "Dove trovare una bicicletta?",
        "content": "Ciao ragazzi, non conosco bene la città, mi servirebbe una bicicletta perchè mi trasferisco a breve a Santa Rita e potrebbe rivelarsi fondamentale! \nQualcuno sa dirmi dove posso trovarne di usate a veramente bassissimo prezzo? Davvero a me basta che pedali 😅\nGrazie (e buon fine feste a tutti)",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pwp7eg/dove_trovare_una_bicicletta/"
    },
    {
        "id": "1pwjnu6",
        "author": "NoResponsibility151",
        "title": "Appena trasferiti a Torino: Musei Card e visita al Museo del Cinema",
        "content": "Ciao a tutti!\n\nSiamo argentini e ci siamo trasferiti da poco a Torino, quindi stiamo iniziando a conoscere la città   \nHo appena comprato la Musei Card e questa domenica pensavo di andare al Museo Nazionale del Cinema.  Se qualcuno ha voglia di unirsi, è il benvenuto!  \nAccetto volentieri consigli su altri musei, ad esempio il Museo Egizio o il Museo Lavazza.\n\nMi fa molto piacere per praticare l’italiano, e se volete praticare lo spagnolo, volentieri 😄",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pwjnu6/appena_trasferiti_a_torino_musei_card_e_visita_al/"
    },
    {
        "id": "1pw7ryu",
        "author": "LuxJupiterian",
        "title": "Suggerimenti per nuova camminata montana",
        "content": "Buonasera ragazzi. Sono qui per chiedervi altri suggerimenti per percorsi raggiungibili da Torino (tipo un'ora di macchina o poco più).\nSono già stato nei seguenti luoghi, per farvi un'idea, e vorrei andare in sentieri della medesima difficoltà/bellezza/altitudine, più o meno:\n- Val Chisone, Parco Naturale Orsiera Rocciavrè: 2000 m (rifugio Selleries);\n- Valle Pellice: 1700 m (provincia Villanova d'asti, rifugio Jervis);\n- Nevache: rifugio i Re Magi;\n- Ceresole Reale.\n\nL'importante è che non siano camminate da Pro. \n\nPS. Abbiamo i ramponcini e scarpe adatte, quello sì.\n\nGrazie!\n\n\n",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pw7ryu/suggerimenti_per_nuova_camminata_montana/"
    },
    {
        "id": "1pwgli4",
        "author": "Cool-Impression6669",
        "title": "Anyone interested in learning Touch Designer?",
        "content": "I have given up on that software more than I can remember it. I always run into some issues with this software and it infuriates me. I am usually good in learning software and good in blender as well, but I just need a study buddy who is not not willing to give up learning this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pwgli4/anyone_interested_in_learning_touch_designer/"
    },
    {
        "id": "1pw0boc",
        "author": "questionsoftheworld",
        "title": "Cancelling pre-enrollment application after admission to Politecnico Torino",
        "content": "Hello,\n\nI applied to Politecnico di Milano for a master's in Architecture, but the results will come out at the end of May.\n\nIn the meantime, I am also applying for Politecnico di Torino in the 1st call for master's in Architecture. However, if I get in, then I only have until the 30th of April to complete the pre-enrolment deadline for the Study Visa.\n\nNow, if I get admitted to Politecnico Torino and complete the pre-enrollment application for it, and then get into Politecnico Milano, can I then cancel the pre-enrollment for Torino and do another application for Politecnico Milano?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pw0boc/cancelling_preenrollment_application_after/"
    },
    {
        "id": "1pv9nmy",
        "author": "Spiritual_Cake_9127",
        "title": "Auguri a tutti, tranne a questo idiota tamarro che nonostante la pioggia battente ha ritenuto opportuno applicare dei fuochi d'artificio enormi nel divisorio in mezzo alla strada prima di ripartire a gran velocità",
        "content": "",
        "upvotes": 80,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1u7l21g2jb9g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1pv9nmy/auguri_a_tutti_tranne_a_questo_idiota_tamarro_che/"
    },
    {
        "id": "1pvng9o",
        "author": "Spirited_Currency_30",
        "title": "Superga",
        "content": "Ciao a tutti. Triplo ringraziamento di: \nCioccolata calda\nPanettone \nCuffie\n\nAdesso essendo una persona che non sa guidare una machina e che patisce il freddo tantissimo... So che si può arrivare con i mezzi a Superga ma la mia paura è se ci sarà la neve.\nQualcuna sa se c'è ne neve in Superga ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pvng9o/superga/"
    },
    {
        "id": "1pv5c5t",
        "author": "Terrible_Wrap1928",
        "title": "Il deficente che ci sta terrorizzando a San Salvario con i fuochi d'artificio può smetterla per favore?",
        "content": "grazie ",
        "upvotes": 46,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1pv5c5t/il_deficente_che_ci_sta_terrorizzando_a_san/"
    },
    {
        "id": "1pv4iqm",
        "author": "CieloeMare",
        "title": "TARI Registration Form (Without SPID)",
        "content": "Is there a guide to fill out the Tari Registration Form? I couldnt find any. \nAre there things to be careful about?\nIs there a way to get free assistance?\nThanks in advance.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pv4iqm/tari_registration_form_without_spid/"
    },
    {
        "id": "1purkxh",
        "author": "RedditUser13011997",
        "title": "Lavoro a Torino vivere a Pinerolo",
        "content": "Ciao a tutti, come da titolo purtroppo fra qualche mese dovrò trasferirmi e trovarmi una casa non in condivisione con altra gente(ho avuto coinquilini a casa per più di 6 anni adesso basta!!!) cercando case a Torino mi rendo conto che i prezzi sono altissimi per un bilocali (almeno 500+ spese per non più di 35m) sto valutando un po' fuori Torino visto che fuori i prezzo sono più \"normali\" particolarmemte Pinerolo. Che ne pensate? È ben collegata con il treno? Ho la possibilità di fare smart 3/5.\nConsigli? Altri posti in cui l'affitto è ancora abbordabile in paesini ben collegati con Torino? \nGrazieeeee",
        "upvotes": 6,
        "comments": 46,
        "media": null,
        "permalink": "/r/torino/comments/1purkxh/lavoro_a_torino_vivere_a_pinerolo/"
    },
    {
        "id": "1pumjd0",
        "author": "googly-eyes2",
        "title": "Locali alternativi/dark/metal",
        "content": "Salve a tutti e buona vigilia! Visiterò Torino dal 26 al 28 dicembre e mi chiedevo se ci fossero locali o serate alternative con musica dark/gotica/metal a cui partecipare! Grazie in anticipo🌸",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pumjd0/locali_alternatividarkmetal/"
    },
    {
        "id": "1puq379",
        "author": "infraross_",
        "title": "Posti dove studiare 27-28-29-30",
        "content": "Ciao! Visto la possibilità di fare ponte moltissimi posti dove solitamente vado a studiare, come le biblioteche, aule studio e il Comala sono chiusi. Avete consigli su posti specifici tranquilli e soprattutto aperti anche di pomeriggio dove poter studiare?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1puq379/posti_dove_studiare_27282930/"
    },
    {
        "id": "1pupwtb",
        "author": "_pigreco_",
        "title": "svapatori",
        "content": "ciao, sto cercando negozi di sigarette elettroniche che abbiano basette di nicotina economiche, per ora il più basso che ho trovato le vende a 4 euro. se conoscete qualcuno con prezzi più vantaggiosi…",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pupwtb/svapatori/"
    },
    {
        "id": "1puew5d",
        "author": "PuzzleheadedTeam3803",
        "title": "Question about asbestos",
        "content": "Hello! Sorry if this is a stupid question, but I've been planning to move to Torino for a couple of months, and I've heard northern Italy (And by extension, Torino) has a problem with asbestos contamination.\n\nIs this true or are these concerns unfounded?",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1puew5d/question_about_asbestos/"
    },
    {
        "id": "1ptv9ev",
        "author": "Intrepid-Routine-875",
        "title": "Ma il mercato della vanchiglietta chi lo controlla?",
        "content": "Ho notato che in quel mercato non ci sono etichette ne tracciamenti, senza considerare che la maggior parte dei prodotti non ha nemmeno il prezzo esposto.. Frutta e verdura non hanno scritto la provenienza, e vengono conservate malissimo. Ho visto due di quei banchi spostare i prodotti dal banco ad un garage che usano come magazzino, non oso immaginare d'estate.\n\nGli altri prodotti, carne, pesce, pasta fresca, frutta secca, olio, conserve, mozzarelle, eccetera, non ha mai etichette che indichino la provenienza, la data di scadenza gli ingredienti. Non c'è tracciabilità di alcun tipo.  \nI prodotti da bagno e casa sono tutti sfusi, senza confezioni, con le etichette strappate nella parte della tracciabilità.\n\nMa è legale una cosa simile? Il mercato in corso chieti sembra essere senza regole.",
        "upvotes": 19,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1ptv9ev/ma_il_mercato_della_vanchiglietta_chi_lo_controlla/"
    },
    {
        "id": "1ptucvl",
        "author": "DistributinOfWealth",
        "title": "Richiesta pubblicazioni fatta! Cosa devo fare ora e quali sono i tempi reali?",
        "content": "Ciao a tutti,\n\nIo e la mia compagna abbiamo appena firmato la richiesta di pubblicazione in Comune, ma non abbiamo ben capito i passaggi successivi. L'impiegato è stato piuttosto sbrigativo e vorrei evitare sorprese con le date.\n\nQualcuno che ci è già passato sa dirmi:\n\n1. **Quanto tempo passa** della richiesta fino alla firma all'effettiva affissione online?\n2. **Ci sono ritardi** comuni di cui dovrei essere a conoscenza per non ridurmi all'ultimo secondo?\n\nUna volta ottenuto il certificato di eseguita pubblicazione, dobbiamo chiamare noi per confermare la data o ci contattano loro?\n\nGrazie a chiunque mi aiuti a fare chiarezza in questo limbo burocratico!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ptucvl/richiesta_pubblicazioni_fatta_cosa_devo_fare_ora/"
    },
    {
        "id": "1pt3fau",
        "author": "Competitive-Sky712",
        "title": "Sosta a metà carreggiata",
        "content": "Non mi capacito di come in questa città la sosta nel mezzo della carreggiata sia tollerata. Auto ferme a cavallo della linea che separa le due corsie di marcia. Lo trovo molto scomodo per il flusso di traffico e pure molto pericoloso. Immagino sia la versione torinese della doppia fila, ma non mi pare di averlo mai visto in altre città. \n\nVoi che ne pensate?",
        "upvotes": 43,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1pt3fau/sosta_a_metà_carreggiata/"
    },
    {
        "id": "1ptj9ie",
        "author": "Le_Moulin_Italien",
        "title": "Turin House Market",
        "content": "Hiii,\n\nI have to give my notice to my landlady and have to move out in July.\n\nDoes anyone know how is house market in May/June to find a house in July for two international students?\n\nI only have traumua from August and September 😭\n\nMany thanks!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ptj9ie/turin_house_market/"
    }
]