[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 75,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lw9k8l",
        "author": "NishinosanTV",
        "title": "KPop Demon Hunters directors and music supervisor is doing an AMA on r/kpop today at 9 AM PT.",
        "content": "Hey r/netflix \n\nWe're being visited by some of the people behind KPop Demon Hunters today for an AMA on [r/kpop](https://www.reddit.com/r/kpop/). Notably the directors Maggie Kang and Chris Appelhans alongside the music supervisor Ian Eisendrath. The AMA starts at 9 AM PT.\n\nYou can send your questions in the thread attached to this post. Or, you can head on over directly to [r/kpop](https://www.reddit.com/r/kpop/) now, it'll be pinned at the top.\n\nNish\n\n[r/kpop](https://www.reddit.com/r/kpop/) modteam",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw9k8l/kpop_demon_hunters_directors_and_music_supervisor/"
    },
    {
        "id": "1lvsll9",
        "author": "grasskisser",
        "title": "Netflix cancels The Residence",
        "content": "I just read this and I am so upset! I really enjoyed this show, so did everyone else I know who watched it. It was about a murder in the White House, and it really kept me guessing the whole time. Cordelia  Cupp, a modern day Columbo, and bird watcher was riveting!  I am so sad because Netflix, in my opinion, does this with so many shows. I wish they would at least commit and do less shows for production. They have so much junk on the platform that is no good, but this was, it really was! Tell me what you ladies and gentleman think below. Am I the only one? I would love to hear your thoughts. ",
        "upvotes": 268,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1lvsll9/netflix_cancels_the_residence/"
    },
    {
        "id": "1lvzgbo",
        "author": "MaxwellSmart07",
        "title": "Nominations for the worst series currently playing on Netflix?",
        "content": "I’ve seen a lot of losers, well actually I’m mostly on Reddit while my wife watches. Currently she is watching Blindspot, a ridiculous the world’s going to blow up every day FBI drams (um, farce). That’s my nomination. Any others anyone wants to warn me about. Thanks.",
        "upvotes": 99,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzgbo/nominations_for_the_worst_series_currently/"
    },
    {
        "id": "1lwegap",
        "author": "LouisTully9000",
        "title": "Too Much Dunham? Possibly. But Not Nearly Enough Megan Stalter",
        "content": "It’s been several years since the chatter around ***Girls*** dimmed to a quiet murmur on the edge of the cultural highway; a show that once inspired think-pieces, toxic debates about privilege and nudity, and a nation of 20-somethings wondering if they, too, were the voice of their generation. Or at least a voice. Of a generation. Since then, Lena Dunham has remained a topic of public fascination, often more for her missteps than her media. There’s been outrage, apology tours, half-started memoirs, a medieval coming-of-age film with a prosthetic rat, and now… a Netflix series called ***Too Much***. And reader, it is.\n\nLet’s not bury the lede: ***Too Much*** is messy. It’s loud. It’s prone to emotional whiplash and cinematic ADD. It’s a show that asks you to embrace characters who, in real life, you might ghost after a single brunch. It is also, somehow, the best thing Dunham has done in years.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lwegap/too_much_dunham_possibly_but_not_nearly_enough/"
    },
    {
        "id": "1lwhg0s",
        "author": "quietrain",
        "title": "HUNTRIX - What It Sounds Like (Male Cover, Lyrics and Guitar Chords) KPop Demon Hunters",
        "content": "I tried XD",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwhg0s/huntrix_what_it_sounds_like_male_cover_lyrics_and/"
    },
    {
        "id": "1lw6nfm",
        "author": "No_Gold_4554",
        "title": "Building The Band",
        "content": "The first four episodes were great television. It's all about the singers voting for each other (that's what they want us to think anyway) and forming groups of their own volition. Such fun.\n\nBut watching the trailer, it would inevitably devolve into an x-factor style show where it's all about the judges and the judges making up non-sensical advice for the drama. \n\nI wish there were more english talent shows that are not centered around the celebrity judges.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lw6nfm/building_the_band/"
    },
    {
        "id": "1lvg8bt",
        "author": "Darkstar_111",
        "title": "The Sandman season 2 is... Actually really good!",
        "content": "Hate to say it, considering the allegations against the creator is harsh and serious. But the second season is better than the first. It feels carefully crafted, the actors are giving us a nuanced rendition of impossible characters and every episode flows by... Like a dream...\n\nSorry, had to go there. 🤭",
        "upvotes": 135,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1lvg8bt/the_sandman_season_2_is_actually_really_good/"
    },
    {
        "id": "1lw3x3t",
        "author": "LightZapper",
        "title": "Building The Band Thoughts",
        "content": "I am currently on Episode 4 right now, and wanted to hear everyones opinion on the current bands formed. \n\nBand 4: Mason, Conor, Shane, and Zach I feel has a lot of potential for the standard pop band. Alone I felt Conor was the strongest so far, maybe the first performance song just fit his voice best but when they came in together the harmonies were out of this world. It almost reminded me of one direction when they came together they blended amazingly together for their first performance. Id love to hear others thoughts on the current bands. \n\nBand 2: Landon, Shade, Malik, and Bradley could be an amazing soul/R&amp;B group and I see the potential, loved their auditions and could definitely see them going far!! \n\nBand 1: Donzell, Aaliyah, Cameron, and Katie I dont have too many thoughts on this first group but they had have a lot of powerful voices here and im interested in seeing what direction this group heads in\n\nBand 3: Nori, Wennley, and Brianna \nI think this group needs a fourth, but were quick to rush and form a three piece. It feels like something is missing or out of place to blend all their voices together\n\nOne more band is currently forming but Id love to hear everyones opinions so far! ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lw3x3t/building_the_band_thoughts/"
    },
    {
        "id": "1lw1o24",
        "author": "ArtisticCod9367",
        "title": "Is the performance order on Building the Band (Netflix) unfair to later contestants?",
        "content": "I’ve been watching Building the Band on Netflix, still on EPISODE ONE LOL and I noticed something that feels a little off. Each contestant performs one by one in to the group of 50, and people are eliminated as the performances go on.\n\nSo here’s my question: doesn’t this give an unfair advantage to contestants who perform later?\n\nFor example, if contestant #3 performs, they’re being judged while all 50 people are still technically in the running. But by the time contestant #40 goes up, a bunch of contestants have already been eliminated, so there are fewer people to compete with or be compared to. That feels like an uneven playing field.\n\nHas anyone else noticed this? Is there something I’m missing in how the voting or eliminations work that makes it fair? Curious what others think.\n\nOr should I just wait and it will seems clearer later?",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lw1o24/is_the_performance_order_on_building_the_band/"
    },
    {
        "id": "1lwb7gu",
        "author": "Sufficient-Crew-5408",
        "title": "Anyone having issues with Netflix?",
        "content": "All my other streaming apps are loading but any time I try and go to Netflix it just gives a black screen and nothing loads?! I’ve tried everything I can think of but it’s not working! \n\nAnyone have this issue or know how to fix it?! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lwb7gu/anyone_having_issues_with_netflix/"
    },
    {
        "id": "1lw5a7a",
        "author": "Confident-Dinner8409",
        "title": "The society",
        "content": "I just finished watching the society and I am absolutely devastated that there is no season 2. I am so fussy with shows and this one captivated me. \n\nIs there anyway fans can somehow show Netflix we want another season? \n\nI am so sad, I NEED to know what happens. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5a7a/the_society/"
    },
    {
        "id": "1lvl51z",
        "author": "buildingthebandnews",
        "title": "Building The Band premiered on Netflix tonight!",
        "content": "What was everyones thoughts? would love to know your favourite performances, who you loved, who you hated, best/worst bands formed?! my only disappointment was no Liam Payne in the first drop of episodes. I did love the tribute they did tho &lt;3",
        "upvotes": 28,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1lvl51z/building_the_band_premiered_on_netflix_tonight/"
    },
    {
        "id": "1lw7cuu",
        "author": "Indoril-Nerevar337",
        "title": "Daniel Craig Returns in New Sneak Peek at “Wake Up Dead Man,” the Next Knives Out Mystery",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw7cuu/daniel_craig_returns_in_new_sneak_peek_at_wake_up/"
    },
    {
        "id": "1lv8tec",
        "author": "ironfalafel",
        "title": "I'm Convinced Old Guard 2 story was created and mostly written by AI, and that's why it sucked.",
        "content": "Title says it all. To wait five years for a sequel to such an original story sucked as it is, but to then receive what we got as the final product was just a slap in the face to the audience. \n\nThe entire premise seemed like it was generated using AI along with the script. Everything was just so choppy and the movie felt like it had absolutely zero substance to it. \n\nI'd almost rather pretend we never got a sequel at all. ",
        "upvotes": 155,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1lv8tec/im_convinced_old_guard_2_story_was_created_and/"
    },
    {
        "id": "1lw5ujn",
        "author": "S4v1r1enCh0r4k",
        "title": "Global Webtoon Sensation Heads to Netflix as Live-Action Series",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5ujn/global_webtoon_sensation_heads_to_netflix_as/"
    },
    {
        "id": "1lviehl",
        "author": "gamerz0111",
        "title": "(Squid Game S3 spoilers) Anyone else disappointed with these two plot threads?",
        "content": "[I really thought Seong Gi-hun’s commando subplot was building up to something big — like a major action set piece once they reached the island. But instead, they got mowed down like fish in a barrel, and we were left with two guys who barely contributed to anything.](https://squid-game.fandom.com/wiki/Seong_Gi-hun#articleComments)\n\nThen there was the former North Korean soldier subplot, which felt like it belonged in an entirely different show. It barely intersected with the main characters or the core storyline. After all that gunfire, are we really supposed to believe the Front Man didn’t notice a thing?",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lviehl/squid_game_s3_spoilers_anyone_else_disappointed/"
    },
    {
        "id": "1lvgc71",
        "author": "ToonAdventure",
        "title": "Wednesday: Season 2 | Official Trailer | Netflix [July 9 at 5:58 AM PT]",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lvgc71/wednesday_season_2_official_trailer_netflix_july/"
    },
    {
        "id": "1lw32zc",
        "author": "proactive-mind",
        "title": "Zero Day — A Masterpiece on Truth, Fear, and Power (And Why It Deserves More Credit)",
        "content": "\n\nJust finished *Zero Day* and I’m honestly blown away. Before anything else, I want to highlight the minds behind it:\n\n* **Noah Oppenheim** – former president of NBC News and Oscar-nominated screenwriter (*Jackie*)\n* **Michael S. Schmidt** – Pulitzer Prize-winning journalist from The New York Times\n* **Eric Newman** – producer of *Narcos* and *Children of Men*\n* **Lesli Linka Glatter** – directed all 6 episodes (she’s known for *Homeland*)\n\nThese are not just Hollywood names. These are people who’ve worked inside media, politics, and truth itself. And it *shows*.\n\n*Zero Day* isn’t just a political thriller. It’s a reflection of our time: how fragile the truth has become, how fear spreads faster than facts, and how power is often invisible. Whether “Proteus” is real or not is almost beside the point—what matters is *what people believe*, and what happens when everyone has their own version of reality.\n\nI get why some viewers (like my girlfriend 😅) found it slow or hard to connect with—it’s not action-packed, and it doesn’t hold your hand. But for those who pay attention to current events, politics, or media—it’s almost *too real*.\n\nThis show hit me hard. It made me question not just the plot, but how much of what I see every day is filtered, manipulated, or designed to confuse. And that’s powerful storytelling.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw32zc/zero_day_a_masterpiece_on_truth_fear_and_power/"
    },
    {
        "id": "1lvzvsp",
        "author": "SWSenthusiast",
        "title": "Can't watch Squid Game???",
        "content": "I keep getting an error that says \"This title is not available to watch instantly. Please try another title.\" whenever I try to open an episode of Squid Game.\n\nI'm able watch The Sandman, The Double, Castlevania, and everything else on my list. Is anyone else having this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzvsp/cant_watch_squid_game/"
    },
    {
        "id": "1lvztcg",
        "author": "Dangerous_Phase_299",
        "title": "show recommendations",
        "content": "My little sister (11f) is going to a soccer camp tomorrow and needs some show recommendations. She has been obsessed with Stranger Things, but that's not the best option because she's going to be away from home and sharing a room with another kid, so we don't want to worry abt nightmares for either of them. Do you have any show or movie recommendations? preferably PG, but PG-13 is okay. Thanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvztcg/show_recommendations/"
    },
    {
        "id": "1lv80xo",
        "author": "greenhierogliphics",
        "title": "Animal kingdom no stopping",
        "content": "This series started kind of slow to me, but once it got rolling there’s just no stopping. I need to get to bed, but I NEED to see what’s going to happen next! On season 2 beginning episode 6. ",
        "upvotes": 52,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lv80xo/animal_kingdom_no_stopping/"
    },
    {
        "id": "1lw90kq",
        "author": "TheExpressUS",
        "title": "Fans feel robbed as Netflix cancels longest-running series",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lw90kq/fans_feel_robbed_as_netflix_cancels/"
    },
    {
        "id": "1lvi53t",
        "author": "S4v1r1enCh0r4k",
        "title": "Jenna Ortega Is Back and Darker Than Ever in 'Wednesday' Season 2 Trailer",
        "content": "",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lvi53t/jenna_ortega_is_back_and_darker_than_ever_in/"
    },
    {
        "id": "1lvw01k",
        "author": "Desperate-Pin9777",
        "title": "Recommendations",
        "content": "I’ve watched many series so far I loved loved squid game, money heist, all of us are dead. So you people know my taste then. Can you guys recommend me any similar series? 🎀",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvw01k/recommendations/"
    },
    {
        "id": "1lvveq0",
        "author": "mebcbb",
        "title": "Resolution decreasIle? mobile?",
        "content": "It's seems that Netflix is decreasing video resolution when viewing on mobile. Sometimes I like to watch higher resolution but it forces me to watch lower quality.  Has anyone else noticed this? Do you know what they are doing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvveq0/resolution_decreasile_mobile/"
    },
    {
        "id": "1lw5m4o",
        "author": "iDawn18",
        "title": "Netflix on iOS 12 not working",
        "content": "I use my old iPad to watch Netflix and I couldn't watch anything because it gave me a connection error, I restarted and it didn't work so I deleted the app and downloaded it again and now I can't even log in, any solution?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lw5m4o/netflix_on_ios_12_not_working/"
    },
    {
        "id": "1lvzzg3",
        "author": "Peg_Leg_Vet",
        "title": "Netflix Removed My Downloads Unexpectedly",
        "content": "I am currently traveling and will be for pretty much the whole month of July. Before leaving the US, I made sure to download a good bit of content to watch on the different plane flights. Imagine my suprise when not even two days into my trip, all of my downloaded content was gone. One movie I had downloaded just that morning while on a layover. I had only watched one movie and a couple episodes of a new season of a show. Then, to make it worse, I can't re-download any of that content because I hit my monthly limit. On top of that, I tried to download some content on another device, but am not even being given the option to do so anymore even though I have in the past.\n\nI was able to contact Netflix support who could offer no actual explanation for why my content was now missing or why I could not download to a second device. Both devices were showing under my account with titles being downloaded. And their only suggested solution was to pay for a higher tier of service that would allow me to download more content (I'm on the ad supported tier) since the one device that can download content has already maxed it's limit. That has got to be the biggest corporate greed solution ever. Why should I pay more for a service when I am not even getting what I am paying for now? I'm paying for a service that will let me download some content for travel without removing it mysteriously and without warning. I don't need 100 downloads, 15 is fine. I'm also paying for a service that is supposed to allow downloading content on two devices. Yet that isn't working either anymore. Both of my devices are new and fully compatible, and I have downloaded on both in the past. \n\nSo now I have dozens of hours to look forward to on airplanes with none of the content I was really looking forward to watching. Fortunately I still have some content from other streaming services who haven't removed my downloads mysteriously. I've been a Netflix customer since the days of mail DVDs, but this has honestly got me thinking to finally ditch Netflix. It's clear they care more about their short term profit than actually keeping customers.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzzg3/netflix_removed_my_downloads_unexpectedly/"
    },
    {
        "id": "1lvzwvm",
        "author": "at1991",
        "title": "Mr. Robot, captions done match and music doesn't at times.",
        "content": "Kinda annoyed they changed some of the music. I watch with captions and they changed a OutKast song.....changed the word r.kelly (which was a more appropriate reference) to \"more but than an ashtray\" I understand copyrights but still it's part of the art. End of rant. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzwvm/mr_robot_captions_done_match_and_music_doesnt_at/"
    },
    {
        "id": "1lvtdxo",
        "author": "Academic-Ganache702",
        "title": "The sandman serie is deep",
        "content": "I am watching the sandman rn (being stoned) on netflix. And this movie is probably the best way to experiende how shrooms feel😅\n\nThe way how it puts you to think about life, death and certain things in live. You trip a bit and than stuff becomes clear.\n\nJust wow",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvtdxo/the_sandman_serie_is_deep/"
    },
    {
        "id": "1lvt4kr",
        "author": "Blademir1708",
        "title": "The story of kpop demon hunters was really weird (SPOILERS)",
        "content": "KPop Demon Hunters is an extremely fun movie, with banger songs, amazing vocal performances, and godly animation (sony is so good at this style). Yes, i loved the movie, but the story just left me confused at the end.\n\nWhile watching the movie, I thought that the movie was about how no one is truly evil, and everyone deserves a second chance. The evidence of this being the girls not wanting to use a diss track to make the golden honmoon because they didn't want to do it with hate, and also Jinu's whole backstory. Yes Jinu did leave his child but Rumi said in the movie that that's not all he is, which led me to believe that this would serve as a signal that demons can also be good. Also, Gwi Ma was the one who used the demons fears to take control over them, so they couldn't be completely at fault.\n\nDespite all this, Gwi Ma dies (which is expected), but every demon dies as well. Are we to believe that all of them deserved that death? Because that's not the message the movie was hinting at earlier. Jinu dies, and yes it could be argued that he paid the price for his sins, but I'd argue that 400 years of tormenting voices of his family was enough torture for the character. I feel like it would've been more interesting if they'd explored the idea of Gwi Ma being evil, and demons the humans who made mistakes and are now paying the price.\n\nThe plot point of Rumi being a half demon was interesting, and led to the actual message of the movie, of not being ashamed of you are, but it could've been explored more. The same applies to her relationship with Celine, which was just served to us through flashbacks.\n\nAlso, not a real criticism, but just a side note, what happened to the missing persons cases, cause their souls are just gone? Was the identity of Gwi Ma and Saja being demons now known to everyone? Did everyone just accept that fact?\n\nTLDR; fucking amazing animation, songs, voice acting (glad they didn't do chris pratt as jinu), and an extremely fun movie, but the plot left more to be desired\n\n  \n(Also, the sort of romance between jinu and rumi was weird, it's literally the 1000 year old anime girl that looks like she's 9 years old, but a little better)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvt4kr/the_story_of_kpop_demon_hunters_was_really_weird/"
    },
    {
        "id": "1lv6cgu",
        "author": "Comprehensive-Way482",
        "title": "'Monster' Season 4 in the Works at Netflix, Focused on Lizzie Borden",
        "content": "",
        "upvotes": 31,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lv6cgu/monster_season_4_in_the_works_at_netflix_focused/"
    }
]