[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 72,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lnrhna",
        "author": "antonia71007",
        "title": "a few takes of mine from the poop cruise documentary (this has definitely been talked about before but idc)",
        "content": "first of all, the guy with the glasses and the bachelorette party were so goddamn annoying. i’m pretty sure the guy cared more about his father in law than the cruise. now i get that shitting in a bag isn’t nice, but wanna know what’s worse? walking around ankle deep in other people’s piss and shit, or shitting on top of someone else’s layered shit. they were clearly all so privileged to act like that. and then they were all disgusted when the piss and shit got everywhere. who’s fault was that? yours for not using the damn bags and continuing to use the toilets. \n\nsecondly, who thought it was a good idea to open the bar? that was really stupid, they were obviously gonna go crazy. and then they were surprised when it turned into a poop deck frat party? like what did you expect?? theyve been stuck there for 4 days.\n\nthirdly, i felt bad for the dad. he was recently divorced and just wanted to have a good time with his daughter, and that was what happened, and he felt like he had failed. at least they still go on cruises together \n\nand obviously, i was dying laughing everytime the indian chef came on screen. when he was talking about someone throwing the shit bag and hitting someone else, i was rolling\n\nthat’s it folks. thanks for coming to my ted talk",
        "upvotes": 78,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrhna/a_few_takes_of_mine_from_the_poop_cruise/"
    },
    {
        "id": "1ln8s7l",
        "author": "Jumpy-Purple7593",
        "title": "What’s a hidden gem on Netflix that you always recommend but no one ever seems to watch?",
        "content": "We all have that one show or movie we loved on Netflix, the one you tell people about constantly, but for some reason, nobody ever seems to give it a shot. Mine is “The OA” ,weird, emotional, and absolutely brilliant. Every time I recommend it, people nod politely and go right back to rewatching The Office for the 6th time. So let’s hear it: what’s your underrated favorite? Could be a foreign film, a forgotten limited series, or a random docuseries that blew your mind. ",
        "upvotes": 1070,
        "comments": 1224,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8s7l/whats_a_hidden_gem_on_netflix_that_you_always/"
    },
    {
        "id": "1lntmmm",
        "author": "picantepepper1",
        "title": "Someone Feed Phil Appreciation Post",
        "content": "This new season made me compelled to write this : I do hope he is a good person IRL, but wow, watching this show makes me feel really touched by the small gestures he does throughout the trips to these different countries. \n\nYes, the family connection is there with his wife, his kids, his brother, and previously his parents (RIP). He's been able to pivot to \"Jokes for Max\" in a really heartwarming way. \n\nBut there are two points I want to emphasize:\n\n1). How in recent seasons when he is traveling he is very conscious to discuss the societal issues and humanitarian efforts going on in all of these countries/cities. It might feel heavy handed at times, but it is the minimum he can do to raise awareness for good causes.\n\n2). How he treats the people he works with and the people he cares about. Almost always in each episode he has a scene where he's having the camera crew getting in on trying the food, too. He will typically treat the local fixers to meals which reinforces this as well. But most of all what I thought was touching this season were his personal stories with his dad's Filipino nurse and his Guatemalan nanny - how he went out of his way to honor them during these journeys. \n\nCombined to me shows someone who cares for his staff no matter how long you worked for him. Feeling like the Everybody Loves Raymond royalties are doing a bit of good in their afterlife. \n\nPhil if you see this, I love ya. \n\n",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lntmmm/someone_feed_phil_appreciation_post/"
    },
    {
        "id": "1ln7niq",
        "author": "zentyme_",
        "title": "Squid Game: Season 1 vs Seasons 2-3",
        "content": "",
        "upvotes": 184,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1ln7niq/squid_game_season_1_vs_seasons_23/"
    },
    {
        "id": "1lnrdlf",
        "author": "randomuser_q12",
        "title": "What do you want to see on Netflix and what needs to come back?",
        "content": "I remember a few years ago they had the original twilight zone. I’m an old fashioned girly that loves her twilight zone and I want it to come back! But I’m very happy to see they have Alfred Hitchcock’s movies. I would love to see more Asian horror movies like my favs a tale of two sisters, juon series, and ringu. I don’t know if those were ever on Netflix but I hope to see it there one day!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrdlf/what_do_you_want_to_see_on_netflix_and_what_needs/"
    },
    {
        "id": "1lnn2l1",
        "author": "wijnandsj",
        "title": "any way to get rid of the mobile games in my view?",
        "content": "It's really rather annoying all those games I'm never going to play and have 0 interest in. Can it be removed from the app/site in any way? Or is this unavoidable?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnn2l1/any_way_to_get_rid_of_the_mobile_games_in_my_view/"
    },
    {
        "id": "1lmzrmi",
        "author": "chrisarrant",
        "title": "[News] Netflix's The Sandman was hoped to run for four seasons... but then they re-read the comic, and decided to end it at two",
        "content": "",
        "upvotes": 146,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lmzrmi/news_netflixs_the_sandman_was_hoped_to_run_for/"
    },
    {
        "id": "1ln8xoj",
        "author": "randomuser_q12",
        "title": "What is a Netflix show you wish had another season?",
        "content": "Ugh I miss the show Ju-on origins. It only had 1 season but the show was sooo intense and disturbing. I wish so much this show would come back to Netflix but I’m sure it won’t it’s been like 5 years 😭",
        "upvotes": 25,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8xoj/what_is_a_netflix_show_you_wish_had_another_season/"
    },
    {
        "id": "1lntwo2",
        "author": "ihsjsbs",
        "title": "Same account different movie selection between profiles",
        "content": "So  I have multiple Profiles on my Netflix most of them the setting language is German but mines is English. Now I saw a movie on my Profil and wanted my sister to see the movie also but she couldn't find the movie on her Profil it was only shown on my Profil. Is it because of the setting language ? Because the movie was not in German and didn't have German subtitles ? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lntwo2/same_account_different_movie_selection_between/"
    },
    {
        "id": "1lmswi4",
        "author": "pnut88",
        "title": "Has anyone else watched and fell in love with Dept. Q? Man i thought this show was great!",
        "content": "The build up, the mystery, the acting. All if it. I thought it was superb. Highly recommend if you haven't seen it yet! Any news on if it has a season 2 in the works? Would love to watch another crime!",
        "upvotes": 264,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1lmswi4/has_anyone_else_watched_and_fell_in_love_with/"
    },
    {
        "id": "1lntcad",
        "author": "PhoneFrequent8459",
        "title": "My overall thoughts on squid game s3 and why it didn't resonate with me",
        "content": "\n\nIt kinda felt off.\n\nFirst of all, Gi-hun killing Dae-ho made no sense, him not even regretting it and then going back to his “I’m not evil like them” persona when he was tested on whether he would kill the other contestants before the final game. Like obviously, he is kinda like them. He just killed a dude who literally did nothing wrong and who was crying and saying “sorry”. Literally killed him with his bare hands. Bye. And then he refuses to kill the front man or the other players before the final game (who are actually bad people and did commit clod blooded murder multiple times and were planning on killing a BABY). no instead he goes after the one guy who actually wanted to help him but physically and mentally couldn't anymore. I get that Gi Hun wasnt really in the right state of mind but them attempting to go back to: oh gi hun you're actually a good person your not evil and you have principles'?? Like no he doesn't, it just felt so hypocritical to me. \n\nThis show keeps killing every character, and too many characters too soon, where just the most useless characters were left (I’m looking at you, Player 100). So the last episode didn't really have any high stakes in my opinion and didn't feel that intense. \n\n\nAlso, Player 333—what happened there? I know he was a shitty person, and I was okay with exploring that side of him, but we never really got an explanation or build-up to why he’s actually this psychotic, to the point that he was willing to sacrifice his own baby. Like what? That came out of nowhere?? Needed better writing so we could understand what was even happening.\n\nI liked Gi-hun’s last words, but that’s about it in terms of what I liked about the ending. So many things didn’t make sense— Jun ho literally circling the island for what felt like an eternity just to shout “WHY” to his brother and watch him go up and down a platform (not gonna lie, that was kinda funny). Like what was the point of that storyline? I’m just so confused. The Front Man is still out there thriving, but In ho just doesn’t care anymore? Bro moved on—maybe he got sea sick \n\nThe Front Man literally had no screen time and wasn’t affected by ANYTHING that happened. He was just so nonchalant about it, like it’s a regular workday (probably is). But like, come on, dude.\nAlso literally no confrontation between front man and Gi hun?? What was all that build up in s2 for? Why wasn't there any conversation? Gi Hun literally just walked it off lmao he wasn't even mad about the betrayal he was like alright fine bye. \n\nDo we really have any indication that the games actually stopped in South Korea? 'Cause I don’t think so. The VIPs left unaffected. Sure, the whole place burned down, but that doesn’t stop them from just finding another location or building it up again. We got no real indication that this was the end of the games in SK.\n\nGi-hun sacrificing himself for a CGI baby (okay…). I get it—this is supposed to feel realistic and mirror corruption in real life, etc.—but it just didn’t feel well-executed. The build-up was weird and disjointed. Players acted way too out of character, and it just didn’t feel satisfying. It felt rushed, like they just flipped a light switch—“okay, games are over, moral of the story is corruption will always win, and bye.”",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lntcad/my_overall_thoughts_on_squid_game_s3_and_why_it/"
    },
    {
        "id": "1lnt2tc",
        "author": "HARJAS200007",
        "title": "Solution to the Pervasive stuttering during full screen in the windows app?",
        "content": "I recently just bought a Microsoft surface pro, 11th generation. I'm attempting to watch Netflix full screen but am met with constant lagging/glitching/video stutter. Is there any solution to this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnt2tc/solution_to_the_pervasive_stuttering_during_full/"
    },
    {
        "id": "1lnt0l4",
        "author": "anarchyRozen",
        "title": "Green screen on Android",
        "content": "Hi. I generally don't watch much Netflix—my family does—but lately, I've wanted to watch some series at night before going to sleep.\nThe thing is, I've watched two episodes halfway through, and my phone always freezes and then shows a green screen in the scariest way possible (like a dying GPU), which causes the phone to shut down completely.\nWhen I turn it back on, everything is normal.\n\nThis doesn't happen with any other streaming app or video player. I can't seem to find anything about this issue—just people experiencing a green screen, but not having their phones freeze.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnt0l4/green_screen_on_android/"
    },
    {
        "id": "1lnrjnn",
        "author": "TiddybraXton333",
        "title": "I need a movie recommendation please",
        "content": "I like stuff like training day, casino, good will hunting, 4th kind , etc\n\nSomething with a long drawn out plot line and action, wittiness, and maybe some mystery/ twists and turns. \n\n\nI feel like I’ve seen everything on the app they have shown me in their shitty menu. I know they have a huge library , but most of the stuff I see keeps getting recycled into the menu option they have.\n\n\n\nCan some one throw out some low key bangers please?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrjnn/i_need_a_movie_recommendation_please/"
    },
    {
        "id": "1lnrena",
        "author": "Sk8er_Infinity",
        "title": "Shows with this style animation?",
        "content": "Okay, so shows that I know of so far with this “certain” style are Voltron, The Legend of Vox Machina, Elves: Secrets of Elvendale and Skull Island. These all have the same animation/drawing style, and I LOVE it! Does anyone know any shows that have a similar/the same type of style?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrena/shows_with_this_style_animation/"
    },
    {
        "id": "1lnqwo6",
        "author": "Cooperfan_1114",
        "title": "I Keep Running Into New Content Not Being Available \"With Ads\" Subscription... Seriously Netflix?",
        "content": "First off: F. U.\n\nThis kinda stuff is getting ridiculous within streaming platforms. We are loyal patrons - EVEN THOUGH WE CHOOSE TO ONLY PAY FOR THE TIER WITH ADS - and this is just stupid. I would cancel my subscription if it wasn't included in a good bundle and price through my cell phone company. It just blows my mind... I know it all boils down to money but adding restrictions like this is just going to drive customers away. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lnqwo6/i_keep_running_into_new_content_not_being/"
    },
    {
        "id": "1lmulp4",
        "author": "Shoddy_Mission6702",
        "title": "Is it just me, or is Netflix's release strategy kind of ruining the hype?",
        "content": "Hey everyone,  \nI just wanted to get your take on this. Do you actually enjoy how Netflix handles its series these days?\n\nThey drop a handful of episodes—fewer and fewer —and then split the season in half, making us wait *years* to get the rest. It’s honestly driving me crazy.\n\nPersonally, I much prefer Disney+'s strategy of releasing one episode a week. It builds hype, whereas Netflix's approach kills it.\n\nLike... do they really think people still care about a show after all that time? I can barely remember what I had for lunch, let alone a series I watched ages ago.\n\nCurious to hear what you all think. Am I alone in this?",
        "upvotes": 136,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1lmulp4/is_it_just_me_or_is_netflixs_release_strategy/"
    },
    {
        "id": "1lnm2ah",
        "author": "mmmadness",
        "title": "'KPop Demon Hunters' Review: Sony Animation's Stunning Animated Musical Slays Demons and Serves K-Pop Realness",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnm2ah/kpop_demon_hunters_review_sony_animations/"
    },
    {
        "id": "1lnm1p3",
        "author": "CinderR3bel",
        "title": "I HAVE A QUESTION ABOUT K-POP DEMON HUNTERS!!",
        "content": "Do all the hunter groups achieve the golden honmoon or is that like the ultimate goal? I thought it was something they all achieve but upon rematch the Sunlight Sisters had a blue one. If they have never achieved it, how do they know it's a thing? I agree with the others!! We need a series to answer so many questions!!\n\nAlso, if Rumi's mom died when she was young, was she killed by her demon lover or protecting him? We know that Gwi-Ma can control/force his demons. Did he force Rumi's dad to kill her mom and then Celine killed him? I need to know!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnm1p3/i_have_a_question_about_kpop_demon_hunters/"
    },
    {
        "id": "1ln78k8",
        "author": "Comprehensive-Way482",
        "title": "'Squid Game' Creator Reveals Why Original Ending Was Scrapped",
        "content": "",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ln78k8/squid_game_creator_reveals_why_original_ending/"
    },
    {
        "id": "1lnkyls",
        "author": "Chareb8",
        "title": "Astroworld and General Festival Thoughts",
        "content": "I just want to throw this out there as someone who grew up dancing and performing since I was a child. And this is not to take any sides in this tragedy that had failed planning, logistics, security, contingency plans and destructive humans. I see a lot of people saying \"Travis Scott was on stage looking right at everything!\" \"He saw!\" \"He knew!\" Here are the facts: when you are on a stage with no lights (even when it's daytime), you cannot see or hear everything that is going on. You could be looking in one direction and someone in the audience will think you were looking right at them. But you don't see them. You can't make out their face or what they were wearing. You also cannot hear. All you hear is the music in your earpiece. \n\nWhen the two people went up to the cameraman to notify him, the concert should've stopped. Police should've had authority to stop it. When someone from Live Nation spoke directly to the engineer backstage and told him about the 4 active CPRs, the concert should've stopped. We watched this unfold in real time on Twitter and I knew it would be chaos when they were jumping the gates once doors opened. I am disappointed to see how much was left out of this documentary. Hopefully Prime Video, HBO or Hulu do a deeper dive (if the families agree to it). I know reliving this is traumatizing.\n\n  \nSpeaking on people in general, there was just a party here in NYC where the crowd pushed their way through security. One girl said her purse was snatched right off of her shoulder, others lost their shoes. It is possible\\* that tickets were over sold - I do not know. Security was not prepared for the chaos. But HUMANS, we HAVE to do a better job at how we treat others and how we conduct ourselves, ESPECIALLY at outdoor events. It is dangerous and it is so easy to get trampled, have a panic attack, asthma attack, heart attack, anything. One of the last music festivals that I went to was Made In America in 2013 and the worst parts were either the long food lines, the sun, or my back pain from standing. But thankfully I did not experience pushing or overcrowding. We have to do better with planning AND our behavior. \n\nI went to Utopia in December 2023, sat close to the stage and pit and it was surprisingly tame. If Travis Scott takes this as a lesson, prioritizes safety, no longer encourages wild behavior and makes sure his team has contingency plans (outside of Live Nation), hopefully the energy of his fans worldwide will calm down. \n\nRIP to those that were hurt, lost their lives and are grieving that experience. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lnkyls/astroworld_and_general_festival_thoughts/"
    },
    {
        "id": "1lnjhba",
        "author": "Dorakos",
        "title": "How do I disable Mobile Games Ads?",
        "content": "Everytime I login on Netflix on my PC I get this ad about mobile games that I have absolutely zero interest in, can someone help me if there is a way to turn them off? Its really annoying. \n\nI much prefer if they would suggest shows instead of monkeys popping balloons game.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lnjhba/how_do_i_disable_mobile_games_ads/"
    },
    {
        "id": "1ln03uj",
        "author": "Upstairs_Demand_6018",
        "title": "Lack Of Content?",
        "content": "I don't mean to be negative here, but does it seem that Netflix is releasing less and less shows? Like it's been pretty dry within the last couple months. Not too many quality shows tbh but maybe it's just me.\n\nAny thoughts or insight on this?",
        "upvotes": 23,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ln03uj/lack_of_content/"
    },
    {
        "id": "1lmozcm",
        "author": "Batrah",
        "title": "Are the english people in season 3 of squid game dubbed?",
        "content": "\n\nIt's really hard to listen to the vip people speaking. It's sounds so.. forced, dubbed or whatever and bad acting\n\nThe asian woman speaking english sounds the worst. Like the way she speaks doesn't fit her\n\nAm i the only one?",
        "upvotes": 101,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1lmozcm/are_the_english_people_in_season_3_of_squid_game/"
    },
    {
        "id": "1lni56l",
        "author": "Intelligent_Duck1844",
        "title": "My plan just updated out of nowhere",
        "content": "So i bought the basic plan and was watching all fine i had about 5 to 6 profiles or so and i dont think anyone has messed with anything but suddenly i got a email that my plan has been updated to standard now i dont know if this means i have to pay 7.99 or my regualr 4.99 for basic i changed it to basic but it says the change will happen at the end of the month. This is really confusing i know i started on a basic plan yet it changed mid month how is that possible. I need help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lni56l/my_plan_just_updated_out_of_nowhere/"
    },
    {
        "id": "1lni401",
        "author": "reapercrewsamcro",
        "title": "Netflix Airplay is apparently discontinued on Samsung TV’s?",
        "content": "What sense does it make to discontinue airplay ?So I’m trying to airplay a show on Netflix to my smart tv and it keeps giving me an error, but other apps like hbo seem to have no problem, Netflix gives me an error every time. So I googled the problem and it tells me Netflix doesn’t support airplay anymore. Why is this even a thing, smart tv apps are junk and thanks to Netflix no longer updating their app on my tv it causes it to freeze and skip. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lni401/netflix_airplay_is_apparently_discontinued_on/"
    },
    {
        "id": "1lngbcq",
        "author": "rockcity1019",
        "title": "Netflix previous live playing from start mid replay (android)",
        "content": "I have been having issues for some time now watching WWE, where I end up having each show restart mid replay, it could be 30, 44, 120min in, but at some point the broadcast will start from the beginning again and it's only been happening for about a month now, even though the remaining time is showing as not being at the start of the timeline. Reinstalling the app doesn't seem to work and clearing all data doesn't do anything either.\n\nIt's stopping me from watching multiple segments, as it just replays the opening segment again. This is on android. Has anyone else encountered this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lngbcq/netflix_previous_live_playing_from_start_mid/"
    },
    {
        "id": "1lnuie5",
        "author": "Post160kKarma",
        "title": "Poop Cruise, what exactly am I watching?",
        "content": "I started watching “Trainwreck: Poop Cruise”, and I was under the impression that is was a documentary.\n\nBut then the people narrating their stories are clearly actors. Like, they are not “regular people trying to be funny because they will appear on tv”, they are actors acting and  reciting scripted jokes like The Office or something.\n\nI realized that maybe it was a mockumentary, so I googled the ship and it really happened. So is this a comedy about a real life thing? Or it’s a documentary but with actors playing the part of regular people that really were there?\n\nIt’s awful because I feel like I can’t enjoy it because it’s not clear if I should be taking it up as a real story or as fiction.",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1lnuie5/poop_cruise_what_exactly_am_i_watching/"
    },
    {
        "id": "1lne67u",
        "author": "GalaxyOpal56",
        "title": "Why does the official scene for Your Idol from Kpop Demon Hunters on Youtube sound different from the movie?",
        "content": "Title. I noticed after seeing a few clips and thought itd be better after the official ones were released, but no. The biggest parts where I see it is the background 'rely on' when Jinu is singing \"i can be the star you rely on\" being much louder on youtube, and the other saja boys sound different during the bridge with the \"living in your mind now\" part. It also feels oddly like for youtube they made the instrumental a bit more quiet. Has anyone else noticed this? If not please compare it to when you actually see the scene in the movie or to the sountrack version!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lne67u/why_does_the_official_scene_for_your_idol_from/"
    },
    {
        "id": "1lnq0ox",
        "author": "Jokerboom656",
        "title": "Demon hunter ending sucked",
        "content": "I’m sorry it felt there was like 3 deleted scenes that felt crucial. Like Rumi was saying maybe this isn’t a world worth saving, but then legit the next scene of her she’s full hero mode. And the film was making it seem like demons may be misunderstood. But the ending It made it seem like everything but jinu is just a monster. Wouldn’t the rest of the boy band members probably be in the same boat? Or am I missing something? They didn’t even explain how she’s half demon. Which now the ending makes it seem like her father was pure evil?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lnq0ox/demon_hunter_ending_sucked/"
    }
]