[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 503,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jqfst1",
        "author": "celestialhvrt",
        "title": "Netflix Actor Cem Yiğit Üzümoğlu arrested after promoting consumption boycott.",
        "content": "Cem Yiğit Üzümoğlu, has starred in Netflix shows such as \"The Protector\" and \"Rise of Empires: Ottoman\" and he was the famous actor of Mehmed The conqueror. \n\nIn Istanbul, arrest warrants were issued for 16 people who called for a consumption boycott on April 2 via social media. As part of an investigation launched by the Istanbul Chief Public Prosecutor’s Office on charges of \"hate and discrimination\" and \"inciting the public to hatred and hostility,\" 11 suspects, including actor Cem Yiğit Üzümoğlu, have been detained. The police are still searching for five other individuals. (The boycott was launched in response to the lack of impartial media coverage during the process that began with Ekrem İmamoğlu's detention and continued with his arrest, as well as the arrest of hundreds of young people.\nOn 2 April, the boycott turned into a general one-day action to demonstrate the power of the public through consumption and to send a message to the entire market. Alongside millions of citizens, numerous public figures also supported the boycott calls.)\n\nSource: HalkTv, BirGün Daily",
        "upvotes": 88,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jqfst1/netflix_actor_cem_yiğit_üzümoğlu_arrested_after/"
    },
    {
        "id": "1jqkqka",
        "author": "thefabgar",
        "title": "Netflix HDR10+ support, only for 2025 TV models, for now... Is this a joke?",
        "content": "",
        "upvotes": 30,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jqkqka/netflix_hdr10_support_only_for_2025_tv_models_for/"
    },
    {
        "id": "1jqw8jv",
        "author": "Zealousideal-Elk8908",
        "title": "Devil May Cry…",
        "content": "The new series of Devil May Cry is starting off pretty good. I had to look up the voice cast of the series and I have to say it was very strange seeing Kevin Conroy’s name. I thought maybe his son or someone else by the same name but then I progressed further into the first episode and I heard it… that heavenly Batman voice we grew up with as kids it’s unmistakably HIS voice for sure. His lines and role were done before his passing. Hearing his voice again truly brought a smile to my face",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqw8jv/devil_may_cry/"
    },
    {
        "id": "1jqdtmk",
        "author": "Legitimate_Ad3625",
        "title": "‘Adolescence’ Dethrones ‘Stranger Things 3’ and ‘Bridgerton 2’ on Netflix’s All Time Most Popular TV List With 96.7 Million Views",
        "content": "",
        "upvotes": 31,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jqdtmk/adolescence_dethrones_stranger_things_3_and/"
    },
    {
        "id": "1jqw1ps",
        "author": "SmallPresentation446",
        "title": "Is Rick and Morty off Netflix?",
        "content": "I started watching rick and Morty a few weeks ago on Netflix since it was not in there in the past. Today when I wanted to watch I saw it was not in there. Is Rick and Morty off Netflix now?\nI’m in Mexico btw so idk if it’s because of that",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqw1ps/is_rick_and_morty_off_netflix/"
    },
    {
        "id": "1jqtpok",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret EP 4-6 (SPOILERS!!!)",
        "content": "First, let me say I'm so glad that Chris is finally gone. What a piece of work he was. He thought he was god's gift to women and what was with that comment at the end about him being Prince charming?? 🤦.\n\n I didn't really care for Sam in the 1st 3 episodes but she's one of my favorites now.\n\nSydnee is playing all the men like fiddles. Those men were pathetic- all it took was a pretty girl with a nice body to show them a little attention and they turned to jelly....(Good for her though.) I wasn't sure if she and Phil had a thing or her and Chris did. \n\nOverall, I enjoyed these three episodes more than the first three. But I liked them all. I'd love to see more seasons of the show. There's still some tweaking for them to do. \n\n***Edited to add-\nThis is by far my favorite podcast I've listened to that talks about this show.  \n\nSo far there are 2 episodes, one of them talks about 1-3 and the next one talks about 4-6.\n\nhttps://open.spotify.com/episode/7eUJyjTkELE2KfbxGHbqkF?si=N_LIduBhTuaX7OB6ws5hjw\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jqtpok/million_dollar_secret_ep_46_spoilers/"
    },
    {
        "id": "1jpqjpy",
        "author": "dailystar_news",
        "title": "Bodybuilder Netflix star dies 'on treadmill at gym' day after chilling selfie",
        "content": "",
        "upvotes": 729,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1jpqjpy/bodybuilder_netflix_star_dies_on_treadmill_at_gym/"
    },
    {
        "id": "1jqqa60",
        "author": "Smaug117",
        "title": "Netflix's Devil May Cry Review: A Devilishly Good Adaptation",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqqa60/netflixs_devil_may_cry_review_a_devilishly_good/"
    },
    {
        "id": "1jqyfms",
        "author": "Longjumping_Sun_8707",
        "title": "Devil May Cry",
        "content": "Okay, Is it just me or did anyone else notice that Vice President Baines from Devil May Cry sounds like Arkham Knight Batman. Not to mention the superhero references...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqyfms/devil_may_cry/"
    },
    {
        "id": "1jqxy2h",
        "author": "dhantantan",
        "title": "Recommendations like With Love Meghan",
        "content": "..but better.\n\nI loved the show's genre! Not to dunk on Meghan. I'm sure she tried her best. But I would love to watch another one of the same genre that's more.. Earnest? With a more articulate host; good chemistry with the guests (if any); more about the fun, slice of life, &amp; things being done than self-congratulating the host, etc.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqxy2h/recommendations_like_with_love_meghan/"
    },
    {
        "id": "1jqmhoq",
        "author": "MysteriousDelay6266",
        "title": "FUBAR Season 2 Release Date (JUNE 12) On Netflix, First Look At New Cast",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqmhoq/fubar_season_2_release_date_june_12_on_netflix/"
    },
    {
        "id": "1jqllyf",
        "author": "MysteriousDelay6266",
        "title": "The Gardener | Official Trailer | Netflix | APRIL 11",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqllyf/the_gardener_official_trailer_netflix_april_11/"
    },
    {
        "id": "1jqwpov",
        "author": "Bdgamer070",
        "title": "Seasons not showing up",
        "content": "I am watching outlander on Netflix and My TV in my bedroom shows a 7th season my living room TV only shows a 6th season why is that? One TV I use a fire stick and the other one is just a Roku TV.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqwpov/seasons_not_showing_up/"
    },
    {
        "id": "1jqwko6",
        "author": "KyleGrizz",
        "title": "Finding a show Mideval setting, foreign language (Romanian or other Slavic) comedy show like The Office with interviews usually had an hour episode run time, help?",
        "content": "It was very much a comedy, I recall it followed a father who was a noble and he was dumb but thought he was smart, it was a recent show had to be shot with the past 10 years. \nIt was on Netflix USA, I think the show title was the year the show was based in.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jqwko6/finding_a_show_mideval_setting_foreign_language/"
    },
    {
        "id": "1jqig06",
        "author": "Intro-Nimbus",
        "title": "Why is netflix spoiling its own shows? Do they want us to stop watching?",
        "content": "Example: \"Drive to survive\" has spoilers for the next episode at the end of the episodes. Well, if you already spoiled it, I guess I won't watch another episode.\n\nIt's great for shutting down binge watching, but usually I just see if HBO has something that they don't intentionally spoil available.\n\nAnd when you spoil the current episode by putting in a spoiler about what will happen \\_this- episode, I won't even watch the first one.\n\nNetflix, you're not competing with TV channels anymore, when someone starts watching an episode they already intended to see it, trying to hook people oldshool TV-style just drives them away.",
        "upvotes": 5,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1jqig06/why_is_netflix_spoiling_its_own_shows_do_they/"
    },
    {
        "id": "1jqvh8z",
        "author": "Waffle_Samurai0",
        "title": "Tv show",
        "content": " I watched this Netflix tv show a while back but I can’t remember the name it was a guy who had a friend over video games and he had a problem on his face and I think the protagonist killed his neighbor and his girlfriend cat",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqvh8z/tv_show/"
    },
    {
        "id": "1jqs0y4",
        "author": "abernasty42",
        "title": "Anyone recovered their account after it was hacked/stolen?",
        "content": "I've had netflix since 2008.  A month ago my card was stolen in a data leak, no big deal. Cancel card and shred it at the bank.  Fast forward 3 weeks and all my netflix accounts are logged out. Username not found. hmm.  Just found an email in my spam folder on the same day my card was stolen that my email and password were changed.  Netflix only requires the debit card number to change an account (glad I had a good password!)  Netflix customer service says they can't verify I'm the actual account holder since I don't have the old debit card number anymore. I have years of bank transactions, dates of plan changes, IP address, etc.. Not good enough for them, it's got to be the number of the stolen debit card that I shredded at the bank (who doesn't keep records of debit card numbers once they are cancelled apparently).\n\nHas anyone every successfully recovered a stolen account or is it just SOL to my algorithm and move on?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqs0y4/anyone_recovered_their_account_after_it_was/"
    },
    {
        "id": "1jqrq49",
        "author": "avacorina",
        "title": "Netflix interviewer job",
        "content": "Hi lovely people,\n\nDoes anyone know what the appropriate job title is for those interviewers/journalists that interview actors about their upcoming movies on Netflix?\n\nAnd how would one go about getting such a job?\nI can’t find anything on their website or careers.\n\nIt seems that in every country there is someone who gets to do these and it just seems cool. I wish I knew where to look for more info on it.\n\nAny insights are welcome.\nThanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jqrq49/netflix_interviewer_job/"
    },
    {
        "id": "1jqk5b1",
        "author": "OrdinaryWheel5177",
        "title": "Secret millionaire new episodes",
        "content": "I’m still liking this show after latest episodes released. I’ll add im super happy they got rid of Chris. No one likes that dude more than Chris. I hope jaimi gets the boot too. Way too much drama for me. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jqk5b1/secret_millionaire_new_episodes/"
    },
    {
        "id": "1jqv7e9",
        "author": "IhatethatIdidthis88",
        "title": "Household question",
        "content": "So, I am thinking of getting netflix. And I plan to be seeing it via my browser on my pc. However in a few months, I will be moving out. New internet. New IP.\n\nWhat's the deal, can I watch still, from my browser? Do I need to delete my account and restart it? Can I restart account with existing email?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqv7e9/household_question/"
    },
    {
        "id": "1jq5mz1",
        "author": "Emergency-Message424",
        "title": "Secret millionaire show",
        "content": "This show is okay but man what’s the purpose of guessing the millionaire? Right or wrong there’s no consequence or reward. You’re better off just getting rid of the strongest competitors like any other show..",
        "upvotes": 18,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1jq5mz1/secret_millionaire_show/"
    },
    {
        "id": "1jqxe3p",
        "author": "Ok_Slice5487",
        "title": "What Netflix plan should I get?",
        "content": "I have been off of Netflix for few years when they started password sharing crackdown. I am looking to get my own account and share it with my parents. I live in the US and my parents live in India.\n\nI need an account that would work for the both of us though my parents don't watch Netflix a lot. Can I get the standard plan and my parents can occasionally use that account in India? Also I travel to India frequently and would like use my account there, would it be allowed without issues?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jqxe3p/what_netflix_plan_should_i_get/"
    },
    {
        "id": "1jqsp41",
        "author": "AIONisMINE",
        "title": "Cancelling netflix while having a netflix credit balance.",
        "content": "i have a significant netflix credit balance due to giftcards.\n\ni dont have any other payment method attached to my netflix account.\n\nwill there be any issues if i were to cancel my netflix subscription?\n\nmy netflix credit will still be there untouched until i decided to subscribe again, correct?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jqsp41/cancelling_netflix_while_having_a_netflix_credit/"
    },
    {
        "id": "1jqy2ss",
        "author": "386U0Kh24i1cx89qpFB1",
        "title": "Want to cancel Netflix but they never kicked my family off",
        "content": "I can't believe Netflix costs $18 a month now. I hardly use it but my family in two other houses does.  I feel like Netflix knows what's going on and won't kick them off because they know I'm paying.  \n\nI refuse to  support or subject my family to the ad tier.  Do I have to be the bad guy or is there a way to trigger the boot?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jqy2ss/want_to_cancel_netflix_but_they_never_kicked_my/"
    },
    {
        "id": "1jqix3o",
        "author": "sp00kynico",
        "title": "sonic profile picture not showing up on my account",
        "content": "Hi, I know there was a 5 year old thread already about pictures varying from profile to profile, but I've tried everything they suggested and still no luck. My brothers and my parents all managed to change their icons to Sonic ones, but the option doesn't show up SPECIFICALLY on my profile. Is there a solution to this? Maybe it's age restricted, even though I highly doubt that's the case? I've even tried watching a full episode of it, but they're still not available to me. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqix3o/sonic_profile_picture_not_showing_up_on_my_account/"
    },
    {
        "id": "1jqna7y",
        "author": "Spirited_Pick_104",
        "title": "Heyy my friend is trying to watch demon slayer season 4 but she can",
        "content": "My friend has a account and Is a huge fan of demon slayer but the newest season isn't appearing for her. We are in Poland but still it says season 4 came out at the end of 2024 everywhere we look. Can someone help?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqna7y/heyy_my_friend_is_trying_to_watch_demon_slayer/"
    },
    {
        "id": "1jqgigg",
        "author": "aku_lofAnjinK",
        "title": "How do I change subtitle settings?",
        "content": "I'm currently watching breaking bad S1. But I notice that the subtitles are kinda delayed in every second half of the series. \n\nAlso I don't like how the subtitles are sometimes placed up, bottom left, bottom right, and so on. In the settings I can only change the subtitle text and language.\n\nIs there a fix for this? So much for accessibility...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqgigg/how_do_i_change_subtitle_settings/"
    },
    {
        "id": "1jqg8tr",
        "author": "Levix00",
        "title": "Why don't I have english subtitles?",
        "content": "I am using Netflix in Austria and many shows, mainly animated ones literally only have german subtitles, not even english. When I used to be in Hungary it worked perfectly and every show had like 5 diferrent subtitle languages. Is there a fix for this or is this really just the way it is supposed to be?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jqg8tr/why_dont_i_have_english_subtitles/"
    },
    {
        "id": "1jpki86",
        "author": "Aman_S7",
        "title": "Con Mum",
        "content": "I know this is the millionth post on con mum but I just saw it last night and WTF? I do NOT feel bad for Graham, after a point I couldn’t. He left heather and his NEW BORN alone and says it was for the betterment of their family, I think it may have been at first but after that he lost the plot on why he was actually in Switzerland with Dionne. Iirc it’s not been revealed right how Dionne was able to make all the hotel staff, concierge and lawyers work with her? I felt so so infuriated for heather, that poor woman. ",
        "upvotes": 90,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jpki86/con_mum/"
    },
    {
        "id": "1jqlj43",
        "author": "Puzzled-Tap8042",
        "title": "Meryl Streep In Talks To Play Aslan In Greta Gerwig &amp; Netflix’s Narnia Movie",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jqlj43/meryl_streep_in_talks_to_play_aslan_in_greta/"
    }
]