[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 131,
        "comments": 424,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mvg1hu",
        "author": "SplitNational2929",
        "title": "Netflix’s KPop Demon Hunters Movie Theater Screenings Are Already Almost Sold Out",
        "content": "",
        "upvotes": 352,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg1hu/netflixs_kpop_demon_hunters_movie_theater/"
    },
    {
        "id": "1mvuj2m",
        "author": "iLikeDinosaursRoar",
        "title": "Dept. Q Renewed for a Second season",
        "content": "We did it guys!\n\nDept Q gets a second season. Let's just hope it's as good as the first season and we get more after this. \n\nhttps://www.bbc.com/news/articles/ckgj8xn9zx0o.amp\n",
        "upvotes": 25,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvuj2m/dept_q_renewed_for_a_second_season/"
    },
    {
        "id": "1mv1iic",
        "author": "Otherwise-Jump-4571",
        "title": "Had this gem of an interaction with a Netflix rep. I called for support and he ended up cancelling my account.",
        "content": "Some of the messages were cut out for privacy. If parts of the conversation doesn't make sense to you, it's not because of the cut out messages.\n\n\n\nHe did a really poor job explaining that whole new member thing (still don't understand it). He promised to resolve the issue but cancelled my account instead.\n\n  \nI asked for a transcript of the chat, and he said it will pop up if I closed the chat. Good thing I took screenshots. ",
        "upvotes": 1072,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1mv1iic/had_this_gem_of_an_interaction_with_a_netflix_rep/"
    },
    {
        "id": "1mvyuz4",
        "author": "hfourm",
        "title": "New Netflix UI on Apple TV - Terrible",
        "content": "I have never been so insulted by an update in my life.\n\nThe arrogance of the product management and design teams to roll this out, is mind numbing.\n\nI literally can only see 3 and a half titles MAX at a time. I get motion sick trying to navigate through titles to find something interesting to watch.\n\nAm I going crazy?\n\nWhatever metrics they chose to A/B test this rollout goes to show you how even the smartest tech talent can succumb to feeling like they are innovating and reverse engineering the metrics to prove it.\n\nI cancelled my subscription. \n\nNetflix literally invented the user experience and mental model most of us expect for streaming apps. To take it in the direction they have is pure hubris.",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mvyuz4/new_netflix_ui_on_apple_tv_terrible/"
    },
    {
        "id": "1mw1csa",
        "author": "OrangeBarcode",
        "title": "Netflix Subtitles on but setting off",
        "content": "If a movie comes with subtitles already on the screen for someone speaking a foreign language, I get a second set of netflix subtitles saying the same thing so I get double subtitles with no way to turn it off.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mw1csa/netflix_subtitles_on_but_setting_off/"
    },
    {
        "id": "1mvg8wo",
        "author": "MysteriousDelay6266",
        "title": "BLACK RABBIT | Official Trailer | Netflix | September 18",
        "content": "# BLACK RABBIT\n\nWhen the owner of NYC’s biggest hotspot (Jude Law) allows his troubled brother (Jason Bateman) to return to the family business, trouble multiplies.\n\n**Only on Netflix SEPTEMBER 18.**",
        "upvotes": 28,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg8wo/black_rabbit_official_trailer_netflix_september_18/"
    },
    {
        "id": "1mw3v07",
        "author": "Marzikoo",
        "title": "Lf someone to share netflix with",
        "content": "Hopefully we can share a year plan thats what im looking for. Types of show ill watch: clasic like dexter etc. will watch malay and english shows :)) if youre inteested, drop me a dm!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mw3v07/lf_someone_to_share_netflix_with/"
    },
    {
        "id": "1muzrde",
        "author": "Conscious-Quarter423",
        "title": "‘Wednesday’ Season 2 Gains 29.1 Million Views in Second Week on Netflix. That’s a 42% decrease from the week before.",
        "content": "",
        "upvotes": 265,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1muzrde/wednesday_season_2_gains_291_million_views_in/"
    },
    {
        "id": "1muo4m8",
        "author": "Sweaty-Toe-6211",
        "title": "‘Dept. Q’ Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 697,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1muo4m8/dept_q_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1mvz9uz",
        "author": "tavernstories",
        "title": "Is there anyway to remove Netflix films off the menu",
        "content": "Respectfully, I just like all the movies that are Netflix films. I really only specifically like movies that aren’t made by Netflix or anyone affiliated with the production of Netflix ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mvz9uz/is_there_anyway_to_remove_netflix_films_off_the/"
    },
    {
        "id": "1mvystz",
        "author": "JeffTheBrainBreaker",
        "title": "Netflix only gives me 540p on PC despite premium plan and HEVC hardware",
        "content": "🟥 Why is Netflix locking me to 540p on PC despite premium plan?\n\nI’m on Netflix’s Premium Ultra HD plan, using a PC with:\n\n• Intel i5-8600 + GTX 1080 Ti\n• 2K monitor (2560x1440)\n• HEVC codec installed\n• Edge browser + Netflix Windows App\n• Stable 100+ Mbps connection\n\n\nDespite meeting all technical requirements, Netflix limits my stream to 960x540 resolution—even for titles like Oppenheimer. No clear error, no explanation. Just low bitrate.\n\n---\n\n🔍 What’s going on?\n\n• Netflix doesn’t support 1440p as a stream tier.\n• DRM checks are overly strict and opaque.\n• DisplayPort connections may be misclassified.\n• Even Edge + Netflix App can fail to trigger HD.\n\n\nMeanwhile, the same hardware on a smart TV or Apple TV gets full 4K. So this isn’t a hardware issue, it’s platform discrimination.\n\n---\n\n⚠️ What I’m asking for:\n\n• Transparency on stream resolution logic\n• Fair treatment for PC users with capable hardware\n• Support for 1440p or better fallback when 4K isn’t available\n\n\nAnyone else stuck at 540p despite having a solid setup? Let’s push Netflix to fix this.\n\n#Netflix540p #PCstreaming #PremiumNotPremium #DRMmadness",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvystz/netflix_only_gives_me_540p_on_pc_despite_premium/"
    },
    {
        "id": "1mvwz7y",
        "author": "issues_com",
        "title": "Weird email and card",
        "content": "I recently couldn't log into netflix on my laptop. I checked my phone and the email wasnt my email. It had my first name, but the rest was random letter. Well later in the day my tv said I needed to update my payment method. I went in to update it and it was a card number and name I have NEVER had or heard of before. I called netflix and they changed my email for me and I changed my card information. They told me \"maybe its an issue when you have the same emails linked to many thing\" like but the card?!?! Thats not mine?!?! Im so confused. I feel like i got help, but no answers? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvwz7y/weird_email_and_card/"
    },
    {
        "id": "1mvz1xs",
        "author": "Which-Holiday9957",
        "title": "Any Given Sunday using AI crowds for random scenes?",
        "content": "I could be wrong but I noticed definitely in episode 6. There are two scenes where the crowd looks fake or people in the background aren’t moving. \n\nIf that’s true it seems weird. It wasn’t for anything special. They didn’t need to do it. Are they just trying to sprinkle it in until we can’t tell the difference?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvz1xs/any_given_sunday_using_ai_crowds_for_random_scenes/"
    },
    {
        "id": "1mvsjgz",
        "author": "YoonSnake",
        "title": "Netflix keeps showing me shows when I search for movies",
        "content": "We love Korean movies and never had problems watching them until recently. We used to be able to search \"Korean movies\" and the whole Netflix catalog of Korean movies would come out. Nowadays, when we search for the same thing, it's mostly K-dramas with very few Korean movies coming up on the search. What's going on? Is there any way to fix this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvsjgz/netflix_keeps_showing_me_shows_when_i_search_for/"
    },
    {
        "id": "1mupni5",
        "author": "veditafri",
        "title": "What's the Netflix show suprised you after starting it just for background noise?",
        "content": "What Netflix show suprised you the most? You started it with  low expectations, just to have something on - but  ended up binge-watching the whole thing instead?",
        "upvotes": 151,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/1mupni5/whats_the_netflix_show_suprised_you_after/"
    },
    {
        "id": "1mvalpf",
        "author": "Vivid-Relationship96",
        "title": "“MOST LIKED” shows",
        "content": "Since Netflix doesn’t provide a full list of shows with the “Most Liked” badge, why don’t we make a thread? \n\nDrop the series you’ve watched that had the “Most Liked” thumbs up!\n\n👇",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mvalpf/most_liked_shows/"
    },
    {
        "id": "1mvnyom",
        "author": "Kiskikena",
        "title": "Chat is unavailable",
        "content": "So, I have a Netflix account that I have been using for several years. \n\n  \nSuddenly, after putting balance for at least 6 months through gift cards, my membership was ended without giving me any explanation.\n\n  \nWhen I try to use the chat to contact an agent it always says \"Chat is unavailable\". \n\n  \nI have created a new account and loaded it with a small balance to test it out and when I try to open a chat with an agent, suddenly it works fine. \n\n  \nWhat is happening and how can I recover my account with my balance??",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvnyom/chat_is_unavailable/"
    },
    {
        "id": "1mv0yds",
        "author": "bobbaganush",
        "title": "Two-and-a-half years between first and second season…",
        "content": "I just looked to see when 3 Body Problem’s new season would be out. The first was dropped March of ‘24. Looks like the second will be sometime between October and December of ‘26. This seems to be a trend with a lot of their series nowadays. It’s ridiculous. Does anyone here have an idea as to why they do this?",
        "upvotes": 20,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0yds/twoandahalf_years_between_first_and_second_season/"
    },
    {
        "id": "1mvkvdx",
        "author": "SkelMaxim",
        "title": "Extant S1, Ep3 missing scene",
        "content": "Hello, so I was watching Extant Season 1,  Episode 3, when I noticed a 13 second time skip I cannot override. It appears as if Netflix cut a scene out, but from the context before and after, I don't understand why.\nIt was from 41:10 minutes remaining to 40:57 during a scene about losing a child.\nIt jumps from mentioning infertility to \"so that's how she lost the baby?\"\n\nCould someone please explain what happened in that scene and possibly if y'all know why it was cut?\n\nEDIT: Nevermind. I reloaded the show and it somehow reappeared... not sure how.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkvdx/extant_s1_ep3_missing_scene/"
    },
    {
        "id": "1mvkt36",
        "author": "Personal-Comfort-507",
        "title": "Have job postings for Fort Monmouth come out yet?",
        "content": "I live near Fort Monmouth, NJ, and recently graduated from a reputed BFA program for acting and film. I was wondering if anyone knows where to find job recruiting posts from Netflix where they post, apart from LinkedIn or something.\n\nThanks so much!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkt36/have_job_postings_for_fort_monmouth_come_out_yet/"
    },
    {
        "id": "1mupavk",
        "author": "ex1stence",
        "title": "“Fit For TV” was a complete waste of time",
        "content": "How tf do \"documentaries\" like this even get made? Literally everything they mentioned in all three episodes was a complete nothingburger, and it was honestly sad to see how deep the producers were trying to dig to find anything even remotely interesting to put in the doc.\n\nDanny gaining the weight back after the show? Wow yeah, turns out people who have a bad relationship with food before the show didn't magically rewire their entire brains after leaving TBL. Not sure how that's NBC's fault or even a controversial thing, but man did they soak up about 20 minutes just repeating the same thing over and over again.\n\nBob said a mean thing to Joelle one time (which did inevitably get her to finish the 30-second treadmill run)? DUN DUN DUNNNN. Dramatic music and another 15 minutes over the fact that yes, every trainer yells at you when you try to give up during a workout because that's literally the job you are paying them to do.\n\nJillian gave....you guys it's so bad, it's terrible, I'm trembling and shaking even as I type this....CAFFEINE to contestants??? Holy shit ya'll, NBC is basically the devil incarnate let's spend another 20 minutes talking about it.\n\nThe whole thing was mining for any controversy it could possibly find and there just wasn't a damn thing to say. I'm a millennial and as someone who struggled with my weight at the time the show first aired, it was actually really inspiring to see how much diet and exercise was paying off for people who were way bigger than I was. While I may not be able to draw a direct line between TBL and my eventual love of exercise, I know that watching these people get on the treadmill and work their asses off (literally) gave me a model that I continue to follow to this day when it comes to my diet and how I take care of my body.\n\nThis wasn't a documentary about scandal or NBC doing anything wrong, it was just a drag on the most inconsequential events that when you pull back and look at what they actually said, sure as shit wasn't worth 120 minutes of my time.",
        "upvotes": 72,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1mupavk/fit_for_tv_was_a_complete_waste_of_time/"
    },
    {
        "id": "1mvkc41",
        "author": "fish5056",
        "title": "ONLY arabic subtitles available on apothecary diaries?",
        "content": "i set my subtitle language to english and english UK (and I checked it multiple times) but sometimes when i want to watch something and I look at the subtitles, the only option is a random language that I didn't even select (and don't speak myself).\n\nfor example, I want to watch apothecary diaries but the ONLY available subtitle language for me is arabic.\n\nI tried to log in from the web, log in with wifi or mobile data, log in from the app on my phone, app on my ipad etc. and nothing changes. I tried to sign out and login again and nothing changes. please help me.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvkc41/only_arabic_subtitles_available_on_apothecary/"
    },
    {
        "id": "1mvjcit",
        "author": "OriginalChri",
        "title": "‘Stranger Things’ Creators Matt and Ross Duffer Sign Paramount Deal",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mvjcit/stranger_things_creators_matt_and_ross_duffer/"
    },
    {
        "id": "1mvcml2",
        "author": "UntypicalOps88",
        "title": "Netflix says my Nvidia Shield is “not optimized (-14)” even though it’s Widevine L1 certified",
        "content": "Hey folks,  \nI just hit the weirdest problem and wanted to see if anyone else is in the same boat.\n\n* Device: **Nvidia Shield TV Pro (2019)**\n* Netflix App: [**com.netflix.ninja**](http://com.netflix.ninja)**, v11.0.12 build 19894**\n* DRM: **Widevine L1 confirmed**\n* Shield firmware: **latest (2025 build)**\n* Play Store: **device certified**\n\nDespite all that, Netflix throws me a **“This device is not optimized for Netflix (-14)”** error and only plays pixelated SD. YouTube, Prime Video, Disney+ all run in 4K HDR with no problem.\n\nI called Netflix support and they confirmed it’s a **certification issue on their end** — not a geo restriction, not my internet, not DRM. But instead of fixing it, they literally asked me to **mail them(not even email)** for escalation. Seriously? This is one of the most popular Android TV devices, and Netflix just drops certification like this?\n\nSo:\n\n* Why is the Shield (2019) suddenly *not certified* anymore?\n* Why is Netflix pushing the burden to the customer to “write a letter” when it’s clearly a backend whitelist/ESN problem?\n* Anyone else running into the same error?\n\nThis feels like something that should be viral. Customers with perfectly capable, certified devices are being told their hardware is “not optimized” because Netflix won’t update their certification database.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvcml2/netflix_says_my_nvidia_shield_is_not_optimized_14/"
    },
    {
        "id": "1mvh48d",
        "author": "kayakvibes",
        "title": "Netflix quality....help!!",
        "content": "Nothing I do resolves the VHS quality I have with Netflix.  I have gigabit internet.  I switched to Wifi 7 inside.  I have a mesh network and placed pucks in close locations.  I'm using Apple TV 4K as the source.  Lost as to where to go.  It's so bad I can hardly make out faces. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvh48d/netflix_qualityhelp/"
    },
    {
        "id": "1mv0zqe",
        "author": "LeeleeLola",
        "title": "Animal Kingdom",
        "content": "Just discovered this show about 3 weeks ago and I've been binge-watching it nonstop!! I'm now at the end of S5. Such a great show! Every character is so well-acted. I ended up really hating Smurf and wasn't sad at all at her exit!I also thought the Nicky character was completely unnecessary, but I guess they needed her to get to the father's storyline. I just love Pope. He was so cringey in the beginning and now I just want to give him a big hug. Shawn Hatosy is an incredible actor! Thoughts? Like the show?Who is your favorite character?",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zqe/animal_kingdom/"
    },
    {
        "id": "1mvnc0v",
        "author": "kfcstew",
        "title": "Is anyone else having this problem?",
        "content": "Netflix has decided to block me from account that i share with my parent because we arent in the same household \nI obvsly moved out but still pay for it but it pops up with this and im not sure what to do \nMy parent is not a tech person so its hard to explain 😭\n\nIs there a setting to add another household or something\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mvnc0v/is_anyone_else_having_this_problem/"
    },
    {
        "id": "1mvdp8h",
        "author": "Even_Battle3402",
        "title": "How was Niro affected using Proteus in Zero Day?",
        "content": "In Zero Day Robert De Niro was suspected to be affected with Proteus, a neurological weapon. This explains his state of mind. But how was this weapon delivered to him? Did they explain how did the hacker implant this neurological weapon in Niros mind? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mvdp8h/how_was_niro_affected_using_proteus_in_zero_day/"
    },
    {
        "id": "1mv0zjn",
        "author": "QualityOdd6492",
        "title": "The Diplomat",
        "content": "I finished the whole 2 seasons....now what? Is there anything that is nearly as good?  I don't do horror, or gore, please. And I can't stand futuristic or animation. But The Diplomat really held my attention, and it has surprises! Help me please find a series I can look forward to turning on for 1, 2, or 3 episodes at a time.",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mv0zjn/the_diplomat/"
    },
    {
        "id": "1mvdc4a",
        "author": "whateven12346",
        "title": "My netflix Breaking Bad’s subtitles are a couple of seconds slow. How do i fix it?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6cd26cgr36kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mvdc4a/my_netflix_breaking_bads_subtitles_are_a_couple/"
    }
]