[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1iod1kt",
        "author": "No_Astronomer4604",
        "title": "Ma che problemi avete alla guida?",
        "content": "Stamattina ero seduto in macchina perché arrivato un po’ prima e stavo aspettando. Un tizio ha iniziato a suonare il clacson, tirato giù il finestrino e gridato ‘MA VAFFANCULO!!!’\n\nL’altro giorno mi si è spenta la macchina al semaforo e per fortuna avevo le porte chiuse, perché quello dietro è sceso e ha cercato di aprire per fare non so che.. si è limitato a tirare un pugno sulla porta.\n\nHo vissuto e guidato in molte altre città e la gente con i neuroni così fumati non l’ho mai incontrata!!",
        "upvotes": 60,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1iod1kt/ma_che_problemi_avete_alla_guida/"
    },
    {
        "id": "1iofgov",
        "author": "carodiario24",
        "title": "Gente con la quale allenarsi",
        "content": "Ciao!\nF31\nC'è qualcuno che potrebbe essere interessato a fare sport all aperto dopo il lavoro?\nCaratteristiche ideali:\n- alla mano, semplice \n- approccio mentale sano ed equilibrato \n- passione per il fitness\n\nSe ti interessa, scrivi! ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1iofgov/gente_con_la_quale_allenarsi/"
    },
    {
        "id": "1iogjlk",
        "author": "ivlia-x",
        "title": "Smarrita tessera GTT",
        "content": "Non credo che qualcuno me la restituisca ma ci provo lo stesso 🙃 \n \nOggi mattina (tra le 7:30 e le 8:00) ho perso la mia tessera GTT. Sono scesa dal tram 10 alla fermata Questura a poi sono andata a piedi fino a Palazzo Nuovo. Ho appena rifatto tutto il percorso nella speranza di trovarla ma apparentemente qualcuno l’aveva già presa\n\nSe qualcuno l’abbia trovata, fatemi sapere per favore. Non so dove cercare, se esiste qualche gruppo su Facebook o qualcosa del genere eh sono triste e disperata\n\nIl primo nome sulla tessera è Julia ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iogjlk/smarrita_tessera_gtt/"
    },
    {
        "id": "1iokdld",
        "author": "Any_Salary8922",
        "title": "Spazi di lavoro remoto in centro",
        "content": "Sono in full smart e a volte mi annoio a stare tutto il giorno a casa.\nPotete consigliarmi qualche bar/coworking/libreria in centro/quadrilatero dove lavorare?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1iokdld/spazi_di_lavoro_remoto_in_centro/"
    },
    {
        "id": "1iok08d",
        "author": "electrolitebuzz",
        "title": "opzioni skipass a Monginevro",
        "content": "Ciao, non riesco a mettermi in contatto con gli impianti di Monginevro. Volevo sapere se oltre allo skipass normale giornaliero che costa sui 55€ ci sono altre opzioni acquistabili in cassa che non si vedono online. Andrò con un amico che è molto principiante e di solito altri impianti offrono biglietti a ore oppure a risalita proprio per chi sta imparando o vuole provare. Ma online non trovo nessun'altra opzione. Grazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iok08d/opzioni_skipass_a_monginevro/"
    },
    {
        "id": "1ioig6n",
        "author": "Fidel_Castrato_",
        "title": "Negozi di bandiere",
        "content": "Ciao a tutti.\nÈ già da un po' di tempo che sarei interessato ad acquistare delle bandiere (possibilmente storiche) per poter arredare la mia camera.\nQualcuno mi saprebbe per caso consigliare un'attività a Torino in cui poterle comprare?\nGrazie in anticipo.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ioig6n/negozi_di_bandiere/"
    },
    {
        "id": "1iohdur",
        "author": "Scared-Anybody-273",
        "title": "Local Taste Of Torino",
        "content": "Hello Italian friends. My first ever visit in Torino will be tomorrow for the weekend. I have been lucky to get tickets  for Juve-Inter and to make this weekend top notch i simply need to add some amazing dishes and drinks during the stay.\n\nI really like local flavours. I always go for the small authentic places whether in Denmark, Morocco or Asia - anywhere. So i listed some thing down already. Is it a go or no go? Anything better? \n\nI appreciate your time and effort! And look forward to discover this magnificent city\n\nLa Taverna Del Bergé - piole\nDa Cianci Piola Caffè - piole\nAntica Bruschetteria Pautasso - Local dishes\nSarchiapone pizzeria Torino - Napolitan Pizza\n\n\nAlso please feel free to mention places even if only for a specific dish. That is what i look for in the essence. Master of their craft\n\nWish you an awesome day!\n\nCiaoo\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iohdur/local_taste_of_torino/"
    },
    {
        "id": "1io05nv",
        "author": "ihaveonebraincell",
        "title": "Bar tranquilli con una buona selezione di tè?",
        "content": "Sono abbastanza nuova a Torino e sto disperatamente cercando un posto tranquillo (senza musica possibilmente) dove posso bere del tè buono e magari leggere un libro.\n\nTutti i posti in cui sono andata fino ad ora o avevano la musica invadente oppure tanta gente che faceva casino.. Quindi vorrei trovare un posto in cui la \"norma\" è la tranquillità e la pace dei sensi hahaha\n\nGrazie a chiunque mi possa aiutare ❤️",
        "upvotes": 15,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1io05nv/bar_tranquilli_con_una_buona_selezione_di_tè/"
    },
    {
        "id": "1iog62n",
        "author": "CorvoPazzo02",
        "title": "Festa",
        "content": "Salve a tutti per caso sapete bei locali da affittare per feste ?(es. Compleanni, lauree ecc)   ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iog62n/festa/"
    },
    {
        "id": "1inyr63",
        "author": "NamelessNiner",
        "title": "Gruppo Telegram per receptionist d'hotel di San Salvario",
        "content": "Ciao a tutti! Lavoro in un hotel di San Salvario e da un po' ho pensato che sarebbe utile ed interessante creare un gruppo telegram dei receptionist dei diversi hotel del quartiere, per scambiarsi informazioni e avvertimenti su avvenimenti vari e tipi loschi. &gt;!Sì, è anche per gossip o per far sapere se l'uomo birillo è in giro. !&lt;\n\nSe volete essere aggiunti, chiaramente in forma totalmente anonima, mandatemi nei messaggi una foto con un biglietto con il vostro nome utente scritto a mano insieme a parti del desk, chiavi, biglietti da visita o comunque qualcosa che dimostri che siete receptionist.\n\n**Non vi chiederò in quale hotel specifico lavorate, non mi riguarda.**",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1inyr63/gruppo_telegram_per_receptionist_dhotel_di_san/"
    },
    {
        "id": "1io108c",
        "author": "FerroFede",
        "title": "Info su Mostra di Giger",
        "content": "Buonasera a tutti, avrei bisogno di un’informazione: sapete per caso quant’è la durata della visita alla mostra di “Beyond Alien H.R. Giger”??\n\nGrazie mille in anticipo ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1io108c/info_su_mostra_di_giger/"
    },
    {
        "id": "1inri3z",
        "author": "angel_flower_0",
        "title": "Gruppo gamer Piemonte",
        "content": "Siete italiani e vivete nello sperduto Piemonte, nel frattempo cercate di accendere un computer o una console con bastoni e pietre e per poter comunicare con altre entità usate i piccioni viaggiatori. Non vi siete stancati di sperare che il piccione non muoia durante il tragitto? Si? BENE!\n\nQuesto è il gruppo perfetto per voi!\n\nIn questo gruppo potrete conoscere direttamente le persone della vostra stessa regione e magari chi lo sa uno di loro sarà il vostro prossimo migliore amico!\n\nChe aspettate? Entrate a divertirvi con noi!\n\nhttps://t.me/Piemontegamersita\n\n(NB: il gruppo è dedicato anche per chi ama gli anime, i cosplay e le convention/cosplay)",
        "upvotes": 4,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gUUYIXrc1G2yzach-DixuOyz50gY5dNq8YTs6TGSL4U.jpg?auto=webp&amp;s=b33d2ae0efab1bb91675740238270b50981cbe03"
        },
        "permalink": "/r/torino/comments/1inri3z/gruppo_gamer_piemonte/"
    },
    {
        "id": "1inub4h",
        "author": "iammigu",
        "title": "sport buddies?",
        "content": "Ciao, senza dover andar per forza nei locali a bere, come conoscete gente nuova magari facendo sport tipo running, funzionale o simili?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1inub4h/sport_buddies/"
    },
    {
        "id": "1in8h3o",
        "author": "initial_chris",
        "title": "Dashcam per il pedone",
        "content": "Sono sempre più convinto che a Torino bisognerebbe girare con una dashcam attaccata al collo. Ogni giorno ne vedo di tutti i tipi che BadDriversOfItaly spostati.\n\nStasera non ho mai rischiato così tanto di finire sotto a una macchina. Impegno l'attraversamento mentre in lontananza si avvicina una Mercedes. Quando sono a metà, mi accorgo che la macchina continua ad accelerare e per fortuna ho avuto la lucidità di correre via.\nIl tizio che guidava mi ha visto quando praticamente era a 15 metri da me, ha provato a inchiodare superando di gran lunga le strisce per poi ripartire a razzo, come se gli avessi fatto un torto.\n\nMi viene in mente anche un altro episodio dove un furgone pretende di passare con il rosso e mi suona a me perché stavo attraversando sulle strisce con il semaforo verde.",
        "upvotes": 45,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1in8h3o/dashcam_per_il_pedone/"
    },
    {
        "id": "1imz23j",
        "author": "CryingAlwaysCrying",
        "title": "UCI Cinemas: sempre cosi?",
        "content": "Ciao a tutti,\n\nqualcuno sa se UCI Cinemas a Torino offre sempre una qualità così scarsa? Sono andato a vedere *The Brutalist* e l’intero film era completamente fuori fuoco, come se il proiettore fosse mal tarato o difettoso.   \n  \nÈ stata un’esperienza davvero deludente e mi sono sentito completamente mancato di rispetto.   \n  \nAnche a voi è capitato qualcosa del genere? ",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1imz23j/uci_cinemas_sempre_cosi/"
    },
    {
        "id": "1in57qo",
        "author": "tonybob94",
        "title": "Corsi di primo soccorso gratuiti",
        "content": "Ciao a tutti!\n\nSapete se per caso ci sono delle occasioni in cui vengono organizzati corsi di primo soccorso gratuiti in città?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1in57qo/corsi_di_primo_soccorso_gratuiti/"
    },
    {
        "id": "1in4lxt",
        "author": "TheTrampIt",
        "title": "Bloccato nel passaggio a livello",
        "content": "https://www.torinoggi.it/2025/02/11/leggi-notizia/argomenti/nichelino-1/articolo/auto-resta-bloccata-tra-le-sbarre-del-passaggio-a-livello-e-brutto-incidente-in-via-scarrone-traffi.html\n\nLa mia domanda è: ma quant’è la multa?",
        "upvotes": 2,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1TaA9FYoj1OpEygfdOyTFmUpME7UdPfrqbKvLWVxHks.jpg?auto=webp&amp;s=b163a44bbab22b06d1d720832a29f501eede3bec"
        },
        "permalink": "/r/torino/comments/1in4lxt/bloccato_nel_passaggio_a_livello/"
    },
    {
        "id": "1in459y",
        "author": "AdThese6575",
        "title": "Partitelle a Torino",
        "content": "Ciao a tutti, \n\nSono un ragazzo di 28 anni, mi rivolgo a voi poiché in cerca di un gruppetto di persone a cui aggregarmi per giocare regolarmente (1/2 volte a settimana) a calcio a 5/7/8 . Non sono un fenomeno, ho giocato in passato ma come un po’ tutti vorrei cercare di non crepare d’infarto a 40 anni a causa del lavoro da scrivania 😂\nSe vi fa piacere concedermi un po’ di spazio nel vostro gruppetto ve ne sarei molto grato!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1in459y/partitelle_a_torino/"
    },
    {
        "id": "1imab6p",
        "author": "Wonderful_East_5741",
        "title": "unpopular opinion, la gtt fa schifo perchè ci sono TROPPE macchine",
        "content": "okay non è solamente quello il problema ma sicuramente la grande maggioranza d'esso è rappresentata dalla moltitudine di macchine presenti nelle strade torinesi. \n\nbasti pensare ad i tram che non riescon a passare per macchine posteggiate sui binari oppure bus che rimangono bloccati nel traffico. \n\ntorino deve iniziare, a mio avviso, a prendere decisioni forti per quanto riguarda le macchine. è una città super vivibile a piedi.",
        "upvotes": 99,
        "comments": 75,
        "media": null,
        "permalink": "/r/torino/comments/1imab6p/unpopular_opinion_la_gtt_fa_schifo_perchè_ci_sono/"
    },
    {
        "id": "1in3fnt",
        "author": "Babele_20",
        "title": "Posti queer a Torino",
        "content": "Ciao a tutti, io sto cercando degli ambienti queer in cui conoscere personcine carine. Non ho trovato né gruppi universitari né associazioni, qualcuno sa se ce ne sono e magari anche dove c’è un bell’ambiente?",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1in3fnt/posti_queer_a_torino/"
    },
    {
        "id": "1in24j4",
        "author": "wherearemyburritos",
        "title": "biglietto per andare a Nichelino?",
        "content": "Ciao,\nQuale biglietto per l'autobus bisogna prendere per andare da Torino a Nichelino?\nGrazie mille ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1in24j4/biglietto_per_andare_a_nichelino/"
    },
    {
        "id": "1imv8d8",
        "author": "EdgarTheComputer",
        "title": "Videomaker e appassionati cinema e color grading su TO?",
        "content": "Ciao a tutti, sono un colorist e appassionato di videomaking (non il mio primo lavoro) e sto cercando altri appassionati in città con cui condividere tips and tricks e magari anche vedersi di persona e creare un piccolo gruppo/network",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1imv8d8/videomaker_e_appassionati_cinema_e_color_grading/"
    },
    {
        "id": "1in12lb",
        "author": "DragonflyPositive637",
        "title": "Prohouse torino",
        "content": "Sto cercando un appartamento a Torino da affittare e ho visto un appartamento tramite l'agenzia Prohouse, qualcuno la conosce?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1in12lb/prohouse_torino/"
    },
    {
        "id": "1imry05",
        "author": "pensareadaltro",
        "title": "Sessioni di sketching",
        "content": "Mi piacerebbe organizzare delle sessioni di disegno in piccoli gruppi (magari appena il tempo permette di star fuori con più facilità), come ho visto fanno spesso a Milano o Bologna. C’è già qualcosa di questo tipo a Torino che voi sappiate? Forse non c’è abbastanza domanda? ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1imry05/sessioni_di_sketching/"
    },
    {
        "id": "1ima6h4",
        "author": "Legitimate-Boss4807",
        "title": "Paradosso torinese: ci sono molti ansiosi da fare amicizia, ma allo stesso tempo nessuno riesce a trovare persone ansiose da fare conoscenza",
        "content": "",
        "upvotes": 59,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vvg6reaf9cie1.jpeg?auto=webp&amp;s=ea4bc65d786bc474702a1fed069687bc82c9a302"
        },
        "permalink": "/r/torino/comments/1ima6h4/paradosso_torinese_ci_sono_molti_ansiosi_da_fare/"
    },
    {
        "id": "1imwnea",
        "author": "Icy_Opposite7696",
        "title": "Tattoo Prices",
        "content": "I just moved to Turin. I wanna get my first tattoo and I’m unsure about the price. I wanna get a little date (26.08.22) on my shoulder. \nHow much do you guys think this would cost?\nI have no idea because it is my first tattoo ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1imwnea/tattoo_prices/"
    },
    {
        "id": "1imvw8m",
        "author": "Careless_Way_3818",
        "title": "Mezzi pubblici a Torino di notte",
        "content": "Salve ragazzi mi sono trasferito da poco a Mirafiori per lavoro, non sono mai stato in una città grande come Torino. Ho visto che per fare diverse cose come cinema/ andare in centro devo prendere dei tram principalmente 10/4 secondo voi viaggiare di notte sui mezzi pubblici è sicuro a Torino, consigli? Non vorrei barricarmi in casa e non poter uscire, grazie a tutti per le risposte.",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1imvw8m/mezzi_pubblici_a_torino_di_notte/"
    },
    {
        "id": "1imclse",
        "author": "DoubleEast2870",
        "title": "Andare in bici a Torino",
        "content": "Questa domanda potrebbe essere stupida ma portate pazienza: vengo da un paesino piccolo e non mi sono mai spostata granché in bici, ma vorrei farlo qui a Torino perché non sopporto l’idea di metterci così tanto tempo a fare pochi chilometri. Ma andare in bici a Torino sembra impossibile! Per strada mi sento un disturbo (e ho un discreto timore di venire stirata) ma sui marciapiedi spesso non c’è spazio (oltre che i pedoni). È meglio lasciar perdere e prendere i mezzi? Aiutate un topolino di campagna ",
        "upvotes": 19,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1imclse/andare_in_bici_a_torino/"
    },
    {
        "id": "1imucnq",
        "author": "Necessary-League2287",
        "title": "Per chi cerca un gruppo nuovo per uscite a Torino",
        "content": "Ciao! Attualmente stiamo gestendo giá da un pó di mesi un gruppo nato per fare conoscenza a Torino e dintorni, siamo non molti ma giusti sparsi tra ragazzi/ragazze.\n\nSiccome vedo nel sub, un sacco di ragazzi o ragazze che arrivano a Torino per motivi lavorativi e vogliono fare nuovo conoscenze, chi ha il piacere sarebbe il benvenuto a unirsi tranquillamente ☺️ A patto che:\n\n-Tu sia in un range tra un’etá dai 19 fino ai 30 anni. -Partecipi alle uscite e non fai ghosting sul gruppo ( come noto a volte diversi gruppi che nascono e si unisce un macello di gente a caso per poi non capirsi piú nulla). -Che sia lí per fare REALMENTE conoscenze e amici e non sià un pretesto per stare in presenza di ragazze e provarci.\n\nChiunque si voglia unire mi scriva pure in DM, ovviamente se non si rispetta questi criteri verrá buttato fuori e non preso piú in considerazione, non è un gruppo SPAM viene fatta prima una selezione. Grazie a tutti e a presto!",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1imucnq/per_chi_cerca_un_gruppo_nuovo_per_uscite_a_torino/"
    },
    {
        "id": "1imefot",
        "author": "almareck",
        "title": "Priorità semaforica mezzi pubblici",
        "content": "Ciao a tutti! Scrivo qui perché magari qualcuno è più informato di me. Cercando su Google “GTT priorità semaforica”, si trovano diversi articoli che suggeriscono l’esistenza di un sistema di priorità semaforica applicato ad almeno alcuni incroci della rete di trasporto pubblico.\n\nDi recente sono stato a Lione, dove la priorità semaforica – soprattutto per i tram – è gestita in modo impeccabile, tanto che praticamente non si fermano mai agli incroci. Da utilizzatore abituale della linea 16, mi chiedo: com’è possibile che a Torino la situazione sia così disastrosa?\n\nCi sono momenti in cui il tram resta fermo per minuti interi agli incroci (penso, ad esempio, a quello tra corso Vittorio e corso Massimo), apparentemente perdendo anche i verdi del suo senso di marcia.\n\nQualcuno sa spiegare il motivo? GTT utilizza ancora una volta sistemi obsoleti?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1imefot/priorità_semaforica_mezzi_pubblici/"
    }
]