[
    {
        "id": "1mthrxd",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 5,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mthrxd/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mn8vcf",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 26,
        "comments": 2466,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mn8vcf/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mto0mq",
        "author": "L0nEspartan",
        "title": "Squad list for Osasuna game.",
        "content": "",
        "upvotes": 197,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ic7q7saqisjf1.jpeg?auto=webp&amp;s=7d2a6234267773c29239392a1992dde51cbae0b7"
        },
        "permalink": "/r/realmadrid/comments/1mto0mq/squad_list_for_osasuna_game/"
    },
    {
        "id": "1mtjptq",
        "author": "Optimal_Lie7824",
        "title": "My Real Madrid goal predictions (and preferred formation) for the new season... La Liga only.",
        "content": "First of all, this is how I would prefer the line up to be. Now back to the main point of this post, the goals predictions which are just based off of previous seasons (mainly last season of course).\n\nThe CBs and full backs with 3-4 goals, mainly from set pieces and for the full backs from overlaps. Nothing outrageous.\n\nThe midfielders with 6-7 goals pretty realistic in my opinion. Jude will drop because he'll miss about 5 matches or so and will slowly be included in the starting XI by like match 9 or so plus he's not going to be as high up the pitch as he used to be, even like last season. \n\nNow the attackers... Vini with 17 is achievable for him. Mbappe with 29, less than last season which happens usually from stars who join other leagues like Haaland and Kane who had crazy first seasons but, in the 2nd, they scored a bit less. I think it'll be same for Mbappe.\n\nWhat do you think? Agreed? Tell us.",
        "upvotes": 141,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/avscqmeolrjf1.jpeg?auto=webp&amp;s=eea9c2fc8c8f32bd00c5bada7d3843eb31cd2402"
        },
        "permalink": "/r/realmadrid/comments/1mtjptq/my_real_madrid_goal_predictions_and_preferred/"
    },
    {
        "id": "1mtp6pw",
        "author": "zblbolapills",
        "title": "Question regarding the stadium.",
        "content": "# It's been on my mind every time I see the Bernabéu from the outside: is this how the exterior was actually planned to look (with gaps between each layer, like in this picture), or is this part of the stadium still unfinished?\n\n[](https://www.reddit.com/r/realmadrid/?f=flair_name%3A%22Discussion%22)",
        "upvotes": 50,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xqxiqn57qsjf1.jpeg?auto=webp&amp;s=5e88c711779ec28a4b6515b15ffb2ca9b880783e"
        },
        "permalink": "/r/realmadrid/comments/1mtp6pw/question_regarding_the_stadium/"
    },
    {
        "id": "1mtliia",
        "author": "ersansefa",
        "title": "Xabi Alonso’s press conference before the season opener against Osasuna",
        "content": "\t•\tHow are you approaching your debut at the Bernabéu?\n“We all approach it with anticipation, excitement, and eagerness to start the season. These past two weeks have been short but intense, and we already want to step onto the Bernabéu. We want to start well. The first match is always important. Tomorrow is the day.”  ￼\n\t•\tHow have you seen Mastantuono?\n“The first time I spoke with him, his personality surprised me a lot. He was only 17 and yet carried himself like a man—very sure of himself. He had no hesitation about taking the step to come to Real Madrid. You can sense that maturity, that drive, that quality. He will integrate very quickly into the team.”  ￼ ￼\n\t•\tWhat level of identity does your team have?\n“We’re making progress. It’s difficult to measure exactly, and I’m sure we still have a few steps to take. But the main ideas were already introduced during the Club World Cup, and over these past two weeks we’ve worked on them even more. The feeling is positive.”  ￼ ￼ ￼\n\t•\tIs the squad finalized? Could there be departures?\n“I count on all the players who are here, and I want them all at 100%. We need them. Right now, I count on everyone.”  ￼ ￼\n\t•\tThere’s strong competition at right back—do you know who will start?\n“I’m clear that that is excellent competition. I love that in every position we have two capable players. Sometimes I’ll have to make selections, but we have depth in every position. Carva (Carvajal) is getting closer to his top level, which is great for the team. We have many matches ahead.”  ￼ ￼\n\t•\tHow do you feel about the match not being postponed?\n“Now the schedule is unchangeable, but our request—mainly for the players’ health—would have been nice to have supported. It couldn’t be done. We’ve only had two weeks, and there are no excuses. The team can compete tomorrow. Heart and desire push more than the legs.”  ￼ ￼\n\t•\tThe Miami match—does it distort the competition?\n“I fully agree with the club’s statement. If rules are changed, it must be by unanimous agreement of all participants. Right now, that’s not acceptable.”  ￼ ￼\n\t•\tWhat do you think of the phenomenon Lamine Yamal?\n“I don’t have a pressure meter… He is becoming a key player for both Barça and the national team. The time to face him will come.”  ￼\n\t•\tHow have Vinicius and Mbappé taken on the message?\n“It’s about all lines being aware. For forwards, it’s important that when we transition defensively they don’t get left behind—and also that when we attack, the defense pushes forward. We want to function as a team. That will help us maintain better structure defensively and offensively. We took a step forward during the Club World Cup, and it’s something we’ve been working on.”  ￼ ￼\n\t•\tWhat promise can you make to the fans?\n“I’m more of a doer than a speaker. Promising before doing doesn’t usually work in football. We also have a lot of desire and energy to bring to the stadium—and deserve it. Saying it doesn’t make it so. We want to begin that journey tomorrow.”  ￼\n\t•\tHow do you choose the ‘defensive boss’?\n“That has to come naturally. It has to emerge organically from the players. We have communicative players who are asserting themselves quickly. Leadership should emerge from what you project, not impose. There may be more than one leader.”  ￼\n\t•\tRefs?\n“We begin the season, and we’ll see how things go. Hopefully, we won’t have to talk about referees.”  ￼\n\t•\tHow is Rodrygo? What role do you envision for him?\n“There are many rumors in summer. I’ve seen he’s in good shape. I count on everyone, and I want them to feel for and belong to the team—and be at 100%. That’s what concerns me and occupies me now.”  ￼\n\t•\tMallorca–Barça controversy?\n“It’s not up to me to comment on what happens in other matches, but I listened to what Arrasate said, and he explained it very well.”  ￼ ￼\n\t•\tWhat can Mastantuono bring?\n“He could have minutes tomorrow. He will provide quality, energy, is defensively committed, has good drive. I’ve seen in him that Argentine fighting spirit. He’s good with the final pass. He’s at a very good level.”  ￼ ￼\n\t•\tBrahim—how surprised are you by him?\n“I’ve seen him in good form. I already knew how he thinks about his position. He excels in tight spaces. He didn’t surprise me.”  ￼\n\t•\tMastantuono said Messi is the best in the world…\n“I can see it makes sense that his favorite player is Messi. Being Argentine, that’s not a surprise to me.”  ￼ ￼\n\t•\t11 years since your last match as a player for Madrid?\n“I have very good memories. I returned with Bayern and felt the love. Now my role is different, but I’m expectant and motivated—eager to feel that connection with the fans again. Let whatever happens, happen—and let them feel whatever they want to feel. I’m happy to be back.”  ",
        "upvotes": 78,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PECRHHasmp3azuf-g4_73lMpdZPULqxnQlJ6hS01GGc.jpeg?auto=webp&amp;s=ed115d724a0c3132580bc43644807696c1326e19"
        },
        "permalink": "/r/realmadrid/comments/1mtliia/xabi_alonsos_press_conference_before_the_season/"
    },
    {
        "id": "1mtnk69",
        "author": "YourNameNameName",
        "title": "Franco Mastantuono called up by Argentina for the Conmebol Qualifiers",
        "content": "",
        "upvotes": 58,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8jwjq8imfsjf1.jpeg?auto=webp&amp;s=7d43ad54b3ccc20b6175a9d1622767fbb4f3622e"
        },
        "permalink": "/r/realmadrid/comments/1mtnk69/franco_mastantuono_called_up_by_argentina_for_the/"
    },
    {
        "id": "1mtj2cx",
        "author": "Hour777",
        "title": "How Good Was José Mourinho at Real Madrid?",
        "content": "I wasn’t around to watch Mourinho’s Real Madrid in person, but from what I’ve read and seen highlights of, he seems like he was incredibly effective. Winning La Liga in 2011–12 with a record 100 points is insane, and it looks like he really knew how to get the best out of players like Cristiano Ronaldo and Sergio Ramos.\n\nPeople talk about his intense tactics and defensive organization, and even though he had conflicts with some players, he clearly left a mark on the club. From what I’ve gathered, he made Madrid competitive again, especially against Barcelona, and his time is still remembered as one of the most intense and successful periods in recent history.",
        "upvotes": 86,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtj2cx/how_good_was_josé_mourinho_at_real_madrid/"
    },
    {
        "id": "1mtk939",
        "author": "Deezwend",
        "title": "How will Real Madrid's squad look like after Bellingham's return from surgery?",
        "content": "https://preview.redd.it/5wy3iin3rrjf1.png?width=792&amp;format=png&amp;auto=webp&amp;s=96f505e173312e1841cc5d1dc6df0310855797cc\n\nIt is told this is how Xabi plans to build the squad after Bellingham's return from surgery. Guler is meant to play in the midfield by Xabi but probably until Bellingham returns. I think he thinks to play Mastantuono rather than Guler, so it looks like they will competete to get jersey on the pitch. Who will play ahead of whom do you think?",
        "upvotes": 23,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtk939/how_will_real_madrids_squad_look_like_after/"
    },
    {
        "id": "1mtgv3c",
        "author": "Gaengsa",
        "title": "Can Rodrygo start tomorrow?",
        "content": "Hearing reports that Brahim Diaz is gonna replace Bellingham and Mastantuano will be a second half substitute. \n\nWas wondering if Rodrygo gets a chance as 10? \n\nWhat do you think? Here goes my XI\n\nCourtois, TAA, Rudiger, Huijsen, Carreras, Tchou, Valverde, Arda, Mbappe, Rodrygo ( Yes!) and Vini Jr. \n\nI will give a chance to Gonzalo, Brahim, Mastantuano, and if possible Alaba in the second half. ",
        "upvotes": 26,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtgv3c/can_rodrygo_start_tomorrow/"
    },
    {
        "id": "1mspbia",
        "author": "Novel_Exchange_356",
        "title": "I miss this man more than ever ,right now.",
        "content": "",
        "upvotes": 684,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pcqtpc14nkjf1.jpeg?auto=webp&amp;s=426feaa8f7754d9b04ebea7d6924f85e7d81a504"
        },
        "permalink": "/r/realmadrid/comments/1mspbia/i_miss_this_man_more_than_ever_right_now/"
    },
    {
        "id": "1msmdjw",
        "author": "EffectiveTie3144",
        "title": "OTD August 17 2010, Real Madrid announced the signing of Mesut Özil for around €18M from Werder Bremen.",
        "content": "",
        "upvotes": 569,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1msmdjw/otd_august_17_2010_real_madrid_announced_the/"
    },
    {
        "id": "1mtipia",
        "author": "RegularBet1050",
        "title": "Throwback Kits and Cool Gifts",
        "content": "Greetings Real Madrid Fans,\n\nI’m an American attending tomorrows fixture, and I’m proud to say it will be my first time at your esteemed pitch. I want to get something really cool to celebrate and remember this moment for a lifetime as I’m huge futból fan, and this is really a unique experience. I was hoping to 1. Get the 1999 kit but it looks like it sold out. Is there anywhere in Madrid I can get a really unique throwback Uni? 2. I want to get something I can put on my office desk or hang up in my office, is there anything special you’d recommend? Thanks and can’t wait to enjoy your stadium for the hopefully the first time.\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtipia/throwback_kits_and_cool_gifts/"
    },
    {
        "id": "1mtr5es",
        "author": "bad_things21",
        "title": "Spanish or foreign players in RM?",
        "content": "Which one do you prefer? Imo I go by the one who's performing better, no matter where did they born. But sometimes I see in media that there are people preferring to sign spanish player \"so there will be more RM players in the Spanish Football Team\", I prefer signing a future superstar, no matter race or country.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtr5es/spanish_or_foreign_players_in_rm/"
    },
    {
        "id": "1mt252h",
        "author": "kasam-se",
        "title": "New training session in preparation for the Osasuna match | Real Madrid",
        "content": "",
        "upvotes": 38,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tlYRidegrAJxqaG-vnU01w_c8cHcsakm8q_0anZH2qs.jpeg?auto=webp&amp;s=df403610f493b5f9050c204c45fdac2a83600748"
        },
        "permalink": "/r/realmadrid/comments/1mt252h/new_training_session_in_preparation_for_the/"
    },
    {
        "id": "1mto34m",
        "author": "4ayo",
        "title": "Where can I see real madrid matches (internet) ?",
        "content": "Hi,\n\nI live in Switzerland. I'm interested in la Liga and some teams because I like to watch some sport on the week end. \n\nWhen I search on Google, it says me that Dazn app provides la liga matches but when I download it and check out, I only see France, Portugal and Germany championships. I don't see Spain nor English championships in the list.\n\nI can search for Real Madrid team but no videos are proposed. Only team comp, stats, or calendar.\n\nWhat's going on ? Do I need to use a VPN ? On which website are you able to see the matches ? (I don't have TV, only internet)\n\nThanks and best regards",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mto34m/where_can_i_see_real_madrid_matches_internet/"
    },
    {
        "id": "1mstv3t",
        "author": "ManuMora98",
        "title": "FT: Union Berlin W 1 - 3 Real Madrid W | Win in our second match of the preseason, next, Bayern on Thursday as the final game before the season begins.",
        "content": "",
        "upvotes": 55,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9k6n08splljf1.jpeg?auto=webp&amp;s=4ea1926635efa95349af83b76454fd562cdc1e83"
        },
        "permalink": "/r/realmadrid/comments/1mstv3t/ft_union_berlin_w_1_3_real_madrid_w_win_in_our/"
    },
    {
        "id": "1msmfzb",
        "author": "KjOnReddit1010",
        "title": "🚨🔵 Manchester City keep thinking of Rodrygo as main target if Savinho ends up leaving and joining Tottenham.\n\nAs revealed days ago, #MCFC want to try for Brazilian star… but only if Sávio leaves.\n\nNo Akliouche, no Xavi Simons as of now. Rodrygo, the name mentioned internally.",
        "content": "",
        "upvotes": 141,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1msmfzb/manchester_city_keep_thinking_of_rodrygo_as_main/"
    },
    {
        "id": "1mssgik",
        "author": "Unique-Winter5193",
        "title": "Hi, I have question about 02-03 jerseys, some have adidas stripes other don’t, also realmadrid logo some with full diagonal blue stripe other limited to “M”.",
        "content": "",
        "upvotes": 54,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mssgik/hi_i_have_question_about_0203_jerseys_some_have/"
    },
    {
        "id": "1msqaqg",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Union Berlin | Friendly",
        "content": "",
        "upvotes": 58,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nba5adjdvkjf1.jpeg?auto=webp&amp;s=168bf398fe782cda740b882e0bc7303c8e3beaca"
        },
        "permalink": "/r/realmadrid/comments/1msqaqg/fem_our_starting_xi_against_union_berlin_friendly/"
    },
    {
        "id": "1mssez1",
        "author": "AdVaanced77",
        "title": "How can I get rid of this on my shirt?",
        "content": "I have only worn this shirt twice and it’s real bought off adidas website and the emirates print has gone like this. Has this happened to anyone else and if so how do you get it back to normal. I can’t tell if it’s faded or something, I know it’s from water but I don’t know how to get rid of it and make it normal ",
        "upvotes": 27,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mssez1/how_can_i_get_rid_of_this_on_my_shirt/"
    },
    {
        "id": "1mssqzs",
        "author": "ManuMora98",
        "title": "Union Berlin W 0 - [3] Real Madrid W | Signe Bruun 49'",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5oRaSkX2eplC0HfiadIWjQOwz1FJs35bcJEZadRQzP8.png?auto=webp&amp;s=98f0235f77745550c7f410894c149162d5f7d82d"
        },
        "permalink": "/r/realmadrid/comments/1mssqzs/union_berlin_w_0_3_real_madrid_w_signe_bruun_49/"
    },
    {
        "id": "1mss546",
        "author": "ManuMora98",
        "title": "Union Berlin W 0 - [2] Real Madrid W | Signe Bruun 43' (Holmgaard 2nd assist)",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5oRaSkX2eplC0HfiadIWjQOwz1FJs35bcJEZadRQzP8.png?auto=webp&amp;s=98f0235f77745550c7f410894c149162d5f7d82d"
        },
        "permalink": "/r/realmadrid/comments/1mss546/union_berlin_w_0_2_real_madrid_w_signe_bruun_43/"
    },
    {
        "id": "1msjage",
        "author": "007ZORO",
        "title": "Who should be Courtois’ replacement once it’s “time”?",
        "content": "With Thibaut Courtois still performing at an elite level, it might feel a bit early to talk about replacing him, but realistically, time catches up with everyone. He’ll be 34 in 2026, and even if he continues strong for a few more years, the club should start thinking ahead to who will eventually step into that role. Real Madrid have usually planned big when it comes to goalkeepers (Casillas, then Navas, then Courtois), so it makes me wonder: who should be next in line once it’s “time”?",
        "upvotes": 62,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1msjage/who_should_be_courtois_replacement_once_its_time/"
    },
    {
        "id": "1msnjp5",
        "author": "ManuMora98",
        "title": "Castilla [2] - 1 Ibiza | Loren Zúñiga 92'",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5oRaSkX2eplC0HfiadIWjQOwz1FJs35bcJEZadRQzP8.png?auto=webp&amp;s=98f0235f77745550c7f410894c149162d5f7d82d"
        },
        "permalink": "/r/realmadrid/comments/1msnjp5/castilla_2_1_ibiza_loren_zúñiga_92/"
    },
    {
        "id": "1ms5abl",
        "author": "Ready_Ad_1353",
        "title": "Mastantuono debuts in Valdebebas: \"The pace is very high.\"",
        "content": "",
        "upvotes": 228,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0dqEvcGX7YWGdJVlXzUXh4H-rVKLDl9-O3txivDtUv0.jpeg?auto=webp&amp;s=5634b655e683b402bc6144a567a83dfcfb5c65b3"
        },
        "permalink": "/r/realmadrid/comments/1ms5abl/mastantuono_debuts_in_valdebebas_the_pace_is_very/"
    },
    {
        "id": "1ms9ix1",
        "author": "Dapper_Ad_229",
        "title": "What will happen to Raul Asencio?",
        "content": "There’s a reason Perez put a 1B buy clause on him. During last injury prone season, he stepped up and delivered as the CB at interim. Big games and league games, fantastic performances and passion in excess… Despite the questionable performance in the CWC, the potential of Raul is enormous. Everyone seems to have shoved him under the rug after the two bad games. I honestly believe he could become a Ramos type defender for Madrid with enough finetuning and training + experience. He’ll probably serve as a sub for Militao or Huijsen…. Although Xabi is really flexible and determines lineups tailored to opponents so maybe in 3CB’s we’ll see him play and Tchoua back in supportive midfield role. If he gets the playtime he needs and is able to be more careful we’re in for a treat.",
        "upvotes": 125,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ms9ix1/what_will_happen_to_raul_asencio/"
    },
    {
        "id": "1mslxws",
        "author": "ManuMora98",
        "title": "Castilla [1] - 1 Ibiza | Rachad Fettal 17' (Great build up) | Friendly",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5oRaSkX2eplC0HfiadIWjQOwz1FJs35bcJEZadRQzP8.png?auto=webp&amp;s=98f0235f77745550c7f410894c149162d5f7d82d"
        },
        "permalink": "/r/realmadrid/comments/1mslxws/castilla_1_1_ibiza_rachad_fettal_17_great_build/"
    },
    {
        "id": "1mrpr9k",
        "author": "EquivalentAbalone456",
        "title": "On this day 9 years ago, Real Madrid presented Marco Asensio.",
        "content": "",
        "upvotes": 1037,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrpr9k/on_this_day_9_years_ago_real_madrid_presented/"
    },
    {
        "id": "1msrh1o",
        "author": "ManuMora98",
        "title": "Union Berlin W 0 - [1] Real Madrid W | Eva Navarro 11' (Holmgaard assist)",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5oRaSkX2eplC0HfiadIWjQOwz1FJs35bcJEZadRQzP8.png?auto=webp&amp;s=98f0235f77745550c7f410894c149162d5f7d82d"
        },
        "permalink": "/r/realmadrid/comments/1msrh1o/union_berlin_w_0_1_real_madrid_w_eva_navarro_11/"
    },
    {
        "id": "1ms1dlw",
        "author": "Max01170117",
        "title": "Tebas hits back at Real Madrid over objection for hosting Villarreal vs Barcelona in US",
        "content": "Real Madrid are 100% right to oppose La Liga’s shady plan of taking Villarreal vs Barcelona to Miami — it destroys the fairness of home-and-away competition and gives Barça an unfair edge. Tebas is once again pushing his own agenda, pretending it’s about “growing the league” when really it’s about cash grabs, and now he’s even trying to deflect by bringing up irrelevant stuff about Madrid’s past. Classic Tebas hypocrisy — always twisting things to attack Madrid instead of protecting the integrity of Spanish football.",
        "upvotes": 143,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kaW1P0kVlkwP1qLGb1xR-wmWDC4SQJ01kxLTkVj5PqA.jpeg?auto=webp&amp;s=b3f239143b393a2900842fc0ebfae2da30302fc8"
        },
        "permalink": "/r/realmadrid/comments/1ms1dlw/tebas_hits_back_at_real_madrid_over_objection_for/"
    },
    {
        "id": "1mrrbgk",
        "author": "Ghost-Ripper",
        "title": "Our boys are focussed and training enough before we go all in. What are our chances this time?🔛",
        "content": "",
        "upvotes": 262,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrrbgk/our_boys_are_focussed_and_training_enough_before/"
    }
]