[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p63sl8",
        "author": "AstralKatOfficial",
        "title": "How do I get netflix to realize I dont give two shits about wrestling?",
        "content": "So for some stupid reason, Netflix has been pushing wrestling HARD on my account for the past few months, not only have I never engaged with anything that'd suggest I want to watch wrestling content, but I've even gone into the info tabs and put \"Not for me\" on all the available ones and *still* whenever some new wrestling thing comes out, it shoves the ENTIRE CATEGORY right back onto my home page... I literally only use Netflix for its originals or shows like The Good Place, please tell me how to get this shit off my home screen for good",
        "upvotes": 174,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1p63sl8/how_do_i_get_netflix_to_realize_i_dont_give_two/"
    },
    {
        "id": "1p6ci4g",
        "author": "tipputappi",
        "title": "Just watched Death by lightning and man I feel so sorry for Charles' sister.",
        "content": "Poor woman tried so hard to bring her brother on the right track but he kept breaking her heart again and again. Allowed him to stay rent free,  turned a blind eye to his crackpot ideas, tried to get him a real job but he kept scaming her.  Love truly does Blind you.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ci4g/just_watched_death_by_lightning_and_man_i_feel_so/"
    },
    {
        "id": "1p6bph0",
        "author": "Curious-Monitor497",
        "title": "The beast in me - why Aggie why???",
        "content": "Why was Aggie Wiggs texting and sending a voice mail everytime she had an important information? I feel like the entire last episode could have been avoided if she just waited for a reply from Brian Abbott. Only thing that make sense is that she probably was terrified of the whole situation and acted irrationally. Also, Brian Abott had no phone lock in his burner phone. Come on, an FBI agent being that careless.",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p6bph0/the_beast_in_me_why_aggie_why/"
    },
    {
        "id": "1p6gqj3",
        "author": "Majestic-Day-5024",
        "title": "Vanilla Sky Ending (M34)",
        "content": "i've seen lots of sad movie scenes/endings, titanic, gladiator, saving private ryan - but this film just hits me different, I can't quite put my finger on it but I cry my eyes out as soon as \"sigur ros\" starts playing\n\nI think it's the fact all of us always have that thought; \"what if\" what if my life tired out differently &amp; we found total happiness &amp; falling in love with someone \n\nplus maybe the look penelope cruz gives tom as he's just about to jump, when she kind of smiles at him with her eyes &amp; gives him a wave but looks a bit defeated herself \n\n\"i'll find you again... when we are both cats\" \n\nmovie magic \n\n\n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gqj3/vanilla_sky_ending_m34/"
    },
    {
        "id": "1p6hghi",
        "author": "Adventurous-Wasabi98",
        "title": "why is my screen going black while watching netflix?",
        "content": "i’m trying to watch stranger things season 4 on netflix since season 5 comes out tomorrow and I got through almost the entirety of the first episode (about an hour) and my screen keeps going black but the audio still plays and this happened a little while ago when I was trying to finish the new Frankenstein movie. When I looked it up the netflix website said to restart your phone blah blah blah I did all of that PLUS deleted the app and redownloaded it and it’s STILL doing it and i’m getting so frustrated!! does anyone have a solution to this or even knows what i’m talking about?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6hghi/why_is_my_screen_going_black_while_watching/"
    },
    {
        "id": "1p6ctft",
        "author": "Luciif3R_2O",
        "title": "Help needed",
        "content": "I’ve tried everything I can. Why is Netflix still not streaming in **HD** (1080p/2K) on my phone? Even when I download content, it only saves in around 480p. I’m on a **4K Plan **so this makes absolutely no sense. It’s been over a month now, and this is getting ridiculous. I prefer watching my content in HD.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ctft/help_needed/"
    },
    {
        "id": "1p634my",
        "author": "Jason2648",
        "title": "need some good gory horror movies",
        "content": "stuff like hostel,saw,terrifier,etc\n\nim rebuilding my list on netflix and need some good horror movies and i like really gory and disturbing ones, i watched that frankenstein movie but i honestly like slasher type horror movies more",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p634my/need_some_good_gory_horror_movies/"
    },
    {
        "id": "1p6h9mf",
        "author": "hannibalism_",
        "title": "chances of olympo renewal?",
        "content": "im so stressed guys. it came out in june and there’s been zero news. no marketing. nothing. i really like the show and its characters, but i am losing hope. it was rlly popular on tiktok and tweets abt it sometimes get over 10k on twt but alas. anyone been a fan of a series that got renewed after 6 months? 😭 is there any hope left for a renewal?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6h9mf/chances_of_olympo_renewal/"
    },
    {
        "id": "1p6h76b",
        "author": "wonderingdreamer00",
        "title": "LF Recommendations (specifics in the comments)",
        "content": "Hello, I am looking for movie/series recommendations. Specifically, non-english ones. I've also watched a lot of kdramas so maybe less on that too. I wanted to explore more filmography from different countries and cultures, I'm hoping to learn a bit of various language by hopefully picking up a few words here and there (but mainly I just really wanted to watch something out of my usual hehe)\n\nHere are some of my recent watches that I enjoyed, and a few of those I can remember from way before. I like thrillers, post-apocalyptic, heartwarming drama, rom-coms,  etc so I'm really open to any genres:\n\nThe Greatest Teacher (JDrama)\n\nGirl From Nowhere (Thai)\n\nBillionaire's Bunker (Spanish)\n\nMoney Heist (Spanish)\n\nInto the Night (Belgian)\n\nThe Rain (Danish)\n\nCurrently watching: Friendzone (French movie)\n\nThank youu!\n\n  \nEDIT: I meant \\*specifics in the post body",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6h76b/lf_recommendations_specifics_in_the_comments/"
    },
    {
        "id": "1p6gstx",
        "author": "agile-coder",
        "title": "Rewind once the credits roll?",
        "content": "Anyone else got the issue where you can’t rewind during the credits?\n\nWatching using LG TV App\n\nMaybe i miss the end of a show and get the watch credits or play next episode message. \n\nI hit watch credits and then hit rewind. \n\nBut instead of rewinding it just crashes and takes me back to the start of the episode and even more annoyingly marks the episode as not watched so it gets confusing as to which one i was watching and now need to forward all the way through to watch the last couple of minutes again!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6gstx/rewind_once_the_credits_roll/"
    },
    {
        "id": "1p5y3fm",
        "author": "KnopeLeslieKnope",
        "title": "Shows Recommendation",
        "content": "Hey guys! So my Netflix subscription renews March 2026 and that's when I'll be canceling. Are there any shows you would recommend me to watch? It's my least streamed service lately and I wanna get the last bang for my buck! I prefer shows that have all of their seasons completed. I also don't mind if a show has been canceled. Give me your recs, please!",
        "upvotes": 17,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1p5y3fm/shows_recommendation/"
    },
    {
        "id": "1p5zgpf",
        "author": "Jazzlike_Ad_8236",
        "title": "Black Rabbit “One Month Earlier”",
        "content": "So I just watched the first scene of Black Rabbit then turned it off. Idk if I’m alone in this, but i absolutely cannot stand when a show opens with the climax, then cuts halfway thru to a previous point in time. To me it feels like such a cheap and lazy way to create intrigue. I cannot think of a single instance where there’s a narrative purpose for it. Anyone else feel that way?\n\n(Sidenote: ik I can’t judge the show, but the dialogue in that one scene was so bad I was worried I wouldn’t like the show. Legit the first line is “well that is definitely the most amount of money I’ve ever had in this safe” that is the most expository line I’ve ever heard)",
        "upvotes": 12,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1p5zgpf/black_rabbit_one_month_earlier/"
    },
    {
        "id": "1p6e99r",
        "author": "jintinlin",
        "title": "A chrome extension to show/hide your movie on netflix",
        "content": "Not sure if it's the correct type to select, but this tool can help you show/hide your movie list on netflix base on your preference. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p6e99r/a_chrome_extension_to_showhide_your_movie_on/"
    },
    {
        "id": "1p6e2ql",
        "author": "jnialt",
        "title": "Netflix job portal?",
        "content": "Hi! I submitted an application to Netflix through Workday last night, and didn't receive a confirmation, only to realize that they use their own application site now and not Workday. I tried applying again directly through their site, but it told me I'd already applied. Does this mean that my application was likely received even if I didn't get confirmation and don't see a status in Workday? Thank you!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p6e2ql/netflix_job_portal/"
    },
    {
        "id": "1p6dqmo",
        "author": "littleMissTired123",
        "title": "Will my netflix work in a different continent?",
        "content": "I recently got netflix zo i dont know much abt it and sorry if this is a stupid question.\n\nIm in the US, abd i have netflix on my iPad, if I go to a different continent and use the wifi there will that affect anything?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p6dqmo/will_my_netflix_work_in_a_different_continent/"
    },
    {
        "id": "1p6dpix",
        "author": "dereverse",
        "title": "Subtitle position in Korean Variety Shows",
        "content": "Why the heck Netflix changing every subtitle on korean varieties show to the top of the screen. I checked all them, including the one I already watched and all of them changed.\n\nUntil yesterday the subtitles still at the bottom of the screen. Now the subtitles covers the cast's faces. What kind of stupid change is this. \n\nIs there anyway to change subtitle position back to the bottom ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6dpix/subtitle_position_in_korean_variety_shows/"
    },
    {
        "id": "1p6864p",
        "author": "lvlynelen",
        "title": "Never have I ever - looking for a scene for my presentation",
        "content": "Hi everyone!\n\nI’m doing a presentation on a principle of influence called “Liking”. Basically, the idea is that the more you like someone, the more easily they can persuade you. My theme for the presentation is Netflix, so I’m using scenes from different shows/movies to show the factors that contribute to liking.\n\nOne of those factors is physical attractiveness and I was thinking of using Never Have I Ever as an example, specifically Devi and Paxton. I haven’t watched the show, but my friends say Devi usually does things for Paxton because she finds him attractive.\n\nCould anyone recommend specific scenes or moments where Devi agrees with or does something for Paxton because he’s good-looking?\n\nAny episode/clip suggestions would really help. Thank you!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6864p/never_have_i_ever_looking_for_a_scene_for_my/"
    },
    {
        "id": "1p6c29u",
        "author": "Unabominable_",
        "title": "Hotel Sakura 2025",
        "content": "Can anyone explain the ending? Did Nid really kill Sarah? Who is telling the truth? The movie is a huge mess to me. I can’t find any explanation on Google and Reddit. Thanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p6c29u/hotel_sakura_2025/"
    },
    {
        "id": "1p61ayb",
        "author": "ZoopZap",
        "title": "What is the most absurd/weird anime I can watch on netflix rn?",
        "content": "Title pretty much sums it up. I want to find an anime with the most layers of batshit insanity, simply because I like shows like that. A lot of my friends are into anime as well, so I want something I can bond with them with while also enjoying my type of shows",
        "upvotes": 5,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p61ayb/what_is_the_most_absurdweird_anime_i_can_watch_on/"
    },
    {
        "id": "1p5seiv",
        "author": "afk_exe",
        "title": "Netflix wants you to stream its video podcasts in between binge-watching its shows.",
        "content": "",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p5seiv/netflix_wants_you_to_stream_its_video_podcasts_in/"
    },
    {
        "id": "1p686d0",
        "author": "lvlynelen",
        "title": "Never have I ever - looking for a scene for my presentation",
        "content": "Hi everyone!\n\nI’m doing a presentation on a principle of influence called “Liking”. Basically, the idea is that the more you like someone, the more easily they can persuade you. My theme for the presentation is Netflix, so I’m using scenes from different shows/movies to show the factors that contribute to liking.\n\nOne of those factors is physical attractiveness and I was thinking of using Never Have I Ever as an example, specifically Devi and Paxton. I haven’t watched the show, but my friends say Devi usually does things for Paxton because she finds him attractive.\n\nCould anyone recommend specific scenes or moments where Devi agrees with or does something for Paxton because he’s good-looking?\n\nAny episode/clip suggestions would really help. Thank you!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p686d0/never_have_i_ever_looking_for_a_scene_for_my/"
    },
    {
        "id": "1p5in2i",
        "author": "hard2resist",
        "title": "Thriller Series Like \"YOU\"  Need Recommendations for Non-Stop Suspense &amp; Dark Psychological Twists",
        "content": "I'm looking for recommendations for series or movies on Netflix or Prime Video that match the psychological thriller and suspense vibe of YOU.\n\nWhat I'm looking for:\n\n\t\\* Crime thrillers with strong suspense elements\n\n\t\\* Action-packed series that keep you on edge\n\n\t\\* Shows with psychological depth and dark themes\n\n\t\\* Fast-paced storytelling that hooks you from episode one\n\nI loved YOU for its unpredictable plot twists and the way it kept me guessing. Now I need something that delivers that same intensity and gripping atmosphere.\n\nWhat are your top picks for thriller series that deliver non-stop suspense and action? Bonus points if it's something that's criminally underrated.",
        "upvotes": 27,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p5in2i/thriller_series_like_you_need_recommendations_for/"
    },
    {
        "id": "1p66890",
        "author": "basedgod1995",
        "title": "Soap opera effect in Last Samurai Standing",
        "content": "On episode 4. The motion seems off though. I have all settings that cause soap opera effect set to off but this episode seems oddly uncanny in motion. Not sure what happened lol\n\nAnyone else notice this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p66890/soap_opera_effect_in_last_samurai_standing/"
    },
    {
        "id": "1p6eiy4",
        "author": "Accomplished-Copy776",
        "title": "Why is Netflix pushing this bulkshit on me",
        "content": "https://imgur.com/a/pAR3FWM\n\nWtf is this? Why is Netflix pushing other people's beliefs systems? I hate astrology. These shows have nothing to do with astrology, and that isnt even my sign.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p6eiy4/why_is_netflix_pushing_this_bulkshit_on_me/"
    },
    {
        "id": "1p61ksa",
        "author": "swimming_onions",
        "title": "Pixelated",
        "content": "Multiple shows are super pixelated and all others are totally fine... what's going on? Already updated app. This is happening on my Xbox one. Someone please help",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p61ksa/pixelated/"
    },
    {
        "id": "1p4l0s5",
        "author": "hard2resist",
        "title": "What Netflix show kept you up all night binge-watching recently?",
        "content": "I just finished The Beast in Me in one sitting and realized I haven't had that \"just one more episode\" feeling in a while. Now I'm looking for my next obsession.\n\nWhat's the last Netflix show that had you completely hooked? The kind where you tell yourself you'll watch one episode and suddenly it's 3 AM.\n\nLooking for something that grabs you from episode one and doesn't let go.",
        "upvotes": 1280,
        "comments": 955,
        "media": null,
        "permalink": "/r/netflix/comments/1p4l0s5/what_netflix_show_kept_you_up_all_night/"
    },
    {
        "id": "1p5lgij",
        "author": "redd84x",
        "title": "Brooklyn 99 vs The Office US - Which one stays?",
        "content": "These are my two comfort-rewatch shows on Netflix. I’ve gone through both more times than I can count, and they somehow never get old.\n\nBut if only one could stay on Netflix…\nWhich one would you keep, and why?\n\nIf I had to choose, I’d probably keep Brooklyn 99 (big Andy Samberg fan here, sorry Steve).",
        "upvotes": 5,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1p5lgij/brooklyn_99_vs_the_office_us_which_one_stays/"
    },
    {
        "id": "1p5ptzl",
        "author": "Beginning_Bridge_272",
        "title": "squid game season 1 was the best",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5ptzl/squid_game_season_1_was_the_best/"
    }
]