[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p4l0s5",
        "author": "hard2resist",
        "title": "What Netflix show kept you up all night binge-watching recently?",
        "content": "I just finished The Beast in Me in one sitting and realized I haven't had that \"just one more episode\" feeling in a while. Now I'm looking for my next obsession.\n\nWhat's the last Netflix show that had you completely hooked? The kind where you tell yourself you'll watch one episode and suddenly it's 3 AM.\n\nLooking for something that grabs you from episode one and doesn't let go.",
        "upvotes": 237,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1p4l0s5/what_netflix_show_kept_you_up_all_night/"
    },
    {
        "id": "1p460iv",
        "author": "GrowthHackerMode",
        "title": "Which Netflix series is as good as 24 or Prison Break?",
        "content": "Looking for a current series that hits the same intensity and grip as 24 and Prison Break. I’m after something with high stakes, tight pacing, and episodes that make you want to keep going without stopping. Any recent shows you think are on that level?",
        "upvotes": 43,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1p460iv/which_netflix_series_is_as_good_as_24_or_prison/"
    },
    {
        "id": "1p4qraj",
        "author": "photoshop_2023",
        "title": "Would you recommend watching Absentia?",
        "content": "Would you recommend watching Absentia? I just saw this series on Netflix and was wondering if you have watched it? \n\nWould you recommend it to someone?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p4qraj/would_you_recommend_watching_absentia/"
    },
    {
        "id": "1p4pttl",
        "author": "niseynisey",
        "title": "Had fun at Netflix House Philly",
        "content": "Had a fun time at the Netflix house. Here are my opinions:\n\nAs soon as you walked in, the host invited you to a movie screening and it was completely free. Not sure if that was only because we went on a Saturday. Their theater is a gorgeous Netflix red color and the fabric seats are very comfortable with plenty of room. The seats do not recline. \n\nThe host will also give you a rundown of everything available &amp; answer any questions you have. There was definitely no shortage of staff wherever you went and everyone was so pleasant. They also had security guards on duty in high traffic areas. \n\nTons of selfie/picture opportunities available in the general admission areas. You’ll find yourself dodging photobombing people left &amp; right during the busy times.  My favorite section was definitely the Bridgerton display; was gorgeous! \n\nThe gift shop was also in the general area &amp; extensive! They had so many unique things available for purchase, so if unique Netflix related swag is your thing, you’ll like their shop. \n\nI didn’t try their restaurant in the general area, but a full restaurant is available to purchase sit down meals. \n\nPaid features:\n\nMini golf - we didn’t do the Netflix show-themed mini golf so I can’t give my opinion on this experience. \n\nPuzzle experience - the Philly location currently has The One Piece puzzle. It was so much fun. I recommend it for teens &amp; older fans as you have to figure out clues to proceed in the game. You also have to participate in slightly physical games and you have to work together as a team. You do not have to be a fan of One Piece to enjoy the game, but fans appreciated all the detail even more than the average attendee. They estimate a 45minute completion of the game, but my team only took 30 minutes; I guess we’re a smart bunch. That leads me to say, if you’re anti-social, avoid at all costs. Each game needs 12 players for very specific reasons. Unless you bring 11 people with you, you WILL be grouped with people you do not know. Please don’t be that person that ruins the fun for everyone. \n\nArcade experience - The Philly location has Wednesday as its gaming adventure. I assumed Wednesday would be a puzzle just like One Piece as it was the same price, but it was not a puzzle experience. This adventure is for sure for all ages but younger kids &amp; teens that are fans of Wednesday Adam’s will have the best time. The main area is an arcade themed around the Adam’s family. The rest are gorgeous photo opportunities. If you are not a fan of Wednesday, I wouldn’t suggest this experience. This area’s attention to detail was far beyond my expectation and it was amazing being able to take photos in live scenes from the show. There is a small puzzle aspect to this area, if you can find it ;). Definitely keep your eye out for posters telling you about the puzzle. I’m still a bit confused why this experience is timed. You basically enter &amp; can do whatever you want. My only thought is that it’s to keep it from getting too crowded at one time. I did enjoy this experience but did not feel it was worth the hefty price tag. \n\nVR experience - The VR game was by far my favorite part of the Netflix house and well worth the money. We did the 45 minute Stranger Things VR and maaan, that thing was tons of fun. It’s a physical experience &amp; lots of movement is involved. You’ll be grouped as 6 people per experience &amp; the hosts give you a thorough walk through on how to setup your gear. When purchasing, you can choose 25 minutes of 45 minutes. Afterwards you’ll be able to sit and watch snippets from your experience that the team records and edits. You’ll also be given access to your recorded session afterwards. You can either wait for them to email you a copy of the video, or you can scan the host’s QR code &amp; download it immediately. \n\nAll in all, it was a fun experience. The biggest stand out was the staff. I don’t know what they’re feeding those people in the cafeteria but everyone “drank the koolaid” and was 100% dedicated to their characters. \n\nEven if you just want to stop by and check out only the free stuff, as a fan of the bigger Netflix shows, you’ll find something for you to enjoy. If you pay for anything, do the VR. It is the best bang for your buck as it’s a lower price than One Piece &amp; Wednesday. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p4pttl/had_fun_at_netflix_house_philly/"
    },
    {
        "id": "1p3vavp",
        "author": "Icy_Object430",
        "title": "Just watched VANILLA SKY and I’m shook 😭💔",
        "content": "I know I’m late. But… This movie is top tier heartbreak, romance and sci-fi. Way ahead of its time! Can’t get over it. \nAm I over hyping it or you guys love it too?",
        "upvotes": 88,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1p3vavp/just_watched_vanilla_sky_and_im_shook/"
    },
    {
        "id": "1p4ooil",
        "author": "andrestrujillopulido",
        "title": "The Witcher (4ª Temporada) Netflix, 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p4ooil/the_witcher_4ª_temporada_netflix_2025/"
    },
    {
        "id": "1p3xkqk",
        "author": "doobied-2000",
        "title": "A question for anyone who has seen the new Frankenstein movie.",
        "content": "I just saw the new Frankenstein movie and I thought it was absolutely amazing! However I'm a little confused about the ending of it. It seems that the monster wants to find Victor but let Victor hunt him all the way to the North Pole? Why did the monster run from Victor just to want to find Victor on the ship? If the monster wants to die and Victor wants to kill the monster why didn't the monster let Victor try to kill him? (Through surgery or any other means).",
        "upvotes": 39,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xkqk/a_question_for_anyone_who_has_seen_the_new/"
    },
    {
        "id": "1p4ohmk",
        "author": "Happy-Chapter664",
        "title": "Petition for one last show of the Nublar Six",
        "content": "There are people who might hate me because they don't want to see more anymore, but I do. And that's why I started a petition. Do you want more? And show me that? Then sign this petition: \n\nhttps://c.org/shvDdx5YGY",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p4ohmk/petition_for_one_last_show_of_the_nublar_six/"
    },
    {
        "id": "1p4fuxc",
        "author": "thenewfingerprint",
        "title": "\"Untamed\" - Does it get any better?",
        "content": "I'm watching the first episode, and I've got to say, I feel like I'm watching a cross between a Hallmark movie and the TV show Tracker. I thought this series was going to be high suspense, edgy. Should I continue watching?",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p4fuxc/untamed_does_it_get_any_better/"
    },
    {
        "id": "1p4aien",
        "author": "WonderMoon1",
        "title": "Can you stop the dimming when pausing on the computer app?",
        "content": "I found that you need to press certain controls on the tv remote, but I haven't found anything for the computer app yet. \n\nIt dims after like 10-15 seconds. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p4aien/can_you_stop_the_dimming_when_pausing_on_the/"
    },
    {
        "id": "1p3uqkt",
        "author": "fbutterfield96",
        "title": "Warner Bros. Discovery Sale: Company Set to Review First-Round Acquisition Bids From Paramount, Comcast, Netflix",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3uqkt/warner_bros_discovery_sale_company_set_to_review/"
    },
    {
        "id": "1p47qaf",
        "author": "sandfrayed",
        "title": "Getting unwanted \"Reminder\" emails from Netflix",
        "content": "I've unsubscribed from all emails from Netflix (all the email settings are off), but they've suddenly just recently started sending me \"Reminder\" emails like \"Reminder: Oh, Hi! is now on Netflix\".  Anyone else having this issue?  \n\nI tried chatting with Netflix support and they recommended turning off push notifications (which have nothing to do with emails), or turning on email subscriptions and then turning it off again, which I'm doubtful will work either.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p47qaf/getting_unwanted_reminder_emails_from_netflix/"
    },
    {
        "id": "1p45zmq",
        "author": "TroubleFantastic682",
        "title": "samsung tv giltch",
        "content": "My new samsung tv seems to be glitching only on netflix shows. audio is fine but the picture almost looks like a record is skipping. most prominent when there are big scene changes. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p45zmq/samsung_tv_giltch/"
    },
    {
        "id": "1p3udgq",
        "author": "Big-Swing3912",
        "title": "horror films for a date night?",
        "content": "i'm going to this guys house and we wanna watch a horror film. i don't wanna accidentally pick something that's too gross or unsettling, any good picks? i'd like the date to end on a good note. i like paranormal films but prefer slasher/killers. not really a fan of psychological horror. thankyou !",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p3udgq/horror_films_for_a_date_night/"
    },
    {
        "id": "1p34ays",
        "author": "lockmasterg",
        "title": "Something new on main page",
        "content": "I cant be the only one. There's literally 1000s of movies and shows on Netflix. Why does my main page only show me the same 50-100 titles over and over. Most of what's there I've already seen and rated. There needs to be a refresh screen button or something.",
        "upvotes": 195,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1p34ays/something_new_on_main_page/"
    },
    {
        "id": "1p3y24o",
        "author": "thee_antichrist",
        "title": "Netflix on my fire stick plays but doesn't show a picture",
        "content": "So for some reason Netflix on my fire stick has completely stopped playing things properly. When I try and watch a show it will load and play the sound but the screen will get stuck on a random loading percentage and not budge. If you then exit and go back to try again it does the same screen but no sound and gets stuck in 0%.\n\nI've tried clearing the cache, data, uninstalling and reinstalling and updating my fire stick and nothing works. Any suggestions would be great thanks!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p3y24o/netflix_on_my_fire_stick_plays_but_doesnt_show_a/"
    },
    {
        "id": "1p3n305",
        "author": "No-Ability-2272",
        "title": "any shows/movies like last samurai standing?",
        "content": "im really into the whole samurai stuff and whatnot. Im kinda pissed off at the cliffhanger in last samurai standing lol.\n ive also watched rurouni kenshin and golden kamuy, i really like these types of movies and shows so if you guys have suggestions i would be extremely grateful! \nthank you!!",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p3n305/any_showsmovies_like_last_samurai_standing/"
    },
    {
        "id": "1p3izoz",
        "author": "Natali-Gessoli",
        "title": "Is it worth getting the no-ads version of Netflix?",
        "content": "Since the new Stranger Things season will be coming out soon, I was debating on whether I should get a Netflix account.\nI’m a college student so I am on a tight budget, and the idea of a $7.99 subscription caught my eye.\nHowever, idk how many ads there are and I am worried they are going to be a lot. I have also heard that not all shows and movies are available, but I’m not fully sure how much is available (like is it a 50/50 available ratio??)\nDoes anyone have this plan, and if so, do you think it’s worth it or should I spend the extra $10 a month for the full experience?",
        "upvotes": 17,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1p3izoz/is_it_worth_getting_the_noads_version_of_netflix/"
    },
    {
        "id": "1p3fej2",
        "author": "THEMADLAD_2009",
        "title": "Should I watch boots?",
        "content": "I have seen a bit of it on tiktok and it looks like a pretty decent show.\nI don’t care about all the “pink marine” stuff\nI just want to know if it’s worth the watch.",
        "upvotes": 25,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1p3fej2/should_i_watch_boots/"
    },
    {
        "id": "1p3kre8",
        "author": "xTHUGGY_YETIx",
        "title": "Thanks netflix very much",
        "content": "Was halfway binge  watching star trek deep space nine and they had updated the app and now it's gone erase faced from the earth fml 😭 even star trek the next generation is gone my god whyyy ",
        "upvotes": 11,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1p3kre8/thanks_netflix_very_much/"
    },
    {
        "id": "1p3y5nk",
        "author": "BankComplex1753",
        "title": "Fate: The winx saga is underrated!",
        "content": "So I saw online a lot of people bashing fate and saying it doesnt compare to winx and how it's not even similar, but the literal show isnt even called winx its called \"Fate\" a winx saga, which i heard people complaining about the name being misinterpreted and how it's a complete different show than what winx club is. Anyway, my views on the show are netrual to good but I think with better writing the potential is very high for succession. When I first watched it, I had watched winx clube a few years prior and while it was alright it had things that I didnt like same as with the Fate saga. But when I first watched fate a few years ago I was very excited to hear about a second season, I do agree with the fact that some of the characters are bad and the storyline could be improved aswell and how the removed flora and replaced her just to bring her back, like wtf. But overall when I went into watching the show I had very little remembrance of the winx club and when watching fate saga I didnt have anything to compare it to, so my raw feedback is that its an entertaining show and the little spin on making it gory and adding more modern stuff really makes the show lore or less watchable. I dont really think nits underrated its just over HATED, plus winx club went to crap after they turned into those believer fairies or whatever and compared to that fate the winx saga is good.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p3y5nk/fate_the_winx_saga_is_underrated/"
    },
    {
        "id": "1p3xlzf",
        "author": "jonnywhatshisface",
        "title": "Outage in Greece?",
        "content": "Suddenly in the middle of watching, Netflix started buffering and hung. Unable to watch anything. I’m in Athens, GR. \n\nAnyone else seeing issues in Greece with the service?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xlzf/outage_in_greece/"
    },
    {
        "id": "1p3xk70",
        "author": "General-Mention-2897",
        "title": "Red lights flashing in Zero Days Headquarters",
        "content": "Hello everyone,\n\nI'm currently watching Zero Day and I'm at episode 3, timestamp 32:00.\n\nWhen the congresswoman comes into the office, some red lights start to flash. \n\nWhat does that mean?\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p3xk70/red_lights_flashing_in_zero_days_headquarters/"
    },
    {
        "id": "1p3rv7l",
        "author": "bidet_enthusiast",
        "title": "Netflix app disabled, disapeared from app store- AppleTV-4k-A2169",
        "content": "My Netflix app was disabled, then I tried to reinstall from the App Store, and it is no longer in the App Store for my AppleTV. I have an A2169 Apple Tv 4K. Account works fine on other devices. Any ideas?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p3rv7l/netflix_app_disabled_disapeared_from_app_store/"
    },
    {
        "id": "1p3vbkl",
        "author": "Only_Highlight2647",
        "title": "Can I remove someone from using my Netflix?",
        "content": "My ex has the password and email 🤦🏻‍♀️ I have no idea where I could log him out from his phone or if it’s possible. Even if I change the password, he’d still be logged into the app.",
        "upvotes": 1,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1p3vbkl/can_i_remove_someone_from_using_my_netflix/"
    },
    {
        "id": "1p47e27",
        "author": "Mistinrainbow",
        "title": "Why is one piece not with german audio?",
        "content": "Just cancelled my subscription because one piece has no german audio!!! How can i make myself heard? I am from austria. Germans can watch one piece episode 1-16 with german audio. Austria apparently not. Wtf??",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p47e27/why_is_one_piece_not_with_german_audio/"
    },
    {
        "id": "1p3dkgd",
        "author": "ShinyBuizel22",
        "title": "What's a good K-Drama to recommend for a first timer?",
        "content": "So I hear Netflix is the place for K-Dramas (I mean, for an American audience, idk if other services have a similar library), but I also hear the genre pretty popular so I do want to see for myself. But yes I'm basically a newcomer, so I'm just curious what you'd recommend for a newcomer?",
        "upvotes": 19,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1p3dkgd/whats_a_good_kdrama_to_recommend_for_a_first_timer/"
    },
    {
        "id": "1p35lrw",
        "author": "Front_Wade1725",
        "title": "Rewatching stranger things with my kids who have never seen it! So excited for the new season!",
        "content": "Anyone else rewatching and discovering anything new? We just finished season 3, my kids were so sad …. left. Who else is ready for season 5? Also thinking about doing a stranger things feast for them to watch the new episodes!",
        "upvotes": 41,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p35lrw/rewatching_stranger_things_with_my_kids_who_have/"
    }
]