[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1hbpgar",
        "author": "UgoNotta",
        "title": "Xmas Comics 2024",
        "content": "Buongiorno a tutti, \nQualcuno fi voi è riuscito a trovare il codice sconto per l'Xmas comics legato a chi viaggia con Trenitalia? \nSul sito della fiera si parla di un QR code nelle biglietterie automatiche in tutto il Piemonte, ma io non l'ho visto ",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/duzm6z2xp66e1.png?auto=webp&amp;s=b80f981ff988c6db8c9b8ab20e26b9c7c894e736"
        },
        "permalink": "/r/torino/comments/1hbpgar/xmas_comics_2024/"
    },
    {
        "id": "1hayzff",
        "author": "Bright-Ice989",
        "title": "Rimango solo a Natale.",
        "content": "Ciao a tutti! Sono uno studente fuorisede qui a Torino. Quest’anno, per la prima volta, passerò il Natale lontano dalla mia famiglia. Lavorerò a Capodanno e, considerando i prezzi esorbitanti dei treni, tornare a casa non era un’opzione fattibile.\n\nHo provato a organizzarmi per rendere la giornata un po’ speciale: ho scritto una mail ben curata e strutturata per fare volontariato al pranzo di Natale dell’associazione Sant’Egidio, ma purtroppo non ho ricevuto risposta.\n\nPerciò, mi chiedevo se qualcuno avesse idee su come potrei passare la giornata. Mi piacerebbe:\n\n1. Fare volontariato (se conoscete associazioni o attività che cercano aiuto, fatemelo sapere)\n2. Partecipare a qualche attività di gruppo o evento natalizio qui in città\n3. Organizzare una piccola “escursione” fuori porta, anche da solo\n\nMi piacerebbe comunque rendere questo Natale speciale, anche se diverso dal solito. Grazie mille a chiunque voglia condividere idee o esperienze.",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1hayzff/rimango_solo_a_natale/"
    },
    {
        "id": "1hbdxo1",
        "author": "simojam93",
        "title": "Bassista cerca band ;)",
        "content": "Ciao!  \nSono un bassista con esperienza che sta cercando una band a cui unirsi? qualcuno può aiutarmi? magari anche solo dei posti dove può essere facile trovare altri musicisti che suonano.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hbdxo1/bassista_cerca_band/"
    },
    {
        "id": "1hba3ce",
        "author": "fiorenteeeeeeeeeeee",
        "title": "Conoscere gente a Torino",
        "content": "Ciao a tutti, mi auguro di non essere ripetitivo o cliché, però ho visto da post precedenti che questo potrebbe essere il posto giusto dove chiedere, prometto di essere il più breve possibile.\n\nSono da tre anni a Torino e ho sempre e solo lavorato, sono persona particolarmente socievole ma al contempo davvero poco estroversa. \nQuesti due sono i principali motivi per cui ad oggi non sono riuscito a stringere rapporti con praticamente nessuno qua.\n\nPassando al dunque, se qualcuno volesse socializzare e/o passare del tempo in compagnia i miei DM sono spalancati.\n\nDue informazioni a caso per cercare di minimizzare lo small talk imbarazzante↓↓↓\n23M nato e cresciuto in Toscana da una famiglia marocchina, fra i miei interessi ci sono: musica (rap, rock, alternative indie and everything in between), stand-up (da bill burr e louis ck a tutta la combriccola di mark Normand, theo von e quant'altro), arti marziali (grande fan dell'UFC) e trekking.\n\nScusate la palese richiesta di attenzioni.\n\nBella",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hba3ce/conoscere_gente_a_torino/"
    },
    {
        "id": "1hb925g",
        "author": "dkroods",
        "title": "📢Grande Novità! “Take It Easy TO” è ora disponibile su Google Play! 🚀",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nrwwkrzfh26e1.png?auto=webp&amp;s=dfac2da9a0f5ed2f22e2649e7c4138b4aaaa5620"
        },
        "permalink": "/r/torino/comments/1hb925g/grande_novità_take_it_easy_to_è_ora_disponibile/"
    },
    {
        "id": "1haxx2p",
        "author": "Yara603",
        "title": "Leggende di Torino",
        "content": "Leggende di Torino\n\nMi piacerebbe conoscere le leggende locali che solo i residenti conoscono. Forse alcuni fatti interessanti legati alla mitologia. Mi va bene tutto ciò che ha un tocco di mistero.",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1haxx2p/leggende_di_torino/"
    },
    {
        "id": "1hbbhr8",
        "author": "fachin_hell",
        "title": "Consiglio Otorino?",
        "content": "Qualcuno ha avuto esperienze positive con un otorino (nello specifico per acufene) e si sentirebbe di consigliarlo?\n\nGrazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hbbhr8/consiglio_otorino/"
    },
    {
        "id": "1hb9v01",
        "author": "_pigreco_",
        "title": "negozio che ripara telefoni decente",
        "content": "ciao, ho rotto l’altoparlante “basso” del mio iphone. alla apple mi han chiesto 150 euro che,onestamente, non spenderei per un iphone 12 mini. perciò cercherei consiglio da voi dove ripararlo, vorrei un tecnico di quelli preparati e non quei negozietti con gente che non sa che sta facendo. naturalmente non mi interessa lo speaker sia originale ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hb9v01/negozio_che_ripara_telefoni_decente/"
    },
    {
        "id": "1hb99t8",
        "author": "dkroods",
        "title": "Grande Novità! “Take It Easy TO” è ora disponibile su App Store e Google Play! 🚀 🚎🚍🚉🚃",
        "content": "Ciao torinesi e visitatori di Torino! 👋\n\nSiamo entusiasti di annunciare il lancio di Take It Easy TO, l’app definitiva per rendere più semplice la vita di chi utilizza i mezzi pubblici a Torino! Che tu stia viaggiando per lavoro, esplorando la città o semplicemente cercando di pianificare i tuoi spostamenti, questa app è pensata per te.\n\n🎯 Cosa può fare per te “Take It Easy TO”:\n\t•\tMonitoraggio in tempo reale dei mezzi 🕒: Rimani aggiornato sulla posizione di bus e tram con un tracking live.\n\t•\tNotifiche di arrivo ⏰: Ricevi promemoria 10 minuti prima dell’arrivo del tuo mezzo. Non perderai mai più un autobus o un tram!\n\t•\tAllarmi personalizzabili 🔔: Pianifica i tuoi viaggi in anticipo con notifiche su misura per i tuoi orari.\n\t•\tDesign semplice e intuitivo 📱: Facile da usare, sia per i residenti che per i turisti che visitano la nostra splendida città.\n\n🚍 Perché scegliere noi?\n\nSiamo appassionati di Torino e vogliamo aiutare i suoi abitanti e visitatori a vivere un’esperienza senza stress sui mezzi pubblici. Take It Easy TO è leggera, affidabile e gratuita da scaricare.\n\n📥 Scaricala ora:\n\t•\tiOS: [Coming Soon!]\n\t•\tAndroid: https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app\n\nHai già provato l’app? Ci farebbe piacere ricevere il tuo feedback! Le tue recensioni e suggerimenti ci aiuteranno a rendere Take It Easy TO ancora migliore.\n\nFacci sapere cosa ne pensi o scrivici qui sotto se hai domande sull’app!\n\nGrazie mille per il tuo supporto a questo progetto locale, e speriamo che Take It Easy TO renda i tuoi viaggi più semplici e piacevoli! 💛\n\n🌟 Aiutaci a spargere la voce!\n\nCondividi questo post con amici, familiari e altri pendolari di Torino per aiutare tutti a vivere i mezzi pubblici senza stress.\n\nFacciamolo insieme, con calma! 🚦",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kmzul7ajj26e1.jpeg?auto=webp&amp;s=420ee9aed6e9a40a907296cf28609aba24061d9d"
        },
        "permalink": "/r/torino/comments/1hb99t8/grande_novità_take_it_easy_to_è_ora_disponibile/"
    },
    {
        "id": "1hb1prc",
        "author": "xclajre",
        "title": "Sciopero 13 dicembre",
        "content": "Ciao! Venerdì ci sarà sciopero nazionale dei mezzi per 24 ore e io ovviamente ho il biglietto aereo proprio per quel giorno 🤙🏻\nSapete se il servizio ferroviario che da Porta Susa arriva all'aeroporto sarà comunque attivo? O se i bus tipo Arriva scioperano anche? \n\nProbabilmente proverò a chiedere anche in stazione ma intanto mi rimetto a voi, grazie!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hb1prc/sciopero_13_dicembre/"
    },
    {
        "id": "1hbbt90",
        "author": "CycleGullible1761",
        "title": "Ma che merda è la zona di via Barletta?",
        "content": "Ciao a tutti, premetto che io sono fuori da Torino ma per lavoro e studio l'ho girata spesso, anche corso Siracusa ecc. Faccio stasera 5 min di auto per prendere un too good to go in una pasticceria vicino a via Barletta, e in un' altra perpendicolare di corso Siracusa è il delirio: 1km di auto in doppia fila, carroattrezzi ambo le direzioni, vigili che ti fermano e ti fanno cambiare direzione, furgoni fermi al semaforo verde, e non per scaricare, non si capisce un cazzo. Di solito vado da dei miei parenti che abitano vicino alla rotonda di corso Venezia, che anche lì è un casino trovare parcheggio, oppure portapalazzo, oltre all'immondizia, ma non come appunto sta via Barletta. Punto positivo di questa zona i negozi sono belli. Mai visto una roba del genere... A proposito sapete qual è il nome di quella zona?\nBella Torino, ma non ci vivrei... Manco Gotham. Servirebbero altre due linee di metro :/ \nChe ne pensate?\nBuona serata a tutti!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hbbt90/ma_che_merda_è_la_zona_di_via_barletta/"
    },
    {
        "id": "1hb0xz5",
        "author": "juvegimmy_",
        "title": "Allenamenti beach volley",
        "content": "Ciao a tutti,\nPer caso qualcuno conosce una struttura in cui fanno lezioni di beach volley? L’ideale sarebbe in posizione comoda coi mezzi o in centro ma mi va bene tutto\n\nGrazie mille",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hb0xz5/allenamenti_beach_volley/"
    },
    {
        "id": "1haxe3u",
        "author": "casinaluis",
        "title": "Consigli ristorante ",
        "content": "Buongiorno a tutti ho un cliente che mi ha chiesto un consiglio su un buon ristorante dove mangiare una buona bagna cauda. Va bene in tutto il Piemonte magari anche zona Asti. Grazie a tutti per i consigli ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1haxe3u/consigli_ristorante/"
    },
    {
        "id": "1haxl3q",
        "author": "matbordaRnB",
        "title": "Foglie secche",
        "content": "Ciao\n\nNoto la gran presenza di foglie secche non raccolte ai bordi delle strade. Mia impressione?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1haxl3q/foglie_secche/"
    },
    {
        "id": "1hadwrl",
        "author": "Few_Willingness_5198",
        "title": "lavoro a Torino e limitrofi?",
        "content": "ho un amico che ospito e vorrebbe cercare lavoro da queste parti, gli va bene anche lavori umili, pulizie spazzacamini, umidificatore per francobolli umano...\n\nsono anni che non guardo il mondo del lavoro e non so come sia al momento,  consigli?",
        "upvotes": 3,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1hadwrl/lavoro_a_torino_e_limitrofi/"
    },
    {
        "id": "1haibfg",
        "author": "Major-Maintenance684",
        "title": "Sports bar/restaurant in torino",
        "content": "Hi,\n\nI'm on a business trip in Torino. What would be the best spots to watch the Champions League tomorrow and Wednesday? I note that Juventus is playing on Wednesday.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1haibfg/sports_barrestaurant_in_torino/"
    },
    {
        "id": "1hag9tk",
        "author": "New-Chocolate1637",
        "title": "Looking for brunette girl met yesterday at Pecchia city center ",
        "content": "Yesterday I was in Pecchia restaurant and met a very cool brunette girl that was basically eating at the table in front of me. \nShe was in a group with other friends or colleagues and all of them were foreigners - I would say from a Mediterranean country like Turkey or Greece but not sure. The majority of them had their own reflex camera, so I guessed it was a group of photographers or something like that.\nWe had a very quick conversation at the end of our dinners and I even took their group picture but didn't have the chance to ask for her name. \n\nIf someone could help or knows here it would be great ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1hag9tk/looking_for_brunette_girl_met_yesterday_at/"
    },
    {
        "id": "1ha507u",
        "author": "Outrageous_Pea4161",
        "title": "Volontariato Natale 2024",
        "content": "Voglio fare il volontario il 25 dicembre, qualcuno sa indirizzarmi in qualche associazione? ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ha507u/volontariato_natale_2024/"
    },
    {
        "id": "1h9sbx0",
        "author": "_L_-",
        "title": "NON puoi dire di aver vissuto il Piemonte senza... ",
        "content": "Simile ad un altro post che avevo fatto sul \"non puoi dire di aver vissuto a Torino senza aver fatto queste cose\". \n\n\nQuali cose suggerite di fare a un non-piemontese che abita in Piemonte? \nMi sto per ritrasferire e voglio approfittarne di quest'ultimo anno qui per vedere/fare/mangiare tutte le cose belle che il Piemonte offre, ",
        "upvotes": 24,
        "comments": 43,
        "media": null,
        "permalink": "/r/torino/comments/1h9sbx0/non_puoi_dire_di_aver_vissuto_il_piemonte_senza/"
    },
    {
        "id": "1h9o7eu",
        "author": "Eye-Dust",
        "title": "Componentistica elettronica",
        "content": "Buona sera, conoscete qualche negozio su Torino o provincia che venda condensatori, resistenze ecc al dettaglio?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1h9o7eu/componentistica_elettronica/"
    },
    {
        "id": "1h9vxnm",
        "author": "Avy_isBored",
        "title": "Sapete se c’è coda per la biglietteria all’xmas comics?",
        "content": "chiedo perché le mie amiche non riescono a fare il biglietto online e hanno optato per la biglietteria però volevo capire quanto possano metterci ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h9vxnm/sapete_se_cè_coda_per_la_biglietteria_allxmas/"
    },
    {
        "id": "1h8z47n",
        "author": "PhilipDrost",
        "title": "Carrefour prezzi sullo scontrino più alti di quelli esposti?",
        "content": "Sono a Torino non da molto e ho già notato due volte che al Carrefour express di fianco a casa nel quale vado abitualmente, mi ritrovo prezzi più alti sullo scontrino di quelli che c'erano scritti... non applicano gli sconti! Come fare a dirglielo senza incazzarmi? Ha senso parlarne con i lavoratori o provare a contattare l azienda?",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1h8z47n/carrefour_prezzi_sullo_scontrino_più_alti_di/"
    },
    {
        "id": "1h8wsf5",
        "author": "Tita_63",
        "title": "Luoghi del cuore",
        "content": "Votate Rimella museo Filippa luoghi del cuore FAI",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rLoOcngFffH1ZkZf35fFoMqQXrmzxa6HCkHGDDnhsBU.jpg?auto=webp&amp;s=c9964cb422a09a1ba5682f49246242f3d3e0747c"
        },
        "permalink": "/r/torino/comments/1h8wsf5/luoghi_del_cuore/"
    },
    {
        "id": "1h85w69",
        "author": "cawalli",
        "title": "Road to Piazza Vittorio ",
        "content": "",
        "upvotes": 102,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tytmc3uod95e1.jpeg?auto=webp&amp;s=70e03785d26da34ea5813ec8f0fae347a1a23d34"
        },
        "permalink": "/r/torino/comments/1h85w69/road_to_piazza_vittorio/"
    },
    {
        "id": "1h8q1sx",
        "author": "Anonymous_77_",
        "title": "Looking for a job as an English speaker",
        "content": "Hello, Im a 19 year old studying business and Im desperate to find a job in torino without speaking italian does anyone know if it’s possible?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h8q1sx/looking_for_a_job_as_an_english_speaker/"
    },
    {
        "id": "1h7ydw3",
        "author": "Lentepubblica",
        "title": "Un automobilista ha visto la sua multa per eccesso di velocità annullata grazie a una sentenza del Giudice di pace: il motivo sta nel fatto che l’auto dei vigili era in quel momento, paradossalmente, in divieto di sosta.",
        "content": "",
        "upvotes": 23,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4NfSXdYW97dkZbCI06cnfrHlUd3JlCqdD6wjK_1Ec_o.jpg?auto=webp&amp;s=0c398a98ca8866b8d5094d505d07c223b1b9aa11"
        },
        "permalink": "/r/torino/comments/1h7ydw3/un_automobilista_ha_visto_la_sua_multa_per/"
    },
    {
        "id": "1h7xfjr",
        "author": "Barde_",
        "title": "Bei posti in montagna in cui andare con lei?",
        "content": "Stavo cercando qualche posto carino in montagna da visitare con la mia ragazza. Abbiamo la possibilità di muoverci con l'auto ma se fosse possibile avvicinarsi con i mezzi sarebbe meglio.  \nL'ultima volta siamo andati al lago di Laux e il lago delle rane. Siamo principianti, quindi magari non rifugi a 3000mt d'altezza grazie :)",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h7xfjr/bei_posti_in_montagna_in_cui_andare_con_lei/"
    },
    {
        "id": "1h7dgtq",
        "author": "Alternative-Oil2330",
        "title": "Inquinamento Torino",
        "content": "Buonasera a tutti,\nA breve mi trasferirò a Torino e ho visto che sia in città sia in tutti i comuni limitrofi vi sono normative stringenti per l'inquinamento. Cercando online mi è apparso il mov'in che con un costo irrisorio permette di usare in maniera limitata i vecchi veicoli. Qualcuno lo utilizza? La richiesta per l'installazione è lunga e tortuosa? Vi sono anche altre casistiche per circolare con un diesel euro 3?\nGrazie a tutti",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1h7dgtq/inquinamento_torino/"
    },
    {
        "id": "1h7db9z",
        "author": "Abradores",
        "title": "Palestra kickboxing o muay thai agonistica a Torino?",
        "content": "Ciao a tutti, eventualmente mi piacerebbe fare muay thai oppure kickboxing , ed eventualmente andare a fare tornei, sono 28m al momento.\n\nMi piacerebbe avere consiglio su quale palestra scegliere.\n\nUtilizzero la ss24 per muovermi dal mio paesino nella palestra, quindi anche altre palestra possono essere ok fuori torino, io penso : Collegno,Rivoli,Susa,Alpignano,Avigliana e Grugliasco.\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h7db9z/palestra_kickboxing_o_muay_thai_agonistica_a/"
    },
    {
        "id": "1h79rxk",
        "author": "Jumpy_Material_439",
        "title": "Hiking recommendations in Gran Paradiso next week?",
        "content": "Traveling to Cogne with beginner hikers. Any recommended short and safe hikes (less than 8km) in Gran Paradiso that is still open now?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h79rxk/hiking_recommendations_in_gran_paradiso_next_week/"
    }
]