[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 139,
        "comments": 498,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mxz31p",
        "author": "TheMirrorUS",
        "title": "Emily in Paris assistant director dies after collapsing while filming",
        "content": "",
        "upvotes": 300,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1mxz31p/emily_in_paris_assistant_director_dies_after/"
    },
    {
        "id": "1mxoe8c",
        "author": "Crafty-Ball9103",
        "title": "Can't stand how many of these exist.",
        "content": "",
        "upvotes": 224,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih9x1a5l8okf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxoe8c/cant_stand_how_many_of_these_exist/"
    },
    {
        "id": "1my5dcc",
        "author": "peoplemagazine",
        "title": "Emily in Paris Resumes Production Days After Assistant Director’s Death as Lily Collins and Eugenio Franceschini Film in Venice",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1my5dcc/emily_in_paris_resumes_production_days_after/"
    },
    {
        "id": "1mxvcd5",
        "author": "Breekoenekk",
        "title": "Miso is back!",
        "content": "It's gonna be awesome! If the fight scenes are half as good as in S1 they will still be better than those of 95% ofcall other series. \nIf they can keep the theme's of alienation, racisme, sexisme and discrimination in the Edo period, something Anime often overlooks, and the amazing sounddesign from S1 Blue eye Samurai S2 can become a instant classic like Arcane.\nCan't wait.",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0idve7385qkf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxvcd5/miso_is_back/"
    },
    {
        "id": "1mxms1o",
        "author": "IGR777",
        "title": "What’s a good show that works mostly as background noise?",
        "content": "This might be an odd question, but sometimes I do some online work from home and I don’t like to just sit there and do the work so what’s a good show I can put on and not really pay attention to, but still understand so nothing with a  Deep story",
        "upvotes": 45,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1mxms1o/whats_a_good_show_that_works_mostly_as_background/"
    },
    {
        "id": "1mxia1h",
        "author": "marianinacob",
        "title": "Shameless on Netflix Greece",
        "content": "Shameless was added on the greek Netflix on August 1, and i have been watching like crazy since then, I'm already on season 6 as of today. As I was watching, and the episode ended, it suddenly popped an error saying that it's not available in my region. How could that happen when it was just added 3 weeks ago? This is very frustrating.",
        "upvotes": 47,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1mxia1h/shameless_on_netflix_greece/"
    },
    {
        "id": "1mxc7io",
        "author": "smcneal",
        "title": "How KPop Demon Hunters Harnessed Girl Power To Become One of Netflix’s Biggest Hits Ever",
        "content": "Director Maggie Kang discusses inspo for the movie, including \"Buffy\" and her tween self:\n\n“I don’t think we see this kind of woman a lot in film, and there’s this kind of fear of showing women look ‘ugly’ and imperfect, especially in animation, and that message doesn’t sit well with me. So I hope girls can learn that there’s beauty in our imperfections, even in how we look on the outside.”",
        "upvotes": 88,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mxc7io/how_kpop_demon_hunters_harnessed_girl_power_to/"
    },
    {
        "id": "1my1ius",
        "author": "fishrocketburgers",
        "title": "Why is Netflix releasing another Gabby Petito film?",
        "content": "I just saw that “The Story of Gabby Petito” is coming to Netflix on Wednesday. I had to double check because I could have sworn Netflix recently released a series and they did earlier this year. Why a second one?? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1my1ius/why_is_netflix_releasing_another_gabby_petito_film/"
    },
    {
        "id": "1my5zeo",
        "author": "hlovesshows",
        "title": "Has this happened to anyone?",
        "content": "Hey, so, I’ve had Netflix for 3 or 4 years and I’d been looking for Pitch Perfect a couple of years ago. I found it and then, I couldn’t find it anymore, the next day. A few months later, I came across it again and double checked  because I intended on watching it a few days later. I didn’t save it to My List. Same thing happened yet again- it disappeared even when I looked for it AND saved it to My List. Now, it just showed on my Netflix on its own. I have no internet issues because the internet in my area is great and it’s not as if I travelled anywhere out of the city or country which could lead to such confusion. What could the problem be? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1my5zeo/has_this_happened_to_anyone/"
    },
    {
        "id": "1my4mgj",
        "author": "Nagarigerss",
        "title": "🧟‍♂️Resident Evil Movies In Order: Your Ultimate Guide To The Zombie Horror Franchise🎬🧟‍♀️",
        "content": "Hey Zombie Survivors! The Resident Evil movies are a mess to watch in order – live-action, animated, reboots, Netflix stuff... it's like dodging zombies blindfolded. I finally found this solid chronological guide that sorts it all out without spoilers. It covers:\n\n* Milla's saga from start to finish\n* CGI ones like Degeneration and Vendetta\n* The 2021 reboot\n* Ties to games/shows for extra lore\n\nGreat for first-timers or rewatches. Pro tip: Play some RE games while binging! Check it: [Resident Evil Movies in Order: Chronological Guide](https://globaltechgadgets.com/resident-evil-movies-in-order-chronological-guide/). What's your fav watch order or scene? (Laser grid still freaks me out!)😅🔥",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1my4mgj/resident_evil_movies_in_order_your_ultimate_guide/"
    },
    {
        "id": "1mxqmtf",
        "author": "Big_Buy8203",
        "title": "Currently watching bloodline",
        "content": "Currently watching bloodline on episode 22 and it’s been an interesting watch so far. I must say Danny has been a menace ever since the show started to introduce what his real motive for coming back was. \n\nDid anyone watch this show and begin to think of their own family to some degree? I understand that no family is perfect and we all have our issues but wow Danny was like a bad omen to the Rayburns lol",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mxqmtf/currently_watching_bloodline/"
    },
    {
        "id": "1my1wah",
        "author": "purplepikminisfat",
        "title": "can you guys give me some recommendations???",
        "content": "I like horror movies like The Conjuring/ Trashy but fun shows like Never Have I Ever/ Wholesome shows like Anne With An E or Young Sheldon!\n\nCan you guys give me some recommendations?? I prefer shows to movies!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1my1wah/can_you_guys_give_me_some_recommendations/"
    },
    {
        "id": "1mxzsaf",
        "author": "greenisnotcreativ",
        "title": "Moving to Japan",
        "content": "l am currently based in Germany and would like to get a netflix account to watch Wednesday before I move to Japan. Would my German account switch to the Japanese when I move? I'm interested in the larger library they have and the lower price. Or would I be stuck with my German account and German price unless I make a new account once I'm there? If so, I'll Just wait until I move.\n\nThank you! I haven't had Netflix since they made it difficult to share the account with my family.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxzsaf/moving_to_japan/"
    },
    {
        "id": "1mxxw5w",
        "author": "welcarlos",
        "title": "Audio Delay Issue on Netflix with Mi TV Stick (MiTV-AESP0)",
        "content": "Hello everyone,\n\nI’m experiencing an audio delay issue on Netflix with my Mi TV Stick (MiTV-AESP0). The delay is approximately 300 ms, and I’m using the TV’s speakers. I noticed this started after the update to the new Netflix interface.\n\nIt’s worth noting that this delay only occurs on Netflix; other streaming platforms like Disney+, Prime Video, HBO, and YouTube are working fine. Is anyone else experiencing this problem on Netflix?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxxw5w/audio_delay_issue_on_netflix_with_mi_tv_stick/"
    },
    {
        "id": "1mx5kju",
        "author": "hamptont2010",
        "title": "Long Story Short is phenomenal",
        "content": "Not the movie, because apparently there is a movie with the same name, but the new show from the people behind Bojack Horseman. I'm currently on episode, and it's everything you'd expect from the BoJack crew and more. It's funny, charming, witty, heart-breaking, and moving. The premise of jumping around to different timelines also allows it to tell some really interesting stories. If you like Bojack, it's definitely worth checking out!",
        "upvotes": 32,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mx5kju/long_story_short_is_phenomenal/"
    },
    {
        "id": "1mxszha",
        "author": "Fortheloveofyarn",
        "title": "Physical 100",
        "content": "Sighing and waiting for Season 3…anyone else?\n\nRelated, just watched Final Draft and that was good. Then had to go back and rewatch some episodes of 100 of S2 to see some Amotti again. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mxszha/physical_100/"
    },
    {
        "id": "1mxsltz",
        "author": "Sun_Flower11",
        "title": "Controversial Take on Greenleaf",
        "content": "I don’t care about Faith Greenleaf. It would’ve been better to have her on the show. Even through flashbacks (not the crappy ones through Sophia) so we could also feel like we lost a beloved character. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxsltz/controversial_take_on_greenleaf/"
    },
    {
        "id": "1mxabaj",
        "author": "lobstersonskateboard",
        "title": "Watched Sneaky Pete after it moved to Netflix— underrated gem!",
        "content": "I was sad to see it got cancelled after 3 seasons, there was still so much it could explore. I absolutely loved every bit of it, the acting is phenomenal and the story's been the most engaging thing I've seen on Netflix in a long time. \n\nI wonder with it moving to Netflix that maybe, just *maybe*, there's a small chance it could get a renewal? Copium, I know, but I wonder if anyone else feels the same way. I'm not sure if David Shore even has the capacity to do something in the near future, since he's working on a new series at the moment... But a man can hope.",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxabaj/watched_sneaky_pete_after_it_moved_to_netflix/"
    },
    {
        "id": "1mxqt4l",
        "author": "DetectiveFujiwara",
        "title": "Does Windows 11 Loudness Equalization work on Netflix in Microsoft Edge?",
        "content": "Was curious if it works at all on Netflix watching using Microsoft Edge. For decreasing the dynamic range aka Turning up quiet voices and lowering action scenes.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxqt4l/does_windows_11_loudness_equalization_work_on/"
    },
    {
        "id": "1mxqn16",
        "author": "SSSparks88",
        "title": "Hulu adds on Netflix?",
        "content": "So I'm rewatching Ozark S1 and keep getting ads for Alien Earth on Hulu/FX. Like... Isn't that bad for Netflix?\n\nI tried googling this and found basically nothing about Netflix running ads for other streaming platforms. Is this actually happening to other people or did I accidentally click into some weird alternate reality?\n\nThis might be a normal thing, but I thought for a sec that I was on Hulu... It feels like McDonald's putting up a Whopper commercial lol. Anyone else seeing cross-platform ads like this? Is it apart of an add package from FX that slipped through the cracks or does Netflix not care if the money is there? Is this not a weird thing?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mxqn16/hulu_adds_on_netflix/"
    },
    {
        "id": "1mwqc5q",
        "author": "ToonAdventure",
        "title": "Blue Eye Samurai: Season 2 | Official Start of Production | Netflix",
        "content": "",
        "upvotes": 136,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqc5q/blue_eye_samurai_season_2_official_start_of/"
    },
    {
        "id": "1mxchii",
        "author": "Less_Manufacturer218",
        "title": "HOSTAGE-great show but puzzling ending",
        "content": "When the parents are telling their daughter to put down the gun when a killer is approaching her armed with a knife was infuriating. Didn’t anyone writing or directing the show realize how backwards that scene was, especially to close out the show?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mxchii/hostagegreat_show_but_puzzling_ending/"
    },
    {
        "id": "1mxxwrr",
        "author": "Reico88",
        "title": "Several Reasons Why I wasn’t upset or even surprised that FUBAR was cancelled",
        "content": "• Season One’s cliffhanger had no barring on the plot. Luke and the team’s information was sold to dangerous criminals and terrorists. I would’ve expected the main villain or secondary antagonist to be one of those criminals or terrorists. Instead we get a completely different villain. Plus the cliffhanger barely added much tension to the overall narrative.\n\n• Carter and Donnie added nothing to the story. The show should’ve found some way to make them relevant to the plot or useful to any of the missions. Instead they just sat at the side and spewed out random unfunny humour. Also, they did nothing with the subplot of Carter and Emma still having feelings for each other. Plus i was a little upset to how insensitive the show was to Donnie being dumped by Talia and her carelessly sleeping with Luke knowing Donnie is in ear shot. The only interesting thing they did was that altercation with the biker gang which only served to have them shipped out of the story as quickly as possible.\n\n• The cliffhanger was resolved so quickly and lazily. It probably should’ve still effected the team into Season Three but we get this anticlimactic conclusion where Greta uses her new fortune to assassinate all the criminals who bought Luke’s information.\n\n• Season Two’s cliffhanger had little tension compared to its predecessor or relevance to the leads. We find out Tina secretly steered away her Russian superiors from Barry and now he has to rescue her cause the Russians know she turned. This hardly effects Luke cause he fully retired. I have no doubt they’ll shoehorn him into this plot but odds are it would’ve been forced. \n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mxxwrr/several_reasons_why_i_wasnt_upset_or_even/"
    },
    {
        "id": "1mxdssi",
        "author": "Substantial-Use-1758",
        "title": "A strong recommendation for “Hostiles” with a superlative Christian Bale",
        "content": "Check out this 2017 new Classic on Netflix, also featuring Wes Studi and Rosalind Pike. \n\nIt’s a slow burning, beautiful western which portrays the violent, painful realities of life in the American West in the 1890’s. \n\nChristian Bale is the best of the best here. The music is also gorgeous, and the final scene — that final scene! Is maybe the most powerful and sublimely done finale in any film, of this or any age 🤷‍♀️🥹",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxdssi/a_strong_recommendation_for_hostiles_with_a/"
    },
    {
        "id": "1mxb2ah",
        "author": "Vast-Passenger-2620",
        "title": "Sense8 Sensational",
        "content": "From the makers of The Matrix this series from 2018 confounded marketing efforts and was cancelled after 2 seasons. It’s very difficult to explain but I think it’s more mind blowing than The Matrix. I have watched it 4 times already and continue to discover new profound insights. Sense8 explores the nature of Reality and Identity. What defines us? Name? Gender? Job? Expression of Love? If everyone is interconnected is that why we must be kept divided and dumbed down for the powers that be to keep us controlled?\nThis is in my Top 5",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mxb2ah/sense8_sensational/"
    },
    {
        "id": "1mx0zig",
        "author": "Ok_Let_893",
        "title": "Hostage",
        "content": "ANOTHER DISAPPOINTING LIMITED SERIES. The story doesn’t make sense. The negotations, the military/ security tactics. Script and dialogues feel like Chatgpt made it. I am on ep 5. Just gotta finish it for closure.",
        "upvotes": 13,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mx0zig/hostage/"
    },
    {
        "id": "1mw700m",
        "author": "BlackDoom_26",
        "title": "The most binge worthy Netflix show or movie you’ve ever watched",
        "content": "You ever start a show or movie on Netflix thinking you’ll just watch one episode, then suddenly it’s 3am and you’ve watched the whole thing? Just curious what people’s recommendations are for ones that really had you hooked.",
        "upvotes": 806,
        "comments": 1363,
        "media": null,
        "permalink": "/r/netflix/comments/1mw700m/the_most_binge_worthy_netflix_show_or_movie_youve/"
    },
    {
        "id": "1mwvq5p",
        "author": "BlueRose99x",
        "title": "Marco Polo",
        "content": "Well, for the longest time I refused to watch this show because I thought it wouldn’t be great. Genghis Khan grandson’s empire? Barely little facts to the actual Kublai Khan story? No thanks.\n\nBut I just finished it, and in reality it was amazingly good. Definitely kept me on the edge and wanting more. Too bad the series got canceled and left the last season on a cliffhanger. No closure, damn you Netflix. ",
        "upvotes": 26,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mwvq5p/marco_polo/"
    },
    {
        "id": "1mwgfil",
        "author": "bbqchef_nyc",
        "title": "Which cancelled Netflix show do you wish would come back?",
        "content": "Same as the question.\n\nIf you had the power to bring ONE cancelled Netflix series back for at least one more season, which show would you pick and why?",
        "upvotes": 140,
        "comments": 1096,
        "media": null,
        "permalink": "/r/netflix/comments/1mwgfil/which_cancelled_netflix_show_do_you_wish_would/"
    },
    {
        "id": "1mx34cl",
        "author": "Sun_Flower11",
        "title": "Sophia in Greenleaf",
        "content": "In the show Greenleaf, why didn’t they just take some of Sophia’s eggs? They could’ve frozen them for the future and she could’ve gotten a surrogate to carry. Strange this was never an option given.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mx34cl/sophia_in_greenleaf/"
    }
]