[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j4nnle",
        "author": "Eeepp",
        "title": "'The Recruit' Canceled At Netflix After 2 Seasons",
        "content": "",
        "upvotes": 365,
        "comments": 204,
        "media": null,
        "permalink": "/r/netflix/comments/1j4nnle/the_recruit_canceled_at_netflix_after_2_seasons/"
    },
    {
        "id": "1j4t3rz",
        "author": "BoredPandaOfficial",
        "title": "Abducted Boy From Netflix ‘Unsolved Mysteries’ Documentary Found 7 Years Later",
        "content": "",
        "upvotes": 70,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j4t3rz/abducted_boy_from_netflix_unsolved_mysteries/"
    },
    {
        "id": "1j4y7yw",
        "author": "Waste-Scratch2982",
        "title": "'Running Point' Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 29,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1j4y7yw/running_point_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1j4rxwu",
        "author": "Sweaty-Toe-6211",
        "title": "'HAPPY GILMORE 2' releases July 25 on Netflix",
        "content": "",
        "upvotes": 78,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1j4rxwu/happy_gilmore_2_releases_july_25_on_netflix/"
    },
    {
        "id": "1j4mamm",
        "author": "deepsealazy",
        "title": "With Love, Ballerina Farm",
        "content": "I have always been a fan of Meghan (from her Suits days), but there's something so disingenuous about this show.\n\nFirst off, I was certain she was filming in her own kitchen... and maybe that was naive of me. During the first episode, when she's putting together those bath salts and preparing for her guest, I really believed she was hosting them in her home. \n\nThen I found out it was a set when she met Mindy, and suddenly everything felt staged. From every single ingredient being perfectly placed in mason jars to the bacon wrapped in brown paper. a perfectly curated homemade life. (and perhaps this is what she wanted? who knows?)\n\nThe whole vibe is weird, honestly. It's giving major Ballerina Farms energy, like she's trying to be the next big homestead influencer. I wouldn't be surprised if she came out with a cottagecore cookbook next.\n\nLook, I still love her and have always supported her and Harry, but this just feels so forced and It's like watching someone try to build a lifestyle brand instead of sharing their actual lifestyle.",
        "upvotes": 51,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mamm/with_love_ballerina_farm/"
    },
    {
        "id": "1j4z29b",
        "author": "Robemilak",
        "title": "Pulse | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4z29b/pulse_official_trailer_netflix/"
    },
    {
        "id": "1j4ce5c",
        "author": "Few_Pumpkin3666",
        "title": "Doubting the authenticity of the \"Top 10\" list",
        "content": "I remember when 'Kinda Pregnant' with Amy Schumer released last month and for like two weeks straight it was showing as #1 on the trending movies and I just, straight up don't believe it. This isn't like some big takedown or the tired trope of \"Amy Schumer is horrible and no one likes women comedians\". Her movies aren't usually my cup of tea but I'm not here to hate. \n\nThis one though, I just cannot believe it was actually number one. Especially with the scene that auto plays when you stay on it too long. It's hard for me to even imagine a demographic that would see that and decide to spend the next hour and a half watching it. Let alone enough to make it #1 for 2 weeks straight. So I guess I'm asking if anyone else feels like they just lie about the numbers to push their newest originals? If they put it as #1 someone might at least give it a try. Or do y'all think I'm just way off base here and imagining things or out of touch. \n\nAgain to reiterate, I have a wide range of movies I'll watch and enjoy, even some of the Netflix original movie slop has its merrit for just turning your mind off and having a little fun. See 'Red Notice'. All this to see I don't just hate the actress or the genre, but still, this looks even worse than their normal original slop. ",
        "upvotes": 116,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ce5c/doubting_the_authenticity_of_the_top_10_list/"
    },
    {
        "id": "1j44a6s",
        "author": "Pogrebnik",
        "title": "Millie Bobby Brown Confirms 'Enola Holmes 3' Filming Start Window",
        "content": "",
        "upvotes": 208,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1j44a6s/millie_bobby_brown_confirms_enola_holmes_3/"
    },
    {
        "id": "1j4xo5q",
        "author": "Somethingman_121224",
        "title": "Netflix's 'Karma' Confirms April Premiere",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4xo5q/netflixs_karma_confirms_april_premiere/"
    },
    {
        "id": "1j4wrom",
        "author": "MysteriousDelay6266",
        "title": "Bet Your Life | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4wrom/bet_your_life_official_trailer_netflix/"
    },
    {
        "id": "1j4xtkl",
        "author": "chrisdh79",
        "title": "Netflix follows Paul vs. Tyson fight with another boxing stream in July | The rematch between Amanda Serrano and Katie Taylor will air exclusively on Netflix on July 11th.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4xtkl/netflix_follows_paul_vs_tyson_fight_with_another/"
    },
    {
        "id": "1j3z2f4",
        "author": "S4v1r1enCh0r4k",
        "title": "Ezra Edelman Slams Netflix for Scrapping His 9-Hour Prince Documentary. Says that Netflix and Prince's estate won't release it since it could \"do generational harm to Prince\"",
        "content": "",
        "upvotes": 250,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1j3z2f4/ezra_edelman_slams_netflix_for_scrapping_his/"
    },
    {
        "id": "1j4x8mm",
        "author": "outremer_empire",
        "title": "Oscar's Drive to Survive bingo card",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4x8mm/oscars_drive_to_survive_bingo_card/"
    },
    {
        "id": "1j4w6wu",
        "author": "tomatoketchupchips",
        "title": "Will my Standard plan work internationally?",
        "content": "I currently reside in the United States and have the Standard with ads plan, which I heard doesn’t work in certain regions. I plan to be in Dubai this summer, and was wondering if Netflix will work if I upgrade to the Standard plan without ads. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4w6wu/will_my_standard_plan_work_internationally/"
    },
    {
        "id": "1j3y8l9",
        "author": "AnagnorisisForMe",
        "title": "With Love Meghan thoughts...",
        "content": "Posting this with great trepidation as I am not a bot (and I'm really hoping I have enough karma points after all the downvotes that I don't get kicked off Reddit). I think there are good parts of the With Love Meghan series. The episode with Roy Choi is in particularly good as the Korean sauces and cooking techniques are interesting as is his brining technique. The series is not exactly Carl Sagan, but that it is not what the intention is. If you want light background entertainment, give With Love Meghan a chance.",
        "upvotes": 227,
        "comments": 182,
        "media": null,
        "permalink": "/r/netflix/comments/1j3y8l9/with_love_meghan_thoughts/"
    },
    {
        "id": "1j4t3e9",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix's New YA Horror Series 'Wish Your Death'  reveals cast",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4t3e9/netflixs_new_ya_horror_series_wish_your_death/"
    },
    {
        "id": "1j4esbn",
        "author": "renis_h",
        "title": "New addition to Netflix: The Leopard",
        "content": "Just wanting to shine a spotlight on a Netflix show that I really think deserves more eyes on it in The Leopard. For those that don't know, this is based on an Italian 1963 film of the same name, that more or less follows the story of the Italian uprising, and documents how the rich are able to hold onto their power and position even after large scale upheaval. \n\nThis is definitely worth the watch, and I am surprised that Netflix is just digging out these old films that no one expects them to remake and actually does a really good job of recreating them. While I have been in a slump with netflix at the moment, this is definitely a show that's worth the watch.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j4esbn/new_addition_to_netflix_the_leopard/"
    },
    {
        "id": "1j4na94",
        "author": "Life-Aardvark-8262",
        "title": "Help with profile transfer?",
        "content": "Im still on my parents’ Netflix account and I live on my own as I’m out of college. Almost nightly, I am prompted to update our account’s household because my parent watch at their house and I watch at mine. Today, I went through the update household prompts which i normally have text a link to my phone. But not matter how many times I try, I did not receive a link to update the household. What is going on here? \n\nSeparately, I set myself up as an “extra member on my parents account, which allowed me to access the content, but not of the shows i have been watching pop up because it is a new profile. Is there a way to transfer my old profile data (shows, recommendations, etc) to my new “extra member” profile? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4na94/help_with_profile_transfer/"
    },
    {
        "id": "1j4jrrv",
        "author": "Necessary_Article410",
        "title": "“Murder doc”?",
        "content": "Does anyone know a good “murder” or kidnapping doc where the actual victim of the crime is in it? I have been searching around for one like that and cannot find it. I like the ones that have “American murder” or “cold case” but i just want to find one with 1st story accounts from the victim! please let me know if someone knows one.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jrrv/murder_doc/"
    },
    {
        "id": "1j4iasz",
        "author": "Alan_Stamm",
        "title": "'The Leopard:' Lavish new series based on 1958 novel is 'a withering takedown of society's flaws and hypocrisies that still hits home today'",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j4iasz/the_leopard_lavish_new_series_based_on_1958_novel/"
    },
    {
        "id": "1j4s0w8",
        "author": "FiammaEvans",
        "title": "Someone transferred their profile without entering my account",
        "content": "As per title someone with what seemed like a legit gmail transferred their profile (ms. \"Assunta\", italian name, as im in italy) from my account to theirs and netfix created a copy of that profile (as per their email) that i can continue to use. \n\nI haven't clicked anything on it and checked directly in app and the \"assunta\" profile was there as they said. I deleted it, changed password and disconnected all devices from the old one, so im pretty safe. \nI just wanted to know how something like that could happen, they didnt even try to change email. They just transferred out. \n\n\nIt's like someone exiting your house without even entering. \n\nI don't know any Assunta around me, and all my old family that was in before \"the sharing purge\" said they didn't do anything, not even transferring their own profile.\n\nAnd i'm sure nobody entered from a new device since netflix sends me an email for it everytime. \n\nI have a basic plan.. i mean enjoy your HD+ADV profile, i guess?\n\nIt's so weird.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j4s0w8/someone_transferred_their_profile_without/"
    },
    {
        "id": "1j4ix8x",
        "author": "Domino_USA",
        "title": "\"A Secret Love\" Netflix Documentary",
        "content": "Does anyone know if it is possible to purchase the Netflix documentary \"A Secret Love\" on DVD or is there a streaming service that carries this documentary that allows downloads for purchase, such as Amazon? I am having trouble finding a copy of the documentary available for purchase outside of streaming on Netflix.  *A Secret Love is* about a lesbian couple who kept their relationship private for nearly 70 years.  It is directed by  Chris Bolan and is a portrait of his great-aunt, Terry Donahue, and her relationship with her partner, Pat Henschel.  Henschel was also a member of the All American Girls Professional Baseball League Players Association which the movie \"A League of Their Own\" is based on.  The documentary is one hour and 20 minutes.  The couple were eventually married and one of them, if not both, have passed on now.  They faced anti-gay bigotry throughout their lives.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4ix8x/a_secret_love_netflix_documentary/"
    },
    {
        "id": "1j4mmng",
        "author": "thomasa_starr86",
        "title": "Travel Option",
        "content": "I’m having trouble trying to send myself my travel code. When I get to the I’m traveling screen, it won’t let me click, SEND CODE. I’ve tried on a fire tv stick and Xbox, same issue! What is happening!?!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mmng/travel_option/"
    },
    {
        "id": "1j4mhm6",
        "author": "RickGrimes30",
        "title": "Why is the aspect ratio of Escape from Pretoria so strange, the top bar is twice as thick as the bottom one..",
        "content": "I checked a couple of other movies and they look normal ",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yo69q9sspzme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j4mhm6/why_is_the_aspect_ratio_of_escape_from_pretoria/"
    },
    {
        "id": "1j4mbf1",
        "author": "mybelovedkasa",
        "title": "help me find this series 😭",
        "content": "It was on Netflix Philippines. It wasn’t an American show. The dub was obvious. I think it’s from a Slavic country? The two main characters were two girls, they were in school. Can’t quite remember what level. There were also two love interests. One was a photographer. Can’t remember the other one though. There was a side character that one of the main female characters almost got with. He was a goth slash delinquent of some sort? There was a scene where her and the goth guy made out in a closet of some sort, then got an electric shock. I don’t think it’s from anything earlier than 2010s. I watched it around 2018-2020 i think? It was made for a young audience 😭 Pls help! I think one of the main characters was a fashion student?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j4mbf1/help_me_find_this_series/"
    },
    {
        "id": "1j41axh",
        "author": "Robemilak",
        "title": "'Bullet Train Explosion' Gets a Teaser Trailer, Releasing April 23",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j41axh/bullet_train_explosion_gets_a_teaser_trailer/"
    },
    {
        "id": "1j4c67u",
        "author": "S4v1r1enCh0r4k",
        "title": "Sam Worthington to Star in Netflix’s New Thriller 'I Will Find You'",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j4c67u/sam_worthington_to_star_in_netflixs_new_thriller/"
    },
    {
        "id": "1j4jvp2",
        "author": "Elborshooter",
        "title": "Student issues",
        "content": "I've seen lots of students on the sub being annoyed that they had trouble with watching netflix on their parents account while away.\n\nHere's my problem : I pay for my own account (way too much might I add), but this year I'm in a different country and coming back to the \"household\" is absolutely out of the question. I got a message saying I have 14 days to get back to the household if I want to be able to continue to watch netflix.\n\nWhat can I even do at this point ? (Apart from cancelling my subscription to what is slowly becoming a massive scam)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j4jvp2/student_issues/"
    },
    {
        "id": "1j47eaj",
        "author": "luvlils",
        "title": "Shows not showing up",
        "content": "Is anyone else experiencing shows are not showing up on my tv for Netflix where im not able to see gossip girl for example it shows as remind me but when I go into the app its there for me to watch. Its the same with switching profiles everything is there except for the shows on my profile",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j47eaj/shows_not_showing_up/"
    },
    {
        "id": "1j43viw",
        "author": "Atlast_2091",
        "title": "How to Sell Drugs Online (Fast): The Final Season | Official Trailer",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j43viw/how_to_sell_drugs_online_fast_the_final_season/"
    }
]