[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jpqjpy",
        "author": "dailystar_news",
        "title": "Bodybuilder Netflix star dies 'on treadmill at gym' day after chilling selfie",
        "content": "",
        "upvotes": 557,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1jpqjpy/bodybuilder_netflix_star_dies_on_treadmill_at_gym/"
    },
    {
        "id": "1jq5mz1",
        "author": "Emergency-Message424",
        "title": "Secret millionaire show",
        "content": "This show is okay but man what’s the purpose of guessing the millionaire? Right or wrong there’s no consequence or reward. You’re better off just getting rid of the strongest competitors like any other show..",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jq5mz1/secret_millionaire_show/"
    },
    {
        "id": "1jpki86",
        "author": "Aman_S7",
        "title": "Con Mum",
        "content": "I know this is the millionth post on con mum but I just saw it last night and WTF? I do NOT feel bad for Graham, after a point I couldn’t. He left heather and his NEW BORN alone and says it was for the betterment of their family, I think it may have been at first but after that he lost the plot on why he was actually in Switzerland with Dionne. Iirc it’s not been revealed right how Dionne was able to make all the hotel staff, concierge and lawyers work with her? I felt so so infuriated for heather, that poor woman. ",
        "upvotes": 75,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1jpki86/con_mum/"
    },
    {
        "id": "1jqd0rq",
        "author": "kaylasiar",
        "title": "Resetting episodes?",
        "content": "Is there a way that I can reset **all episodes** of a watched series from the beginning? I know that I am able to remove the entire show/movie from the recently watched section by hiding it completely, but looking to have the show appear as if it was never watched. \n\n  \nThank you :) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jqd0rq/resetting_episodes/"
    },
    {
        "id": "1jpxk4x",
        "author": "Tragickingdom555",
        "title": "Million Dollar Secret",
        "content": "Why is it that on every game show like this contestants always get angry/whine about contestants breaking their trust and that “we can’t trust you, how can you do this to me/us?”\n\nDo people think Lauren was not going to play the game and come out and say guys I want to be honest I am the millionaire. The whole premise is to lie and be deceitful to win a million. You can’t win by being honest the entire time. But over and over again I see the same thing on every game show contestants getting mad that people lie on a game about lying. 😂 Traitors and The Mole are some other shows that do this.\n\nI’m on episode 3 so no spoilers please. 😬",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jpxk4x/million_dollar_secret/"
    },
    {
        "id": "1jq9pn8",
        "author": "slUrp_aaaaaaa",
        "title": "Talk To Me question",
        "content": "!!!!!!!!!!!SPOILERS!!!!!!!!!!!!!!\n\nOkay so as the title says this post is about the new Netflix movie Talk To Me. I guess it’s really not like a question itself about the movie but just a dumb question me and my friend asked.\n\nSo when the kid smashes his head in and they’re all like “don’t let the police know they’re already sus about duckett”… is it like if you get someone haunted(?) and the person becomes violent and kills someone else would you be at fault for convincing them to get taken control of by the spirits? Like the same way if you give someone alcohol and they start drunk driving ur kinda at fault for it? I don’t know that was just like our thoughts.\n\nSorry I know it’s dumb but thanks lol",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jq9pn8/talk_to_me_question/"
    },
    {
        "id": "1jpow8y",
        "author": "intelerks",
        "title": "'Once Upon a Time in Hollywood' sequel on Netflix: David Fincher helms film written by Quentin Tarantino starring Brad Pitt",
        "content": "David Fincher is set to direct a sequel to *Once Upon a Time in Hollywood*, with Quentin Tarantino penning the script for the follow-up to his Academy Award-winning film. The project, confirmed by *Variety*, does not yet have an official title but is being developed at Netflix, where Fincher holds a first-look deal. Brad Pitt will reprise his role as Cliff Booth, the stuntman with a dark past. ",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jpow8y/once_upon_a_time_in_hollywood_sequel_on_netflix/"
    },
    {
        "id": "1jpze2z",
        "author": "MysteriousDelay6266",
        "title": "Race For the Crown | Official Trailer | Netflix | APRIL 22",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpze2z/race_for_the_crown_official_trailer_netflix_april/"
    },
    {
        "id": "1jpfm2h",
        "author": "anymoose",
        "title": "Did they change the algorithm?",
        "content": "I swear 50% of my \"recommendations\" lately are for things I've already watched and rated. Any way to stop that?\n\nI don't mind seeing the occasional \"watch it again\" feed but things I've already rated should not be in \"we think you'll love this!\" or in any category with the word \"new\" in the title....",
        "upvotes": 31,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfm2h/did_they_change_the_algorithm/"
    },
    {
        "id": "1jq5rvr",
        "author": "Cheap_Acanthaceae_70",
        "title": "Did anyone else think",
        "content": "It was completely unnecessary to show the kids of the Long Island serial killer? They were victims in their own rite. Wild to continuously show their faces during the final episode only for them to face even more scrutiny than they already are. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jq5rvr/did_anyone_else_think/"
    },
    {
        "id": "1jp921p",
        "author": "Dommichu",
        "title": "'Adolescence' co-creator says 'maybe we're all accountable' for youth violence",
        "content": "Fabulous interview with Stephen Graham on the development and filming of Adolescence!  Like… I was in complete awe in the scene shot at the school!  Post Covid, to see so many extras in a scene and how natural and flowing it all went with so much going on!  Turns out a lot of the extras went to that school!  What pros!  \n\nWorth a listen to learn about the show and Stephen himself.  ",
        "upvotes": 54,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jp921p/adolescence_cocreator_says_maybe_were_all/"
    },
    {
        "id": "1joz0iv",
        "author": "-Xoz-",
        "title": "Adolescence to be shown in UK schools for free as British PM Keir Starmer meets creators",
        "content": "",
        "upvotes": 179,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1joz0iv/adolescence_to_be_shown_in_uk_schools_for_free_as/"
    },
    {
        "id": "1jpvy5j",
        "author": "BreadfruitNo9500",
        "title": "Brooklyn 99",
        "content": "A bit back Netflix took off seasons one through three of Brooklyn 99 and added season five and six. I know there are more seasons but the aren’t on Netflix. Will they be adding the seventh season soon? Like is there any announcement or something like that?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpvy5j/brooklyn_99/"
    },
    {
        "id": "1joqfkr",
        "author": "Salt-Lake5807",
        "title": "I just finished the Adolescence",
        "content": "As a father of a boy and a daughter (both under 12yr) this serie really hit me hard. Especially third third and the fourth episode. Jamie being interviewed by the therapist was something I've never seen before. You can feel the rage and anger the boy is holding inside of himself. The acting was just perfect.\n\nThe final episode blew me away. When Jamie called and said that he's gonna plea guilty I just stopped breathing. The reactions of the parents and the sister were so real and heartfelt. \n\nI started to cry at the end of the final episode when Lisa (sister) came and said \"Jamie is ours\".  As the dad went to Jamie's room I was blubbering. I'm still weeping as I'm writing this.\n\nNever ever has a movie or a serie made me feel so much. Made me think about my own kids and the world they're living. ",
        "upvotes": 509,
        "comments": 282,
        "media": null,
        "permalink": "/r/netflix/comments/1joqfkr/i_just_finished_the_adolescence/"
    },
    {
        "id": "1jq0btf",
        "author": "AIONisMINE",
        "title": "stupid question.... but just want to make sure. Cancelling netflix while having a netflix credit balance.",
        "content": "i have a significant netflix credit balance due to giftcard.\n\ni dont have any other payment method attached to my netflix account.\n\nwill there be any issues if i were to cancel my netflix subscription?\n\nmy netflix credit will still be there untouched until i decided to subscribe again, correct?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jq0btf/stupid_question_but_just_want_to_make_sure/"
    },
    {
        "id": "1jq57vf",
        "author": "Extension_Bit4323",
        "title": "Why does Netflix cancel so many shows?",
        "content": "V wars, Travelers and others I've watched but can't remember. Also read that the OA was cancelled. Sounds interesting but I don't want to get into it. \n\nEverytime I find a show I find interesting and get into just to look it up only to find out it's been cancelled. Most of the time after one season. I didn't even finish watching First Kill, after two episodes I found out it's been cancelled.\n\nWhy do this? It's not even about views sometimes, some shows get tons of views but they still get cancelled.",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1jq57vf/why_does_netflix_cancel_so_many_shows/"
    },
    {
        "id": "1jq3h29",
        "author": "dasnotpizza",
        "title": "Netflix Modifying Release Dates Based on Subscription",
        "content": "I rotate through subscription services to save money, so a couple of weeks ago, I cancelled my Netflix subscription because there wasn't anything interesting coming up on their \"Coming Soon\" section. I was supposed to have access until April 3rd. Love on the Spectrum comes up saying a new season will be released April 2, so I planned to binge the season while I had access that day since it was my day off. When I checked Netflix this morning, it said the new season was being released April 3, so I figured I got my dates wrong. I decided to renew my subscription since there's a new season of Black Mirror coming out in a couple of weeks, and as soon as I did that, I suddenly have access to the newest season of Love on the Spectrum. Has anyone else experienced something similar? It's a clever move, and probably something we'll see more with AI using viewers preference data.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jq3h29/netflix_modifying_release_dates_based_on/"
    },
    {
        "id": "1jpolyg",
        "author": "Somethingman_121224",
        "title": "Finn Wolfhard Says Filming 'Stranger Things' Season 5 Was \"Super Emotional\"",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jpolyg/finn_wolfhard_says_filming_stranger_things_season/"
    },
    {
        "id": "1jpoau6",
        "author": "indiewire",
        "title": "Finn Wolfhard Teases 'Stranger Things' Final Season",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpoau6/finn_wolfhard_teases_stranger_things_final_season/"
    },
    {
        "id": "1jq68fr",
        "author": "seethatocean",
        "title": "Adolescence - Lessons for women and young girls",
        "content": "Here we go: \n\n1. Do not send your nudes to random immature school boyfriends. Guard your nudes like your bank account deets or social security number. \n\n2. If a super creepy guy asks you out, turn him down clearly but nicely. Don't use words like \"I am not desperate\" even when the guy is full-on creep festival. Don't anger it. Say something like your parents are conservative and want you to focus on your studies for now etc. \n\n3. Even when the creep is a Certified Baby Incel, don't call it by that name. Even when you go on his Instagram and see that he has left aggressive comments below pictures of models, that doesn't mean you are entitled to comment on him. His bullying is justified. Your bullying will justify your murder. So just leave him alone. Reduce your own social media use. \n\n4. Don't roam around lonely places alone at night. You want to hang out, do that in a bustling park or food market where many grown-ups and and families are around. So if the freak tries to stab you, there is at least a possibility that you will get help. \n\n5. If you are an older woman with a aggressive husband (like the mom in the show), don't procreate. If you cannot stand up for yourself and are just going to passively live life like a doormat, at least don't propogate this toxic behavior by having his kids.\n\nAnything else? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jq68fr/adolescence_lessons_for_women_and_young_girls/"
    },
    {
        "id": "1jpktte",
        "author": "Slamboi83",
        "title": "something Gripping",
        "content": "Get based in UK as suddenly feel like I watched almost everything but obviously that will be impossible so if anyone has any good advice on something new to watch that I might have scrolled right past and thought looking at it won’t enjoyed as ready to have my mind changed. Looking for something gripping and that I can hopefully want to sit and watch it all as have week off and bored ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpktte/something_gripping/"
    },
    {
        "id": "1jpsqj3",
        "author": "abhilash512",
        "title": "Big Return post WWE WrestleMania 41",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpsqj3/big_return_post_wwe_wrestlemania_41/"
    },
    {
        "id": "1jpyiel",
        "author": "urmomiskindafruity",
        "title": "Brad Pitt as an executive producer in Adolescence.",
        "content": "I literally just saw the credits in the beginning of episode four and realized Brad Pitt is an executive producer. \n\nI love Adolescence and think that it is an incredible and much needed show. Masculinity, male power and abuse is the prominent theme in the show. And I just cannot fathom why a rich, powerful man, who has a history of physical and mental abuse against his kids and spouse. \n\nNot a single article I saw mentioned this and I am just genuinely off put. Does anyone have any thoughts?",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jpyiel/brad_pitt_as_an_executive_producer_in_adolescence/"
    },
    {
        "id": "1joqis7",
        "author": "Loose_Clock609",
        "title": "Gone Girls: The Long Island Serial Killer' - Are the cops morons or just in on it?",
        "content": "Why was the docuseries made? We literally learned nothing new about the case or the victims. \n\nI don't believe the cops are this incompetent. It's impossible for any police department this large to be so stupid. With all the technology we have available, how are these cases still so unsolved or at least identify the victims. Either a cop did it or some rich guys with kinks pay them to look the other way\n \nIt's definitely more than one killer in the area. I wouldn't go from burlap sacks to dismemberment to just random dumpings... Rex isn't the only killer. \n\nI thought the documentary would answer big questions like, who are the other victims? Who is the baby? Who was the male? Nope...\n\nAnd if I hear the journalist says she's shocked again... \n\n ",
        "upvotes": 47,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1joqis7/gone_girls_the_long_island_serial_killer_are_the/"
    },
    {
        "id": "1jpfw8x",
        "author": "Due_Doughnut7352",
        "title": "Downloads almost always tell me that “this is the end of the download” despite being 100% downloaded.",
        "content": "Can’t find anyone that asked about this so i’m asking here. I’m on IOS (Iphone 14) and am trying to watch the Good Place. Now I downloaded all of season one but every time I would go to watch it, despite telling and showing the episode as fully downloaded, usually 5-10 minutes into the episode an error message would show up indicating that I only downloaded up to that point. Please help, it’s so gd annoying 😭 thanks in advance ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfw8x/downloads_almost_always_tell_me_that_this_is_the/"
    },
    {
        "id": "1jpb0ae",
        "author": "CrimsonRaven7",
        "title": "Show disapearing on home wifi but reapearing on data and on other wifi networks",
        "content": "My sisters netflix (doesnt have reddit) suddenly stopped allowing her to watch Grays anatomy on nextflix while connected to our home wifi (spectrum). Turning off Wi-Fi on her phone makes it show back up. It shows  on wifi other than our own and on data. Anyone know why?\n\nEdit:. My mothers works fine and shows Grays. My sisters phone and laptop do not show Grays. If she connects to any other wifi Grays comes back.  Seems like something is causing her account on this specific wifi to not show Grays. No other shows disapear that she can tell. Its really weird",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jpb0ae/show_disapearing_on_home_wifi_but_reapearing_on/"
    },
    {
        "id": "1jp96py",
        "author": "Roxith",
        "title": "Netflix Removed Qin Empire Alliance Season 1?",
        "content": "I watched Qin Empire season 1 on Netflix and it was so good. I wanted to go back to it but now see that only season 2 is there. What happened? How can I get back to it? Or is it gone forever?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp96py/netflix_removed_qin_empire_alliance_season_1/"
    },
    {
        "id": "1jpomzo",
        "author": "Fritja",
        "title": "The Hard Sell of Meghan’s Soft Life",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpomzo/the_hard_sell_of_meghans_soft_life/"
    },
    {
        "id": "1jozl4t",
        "author": "McNasty420",
        "title": "This day in history- Will Arnett narrates Netflix Live",
        "content": "This was from April Fools many years ago, I can't remember when exactly.  It is Will Arnett narrating video of an office.  The funniest thing ever. \n\n[https://www.youtube.com/watch?v=ZbsRwH2jbac](https://www.youtube.com/watch?v=ZbsRwH2jbac)",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jozl4t/this_day_in_history_will_arnett_narrates_netflix/"
    },
    {
        "id": "1joq985",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 15,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1joq985/cancelled_shows/"
    }
]