[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h2nmem",
        "author": "bunaventure",
        "title": "Does everyone mute their TV when navigating Netflix?",
        "content": "Surely everyone dislikes the auto-preview feature as much as me? Either I have to flip back and forth, not staying on any one item too long, or I simply mute my TV. I feel like both spoil the experience a bit and I'm shocked Netflix hasn't done anything to tone it down. I get that they have their reasons, but it's awful.\n\nIs everyone else less bothered or what? I figure it would have changed by now if everyone dislikes the auto-preview as much as me. Google TV version btw - but I'm pretty sure it's implemented on most Netflix apps..",
        "upvotes": 67,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1h2nmem/does_everyone_mute_their_tv_when_navigating/"
    },
    {
        "id": "1h24oeh",
        "author": "techfinpro",
        "title": "Netflix Issues New Adults-Only Warning for ‘Stranger Things’ Ahead of Season 5",
        "content": "",
        "upvotes": 329,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1h24oeh/netflix_issues_new_adultsonly_warning_for/"
    },
    {
        "id": "1h2idcy",
        "author": "LetterheadFun3697",
        "title": "Three Years After Cancellation, 'A.P. Bio' Continues To Dominate Netflix Charts",
        "content": "",
        "upvotes": 26,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h2idcy/three_years_after_cancellation_ap_bio_continues/"
    },
    {
        "id": "1h2m4ta",
        "author": "Automatic-Attorney96",
        "title": "My fav relationships",
        "content": "",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h2m4ta/my_fav_relationships/"
    },
    {
        "id": "1h2mc49",
        "author": "Dependent-Internal37",
        "title": "Anyone else watched or watching The Later Daters?",
        "content": "Would love to get the community’s thoughts on The Later Daters show which just dropped on Netflix. Understand it’s a reality show, but would appreciate to hear people’s thoughts - good or bad! I’m personally smitten by their candour and as a single person in my 30s they’ve motivated me not to give up.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h2mc49/anyone_else_watched_or_watching_the_later_daters/"
    },
    {
        "id": "1h1x1rm",
        "author": "S4v1r1enCh0r4k",
        "title": " China censored LGBT Scenes in Arcane Season 2, the scenes west saw were starkly different ",
        "content": "",
        "upvotes": 219,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1h1x1rm/china_censored_lgbt_scenes_in_arcane_season_2_the/"
    },
    {
        "id": "1h2p80a",
        "author": "MovieGuyTravis",
        "title": "Thrilling Official Trailer for Netflix’s Missing You",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2p80a/thrilling_official_trailer_for_netflixs_missing/"
    },
    {
        "id": "1h2nfjh",
        "author": "Mental-Summer-9831",
        "title": "Can't find the same shows as my kid?",
        "content": "My household has a family account with a profile for each family member.\nMy oldest kid is really into anime and I want to watch a few of her favorite shows.\n\nHowever - when I search for the shows from my profile, they don't show up. \nShe has a 16 yo age restriction, I have none.\n\nI know we will get different recommandations based on our watch history, but not being able to find the show? Is that a thing? \nShouldn't I be able to access the same shows as her?\n\nI have reached out to the support chat, but their suggestion was to restart my phone, which didn't work.\n\nAny tips or even explanations?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2nfjh/cant_find_the_same_shows_as_my_kid/"
    },
    {
        "id": "1h2k9ee",
        "author": "Nearby-Olive2048",
        "title": "Very bad app",
        "content": "Every time i use twitch on my smart tv then this shit netflix app doesent work and i need to uninstall and install the netflix app wtf is going on? Very bad app on smart tv. \n\n\nI am very close to end the subscription. \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2k9ee/very_bad_app/"
    },
    {
        "id": "1h2h42x",
        "author": "biggs1199",
        "title": "Rhythm and flow ",
        "content": "If this season was going to be this terrible they should have just canceled the series. That’s the thing that pisses me off about Netflix, when a series deserves to be cancelled they don’t and when a series doesn’t deserve to be cancelled it is. Im still trying to figure out why KAOS was cancelled…",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h42x/rhythm_and_flow/"
    },
    {
        "id": "1h27ixu",
        "author": "443610",
        "title": "How “Senna” meticulously recreated every detail of F1 legend's life - from cars to racing suits",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h27ixu/how_senna_meticulously_recreated_every_detail_of/"
    },
    {
        "id": "1h2ga9g",
        "author": "shakha",
        "title": "Have there been any updates on Mo season 2?",
        "content": "This show is difficult to look up info on. I googled it and accidentally spent quite a bit of time reading about The Mole! So, where is season 2? When is it coming?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h2ga9g/have_there_been_any_updates_on_mo_season_2/"
    },
    {
        "id": "1h2iuea",
        "author": "ChestIcy9105",
        "title": "Did they downgrade vid quality?",
        "content": "I am using ad sub and it is unwatchable. What is going on with Netflix? I feel like they are intentionally downgraded vid quality for some reason. This is 720p at best.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h2iuea/did_they_downgrade_vid_quality/"
    },
    {
        "id": "1h2deqa",
        "author": "Fluffy-Isopod7469",
        "title": "How do I  get Netflix to work at a second home? Need help ",
        "content": "So I read that you had to go to the primary home, sign into Netflix at that home from the Wi-Fi with your phone, stream something, then go back to the second home, stream something on that homes Wi-Fi, then it should work on the TV.\n\nWell I did that and it’s still showing “This TV isn’t apart of your Netflix household” on my TV.\n\nHow the hell do I fix this?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h2deqa/how_do_i_get_netflix_to_work_at_a_second_home/"
    },
    {
        "id": "1h2cuuf",
        "author": "spookysteely",
        "title": "Ads don't play unless Netflix tab selected?",
        "content": "I just noticed something weird today on my laptop. When an ad is playing and I click off the tab, netflix auto pauses the content, and doesn't begin playing it again until I manually press play in the tab again. \n\n  \nIt doesn't auto-pause actual content when I click off the tab, just the advertisement. Has anyone else noticed this? Was this a new change just added?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h2cuuf/ads_dont_play_unless_netflix_tab_selected/"
    },
    {
        "id": "1h2k0zn",
        "author": "Legitimate_Ad5436",
        "title": "I made a horrible Fandango and Netflix rip-off",
        "content": "(Also why would I put ® or © this is a fake company bruh)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h2k0zn/i_made_a_horrible_fandango_and_netflix_ripoff/"
    },
    {
        "id": "1h19gp5",
        "author": "TheLaraSuChronicles",
        "title": "Netflix kids' movie, Spellbound slammed by parents for 'normalizing' divorce and 'pushing for family separation'",
        "content": "",
        "upvotes": 318,
        "comments": 127,
        "media": null,
        "permalink": "/r/netflix/comments/1h19gp5/netflix_kids_movie_spellbound_slammed_by_parents/"
    },
    {
        "id": "1h1zk63",
        "author": "ontario-guy",
        "title": "Kids missing almost all shows?",
        "content": "I’m not sure if it’s an issue with my Firestick or Netflix…when I loaded it up this morning there was the 5 featured shows, one row of shows, and then just a row of kids characters. I think there were only like 10 different shows and the search wouldn’t bug up the shows that were there yesterday. It’s the same in iOS.\n\nAnyone else seeing issues like this? I can’t imagine Netflix is intentionally removing 90%+ of their kids shows. (I’m in Canada FWIW)",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h1zk63/kids_missing_almost_all_shows/"
    },
    {
        "id": "1h1p1d2",
        "author": "JinJaDubstep",
        "title": "Best ACTUALLY SCARY movies on Netflix currently?",
        "content": "What are some of the best actually scary movies on Netflix currently? Not a fan of slow burn movies or creepy movies. looking for movies with a lot of \"scary\" parts (ie - conjuring 2, smile 2, evil dead rise)",
        "upvotes": 25,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h1p1d2/best_actually_scary_movies_on_netflix_currently/"
    },
    {
        "id": "1h26ddn",
        "author": "Romulo_und_Remo",
        "title": "Can I change my icon to one from the Profile Icon history?",
        "content": "I want to change mine to one from Arcane but I'm currently using the Dedenne icon and I don't want to lose it since the Pokemon Concierge icons are not available anymore. Would I be able to pick it from my history?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h26ddn/can_i_change_my_icon_to_one_from_the_profile_icon/"
    },
    {
        "id": "1h2gb2w",
        "author": "fufa_badmash",
        "title": "Comment Section on Netflix?",
        "content": "What if Netflix added comment section like YouTube where viewers could leave comments on individual episodes, movies, or entire series, similar to YouTube?\n\nImagine the possibilities:\n\n* Fans could discuss their favourite scenes, share theories, and point out Easter eggs.\n* Mini-reviews and recommendations would help you decide what to watch next.\n* Community-driven conversations could make Netflix feel more interactive and social.\n\nBut... there’s also the downside:\n\n* Spoilers everywhere!\n* Would it distract from the “lean-back” streaming experience Netflix is known for?\n\nWould this be a game-changing feature or just unnecessary noise?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h2gb2w/comment_section_on_netflix/"
    },
    {
        "id": "1h1m7ro",
        "author": "beeemmvee",
        "title": "Buy Now!",
        "content": "Wow.\n\nI knew some of this but had no idea how far it actually went. The slime of humanity is truly revealed. \n\nThis is a must see for every human consumer on the planet. \n\n  \n",
        "upvotes": 31,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h1m7ro/buy_now/"
    },
    {
        "id": "1h2h0r6",
        "author": "billiondollartrade",
        "title": "Why tf does Netflix keep making good as shows just to cancel the dam show 2 seasons later ! ! And then allow the trash shows to go for seasons on seasons! ",
        "content": "For the Love of God, so many shows that are actually good and they just be dropping those but “ oh no let’s keep the trash show about some stupid comedy or sx “ anything damn sex related is all they give a fck about. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1h2h0r6/why_tf_does_netflix_keep_making_good_as_shows/"
    },
    {
        "id": "1h235la",
        "author": "ok_raspberry_jam",
        "title": "Funny spelling mistake on \"Ransom\" description",
        "content": "\"A skilled crisis and hostage negotiator uses his knowledge of human behavior to **DIFFUSE** dangerous situations all over the world.\"  \n  \nAll over the whole world! Like a fine mist. Someone stop this man.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h235la/funny_spelling_mistake_on_ransom_description/"
    },
    {
        "id": "1h279h6",
        "author": "RidleyMCI",
        "title": "Netflix Payment Method changed without my knowledge",
        "content": "Has anyone ever had their Netflix payment method change to someone else’s they know for seemingly no reason?\n\nSo I was going through my finances and realised I hadn’t been charged for Netflix in quite some time, but I’ve been using it no problem. I log on to my account on the website and the payment method is a card I don’t recognise. As far as I knew, I hadn’t been hacked. \n\nThe only thing I could think of is that a while ago, I logged out of my Uncle’s Netflix account on his smart TV, and into my own. I then went into my emails and found an email I missed that said my payment details had been changed, around 2 weeks after I logged into my uncle’s TV. I didn’t think he could’ve done it because he’d have needed my password to change the payment method, as I don’t think you can do it in the TV app and I didn’t write my password down anywhere. But when I called him, he confirmed it was his card. He hasn’t been paying for double Netflix or anything, he didn’t even notice. I have no idea how this has happened. \n\nMy uncle is not a tech genius in the slightest so I genuinely don’t think he would’ve been able to hack my password, nor do I think he would try to do that. I’m just concerned that mine and/or his details have been compromised. Is there an explanation for this? Could he have changed the payment details without my password without realising he was logged into my account? \n\nEdit: I should also say that the only reason this flagged to me is that I stopped paying for my Netflix several months ago as I barely used it, only to log onto to find it was working again. And that’s when I discovered the unfamiliar bank details that turned out to be my uncle’s.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h279h6/netflix_payment_method_changed_without_my/"
    },
    {
        "id": "1h2cei5",
        "author": "No_Significance_573",
        "title": "Are people really able to just download a movie or show right off Netflix?",
        "content": "I see that button for download but didn’t think that literally meant “since you have this subscription you can just download what you’re watching onto your current device.” Is it?\n\n  \nI saw a quick comment saying it may depend on the plan you have(?) or it doesn’t work like that anymore, but it seems odd that you could let’s say download a movie that would otherwise be leaving Netflix but you now have it on your device. Like is that what’s really happening? I always wondered.",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1h2cei5/are_people_really_able_to_just_download_a_movie/"
    },
    {
        "id": "1h1tvbh",
        "author": "bore-ito",
        "title": "Mortel Season 3??",
        "content": "I don’t think I’ve seen  any recent posts but I’ve been waiting for the new season since 2022 I think. Is there any news on when it’ll come out?? I hope it hasn’t been canceled…\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1tvbh/mortel_season_3/"
    },
    {
        "id": "1h1qocj",
        "author": "Agreeable_Car_9778",
        "title": "How do I watch netflix outside of my home?",
        "content": "So I bought netflix in my country before leaving and right now I am in another country for my studies, but today it suddenly told that since the wifi I use is not same as my household wifi ill only be able to watch netflix for another 14 days on mobile before it told me to do something on my home TV which I didn't quite understand, could someone help me I dont quite understand what that means?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h1qocj/how_do_i_watch_netflix_outside_of_my_home/"
    },
    {
        "id": "1h15qyp",
        "author": "healthyF0X",
        "title": "The docuseries My Wife, My Abuser highlights the enormous challenges faced by male victims of domestic abuse",
        "content": "",
        "upvotes": 34,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h15qyp/the_docuseries_my_wife_my_abuser_highlights_the/"
    },
    {
        "id": "1h24xf4",
        "author": "_iamNumberTWO_",
        "title": "Proud of my Top 10",
        "content": "From top, then left to right.\n\nSuggest better TV shows and I shall watch them and see whether any new ones can break my solid 10.\n\nHouse of Cards is by far my top TV show, although Peaky Blinders do have some better seasons in general. Prison Break sits at 4 only because of its very solid first two seasons. Could be replaced with BB.\n\nServant is definitely top 10. Dark could be ranked higher. My 6-10 could actually be mixed up.\n\nLet me know your thoughts?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h24xf4/proud_of_my_top_10/"
    }
]