[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p85gri",
        "author": "pleasestoptalkin",
        "title": "Millie Bobby Brown takes me out of every Stranger Things scene she’s in",
        "content": "I don’t know if it’s the bad acting or the fact she’s a grown woman, who has had work done on her face, playing a little girl, but I just start laughing every time she’s on screen. If David Harbour really did snap at her, I get it because it seems like she stopped trying and their emotional scenes together are really bad. ",
        "upvotes": 1565,
        "comments": 538,
        "media": null,
        "permalink": "/r/netflix/comments/1p85gri/millie_bobby_brown_takes_me_out_of_every_stranger/"
    },
    {
        "id": "1p8i9eo",
        "author": "JustAcivilian24",
        "title": "Stranger Things skipped an episode",
        "content": "Did season 5 skip an episode for anyone else last night? My wife and I were binging it last night and it went from episode 2 right to episode 4. Didn’t know until episode 4 was finished so we brought up the episodes and the show just straight up skipped episode 3. ",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1p8i9eo/stranger_things_skipped_an_episode/"
    },
    {
        "id": "1p8pngo",
        "author": "ThePale99",
        "title": "Train Dreams",
        "content": "Watched Train Dreams and I wasn't expecting much but heard good things here and there and it hit me hard how incredibly Beautiful it is it's truly something special.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8pngo/train_dreams/"
    },
    {
        "id": "1p85fl1",
        "author": "Worried-Struggle2788",
        "title": "Anything on Netflix similar to Mr. Robot",
        "content": "I just finished rewatching Mr. Robot and it reminded me how good that style of show is. The mix of tech, paranoia, social commentary, and all the weird psychological stuff hits different compared to most series out right now.  \n  \nI checked Netflix but their recommendations felt kind of random and not really in the same vibe. Before I start scrolling for an hour, is there anything on Netflix with a similar feel? Something with hacking, underground groups, heavy atmosphere, or that same kind of tension where you never fully know who to trust.  \nI am not expecting a perfect match since Mr. Robot is pretty unique, but anything close in tone or theme would be solid. Would appreciate any suggestions from people who watch the same kind of shows.",
        "upvotes": 63,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p85fl1/anything_on_netflix_similar_to_mr_robot/"
    },
    {
        "id": "1p8m5hz",
        "author": "-H3110_W0R1D-",
        "title": "Thoughts on Stranger Things 5?",
        "content": "I'm only two episodes in as of now, but I think it's pretty great. Of course there's the inevitable time-skip to compensate for the actors aging, but I don't really see it as that big of a deal. I was scared I wouldn't remember anything from the previous seasons considering how long it took, but I guess Stranger Things is just one of those shows where once you pick it back up, you suddenly remember everything. Again, I'm only two episodes in right now, but so far, I like it a lot. It could be that I've been starved of any Stranger Things content for a while now, but it's just nice to watch it again. In episode one I got so scared cause I thought they just killed off Dustin. They for real had me concerned. Besides that, I'm enjoying it. What do you think?",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p8m5hz/thoughts_on_stranger_things_5/"
    },
    {
        "id": "1p875ad",
        "author": "At0micDonut",
        "title": "Stranger Things had the best timing to release the last season and ignored it.",
        "content": "Nov 3rd is when it all started with Will, ep-2's on screen date is nov 3rd. Nov 6th is when they had a big break. Imagine real life dates synced with these dates. It would have been such a cinematic end  \n",
        "upvotes": 29,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p875ad/stranger_things_had_the_best_timing_to_release/"
    },
    {
        "id": "1p8jfur",
        "author": "Material-Dot7684",
        "title": "Is netflix down again?",
        "content": "Netflix gets to 24% then stops loading. Anyone else getting this? Or is it me? I tried multiple shows as well and that did not matter which show, it did the same thing.​",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p8jfur/is_netflix_down_again/"
    },
    {
        "id": "1p8mrp7",
        "author": "claire_luna_25",
        "title": "the beast in me",
        "content": "am i the only one who wanted Nile to come out winning in the end? \n\nmaybe it’s just me but sometimes if the show paint the “villain” well enough, i want them to get away with it. this is probably an unpopular opinion but i felt the same about joe from the show You. and for same with. cersei in GOT. \n\nplz tell me there’s more of you villain lovers out there ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8mrp7/the_beast_in_me/"
    },
    {
        "id": "1p7pc8k",
        "author": "TheMirrorUS",
        "title": "Netflix crashes with Stranger Things Season 5 release",
        "content": "",
        "upvotes": 334,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1p7pc8k/netflix_crashes_with_stranger_things_season_5/"
    },
    {
        "id": "1p8oqec",
        "author": "throwaway6767676713",
        "title": "Screen keeps dimming white",
        "content": "The screen keeps fading white and sometimes black but its mostly white. Its really frustrating and shows are becoming unwatchable. It only recently started doing this and it does this without about every show i watch on mobile. It doesnt happen on a laptop. I have an iphone if that helps. I tried changing the HDR thing since google said so but theres no HDR option in the app settings. Some help would be much appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8oqec/screen_keeps_dimming_white/"
    },
    {
        "id": "1p8hgsq",
        "author": "InfinitePie3231",
        "title": "Stranger Things Real Review!! + Prediction",
        "content": "I LOVED IT!!!\n\nGreat: Twist with Will at the end of ep 4!\n\nBad: Yes, I didn't like the sudden introduction &amp; goodbye of the 'dipshit derek', the boy was just starting to warm up to he viewer and forming a character. (but obviously it doesn't end here so why are people hating on the writers? ofc we will see a face off between 008 (sister), 011 (El) &amp; Will against Vecna)\n\nPrediction: HIGH POSSIBILITY - they kill off Eleven because it all started with her + in S5 E2/3 Mike was talking about their happily ever after post-chaos. OHH! You know what that means. She gon die.\n\n  \nThe Series are great, I despise the people who are hating on it because they took too long, well efforts take long! It's a work of ART people. (I'm 22F, a cinephile)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p8hgsq/stranger_things_real_review_prediction/"
    },
    {
        "id": "1p7oxqd",
        "author": "Acrobatic-Apricot874",
        "title": "Netflix broken?",
        "content": "Anyone else's netflix just break?? I was trying to watch season 5 of stranger things because it just dropped a minute ago but my netflix isn't letting me into anything...\n\nedit: it came back up after 30 minutes.. but holy shit guys please calm down &lt;/3",
        "upvotes": 215,
        "comments": 189,
        "media": null,
        "permalink": "/r/netflix/comments/1p7oxqd/netflix_broken/"
    },
    {
        "id": "1p8fvh9",
        "author": "Popis_Smex",
        "title": "My extra member was removed and replaced",
        "content": "Hi community,\n\nMy extra member was removed and replaced just now.\n\nI changed my password &amp; log out from all devices (my previous password was unique).\n\nI checked my email account, no new device connected and 2FA active (so 100% secure).\n\nSo it's very weird... \n\nIs it something common? A bug? \n\n(The new user: word1+word2@gmail.com) \n\nThank you",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p8fvh9/my_extra_member_was_removed_and_replaced/"
    },
    {
        "id": "1p79ilm",
        "author": "intelerks",
        "title": "Linda Hamilton refuses to chase youth in 'Stranger Things': \"I do not spend a moment trying to look younger\"",
        "content": "",
        "upvotes": 553,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1p79ilm/linda_hamilton_refuses_to_chase_youth_in_stranger/"
    },
    {
        "id": "1p8fldj",
        "author": "shadow_spinner0",
        "title": "Current Stranger Things IMDB ratings for Season 5",
        "content": "Chapter One: The Crawl - *8.4\nChapter Two: The Vanishing of - *9.0\nChapter Three: The Turnbow Trap - *9.2\nChapter Four: Sorcerer - *9.8 \n\nYou agree with the ratings?  Too high? Too Low? \n\nhttps://m.imdb.com/title/tt4574334/ratings/?ref_=tt_ov_rat",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p8fldj/current_stranger_things_imdb_ratings_for_season_5/"
    },
    {
        "id": "1p8fh3e",
        "author": "tomb_77",
        "title": "Was Electric State that bad?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8fh3e/was_electric_state_that_bad/"
    },
    {
        "id": "1p8f67d",
        "author": "dirtyflower",
        "title": "Missing: Dead or Alive S2 Analysis",
        "content": "Anyone else think that Eric Greene didn't do it and that Jersey and James Kelly framed him?\n\n1) When Jersey was at the police station he complained that they had been holding him there for \"4 hours.\" When he was being interviewed he said he went to some other house and waited for \"4 hours.\" Just seemed like an evasive type of phrase he uses. Like he wants the listener to focus on how long he was occupied with something rather than what he was really doing there.\n\n2) Detective Raine said that Jersey and James didn't know each other, she emphasized that their stories matched even though they didn't know each other twice...and yet Jersey was at James house often? They definitely all knew each other. Certainly enough to plot to frame someone within the group...especially the time that they first visited James and there was someone else in his house and they were pretty sure it was Jersey (who tipped them off to talk to James anyway? Wasn't it Eric?). I also didn't like that Detective Raine at first was like \"Jersey's name keeps coming up\" and then later switched that to \"Easy's name keeps coming up\" and yet that didn't seem true. Eric/Easy's name didn't come up hardly at all except by Jersey and James.\n\n3) Sunshine would probably have spoken if the police seemed like they were going to catch the correct people. When she said \"that's a sad story\" it was obvious she knew what happened but it seemed to me that the story was wrong and the tears were less likely about Morgan and more that she was still going to have to deal with the guys who actually did it.\n\n4) Jersey makes a point to claim that Eric was involved with the top drug dealers...and yet the other police department investigating the top drug dealers said that Jersey was involved and didn't mention Eric. Perhaps the cops are in on the framing of Eric for this reason because it is way too obvious that it was Jersey.\n\n5) Jersey showed with ease how Morgan was strangled. If it was not something he had done before he would have fumbled with his hands and wouldn't have done the extra squeeze. He claimed previously that he would shoot people just because he wanted to and they found a gun and there was no follow up on that either. When the guy who found the skull said it looked like cartel did it...why was that? Was there a bullet hole? Did they choke him out, move him, then shoot him so there wouldnt be mess in James house or the car?\n\n6) Eric's angry reaction to being framed seemed very genuine as did his last words in the court room. There was no pause. He probably caused Jersey and James problems and having him framed was a solution. And the other big drug investigation cops likely also saw framing Eric as an easy solution to protecting their investigation. I don't think Detective Raine was happy with likely being told to handle the case that way, especially on TV. She seemed quite tense and \"scripted\" as people have complained about. I don't think she (or the captain) wanted things to be handled that way. I wonder if that's why they are doing the show or if they had gone too far with it and had to wrap it up and add in a second story to distract. Bet they wanted people to focus on the trans aspect.\n\n7) If Jersey is dealing with a big drug ring he's not stupid. He probably was cutting James in on the money. James was very obviously not \"scared\" when he said he was scared. His original demeanor with the cops was what kind of guy he is because he was caught off guard and he was putting on a full act in the station. Saying he was nervous was not him opening up about his feelings, it was setting a narrative out there to cover up how his behavior being \"off\" might be from nerves rather than lying.\n\nThis guy Eric Greene got put away for 57 years. Looked like Jersey got put away for something as well, but if him and James are out, I bet they start the whole thing back up again. All the witnesses who had their homes \"invaded\" never mentioned Eric, they mentioned Jersey. Well technically they all mentioned 2 guys and technically the show didn't confirm that the other guy was Eric, maybe it was or maybe it was someone else important for the big drug investigation who's name couldn't even be aired in the show. I bet Eric was actually Morgan's friend based on the video of Morgan talking to \"Easy\" in the store. I bet part of Eric's anger is that he didn't have any evidence on Jersey or James to give the police, but there's no way that all he said in the interview was that he didn't do it. They didn't show what he would have claimed his alibi to be because anyone who says they didn't do it has to have some kind of alibi story even if its a weak one.\n\nI wonder if Eric is fighting to get out or not, if he even can and what kind of family he has or what his background is, the show really didn't seem to want to let us know too much about him.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p8f67d/missing_dead_or_alive_s2_analysis/"
    },
    {
        "id": "1p8m13g",
        "author": "HalfAsleep28",
        "title": "Stranger things vs Squid games",
        "content": "So I got into this debate with my friend about which show actually stands on top, Stranger Things or Squid Game. And honestly, I’m firmly on the Stranger Things side. For me, it’s not just a show; it’s a whole world you sink into. The mix of supernatural horror, 80s nostalgia, and those genuinely loveable characters makes it feel richer and more emotional. You grow up with the kids, you get invested in every friendship, every twist, every villain. Even the side stories feel meaningful. And the world-building? Massive. The Upside Down, Hawkins Lab, Vecna, it always feels like there’s a deeper layer waiting to unfold.\n\nNow, Squid Game is definitely powerful in its own way. It’s sharp, socially relevant, and brutally unpredictable. The tension is unreal and it keeps you hooked from the first episode. I get why people hype it.\n\nBut for me, Squid Game is more of a one-time adrenaline rush, whereas Stranger Things has long-term emotional weight. It’s something you rewatch, quote, and connect with. That’s why I’ll always pick Stranger Things. It's  not just thrilling, it’s iconic.\nYou can put your point if disagree. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p8m13g/stranger_things_vs_squid_games/"
    },
    {
        "id": "1p89dbe",
        "author": "TheOrdinaryMind",
        "title": "Did netflix quality dropped for anyone else after crash?",
        "content": "I've been rewatching breaking bad for past 3-4 days now with no issue in quality. But when I resumed today, it was very grainy(standard plan). Most probable reason seems to be lower bitrate due to recent increased load on the server.\nJust wondering if anyone else is facing the same issue.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p89dbe/did_netflix_quality_dropped_for_anyone_else_after/"
    },
    {
        "id": "1p8o6h3",
        "author": "Tall_Violinist2685",
        "title": "Will Byers Shocks Fans With New Abilities in Stranger Things Season 5 Finale",
        "content": "Will Byers finally unlocks new abilities in the Stranger Things 5 finale. Full breakdown of the twist and what comes next.\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8o6h3/will_byers_shocks_fans_with_new_abilities_in/"
    },
    {
        "id": "1p7iqtt",
        "author": "Gamer_8887",
        "title": "In my opinion Stranger Things is the best Netflix show I've ever watched and I am sad to know that it's coming to an end",
        "content": "I started watching it in 2020, at the time I bingewatched seasons 1-3 and I was so addicted. Season 4 in 2022 really blew me away, especially the Max episode, I still listen to that song till today. It's really good. With the final season volume 1 around the corner, I just wanted to make this post before it airs. I will miss this masterpiece of a show when it ends 😭.",
        "upvotes": 41,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1p7iqtt/in_my_opinion_stranger_things_is_the_best_netflix/"
    },
    {
        "id": "1p8hpk6",
        "author": "Jppm77",
        "title": "My friends account when I enter it asks to activate extra member",
        "content": "So when i try to enter my friends account it says that his account is paying for an extra member and I have to activate it or make a new account my question is if I activate it he doesn't pay more right? Cuz it says he is paying it that means no one is using that extra member yet right?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p8hpk6/my_friends_account_when_i_enter_it_asks_to/"
    },
    {
        "id": "1p7vs65",
        "author": "Pulp501",
        "title": "Picture in picture settings?",
        "content": "I want to be able to have netflix playing in the background on my phone while using other apps. Ive been subscribed before and never had a problem but now it doesn't do it and there doesn't seem to be any setting for it. Never needed a setting before, it would automatically do it, like most apps do. Does netflix just not have this feature anymore? ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7vs65/picture_in_picture_settings/"
    },
    {
        "id": "1p7wgc9",
        "author": "Maybe_Everett",
        "title": "can’t see show info",
        "content": "Every time I click on a show or movie it just immediately starts it without displaying the info first. I want to watch a specific episode of a show, but it automatically just starts episode 1 without letting me choose. This has been happening for a month on multiple devices. What’s happening? ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p7wgc9/cant_see_show_info/"
    },
    {
        "id": "1p82uli",
        "author": "michaelpaul7",
        "title": "Standard plan with ads",
        "content": "I have the standard plan with ads and I see that it says 15 downloads per device each calendar month. I have two tablets so I should be able to get 30 downloads..... Can someone please confirm. \nI use my tablet when I have down time and no access to WiFi.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p82uli/standard_plan_with_ads/"
    },
    {
        "id": "1p8hz54",
        "author": "ShopLongjumping9285",
        "title": "Stranger Things Season 5: Who is Mr. Whatsit? Explained",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p8hz54/stranger_things_season_5_who_is_mr_whatsit/"
    },
    {
        "id": "1p7p31x",
        "author": "sgudeman",
        "title": "Opened Netflix app on Apple TV and was logged into somebody else’s account at my house… what??",
        "content": "So I opened up Netflix on my Apple TV and the account profiles were all somebody else’s account… Terrance, kids, Matthew, Michael, and Jacob. None of whom live at my house or who I have on my Netflix account. It was so weird! Had to log out and log back in as me… it was like being at an Airbnb where somebody else had forgot to log out except this was at my own house. Anyone else have this happen ever?? ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p31x/opened_netflix_app_on_apple_tv_and_was_logged/"
    },
    {
        "id": "1p8abul",
        "author": "MiloP27",
        "title": "YouTube series now going to Netflix?",
        "content": "My son was on Netflix this morning and started watching the new series by Mark Rober Crunch Labs\n\nIt’s just the YouTube series he has done but now on Netflix…\n\nIt doesn’t seem to be edited at all, with him saying in the video check the description below…and then a segment of him advertising his crunch labs box again stating check the description below?\n\nWhat are everyone’s thoughts on this? \n\nNot sure I’m too happy with Netflix just buying something that’s free on YouTube and saying it’s new on Netflix, also the mid advertisements feel odd as it’s aimed at children!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p8abul/youtube_series_now_going_to_netflix/"
    }
]