[
    {
        "id": "1jm0dan",
        "author": "netflix",
        "title": "[ANNOUNCEMENT] Official r/movies Competition! Director Gareth Evans (THE RAID) announces poster contest (with prizes!) and AMA to celebrate the release of Netflix's HAVOC (starring Tom Hardy) on April 25th.",
        "content": "",
        "upvotes": 32,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n8jr81g2sgre1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jm0dan/announcement_official_rmovies_competition/"
    },
    {
        "id": "1jlkg77",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Death of a Unicorn / The Working Man / The Woman in the Yard / Magazine Dreams / Ash / O'Dessa) and introducing Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Death of a Unicorn](https://www.reddit.com/r/movies/comments/1jlkd7q/official_discussion_death_of_a_unicorn_spoilers/?)\n\n[The Working Man](https://www.reddit.com/r/movies/comments/1jlkdcp/official_discussion_the_working_man_spoilers/?)\n\n[The Woman in the Yard](https://www.reddit.com/r/movies/comments/1jlkdi0/official_discussion_the_woman_in_the_yard_spoilers/?)\n\n[Magazine Dreams](https://www.reddit.com/r/movies/comments/1jlkdma/official_discussion_magazine_dreams_spoilers/?)\n\n[Ash](https://www.reddit.com/r/movies/comments/1jlkdp3/official_discussion_ash_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Erin Brockovich](https://www.reddit.com/r/movies/comments/1jlke90/official_throwback_discussion_erin_brockovich/?)\n\n[Final Destination](https://www.reddit.com/r/movies/comments/1jlked9/official_throwback_discussion_final_destination/?)\n\n[Romeo Must Die](https://www.reddit.com/r/movies/comments/1jlkeg0/official_throwback_discussion_romeo_must_die/?)\n\n# Still in Theaters\n\n[Snow White (2025)](https://www.reddit.com/r/movies/s/zHwZaVwVDH)\n\n[Alto Knights](https://www.reddit.com/r/movies/s/Xvz6dM0MZP)\n\n[Novocaine](https://old.reddit.com/r/movies/comments/1jat4d0/official_discussion_novocaine_spoilers/?)\n\n[Black Bag](https://old.reddit.com/r/movies/comments/1jat4fj/official_discussion_black_bag_spoilers/?)\n\n[Mickey 17](https://www.reddit.com/r/movies/comments/1j5dv2d/official_discussion_mickey_17_spoilers/?)\n\n\n# On Streaming\n\n[O'Dessa](https://www.reddit.com/r/movies/comments/1jlkdu3/official_discussion_odessa_spoilers/?)\n\n[The Electric State](https://old.reddit.com/r/movies/comments/1jbkncc/official_discussion_the_electric_state_spoilers/?)\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jlkg77/official_discussion_megathread_death_of_a_unicorn/"
    },
    {
        "id": "1jmikp3",
        "author": "Funendra",
        "title": "This Studio Ghibli AI trend is an utter insult to the studio and anime/cinema in general.",
        "content": "What's up with these AI Ghibli pics recently? Wherever I go, I just cannot escape it. Being a guy who loves the cinematic art in any form, seeing this trend getting this scale of traction is simply sad. I have profound respect for the studio and I  was amazed by their work when I discovered movies like Castle in The Sky, Grave of the Fireflies, Spirited away, etc. And when I got to know how these movies are made and how much manual effort it takes to produce them, my appreciation only increased. But here comes some AI tool that can replicate this in a matter of minutes. This is no less than a slap on the faces of artists who spend hours imagining and creating something like this. \n\nI am not against AI, or advancements it is making. But there must be a limit to this. You can cut a fruit as well as stab someone with a kitchen knife. Right now, it is the latter happening with the use of AI tools just for cheap social media points. Sad state of affairs.\n\nWhat do you think? Do you guys like his trend? ",
        "upvotes": 17359,
        "comments": 3180,
        "media": null,
        "permalink": "/r/movies/comments/1jmikp3/this_studio_ghibli_ai_trend_is_an_utter_insult_to/"
    },
    {
        "id": "1jmipcl",
        "author": "JonasKahnwald11",
        "title": "Poster for 'Gunslingers' - Starring Stephen Dorff, Heather Graham and Nicolas Cage",
        "content": "",
        "upvotes": 402,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/llfvwgimmlre1.jpeg?auto=webp&amp;s=57358559664eaa5e458f4f4d96e0c034926a0763"
        },
        "permalink": "/r/movies/comments/1jmipcl/poster_for_gunslingers_starring_stephen_dorff/"
    },
    {
        "id": "1jmeuan",
        "author": "farmsfarts",
        "title": "The movie “IF” is perhaps the worst movie I’ve ever watched the whole way through.",
        "content": "I watched the whole thing because my daughter thought the purple monster was cute and so I rented it off Amazon for $7. She’s 8 years old. We watched it together and both hated it, I could not believe how ham-fisted and boring it was, so fake, cheesy, falsely sentimental. My daughter and I love magical movies, The Princess Bride, stuff like that, this was complete garbage. I kept quiet outside of the occasional derisive snicker but my daughter begged me to turn it off, I said no I paid for it we must suffer through it. AWFUL. ",
        "upvotes": 938,
        "comments": 451,
        "media": null,
        "permalink": "/r/movies/comments/1jmeuan/the_movie_if_is_perhaps_the_worst_movie_ive_ever/"
    },
    {
        "id": "1jmh5r1",
        "author": "accidentalzero",
        "title": "What movie wasn't about what you thought it was about?",
        "content": "Watched The Devil Wears Prada last night having never seen it before. I always thought this was a film in which Meryl Streep literally played the devil and so was a bit surprised to discover this wasn't the case. (In fairness i did always wonder why the devil would be editing a fashion magazine but figured it'd be explained) \n\nAnyone else watched a film thinking they knew what it was about only to discover they must have picked it up wrong?",
        "upvotes": 457,
        "comments": 929,
        "media": null,
        "permalink": "/r/movies/comments/1jmh5r1/what_movie_wasnt_about_what_you_thought_it_was/"
    },
    {
        "id": "1jmhcmi",
        "author": "Danielnrg",
        "title": "The World's End became way more relevant than I initially gave it credit for",
        "content": "This movie came out over 10 years ago; I don't think I have to litigate its quality to anyone here. \n\nI originally saw this movie in 2014, a couple years after it released. I figured, it's no match for Shaun of the Dead, which I grew up watching from when I was 10, and not as clever as Hot Fuzz. It was just a lukewarm movie that I got a handful of laughs out of. \n\nIt wasn't until I entered adulthood that I realized how much this movie spoke to who I am as a person. It laid bare my inadequacies far clearer than any media I have ever viewed.\n\nI think the vast majority of viewers see Gary King as a pitiful character. Some may have even known someone like him. \n\nOne thing that has always struck me about this movie in later years is that it felt like it was talking directly to me in its plot points and characters.\n\nGary King is not just a fictional character. He's me. I've never felt more affinity for a fictional character than hearing Gary's monologue towards the end of the film. \n\n\"That was supposed to be the beginning of my life. All that promise and fucking optimism. It was a big lie. Nothing happened.\"\n\nFuck, man. I watched this shit for the first time when I was a sophomore in high school, out of obligation for Shaun and Fuzz at the time. I had no idea it would go on to describe an essential part of who I was for 10 years. \n\nI like to think that most people empathize with Gary here, but some of us really are that fucking pathetic to hold on to our \"glory days\" all these years later. For some of us, it really was all we ever had.\n\nIt never got better than that night.",
        "upvotes": 359,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1jmhcmi/the_worlds_end_became_way_more_relevant_than_i/"
    },
    {
        "id": "1jmpqkp",
        "author": "Forsaken_Walk6008",
        "title": "Movies that depicts urban decay and marginality of New York in the 70s",
        "content": "Yooo people, im watching Right now a lot of documentaries about the story of New York and i think súper interesting the period of the 70s to 90s that shows a completely different New York in comparison with now, im looking of a film that depicts that time with all that it entails Drugs, Slums, High rate of crime that type of film from New York im  looking exactly",
        "upvotes": 46,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1jmpqkp/movies_that_depicts_urban_decay_and_marginality/"
    },
    {
        "id": "1jlup5j",
        "author": "DemiFiendRSA",
        "title": "‘Legend of Zelda’ Film Sets March 2027 Theatrical Release From Sony Pictures",
        "content": "",
        "upvotes": 6873,
        "comments": 1451,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZLCaz_ITXP9ZzNJoILekFvAkAhTenar9JnKQBCn2O5g.jpg?auto=webp&amp;s=68f7a5649a14d32ed8ddbf3267b667ed279d0d69"
        },
        "permalink": "/r/movies/comments/1jlup5j/legend_of_zelda_film_sets_march_2027_theatrical/"
    },
    {
        "id": "1jmq5v7",
        "author": "Newreverb",
        "title": "Were movie starting times irrelevant decades ago?",
        "content": "My 85-year old father swears that when he was a kid (1940s to 1950s) everyone just went to the movies at random times and started watching the main feature whenever, even in the middle.  Then when it was over they'd stay, watch the opening cartoons, then watch the feature film up to the point they arrived.  My mom and I tease him about this and say surely it was never really a thing but he swears that's the way it was done back then.  Anyone heard of or experienced this? ",
        "upvotes": 41,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1jmq5v7/were_movie_starting_times_irrelevant_decades_ago/"
    },
    {
        "id": "1jmlw9q",
        "author": "veganbell",
        "title": "Movies like 'The Man from Earth' (2007)?",
        "content": "I just finished watching The Man from Earth (2007) and absolutely loved it. It’s a low-budget film, incredibly dialogue-heavy, and almost the entire story unfolds in a single room (and with a cast I am not familiar with).\n\nYet, despite all that, it never once feels boring.  \n\nWhich got me curious—are there any other hidden gem movies like this?",
        "upvotes": 62,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1jmlw9q/movies_like_the_man_from_earth_2007/"
    },
    {
        "id": "1jmn1w2",
        "author": "MarvelsGrantMan136",
        "title": "'How to Train Your Dragon' at 15: The Story Behind the Dazzling Animated Children’s Fantasy",
        "content": "",
        "upvotes": 50,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3jlnubQzER4fNPAXza91W8HVWZ3s2Yz16e3Cs6thfdk.jpg?auto=webp&amp;s=7f95bda7b8dd57bf6385352c82f2a30b40db15e3"
        },
        "permalink": "/r/movies/comments/1jmn1w2/how_to_train_your_dragon_at_15_the_story_behind/"
    },
    {
        "id": "1jlus45",
        "author": "NoCulture3505",
        "title": "Sony Closes Simon Pegg &amp; Nick Frost’s Production Outfit Stolen Picture",
        "content": "",
        "upvotes": 4091,
        "comments": 324,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/POMhWdD6cFIPlNYJmPj8jo9Nzoy03x8UFl7YU0g94Us.jpg?auto=webp&amp;s=186fc62f3673c3ee321e2431c4c96e6f7c02b72c"
        },
        "permalink": "/r/movies/comments/1jlus45/sony_closes_simon_pegg_nick_frosts_production/"
    },
    {
        "id": "1jm9nz4",
        "author": "n_african_daemon",
        "title": "12 angry men",
        "content": "This movie wasn’t supposed to surprise me. The ending was spoiled for me long before I even hit play nd to make it worse i had already seen a few key shots on YouTube so going in I thought, 'What is left to enjoy?' Turns out , everything lol\nEven knowing the outcome, this movie hooked me in ways I didn’t expect. It is not about what happens it is about how it happens. Watching these 12 strangers argue ,clash nd unravel felt like seeing raw human nature laid bare. Their biases , egos nd frustrations it ia all so uncomfortably real nd that is where the brilliance lies !!\nThe cinematography blew me away. At first, the camera looks down on the jurors like we are judging them from a distance but as the movie progresses the angles shift. The room feels tighter ,the shots get closer nd by the end, we are looking up at these men. It is subtle but genius without saying a word , Sidney Lumet forces us to respect them , to understand that justice requires effort, humility nd courage.\nSpeaking of Lumet how is this his debut feature film? The man came in swinging. His ability to pull such distinct layeered performances from his cast is ridiculous. Every juror feels so real like you kinda have met them before lol tthe stubborn one , the quiet one , the loud one who doesn’t shut up etc ..nd yet, together, they form this chaotic but gripping puzzle. Lumet doesn’t overdo anything like he keeps it simple , letting the dialogue nd performances do all the heavy lifting lol . As much as I loved the movie , it doesn’t quite fit the intensity I usually crave in films. Don’t get me wrong this is smart, layered nd almost flawless but it is more cerebral than emotional ,I honestly didn’t feel gutted by it the way I do with darker nd more tragic stories. It challenged me sure but it didn’t hit as hard as I expected\nAnyway even spoiled, 12 Angry Men is a masterclass in filmmaking nd that is how you know it is a damn good film",
        "upvotes": 520,
        "comments": 204,
        "media": null,
        "permalink": "/r/movies/comments/1jm9nz4/12_angry_men/"
    },
    {
        "id": "1jm6n8e",
        "author": "Acrobatic-Put1998",
        "title": "Exit 8 game movie trailer",
        "content": "",
        "upvotes": 751,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/87zz6lbe4ire1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jm6n8e/exit_8_game_movie_trailer/"
    },
    {
        "id": "1jlyszg",
        "author": "MarvelsGrantMan136",
        "title": "Edgar Wright’s ‘The Running Man’, Starring Glen Powell, Wraps Filming",
        "content": "",
        "upvotes": 1271,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jS8Kkol7rQtyIdLiIlVwDaiAflZZq8zrHbyZF6ocxoE.jpg?auto=webp&amp;s=74fe3a9851d250e3615d67ccf6dcf27043546730"
        },
        "permalink": "/r/movies/comments/1jlyszg/edgar_wrights_the_running_man_starring_glen/"
    },
    {
        "id": "1jluzwd",
        "author": "Honey_Skimmer_1999",
        "title": "Actors who have played the same role in multiple different movies?",
        "content": "[Lucy Punch](https://www.imdb.com/name/nm0700577/) has played one of Cinderella's stepsisters (or variations thereof) in 4 completely different filmed productions:\n\n* [Cinderella (2000)](https://www.imdb.com/title/tt0218891/)\n* [Ella Enchanted (2004)](https://www.imdb.com/title/tt0327679/)\n* [Fairy Tales: Cinderella (2008)](https://www.imdb.com/title/tt1062248/)\n* [Into the Woods (2014)](https://www.imdb.com/title/tt2180411/)\n\nAre there any other actors who have played the same role more times in wholly different productions? (Obviously this doesn't include franchises etc.)",
        "upvotes": 1458,
        "comments": 599,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/81kdF12DhR1cG75alqPoT-LqSKDJnJw2m8NHKeAkikE.jpg?auto=webp&amp;s=d860c2de5a094a94b560829fbede56cda79ce287"
        },
        "permalink": "/r/movies/comments/1jluzwd/actors_who_have_played_the_same_role_in_multiple/"
    },
    {
        "id": "1jm0pcl",
        "author": "MyNameIsBlueHD",
        "title": "Neon Acquires Nirvanna the Band the Show the Movie",
        "content": "",
        "upvotes": 574,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NYsXl9fg8a6Htudwu7a9FN2Khblso4SiKirhUsni_Bg.jpg?auto=webp&amp;s=dc469869422a0fc942a11123f400aaa09000ac7d"
        },
        "permalink": "/r/movies/comments/1jm0pcl/neon_acquires_nirvanna_the_band_the_show_the_movie/"
    },
    {
        "id": "1jlvfq8",
        "author": "ChiefLeef22",
        "title": "A24's 'WARFARE' - Review Thread",
        "content": "Director: Alex Garland/Ray Mendoza\n\nCast: Will Poulter, Kit Connor, Joseph Quinn, Cosmo Jarvis, Charles Melton, Noah Centineo, D'Pharaoh Woon-A-Tai, Evan Holtzman, Finn Bennett\n\n**Rotten Tomatoes:** [93%](https://www.rottentomatoes.com/m/warfare)\n\n**Metacritic:** [78/100 ](https://www.metacritic.com/movie/warfare/)\n\nSome Reviews:\n\n[IndieWire](https://www.rottentomatoes.com/critics/source/226) \\- [David Ehrlich](https://www.rottentomatoes.com/critics/david-ehrlich) \\- B-\n\n&gt;“Warfare” is a film that wants to be felt more than interpreted, but it doesn’t make any sense to me as an invitation — only as a warning created from the wounds of a memory. The film is a clear love letter to Elliot Miller and the other men in Mendoza’s unit, but the verisimilitude with which it recreates the worst day of their lives — when measured against the ambiguity as to what it hopes to achieve by doing so — ultimately makes “Warfare” seem like a natural evolution of Garland’s previous work, so much of which has hinged on the belief that our history as a species (and, more recently, America’s self-image as a country) is shaped by the limits of our imagination. \n\n[San Francisco Chronicle](https://www.rottentomatoes.com/critics/source/402) \\- [G. Allen Johnson](https://www.rottentomatoes.com/critics/g-allen-johnson) \\- 4/4\n\n&gt;Garland has become this generation’s Oliver Stone, a studio filmmaker who is able to fearlessly capture the zeitgeist on hot-button issues few other Hollywood filmmakers touch, such as AI (2015’s “Ex Machina”), the political divide and a society’s slide toward violence (“Civil War”), and now the consequences of military diplomacy.\n\n[Empire Magazine](https://www.rottentomatoes.com/critics/source/148) \\- [Alex Godfrey](https://www.rottentomatoes.com/critics/alex-godfrey) \\- 5/5\n\n&gt;War is hell, and Warfare refuses to shy away from it. Free of the operatics of most supposed anti-war films, it’s all the more effective for its simplicity. It is respectfully gruelling.\n\n[The Hollywood Reporter](https://www.rottentomatoes.com/critics/source/213) \\- [David Rooney](https://www.rottentomatoes.com/critics/david-rooney)\n\n&gt;Garland is working in peak form and with dazzling technical command in what’s arguably his best film since his debut, *Ex Machina*. But the director’s skill with the compressed narrative would be nothing without the rigorous sense of authenticity and first-hand tactical knowledge that Mendoza brings to the material — and no doubt to the commitment of the actors.\n\n[AV Club](https://www.rottentomatoes.com/critics/source/833) \\- [Brianna Zigler](https://www.rottentomatoes.com/critics/brianna-zigler) \\- B+\n\n&gt;Simply depicting the plain, ugly truth of human combat makes *Warfare* all the more effective as a piece of art setting out to evoke a time and place. The bombing set piece is equal parts horrific and thrilling; the filmmakers draw out the sensory reality of the slaughter as the men slowly come to, disoriented, ears ringing, ultimately leading to a frenzy of confusion, agita, and howling agony. The cacophony of torment and its reaction in the men meant to arrive with help is as grim as the bureaucratic resistance to send in medic vehicles to give the wounded any chance to survive their injuries.\n\n[Independent (UK)](https://www.rottentomatoes.com/critics/source/691) \\- [Clarisse Loughrey](https://www.rottentomatoes.com/critics/clarisse-loughrey) \\- 3/5\n\n&gt;Alex Garland has now constructed what could be called his trilogy of violence... Warfare, at least, is the most successful of the three, because its myopia is a crucial part of its structure. Garland and Mendoza do, at least in this instance, make careful, considerate use of the film’s framework. We’re shown how US soldiers invade the home of an Iraqi family who, for the rest of *Warfare*’s duration, are held hostage in a downstairs bedroom, guns routinely thrust into their faces. In its final scene, they reemerge into the rubble of what was once their home, their lives upended by US forces and then abandoned without a second thought. It’s quite the metaphor.\n\n[Daily Telegraph (UK)](https://www.rottentomatoes.com/critics/source/921) \\- [Robbie Collin](https://www.rottentomatoes.com/critics/robbie-collin) \\- 5/5\n\n&gt;It’s necessarily less sweeping than Garland’s recent Civil War, and for all its fire and fury plays as something of a philosophical B-side to that bigger earlier film. I’d certainly be uncomfortable calling it an action movie, even though vast tracts of it are nothing but. It leaves questions ringing in your ears as well as gunfire.\n\n[Guardian](https://www.rottentomatoes.com/critics/source/205) \\- [Peter Bradshaw](https://www.rottentomatoes.com/critics/peter-bradshaw) \\- 3/5\n\n&gt;In some ways, Warfare is like the rash of war-on-terror pictures that appeared 20 years ago, such as Kathryn Bigelow’s The Hurt Locker or Nick Broomfield’s Battle for Haditha, or indeed Brian De Palma’s interesting, underrated film Redacted. But Warfare doesn’t have the anti-war reflex and is almost fierce in its indifference to political or historical context, the resource that should be more readily available two decades on. The movie is its own show of force in some ways, surely accurate in showing what the soldiers did, moment by moment, though blandly unaware of a point or a meaning beyond the horror.\n\n[Times (UK)](https://www.rottentomatoes.com/critics/source/823) \\- [Kevin Maher](https://www.rottentomatoes.com/critics/kevin-maher) \\- 5/5\n\n&gt;This is a movie that’s as difficult to watch as it is to forget. It’s a sensory blitz, a percussive nightmare and a relentless assault on the soul.\n\n[Deadline](https://www.rottentomatoes.com/critics/source/2256) \\- [Gregory Nussen](https://www.rottentomatoes.com/critics/gregory-nussen)\n\n&gt;While it aims for an unromantic portrait of combat, it can only conceive of doing so through haptic recreation in lieu of actual characterization. The result is a cacophonous temper tantrum, a vacuous and perfidious advertisement for military recruitment.\n\n[London Evening Standard](https://www.rottentomatoes.com/critics/source/446) \\- [Martin Robinson](https://www.rottentomatoes.com/critics/martin-robinson) \\- 4/5\n\n&gt;Given all the America First stuff going on, and the history of the Iraq War, Warfare may suffer from a lack of sympathy for American military operations. And yet, the sheer technical brilliance and strength of performances, cannot fail to connect when you take on the film on its own terms, as pure human experience in the most hellish of circumstances.",
        "upvotes": 1064,
        "comments": 473,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZIo3wW_9XaXIncJMC3f4DWyoIMhsDIxgKNjaGAXGZM.jpg?auto=webp&amp;s=fd85dfc8bcd351ec8c5324238c57d50b91e5de09"
        },
        "permalink": "/r/movies/comments/1jlvfq8/a24s_warfare_review_thread/"
    },
    {
        "id": "1jmof6x",
        "author": "JulioCesarSalad",
        "title": "What movies would you recommend for older family members who haven’t really been exposed to films or literature throughout their lives?",
        "content": "Looking for movies with which everyone should be familiar\n\nMy in laws are immigrants from a very rural area, “parents were subsistence farmers in the mountains” rural, and their academic education did not make it very far. \n\nAs such, their exposure to literature, both written and filmed, has been limited. \n\nThey’re very intelligent people, they watch the evening news every day and have no problem keeping up with the intricacies of *why* things happen, and can relate things happening in the US easily between patterns they’ve seen in El Salvador. \n\nHowever, their life experience has been limited to things they have personally experienced, and I believe the great value of literature is expanding our world beyond the lived experience. (I consider films to be literature, not just books)\n\nAs such, we would like to come up with a list of essentially the western canon, but in film. \n\nWhat are the movies you think everyone should watch, movies that set up or include structures seen in other works, movies that expose people to classic storylines, even if not the original story, and movies that are, above all, entertaining?\n\nBonus points if the movie is known to have a great Spanish dub. We want to avoid subtitles for now. \n\nShrek would be a movie I consider part of the western canon, for example, and it has a great Spanish dub, but I would not feel it’s a good option to start them with it given that it requires knowledge or familiarity fairy tales, fantasy tropes, and satire to enjoy.\n\nSo, with this in mind, what are some films you think would be good for the goal of exposing our parents to these movies and build up their cultural knowledge, worldly experience, and enjoyment?",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jmof6x/what_movies_would_you_recommend_for_older_family/"
    },
    {
        "id": "1jm5oe7",
        "author": "aninjacould",
        "title": "\"Rube Goldberg\" Slapstick Sequences in Films Like How to Park a Car by Detective Frank Drebin in the Naked Gun Franchise",
        "content": "Detective Frank Drebin parking a car scenes in the Naked Gun movies are, in my opinion, endlessly hilarious and impressive film making. Are there more like it in other films? Looking for chain of events sequences, comedic, dramatic, or otherwise.... I can think of one other but I'm hoping the reddit community can identify more. Thanks!",
        "upvotes": 155,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B8AaUSPX36GKkBUHXzBZyMJkEw8NDBXjsGwxbuMDvqQ.jpg?auto=webp&amp;s=b35ef9aafb535540e54f13d7ee1f839d0bea20b4"
        },
        "permalink": "/r/movies/comments/1jm5oe7/rube_goldberg_slapstick_sequences_in_films_like/"
    },
    {
        "id": "1jlv8wo",
        "author": "Sisiwakanamaru",
        "title": "Inside YouTube’s Weird World Of Fake Movie Trailers — And How Studios Are Secretly Cashing In On The AI-Fuelled Videos",
        "content": "",
        "upvotes": 556,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uujL1Ka2imLIY1Qbh1AueVegXpTpK3AvTUacMm2Z7BE.jpg?auto=webp&amp;s=436e235418b5afc5e04b028d07fb77a4329d6e93"
        },
        "permalink": "/r/movies/comments/1jlv8wo/inside_youtubes_weird_world_of_fake_movie/"
    },
    {
        "id": "1jm9jye",
        "author": "dajavu_2",
        "title": "Secretary (2002) I need to get this off my mind",
        "content": "I saw this December 31 and immediately restarted so it was my last movie of last year and first of this year. I felt so mesmerized by it I wanted to watch it all the time and I watched it in full again yesterday and I felt so in love with it and I wanted to understand why in my mind it’s a near perfect movie. Lees growth into becoming her own person realizing she gets pleasure from pain and has found someone to give her happiness and pleasure. Mr. Grey becoming more open and learning that it’s okay to be a sadist and enjoy it with someone. Helping lee discover herself and letting her discover more about himself. I have looked and it’s a decently underground movie so I haven’t found anyone to truly talk to about it or to recommend movies where the two main characters matched each others freak perfectly. What other movies are like this and I’ve already seen James spaders big three so those are off the table already. So what movies are like secretary?",
        "upvotes": 67,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1jm9jye/secretary_2002_i_need_to_get_this_off_my_mind/"
    },
    {
        "id": "1jm3ocu",
        "author": "No-Construction4827",
        "title": "I don’t know what Inside Llewelyn Davis makes me feel.",
        "content": "Have you ever experienced and been so overwhelmed by an emotion or a feeling that you could never begin to explain to others, or even to yourself for that matter. But you know what it is in your soul, like a resonance within yourself. I know it sounds corny and tacky. But Inside Llewelyn Davis is like no other movie I’ve ever seen. It is an experience I will carry with me forever.\nBy the end of the movie I felt empty, confused, and kind of let down as many others Im sure have felt. But as my day went on and I reflected over what I had watched, that feeling started to grow. And gets only stronger whenever I think back to the movie, the themes and its plot. This is the only experience I’ve ever had like this and I’m curious if anyone else has something similar with this film or another.\n\n",
        "upvotes": 130,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1jm3ocu/i_dont_know_what_inside_llewelyn_davis_makes_me/"
    },
    {
        "id": "1jlcv2v",
        "author": "MarvelsGrantMan136",
        "title": "Warner Bros. is Tearing Down the Looney Tunes Building on Their Studio Lot",
        "content": "",
        "upvotes": 11914,
        "comments": 1079,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BCGVuK8wTLpqe0h3QxtMxBxbIZ5KfK7utxI0tgMQ3AA.jpg?auto=webp&amp;s=df800d942a29b4cbe472f22f593080f67b939d68"
        },
        "permalink": "/r/movies/comments/1jlcv2v/warner_bros_is_tearing_down_the_looney_tunes/"
    },
    {
        "id": "1jm09wf",
        "author": "Kaurblimey",
        "title": "If you had an unlimited budget and full creative control, which book(s) would you adapt for the screen?",
        "content": "I’d go for some Orwell miniseries, Down and Out in Paris and London and Homage to Catalonia. Not sure who I’d cast as Orwell, maybe Josh O’Connor as he’s tall and slim. \n\nThere have been way too many mediocre biopics recently but Orwell’s life is pretty spectacular and unique for an upper class British man of that era. I’d watch it! ",
        "upvotes": 189,
        "comments": 963,
        "media": null,
        "permalink": "/r/movies/comments/1jm09wf/if_you_had_an_unlimited_budget_and_full_creative/"
    },
    {
        "id": "1jlsadm",
        "author": "aledethanlast",
        "title": "Why was Titan AE so poorly recieved?",
        "content": "I haven't had opportunity to watch the movie, so if the answer is \"watch it, it'll be REALLY obvious\" then fair enough.\n\nBut on its face shouldn't it have been a knockout? Solid premise, iconic animator, star studded cast.\n\nWhat made it not only flunk but legendarily so? Was the marketing a wash? Does it just massively disappoint somehow?",
        "upvotes": 596,
        "comments": 476,
        "media": null,
        "permalink": "/r/movies/comments/1jlsadm/why_was_titan_ae_so_poorly_recieved/"
    },
    {
        "id": "1jliwjd",
        "author": "IamChicharon",
        "title": "Jumanji (1995) is dark as hell",
        "content": "Everyone’s parents are dead \n\nRobin Williams was stuck in a game for 26 years \n\nThe young girl goes insane\n\nDavid Alan Grier’s dreams are dead and he had to become a cop\n\nThe nice town in the 1960s has become a ghost town, filled with homeless people and drug addicts. And most of the stores on Main Street are porn shops!\n\nThe evil villain is actually the main character’s dad\n\n…they really don’t make them like they used to. \n\n",
        "upvotes": 2901,
        "comments": 342,
        "media": null,
        "permalink": "/r/movies/comments/1jliwjd/jumanji_1995_is_dark_as_hell/"
    },
    {
        "id": "1jlu0ts",
        "author": "wlane13",
        "title": "What is a small scene in an otherwise less than critically acclaimed movie that is just amazing and has always stuck with you.",
        "content": "For me, it is a scene in the movie \"Vision Quest\" from the 80's   Not a bad movie by any stretch (I love it) but it's not exactly on the level of the Godfather.   But this one scene, where the main character's coworker/boss explains why he is taking the night off to come see the main character wrestle in the big match... it could have been done by Brando or Pacino or so many... it's that good of a scene by itself if you ask me.\n\n\nIf you are unfamiliar... enjoy\n\nhttps://www.youtube.com/watch?v=n6W5Zcgt8kA",
        "upvotes": 315,
        "comments": 341,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I4bTsG7dIX5UUd0h8fw9t9LOWSir-HLMhVUlUwPrjQ0.jpg?auto=webp&amp;s=7319056ca6dd4928eecd36242182db2fcefb712a"
        },
        "permalink": "/r/movies/comments/1jlu0ts/what_is_a_small_scene_in_an_otherwise_less_than/"
    },
    {
        "id": "1jlvdpe",
        "author": "ladycourt_knee",
        "title": "Which movie would you wipe from your memory to experience again?",
        "content": "If you could erase one movie from your brain just to rewatch it fresh, what would it be? Interstellar blew my mind on the first watch, and I’d love to relive that experience. Like on IMAX if that happens. I love how immersive the experiemce was the first time watching it. Maybe Fight Club or The Sixth Sense for their twists? What’s your pick?",
        "upvotes": 213,
        "comments": 809,
        "media": null,
        "permalink": "/r/movies/comments/1jlvdpe/which_movie_would_you_wipe_from_your_memory_to/"
    },
    {
        "id": "1jm0pn2",
        "author": "ChiefLeef22",
        "title": "‘True Detective’ Actress Anna Lambe Joins Brad Pitt in David Ayer Directed, Damien Chazelle Produced ‘Heart of the Beast’ | It centers on a former Army Special Forces soldier (Pitt), who fights for survival with his combat dog after a plane crash strands them in the Alaskan wilderness.",
        "content": "",
        "upvotes": 95,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v1hANpf8iRkZdSu0qkA2P5BQExLaY9x5CxC0ptFX37o.jpg?auto=webp&amp;s=bb8e536ad93e86bbd2709b875a7b798f7a261c2e"
        },
        "permalink": "/r/movies/comments/1jm0pn2/true_detective_actress_anna_lambe_joins_brad_pitt/"
    },
    {
        "id": "1jme8k4",
        "author": "HoudeRat",
        "title": "Music videos based on movies",
        "content": "Anyone remember more like these, that are based on, paying homage to, or parodying specific movies, and feature established film actors? Not looking for videos of songs released on the soundtrack for the movie in question. There are a ton of those.  \n  \n[\"Last Cup of Sorrow\" - Faith No More (Vertigo)](https://www.youtube.com/watch?v=gjEbHBafvm0), starring Jennifer Jason Leigh  \n[\"Rush Rush\" - Paula Abdul (Rebel Without a Cause)](https://www.youtube.com/watch?v=Ys1Y_ghrMYQ), starring Keanu Reeves  \n[\"Walking on Broken Glass\" - Annie Lennox (Dangerous Liaisons)](https://www.youtube.com/watch?v=y25stK5ymlA), starring John Malkovich/Hugh Laurie",
        "upvotes": 11,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y79J0rG5LouSdvbBOuZUhGcRnr0T-FjrbLMnjlIHBgA.jpg?auto=webp&amp;s=cd83b3c98984407dbcede5fd271862abd7c224f7"
        },
        "permalink": "/r/movies/comments/1jme8k4/music_videos_based_on_movies/"
    }
]