[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 481,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h6h49s",
        "author": "misana123",
        "title": "‘Wednesday’ Season 2 Wraps Production",
        "content": "",
        "upvotes": 90,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1h6h49s/wednesday_season_2_wraps_production/"
    },
    {
        "id": "1h6xigq",
        "author": "camiliski",
        "title": "Leave The World Behind 👂💥",
        "content": "#spoilers. \nthis movie. This movie bout PISSED me tf off. \nlikeeee, it needs more. \nThe mom finding the daughter. \nThe boy that’s sick. Getting better or ???\nThe adults locating the bunker. \nFINDING OUT WHATS REALLY GOING ON..??!  Like hello. Cliffhanger or just a LAME @$$ ending??! So mad. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6xigq/leave_the_world_behind/"
    },
    {
        "id": "1h6xaru",
        "author": "indiewire",
        "title": "15 Best New TV Shows of 2024",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6xaru/15_best_new_tv_shows_of_2024/"
    },
    {
        "id": "1h6qe3a",
        "author": "VisualDapper",
        "title": "Anyone else unable to watch their shows after new ui on iOS?",
        "content": "Netflix auto updated and I am now unable to see my continue watching list and when I go to search for my show there’s no option to play an episode only a “remind me” button. Is anyone else experiencing something similar?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h6qe3a/anyone_else_unable_to_watch_their_shows_after_new/"
    },
    {
        "id": "1h6lhs9",
        "author": "Accomplished-Dress-9",
        "title": "Black subtitles",
        "content": "Suddenly my white normal subs have turned black on the tv. The serie itself is dark so i cant see them.. how do i change them? I tries the settings on netflix tv app",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6lhs9/black_subtitles/"
    },
    {
        "id": "1h6tad4",
        "author": "unitedfan6191",
        "title": "What upcoming (live or pre-recorded) shows or movies are you looking forward to watching in 2025?",
        "content": "Hi all.\n\nHope you’re doing well.\n\nThis is not a suggestion thread, but a discussion about what especially intrigues you about upcoming movies or shows.\n\nI am *really* looking forward to Wallace &amp; Gromit: Vengeance Most Fowl because I’ve always been a fan of stop-motion animation and grew up watching Wallace &amp; Gromit and key creative personnel from the original (including the original creator) are returning. \n\nMaybe it turns out to be nostalgia bait, but that’s not something I will hold against it before it’s released.\n\nI am also curious how Netflix handles regular live programming for the first time with the WWE.\n\nWhat about you?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6tad4/what_upcoming_live_or_prerecorded_shows_or_movies/"
    },
    {
        "id": "1h6huad",
        "author": "Atlast_2091",
        "title": "Sakamoto Days | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6huad/sakamoto_days_official_trailer_netflix/"
    },
    {
        "id": "1h6ttmg",
        "author": "EnvironmentalAd1988",
        "title": "Changing internet providers",
        "content": "Will I be locked out of my netflix when I change internet providers tomorrow. Obviously I will have a new IP address so will netflix lock me out because it won't think I'm part of the household? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ttmg/changing_internet_providers/"
    },
    {
        "id": "1h5p4yu",
        "author": "aresef",
        "title": "‘Cunk On Life’ Netflix Special Sets January Premiere Date",
        "content": "",
        "upvotes": 183,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h5p4yu/cunk_on_life_netflix_special_sets_january/"
    },
    {
        "id": "1h6ndby",
        "author": "ProcedureNo2050",
        "title": "Why arcane disappeared from my netflix?",
        "content": "I started to watch season 2 of arcane and today i opened netflix and i cant find arcane with any kind of search? Does anyone know what could be the cause for this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ndby/why_arcane_disappeared_from_my_netflix/"
    },
    {
        "id": "1h6nbbo",
        "author": "realjacksonluck",
        "title": "The Merry Gentlemen Netflix Christmas Moive MC Is See Through",
        "content": "Anyone else notice that at about 19mins 10 seconds (1hr 8mins 36sec Remaining) Ashely goes somewhat see through XD. Idk why that would happen. I don't see a reason why they would have had to record her on a greenscreen and then add her in post. But thats the only thing I can think of that happened. Anyone else have a better idea?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6nbbo/the_merry_gentlemen_netflix_christmas_moive_mc_is/"
    },
    {
        "id": "1h6l3oh",
        "author": "creel_mg",
        "title": "Will be gifting Netflix to my sister for her birthday",
        "content": "I have never purchased Netflix but want to gift at least an year of subscription to my sister. In India, there is no option to have a Netflix gift card but there are workarounds to this. My main concern is that I was initially thinking of buying the Standard Plan (499 INR : 5.89 USD per month) which supports 2 concurrent devices on a household network but I can also afford the Premium Plan (649 INR : 7.66 USD per month) which supports 4 devices. The all time big question - will it be possible to have 2 devices on one wifi at my house and 2 devices on my sister's wifi in her house. She is married but it is possible for us to bring the 4 devices on the same network at least once a month. Will this work with the netflix household? Please any help is appreciated.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h6l3oh/will_be_gifting_netflix_to_my_sister_for_her/"
    },
    {
        "id": "1h6k9tm",
        "author": "gougluinn",
        "title": "netflix videos are too dark!",
        "content": "hello videos are too dark on netflix and netflix doesnt have adjust video brightness feature and they also banned/blocked 3rd party addons i guess because the screen goes black when i increase brightness via 3rd part addons on chrome.\n\nso how can i increase brightness? right now movies are not watchable.\n\nor maybe microsofts stupid hdr feautre causes this who knows??",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h6k9tm/netflix_videos_are_too_dark/"
    },
    {
        "id": "1h6f0pj",
        "author": "S4v1r1enCh0r4k",
        "title": "It seems that 'Quicksilver' romantasy adaptation is coming to Netflix, they won the bidding war with a massive 7-figure deal",
        "content": "",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h6f0pj/it_seems_that_quicksilver_romantasy_adaptation_is/"
    },
    {
        "id": "1h6ekw5",
        "author": "Fresh_Elevator7063",
        "title": "Inside Man - Grieff’s Wife ",
        "content": "I might be a little late on this but after finally watching, here’s my take: \n\nGrieffs wife may have walked in on him cheating. That line, \"If you love someone, don’t come home early,\" feels like a major hint. In a fit of rage, she strangles his mistress. Grieff, out of love or guilt, decides to take the blame. Since he’s a criminal psychology expert, he stages everything to make it look like he killed his wife in a moment of madness. She goes into hiding in the UK. \n\nIt seems like the police simply accepted Grieff’s confession and didnt do any further investigating. All they focused on was finding the missing head - to bury her body whole. Grieff knows that if they were ever to find the head it would show that the woman they buried was not his wife ...\n\nFast forward to when Janice bumps into Beth on the train. Although she'd been the one to publicly stand up for Beth, she is very reluctant to chat further and refused multiple times to be interviewed. She also mentioned not having Facebook. She had a very \"loner\" attitude and didn't want to be in the public eye.  \n\nBeth then received the distress message from Janice and essentially starts the process of finding her \"friend\" with Grieff... after long debate. \n\nAlthough Grieff has insane resources at hand.. he seems to know just that little bit more about Janice as the investigation continues. He knew that she had a Skype call with her sister that she never misses... did he know that because he knew his wife would never abandon her sister... even if she was in hiding ...The matter of how he got that information before getting into her apartment is suspect. \n\nWhile Janice is trapped she is very strategic and understanding of her circumstances. Taking very tactical measures in attempt to escape... leading me to believe she has this knowledge from growing up with a mafia dad or (more likely) from being married to a criminal psychologist... she's not just a regular math tutor. \n\nAs we all know, the Vicars wife is killed and he is arrested. Him and Grieff are shown on a call together. The Vicar argues to Grieff that he is not a murderer and he did not murder anyone. To which Grieff replies.. \"Oh you didn't murder Janice - But if you hadn't have acted the way you did, would your wife still be alive?\" \n\nHe wants the Vicar to understand that it was solely his actions that resulted in someone's death.. just as his had resulted in the same. They're not so different after all. \n\nNow, let’s talk about the scene where Janice visits Grieff on death row. Their interaction feels... familiar, more than a mere acquaintance from the ordeal. \nDillon’s grin when the guards leave the room shows that there is a mischievous atmosphere between them. \n\nWhen Janice says, \"I understand you'll be dead in a week,\" Grieff replies with, \n\"Do you? Personally, I'm having a little trouble with the fact of my execution.\" \nThe way he emphasizes \"fact of my\" feels like he’s mocking her slightly. \n\nJanice explains why she’s meeting with them - her husband's murder. Dillon says \n\"With all due respect, you do know your husband isn’t actually dead.\" \nHis mannerisms seem like he's hinting towards an inside joke. \nJanice’s response, \"No, but he deserves to be,\" obviously still holding on to a bit of cold blood and referring to his betrayal. \n\nShe asks him why he seems surprised at this.. \n\nGrieff then says, \"This is death row, Janice. We're all murderers here,\" and she grins knowingly... as, theoretically, there are 3 murderers in that room. \n\nIt feels like Janice, after being saved by her husband for a second time, and hearing that he will be executed in a week (because he refused to give up the head/real story), had a change of heart and wanted to plan how they could get away with his \"murder\" and ultimately break him out. \n\nAs for Janice’s father, his involvement in shady stuff—maybe CSAM— that might explain why Janice was so (annoyingly) triggered by what was on the flash drive.\n\nMaybe introducing an impulsive gangster of a father hints towards why she’s a bit of a psychopath herself.\n\nAnd maybe that’s why Beth doesn’t write the story... She knows the truth now and wants to protect her identity.\n\nAny thoughts? \n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ekw5/inside_man_grieffs_wife/"
    },
    {
        "id": "1h68f87",
        "author": "HeliumRhenium",
        "title": "the snow sister",
        "content": "has anyone watched this?! what did you think?? need someone to talk to about it 😭😭😭\n\nknew it was gonna be sad and could also tell that twist was coming BUT it still broke heart...I cried so much 😭😭😭\n\nseeing how depression is expressed differently between the adults and children is so subtle but deeply moving. the ice skates scene...oof. \n\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h68f87/the_snow_sister/"
    },
    {
        "id": "1h68nnc",
        "author": "Best_Mammoth_9589",
        "title": "The Hollow Season 2 sucks",
        "content": "Season one is possibly one of my favorite shows of all time. It was so engaging and intriguing and the characters felt authentic and well rounded the world building was interesting, and while I didn’t like how they went to real people at the end, I was so excited for season two. \n\nSeason two, we start out extremely confused. It feels like season one was all for nothing, seeing as they are still in the game for some reason. Time passes, the characters keep doing the video game thing, but somethings off. Anyway, long story short, season two doesn’t have the main characters in it at all. These are clones, perfect copies yes but they aren’t the original MCs. The original characters are in the real world. I figured this out on episode three. Unlike with the original season one, I immediately knew what was going on pretty much from the get go. \n\nIesperately want to know what happened from there? But I guess we will never know seeing as it got canceled. Not surprised how bad that season was. I would’ve loved it if we had gotten a take two almost. They are a team are they not? They would play hollow over and over again. I would’ve loved to see the same three characters in a different  game of hollow. perhaps new sides of their characters and dynamics would show in different environments? Starting from scratch, no memories. Alternatively, I would’ve loved to see how their lives continued in the real world after the game. Their relationships, etc, etc. What we got was so boring and low stakes in comparison.\n\n  \napparently, a lot of people loved it. So happy for you. I am not there, I don’t think I will ever be there. please don’t yell at me for having a different opinion.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h68nnc/the_hollow_season_2_sucks/"
    },
    {
        "id": "1h5truk",
        "author": "Horror_Effective12",
        "title": "'The Madness' Review - Is it actually binge-worthy?",
        "content": "",
        "upvotes": 31,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1h5truk/the_madness_review_is_it_actually_bingeworthy/"
    },
    {
        "id": "1h67ljv",
        "author": "gumbo100",
        "title": "Unable to cast Netflix and only Netflix, other apps work fine",
        "content": "I can't cast from my laptop or my phone. This is the second time I've restarted my subscription and had this problem. I could really use some TV right now and would appreciate the help.\n\nI've updated my app/browser. I've made sure the chromecast has powered down and then turned back on. They are for sure on the same wifi - other apps work. I simply have no clue what the issue is",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h67ljv/unable_to_cast_netflix_and_only_netflix_other/"
    },
    {
        "id": "1h66q04",
        "author": "TumbleweedCold5792",
        "title": "Dimming problems due to Dolby vision (I think)",
        "content": "So, I was trying to watch a show and whenever I watch it, regardless of how bright I make my screen, it dims down heavily. Anyone solve this or is it just me? I’m using an iPhone to watch I should mention. I think it may have to do with Dolby vision, but I’ve looked through my settings and found nothing. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h66q04/dimming_problems_due_to_dolby_vision_i_think/"
    },
    {
        "id": "1h5nkq3",
        "author": "reddittiess",
        "title": "Subtitle font colour stuck in black",
        "content": "TV Netflix substitute stuck in black font. No matter what style I change it to, it always goes back to black font colour. It’s really hard to read, any help is appreciated ",
        "upvotes": 52,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1h5nkq3/subtitle_font_colour_stuck_in_black/"
    },
    {
        "id": "1h6li1g",
        "author": "thepamer",
        "title": "Netflix app deleates downloades",
        "content": "Since i changed my normal abonnement to the ad abonnement the netflix app keeps deleating my downloads. I can only download 15 episodes per month with this Abonnement, so this is an issue for me. \n\nI tried netflix Support but they said they cant help me. \nI tried changing netflix app settings but this didnt help. I also changed the saving place from phone to sd card, but this didnt work. \nI checked my cleaning apps, i didnt install one. Just one pre installed one that i cant delete. When i use this one with an episode downloaded, the episode doesnt disappear. \n\nI have a Xiaomi 11 Lite with Android 14UKQ1.231108.001\n\nIf someone has an idea to fix this, this would help me a lot. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h6li1g/netflix_app_deleates_downloades/"
    },
    {
        "id": "1h5yman",
        "author": "Same_Celery_6273",
        "title": "netflix with ads but almost none",
        "content": "i watched breaking bad from start to finish and i think i got like 5 ads the whole series. hbo max or peacock have like 5 ads every episode. 7 bucks for this seems like a steal",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h5yman/netflix_with_ads_but_almost_none/"
    },
    {
        "id": "1h6o598",
        "author": "Hentai_Cop",
        "title": "Student who uses family’s account",
        "content": "I’m a student who lives away from home and I use my family’s netflix account. Netlfix usually doesn’t recognize the IP of my student living as my household and I would normally use the “im traveling” option but recently that option disappeared for me and now I cannot use the app. Is there any workaround for this? The platform just feels very anti-family.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h6o598/student_who_uses_familys_account/"
    },
    {
        "id": "1h6bzo9",
        "author": "daily_mirror",
        "title": "First Look Review: That Christmas on Netflix from Love Actually's Richard Curtis",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6bzo9/first_look_review_that_christmas_on_netflix_from/"
    },
    {
        "id": "1h6aj61",
        "author": "crazywave83",
        "title": "Netflix subtitles semi transparent dolby vision… no more?",
        "content": "Hi all. I changed subtitles appearance in the Netflix website to semi transparent some years ago… everything was fine on my OLED TV until yesterday. Now everithing in dolby vision has too bright subtitles. No dolby vision content/SDR is ok with semi transparent subtitles. Does Netflix changed something? I tried also reinstalling the app but nothing changed. Thank you",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h6aj61/netflix_subtitles_semi_transparent_dolby_vision/"
    },
    {
        "id": "1h6agoi",
        "author": "ErosUno",
        "title": "Netflix through FIOS issues ",
        "content": "Since last month Netflix decided my home TV was too old for them to allow me to use. I now must stream through my FIOS. The FIOS remote only responds when it feels like and gets stuck routinely. Is there anything that I can possibly do?  I've tried streaming via phone and the feed starts chattering at random. I am getting ripped off by Netflix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6agoi/netflix_through_fios_issues/"
    },
    {
        "id": "1h656b9",
        "author": "Short-E-8814",
        "title": "One more “extra member” notification and I’m cancelling Netflix for a while.",
        "content": "I've been getting these \"extra member\" notations telling me to add an extra member because it detects more than two users. But I don't have more than two users. Netlflix thinks one device is permanently showing even though it's off. They're tying each account to a device. F that. Give me one more notification, I'm out. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h656b9/one_more_extra_member_notification_and_im/"
    },
    {
        "id": "1h6504j",
        "author": "Donceko",
        "title": "Cancelled extra member slot but still being forced to activate account?",
        "content": "Hi, I may have accidentally created extra member slot which I not need. I have already cancelled extra member slot but I am still forced to create an account for extra member. I can't watch anything unless I do it. I don't mind paying £5 extra this month as I have cancelled this membership slot so I won't be charged for the next month. What do I do?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6504j/cancelled_extra_member_slot_but_still_being/"
    },
    {
        "id": "1h696qi",
        "author": "investorhalp",
        "title": "Help Identifying the Song from \"Dear Sa-chan\" (Sacchan, Boku wa.) Episode 8",
        "content": "Hi everyone,\n\nI’m trying to find a specific song from *Dear Sa-chan* (Sacchan, Boku wa.) Episode 8, which aired in 2024. The track plays around the 11-minute mark, and I’ve tried using Shazam to identify it, but no luck so far. Does anyone happen to know the name of this song or the artist?\n\nIt’s really sticking with me, and I’d love to add it to my playlist. I’ve checked online, but so far, I haven’t been able to find any details. If anyone has an idea or can point me in the right direction, it would be greatly appreciated.\n\nThanks in advance for your help!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h696qi/help_identifying_the_song_from_dear_sachan/"
    }
]