[
    {
        "id": "1mthrxd",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 747,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mthrxd/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1muv1um",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Osasuna, La Liga, Match 1",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1muv1um)",
        "upvotes": 136,
        "comments": 364,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muv1um/post_match_thread_real_madrid_vs_osasuna_la_liga/"
    },
    {
        "id": "1muvbv0",
        "author": "Ready_Ad_1353",
        "title": "Mbappe is the Man of the Match",
        "content": "",
        "upvotes": 924,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0owp5g8jl1kf1.jpeg?auto=webp&amp;s=4c281ed919019727f4a74e7ab57596030631163c"
        },
        "permalink": "/r/realmadrid/comments/1muvbv0/mbappe_is_the_man_of_the_match/"
    },
    {
        "id": "1mv88ds",
        "author": "ivar_theB",
        "title": "Nice play from mbappe but…",
        "content": "I dont know about u guys but a hated the passe choice he did at the end, there was plenty of Space on the center and left side to have a good attack… \n\nvery desapointed for the behavior dribbling 3 players is good but doin it to open up the play and speed up the attack is even better\n\nGood game anyway from KM10\n",
        "upvotes": 131,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rpp53804o4kf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mv88ds/nice_play_from_mbappe_but/"
    },
    {
        "id": "1mutg65",
        "author": "bezaalopez",
        "title": "How is this not a foul ?? I can't take this league anymore!!",
        "content": "Every game these referees cheat against us and then we are the ones who are \"helped\". And it wasn't just this one incident, in today's match alone there were 3 or 4 similar ones. In this match no one might pay attention, but when we are playing against better teams every play matters and this can't happen in either big or small matches.\nI'm only posting this because every season this happens and nothing changes.",
        "upvotes": 565,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4xvzcfs791kf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mutg65/how_is_this_not_a_foul_i_cant_take_this_league/"
    },
    {
        "id": "1murz10",
        "author": "No-Independent2522",
        "title": "The new interior corridor in Bernabeu",
        "content": "",
        "upvotes": 606,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8g3xehcmz0kf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1murz10/the_new_interior_corridor_in_bernabeu/"
    },
    {
        "id": "1muv8cz",
        "author": "FearlessWasFounded",
        "title": "I see so many deadbrain \"Madrid fans\".",
        "content": "This was literally the first match of the season, we had 71% possesion with a team parking the bus and playing 6 at the back, they literally just came to Bernabeu for a draw. Vinicius was starting to dribble again and tried making chances today and some people are saying \"Oh Vini Mbappe isn't going to work.\" Mbappe is literally our Centre Forward, how do you expect him to find spaces when there are 2 to 3 players always surrounding you? And then there are those players who say \"Rodrygo &gt; Vini.\" Yeah sure. If he ever gets gametime. No disrespect to Rodrygo but what is the point of comparison when the guy is uncertain about his future at the club? Yes he is a great dribbler but Vinicius also performed better than the dogshit he was dropping since the past 6 months. We just have to be patient it's the FIRST MATCH of the season. ",
        "upvotes": 179,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muv8cz/i_see_so_many_deadbrain_madrid_fans/"
    },
    {
        "id": "1muph98",
        "author": "EndouShuuya",
        "title": "Gareth Bale SUPERGOAL with Brazilian Commentary (I'm Brazilian Madridista)",
        "content": "To remember, what a great goal!",
        "upvotes": 336,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6bsw9r2xh0kf1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1muph98/gareth_bale_supergoal_with_brazilian_commentary/"
    },
    {
        "id": "1muvha5",
        "author": "KjOnReddit1010",
        "title": "🚨⚠️ Zero minutes again for Rodrygo tonight as he was unused sub against Osasuna.\n\nManchester City want Rodrygo but will only try if Savinho goes to Tottenham — and that move is still not advancing, blocked by #MCFC hierarchy as of now.",
        "content": "",
        "upvotes": 102,
        "comments": 76,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muvha5/zero_minutes_again_for_rodrygo_tonight_as_he_was/"
    },
    {
        "id": "1mv2g6q",
        "author": "Even_Truck_9032",
        "title": "Vini and Trent hate....",
        "content": "Ill start with my stand , they were below par , but they were not as bad as people are making it out to be. We genuinely need to have a lot of patience and manage expectations this season. We wont be winning every game by a 4 goal margin , especially not against a low block. PSG project took time , so will this. \n\nNow coming to Vini and Trent , vini was tracking back , thats a step forwards , thats enough , one step at a time. Trent was playing in front of the bernabeu crowd for the first time and he has a risk taking role( Passes to break the lines) sometimes it works , sometimes it doesn't. Stop being reactionary and trust. Only time will tell. ",
        "upvotes": 39,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv2g6q/vini_and_trent_hate/"
    },
    {
        "id": "1mudb3o",
        "author": "Hockeynerden",
        "title": "Valverde back from Injury",
        "content": "",
        "upvotes": 834,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zgcgezsxzxjf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mudb3o/valverde_back_from_injury/"
    },
    {
        "id": "1mv7fl9",
        "author": "Ready_Ad_1353",
        "title": "How did the new boys fare in their La Liga Debut?",
        "content": " Carreras - He was a sight for sore eyes as he was the brightest among the new signings and we finally have a left back with attacking threat.\n\nHuijsen- Confident on the ball and had few cracks that will eventually lead to golazos later. \n\nTrent - He had an average game but i think he will grow into his role as he was too cautious and not as adventurous as i know him to be. Had a few good crosses but was tentative with his approach to the game.\n\nMastuntaono - His brief cameo  was eye catching, i thought he will struggle being that young in his debut but he changed the game with how he dictated play and was demanding the ball at all times.",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv7fl9/how_did_the_new_boys_fare_in_their_la_liga_debut/"
    },
    {
        "id": "1mupxpc",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs CA Osasuna Live Score | LaLiga 25/26 | Aug 19, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1mupxpc)",
        "upvotes": 111,
        "comments": 3091,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mupxpc/match_thread_real_madrid_vs_ca_osasuna_live_score/"
    },
    {
        "id": "1murnbq",
        "author": "jsh425",
        "title": "Steve McManaman on when the first Galáctico era went wrong",
        "content": "He says it wasn't when Figo or Zidane came. It was when Beckham came:\n\n[https://www.thefootballweekend.com/p/steve-mcmanaman-real-madrid-galacticos](https://www.thefootballweekend.com/p/steve-mcmanaman-real-madrid-galacticos)",
        "upvotes": 88,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4n3vvj7ax0kf1.png?auto=webp&amp;s=c6e9a80315515d679a0a340fcd7c25a55546dae0"
        },
        "permalink": "/r/realmadrid/comments/1murnbq/steve_mcmanaman_on_when_the_first_galáctico_era/"
    },
    {
        "id": "1mupe8m",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Osasuna",
        "content": "",
        "upvotes": 110,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mupe8m/our_starting_𝗫𝗜_osasuna/"
    },
    {
        "id": "1mur4hd",
        "author": "fifaddict-barna",
        "title": "feeling ready for the new season now! Hala Madrid Y Nada Mas 🤍",
        "content": "",
        "upvotes": 89,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eo2x1ygdu0kf1.jpeg?auto=webp&amp;s=bfc27af3534f099ac691d3bbf82c7dcf4cc911e6"
        },
        "permalink": "/r/realmadrid/comments/1mur4hd/feeling_ready_for_the_new_season_now_hala_madrid/"
    },
    {
        "id": "1muji83",
        "author": "MammothCucumber9974",
        "title": "Xabi Alonso admits Trent Alexander-Arnold not guaranteed Real Madrid start - ‘Not going to be about being fair’... Thoughts on Trent or Carvajal starting as right-back?",
        "content": "# \"Xabi Alonso has admitted that Trent Alexander-Arnold is not guaranteed to start for Real Madrid, with Dani Carvajal returning to fitness after rupturing his anterior cruciate ligament last season. Alexander-Arnold's arrival from Liverpool was Real's most high-profile piece of business this summer, but he may have to split game time with the Spaniard, who came fourth in the Ballon d'Or last year.\" \n\nThoughts? Have you seen enough from Trent to think he should be first-choice right-back? I know he was a free transfer, but still Trent was a high-profile signing. Personally having watched a lot of Liverpool, Trent can definitely be a defensive liability, especially in 1v1s, but offensively he can make attacking passes that very few other players can. I suspect Alonso will make his choice as the season progresses and based on the opponent's style of play/wingers that would matchup against right-back.   \n",
        "upvotes": 208,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muji83/xabi_alonso_admits_trent_alexanderarnold_not/"
    },
    {
        "id": "1muvsbh",
        "author": "SDTRRDTS",
        "title": "First game of the season",
        "content": "I think that the game was good. \nOf course we should tweak a lot of things but I got a good feeling from the game.\nAbout newcomers:\nHuijsen: a lot of quality in this guy, I would like to compare him to Jude - he is very mature and confident, can’t be more happy for our defence with him.\nTrent: he is shy at the moment, but I think it’s natural and eventually he will integrate. He was outplayed a couple of times but I think he will get better, for now his passes aren’t working like in Liverpool but again I think it will come.\nCarreras: a decent game from him , he got pace and he is aggressive in defending which is beneficial.I think he and Fran gonna give us a solid stack for the season.\nFranco M. : can’t tell much but I can see his potential.\n\n\nSo, Xabi is basically cooking for a month+ and I can see the positives : energy, desire, running, motion.\nStill there is some of Ancelotti’s habits but it will go away. Those habits could be labeled as a con in today’s game , we just need some time.\nI think in 5 matches and throughout them we’ll get to clicking.\n\nLots of “buts” but I will stay positive.\n\nBTW, happy for Carvajal and it was not good to see him falling down near the end of match.",
        "upvotes": 43,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muvsbh/first_game_of_the_season/"
    },
    {
        "id": "1muwfx2",
        "author": "Aggressive_Catch_163",
        "title": "Real Madrid 1- 0 Osasuna Kylian Mbapee 55\" Goal Short",
        "content": "",
        "upvotes": 35,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1muwfx2/real_madrid_1_0_osasuna_kylian_mbapee_55_goal/"
    },
    {
        "id": "1muqxro",
        "author": "the_second_of_them",
        "title": "Can you guys help me name all the players in this squad? Of course I know the obvious ones, but there are some I'm lacking. Thanks!",
        "content": "",
        "upvotes": 64,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/71hkm80xs0kf1.jpeg?auto=webp&amp;s=a28953707ffb985597d64cebc1be5a90dc8e9274"
        },
        "permalink": "/r/realmadrid/comments/1muqxro/can_you_guys_help_me_name_all_the_players_in_this/"
    },
    {
        "id": "1mv80tp",
        "author": "ColdAd3682",
        "title": "Fede Valverde looked weird last night",
        "content": "Is it just me or anyone else noticed that Fede looked really out of role last night. He looked really weird off the ball like I don’t know how to clearly say it. I feel like he wasn’t given a particular clear role or any instructions yesterday. He played in a kinda like a 10 position for the first half. Where he was really like nullified. He was on the ball more in the second half. I feel like his best position is on the right hand side of the midfield with Guler operating in the centre. Yesterday I felt like he was one player with the least impact for the team with Trent . This is not a criticism at any point by the way I know how much he means to us we all absolutely adore him. But last night felt kinda weird.",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv80tp/fede_valverde_looked_weird_last_night/"
    },
    {
        "id": "1mv0wsy",
        "author": "Hour777",
        "title": "What went wrong with Eden Hazard at Real Madrid?",
        "content": "I’ve always been curious about Hazard’s time at Madrid. At Chelsea he was world-class, one of the best attackers in Europe, but at Madrid he never really got going. Was it just injuries holding him back, or was there more to it?\n\nSome people say his fitness wasn’t great, others think the pressure of being the big signing after Ronaldo was too much. Personally, I feel like he just had terrible luck with timing and every time he started to look sharp, he picked up another injury.",
        "upvotes": 13,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv0wsy/what_went_wrong_with_eden_hazard_at_real_madrid/"
    },
    {
        "id": "1mubsow",
        "author": "Ready_Ad_1353",
        "title": "[ESPN] Vinícius Júnior contract talks have been stalled with Real Madrid for weeks. The club offered a fixed 20M per season, but the player's camp wanted extra 10M as variables. Now the agents have opted to wait and see how 2025-26 season progresses,",
        "content": "",
        "upvotes": 290,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/74irVgY9jIXyZzwktUeUfUQNub4VWA6HfprxflD5YGA.jpeg?auto=webp&amp;s=9d1ed9ea3413276cb11e31be93600a8e8df753cd"
        },
        "permalink": "/r/realmadrid/comments/1mubsow/espn_vinícius_júnior_contract_talks_have_been/"
    },
    {
        "id": "1murfsz",
        "author": "Football4Ever123",
        "title": "It's not Vini vs. Mbappe",
        "content": "I just opened my local broadcaster for the game against Osasuna, and the commentators were talking about Vini and Mbappe and on the screen the words \"Vini vs. Mbappe\" with stats.\nIt just had me dismayed.\nHow are two teammates against each other, literally the word - vs, against.\nWhy? The team is a team and should not be pitted against each other in such a fashion.\nIt just has me angry.",
        "upvotes": 32,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1murfsz/its_not_vini_vs_mbappe/"
    },
    {
        "id": "1mugji7",
        "author": "No-Independent2522",
        "title": "RealMadrid on X: 💫Zidane's Debut💫  🗓 08/19/2001",
        "content": "",
        "upvotes": 92,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fztuq3jovyjf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mugji7/realmadrid_on_x_zidanes_debut_08192001/"
    },
    {
        "id": "1mupia5",
        "author": "Fit-Hovercraft2340",
        "title": "Investing in Vini jr. stock for the season",
        "content": "Many must have lost any hope from vini jr. for the season and the future but i m investing in him for the season, he's gonna prove everyone wrokg and shut his haters mouth. He's gonna give his best for the team and will make up win many games alone.\n\nHe earned his place in the 11 in 2021/22 and now when his place is at risk, he'll show the world why he has been the best player in the world for over 4 years now.\n\nI m with him and i think he'll do it...\n\nUnder xabi we'll see a new vini jr. who presses like a monster and will go on to make us win.\n\nHala Madrid!",
        "upvotes": 25,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mupia5/investing_in_vini_jr_stock_for_the_season/"
    },
    {
        "id": "1mv9k7f",
        "author": "VermicelliNo864",
        "title": "Who are the authors of markstats.club? Do you know of any other such platforms?",
        "content": "Does anyone know how I can connect with the owners of this platform. I am looking to experiment with the data they are producing via api, but I cant find a way to connect with them.\n\nIf not, can someone help me with other such API's that generate kind of informative data about a match as they do?   \nI am buiding a personal project, so cant pay hefty fees for this atm. Maybe when I have something on my hand I can look for a business partnership, but right now I just want to play around with the data.\n\nMarkstats have a bot that posts match analytics like one's below.  \n\n\nhttps://preview.redd.it/feky5tj435kf1.png?width=1694&amp;format=png&amp;auto=webp&amp;s=81063e7527d05fd3bf4a56cc90989a5ff39f7ddb\n\nhttps://preview.redd.it/39dl7lj435kf1.png?width=1398&amp;format=png&amp;auto=webp&amp;s=2b171039768be645eb5df5af4d5959d672430bca\n\nhttps://preview.redd.it/0alooxl435kf1.png?width=2486&amp;format=png&amp;auto=webp&amp;s=63f023c44656de482613698f525a60486439afc1\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mv9k7f/who_are_the_authors_of_markstatsclub_do_you_know/"
    },
    {
        "id": "1mtv430",
        "author": "zblbolapills",
        "title": "Xabi Alonso's reaction to one of Franco's screamers in training is hilarious 😭",
        "content": "",
        "upvotes": 991,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mtv430/xabi_alonsos_reaction_to_one_of_francos_screamers/"
    },
    {
        "id": "1mundyd",
        "author": "DapumaAZ",
        "title": "Espanyol Date Confirmation + kickoff time",
        "content": "i will be traveling and wanted to catch a game \n\nEspanyol date shows the 21st on espn however the official site is showing 20th and the date and time are not set - espn has the rights here in the US so i am assuming they know the date, however maybe not - when do we actually know when the date of the match is confirmed - kickoff time would be nice, however i am guessing that is set at a different time ?",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mundyd/espanyol_date_confirmation_kickoff_time/"
    },
    {
        "id": "1mup9o0",
        "author": "archetype_7",
        "title": "PSA: Fancode India is running limited time 50% off early bird offer for La Liga season pass",
        "content": "You get flat 50% off + additional discounts with BUSGAP2CD. First it showed 999 for season pass but with the code it ended up being 400rs for me\n\nI tried with my old account at first but it didn't work. So made a new account and got total 60% off original price lol. \n\nI’m sharing it with a friend of mine since Fancode allows 2 simultaneous streams so it's more cheaper now. Idk if the early bird offer will stay much longer so thought of letting y'all know\n",
        "upvotes": 3,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mup9o0/psa_fancode_india_is_running_limited_time_50_off/"
    },
    {
        "id": "1mto0mq",
        "author": "L0nEspartan",
        "title": "Squad list for Osasuna game.",
        "content": "",
        "upvotes": 459,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ic7q7saqisjf1.jpeg?auto=webp&amp;s=7d2a6234267773c29239392a1992dde51cbae0b7"
        },
        "permalink": "/r/realmadrid/comments/1mto0mq/squad_list_for_osasuna_game/"
    },
    {
        "id": "1mtruam",
        "author": "Optimal_Lie7824",
        "title": "Predict our new season:",
        "content": "In my opinion, no bias:\n\nChampions League: Winners. PSG is falling apart (losing Donnarumma probably and of course showed they can lose when Chelsea beat them). Strong opponents: Chelsea, still beatable though; PSG of course but we can beat them; Liverpool too but still very beatable.\n\nLa Liga: 2nd place. Negreira league, can't do anything about it... LITERALLY. Idc what some of you will say here. ''Oh victim mentality'' ask Mallorca players. Easy.\n\nCopa del Rey: Winners. \n\nSupercopa de Espana: Winners. We beat atletico then barca just like 2 seasons ago.\n\nTell me yours.",
        "upvotes": 288,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6xnpnhj85tjf1.jpeg?auto=webp&amp;s=d524ea4e600c488e57539fb156c094f23b374e8a"
        },
        "permalink": "/r/realmadrid/comments/1mtruam/predict_our_new_season/"
    }
]