[
    {
        "id": "1qrcqeg",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CA Osasuna Promesas | Primera Federación, Matchday 22",
        "content": "#FT: CASTILLA 1:1 OSASUNA B\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\nRed card: Mikel Serrano (Osasuna) 41'\n\n1:0 César Palacios 45'+3 \n\n1:1 Roberto Arroyo 51' \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n🟥 41' - red card for Osasuna - Mikel Serrano leaps at knee height into Dani Yáñez - he doesn't connect fully, but the height of the challenge alone leads the referee to give a red card. After a challenge, she lets the card stand \n\n⚽ 45'+3 - GOLLLLL DEL CASTILLA, golazo de Palacios! - the ball is played out to the left wing, then back inside - Cestero lays it off to Palacios with a single touch, and he shoots first time and curls it perfectly into the top right corner from just inside the box \n\nHT - a very uneventful first half with both teams struggling to create danger, Osasuna struggling with terrible form and Castilla still insecure with their new coach ends with two bangs, as Osasuna needlessly get a player sent off and Castilla score a great goal to get themselves perfectly on track for the second half \n\n46' - second half underway\n\n⚽ 51' - Goal for Osasuna - unbelievable mistake by Valde, who doesn't get the pass off in time and gets the ball stolen in our half - Arroyo takes it and converts the 1v1 with Fran\n\n65' - incredible miss again by Manuel Ángel, whose shooting has been absolutely awful today - he's completely open after a great play by the team at the left side of the box, but he puts it wide from a good position with the outside of his boot \n\n🔄 68' - Arnu, on loan from Valladolid, makes his Castilla debut, coming on for Loren\n\n🔄 74' - Mesonero and Leiva on for Manuel Ángel and Thiago Pitarch \n\n🔄 89' - Yáñez and Palacios off for Pol Fortuny and Bruno Iglesias \n\nFT - an absolute embarrassment of a performance, letting the win slip away against 19th placed Osasuna who haven't won a match in months, playing against 10 men for more than an entire half. Bad start into Julian López' era with 2 points out of a possible 9 and the team portraying a very bad image  today - the team can drop to as low as 9th place this matchday \n\n&amp;#x200B;\n\n**Kickoff:** 19:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Eugenia Gil Soriano \n\n**Competition:** Primera Federación, Grupo 1, Matchday 22\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas ‘Valde’, Mario Rivas, David Jiménez - Jorge Cestero, Manuel Ángel (74' Dani Mesonero), Thiago Pitarch (74' Álvaro Leiva) - César Palacios (89' Bruno Iglesias), Loren Zúñiga (68' Adrián Arnuncio 'Arnu'), Dani Yáñez (89' Pol Fortuny) \n\nBench: Sergio Mestre (GK), Guille Súnico (GK), Jesús Fortea, Lamini Fati, Cristian David. \n\nUnavailable: Joan Martínez (first team call-up), Manu Serrano (injury), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Julián López de Lerma\n\n&amp;#x200B;\n\n**Castilla last five matches:** LWLDL\n\n**1ª RFEF stats:** 7th | 32pt | 10-2-9 | 28:30\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrcqeg/match_thread_real_madrid_castilla_ca_osasuna/"
    },
    {
        "id": "1qs6q60",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] Real Madrid vs Rayo Vallecano, La Liga match 22",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qs6q60)",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs6q60/prematch_thread_real_madrid_vs_rayo_vallecano_la/"
    },
    {
        "id": "1qs48x8",
        "author": "ace-s",
        "title": "Ultra Sur prepares massive whistles against Florentino and the players",
        "content": "",
        "upvotes": 208,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs48x8/ultra_sur_prepares_massive_whistles_against/"
    },
    {
        "id": "1qs3zf1",
        "author": "Timely-Structure-905",
        "title": "Dread it… run from it… destiny arrives all the same. Benfica again in UCL playoffs. Are they inevitable?",
        "content": "",
        "upvotes": 129,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gnvibcw4pgg1.jpeg?auto=webp&amp;s=a1d4be74facf8c5eb0e355968ba8ee00065309c3"
        },
        "permalink": "/r/realmadrid/comments/1qs3zf1/dread_it_run_from_it_destiny_arrives_all_the_same/"
    },
    {
        "id": "1qs1vo1",
        "author": "Ready_Ad_1353",
        "title": "Eden Hazard asked if Chelsea was the best club he's played with: \"No, Madrid is better. My time at Chelsea was unbelievable but as a club, Madrid is the very best, Its number one. My dream was to play for Madrid when I was young, I always told to my dad that one day I want to play for Madrid.\"",
        "content": "",
        "upvotes": 167,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/00w95csnoogg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs1vo1/eden_hazard_asked_if_chelsea_was_the_best_club/"
    },
    {
        "id": "1qs38pd",
        "author": "ace-s",
        "title": "According to the club, I am not a Madridisa...",
        "content": "Thanks for the gaslighting Flo and Alvaro. I actually lost respect in him. The fans have the right to be mad and he goes and gaslights the fans?\n\nApparently\n\nI am not a Madridista for wanting only the players who preform to get minutes or when a player is not having a good game to get subbed out.\n\nI am not a Madridista for criticizing the club for constantly getting humiliated in big games and it being the players and board fault.\n\nI am not a Madridista for feeling embarrassed how they humiliated us infront of the entire world over a stupid award\n\nI am not a Madridista for being tired of our club constantly blaming its on everything on the managers or the referees and never the players or themselves.\n\nI am not a Madridista for feeling ashamed that a club \"captain\" throws a public tantrum during a time when the team is on a winstreak and finally we won Vs. them after constant humilation. Making it all about HIM and not the club\n\nI am not a Madridista for feeling offended that the club chose the players over the most exciting manager in the past few years who was also a club legend. Something EVERYONE knew that needs time and patience.\n\nI really hope they whistle at them.",
        "upvotes": 116,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs38pd/according_to_the_club_i_am_not_a_madridisa/"
    },
    {
        "id": "1qs4cyz",
        "author": "KabiX2",
        "title": "OTD in 2009 we signed Julien Faubert on loan, one of the football players of all time🔥",
        "content": "",
        "upvotes": 99,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yy8rwcno7pgg1.jpeg?auto=webp&amp;s=7a96ddcf05122e0da5007e96761fb2883a4c765a"
        },
        "permalink": "/r/realmadrid/comments/1qs4cyz/otd_in_2009_we_signed_julien_faubert_on_loan_one/"
    },
    {
        "id": "1qs645a",
        "author": "MrCubeCollector",
        "title": "Cristiano Ronaldo out of Rubik’s cubes",
        "content": "",
        "upvotes": 39,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6r8rlwswjpgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs645a/cristiano_ronaldo_out_of_rubiks_cubes/"
    },
    {
        "id": "1qs06wm",
        "author": "Majestic-Nobody-3178",
        "title": "Was thinking about this recently and 9/11 players from our 23/24 final starting lineup from 2 years ago still play for us. What the hell happened to some of these players man?",
        "content": "",
        "upvotes": 63,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5k51513f9ogg1.jpeg?auto=webp&amp;s=5560266a79a7e6a02222f265285b8f51609dbf54"
        },
        "permalink": "/r/realmadrid/comments/1qs06wm/was_thinking_about_this_recently_and_911_players/"
    },
    {
        "id": "1qs49cw",
        "author": "KabiX2",
        "title": "OTD in 2007 three Polish players joined Real Madrid academy",
        "content": "Krzysztof Król, Kamil Glik and Szymon Matuszek. Honestly it's quite unique story, because we got 3 players from quite uncommon nationality in La Liga and Real Madrid historically. All signed a contract for 3,5 years, but never debuted in the first team. Król trained in Castilla while the other two went to Real Madrid C.\nKról was a left back, he admired Roberto Carlos and he played U19 National team.\nGlik was a center back and he was bought from Union Deportivo Horadada where he made a good impression on Real Madrid squad. He had the best career out of these 3 and was a solid defender.\nMatuszek was a CDM and he was considered the most talented and came from a club called Pilar de la Horadada.\n\n",
        "upvotes": 33,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xwh4xxwx6pgg1.jpeg?auto=webp&amp;s=a86d059c0e3185eb512fcbaa5ace44b7ced2b532"
        },
        "permalink": "/r/realmadrid/comments/1qs49cw/otd_in_2007_three_polish_players_joined_real/"
    },
    {
        "id": "1qs7v1g",
        "author": "tfisthh",
        "title": "Context matters: Arbeloa’s comments",
        "content": "",
        "upvotes": 18,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9wuko2edvpgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qs7v1g/context_matters_arbeloas_comments/"
    },
    {
        "id": "1qrj5gl",
        "author": "Hot-Cantaloupe-6217",
        "title": "Crazy stats! I hope Mbappe keeps this momentum until we get the 9 reinforcement players we need to recover",
        "content": "",
        "upvotes": 426,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o9i88i7o4kgg1.png?auto=webp&amp;s=4de7bc36c0e0449afb922161f40d67321617f06f"
        },
        "permalink": "/r/realmadrid/comments/1qrj5gl/crazy_stats_i_hope_mbappe_keeps_this_momentum/"
    },
    {
        "id": "1qrbv9v",
        "author": "Far_Awareness4497",
        "title": "The lack of urgency from our players is disgusting",
        "content": "Most of players are not in form but that's not what infuriates me, it's the lack of effort that kills me. You can criticise Bellingham and valverde current form but These guys put in the effort. Unlike so many of our players. Look at tchouameni jogging to the post, he could have prevented the goal if he ran like valverde. Tchouameni is out of his depths, it's time the board sells him and make some profit now that he's still young and not completely finished.",
        "upvotes": 731,
        "comments": 134,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rq5owev6uigg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qrbv9v/the_lack_of_urgency_from_our_players_is_disgusting/"
    },
    {
        "id": "1qs661s",
        "author": "o6ohunter",
        "title": "Why do some fans believe anything they see from the media?",
        "content": "People on here read tweets from MadridZone, MARCA, whatever the source and just take it as absolute law. There are countless examples that I can’t just instantly recall, but I’ll use a recent example.\n\nJude’s been on the hot seat for a little now and the media’s out in full force. I saw a tweet bashing him for being at a party shortly after the Benfica loss. And this wasn’t just some small tweet, it had about a million or so views and counting. Quotes full of people mocking/ridiculing him. All that just for the picture used in the tweet to be a picture from 2024… This is the news our fanbase is consuming (and believing) day in and day out.\n\nAnd don’t let it be a player who’s currently disliked (such as Vini). When people who already don’t like a player see negative news about said player, all critical thinking goes out the window. That post affirms their bias so they’re not about to go fact checking or commit real thinking on it. Textbook confirmation bias. If it’s drama you want, there’s plenty of reality TV out there for you, but I guess it doesn’t quite scratch the itch of spreading false narratives of a player on a team you love and support.",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs661s/why_do_some_fans_believe_anything_they_see_from/"
    },
    {
        "id": "1qs7w2j",
        "author": "asensia-kopfschmerz",
        "title": "Arbeloa on the “untouchables”: “I always want the best players on the pitch. And the more minutes the stars are available to the team, the better…They can make a difference at any moment. There will be people who aren't Madrid fans and won't want them on the pitch.”",
        "content": "Álvaro Arbeloa: “I understand the debates, but I always want the best players on the pitch. And the more minutes the stars are available to the team, the better. In Villarreal, the goal came from a very good play by Vinicius, for example; the second one. They can make a difference at any moment. There will be people who aren't Madrid fans and won't want them on the pitch.”",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs7w2j/arbeloa_on_the_untouchables_i_always_want_the/"
    },
    {
        "id": "1qr2vn0",
        "author": "Ready_Ad_1353",
        "title": "Real Madrid to face Benfica in the UCL Knockout Playoffs",
        "content": "",
        "upvotes": 1505,
        "comments": 309,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i0c7j4rw1hgg1.jpeg?auto=webp&amp;s=1a7d1a4aaf04e1d8bb3640def10846328d616112"
        },
        "permalink": "/r/realmadrid/comments/1qr2vn0/real_madrid_to_face_benfica_in_the_ucl_knockout/"
    },
    {
        "id": "1qs26av",
        "author": "cyrusmancub",
        "title": "Squad list against Rayo",
        "content": "",
        "upvotes": 12,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs26av/squad_list_against_rayo/"
    },
    {
        "id": "1qr73so",
        "author": "Dangerous_Tip_4985",
        "title": "I prefer not to speak. If I speak, I am in big trouble.",
        "content": "",
        "upvotes": 640,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oqnkhejkzhgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qr73so/i_prefer_not_to_speak_if_i_speak_i_am_in_big/"
    },
    {
        "id": "1qs6s3r",
        "author": "Crafty-Requirement40",
        "title": "Florentino Perez never learnt his lesson",
        "content": "In 2005, he targeted Xabi Alonso but didn't buy him because Xabi was a young talented spanish defensive midfield so Xabi joined Liverpool and they won Champions League. In the other hand, Perez bought Julio Baptista, an brazilian attacking midfield, and forced him to play as defensive midfield then failed disastrously, we were trophyless 2 season in a row that year\n\nIn 2025, another talented defensive midfield name Martin Zubimendi was skipped because he is spanish (not brazilian). Then Martin is shining in Arsenal, they are on top of PL and CL, when we're struggling and might have 2nd trophyless season in a row.\n\nIt's time to step down Perez.",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qs6s3r/florentino_perez_never_learnt_his_lesson/"
    },
    {
        "id": "1qr6mpf",
        "author": "Bijay12356",
        "title": "When we used to fight until the final whistle, when we didn’t know the meaning of surrender 🥲",
        "content": "",
        "upvotes": 476,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/orbp1x29whgg1.jpeg?auto=webp&amp;s=e5b1c12cb2fe2172f0f5bc085a36c6e4e85437da"
        },
        "permalink": "/r/realmadrid/comments/1qr6mpf/when_we_used_to_fight_until_the_final_whistle/"
    },
    {
        "id": "1qrau7e",
        "author": "TheFeatherDiaries",
        "title": "The only player in the last 15+ seasons to create more chances than Arda Guler per 90 mins in La Liga is 2010/11 Mesut Ozil who played the whole season as a pure Number 10. Moreover Arda ranks third in chances creation percentage through long balls over the same time period.",
        "content": "",
        "upvotes": 189,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/izu3nm6fmigg1.png?auto=webp&amp;s=0cc7ea7b5e1cf13213b7f5d750244db49b799860"
        },
        "permalink": "/r/realmadrid/comments/1qrau7e/the_only_player_in_the_last_15_seasons_to_create/"
    },
    {
        "id": "1qrzwdx",
        "author": "Specialist_Pickle_92",
        "title": "What’s your unpopular opinion about Real Madrid?",
        "content": "Some people think Mbappé is the problem  pointing to PSG winning the Champions League after he left and Real Madrid struggling since he arrived.  \nSome believe Bellingham constantly playing as a No.10 instead of a box-to-box No.8 is hurting the team.  \nSome blame Vini.  \nSome think Huijsen and Asencio don’t form a scary or dominant defensive line at all.  \nOthers believe Real Madrid still hasn’t replaced Kroos and Modrić.  \nAnd there are many more opinions I haven’t even mentioned. So what do you think the real problem is?",
        "upvotes": 5,
        "comments": 85,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrzwdx/whats_your_unpopular_opinion_about_real_madrid/"
    },
    {
        "id": "1qred9w",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CA Osasuna Promesas - César Palacios golazo 45'+3",
        "content": "",
        "upvotes": 97,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9e7mpkkd9jgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qred9w/real_madrid_castilla_10_ca_osasuna_promesas_césar/"
    },
    {
        "id": "1qr4g43",
        "author": "ch1nkkyy",
        "title": "🚨 JUST IN: Real Madrid are currently focused on CB's and midfielders. The club is currently conducting analysis, and decisions will be made on TARGETS starting from MARCH.",
        "content": "",
        "upvotes": 265,
        "comments": 125,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qr4g43/just_in_real_madrid_are_currently_focused_on_cbs/"
    },
    {
        "id": "1qr718q",
        "author": "InspectorExact3836",
        "title": "[UEFA] Courtois has made second most saves(41) in CL this season",
        "content": "",
        "upvotes": 172,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/556os8c3zhgg1.jpeg?auto=webp&amp;s=cc5bf74a96e60e1640a71f1b790b7433749e914a"
        },
        "permalink": "/r/realmadrid/comments/1qr718q/uefa_courtois_has_made_second_most_saves41_in_cl/"
    },
    {
        "id": "1qqynyy",
        "author": "oiomelanda",
        "title": "😂😂😂😂😂😂😂😂😂 sums up our current state",
        "content": "",
        "upvotes": 546,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/18terrm3tfgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqynyy/sums_up_our_current_state/"
    },
    {
        "id": "1qrni1m",
        "author": "Mastermind_737",
        "title": "What's Valverde doing so high up when we need to defend a lead. And then our 3rd goal",
        "content": "",
        "upvotes": 20,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrni1m/whats_valverde_doing_so_high_up_when_we_need_to/"
    },
    {
        "id": "1qrjp2h",
        "author": "Educational_Rub8733",
        "title": "“We can’t always be winning”, but where are the changes to show that Madrid management cares?",
        "content": "No matter how the fans justify the current condition of Madrid, especially with the thesis that “we can’t always win” or “everyone goes through crisis”, this is such an understatement and distortion of what’s happening at the club. Yeah, we can’t always win, but where are the changes to improve or to consider something a change???? Do you not understand that the president spent more than a hundred mil for players whom we consider a “future perspective”, but not for players who could bring changes now? Like someone who is a lot more experienced, so we could close the midfield and the players who play 70 matches a season and then get injured for the upcoming future. \n\nAgain, this isn’t about bitching Perez or always complaining. It’s about the club. The emblem. Y’all understand that we are considered to be a historic team and the best team worldwide (according to the trophies and the whole “3ucls in a row” narrative). It’s unacceptable for the fans of the club to constantly bring down the status of Madrid to a state, where we would be bragging about 6:1 against Monaco. We are bigger than that.\n\nGoing to back to the first paragraph, there were rumours (rather news from certain article) that Madrid is in a brink of bankruptcy, but why is Perez making such “big purchases” for the so called “future talents”? Again, I don’t believe on these news, but makes me think. Perez has a network of propaganda (el chiringuito, RMTV,etc) who deliver what the Madrid bureaucracy thinks in a moment. If you notice, no pressure on Alaba, Rudiger, and others, who are keen to be injured, but earn almost 20 mil a year. Why aren’t there news about Perez pushing those players out by mutual contract termination?\n\nThe logic of this might just lie on Perez being a corporate leader while players are the product. We can’t accept this kind of shift from a sport team, to a corporate clergy",
        "upvotes": 25,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrjp2h/we_cant_always_be_winning_but_where_are_the/"
    },
    {
        "id": "1qrhdsk",
        "author": "Short_Mousse_6812",
        "title": "I don’t understand why we play 433",
        "content": "  I quite honestly don’t understand why we keep focusing so much on 433. A formation that is heavily reliant on width and the wings. The whole point of the formation is for the winger to create chances by either beating the defenders or crossing the ball. Guess what? Our wingers are not exceptionally good at that. We do not have a tall striker who gets in the box to receive crosses, and our wingers have been underperforming. Our right flank is basically nonexistent except for when Rodrygo decides to play good. If our wings are so weak, why not drop the same formation that has not led us anywhere. I am not claiming it is the solution, but playing the diamond again would be great. You put Bellingham behind the strikers so he can thrive again. We would also have more control in midfield and fullbacks could go higher up the pitch. Maybe this is not the best, but 433 is definitely not the way. ",
        "upvotes": 26,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qrhdsk/i_dont_understand_why_we_play_433/"
    },
    {
        "id": "1qqfzbd",
        "author": "AbuElKess",
        "title": "Reminder: up until that day we were top of the league, 7 points ahead of Barcelona, and second in the Champions League.",
        "content": "",
        "upvotes": 3676,
        "comments": 316,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/abalq3yqvbgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqfzbd/reminder_up_until_that_day_we_were_top_of_the/"
    }
]