[
    {
        "id": "1q1nh76",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (We Bury the Dead)",
        "content": "**New In Theaters**:\n\n* [We Bury the Dead](https://old.reddit.com/r/movies/comments/1q1ngoh/official_discussion_we_bury_the_dead_spoilers/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n* **No Other Choice coming next week**\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwback releases this week. See ya next week as we continue into 2001!**\n\n**Still In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 32,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1q1nh76/official_discussion_megathread_we_bury_the_dead/"
    },
    {
        "id": "1q47cw2",
        "author": "LiteraryBoner",
        "title": "There's still time to organize Fantasy Box Office Game leagues and draft for 2026!",
        "content": "A few weeks ago I made a [post about a great box office fantasy game a redditor has been perfecting for the last few years.](https://old.reddit.com/r/movies/comments/1pk1m27/introducing_the_fantasy_box_office_game_two_years/)\n\n# www.FantasyBoxOfficeGame.com\n\nThis is a year-long fantasy game that involves three seasonal drafts. It's a great low-key way to add some excitement to each movie release and as someone who's been playing it the last two years with coworkers/other redditors I can attest it's an absolute blast. \n\nEven though 2026 has begun you can still have your first draft any time. My leagues are drafting this week but January is so slow release-wise there's still plenty of time to put a good league together. \n\nIf you want to know more about the game check out the reddit post I linked above or just head over to the site to check it out! It's **totally free** to play and the UI is very intuitive. Big shoutout to /u/Chris_Tennant for making the site over these past few years!\n\nSo check it out and let us know if you have any questions! Happy New Year!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1q47cw2/theres_still_time_to_organize_fantasy_box_office/"
    },
    {
        "id": "1q3phd6",
        "author": "Amaruq93",
        "title": "Tim Curry behind the scenes of \"Ferngully: The Last Rainforest\" (1992), recording Toxic Love",
        "content": "",
        "upvotes": 9675,
        "comments": 273,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2bz1puavzbbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q3phd6/tim_curry_behind_the_scenes_of_ferngully_the_last/"
    },
    {
        "id": "1q420wn",
        "author": "Kristofferabild",
        "title": "Does Steven Spielberg never get angry on set?",
        "content": "Watching the great documentary on the The West Side Story , I realised something. I have never seen footage of Steven Spielberg being angry, annoyed or yelling at someone on set. I seem to remember, I have seen David Lynch , Janes Cameron , Stanley Kubrick and David Fincher being angry and annoyed on set. \nSo is all footage of Spielberg on set heavily edited, or is that just not the kind of director he is? \nI know he used to be harder on sets, and especially on E.T. he changed his approach. ",
        "upvotes": 1362,
        "comments": 406,
        "media": null,
        "permalink": "/r/movies/comments/1q420wn/does_steven_spielberg_never_get_angry_on_set/"
    },
    {
        "id": "1q439yy",
        "author": "sugarplumfairybarely",
        "title": "Appreciation post: Jesse Plemons is the Philip Seymour Hoffman of this generation",
        "content": "Jesse Plemons is the Philip Seymour Hoffman of this generation. Incredible actor. \n\nObviously hated him in Breaking Bad, liked him in Black Mirror, loved him in Bagonia, and just watched Windfall and I’m completely blown away. I’m convinced by every character he plays. The mannerisms and presence are so specific that I forget entirely who his last character even was.\n\nSorry if this has already been said. I’m just fascinated by his craft and felt like sharing.\n\nAlso, Windfall was an excellent film. I’ve never seen anything else like it. ",
        "upvotes": 676,
        "comments": 172,
        "media": null,
        "permalink": "/r/movies/comments/1q439yy/appreciation_post_jesse_plemons_is_the_philip/"
    },
    {
        "id": "1q3zxul",
        "author": "LollipopChainsawZz",
        "title": "‘Top Gun: Maverick’ Copyright Suit Gets Its Wings Clipped By Appeals Court In Win For Paramount",
        "content": "",
        "upvotes": 514,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N_q2prAePJNsm1fh1i7RIG8IYLP7AbtlOQsPnCYZ1gE.jpeg?auto=webp&amp;s=a1c9720f0739ad205a09b1fcceb696389e2835b1"
        },
        "permalink": "/r/movies/comments/1q3zxul/top_gun_maverick_copyright_suit_gets_its_wings/"
    },
    {
        "id": "1q42wc5",
        "author": "Outside_Objective183",
        "title": "How come we don't get action movies like Die Hard, Lethal Weapon, etc, anymore?",
        "content": "Been rewatching a lot of action films like The Last Boy Scout, Lethal Weapon, Die Hard 1-3, Action Jackson, Speed, etc. \n\nAside from all looking fantastic, all crunchy textures and sweaty biceps on 35mm, but the scripts were whitty, energetic and well-structured. Critics and audiences loved them. \n\nAction goes through trends like any other genre; The Raid/John Wick style action is/was all the rage for awhile, and while those are good, they just don't feel as memorable or well written as the stuff in the 80s and 90s. The Joel Silver, Joel Schumacher era, I guess? \n\nWe can point out several things from increase in CG explosions &amp; gunshots, to the rise of superhero cinema to streaming channels taking the smaller budget action films, but there's a specific type of big Hollywood action film we just don't get anymore. ",
        "upvotes": 352,
        "comments": 383,
        "media": null,
        "permalink": "/r/movies/comments/1q42wc5/how_come_we_dont_get_action_movies_like_die_hard/"
    },
    {
        "id": "1q3fa43",
        "author": "SanderSo47",
        "title": "Box Office: ‘Avatar: Fire and Ash’ Flies Past $1B",
        "content": "",
        "upvotes": 10776,
        "comments": 2151,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r_1EwzcoRckle-V2YlOlbsCElW122Q4yqpIdhWxv7lo.jpeg?auto=webp&amp;s=c9c7fb6dd5ebde4684380b9ba56828beff06d3fd"
        },
        "permalink": "/r/movies/comments/1q3fa43/box_office_avatar_fire_and_ash_flies_past_1b/"
    },
    {
        "id": "1q46qll",
        "author": "I_Don-t_Care",
        "title": "Wag the Dog (1997) - The USA president is caught in a scandal, to avoid a public affront they construct a fake war against Albania",
        "content": "It's a dark comedy, both funny and unsettling due to the connection to the present days, it goes to show how easily spectacle replaces reality.\n\nIt does absolutely feel relevant today in terms of how organic fake news can rip out into the open, and how the narrative can quickly change and adapt in order to reach the goal of obscuring what must be obscured.",
        "upvotes": 166,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1q46qll/wag_the_dog_1997_the_usa_president_is_caught_in_a/"
    },
    {
        "id": "1q3h7ms",
        "author": "Imnotsomebodyelse",
        "title": "I accidentally activated the audio narration while watching The Naked Gun. Didn't notice something was wrong",
        "content": "Watching the naked gun on prime. Somewhere after the halfway mark i accidentally turned on narration feature. \n\nI'll be honest people, i genuinely thought it was part of the damn film. It fit freaking perfectly. Had that noir narration feel just enhanced to the level of it being a bit taken long enough to be funny. Didn't realise until a good 20 minutes later",
        "upvotes": 5055,
        "comments": 442,
        "media": null,
        "permalink": "/r/movies/comments/1q3h7ms/i_accidentally_activated_the_audio_narration/"
    },
    {
        "id": "1q41wsw",
        "author": "SanderSo47",
        "title": "The Last Samurai (2003, dir. Edward Zwick) – Ninjas infiltrate Katsumoto's village.",
        "content": "",
        "upvotes": 218,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0w2i0yoyeebg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q41wsw/the_last_samurai_2003_dir_edward_zwick_ninjas/"
    },
    {
        "id": "1q3xw6c",
        "author": "InvestigatorFull7520",
        "title": "Just finished watching Nightcrawler — disturbing, uncomfortable, and unforgettable",
        "content": "I just finished watching Nightcrawler and it honestly left me feeling disturbed. The movie has a very cold, dark vibe and never tries to make you feel comfortable. It slowly pulls you into a world where ambition matters more than morality.\nJake (Lou Bloom) really got under my skin. He’s obsessive, manipulative, and feels completely empty inside. The moment he lets his partner die just to get exclusive footage genuinely made me angry, which says a lot about how effective the film is.\nJake Gyllenhaal was incredible. The calm way he plays Lou, the forced smiles, and the lack of empathy feel disturbingly real. I hated the character, but I have a lot of respect for the performance.\nIt’s not a fun watch at all, but it’s a powerful and uncomfortable one. Curious how others felt about it.",
        "upvotes": 246,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1q3xw6c/just_finished_watching_nightcrawler_disturbing/"
    },
    {
        "id": "1q40x1w",
        "author": "CalebOnPoint",
        "title": "Best movie you ever saw in a movie theater?",
        "content": "Hey guys what's the best movie theater experience you ever had? (preferably pre-Covid back when everybody was normal, happy and enjoyed life)\n\nMine was actually How The Grinch Stole Christmas (2000). I remember that movie was so big at the time and I ended up going (not intentionally) like 4 times in the same month. My friends wanted to see it, then I went with family, then I went with my cousins or something. But overall I watched it like 4 times. One time I had to sit in the front row, was forced to do it, because of how many people were there. Never sat in the front row again lol.\n\nIn hindsight though it was a really unique experience because it was my own personal phenomenon. That was like peak Carrey too ... Miss his movies ... Miss comedies in general",
        "upvotes": 157,
        "comments": 925,
        "media": null,
        "permalink": "/r/movies/comments/1q40x1w/best_movie_you_ever_saw_in_a_movie_theater/"
    },
    {
        "id": "1q38lyw",
        "author": "MarvelsGrantMan136",
        "title": "‘One Battle After Another’ Named Best Picture by National Society of Film Critics",
        "content": "",
        "upvotes": 7137,
        "comments": 1347,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6ufIJnfMaPO4UXVVL4kZLJ-OzIfdIjfh7NELqmQ8XfY.jpeg?auto=webp&amp;s=44f3e1bd67b91effa948219778f9d80831a30866"
        },
        "permalink": "/r/movies/comments/1q38lyw/one_battle_after_another_named_best_picture_by/"
    },
    {
        "id": "1q3n3uy",
        "author": "XInsects",
        "title": "Lawrence of Arabia (1962) blew my mind",
        "content": "I went into Lawrence of Arabia expecting a stuffy, tedious, dated film where I'd probably give up after 20 minutes. Instead it felt incredibly fresh, relevant, and endlessly exciting, and I ended up glued to the screen for the full 3 1/2 hrs or so. I haven't stopped thinking about it since. The story, the fascinating intracacies and emerging contradictions of the character, and how incredible the filmmaking was. I love how Lawrence's attitudes and ideas were shaped by the responses he gets to various events, his innocent, pure idealism slowly crumbling into this cynism and bitterness.    \n\nIt was just incredible. Like Barry Lyndon, every shot is just beautifully framed and interesting. Then the huge scenes of people, with hundreds of camel mounted arabs galloping across the desert, or hundreds of unmounted horses escaping a traincart. I just have no idea how they were able to create some of these shots, and in such remote places of the world.   \n\nIt was absolutely mind-blowing to me now, so I can't imagine how audiences would have received it back in 1962, when they probably hadn't even seen colour footage of desert before? It must have been far more impactful than any spectacle films we have today (e.g Avatar etc). And so much more mature and complex. I'm sad we'll never see anything like it again.   \n\nIf you haven't seen it, I highly recommend it, and on the biggest screen possible. \n\n",
        "upvotes": 665,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1q3n3uy/lawrence_of_arabia_1962_blew_my_mind/"
    },
    {
        "id": "1q3rntc",
        "author": "Boss452",
        "title": "James Cameron talks about the simple pitch he made for Titanic and Leonardo Dicaprio's reluctance to join the film.",
        "content": "",
        "upvotes": 295,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g3g6rdt7gcbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q3rntc/james_cameron_talks_about_the_simple_pitch_he/"
    },
    {
        "id": "1q3pa27",
        "author": "laudrupszn11",
        "title": "Movies like Snatch and Lock, Stock and two smoking barrells",
        "content": "Same as title. \n\nMovies like Snatch (2000), Lock, Stock and two smoking barbells (1998) and The gentlemen (2019). \n\nThey're 3 of my fav movies and I'm in love with this genre. With interconnected storyline and humour etc. I watched RocknRolla but found it bad so left in between. Maybe I'll give it another shot.\n\nPlease suggest!",
        "upvotes": 382,
        "comments": 443,
        "media": null,
        "permalink": "/r/movies/comments/1q3pa27/movies_like_snatch_and_lock_stock_and_two_smoking/"
    },
    {
        "id": "1q3z5ve",
        "author": "Quirky-Invite7664",
        "title": "What sci fi movie ended like this?",
        "content": "Help me remember which movie this was. It ends with a female in a room of a spaceship, wrestling with an alien/monster. The female manages to separate them into different pods. The alien pod launches towards outer space, while the female’s pod starts heading to Earth - except, at the very end, the female screams “No!!!” as she realizes SHE’s in the pod headed towards outer space, which means the alien is headed towards Earth. ",
        "upvotes": 81,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1q3z5ve/what_sci_fi_movie_ended_like_this/"
    },
    {
        "id": "1q3pdrx",
        "author": "Alternative-Cake-833",
        "title": "Movie franchises that ran their course?",
        "content": "For me, it's the Michael Bay Transformers movies. Even though Dark of the Moon wasn't a very good film, you could tell that it ended perfectly. Megatron is killed and the Transformers are hopeful for the future as Sam's character arc is wrapped up. You think that they could end it on Dark of the Moon, with a perfect ending. And that's coming from someone that wasn't even big on Bayformers in general besides for the first one.\n\nBut no, they did two more Michael Bay Transformers movies (Age of Extinction and The Last Knight), while recasting LaBeouf with Mark Wahlberg and undoing the ending of the third film. By that time, it had approached into the ridiculous and overdone territory with a Transformer that could age old. I mean, really. That baffled me a lot. It was clear that by the time Last Knight came out, the whole franchise had run its course and realistically, there was no coming back from it. The Transformers movies has since improved overtime but holy smokes, that franchise was just going downhill bigtime for a while with no signs of improvement until Bay stepped down from the director's chair.",
        "upvotes": 178,
        "comments": 398,
        "media": null,
        "permalink": "/r/movies/comments/1q3pdrx/movie_franchises_that_ran_their_course/"
    },
    {
        "id": "1q3yrxz",
        "author": "Simple-Profile1817",
        "title": "Has a movie scene ever made you want to throw up? Any genre counts.",
        "content": "I'm the kind of moviegoer who can't watch a single scene of blood, even if it's not horror. The most I've seen is Lord of the Rings and a Marvel movie; Puss in Boots 2 was actually mild for me. However, The Thing and Sinners are definitely movies I dropped at the beginning and middle (The Thing during the autopsy scene and Sinners during the scene where Mary bites the stack).",
        "upvotes": 42,
        "comments": 365,
        "media": null,
        "permalink": "/r/movies/comments/1q3yrxz/has_a_movie_scene_ever_made_you_want_to_throw_up/"
    },
    {
        "id": "1q43ff6",
        "author": "Southern-Brother5693",
        "title": "Cherry 2000 (1998) - Melanie Griffith - This was pretty fun!",
        "content": "Caught this on Prime Video for the first time.\n\nA lot of the action sequences and worldbuilding were more impressive than I expected. It also helps that Melanie Griffith is cute as a button. It certainly feels like a dytospian wasteland movie.\n\nAnd we also get Tim Thomerson, Brion James, Robert Z'Dar and Laurence Fishburne (in a cameo).",
        "upvotes": 22,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1q43ff6/cherry_2000_1998_melanie_griffith_this_was_pretty/"
    },
    {
        "id": "1q3lpsp",
        "author": "starwarsisawsome933",
        "title": "Do you think we will ever find or have a series that either is on the same grandeur or tops the Lord of the rings trilogy?",
        "content": "I just finished re-watching return of the King and I'm having that feeling of emptiness inside me, not because the movie is bad (my goodness, it's in its own category of epicness, nothing compares to it currently) but just the feeling of will we ever get an epic like that? \n\nWhen I think of epics that could even come close to it the only thing I can really think of is the conclusion of the MCU, and even then there's a part of me that feels like endgame was just kind of thrown together and shoved in front of the fans instead of this really overarching Grand conclusion story lines (honestly personal opinion, I think they should have turned Infinity War into three separate movies, kept Infinity War the same, changed a bit of endgame to create different branching paths, and then find a good way to conclude it all in a third movie) \n\nDo you think we'll ever have something of that grandeur that the LOTRs saga is?",
        "upvotes": 217,
        "comments": 386,
        "media": null,
        "permalink": "/r/movies/comments/1q3lpsp/do_you_think_we_will_ever_find_or_have_a_series/"
    },
    {
        "id": "1q3ne2k",
        "author": "browniebiscuitchildr",
        "title": "What’s a movie character who, if they weren’t the protagonist, would be seen as a total bum?",
        "content": "\nI’m thinking of characters who only come across as charming, relatable, or sympathetic because the movie is told from their point of view. If the story followed anyone else, they’d probably be viewed as irresponsible, selfish, or just plain annoying. What are some good examples where the protagonist framing does a lot of the heavy lifting?",
        "upvotes": 127,
        "comments": 334,
        "media": null,
        "permalink": "/r/movies/comments/1q3ne2k/whats_a_movie_character_who_if_they_werent_the/"
    },
    {
        "id": "1q3dioz",
        "author": "TheWor1dsFinest",
        "title": "What scene makes you go “Nope!” every time you watch it?",
        "content": "As a lifelong arachnaphobe I’ve never once watched Return of the King and not thought “Nope! Couldn’t do it” once it gets to the Shelob scene. Middle Earth is lucky it was Frodo and not me having to deal with that giant spider. God damn demon it is. Sauron would’ve won. There would no more Shire, Pippin. Samwise Gamgee is the bravest character in fiction for facing that thing.",
        "upvotes": 626,
        "comments": 930,
        "media": null,
        "permalink": "/r/movies/comments/1q3dioz/what_scene_makes_you_go_nope_every_time_you_watch/"
    },
    {
        "id": "1q3yagv",
        "author": "ActInternational9558",
        "title": "Perfect Days (2023) touched me deeply",
        "content": "I started off my 2026 in cinema with Perfect Days, a movie that’s been on my list for quite some time.   I’m not all that familiar with Wim Wenders’ work - I’ve watched and really like Paris, Texas but haven’t seen anything else by him. Perfect Days seemed right up my alley though - a slow-burn slice of life film based in Tokyo, so I decided to check it out.\n\nIt really is a very restrained and low-key story, even moreso than Paris, Texas, but it has a way of creeping up on you. I’m finding that as much as I enjoyed it when I initially watched it, Im starting to appreciate it more afterwards as various scenes keep creeping up on my head. \n\nWhat really stands out to me is that I found the story simultaneously uplifting and sad. There’s something beautiful and inspiring about how Hirayama lives his day to day life, following the same routine of going to work, listening to his favourite songs, finding the joy and simple pleasures in going to his favourite bars or watching the sunlight peek through the top of the trees while enjoying an egg sandwich. It’s contemplative and asks questions about what constitutes a meaningful life for someone. It seems like Hirayama may be from a well-off family based on the small scene with his sister, and her reaction to him cleaning toilets - but this is what brings him joy, the little mundane routines of everyday life, finding the beauty in the ordinary. \n\nOn the other hand, there seem to be some hints that maybe everything Hirayama is doing is almost a kind of coping mechanism. Something happened in his family life which made him run away and lead this solitary, insular lifestyle. Are these “perfect days” something he’d always dreamed of or are they something he had to create to deal with whatever happened? I think this is where the narrative can be interpreted as more tragic than it initially appears to be.\n\nI can’t speak highly enough of Koji Yakusho’s performance. The movie relies entirely on him to make it compelling considering how sparse (nonexistent actually) it is from a plot perspective and he really carries the whole thing. What’s really impressive is how quiet and restrained of a performance it is. There’s no big emotions, big speeches or gestures here. The dude barely says more than a few words in the entire movie - he just conveys it all through his eyes and facial language and it’s incredible. You get a full picture of his inner life and who he is as a person in the here and now.\n\nRegardless of what the true meaning behind the story is, I personally found it to be very poignant and thoughtful, and it made me reflect on my own life and the things I often convince myself will make me happy. Its a reminder to be present in the moment, appreciate what you have and find the intrinsic pleasure in the act of doing something. \n\n“Next time is next time. Now is now.”",
        "upvotes": 24,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1q3yagv/perfect_days_2023_touched_me_deeply/"
    },
    {
        "id": "1q3eequ",
        "author": "RonSwanSong87",
        "title": "*The Sandlot* is a masterful piece of cinema",
        "content": "I vaguely remember it from my childhood (I'm 38 and grew up playing baseball fairly seriously, but was only 6 or 7 when it was released...), but damn if I knew at the time it was a cinematic and story telling masterpiece...in fact, i did not.\n\nThe narration / voice over, the nostalgia, the innocence and pure fun portrayed in the essence of the game of baseball (and childhood), the soundtrack (hello Ray Charles, my goat), the humor, the dialogue, the cast, and the warm fuzzies of how it ends with the narration zoom out.\n\nMy younger kids (9 and 11) discovered it a few weeks back and it has been a real treat to have it on repeat.  That is all...",
        "upvotes": 449,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1q3eequ/the_sandlot_is_a_masterful_piece_of_cinema/"
    },
    {
        "id": "1q3v1pq",
        "author": "3Din3D",
        "title": "Best 1980s movies in NYC?",
        "content": "I’m looking for suggestions for 1980s movies that take place in NYC and have a very 1980s soundtrack. Does anyone have any good recommendations? I’ll settle for movies that take place in other cities besides New York, but NYC is preferable. \n\nIf I had to give an example, I’d say something like Short Circuit 2 fits the bill.",
        "upvotes": 30,
        "comments": 148,
        "media": null,
        "permalink": "/r/movies/comments/1q3v1pq/best_1980s_movies_in_nyc/"
    },
    {
        "id": "1q2vjoy",
        "author": "BunyipPouch",
        "title": "Cinemark Announces 'Bring Your Own Bucket' Weekend Event for National Popcorn Day on January 18th and 19th - For $5, the theater will let patrons fill up any container they bring full of popcorn, up to 400 ounces.",
        "content": "",
        "upvotes": 4194,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjJ4cMNwimklBrEdIoj8RSrawiDjItVN35KIxRE_Kww.jpeg?auto=webp&amp;s=972bfaa25d174011943ef296d619d3deef99b922"
        },
        "permalink": "/r/movies/comments/1q2vjoy/cinemark_announces_bring_your_own_bucket_weekend/"
    },
    {
        "id": "1q32cxg",
        "author": "LiteraryBoner",
        "title": "Harrison Ford tells the President to go fuck himself (in not so many words) in A Clear and Present Danger (1994, dir. Phillip Noyce)",
        "content": "",
        "upvotes": 1587,
        "comments": 139,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wn6g9ewjh6bg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q32cxg/harrison_ford_tells_the_president_to_go_fuck/"
    },
    {
        "id": "1q3m06d",
        "author": "Giff95",
        "title": "\"The Apartment\" (1960) gets better with age.",
        "content": "I finally watched Billy Wilder's \"The Apartment,\" and I honestly wasn’t prepared for how heavy and emotionally complex it would get beneath its clean, witty exterior. Going in, I expected a light romantic comedy. What I got instead was a surprisingly honest exploration of loneliness, moral compromise, and even suicide, all wrapped inside one of the most deceptively simple premises I’ve ever seen.\n\nAt first, the setup feels almost sitcom-like. Jack Lemmon lends his apartment to higher-ups at his insurance company so they can carry on affairs, hoping it’ll help him climb the corporate ladder. It’s clever, funny, and absurd. But as the film unfolds, the simplicity of that idea spirals into something nuanced. His apartment stops being a joke and becomes representative of his isolation, a space he technically owns but never truly gets to live in.\n\nJack Lemmon's performance is absolutely perfect. He plays Baxter as the ultimate everyman, he is awkward, well-meaning, quietly desperate to belong. Lemmon’s performance makes Baxter’s loneliness feel painfully real without ever becoming too melodramatic. You can see how Baxter’s small moral compromises slowly eat away at his sense of self, even as he keeps smiling and cracking jokes.\n\nWhat really surprised me is how directly the film confronts despair and suicide, especially for a mainstream Hollywood movie from 1960. Shirley MacLaine’s Fran is treated with genuine compassion, and the film never trivializes her pain. Instead, it frames loneliness as something systemic created by power imbalances, emotional neglect, and a culture that rewards selfishness.\n\nThe film features an exchange of dialogue that is among my favorites in film now:\n\n*The mirror... it's broken.*  \n*Yes, I know. I like it that way. Makes me look the way I feel.*\n\nBy the time the movie ended, it stood out for feeling far more layered than its premise suggests. It has its humorous moments, but it’s also deeply human and sad. For a film over 60 years old, it feels shockingly relevant and I imagine it speaks more so now to people than it did when it was introduced as a \"comedy.\"",
        "upvotes": 98,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1q3m06d/the_apartment_1960_gets_better_with_age/"
    }
]