[
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 9,
        "comments": 3586,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qcnjf8",
        "author": "Luffy710j",
        "title": "Arbeloa left Real Madrid in 2016 and came back as a coach in 2026…still Barcelona has won zero UCL.",
        "content": "",
        "upvotes": 720,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dd5vnm3ajbdg1.png?auto=webp&amp;s=f9178061ecc69c3ec1e88e005dba9cd49910eacc"
        },
        "permalink": "/r/realmadrid/comments/1qcnjf8/arbeloa_left_real_madrid_in_2016_and_came_back_as/"
    },
    {
        "id": "1qcgytu",
        "author": "chunchunmaru1129",
        "title": "For me Toni Kroos is the greatest Midfielder of all-time",
        "content": "",
        "upvotes": 557,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6j89rvein9dg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcgytu/for_me_toni_kroos_is_the_greatest_midfielder_of/"
    },
    {
        "id": "1qcmlqx",
        "author": "FrrancondonaEra",
        "title": "player on there way to the game Albacete! lmao i feel pure carlo vibes",
        "content": "",
        "upvotes": 193,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dz5tve2jbbdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcmlqx/player_on_there_way_to_the_game_albacete_lmao_i/"
    },
    {
        "id": "1qcmbqh",
        "author": "Specialist_Doctor_34",
        "title": "Alvaro Arbeloa has called up 7 academy player today for game against Albacete",
        "content": "Our new Manager Alvaro Arbeloa has called 7 academy player and they are :-\n\nFran Gonzalez ( GK )\nSergio Mestre ( GK )\nDavid Jimenez ( RB ) \nJoan Martinez ( CB )\nCestero ( CM ) \nManuel Angel ( CM )\nPalacios ( CM ) \n\nAll of them were part of our under 19 team who won the historic treble and their coach was Alvaro Arbeloa. The player described him as their own father and someone who always look for his player. I expect our new manager to call many of our  academy player and give them a lot of minute to develop. ",
        "upvotes": 147,
        "comments": 77,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcmbqh/alvaro_arbeloa_has_called_up_7_academy_player/"
    },
    {
        "id": "1qcjlj1",
        "author": "Ready_Ad_1353",
        "title": "Bale: “ I think eveybody knows at Real Madrid it’s about managing players rather than just tactics. Second Best is just not accepted at Real Madrid, I think the fans are so relentless that you need to keep going until you can’t no more.”",
        "content": "",
        "upvotes": 204,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2z1ijsnrhadg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcjlj1/bale_i_think_eveybody_knows_at_real_madrid_its/"
    },
    {
        "id": "1qcoh8l",
        "author": "IcefoxX5",
        "title": "[OC] What to Expect from Arbeloa as a Coach - and Above All as a Man-Manager",
        "content": "As someone who has watched Arbeloa's teams play weekly for the past few years, I thought I'd give this sub some insights into what kind of manager he is on the tactical side, but also with a special focus on the relationship with his players, and how I expect his qualities and shortcomings to translate to our first team\n\nhttps://preview.redd.it/6naiznshdbdg1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=d2922e7852e2cd249256a33da1d71a1bd2db3511\n\n# Tactical aspects:\n\nI will keep this part of the post short, or at least shorter than I normally would have, as Xabi's exit has made it definitively clear that it doesn't really matter with the first team anyway. \n\nArbeloa plays a style of extraordinarily high possession - this season, his Castilla side have an average of 65.5%, which is far and away the highest of all 40 teams in Primera Federación (Betis B are second with 59.2%). \n\nTo play this style of possession, the team needs two things mainly, things that I don't believe the first team has, or actually, they could not be any further away from: \n\n1. an extremely technical midfield\n2. a very aggressive and well organised press\n\n**Ball retention and quick circulation** are the key elements to both uphold this level of possession and actually create gaps in the opponent's deep defensive line - this only works since Castilla's midfielders are technically gifted to an extreme degree: the starters, Jorge Cestero, Manuel Ángel and Thiago Pitarch but also the other midfielders such as Roberto Martín, Pol Fortuny, Dani Mesonero and Bruno Iglesias can compensate for all their tactical and physical shortcomings with their agility, technical finesse and vision, and make it almost impossible for the opponent to recover the ball in their areas of influence. \n\nIn the first team, the profiles of Camavinga, Tchouaméni, Bellingham and Fede are all the polar opposite, compensating their technical shortcomings with physical excellence and often struggling to circulate the ball quickly with precision and find solutions in tight spaces. They shine in transition and in open space, not under pressure or while trying to find solutions against a low block. \n\nPlayers like Pol Fortuny, Dani Yáñez, César Palacios and Álvaro Leiva are drifting in and out of the half-spaces and zone 14, offering the necessary outlets for the midfielders to find solutions against deep defences. Contrary to the central midfield, the first team does have similar profiles in these spaces, with Arda, Brahim, Mastantuono and to some extent, Rodrygo.\n\n**A high press** that is defined not just by good organisation, but by an aggressive and relentless motivation to chase after the ball high upfield and recover the ball as early as possible is another necessity to uphold this level of possession and control. Arbeloa's teams' press is not characterised as much by perfect organisation and anticipation, but more so by high energy and intensity and rapid direction changes to cut passing lanes. All of this is something I don't expect our first team players to do with everything we just experienced with Xabi's attempts to set up a high press. \n\n**The formation** Arbeloa plays is practically exclusively a 4-3-3, no formation switches or experiments with a back 5 like Raúl, let alone a tactical fixation on it like Xabi showed with La Real's B team and Leverkusen, which definitely translates well to the first team as we won't be able to line up more than 4 fit defenders at any point anyway. \n\nThis lack of **tactical flexibility** leads to people rightfully noting that Arbeloa's teams are prone to not having a plan B if their controlling approach backfires and the risks they take in their press end up being too high and too exhausting - if a team can bypass their first pressing line, they can catch them off guard on the counter with ease, like Arenas Club demonstrated perfectly on the weekend in their 4-1 win over Castilla. Arbeloa's teams often struggle against sides that are good on the counter, overwhelmingly physical on defence and have extremely fast and flashy wingers, like our own academy product Baba Diocou for Arenas Club last weekend, or Arenteiro's Martín Ochoa the week before. \n\nhttps://preview.redd.it/hg8eagcvjbdg1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=64174c63a1b7aab592cc8acf1567caebf41fceb0\n\nSomething to note from his time as Juvenil A coach is the huge number of players he tried to integrate from younger categories like Juvenil B, Juvenil C or even Cadete A (U16), and due to the firm structure and the dominance of his side, they were able to integrate seamlessly, not making the age difference to their older opponents and teammates noticeable. Often, they even contributed goals and assists on their debuts. \n\n\n\n# Trajectory in La Fábrica:\n\n* 2020/21: Infantil A (U14) - 15 wins &amp; 2 draws in 17 games. Primera División Autonómica Infantil title.\n* 2021/22: Cadete A (U16) - 23 wins, 5 draws &amp; 2 losses in 30 games.\n* 2022/23: Juvenil A (U19) - 41 wins, 5 draws &amp; 1 loss in 47 games. Domestic treble (Juvenil División de Honor, Copa del Rey Juvenil, Copa de Campeones)\n* 2023/24: Juvenil A (U19) - 29 wins, 5 draws &amp; 6 losses in 40 games. \n* 2024/25: Juvenil A (U19) - 31 wins, 4 draws &amp; 8 losses in 43 matches. Juvenil División de Honor title.\n* 2025/26 so far: Real Madrid Castilla - 12 wins, 3 draws, 8 losses in 23 matches. \n\nIn total: **200 matches: 151 wins, 24 draws, 25 losses — 75.5% win rate**\n\n\n\n# The human side of Arbeloa as a coach:\n\nWhat is unequivocally more important to manage Real Madrid's first team, once again made clear by the manner of Xabi's exit, is **man-management**, moderation of the tempers and egos in our dressing room, and making every player feel involved and appreciated. \n\nI feel like I have come to have a pretty good idea of the way Arbeloa manages a dressing room, but be aware that many of the impressions I will write up in these next paragraphs are, on one hand, based on my own observations and Arbeloa's public comments, while others are based on unconfirmed rumours, some of which stem from credible, some from less credible sources. Also, obviously managing a dressing room with world class star players and their respective egos is obviously a completely different beast compared to managing a few teenagers that are more extroverted than others. \n\nIt is easiest to compare his man-management style to that of **Raúl**, as Arbeloa is his direct successor and many people that follow the academy closely have noticed that they are polar opposites in this regard. \n\nRaúl's approach is purely based on strict discipline - he loves hard-working, relentless, mature and down-to-earth players like Gonzalo, Mario Martín, Chema, Álvaro Rodríguez and Mario Rivas, and often hand-picked these players from as low as Juvenil C, allowing them to skip multiple ranks - on the other hand, he had huge problems and a no-nonsense approach when dealing with more extroverted players like Iker Bravo, Bruno Iglesias, Vinícius Tobias, Álex Jiménez and Álvaro Leiva, whose fiery personalities not only show on the pitch with high-risk approach and extra flair, but also often off the pitch with disciplinary issues and a more outgoing lifestyle. \n\nAccording to some sources, Raúl famously had a rule of no jewellery, no cellphones, no attire apart from the official one that is given out by the club in the dressing room - so that no player, no matter their upbringing, the type of family they come from, their age, their wages etc. feels left behind or influenced by these distractions - which is directly conflicting with the lifestyle of some of the players I mentioned above, who often flaunt material things on social media, already had their first tattoos as minors and always have a fresh, extravagant haircut before every matchday. \n\nArbeloa however seems to realise that these players need special affection to flourish. He often takes particular initiative to help these players get back on track - willing to give players like Leiva, Bravo and Bruno Iglesias second or even third chances even after repeated missteps. For example, promoting Bruno Iglesias back to Castilla was apparently by his own special request to the club. \n\nhttps://preview.redd.it/v1gqueiyjbdg1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=f2e1f9edfaa3a1a8defb378feebf0316391fe2e3\n\nThe best example of this is **Iker Bravo**'s journey at Real Madrid - he was signed as a mega-talent, on loan from Leverkusen, formerly one of the top players from La Masía and in the Spanish youth national teams. Even before we were interested in signing him, I was a big fan of him as a player and put lots of research into him, and something I had found out about him is that according to people who claim to work with Bayer 04's youth players, he was thrown out by his German guest family, then later lived in a hotel room that employees found thrashed once he had left. In Madrid this behaviour quickly continued, he lived by himself in his own apartment for the first time with his family still in Barcelona. He started off the season in acceptable fashion both for Castilla and in UEFA Youth League, but his performance and his match time quickly deteriorated - according to Ramón Álvarez de Mon, after the club had received news that he spent night after night partying in Madrid, they practically \"locked\" him in one of the suites in Valdebebas, quite literally locking him inside at night so he he could return his focus back on football until his family moved in with him in Madrid. Despite his struggles and disciplinary problems, we extended his loan for another year, which was far from a straightforward decision he should have taken for granted. Despite that, he returned to Castilla's preseason overweight and in a bad physical state - Raúl finally had enough and removed him from the squad once and for all. The club decided it would be best for Bravo to get \"demoted\" to Juvenil A, so Arbeloa can get him back on the right track - what followed was a really good season from Iker, finally the noise about his discipline had stopped, he scored or assisted every other week and played really well. Arbeloa showed him a lot of trust, a lot of affection, and Iker Bravo returned that trust on the pitch - when he scored, he ran to Arbeloa to celebrate, and continuously highlighted his gratitude for his coach on social media. Here's what Iker had to say about him after he left:\n\n&gt;\"Yes (he can coach the first team). Arbeloa knows a lot about football. To make myself clear and without comparing, he is a bit like Guardiola, in the sense of being a football 'madman'. He understands tactics very well, knowing how to press and looking for ways to attack depending on what the opponent is doing. And, above all, that emotional intelligence of knowing how to lead people, a dressing room like the first team's would be perfect for him. And he also knows the club very well. Right now Ancelotti is doing very well, but in a few years I do see him there\".\n\nOn what he would tell Arbeloa:\n\n&gt;\"First, I would give him a big hug. Then I would thank him for everything he has done for me, especially on a personal level rather than in football. He is not going to teach me how to shoot, but as he understands me so well, he has experienced so many situations in football and has been in so many dressing rooms, he has given me advice on how to deal with frustrations, how to act in a dressing room or how to behave myself\".\n\nhttps://preview.redd.it/twdz4hqbkbdg1.jpg?width=1706&amp;format=pjpg&amp;auto=webp&amp;s=40be00e27b24acf1cd0ec5e1359c4941a19c521b\n\nA more recent example is **Álvaro Leiva**. We signed him as a big talent at just 17 years old from Algeciras, but after just a couple of games, Raúl had difficulties with his creative style of play and his extroverted personality. He spent two seasons away on loan at Osasuna B and back at Algeciras, before Arbeloa made one of his special requests this summer, wanting him back for Castilla. Then however, something happened - the only thing more or less confirmed is a major disciplinary issue, some rumours (don't quote me on this) mention that he caused a traffic collision in which he got injured, others just speak of him having been overweight. The club disciplined him by demoting him to Real Madrid C, but Arbeloa quickly reintegrated him, giving him much more game time than Raúl ever had - right now, in the absence of other injured attackers such as Rachad Fettal, Bruno Iglesias, Roberto Martín, Leiva is even starting for Castilla. \n\nIn general, Arbeloa has an extremely cordial relationship with his players. He speaks highly of his players, going as far as defending them on social media against random users - I would know, since he once was very pissed off about a tweet I posted a couple of years ago and we had a little discussion on twitter (true story). He takes immense pride in the players he develops and shows them enormous affection behind the scenes and also in public. \n\n**Some examples:**\n\nAbout Diego Aguado after he made his first team debut: [\"Few boys reflect better everything that a Real Madrid academy player should be. Talent, effort, character, mentality, passion and an immense motivation to learn and improve every day. An example for everyone. Very happy for you, crack!](https://x.com/i/status/1876394144534540600)\n\nOn Gonzalo's phenomenal 35-goal Juvenil A season: [\"And all that while playing as a winger!\"](https://x.com/i/status/1655486344272003073)\n\nOn his captain, Manuel Ángel: \"Manuel Ángel is an absolutely differential player. I was very clear that I wanted him to be my captain, not only because of what he means on the pitch but also because of the tendencies he has with his team-mates. I love the way he leads. I love the way he plays football, and I think everyone else does.\"\n\nAnd famously, he recently has called Jorge Cestero the \"top #6 talent in all of Spain\" in a press conference.\n\nI vividly remembered when Arbeloa's grandmother passed away, all his players ran up to him for a big hug to dedicate their goal to him: \n\nhttps://reddit.com/link/1qcoh8l/video/ix6996k5lbdg1/player\n\nI think Iker Bravo's words about him, his man-managing capabilities and his potential to manage the first team's difficult dressing room perfectly encapsulate the hopes I have for how he'll manage the first team - he tries to make every player feel valued and important, always giving second chances, trying to guide players back on track through rehabilitation and cordiality, not by punishing and ostracising them. \n\nHopefully, this bodes well for the first team and he could make even the most extroverted guys like Vini, Mbappé and Jude happy, while also getting players that are and were struggling back on track by improving their confidence, like Rodrygo, Brahim, and Endrick further down the road. \n\nThis lack of punishment and consequences can, however, also backfire with the first team, and let the disciplinary and attitude problems of certain players escalate at an exponential rate - and this brings me to my next point, the huge downside that comes with Arbeloa’s man-management style: the team's overall **discipline.** \n\nCastilla's players have been sent off a staggering amount of 8 times this season, Arbeloa himself has seen a red card followed up with a two match suspension this season. The players commit too many fouls, often stupid or overly aggressive ones, and also let themselves get provoked and involved in fights too often. The star player of the team, César Palacios already saw his 5th yellow two matchdays ago, leading to him being direly missed on the weekend. He stupidly saw his 5th yellow for taking his shirt off after scoring a goal, while the captain Manuel Ángel has already missed 4 matches due to suspension this season. Our first team has seen 16 (!) red or second yellow cards since the start of last season, so the issue there is already substantial, and the last thing we need is the players to become even more out of control. \n\nThe **lack of discipline** also affects tactical aspects like concentration in a deep block, zonal and man-marking especially while defending set-pieces. Also, when caught on the counter, the team often lacks quick organisation of their defensive transition, with Lamini but also Joan often making errors in their zonal positioning. The Castilla defence can often mask this with their very fast players like Lamini, Valde and Joan, but the first team might struggle considering Huijsen's poor mobility and the knee issues of Rüdiger, Alaba and Militão. \n\nArbeloa is also not the ideal gentleman compared to Xabi - if he feels treated unfairly, be it by the press, the opponent or the referee, he will square up to them and make his opinion known, even if the IRL Hulk (Fernando Torres) is on the other side. Let's see if he tries that with some of our first team players or the board, I would bet he doesn't if he plans on keeping his job for a bit.\n\nhttps://preview.redd.it/afzoeevvlbdg1.jpg?width=1980&amp;format=pjpg&amp;auto=webp&amp;s=7ec4d5119a0a4d803bc7708b473afc6f27145f21\n\n# What I expect him to achieve with the first team:\n\nI think he will improve the atmosphere within the squad slightly, and the mood of certain players by quite a lot by trying to understand their frustrations instead of forcing them to play a certain way or punishing and ostracising them.\n\nHis type of football will not work with the players at hand, neither the aggressive press, the quick circulation or the ball retention under pressure will be possible with our attackers and midfielders, while a high line with Huijsen and Rüdiger might get caught out very often - the logical consequence would be to give opportunities to some of the players he knows and appreciates from his Castilla side, like Manuel Ángel, Cestero, Palacios or Thiago Pitarch in midfield and Joan or Valde in defense, but I'm convinced the club will not allow him to if it means less gametime for their valuable assets in the first team... \n\nSo he will have to adapt, and it's yet to be seen whether he can be tactically adaptable, as the only football he has ever shown or needed to show is this dominant and possession oriented style.\n\nI expect him to line up in a 4-3-3 (with everyone fit: Courtois - Carreras, Huijsen, Militão, Trent - Tchouaméni, Bellingham, Valverde - Vini, Mbappé, Arda/Brahim) \n\nI have a lot of trust in his knowledge and leadership and expect him to improve the team to a level that will allow him to finish the season as our first team coach, but a coach like him who demands his players to play a certain trademarked style of football will always have it hard at Real Madrid, and if someone that is already as decorated as Xabi is in his short coaching career is going out so quickly, I doubt Arbeloa can do enough to keep the job beyond the summer, let alone become a new Zidane, he's more likely to be another, but slightly more talented version of Solari. With the atmosphere at the club and the way the board has \"planned\" this squad, it certainly won't be his fault alone if things go further south, just like it wasn't Xabi's.",
        "upvotes": 79,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcoh8l/oc_what_to_expect_from_arbeloa_as_a_coach_and/"
    },
    {
        "id": "1qcpbvv",
        "author": "Specialist_Doctor_34",
        "title": "📲 Sebástian Parrilla, Xabi Alonso's assistant coach, through his latest Instagram post",
        "content": "**Sebástian Parrilla, Xabi Alonso's assistant coach, through his latest Instagram post:**  \n  \n*“The best that I know and as much as I can… turns out it’s not enough. Completely grateful, completely feeling indebted. Thank you, Mother!”*  \n  \n*\\*Sebás once served as assistant coach to Manolo Diaz at La Fábrica circa 2002 (second slide photo), he refers to Real Madrid as 'Mother.'*\n\n\n\nAll the best to him and his team.",
        "upvotes": 67,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcpbvv/sebástian_parrilla_xabi_alonsos_assistant_coach/"
    },
    {
        "id": "1qcl5tg",
        "author": "Kick1O1",
        "title": "Xabi Alonso is the permanent Real Madrid manager with the 5th shortest spell at the club in the 21st century, despite having the 4th highest points-per-game during the same period.",
        "content": "Xabi Alonso has the 5th shortest managerial spell of any Real Madrid manager in the 21st century at 7 months. He averages 2.24 points per game, ranking joint 4th highest in club history this century same as Rafa Benítez and ahead of Zidane (2.19). Only Pellegrini (2.35), Mourinho (2.30), and Ancelotti (2.29) rank higher. Posted by u/BlazingFirey on r/soccer.",
        "upvotes": 94,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b4ov7vqcyadg1.jpeg?auto=webp&amp;s=9b06941882707153b292f00809a913d4f3aac24b"
        },
        "permalink": "/r/realmadrid/comments/1qcl5tg/xabi_alonso_is_the_permanent_real_madrid_manager/"
    },
    {
        "id": "1qck9jd",
        "author": "ace-s",
        "title": "Why are Flo and the board opposing the signing of a holding midfielder that both their previous manager's desperately needed?",
        "content": "Both Carlo and Xabi wanted reinforcements. Carlo did not get any and Xabi got some reinforcements but he didnt get Zubimendi or another holding midfielder. Once again he pushed for one in the winter and again they said no. \n\nWe do not have any midfielder that can tempo control and is press ressistent like Kroos was. We saw how big of a loss Kroos was for us and Rodri was for Man C. \n\nModern football these days requires having a press resistent midfielder. ",
        "upvotes": 109,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qck9jd/why_are_flo_and_the_board_opposing_the_signing_of/"
    },
    {
        "id": "1qccpox",
        "author": "asensia-kopfschmerz",
        "title": "Xabi Alonso's coaching staff knew since November that seven Real Madrid players criticized them before the board",
        "content": "",
        "upvotes": 232,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L7a3NdN9B7gchnctvP-sYrZaN9aSAxzJ-ZbM7caojz4.jpeg?auto=webp&amp;s=0a0bb46f4a73097bc36b250e7c61b52ccc461e32"
        },
        "permalink": "/r/realmadrid/comments/1qccpox/xabi_alonsos_coaching_staff_knew_since_november/"
    },
    {
        "id": "1qcnjod",
        "author": "FrrancondonaEra",
        "title": "Arbeloa gonna make Trent rewatch his 08/09 season",
        "content": "",
        "upvotes": 35,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5i8zc388jbdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcnjod/arbeloa_gonna_make_trent_rewatch_his_0809_season/"
    },
    {
        "id": "1qby7ck",
        "author": "ace-s",
        "title": "Xabi Alonso told the club directly that their decision is wrong and unfair, and told them the reason they were sacking him is because of \"player power\". Vini, Jude and Fede were the main players against Alonso while Mbappe, Tchou and Arda were happy with him.",
        "content": "",
        "upvotes": 966,
        "comments": 216,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qby7ck/xabi_alonso_told_the_club_directly_that_their/"
    },
    {
        "id": "1qbw7yq",
        "author": "Serious-Letter7938",
        "title": "Throwback to when Xabi Alonso and Alvaro Arbeloa had a heated argument on the pitch during their days as Real Madrid players.",
        "content": "",
        "upvotes": 1187,
        "comments": 68,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eluwdf6aa5dg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbw7yq/throwback_to_when_xabi_alonso_and_alvaro_arbeloa/"
    },
    {
        "id": "1qbqv7r",
        "author": "TheFeatherDiaries",
        "title": "Khabib Nurmagomedov : I'm absolutely certain that there is no coach capable of managing a team like this at Real Madrid. I believe Alonso is among the top three coaches of our era. If this team didn't succeed with him, they should have changed the players, not the coach.",
        "content": "",
        "upvotes": 2243,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GDN62VWm6oOlBmNNzuJ6skqg6Is3w2D3lGb8NO2mTdk.jpeg?auto=webp&amp;s=db007f09e540b342b57080b14487f6a04d6b5d8d"
        },
        "permalink": "/r/realmadrid/comments/1qbqv7r/khabib_nurmagomedov_im_absolutely_certain_that/"
    },
    {
        "id": "1qcapqg",
        "author": "Kavazou77",
        "title": "For the panicked, hyperbolic and new fans. Let’s take a trip down memory lane.",
        "content": "I’m a bit shocked at all the panic on the sub and the extremes people are going to as a result of the managerial change. Honestly, welcome! Because a lot of you must be new and it’s telling by the way the activity on this sub has had an uptick. I assume it’s the post Covid era and Madrid winning in those years that lead a lot of you here. \n\nLet me show you something. This team has never been stable, it’s never lacked egos and every single manager has always been one bad month from being fired, even if you are a living legend. \n\nNo player has ever been free of criticism and there has always been those few that are die hard of the team but wish its best player would leave because they don like their personalities. In all honesty, 22/23 was the first year where we won and it wasn’t a bumpy road to the trophies. \n\nNo, the sky isn’t falling, no there isn’t a crisis and no the team won’t change and the players that make the team what it is won’t ever change either. \n\nThanks for coming to my Ted talk . \n ",
        "upvotes": 182,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcapqg/for_the_panicked_hyperbolic_and_new_fans_lets/"
    },
    {
        "id": "1qcfq0u",
        "author": "FleukYT",
        "title": "Made a mock Starting 11 graphic, feedback?",
        "content": "Came back to graphic designing after a short hiatus, finally made my first piece I am somewhat satisfied with, it looks very simple, and it is. But just wanted to know what peoples thoughts and criticisms are on it? Because I am still looking to improve.\n\nThis design is based on the match we played against Sevilla back in December.",
        "upvotes": 82,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qmbxovzsa9dg1.jpeg?auto=webp&amp;s=dabdee3de22e0c27ac2e217e5ae64bc5e8b6e0e3"
        },
        "permalink": "/r/realmadrid/comments/1qcfq0u/made_a_mock_starting_11_graphic_feedback/"
    },
    {
        "id": "1qbvuks",
        "author": "No-Independent2522",
        "title": "Bellingham posts on Insta wishing Xabi",
        "content": "",
        "upvotes": 959,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/23reythz75dg1.jpeg?auto=webp&amp;s=e8ac6b3300bb90bec20690a016794f99bbf44eed"
        },
        "permalink": "/r/realmadrid/comments/1qbvuks/bellingham_posts_on_insta_wishing_xabi/"
    },
    {
        "id": "1qbzwlz",
        "author": "No-Independent2522",
        "title": "🚨 Jude Bellingham calling out reports that he had issues with Xabi as false on his official app (JB5)",
        "content": "",
        "upvotes": 485,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mryroll6z5dg1.jpeg?auto=webp&amp;s=62c91cac086ea67798fdb1059414e977297e3c35"
        },
        "permalink": "/r/realmadrid/comments/1qbzwlz/jude_bellingham_calling_out_reports_that_he_had/"
    },
    {
        "id": "1qbuk1v",
        "author": "ace-s",
        "title": "Real Madrid players showed zero effort in tactical work, which drove Xabi Alonso crazy.\nThe players complained that Xabi was giving them too much tactical info that they didn't care about. He said it because some players constantly showed low effort, sulked, and whispered between each other",
        "content": "",
        "upvotes": 853,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nNgoA12yWluSb5SEBuKqr6Hu-LwSMCaOVmVsxdVQNoA.jpeg?auto=webp&amp;s=92397ae5ed205d342ec26371286914c09f09ff26"
        },
        "permalink": "/r/realmadrid/comments/1qbuk1v/real_madrid_players_showed_zero_effort_in/"
    },
    {
        "id": "1qbptm4",
        "author": "No-Independent2522",
        "title": "Xabi Alonso posts on Insta after leaving Madrdi",
        "content": "",
        "upvotes": 1513,
        "comments": 187,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kzdiliwiz3dg1.jpeg?auto=webp&amp;s=010f9447dfb848eb7b37fe843c182c146fe968a3"
        },
        "permalink": "/r/realmadrid/comments/1qbptm4/xabi_alonso_posts_on_insta_after_leaving_madrdi/"
    },
    {
        "id": "1qbw7jq",
        "author": "frostwyrm999",
        "title": "Looks like we are trapped by the media again",
        "content": "From this clip we can see that Carreras already asked and pointed to the right while Courtois and Mbappe were still walking to the left which then later Mbappe and Rodrygo waved their hand and asked to leave\n\nAccording to a source in X, the RFEF cameraman told Real Madrid to move because they covered the cameras view (it was on the bottom left). Chendoo kept telling the players to move to the other side, Xabi Alonso joined him. Courtois, Mbappé and Rodrygo explained that they were told to move",
        "upvotes": 523,
        "comments": 100,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2arxllpaa5dg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbw7jq/looks_like_we_are_trapped_by_the_media_again/"
    },
    {
        "id": "1qco1cb",
        "author": "Downtown-Act-590",
        "title": "Is there at least any semi-official explanation of the Xabi sacking for those out of the loop?",
        "content": "As a keen watcher of Xabi's Leverkusen, I was very surprised by his sacking. \n\nEspecially so, because Madrid was not playing terrible at all. Your club is 4 points below Barcelona with 19 games in hand, currently set to finish in the UCL top 8 and still in Copa del Rey. I know the standards are high, but this may well be a season where the club brings in some worthy trophies. \n\nHence, I found it extremely peculiar that the board decided to sack a club legend after such a short time and give command to a man with no real history of achievement as a manager, who is quite unlikely to see the season through. \n\nWas there at least semi-official explanation for this decision? An interview or e.g. a post by someone close to those in charge? I see a lot of rumours about the dressing room, but that sounds quite difficult to verify.\n\n",
        "upvotes": 11,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qco1cb/is_there_at_least_any_semiofficial_explanation_of/"
    },
    {
        "id": "1qbxwaq",
        "author": "ace-s",
        "title": "[MarioCortegana] Xabi's Sacking Full Story \"the exact moment where Xabi Alonso LOST the dressing room is when the club failed to fine Vini Jr for his outburst after El Clasico\"",
        "content": "The Real Madrid locker room was divided between:\n\n\\- Players that BELIEVED in Xabi Alonso: Kylian Mbappé, Arda Guler, Tchouaméni, Ceballos, Asencio.\n\n\\- Players that did NOT believe in him: Fede Valverde, Jude Bellingham, Vini Jr.\n\nSome Real Madrid players were UNHAPPY that the team was travelling to Bilbao the day BEFORE the game, as they wanted to spend the NIGHT in Madrid. Xabi tried to calm them down by promising them a 2-day vacation if they won. They won 3-0.\n\nA source close to Xabi Alonso: \"Real Madrid doesn't have a team that's interested in training. The players have such big egos.\"\n\nSenior club figures wanted Xabi Alonso to start Mbappé, Vini Jr, Rodrygo, and Bellingham together. That wasn't his plan at first. ",
        "upvotes": 404,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bM1cEPNoCgLqPkZUehPrvuPkNaIR3NR8mHi9-9iPUn8.jpeg?auto=webp&amp;s=4b32d6238f234e0f5bb574af41f8dd7f930bbb67"
        },
        "permalink": "/r/realmadrid/comments/1qbxwaq/mariocortegana_xabis_sacking_full_story_the_exact/"
    },
    {
        "id": "1qbny8u",
        "author": "No-Independent2522",
        "title": "Klopp : where I am now is the right place for me. It’s a sign that not everything is 100 percent right there if Xabi Alonso, who showed over two years at Leverkusen what an outstanding coaching talent he is, has to leave Real Madrid just six months later.",
        "content": "",
        "upvotes": 1543,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BnR6ML9jvjovijKCPRyeSZ_4DO51NHGf508m7a0rZAI.jpeg?auto=webp&amp;s=b5ac27d0d735302ab9650e2483495f8486c333d8"
        },
        "permalink": "/r/realmadrid/comments/1qbny8u/klopp_where_i_am_now_is_the_right_place_for_me/"
    },
    {
        "id": "1qbkzn4",
        "author": "andy111999",
        "title": "Fabrizio Romano :- Xabi Alonso told the club today:\"You CAN'T give the players this much power.\" \"It's IMPOSSIBLE for a coach to rule in a dressing room if the club is always taking the players' side.\"",
        "content": "",
        "upvotes": 2398,
        "comments": 257,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbkzn4/fabrizio_romano_xabi_alonso_told_the_club/"
    },
    {
        "id": "1qbkda1",
        "author": "nocturnal_brownie",
        "title": "Xabi Alonso is genuinely one of the kindest and most humble person in football. It wasn’t supposed to end like this..",
        "content": "",
        "upvotes": 2414,
        "comments": 117,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yqoa6r49c2dg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qbkda1/xabi_alonso_is_genuinely_one_of_the_kindest_and/"
    },
    {
        "id": "1qbs3ge",
        "author": "Sunny4k",
        "title": "The Bernabéu needs to relentlessly boo these spoiled kids",
        "content": "They’re nothing without this club and they’re acting bigger than the club. It’s absolutely unacceptable!\n\nXabi was supposed to lead us, but these brats just didn’t want to put an effort, utterly ridiculous. \n\nThese players really need to be humbled and really need to be shown that they are NOT bigger than the club, regardless of how good they are!",
        "upvotes": 569,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qbs3ge/the_bernabéu_needs_to_relentlessly_boo_these/"
    },
    {
        "id": "1qbyiog",
        "author": "No-Independent2522",
        "title": "Meanwhile its all normal back at Sanitas 😭",
        "content": "",
        "upvotes": 206,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y3xlozhiq5dg1.jpeg?auto=webp&amp;s=da93dacad92caba5f2d9a5497f36b3c42c5f2e61"
        },
        "permalink": "/r/realmadrid/comments/1qbyiog/meanwhile_its_all_normal_back_at_sanitas/"
    },
    {
        "id": "1qbylqs",
        "author": "Glad-Ad5911",
        "title": "Real Madrid’s new manager 👀",
        "content": "",
        "upvotes": 164,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/29yrsyy0r5dg1.jpeg?auto=webp&amp;s=a2aad3cae8d80128b673be8d535f46e98cc8a338"
        },
        "permalink": "/r/realmadrid/comments/1qbylqs/real_madrids_new_manager/"
    }
]