[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hxi1ti",
        "author": "Aaditya203",
        "title": "Squid Games: Unleashed Is Now Netflix's 5th Most Downloaded Game After 10M Installs\n",
        "content": "",
        "upvotes": 110,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hxi1ti/squid_games_unleashed_is_now_netflixs_5th_most/"
    },
    {
        "id": "1hxowvj",
        "author": "HehroMaraFara",
        "title": "American Primeval",
        "content": "Netflix makes and releases a lot of garbage and I freely shit all over it whenever possible. \n\nThat being said, this series is fucking metal. One, I had the most intense desire to redownload Red Dead 2 within the first 15 minutes and two, when they don’t pull punches on just how brutal even the Mormons were back then, I was all in. \n\nIve seen some people complain about it being too much, but these are probably the same people that want to burn books and pretend the real history of the United States never happened. \n\nThis series is awesome. ",
        "upvotes": 24,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hxowvj/american_primeval/"
    },
    {
        "id": "1hxrrme",
        "author": "HandsomeStarLord",
        "title": "Bring this back on Netflix I would love this shows to be on Netflix uk again they were so funny and brought so light ",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hxrrme/bring_this_back_on_netflix_i_would_love_this/"
    },
    {
        "id": "1hxg8za",
        "author": "NamikazeKage",
        "title": "American Primeval on Netflix is damn good",
        "content": "It is frankly surprising that I found out the show existed randomly yesterday night when I came upon the IMDB most anticipated shows of 2025 and then by 3am the entire show released on Netflix. I wanted to watch one episode a day to pace myself but i just caved and binged the whole show, and it is the BEST western I've seen in YEARS. Highly recommend.",
        "upvotes": 56,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1hxg8za/american_primeval_on_netflix_is_damn_good/"
    },
    {
        "id": "1hxguia",
        "author": "goldingot_",
        "title": "Any suggestions for 2000s shows?",
        "content": "I watched dexter recently and got hit with nostalgia with how shows were made and written during those years like hawaii five-o but dexters premise was more interesring and less rinse and repeat. any show recs?",
        "upvotes": 20,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hxguia/any_suggestions_for_2000s_shows/"
    },
    {
        "id": "1hxpuf9",
        "author": "speed_ganggg",
        "title": "Why can't I watch some shows and movies on my profile that I can watch on a family members profile on the same account????",
        "content": "Title. I search up the show, for example Arcane, and it doesnt show up on my profile. However when I switch to a family members profile I can watch it. What is the reason. Also when I search the show up on google and then netflix and click the link while my profile is active it comes up but it says \"remind me\" with a bell next to it. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxpuf9/why_cant_i_watch_some_shows_and_movies_on_my/"
    },
    {
        "id": "1hxschi",
        "author": "Ornery_Disaster_953",
        "title": "Netflix Android App Brightness Slider",
        "content": "When is Netflix going to fix the awful brightness slider. Why even have a slider like that, nobody needs it. Many people know it exists, but it causes so many problems. I cannot reach the lowest brightness and neither the highest. It deactivates automatic brightness, which makes me get flashed trying to watch in a dark room, after watching somewhere in the sun...  Some people are also having the problem of it disabling the blue light filter...",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxschi/netflix_android_app_brightness_slider/"
    },
    {
        "id": "1hxs45y",
        "author": "Outragedwaffle",
        "title": "Strangest scam/hack?!",
        "content": "So I tried to open Netflix tonight, upon opening it had signed me out, when I tried to sign in it I got told my password was incorrect, I clicked reset password.\n\nWhen I opened my email I noticed that on 06/01/2025 I had 3 emails, someone had already reset my password, changed my email address and then changed the payment details and upped the plan to the £17.99 plan.\n\nSo I fairly understand that someone could want to gain access to your account and use your payment details to get some free Netflix.\n\nBut what I do not understand and can not understand is why they changed the payment details? That physically doesn’t make sense to me.\n\nAny ideas?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hxs45y/strangest_scamhack/"
    },
    {
        "id": "1hxqywl",
        "author": "mkaszycki81",
        "title": "Is there a way to force Netflix app to send UHD-4K (3840 px horizontal) instead of DCI-4K (4096 px horizontal) to LG TV?",
        "content": "Hi!\n\nMy TV is an ordinary LG B8 4K OLED with 3840×2160 resolution (16:9). A lot of content on Netflix is properly recorded in 16:9 aspect ratio UHD (3840×2160) and the picture fills the screen.\n\nHowever, theatrical movies are a different matter. They're recorded in DCI-4K (4096×2160 resolution, \\~17:9 aspect ratio) with an extra 256 horizontal pixels. Movie theaters make use of the entire resolution, there are home projectors and some exotic TVs that can display 4096 horizontal pixels, but my TV can't.\n\nHowever, I can't force the TV to just discard the 256 pixels, and instead it rescales the video to the 3840 horizontal pixels, displaying it in a very slight letterbox. The slight rescale also means a bit of blurriness which basically makes the displayed picture not much better than full HD resolution. Not that it matters much with typical viewing distances, but Dolby Vision isn't available with full HD video and I'm not sure about Dolby Atmos, I always had the UHD package, never tried the lower tiers.\n\nAt the very least, it wastes 6.25% of bandwidth and causes the TV to get warm due to having to rescale the movie.\n\nAnother missed opportunity is that the smart TV app is not smart enough to just align the top of the picture with the top of the screen and use the extra 135 pixels on the bottom for subtitles so they cover less of the movie, but it can't.\n\nIn short, I'd like Netflix to just send a UHD (3840×2160) stream to my TV. It can be pan/scan to show the important bits if the director was so inclined as to use the entire frame to put something important on it, but I'd be fine with just a crude center crop, it's not like trying to fit as much as possible from a 2.35:1 CinemaScope content on a 4:3 CRT TV thirty years ago.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxqywl/is_there_a_way_to_force_netflix_app_to_send_uhd4k/"
    },
    {
        "id": "1hxqqoh",
        "author": "cooly0urjets",
        "title": "Can I change the Netflix home screen on my laptop?",
        "content": "Sorry in advance if this has been asked before.  \n\nFor the last several weeks, my Home Screen has been showing the Netflix game “Underwater-Melon” at the top of the page.  I no longer see new arrivals. It’s just been this stupid looking watermelon cartoon and annoying childish sounding music. It has begun to annoy me greatly. \nI don’t have this problem on my phone or my TV. It’s just on my laptop, which is my main way of watching. I am currently using a cheap, crappy Chromebook if that makes any difference.  Does anyone know if there is a way to change this, or at least have it cycle and show different videos so it’s not the same thing every time I sign on?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxqqoh/can_i_change_the_netflix_home_screen_on_my_laptop/"
    },
    {
        "id": "1hxqavq",
        "author": "No_Leader1868",
        "title": "Do Netlix games have a precedent on including more supported devices?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxqavq/do_netlix_games_have_a_precedent_on_including/"
    },
    {
        "id": "1hxok4r",
        "author": "Impossible_Wafer_311",
        "title": "Netflix Preview Club ",
        "content": "Hello! ☺️\n\nNot sure who/ where to ask, please remove if inappropriate!\n\nI'm part of the Netflix Preview Club and have been able to watch a preview, but haven't received a survey email to fill in! I don't know who to contact, Netflix general customer service doesn't seem to know a lot about the club.... \n\n\nThank you in advance ✨\n\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hxok4r/netflix_preview_club/"
    },
    {
        "id": "1hxcxwt",
        "author": "Atlast_2091",
        "title": "Sakamoto Days | Final Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hxcxwt/sakamoto_days_final_trailer_netflix/"
    },
    {
        "id": "1hwn7w1",
        "author": "S4v1r1enCh0r4k",
        "title": " New Jerry Springer docuseries discovers some shocking stuff about the show, some of which we could already assume, apparently the producers went as far as to blackmail poor guests if they thought about not showing up for the final show panel ",
        "content": "",
        "upvotes": 325,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1hwn7w1/new_jerry_springer_docuseries_discovers_some/"
    },
    {
        "id": "1hxo4qa",
        "author": "NewFrenchie760",
        "title": "Is anyone that worked at WWE Raw is Netflix premiere selling those \"staff jackets\" ?",
        "content": "I attended the WWE RAW on Netflix premiere (which was historic!) and saw the amazing jackets that the staff was wearing. It was red, gray, or black jackets with the RAW on Netflix logo. Was interested to see if anyone was willing to sell a jacket or two? Would like to buy as a gift for my nieces who attended there first WWE event ever and loved this experience! Please DM.        ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxo4qa/is_anyone_that_worked_at_wwe_raw_is_netflix/"
    },
    {
        "id": "1hxfd0f",
        "author": "S4v1r1enCh0r4k",
        "title": "Here Are the Amounts that Each ‘Squid Game’ Season 2 Character Owes",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxfd0f/here_are_the_amounts_that_each_squid_game_season/"
    },
    {
        "id": "1hxmv6r",
        "author": "Wooden-Reserve-2573",
        "title": "Netflix Games on Instagram: \"which new year responsibility are you fighting off? #netflixgames 🎮: into the dead 2: unleashed\"",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hxmv6r/netflix_games_on_instagram_which_new_year/"
    },
    {
        "id": "1hxddm0",
        "author": "ThePrinceoP49",
        "title": "Netflix Sets Stop-Motion Japanese Series ‘My Melody &amp; Kuromi’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxddm0/netflix_sets_stopmotion_japanese_series_my_melody/"
    },
    {
        "id": "1hx90l2",
        "author": "Legitimate_Ad3625",
        "title": "Mo: Season 2 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx90l2/mo_season_2_official_trailer_netflix/"
    },
    {
        "id": "1hx6tbj",
        "author": "Yazikussy",
        "title": "American Primeval release time?",
        "content": "Hi. New(ish) into Netflix. I don't typically follow when things are releasing and I don't watch much.\n\nAmerican Primeval was said to be releasing today. Is there a specific time that Netflix does releases? Thanks!",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hx6tbj/american_primeval_release_time/"
    },
    {
        "id": "1hx3lam",
        "author": "Complete_Question_41",
        "title": "How the hell do I stop netflix from asking me to sign in every day or second day?",
        "content": "It makes no sense, and it means other people in the house can't use netflix on my xbox when I am not around as the damn thing keeps asking them to sign in.\n\nOnce every week, sure. But it's daily, which is just nuts.",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hx3lam/how_the_hell_do_i_stop_netflix_from_asking_me_to/"
    },
    {
        "id": "1hxm4zm",
        "author": "redskrot",
        "title": "How to prevent kids using profile?",
        "content": "So i noticed that one of my kids have used my Netflix profile to watch a mature tv show.\n\nI can't seem to find a way to remove my profile from his iPad.\n\nAny tips on how to prevent this? I still want him to be able to use his own profile.\n\nEdit: i have obviously already talked about it with him. He is 7 and there are some things on Netflix that he should absolutely not see at his age.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hxm4zm/how_to_prevent_kids_using_profile/"
    },
    {
        "id": "1hwtq3m",
        "author": "Frensisca-",
        "title": "Non-murder documentaries ",
        "content": "I would like to watch non-murder true crime documentaries, such as fraudulent, scam. financial, medical crimes etc also political scandals. I appreciate your recommendations.",
        "upvotes": 28,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1hwtq3m/nonmurder_documentaries/"
    },
    {
        "id": "1hwh37q",
        "author": "Robemilak",
        "title": "‘Squid Game’ Season 2 earns 126.2M views from its first 11 days on Netflix. Faster than any series ever on the platform.\n",
        "content": "",
        "upvotes": 129,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hwh37q/squid_game_season_2_earns_1262m_views_from_its/"
    },
    {
        "id": "1hx8hp5",
        "author": "ToonAdventure",
        "title": "My Melody &amp; Kuromi | First Look | Netflix Anime",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hx8hp5/my_melody_kuromi_first_look_netflix_anime/"
    },
    {
        "id": "1hwqxuk",
        "author": "Alternative-Earth325",
        "title": "Squid Game, Alice in Borderland, The 8 Show. What’s your favorite and why?",
        "content": "Which is the standout among the survival dramas *Squid Game*, *Alice in Borderland*, and *The 8 Show*? \n\n*Squid Game* offers a poignant look at desperation with its deadly childhood games, becoming a global phenomenon due to its storytelling and character arcs. \n\n*Alice in Borderland* combines sci-fi with survival, setting its narrative in a deserted Tokyo with an intriguing card game twist, noted for its visual appeal and plot twists. \n\n*The 8 Show* examines human psychology within a grim reality show, tackling themes of greed and morality with a touch of dark humor. \n\nConsidering their unique elements - from social critique to innovative game concepts - which do you believe excels in narrative depth, character development, and cultural impact? Share your thoughts on these compelling series.",
        "upvotes": 21,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hwqxuk/squid_game_alice_in_borderland_the_8_show_whats/"
    },
    {
        "id": "1hx3ghf",
        "author": "ZealousidealLuck4665",
        "title": "The perfect couple is horrific ",
        "content": "Just started watching the perfect couple I'm on episode 2, I've stopped it numerous times because of the horrid script. Does it get better? From Nicoles awful lace front wigs and stiff face to the awful script that tries so hard to be scandalous and feels like some sort of rip off of White lotus in a way. I want to give it a chance but honestly have no idea if it's worth the watch or not if anyone has finished it, is it truly worth it?",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hx3ghf/the_perfect_couple_is_horrific/"
    },
    {
        "id": "1hxgxuk",
        "author": "peggysuedog",
        "title": "How to submit a complaint? ",
        "content": "How do I submit a complaint about Netflix customer service? \nI just reached out to Netflix with an issue about my account and received the worst customer service I have ever received. I tried to email a resolutions email address but received a bounce back. Has anyone got any idea about where to send a complaint? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hxgxuk/how_to_submit_a_complaint/"
    },
    {
        "id": "1hxerpq",
        "author": "North_Preparation219",
        "title": "Santa Clarita Diet Season 4",
        "content": "Hey! Use this link to request season 4! If we can get enough people to request it then we can get season 4! \n\nhttps://help.netflix.com/en/titlerequest",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hxerpq/santa_clarita_diet_season_4/"
    },
    {
        "id": "1hxj47k",
        "author": "Zeroyhme",
        "title": "Any thoughts about this?",
        "content": "I’ve seen several posts about this, and it looks like the photo/announcement came from Comic-Con. So it might actually be true that Netflix is about to milk this show dry.",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hxj47k/any_thoughts_about_this/"
    }
]