[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 131,
        "comments": 483,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mwqc5q",
        "author": "ToonAdventure",
        "title": "Blue Eye Samurai: Season 2 | Official Start of Production | Netflix",
        "content": "",
        "upvotes": 86,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqc5q/blue_eye_samurai_season_2_official_start_of/"
    },
    {
        "id": "1mw700m",
        "author": "BlackDoom_26",
        "title": "The most binge worthy Netflix show or movie you’ve ever watched",
        "content": "You ever start a show or movie on Netflix thinking you’ll just watch one episode, then suddenly it’s 3am and you’ve watched the whole thing? Just curious what people’s recommendations are for ones that really had you hooked.",
        "upvotes": 715,
        "comments": 1228,
        "media": null,
        "permalink": "/r/netflix/comments/1mw700m/the_most_binge_worthy_netflix_show_or_movie_youve/"
    },
    {
        "id": "1mxabaj",
        "author": "lobstersonskateboard",
        "title": "Watched Sneaky Pete after it moved to Netflix— underrated gem!",
        "content": "I was sad to see it got cancelled after 3 seasons, there was still so much it could explore. I absolutely loved every bit of it, the acting is phenomenal and the story's been the most engaging thing I've seen on Netflix in a long time. \n\nI wonder with it moving to Netflix that maybe, just *maybe*, there's a small chance it could get a renewal? Copium, I know, but I wonder if anyone else feels the same way. I'm not sure if David Shore even has the capacity to do something in the near future, since he's working on a new series at the moment... But a man can hope.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxabaj/watched_sneaky_pete_after_it_moved_to_netflix/"
    },
    {
        "id": "1mwvq5p",
        "author": "BlueRose99x",
        "title": "Marco Polo",
        "content": "Well, for the longest time I refused to watch this show because I thought it wouldn’t be great. Genghis Khan grandson’s empire? Barely little facts to the actual Kublai Khan story? No thanks.\n\nBut I just finished it, and in reality it was amazingly good. Definitely kept me on the edge and wanting more. Too bad the series got canceled and left the last season on a cliffhanger. No closure, damn you Netflix. ",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mwvq5p/marco_polo/"
    },
    {
        "id": "1mwgfil",
        "author": "bbqchef_nyc",
        "title": "Which cancelled Netflix show do you wish would come back?",
        "content": "Same as the question.\n\nIf you had the power to bring ONE cancelled Netflix series back for at least one more season, which show would you pick and why?",
        "upvotes": 110,
        "comments": 943,
        "media": null,
        "permalink": "/r/netflix/comments/1mwgfil/which_cancelled_netflix_show_do_you_wish_would/"
    },
    {
        "id": "1mx0zig",
        "author": "Ok_Let_893",
        "title": "Hostage",
        "content": "ANOTHER DISAPPOINTING LIMITED SERIES. The story doesn’t make sense. The negotations, the military/ security tactics. Script and dialogues feel like Chatgpt made it. I am on ep 5. Just gotta finish it for closure.",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mx0zig/hostage/"
    },
    {
        "id": "1mx5kju",
        "author": "hamptont2010",
        "title": "Long Story Short is phenomenal",
        "content": "Not the movie, because apparently there is a movie with the same name, but the new show from the people behind Bojack Horseman. I'm currently on episode, and it's everything you'd expect from the BoJack crew and more. It's funny, charming, witty, heart-breaking, and moving. The premise of jumping around to different timelines also allows it to tell some really interesting stories. If you like Bojack, it's definitely worth checking out!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mx5kju/long_story_short_is_phenomenal/"
    },
    {
        "id": "1mxb4oa",
        "author": "fartingpopsicles",
        "title": "Does anyone else find it annoying that no one helps Wednesday in the series when she actually needs it?",
        "content": "\\[SPOILER ALERT BTW\\]\n\nts is pissing me off. like bro just help the poor girl. she keeps asking her mother for help. she keeps stressing over minimal clues and all that. she has proven herself worthy of belief regarding the crime scenes after that joseph crackstone and hyde incidents but somehow everyone keeps asking her to stop except probably uncle fester and recently, her grandmama. especially her mother!!! she keeps asking Wednesday to stop when she is clearly trying to prevent the goddamn death of her best friend??? in s2 episode 4 SHE SAW THEM GETTING ATTACKED BY THE BIRDS. but still she keeps pushing wednesday beyond the boundaries. let the girl breathe jeez\n\nalso, morticia can see how hiding the truth from wednesday does NO good whatsoever but she just has to protect her secrets and stuff. god this is stressing tf outta me",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxb4oa/does_anyone_else_find_it_annoying_that_no_one/"
    },
    {
        "id": "1mxb2ah",
        "author": "Vast-Passenger-2620",
        "title": "Sense8 Sensational",
        "content": "From the makers of The Matrix this series from 2018 confounded marketing efforts and was cancelled after 2 seasons. It’s very difficult to explain but I think it’s more mind blowing than The Matrix. I have watched it 4 times already and continue to discover new profound insights. Sense8 explores the nature of Reality and Identity. What defines us? Name? Gender? Job? Expression of Love? If everyone is interconnected is that why we must be kept divided and dumbed down for the powers that be to keep us controlled?\nThis is in my Top 5",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxb2ah/sense8_sensational/"
    },
    {
        "id": "1mx4mle",
        "author": "Sweaty-Toe-6211",
        "title": "‘Death By Lightning’ Starring Michael Shannon &amp; Matthew Macfadyen Gets Netflix Premiere Date (November 6)",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mx4mle/death_by_lightning_starring_michael_shannon/"
    },
    {
        "id": "1mwr9ek",
        "author": "ToonAdventure",
        "title": "Devil May Cry: Season 2 | First Look | Netflix",
        "content": "",
        "upvotes": 20,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mwr9ek/devil_may_cry_season_2_first_look_netflix/"
    },
    {
        "id": "1mx3if4",
        "author": "No-Muffin-874",
        "title": "Need help with an older animated kids show",
        "content": "I need help trying to find an animated kids show that was on Netflix, somewhere around 2016. It was circus themed, and was mostly musical. I specifically remember a tiger singing, but there were other animals. It seems like the songs were set to classical music, but I may be wrong. Any help figuring this out would be very appreciated, as I have been unsuccessful. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mx3if4/need_help_with_an_older_animated_kids_show/"
    },
    {
        "id": "1mx34cl",
        "author": "Sun_Flower11",
        "title": "Sophia in Greenleaf",
        "content": "In the show Greenleaf, why didn’t they just take some of Sophia’s eggs? They could’ve frozen them for the future and she could’ve gotten a surrogate to carry. Strange this was never an option given.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mx34cl/sophia_in_greenleaf/"
    },
    {
        "id": "1mx6gnx",
        "author": "paintednature",
        "title": "account sharing (without actually sharing)",
        "content": "hey,\nits my siblings' 16th birthday on sunday and i wanted to gift them a netflix subscription. however i moved out and have my own subscription with my partner, i wanted to make a netflix sub where they each have an account for themselves.\n\ntheres this household-sharing rule, how do i set up this subscription? do i need to be in their wifi and set it up because of the ip-adress? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mx6gnx/account_sharing_without_actually_sharing/"
    },
    {
        "id": "1mwe7u7",
        "author": "peoplemagazine",
        "title": "First Look at Emily in Paris Season 5 | 📷: Netflix",
        "content": "Netflix shared first-look images of the fifth season of 'Emily in Paris' on Wednesday, which sees the titular character, played by Lily Collins, continuing her journey in Venice, Italy — and the return of Lucas Bravo as Gabriel. More details [here](https://people.com/emily-in-paris-season-5-first-look-lily-collins-continues-italian-adventure-lucas-bravo-returns-11794241?utm_campaign=peoplemagazine&amp;utm_medium=social&amp;utm_source=reddit.com&amp;utm_content=post).",
        "upvotes": 55,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1mwe7u7/first_look_at_emily_in_paris_season_5_netflix/"
    },
    {
        "id": "1mwqk4m",
        "author": "ToonAdventure",
        "title": "Splinter Cell: Deathwatch | Official Teaser | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqk4m/splinter_cell_deathwatch_official_teaser_netflix/"
    },
    {
        "id": "1mwyl6e",
        "author": "Uraqtae",
        "title": "extra member for $8 dollars thinks its main household member?",
        "content": "i’m just gonna out my family. My aunt is broke so she borrows our streaming accounts all the time no problem shes family who cares so we added an extra account through our Netflix for the extra $8  but it kicked my entire family off the Netflix and the only way to bypass it with another device (or my moms email) cool i can use my phone or living room tv right NAH it thinks the main household device (id use my moms email to fix it but its the middle of the night shes sleeping i dont know her password and im a night owl ill get it tomorrow) is my aunts Roku top box and what I find annoying is I thought that buying the extra account would cancel out the not a part of the household error we keep getting but it doesnt??",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mwyl6e/extra_member_for_8_dollars_thinks_its_main/"
    },
    {
        "id": "1mwx05t",
        "author": "Horror-Internet-9601",
        "title": "Biggest plot hole in Damsel",
        "content": "I’m rewatching it for like the fourth time (it’s a good background noise movie) and I’ve finally had enough with this plot hole: who the fuck drew the map? V was the only one who seems to make it past the crystal cave and she clearly died at the top, and even if she’d lived how and why would she climb back down to make that map😭 am I missing smth or is this just a massive plot hole that none of the creators thought of ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mwx05t/biggest_plot_hole_in_damsel/"
    },
    {
        "id": "1mx0h2c",
        "author": "PaperFlower14765",
        "title": "Wtf",
        "content": "Dude. The way my Netflix account has been working for the last like, I don’t know… maybe couple months? It has been so frustrating. The load times are ridiculous. The time between when I press pause and when it actually happens is absurd. At this point I swear I’d get better quality from a vhs tape! What is happening?! Anyone else experiencing this??",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mx0h2c/wtf/"
    },
    {
        "id": "1mwwlbt",
        "author": "ADEEXL",
        "title": "Help to find this show that i see on Netflix pliss",
        "content": "Hey everyone, I’m trying to remember the name of an animated show I watched on Netflix a while ago. I don’t know if it’s still there, but I remember a bunch of weird and specific things:\n\t•\tThe main character is a kid who lives in a strange world with bizarre creatures.\n\t•\tHe finds a really weird dog that sort of adopts him. The dog is super powerful and can open its face to absorb or eat things.\n\t•\tThere’s one scene I clearly remember: a piece of debris is about to fall on the kid, and the dog opens its face and sucks it in to protect him.\n\t•\tThe dog could transform, possibly into other forms or weapons.\n\t•\tThese creatures (like the dog) were treated by humans as tools or weapons to fight others like them.\n\t•\tI think the kid’s mom dies early in the show.\n\t•\tThere’s also some company or organization trying to capture the dog because it’s too overpowered.\n\t•\tAt some point, it’s mentioned that the dog destroyed or made an entire island disappear, and the kid’s dad was on that island.\n\n Does anyone know what this show is called? I’ve been trying to find it for days and it’s driving me crazy.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mwwlbt/help_to_find_this_show_that_i_see_on_netflix_pliss/"
    },
    {
        "id": "1mwzwxu",
        "author": "InboxGhost",
        "title": "What's that one underrated gem on Netflix India you wish more people talked about?",
        "content": "Everyone's heard of the big hits like squid games and delhi crime, but what's that one show or movie you randomly clicked and ended up loving?\nCould be a regional film, a niche documentary, comedy movie , rom com or even a hidden international series buried deep in the algorithm.\nDrop your favourite gem below and see who else like it as well.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mwzwxu/whats_that_one_underrated_gem_on_netflix_india/"
    },
    {
        "id": "1mwt7jx",
        "author": "SatisfactionOther595",
        "title": "Survival stories",
        "content": "I just watched 2 episodes of Survival Stories where they talk about JMS but I didn't quite understand why Netflix attacked itself for another documentary from 2 years ago, could someone explain to me why Maple was so important in the case and why there is a conflict with that documentary",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwt7jx/survival_stories/"
    },
    {
        "id": "1mwfbhc",
        "author": "Less_Manufacturer218",
        "title": "Excited for new show HOSTAGE-same actress from Dr. Foster!!!!",
        "content": "Just saw this new show hostage and has the foreign actress (I’m from the US) from Doctor Foster! Been waiting for something good with her in it and forgot about it and wham a pleasant surprise!!",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mwfbhc/excited_for_new_show_hostagesame_actress_from_dr/"
    },
    {
        "id": "1mws9rc",
        "author": "Relevant_Ruin_8704",
        "title": "Netflix Next Episode Button Gone?",
        "content": "Netflix on my TV just updated and there is normally a next episode button when I pause but I think it’s gone? Now I have to back out and go to the episode list OR wait until the end. Is this a bug or is this just how the new update looks? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mws9rc/netflix_next_episode_button_gone/"
    },
    {
        "id": "1mwrvih",
        "author": "ToonAdventure",
        "title": "Record of Ragnarok III | Official Trailer 2 | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwrvih/record_of_ragnarok_iii_official_trailer_2_netflix/"
    },
    {
        "id": "1mvg1hu",
        "author": "SplitNational2929",
        "title": "Netflix’s KPop Demon Hunters Movie Theater Screenings Are Already Almost Sold Out",
        "content": "",
        "upvotes": 502,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1mvg1hu/netflixs_kpop_demon_hunters_movie_theater/"
    },
    {
        "id": "1mwqm3i",
        "author": "ToonAdventure",
        "title": "Sakamoto Days | Part 2 Mid-Season Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqm3i/sakamoto_days_part_2_midseason_trailer_netflix/"
    },
    {
        "id": "1mwnt3a",
        "author": "Movies10",
        "title": "Netflix Wednesday Season 2 Outcastaway Cruise (PR Stunt)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mwnt3a/netflix_wednesday_season_2_outcastaway_cruise_pr/"
    },
    {
        "id": "1mvyuz4",
        "author": "hfourm",
        "title": "New Netflix UI on Apple TV - Terrible",
        "content": "I have never been so insulted by an update in my life.\n\nThe arrogance of the product management and design teams to roll this out, is mind numbing.\n\nI literally can only see 3 and a half titles MAX at a time. I get motion sick trying to navigate through titles to find something interesting to watch.\n\nAm I going crazy?\n\nWhatever metrics they chose to A/B test this rollout goes to show you how even the smartest tech talent can succumb to feeling like they are innovating and reverse engineering the metrics to prove it.\n\nI cancelled my subscription. \n\nNetflix literally invented the user experience and mental model most of us expect for streaming apps. To take it in the direction they have is pure hubris.",
        "upvotes": 24,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1mvyuz4/new_netflix_ui_on_apple_tv_terrible/"
    },
    {
        "id": "1mvuj2m",
        "author": "iLikeDinosaursRoar",
        "title": "Dept. Q Renewed for a Second season",
        "content": "We did it guys!\n\nDept Q gets a second season. Let's just hope it's as good as the first season and we get more after this. \n\nhttps://www.bbc.com/news/articles/ckgj8xn9zx0o.amp\n",
        "upvotes": 42,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mvuj2m/dept_q_renewed_for_a_second_season/"
    }
]