[
    {
        "id": "1iyobt1",
        "author": "MyDeadFriendZoe",
        "title": "Hey /r/movies! I am Kyle Hausmann-Stokes, the director/co-writer/producer of the dark comedy ‘MY DEAD FRIEND ZOE.’ (Ed Harris, Morgan Freeman, 100% RT, SXSW Audience Award). I’m a former paratrooper, the film is autobiographical, and got made by totally nontraditional means. AMA! (Back at 7 PM ET)",
        "content": "",
        "upvotes": 41,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4ch4ia2bqhle1.png?auto=webp&amp;s=2d0d7729ff3f4acb5b9406fb7215321c373cd5bf"
        },
        "permalink": "/r/movies/comments/1iyobt1/hey_rmovies_i_am_kyle_hausmannstokes_the/"
    },
    {
        "id": "1iyt2kf",
        "author": "MarvelsGrantMan136",
        "title": "Actress Michelle Trachtenberg Dead at 39",
        "content": "",
        "upvotes": 35097,
        "comments": 3787,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mU7sebwLt5ilXmZhNJA5dki1_pt1Xr7gLB7IKjMnWCM.jpg?auto=webp&amp;s=a9ad4bd174c057d87f82c8a26a858d4c4203becb"
        },
        "permalink": "/r/movies/comments/1iyt2kf/actress_michelle_trachtenberg_dead_at_39/"
    },
    {
        "id": "1iz01k1",
        "author": "MarvelsGrantMan136",
        "title": "Steven Spielberg’s New UFO Movie Has Begun Filming - Starring Emily Blunt, Wyatt Russell, Colman Domingo, Colin Firth, Eve Hewson and Josh O’Connor",
        "content": "",
        "upvotes": 690,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bFOVEErUzwi5ir0RBywxApyFxEwXrapNXxE9mpSeVaY.jpg?auto=webp&amp;s=649b5757fbf205366b02a804b6e026ac79a75fe9"
        },
        "permalink": "/r/movies/comments/1iz01k1/steven_spielbergs_new_ufo_movie_has_begun_filming/"
    },
    {
        "id": "1iyudxk",
        "author": "Somnambulist815",
        "title": "Tom Cruise needs to go back to playing broken men",
        "content": "Tom Cruise seems to be winding down his death-defying era, if the rumors around MI:9 being the last one with Ethan Hunt are true. But I don't think hanging off cliffs or holding his breath for 10 mintues are his true forte. \n\nFor me, Cruise's best roles have always been men who are deeply broken and fight vigorously and belligerently to deny that reality. Collateral, Magnolia, Minority Report, Eyes Wide Shut, War of the Worlds, all of these performances, I find to be the most compelling in his career, because they all carry that contradiction of an emotionally and psychologically broken and stunted man, fighting vigorously to maintain a facade of having it together.\n\nIf Cruise is hanging up the parachutes and helicopters for good, now, I think he should look past Xenu and revive that Seminarian guilt, and maybe finally get that Oscar.",
        "upvotes": 1028,
        "comments": 322,
        "media": null,
        "permalink": "/r/movies/comments/1iyudxk/tom_cruise_needs_to_go_back_to_playing_broken_men/"
    },
    {
        "id": "1iyr09p",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Gareth Evans' 'HAVOC' Starring Tom Hardy - After a drug deal gone wrong, a bruised detective must fight his way through a criminal underworld to rescue a politician's estranged son, while unravelling a deep web of corruption and conspiracy that ensnares his entire city.",
        "content": "",
        "upvotes": 879,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/63qpxxrubile1.jpeg?auto=webp&amp;s=b5f7fabf0e3d3891b3b88935aaf8f66906a1c6d7"
        },
        "permalink": "/r/movies/comments/1iyr09p/official_poster_for_gareth_evans_havoc_starring/"
    },
    {
        "id": "1iyquza",
        "author": "MarvelsGrantMan136",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 788,
        "comments": 178,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H057gCadG0t7FdW1UPhGJu1tCvpzy7bfYd4_XgSCcFo.jpg?auto=webp&amp;s=00089beed78952af1be8e9b681549011dee38ec4"
        },
        "permalink": "/r/movies/comments/1iyquza/havoc_official_teaser_netflix/"
    },
    {
        "id": "1iyvh7t",
        "author": "Disastrous-Jello-247",
        "title": "Anyone seen ‘Up in the air’? Any thoughts?",
        "content": "I just finished watching *Up in the Air*, and I’m completely overwhelmed. I initially thought the film was glorifying corporate culture, but as it unfolded, it revealed a much deeper commentary on its toxicity—both for those who enforce it and those who suffer from it. I loved how it emphasized the importance of human connection.  \n\nOne thing that stood out to me was the contrast between Clooney’s and Kendrick’s characters. He’s a loner who avoids attachment yet insists on conducting layoffs face-to-face (perhaps because it allows him to keep traveling). Meanwhile, she values connection but prefers to handle things remotely, through a screen. It almost feels like the movie is making contradictory points.  \n\nAnd Vera’s character—that completely took me out. I still don’t know how to process that revelation.\n\nIdk if anyone else has seen this movie. It was released in 2009, and Im just seeing it NOW! How’d I miss it? What do you guys think?",
        "upvotes": 231,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1iyvh7t/anyone_seen_up_in_the_air_any_thoughts/"
    },
    {
        "id": "1iyqgdd",
        "author": "YohannT",
        "title": "Guy Pearce Next Movie will be a western : 'Killing Faith'",
        "content": "",
        "upvotes": 409,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u88emkSGtOFkPdQFP0jn42UM8S-XqrbYuffTX3JuxYo.jpg?auto=webp&amp;s=7dcccd14d679db26258ee071927a0238bbb6b166"
        },
        "permalink": "/r/movies/comments/1iyqgdd/guy_pearce_next_movie_will_be_a_western_killing/"
    },
    {
        "id": "1iyknhb",
        "author": "soalone34",
        "title": "Inside the Oscar-Nominated Film That No Studio Will Touch: “No Other Land”",
        "content": "",
        "upvotes": 954,
        "comments": 263,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f0O48djayP_VPaPlTUBOuWu_-W_Q65wUrw6sHhURyXg.jpg?auto=webp&amp;s=c865902fffaef437cb9cd26ccd46ad0741e25ef2"
        },
        "permalink": "/r/movies/comments/1iyknhb/inside_the_oscarnominated_film_that_no_studio/"
    },
    {
        "id": "1iysffe",
        "author": "NoCulture3505",
        "title": "THE SURFER | Official Trailer | In theaters May 2nd",
        "content": "",
        "upvotes": 163,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X0m54YPRzGybTuHT4_vhbP65xoc2H8bxVhhsNvn-Tlk.jpg?auto=webp&amp;s=a40d7a33ae3242963ea199eb648d596d080f6736"
        },
        "permalink": "/r/movies/comments/1iysffe/the_surfer_official_trailer_in_theaters_may_2nd/"
    },
    {
        "id": "1iyo2sw",
        "author": "Odd_Advance_6438",
        "title": "I really disagree with the take that the Watchmen movie glorifies the characters",
        "content": "So I really like the movie, I think it does a good job translating some very challenging source material. It’s got its flaws, but I think overall it’s an entertaining movie.\n\nI do see a lot of people claim it misses the point of the book, specifically in how the heroes are portrayed, but I think that’s a little unfair.\n\nIn my opinion, the heroes are still very much portrayed as incredibly flawed individuals. Rorschach is still a homophobic psychopath (I’ve seen a lot of people say that was cut out of the movie, but he definitely still says bigoted stuff), the Comedian is still a douche, Dr Manhattan is increasingly apathetic, and Nite Owl has to fight crime just to get hard rather than out of the goodness of his heart.\n\nI think a lot of it comes down to how people perceive Snyders style in the movie. The main argument is that the way he frames action and the camera makes the heroes look too badass. I can kind of see that criticism, but it doesn’t change what kind of people they are. Just because Rorschach has a cool shot in the rain doesn’t make him any less of a nut job.\n\nAs for the action, I feel like it’s deliberately shot in an exaggerated violent way to make the characters look even more irresponsible and messy, like in the alleyway mugging. I feel like it makes Silk Spectre and Nite Owl not look very heroic to see them getting excited over the prospect of breaking bones out of peoples arms. It may be shot in a cool way, but it also demonstrates how that lifestyle might seem intoxicating for the characters ",
        "upvotes": 211,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1iyo2sw/i_really_disagree_with_the_take_that_the_watchmen/"
    },
    {
        "id": "1iyq7bj",
        "author": "30Bones",
        "title": "REDUX REDUX | SXSW Festival Teaser | In an attempt to avenge her daughter's death, a woman travels through parallel universes, killing her daughter’s murderer over and over again.",
        "content": "",
        "upvotes": 147,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1en-c0NlA-qwGwKwGI5q_bkj7VkPYEIHz9pOVJ0wqyw.jpg?auto=webp&amp;s=229e927b81ad1ca9e39470d9a6193bf1079dfbcf"
        },
        "permalink": "/r/movies/comments/1iyq7bj/redux_redux_sxsw_festival_teaser_in_an_attempt_to/"
    },
    {
        "id": "1iy98cm",
        "author": "MarvelsGrantMan136",
        "title": "Roberto Orci Dies: ‘Star Trek’, ‘Transformers’ &amp; ‘Hawaii Five-0’ Writer-Producer Was 51",
        "content": "",
        "upvotes": 2600,
        "comments": 283,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4PGTB061g93g40q-abF9kS7x-gzKY5swo8yxilzx0D4.jpg?auto=webp&amp;s=4d687a5d01d9acee2e9e604a63455ca79a730c39"
        },
        "permalink": "/r/movies/comments/1iy98cm/roberto_orci_dies_star_trek_transformers_hawaii/"
    },
    {
        "id": "1iz00y2",
        "author": "king_of_the_rotten",
        "title": "Shea Whigham Appreciation Post",
        "content": "I just finished American Primeval on Netflix (I thought it was excellent!) and it featured Shea Whigham perfectly cast as Jim Bridger. As usual, he knocked it out of the park, and it made me reflect on how he is easily one of the best character actors of my generation (I'm Gen X and I'm 5 years younger than him). \n\nBoardwalk Empire, American Hustle, Perry Mason, Wristcutters: A Love Story, True Detective...he can do no wrong in my book. Looking forward to seeing him in the final Mission Impossible film. \n\nWhat are some of your fave roles of his? ",
        "upvotes": 34,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1iz00y2/shea_whigham_appreciation_post/"
    },
    {
        "id": "1ixydm8",
        "author": "MarvelsGrantMan136",
        "title": "Official 20th Anniversary Poster for 'Star Wars: Episode III - Revenge of the Sith', Returning to Theaters April 25",
        "content": "",
        "upvotes": 10670,
        "comments": 907,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/keaxfxiu5ble1.jpeg?auto=webp&amp;s=784f791203d4a4efe78c307c4bd852b92fcd4b63"
        },
        "permalink": "/r/movies/comments/1ixydm8/official_20th_anniversary_poster_for_star_wars/"
    },
    {
        "id": "1iy4yti",
        "author": "ohhgreatheavens",
        "title": "Pixar absolutely cooked with The Incredibles (2004)",
        "content": "More than 20 years and dozens and dozens of feature-length superhero movies later, I still think that **The Incredibles** sits at the top of the list by a fairly wide margin. \n\nThis movie has so much to say about personal and familial growth. Every member the family is well-written in their struggle with finding their place in the family and in the greater world. On top of that each one of their superpowers perfectly reflects their character’s *personal* strengths and weaknesses without being hamfisted about it! You get to see how both suppression and expression of their powers affects each family member differently. \n\n\nIt’s really a masterclass in movie writing and I only scratched the surface: the retro-futuristic setting, the surprisingly emotional and intense story beats, the villain… all of it is so thoughtful and well-executed.\n\nThen there’s the music, the voice acting, and the creative *action*! \n\nBrad Bird’s fingerprints are all over the action set pieces. From the kids discovering the broader range of their superpower abilities while under extreme pressure, to Bob’s strength paired with his brute force tactics, to Helen’s ingenuity and quick-thinking skills in both the plane and hallway sequences, all of it is so clever and entertaining. \n\nThe absolute worst thing I can say about this movie is that the animation looks 20 years old, because it is. But otherwise this movie has been both a blessing and a curse all these years for me because I hold every other superhero movie to this standard. Unfortunately 95% of them have not been even close to this level of excellence. \n\n\n\n",
        "upvotes": 3483,
        "comments": 404,
        "media": null,
        "permalink": "/r/movies/comments/1iy4yti/pixar_absolutely_cooked_with_the_incredibles_2004/"
    },
    {
        "id": "1iz0w2b",
        "author": "No_Addendum5504",
        "title": "Asterix &amp; Obelix : Mission Cléopâtre is one of the best sequels ever done for a comedic movie",
        "content": "As a child, I adored this movie, and upon rewatching it last Sunday, I found it even more hilarious than I remembered.\n\nThis time, the famous Gauls embark on a new adventure in Egypt, tasked with helping an architect construct a grand palace for Cleopatra who was in a dick mesuring contest with Cesar—in just three months. Naturally, their mission is far from simple, as adversaries lurk in the shadows, ready to thwart their efforts.\n\nWhat makes this film truly exceptional is its relentless humor, with an impressive density of jokes per minute. The clever wordplay in the characters' names—Numérobis, Amonbofis, Itineris, Feudartifis, Antivirus—adds a layer of wit, while the visual comedy is equally remarkable. The inventive animated sequence set in total darkness, the martial arts-inspired fight between Jamel Debbouze and Gérard Darmon, and the slow-motion chase of a Roman soldier by Idéfix are just a few examples of the film’s brilliant comedic timing.\n\nEven though some of its stars are no longer as widely appreciated today—and for valid reasons—the film was also carried by an impressive cast of A-listers, including Christian Clavier, Alain Chabat, Gérard Depardieu, Monica Bellucci. Their performances contributed significantly to the film’s charm and enduring appeal.\n\nA true delight, this movie remains a timeless masterpiece of humor.\n\n\n",
        "upvotes": 22,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1iz0w2b/asterix_obelix_mission_cléopâtre_is_one_of_the/"
    },
    {
        "id": "1iz3hwy",
        "author": "Mikeyboy101591",
        "title": "The Great Race (1965)",
        "content": "Just got done watching this film and it’s a classic, it’s one of the funniest films ever made. A spectacular land race from New York to Paris in the early 20th century is planned, the two main competitors being the handsome, dashing hero in white, The Great Leslie (Tony Curtis), and the dastardly, black-suited Professor Fate (Jack Lemmon). While Fate's sidekick, Max (Peter Falk), attempts to sabotage Leslie and the other racers, Leslie finds an unlikely ally in Maggie DuBois (Natalie Wood), a suffragette and journalist-turned-racer whose car breaks down halfway through the event. Tony Curtis and Natalie Wood are awesome together. Jack Lemmon and Peter Falk come off likable even though they are the villains of the film and their chemistry is great. It also has one of the best pie fights in cinema. I also loved how the film played out like a live action cartoon.",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1iz3hwy/the_great_race_1965/"
    },
    {
        "id": "1iyymd2",
        "author": "jungleboy1234",
        "title": "Technicolor: Historic visual effects studio collapses in UK",
        "content": "",
        "upvotes": 25,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IsGhpSao6JnHE5jXKPxPHNaXSkpQAUZm8IoBnPVbS04.jpg?auto=webp&amp;s=007f86c05ba780b55bb437ae49421966cd872aa7"
        },
        "permalink": "/r/movies/comments/1iyymd2/technicolor_historic_visual_effects_studio/"
    },
    {
        "id": "1iz0noa",
        "author": "BunyipPouch",
        "title": "Join us tomorrow Thursday 2/27 at 3 PM ET here on /r/movies for a live AMA/Q&amp;A with Osgood Perkins, director of 'The Monkey', 'Longlegs', 'The Blackcoat's Daughter', and 'Gretel &amp; Hansel'.",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ku77isx3bkle1.png?auto=webp&amp;s=f34153a399cc76c7f9419f2c0344a9d77635aac8"
        },
        "permalink": "/r/movies/comments/1iz0noa/join_us_tomorrow_thursday_227_at_3_pm_et_here_on/"
    },
    {
        "id": "1iywf39",
        "author": "Upstairs_Drive_5602",
        "title": "Rubber (2010)",
        "content": "https://preview.redd.it/fru4qlb0fjle1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=97dea2112ac2ec13b55b4d51366e0e521c58906f\n\nI was totally baffled by this movie that after I finished watching it. It seemed both weird, crap and not entirely disinteresting in a weird crap way. By the end, I really didn't know whether I liked it or not.\n\nFor those that don't know it, it's about film about a tyre that rolls around the Californian desert blowing (and crushing) things up (an insect, a can, a bottle, a rabbit, a crow and people). Has anyone else seen it that has enjoyed it?\n\nTo be honest, I found the entire tyre-thing tiring.",
        "upvotes": 24,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1iywf39/rubber_2010/"
    },
    {
        "id": "1iyy8iv",
        "author": "soalone34",
        "title": "‘Hell of a Summer’ Poster",
        "content": "",
        "upvotes": 19,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rzo9ia1vsjle1.jpeg?auto=webp&amp;s=ef11de485daa6f55c44e50eba9140e0b9f1badac"
        },
        "permalink": "/r/movies/comments/1iyy8iv/hell_of_a_summer_poster/"
    },
    {
        "id": "1iypg8u",
        "author": "NoCulture3505",
        "title": "Another Simple Favor - Official Teaser Trailer | Prime Video",
        "content": "",
        "upvotes": 59,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hr6GKM0Dh_uJ9c4NFvJTZWHswyNEXQ7abhINRlWEBUc.jpg?auto=webp&amp;s=dd6cab756c9b253de54752007462f201e958a501"
        },
        "permalink": "/r/movies/comments/1iypg8u/another_simple_favor_official_teaser_trailer/"
    },
    {
        "id": "1ixyf6k",
        "author": "DemiFiendRSA",
        "title": "Ayo Edebiri Tapped To Write Live-Action Barney Movie For Mattel, A24",
        "content": "",
        "upvotes": 3175,
        "comments": 554,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIhjRxIFqJBY6jsICuLi4pXM38T-5V6u4-sAopR1f8A.jpg?auto=webp&amp;s=8b1e53c8f74c158f71319bc03cf3869c9a5a18e5"
        },
        "permalink": "/r/movies/comments/1ixyf6k/ayo_edebiri_tapped_to_write_liveaction_barney/"
    },
    {
        "id": "1iyefpy",
        "author": "Odd_Advance_6438",
        "title": "Willem Dafoe was fucking hilarious in Beetlejuice Beetlejuice",
        "content": "So I just watched the movie for the first time. I’m not even a huge fan of the original, but I still felt the sequel was kind of underwhelming. There wasn’t a lot of interesting stuff overall even if there were a lot of great parts. I know Beetlejuice didn’t have much screen time in the original, but it still feels like this movie is missing his presence.\n\nBut Willem Dafoe was absolutely hysterical in it. I loved every scene he was in, the way he talked so proudly of himself and his career as an action Star, the fact that his assistant used cue cards and brought him coffee just for him to crush it every single time into a big trash can",
        "upvotes": 355,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1iyefpy/willem_dafoe_was_fucking_hilarious_in_beetlejuice/"
    },
    {
        "id": "1iybidl",
        "author": "Embarrassed-Belt-693",
        "title": "Movie/tv trope you can’t stand…",
        "content": "What’s something that happens on screen that makes you question if directors know anything about real life…. I’ll go first..\n\nWhen someone is trying to secretly smoke a cigarette in a bathroom or out a bedroom window and when they are about to get caught they toss is out the window and waft around the air with their hand and then 2 seconds later someone walks in and are none the wiser. If you have ever smoked a cigarette you know that once that fucker is lit there’s no hiding. That entire room and your clothes are gonna smell after one drag. Anyways that’s one always get an eye roll out of me lol \n\nEdit thought of another one….. when someone is being chased and they hide somewhere and after whoever is looking for them looked in that area they immediately come out of hiding like have you never heard of people turning around?? Like the bad guys just walked away and yall pop up out of hiding and start talking?? They gotta be like 10 feet away tops. ",
        "upvotes": 438,
        "comments": 1043,
        "media": null,
        "permalink": "/r/movies/comments/1iybidl/movietv_trope_you_cant_stand/"
    },
    {
        "id": "1iz2sfe",
        "author": "These_Feed_2616",
        "title": "I Love You To Death (1990)",
        "content": "This film is one of the most underrated comedies, I think it’s absolutely hilarious, Kevin Kline plays such a convincing Italian and is so funny in the film, and William Hurt and Keanu Reeves are the stand out in the whole film, every scene with them is just hilarious, plus River Phoenix is also great in it, I love dark comedies and this one is awesome!",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1iz2sfe/i_love_you_to_death_1990/"
    },
    {
        "id": "1iyynmc",
        "author": "nope_not_here_",
        "title": "Movies with a supercalm vibe like A Ghost Story, Ammonites etc",
        "content": "I am really enjoying calm paced, \"no rush vibes\" movies lately. Im quite the horror fanatic but there's something about calm movies about well...people, a piece of their life/lives, a quiet surrounding. I also like The Outrun for example. A Ghost Story is ofc the most perfect example. Calm, moving, pulls you in. Well atleast me. Ammonite, loved the surroundings and overall a fan of Kate and Saoirse, and so I also loved The Outrun. I would love some recs for more movies like this. I've seen quite a few of the \"real life movies\" already, The Straight Story, Wild, you know the drill. The first ones I mentioned have a bit of a gloomy feel about them. Calm, gloomy, real people. Yes, a sheet with holes is a person in my universe. So, any I need to see?",
        "upvotes": 10,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1iyynmc/movies_with_a_supercalm_vibe_like_a_ghost_story/"
    },
    {
        "id": "1iya92j",
        "author": "Physical_Soil746",
        "title": "The Godfather Part lll feels so bizarre compared to the first two",
        "content": "Putting aside the absence of Robert Duvall and Sophia Coppola's acting abilities the whole movie is so brazenly over the top that it almost feels like your watching a Godfather parody movie.\n\nJust to name a few scenes \n\nVincent biting the ear of a mafia boss which is then quickly forgotten about\n\nMichael expanding his family from the power sphere of a few corrupt politicians to now the entire Vatican \n\nThe shootout scene with a helicopter hovering over the mafia bosses and the one guy screaming MY LUCKY COAT \n\nZasa getting killed by Vincent dressed up as a police officer while riding a horse through the street \n\nMichael than makes some guy who he just met a few weeks ago with poor judgment skills the next Don in exchange for not having incest sex with his daughter \n\nThe absolute ridiculous Pacino yell let out in the end when his daughter is killed. \n\nAs a standalone movie it wouldn't be so bad but coming off the first two it absolutely feels out of place.",
        "upvotes": 352,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1iya92j/the_godfather_part_lll_feels_so_bizarre_compared/"
    },
    {
        "id": "1ixzuff",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Surfer' Starring Nicolas Cage - A man returns to the idyllic beach of his childhood to surf with his son, but is humiliated by a group of powerful locals and drawn into a conflict that rises with the punishing heat of the summer and pushes him right to his breaking point.",
        "content": "",
        "upvotes": 1305,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/enj0mb6jgble1.jpeg?auto=webp&amp;s=40e8f8201da68e724965f9558cc2a40830c65934"
        },
        "permalink": "/r/movies/comments/1ixzuff/official_poster_for_the_surfer_starring_nicolas/"
    },
    {
        "id": "1iy582f",
        "author": "Task_Force-191",
        "title": "Christopher Nolan's ‘Oppenheimer’ will be re-released in select IMAX &amp; 70mm theaters this weekend",
        "content": "",
        "upvotes": 621,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SLM9lSXKpq-KpKoPCPenKY9Kijyy9yQPXJse5Loa4c4.jpg?auto=webp&amp;s=ec29f540829344572ff4de62c0c22947b5d9c8e3"
        },
        "permalink": "/r/movies/comments/1iy582f/christopher_nolans_oppenheimer_will_be_rereleased/"
    }
]