[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 477,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hj184y",
        "author": "Sensitive_Rock6788",
        "title": "Anyone watching La Palma? ",
        "content": "Just started this series on Netflix; so far, so very good. An emotionally charged series, which I normally avoid , but the pace is so steady I can’t turn it off. On episode 4 and I’ve lost my patience with the daughter. Frederick really stepped up! Amazing what a crisis will prompt you to do. You can tell he loves his family regardless of their difficulties. \n\nEdit: Alright alright. They got me. Hahahahaaaaaaaa",
        "upvotes": 22,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hj184y/anyone_watching_la_palma/"
    },
    {
        "id": "1hj5qh3",
        "author": "scorpiovenusgiu",
        "title": " Opinions on The Madness???",
        "content": "Im about to finish up the season im on episode 6 but man have i binged this all day!!! This show has kept me hooked and pissed off. I was just wondering how yall felt about it and what should be the next watch ?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hj5qh3/opinions_on_the_madness/"
    },
    {
        "id": "1himfkk",
        "author": "misana123",
        "title": "Netflix snaps up US broadcast rights for Women’s World Cup in ‘landmark deal’",
        "content": "",
        "upvotes": 61,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1himfkk/netflix_snaps_up_us_broadcast_rights_for_womens/"
    },
    {
        "id": "1hj525g",
        "author": "Accomplished-Pea3152",
        "title": "log in to netflix on chromebook",
        "content": "Can someone inform me on how i can log in to Chromebook for netflix instead of signing in? I'm trying to log in (which I did on my phone and worked completely fine) but on my Chromebook It only gives me the option to sign in and start a new account when I already have one. so can someone pls tell me how to LOG IN and not SIGN IN? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hj525g/log_in_to_netflix_on_chromebook/"
    },
    {
        "id": "1hj4uoz",
        "author": "AdventurousMatch73",
        "title": "Looking for thoughts on the movie Fractured?",
        "content": "I've heard it's a solid thriller with great acting, but some say it's predictable. Others mention it keeps you guessing until the end. If you've watched it, what did you think? Worth the watch or not? Thanks in advance, fellow Netflix Redditors!\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hj4uoz/looking_for_thoughts_on_the_movie_fractured/"
    },
    {
        "id": "1hibqk2",
        "author": "Pep_Baldiola",
        "title": "Netflix is leaning hard into the 'Squid Game' universe. Its creator said he's 'sick' of working on it.",
        "content": "",
        "upvotes": 257,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1hibqk2/netflix_is_leaning_hard_into_the_squid_game/"
    },
    {
        "id": "1higu49",
        "author": "Whobitmyname",
        "title": "‘Dan Da Dan’ Season 2 Coming to Netflix in July 2025",
        "content": "",
        "upvotes": 65,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1higu49/dan_da_dan_season_2_coming_to_netflix_in_july_2025/"
    },
    {
        "id": "1hiq8js",
        "author": "Dormouse710",
        "title": "Ferry 2",
        "content": "Please tell me this isn't how the saga ends T\\_T\n\nDid they officially kill Ferry at the end? \n\nIdk why it feels so unsettling seeing the ending play out like this.",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hiq8js/ferry_2/"
    },
    {
        "id": "1hinkvh",
        "author": "1cockeyedoptimist",
        "title": "Younger coming to Netflix",
        "content": "January 7 if you're looking for a light, quirky comedy created by Darren Star. Great cast includes Hillary Duff, Sutton Foster, Debi Mazar, Peter Hermann).\n\nAfter being mistaken for younger than she really is, a single mother decides to take the chance to reboot her career and her love life as a 26-year old.",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hinkvh/younger_coming_to_netflix/"
    },
    {
        "id": "1hj02cx",
        "author": "Backgammon_Saint",
        "title": "Will the NFL Christmas Day matches be shown worldwide on Netflix?",
        "content": "Will the NFL Christmas Day matches be shown worldwide on Netflix\n\nOr do the NFL matches get shown on other networks in other countries?\n\nI will not be in the United States of America on the dates of the matches so would be interested to know. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hj02cx/will_the_nfl_christmas_day_matches_be_shown/"
    },
    {
        "id": "1hit77j",
        "author": "Designer-Captain3104",
        "title": "Video quality varies greatly",
        "content": "I have the problem that the video quality when watching Netflix on my iPad varies a lot. It gets worse and doesn't get better again unless I restart the app. It can't be because of my internet and I've restarted the iPad many times. The latest software is also installed. Does anyone else have the problem and does anyone have solutions?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hit77j/video_quality_varies_greatly/"
    },
    {
        "id": "1hizfot",
        "author": "Historical-Score-863",
        "title": "Hot Frosty drinking game",
        "content": "So, the movie has been selected. We will be embarking on Hot Frosty tonight. I need your guys’ help with a drinking game. I’m hoping you all will pull through! Cheers 🍻 \n\nEdit: I’m just also going to add things to the comments as stuff comes to mind. We’re building a resource for the community here, friends 💕",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hizfot/hot_frosty_drinking_game/"
    },
    {
        "id": "1hiuj3j",
        "author": "danglewanglemangle",
        "title": "Video not showing up on Netflix App ",
        "content": "Is anyone else having problems with the netflix app not showing video but the sound is there? Ive tried deleting the app and redownloading it. Its working on TV but not on my iphone app. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hiuj3j/video_not_showing_up_on_netflix_app/"
    },
    {
        "id": "1hiy72h",
        "author": "ImaginaryConstant141",
        "title": "Any external catalog that displays title quality",
        "content": "So I used to visit this: https://www.movies-net.com\n\nIt used to contain all recently uploaded netflix titles from every country, but the main use case is it also displayed for each title if its 1080p, 4k, dolby vision, atmos or 5.1 etc. \n\nAs we all know netflix catalog is shit and also it's extremely hard to find out if a title belongs to what quality. It becomes even more difficult if its a series with different seasons in different qualities. \n\nAny other website for this use case?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hiy72h/any_external_catalog_that_displays_title_quality/"
    },
    {
        "id": "1hhwt5i",
        "author": "SoftPois0n",
        "title": "First poster for the final season of ‘YOU’ - Releasing in 2025 on Netflix.",
        "content": "",
        "upvotes": 345,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1hhwt5i/first_poster_for_the_final_season_of_you/"
    },
    {
        "id": "1hj0shn",
        "author": "MamaEsquilos",
        "title": "If i remove the device, can i download again 15 episodes?",
        "content": "I have the plan on ads and i didn't know that i had only 15 downloads per device. I accidentally download the wrong season and i deleted it all. Know i have only 3 episodes of the right season e can't download more\n\nIf i remove the device in the settings, can i re-download 15 episodes? Or i will just lose the 3 episodes that i already have?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hj0shn/if_i_remove_the_device_can_i_download_again_15/"
    },
    {
        "id": "1hikvqi",
        "author": "Wall_of_Wolf_Street",
        "title": "Christmas recommendations ",
        "content": "Im a 27yo and I’ve watched almost all of Netflix’s top content (minus Arcane because having a hard time keeping up) looking for the best christmas movies/series recommendations here. Doesnt have to be romcoms just need winter/murder/thriller vibes.",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hikvqi/christmas_recommendations/"
    },
    {
        "id": "1hikb3g",
        "author": "Robemilak",
        "title": "Google Launches ‘Squid Game’ Browser Game You Can Play on Google Search",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hikb3g/google_launches_squid_game_browser_game_you_can/"
    },
    {
        "id": "1hi641z",
        "author": "indiewire",
        "title": "What's Coming to Netflix in January 2025",
        "content": "",
        "upvotes": 51,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hi641z/whats_coming_to_netflix_in_january_2025/"
    },
    {
        "id": "1hi98g0",
        "author": "deeznuttingtons",
        "title": "King of Tupelo - Possibly the goat netflix doc. ",
        "content": "I normally don't gas up shows that I enjoyed watching like this but holy shit King of Tupelo had me crying laughing and dropping my jaws in awe at just how insane the story is. The production cooked; shooting and editing were elite. One reason that I found it so entertaining was that the first two episodes set up such a satisfying twist in the last episode.\n\nKC and Everett are hysterical foils of each other, not to mention they're both absolutely fucked as individuals. Everyone interviewed are such good storytellers, having a certain southern style humor/charm that doesn't get old quickly. The ending is so good too; there's a feeling of a hero's redemption with KC which ties the story very nicely. All in all, super impressed and grateful to see Netflix invest in this show. What a treat.",
        "upvotes": 23,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hi98g0/king_of_tupelo_possibly_the_goat_netflix_doc/"
    },
    {
        "id": "1hihwsb",
        "author": "thernker",
        "title": "Shows like Murder Mindfully",
        "content": "So just finished watching Murder Mindfully with subtitles and loved the concept and the show. I would request any recommendations for similar shows in any language. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hihwsb/shows_like_murder_mindfully/"
    },
    {
        "id": "1hix52r",
        "author": "bashrone93",
        "title": "Name of this show?",
        "content": "Can anyone help me out with the name of a show on Netflix where from what I recall in the trailer a woman did some crime or something with some man or younger man years ago and then it resurfaces and people are sort of coming for her saying they know what she did? Want to say it was a foreign film but not certain. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hix52r/name_of_this_show/"
    },
    {
        "id": "1hhsfhw",
        "author": "Robemilak",
        "title": "Netflix Is Reportedly Making an Adaptation of the S.T.A.L.K.E.R. Video Game Series",
        "content": "",
        "upvotes": 132,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1hhsfhw/netflix_is_reportedly_making_an_adaptation_of_the/"
    },
    {
        "id": "1hii1r2",
        "author": "Mysterious_County154",
        "title": "Netflix only showing originals on one profile while connected to home wifi, does this eventually go away?",
        "content": "Non original Show errored out mid watch yesterday and after reloading Netflix I could only see originals. I can see non originals on my profile if I switch to my mobile data but also on my home wifi if I use another profile (on the same account). The only thing I can think of it is that might have flagged something is I have a different country sim card as well in my phone and I used it to watch a show on Netflix a couple weeks ago, though I find it weird the limit would've only happened yesterday. Netflix support wasn't helpful at all",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hii1r2/netflix_only_showing_originals_on_one_profile/"
    },
    {
        "id": "1hj1d3f",
        "author": "OKTCYouGotThis",
        "title": "I wrote for Bojack Horseman without compensation, and I need to say something. And ask something. Loudly.",
        "content": "First off, Bojack is a great person. He's jaded and he's too smart for his own good, which is what gets him into trouble. When it comes down to it, he loves his friends. He just has trouble expressing himself to them becuase he has a lot of emotions and was abused by his mother and father while growing up, who taught him to suppress his emotions. He is completely relatable and it's baffling to me that some people's takeaway from the show is that he's a terrible person. These people missed the point of the show. Bojack is not your abusive ex. Bojack is YOU. And YOU are SECRETARIAT.\n\nTodd, on the other hand is smart but gets distracted easily because of his mental health condition. He has synesthesia, which sometimes becomes so overwhelming that he is often mistaken for being psychotic when he is actually just trying to express his own personal experience. From my perspective as someone who has gone through misdiagnosis, he is struggling with coming to terms with having been diagnosed with a mental health condition that he doesn't believe he has. In short, he is absolutely not as relatable as people seem to think he is.\n\nWhile studying at Bard College, Todd Chavez went through an identity crisis and changed his name to William. Then he changed his name to Timo. I know this becuase he's based on me. Timothy. I went to school at the same time as this show was being written. I am the same age as Todd. I dated a man with a last name that started with H and ended with Man.\n\nAnd I am absolutely not making ANY of this up.\n\n\nNetflix and/or Raphael Bob-Waksberg, you've got some mothereffing 'splaining to do.\n\n\nAnd anyone who wishes to argue about the validity of this or attempt to silence me, stop telling Todd to shut up. He's fucking sick of it, Bojack.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hj1d3f/i_wrote_for_bojack_horseman_without_compensation/"
    },
    {
        "id": "1hi2gre",
        "author": "iirison1",
        "title": "Shows to watch with my dad",
        "content": "I’m a 17 years old girl, who wants to bond with my dad, who’s currently on sick leave from work (that he loves dearly) and has been struggling a lot. I want to find a show with a bunch of seasons to watch with my dad to spend some time with him, but I can’t seem to find any.",
        "upvotes": 21,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1hi2gre/shows_to_watch_with_my_dad/"
    },
    {
        "id": "1hiiuy5",
        "author": "yutgoj",
        "title": "Netflix is not auto-playing the next episode on mobile data (iPhone)",
        "content": "Basically summed up on the main text, it auto-plays on my iPad w hotspot. Wifi works in autoplaying, i've tried turning on and off the autoplay settings, sign-out and sign-in, and force reset, none of them worked. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hiiuy5/netflix_is_not_autoplaying_the_next_episode_on/"
    },
    {
        "id": "1hi8uo7",
        "author": "tablefortress",
        "title": "Shows to Watch with a 6-Year-Old",
        "content": "My daughter (almost 6) and I have been watching Junior Bake Off together, and it's been so cozy. What other wholesome, NOT scary shows do you recommend that are interesting for both the kids AND adults watching?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hi8uo7/shows_to_watch_with_a_6yearold/"
    },
    {
        "id": "1hiu94g",
        "author": "gruebdopommes",
        "title": "10 second rewind / forward isn't actually 10 seconds",
        "content": "https://preview.redd.it/avga9m8gk28e1.png?width=408&amp;format=png&amp;auto=webp&amp;s=167f586e31563717d11440a2f5a7c66ee1025bc4\n\nI've noticed this before and it is super annoying. I luckily forgot it for some time but since there are these buttons now in the windows app ui that literally have the numbers \"10\" on them it is even more ridiculous. The rewind is something random between around 10 and 15 seconds. The forward does forward something between 6 and 10 seconds. Unbelievable. Not sure if this is the case on all operating systems, on windows you can easily test it this out with hitting rewind and forward alternately for 5 times each while not playing. What should be the result is that you end up at the same time stamp (I think??), however, you're gonna end up around 30 seconds behind of where you started. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hiu94g/10_second_rewind_forward_isnt_actually_10_seconds/"
    },
    {
        "id": "1hhymeb",
        "author": "StEvUgnIn",
        "title": "You Season 5 - Did you figure out the secret code?",
        "content": "",
        "upvotes": 22,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hhymeb/you_season_5_did_you_figure_out_the_secret_code/"
    }
]