[
    {
        "id": "1ndmlgk",
        "author": "MoviesMod",
        "title": "/r/movies Exclusive TIFF Interview - Cast &amp; Director of 'Roofman' - Channing Tatum, Kirsten Dunst, LaKeith Stanfield, and Director Derek Cianfrance ('Blue Valentine')",
        "content": "r/movies is officially covering TIFF this year for the first time. As part of this coverage, here's our exclusive in-person interview with the cast &amp; director of **Roofman**, a true-life crime comedy-drama that had its World Premiere at TIFF this past weekend.\n\nIt's out in theaters starting October 10th. It stars Channing Tatum, Kirsten Dunst, Ben Mendelsohn, Peter Dinklage, LaKeith Stanfield, Uzo Aduba, Juno Temple, Emory Cohen, Lily Collias, Melonie Diaz, Tony Revolori, and Jimmy O. Yang.\n\n&gt;After escaping from prison, former soldier and professional thief Jeffrey Manchester finds a hideout inside a Toys \"R\" Us, surviving undetected for months while planning his next move. However, when Jeffrey falls for a divorced mom, his double life starts to unravel, setting off a compelling and suspenseful game of cat and mouse as his past closes in.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=IkNXhI4Lteo](https://www.youtube.com/watch?v=IkNXhI4Lteo)\n\nKeep an eye out throughout the week for more TIFF coverage.",
        "upvotes": 34,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pli1ikf1tdof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ndmlgk/rmovies_exclusive_tiff_interview_cast_director_of/"
    },
    {
        "id": "1ncs1fj",
        "author": "MoviesMod",
        "title": "/r/movies at TIFF! - First Half Coverage (Reviews, AMAs/Q&amp;As, etc)",
        "content": "r/movies is covering the Toronto International Film Festival this year to celebrate the 50th anniversary of the fest. Included in our coverage will be AMAs/Q&amp;As, junkets, mod reviews/summaries, and community reviews. This post will cover the first of the fest. For information about TIFF, please visit tiff.net.\n\n***TIFF AMAs/Q&amp;As:***\n\n* [Tuesday 9/2 - Curry Barker, Director of Obsession](https://www.reddit.com/r/movies/comments/1n6hto7/hey_rmovies_im_filmmaker_curry_barker_milk_serial/)\n* [Wednesday 9/3 - Sean Ellis, Director of The Cut](https://www.reddit.com/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/)\n* [Thursday 9/4 - Chandler Levack, Director of Mile End Kicks](https://www.reddit.com/r/TIFF/comments/1n97oy0/hi_rtiff_im_chandler_levack_writerdirector_of_i/)\n\n***Upcoming Coverage:***\n\n* Wednesday 9/10 - In-Person Junket Interview with Channing Tatum, Kirsten Dunst, LaKeith Stanfield, and Derek Cianfrance of Roofman\n* Wednesday 9/14 - Shasha Nakhai, Rich Williamson, Co-Directors of Bots &amp; Scarborough\n* Tuesday 9/30 - Nadia Latif, Director of The Man In My Basement\n\n***Mod Reviews/Summaries:***\n\n* *If I Had Legs I’d Kick You*\n\n\tAn anxious fever dream of motherhood stress. Watch Rose Byrne lose it in real time as the camera focuses almost solely on her face and incredible performance. Conan O’Brian and A$AP Rocky fill out this cast of oddballs, but they feel right at home in this surreal and experiential film.\n\n* *Nouvelle Vague*\n\n\tRichard Linklater gives credit to the birth of the French New Wave in this biopic about Jean Luc-Godard making the timeless classic Breathless. Not at all a brooding biopic, this feels more like a heist film as Godard and his ragtag crew, including a magnetic performance from Zoey Dutch as Jean Seberg, attempt to reinvent the rules of cinema in twenty days of shooting. You can see how this story inspires Linklater to do his thing and feel his love for this moment in cinema bursting off the screen.\n\n* *Eleanor the Great*\n\n\tScarlett Johansson’s directorial debut sees June Squibb as a woman mourning the death of her lifelong friend and roommate and looking to start fresh in Manhattan at the age of 94 after she moves in with her daughter. This is an emotions-on-the-sleeve movie and the plot will leave a bad taste in a lot of people’s mouths, but the end goal is to encourage us all to talk about grief more openly.\n\n* *Mile End Kicks*\n\n\tAn extremely Canadian autobiographical film the director, Chandler Levack, wrote about her time writing as a music critic in her early 20’s. Barbie Fereirra stars in a boy crazy summer, a book deadline, and the many mistakes you will make on the way to finding out what you really want, this movie has all those feelings and more in a movie that falls somewhere between Almost Famous and Superbad.\n\n* *Nirvana the Band the Show the Movie*\n\n\tIf you’re not familiar with this web series/show then don’t fear, it just means you have the amount of context I did going on. And rest assured, this is still a hilarious and surprisingly well-executed journey through time and friendship. This is a reality movie, much like Borat, but there are concepts and filmmaking techniques in play that will legitimately make you scratch your head and wonder how the hell they pulled this off. \n\n* *No Other Choice*\n\n\tPark Chan-Wook’s new masterpiece comes in the form of a Donald E. Westlake novel adaptation about a man forced to take extremely darkly comical steps to ensure his future in his dying industry. With classic Park wit and violence, this movie is never predictable and will put a cynical smirk on your face.\n\n* *Sentimental Value*\n\n\tOne of the hottest tickets of the week, Sentimental Value is the new film from Worst Person in the World director Joachim Trier. It’s a steady but fascinating film about an absent father/famous Norwegian director, played by Stellan Skarsgaard, attempting to reconnect with his actress daughter, Renate Renseive, by writing a film for her and casting her in the main role. When she refuses, he sparks a friendship with a young American actress played by Elle Fanning and casts her in the role instead. This movie has an endless mirror quality to it with plenty of meta to go around as you watch Stellan try and form someone else into the daughter he so badly wants to make amends with, and as you watch her get jealous of the olive branch she denied going to someone else. \n\n* *The Lost Bus*\n\n\tPaul Greengrass is back with the true story of Kevin McLeod, a California bus driver who drove towards the Camp Wildfire of 2018 in order to save a classroom of children. Matthew McConaughey and America Farerra star in this thrilling disaster film.\n\n* *Christy*\n\n\tSydney Sweeney takes on the role of famous women’s boxer Christy Martin who spent years married to her manager/trainer denying her queer identity and being mentally and physically abused. Sweeney impresses and Ben Foster is unrecognizable in this disturbing but freeing sports biopic.\n\n* *Bad Apples*\n\n\tSaorsie Ronan stars as a middle school teacher in a small community in Ireland who is at her wits end with a troubled boy in her class. As he continues to disrupt other students ability to learn and lashes out violently during school she accidentally does something extremely illegal to put a stop to it. This is a cynical film that was getting a lot of dark laughs from our crowd and is sold on some great performances from Saorsie and the kids at the center.\n\n* *Roofman*\n\n\tThe wild true story of Jeffrey Manchester, played by Channing Tatum, who robbed 40+ McDonald’s restaurants in the early 2000s by breaking in through the roof and holding up the opening workers. The movie takes place after his escape from prison when he spends several months hiding out in a Toys ‘R’ Us and falling for a local woman played by Kirsten Dunst. This has a great ensemble cast and Derek Cianfrance has no problem finding the human side of this bizarre true crime story.\n\n* *100 Sunset*\n\n\tIn a Tibetan apartment building where everyone knows everyone, a teenager with a penchant for stealing befriends the young trophy wife of a new and mysterious resident. Half found footage film, half Sofia Coppola teen longing, all indie filmmaking.\n\n* *Dead Man’s Wire*\n\n\tGus Van Sant tackles the true story of a kidnapping that took place in Indianapolis in 1977 in which a men rigged a shotgun around the neck of a corporate executive at his mortgage lending company and took him home in a days-long standoff with the police. Played incredibly with humor and gravity by Bill Skarsgaard, he speaks through a local radio DJ played by Colman Domingo and becomes a voice for all the people who have been taken advantage of by rich money-lenders. \n\n* *Sound of Falling*\n\n\tGerman arthouse at its most intriguing, Sound of Falling tells the story of four generations of daughters and mothers living on the same farm in Germany. Somewhere between Tarkovsky’s Mirror and Nickel Boys, this movie weaves in and out of timelines and between characters as if the camera is a ghost out of time who sees the rhyming nature of all these lives but is privy to little context.\n\n* *Hedda*\n\n\tA new film from Candyman director Nia DaCosta, Hedda is a reimagining of the classic stage play Hedda Gerbler about a woman scheming and manipulating her way into continued riches even if it keeps her trapped in a society marriage. Tessa Thompson plays this Hedda with heavy tones of queerness and sexual charge as well as a wily unpredictability and Nia feels right at home directing a project that is truly hers. \n\n***Community Reviews:***\n\n* I really enjoyed Eleanor the Great. I laughed and then cried. It was very moving and great performances, especially by June. The audience gave it a standing ovation tonight. - u/Wonderful__\n* Dead Man’s Wire - just brilliant, the tension was there throughout while still managing to have so much humour. bill skarsgard is amazing in this role (a little bummed that he couldn’t be there for the premiere), might be my favourite film from the festival so far!! - u/residentofhell\n* No Other Choice - 9.5/10. My top film of the festival so far. Its critique of capitalism isn’t groundbreaking, but the film is much more than that. What it has to say about individual moral choices people make in such a system is where it shines. Wonderful characters. Expert use of symbolism. As expected with Park, visually stunning. - u/BenefitIndependent88\n* The Last Viking: No expectations going in and it’s a MUST SEEEEE. I laughed. I cried. Fantastic and lovable characters. This deserves the people’s choice awarddd. 4.5/5 - u/Maester_Hodor\n* Blue Moon - Small and intimate character study. The script is a standout with its remarkably smooth flow and witty, but not excessive, jokes. I did not however enjoy the color grading looking like a whiskey commercial and the cold open scene, which I found jarring compared to the rest of the film. - /u/[cleric\\_of\\_deneir](https://www.reddit.com/user/cleric_of_deneir)\n* Hey, ah, where can I find the Sirāt support group? Because Jesus Christ. - /u/[johnlukegoddard](https://www.reddit.com/user/johnlukegoddard)\n* Roofman - 4/5, just a fun ride all around. Blends a mix of action, comedy, and drama. Channing Tatum is charismatic, as always, but this is the most serious role I’ve seen him in! Also appreciated that the director came to introduce this for the regular screening. - /u/CinemaBud\n* Only five star film I have seen so far is THE VOICE OF HIND RAJAB and it’s not because of my political leaning, it is a smartly made recreation that locks you in and emotionally devastates you. After that I probably enjoyed DEAD MAN’s WIRE the most, Van Sant doing his riff on Fargo. 4/5. - /u/[MikeRotzzz](https://www.reddit.com/user/MikeRotzzz)\n* Eternity - probably around an 8/10. I really liked this one a lot. It's been my favourite so far. It was really funny, I love the kind of humour the dialogue had and it was a fun environment to be in. Gets you thinking about death and what you would do if there was an afterlife. My friend and I were discussing after what kind of eternity we would choose. Da'Vine Joy Randolph and John Early were fantastic together. They were so hilarious. We had Miles Teller, Elizabeth Olsen, Callum Turner (man, he is so handsome), John Early, and director David Freyne for the intro and then John, Elizabeth, and the director for a Q&amp;A, which was a nice surprise. I guess Miles and Callum couldn't stay. I'm pretty sure this is going to be near the top of my festival rankings when I'm done and will probably be on favourites of the year list. - /u/[mistakes\\_were\\_made24](https://www.reddit.com/user/mistakes_were_made24)\n* Hamnet: 5/5 (actually 10/5): I knew the reviews were good going into this but I was not expecting this good a film. Poignant and heartbreaking in equal amounts, this has to be a front runner for the Oscar’s at this point. Especially for Best Actress, cause holy shit, Jessie Buckley’s performance. - /u/[BreadfruitWorth](https://www.reddit.com/user/BreadfruitWorth)\n* Sacrifice - 2/10. Has a couple funny moments and themes perhaps provide something to chew on. But satire is hard these days and this didn’t get over that hurdle for me. Characters aren’t grounded in reality and the filmmaking seems like it was done by someone who mostly makes music videos. Maybe this just wasn’t for me, but it really really wasn’t for me. - /u/[BenefitIndependent88](https://www.reddit.com/user/BenefitIndependent88)\n* The Furious: - 9/10 - OMG an action film has never left me breathless. To be clear, there is very little story. A mute father goes to save his daughter after she’s abducted on the streets of “somewhere in SE asia”. But honestly who cares. Wall to wall dances of insane fight scenes that are hard to believe anyone could pull off. A+ midnight madness programming. - /u/[Lolakery](https://www.reddit.com/user/Lolakery)\n* Frankenstein- 4/5 stars. Solid film; you'll be guaranteed to be entertained at the cinema, though it's not the type of film that sticks with your soul after you leave. There's quite a few changes from the novel but I thought it captures the spirit of the story well, and I think they were necessary to keep the film under 5 hours lol- it already feels quite bloated as it is (the first half especially drags a bit). As expected, the vibes are immaculate- set, costumes, shots are all beautiful and it really manages to capture the gothic vibes of the story. Oscar Issac &amp; and Jacob elordi were terrific, but I found Mia Goth distracting during her scenes because she kept doing this head nodding thing whenever she had a line. All in all it's a good movie. - /u/[evil-poatotes](https://www.reddit.com/user/evil-poatotes)\n\n",
        "upvotes": 47,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c5vf6aypp6of1.jpeg?auto=webp&amp;s=27a8069518b815a3c7acfa484f5c833fb9ca3629"
        },
        "permalink": "/r/movies/comments/1ncs1fj/rmovies_at_tiff_first_half_coverage_reviews/"
    },
    {
        "id": "1nea7ns",
        "author": "MoneyLibrarian9032",
        "title": "Liam Neeson to Produce Element Pictures’ ‘The Lost Children of Tuam,’ About Irish Child Grave Scandal",
        "content": "",
        "upvotes": 1349,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hO3nJYt5BXa0aWmBH9JOvsoQE83y1miPsyaMsEAkSGE.jpeg?auto=webp&amp;s=c173ab2bf5a625a2fa0800898e52fdaa9b5ca363"
        },
        "permalink": "/r/movies/comments/1nea7ns/liam_neeson_to_produce_element_pictures_the_lost/"
    },
    {
        "id": "1ne7rc0",
        "author": "indiewire",
        "title": "'One Battle After Another' Is an Immediate Early Oscar Frontrunner",
        "content": "",
        "upvotes": 509,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f74q_lagOh5o9e-xHOvJ-QyxXgtcgepIVxL74bCxchw.jpeg?auto=webp&amp;s=1c79e4e85e21e7547a0434a0eb3d1ff28dfb949a"
        },
        "permalink": "/r/movies/comments/1ne7rc0/one_battle_after_another_is_an_immediate_early/"
    },
    {
        "id": "1nds3sr",
        "author": "MarvelsGrantMan136",
        "title": "Daniel Day-Lewis Speaks Out on Ending Acting Retirement After 8 Years",
        "content": "",
        "upvotes": 4133,
        "comments": 256,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5dwT27uCAAmg8Nkh67Fqdn8tdcBNioSzjV1Z5xEpSCk.png?auto=webp&amp;s=6c115673955669169083a12c202e7b448dcc92e8"
        },
        "permalink": "/r/movies/comments/1nds3sr/daniel_daylewis_speaks_out_on_ending_acting/"
    },
    {
        "id": "1ndk7a7",
        "author": "Task_Force-191",
        "title": "Official Poster for the 4K Restoration of 'Perfect Blue Remastered'",
        "content": "",
        "upvotes": 12488,
        "comments": 335,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kjrhs017edof1.jpeg?auto=webp&amp;s=8515052d065cb071e723b1c549049c7fb550219d"
        },
        "permalink": "/r/movies/comments/1ndk7a7/official_poster_for_the_4k_restoration_of_perfect/"
    },
    {
        "id": "1ne6y79",
        "author": "n0b0dycar3s07",
        "title": "PERFECT BLUE Remastered | Official 4K Trailer - In Theatres October 3",
        "content": "",
        "upvotes": 287,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yI1tzcDJogIwCB0ingkKwWfYvr1-Ez-UIO8tGmPvnXI.jpeg?auto=webp&amp;s=22ceee7bf6adc1f306c13eea6d1ff76d08d568e7"
        },
        "permalink": "/r/movies/comments/1ne6y79/perfect_blue_remastered_official_4k_trailer_in/"
    },
    {
        "id": "1ndnh28",
        "author": "EuphoricButterflyy",
        "title": "‘Heavy Metal’ (1981)… the B-17 scene",
        "content": "",
        "upvotes": 4294,
        "comments": 277,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/friipu8szdof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ndnh28/heavy_metal_1981_the_b17_scene/"
    },
    {
        "id": "1ndyxeq",
        "author": "paxinfernum",
        "title": "THE LIBRARIANS | Official Trailer",
        "content": "",
        "upvotes": 693,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SQyuillTDYUSZKl0BYikYUn431hOrBNVTtOzbED8Kls.jpeg?auto=webp&amp;s=6c0c40f4861fde23d20e2966886f5ba3ffef3847"
        },
        "permalink": "/r/movies/comments/1ndyxeq/the_librarians_official_trailer/"
    },
    {
        "id": "1neb5ii",
        "author": "Lucifer926",
        "title": "What are some of the best scenes (or actors) that portray grief/anguish?",
        "content": "Not necessarily looking for a whole movie regarding the subject, but key scenes within the film that made you feel it.\n\n\nFor example, Chris Pratt in GOTG Vol 2 &amp; 3. When he's losing &gt;!Yondu and Rocket, respectively!&lt;, his anguish feels so raw and real.\n\nAlso, Mel Gibson in The Patriot when &gt;!he loses both of his sons and he butchers that man out of grief and rage for Samuel and the shock of losing a second son in Gabriel!&lt;\n\nWhat are your examples?\n",
        "upvotes": 79,
        "comments": 324,
        "media": null,
        "permalink": "/r/movies/comments/1neb5ii/what_are_some_of_the_best_scenes_or_actors_that/"
    },
    {
        "id": "1ndx1qt",
        "author": "NoMoreFund",
        "title": "Movies that have aged heavily, but not badly",
        "content": "Looking for movies where the movie definitely looks or feels outdated, but that enhances what the movie is going for, or otherwise just works. For example, movies that weren't intended as period pieces but have accidentally ended up that way and offer very interesting insights into the time period when it was made. Or movies where it's harder to take the movie seriously, but that works well for the movie. \n\nFor example, I made this topic thinking about Eurotrip. The stereotypes about Europe and plot contrivances were silly when the movie came out. Now they're even sillier - basically none of the movie's plot could happen even in 2008 (with Facebook and IPhones) let alone 2025 - but it's charming now. A lot of the crude humour in the movie feels even more like a tongue in cheek parody than they did at the time. Overall IMO it's aged heavily, but aged well.",
        "upvotes": 426,
        "comments": 443,
        "media": null,
        "permalink": "/r/movies/comments/1ndx1qt/movies_that_have_aged_heavily_but_not_badly/"
    },
    {
        "id": "1necrpc",
        "author": "Gato1980",
        "title": "Jimpa | Official Trailer | Olivia Colman, John Lithgow",
        "content": "",
        "upvotes": 24,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9Uwy-BQtESLH3SmimWog0D8CI1q5zUSuSB2qkNYcBpA.jpeg?auto=webp&amp;s=517581dd2b7c462742ac36f21e833560f0d38a70"
        },
        "permalink": "/r/movies/comments/1necrpc/jimpa_official_trailer_olivia_colman_john_lithgow/"
    },
    {
        "id": "1ndkbxq",
        "author": "dear97s",
        "title": "Just broke up, need ONE movie to destroy me and ONE to make me laugh my ass off",
        "content": "I just went through a breakup and… wow. It’s bad. I’m looking for something very specific. One super dramatic, soul-crushing movie that will hit me right in the chest, make me ugly cry, and leave me a hollow shell of my old self. Something that feels like it understands heartbreak on a personal level and one hilariously stupid, laugh-until-you-cry comedy to lift me back up immediately afterward. I want something so dumb, over-the-top, and ridiculous that I literally forget my sadness for a few hours.\n\nBasically, I need the ultimate emotional rollercoaster: first heartbreak, then pure silly comedic chaos.\n\nAny suggestions for both extremes?\n\nThanks in advance 🙏",
        "upvotes": 1317,
        "comments": 1898,
        "media": null,
        "permalink": "/r/movies/comments/1ndkbxq/just_broke_up_need_one_movie_to_destroy_me_and/"
    },
    {
        "id": "1ndnr7m",
        "author": "MarvelsGrantMan136",
        "title": "‘Gremlins’ &amp; 'Alice' Actress Polly Holliday Has Passed Away at 88",
        "content": "",
        "upvotes": 663,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sL7FFHpPnuglXDyO_3N-kdUsLMnJLa5SRD61lNG8PmQ.jpeg?auto=webp&amp;s=129fbc32cfe6f3c68f57e39f7734268e17991f3b"
        },
        "permalink": "/r/movies/comments/1ndnr7m/gremlins_alice_actress_polly_holliday_has_passed/"
    },
    {
        "id": "1nebzbu",
        "author": "CorpseeaterVZ",
        "title": "Looking for heartfelt and warm movies",
        "content": "There are so many bad things happening in the world, I need an evening (or a weekend) of heartwarming movies which light up the day. Please no tearjerkers :)\n\nHere are some of mine:\n- Little Miss Sunshine\n- Mask\n- Notting Hill\n- Stardust\n- Groundhog Day\n- Are you there god? It's me, Margareth\n- The Blind Side\n- Kiki's delivery service\n- The Holdovers\n- Please stand by\n\nI could post more, but what aces do you have in your sleeves? :)\n\n",
        "upvotes": 16,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1nebzbu/looking_for_heartfelt_and_warm_movies/"
    },
    {
        "id": "1ndv76e",
        "author": "Kal-El_Yes",
        "title": "Me (17) and my gf (17) have started a film club at our school, what films should we show?",
        "content": "**Nothing over the rating of PG-13**\n\nMy gf has wanted to do this for a while, but we finally got the green light this year. We’re doing a film club at our high school, where we will be showing movies to people. We have a small list assembled right now, but we want to expand it with some more movies, but we can’t think of any more. I can provide the list if anyone would like.",
        "upvotes": 197,
        "comments": 881,
        "media": null,
        "permalink": "/r/movies/comments/1ndv76e/me_17_and_my_gf_17_have_started_a_film_club_at/"
    },
    {
        "id": "1ndc88p",
        "author": "MarvelsGrantMan136",
        "title": "The Rip | Official Teaser | Netflix",
        "content": "",
        "upvotes": 1870,
        "comments": 312,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3Sk8uY3TASZAvxeWXn4IqdS5fcyC13fQ4p9zhDW3lRo.jpeg?auto=webp&amp;s=86d646c699f0ac3960e91a25c5ce8d0f33109e72"
        },
        "permalink": "/r/movies/comments/1ndc88p/the_rip_official_teaser_netflix/"
    },
    {
        "id": "1nedsr2",
        "author": "lionsgate",
        "title": "THE LONG WALK - 9/12 Reddit Screenings",
        "content": "Join us on THE LONG WALK. As a gift for this subreddit’s support of the film, we’re offering a free screening tomorrow in Los Angeles and New York – even better we’d love for everybody who attends to post their reactions in this post. \n\nBoth screenings will start at the same time for this unique communal viewing experience.\n\n \n\n**SIGN UP HERE:** [https://bit.ly/tlwredditscreenings](https://bit.ly/TLWRedditScreenings)\n\n \n\nSo, who’s ready to fucking WIN? See you there.\n\n \n\nTHE LONG WALK in theaters TONIGHT.",
        "upvotes": 9,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rdeqbhyvckof1.png?auto=webp&amp;s=6740e5d1cc9b4cc61f50414d6c96a70cba0532c2"
        },
        "permalink": "/r/movies/comments/1nedsr2/the_long_walk_912_reddit_screenings/"
    },
    {
        "id": "1ndm4gb",
        "author": "Remarkable-Key-9335",
        "title": "Tron: Ares Official New Trailer \"Flynn Lives\"",
        "content": "",
        "upvotes": 446,
        "comments": 208,
        "media": null,
        "permalink": "/r/movies/comments/1ndm4gb/tron_ares_official_new_trailer_flynn_lives/"
    },
    {
        "id": "1nebk70",
        "author": "SonOfPlinkett",
        "title": "What actors have played oddly specific roles in different productions?",
        "content": "By that I mean roles that make you think “If I had a nickel for every time [Actor] played [X], I'd have two nickels. Which isn't a lot, but it's weird that it happened twice”\n\nSome examples I can think of:\n\n**Charlie Hunnam**\n\nPlays a convict that escapes prison then later writes a novel about their life. Even though the author claims the book to be a true story critics believe the author made up many of the events in the book.\n\nPapillon - 2017 \n\nShantaram - 2022 \n\n**Walton Goggins**\n\nPlays a zombie-like person that maintains their human cognition by taking a special formula… also missing a nose.\n\nMaze Runner: The Death Cure - 2018\n \nFallout  -  2024\n\n**Bob Hoskins**\n\nPlays Smee in a re-imaged version of Peter Pan… Okay maybe this one isn’t so odd since he really was the best Smee, but I was still surprised to learn that he got to play Smee more than once in his life in completely different productions. \n\nHook - 1991\n\nNeverland – 2011\n\nWhat other actors do you feel fit this criteria?",
        "upvotes": 8,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1nebk70/what_actors_have_played_oddly_specific_roles_in/"
    },
    {
        "id": "1ndcdbl",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘The Rip’ Starring Ben Affleck and Matt Damon - A group of Miami cops discovers a stash of millions in cash, leading to distrust as outsiders learn about the huge seizure, making them question who to rely on",
        "content": "",
        "upvotes": 1195,
        "comments": 292,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0k970blqvbof1.jpeg?auto=webp&amp;s=b2e50d234a57e7ed47f8766adcca09f154d29412"
        },
        "permalink": "/r/movies/comments/1ndcdbl/official_poster_for_the_rip_starring_ben_affleck/"
    },
    {
        "id": "1ndf5dw",
        "author": "KillerCroc1234567",
        "title": "Pixar’s ‘Elio’ Hits Disney+ Next Week (Sept 17)",
        "content": "",
        "upvotes": 674,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2g7uNFMMViIZ_uNGu5CbRTqbLu7EzmJsrx0PCUehgNk.jpeg?auto=webp&amp;s=3ea5d9eb479ae93c6658c62c651806de797da664"
        },
        "permalink": "/r/movies/comments/1ndf5dw/pixars_elio_hits_disney_next_week_sept_17/"
    },
    {
        "id": "1ndi9a9",
        "author": "SanderSo47",
        "title": "Charles Melton and Lucy Liu to Lead Laika’s First Live-Action Film ‘Audition’ With Lulu Wang ('The Farewell') on Board to Direct",
        "content": "",
        "upvotes": 345,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WAG1rE-ZMUmosKpJROrAHH-o8wC4DLfJt8ZQlT2XvRI.jpeg?auto=webp&amp;s=acc33a39c4c17b007237ab52c1a542200d18ab74"
        },
        "permalink": "/r/movies/comments/1ndi9a9/charles_melton_and_lucy_liu_to_lead_laikas_first/"
    },
    {
        "id": "1nd3bgu",
        "author": "Low_Fig4201",
        "title": "Watching Juno again in 2025",
        "content": "When Juno came out in 2007, I was 14 years old. I went to see this in the theaters with a friend and I remember thinking that I liked it, but I mostly took away Juno's quirky one-liners and tried to adapt them in real life, and failed miserably. I had watched it a few times after and always enjoyed it, but never really had any strong feelings towards it other than a \"no way do I want to ever be a pregnant teenager\" mindset. \n\nI just rewatched Juno for the first time in probably 12 years. Oh My God. Now, I'm 32 and have a child of my own (she's 2). There was so much more that jumped out to me this time around, so much that I missed as a teenager. I think it was really beautifully done, how a teenager's perspective and an adult's perspective were both so truthfully represented in this movie. Juno's character is one of the most original, strong, hilarious, and self-aware that I've ever seen in a film. As a teenager, I thought she was a little \"weird\", and as an adult, I'd be honored to have a teenager like that involved in my life in just about any way. \n\nAs a teenager, I thought that Juno's and Bleeker's relationship was different than most teenage relationships, but that they loved each other. As an adult, I can see that it is a young love that got dangerously close to being violently shoved into adulthood.\n\nI always thought Mark was cool watching the movie when I was younger, and the very first time I saw them start to slow dance, alarm bells would go off in my head and I'd be like \"um, what is going on\". I always thought that Mark liked Juno and wanted to leave Vanessa to be with her. As an adult, I think Mark was just more envious of Juno's youth and clean slate after the adoption. She just held a figurative mirror up to his face, and he could see that he was going down the wrong path for himself, and then proceeded to handle it like a jackass. \n\nIn 2007, I couldn't even imagine telling my parents I was pregnant and having them react like that Juno's dad and stepmom in the movie. And now, being a parent of a daughter no less, I have a goal for that to obviously not happen for her, but to really try and remember this scene from the movie and bring that energy into the room should she come to me and tell me she's pregnant when she's 16. Best reaction I think I could give. \n\nI also had a theory about Juno and her birth mother's relationship. She mentions her mom left when she was young, and got remarried, and started a new family across the country, and mails her a cactus every year on Valentine's Day. When Juno is telling us all of this, she mentions the word \"abondonment\", and I wonder if that played a roll in her being so willing to give up her baby for adoption. She was so strong-willed, and I don't know that I would have had the strength to do that, even being a teenager. Any other thoughts on that?\n\nLastly, I was confused as to why Vanessa appeared to have a reaction when Juno told her that she found their ad in the Penny Saver. Did anyone else think Vanessa appeared confused or like wtf? \n\n",
        "upvotes": 3324,
        "comments": 260,
        "media": null,
        "permalink": "/r/movies/comments/1nd3bgu/watching_juno_again_in_2025/"
    },
    {
        "id": "1necdbt",
        "author": "indiewire",
        "title": "Paul Mescal on Shedding His ‘Gladiator II’ Body for ‘History of Sound’ and the Film’s Lack of Explicit Sex Scenes",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9qps4AXzIbN802-qoVEYJFUb--88ZljgwSJLXYc5iXA.jpeg?auto=webp&amp;s=cd8972dabeafdeabe006ad8866322df7a4569167"
        },
        "permalink": "/r/movies/comments/1necdbt/paul_mescal_on_shedding_his_gladiator_ii_body_for/"
    },
    {
        "id": "1ndprs0",
        "author": "Lucky_Lou_9897",
        "title": "Eternal Sunshine of the Spotless Mind is strangely a comfort movie for me",
        "content": "There's something about this movie I find so comforting and I can't put my finger on it.\n\nI know everyone analyzes the meaning behind the story but for me, my fixation is more on the mood and the characters.\n\nThe way it portrays the main character as this shy, dopey guy who's kind of listless and depressed, wandering around with the new england aesthetic and the sunny cold winter morning. It's something I can wrap myself up in like a blanket.\n\nGrowing up I was always really shy and lost and this was the first movie I saw that almost romanticized this personality (I was very young when I watched it - I know it's not unique), but I think it was so comforting to me and made me almost feel like I can romanticize my own life without having to turn into some superhero. I can just be the shy artsy dopey guy.\n\nAgain, I know this is a common trope in films but I was very young when I first watched it and I think that's partially why I built this connection to it.\n\nThe score is also amazing. Everytime I listen to the main theme it instantly brings back the entire mood that I can wrap myself up inside.\n\nThe way I would describe this movie is it's like waking up in an old creeky wooden new england house full of blankets, on a cold Sunday winter morning where the sun is shining through windows, making a coffee and thinking about a girl that you are crushing on and your stomach has a slight pain from the chronic low level anxiety you always feel, and it's this mixture of anxiety, peace, depression, sleepiness, and whimsy.",
        "upvotes": 80,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1ndprs0/eternal_sunshine_of_the_spotless_mind_is/"
    },
    {
        "id": "1nedz2j",
        "author": "J_Greer20",
        "title": "What are some of the most impactful movie scenes?",
        "content": "Crazy Rich Asians (2018) is a movie I did not expect to enjoy as much as I did.\n\nI’m not a huge romance fan, but this movie is excellent. \n\nThe mahjong scene with Constance Wu and Michelle Yeoh is such an impactful scene, that it makes the movie worth watching. Wu’s character is a game theory professor and she utilizes her skills to demonstrate she’s letting Yeoh “win” in the end. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1nedz2j/what_are_some_of_the_most_impactful_movie_scenes/"
    },
    {
        "id": "1ndvari",
        "author": "tshirtguy2000",
        "title": "What basis/inspiration for a movie character still fascinates you?",
        "content": "Like how Christian Bale based his performance of Patrick Bateman in American Psycho on late 90s Tom Cruise. Especially his appearance on the Letterman Show in 99'. \n\nOr that Gary Oldman's character Drexl's accent in True Romance was based on a couple urban youth he just happened to hear talking on a street corner in Brooklyn. \n\n\n\n\n\n ",
        "upvotes": 35,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1ndvari/what_basisinspiration_for_a_movie_character_still/"
    },
    {
        "id": "1ncrqrl",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Good Boy'",
        "content": "",
        "upvotes": 10209,
        "comments": 571,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/anmo02nms6of1.jpeg?auto=webp&amp;s=2712f43f33d14a13d7c153eed2b4957acd7c01dd"
        },
        "permalink": "/r/movies/comments/1ncrqrl/new_poster_for_good_boy/"
    },
    {
        "id": "1ndlw6v",
        "author": "FixedFun1",
        "title": "Trailer for Decorado, a 2D animated film from Alberto Vásquez (subtitled by me)",
        "content": "",
        "upvotes": 115,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4mdg6is0pdof1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ndlw6v/trailer_for_decorado_a_2d_animated_film_from/"
    },
    {
        "id": "1ndmlx6",
        "author": "TwowolvesMatt",
        "title": "Don't Be Afraid Of The Dark: The TV Movie That Made Me Afraid Of The Dark",
        "content": "This is a Gen X cult classic. It's surprisingly scary for a television movie. Anyone else's childhood scarred by watching it?",
        "upvotes": 110,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1ndmlx6/dont_be_afraid_of_the_dark_the_tv_movie_that_made/"
    },
    {
        "id": "1ndn9a7",
        "author": "MrShadowKing2020",
        "title": "AEW Star Maxwell Friedman And Andrew ‘King Bach’ Bachelor Latest To Join ‘Violent Night 2’ From Universal And 87North",
        "content": "",
        "upvotes": 82,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DnIPWPI1a7qtPC4qmSo5vAD67Tt1mumnudv428kadhY.jpeg?auto=webp&amp;s=b3feb2c4dd75c4d8ca26f526d36296bd9df36d4d"
        },
        "permalink": "/r/movies/comments/1ndn9a7/aew_star_maxwell_friedman_and_andrew_king_bach/"
    }
]