[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i65s3b",
        "author": "Nejiflower",
        "title": "XO kitty acting is garbage, everything about that show is garbage",
        "content": "Okay, XO, Kitty is proof that not everyone needs to be on TV. I mean, was there even an audition process? Or did Netflix just scroll through creators on insta and say, “You look okay, congrats, you’re now an actor”? The acting felt like a bunch of people who’d never been in front of a camera before\n\nAnd don’t even get me started on the dialogue. It’s like the script was written in TikTok comment sections. Nobody actually talks like that in real life  Hearing those lines come out of their mouths was physically painful, like they were trying to make TikTok slang happen, but no just stop this aint it.\n\njust cast actual actors next time. And get a script that sounds like it was written by humans and not an algorithm trying to go viral. And everyone is suddenly gay and bisexual on a korean school? How unrealistic😹😹 is netflix just trying to check the lgbt boxes or something???",
        "upvotes": 24,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1i65s3b/xo_kitty_acting_is_garbage_everything_about_that/"
    },
    {
        "id": "1i5xf7z",
        "author": "dreamingofinnisfree",
        "title": "Sorry not sorry Jim ",
        "content": "Our Netflix was recently compromised. We got two notifications of unfamiliar logins from devices we definitely do not own from locations we definitely do not live. We changed the password and should be good now but we did notice a new user profile for “Jim”.  Had we not checked our email, we would have never seen the alerts. Jim could have gotten away with it if he hadn’t been so damn obvious. No question….it just amused me. Better luck next time Jim. ",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i5xf7z/sorry_not_sorry_jim/"
    },
    {
        "id": "1i5hpow",
        "author": "Cheekychic_89",
        "title": "Whoever decided to not renew The Brothers Sun needs to jailed..",
        "content": "OK Jailed might be a bit far but seriously atleast fire the shit outta that guy. They renew so many mind numbing shows yet, The Brothers Sun was actually pretty well done and an all around good show with potential. \n\nNow instead of waiting for season 2 for the next 3 years (because that's how long seasons take to shoot these days apparently) I'm sitting here having a winge on reddit.. Thanks guy....",
        "upvotes": 152,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1i5hpow/whoever_decided_to_not_renew_the_brothers_sun/"
    },
    {
        "id": "1i60fre",
        "author": "DismalLeg7977",
        "title": "Any good dinosaur shows that's not a cartoon or documentary?",
        "content": "So I showed my dad Netflix for the first time and he said wanted to watch \"dinosaur\" we watched all the Jurassic movies and he really enjoyed them. Today he said \"hey put on dinosaur\" so I looked for other dinosaur shows but all I could find was cartoons and documentaries and we watch a little bit but he doesn't like them. I asked him if he wanted to watch anything else and he said \"no I want dinosaur\". Thanks",
        "upvotes": 6,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i60fre/any_good_dinosaur_shows_thats_not_a_cartoon_or/"
    },
    {
        "id": "1i668xx",
        "author": "thrownitallawayyy",
        "title": "Has the subtitle size changed?",
        "content": "It's been a couple of weeks since I last watched netflix on my laptop but I just started a movie and the subtitles look huge for some reason. Did they increase the size of them? And is there a way to make them look smaller?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i668xx/has_the_subtitle_size_changed/"
    },
    {
        "id": "1i5wkgw",
        "author": "Anxious_Purpose_2022",
        "title": "Good thriller suspense series? ",
        "content": "Can anybody suggest me a good thriller/suspense series to watch for tonight. I’m craving for one from a very long time and haven’t had the time to watch. So suggest me some. \n\nThank you. ",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1i5wkgw/good_thriller_suspense_series/"
    },
    {
        "id": "1i61shm",
        "author": "Infinite_Cricket_633",
        "title": "Series or movies similar to shogun/Vikings",
        "content": "Hi all, I really love immersive movies and series that play in times long ago like medieval times or similar to shogun or even ancient rome/greece, whatever - you get the idea.. So I'd really appreciate any recommendations on shows or movies that might fit these requirements.\n\nVikings is another show that I really like, just so you guys get an idea,\nSo really any show/movie that plays many years ago and is fairly immersive and cool",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i61shm/series_or_movies_similar_to_shogunvikings/"
    },
    {
        "id": "1i66elq",
        "author": "sPdMoNkEy",
        "title": "Bandidos",
        "content": "They kill off my favorite character of all time in Bandidos I don't think I'll be watching another season if they come out with it.  I won't even be watching the last episode of season 2 🫤",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i66elq/bandidos/"
    },
    {
        "id": "1i62ugz",
        "author": "Cat_2025",
        "title": "Autoplay issue ",
        "content": "For the past like four days Netflix hasn’t been auto playing episodes. It’ll play an episode, play the next, and then autoplay stops and gives me the screen options like it’s the last episode of a series (instead of **moments/speed/episodes/audio and subtitles/next ep/full screen** it’s just **moments/speed/audio and subtitles**) I’ve tried deleting my profile and making a new one, shutting down my iPad, deleting and redownloading the app, and nothing is working. Plz help lol",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i62ugz/autoplay_issue/"
    },
    {
        "id": "1i5kui4",
        "author": "Nuclear_Machine",
        "title": "Back In Action copied almost everything from The Family Plan",
        "content": "Yesterday I watched the new movie „Back in action“ with Cameron Diaz and Jamie Foxx on Netflix. For me, the movie was quite boring and nothing special. But many times the same thought came into my mind: this movie copied so much from „The Family Plan“ with Mark Wahlberg! First of all the plot itself is very similar. But also some scenes of the movie were almost identical. Like the scene, where they get filmed (in the club) or when they were singing classic songs in their cars.\n\nI wonder why Netflix is copying a one year old movie so obviously?",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i5kui4/back_in_action_copied_almost_everything_from_the/"
    },
    {
        "id": "1i665ey",
        "author": "wastingparty",
        "title": "When the phone rings/ Rant",
        "content": "Im so disappointed!!! The show was alright. It kept me on edge, very entertaining BUT what was that last episode?!!! This man went to a war zone because his father was responsible for the accident? So he leaves his “love of his life” to go to war …. are you freaking kidding me? I was so freaking irritated that I didn’t even bother finishing that episode. I turned it off. That was Ridonculous.\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i665ey/when_the_phone_rings_rant/"
    },
    {
        "id": "1i5w79k",
        "author": "friutfulmonk5888",
        "title": "Stuck on 1080p despite 4k TV and premium plan",
        "content": "I have two 4K TV's (LG &amp; Samsung) and Netflix's Premium plan (4K). Both are connected to the Internet by Wi-fi (I do not have the possibility to connect via cable).\n\nThe issue - both TV's are constantly stuck on 1080p quality. I do not think Internet connection is an issue - I have a very fast fiber-optic internet. I ran a speedtest and it shows 413mb/s download / 103mb/s upload. I ran a test of the internet stability directly on the Netflix app and it shows 44mb/s and 139mb/s on each TV. As I understand Netflix help-guidelines, they require a minimum of 15mb/s to run 4K media.\n\nDuring playing the TV displays the Internet speed at 0,95mb/s or 1,95mb/s depending on the TV, which is drastically low and in no way in line with my actual internet speed. I have changed the quality from automatic to highest in Netflix account settings, but no change. Both TV's have no issue playing 4K media on YouTube, I did not check other platforms yet.\n\nWhat's most interesting is that I had no problem obtaining 4K quality on Netflix on a much slower fixed wireless internet that I had previously (actual download speed was around 1mb/s, I do not remember the upload speed there).\n\nCould you please advise what could be the issue? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5w79k/stuck_on_1080p_despite_4k_tv_and_premium_plan/"
    },
    {
        "id": "1i5w47t",
        "author": "unknownr2197",
        "title": "If I am shown spatial audio on my netflix account when I am watching videos, which plan do I have?",
        "content": "I have a netfilx account which is billed through sky tv and I do not know which subscription I have. I only have netfilx on 2 tvs. Can someone please help?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5w47t/if_i_am_shown_spatial_audio_on_my_netflix_account/"
    },
    {
        "id": "1i5bn4u",
        "author": "ewazer",
        "title": "How many episodes do you prefer?",
        "content": "As the title says, what's your preference for how many episodes a season contains? I grew up in the era of 22(+) episode seasons of network tv, which was fine when there were only 3 or 4 networks to watch. Now though, there are so many shows to watch that I'm thrilled when a show is only 6 eps. 8 is fine, 10 is ok, but above that I start to get antsy. And I'm completely fine with \"Limited\" series. Tell a good story then get out of the way!",
        "upvotes": 23,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1i5bn4u/how_many_episodes_do_you_prefer/"
    },
    {
        "id": "1i5rvy6",
        "author": "SpoonkillerCZ",
        "title": "I can no longer cast from mobile to TV?",
        "content": "Hello!\n\nI am owner of my Netflix account and also student living/studying in different city then my family.\n\nI set my family home as Netflix home. I pay for the plan that also let's me have one different device then home. But I hate that I need another own email to use it, I hate that its not my profile with my settings and such. That is why I always just used mobile for sign in and my TV in student home worked for like 14 days before needing to do it again.\n\nBut starting today I no longer can do this. I can't even just cast it from phone. Netflix really doesn't make much sense to me anymore, I feel like for increasing price I get still less and less in both content and user experience.\n\nDoes anybody see it the same? What are you experiencing?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i5rvy6/i_can_no_longer_cast_from_mobile_to_tv/"
    },
    {
        "id": "1i5gllx",
        "author": "SilyTheGoose",
        "title": "Does Netflix not have subtitles for films that have a different language in them?",
        "content": "Sometimes I try to watch English movies and every once in a while one of them will have a scene or two of the characters speaking a different language. I turn on subtitles hoping I’ll be able to understand what’s going on, but the subtitles just say “speaking in Japanese” or whatever foreign language they are speaking in. Is this a thing that Netflix does in general? Or is it location based or something? It’s pretty annoying not being able to understand what is going on because Netflix doesn’t feel the need to add subtitles.",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i5gllx/does_netflix_not_have_subtitles_for_films_that/"
    },
    {
        "id": "1i66189",
        "author": "Keep-it-kute",
        "title": "I fucking hate XO Kitty.",
        "content": "The show is cringey. The plot is decent, but the writing…I won’t say it’s terrible, but it not good either. Overall, it feels like a self-insert of a koreaboo ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i66189/i_fucking_hate_xo_kitty/"
    },
    {
        "id": "1i4djim",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2 Comparisons",
        "content": "",
        "upvotes": 1467,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1i4djim/squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1i60qz1",
        "author": "Key-Ad331",
        "title": "Account Hacked and Netflix are idiots",
        "content": "So our Netflix account was hacked. Got emails the email addy was changed and payment info.   Tried to login with our email and cannot.   Chatted with Netflix support and they wanted the old credit card and came back no account found. Said they cannot help at all. What a bunch of shit. They have terrabytes of logging at Netflix .. yes I know this for a fact.  Netflix devs are famous for \nsaying we are a telemetry company masquerading as a streaming service. \n\nSo we are screwed. Thanks Netflix!  \n\nBut why would a hacker do this?  They had to put in another payment method.  Why don't they just create a new account?   Even if the cc was stolen why use an existing account?  This makes no sense at all. \n\nIs this Netflix padding their subscriber numbers?  \n\n\n\n\n\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i60qz1/account_hacked_and_netflix_are_idiots/"
    },
    {
        "id": "1i5lc3x",
        "author": "Robemilak",
        "title": "Limited series vs. multiple seasons - pros/cons for each, which do you prefer?",
        "content": "Limited series are getting more and more popular recently, especially on Netflix. I guess people have less and less time, and finding a title they can finish during the weekend from start to end is a pretty good format. What do you think? Which do you like more? Why?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i5lc3x/limited_series_vs_multiple_seasons_proscons_for/"
    },
    {
        "id": "1i5mtbe",
        "author": "Voliver6",
        "title": "low resolution on most shows",
        "content": "can't get past 720p on most shows on netflix, have already tried different browsers and netflix app... the same movie (the equalizer) I'm trying to watch on netflix is on amazon prime as well, I'm getting 1080p no problem there, as on any other content, so I can guarantee it's not my internet, but netflix bottlenecking me... I'm unsubbing from the service rn",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i5mtbe/low_resolution_on_most_shows/"
    },
    {
        "id": "1i5sfrf",
        "author": "nrhuds",
        "title": "Netflix Household, why are they deciding what my household looks like?",
        "content": "Since when does Netflix dictate what my household looks like and force me to pay for another Netflix account. Even though my situation has me outside of the household temporarily. \n\nI am taking care of my ill grandmother for the duration of her time on this earth. We also pay for 2 users. Having to confirm my household on every device I use, every time I turn around is absolutely ridiculous. Considering canceling netflix altogether.\n\nAnyone else having this issue? I can see families having kids in college Or for extensive business travel. This requirement is just ridiculous to me when  the service is being paid for.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1i5sfrf/netflix_household_why_are_they_deciding_what_my/"
    },
    {
        "id": "1i544x7",
        "author": "ThinkApplication4183",
        "title": "Personalised notifications despite being logged out",
        "content": "Hey, so I used to share a Netflix account with my sister some time ago and was logged in with that account on my phone. I have my own account now though, with only my profile, and I keep getting notifications from Netflix with recommendations using her name, even after reinstalling the app. I don't know if it's just the wrong name or if it's actually recommendations for her, but I suppose the first makes more sense. Does anyone know why this happens?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i544x7/personalised_notifications_despite_being_logged/"
    },
    {
        "id": "1i4poc6",
        "author": "Wildflowers4me",
        "title": " So annoying ",
        "content": "Does anyone else think it’s annoying of Netflix that if you’re in the cheaper plan that watches comercials, they also block you from watching content like some of the newer movies? Isn’t it enough that we watch comercials? ",
        "upvotes": 45,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i4poc6/so_annoying/"
    },
    {
        "id": "1i5l5po",
        "author": "Imaginary_Stomach139",
        "title": "What on earth are those Netflix noises?",
        "content": "https://reddit.com/link/1i5l5po/video/a73ue0o5s3ee1/player\n\nHi, my dad called me yesterday.. Something is wrong with his Netflix, the speakers make some weird noises. He has this TV and stereo system for a few years, but since yesterday it makes some werid noises. And it's only on Netflix. When he uses his DVD player, or normal TV, the sound works great. It's just the Netflix App.\n\nIf he turns the stereo system off and uses his TV speakers for Netflix, it works again and doesn't make this werid noises.\n\nI told him to check if there is a Netflix or TV update but both are on the latest versions. Then i told him to delete the app and then install it again, but he said, you can't deeinstall it... So I don't really know...\n\n  \nAnyone has a clue?\n\nThanks",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i5l5po/what_on_earth_are_those_netflix_noises/"
    },
    {
        "id": "1i59fga",
        "author": "Safe_Letterhead_7234",
        "title": "Account Sharing",
        "content": "Hi, I was just wondering if anyone knew about how Netflix’s password sharing currently works? I know that they’re meant to prevent it from outside of the primary internet address. However, I know a family that is able to use an individual’s account at very distant households. I was wondering how this was possible?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i59fga/account_sharing/"
    },
    {
        "id": "1i57mog",
        "author": "Bad--_--Karma",
        "title": "\"Something went wrong\nWe are having technical difficulties and are actively working on a fix. Please try again in a few minutes\" Solution ON MAC",
        "content": "Had this problem everytime trying to login from my MacBook but it worked on phone.\n\nAnyway how u resolve it : \n\npress network on settings -&gt; click the three dots next to question mark -&gt; hover over locations and press edit location -&gt; click the \"+\" sign in the bottom right corner and call the new location \"test\" -&gt; click done -&gt; Again click on three dots and hover over locations -&gt; Click test (new one u just made) NOT AUTOMATIC -&gt; Make sure to refresh the netflix page before signing in\n\nThe steps are for new ios update if u have an old one the link is below\n\n[https://www.youtube.com/watch?v=tj5aLs1H-6g](https://www.youtube.com/watch?v=tj5aLs1H-6g)\n\nFrom what i know this just resets ur network setting :)\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i57mog/something_went_wrong_we_are_having_technical/"
    },
    {
        "id": "1i5icgi",
        "author": "HistorianPlus5025",
        "title": "Who better ",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i5icgi/who_better/"
    },
    {
        "id": "1i56t22",
        "author": "Snowpholofagous",
        "title": "Block scary images and automatic previews",
        "content": "Okay, call me old fashioned but I get completely overwhelmed by automatic previews on all streaming services. I also, do not want any scary images popping up and scaring our 2 year old. Any tips for Disney plus, prime video, Netflix and Gem. \n\nThank you in advanced. I am thinking I will have to make a kids profile for each but we still get the auto previews. I need quiet for searching. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i56t22/block_scary_images_and_automatic_previews/"
    },
    {
        "id": "1i5jrg2",
        "author": "shesavestheday",
        "title": "Will The OA return?",
        "content": "That show was so unbelievably incredible and I need more. It’s been years since it last came out, but I still think about it often. \n\nQuit canceling awesome shows. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i5jrg2/will_the_oa_return/"
    }
]