[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o712m6",
        "author": "sftradersf",
        "title": "Netflix has gone to the dogs",
        "content": "Just tried to watch and finish Cabin 10, which was “#1 in the movies today,” and it’s the worst show they’ve put on in ages. I think this streaming service has seriously jumped the shark \n\nIt’s been a little over a year now but it seems as if every single new show is just a horrific plot trying to garner some kind of notoriety or great experience and it’s just the exact opposite. I’m so disappointed with everything they seem to put out that I now think it’s time to call it. They’re just awful now!",
        "upvotes": 401,
        "comments": 280,
        "media": null,
        "permalink": "/r/netflix/comments/1o712m6/netflix_has_gone_to_the_dogs/"
    },
    {
        "id": "1o6zb2y",
        "author": "GuineaPKilledMe",
        "title": "The Woman in Cabin 10 is such an eye rolling, boring movie",
        "content": "The entire movie just felt so flat to me. I couldn't even be on the main character's side because she started acting so deranged from the start I couldn't even blame the other characters for distancing themselves or being rude towards her. It felt like some sort of weird Gone Girl style movie (I admit, i'm not a Gone Girl fan, I found that movie itself to be pretty boring)\n\nWhat are some other thoughts whether positive or negative you guys had on this movie?",
        "upvotes": 226,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1o6zb2y/the_woman_in_cabin_10_is_such_an_eye_rolling/"
    },
    {
        "id": "1o7af4r",
        "author": "Secretly-Aware",
        "title": "Kingdom has to be the best piece of “zombie” media I’ve seen.",
        "content": "I was blown away by the quality of this show and don’t know why everyone isn’t talking about it. If you like zombie stuff, please go watch this show. If you don’t like zombie stuff, go watch it. The storyline is so complex and there are so many nail-biting political plots going on that there are whole episodes I forget that zombies exist. Love the alternate 17th century world-building, love the character development, love the HATS, people just go watch this for the hats alone and you won’t be disappointed.",
        "upvotes": 31,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1o7af4r/kingdom_has_to_be_the_best_piece_of_zombie_media/"
    },
    {
        "id": "1o6we9v",
        "author": "reverze",
        "title": "Monster: Ed Gein was horrific.",
        "content": "It was mostly inaccurate from start to finish. 80% of it was the most ridiculous made up trash. At one point the entire show seemed like they were saying I should feel bad for Ed. ",
        "upvotes": 252,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1o6we9v/monster_ed_gein_was_horrific/"
    },
    {
        "id": "1o71gc2",
        "author": "Ok_Builder_310",
        "title": "I just finished watching 6 feet under",
        "content": "The last episode completely killed me 😭 I didn’t even like the show to begin with but I’m someone that has to finish a show if I started it. I really started to love it after a while and this last season broke me. Especially the last episode. I’m not okay 😭 ",
        "upvotes": 18,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1o71gc2/i_just_finished_watching_6_feet_under/"
    },
    {
        "id": "1o72ngh",
        "author": "slickmoney11",
        "title": "Barely any new Halloween/scary movies this year",
        "content": "The fuck is netflix doing bro? Their halloween section includes a bunch of shows and movies that were already there. Usually they add a bunch of cool shit but im not seeing much. Not to mention there isnt even a dedicated halloween or scary movie section in THE MOVIE SECTION of netflix. Also has anyone noticed only tv shows appear on the homepage now? It seems they really dropped the ball this year man. For reference its netflix canada so might be different for other users, but im fairly dissapointed ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o72ngh/barely_any_new_halloweenscary_movies_this_year/"
    },
    {
        "id": "1o6zx3s",
        "author": "AccomplishedPut5175",
        "title": "Caramelo❤️",
        "content": "I just watched this movie, and I simply have no words. At the same time, I was crying and laughing like crazy. Whether it's because I have a dog too, or the overall story of the film, I don't know. But what I do know is that this movie is a 10/10. It's a must-watch, with a warning to prepare for a big dose of emotions.☘️🍀",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o6zx3s/caramelo/"
    },
    {
        "id": "1o7cpm4",
        "author": "ChallengeAdept8759",
        "title": "How realistic is the nuclear threat in Netflix’s ‘A House of Dynamite’?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o7cpm4/how_realistic_is_the_nuclear_threat_in_netflixs_a/"
    },
    {
        "id": "1o7buc8",
        "author": "Dry_Pressure_5249",
        "title": "modem",
        "content": "tv’m modeme bağlı netflix izlerken sıkıntı yok fakat modeme pc’yi bağladığım zaman tv ‘de netflix izleyenlerin görüntü kalitesi çok bozuluyor internetim 100mb fakat böyle bir sorun yaşıyoruz?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7buc8/modem/"
    },
    {
        "id": "1o74p7p",
        "author": "hexflicksarts",
        "title": "Why the Upper East Side in Gossip Girl Never Felt the Same After Season 4",
        "content": "You ever rewatch **Gossip Girl** and notice that something shifts around Season 4? It’s subtle at first , like the sparkle’s still there, but the edge, the bite, the tension that made the show feel alive starts to fade. The Upper East Side stops feeling like a battleground and more like a fashion runway.\n\nThe early seasons had this intoxicating cocktail of chaos. Every episode felt like a tug-of-war between privilege and pain. It wasn’t just about who wore what, it was about who would survive the social hurricane. By Season 4, the show had climbed so high into its own mythology that it started to lose that New York grit that once grounded it. The parties got flashier, the scandals bigger, but the consequences smaller. Blair and Serena stopped feeling like complex women navigating identity and started becoming plot devices in an endless carousel of recycled love interests. Even Dan, once our moral compass , turned into a caricature of the self-righteous artist.\n\nIt’s not that the show got bad , it just lost its danger. Remember how early Gossip Girl made you feel like you were peeking into a forbidden world, one text away from social annihilation? That electric fear , that’s what vanished. The Upper East Side became too forgiving, too polished, too safe.\n\nWhat are your thoughts on this?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o74p7p/why_the_upper_east_side_in_gossip_girl_never_felt/"
    },
    {
        "id": "1o6rsbz",
        "author": "broomboy101",
        "title": "Can anyone recommend me a drama show?",
        "content": "I’m looking for one that isn’t boring that will almost always have me on the edge of my seat. I really liked shameless u.s there was always shit going down in that. I also liked breaking bad, but normally I stick to watching sitcoms. But now I want to find more shows like those that have dramatic tension and you’re dying to know what’s going to happen. ",
        "upvotes": 15,
        "comments": 116,
        "media": null,
        "permalink": "/r/netflix/comments/1o6rsbz/can_anyone_recommend_me_a_drama_show/"
    },
    {
        "id": "1o6hftv",
        "author": "Jack_Micheals04",
        "title": "Ryan Murphy is such a hypocrite",
        "content": "I just finished a painful watch of the Ed Gein story and I’m just in shock as to how this got produced. This series really highlights the hypocrisy and inability to tell a story on Ryan Murphy’s behalf.\n\nI’m under the impression that the Monsters series is meant to help empathize with serial killers by showing the abuse they endured, as well to highlight the societal impact these cases have when they are so sensationalized. The main point of the Ed Gein story that I picked up on was that serial killers stories are misconstrued time and time again, and this has negative impacts, like glorifying violence and desensitizing audiences towards situations like this. Such is completely ironic.\n\nThe exact irony this show is trying to call out is simultaneously partaking in that irony on a whole new level. \n\nEd Gein never had an infatuation with “isle Koch” and “isle Koch” never had comic books made about her. Ed Gein also never had a fiance she was completely fictional for this series. Ed Gein also never had any contact with “Birdman”, and it was never corroborated that he had any romantic affiliation with the shop owner he murdered. I could go on about the historical inaccuracy’s of this show. And I understand some artistic liberties need to be drawn to help tell a story, but these plot lines really had no correlation towards telling his story, and were completely made up for the sake of entertainment, it dilutes his story and shows a complete hypocrisy in the shows mission.\n\nIn my opinion a gritty docuseries about his actual life would have been hard hitting. He lived a boring isolated life, and yeah that would have made for less drama in the show, but it would have struck a nerve with the audience. It could have highlighted a truth that I think is extremely interesting; that anyone with a similar mental health disorder could have easily committed the same crimes that Ed Gein did, if their condition where left untreated and consumed by isolation, grief, and childhood trauma. That Ed Gein could have been a peaceful (yet eclectic) member of society if access to mental health care was available to him. \n\nThat would have really driven the shows moral standpoint clearly. That we are all vulnerable, and all deserve empathy, and that media never shows the real truth (and the negative consequences of that).\n\nInstead we got Birdman shaking his boobs in Ed Geins face, and a dance montage of Ed walking up to heaven while owner of a lonely heart plays 😂 pure brain rot.\n\n",
        "upvotes": 40,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1o6hftv/ryan_murphy_is_such_a_hypocrite/"
    },
    {
        "id": "1o76o9f",
        "author": "Princessomani",
        "title": "New to C drama .. newbie newbie",
        "content": "Which C drama on netflix with eng subtitles would you recommend for someone who just wants to binge watch this weekend? Have been boored with k drama recently ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o76o9f/new_to_c_drama_newbie_newbie/"
    },
    {
        "id": "1o75l8x",
        "author": "hard2resist",
        "title": "Which websites tell you the monthly best suspense or thriller movies from all regions of Netflix?",
        "content": "I'm looking for websites that curate monthly lists of the best suspense and thriller films available on Netflix, beyond Rotten Tomatoes. I need resources that provide yearly compilations so I can easily identify top-rated titles from all regional Netflix libraries.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o75l8x/which_websites_tell_you_the_monthly_best_suspense/"
    },
    {
        "id": "1o7b17p",
        "author": "Cupid_Fox",
        "title": "How do i prevent from new accounts being made?",
        "content": "my Netflix is being used by me and my mother \ni do not want my younger siblings to get on my Netflix \nthere are shows they're not supposed to watch\n\ni had made a specific account that shows movies and shows appropriate for their ages and made a pin on those they're not allowed to access but they kept making new accounts \nso i decided to play that game, filled all spaces up with an account, added pins for each\n\nunfortunately they found out how to delete these accounts and made new ones\n\nidk how to stop them except for logging the account out of Netflix \n\nhowever my mom logs back in when im not there and thus cant do anything about it\n\nis there a possibility you can prevent someone from making new accounts??",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o7b17p/how_do_i_prevent_from_new_accounts_being_made/"
    },
    {
        "id": "1o69ekl",
        "author": "TheHippyWolfman",
        "title": "I enjoyed \"Wayward,\" this is my review",
        "content": "I enjoyed Wayward. As a matter of fact, I thought it was pretty good. I *did* go into it with absolutely no expectations, simply clicking the link after a brief look at the description. A critique I would have is that the eight episode format felt, to me, sort of limiting. There was a lot that was touched on but not really elaborated upon in a satisfying way. The show may have benefitted from either being shorter and more concise, in order to remove elements that were either unnecessary or improperly explored, or longer, so as to deal with these issues in a more coherent manner and to keep some of the plot points from having such a rushed execution. \n\nThat being said, if you’re down for a wild, and somewhat tonally inconsistent, ride, then there is fun to be had here. I found it relatively easy to get invested in the characters and their lives. The show was, at turns, endearing, unsettling and downright disturbing. There were twists I honestly didn’t expect and ended up enjoying (sometimes despite the execution and not because of it, but whatever). The psychological drama, I thought, was more often than not well done and satisfying. The fact that one pair of protagonists are teenagers and the other pair are adults allows the series to walk the line between teen and adult drama without fully committing to either audience, and maybe being accessible to both (but I will leave that for you to decide). In terms of acting, some performances were more memorable than others, but I found nothing unserviceable and the main antagonist to be delightfully both creepy and easy to hate. \n\nOverall, I feel as if I was able to feel satisfied with the series because I went into it with very little hype. It certainly wasn’t a masterpiece, but it gave me eight hours of solid entertainment and left me wanting to know *more-* about the characters, their pasts and their inevitable fates. That’s the primary pro and con of this series: it is like walking through a museum and looking at its portraits of people and landscapes. You are looking at \"snapshots\", and what both intrigues and frustrates about the experience is that each piece *suggests* so much to the mind, in terms of questions, speculations and fantasies, but the ultimate satisfaction of these suggestions occurs only in our imaginations.\n\nI have not settled on a rating yet, but I liked it, and my initial recommendation is to watch if you’re into some creepy cult-thriller fun with a heavy dose of teenage angst and a penchant for leaving you with more questions than answers. \n\n*I press post. I am sitting in a chair. I am crying out for the upvotes...*",
        "upvotes": 71,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1o69ekl/i_enjoyed_wayward_this_is_my_review/"
    },
    {
        "id": "1o6eigi",
        "author": "ImEmilyCampbell",
        "title": "Orphan Black - Easily One of the Grittiest Thrillers on Netflix",
        "content": "I just finished all five action-packed seasons of the Primetime Emmy-winning 2013 thriller, and I can't recommend it enough. It's one of the best I've watched since Black Doves, and in my opinion, much grittier than Black Rabbit (which left me a bit underwhelmed).",
        "upvotes": 23,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1o6eigi/orphan_black_easily_one_of_the_grittiest/"
    },
    {
        "id": "1o6ylhu",
        "author": "tucsongoat",
        "title": "Won’t screen cast?",
        "content": "2nd time in 3 days, Why is this? there is probably another thread like this but can someone give me a solution real quick? I’ve signed out, signed back in and nothing. Trying to rewatch stranger things in to catch up for the new season. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o6ylhu/wont_screen_cast/"
    },
    {
        "id": "1o6nhts",
        "author": "ArrivalLess",
        "title": "Going through a terrible heartbreak - recommend something feel good to watch",
        "content": "Please recommend me a good show to watch that will distract me from a heartbreak I got from a relationship. I don't want to see anyone else because this was the person I love the most but I also don't want to sit and suffer from all the pain I am going through.\n \nPlease suggest some feel good or something that you think can distract anyone going through a heartbreak. Thankyou!",
        "upvotes": 4,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6nhts/going_through_a_terrible_heartbreak_recommend/"
    },
    {
        "id": "1o6wxp9",
        "author": "june_yah",
        "title": "Region Swap Glitch?",
        "content": "So tonight I got a 'please update your payment' notification from Netflix. (This came up on the app.) Weird, but OK. I go in and check it out, it's asking for a ZIP Code and not a Postal Code. After a couple of failed attempts, I get a hold of Customer Support and they say I have an American account. I've had my account for 12 years, only in Canada, and suddenly I have an American account. My only option was to create a new membership, which I declined. Anyone else have this happen to them?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o6wxp9/region_swap_glitch/"
    },
    {
        "id": "1o6w67u",
        "author": "Diligent-Analyst-909",
        "title": "Help me remember name of show",
        "content": "Hello fellow Redditor’s I’m trying to remember the name of this show I watched a couple years ago i don’t remember much but It was an animated show with 1 season then it got discontinued I think  I remember it was about a boy who was attacked by two people and found out his parents where from a different planet but he was saved by these other guys and they took him with them I know that’s not much help but that’s all I really remember.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o6w67u/help_me_remember_name_of_show/"
    },
    {
        "id": "1o6u66n",
        "author": "aykalam123",
        "title": "I thought we’re having another Michael Flanagan show this year but got disappointed. What’s the major Halloween show if any?",
        "content": "I couldn’t find news about what they’ll show to replace Flanagan’s shows (Haunting of Hill House, Fall of House of Usher, etc.). Is that it? The end of these types of shows?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o6u66n/i_thought_were_having_another_michael_flanagan/"
    },
    {
        "id": "1o6m38f",
        "author": "SalesforceSalesman",
        "title": "I need a movie recommendation for my dad who isn't really into movies and he has an attention span of a 5 year old",
        "content": "He doesn't really watch movies but with the convincing of his girlfriend, he wants to give them a try. The issue is, years of doom scrolling on FB video in retirement has basically rendered his attention span to zero. Everytime we try to watch a movie together, he's always on his phone and then we quickly loses interest, because he doesn't follow the story (duh? Then actually pay attention?). Can you ppl recommend me a movie that's actually engaging and fun for someone like him? His gf wants to watch a horror but it doesn't have to be as long as we can get him to actually pay attention and finish the movie for once. \n\n",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o6m38f/i_need_a_movie_recommendation_for_my_dad_who_isnt/"
    },
    {
        "id": "1o6ye6t",
        "author": "MostFrame2688",
        "title": "Should I watch wayward?",
        "content": "I have a phobia of frogs. I can tolerate seeing one occasionally but not frequently. \n\nI’m 4 episodes through and have a feeling they’re tied to the plot. \n\nI like it so far though, should I continue?  (Please no spoilers) \n\nEdit: thanks for all your input, I stopped after a couple more episodes, felt like it was going nowhere. ",
        "upvotes": 0,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1o6ye6t/should_i_watch_wayward/"
    },
    {
        "id": "1o6n4uq",
        "author": "Hikithe",
        "title": "Is Stranger Things Season 5 Costlier Than Avengers: Endgame? Budget Breakdown",
        "content": "",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o6n4uq/is_stranger_things_season_5_costlier_than/"
    },
    {
        "id": "1o5g2ay",
        "author": "T-tail88",
        "title": "Ed Gein story...how did the people in the town not know his mother was dead?",
        "content": "She dropped dead in front of two other people and then they had a graveside service for her. Not to mention her tombstone in the cemetery.  Does no one pay attention to anything in that town? ",
        "upvotes": 263,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1o5g2ay/ed_gein_storyhow_did_the_people_in_the_town_not/"
    },
    {
        "id": "1o6kjtx",
        "author": "maje8290",
        "title": "Going insane trying to download shows/movies to my ipad",
        "content": "Hey now. I've spent the last hour trying to figure out what I'm doing wrong, and googling answers to this, but I'm about to give up.\n\nI do have an older ipad, that can't download past ios 15.8, but I can't find on their help page where it says you must have the most current OS to download things to your device.\n\nMy account says I can have 2 devices with downloads, and it can work on my iphone, but I can't find anything on the app on the ipad with the download icon?\n\nMaybe it's moot, because starting tomorrow I might not be able to use the app at all, on this specific device, but I am going bananas trying to figure out why I am not prompted anywhere to download anything, as it never was an issue in the past.\n\n  \nThanks all!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o6kjtx/going_insane_trying_to_download_showsmovies_to_my/"
    },
    {
        "id": "1o6e8ch",
        "author": "HuckleberryMurky3651",
        "title": "Splinter Cell Deathwatch",
        "content": "Already having one of the most charismatic characters in pop culture, a big universe built for at least two decades, all the cards in hand to make a banger show, and we got this. Death to watch.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o6e8ch/splinter_cell_deathwatch/"
    }
]