[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p4kx6z",
        "author": "Cairoli23",
        "title": "perché la statua davanti al Madama parla dei milanesi?",
        "content": "ciao! sono spagnolo e da quando ho visto questa statua mi sono fatto una domanda: perché è intitolata ai milanesi se è a Torino. capisco quella roba dell'esercito sardo ma... perché i milanesi? è stato un regalo e messa nella capitale in quelli tempi?",
        "upvotes": 46,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/unedm12zwz2g1.png?auto=webp&amp;s=c88e960010e37e2d3786968ff91c143b7ef2425e"
        },
        "permalink": "/r/torino/comments/1p4kx6z/perché_la_statua_davanti_al_madama_parla_dei/"
    },
    {
        "id": "1p4pxhr",
        "author": "Top-Pension4334",
        "title": "(sfogo) la situazione parcheggi in centro è imbarazzante",
        "content": "Ricordo quando,  5/10 anni fa, quando si voleva andare a cena in centro, la scelta era: se vuoi parcheggiare vicino, accetta di pagare un parcheggio a pagamento, se non vuoi pagare, accetta di parcheggiare un po' lontano, o di girare in attesa di trovare un posto libero.\n\nA distanza di pochi anni, la scelta è: se vuoi avere una qualsiasi possibilità parcheggiare, mettiti in coda per un parcheggio a pagamento sperando che esca qualcuno, o torna a casa.\n\nLa situazione che ho trovato ieri sera era imbarazzante: posti dove uno può effettivamente parcheggiare inesistenti, tra riservati ai residenti, una miriade di posti per disabili, lavori, gente in doppia fila. Roba che se per caso ne trovi uno libero (e non avendo altre possibilità!) fai il segno della croce che non ti arrivi una multa. Nessun parcheggio a pagamento libero: tutti occupati, con gente IN CODA all' entrata in attesa che qualcuno esca.  \n\nUnica alternativa, se vuoi cenare in centro, è parcheggiare in zone a 40 minuti a piedi e attraversarti tutto il centro, magari in inverno e magari insieme a famiglia/persone anziane\n\nSiamo una città ridicola.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p4pxhr/sfogo_la_situazione_parcheggi_in_centro_è/"
    },
    {
        "id": "1p4rqsk",
        "author": "Complex_Lynx_8546",
        "title": "SOS LAVANDERIA",
        "content": "Ciao \nSapete per caso qualche lavanderia a gettoni che ha l’asciugatura che non costa tantissimo? \nIo abito vicino porta palazzo e vado spesso alla lavarmi le in via Maria ausiliatrice che con la tessera ti fa 90 centesimi 8 minuti di asciugatura(altrimenti 1 euro) solo che da un mese circa funziona solo un’asciugatrice su 2 e se la trovo occupata sono fregato. Le scorse volte ho provato 2 asciugatrici in via Cigna, entrambe vicino al fiume Dora, solo che una ora anche lì su 2 ne funziona solamente una e l’altra che ha 3 asciugatrici mi ha lasciato la roba con un odore strano, metallico, non so come spiegarlo. Se qualcuno conosce qualche lavanderia in zona accetto consigli, grazie 🙏 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p4rqsk/sos_lavanderia/"
    },
    {
        "id": "1p3y04x",
        "author": "_Giulio_Cesare",
        "title": "Botte e minacce a un professore, “sei un pedofilo”: arrestato Don Alì, il “re dei maranza”",
        "content": "",
        "upvotes": 76,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gd6d0WXTyTEhcSXB5CGc0rnUrTSslly_fIWYbADy19o.jpeg?auto=webp&amp;s=51f1cb6f9793992d178f7f7fb04a67af59121825"
        },
        "permalink": "/r/torino/comments/1p3y04x/botte_e_minacce_a_un_professore_sei_un_pedofilo/"
    },
    {
        "id": "1p4qrve",
        "author": "Rude_Calligrapher712",
        "title": "Corso di chitarra",
        "content": "Come da titolo, mi piacerebbe iniziare a suonare la chitarra. \nConoscete scuole di musica da consigliarmi? Io abito in Sansa ma mi sposto senza problemi. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p4qrve/corso_di_chitarra/"
    },
    {
        "id": "1p4ixfo",
        "author": "Signal_Cucumber_1111",
        "title": "Situazione lavorativa a Torino",
        "content": "Buongiorno,\n\nnel prossimo anno potrei dovermi trasferire in città con mio fratello e mia madre. Qual'è la situazione lavorativa a Torino? Senza conoscenze, quanto è difficile trovare lavoro in ambito IT, operaio in fabbrica o autista patente B, pulizie?\n\nGrazie.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p4ixfo/situazione_lavorativa_a_torino/"
    },
    {
        "id": "1p3tqwo",
        "author": "TheDreamingMind",
        "title": "La GTT è la cosa peggiore che esista",
        "content": "Ho pagato per 6 anni (di servizio osceno) l’abbonamento Under 26 a oltre 200€. A partire da Novembre, non essendo più Under 26, ho deciso di andare avanti a biglietti singoli usando l’app. Bene, l’app fa schifo tanto quanto la GTT. Due biglietti ho fatto. Il primo, nonostante il pagamento sia avvenuto, non è stato rilasciato. Ironicamente, per il viaggio di andata la linea si è fermata senza apparente motivo e ci hanno fatto scendere (a metà percorso per me). Al ritorno, semplicemente non è proprio passata la linea. Per il secondo biglietto, l’app si è rifiutata di farmi convalidare o auto convalidare. I controllori salgono, controllano pure che il biglietto sia stato acquistato e mi fanno comunque la multa per non ho convalidato. A nulla sono servite le spiegazioni con annesse dimostrazioni. 37€ mi hanno fottuto. Io ho pagato ma ho già fatto reclamo, consapevole che forse non servirà a niente, sperando che qualcuno mi dia speranza. La GTT deve esplodere adesso.",
        "upvotes": 78,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1p3tqwo/la_gtt_è_la_cosa_peggiore_che_esista/"
    },
    {
        "id": "1p4lqp0",
        "author": "Overall_Task_2783",
        "title": "URGENTE per 28 venerdi",
        "content": "Qualcuno di zona o disposto ad andare alla tana di charizard, joker o daimachi a prendere il set allenatore fiamma sprettrali che escono proprio quel giorno, io sto a scuola e non posso fare in tempo, PLS",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p4lqp0/urgente_per_28_venerdi/"
    },
    {
        "id": "1p3r1j2",
        "author": "Mindless-Set-8993",
        "title": "Enjoy abbandona Torino?",
        "content": "Stamattina alle 7,30 cercavo una Enjoy in zona centro, e questa era la situazione. 16 auto in tutta la città, di cui nessuna nella parte est della città.\nÈ così da alcune settimane almeno.\nÈ in corso un disimpegno totale di Enjoy dal sistema di car-sharing a Torino? \nNon credo che il sistema sia redditizio con sole 16 vetture, quindi ho l'impressione che sia un servizio residuale (lasciamo in giro quel che resta del parco auto, in attesa che si fermi da sé per qualche motivo e senza procedere a sostituzioni).\nQualcuno ne sa di più?\nGrazie!",
        "upvotes": 49,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m2m6qogxns2g1.jpeg?auto=webp&amp;s=f7c3d3dcbbd8d11b54a2b1bac9e3a92066fe0cb5"
        },
        "permalink": "/r/torino/comments/1p3r1j2/enjoy_abbandona_torino/"
    },
    {
        "id": "1p3zipp",
        "author": "AnwMiz",
        "title": "Balkan party",
        "content": "Cerco qualcuno (possibilmente Balkan 😄) che abbia voglia di andare alla serata Balkan di stasera a Trofarello. Se non avete la macchina No Problem scrivetemi in DM ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p3zipp/balkan_party/"
    },
    {
        "id": "1p441hf",
        "author": "Particular-Face1757",
        "title": "La mia esperienza terrorizzante a Torino, parco dell’arrivore",
        "content": "Voglio condividere una storia che mi porto dietro da più di dieci anni, accaduta nel Parco dell’Arrivore a Torino. Quando l’ho raccontata in passato, nessuno mi ha mai creduto davvero. Ma recentemente ho trovato online altre persone che parlano di ossa e situazioni strane in quella zona, quindi ho deciso di raccontare tutto.\n\n1. Primo incontro – “L’uomo col cappello di paglia” (avevo 12 anni)\n\nEra mattina presto, intorno alle 8. Avevo deciso di non andare a scuola e di girare per Torino da solo. Sono entrato nel Parco dell’Arrivore; era nuvoloso, umido, l’atmosfera pesante.\n\nCamminando lungo un sentiero stretto nella zona più interna, ho visto in lontananza una figura che veniva verso di me. Avvicinandomi, ho iniziato a notare dettagli strani: indossava vestiti che sembravano asiatici e soprattutto un cappello di paglia in stile vietnamita/cinese. In Italia non avevo mai visto nessuno vestito così.\n\nPiù mi avvicinavo, più sentivo che c’era qualcosa di profondamente sbagliato. Lui camminava dritto verso di me, con il volto completamente coperto dal cappello, guardando per terra. Il modo in cui avanzava mi ha dato una sensazione terribile, come se stesse venendo esattamente verso di me, non semplicemente passando.\n\nMi sono voltato e ho iniziato a tornare verso l’uscita. Ogni volta che mi giravo a guardare, anche se lui camminava, era sempre più vicino. Alla fine ho iniziato a correre fino all’entrata del parco, sono uscito e Quando ho attraversato la strada, mi sono girato: lui era fermo esattamente al limite del parco, immobile. Mi ha guardato per un attimo come per dire, mi sei sfuggito, poi si è girato ed è tornato indietro.\n\n2. Secondo incontro – “Il portale” e le ossa (avevo 14 anni)\n\nDopo quell’episodio non sono più tornato nel parco per molto tempo. Quando finalmente ci sono tornato con degli amici, quasi due anni dopo, le cose sono diventate ancora più inquietanti.\n\nCamminando nella zona boschiva, ho trovato quella che sembrava una sorta di struttura in cemento, una specie di portale senza porta, come quelli giapponesi ma più grezzo e abbandonato.\n\nLa struttura era imbrattata di quello che sembrava sangue secco o vernice rossa.\nE tutto intorno… ossa. Tante. Sparse dappertutto. Alcune sicuramente di animali, altre non riuscivo davvero a capirle.\nHo sentito un gelo dentro.\n\nSono corso via, e durante la fuga ho visto un crocefisso rovesciato, alto all’incirca 2 metri fatto da 2 pezzi di legno messi insieme ed era ricoperto di come ho già detto anche quelli vernice rossa o sangue\n\nPoco prima dell’uscita, ho trovato una valigia appoggiata contro un albero. Curioso, L’ho aperta.\nEra piena di libri.\nHo preso il primo: in copertina c’era il simbolo satanico della capra, il pentacolo, e il titolo era qualcosa come “Le Regole di Satana”.\nC’erano decine e decine di libri simili dentro quella valigia\nHo buttato tutto e sono scappato senza fermarmi.\n\n\n3. Terzo incontro – “L’uomo dagli occhi neri” (qualche mese dopo)\n\nL’ultima volta che sono stato in quel parco ero con la mia ragazza dell’epoca.\n\nMentre camminavamo per il parco un uomo anziano con un cane al guinzaglio è arrivato verso di noi. Il cane era nel panico, tirava come se volesse scappare da lui.\nQuando l’uomo mi è passato accanto, l’ho guardato negli occhi… e i suoi occhi erano completamente neri.\nNiente bianco, niente pupille distinguibili. Solo nero.\nCamminava rigido, come uno zombie, senza reagire al cane che quasi si strozzava per scappare da lui.\n\nIo e la mia ragazza non abbiamo detto una parola. Abbiamo semplicemente continuato a camminare e poi siamo usciti dal parco.\nQuella è stata l’ultima volta che ci sono tornato.\n\n\n4. Dopo tanti anni… ho scoperto che non ero l’unico\n\nPer anni ho pensato a quei momenti e specialmente all’uomo con il cappello di paglia, chissà cosa mi sarebbe successo se non fossi scappato, chi era, cosa voleva, mi è rimasto e rimarrà impresso per sempre. Nessuno mi credeva, mia sorella era l’unica che mi sosteneva e credeva, tutti gli altri lo prendevano come uno scherzo. \n \nPoi recentemente ho cercato il parco su Google Maps (ogni paio di mesi mi veniva di nuovo quell’immagine del parco e iniziavo a fare ricerche senza trovare niente) e ho trovato un commento di un’altra persona che parlava esattamente della stessa cosa: ossa sparse ovunque, atmosfera “alla Dylan Dog”, e la torre del parco vicina al portale che sembra infestata.\n\nHo trovato anche foto di quella struttura di cemento (portale) che avevo visto, pubblicate da altri.\nNon ero pazzo. Finalmente dopo più di dieci anni ho trovato persone che avevano visto le cose che ho visto io a cui nessuno credeva, e anche se non hanno visto propio tutto quello che ho visto io come l’anziano con gli occhi neri o l’uomo col cappello di paglia, ho deciso di dedicarmi a scoprire cosa realmente accade lì e chi è quell’uomo col cappello di paglia.\n\nQuel posto ha qualcosa che non va, e credo che nessuno abbia mai parlato apertamente di ciò che succede lì dentro.\n\nUn’altra cosa inquietante di quel parco è che sono stati trovati nel corso di anni, corpi di persone, ed era un parco dove abbastanza spesso sparivano bambini, ed a volte venivano anche ritrovati… ma non in vita, ed io potevo essere uno di quei bambini/ragazzini se non scappavo al momento giusto.\n\n\nSe qualcuno ha vissuto qualcosa di simile al Parco dell’Arrivore, o ha informazioni su cose strane accadute lì negli anni, mi piacerebbe saperlo. È un luogo che mi ha segnato per tutta l’infanzia, e ora voglio solo capire cosa ho realmente visto, sono sicuro sia un posto dove si fanno rituali satanici, ma c’è ancora di più lì dentro e se qualcuno ha delle informazioni e vorrebbe parlarmi della sua storia, per favore non esitare a scrivermi.\n\nE se sei uno di quei satanisti che fa rituali in quel parco e stai leggendo questo commento, verrete fermati presto.",
        "upvotes": 2,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1p441hf/la_mia_esperienza_terrorizzante_a_torino_parco/"
    },
    {
        "id": "1p46902",
        "author": "Feisty_Bathroom_807",
        "title": "Cerco rapper/produttore con cui collaborare",
        "content": "Ciao! Sono Mattia, ho 17 anni e vengo da Torino. Scrivo musica da un paio d’anni: le mie influenze principali sono rap e trap, ma in realtà mi piace spaziare un po’ su tutti i generi.\nFinora non ho mai avuto l’occasione di registrare i miei pezzi in uno studio, quindi sto cercando qualcuno interessato a andarci insieme, sia per conoscere nuovi artisti sia per vedere cosa possiamo creare collaborando.\n\nConosco solo le basi dei programmi di produzione, quindi mi sarebbe davvero utile avere accanto qualcuno un po’ più esperto per la parte di registrazione.\nVa benissimo anche un ragazzo semplicemente appassionato di musica come me, con cui dividere i costi dello studio e provare a fare qualcosa insieme. \n\nSe mi scrivete qua sotto possiamo benissimo accordarci e scriverci su ig per conoscerci meglio e vedere se eventualmente andare in studio insieme. (Se mi scrivete il vostro ig vi contatto io direttamente in direct)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p46902/cerco_rapperproduttore_con_cui_collaborare/"
    },
    {
        "id": "1p3vbcv",
        "author": "alessiotucci",
        "title": "Campo di pallacanestro (aperto o al chiuso) 🏀",
        "content": "Ciao a tutti, \n\nSapete quali sono i  campetti migliori di Torino per fare due tiri ogni tanto?\nE se ci sono quelli al chiuso, quanto costa affittarli?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p3vbcv/campo_di_pallacanestro_aperto_o_al_chiuso/"
    },
    {
        "id": "1p3ujwz",
        "author": "Cloud_Of_Thoughts452",
        "title": "Consigli Affitto Torino",
        "content": "Ciao a tutti,\n\nM30, avrei bisogno di qualche consiglio per trovare affitto a Torino per 1 o 2 anni.   \n\n\nQual è il periodo migliore ?   \nQual è il budget per un mono/bilocale ? nelle varie zone ? Zona San Paolo ?  \nInvece una stanza singola ?\n\nAvete altri consigli o raccomandazioni ?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p3ujwz/consigli_affitto_torino/"
    },
    {
        "id": "1p3tiz4",
        "author": "Aggressive-Bunch-202",
        "title": "Cerco un salone da parrucchiere o barbiere autentico per girare un documentario",
        "content": "Ciao a tutti,\n\nSto cercando un salone da barbiere o un parrucchiere autentico nella vostra città per un piccolo shooting semi-documentaristico. Non serve che sia bello o di design: cerco soprattutto un luogo con una vera anima, un’atmosfera di quartiere, persone interessanti da incontrare e magari da intervistare. L’idea è di catturare un momento reale, caldo e vivo, in un posto autentico e con carattere.\nSe avete qualche consiglio o un luogo in mente, sono tutto orecchi. Grazie! 🙏",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p3tiz4/cerco_un_salone_da_parrucchiere_o_barbiere/"
    },
    {
        "id": "1p32skj",
        "author": "hemaybefede",
        "title": "La sola Madrid ha più km di metropolitana che l'intera Italia",
        "content": "Per quelli che: \"ma Torino ha una metro fantastica, siamo già fortunati così...\".",
        "upvotes": 106,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ydpfc9s5l2g1.png?auto=webp&amp;s=ed3ba23fb4da0a0fa1be025b4c20622baa298f7d"
        },
        "permalink": "/r/torino/comments/1p32skj/la_sola_madrid_ha_più_km_di_metropolitana_che/"
    },
    {
        "id": "1p3sjoy",
        "author": "FutureVirtual6811",
        "title": "Sending an Envelope by Post at Turin",
        "content": "Guys I’m new in Turin and I have a tiny question. I have to send an envelope to an address in Milano but where do I go? Dhl or some other shipping company? I want to be able to track my shipment and get notifications to my mail/phone if it arrived etc. Thanks for all the help.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p3sjoy/sending_an_envelope_by_post_at_turin/"
    },
    {
        "id": "1p2zutz",
        "author": "daccia",
        "title": "Richieste bizzarre: dove posso trovare una campana per pecore?",
        "content": "Ho un compleanno in arrivo e verrà regalata una pecora, quindi giustamente vorrei trovare una campana degna per la nuova queen, ma a Torino non ho proprio idea di dove potrei mai trovare qualcosa del genere, ogni consiglio è ben accetto!",
        "upvotes": 58,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/27xbnkwzcm2g1.jpeg?auto=webp&amp;s=d11e4909c1470c4473023ff3a17ce1eb85ab2368"
        },
        "permalink": "/r/torino/comments/1p2zutz/richieste_bizzarre_dove_posso_trovare_una_campana/"
    },
    {
        "id": "1p37khe",
        "author": "Effect-Imaginary",
        "title": "Devo regalare parecchi Gianduiotti (e dolci simili), cosa mi consigliate per avere un buon rapporto qualità prezzo?",
        "content": "Non sono un sommelier del cioccolato &amp; co, ma a spanne mi sembra brutto portare cose della lindt.\n\nMagari comprare direttamente da cioccolaterie locali.\n\n\nNon vorrei svenarmi da ghigo.\n\nPer adesso ho solo adocchiato i negozi di dolciumi a porta palazzo, quelli sotto la tettoia. Sono troppo commerciali e troppo poco piemontesi? \n\nA memoria vendevano anche lindt,  ma di sicuro ci sono altre marche.\n\nEdit: alla fine opterò per la qualità sopra la quantità, grazie per i consigli. \n\nCalcagno \n\nCroci\n\nSperandri\n\nGobino\n\nCaffarel\n\nGuido Castagna\n\nZiccat\n\nLa Perla",
        "upvotes": 14,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1p37khe/devo_regalare_parecchi_gianduiotti_e_dolci_simili/"
    },
    {
        "id": "1p3p19i",
        "author": "Mattringmecc",
        "title": "Metro con biglietto gtt to move",
        "content": "Buongiorno a tutti, ho fatto un abbonamento per 72 ore tramite l'app GTT to move. Il mio cellulare però essendo un po' vecchiotto non ha l'nfc quindi nell'autobus procedo con l'auto convalida ma se volessi prendere la metro? Ci sono i tornelli? Come si fa in quel caso? Ho visto che il biglietto ha un codice QR code, è possibile fare scannerizzare quello al tornello? Grazie a chi risponderà ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1p3p19i/metro_con_biglietto_gtt_to_move/"
    },
    {
        "id": "1p3fgxg",
        "author": "Imaginary_Hour6285",
        "title": "Qualcuno di voi in cosa è stato discriminato in base alla propria provenienza?",
        "content": "P",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1p3fgxg/qualcuno_di_voi_in_cosa_è_stato_discriminato_in/"
    },
    {
        "id": "1p40f1s",
        "author": "Medium_Woodpecker887",
        "title": "Mi sono stancato di questa città...",
        "content": "Non è più come anni fa,mi sta stancando,non dico sia tutto da buttare al cesso,ma ho visto cose che mi fanno schifo e nessuno che fa nulla...Adesso sono fuori e mi spiegherò meglio più tardi o in un altro,ma mi ha veramente stancato l'aria pure di questa città,sono stato già a Bardonecchia ed era meglio,ma alla gente sembra non fregare un cavolo,preferisce sfondarsi di alcool il fine settimana e guardare le partite di calcio,e sono cose che faccio anche io lo ammetto,non voglio fare il superiore,ma nessuno che scende mai in piazza per la criminalità in sta città,ho fatto vari post in cui l'ho fatto notare e sarà che Reddit Italia ha queste regole rigide e sono stato schiacciato con \"\"vai in terapia!!'!'!!'\" ci vado già,ma sono queste le vostro contro argomentazioni?A proposito,l'SSN è uno degli altri problemi non solo di Torino ma tutta Italia, probabilmente il post verrà rimosso ma veramente già 6 anni fa di respirava un aria diversa,oggi fa schifo,piena di ubriaconi,spacconi,e oltre a quello in generale e noiosa, forse è anche per questo che la gente si dr0ga..Rimuovete pure il post se non lo ritenete adatto ma il mio è uno sfogo,non levo il paese sia perché comunque ho amici e persone care giustamente,sia perché ci sono anche delle cose belle,il Museo del Cinema, i musei in generale le zone non troppo affolate,chi si conosce e si fidanza non tramite Tinder e e ste cavolate ma dal vivo, i veri psicologi,non i fuffaguru spirituali,La Mole Antonelliana,le trattorie,ora è tutto lercio,vaffanculo.",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1p40f1s/mi_sono_stancato_di_questa_città/"
    },
    {
        "id": "1p3lmby",
        "author": "Le_Moulin_Italien",
        "title": "Student Job",
        "content": "Hi!\n\nThis is a random question but what are realistic opportunities for student job for someone who\nwho\n\n○speaks french (c1), italian(b2) and english (c2)\n○loves cooking and baking with some experience in italian dishes (it will never reach your nonna's but it is honest to god)\n\nTo find job in Torino?\nWhat would the salary be?\n\n-Many thanks at advance!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p3lmby/student_job/"
    },
    {
        "id": "1p35el2",
        "author": "glorious-ahole",
        "title": "Things to do other than drinking after 8pm",
        "content": "I am going out with a friend tomorrow and I was wondering what can we do ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1p35el2/things_to_do_other_than_drinking_after_8pm/"
    },
    {
        "id": "1p2tgwu",
        "author": "Powerful-Ostrich-120",
        "title": "Stellantis, a Mirafiori 400 nuovi lavoratori per la Fiat 500: non accadeva dagli anni '90",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cHAfJIUPx3EgsITC5QfJu_wNDCfmk4y1cmYEnng3ELY.jpeg?auto=webp&amp;s=f8108675d55a3884c1cacee82607b2559a39ac86"
        },
        "permalink": "/r/torino/comments/1p2tgwu/stellantis_a_mirafiori_400_nuovi_lavoratori_per/"
    },
    {
        "id": "1p2t268",
        "author": "zanard1",
        "title": "disperazione",
        "content": "Premessa: ho scaricato Reddit da poco, quindi spero di star impostando tutto nel modo giusto.\nSalve gente, sono uno studente universitario toscano di 21 anni alle prese, in modo abbastanza disperato, con il tentativo di crearmi un minimo di amicizie qui a Torino. Sono arrivato da un mese preciso e per ora nada. Anche all’università risulta molto più difficile di quanto pensassi.\nQuindi… nel caso esistesse qualche essere umano che ha voglia di fare due chiacchiere dal vivo e provare a fare amicizia, si manifesti. A questo punto provo pure Reddit, non ho altre idee. Poi se la cosa può risultare utile, menzionerei qualche mio interesse giusto per facilitare la cosa come la lettura in generale, testi classici in special modo, cultura pop e musica, tanta musica, special modo indie pop, cantautorato italiano vecchia scuola, rap sulla base di truceboys, in THE panchine ecc. mi farebbe piacere perché ahimè qua sento un po’ di solitudine e sarebbe bello poter alternare lo studio con un po’ di vita sociale. ",
        "upvotes": 15,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1p2t268/disperazione/"
    },
    {
        "id": "1p35fa5",
        "author": "loukasm99",
        "title": "Opinioni su monolocale zona Barca",
        "content": "Tra poco mi trasferirò a Torino e non conosco bene i quartieri migliori in cui vivere, che non siano centro e limitrofi. Mi hanno sconsigliato Barriera, per cui siccome dovrei lavorare nei paraggi di Barca, stavo pensando proprio a Barca.\n\nSarebbe una buona idea andare a vivere lì? Per me un buon quartiere è un quartiere che non sia eccessivamente isolato rispetto al centro e che vi si possa camminare in modo abbastanza tranquillo la sera. Porterei l'auto con me e cercherei un appartamento con box auto.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p35fa5/opinioni_su_monolocale_zona_barca/"
    },
    {
        "id": "1p2x106",
        "author": "ema0897",
        "title": "Gruppi Pokémon Torino?",
        "content": "Sto cercando gruppi per compravendita e scambi di carte Pokémon a Torino,  su whatsapp o telegram.\nQualche idea?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p2x106/gruppi_pokémon_torino/"
    }
]