[
    {
        "id": "1p5e4zn",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 2946,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5e4zn/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p6wqq2",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] UCL, Olympiacos FC vs Real Madrid CF, Match 5",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p6wqq2)",
        "upvotes": 13,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6wqq2/prematch_thread_ucl_olympiacos_fc_vs_real_madrid/"
    },
    {
        "id": "1p71y0i",
        "author": "ContributionAway1010",
        "title": "Hi guys, I drew you Vinícius Júnior",
        "content": "",
        "upvotes": 89,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gs2xdr644k3g1.jpeg?auto=webp&amp;s=d46a4b786ab0aec6dd60aec5172dbdc30b0273cd"
        },
        "permalink": "/r/realmadrid/comments/1p71y0i/hi_guys_i_drew_you_vinícius_júnior/"
    },
    {
        "id": "1p6t2eg",
        "author": "Code__Lyoko",
        "title": "LaLiga is becoming huge problem",
        "content": "The quality of football has significantly dropped in LaLiga in past 1-2 years. The intensity weakened, the players are moving like they are 50+ years old. It is easiest to see when LaLiga clubs face non LaLiga teams. For example, Barcelona players against Chelsea were in “slow-mode”. Similar problem is with us. How did we develop that? I don’t see that enemy teams are pressing a lot, to make us run non-stop, but we rather play super slow and wait for Mbappe to score. \n\nI was hyped to see Atletic Bilbao and Villareal to play in Champions League, but now I am disappointed. \n\nRemember few years ago, Spanish football was dominant, and playing in such league made Real Madrid strong. What we see today is slow and boring football. ",
        "upvotes": 195,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6t2eg/laliga_is_becoming_huge_problem/"
    },
    {
        "id": "1p6xpwj",
        "author": "Lolman4O",
        "title": "Do you have any Real Madrid item that's super special to you?",
        "content": "",
        "upvotes": 74,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6xpwj/do_you_have_any_real_madrid_item_thats_super/"
    },
    {
        "id": "1p6j1a8",
        "author": "Ineedhelpistaken",
        "title": "Kylian Mbappe’s consistency in club football over the years is Insane. Numbers like these are why we signed him.",
        "content": "",
        "upvotes": 353,
        "comments": 163,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jsh7yo0vwf3g1.png?auto=webp&amp;s=bf99e62fb1bebd8807323be98b85f23bb3adcc59"
        },
        "permalink": "/r/realmadrid/comments/1p6j1a8/kylian_mbappes_consistency_in_club_football_over/"
    },
    {
        "id": "1p66mxf",
        "author": "TheFeatherDiaries",
        "title": "HAPPY BIRTHDAY!!!, Xabi Alonso!",
        "content": "",
        "upvotes": 1505,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o8ww09sxyc3g1.jpeg?auto=webp&amp;s=8c35269178e1f32c0536a760eab65d2cd8af52ce"
        },
        "permalink": "/r/realmadrid/comments/1p66mxf/happy_birthday_xabi_alonso/"
    },
    {
        "id": "1p6b3wc",
        "author": "Falconica24",
        "title": "Did Vini just nutmeg Xabi Alonso? 😭",
        "content": "Bruh, with the current news and rumours, this is so hilarious, media and newspaper will use this material to push the war between Xabi and the players even more which is cringe but funny at the same time.\nAnd I hope Xabi doesn't bench Vini for that next game and start him.\nBro juggled the ball to get aura back lmao.",
        "upvotes": 399,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bs4gu3p6ce3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p6b3wc/did_vini_just_nutmeg_xabi_alonso/"
    },
    {
        "id": "1p6busq",
        "author": "No-Independent2522",
        "title": "Do not know what to believe 😅",
        "content": "",
        "upvotes": 358,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pb7ghsurie3g1.jpeg?auto=webp&amp;s=ea81ae8cedab45d3064c93907a81eb3215648131"
        },
        "permalink": "/r/realmadrid/comments/1p6busq/do_not_know_what_to_believe/"
    },
    {
        "id": "1p6behe",
        "author": "Mastermind_737",
        "title": "What they won't show you after the nutmeg. All smiles, good vibes, and working hard.",
        "content": "",
        "upvotes": 374,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/clpypdzsee3g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p6behe/what_they_wont_show_you_after_the_nutmeg_all/"
    },
    {
        "id": "1p6zhjy",
        "author": "bwildered_mind",
        "title": "Our Speed of Play Needs Improvement",
        "content": "First of all, I think Xabi is doing an acceptable job overall given his constraints and the nature of the squad that he has. However, improvements can be made. \nTo me, the team needs to play at a faster pace. We spend a considerable amount of time in the buildup phase of an attack and that gives the opposition too much time to set themselves defensively. That makes defences harder to unlock generally and near impossible against disciplined teams. \nAdditionally, by spending so much time trying to break a defence makes the players vulnerable on the transition since the defence tends to lose concentration defensively after attacking for so long. \nIn football, possession is a statistic that means nothing. When you have the ball, do something with it quickly. The scoreline is the only metric worth tracking. ",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6zhjy/our_speed_of_play_needs_improvement/"
    },
    {
        "id": "1p644km",
        "author": "Gaengsa",
        "title": "Rafa Nadal : Vinicius has to understand who the authority is and Respect that. Xabi? Before the start of the season, who wouldn't sign to be first in the league and a privileged position in Champions League. A house isn't built in a day.",
        "content": "",
        "upvotes": 1182,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EFBXwmCuzj4i3uwx_XzEDd7uRsPNH27GzyZk63ZueAk.jpeg?auto=webp&amp;s=997246b8c34a3d9106929afa02f9e2f1e8c62e3b"
        },
        "permalink": "/r/realmadrid/comments/1p644km/rafa_nadal_vinicius_has_to_understand_who_the/"
    },
    {
        "id": "1p6v017",
        "author": "Hazimbappe",
        "title": "We are genuinely the worst fanbase on earth",
        "content": "I have never seen a more ungrateful and undeserving fanbase on any fandom ever. It sucks being associated with half of the people that support this club. \n\nEveryone is so whiny and just plain wrong 9/10 times. If our players weren’t being paid millions, they’d probably get depression just from the fans always berating them for everything.\n\nLet’s all do better.",
        "upvotes": 29,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6v017/we_are_genuinely_the_worst_fanbase_on_earth/"
    },
    {
        "id": "1p663wr",
        "author": "Modo97",
        "title": "Rodrygo is making me appreciate Gareth Bale even more!",
        "content": "I think Gareth Bale is the closest comparison to Rodrygo among any player you might think of.\n\nHe too was originally a left winger, but he spent his entire Real Madrid career playing on the right because of Ronaldo’s presence. However, the key difference is that Gareth Bale arrived at Real Madrid as one of the top three players in the Premier League at the time — a true superstar that any team in the world would have loved to sign.\n\nFor more than seven years with Madrid, Gareth Bale was one of the most criticized players. And the funny thing is that the excuses fans now make for Rodrygo were never once brought up for Gareth Bale: “Oh, he’s not playing in his preferred position… Oh, he’s overshadowed because of Ronaldo and Benzema… Oh, he doesn’t get special treatment like the other stars of the team.”\n\nRodrygo will live long on the memory of what he did against Man City and Chelsea. But let’s remember that this man (Bale) contributed with goals in three Champions League finals and yet never received even a fraction of the sympathy, media support, or fan backing that Rodrygo gets today.",
        "upvotes": 499,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p663wr/rodrygo_is_making_me_appreciate_gareth_bale_even/"
    },
    {
        "id": "1p68zxh",
        "author": "chunchunmaru1129",
        "title": "Lucas Vasquez started his career as a Right winger but for the team he would many many times play as a right back without any complain and nowadays players don't even want to get out of their comfort zone",
        "content": "I remember many times Lucas getting trolled online for his mistakes he made playing in the right back position but he never complained.Lucas got trolled online by fans more than any other player in the last couple of years here in real Madrid. \n\nAlthough Lucas isn't on the level of guys like Vini or Rodrygo but he never once complained whenever he had to play out of position in the right back.He always gave his absolute best for the team. \n\nDid he make many many mistakes playing there? Yes he obviously did and he took the criticism head on without any complains. \n\nGuy's like these should be valued in every team. ",
        "upvotes": 224,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p68zxh/lucas_vasquez_started_his_career_as_a_right/"
    },
    {
        "id": "1p6mpu7",
        "author": "ManuMora98",
        "title": "[Basket] Important win in Euroleague against current leaders Hapoel Tel Aviv 74-75",
        "content": "",
        "upvotes": 32,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/au9v3yq5lg3g1.jpeg?auto=webp&amp;s=d78c01a98c7b2eceaacc2fea3af8e4b49589b1d0"
        },
        "permalink": "/r/realmadrid/comments/1p6mpu7/basket_important_win_in_euroleague_against/"
    },
    {
        "id": "1p62s1c",
        "author": "TheFeatherDiaries",
        "title": "Arancha Rodriguez : Federico Valverde, Vinicius Junior, Rodrygo, Brahim DON'T buy into the Coach's ideas.",
        "content": "",
        "upvotes": 463,
        "comments": 481,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KIJckxpXwXzNUGoTDLe73SkW2LOrBn0xKe3MtX5pVOI.jpeg?auto=webp&amp;s=e01f37803e526df367db158d3ef8179d8ccb0e33"
        },
        "permalink": "/r/realmadrid/comments/1p62s1c/arancha_rodriguez_federico_valverde_vinicius/"
    },
    {
        "id": "1p68x0q",
        "author": "chunchunmaru1129",
        "title": "If Vini or any player doesn't fix their behaviors or want to play for the badge than they should be sold no questions asked",
        "content": "No Player I mean no player is bigger than the club it doesn't matter if your Cristiano Ronaldo or  Lionel Messi.But the way I'm seeing the news about how some players are misbehaving with the coach and whining about the coaches tactics I think it's better to sell them instead of keeping them here.It doesn't matter if the player is Kylian Mbappe or Vinisious Jr or even Jude Bellingham. \n\nThe club real Madrid always comes first.If you don't want to play for the badge and the team then you don't deserve to be here.If you don't want to play according to the coaches tactics and out of position because the team needs it then you don't deserve to be here. \n\nI know it's a rant from someone whose opinion doesn't matter here but I just wanted to get this out of my chest. \n\nBut thankfully there are also guy's like Jude Bellingham and Arda Güler or Tchoumeni who have no problem playing out of position. \n\nGüler doesn't even have the physical build to play that deep in the Midfield but he still gives his absolute best in the pitch and tries to make things work out and fight for the badge.Does he fuck up?yes he got a hand ball in one match and 2-3 occasions his mistake led to a goal but he never complained and took the blame and criticism head on.\n\nJude while he does play as a cam at the moment would also help with the midfield and defense if he is seeing things looking bad and work his ass off. \n\nTchoumeni basically had to play Center back for 2 whole seasons and got many many criticism because of him sometimes failing but he never complained.",
        "upvotes": 133,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p68x0q/if_vini_or_any_player_doesnt_fix_their_behaviors/"
    },
    {
        "id": "1p68jy8",
        "author": "Luffy710j",
        "title": "Courtois out against Olympiakos",
        "content": "",
        "upvotes": 97,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g_qA7vREfb2wx5NGc3STQwXFMaMjsVH5WzhyEN0RdDo.jpeg?auto=webp&amp;s=7e5b7cd255a104e7afd1b13640f85b1364cd4171"
        },
        "permalink": "/r/realmadrid/comments/1p68jy8/courtois_out_against_olympiakos/"
    },
    {
        "id": "1p66479",
        "author": "Quirky_Appearance539",
        "title": "How &amp; why did the dressing room get filled with such divas? [RANT]",
        "content": "Growing up I've always felt RM had one of the most secure dressing room maybe along with Bayern. Very little controversies or media stories. Even during the Barca treble years there was absolutely reports of unrest. RM have always been one of the most media secure football clubs as far as I've known. But what's changed now?\n\nWe're literally top of the table. Have 2 defeats in the season till now with 2 draws. How is there so much unrest? How is Alonso's job at risk? We've got the best defence in the league &amp; 3rd best in UCL. Coming to Alonso. Is he making mistakes? Yes. Are some of his decisons highly questionable? 100%. But that's what you get with a manager with 2+1/2 seasons of senior management. HE WILL MAKE MISTAKES! THAT IS WHAT YOU GET WITH A YOUNG MANAGER.\n\nArteta took time. Kompany literally got relegated. You have to give him the headroom to learn from his mistakes instead of sack threats. Are we not allowed a transition? Are we not alloed a rebuild phase? Plus its a well known fact that we had an incomplete transfer window!\n\nComing to the dressing room. I feel so sad. Bunch of primadonnas. How have you had your head so up your arse as to not renew your contract cause the manager is rotating you? Its his job ffs! His job is create tactics &amp; win &amp; your job is to play the way he wants! These massive egos will ruin the club. I really believed these issues would never appear at RM.\n\nFreaking Cristiano was let go due to these issues. Who do these players think they are?           \n\nI miss Sergio Ramos in times like this. \n\nPS - I'm not defending Alonso but he's exactly what you're gonna get with a young manager. You have to accep his vision. ",
        "upvotes": 104,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p66479/how_why_did_the_dressing_room_get_filled_with/"
    },
    {
        "id": "1p63ge1",
        "author": "BreadfruitGrand2880",
        "title": "The squad needs a reset and Xabi needs support",
        "content": "I genuinely think Xabi has the potential to become one of the best managers in the world. But even if he doesn’t reach that level, the club still needs to back him right now. There isn’t a single top manager in Europe who would cave to this group of players. If they get their way again, what manager can realistically succeed here?\n\nDo people seriously think Arteta, Lucho, Conte or anyone of that calibre would be a good fit for these players? Vini needs to be moved on, Xabi needs a striker who fits his style, and the club needs to send a clear message: the collective comes first. This team has rarely been greater than the sum of its parts, and that’s the real shame",
        "upvotes": 146,
        "comments": 85,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p63ge1/the_squad_needs_a_reset_and_xabi_needs_support/"
    },
    {
        "id": "1p5kbt6",
        "author": "Bald-Eagle619",
        "title": "[Mario Cortegana] Vinicius Junior currently earns €18M a year after tax with Real Madrid. The club offered Vini an increase in salary at around €20M net, but Vini said no. The club told Vini to make a counter-offer, and he demanded the biggest contract in club history, similar to Cristiano Ronaldo.",
        "content": "Vinicius Jr signed fresh terms at Madrid in 2022, the details of which were announced a year later. He currently earns around €18million (£15.8m; $20.7m) a year after tax and his contract contains a €1billion release clause.\n\nIn 2024, a delegation working on behalf of Saudi Arabia’s Public Investment Fund (PIF) was keen to explore a move for him to join a Saudi Pro League club. It would have involved lucrative personal terms, but did not develop into anything concrete.\n\nEarlier this year, Madrid made Vinicius Jr a renewal offer, including an increase in salary to around €20million net a year. When this was not accepted, the club asked the player’s side to propose a figure.\n\nVinicius Jr’s representatives requested a historic contract, in the region of the highest ever at the club (which was given to Cristiano Ronaldo), with a package of up to €30million per season. This included base salary, performance bonuses and a renewal bonus, something which has not been offered to players at Real Madrid previously.",
        "upvotes": 1090,
        "comments": 449,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8LqdgxsCySotoqdbJLjQI7S-1m5hqy9ZE1_au-r2SS0.jpeg?auto=webp&amp;s=efcb925e258267c049055a19b1977ef92bcbc8fd"
        },
        "permalink": "/r/realmadrid/comments/1p5kbt6/mario_cortegana_vinicius_junior_currently_earns/"
    },
    {
        "id": "1p6dqog",
        "author": "Bunchdawg",
        "title": "New Fans must realize that Real Madrid is a Media Powerhouse and a Football Club",
        "content": "Real Madrid will never be a club defined by average players or a modest star system like Bayer Leverkusen because its identity is built on global media power and the constant pursuit of the biggest names in football. The club thrives on being a spectacle, a brand that demands the brightest stars to maintain its dominance in sales, sponsorships, and media rights. Xabi Alonso understood this culture when he joined, adapting to the reality that Madrid is not just a team, but a global institution. To suggest that Real Madrid would willingly sell off all its star players is absurd, because the club’s financial model and prestige depend on showcasing elite talent. The Galáctico tradition ensures that Madrid will always attract and retain world-class players, reinforcing its status as the ultimate footballing stage.",
        "upvotes": 14,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6dqog/new_fans_must_realize_that_real_madrid_is_a_media/"
    },
    {
        "id": "1p68hmk",
        "author": "simomo9112",
        "title": "Institution over players",
        "content": "The situation is worrying. Very reliable sources indicate that several players aren’t buying into the coach’s ideas and are already pushing for his exit after just a few months. To me, that reflects immaturity more than anything else — a group that has gotten used to having things their way. It’s not shocking coming from Vini, but it is disappointing to see someone like Valverde, a captain, fall into the same pattern, projecting his poor form onto the coach instead of taking responsibility.\n\nI’m not saying Xabi is necessarily the perfect fit, but he’s clearly addressing the main structural issues we carried over from last season. The club cannot bend to players’ whims; even Ronaldo — arguably the greatest in our history — was shown the door when he tried to strong-arm the club.\n\nThis is precisely the moment to reaffirm that principle. And I trust Pérez to make the right decisions.",
        "upvotes": 38,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p68hmk/institution_over_players/"
    },
    {
        "id": "1p62nwa",
        "author": "chunchunmaru1129",
        "title": "Can we all just calm down and stay quiet for this season atleast because it's literally Xabi's first season here",
        "content": "We just came of our worst season in a long time in the last season.Not everything will be immediately fixed.No coach will ever be able to fix a club with many problems immediately.It will need some time. \n\nWe can't overspend like the premier league clubs because of La Liga rules which is a handicap for us. \n\nWe are basically in a transition period with many of our legends like Kroos and Modric either retiring or leaving the club. \n\nWe have many young talented players who just need some time to settle down. \n\nWe still haven't figured out our proper play style yet and our players haven't yet gotten used to Xabi's tactics. \n\nSo guys I ask we all stay calm and quiet atleast for this season and let Xabi do his work. \n\nIt's not going to be the end of the world if we don't win the champions league this season. \n\nRemember Jose Mourinho built the blueprint of the team which ended up winning 4 champions league in 5 years and Mourinho's team took a while to get going. \n\nSo please stay calm and let the professionals handle it.",
        "upvotes": 107,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p62nwa/can_we_all_just_calm_down_and_stay_quiet_for_this/"
    },
    {
        "id": "1p5w2lz",
        "author": "NicoSpurs",
        "title": "Nico Paz will return to Real Madrid in January",
        "content": "Breaking news from Argentina: according to Gastón Edul, the journalist with the closest ties to the Argentine national team, the repurchase of Nico Paz is very close to being finalized right now, in the winter transfer window. \n\n[https://x.com/gastonedul/status/1993081129285366120](https://x.com/gastonedul/status/1993081129285366120)\n\nAnd it is necessary. Although many do not want to see it, this team lacks creativity. There are too many one-on-one players and physically gifted midfielders, but few players capable of combining and creating play, apart from Arda and, if he manages to settle in, Mastantuono.",
        "upvotes": 192,
        "comments": 119,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5w2lz/nico_paz_will_return_to_real_madrid_in_january/"
    },
    {
        "id": "1p6h9gu",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey] Real Madrid 2-2 Elche",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6h9gu/postmatch_survey_real_madrid_22_elche/"
    },
    {
        "id": "1p5i9ss",
        "author": "cyrusmancub",
        "title": "Vini Jr. has informed Florentino Perez that he does not intend to renew his contract while his relationship with Xabi Alonso remains strained. Talks over an extension are now stalled",
        "content": "Vinicius Junior informed Real Madrid president Florentino Perez that he does not intend to renew while his relationship with Xabi Alonso remains strained\n➕Talks over an extension are stalled",
        "upvotes": 738,
        "comments": 473,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5i9ss/vini_jr_has_informed_florentino_perez_that_he/"
    },
    {
        "id": "1p5vtss",
        "author": "Puzzleheaded-Delay60",
        "title": "Its time we need to be honest with ourselves as fans and say this real madrid team has become average.",
        "content": "I know some of us don't want to admit it but some of our players are overrated. We have always had world class players in every position in this team, but if you look at the squad post 2024 our quality is severely diminished in all areas except the keepers. Not to say we have bad players, they are good but some of them are at best average at what they do without kroos, modric and benzema holding their hands. Look at some of the quality we lost since those three left: No Aerial threats, our set pieces have gone down the gutter, inconsistent forwards, midfield now lacks a technical player that isn't afraid of the ball, our defense is trash, our right side is completely dead without Carvajal, the bench is full of average players mixed in with young players who wont get chances to play (We have two strikers rotting on the bench) and most importantly we lost our mentality. The only reliable position we have is goalkeeping and thats because its courtois and we have a very good backup in lunin. The squad planning since the departure of Benzema has been questionable to say the least and those two ucl wins glossed over the issues which we are now facing. \n\nI know I'm going to get downvoted just because of what I said but at this point I don't really care. We have become an average team and unless these players start to play for the club and not themselves, we will remain average and no coach is going to fix this doesn't matter if its carlo, xabi or zidane.",
        "upvotes": 145,
        "comments": 139,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5vtss/its_time_we_need_to_be_honest_with_ourselves_as/"
    },
    {
        "id": "1p6axli",
        "author": "One_Impressionism",
        "title": "Vinicius nutmegs Alonso during Real Madrid training",
        "content": "",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p6axli/vinicius_nutmegs_alonso_during_real_madrid/"
    }
]