[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 116,
        "comments": 366,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1ms9tim",
        "author": "Upset-Flower-148",
        "title": "The stupid household thing should be illegal and it is infuriating",
        "content": "Netflix uses your wifi to know if you are home. What if I have a kid in college across the country? What if my parents want to use my account and live across town? \nWhy the heck should I not be able to share MY account which I PAID for with anyone I want?\nA limit on the number of accounts makes sense but who cares on the location!?\n\nIt’s an obvious money grab and they have literally said in the past “true love is sharing your Netflix password” \n\nTalk about a 180. \n\nIt is infuriating. \n\nThis is just one of the things I added to my consumer protection law draft I am sending to my congressman. \n\nThen they “let you” add a person like they are benevolent and we should be thankful to spent $8 EXTRA!? Maybe if it was $1 I would understand but the entire software industry is infuriating on how much of a cash grab it is. ",
        "upvotes": 952,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1ms9tim/the_stupid_household_thing_should_be_illegal_and/"
    },
    {
        "id": "1msc1rn",
        "author": "Low-Squirrel-4868",
        "title": "Just rewatched Catch me if you can and it got me thinking",
        "content": "I know the movie is set decades ago but watching someone pull off that level of identity theft with nothing but charm and some paperwork is wild. It made me wonder how much easier it would be today with everything being online.  \n  \nBack then you had to forge documents and physically be somewhere to make the scam work. Now with social media, data leaks and people oversharing, you could probably impersonate someone you have never met just by piecing together public information. Name, address, phone number, old photos, even their signature if they have posted it somewhere (I myself have never changed my phone number or email, I imagine I'm in every database online). The scary part is how official everything can look. A scammer could set up fake accounts, fake email domains, fake phone numbers, and most people would not even think twice if the message looked professional. If someone had enough of your personal data they could probably pass as you with your bank, insurance, or even your employer.  \n  \nI know there is places you can buy data but is there any software or method to help with this stuff? I'd like to know your opinions or advice.",
        "upvotes": 68,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1msc1rn/just_rewatched_catch_me_if_you_can_and_it_got_me/"
    },
    {
        "id": "1mrqbz2",
        "author": "Flowerofthesouth88",
        "title": "S Club 7 Netflix documentary in The Works",
        "content": "I know there was more of no hit wonder in The US with Never have a dream come true but in The UK and a few countries they had a few hits but The band isn’t make much money then people thought and once they broke up, They still have financial issues that one member, Jon Lee turned to drug abuse to cope and drug abuse that nearly killed him, And Paul Cattermole sadly died in 2023 of natural causes and was on benefits months prior and tried to sell his Brit Awards trophy just pay The bills, Jo O'Meara was a contestant on Celebrity Big Brother UK in 2007 where she was controversy of racism in The house that killed her career in The end and had suicidal thoughts because what went on as she even had death threats from The public, It’s would be interesting for Netflix Viewers to watch even there not into S Club 7 or never heard of them because with The darkness that The band went during and after S club 7 and that it’s shows how little they made within The success within how much fame and little money they made that The fans didn’t think and also how there mental health can take a toll. ",
        "upvotes": 467,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1mrqbz2/s_club_7_netflix_documentary_in_the_works/"
    },
    {
        "id": "1mscvge",
        "author": "___TylerDurden",
        "title": "Brothers Home: The Echoes of Survivors: Inside Korea's Tragedies",
        "content": "Who else has watched the two episodes of Brother’s Home on Netflix and is horrified? This series made me so angry and sad, especially knowing that the members of that family are able to live well today. Why are people capable to do such things?! I feel so bad for the victims.\n\nWhat’s your opinion on this?",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mscvge/brothers_home_the_echoes_of_survivors_inside/"
    },
    {
        "id": "1msvhzc",
        "author": "AlexisLexus3829",
        "title": "Gossip Girl s5",
        "content": "Hey, it's not much a question about the season rather than a technical issue, ig..., E17 \"the princess dowry\" can't be played for some reason..., when I searched about it it showed that it's episode 20.., so now I'm confused with the order and note that every episode after and before E17 can be played except it for some reason. Does anyone know what's up with that?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msvhzc/gossip_girl_s5/"
    },
    {
        "id": "1msuhbs",
        "author": "t-rex_leggings",
        "title": "Oppenheimer sound is horrible",
        "content": "When it came out I heard all this great reviews on the sound of the movie. Did they leave out the bass on this? Every other show/movie I've watched has bass sometimes too much so I turn down the subs. Anyone else find this?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1msuhbs/oppenheimer_sound_is_horrible/"
    },
    {
        "id": "1msu4up",
        "author": "Deep_Block7712",
        "title": "What if  Rumi showed her patterns to huntrix",
        "content": "I was watching korean cómics video and i was wondering what if she dud show her powers and say my dad was a demonnbut im not one  i  just am wondering. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msu4up/what_if_rumi_showed_her_patterns_to_huntrix/"
    },
    {
        "id": "1msiw9e",
        "author": "Intelligent-Bit4250",
        "title": "Hitler and the nazis evil on trial",
        "content": "Just arrived at the last episode. I think the show is okay, but just okay. As someone who knows relatively much about the history of the Second World War I expected, judging by the title, a more thorough history of the Nuremberg trial of which I know less. However, that’s not what I got at all. \n\nThe trial is treated more as a sideshow and the documentary watches more like a general history doc of the Second World War. A missed opportunity to do something unique in my opinion. I get that it is also meant for people who don’t know anything about the Second World War, but I think you can also just introduce the fact that the trial is about the horrors and crimes during that war and then go on with a documentary about how the trial took place. \n\nNow it’s just the worst of both worlds. It’s veeeery general on the war, it’s causes and the way it was lost itself, but then also it just touches briefly upon the different perpetrators. \nWouldn’t it have been far better to go by topic, eg people responsible for the camps, people in general administration, generals etc etc. Or just a couple of episodes where they talk about one person only, eg Speer, Göring or Hans Frank? \n\nTLDR: the documentary is not anything like the title would suggest and it feels more like a general history doc of WW2. Generic. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msiw9e/hitler_and_the_nazis_evil_on_trial/"
    },
    {
        "id": "1msmug4",
        "author": "Commercial-Ad-674",
        "title": "Hunting Wives - lazy writing",
        "content": "I enjoyed the drama but ti was so hard to get past how easily this would've been solves if they FOLLOWED THE GUN at the other shooting. They would've immediately figured out Kyle sold it, and that he was Margo's sister. If they had just left out the other shooting but that they found the gun, that wouldve been way more realistic. But also, no forensics were done at all??",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msmug4/hunting_wives_lazy_writing/"
    },
    {
        "id": "1msomee",
        "author": "randymysteries",
        "title": "Add ratings and warnings to show descriptions",
        "content": "When you open a film on Netflix, it counts as a hit, or view. If you look at the rating at the start of the show and decide not to watch the video and close it before the opening credits finish running, you've still technically watched the movie: by opening the movie, you generated a view for the movie. This means that if you open a movie and realize it is something you would never watch, you still stated that you watched it by opening it. This information is probably used by Netflix to determine what to add to its catalog, and false data like yours can be used to justify posting more movies you don't want to watch. \n\nIf Netflix included ratings and warning in the descriptions of their shows, we could decide whether to watch a show based on this information without opening the video. If the rating and warning make us concerned and we decide not to watch the show, we won't generate false data by opening the video. This could reduce the amount of false data used in determining Netflix content. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1msomee/add_ratings_and_warnings_to_show_descriptions/"
    },
    {
        "id": "1msrwxq",
        "author": "roydodger3",
        "title": "Update now on Apple TV",
        "content": "So I saw and experience the update menu on my ps5 and I say to myself I hope this update doesn’t come to the Apple TV. And you know what it happened, browsing the new menu was kinda annoying only seeing 4 movies in the category is something I can’t get used to it. Maybe someday Netflix will make an option to go back the old design.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msrwxq/update_now_on_apple_tv/"
    },
    {
        "id": "1msjeo9",
        "author": "akagiaa",
        "title": "Lucifer",
        "content": "I m thinking of watching Lucifer, but is it worth watching? Don't spoil the show, tho. The Imdb rate is 8, but I heard it's kinda boring . In every episodes there is a new case, and at the end, with the help of lucifer, it gets solved that's it. Idk, tho. What do you guys have to say about it?",
        "upvotes": 1,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1msjeo9/lucifer/"
    },
    {
        "id": "1ms051n",
        "author": "niloufaeri",
        "title": "about echoes of survivors, ep1-2",
        "content": "i watched the first two episodes and it was gut wrenching. i am horrified this happened and i am utterly sad and outraged for the victims. i had absolutely no idea about this tragedy and i feel like more people should know about it. i mean there is barely any discussions or documentary about such horrific event. we should talk about this more, if there is any way the victims must know that the world has heard them and that we stand by them. has anyone here watched it too? and had you already heard about this case before ?",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ms051n/about_echoes_of_survivors_ep12/"
    },
    {
        "id": "1msgxg3",
        "author": "Southern-Brother5693",
        "title": "New Layout - Suddenly the rows are so boring",
        "content": "Something I noticed when using Netflix on my Sony Bravia TV. Previously, i used to get different rows of recommendations like \"Asia Movies, Get With Action, Documentaries\" but now for the past week I am only getting the same tired rows like \"Gems for you, Catch up with unwatched episodes.\"\n\nThis only happens on my TV. My Phone and PC still have the different variety of rows. Anyone here facing the same issue?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1msgxg3/new_layout_suddenly_the_rows_are_so_boring/"
    },
    {
        "id": "1ms2iuh",
        "author": "ryanbuckner",
        "title": "Why isn't anyone ever around in public in Animal Kingdom",
        "content": "Oceanside, CA has a population of 170,000 people. Why isn't there ever anyone outside in the daylight while these crimes are being committed?  On the beach on the Strand, middle of the day.. .nobody.",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ms2iuh/why_isnt_anyone_ever_around_in_public_in_animal/"
    },
    {
        "id": "1mrsbex",
        "author": "Et_Crudites",
        "title": "The Residence had more things I hate than in any other show I like overall",
        "content": "Halfway through. It’s a fun mystery. I like Cordelia when she’s being her own take on Sherlock Holmes. It should be great. The problem for me are some parts that are so distractingly awful they ultimately stick with me more than anything else. To wit:\n\n- Birding. I’ve never been more annoyed by a main character’s quirk. Every mention of birding felt forced, and not a single analogy landed. It felt like some writer read that specific birding book Cordelia carries around and got a huge inflated ego about it. I will instantly judge anyone I find out is into birding going forward. That’s not fair to them and it’s The Residence’s fault. \n\n- Two unbelievably bad actors. 1) The Secret Service comic relief guy is painful to watch. I feel second-hand embarrassment when he’s trying to make the Kylie Minogue jokes land. Heinous comedic acting. 2) The Congresswoman who constantly interrupts the proceedings. I initially thought they were going for a caricature of boorish, ignorant politicians, but now it seems like she was supposed to be playing some kind of champion of skepticism, challenging the establishment? Either way she comes off like she read the script immediately before each take, took a shot, did her lines, then did them again after the director told her to lay on the sarcasm even more thick. Truly awful. \n\nSnark - These writers cannot do snark. They think they can and that makes it worse. I almost turned it off for good in the office scene when the slimy friend of the president tells Cordelia “This is bigger than you” and her response is “Do you mean the house is bigger than me, because, like, duh, I’m inside the house!” \n\nI’m sorry, I had to get this out of my system. Normally any one of those annoyances would be a dealbreaker and I’d happily move on with my life. But I want to see how this ends. And I can’t until I purge my hatred of some do this stuff. ",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mrsbex/the_residence_had_more_things_i_hate_than_in_any/"
    },
    {
        "id": "1mseksi",
        "author": "Creative-Ad-1363",
        "title": "Quantum Leap",
        "content": "I love this series, it's so refreshing. I'm on season 1. It tells really important stories in the most wholesome way. Those of you looking for a family show, this fits the bill.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mseksi/quantum_leap/"
    },
    {
        "id": "1msn9os",
        "author": "03deepu",
        "title": "Netflix subscription cancellation be like “how dare you cancel subscription, we won’t allow that”. Continue paying even if you don’t watch.",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/684bbniq2kjf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1msn9os/netflix_subscription_cancellation_be_like_how/"
    },
    {
        "id": "1msbmg0",
        "author": "Wise-Smile-1965",
        "title": "Strike Back",
        "content": "Can we petition Netflix to get Strike Back’s rights to stream it? I want to binge another crazy show that’s plot is insane. I did Blindspot, I just wrapped up Banshee and now I want Strike Back. Come on Netflix get it done!!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1msbmg0/strike_back/"
    },
    {
        "id": "1mrpjuk",
        "author": "refdeser",
        "title": "The echoes of survivors:Inside Korea’s Tragedies - JMS (ep 3 &amp; 4)",
        "content": "\nMaple is such a strong woman, standing up and seeking justice for the sexual abuse. It takes a lot of courage, especially with JMS followers constantly harassing her. I’m so happy that, at the end of the episode, she finally got her own happy ending.\n\nAs the story unfolds, it’s really shocking to see how the authorities were also involved with JMS and even tried to disrupt the investigation. Salute to the director, despite being threatened by JMS followers, he continued investigating and kept the cameras rolling.",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mrpjuk/the_echoes_of_survivorsinside_koreas_tragedies/"
    },
    {
        "id": "1mrbk7y",
        "author": "AsCrowsFly75",
        "title": "Because You Watched 😡",
        "content": "Is there any possible way to change the layout on Netflix? The current interface is so annoying. While they’re at it, please for the love of all that’s good, label a film or series as international so people can decide if that’s what they want or not. I have so many ‘Resume Watching’ shows that I bailed on because it was foreign with shitty voice-overs. ",
        "upvotes": 87,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1mrbk7y/because_you_watched/"
    },
    {
        "id": "1msme08",
        "author": "BlundeRuss",
        "title": "Obese people on “Fit for TV: The Reality of the Biggest Loser” complaining that the show caused them to still be fat 20 years later is ridiculous",
        "content": "Like, take some responsibility. Ok, the show didn’t teach you healthy and sustainable ways to keep the weight off, but you’re grown adults. Maybe do some reading about healthy habits, it’s really not complicated. Having a very obese guy sit there and say “I’m the proof it doesn’t work” is so stupid. The show did not make you eat a box of donuts every day since you stopped appearing on it two decades ago. The show did not permanently prevent you from educating yourself on how to look after your health. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1msme08/obese_people_on_fit_for_tv_the_reality_of_the/"
    },
    {
        "id": "1ms6lsw",
        "author": "Silent_Sign6437",
        "title": "Building the Band: An opinion on 3quency style",
        "content": "Ok, it’s totally ok to have your own style, but if it’s not a good one: please stop, it’s only a distraction from the unique talents you possess (in regards to the girl with the neon face paint). That’s it. Everything else was awesome! They were giving Destiny’s Child vibes with a flair!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ms6lsw/building_the_band_an_opinion_on_3quency_style/"
    },
    {
        "id": "1mrfzcw",
        "author": "Affectionate_Sky9090",
        "title": "Is JOELLE from the biggest loser on reddit? (Netflix documentary)",
        "content": "I just want her to see that I have so much love and appreciation for her.\nWhat an absolutely beautiful woman that didn't deserve all that horrid nastiness!",
        "upvotes": 30,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1mrfzcw/is_joelle_from_the_biggest_loser_on_reddit/"
    },
    {
        "id": "1ms55m5",
        "author": "Traditional_pipe_69",
        "title": "Netflix subscription",
        "content": "I’m in the army and looking to get an account after a year of not having it, will I be able to use this account at my house but also on base? As I don’t wanna buy a subscription and only be able to use it when I’m at home or only in my spare time on the weekday ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ms55m5/netflix_subscription/"
    },
    {
        "id": "1mr7us0",
        "author": "satan_69-",
        "title": "We need to talk about The Echoes of Survivors",
        "content": "I am writing this to boost this tv serie, hoping at least the victims perhaps will receive some peace. People needs to know what happened to them, and internet has to talk about it!!!\n\nThis case blow my mind. Never heard about it before. Did a quick research. It is still 80% unknown, mainly the details of it. My heart aches for the victims that grew up being dead inside. I wonder, why this case is not talked enough??",
        "upvotes": 60,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7us0/we_need_to_talk_about_the_echoes_of_survivors/"
    },
    {
        "id": "1ms1t30",
        "author": "thatdude101010",
        "title": "Is there a way to filter?",
        "content": "Why isn’t there a way to filter out certain recommendations? I don’t want to see a bunch of foreign films like Bollywood movies. As much I as I want to easily see 30 min comedy shows, I want to be able to filter. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ms1t30/is_there_a_way_to_filter/"
    },
    {
        "id": "1mrx992",
        "author": "Fast_Blacksmith_7790",
        "title": "I’m looking for some thriller shows with a close-knit friend group.",
        "content": "Hi guys! I’m hoping to find some thriller or horror shows where the main characters are a friend group. I’m looking for a show that’s got some real spooky and suspenseful stuff but also a comforting vibe because of their close bond. The crazy twists are a must and I’d love it if it had a happy ending.\n\nThanks to anybody who responds!!\n",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mrx992/im_looking_for_some_thriller_shows_with_a/"
    },
    {
        "id": "1mra6eo",
        "author": "ShacklesOfLanguage",
        "title": "Netflix no longer allows sign in on desktop away from home?",
        "content": "Has anyone else experienced this problem?\n\nMy family has a second home, we haven’t been able to log into Netflix on the Roku since they stopped allowing sharing. That’s no surprise.\n\nWhat I can’t believe is now I tried to use it on my phone on the WiFi and that was blocked\n\nThen I tried my laptop and that was blocked\n\nAnd then I tried a DESKTOP and that was blocked\n\nThey’ve completely removed the ability for me to use it anywhere outside my home. I “get” blocking tvs, but desktops and phones make no sense and I do not understand. \n\nAnyone else have this problem?\n\n",
        "upvotes": 25,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1mra6eo/netflix_no_longer_allows_sign_in_on_desktop_away/"
    },
    {
        "id": "1mqlr42",
        "author": "BlackDoom_26",
        "title": "What is the most underrated show you have found on Netflix?",
        "content": "Sometimes I stumble upon a show I have never heard of before and end up loving it way more than I expected. I am curious if anyone else has had this experience. What is the most underrated show you have discovered on Netflix that more people should watch?",
        "upvotes": 634,
        "comments": 1305,
        "media": null,
        "permalink": "/r/netflix/comments/1mqlr42/what_is_the_most_underrated_show_you_have_found/"
    }
]