[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h9e4ln",
        "author": "IAmPookieHearMeRoar",
        "title": "Netflix Sued Over Jake Paul-Mike Tyson Boxing Match Glitches",
        "content": "",
        "upvotes": 1129,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1h9e4ln/netflix_sued_over_jake_paulmike_tyson_boxing/"
    },
    {
        "id": "1h9yr0b",
        "author": "Backwoodz333",
        "title": "Why does this happen when i try to watch any show?",
        "content": "Everything looks fine in the main menu, preview of the show, and preview when I’m fast forwarding but when i play the show the contrast is way off\n\nWhat’s happening? It says Netflix is updated",
        "upvotes": 38,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1h9yr0b/why_does_this_happen_when_i_try_to_watch_any_show/"
    },
    {
        "id": "1h9mzr7",
        "author": "mrmrln42",
        "title": "Terrible bitrate on Netflix ",
        "content": "Netflix 4k, 3 body problem in 4k, dolby vision+atmos. 2Mbps. NOT MBps...\n\nNetflix 4k, kung fu panda in 4k, dolby vision+atmos, 5Mbps\n\nApple tv plus, for all mankind in 4k, dolby vision+atmos, 30mbps \n\nThere was nothing else going on on the network. I paused several times to confirm and the download speed went away (it's only my phone and pc on the network and neither was doing anything). It says outbound because of the interface I selected, but it's download. I started the show (burst of download for the buffer) and then let it stabilize for 2 minutes. \n\nHow can netflix get away with a 6-15 TIMES WORSE bitrate than apple tv? I knew their bitrate is shitty, but this is crazy bad. Apple tv shows look great, on Netflix I can see color banding and lack of detail from 3m away... Such a shitty service - and that's their highest tier too. It sucks so much that such cool looking content is completely destroyed by a shitty low bitrate streaming service. ",
        "upvotes": 74,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1h9mzr7/terrible_bitrate_on_netflix/"
    },
    {
        "id": "1ha1ay6",
        "author": "Extreme_Homework7936",
        "title": "Tony Hale: “Woman of the Hour isn't an easy watch, but it’s an important one.”",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1ay6/tony_hale_woman_of_the_hour_isnt_an_easy_watch/"
    },
    {
        "id": "1h9qshg",
        "author": "t0m0m0t",
        "title": "Black Bars Keep Changing Size",
        "content": "I just bought a new smart TV, and immediately put the Netflix app on it. Now, while I'm watching movies, the black bars on top and bottom keep changing height. It's really freaking annoying, so I was wondering if this is something that happens often? I have my TV on 'automatic', as in, it will automatically recognise what aspect ratio the media was meant to be shown. I have never had this issue before, so I'm at a loss. Please advice.",
        "upvotes": 26,
        "comments": 37,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3yvk7oi6go5e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1h9qshg/black_bars_keep_changing_size/"
    },
    {
        "id": "1ha53yx",
        "author": "Shhh_Boom",
        "title": "Single's Inferno Season 1 - 2 (Korean Dating Show)",
        "content": "There are some curious things I've observed watching this show. I am very intrigued by it and the intersex dynamics between the contestants. \n\nThe men seem to lack [Single's Inferno Season 1 &amp; 2]&gt;!the aggression to claim their woman and I find it a bit comical but also frustrating at times. The guys lack confidence! They're overly cautious when they approach the women treating them like they're fragile. It's so gentlemanly to a fault. It's just not how things are supposed to be done. Their approach simply gives power to the women. It's so unusual for men to put their fate in the hands of a woman. It's so clumsy and awkward seeing men waiting with bated breath for a woman to pick them.!&lt;\n\nWhen the women experience rejection, it's just excruciating. It's painful to watch because they wear their emotions on their faces and that's just awful. [Single's Inferno Season 2]&gt;!One of the girls was so unfavoured by the men, she broke down in tears because she wasn't being picked. That was painful. I feel like the producers of the show had to step in to intervene as she eventually gets picked by a guy that's a twist entrant in the middle of the show. It's so against the grain of events it's clearly manufactured as the girl may have been contemplating leaving the show.!&lt;\n\nAnother problem that seems to be a societal norm is the [Single's Inferno Season 1 &amp; 2]&gt;!inability to move on. This criticism is levied against both men and women. When they are clearly not their targets favourite, they engage in this self destructive \"I refuse to move on\" thing that's so problematic. It's so twisted! That means that it's an obsession rather than a love interest. This is a critical flaw.!&lt;\n\nOverall the show is great. The women are beautiful and the men are good looking. It's nice seeing how things are done in a conservative society albeit frustrating at times. I do think that the episodes are too long and [Single's Inferno Season 1 &amp; 2]&gt;!I'm not a fan of the physical challenges that earn people first choice rights. I think they made a mistake here and should've gone with a random system instead.!&lt;",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ha53yx/singles_inferno_season_1_2_korean_dating_show/"
    },
    {
        "id": "1h9nu6v",
        "author": "Ok-Fee-5067",
        "title": "Love never lies South Africa (on Netflix) is sooo good ! ",
        "content": "Have you seen it ?! \nThe episodes, the couples, the reunion everything was  great, genuine but also crazy ! \nThe reunion OMG the Lacheys from LIB.. please take note ! The truth was told ! It was crazy ! \nNo spoiler here so go watch it and we can discuss after 🫣",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h9nu6v/love_never_lies_south_africa_on_netflix_is_sooo/"
    },
    {
        "id": "1h9uz7c",
        "author": "Mentally_Soup",
        "title": "Pink and Blue progress bars???",
        "content": "I didn’t know this existed ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h9uz7c/pink_and_blue_progress_bars/"
    },
    {
        "id": "1h9xjz5",
        "author": "Mundane-Midnight-672",
        "title": "Monsters- Menendez Bros cast question",
        "content": "The scene at the beginning where Leslie is talking to the adoption agent- who plays that guy? I could’ve sworn it was the guy who played Buzz on Home Alone. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h9xjz5/monsters_menendez_bros_cast_question/"
    },
    {
        "id": "1ha1fyc",
        "author": "goexuma",
        "title": "Crazy surges in volume",
        "content": "We have had Netflix for at least 5 years and this. Is only happening in the last few months.\nIrregardless of the show we are watching, the volume goes up like crazy on each act that has drama.\nI keep the keyboard on my lap just to control the increase s quicker than the mouse \nIs there any option to keep this from happening.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha1fyc/crazy_surges_in_volume/"
    },
    {
        "id": "1h9py36",
        "author": "sorakawa_94",
        "title": "Recs for light-hearted, cheerful show that has nice, bright cinematics?",
        "content": "Looking for a show to put in the background that I don't have to pay much attention to. \n\nI like the classic sitcoms like The Office, HIMYM, etc but find that the look of a lot of these shows is muted and dreary. Just IRL visuals I guess, but I want something brighter and more saturated. \n\nI took a quick peek at Emily in Paris and it seems to have the look I'm going for, but haven't actually tried the show yet. \n\nAny recommendations would be greatly appreciated. Thank you!!",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1h9py36/recs_for_lighthearted_cheerful_show_that_has_nice/"
    },
    {
        "id": "1h9fol2",
        "author": "PixelVapor",
        "title": "EXCLUSIVE: Richard Gadd may be personally sued as Fiona Harvey Netflix libel case looms",
        "content": "",
        "upvotes": 27,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fol2/exclusive_richard_gadd_may_be_personally_sued_as/"
    },
    {
        "id": "1ha14nc",
        "author": "NightHawk_787",
        "title": "Netflix Canada app Picture in Picture not working on mobile",
        "content": "I've seen all of the stuff about the ad-supported plan not allowing picture-in-picture on mobile, but my family is on the standard HD plan with no ads, and I'm unable to get picture-in-picture working on my phone even though I have all of the permissions granted and picture-in-picture allowed in the settings.\n\nIs there something I'm doing wrong? Or is it my phone itself. I'm on a Samsung Galaxy A15 running the latest available version of Android (Android 14).\n\nNetflix picture-in-picture is working perfectly fine on my account through the mobile app on my old phone, which is an A70 running Android 11.\n\nHow might I troubleshoot this if the problem is something related to my phone?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ha14nc/netflix_canada_app_picture_in_picture_not_working/"
    },
    {
        "id": "1h9vk8d",
        "author": "allyourtv",
        "title": "A pretty good rundown of the best global TV of the year",
        "content": "Not just Netflix shows, although they obviously are the majority of the releases\n\n[https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees](https://www.allyourscreens.com/latest-news/global/2900-the-1st-annual-ays-global-television-awards-the-nominees)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9vk8d/a_pretty_good_rundown_of_the_best_global_tv_of/"
    },
    {
        "id": "1h9k8gu",
        "author": "sandynikola",
        "title": "stuck on net flix",
        "content": "Anyone else having this problem? I am scrolling on shows and go to coming soon. I added first show, No Good Deed, to add to my reminder. Netflix will not let me move around after that. Have to exit Netflix and go back in. Every time I hit No Good Deed, I get stuck again.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9k8gu/stuck_on_net_flix/"
    },
    {
        "id": "1h9yhoq",
        "author": "arma__virumque",
        "title": "Ads for the show during the show",
        "content": "I am watching Black Doves (rave!) and have gotten ads for this show during each episode. Does this happen to you? Bother you? I assume it's mostly common with a new and popular Netflix ™️ show. Still annoying",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9yhoq/ads_for_the_show_during_the_show/"
    },
    {
        "id": "1h8yb9l",
        "author": "yuppieByDay",
        "title": "The auto play after finishing a series is a disease ",
        "content": "So was just finishing The Playlist on Netflix there was a solid 4 minutes left and was setting up the final scene of the show. No credits and still much part of the show. \n\nSuddenly a take over title card for prison break came up while still playing the audio and shortly after went to a trailer for it. And then the first episode of the show \n\nWtf? I excited and picked up where it left off and then it did play til the actual end. But why would they do this? Just so you’re on Netflix more? Super annoying. ",
        "upvotes": 58,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h8yb9l/the_auto_play_after_finishing_a_series_is_a/"
    },
    {
        "id": "1h98021",
        "author": "kschaffs",
        "title": "The Madness: it’s ridiculous and hard to quit ",
        "content": " I’ve only been through the first three episodes and nothing makes sense in reality about the what Muncie does but I gotta know what stupid shit he does next. MF just got backstage,unstopped, on some broadway play staging area in 2024. Straight Ninja. \n\n",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h98021/the_madness_its_ridiculous_and_hard_to_quit/"
    },
    {
        "id": "1h9bhcs",
        "author": "Jazzlike_Assignment2",
        "title": "The Madness",
        "content": "I saw the trailer today and decided to watch it because I mess with the limited series. I love the actors, but the plot is so out of the place. I don’t understand the rollercoaster I was on, but I felt like there was too much going on. What did yall think? Also I hated what happened to quinones (i understand why by assumption but still felt like there wasn’t enough context). ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h9bhcs/the_madness/"
    },
    {
        "id": "1h9iqp6",
        "author": "Kebabkrabbe",
        "title": "Netflix bugging around",
        "content": "Tried to get my grandma netflix on her TV but its always lagging, halting and even throwing her out. We tried to un- and reinstall it but nothing changed. Tried to refresh her netflix household but nothing. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h9iqp6/netflix_bugging_around/"
    },
    {
        "id": "1h9gj8x",
        "author": "n01_b4_flash",
        "title": "Help with finding particular UFO documentary",
        "content": "Hello,\n\nAt one point in time, there was a low budget, independent documentary that had to do with so called \"alien crash and retrieval.\" It was available on NetFlix when it used to be a DVD rental service. This was about supposed ET craft with the \"Men in Black\" taking over and intimidating the witnesses at the crash site.\n\nI remember seeing it one day but I don't remember the name and would like to see it again but have no idea what title search for lol\nAnyone can help??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9gj8x/help_with_finding_particular_ufo_documentary/"
    },
    {
        "id": "1h92q7i",
        "author": "gamersunite1991",
        "title": "American Primeval Cast and Director Discuss the Western Series’ Cultural Influences",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h92q7i/american_primeval_cast_and_director_discuss_the/"
    },
    {
        "id": "1h9f87m",
        "author": "xXShalkurXx",
        "title": "Has anyone had this happen??",
        "content": "Hi! Family account owner here. My family and I share a account and recently it deleted itself randomly out of nowhere? Looking into the information layout to us more, we recently payed the fee for our account so we did NOT delete it ourselves, we contacted support but does anyone else know or have had this problem before???",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9f87m/has_anyone_had_this_happen/"
    },
    {
        "id": "1h9sz3a",
        "author": "Fancy-Commercial2701",
        "title": "Taking calls from her daughter? Wtf???",
        "content": "Just started watching the show last night and liked it. Seemed to be well written and acted and heading in an interesting direction. And then this scene totally threw me off.\nKeira is hiding from two assassins who just killed someone and are coming up the stairs. And she gets a video call from her daughter! And takes it. And speaks to her daughter for a minute telling her to go to sleep or something.\nFor a show that has pretentions of being a semi-serious spy thriller this was completely ridiculous. \n\n1. Which spy still has their bloody ringer on?\n2. Who takes a call when hiding from assassins? \n3. If you have taken that call, who tf argues with their daughter to get off? Instead of, you know, just disconnecting the call.\n\nI realize these show writers have to now be sensitive to the delicate sensibilities of 5 year olds or whatever, but surely not having your mother take a call or two would be less traumatizing than seeing her brains get blown out on a video call. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h9sz3a/taking_calls_from_her_daughter_wtf/"
    },
    {
        "id": "1h9b1pv",
        "author": "BonelessAir41",
        "title": "shared account with ads",
        "content": "So I have been using my account on my parents netflix in my apartment(s) since I moved out 3-4y) ago. It just now kicked me off due to not being in the same household. Set up a shared account added onto the plan, but now I have ads even though the main subscription is ad free?? Unless I am missing a setting or something that is fucked since I saw nowhere where it said ads would be on. Would have just made a fresh account.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9b1pv/shared_account_with_ads/"
    },
    {
        "id": "1h9dazo",
        "author": "Newtothis_leavemebe",
        "title": "Subservience ",
        "content": "That one scene with Megan Fox. You know the one. Wow. \n\nanyway this movie was better than I thought it would be. megan played a really good AI robot. What did yall think?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9dazo/subservience/"
    },
    {
        "id": "1h94sh9",
        "author": "generic_username-92",
        "title": "Woman of the hour ",
        "content": "i know this is a shot in the dark, but does anyone know when woman of the hour will premiere in netflix Egypt? I could have sworn i saw it but then suddenly it disappeared. \n\nIs there a website where I can find out when movies or series are coming to netflix? \n\nThank you! ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h94sh9/woman_of_the_hour/"
    },
    {
        "id": "1h9krwp",
        "author": "shaalalalan",
        "title": "What should I do?",
        "content": "Need help",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1h9krwp/what_should_i_do/"
    },
    {
        "id": "1h9ceuk",
        "author": "laurendharma",
        "title": "Name of Series Help - Maybe 2020-2024 - About a Female Middle Eastern Assassin. Her Reference Name was \" A Jinn\" or ' A Book of Jinns\"...",
        "content": "Hello, Netflix or Hulu Series Help Question. \n\nHello can anyone help me with the name of a Hulu/Netflix/Prime Series Name. \n\nThere was a Series i watched last year.\nA female middle eastern woman trying desperately to save her child,but also known to be a top \"Assassin\" in her country. The woman was refered to as a \"8th\" Jinn or a ???¿ Jinn had a favorite \"book of Jinns\". \n\n She was given The reference from a book she loved a child. Or a book her father or grandfather read to her. ( they visit this person on a cemetery). \n\nThere was a British or French MI6 or Intelligence woman attempting to gain her trust.   Was acting as a friend but really wanted to turn her over to the government,bcshe was a \"known Assassin\". \n\nThey traveled from European country to country in hiding. And fighting....but caring about each other. And sharing life experiences. About their kids, and lovers and families. \n\nThere was a secret message written on the inside of a car that could only been seen by breathing hot 🔥 breath onthe windows.\n\nShe was known to be killed in the end but most likely secretly got away.\n\nI loved this series and wanted to share with friends and family. Or see if there was a 2nde.\n\nI meant / mean no disrespect with this post. I am just looking for thr name of the series.\nI thought it was based around a \"Book of Jinns\" or the female being referred to as a \"Jinn\". Google was no help.\n\nThank you. \n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h9ceuk/name_of_series_help_maybe_20202024_about_a_female/"
    },
    {
        "id": "1h9fg9s",
        "author": "daddyvow",
        "title": "Where is the trivia verse?? ",
        "content": "Where did trivia go?\n\nI’m trying to find trivia verse and it doesn’t show up??? I’m\nTrying the open it up and it’s not shaking up at all. Where is the trivia??? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fg9s/where_is_the_trivia_verse/"
    }
]