[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1k7w7a9",
        "author": "ChardTechnical5834",
        "title": "Ci siamo rotti le gonadi",
        "content": "Abbiamo bisogno di qualche gentil anima che domani sera 26/4  avesse voglia di venire alla serata anni 90 al locale Hiroshima Mon amour con me (M20) e il mio fedele collega (M19), in quanto Cuneo è una città orribile e la trap fa schifo. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k7w7a9/ci_siamo_rotti_le_gonadi/"
    },
    {
        "id": "1k7rg2g",
        "author": "Evening-Bug-836",
        "title": "Cerco socio esperto in automazioni – Torino",
        "content": "Ciao a tutti!\n\nSto cercando un socio con esperienza nella **costruzione di automazioni personalizzate**, sia con strumenti come **Make, Zapier, n8n**, sia con soluzioni scritte **da zero in codice**.\n\nL'obiettivo è creare un servizio che **aiuti le aziende a migliorare l'efficienza dei loro processi**.\n\nVivo a **Torino**, quindi sarebbe ideale trovare qualcuno della zona o comunque disponibile a vedersi **anche dal vivo**, oltre al lavoro da remoto.\n\nCerco qualcuno che:\n\n* Sia pratico nella creazione di automazioni custom\n* Abbia interesse a costruire un progetto da zero\n* Sia disponibile a lavorare in team e affrontare insieme le prime fasi di sviluppo\n\nSe ti interessa o vuoi saperne di più, **scrivimi in privato!**\n\n(E se conosci qualcuno che potrebbe essere interessato, **gira pure il post!**)",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k7rg2g/cerco_socio_esperto_in_automazioni_torino/"
    },
    {
        "id": "1k7nra1",
        "author": "shibarama",
        "title": "How to get into the city from Caselle airport?",
        "content": "Ciao a tutti! I'm arriving into Torino this Sunday. I will stay for two months and I'm looking for the best option to move from the airport to the B&amp;B Hotel in Orbassano. I'm bringing with me two pieces of luggage, so I would like to know if a cab is the best option, or if there are services like Uber/Didi in the region.\n\nThanks for your help!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1k7nra1/how_to_get_into_the_city_from_caselle_airport/"
    },
    {
        "id": "1k7ndso",
        "author": "Academic-Win-1871",
        "title": "Negozio bici usate a torino",
        "content": "Ciao! Come da titolo cerco negozio di bici. Notizie e suggerimenti?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1k7ndso/negozio_bici_usate_a_torino/"
    },
    {
        "id": "1k7iaji",
        "author": "James_Lovell",
        "title": "Che fine ha fatto il sushi Origami in piazza Vittorio?",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k7iaji/che_fine_ha_fatto_il_sushi_origami_in_piazza/"
    },
    {
        "id": "1k7hubi",
        "author": "tomaz-suller",
        "title": "Ladri a Lucento (specificamente Via Forli)?",
        "content": "Dei maranza mi hanno rubato il telefono mentre ero in treno verso Milano (dove vivo) e un giorno dopo l'hanno portato a Piazza della Repubblica a Torino. Non sono sicuro di che cos'e' sucesso ma alla fine e' rimasto nei utlimi tre giorni sempre intorno la stessa posizione, a Via Forli' circa civico 116, Lucento. Controllando immagini di satelite si capita che sia una brutta zona, con dei edifici chiaramente abbandonati, oltre um terreno vuoto e un cantiere di Iren.\n\nSapete qualcosa della zona? Ho gia' provato chiamare la polizia parecchie volte ma dicono sempre che non possono fare niente. Ieri sera un amico e' andato alla Polizia di Stato li vicino e l'hanno detto che, anche se trovavano i tipi, non potevano fermare nessuno in strada, molto meno entrare in una proprieta' privata.",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1k7hubi/ladri_a_lucento_specificamente_via_forli/"
    },
    {
        "id": "1k7nvvj",
        "author": "Simple_Masterpiece97",
        "title": "Appartamento per studenti a Torino",
        "content": "Ciao, dovrei venire a studiare ingegneria matematica al poli e vorrei sapere se ci sono delle zone dove cercare appartamenti migliori di altre",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k7nvvj/appartamento_per_studenti_a_torino/"
    },
    {
        "id": "1k7lz5x",
        "author": "Many_Address_6474",
        "title": "Decent barber for long hairs in Torino",
        "content": "Hello everyone,\nI'm looking for an experienced barber/stylist for medium to long hair in Torino, I don't want the default fades or shadow fades that almost every barber is doing nowadays.\nPlease recommend me some",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1k7lz5x/decent_barber_for_long_hairs_in_torino/"
    },
    {
        "id": "1k6vmlx",
        "author": "Worldly_Shoulder_868",
        "title": "Città italiana dove svolgere stage",
        "content": "Ciao a tutti,\n\nChiedo per chi vive a Torino, Bologna, Roma ed Assago, come si trovano a vivere in queste città. L'ideale sarebbe conoscere l'opinione di persone che sì sono traferite in questi posti per lavoro, perché  sto valutando di lasciare la Sardegna per iniziare la mia esperienza lavorativa in una città di medie-grandi dimensioni. Nel mio caso sarebbe uno stage, ben consapevole che da solo come stipendio non basterebbe, ma mi interessa sapere solamente la vostra opinione sulla città, PRO e CONTRO.\n\nGrazie!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1k6vmlx/città_italiana_dove_svolgere_stage/"
    },
    {
        "id": "1k75167",
        "author": "GoodItalianPoet",
        "title": "Cerco nuove amiche con cui parlare",
        "content": "Ciao! Sono un ragazzo di 19 anni, frequento il primo anno di università e studio lingue. Ultimamente mi sento un po’ solo e mi piacerebbe fare nuove amicizie, soprattutto con ragazze. So che può sembrare strano, ma mi viene più naturale parlare e condividere esperienze di vita con loro.\n\nSono un tipo riflessivo, scrivo racconti e poesie, leggo Seneca, ho una mia filosofia spirituale un po’ fuori dal comune, ma mi piacciono anche le chiacchiere leggere, i meme, la cucina e i videogiochi. Cerco un’amicizia vera, anche solo per parlare ogni tanto e sentirmi un po’ meno solo. Non cerco necessariamente qualcosa di romantico, solo un legame sincero.\n\nSe le cose andranno bene potremmo vederci anche dal vivo, ma va benissimo anche una conoscenza online! Scrivimi se ti va di fare due chiacchiere!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1k75167/cerco_nuove_amiche_con_cui_parlare/"
    },
    {
        "id": "1k6tskd",
        "author": "sbrodolino_21",
        "title": "Bonghi al Valentino",
        "content": "Perché c'è gente che continuamente suona bonghi sempre nello stesso posto al Valentino?\nSono autorizzati?\nÈ molto fastidioso quando uno vuole rilassarsi al parco e invece si becca ore di rumore.",
        "upvotes": 0,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1k6tskd/bonghi_al_valentino/"
    },
    {
        "id": "1k6xk1z",
        "author": "Thecrazypacifist",
        "title": "Tutti possono vivere tranquillamente a Torino che avessero un lavoro part--time.",
        "content": "**EDIT: Ho fatto un errore, volevo dire FULL-TIME.**\n\nAllora, assumiamo che sei una persona giovane, con un lavoro full-time, come un cameriere per esempio. Un cameriere guadagna normalmente circa 1100 a Torino. Questo secondo me è abbastanza per una vita comoda. Questo è un budget per farvi vedere:\n\nPrima dobbiamo risparmiare almeno 10%, quindi abbiamo 1000 per spendere.\n\n450 euro per l'affitto, per vivere in un bilocale con un partner o in un trilocale con un amico. Se vivi con il tuo partner potresti spendere anche 350 - 400 o meno.\n\n50 per le bollette.\n\n200 per cibo, facendo la spesa nei mercati e mangiare sana. Io ho una dieta vegetariana sanissima, e spendo meno di 150 euro al mese.\n\n30 per il trasporto publico.\n\n50 euro per internet e abbonamenti. 15 per il tuo cellulare, 12 per Wi-Fi, 10 per Spotify e 14 per Netflix.\n\n100 per uscire con gli amici, mangiare fuori di casa ecc. Andare a mangiare una pizza una volta alla settimana costerebbe tipo 10, colazione in caffetteria carina costerebbe 3, e una cena romantica ogni mese, verso 50 euro.\n\n100 per altre spese tipo vestiti.\n\nIn totale, 980 al mese.\n\nQuindi non capisco perché dicono che riescono a vivere con i salari bassi! E avevo scelto un salario basissimo, la maggior parte delle persone guadagna più di un cameriere.",
        "upvotes": 0,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1k6xk1z/tutti_possono_vivere_tranquillamente_a_torino_che/"
    },
    {
        "id": "1k62is9",
        "author": "Firm_Love_2325",
        "title": "Costo della vita",
        "content": "Ciao a tutti.\n\nCome si vive a Torino con uno stipendio di 1900/1950? \n\nParlo di uomo ( anni 30) che vive solo e dispone di auto",
        "upvotes": 6,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1k62is9/costo_della_vita/"
    },
    {
        "id": "1k6660v",
        "author": "astroares",
        "title": "torino in giornata",
        "content": "questo sabato vorremmo fare una gita in giornata a torino; guardando online ho individuato queste possibili tappe:\n\nPARTENZA: Torino Porta Nuova\nAndare verso Piazza Castello passando per Piazza San Carlo\nChiese gemelle Santa Cristina (8:00-12:45 / 15:00-19:00) e San Carlo Borromeo (9:00-13:00)\nFarmacia del Cambio → bar famoso per le colazioni e le brioche a forma di cubo\nPiazza Castello\nPalazzo Reale con Armeria Reale (9:00-19:00), 15,00€\nPalazzo Madama (10:00-18:00), 10,00€\nMole Antonelliana (9:00-19:00), salita in cima con ascensore 9.00€\nDuomo di Torino (7:00-12:30 / 15:00-19:00)\nin via San Domenico c’è il Museo della Sindone (9:00-12:00 / 15:00-19:00), 6,00€\n\nARRIVO: Piazza Vittorio Veneto\n\navrei bisogno di sapere alcune cose aggiuntive:\n\n1. un parco dove potersi rilassare il pomeriggio (ho visto che purtroppo il parco valentino è chiuso fino al 2026)\n2. due ristoranti dove mangiare a pranzo e a cena (vicino a piazza vittorio veneto). sarebbe meglio dei ristoranti dove si possono trovare alternative plant based/senza carboidrati (tipo un secondo)\n3. mi piacerebbe passare dalla libreria luxembourg, in che zona è?\n4. quale percorso è più efficiente?\n\ngrazie!\n",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1k6660v/torino_in_giornata/"
    },
    {
        "id": "1k68ur9",
        "author": "Pasta-al-Ragu",
        "title": "gymbro 'McFit Politecnico'?",
        "content": "obiettivo diventare enormi ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1k68ur9/gymbro_mcfit_politecnico/"
    },
    {
        "id": "1k62s8m",
        "author": "Richgardonel",
        "title": "Sono arrivato a Toronto oggi e ho prenotato un hotel",
        "content": "Buonasera tutte \nHo elencato alcuni bei posti da visitare. Ora sono vicino alla stazione di Porta Nuova.\nBy the way I don't speak Italian (bene)😁",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1k62s8m/sono_arrivato_a_toronto_oggi_e_ho_prenotato_un/"
    },
    {
        "id": "1k65dj6",
        "author": "Nopesas",
        "title": "Amici crossdresser",
        "content": "Ciao sono un ragazzo di 19 anni e mi piacerebbe fare amicizia con qualche crossdresser della mia età o anche un po' più grande",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1k65dj6/amici_crossdresser/"
    },
    {
        "id": "1k5ikye",
        "author": "CryingAlwaysCrying",
        "title": "Ma quanto costa un taxi a Torino?!",
        "content": "Scusate lo sfogo, ma com’è possibile che Taxi Torino costino così tanto?!\n\nIl trasporto (GTT) è praticamente inesistente: corse cancellate, ritardi infiniti, mezzi fatiscenti e inaccessibili. Quindi proviamo a prendere un taxi… e ci troviamo davanti a tariffe da capogiro. Ma è normale pagare così tanto per pochi chilometri? 20 EUR per andare 10 min?\n\nSeriamente, sembra che se non hai l’auto sei fregato in questa città.\n\nPazzesco\n",
        "upvotes": 54,
        "comments": 67,
        "media": null,
        "permalink": "/r/torino/comments/1k5ikye/ma_quanto_costa_un_taxi_a_torino/"
    },
    {
        "id": "1k5yk3s",
        "author": "Waste-Knowledge-8853",
        "title": "lavori estivi?",
        "content": "Dove trovare lavori estivi a Torino se non si ha esperienza? ,sto mandando vari CV ai centri estivi per fare animazione ma non saprei dove altro mandarli .\nTra l’altro qualcuno ha mai fatto animatore/trice presso gli Estate ragazzi della città di Torino?come vi siete trovati ?\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1k5yk3s/lavori_estivi/"
    },
    {
        "id": "1k5rgjs",
        "author": "Ph4edra",
        "title": "Palestre accettabili a Torino?",
        "content": "tldr; Cerco una palestra con l'obiettivo di continuare bodybuilding quest'estate, Consigli?\n\nNon vivo più a Torino da 2 anni ormai. Quando ci vivevo ho praticato diversi sport ma non sono mai andati in palestra ad alzare pesi/bodybuilding. Fino a circa 2 anni fa non ho mai messo piede in una palestra in città con l'obiettivo di fare bodybuilding. Controllando su google maps tutte le palestre sembrano una merda senza attrezzatura, piccole, e abbonamenti truffa.\nSono di passaggio quest'estate per 3 mesi e avrei bisogno di trovare una palestra decente in centro a Torino. Qualcuno ha consigli?\nPer ora l'unica palestra che effettivamente non era un buco con 3 bilancieri era la McFit che però a quanto pare dalle recensioni è sempre affollata, e disdire l'abbonamento a quanto pare è impossibile un po' alla planet fitness negli Stati Uniti. Insomma una merda, però non costa niente quindi mal che vada.\nVi ringrazio in anticipo per i vostri consigli\n\nPS: È anche da 2 anni che parlo solo inglese tutti i giorni e mi sto dimenticando l'Italiano, scusatemi se questo post è super disorganizzato. Sto faticando a scrivere questo post con un Italiano che si capisca",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1k5rgjs/palestre_accettabili_a_torino/"
    },
    {
        "id": "1k5t59n",
        "author": "devilishyessine",
        "title": "Activities to do in Torino?",
        "content": "Hi everyone,I will be visiting Torino soon and I'd love to know your favorite free activites to do there ,I'd also like to know some authentic restaurants that aren't expensive and not a tourist scam that offer pizzas and tiramisus as well as coffees offering great expressos .\nThanks in advance !",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1k5t59n/activities_to_do_in_torino/"
    },
    {
        "id": "1k587vc",
        "author": "BattiPesce",
        "title": "Negozio Leggero. Perché costa così tanto?",
        "content": "Sono andato a comprare un po' di cose secche al Negozio Leggero, e mi sono sorpreso nel notare che i prodotti costino molto più di quelli confezionati.  \nCome mai? L'assenza di confezionamento non dovrebbe diminuire il costo di produzione?",
        "upvotes": 26,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1k587vc/negozio_leggero_perché_costa_così_tanto/"
    },
    {
        "id": "1k5dfiv",
        "author": "Aromatic_Ad_7315",
        "title": "Secondo voi dove dovrebbe passare i prolungamenti delle metro o nuove linee metro",
        "content": "",
        "upvotes": 4,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1k5dfiv/secondo_voi_dove_dovrebbe_passare_i_prolungamenti/"
    },
    {
        "id": "1k5avgg",
        "author": "LIB8RATO",
        "title": "Negozi di antiquariato",
        "content": "Ciao a tutti. Hai avuto qualche buona esperienza e puoi consigliare un negozio di antiquariato decente? Per favore condividi i tuoi pensieri. Grazie.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1k5avgg/negozi_di_antiquariato/"
    },
    {
        "id": "1k57e1c",
        "author": "Simple_Masterpiece97",
        "title": "Doppia Lauera al Polito",
        "content": "Sono uno studente triennale di informatica all'unipi e vorrei iscrivermi al corso di doppia laurea crypTO. Tuttavia non penso di avere alcuni requisiti (mi mancano probabilmente CFU nel gruppi MAT/\\*). Da quanto ho capito il corso è ingegneria matematica con eventuale doppia laurea in ingegneria informatica. Ma è possibile fare il contrario? Ovvero partire da ingegneria informatica e passare dopo a matematica? Perchè nel caso potrei coprire i requisiti di ingresso durante la magistrale direttamente",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1k57e1c/doppia_lauera_al_polito/"
    },
    {
        "id": "1k4kece",
        "author": "CryingAlwaysCrying",
        "title": "Vivere fuori Torino – stanchi del cemento e del parcheggio impossibile",
        "content": "Ciao a tutti!\n\nViviamo a Borgo Vittoria e stiamo pensando seriamente di trasferirci fuori Torino. Siamo stanchi di essere circondati dal cemento e ogni giorno dover lottare per trovare parcheggio 😵‍💫\n\nCi piacerebbe un posto più tranquillo, con un po’ di verde intorno, ma comunque ben collegato alla città con la macchina. Abbiamo pensato a posti come **Rivoli**, **Chivasso**, ma siamo aperti a suggerimenti.\n\n* Qualcuno vive lì o in zone simili? \n* Com’è la vita? Servizi, tranquillità, natura, collegamenti con Torino?\n\nOgni consiglio è super benvenuto 🙏 grazie!",
        "upvotes": 18,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1k4kece/vivere_fuori_torino_stanchi_del_cemento_e_del/"
    },
    {
        "id": "1k4mjrg",
        "author": "TorineseNonCalabrese",
        "title": "Svuota cantine a Torino",
        "content": "Ciao a tutti, avrei bisogno di uno svuota cantine ma con la possibilità di salvare qualcosa perché non è tutto da buttare, come funzionano quelli gratis? Conoscete o consigliate qualcuno anche a poco prezzo?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1k4mjrg/svuota_cantine_a_torino/"
    },
    {
        "id": "1k4dkdu",
        "author": "devilishyessine",
        "title": "HBKU VS POLITO ?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1k4dkdu/hbku_vs_polito/"
    },
    {
        "id": "1k3zmfj",
        "author": "Buk6",
        "title": "Ho comprato il gioco coop Split fiction per giocare con la mia ragazza ma ci siamo lasciati",
        "content": "Si può giocare solo in due e la condivisione del pass amici è gratuito, se una c'è una ragazza che volesse giocare le mando il link, il gioco è un capolavoro",
        "upvotes": 9,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1k3zmfj/ho_comprato_il_gioco_coop_split_fiction_per/"
    },
    {
        "id": "1k496lt",
        "author": "Loken246",
        "title": "Ciao a tutti! Sono nuovo/a a Torino e volevo chiedervi: qual è secondo voi il posto migliore per comprare tabacco con buoni prezzi e una buona varietà? Qualche tabaccheria consigliata in città o in zona centrale?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1k496lt/ciao_a_tutti_sono_nuovoa_a_torino_e_volevo/"
    }
]