[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 52,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qw0rl1",
        "author": "godfire_dragneel",
        "title": "The Queen's Gambit",
        "content": "Ngl, when this came out, what, 1 or 2 years ago I didn't think it'll be this good. I mean sure, as a chess player myself I thought it'll be interesting but nothing much. I thought it'll be something like, idk, someone inventing the Queen's Gambit and using it against other players and publishing it yada yada yada.\n\nI didn't have high hopes for this. Fortunately, today I took myself to go and watch it. Glad I did.\n\nWhen watching, I genuinely thought that it'll overwhelm it's viewers with chess technicalities but thankfully no. It blends the thrill of playing with personal drama and so all. Chef's kiss, the best way they could've done it.\n\nThe realities of child prodigies and the 'curses' it comes with it was beautiful portrayed as well.\n\nTruly a masterpiece.",
        "upvotes": 107,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qw0rl1/the_queens_gambit/"
    },
    {
        "id": "1qvyp7y",
        "author": "BrandNew84rt",
        "title": "When will Netflix stop suggesting series I saw",
        "content": "Does anyone have any idea why the algorhythm and ai is so bad apart from they want us to scroll through all the content.... My god I cannot appreciate the lack of intelligence in the UI.... and why would I want to 'revisit' a series of 8 seasons three weeks later? I don't have dementia 😂🤓 \n\n ",
        "upvotes": 95,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qvyp7y/when_will_netflix_stop_suggesting_series_i_saw/"
    },
    {
        "id": "1qwguht",
        "author": "cristrawberry",
        "title": "Is Bridgerton Season 4 Basically the Perfect Live-Action Cinderella?",
        "content": "Can we talk about how Bridgerton Season 4 feels like the perfect live-action take on Cinderella?\n\nThe parallels are stunning—fairytale romance, quiet longing, and that signature Bridgerton drama layered on top. Every scene feels cinematic, every moment intentional. It’s classic magic with a modern glow-up, and honestly, some of Bridgerton’s most beautiful storytelling yet.\n\nWhat do you think this season will end with?\n",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qwguht/is_bridgerton_season_4_basically_the_perfect/"
    },
    {
        "id": "1qwr5mk",
        "author": "Prior_Recipe_5999",
        "title": "When Netflix ends up with the canceled cw shows",
        "content": "what do you guys think the odds are that Netflix revives some of the cancelled cw shows cuz historically those always did very well on Netflix that was where most of those shows views came from",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qwr5mk/when_netflix_ends_up_with_the_canceled_cw_shows/"
    },
    {
        "id": "1qvm1df",
        "author": "rubythieves",
        "title": "Lucy Letby - sources ‘digitally anonymised’",
        "content": "I’ve just started watching this documentary and one of the parents who lost their newborn appears as ‘digitally anonymised’ - essentially, an almost perfectly human-like AI figure appears on screen and tells her story (presumably her voice would have been altered too.)\n\nI find this a little creepy but also interesting for the future of this genre - true crime, documentaries about political resistance or secret organisations etc often need witnesses or sources to appear as dark silhouettes with electronically altered voices. Now they can appear as very realistic AI avatars. Is this a good thing or a bad thing?",
        "upvotes": 232,
        "comments": 198,
        "media": null,
        "permalink": "/r/netflix/comments/1qvm1df/lucy_letby_sources_digitally_anonymised/"
    },
    {
        "id": "1qwqn52",
        "author": "FrostingGrouchy4944",
        "title": "7 seconds tv show",
        "content": "I know it’s not a recent show but i just watched it and it’s so haunting and I’m so sad and mad about how it ended even though realistic it leaves someone feeling sick with injustice. I need to talk to people about it! The ending with Brenton on a bike with the sky and how we finally see him, it’s just so poetic -an amazing director. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qwqn52/7_seconds_tv_show/"
    },
    {
        "id": "1qwn9ap",
        "author": "NaturalCarob1460",
        "title": "Mobile downloads",
        "content": "Is there any way to watch mobile downloads from the phone itself or is it a netflix download thing where it's downloaded on netflix and I can only watch it on netflix?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qwn9ap/mobile_downloads/"
    },
    {
        "id": "1qwlv11",
        "author": "watermelonornot",
        "title": "Need something new to watch",
        "content": "Hi guys, I am in need of a new series. Waiting for the new episodes of bridgerton, good doctor, the rookie, high potential and 911 Nashville. I need something to watch while I eat. 🙈😂 Otherwise University becomes unbearable",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qwlv11/need_something_new_to_watch/"
    },
    {
        "id": "1qweuws",
        "author": "CanningTone19",
        "title": "Why is the series called \"All Her Fault\"?",
        "content": "All Her Fault is a mystery thriller television miniseries for Peacock starring Sarah Snook, Jake Lacy, and Dakota Fanning. Did you notice any metaphors?\n\nI just watched the first season, and I really enjoy it, but why is it called that? Did I miss something?",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qweuws/why_is_the_series_called_all_her_fault/"
    },
    {
        "id": "1qvwr0a",
        "author": "Climbing13",
        "title": "What did you think of The OA?",
        "content": "I’m a sucker for time travel shows so after finishing Dark I was looking for another.\n\nI kinda of want another season of The OA lol. It grabbed me in and I got invested. Ended up finishing it pretty quickly. I enjoyed that not everything was told  right away so there was actual mystery throughout the show. \n\nI feel like a lot of stuff nowadays has no mystery and every scene goes by so fast. I liked that the show didn’t feel rushed, but ended up finishing on a high note with more questions. \n\nA few things were kinda weird , but I think in some ways it’s what made it a great show for me. ",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1qvwr0a/what_did_you_think_of_the_oa/"
    },
    {
        "id": "1qwgqki",
        "author": "_barat_",
        "title": "Is subaccount and child profile on TV possible?",
        "content": "Hi,\n\nLong time ago my brother logged in on my TV and I've created my profile (plus there was a child profile - I don't remember if it was automatic like on Amazon).   \nAfter some time Netflix started to be more aggressive when it comes to account sharing (those animated \"qr codes\" and so on) and I've stopped to use this account.   \nFortunately the Child account was still functional til yesterday when Netflix started to nag that the adult needs to log-in so that the child can continue. \n\nQuestion is - does someone know what will happen when my brother would activate me this subaccount (extra seat or how you call it). When I log-in (as adult then) the child account will start to work again?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qwgqki/is_subaccount_and_child_profile_on_tv_possible/"
    },
    {
        "id": "1qv4k7b",
        "author": "anonRedd",
        "title": "\"A Man on the Inside\" renewed for season 3!",
        "content": "",
        "upvotes": 617,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1qv4k7b/a_man_on_the_inside_renewed_for_season_3/"
    },
    {
        "id": "1qwa130",
        "author": "PotterOneHalf",
        "title": "Sesame Street Missing Episodes",
        "content": "Netflix has only aired five episodes of the newest season of Sesame Street. The PBS Kids app has at least 30. HBO still has the back catalogue, so it’s really weird how this is shaking out. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qwa130/sesame_street_missing_episodes/"
    },
    {
        "id": "1qvnvhc",
        "author": "Resident_Leg_4332",
        "title": "Why are the subtitle options so random?",
        "content": "Im from Belgium and netflix is absolutely terrible here.\n\nI understand that it isnt easy for a streaming service to accommodate for all languages in a tri-lingual country however the dutch part in Belgium is by far the biggest (57% population).\n\nYet for almost all asian shows (mostly anime) the subtitle options are either french or german. The german speaking population is extremely small (0.7% population)\n\nI personally prefer all my subtitles in english and our country has 60% of people speaking english.\n\nI understand that its alot to ask to have dutch subtitles for these shows, but atleast give us the english option for these shows.\n\nWhats the reason they cant just copypaste english subs for these shows?",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qvnvhc/why_are_the_subtitle_options_so_random/"
    },
    {
        "id": "1qw8i30",
        "author": "davidbigboy2",
        "title": "When I try to download on Netflix it just stays a 0%",
        "content": "When I try to download episodes on Netflix they stay a 0% why is this. I know my storage isn't full and I downloaded episodes about 2 weeks ago so why all of a sudden is this happening?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qw8i30/when_i_try_to_download_on_netflix_it_just_stays_a/"
    },
    {
        "id": "1qw82vh",
        "author": "tervro",
        "title": "About music in Cosmic Princess Kaguya",
        "content": "Do you guys think there is actually any AI music in the film? The movie looks incredible and view-worthy either way, but people are saying the remix of Melt uses genAI. What do you think? Is there AI used in any other music from the movie?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qw82vh/about_music_in_cosmic_princess_kaguya/"
    },
    {
        "id": "1qw7akx",
        "author": "stitchandsin",
        "title": "Runaway - Instagram post irk",
        "content": "I am less than an episode into this but I am sooooo irrationally annoyed that the Instagram post was 3 days ago yet the comment was from a week ago? \n\nSurely it would've been more difficult to make it incorrect?! It's actually made me want to turn it off😒",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qw7akx/runaway_instagram_post_irk/"
    },
    {
        "id": "1qwb6on",
        "author": "No-Assistant6369",
        "title": "Netflix is failing me currently...",
        "content": "I am always saddened with netflix cancels something mid watch.  I am more sad when I forget to see if something was finished properly and accidentally watch it to learn it was dropped and never to return.\n\nBut this current issue(s) is not that.\n\nCurrently Netflix is suggesting me all sorts of kdrama, which is fine but I cannot specify that I don't do subtitles and I cannot understand Korean language.  They really need to implement some tailoring to their content.  I like kdrama if it is dubbed well.  I don't do subtitles unless there is no choice and it is a good anime.  At no point do I want French or Spanish stuff being suggested, and at no point do I want children's progamming offered to me unless it is he-man or scooby doo.  Also I don't like the 3D rendered stuff in animation.  AND because the algorithm can't get it's understanding of me, I am getting some terrible suggestions.\n\nThat is bad enough, but now Netflix is suggesting stuff to me as if I have not already watched it.  NONE of my progress(red lines) are working correctly...some are sometimes, but shows I finished a month ago are being suggested to me again...\n\nMan.  I think I miss them DVDs sometimes.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qwb6on/netflix_is_failing_me_currently/"
    },
    {
        "id": "1qvdbav",
        "author": "mohoxpom_",
        "title": "Star Search: Jaïr and Johnny Woo",
        "content": "Singer Jaïr and magician Johnny Wu\\* (misspelled his name in the title) were completely robbed by the judges. This show feels rigged, with real talent getting eliminated way too early because of weird inconsistent judging.\n\nJohnny Wu performed actual magic and genuinely engaged the audience, literally had Chrissy on stage performing unexplainable magic while the other act TJ Salta relied on looks, shock value/theatrics hanging upside down with fire and a card in his mouth which seems like it couldve been completely orchestrated and rigged before the show went live. I feel like the kid Harry Piper had better magic tricks honestly than TJ.\n\nJaïr also had the best energy so far as a singer and felt like a true star, getting the crowd dancing and hyped. Sophie was awesome too but it felt like he was completely robbed.\n\nS1:E5",
        "upvotes": 92,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qvdbav/star_search_jaïr_and_johnny_woo/"
    },
    {
        "id": "1qvjomh",
        "author": "No_Pop7296",
        "title": "The Way Home— Hallmark show that’s actually good. The time travel and family dynamics works. Thoughts?",
        "content": "I also want to know if there’s a S3 and S4 coming? I’m in the middle of S2. I like how they’ve woven the theme of the family roots and lost child.  What’s everyone else’s take?",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qvjomh/the_way_home_hallmark_show_thats_actually_good/"
    },
    {
        "id": "1qv37z7",
        "author": "Next_Rhubarb_5986",
        "title": "if you could bring one show that Netflix canceled which one would you choose?",
        "content": "like if you became the owner of netflix today and you can bring back any one show which one?  \ni would choose raising Dion  cause i am the only person who liked season 2 lol  \nsorry for bad grammar english is my second laguge im trying to  get better ",
        "upvotes": 100,
        "comments": 610,
        "media": null,
        "permalink": "/r/netflix/comments/1qv37z7/if_you_could_bring_one_show_that_netflix_canceled/"
    },
    {
        "id": "1qvrq3u",
        "author": "JSL1992",
        "title": "Extended Pause",
        "content": "Is it possible to extend my pause for a second month? Im not seeing the option in my settings. If not, and I delete my account, if I sign up with the same email will my watch list be revived​",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qvrq3u/extended_pause/"
    },
    {
        "id": "1qvcyf8",
        "author": "royoclarito",
        "title": "Any suggestions?",
        "content": "I love crime-related and mafia shows like The Sopranos, Snowfall, and The Mayor of Kingstown. Even though those shows aren’t on Netflix, I just made a Netflix account and I’m looking for recommendations in the same style. I enjoy stories with intense crime, powerful characters, and complex worlds where loyalty, betrayal, and family play a big role.\n\nNow that I’m on Netflix, I want to know what shows or movies I should watch next if I like gritty dramas with criminal empires and deep character development. I’m especially interested in series that focus on crime bosses, drug trades, gangs, or undercover stories — anything that gives the same kind of tension and world-building as the shows I already love.\n\nCan you suggest crime or mafia-style Netflix titles that would be a good fit for someone who enjoys dark, character-driven stories with moral complexity?",
        "upvotes": 8,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qvcyf8/any_suggestions/"
    },
    {
        "id": "1qvperq",
        "author": "Fabulous_Map_2501",
        "title": "Ozark S4 - Why is Jonah just a regular teenager suddenly.",
        "content": "I'm watching season 4 for the first time, and a couple of things are dissapointing me, one of which being Jonah.\n\nHe's been a top character for ages to me, and after his season 3 ending, I was expecting him to be a vengeful demon this season, but instead he's just playing video games and being annoying. It's obvious that he isn't happy, but I thought he would be outwardly hateful to Wendy and shouting and possibly even violent. Idk if the writers second guessed what it seemed like they had set up, but I want to know other's thoughts.\n\nI'M ONLY ON EPISODE 2 SO NO SPOILERS PLEASE.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qvperq/ozark_s4_why_is_jonah_just_a_regular_teenager/"
    },
    {
        "id": "1quhpzo",
        "author": "itsy_bitsy_seer",
        "title": "Is Bridgerton craze over?",
        "content": "First half of season 4 has dropped but I haven't seen the same fan fare or discussions surrounding it. \nIt hasn't peaked to No. 1 in my area (it's at Number 3).\nIs it the solely about them splitting the season up or a boring Cinderella-esque storyline or fans have moved on? What do you think is going on?\n\nEdited to add:\nI should probably clarify - I loved it, but I didn't find enough discussion related to it. It may just be my algorithm.",
        "upvotes": 199,
        "comments": 198,
        "media": null,
        "permalink": "/r/netflix/comments/1quhpzo/is_bridgerton_craze_over/"
    },
    {
        "id": "1qv95q1",
        "author": "gski4life",
        "title": "Genre/Category change meaning???",
        "content": "For context, there was a sudden movement or motivation to watch former 1st lady Michelle Obama's documentary \"Becoming\" instead of Melania's release.....well I noticed Netflix changed the category from documentary to KIDS???\n\nWhy? \n\nWhat are they tryna dumb down and avoid? Did someone from the WH give them a call? ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qv95q1/genrecategory_change_meaning/"
    },
    {
        "id": "1qvnw1n",
        "author": "SharpBookkeeper932",
        "title": "Short survey for my Master’s thesis about Netflix &amp; personalization – looking for respondents",
        "content": "Hi everyone!\n\nI’m a Master’s student in Marketing working on my dissertation about how people perceive AI‑driven personalization on streaming platforms like Netflix, and how that affects brand loyalty and privacy concerns.\n\nI’m looking for streaming platform users willing to answer a short, anonymous online survey (about 2 minutes). Your responses will be used for academic purposes only and no identifying personal data is collected.\n\nIf you’d like to help, you can access the survey here: [https://forms.gle/WrYjwbCh7CAvkxA86](https://forms.gle/WrYjwbCh7CAvkxA86)\n\nThank you very much for your time and support!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qvnw1n/short_survey_for_my_masters_thesis_about_netflix/"
    },
    {
        "id": "1qv8igo",
        "author": "Stranger-danger341",
        "title": "Noob question",
        "content": "I’ve always family shared our streaming services with each other but I’ve been cut off from Netflix cuz of the sharing rules and whatnot, but I was going to just suck it up and get my own plan.  I rock with an 85” oled Samsung. Is it really that big of a difference between standard and premium or is it just minute.  I’m 40. Kinda out of touch with a lot of technology. Just curious if premium is worth the price or if id just be satisfied with 1080p\n\nThanks! ",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qv8igo/noob_question/"
    }
]