[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 499,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jhmggt",
        "author": "-Xoz-",
        "title": "Adolescence is the best show from Netflix in a long while",
        "content": "My God! This show is so fucked. In mere 4 episodes, the show manages to tackle huge issues like the evil of social media among younger generation, the consequences of it, the legal system of a nation and the family which suffers through it all.\n\nThe cinematography and the music is intense. Check out the soundtrack by Aaron May and David Ridley. Stephen Graham is a mad actor! The other actors have done a great job and the overall production is a beautiful piece of art. They shot entire episodes in a single take! \n\nThe finale of the episode will tug at your heart strings. You can't stop from feeling the dread of the family. Stephen really outside himself in this episode, he better have an Emmy or atleast a nomination. I nearly cried, he portrays the emotion in such a devastating way that you may have to look away. \n\nI found the series highly engrossing. It draws you in and let's you do the work of filling in the gaps as a viewer, really makes you think. Most Netflix shows have been mid for me for the past couple of years, I haven't loved a Netlix show as much as this one in a long while. Do give it a watch.\n",
        "upvotes": 113,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1jhmggt/adolescence_is_the_best_show_from_netflix_in_a/"
    },
    {
        "id": "1jhe1vr",
        "author": "Immediate-Suit-4621",
        "title": "Fell for British Series – What Should I Watch Next?",
        "content": "After watching *Adolescence*, I’m well into British series now. The vibes, the storytelling, the characters, I’m all for it. So, drop me some recs! I’m down for a thriller that keeps me on my toes or a drama that hits right in the feels. As long as it’s a banger, I’m in. Old, new, whatever, just gimme the good stuff. What are your go-to British series?",
        "upvotes": 82,
        "comments": 205,
        "media": null,
        "permalink": "/r/netflix/comments/1jhe1vr/fell_for_british_series_what_should_i_watch_next/"
    },
    {
        "id": "1jhgbda",
        "author": "Yuck_Few",
        "title": "Kim's Convenience",
        "content": "This was one of the best comedy series I've seen in quite some time. I hope all the actors get other acting jobs because they all did an amazing job.\nSanjiv Mehta was my favorite character. He was hilarious \nSucks that it got canceled because It leaves a lot of topics unresolved.\nLike did Janet's photography career ever take off or did Jung and Appa ever resolve their issues. Also, it never really gives a lot of detail as to why they didn't get along in the first place.\n",
        "upvotes": 58,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jhgbda/kims_convenience/"
    },
    {
        "id": "1jhuqk1",
        "author": "Current-Routine2497",
        "title": "How to turn off automatic playing of trailers?",
        "content": "While browsing trailers start playing every time you select a movie. Besides the fact that I hate trailers because they contain spoilers regularly, this also makes the browsing experience very stressful and not chill for me. Is there a way to turn this off?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhuqk1/how_to_turn_off_automatic_playing_of_trailers/"
    },
    {
        "id": "1jhigbf",
        "author": "MysteriousDelay6266",
        "title": "'Little House On the Prairie' Reboot for Netflix begins search for Ingalls Family",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jhigbf/little_house_on_the_prairie_reboot_for_netflix/"
    },
    {
        "id": "1jhp9ug",
        "author": "Just-Phill",
        "title": "Best episode of Adolescence being broken down by the 2 actors Owen Cooper and Erin Doherty",
        "content": "https://youtu.be/F7BRIlYFpPY?si=fSq9gng_6328VWw3\n\n\nCONTAINS SPOILERS** This video of Owen and Erin watching the therapy episode and discussing it is so intriguing I had to share it. This kid, if he wants to keep acting, had such a bright future his talent is through the roof.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhp9ug/best_episode_of_adolescence_being_broken_down_by/"
    },
    {
        "id": "1jhtsr5",
        "author": "Doomguyfazbear",
        "title": "What was this show?",
        "content": "I am pretty sure it was on Netflix unless it was Hulu but it was an anime that was about different ghosts and stuff and it was kind of like Pokemon in a way and it had a little green guy with a girl in an apartment and stuff. It might have been taken off or it might have been Hulu but it was so good.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhtsr5/what_was_this_show/"
    },
    {
        "id": "1jhimsj",
        "author": "SpecialistShort6421",
        "title": "More tornado documentaries centering around stories of survival.",
        "content": "Just finished watching Twister: Caught In The Storm. This was such a great documentary. It centered around stories of survival during the 2011 Joplin, Missouri Tornado. For someone who is fascinated with weather, I wish we had more documentaries like this surrounding stories of survival before, during and after major tornadoes like the 2012 Henryville Indiana Tornado. The Washington Illinois Tornado. The 2011 Super Tornado Outbreak in April. ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jhimsj/more_tornado_documentaries_centering_around/"
    },
    {
        "id": "1jh8pcd",
        "author": "sidroy81",
        "title": "Netflix’s Origin Story: How the Streamer Killed Blockbuster Video, Snagged ‘House of Cards’ From HBO and Changed Hollywood Forever",
        "content": "",
        "upvotes": 17,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jh8pcd/netflixs_origin_story_how_the_streamer_killed/"
    },
    {
        "id": "1jh5kmm",
        "author": "ashleyriot31",
        "title": "Last show you finished in one sitting?",
        "content": "The 8 show. Got recommended because I liked Squid Game but wow this was so much better. I just wanted to watch an episode then go to bed but I ended up finishing the whole thing.",
        "upvotes": 26,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1jh5kmm/last_show_you_finished_in_one_sitting/"
    },
    {
        "id": "1jgt282",
        "author": "Mindless_musings",
        "title": "Episode 3 of Adolescence FLOORED me and I think it will stick with me for a very long time.",
        "content": "The acting, man, the acting was straight up magnificent. What the hell. How can a one hour long episode about a psychiatrist and a 13 yr old boy be so fucking gripping? The back and forth, the one-take, the expressions, the physicality, the _craft._ I gave this episode \na standing ovation in my room because it deserves it and soooo much more. The way both the actress and the child actor did their scenes... I am truly speechless. Their talent is astounding and apparent and so compelling. The range of emotion, the humanity in the twistedness of Jaime, the eventual realisation and coming-to-terms of the psychiatrist, the way the spectrum of Jaime’s character was shown without disarming clarity. \n\nI will never ever forget this episode. I thought the first two were amazing but this one. Goddamn. God fucking damn. Some actors are just meant to be and I hope this boy goes far and I hope him and the actress earn their flowers (I will look them up once I’m done with episode 4 but I just HAD to spew my thoughts out about episode 3 first. The writing, the dialogue, the camerawork, direction, cinematography all are spectacular in their own right but I feel like in such a claustrophobic setting as the third episode, it couldn’t have worked so magically had lesser actors been on the job so just appreciating that aspect here primarily). ",
        "upvotes": 226,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jgt282/episode_3_of_adolescence_floored_me_and_i_think/"
    },
    {
        "id": "1jh3gew",
        "author": "Ester_LoverGirl",
        "title": "Watching Adolescence for the third time",
        "content": "\nAnd I am still surprised that he never call for his mom.\n\nWhy no one is talking about that? Of course we realized why after episode 2.\n\nHe doesn’t trust women and think they are useless and of course, just there to be slave ot whatever these crazy incels think.\n\nBut the first time you watched the show, did you notice this too? Did you find it odd and made you kind of « uncomfortable » that he was screaming for his dad and not his mom?\n\nBecause that is what I was feeling.\nBecause i would reach for my mom is anything like this would happen to me. To feel love and comfort.\nThat would be the « normal » thing to do.\n\nAnd the first time I watch the show I knew something was off with this little guy who never mentioned his mom, not once.",
        "upvotes": 35,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1jh3gew/watching_adolescence_for_the_third_time/"
    },
    {
        "id": "1jht1jo",
        "author": "AdeleDazeem19",
        "title": "Emilia Perez removed from catalogue?",
        "content": "Hi! I'm home sick and wanted to watch Emilia Perez because my curiosity got the best of me, but the search bar says they don't have it! I'm pretty sure it's a Netflix original so it's not a licensing issue...does anyone know if it's been removed? I haven't seen anyone else mention it. Thanks!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jht1jo/emilia_perez_removed_from_catalogue/"
    },
    {
        "id": "1jh3tui",
        "author": "JemJemIsHerName",
        "title": "The Residence is very entertaining!",
        "content": "It gives the vibes of the Knives out/Glass onion “greatest detective ever” stuff. It’s so tongue in cheek about it. They even say in episode 1 they want the guy Daniel Craig plays in the detective movies to investigate. The episodes are named after top nextflix shows/movies (the fall of the house of Usher, Knives out…) and that’s a cute nod. The show is actually really fun and a good mystery. It’s probably not winning Emmy awards but it’s entertaining and a fun watch and I would suggest friends watch it. ",
        "upvotes": 26,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jh3tui/the_residence_is_very_entertaining/"
    },
    {
        "id": "1jh0dyu",
        "author": "bing_bang_bum",
        "title": "Justice for Adolescence Episode 2",
        "content": "Just finished ep 2 so I’m not done yet, but I’ve read the discussions and, don’t get me wrong, I was not in the least bit let down by ep 3. It was a masterpiece. But honestly episode 2 hit me harder. The power the kids had over the adults. The fucking hurt and rage of Jade. The sheer magnitude of having 100+ child actors doing their job effortlessly for a full hour. The CAMERA WORK (a literal seamless transition from ground to drone). The fluctuations between tight, emotional portraits to clinical medium to wide shots. The acting all around from, what…7 leads? It was an absolute masterclass in filmmaking and already is in my top episodes of any TV show, ever. I am completely marveled.",
        "upvotes": 46,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1jh0dyu/justice_for_adolescence_episode_2/"
    },
    {
        "id": "1jhm1x2",
        "author": "TigOlBittiesz",
        "title": "Black summer is so dope can’t believe it was cancelled",
        "content": "This show is fire I can’t believe it died it’s intense as fuck it’s on some 28 days later vibes  heard they let die cause of a nation what a fuckin shame this runs laps around z nation in my opinion and I like it just as much as TWD but it’s when more intense. ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jhm1x2/black_summer_is_so_dope_cant_believe_it_was/"
    },
    {
        "id": "1jhlqus",
        "author": "noideawhowhatwhenhow",
        "title": "Is netflix down today[22/3/25]?",
        "content": "Missing play button. Eposiode was playing just fine just before dinner. \n\nOnly options are: \n- More like this\n- Remind me\n- Credits and more info\n\nAnyone else facing this?\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jhlqus/is_netflix_down_today22325/"
    },
    {
        "id": "1jgwso2",
        "author": "brittan5",
        "title": "Adolescence: Emojis, 80/20, etc.",
        "content": "I guess I’m old —I’ve heard of the incel concept but the show made me feel as if I’ve been living under a rock with the explanation of the emojis, 80/20 interpretation, etc.  \nCan someone explain this in relation to Jamie and the show in general? I know the show didn’t specifically state what he was involved in online, but what was your takeaway or perception? How do you believe this played into Jamie’s belief system or himself and women? ",
        "upvotes": 56,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jgwso2/adolescence_emojis_8020_etc/"
    },
    {
        "id": "1jhke51",
        "author": "Ballerbankomat",
        "title": "Profile name won’t update",
        "content": "I changed my profile name on Netflix, yet the Continue watching tab still show the old name. It’s been two days and it hasn’t updated. When does it update?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhke51/profile_name_wont_update/"
    },
    {
        "id": "1jhjpa4",
        "author": "TrustAffectionate966",
        "title": "Gift Cards Not Redeeming For Basic Plan",
        "content": "I've had the Basic Plan since 2014. Last night, I bought some additional gift cards and tried to load them to my account. I got an error response stating the following:\n\n\"Sorry, gift credits can no longer be used on your current plan.\"\n\nSo now, to be able to redeem the gift cards I bought, I need to cancel my Basic Plan and switch to some other plan. Nowhere do Netflix gift cards say this. Hell, it doesn't even say in their website (or, at least, the terms do not explicitly mention this). I have a couple of questions:\n\n1. Has anyone else encountered this problem?\n2. Can anyone point to me where in Netflix's terms it mentions that their gift cards cannot be redeemed for the Basic Plan?\n\nI am thinking of contacting them sometime next week to see if I can redeem the gift cards into my Basic Plan, but I anticipate pushback from them, so I want to be properly informed in case I either have to adhere to their posted terms or if I have to escalate it within Netflix (or to the FCC).",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jhjpa4/gift_cards_not_redeeming_for_basic_plan/"
    },
    {
        "id": "1jh665m",
        "author": "No_Narwhal9099",
        "title": "Question About The Residence - SPOILER",
        "content": "I have a spoiler question about The Residence on Netflix. I loved the show! But what happened to the calligrapher? Why was he so bad at writing the names? I assumed he must have been drugged, as it seemed AB would have not stood for this guy as the calligrapher if he were usually that bad at his job. Did we find out and I missed it?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jh665m/question_about_the_residence_spoiler/"
    },
    {
        "id": "1jhej07",
        "author": "GryffynSaryador",
        "title": "what firestick is compatible with the ad version of Netflix?",
        "content": "I got gifted the old TV from my dad and wanted to watch some netflix - only to find out the device is outdated and cant be watched with the ad plan of Netflix. Im not gonna upgrade my subscription out of principle and currently looking to buy a Firestick from amazon instead. But where do I see what generation it is and if its compatible with the new netflix subs? I dont want to buy a stick only to run into the same issue...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhej07/what_firestick_is_compatible_with_the_ad_version/"
    },
    {
        "id": "1jh98rn",
        "author": "neonxdragon",
        "title": "Question re: Adolescent. How heavy is it?",
        "content": "Looking for a new show to binge this weekend and Adolescent is being talked about everywhere. \n\nI know the basics on the storyline. How heavy is it? Is it triggering for those that have gone through similar things IRL?\n\nContext without going too dark: my highschool boyfriend of almost 3 years was tragically murdered some years ago. And my other ex bf that I dated before him brutally murdered someone a few months ago.",
        "upvotes": 3,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jh98rn/question_re_adolescent_how_heavy_is_it/"
    },
    {
        "id": "1jh8w84",
        "author": "S4v1r1enCh0r4k",
        "title": "'One Piece' Is Back on April 12 with Egghead Arc Part 2, Special recap episode will air on April 5",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jh8w84/one_piece_is_back_on_april_12_with_egghead_arc/"
    },
    {
        "id": "1jhdqw9",
        "author": "Mothman164",
        "title": "Netflix and other streaming apps cant run on 1080p",
        "content": "I have Netflix, HBO, Disney+, Apple TV and Amazon Prime. Out of these only HBO and Amazon Prime are capable of streaming content in 1080p. The others are probably 720p or lower and this is insane. Im paying loads of extra money for streaming quality and i just cant watch stuff above 720p. I know that some dmr change happened in the browsers i dont really understand it but i tried chrome, opera and edge and the microsoft store apps and all of them are bad quality. I have the highest quality package on all of these services and my internet should be able to handle it. Does anyone have a solution for this? Im at the point of unsubscribing because im very big on image quality and everything just looks bad.",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jhdqw9/netflix_and_other_streaming_apps_cant_run_on_1080p/"
    },
    {
        "id": "1jhdpaj",
        "author": "StandardDowntown441",
        "title": "Is El Turco streaming on Netflix",
        "content": "El Turco - Official First Trailer | English Subtitled / Ay Yapım\nhttps://www.youtube.com/watch?v=YMXVVXhdpCw\nThis web series wad supposed to air on Disney plus,  I can just find trailers on You Tube\nIs it on Netflix ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhdpaj/is_el_turco_streaming_on_netflix/"
    },
    {
        "id": "1jhd9fj",
        "author": "Legal_Math7439",
        "title": "Honest question",
        "content": "I’m not sure if it’s just me, but I’ve noticed that H2O seems to have a lack of episodes and seasons available. I remember there being supposed to be 3 seasons with 26 episodes each. I watched it not too long ago, and it indicated that there were 3 seasons, but now that information is gone! When I go on Netflix, it only shows 26 episodes with no mention of seasons at all. Is Netflix planning to remove H2O soon? What’s going on with Netflix? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jhd9fj/honest_question/"
    },
    {
        "id": "1jhcquz",
        "author": "jir1979",
        "title": "Mr McMahon documentary",
        "content": "I just finish watching the documentary and all I have to is wow. I use be a huge fan of wrestling in the 80s and 90s. Watch some of it in the 2000s. It got to be a bit too much after awhile. Maybe I outgrew it, but it’s great to see how wrestling was in those days. A reminder of young pop culture. If anyone has ever been a WWF/WWE, this is a must watch.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jhcquz/mr_mcmahon_documentary/"
    },
    {
        "id": "1jgw1ib",
        "author": "Original2021",
        "title": "Uzo Aduba  is brilliant in The Residence",
        "content": "The only reason I watched the series is because of the lead actress Uzo Aduba. I've been a fan of her work since In Treatment. I didn't like the writing and overall series but she definitely carried the series. I watch a lot of mysteries mainly British and this wasn't really a mystery but a dramedy.",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jgw1ib/uzo_aduba_is_brilliant_in_the_residence/"
    },
    {
        "id": "1jhprcc",
        "author": "SubstantialFox2099",
        "title": "Guess the movie or show from scene",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jrpmvfvbucqe1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jhprcc/guess_the_movie_or_show_from_scene/"
    }
]