[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ikq32a",
        "author": "peoplemagazine",
        "title": "Prince Documentary Featuring Abuse Claim by Ex Killed by Netflix as Estate Plans New Film",
        "content": "",
        "upvotes": 23,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikq32a/prince_documentary_featuring_abuse_claim_by_ex/"
    },
    {
        "id": "1ijvfht",
        "author": "Internal_Deer_5324",
        "title": "Stop making documentaries about serial killers.",
        "content": "Making these documentaries is only giving what these murderer what they want… to be famous. They want to be immortalized by these terrible terrible acts, and these documentaries do exactly that. Please stop fulfilling the hopes of these wretched and vile transgressors.",
        "upvotes": 1045,
        "comments": 181,
        "media": null,
        "permalink": "/r/netflix/comments/1ijvfht/stop_making_documentaries_about_serial_killers/"
    },
    {
        "id": "1ikrhzw",
        "author": "I_ReadThe_Comments",
        "title": "I’m obsessed with the show “MO.”",
        "content": "It’s informative, funny, heartwarming, heartbreaking. It touches ALL aspects of life in the U.S. as a Muslim, Jew, Hispanic, a man on the spectrum. And it all focuses around a family of refugees from war torn Palestine.\n\nDon’t do what I did and sleep on this show.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikrhzw/im_obsessed_with_the_show_mo/"
    },
    {
        "id": "1ik3far",
        "author": "dailystar_news",
        "title": "Netflix star's mum brutally slaughtered in France as 'burglary goes wrong'",
        "content": "",
        "upvotes": 322,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ik3far/netflix_stars_mum_brutally_slaughtered_in_france/"
    },
    {
        "id": "1ikjdkz",
        "author": "S4v1r1enCh0r4k",
        "title": "Baby Reindeer wins best limited series at critics choice awards",
        "content": "",
        "upvotes": 19,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikjdkz/baby_reindeer_wins_best_limited_series_at_critics/"
    },
    {
        "id": "1iki5at",
        "author": "okaybhaii",
        "title": "What a lively movie! Isn't it? ✨",
        "content": "",
        "upvotes": 21,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/drp72vo3evhe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iki5at/what_a_lively_movie_isnt_it/"
    },
    {
        "id": "1ikbzs2",
        "author": "Dabomblol1231",
        "title": "Why doesn't Netflix see that shows that don't receive Stranger Things ratings can still be used as a way to grow their content library instead of just canceling them?",
        "content": "It seems pretty short-sighted to cancel shows just because they don’t pull in massive ratings like Stranger Things. With almost every major media company now running their own streaming service and fighting for subscribers, it’s more important than ever to have a variety of good content. Keeping shows with solid writing, even if they’re not huge hits, could help in the long run by pulling in niche audiences, keeping loyal fans around, and making the platform look better overall. Instead of only chasing big, instant successes, streaming companies should think about the long-term value of having a mix of different shows that keep people watching and stop them from canceling their subscriptions.\n\n",
        "upvotes": 51,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ikbzs2/why_doesnt_netflix_see_that_shows_that_dont/"
    },
    {
        "id": "1ik59xa",
        "author": "valentaain",
        "title": "Anyone else totally obsessed with Psych?",
        "content": "A few months ago I was browsing through the homepage on my Netflix prolife and I found out *Psych*. It was and old show whit eight seasons, so I didn´t hit play in that moment... but something later tolde me to give it a try and I watched first episode.\n\nHonestly I think it is a super fun and really fast-paced show, really hilarious! It has a bit of everyting! I loved all the characters and it became an obsession to me. I0m currently finishing season 7 and every time I watc an episode I feel like I'm close to the end, that's make me feel sad :(\n\nIf you haven't watched it yet, I totally recommend it! And if you have, what did you think? Did you get as obsessed as I did?\n\nPS: I'm not really good writing in English so sorry If there is anything that is bad written ;)\n\nhttps://preview.redd.it/z254xtih4she1.png?width=718&amp;format=png&amp;auto=webp&amp;s=3536771552c5955d46c5a8f193b7f5a073a92f8b\n\n  \n",
        "upvotes": 55,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1ik59xa/anyone_else_totally_obsessed_with_psych/"
    },
    {
        "id": "1iklucu",
        "author": "Alone-Application454",
        "title": "Night agent season 2 is horrible",
        "content": "24 js my favorite show of all time so as a 24 fan i adored season 1 of the night agent. But season 2 is just strange. Firstly the episodes are just straight up boring. No fights are high adrenaline scenes. Just conversations that feel meaningless to the plot. Rose is actually unbearable with her storyline of constantly changing her mind about staying or leaving was so frustrating to watch and it just feels ljke theyre forcing her into the show. Big boss lady is awful and horribly acted. Peter feels like a shell of himself in this season and half the episodes is just his relationship with rose. Its all awful. The final problem with this season is the muslim people always speaking that language. I dont have any problem with muslims or their language but o hate that half the episode isnt captioned and half of it is and when it is the conversations still feel pointless. Who else agrees?",
        "upvotes": 5,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1iklucu/night_agent_season_2_is_horrible/"
    },
    {
        "id": "1ijv56g",
        "author": "Whobitmyname",
        "title": "‘Dungeons &amp; Dragons: Honor Among Thieves’ Releases on Netflix on February 26.",
        "content": "",
        "upvotes": 170,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv56g/dungeons_dragons_honor_among_thieves_releases_on/"
    },
    {
        "id": "1ijv5ef",
        "author": "Somethingman_121224",
        "title": "Streaming Giant Netflix Is Looking To Secure F1 Broadcasting Rights",
        "content": "",
        "upvotes": 165,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ijv5ef/streaming_giant_netflix_is_looking_to_secure_f1/"
    },
    {
        "id": "1ikrqy4",
        "author": "Familiar_Mine_4353",
        "title": "Ghosts TV show",
        "content": "When are seasons 3 &amp; 4 of Ghosts going to be added on Netflix? Binged the show in 2 days and I totally loved it! I found out the show has 2 more seasons and season 2 left us with a cliffhanger. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikrqy4/ghosts_tv_show/"
    },
    {
        "id": "1ikfgv9",
        "author": "pocketfullofprose",
        "title": "Dark Forest Show?",
        "content": "A couple of years ago or so I got into a show about a small-town female detective with a few severed fingers from a traumatic incident in the dark woods in their town. Her trauma unfolds as other teenagers have traumatic events in the woods. I don't remember the title ... And I think it wasn't in English? Anyone remember anything like that?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikfgv9/dark_forest_show/"
    },
    {
        "id": "1ikq1g3",
        "author": "jhje",
        "title": "Netflix Spoils",
        "content": "So I was showing the first episode Three Body Problem to someone that never seen it and all good.. BUT! When the episode is over comes \"This season on - Three Body Problem\" and they spoil the whole season visually. \n\nAnyone else had this? \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ikq1g3/netflix_spoils/"
    },
    {
        "id": "1ikpz8o",
        "author": "JbreezyReviews",
        "title": "Best Movies Each Genre",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikpz8o/best_movies_each_genre/"
    },
    {
        "id": "1ikceyt",
        "author": "medinah66",
        "title": "Documentaries about the fall of a powerful man?",
        "content": "I've had this weird fascination with how men in positions of power get knocked off their pedestal. I just finished \"Madoff: The Monster of Wall Street\" and really loved it, so I'm looking for documentaries that are similar. Thanks in advance. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ikceyt/documentaries_about_the_fall_of_a_powerful_man/"
    },
    {
        "id": "1ikkbd9",
        "author": "abrahameatspears",
        "title": "My Top 5 Favorite Shows In Netflix",
        "content": "Hello! Just wanted to share my top 5 shows that I have seen so far in netflix. I've seen about 15 shows but here's my top 5. Feel free to share your thoughts or your top 5 in the comments as well!\n\n1. Cobra Kai (9.7/10)\n2. Never Have I ever (9/10)\n3. Alice in Borderland (8.5/10)\n4. Stranger Things (8.3/10)\n5. Sex Education (7.5/10)\n\nHonorable Mention/6th Place. XO, Kitty (6/10)\n\nJust my personal opinion! Would love to see your guys' thoughts",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ikkbd9/my_top_5_favorite_shows_in_netflix/"
    },
    {
        "id": "1ikgqs9",
        "author": "theRetr0",
        "title": "netflix philippines most titles suddenly disappeared",
        "content": "last night everything was fine now this morning im trying to watch the anime i downloaded and suddenly its not available i check the home page and even the kdrama and anime series and some movie titles on netflix has been gone can somebody check if this the case on some people ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikgqs9/netflix_philippines_most_titles_suddenly/"
    },
    {
        "id": "1ikj7zu",
        "author": "Ok_Writing1472",
        "title": "Need help finding consistently loud series to binge",
        "content": "Hi, i've become a caretaker for my dad, and to spend more time with him i plan on streaming on my computer right next to him, while he watches his shows and listens to music, i need shows that have as little amount of quiet scenes as possible to drown out his stuff. Would like Dramatic thrillers and political thrillers are best, ty",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ikj7zu/need_help_finding_consistently_loud_series_to/"
    },
    {
        "id": "1ikif7q",
        "author": "MusicInTheAir55",
        "title": "Subtitles suddenly oversized, cant watch any shows",
        "content": "Suddenly my subtitles are oversized, taking up much of the screen making shows unwatchable. \n\nhttps://preview.redd.it/anaz1yj6hvhe1.png?width=1762&amp;format=png&amp;auto=webp&amp;s=5ba5d9683b81f1bf9e755e7a4252c12083830f5c\n\nI have tried changing the subtitle size to small (was originally medium), but it made no difference. The problem appears on all titles that I have tested. \n\nWatching Netflix on Google Chrome Version 133.0.6943.59 (Official Build) (64-bit)  \nWindows 10 Pro",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikif7q/subtitles_suddenly_oversized_cant_watch_any_shows/"
    },
    {
        "id": "1ik6e6p",
        "author": "indiewire",
        "title": "Best New Movies Streaming on Netflix in February 2025",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik6e6p/best_new_movies_streaming_on_netflix_in_february/"
    },
    {
        "id": "1ikbz3v",
        "author": "duffmanenthusiast",
        "title": "House MD Glitchy",
        "content": "Why is House MD so glitchy? It often skips over minutes and sometimes has a green screen when I unpause. This has never happened to me before. I'm assuming it's either because of my device or because of the way it was recorded to Netflix. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikbz3v/house_md_glitchy/"
    },
    {
        "id": "1ikeukb",
        "author": "aidanmansfield75",
        "title": "Snootworld",
        "content": "Hey guys, I was thinking about David Lynch's tragic recent passing and thinking about his unmade animated project called snootworld which he was trying to get out with Netflix. What exactly did we know about it? What was the animation style? What was the plot? Was it for children or adults? What were the exact details we knew?\nIf someone could make a list of what the project was supposed to be it would be endlessly interesting to read\nThanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ikeukb/snootworld/"
    },
    {
        "id": "1ik8t22",
        "author": "missylyssy3210",
        "title": "New &amp; old All American cast thoughts?",
        "content": "What are your thoughts on the new cast and some of the old ones returning in the storylines they have in the next episodes",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ik8t22/new_old_all_american_cast_thoughts/"
    },
    {
        "id": "1ik9e1i",
        "author": "vickec07",
        "title": "Nothing loads around midnight",
        "content": "When i try to watch a show it just loads forever, the ui works and i can search for stuff but no media loads, not even trailers! I've only tried on the mobile app so far.\n\nIs this just for me?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ik9e1i/nothing_loads_around_midnight/"
    },
    {
        "id": "1ik27tm",
        "author": "Mary_Ellen_Katz",
        "title": "My shows keep automatically lowering their visual quality.",
        "content": "I watch netflix in a browser while I play games sometimes. I've noticed when I do this the quality of my show tanks in visual quality. Starting at 1080p, and shriving up to as low as 480p. I've tried to get it to stop via the settings, but I can't seem to do it. Anyone got any ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ik27tm/my_shows_keep_automatically_lowering_their_visual/"
    },
    {
        "id": "1ijygkh",
        "author": "Miserable-Penalty-54",
        "title": "Barbarians",
        "content": "Hi everyone, I have a question about a netflix show that I really liked, barbarians.\nI finished the first two seasons in no time and the final episode left me dangling and I would like to know if there is going to be a New season.\nI've recently read on the web that the series has been \"renewed\" (source: rotten tomatoes, an article from 2 weeks ago), please let me know anything.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ijygkh/barbarians/"
    },
    {
        "id": "1ijs6ks",
        "author": "FirTrader",
        "title": "My favorite show",
        "content": "I feel that “Black Mirror” has so much character creation and story to fit into each episode, that every second and every detail , of every scene, matters.  I know it is often dark, and has its fair share of gore, but I sure do love the series.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ijs6ks/my_favorite_show/"
    },
    {
        "id": "1ijjysf",
        "author": "IshaanM8",
        "title": "Device not part of household on PC",
        "content": "# Your device is not part of the Netflix Household for this account is now happening on PC as well..\n\n  \nIt was good while it lasted as you could still use it as before on the laptop / desktop but the same issue that was happening on the phone, is now happening on PC.",
        "upvotes": 27,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ijjysf/device_not_part_of_household_on_pc/"
    },
    {
        "id": "1ik394i",
        "author": "ChainBoring",
        "title": "low quality",
        "content": "why are specific movies in lower quality ?   \ni was watching squid game and i had no quality difference between my phone and my pc, but when i went to watch fast &amp; furious, the movie looked really blurry, almost like 480p on pc, but perfectly HD on phone, does anyone know why ? (i tried all of the fast &amp; furious saga and got the same results)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ik394i/low_quality/"
    }
]