[
    {
        "id": "1hruk2x",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched from 2024?",
        "content": "Happy New Year! /r/movies. A little bit of fun to start the year. **The way this works is that you post a review of the Best Film you watched from the past year, 2024.**\n\n**Here are some rules:**\n\n1.\t**Check to see if your favorite film from 2024 has been posted already.**\n2.\t**If not, Please post your favorite film released in 2024. \\[Limit to one Film only\\]**\n3.\t**Explain why you enjoyed your film.**\n4.\t**ALWAYS use SPOILER TAGS.**\n5.\t**The Best Films of 2024 will be chosen by UPVOTES. So if your film has been mentioned, upvote that comment and discuss in child comments.**\n6.\t**Someone already commented Dune: Part Two**",
        "upvotes": 643,
        "comments": 1033,
        "media": null,
        "permalink": "/r/movies/comments/1hruk2x/what_is_the_best_film_you_watched_from_2024/"
    },
    {
        "id": "1hsvqaz",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Wallace &amp; Gromit: Vengeance Most Fowl / Nightbitch / Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 30,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hsvqaz/official_discussion_megathread_wallace_gromit/"
    },
    {
        "id": "1htq8om",
        "author": "AlwaysBi",
        "title": "Perry, the donkey who served as the Donkey model for Shrek, has passed away at the age of 30.",
        "content": "",
        "upvotes": 22845,
        "comments": 349,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j7TlbrfnfYHYqohIJLAWmQgSlF5S0kA30hmyAD6h8yg.jpg?auto=webp&amp;s=147f388f38c8a79ad35cecad15ba001bf8a5ae29"
        },
        "permalink": "/r/movies/comments/1htq8om/perry_the_donkey_who_served_as_the_donkey_model/"
    },
    {
        "id": "1hu7s29",
        "author": "Zhukov-74",
        "title": "Marlon Brando “So Furious At Being Dubbed For Italian ‘Waterfront’ He Stormed Out Of Premiere,” New Book Reveals",
        "content": "",
        "upvotes": 243,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4lMYUdeqp_dejsRxm7IvbO52i58hAJ2OiQ05AkCXA3s.jpg?auto=webp&amp;s=5fd40c97d5992cf5095441654f38962de1e9f079"
        },
        "permalink": "/r/movies/comments/1hu7s29/marlon_brando_so_furious_at_being_dubbed_for/"
    },
    {
        "id": "1huahnf",
        "author": "JiskiLathiUskiBhains",
        "title": "I watched 3:10 to Yuma and damn it is good.",
        "content": "** The 2007 one. **\n\nWhat I didnt like:\n\nIts a 2 hour movie that doesnt get interesting until 55 minutes have passed. And that is a solid commitment for a casual watcher to make.\n\n\nWhat I liked: \n\nAfter minute 55, the movie is friggin rivetting. I didnt want to stop it to get up to pee. \n\nThe acting is excellent. And I mean excellent. There was one point where I teared up a little. And another where I chuckled along with the characters just because it was just a good moment. The character building and relationship building is top notch.\n\nEven the small characters do well. If you dont watch westerns you forget that &gt;!anyone can die. and goodamn it characters drop like flies in this film.!&lt;  And that really sells a story to me.\n\nRussel Crowe. You forget how good of an actor he is.\n\nMusings: \n\n\nI fell asleep watching this movie back when it came out and I just kinda forgot about it. I've heard many people say its a good movie so its been on my list for a long time. Just took me around 18 years to get around to watching it. Oddly enough, I fell asleep watching it this time too. So I watched the rest of the movie today. And I'm happy to have watched it. I'm already excited to watch it again. \n\nThe good part is things makes sense at the end. There were a few things that bothered me after I watched it so I read up the reddit posts about the movie and that cleared it up for me. I watched the scenes redditors talked about and I found that, yeah, it all adds up. In a convincing way. \n\nIf you liked this movie, I will recommend you watch Appaloosa, if you havent already.",
        "upvotes": 156,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1huahnf/i_watched_310_to_yuma_and_damn_it_is_good/"
    },
    {
        "id": "1hu8076",
        "author": "Amaruq93",
        "title": "Aardman Animations maintains its stop-motion ideal of a cozy &amp; simpler England",
        "content": "",
        "upvotes": 91,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-zJ8p-KianwvvRoNH5xwCR_9zks_Yy7IWwwn48QuIvk.jpg?auto=webp&amp;s=39be801e49abfe0a6650e79d887298c2d4326687"
        },
        "permalink": "/r/movies/comments/1hu8076/aardman_animations_maintains_its_stopmotion_ideal/"
    },
    {
        "id": "1htf5pz",
        "author": "MarvelsGrantMan136",
        "title": "'Life After Beth' &amp; 'Spin Me Round' Director Jeff Baena Has Passed Away At 47",
        "content": "",
        "upvotes": 6441,
        "comments": 578,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3SaG1jWtKurjVeM2L9K4cHNXVHWnBgonCzvr5VBuUpY.jpg?auto=webp&amp;s=89214beeca1533c5e8a3a1e8b19880780854523b"
        },
        "permalink": "/r/movies/comments/1htf5pz/life_after_beth_spin_me_round_director_jeff_baena/"
    },
    {
        "id": "1htqkf1",
        "author": "Philosopherskin",
        "title": "Visually timeless films?  Like you could watch it and be unable to say “oh yeah that was definitely filmed in the 90’s.”",
        "content": "\nHopefully the question makes sense.  I’m not talking about “timeless” in terms of the subject matter of a film, but rather the visuals of the film. Whether it be because of the camera shots, the color grading, etc.  \n\nFor example, out of The Lord of the Rings films, The Two Towers and The Return of the King seem visually timeless to me, but The Fellowship of the Ring seems to have a look to it that makes me think “yeah I can tell that this was filmed in 1999.”  (Which is confusing because all 3 films were filmed at once.)\n\nI suppose my question would obviously not apply to recent films as obviously they would be timeless because of their proximity to the current day.",
        "upvotes": 713,
        "comments": 613,
        "media": null,
        "permalink": "/r/movies/comments/1htqkf1/visually_timeless_films_like_you_could_watch_it/"
    },
    {
        "id": "1hu9mqt",
        "author": "CrazyFinnishdude",
        "title": "What are some of your favorite \"Best [A Well-Known Director] Movie, not made by [A Well-Known Director]\" Movies?",
        "content": "Or more clearly, what are some of your favorite cases, where a movie (whenever through style, tone and/or certain tropes) feels like it was made by a certain filmmaker, but actually wasn't?\n\nFor me, *Death Becomes Her* is the best Tim Burton movie, not made by Tim Burton. It has certain \"cartoonishly macabre\" tone to it and \"the snobbish high society is dumb\" social commentary, both of which are pretty typical in Burton's movies. It helps that the movie to this day stands-out from the rest of Zemeckis' filmography, which is more known for fun adventures and grounded dramas, so it never comes to my mind first, when thinking about his movies.",
        "upvotes": 24,
        "comments": 64,
        "media": null,
        "permalink": "/r/movies/comments/1hu9mqt/what_are_some_of_your_favorite_best_a_wellknown/"
    },
    {
        "id": "1htukmz",
        "author": "kxdaj",
        "title": "I need soul-crushing, heart-wrenching romance drama movies to completely lose myself in and cry my heart out\n",
        "content": "Please give me films recommendations.  \nI'm craving deeply emotional, soul-crushing romance dramas that will allow me to completely escape into their world. I want films that pull at my heartstrings, leaving me breathless and teary-eyed. Something intense, heart-wrenching, and utterly consuming—movies that will make me cry uncontrollably.  \nI need to feel something !!\n\nWhat movies made you feel this way?  Please, tell me, even if it is not romance.\n\nEDIT: Thank you so much! I'm adding all your reco to my watchlist. If anyone is wondering about it too, I will give you also a recommendation : Farewell, my concubine (1992)",
        "upvotes": 225,
        "comments": 680,
        "media": null,
        "permalink": "/r/movies/comments/1htukmz/i_need_soulcrushing_heartwrenching_romance_drama/"
    },
    {
        "id": "1hu1r5g",
        "author": "ReadWriteArithmetic",
        "title": "In The Secret Life of Walter Mitty (2013) what are the beards meant to symbolize? ",
        "content": "The three senior managers and executives who are in charge or closing down Life magazine and managing the redundancies have full, almost over the top beards. The way the beards are such an obvious trait, it feels like it's meant to symbolize something but I've never been fully sure what? And all of the other employees seem to be clean shaven as well",
        "upvotes": 60,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1hu1r5g/in_the_secret_life_of_walter_mitty_2013_what_are/"
    },
    {
        "id": "1htz9us",
        "author": "Embarrassed_Roof5512",
        "title": "Are there any movies shot in first person? ",
        "content": "Been thinking about how games use some characters that don't even speak. But still make such a good story as you play as them and experience they're journey without ever hearing them or seeing them and was wondering if there any any movies with a similar premise as I haven't heard of anybody talking about one.",
        "upvotes": 89,
        "comments": 221,
        "media": null,
        "permalink": "/r/movies/comments/1htz9us/are_there_any_movies_shot_in_first_person/"
    },
    {
        "id": "1hu0vh3",
        "author": "Boss452",
        "title": "Director David Fincher Talks The Making Of 'Se7en,' Where 'The Box' Is Now, Added Scenes, &amp; More",
        "content": "",
        "upvotes": 39,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L00Uf-CJsuiW-w36u_fkYTmKHf6cCEkHcIU8cNwlJZ0.jpg?auto=webp&amp;s=eec865d3d8ef36e9db90ecc04a05d7e810c21758"
        },
        "permalink": "/r/movies/comments/1hu0vh3/director_david_fincher_talks_the_making_of_se7en/"
    },
    {
        "id": "1htipgx",
        "author": "RevWaldo",
        "title": "From Ground Zero | Official Trailer - shortlisted for 97th Academy Awards for the International Feature Film category",
        "content": "",
        "upvotes": 429,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XZNI8t22tIJUCYxvcIfQFsqO7T1oIiK-OL5PNZvw3r0.jpg?auto=webp&amp;s=06150faced593c490e649b9e52b8a7f14fc3998c"
        },
        "permalink": "/r/movies/comments/1htipgx/from_ground_zero_official_trailer_shortlisted_for/"
    },
    {
        "id": "1hub2ht",
        "author": "gunslanger21",
        "title": "Ranked: Top Grossing Movie Worldwide in 2024",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BY_B12jcum4EhNoOBtvnTQjL13x3YFJ-Ue25Dactwro.jpg?auto=webp&amp;s=8edd802d107fa0f16b56fc9453a80fa77470c335"
        },
        "permalink": "/r/movies/comments/1hub2ht/ranked_top_grossing_movie_worldwide_in_2024/"
    },
    {
        "id": "1htjvj6",
        "author": "JonasKahnwald11",
        "title": "Juliette Binoche and Ralph Fiennes’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 333,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ry7WjFRJoPC_e4OHdBfmH_OUCnRwyv9NgM4uKuEz77o.jpg?auto=webp&amp;s=7786d7b0513b99f8a676681e532e0750bcbc6d3c"
        },
        "permalink": "/r/movies/comments/1htjvj6/juliette_binoche_and_ralph_fienness_criterion/"
    },
    {
        "id": "1huaf3k",
        "author": "Dirk_Dingham",
        "title": "Movie recommendations for a snowstorm?",
        "content": "The snow is coming down pretty hard and i’d like to be able to watch a movie before my power inevitably goes out. I’m looking for something that kind of fits the atmosphere of The Thing. I usually always watch that movie during a snowstorm but i watched it a few weeks ago so i’m kinda burnt out on it rn and want to find something with a similar vibe",
        "upvotes": 5,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1huaf3k/movie_recommendations_for_a_snowstorm/"
    },
    {
        "id": "1htqu27",
        "author": "Suitable_Candy_1161",
        "title": "The talented mr ripley (1999) left me uncomfortable the whole movie, any one else?",
        "content": "Something about the demeanor of all the main characters felt off. Maybe it's because Tom was in every scene and he's the one who I felt was the most awkward.\n\nWas that the intended reception?\n\nPart of it, how many awkward situations Tom is in. The Meredith boat scene, meeting Marge at the opera, the PI at Dickie's dad place, Marge &amp; the rings, meltdown at the boat with Dickie, The Italian detective, last Freddie scene, and that's not even all of them.\n\nOne other question, were we supposed to assume a lot of days passed in between every scene when Tom, Dickie &amp; Marge were friends?\n\n I felt like they got along like very good friends very fast.",
        "upvotes": 118,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1htqu27/the_talented_mr_ripley_1999_left_me_uncomfortable/"
    },
    {
        "id": "1htrqzv",
        "author": "thetokyofiles",
        "title": "Movies with bar fight scenes",
        "content": "Just rewatched the original Sonic the Hedgehog (2020) movie and the bar fight scene, while not my favorite of the genre, reminded me how much I enjoy a good bar fight scene in a film. My favorite is probably the scene in The Presidio (1988) where Sean Connery’s character defeats a man using just one thumb.\n\nWhat are your favorites? ",
        "upvotes": 99,
        "comments": 324,
        "media": null,
        "permalink": "/r/movies/comments/1htrqzv/movies_with_bar_fight_scenes/"
    },
    {
        "id": "1htkj7o",
        "author": "mrjohnnymac18",
        "title": "Iranian director Mohammad Rasoulof reflects on fleeing country after making searing Oscar-contending film",
        "content": "",
        "upvotes": 252,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ggSLF7e16_NDyK48OYsgoXcpqcf2gw5KXySpu2YCWd0.jpg?auto=webp&amp;s=2f0d257a888f468b51a5f3f64043ce895e06b3d8"
        },
        "permalink": "/r/movies/comments/1htkj7o/iranian_director_mohammad_rasoulof_reflects_on/"
    },
    {
        "id": "1hublf9",
        "author": "EffMemes",
        "title": "Bedford Falls is just fine without George Bailey",
        "content": "One of my favorite films is “It’s a Wonderful Life” and I’m beginning to believe that there’s an alternate take on this film that isn’t often spoken about.\n\nThe town of Bedford Falls and its people would have been just fine without the existence of George Bailey.\n\nI know that contradicts what Clarence the angel shows us, but I ask you to consider the following:\n\n1. Harry Bailey never falls through the ice and never dies.\n\nWe see George as a kid, and he is overly confident (as we see when telling Mary about all the skyscrapers he’ll build and the four wives he’ll have) and no doubt he is a leader among his peers.\n\nSo…why was Harry even sledding on the ice in the first place?  I posit that it was George and his friends who decided on that activity, and Harry simply tagged along for the ride.  Furthermore, it was probably George himself who insisted on being near the thin ice as he is overly confident in himself.\n\nSo if George doesn’t exist, Harry never even goes there.  He’s either chillin’ with mom or as an only child, learned to find his own friends.  And if he did go, didn’t have a daring, adventurous leader like George Bailey and probably played somewhere safer.\n\n2. Mr. Gower never poisons anyone because he hires a pharmacy assistant who knows how to get to work on time.\n\nPeople think that Mr. Gower almost poisoned a customer because of the distraught state he was in as a result of his son dying.  \n\nI call bologna.\n\nPeople forget that when George shows up for work that day, Mr. Gower is pissed and calls him out “You’re late!”\n\nSo Mr. Gower had to rush around and open the store all by himself and tend to customers and fill prescriptions all while dealing with the death of his son.\n\nHad Mr. Gower simply hired an employee who showed up to work on time, then he wouldn’t have been rushed and would’ve poisoned no one.\n\n3. Peter Bailey lives many more years as a result of his son, George, not existing.\n\nThe very last conversation between Peter Bailey and his ungrateful son is excruciating to watch.\n\nPeter sheepishly asks George if he would consider staying on at the Building and Loan.  Peter knows he shouldn’t ask but probably also wants help contending with the likes of Potter.\n\nNot only does George say no, which is fine by itself, but then goes on to berate the profession that his stand up father has done his entire life.  Sure, he apologizes after, but the damage has been done.\n\nA mere few hours after this Peter would have a heart attack and pass away.  Coincidence?  I think not.\n\nI think Peter would have lived had he and his profession not been badmouthed by a loved one as a response to simply asking for help.  Imagine the stress of having to deal with Potter and his schemes, and then you finally come up with the courage to ask a loved one to fight the good fight, and they say “Nah that sounds like it would suck.”\n\nThe fight left Peter Bailey that day, and the reason was his son George.\n\nWithout George around, Peter himself lives on and continues the fight against Potter.  When the run on the bank happens, Peter and Irene simply use their savings just as George and Mary did.  And Peter/Irene would have a lot of extra money considering they didn’t have to pay for George’s entire existence.\n\n4. Ernie would’ve never found out his wife was only in it for the money.\n\nSure, one saving grace of George Bailey is that he created Bailey Park to help the good folk of Bedford Falls avoid Potter’s slums.  But what happens when you examine the details here?\n\nOne such person who “benefited” from Bailey Park was George’s pal Ernie and his wife and kid.  However, in the Pottersville timeline, we learn that Ernie’s wife ran away with the kid because Ernie was too poor.\n\nI’m actually sad for Ernie, that by the end of the film, he’ll never know that the woman he loves would have dropped him had he not been able to afford a house.\n\n5. Mr. Welch wouldn’t be banned from the local bar.\n\nGeorge says some rather hateful things to his children’s school teacher, Mrs. Welch.\n\nLater on, Mr. Welch rightfully stands up for his wife and pops George in the mouth.  He is then forever banned from his local bar.\n\nIf George doesn’t exist, then a good teacher doesn’t get savagely insulted on Christmas Eve and her husband is still allowed to drink at the establishment he prefers.\n\n6. Mary Hatch would not have been an old maid.\n\nI maintain that Mary had a somewhat unhealthy obsession with George starting at a very young age.\n\nTo the point of calling her fellow 10 year old classmate a whore for liking the same boy, rudely flaking on a date with her suitor Freddie MID DATE to go out with George instead, and later, she would attempt to make George jealous by being overly enthused with Sam Wainwright on the phone.  I’d say that wasn’t fair to Sam’s feelings but he already knows Mary’s game which is why he has a side fling of his own.\n\nI believe that if George hadn’t existed, then Mary wouldn’t have been so narrow focused on one man her entire life and could’ve made it work with Sam.  Sam knew that Mary was obsessed (as anyone with eyes knew if they saw Mary looking at him) and that’s why he played around on her, but otherwise we see that Sam is a pretty smart and good guy.  He’s able to create a booming business and we know his character is good by his donation of $25,000 at the end of the film.\n\nAnd even if Mary never marries, there’s literally nothing wrong with a life devoted to the library of all things.  The library is a wonderful public service and I’d say a life devoted to that is a life well lived.\n\n7. The town would have come to the aid of Peter Bailey just as they did George had a similar circumstance arisen like Uncle Billy giving Potter $8,000.  In fact, that situation would have never happened under Peter’s tenure.  Unlike his son George who likes to sled too close to the thin ice, Peter is responsible and would’ve known to never let that drunkard Billy handle all that cash.\n\nAbout the only thing George was good for was a housing development that should’ve been a cemetery, and now because George Bailey exists the town has no place to bury their loved ones when they die.\n\nI hear no bell.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hublf9/bedford_falls_is_just_fine_without_george_bailey/"
    },
    {
        "id": "1hu6je9",
        "author": "AporiaParadox",
        "title": "Interesting dialogue or plot changes made in localizations for foreign languages",
        "content": "We often talk about localization of movies in foreign markets when it comes to weird title changes, but that's only the most visible form of localization when translating movies to other languages. The whole point of localization isn't to just translate everything, it's to make the product understandable, non-controversial, and entertaining to foreign cultures, which doesn't always work with a purely faithful translation, so changes are often made to the dialogue and plot.\n\nFor example, in Inside Out Riley doesn't like broccoli, a common trope with Western children, but in Japan this was changed to bell peppers, which is a more common disliked food trope in Japan. They even changed the animation for those particular scenes.\n\nA common one we often hear about is when a movie has gay characters. Foreign markets will often change the dialogue where it is stated that a character is gay, and if there's a scene of them kissing someone of the same gender they'll just cut it out. \n\nBut one of the most infamous localization changes was what happened to the Castilian dub of the movie Mogambo. In the film, Grace Kelly and Clark Gable are in an adulterous relationship, which was a big no-no to the Catholic censors of the time. To rectify this sinful plot, the married couple were instead changed to being siblings, thus Grace Kelly was free to be in a relationship with Clark Gable. The problem was that they didn't cut the scenes where Grace Kelly kisses her \"brother\" and is quite close to him, so they accidentally replaced adultery with heavily implied incest.\n\nSo what are some other interesting localization changes?",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1hu6je9/interesting_dialogue_or_plot_changes_made_in/"
    },
    {
        "id": "1htz12y",
        "author": "quantumshenanigans",
        "title": "If I loved watching Sergei Bondarchuk's War and Peace (1966-67, 431 minutes) during a snowstorm last year, what should I watch during a snowstorm this year?",
        "content": "My friends and I watched the [1960's Soviet epic *War and Peace*](https://en.wikipedia.org/wiki/War_and_Peace_(film_series) over a few days during a snowstorm last year and absolutely loved it. We've got a snowstorm coming in tomorrow night and I'm eager to replicate the experience.\n\nEpic scale, historical focus, snow/winter vibes, multiple installments/long runtime, foreign film - these are the main elements I'm looking for (and of course the movie doesn't need to have literally all of these)\n\nThanks in advance for any and all suggestions!",
        "upvotes": 20,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1htz12y/if_i_loved_watching_sergei_bondarchuks_war_and/"
    },
    {
        "id": "1hub1rw",
        "author": "gunslanger21",
        "title": "Gwen Van Dam Dead: Character Actress for 70 Years Was 96",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XH1OhwAjAiSmVAbf0RHA35c5qexoYM3kBO3f55XDbtc.jpg?auto=webp&amp;s=f3d63ee8dae0307d25340ce46862e3bebd3555de"
        },
        "permalink": "/r/movies/comments/1hub1rw/gwen_van_dam_dead_character_actress_for_70_years/"
    },
    {
        "id": "1htxq4c",
        "author": "Outside-Pear9429",
        "title": "Lesser-known twist ending movies",
        "content": "Name the best lesser-known/lesser-discussed twist ending movie (or a common one just left off the list below). The general \"best twist\" question has been asked several times I know, so what's out there that hasn't been named a hundred times.  And yes, before someone says it, I know being told a movie has a twist ending kind of ruins the surprise of twist ending. I get it. Anyway. What are some that are not on the list below. Debatable if some of these count as twist endings, just listing the ones people name a lot. Post edited cause the list below was originally covered as spoilers but it's annoying to click them all individually in a list this long, so if you don't want to know what movies have twist endings you should probably stop reading:\n\n.\n\n.\n\n.\n\n.\n\n.\n\n* Shutter Island\n* The sixth sense\n* the others\n* fight club\n* oldboy\n* No way out\n* the prestige\n* the game\n* the mist\n* The usual suspects\n* The book of Eli\n* Primal Fear\n* Hide and Seek\n* Mulholland drive\n* Jacob's ladder\n* Cabin in the woods\n* frailty\n* Psycho\n* the crying game\n* predestination\n* saw\n* arrival\n* memento\n* Orphan\n* Identity\n\nProbably others but these are all I can think of at the moment.",
        "upvotes": 21,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1htxq4c/lesserknown_twist_ending_movies/"
    },
    {
        "id": "1hu7ga0",
        "author": "FloridaMan_90",
        "title": "Recommendations for a movie like The Mask (1994)...for grownups?",
        "content": "This was one of my favorite movies as a kid... full disclosure, I still enjoy it as a grown ass man lol. Looking for other movies that might scratch that same itch. Here are some of the elements I love about it, to help with matching:\n\n-The atmosphere of like 1930s mob gangsters, jazz music, big city, almost noir-like feel to it.\n\n-Pulling off a great balance of being both fun and sincere (Stanley Ipkiss is the best of both worlds Jim Carrey).\n\n-Good believable performances by side characters like Cameron Diaz, whoever plays Dorian Tyrell, and even the annoying detective character.\n\nAnyway, I could keep rambling on, but hopefully you get the idea. I'm sure theres nothing quite the same, but if anything comes to mind that matches this style that I could enjoy as an adult, I'd love to hear it. \n\n",
        "upvotes": 5,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1hu7ga0/recommendations_for_a_movie_like_the_mask_1994for/"
    },
    {
        "id": "1htcmpw",
        "author": "Garmou",
        "title": "Is Napoleon (Director's Cut) any more enjoyable than the dull regular cut?",
        "content": "When it came out, I was super stoked to see Napoleon based on the very promising trailer. Scott, Phoenix, what could go wrong? Well, turns out a lot. It felt empty, incoherent, jumping from event to event without being embedded in a proper story arc that connected everything. It was a huge disappointment for me. Now I just noticed that a Director's Cut exists, which leaves me twisted: I'm kinda interested to see whether that cut makes up for the weaknesses of the original... But then again I wouldn't wanna waste yet another 3,5 hours. Has anyone been able to compare the two versions yet? ",
        "upvotes": 339,
        "comments": 202,
        "media": null,
        "permalink": "/r/movies/comments/1htcmpw/is_napoleon_directors_cut_any_more_enjoyable_than/"
    },
    {
        "id": "1hu8se8",
        "author": "undeadsabby",
        "title": "Obsessive Films about the Filmmaking/Storytelling Process",
        "content": "Showing my husband some obscure films he'd never seen: The Cable Guy, Barton Fink, and Shadow of the Vampire, all films with an obsessive/difficult friendships, with heavy references to films or storytelling.\n\nWhat other films are like this? A Different Man may count, but I've seen it recently. The Unbearable Weight of Massive Talent even counts cause of Nic Cage's relationship with himself and his films.  \n  \nFilms that I haven't seen that may fit are Adaptation, Bowfinger, Being John Malcovich...?   \nThey do not have to be very funny or very dark, but surreal is encouraged.   \nForeign film recommendations are encouraged too, of course. ",
        "upvotes": 2,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1hu8se8/obsessive_films_about_the_filmmakingstorytelling/"
    },
    {
        "id": "1ht3m5q",
        "author": "Anchor_Aways",
        "title": "What We Lose When Streaming Companies Choose What We Watch",
        "content": "",
        "upvotes": 1612,
        "comments": 298,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2Z9_fu6-Eop5LX6sQiDYZ7UfrFSnUNchaIwS0cXLQ5M.jpg?auto=webp&amp;s=7df8d311f879aaf4528bd979971ad224944762b9"
        },
        "permalink": "/r/movies/comments/1ht3m5q/what_we_lose_when_streaming_companies_choose_what/"
    },
    {
        "id": "1htz7bx",
        "author": "nlightningm",
        "title": "Just finished Fractured (2019). [SPOILERS]",
        "content": "Weird way to make a movie. My wife and I enjoyed the ride, it's at least fun and riveting to watch and figure out what it's leading up to\n\nThe movie has some issues in my opinion, and obviously the whole Shutter Island plot is obvious from the get-go basically as soon as you know he's both a recovering alcoholic after having driven drunk.\n\nMy maim things are\n- What's actually real? \n\n&gt;&gt;&gt; Were the police real people involved in the investigation, or did they just happen to be there when he was leaving? They were too agreeable to not be Shutter Island-esque plants. But prior to that it doesn't seem like the hospital is at all trying to push any investigation. \n\nIt seems like the therapist lady was guiding the investigation, but it was unclear at what point that was the *purpose* of him being there, since finding the bodies didnt seem like an important or relevant point until she showed up. \n\n&gt;&gt;&gt; DOES he lock them in the gas station? How the frick does he steal the cop car? \n\n&gt;&gt;&gt; DOES he actually kill the security, break in and manage to kidnap a guy? And no one stops him?! What??? Did he actually shoot the oxygen tap and blow up the OR and shoot Bruce? Or is that in his imagination?\n\n\n- Why are there so many small seeds they plant that are more of poor misdirects rather than intentional red herrings?\n\n&gt;&gt;&gt; besides some message of masking trauma and parallels to him losing a wife and child, as well as tying in his alcoholism, how does the previous wife plot have any relevance? Not saying I don't get it, but they could've basicslly.cut that whole thing and it wouldn't make a difference to the main plot.\n\n&gt;&gt;&gt; The LL floor thing is wacky to me. What are the chances that it actually IS the organ donation floor?? I mean, he saw them go down there assuming it was cor a CAT scan and is none the wiser, he finds out at some point that they genuinely harvest organs, AND it's ACTUALLY on the floor he saw them going to? Puh-leeease!!\n\n&gt;&gt;&gt; How was Peri's scarf in there? He brought it in when he got treated? \n\n&gt;&gt;&gt; If he was coming in being treated for a car crash, why would no one have checked his car out? Looked out the window even? \n\nTons of other things to point at, but these are some of the glaring flaws. \n\nI feel like because of some things they did in thus movie, they missed some good opportunities. In some areas, it's utterly predictable. In others, they do a weird twist that contradicts something established earlier in the plot.\n\nIt would've been better if they didn't show MC having fallen into the pit. The viewer knowing that he has untreated head trauma makes it obvious that everything is in his head. It's been said before, but it would've actually been better if they made him seem delusional to trick him into not realizing it was a REAL evil organ-harvesting hospital.\n\nNonetheless, San Worthington is STELLAR in this movie, and it definitely had me on the edge of my seat wanting to know what exactly is going on and what'll happen next.\n\n\n\nHoly frick that was long.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1htz7bx/just_finished_fractured_2019_spoilers/"
    },
    {
        "id": "1hto30j",
        "author": "AdSpecialist6598",
        "title": "Are you more forgiving of movies if the cast and crew are giving all they got and are clearly enjoying themselves?",
        "content": "For context I grew up on Hong Kong and other Asians film that outside of your big hits like Protect A etc. are b grade flair even the cast and crew fully admit that many of those films were shlock but as many of them said those films were made with a shoestring budget, tight time tables and a lot of times incomplete scripts they had to wing it. None the less they put their best foot forward and have fun with it. Partly because as I learned watching interviews unless you were a big star part of your pay depended on how well the movie does and if you are in movie at all so you couldn't phone in. That plus the fact that you work with the same people over and over who often times live in the same area run a side business that everyone goes to etc. So, for me even if the movie is bad if the actors and crew are giving their all and enjoying themselves I can forgive it and in many cases enjoy it.\n\n",
        "upvotes": 47,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1hto30j/are_you_more_forgiving_of_movies_if_the_cast_and/"
    },
    {
        "id": "1ht70sx",
        "author": "kaybrg",
        "title": "Best and Worst A24 Films??",
        "content": "I honestly have yet to see an A24 film that i hate or don’t like. They have all been decently thought provoking for me, so thats enough for me to not “hate” it. \n\nFor me, id say the best (my favourites) have to be \n•Hereditary\n•Everything Everywhere All At Once\n•Talk To Me\n•The Florida Project \n•Waves\n•Babygirl (mainly for the soundtrack)\n\nIm curious to know what A24 films other people loved or hated. And which ones you highly recommend people see. :) ",
        "upvotes": 891,
        "comments": 884,
        "media": null,
        "permalink": "/r/movies/comments/1ht70sx/best_and_worst_a24_films/"
    }
]