[
    {
        "id": "1jwessd",
        "author": "SonyPictures",
        "title": "We’re the Director (David F. Sandberg) and Producer/Writer (Gary Dauberman) for Until Dawn. AMA tomorrow, Friday April 11 at 11am PST on r/movies",
        "content": "[Until Dawn Movie Director David F. Sandberg, \\(Annabelle: Creation, Lights Out\\) and Producer\\/Writer Gary Dauberman, \\(Annabelle Comes Home, IT Chapter Two, The Nun\\) are answering all your questions tomorrow, April 11! Check back at 11am PST\\/2pm EST and get your tickets for Until Dawn, in theatres April 25th. ](https://preview.redd.it/ww5wbu6w34ue1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=7e6f083dfc27d3adee94d67a9a2970ca55d4746c)\n\n&gt;Thanks so much for all of the great questions! Make sure to see Until Dawn in theatres April 25. ",
        "upvotes": 63,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1jwessd/were_the_director_david_f_sandberg_and/"
    },
    {
        "id": "1jxf29i",
        "author": "StevenSanders90210",
        "title": "Warner Bros. Discovery's David Zaslav's Pay Rises to $52 Million",
        "content": "",
        "upvotes": 1636,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vqxYOmQ3D63_7pKVmE4rRNgxoce_1R49ao0IwTFrxRY.jpg?auto=webp&amp;s=40230cd744989b00622e0ba3700faf314363ad2a"
        },
        "permalink": "/r/movies/comments/1jxf29i/warner_bros_discoverys_david_zaslavs_pay_rises_to/"
    },
    {
        "id": "1jxjp5d",
        "author": "cmaia1503",
        "title": "New image of Aaron Taylor-Johnson &amp; Alfie Williams in Danny Boyle’s ‘28 Years Later’",
        "content": "",
        "upvotes": 710,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nx4t2bau8fue1.jpeg?auto=webp&amp;s=f0f5b0194bc9bf49078f6a401eb98d1c63547eb0"
        },
        "permalink": "/r/movies/comments/1jxjp5d/new_image_of_aaron_taylorjohnson_alfie_williams/"
    },
    {
        "id": "1jx8ze9",
        "author": "Sonia341",
        "title": "Warner Bros. Confirms New ‘Gremlins’ Movie and ‘Beetlejuice Beetlejuice’ Sequel",
        "content": "",
        "upvotes": 2150,
        "comments": 594,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xFY8a4j0L1cSZ530I0Gl-todRIOanX6TGteWf6fBdaU.jpg?auto=webp&amp;s=01ec31b4c4f75831b59c3201d5816050cfc9f54e"
        },
        "permalink": "/r/movies/comments/1jx8ze9/warner_bros_confirms_new_gremlins_movie_and/"
    },
    {
        "id": "1jwyr9i",
        "author": "West_Conclusion_1239",
        "title": "Gladiator II made me finally understand the greatness and uniqueness of Russell Crowe's iconic performance.",
        "content": "When i was a kid and watched Gladiator, i obviously thought Russell Crowe was great as Maximus, but in the following years i never necessarily understood why he won an Oscar for it.\n\nIt's not the typical role and performance for which you are considered worthy of an Oscar, it's not a baity biopic about a real-life famous and beloved figure or an arthouse challenging auteur-driven project, it's an heroic figure in a sandal and sword blockbuster.\n\nWhat could be so great about this performance that you even win an Oscar for it??\n\nI didn't get it until recently when i saw on theaters the awaited sequel.\n\nGladiator II and Paul Mescal's performance in it (and i really like him as an actor) made me revalue and understand how hard it is to play convincingly an heroic role like that and how easy and effortless Crowe made it look like.\n\nIt's an iconic performance that still resonates today, but not necessarily for reasons the general public thinks about.\n\nHe managed to do character-actor work, immersing himself into this character and creating a three-dimensional human being out of this two-dimensional role and also imbue it with huge and rugged movie star charisma and such fierce intensity.\n\nWith Crowe's presence, there's such depth and gravitas into a role that on paper could have easily ended up being so flat and dull in the hands of many and many other actors, even good ones.\n\nHe's stoic, but never dull or uninteresting, he's absolutely magnetic, always elevating every scene with a ferocious potency.\n\nIt's almost a throwback to those powerful, big, theatrical, and commanding performances you would see on those sword and sandal epics of the 40s-50s-60s, but updated, modernized, and made accessible for the audiences of the new millennium.\n\nIt's a hard feat he pulled off, much harder than many people think, it's simply not a performance you can just imitate and replicate, and watching recently Mescal trying to inhabit that same type of stoic character made me realize it much more.\n\nRussell's performance wasn't just \"playing the hero\" or the good soldier, there was a personality and specific characterization you can't just copy, an entrancingly unique magnetism you can't just hope to recapture on film.\n\nHe's not just great, like i always thought, but quite frankly, no other actor in the world could have played Maximus and suddenly turn it into an Oscar winning role.\n\nIt's an unusual, unique, and absolutely deserved Oscar win, and a reminder of Crowe's unique talents and why he became a full fledged movie star after always having been a great actor.\n\nI hope one day we will see him again in another role worthy of him and make a great comeback.\n\n\n",
        "upvotes": 4082,
        "comments": 499,
        "media": null,
        "permalink": "/r/movies/comments/1jwyr9i/gladiator_ii_made_me_finally_understand_the/"
    },
    {
        "id": "1jwz3xf",
        "author": "MarvelsGrantMan136",
        "title": "Ted Kotcheff, ‘Rambo: First Blood’ and ‘Weekend at Bernie’s’ Director, Dies at 94",
        "content": "",
        "upvotes": 3319,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mTtYFWDTgV0YcUUcM9yFFbYEo58Qgwz28xMFNDvwAYM.jpg?auto=webp&amp;s=13c6ca5b918259be907f21016f50ff0b10203e9f"
        },
        "permalink": "/r/movies/comments/1jwz3xf/ted_kotcheff_rambo_first_blood_and_weekend_at/"
    },
    {
        "id": "1jx7c61",
        "author": "BikeOk4256",
        "title": "I still stand by this being one of the best openings to a movie period (Willy Wonka and the Chocolate factory)",
        "content": "From its visuals of the chocolate process, to the beautiful orchestral soundtrack accompanying it; I can't stress that this opening, especially it's ost especially brings a tear to my eye. It straight up sounds like heaven in the form of a song. Does this intro have a special place for anyone else? ",
        "upvotes": 954,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/idq8k3gzgbue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jx7c61/i_still_stand_by_this_being_one_of_the_best/"
    },
    {
        "id": "1jxh90r",
        "author": "BunyipPouch",
        "title": "Alan Ritchson &amp; Arnold Schwarzenegger Christmas Comedy 'The Man With The Bag' Gets October 3 Theatrical Release Date",
        "content": "",
        "upvotes": 124,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3WT8iXUnKzPyK6tpzzQsSg3t3FXHTAd5LdfZCmvtKRA.jpg?auto=webp&amp;s=98e5e7e061f321afffc9af1cfd5006aa3551ea66"
        },
        "permalink": "/r/movies/comments/1jxh90r/alan_ritchson_arnold_schwarzenegger_christmas/"
    },
    {
        "id": "1jxk4s7",
        "author": "cmaia1503",
        "title": "New image of David Corenswet &amp; Nicholas Hoult in James Gunn’s ‘Superman’",
        "content": "",
        "upvotes": 83,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bxr2x2cacfue1.jpeg?auto=webp&amp;s=a9a94586c07d1e5f98a8015736989b986e5f9338"
        },
        "permalink": "/r/movies/comments/1jxk4s7/new_image_of_david_corenswet_nicholas_hoult_in/"
    },
    {
        "id": "1jx65on",
        "author": "BunyipPouch",
        "title": "Netflix's ‘Enola Holmes 3’ Starring Millie Bobby Brown Begins Filming in the UK",
        "content": "",
        "upvotes": 646,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0-vEB-ywjS5o7lh8rvEtooIH1IZc8CldgJjKr5LezfI.jpg?auto=webp&amp;s=02669da2aa19b3cb6b96f74b21f93a7fe7691056"
        },
        "permalink": "/r/movies/comments/1jx65on/netflixs_enola_holmes_3_starring_millie_bobby/"
    },
    {
        "id": "1jxcf3q",
        "author": "jaguarp80",
        "title": "Everest (2015) is a surprisingly well crafted movie",
        "content": "Found it on Netflix and just finished watching, don’t remember seeing anything about it when it came out.\n\nStars Jason Clarke, Josh Brolin and Jake Gyllenhaal. They had top billing for obvious reasons, Brolin and Gyllenhaal are what attracted me to it, but there’s a lot of actors sharing the screen and they’re all top notch in this movie.\n\nI decided to watch it despite thinking to myself “okay, this is gonna be one of those movies that I can go ahead and play in my mind with probably 70% accuracy.” I thought it was gonna be superficial and formulaic - it was not.\n\nIt’s based on a true story of a disaster on Mt Everest in 1996. Won’t go into more detail than that to avoid spoilers.\n\nI doubt the movie would blow anybody’s mind but it’s just a really good, solid film. There’s a lot of human drama that felt very genuine to me, no melodrama. No cheesy dialogue. No caricatures. No actors hamming it up or overacting, in my opinion. No major genre cliches that I can recall. In fact I feel that it’s the type of movie that kinda defies genre, although you could categorize the themes well enough.\n\nPlot wise I didn’t find it predictable at all. If you’re already familiar with the story then I think you’ll find that the events aren’t portrayed predictably. No cheap thrills or cheap sentiment, just real ones. It made me feel shit.\n\nThe cinematography is great, there’s a lot of astounding shots of the mountain and surrounding environment. I don’t know if it was IMAX, but I’d have to assume it was because of some of the photography that just screams IMAX. Watch it on your biggest screen\n\nLong story short, I was expecting to accept a certain degree of eye rolling bullshit but there was none to be found. Really solid movie, it impressed me a lot.",
        "upvotes": 172,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1jxcf3q/everest_2015_is_a_surprisingly_well_crafted_movie/"
    },
    {
        "id": "1jwrf71",
        "author": "indiewire",
        "title": "Pam Grier Says 'Blaxploitation' Term Was Meant to Deter Black Audiences",
        "content": "",
        "upvotes": 4146,
        "comments": 370,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_9zKtP7IUSyx5dS4uRzbabUeqqkzto_51oyD7LGdHYk.jpg?auto=webp&amp;s=983e20d04bd412c1bab410b460e2ded6491b8e0d"
        },
        "permalink": "/r/movies/comments/1jwrf71/pam_grier_says_blaxploitation_term_was_meant_to/"
    },
    {
        "id": "1jx6di6",
        "author": "lostartz",
        "title": "Tornado - Official Trailer",
        "content": "",
        "upvotes": 431,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H2b9KgenXpWLtgHb1ptgGtq6zXfJXho8hN-YmM-XfMg.jpg?auto=webp&amp;s=07958c5f5516b8a90462505f1f751e9c460652a7"
        },
        "permalink": "/r/movies/comments/1jx6di6/tornado_official_trailer/"
    },
    {
        "id": "1jxbjxq",
        "author": "WartimeHotTot",
        "title": "The Watcher in the Woods (1980) was a Disney movie and it gave me nightmares for years.",
        "content": "This aired on the Disney Channel. _The Disney Channel!_ I watched it when I was five years old and it scared the absolute shit out of me. \n\nMy five-year-old niece was recently watching something and I heard her whine. I went into the room and she was covering her eyes, very distressed. I asked her what was wrong and she said the show was too scary. I asked her what was scary and she said the soup the character was eating was too hot and it burned his mouth. \n\nI’m so glad she’s getting scared by soup and not getting terrified out of her mind by stuff like this. ",
        "upvotes": 154,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L4e948DbkQvRNq4N_Xm7bctgXwsAIZUMG_eArMzoFQ0.jpg?auto=webp&amp;s=dc0d5a475c0f28f91dcc23e62d3000084eff1272"
        },
        "permalink": "/r/movies/comments/1jxbjxq/the_watcher_in_the_woods_1980_was_a_disney_movie/"
    },
    {
        "id": "1jxgxbo",
        "author": "joesen_one",
        "title": "Official trailer for Chie Hayakawa's RENIOR - a young girl navigates adolescence and family struggles in 1980s Tokyo",
        "content": "",
        "upvotes": 45,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QJYAuNPoDI3wAH2Tpnf_POVxgGIBFsFoGklPDCbl4cc.jpg?auto=webp&amp;s=ade4cf4b69aa342eeaae7ac587a4f9166a35ee0b"
        },
        "permalink": "/r/movies/comments/1jxgxbo/official_trailer_for_chie_hayakawas_renior_a/"
    },
    {
        "id": "1jxdz8a",
        "author": "Putrid-Guest-4426",
        "title": "Perspective change on the truman show",
        "content": "\nJust finished rewatching The Truman Show for the first time since I was a teenager, and I'm genuinely stunned by how prophetic this film was.\n\nBack in 1998, the idea of someone's entire life being broadcast 24/7 seemed like pure science fiction. Now we literally have people voluntarily documenting every aspect of their lives for strangers online.\n\nThe scene where Truman realizes patterns in his world (same people walking past at the same time) reminds me of how recommendation algorithms keep showing us the same content. And when he tries to leave town but encounters obstacles? That's basically what happens when we try to disconnect from social media - there's always something pulling us back in.\n\nThe most haunting part was when Truman asks \"Was nothing real?\" That question hits harder now when we're all curating these perfect online versions of ourselves.\n\nAnyone else revisit older films that seem to predict our modern reality in ways that weren't obvious when they were released?\n",
        "upvotes": 72,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1jxdz8a/perspective_change_on_the_truman_show/"
    },
    {
        "id": "1jwowlg",
        "author": "beatboxxx69",
        "title": "Austin Powers movies are a joy to watch in 2025",
        "content": "I'd had fond memories of the Austin Powers movies, but I hadn't watched them since they'd come out and I was much younger and more immature, and times were different. To be honest, I was afraid to watch them again because I figured I'd find them to be immature and dated.\n\nBut, I'd run out of movies I'd wanted to watch, and I figured I'd give them a re-watch all these years later. Oh, boy, was I impressed. They were all truly a delight to watch from start to finish.\n\nFortunately, I'd forgotten most of what happens during the films. There are scenes and jokes that I remembered, but they were also fun to watch because they're performed so well. Absolute classics. Then, the rest, had me laughing on the inside and the outside.\n\nNowadays, there aren't that many movies that I find truly joyful to watch from start to finish, but these movies all met the mark. When I first saw Goldfinger, I didn't even know who Beyonce was xD.\n\nI don't think there's been comedy like this since the last time it came out.",
        "upvotes": 2309,
        "comments": 426,
        "media": null,
        "permalink": "/r/movies/comments/1jwowlg/austin_powers_movies_are_a_joy_to_watch_in_2025/"
    },
    {
        "id": "1jx5xay",
        "author": "Quick_Silver2278",
        "title": "\"Crazy Stupid Love\" Steve and Gosling - what a duo",
        "content": "So I was up through the night and had a hotstar subscription so I decided to watch something to light my mood and picked up this fine piece of writing. The movie begins with a divorce, goes through crazy casanova playboy teachings and ends in perfect harmony of soulmate-y relationships of lead and side casts. \n\n'Crazy how stupid love is'\n\nI mean what made Emily cheat on a stable employed Cal and what made Jacob get into a committed relationship; Jacob meeting Cal crying and telling the tale of his divorce, turning him into a suave person and giving him lessons on how to pick up girls and then Jacob literally picking up a girl(Hannah), it was such intricate and finely connected as the teacher turns out to be first women picked by Cal from the bar and that line he used to pick her up...\n\nLove is jumbled and comes with alot of faucets you open the wrong one and you are in for a long time of regrets and self isolation.",
        "upvotes": 191,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1jx5xay/crazy_stupid_love_steve_and_gosling_what_a_duo/"
    },
    {
        "id": "1jwzgxi",
        "author": "Kudoshinichi0007",
        "title": "After all these years, I finally watched Grave of the Fireflies… and I’m broken.",
        "content": "I went into *Grave of the Fireflies* completely clueless , I had no idea what to expect. But by the time the movie ended, only one thought kept echoing in my mind:\n\n**“Whoever starts the war, no matter who wins or loses, the ones who truly suffer are the people just trying to survive it.”**\n\nThe pain, the sorrow, the daily struggle of those living through wartime…it’s unmatchable. Unless you've lived it, you can never truly understand it. And I was in tears by the end.\n\nI came across some online discussions where people were blaming Seita, the brother, saying his pride got them killed. But honestly? I don't agree. During a war, everyone is pushed to the edge , there’s food scarcity, fear of sudden death, bombing raids. Every morning, you wake up wondering if you’ll live to see another day. In that kind of world, the mind doesn't function normally.\n\nEven the aunt, who many view as cruel, was also a victim of the war. You could see how it was mentally breaking her. Seita and Setsuko were just children. Seita had just lost his mother, had no contact with his father or relatives, and on top of that, he had a little sister to protect. How is a child supposed to carry all that?\n\nPeople say it was pride...but if it was, would he have risked stealing food again and again, even after getting beaten, just to feed his sister? That’s not pride. That’s pure, desperate love. He didn’t have an adult to guide him. He was just a boy, doing the best he could in a world that had collapsed around him.\n\nThis movie doesn’t draw a line between good and bad—it shows how **unfair** war is to everyone. And I think this is the **saddest movie I’ve ever seen in my life**. I don’t want to watch it again... but I truly believe *everyone*, especially our generation, needs to see it **at least once**. You’ll learn something that no book or lecture can teach.\n\nAlso, that background music , Absolutely unforgettable. And that fireflies scene... the red glow, Seita and Setsuko sitting together on the bench in the night ,that image is forever engraved in my heart.\n\nThis movie... it’s more than a story. It’s an experience. And I’ll never forget it.",
        "upvotes": 356,
        "comments": 184,
        "media": null,
        "permalink": "/r/movies/comments/1jwzgxi/after_all_these_years_i_finally_watched_grave_of/"
    },
    {
        "id": "1jwtrsi",
        "author": "KillerCroc1234567",
        "title": "Josh Holloway To Star In Western ‘Flint’ Based On Louis L’Amour Novel",
        "content": "",
        "upvotes": 585,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SfrGhfi5HuyWw1lCMttMAnRbynFDSJYoUoehzVo9o30.jpg?auto=webp&amp;s=55bcfad23b20eb18a0a8668c06723c4e18a49d05"
        },
        "permalink": "/r/movies/comments/1jwtrsi/josh_holloway_to_star_in_western_flint_based_on/"
    },
    {
        "id": "1jxcllm",
        "author": "These_Feed_2616",
        "title": "Robert De Niro’s performance in Raging Bull is one of the best performances in film history",
        "content": "Robert De Niro is my favorite actor, and this performance is his crowning achievement. This was basically the first performance where an actor gained a lot of weight for the role which inspired many other actors to do the same thing to this day. His performance is raw, unfiltered, angry, and completely believable as Jake LaMotta. This performance is right up there with Brando in The Godfather and Daniel Day Lewis in There Will Be Blood. This film is just a perfect character study of a violent guy slowly destroying his own life professionally and personally. The black and white was perfect for this film as well, it almost made the boxing scenes feel more vicious in a weird way. The scene in jail where he’s punching the wall and crying and screaming is some of the finest acting you could ever see. He completely deserved his Oscar for this film.",
        "upvotes": 29,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1jxcllm/robert_de_niros_performance_in_raging_bull_is_one/"
    },
    {
        "id": "1jx7wh4",
        "author": "Outside-Pear9429",
        "title": "Best movies about cults/brainwashing that are maybe too realistic for comfort?",
        "content": "Been thinking a lot about the dangers of cults lately for reasons maybe some of you can understand. What are your favorite movies (fiction or very loosely based in actual events) that center around cults or mass brainwashing that really did a good job capturing the consequences or impacts and ideally were also well-acted? ",
        "upvotes": 76,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1jx7wh4/best_movies_about_cultsbrainwashing_that_are/"
    },
    {
        "id": "1jxde5n",
        "author": "HighwayCommercial702",
        "title": "Which movie do you often think about from time to time, even years after watching it?",
        "content": "I saw Ran's 4k restoration in my local theater last week. I hadn't see it for at least twelve years on TV and it just hit me that every other week when I'm daydreaming at work between lines of codes I keep thinking \"man, this ending was so dark.\" And I get flashes from the burning castle.\n\nA friend has the same thing with The Mothman Prophecies when he had to pick up a phone receiver.\n\nIs there a movie, maybe not your favorite, that keeps popping in your head at the most unexpected times?",
        "upvotes": 23,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1jxde5n/which_movie_do_you_often_think_about_from_time_to/"
    },
    {
        "id": "1jwu6au",
        "author": "ChiefLeef22",
        "title": "Man On Fire: Jayson Dumenigo To Become Third Stunt Man In Movie History To Earn Oscar Recognition Thanks To His Burn Gel | His spectacular fire work on the upcoming John Wick spinoff 'Ballerina' prompted Dumenigo to finally submit himself for the Awards",
        "content": "",
        "upvotes": 455,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HZ6ulzcf9W4p1l1ssFV-ACKL93heMOcEr7bAM7ukbR0.jpg?auto=webp&amp;s=c3afec59a232436eadb577b3b3d66d44ca952f8a"
        },
        "permalink": "/r/movies/comments/1jwu6au/man_on_fire_jayson_dumenigo_to_become_third_stunt/"
    },
    {
        "id": "1jxc53l",
        "author": "Chemical-Ad8073",
        "title": "War of the Worlds (2005)",
        "content": "Rewatching War of the Worlds. When I first watched it back in 05 I hated Ratchel, she was whiney and annoying and her high pitched screaming irritated me. Now, after about 10 years I have 2 daughters and I 100% empathize with her. I can’t imagine trying to keep my kids alive in an apocalyptic environment when they won’t even listen to me long enough to make sure their school iPads are charged. Still an 8/10 movie at the end of the day but my viewpoint on this movie has changed with the times. ",
        "upvotes": 19,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1jxc53l/war_of_the_worlds_2005/"
    },
    {
        "id": "1jwz9ir",
        "author": "indiewire",
        "title": "Why New Stunt Oscar Will Become an Award for Best Action Design",
        "content": "",
        "upvotes": 142,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/54Bj9Znnjfn8hmGGRcHjZ-PQ5skyXsg-pkIq5W1up0U.jpg?auto=webp&amp;s=9d1f891a5211e67c14f4467bf47264fba42a9210"
        },
        "permalink": "/r/movies/comments/1jwz9ir/why_new_stunt_oscar_will_become_an_award_for_best/"
    },
    {
        "id": "1jxc7u0",
        "author": "Background-Zombie689",
        "title": "The Place Beyond the Pines",
        "content": "Luke's life is a series of bad decisions... he's not a bad person, he just doesn't know how to make the good choices. And all of this had bad consequences on him and his entire family.\nSuch a tragic story. But such a masterpiece movie\n\n\n\"If you ride like lightning, you're gonna crash like thunder\"\n\nOne of the best movies ever hands down is go as far as to say it's one of the best movies ever just my opinion.",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1jxc7u0/the_place_beyond_the_pines/"
    },
    {
        "id": "1jw8ak1",
        "author": "cmaia1503",
        "title": "Oscars: Film Academy Establishes Stunt Design Award",
        "content": "",
        "upvotes": 5974,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8fOiQW9JPwAVE8DP2nfbb8UqjvWcKDNJXnpDxhOy_X0.jpg?auto=webp&amp;s=bc676d9c54fb69d9c8eb155fb2707cfa26194682"
        },
        "permalink": "/r/movies/comments/1jw8ak1/oscars_film_academy_establishes_stunt_design_award/"
    },
    {
        "id": "1jwrgyo",
        "author": "Dangerous_Treat_8074",
        "title": "Do you still prefer physical media for movies, even though digital streaming is so much more convenient?",
        "content": "When I was growing up, I used physical media all the time: VHS tapes, DVDs, Blu-rays. I remember going to the store or renting a movie and feeling a real connection to it. I used to collect DVDs and Blu-rays too, especially full series of movies I loved.\n\nThese days, with streaming platforms, everything is online and instantly available. It’s so convenient: you can watch whatever you want, whenever you want. The same goes for books and music.\n\nBut I wonder: do people still prefer physical media? Does anyone still collect Blu-rays or DVDs? Do you think physical media offers something digital just can’t replicate? Like, do you miss the experience of handling a book, album, or movie?\n\nI guess what I’m really asking is: do you miss that era of physical media, or are you glad we’ve moved on to everything being digital?",
        "upvotes": 169,
        "comments": 523,
        "media": null,
        "permalink": "/r/movies/comments/1jwrgyo/do_you_still_prefer_physical_media_for_movies/"
    },
    {
        "id": "1jwlotr",
        "author": "michajlo",
        "title": "Finally watched Arrival (2016) - Instant Favourite",
        "content": "For the longest time I've had this movie hidden away in my backlog, like a dowagers dark secret. Knew it was supposedly ambitious and the kind of movie that makes you think, but never bothered to read up on it, and I'm glad I didn't spoił it for myself.\n\nA great sci fi story, and probably the most interesting alien movie out there. Granted, I may be biased because I did study linguistics, so the movie was right up my alley, but I get the feeling it's be quite intriguing even if you're not into that particular science.\n\nI am giving the movie a big, fat, enthusiastic 9/10, and now I want to continue with the alien motif. I'll go for Sputnik either tonight or tomorrow, but can't decide what movie to pick as the third. Any recommendations?",
        "upvotes": 423,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1jwlotr/finally_watched_arrival_2016_instant_favourite/"
    },
    {
        "id": "1jxffy0",
        "author": "SarcasticFish69",
        "title": "(Ont, Canada) Place to buy physical 4K media?",
        "content": "Other than Amazon, that’s the last option. I previously went to Sun Rise Records, but last night I went to check out some movies and they had up to DOUBLED the prices on most movies. LOTR went from $79 to $149, Interstellar, The Batman, Dune 1/2 were all upped to almost $40. Breaking Bad was up to $160. Sadly, while this hobby has never been cheap, that seems more like price gouging. I haven’t found any other stores that have a good collection outside of just the most recent movies, so please any recommendations would be much appreciated.",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1jxffy0/ont_canada_place_to_buy_physical_4k_media/"
    }
]