[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r4ny32",
        "author": "SgomberiTorino",
        "title": "Come organizzare uno sgombero economico senza buttare soldi (consigli pratici)",
        "content": "Ciao a tutti,\n\ncondivido alcuni consigli pratici per chi deve organizzare uno sgombero (cantina, garage, appartamento) e vuole risparmiare, evitando fregature o costi inutili:\n\n\t1.\tFai una selezione prima\n\nDividi gli oggetti in 3 categorie:\n\n– da tenere\n\n– da buttare\n\n– da regalare / vendere\n\nMeno roba = meno tempo = meno costo.\n\n\t2.\tVerifica se qualcosa ha valore\n\nMobili vecchi, elettrodomestici funzionanti, libri o oggetti vintage possono ridurre il prezzo finale se recuperabili.\n\n\t3.\tChiedi sempre un sopralluogo (anche via foto)\n\nEvita preventivi “a caso”. Foto chiare o un sopralluogo evitano sorprese.\n\n\t4.\tAttenzione allo smaltimento\n\nChiedi sempre se lo smaltimento in discarica è incluso nel prezzo. È una delle voci che fa lievitare i costi.\n\n\t5.\tOrari e accessi contano\n\nPiani alti senza ascensore, ZTL, cortili stretti: se li comunichi prima, eviti rincari all’ultimo momento.\n\n\t6.\tConfronta più preventivi, ma diffida dei prezzi troppo bassi\n\nSpesso nascondono costi extra dopo.\n\nSe avete esperienze, errori da evitare o altri consigli utili, condividete 👇\n\nPuò essere utile a molti.",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2xzm0cudehjg1.jpeg?auto=webp&amp;s=d3225dd114e707555c51eca7c9a58cae777ae96c"
        },
        "permalink": "/r/torino/comments/1r4ny32/come_organizzare_uno_sgombero_economico_senza/"
    },
    {
        "id": "1r4ionq",
        "author": "SgomberiTorino",
        "title": "Sgomberi e traslochi a Torino: cosa conta davvero quando si sceglie un servizio?",
        "content": "Ciao a tutti,\n\nsto lavorando nel settore sgomberi e piccoli traslochi a Torino e mi capita spesso di parlare con persone che hanno avuto esperienze molto diverse, sia positive che negative.\n\nMi incuriosisce sapere da chi vive a Torino o dintorni:\n\n\t•\tCosa guardate per prima cosa quando dovete svuotare una cantina, un alloggio o un garage?\n\n\t•\tPrezzo basso, velocità, affidabilità o smaltimento corretto?\n\n\t•\tVi è mai capitato di avere brutte sorprese (costi extra, ritardi, lavori fatti male)?\n\nLo chiedo perché nel mio lavoro cerco di capire cosa conta davvero per i clienti, non solo offrire un servizio ma farlo nel modo giusto.\n\nSe avete consigli o esperienze da condividere, sono benvenuti 👍\n\nGrazie!",
        "upvotes": 6,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zsza5w0i7gjg1.jpeg?auto=webp&amp;s=847c47c10a710b08bbe9d6eb2efa4c233da08462"
        },
        "permalink": "/r/torino/comments/1r4ionq/sgomberi_e_traslochi_a_torino_cosa_conta_davvero/"
    },
    {
        "id": "1r4hndn",
        "author": "Trim0din",
        "title": "Opinioni zona Regio Parco",
        "content": "Buongiorno a tutti, sto cercando casa per trasferirmi e non ho mai vissuto a torino nord, non ho idea di come sia questa zona. \n\nI miei dubbi più grandi sono su sicurezza, parcheggi per l’auto e servizi, avete opinioni/esperienze da condividere? \n\nGrazie mille",
        "upvotes": 5,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p8ntgzslwfjg1.jpeg?auto=webp&amp;s=375c3b8847817b3c2fd47ad4c61ceca86d4f82dd"
        },
        "permalink": "/r/torino/comments/1r4hndn/opinioni_zona_regio_parco/"
    },
    {
        "id": "1r4kjc8",
        "author": "Garaad252",
        "title": "Bardonecchia trip tomorrow ; any tips?",
        "content": "Hey everyone! I’m heading to Bardonecchia tomorrow and wanted to ask:\n\nAny last-minute tips, things to see, places to eat, or activities worth doing? I’m open to skiing, easy walks, or just exploring the town. Thanks",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r4kjc8/bardonecchia_trip_tomorrow_any_tips/"
    },
    {
        "id": "1r4k9fy",
        "author": "Such-Confusion-438",
        "title": "Bibliomediateca Mario Gromo: come richiederete di consultare un libro?",
        "content": "In sintesi, sto scrivendo una tesi e necessito di un libro in particolare che non riesco a trovare da nessuna parte. L’unico posto che ce l’ha é la Bibliomediateca Mario Gromo, ma volevo chiedere: é necessario prenotarsi? Oppure posso presentarmi direttamente lì e richiedere di consultare il libro in questione? Grazie.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r4k9fy/bibliomediateca_mario_gromo_come_richiederete_di/"
    },
    {
        "id": "1r3plwr",
        "author": "Accurate-Ad-5223",
        "title": "La cazzo di GTT",
        "content": "Ragazzi: ma è possibile che la GTT mi chieda il biglietto quando sono già scesa dal bus? So che è parte del loro regolamento, ma il fatto che una cosa sia \"codificata\" non la rende più legittima, al massimo ne fa un abuso di potere istituzionalizzato. Cioè ma cazzo, un ragazzo stava correndo verso la stazione perché evidentemente gli partiva il treno, e sto pirla del controllore gtt gli si parava davanti e non lo lasciava andare, gli ha pure schiacciato in faccia il suo cazzo di distintivo. NON FUNZIONA COSI'. Se di pomeriggio un carabiniere mi chiede se di mattina indossavo la cintura in macchina, io posso dirgli di no e lui non può farmi la multa. Devi cogliermi sul fatto! E se io avessi già buttato il biglietto gtt? Avete dei servizi di merda, sempre in ritardo, macchinette rotte, pochi mezzi e bus impallati di gente. Vaffanculo se non pago il biglietto per non fare due cazzo di fermate. Salvini merda",
        "upvotes": 51,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1r3plwr/la_cazzo_di_gtt/"
    },
    {
        "id": "1r4binw",
        "author": "askingquestions009",
        "title": "Travelling with a young child (1.5 years)",
        "content": "How safe would it be (coming from Asia)  \nHow many days would give us a sense of the city  \nIs Italian required to get around\n\nThanks (first time heading over!)",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1r4binw/travelling_with_a_young_child_15_years/"
    },
    {
        "id": "1r4hjhn",
        "author": "thdvl",
        "title": "Rugby 14/02",
        "content": "Posti consigliati dove vedere rugby oggi? 6 nations?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r4hjhn/rugby_1402/"
    },
    {
        "id": "1r4g0c5",
        "author": "RevolutionaryLog3631",
        "title": "Sto cercando un  negozio a Torino che",
        "content": "faccia stampe su abiti  (da lavoro) personalizzate.\n\nAvete presente tipo i trasferibili con ferro da stiro che comprate su amazon?\n\nSolo che mi servono delle scritte un pò più grandi rispetto alle dimensioni che propongono sul sito di e-commerce.\n\nQuindi io avrei un abito da lavoro con un logo ed una scritta e mi piacerebbe portarlo in un negozio fisico per farglieli copiare e mettere su un'altra giacca.\n\nsapete se c'è qualcosa di questo tipo a Torino?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r4g0c5/sto_cercando_un_negozio_a_torino_che/"
    },
    {
        "id": "1r4nq57",
        "author": "Comfortable_Room6619",
        "title": "Perché odio Torino?",
        "content": "Allora scrivo questo post in realtà sia per capire che cosa non vada con il mio rapporto con Torino, sia per conoscere nuove persone.\n\nSe un ragazzo di 23 anni nato e cresciuto a Torino da genitori, entrambi i torinesi. Ho sempre avuto la sensazione di non essere nel posto giusto a Torino sia perché mi sembra una città spenta sia perché la trovo generalmente noiosa. Ma questo probabilmente è dovuto anche al fatto che vado negli stessi posti con le stesse persone. Ogni volta che vado all’estero, realizzo che Torino non mi piace. Vorrei vivere in un posto più multiculturale e senza pregiudizi. \n\nL’unico momento in cui mi piace Torino e durante il Pride, un momento in cui mi sento di vedere la positività in questa città lontano dagli occhi indiscreti della gente.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1r4nq57/perché_odio_torino/"
    },
    {
        "id": "1r3lc6f",
        "author": "Naso_Coraggioso",
        "title": "Anche a Torino nelle Olimpiadi del 2006 c'era la stessa euforia che c'è per Milano-Cortina 2026 ?",
        "content": "",
        "upvotes": 24,
        "comments": 50,
        "media": null,
        "permalink": "/r/torino/comments/1r3lc6f/anche_a_torino_nelle_olimpiadi_del_2006_cera_la/"
    },
    {
        "id": "1r3tqxr",
        "author": "SpeakerEven6320",
        "title": "Nasty Club domani 14/02",
        "content": "Ciao, sono un ragazzo di 25 anni, qualcuno vorrebbe venire domani sera al Nasty Club?\n\nPreferibilmente ragazzi (maschi) dai 20 ai 27/28 anni, però dipende se si fa gruppo va bene chiunque.\n\nChi interessato può scrivermi in privato, grazie. ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1r3tqxr/nasty_club_domani_1402/"
    },
    {
        "id": "1r3u3q1",
        "author": "_Kacchan__",
        "title": "Corso Pizzaiolo",
        "content": "Ciao ragazzi,  \ncome da titolo, qualcuno ha fatto un corso che consiglia a Torino?  \nE' da un po' che ho il pallino, e adesso che ho un po' di tempo libero vorrei farlo.  \nGrazie!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r3u3q1/corso_pizzaiolo/"
    },
    {
        "id": "1r3y2x1",
        "author": "Responsible_Bag_7051",
        "title": "Convince me to not buy a house in Bruzzolo",
        "content": "It is close to skiing, the train, and I love that it is not in the city. Additionally, the house is only 20,000 (and ready to live in). Why should I not buy it?",
        "upvotes": 2,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1r3y2x1/convince_me_to_not_buy_a_house_in_bruzzolo/"
    },
    {
        "id": "1r3x9vh",
        "author": "Maleficent-Regret802",
        "title": "Dove comprare arachidi al wasabi",
        "content": "Vi prego ragazzi ne va della mia vita. All’Esselunga non ci sono, al Carrefour non ci sono, al Lidl non ci sono.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r3x9vh/dove_comprare_arachidi_al_wasabi/"
    },
    {
        "id": "1r2wte6",
        "author": "sbrodolino_21",
        "title": "Senso del biglietto GTT da 7,80€",
        "content": "Un biglietto giornaliero costa 3,70€. 3,70 x 2 = 7,40€.\nQual è dunque l'utilità del biglietto da 48h a 7,80€? Sfugge qualcosa a me?",
        "upvotes": 76,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1r2wte6/senso_del_biglietto_gtt_da_780/"
    },
    {
        "id": "1r3qrdh",
        "author": "Project-PhoenX",
        "title": "Quanto tempo spendiamo a trovare un parcheggio?",
        "content": "Ciao a tutti,  \nho creato un questionario anonimo sul tema parcheggio/tempo perso.  \nSe vi va di partecipare:  \n[https://survey.cloud-ixio.net/index.php/716789?lang=it](https://survey.cloud-ixio.net/index.php/716789?lang=it)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r3qrdh/quanto_tempo_spendiamo_a_trovare_un_parcheggio/"
    },
    {
        "id": "1r3lrww",
        "author": "No_Dark7733",
        "title": "Giro carino per San Valentino a Torino",
        "content": "Ciao a tutti,  \ncome scrivo da titolo \"sto inguaiato\". Come ogni anno mi trovo ad organizzare San Valentino l'ultima settimana, ovviamente è tutto stra pieno: facciamo i fighi che San Valentino non ci interessa, ma memore di tutti quelli passati in solitaria quando si era single, mi si tocca una debolezza a cui fatico tenere a bada. QUALCOSA DEVO ORGANIZZARE. Lo so è egositico, non giudicatemi troppo. Prima o poi mi passerà.  \nChiedo dunque parere per questo programma:  \nsiamo di Varese ed in meno di 2h saremmo  a Torino per le 20.30 circa, stavo pensando a questo giro sperando di salvarmi anche quest'anno:\n\nArriviamo a Torino e andiamo diretti al **Monte dei Cappuccini** per goderci 20–30 minuti di panorama e tranquillità insieme (magari mi porto una bottiglia di prosecco).  \nA piedi scendiamo poi verso **San Salvario** dove possiamo, spero, trovare facilmente un posto senza prenotazione per cenare o bere qualcosa.  \nDopo facciamo una passeggiata serale in **Piazza Vittorio Veneto** e lungo il Po, che di notte è molto suggestivo.  \nChiudiamo la serata con un cocktail o un dolce caldo in un locale intimo del centro, senza fretta.  \nÈ una roba un po' misera? Di base spendere non sarebbe un problema  (nel limite di un accordo già preso con la mia dolcissima metà di tenerci i soldi per le vacanze e non per sta festa), ma cazzarola è tutto stramaledettamente occupato! Inoltre volevo evitare il casino di Milano che nè io nè lei non sopportiamo più.  \nAvete qualche consiglio?  \nGrazie in anticipo.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r3lrww/giro_carino_per_san_valentino_a_torino/"
    },
    {
        "id": "1r3ll1c",
        "author": "yashonredit",
        "title": "Mask for masquerade ball",
        "content": "Where can I find cheap masks for masquerade ball?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r3ll1c/mask_for_masquerade_ball/"
    },
    {
        "id": "1r2nxrb",
        "author": "nazarthinks",
        "title": "Totally useless English interface in this GTT terminal",
        "content": "",
        "upvotes": 95,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MnlmazluZGt2MGpnMbEmHAdUL-FYl291wGWXNugHxZPr_wO623gq9VzLGEMH.png?auto=webp&amp;s=b42b0d1104a0efc87bba50eec37d4e86c68677c6"
        },
        "permalink": "/r/torino/comments/1r2nxrb/totally_useless_english_interface_in_this_gtt/"
    },
    {
        "id": "1r3i02u",
        "author": "jhndoe__",
        "title": "La Morra info",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r3i02u/la_morra_info/"
    },
    {
        "id": "1r2zmsb",
        "author": "garypaytontheglove20",
        "title": "Consigli su dove comprare casa in provincia di Torino con budget max 70k?",
        "content": "Ciao a tutti,  \nscrivo perché sto cercando di fare un po’ di ordine mentale e magari qualcuno qui può darmi uno spunto interessante. \n\nHo 44 anni, lavoro a Grugliasco, mia moglie lavora in zona Rivoli. Abbiamo un figlio piccolo. Attualmente siamo in affitto e tra affitto, spese condominiali e varie arriviamo tranquillamente intorno ai 900–1000 € al mese. La situazione affitti è diventata piuttosto pesante, quindi sto iniziando a valutare seriamente l’acquisto.\n\n   \nNon credo di potermi spingere oltre i 70.000 € di prezzo d’acquisto. Forse 75k tirando tanto la corda, ma vorrei restare prudente. Abbiamo un po’ di liquidità per anticipo e spese, ma non parliamo di cifre enormi. L’idea è fare un mutuo sostenibile senza impiccarmi per 30 anni con l’ansia.\n\nAltri dettagli importanti:\n\n* Lavoro a Grugliasco, quindi idealmente zona ovest/sud-ovest sarebbe più comoda.\n* Mia moglie al momento non ha la patente (la sta prendendo), quindi per ora dipendiamo molto dalla logistica.\n* Non siamo legati per forza alla cintura stretta tipo Rivoli/Collegno, anzi, se trovassi una casa bella e grande potrei anche accettare 35–40 minuti di macchina.\n* Non mi interessa Torino città, onestamente non mi fa impazzire e i prezzi nelle zone “decenti” sono comunque alti.\n\nMi sto guardando intorno un po’ ovunque:  \nVal di Susa, Valli di Lanzo, zona Pinerolo, direzione Carmagnola, verso Asti… ma faccio fatica a capire quali posti siano un buon compromesso tra:\n\n* prezzo case\n* qualità della vita\n* servizi minimi (scuole, supermercato, farmacia)\n* tempi reali di percorrenza verso Grugliasco/Rivoli\n\nNon cerco il paese perfetto, ma nemmeno un posto totalmente isolato dove ogni cosa è a 20 minuti.\n\nDomande per voi:\n\n1. Se aveste un budget massimo di 70k e lavoraste in zona Grugliasco, dove guardereste?\n2. Ci sono paesi che hanno ancora prezzi umani ma che non siano completamente “morti”?\n3. Qualcuno vive in posti tipo Lanzo, Villafranca d’Asti, zona Pinerolo, ecc.? Come vi trovate davvero nella vita quotidiana?\n4. C’è qualche zona che secondo voi è sottovalutata ma interessante?\n\nAccetto consigli, anche controintuitivi    \nSe devo fare il sacrificio dei 40 minuti, vorrei farlo per una casa che mi piace davvero, non per una mansarda che già so che non è casa mia.\n\nGrazie a chi avrà voglia di rispondere  ",
        "upvotes": 11,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1r2zmsb/consigli_su_dove_comprare_casa_in_provincia_di/"
    },
    {
        "id": "1r3rswm",
        "author": "Putrid-Physics-7285",
        "title": "Petizione Kid Yugi",
        "content": "Upvotare se si è rimasti delusi dal fatto che Kid Yugi ha escluso Torino dal suo tour nei palazzetti.\nFacciamo più upvote possibili in modo che gli arrivi e che cambi idea.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r3rswm/petizione_kid_yugi/"
    },
    {
        "id": "1r29uzr",
        "author": "KillerBossOriginal",
        "title": "Superga il 03/02/2026",
        "content": "",
        "upvotes": 198,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r29uzr/superga_il_03022026/"
    },
    {
        "id": "1r3b1xt",
        "author": "ryu468",
        "title": "any local clothing stores with decent quality?",
        "content": "Hi all! I'm an exchange student and just arrived in Turin. It's my first time here and in Europe. I've been trying to find some nice clothing stores that are local and not a chain (like Zara), but lots of recommendations I've seen on Reddit are either for men or from many years ago. \n\nDoes anyone have any suggestions? Would you suggest the Balon market or Mercato di Piazza Benefica is also good for finding decent quality but affordable clothes? I also can not speak Italian (am trying to learn!!) so if you think online shopping is better, let me know any websites!\n\nGrazie mille!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r3b1xt/any_local_clothing_stores_with_decent_quality/"
    },
    {
        "id": "1r33ff5",
        "author": "iruoo",
        "title": "Orange cigna, è sicura ?",
        "content": "Ciao ragazzi vorrei andare in questa palestra ma ho paura per la zona, essendo vicina a barriera\n\nLa considerate sicura ? Secondo voi avrei problemi ad andare in palestre 3 volte a settimana in bici più o meno la mattina ? Ho paura mi rubino la bici in 2 secondi, e penso non ci sia un parcheggio della palestra purtroppo... Se mi dite che le rubano facilmente penso che dovrò andare in bus o a piedi, ma in bici sarebbe stato molto comodo\n\nPoi chiedo in generale anche per la sicurezza, ma presumo chendi mattina non sia pericoloso o sbaglio ?",
        "upvotes": 1,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1r33ff5/orange_cigna_è_sicura/"
    },
    {
        "id": "1r2smlg",
        "author": "lospavaldo",
        "title": "cerco amicizie",
        "content": "io ho 18 anni e mi piacerebbe conoscere nuove persone di torino o ditorni.\n\nmi piace quasi tutti i generi di musica,l arte e leggere e sopratutto la montagna\n\ncome dal titolo cerco amici con cui fare progetti futuri tipo organizzare trekking,viaggi in bici o altre attività ma anche uscire in citta ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r2smlg/cerco_amicizie/"
    },
    {
        "id": "1r31vdx",
        "author": "TroubleDesigner5441",
        "title": "Aiutatemi a trovare un portafoglio per la mia mamma",
        "content": "Ciao a tutti, sapete dove posso trovare dei bei portafogli (magari in pelle, ma non necessariamente) a Torino centro? Mi piacerebbe ricevere consigli per negozietti, ma anche catene di negozi che vendono bei portafogli, con un budget di 50 euro. La mia mamma ha il portafoglio tutto rovinato e ne vorrebbe uno per il compleanno! \n\nGrazie a chi risponderà 🥰",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r31vdx/aiutatemi_a_trovare_un_portafoglio_per_la_mia/"
    }
]