[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 40,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ktdjr7",
        "author": "muffinpie90",
        "title": "Anyone else sick of the long wait between seasons and wish we had 22 episodes again?",
        "content": "Even 13-16 episodes would be better than 8. It's taken almost a decade to produce 42 episodes of Stranger Things... Why is this the norm? Kind of over it and it loses the momentum with these big breaks.",
        "upvotes": 43,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ktdjr7/anyone_else_sick_of_the_long_wait_between_seasons/"
    },
    {
        "id": "1ksssyk",
        "author": "theoriginalshabang1",
        "title": "Liver King. Wtf did I just watch? Lots of spoilers because shame on Netflix for giving this guy more of a voice",
        "content": "It’s new &amp; I had never heard of this guy so I watched it last night. Why is Netflix is giving this guy more notoriety and why do we elevate ‘influencers’ like this??\n\nToxic &amp; cliche grifter promoting an ‘All Meat Primal’ and ‘natural’ lifestyle gets caught using steroids… a surprise to no one with eyeballs.  He walks around in no shirt and shorts all the time. Seriously - in public, at conventions, multiple clips of podcasts interviews, a Piers Morgan interview… there is literally 1 scene in the entire thing where he is wearing a shirt. It’s cringy af to watch.\n\nHe makes a ton of money off of selling supplements and making videos that this diet is healthy and his physique is all due to meat &amp; supplements - so Buy Now! It’s terrible advice, in no way healthy and can seriously harm people! If he possesses any qualifications for giving diet advice, or knowledge to create a supplement line (other than working at GNC when he was a teen), they sure don’t mention it.\n\nHe goes from ‘f you! It’s none of your business if I take steroids’ to ‘I’ll just lie again’ to an unapologetic apology to his fans saying he has self esteem issues because his dad died when he was a kid and steroids help. 🙄 Then admitting that he has been stealing &amp; grifting since he was 16 - even printing counterfeit money at one point! \nDude…. if that is true, prolly shouldn’t admit that on a Netflix special…\n\nHe and his “queen” kill a bull and make their kids eat its testicles while per-formatively thanking his “bull brother” and Earth for his gifts like he’s a character in Avatar. Yup, raw bull testicles just out in the middle of a field, still warm.  I mean, I’m not into hunting - not that you can call this hunting because it was a lone bull standing in a field that someone else shot for him  - but I get that some people are. You should not be eating raw animal organs! EVER!!! And you certainly should not be feeding it to your kids! I guess if this guy brings on a new pandemic or the zombie apocalypse, he’ll just bicep curl his way out of it.\n\nAfter taking mushrooms, a shaman shows up (?) for a sweat lodge and he has to think of his next move while of the mean things Internet people said to him are dubbed over the scene… Not his responsibility or fraud or lies or how his business partners were also screwed over with his fraud. \n\nBut, don’t worry because he realizes he should be eating fruit too (which he thanks before eating) and his new business plan is to open 302 resorts where people can pay to live like him and his family. His 9 Pillar Belief System has become 10 Pillars because he’s not giving up steroids, but he’s definitely done grifting, right guys?",
        "upvotes": 387,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1ksssyk/liver_king_wtf_did_i_just_watch_lots_of_spoilers/"
    },
    {
        "id": "1kt0qoi",
        "author": "Longjumping_Land_977",
        "title": "I watched A Deadly American Marriage over a week ago but I’m still thinking about it",
        "content": "",
        "upvotes": 115,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1kt0qoi/i_watched_a_deadly_american_marriage_over_a_week/"
    },
    {
        "id": "1kspv45",
        "author": "New-Talk3039",
        "title": "Just started Breaking Bad — how is it overall? (No spoilers please)",
        "content": "Hey everyone,\n\nI just started watching Breaking Bad for the first time and I'm a couple of episodes in. I’ve heard a ton of praise about it over the years, and finally decided to see what the hype is about. So far, it’s definitely got me intrigued.\n\nFor those who’ve watched the whole thing — how did you find the overall experience? Does it live up to the reputation it has? I’d love to hear your thoughts (but please, no spoilers — I’m going in fresh!).\n\nThanks!",
        "upvotes": 422,
        "comments": 875,
        "media": null,
        "permalink": "/r/netflix/comments/1kspv45/just_started_breaking_bad_how_is_it_overall_no/"
    },
    {
        "id": "1kt7ain",
        "author": "Big-Negotiation888",
        "title": "“You are not a part of the household” rant",
        "content": "I’ve seen people on here confused about why their devices “aren’t part of the household” - EVEN when they are literally in the same house!!\n\nBut I just wanted to rant about this for a second. People should be able to use their profile if a family member is paying for the subscription, and I know I’d let my family use their profiles on my account too if that were the case. I’ve seen people who move for military reasons complain, and I am in college out of state so it’s super frustrating to be kicked out of my family’s subscription.\n\nIt’s such an egregious cash grab as well as a petty attempt to discourage password sharing that affects people who aren’t even doing so that unfairly (ie children on their parents’ subscription). It’s a genius business decision and you almost have to give it to em—forcing people into paying for more individual plans just so they can watch makes Netflix wayyy more money—but it’s just sooooo frustrating. Anyone else?? I just had to rant 😭",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kt7ain/you_are_not_a_part_of_the_household_rant/"
    },
    {
        "id": "1ktea2j",
        "author": "S4v1r1enCh0r4k",
        "title": "Josh Hartnett to Star in Netflix's New Sea Creature Thriller Set in Newfoundland",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktea2j/josh_hartnett_to_star_in_netflixs_new_sea/"
    },
    {
        "id": "1ktcayb",
        "author": "Imsmart-9819",
        "title": "I find Devil's plan boring",
        "content": "My brother recommended Devil's plan season 2. I'm watching season 1 to catch up. I'm on episode 3 and find it boring. The games are too complicated. I can't stay focused. What's so great about this show?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ktcayb/i_find_devils_plan_boring/"
    },
    {
        "id": "1kszvek",
        "author": "Internal-Bed-3150",
        "title": "Josh Hartnett set to star in Netflix's Newfoundland-filmed series",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kszvek/josh_hartnett_set_to_star_in_netflixs/"
    },
    {
        "id": "1kswer9",
        "author": "Busy-Category-3489",
        "title": "How was Adolescence?",
        "content": "I just finished watching \"Adolescence\" on Netflix. I found it not as good as I expected it to be. I will probably rate it 7/10. The shots taken in one take were quite impressive on the one hand, but it sometimes got really annoying for me. I just wanted to get your thoughts on it—did you guys like it, or is it just me? ",
        "upvotes": 22,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1kswer9/how_was_adolescence/"
    },
    {
        "id": "1ksndr7",
        "author": "Milk_Man9696",
        "title": "Is The Haunting of Hill House worth watching? (NO SPOILERS)",
        "content": "I’ve been hearing a lot about *The Haunting of Hill House* and wanted to ask if it’s worth the time. I enjoy horror, but not just jump scares. Please no spoilers in the replies—thanks!",
        "upvotes": 63,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1ksndr7/is_the_haunting_of_hill_house_worth_watching_no/"
    },
    {
        "id": "1kte9we",
        "author": "VesnaKostic",
        "title": "I'm interested in a similar TV show likeTabula Rasa (2017)",
        "content": "I'm interested in recommendations for a TV show as similar as possible to the Belgian series Tabula Rasa from 2017. It should be very dark, eerie atmosphere, mystery and you have no idea where it all leads. To be completely mysterious and you have no idea what will happen next. No ghosts or paranormal stuff. Thank you very much❤️❤️❤️❤️❤️",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kte9we/im_interested_in_a_similar_tv_show_liketabula/"
    },
    {
        "id": "1ktagb2",
        "author": "MoonSpillingIn",
        "title": "Feature Idea: What if Netflix played the ta dum when someone joins a profile",
        "content": "Okay hear me out..\n\nWhat if Netflix played the ta dum sound when someone logged into their profile on a shared account? Like a little Netflix “doorbell”\n\nI was thinking it’d be:\nCompletely optional (you could toggle it on/off in settings)\nMaybe just for certain devices, like TVs or consoles\nAnd could even show who’s watching or what they’re starting (if you want it to)\n\nIt would be such a fun way to know when your partner, roommate, or kid is about to start binging.\n\nHonestly I’d love it just for the nostalgia of hearing the ta dum more often. It’s already iconic but this could turn it into one of those generation wide sound memories we all associate with cozy nights, family time, or solo binge rituals.\n\nNetflix, if you see this… pls consider 🥺\n\n\nWould anyone else use this?\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ktagb2/feature_idea_what_if_netflix_played_the_ta_dum/"
    },
    {
        "id": "1kta95n",
        "author": "CopenhagenCalling",
        "title": "Someone attached my email to a random 2 year old account - what is the scam here?",
        "content": "So i have heard scammers making new account with users emails and i have heard scammers taking over someone elses Netflix account, but i’m not really sure what’s going on here.\n\nI got an email that said that my email adress had been changed and i was confused because i didn’t change the email to my account and the email that it was changed to is an email i don’t use for subscriptions. So i have never used the email for Netflix.\n\nI logged into it and could see it was a 2 year old Netflix account. There’s a name, phone number and credit card that’s not mine.\n\nI’m so confused, because it seems like the scammers just took a random Netflix user and changed the email to my email? And it’s definitely not by mistake because my email is my name and the name of the user is completely different(i’m a man, the name of the account is a women). I looked up the phone number and it matches the name of the account.\n\nMaybe the scammer took her phone number and my email, but i’m not sure if it’s her credit card they are using or just a random one. The account is 2 years old so maybe the scammers just keeps changing the info? But i’m a bit confused because if it was a stolen credit card they wouldn’t be able to use it for 2 years.\n\nAlso my email isn’t compromised. It’s a gmail and there’s no “foreign” activity in the log in history.\n\nHave anyone seen or heard something like this happen before, because i’m curious and wondering what is the scam here?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kta95n/someone_attached_my_email_to_a_random_2_year_old/"
    },
    {
        "id": "1ksv5gh",
        "author": "ToonAdventure",
        "title": "KPop Demon Hunters | Official Trailer | Netflix",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ksv5gh/kpop_demon_hunters_official_trailer_netflix/"
    },
    {
        "id": "1ktb1df",
        "author": "Cold_Daikon8068",
        "title": "easy way to \"switch\" tv show, without the need to get back on home page?",
        "content": "Hi, i dislike that netflix forbid us to have 2 tabs open with different thing that we want to watch.\n\nI watch different things depending on what i do during the time, and for youtube i can easily let tabs open and go on the one that i want to watch, but netflix block this behavior.\n\n  \nThat's quite stupid, because if i watch one, it's mean i cannot watch the other tab, so i don't see the point of this feature.\n\n  \nAnyway, i'm looking for a tool/technique/extension that would allow me to easily switch between 2 (or more) netflix content that i'm currently interested in. \n\n  \nI have no idea if something like this exist, but if it does, that would be great.\n\n  \ncheers",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ktb1df/easy_way_to_switch_tv_show_without_the_need_to/"
    },
    {
        "id": "1kt9u0k",
        "author": "monster_lily",
        "title": "Things Bet does right and wrong",
        "content": "\ni watched this show as someone who’s only seen a few episodes of kakegurui (both anime and live action, disliked them both, hope I’m still allowed to post this here though) and honestly i think the show is not all that bad. however, it has LOTS of room foe improvement come s2 if we get it, which i hope we do! first i will start with what it does right:\n\nYumeko: easily the best part of the show, both yumekos character and actress. she’s the perfect mix of mysterious yet an open book; she’s very similar to the original but she openly has a soft, sensitive and sweet side. Great acting as well. Also I just wanna say she’s so pretty lol\n\n\nPlot: The plot in this show is VERY different but quite intriguing, definitely not an adaptation of kakeguri, more like a reboot or reimagining. \n\n\nNow for the bad:\n\nCharacter design: woww this is really where the show struggles. firstly, at least 4 characters have names that rhyme: dori, suki, Mary, riri?? I get that their names were directly inspired by the anime counterparts but come on…. was there really NO way to make the names more interesting while still keeping the Japanese influence? also the student council is supposed to be this intimidating (as in they can and will kill you if you mess with them) and powerful group but they literally all look soft. Literally suki comes is a run of the mill stan twitter user, all bark; ZERO bite whatsoever. riri looks like a cosplayer with bug/bugself pronouns straight out of 2020. Dori,, i wont even comment. Kira looks ok, but the blue lipstick just does NOT translate well from an anime character onto a real person, it was extremely distracting in every scene she was in. also doesn’t really match her personality, hard to believe someone as uptight as her is walking around with bright blue lipstick. \n\n\nWorld building: it’s my understanding that in kakegurui the school was specifically a school FOR gambling, but the school in bet is more like a  normal prep school where students just happen to gamble on the side? I wish they would have done more to make it seem like a school and not just a gigantic casino, I mean I don’t even think there was ever even as much as ONE scene where the characters are in class or studying or interacting with a teacher or just doing something non gambling related?\n\n\nActing: you can definitely tell that many of the actors are novices especially in the last episode. The show definitely gets more interesting towards the end but in turn the pacing really suffers the closer it gets to the end as well.\n\n\nOverall, I want to say 6.5/10 with LOTS of potential; If i was to describe this show to someone whos thinking of watching it, I’d say it’s Wednesday meets Fate the winx saga meets Kill Bill meets Kakegurui\n\n\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kt9u0k/things_bet_does_right_and_wrong/"
    },
    {
        "id": "1kszp2a",
        "author": "throw__away3_",
        "title": "Tony from Battle Camp and Mole (spoilers)",
        "content": "I'm sure he's cool irl and all but wtf is his deal? Both shows he went on he was real thirsty for a girl. When he was on the mole his thirstiness for Hannah basically sent him home (from what I remember or was partially due to it). He's so tall and built that he can pull a lot when he gets home, focus dude. He definitely didn't get Hannah afterwards and he knew Gabby had a bf. He was real competitive early on for that 250k yet forfeighted anyway?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kszp2a/tony_from_battle_camp_and_mole_spoilers/"
    },
    {
        "id": "1ksnr04",
        "author": "liamkkkk",
        "title": "Love Death + Robots…?",
        "content": "Just finished watching the new season of LDR, and although the series seems to be made to make the viewer uncomfortable, one episode stands out to me. “The Screaming of the Tyrannosaur” features a death race partaken in by poorer people to appease rich upperclassmen, who drink the blood of dinosaurs to stay young. I might be overthinking things but I found it weird that Mr Beast of all people cameos as the host and commentator of this gladiatorial episode. Thoughts? ",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ksnr04/love_death_robots/"
    },
    {
        "id": "1kt3pc9",
        "author": "GenTrapstar",
        "title": "The Recruit",
        "content": "Well I thought the show was pretty good. I’m pretty much binged watched it all in like 2 days. With that being said I recently found out that they cancelled season 3. Talk about  dramatic cliffhanger of the year. Won’t know what happened to anyone because it got cancelled. In situations like this I wish the writers would be kind enough to write up a one to two page paper of a quick finale of what happened to everyone. Anyways fuq cancellations. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kt3pc9/the_recruit/"
    },
    {
        "id": "1kt0b0z",
        "author": "mk52001",
        "title": "suggestions based on Interests",
        "content": "\nAny Netflix suggestions? I’m into drama, mystery, suspense, and anime. No overly romantic stuff please. I like plot twists, deep characters, and action. especially shows with plot twists, good pacing, and deep characters. Please no romance-heavy shows. I like dark themes, psychological stuff, or anything that keeps me guessin",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kt0b0z/suggestions_based_on_interests/"
    },
    {
        "id": "1ksbkz2",
        "author": "HP_sauce78",
        "title": "Watching worst roommate ever",
        "content": "I am so angry at the incompetence of police officers and the scary laws America has. As a British person, I’ve never heard a story where someone who moves into another persons home has more rights than they do???\n\nIt’s crazy what the hell. I’m talking specifically about ep3 (although I’m angry at all of them) and I hate how these victims have lost their homes due to stupid laws.\n\nFeel like I’m late to the story but I think it’s time Americans demand changes within the law ",
        "upvotes": 44,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ksbkz2/watching_worst_roommate_ever/"
    },
    {
        "id": "1krxgf6",
        "author": "New-Entrepreneur4132",
        "title": "Untold the fall of Favre",
        "content": "What a hard one to watch. He did so much right. He also did so much wrong that is traceable and yet he still claims innocence. I don’t know how he lives with himself and looks in the mirror. Using welfare money from one of the poorest states in the US is a new bottom for any human. His sexual harassment is well-documented too. I hope they recover money for the people of Mississippi and I hope Favre acknowledges his wrongs and has regrets before Parkinson’s makes it hard for him to apologize. Greed is a horrible thing. ",
        "upvotes": 181,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1krxgf6/untold_the_fall_of_favre/"
    },
    {
        "id": "1ks6n78",
        "author": "LouisTully9000",
        "title": "Sneaky Links and the Death of Romance (as We Knew It)",
        "content": "At some point in the past five years; perhaps between the eighth season of Love Is Blind and the 437th rebranding of The Bachelor; televised dating quietly stopped being about dating. Instead, it became a parade of bronzed narcissists dry-humping on bean bags for the chance to sell flat tummy tea and boner pills to strangers on Instagram. Into this rich tradition steps Netflix’s latest entry, Sneaky Links: Dating After Dark, a show that dares to ask: What if your ex-booty call was also your soulmate? (And what if you were filmed trying to figure that out while shirtless, emotionally stunted, and surrounded by Ikea furniture?)\n\nIf you, like me, are 43 years old and unaware that “sneaky link” is Gen Alpha for “booty call,” you’re not alone. Apparently, the term “booty call” was too on-the-nose for a streaming platform that also produces prestige dramas about Elizabethan corsets and talking bears. Instead, we get “Sneaky Links,” a phrase that sounds like a sketchy URL you click by accident while searching for airfare.",
        "upvotes": 42,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1ks6n78/sneaky_links_and_the_death_of_romance_as_we_knew/"
    },
    {
        "id": "1kt06wj",
        "author": "Sersch",
        "title": "Can you disable games suggestions by Netflix?",
        "content": "I have Netflix for watching series, I have steam and consoles for playing games. Whenever I turn Netflix on, I 100% don't want to play games but watch something. It would be ridiculous if Steam would start suggesting me series all of a sudden.\n\nIs there a way to disable the games?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kt06wj/can_you_disable_games_suggestions_by_netflix/"
    },
    {
        "id": "1ksqntq",
        "author": "Ok-Opportunity-9500",
        "title": "Netflix glitching in full screen",
        "content": "Hello hello, I tried today to watch netflix on my new laptop (had it for about a month) and when in full screen it keeps glitching, going up and down sort of. Tried on the website and on the app for windows, same thing. When it’s not on full screen it’s perfectly normal.\nI saw somewhere something about the screen cool off setting, I checked mine and it’s the recommended 120hz. I updated windows and it’s still glitching. Any idea would be greatly appreciated 🙏",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksqntq/netflix_glitching_in_full_screen/"
    },
    {
        "id": "1kseg86",
        "author": "Objective-Shift7932",
        "title": "I am not okay with this season 2",
        "content": "Is there a chance for \"I am not okay with this\" to come back for season 2? I really loved the first season and it sucks that they left it on a cliffhanger. I was thinking that they might start working on it again after Stranger Things season 5 releases but I'm not sure.",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kseg86/i_am_not_okay_with_this_season_2/"
    },
    {
        "id": "1ks25hd",
        "author": "Accomplished-Snow727",
        "title": "The Residence",
        "content": "Just finished watching The residence on Netflix.. LOVED IT. Now i have a hankering for murder mysteries but not like dead serious a little quirky, like the residence, but not a movie - a tv series? Any suggestions? ",
        "upvotes": 34,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ks25hd/the_residence/"
    },
    {
        "id": "1ksn2ko",
        "author": "worldhumanist",
        "title": "Has anyone been watching Legado on Netflix?",
        "content": "It's a Spanish series on Netflix.\nI think it's available in Europe. Not sure about the rest of the world.\n\nI have so many questions and have had so many wtf-moments while watching it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ksn2ko/has_anyone_been_watching_legado_on_netflix/"
    },
    {
        "id": "1ksduiv",
        "author": "Shadowlab72",
        "title": "How to find independent movies on Netflix",
        "content": "Back in 2000 I started renting movies from Netflix and did so until about 2015. Netflix movies, mailed of course, had the best catalog of independent movies from anywhere. \n\nIf my local movie rental store didn't have an obscure title then I knew Netflix would. \nI know times have changed but I cannot seem to find many Independent films on Netflix streaming.\n\nI've tried the categories option but that's limited to drama comedy reality etc.. \n\nHas anybody found a way to find Independent films on the Netflix app?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ksduiv/how_to_find_independent_movies_on_netflix/"
    },
    {
        "id": "1ksm76q",
        "author": "PresentationJolly365",
        "title": "Looking for shows like Control Z or How to Sell Drugs Online (Fast) — teen drama, mystery, dark vibes?",
        "content": "Hey everyone!\nI recently rewatched Control Z and How to Sell Drugs Online (Fast) and loved their mix of teen drama, mystery, and dark humor.\n\nCan you recommend similar shows on Netflix with that kind of vibe? Doesn’t have to be exactly the same, but something with suspense, smart characters, and that edgy feel.\n\n\nAlso I don't want really long series with 8-10 seasons with each having 24 eps of 1 hr each\n\nWoukd like 3-5 seasons with episodes about 20-40 mins ?\n\nMaybe there are none based on so many restrictions LAWLLLLLL but kindly help or suggest \n\nThanks in advance!\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ksm76q/looking_for_shows_like_control_z_or_how_to_sell/"
    }
]