[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kktabc",
        "author": "Hairy-Avocado-445",
        "title": "Torino psicotica",
        "content": "Ma voi non avete l’impressione che negli ultimi (boh?) 5 mesi anche le zone centrali si stanno popolando di casi umani?\n\nOggi nell’arco di 2 ore:\nuna psicotica ha iniziato a insultarmi dicendo che non ci sto dentro con il cervello per come le agitavo contro (???) le chiavi di casa;\nun tipo in auto si è preso la sbatta di accostarsi a me, che ero nella mia, per parlarmi di cose no senso; i pedoni suicida senza cognizione che SI LANCIANO senza capire che se ti investo sì ti paga l’assicurazione ma poi campi in sedia a rotelle 50 anni; la gente al volante che boh, manco c’è da dire.\n\nPrima avevamo solo una massa immensa di depressione (e lo dico da torinese), ora abbiamo pure i pazzi.\n\nBoh, qualcuno condivida il proprio punto di vista vi prego",
        "upvotes": 29,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1kktabc/torino_psicotica/"
    },
    {
        "id": "1kkqede",
        "author": "frallow999",
        "title": "Where do foreign people meet in Turin?",
        "content": "Hi there ☀️\nI'm new in town and was wandering if there is a Facebook group, telegram group, or an event - anything really - that's dedicated to foreign people in turin, especially foreign students.\n\nIf a foreign students needs information for instance, where should she ask?  \nAre there meetups, like language exchanges and such?\n\nApart from sub reddits of course :) do you have recommendations? \n\nThanks!",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kkqede/where_do_foreign_people_meet_in_turin/"
    },
    {
        "id": "1kk0uxx",
        "author": "CollapseOverflow",
        "title": "Ma che cos’è sto “VPN” scritto in giro?",
        "content": "",
        "upvotes": 356,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yES4mBplX0afMsCwsa6nwRKXRiRUdJuLoH4plNBAeXg.jpeg?auto=webp&amp;s=e11dea45ca954bd908a2f23a5c3a6a3b3cc60d16"
        },
        "permalink": "/r/torino/comments/1kk0uxx/ma_che_cosè_sto_vpn_scritto_in_giro/"
    },
    {
        "id": "1kkp83x",
        "author": "Choice_Lock_5133",
        "title": "Singer",
        "content": "Can you help me get this singer’s instagram? I saw him last time but forgot to check it.",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/alooqpoxwb0f1.jpeg?auto=webp&amp;s=d80d6cd6a359f38ef44986d2d2574ef4bcedcebe"
        },
        "permalink": "/r/torino/comments/1kkp83x/singer/"
    },
    {
        "id": "1kkxxez",
        "author": "Dabbi_e",
        "title": "Muro tennis",
        "content": "Qualcuno conosce qualche circolo in cui è presente il muro di allenamento? Oppure qualche posto in zona centrale/sansa dove poter palleggiare contro un muro senza dare fastidio? Tipo struttura abbandonata con dell'asfalto davanti o simili, grazie a tutti :)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kkxxez/muro_tennis/"
    },
    {
        "id": "1kl0zq3",
        "author": "Traditional-Glove632",
        "title": "Zone",
        "content": "Ciao a tutti! Forse mi dovrò trasferire a Torino per lavoro. \nAttualmente vivo a Milano, ho 26 anni, sono nata nel Canavese ma di Torino non conosco nulla a parte via Roma e Piazza Castello. \n\nSto valutando se il trasferimento lavorativo si concretizza di prendere casa momentaneamente in affitto a Torino o zone limitrofe. \nVorrei una zona che offra un parco abbastanza ampio e con la metro vicina e ovviamente le comodità come supermercati bar ecc nell’arco di 15 min a piedi. \nHo visto le zone pozzo strada o monte grappa, che hanno il parco della pellerina vicino.\n\nIl mio lavoro sarebbe in centro (via Roma). \n\nOppure seconda scelta rimanere a Milano, sono comoda con la stazione di Rho fiera e fare la pendolare tutti i giorni.\n\nCosa mi consigliate? Quali zone sono le migliori? E le più sicure almeno durante il giorno? \n\nPassando al fattore economico attualmente pago 810€ al mese bilocale 5° piano, tutta la casa non stanza tutte le spese incluse e incluso anche box auto, una gran botta di fortuna a Milano.  Vorrei rimanere sullo stesso budget, impossibile? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kl0zq3/zone/"
    },
    {
        "id": "1kk7win",
        "author": "Tricky-Telephone6315",
        "title": "Alzi gli occhi e vedi questo",
        "content": "",
        "upvotes": 81,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/np4nmuzs570f1.jpeg?auto=webp&amp;s=192aff066cc506ab57efe2a21541280867258e61"
        },
        "permalink": "/r/torino/comments/1kk7win/alzi_gli_occhi_e_vedi_questo/"
    },
    {
        "id": "1kknann",
        "author": "aebline",
        "title": "Dove rivolgersi per verificare se si ha l'autismo in età adulta?",
        "content": "Salve.\n\nDopo essermi informata, ho il sospetto che io ed un mio parente potremmo rientrare nello spettro; chiaramente non posso dirlo con certezza senza una diagnosi.\n\nQualcuno sa dove è possibile andare per accertarsi di avere o meno l'autismo in età adulta?",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1kknann/dove_rivolgersi_per_verificare_se_si_ha_lautismo/"
    },
    {
        "id": "1kkvr97",
        "author": "Anonymous_77_",
        "title": "How to take legal action against landlord",
        "content": "Hello, i need to leave my room because im returning to my country, but the landlord blocked me because i demanded the deposit to be returned. The contract clearly states that in case i want to leave without finding a substitute, i have to pay a 250€ fee. So how can I take legal action against him, cheapest way possible. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kkvr97/how_to_take_legal_action_against_landlord/"
    },
    {
        "id": "1kktaeq",
        "author": "Sophibom",
        "title": "Qual è il miglior hotel in zona dove riposarsi?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kktaeq/qual_è_il_miglior_hotel_in_zona_dove_riposarsi/"
    },
    {
        "id": "1kk6ajv",
        "author": "jollanza",
        "title": "Servizio interessante trovato a caso",
        "content": "Sembra che dopotutto potremmo avere un servizio del genere. Non so chi siano, ma il questionario è veloce e potrebbe nascerne qualcosa di buono.",
        "upvotes": 38,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zhyada2ct60f1.jpeg?auto=webp&amp;s=fe503d330c8fca9061fadb9bafcab6713c93295c"
        },
        "permalink": "/r/torino/comments/1kk6ajv/servizio_interessante_trovato_a_caso/"
    },
    {
        "id": "1kkrtlc",
        "author": "lovingfree",
        "title": "Tempi di elaborazione della carta del permesso di soggiorno a Torino/Permesso di Soggiorno Card Processing Times in Torino",
        "content": "Ciao a tutti,\n\nMi sono presentato all'appuntamento per le impronte digitali in Questura (Torino) per rinnovare il mio permesso di soggiorno il 13 marzo 2025. Mi sono laureato da poco e ho richiesto il permesso \"cerca lavoro\" perché il mio permesso di studio è scaduto. Ciononostante, sono passati due mesi e non ho ancora ricevuto la comunicazione per ritirare il mio permesso. Ho controllato lo stato della mia domanda sul sito [https://questure.poliziadistato.it/](https://questure.poliziadistato.it/) e risulta ancora \"documento di soggiorno in trattazione\". **C'è qualcuno che ha avuto un appuntamento per le impronte digitali simile al mio (inizio o metà marzo) e ha ricevuto il suo permesso di soggiorno? Potreste indicarmi il tipo di permesso e quando avete ritirato il vostro (quanti giorni dopo l'impronta digitale)?**\n\nGrazie mille in anticipo, perché potrei dover partire alla fine di questo mese e temo di non ricevere il mio permesso in tempo.\n\n\n\n\n\nEnglish:\n\nHello all,\n\nI went to the fingerprint appointment at Questura (Torino) to renew my permesso di soggiorno on March 13, 2025. I recently graduated and asked for the \"cerca lavoro\" permit since my student permit has expired. Nevertheless, it has been two months and I still have not received the communication to pick up my card. I checked the state of my application from the [https://questure.poliziadistato.it/](https://questure.poliziadistato.it/) website and it still says \"**documento di soggiorno in trattazione\". Is anyone here who had a fingerprint appointment date similar to mine (early or mid-March) and received their residence permit card? Can you please indicate the type of permesso and when you picked up your card (how many days after the fingerprint)?** \n\n\n\nThanks a lot in advance, because I may need to travel at the end of this month and am nervous that I may not receive my card on time.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1kkrtlc/tempi_di_elaborazione_della_carta_del_permesso_di/"
    },
    {
        "id": "1kkd989",
        "author": "Sophibom",
        "title": "Pioggia dokenica torino 🥰",
        "content": "",
        "upvotes": 9,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9dwc52m3c80f1.jpeg?auto=webp&amp;s=34c3dcee37f35204be47cb90b42f05e4de90032e"
        },
        "permalink": "/r/torino/comments/1kkd989/pioggia_dokenica_torino/"
    },
    {
        "id": "1kkc2hs",
        "author": "Comfortable_Let_4923",
        "title": "Gruppo whatsapp nuovi Torino",
        "content": "Ciao, qualcuno è interessato a creare un gruppo whatsapp per uscire/cazzeggiare e conoscersi a Torino? Età 22-30",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kkc2hs/gruppo_whatsapp_nuovi_torino/"
    },
    {
        "id": "1kk0tqw",
        "author": "Sophibom",
        "title": "Vittprio emanuele II",
        "content": "",
        "upvotes": 27,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jhft7lu5l50f1.jpeg?auto=webp&amp;s=fbac1b9c2ca6bfd12a8b51e79ca287a929f6f178"
        },
        "permalink": "/r/torino/comments/1kk0tqw/vittprio_emanuele_ii/"
    },
    {
        "id": "1kk38vu",
        "author": "ziocrodo",
        "title": "Ci riprovo Basket Edition 🏀🏀",
        "content": "Non importa se hai smesso da anni o giochi ancora ogni tanto con gli amici: se il suono della retina che fruscia ti dà ancora i brividi… allora sei nel posto giusto.\n\nStiamo cercando nuovi giocatori + 1/2 allenatori per una squadra amatoriale: ci alleneremo, giocheremo nel campionato UISP 2025/2026 e soprattutto ci divertiremo. Livello medio, età 25-40, clima easy ma con voglia di fare sul serio.\n\nInfo pratiche: •\tZona: Pozzo Strada e limitrofe (speriamo di trovare palestre in zona) •\tAllenamenti: si pensa martedì e giovedì 21/23\n\nCerchiamo gente con un minimo di esperienza, ma soprattutto con voglia di rimettersi in gioco. Se sei un ex playmaker col vizio del passaggio no-look, o un lungo che vive di rimbalzi e ginocchia consumate… vieni a fare un giro.\n\nDato lo sbattone, sarò il capitano\n\nSi cercano anche allenatori che siano disponibili a mettersi a disposizione per passione ed a titolo gratuito, in caso non si trovino, la squadra verrà allenata da me.\n\nNO primedonne NO attaccabrighe\n\nLa squadra nasce con la voglia di giocare e provare a togliersi qualche sfizio.\n\nFatta da e per tutte quelle riserve che in FIP non hanno mai avuto troppo spazio.\n\nPanchinari di Torino, se anche voi siete tornati a casa dopo una trasferta a 50km senza nemmeno entrare in campo, qui avrete la vostra rivalsa.\n\nL’idea è di non avere troppe persone, io direi che al massimo 14/15 persone vadano bene.\n\nL’idea di spesa per ciascun giocatore sarà penso non più di 150/200 euro a testa compreso di divise (no borsoni), ma questo dato senza ancora una palestra a disposizione prendetelo con le pinze.\n\nPerfavore NO HATE.",
        "upvotes": 16,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kk38vu/ci_riprovo_basket_edition/"
    },
    {
        "id": "1kkk0ko",
        "author": "dastagirawan",
        "title": "Masters in Area &amp; Global studies for international Cooperation in University of Turin",
        "content": "Hi, i'm going to for the postgrad program in University of Turin after BS Media &amp; Communication studies. what aspects should i need to consider before applying? how much CGPA is required for that? please help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kkk0ko/masters_in_area_global_studies_for_international/"
    },
    {
        "id": "1kkbmpm",
        "author": "gamma50g",
        "title": "6 am flight from Torino",
        "content": "I am visiting  Torino in the second week of July. I am staying close to the Art of Living Center at Torino. If I need to board a 6 am flight  from the Torino airport to Nuremberg on a Wednesday\n\n1. Is it easy and safe to get a ride to the  airport that early? Which is the best way to get there?\n\n2. How many hours before flight departure do I need to be at the airport?\n\n",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kkbmpm/6_am_flight_from_torino/"
    },
    {
        "id": "1kjwrnw",
        "author": "Top_Needleworker5833",
        "title": "❤️Incrocio di sguardi in via Baretti a Torino il giorno 9 maggio",
        "content": "Sembrera' banale ma quel tuo sorriso venerdì mi ha cambiato completamente la giornata, chiunque tu sia volevo ringraziarti. Il  giorno 9 maggio intorno le 16.30 in via Baretti a Torino,mentre camminavo i nostri sguardi si sono incrociati, tu mi hai sorriso poi io ho attraversato la strada e prima di proseguire mi sono girata e ho ricambiato e anche tu hai fatto lo stesso girandoti un altra volta. E' stato bello e spero tu possa riconoscerti tra le mie righe, se cosi non fosse ti ringrazio comunque perche' hai cambiato la mia giornata ❤️",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1kjwrnw/incrocio_di_sguardi_in_via_baretti_a_torino_il/"
    },
    {
        "id": "1kkawhu",
        "author": "Agreeable_Produce_86",
        "title": "Kombucha Scoby",
        "content": "Does anyone fermenting Kombucha and have Scoby to start mine?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kkawhu/kombucha_scoby/"
    },
    {
        "id": "1kk4mfg",
        "author": "CashFlow-10",
        "title": "Zona piazza statuto / San Donato",
        "content": "Sto valutando una casa in zona piazza statuto, più precisamente via San Donato (civico 5 - quindi quasi sulla piazza).\n\nCome è la zona? Per famiglia",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kk4mfg/zona_piazza_statuto_san_donato/"
    },
    {
        "id": "1kk6axi",
        "author": "MicheleCaracas",
        "title": "Qualcuno ha fibra Digi? Come si trova?",
        "content": "Sto pensando di sostituire la mia attuale fibra di casa, e ho visto che a Torino si può attivare Digi fibra che ha prezzi estremamente competitivi. Anche un po' troppo, al che mi viene il dubbio che poi la qualità non sia un granché... Qualcuno l'ha messa a casa? Come si trova? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kk6axi/qualcuno_ha_fibra_digi_come_si_trova/"
    },
    {
        "id": "1kjzs1d",
        "author": "Competitive-Bet-2534",
        "title": "Gruppo videogiochi/nerd/weeb",
        "content": "Come da titolo, ho creato un gruppo per chi volesse parlare e conoscere altre persone a Torino con gli stessi interessi. \nNel gruppo c'è un' area generale e poi ci sono aree dedicate ai vari interessi per poter discutere più approfonditamente di quella cosa\nOvviamente, nella maniera più educata possibile\n \nhttps://t.me/+gFkPrcOSkWQ1ODM8\n\nNel caso dovesse scadere o non funzionare più scrivetemi un messaggio privato\n\nOvviamente, nella maniera più educata possibile",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tmLGJLxP45A3_pxnlPXjCmNMdTVAAtUXmNqxExj5R6s.jpeg?auto=webp&amp;s=befffc3a24cec446b092bda9ec5720ee936ca7dd"
        },
        "permalink": "/r/torino/comments/1kjzs1d/gruppo_videogiochinerdweeb/"
    },
    {
        "id": "1kkaaeh",
        "author": "DanielFHD4K",
        "title": "Reale Mutua",
        "content": "Ciao a tutti! \nMi chiedevo, qualcuno lavora in Reale Mutua o altre società del gruppo? Mi farebbe piacere fare due chiacchiere e chiedere un paio di cose, sto facendo un iter di assunzione con loro e vorrei chiarire dei dubbi.\n\nGrazie mille!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kkaaeh/reale_mutua/"
    },
    {
        "id": "1kk96pj",
        "author": "FriendlyRaisin3789",
        "title": "Baldoria a via Madama Cristina",
        "content": "Ciao a tutti,\n\nIo e la mia famiglia (con una piccola di tre anni) ci trasferiremo a breve a Torino e stiamo cercando casa.\n\nAbbiamo trovato una soluzione perfetta a Via Madama Cristina, vicino a un mercatino.\n\nNon siamo originari di Torino e quindi perdonate l'ignoranza, ma volevo sapere se è una strada tranquilla per una famiglia che non ama baldoria e festa.\n\nHo avuto pareri contrastanti su San Salvario, c'è chi mi dice che è dove si fa festa e si va a comprare la droga, chi mi dice che in effetti ha solo una brutta reputazione ma che la mondanità si è spostata altrove e quindi è una zona tranquilla.\n\nA chi credo? :D",
        "upvotes": 1,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1kk96pj/baldoria_a_via_madama_cristina/"
    },
    {
        "id": "1kjx039",
        "author": "Cute_Strawberry5010",
        "title": "Weekend di disperazione",
        "content": "Salve popolo di Reddit, al mio capo (mia moglie) è venuto in mente di andare a vedere il salone del libro e il museo egizio il prossimo weekend (17-18 maggio). Ovviamente il periodo peggiore visto che col salone del libro tutti gli hotel/alloggi sono stracari e prenotando così all’ultimo non si trova nulla a prezzi decenti.\n\nDomanda: dove potremmo fermarci a dormire, eventualmente anche fuori Torino? Siamo in automobile quindi abbastanza indipendenti, ma ovviamente si pone anche il problema del parcheggio in centro e al Lingotto.\n\nGrazie a tutti coloro che daranno il loro contributo!\n",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kjx039/weekend_di_disperazione/"
    },
    {
        "id": "1kjzwvk",
        "author": "mattia_pascal",
        "title": "Higher Nichelino",
        "content": "Buongiorno Torinesi, da saltuario frequentatore di Higher a Nichelino (ex Bounce) ho scoperto solo di recente che la struttura risulta chiusa senza informazioni sul motivo o le tempistiche per la possibile riapertura. Anche online non si trova nulla. Qualcuno può avere una mezza idea di cosa sia successo???\n\nGrazie mille!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kjzwvk/higher_nichelino/"
    },
    {
        "id": "1kjkycy",
        "author": "Filipo_it",
        "title": "Dove frequentano i 30enne?",
        "content": "Sul serio, quale posto si può andare senza essere un posto pieno di ragazzini? Più specificamente serate lgbt.",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1kjkycy/dove_frequentano_i_30enne/"
    },
    {
        "id": "1kjya04",
        "author": "Laepus_",
        "title": "Settecentesimo post per fare amicizia",
        "content": "Mi rendo conto che ce ne siano almeno un migliaio qui su r/torino, ma io voglio essere più specifica per far funzionare le cose, anche perché se non riesco a fare amicizia ci sarà pure un motivo (lo scoprirete presto)\n\nPersonalmente cerco amici di circa 25-35 anni che siano in zona Lingotto (perché tra lavoro e palestra tutto avrò si e no un’ora di tempo per due passi ogni tanto) possibilmente appassionati di fitness o meglio ancora gymbro e gymsis.\n\nNiente aperitivi perché non bevo e non mangio fuori, niente fumatori perché ho smesso di fumare e non voglio ricominciare.\n\nAh, mi piace il black humor quindi niente gente che mi fa i pippotti woke che non ho voglia.\n\nHo un solo singolo amico che vive nella stessa zona, ogni tanto prendiamo e ci facciamo un caffè la mattina o due passi a caso in giro giusto per chiacchierare, sono sicura al 100% che se invitassi qualcun altro nelle nostre passeggiate da anziani sarebbe contento.\n\nFatemi sapere.\n\nPs. So di essere una rompicoglioni, infatti scrivo sto post in cerca di altri rompicoglioni come me.\n\nEDIT: Ho modificato “battute razziste” in “Black Humor” in quanto mi è stato fatto notare che son cose diverse. \n\n",
        "upvotes": 0,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1kjya04/settecentesimo_post_per_fare_amicizia/"
    },
    {
        "id": "1kjsblp",
        "author": "mango_fiero",
        "title": "Parrucchieri Torino",
        "content": "Migliori parrucchieri di Torino per un wolfcut? Uomo, capelli lunghi, non 30€ per favore 😭 (gli unici che trovo)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kjsblp/parrucchieri_torino/"
    }
]