[
    {
        "id": "1p5e4zn",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 11,
        "comments": 1279,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5e4zn/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p4zs10",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Elche vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p4zs10)",
        "upvotes": 166,
        "comments": 508,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p4zs10/postmatch_thread_elche_vs_real_madrid/"
    },
    {
        "id": "1p644km",
        "author": "Gaengsa",
        "title": "Rafa Nadal : Vinicius has to understand who the authority is and Respect that. Xabi? Before the start of the season, who wouldn't sign to be first in the league and a privileged position in Champions League. A house isn't built in a day.",
        "content": "",
        "upvotes": 431,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EFBXwmCuzj4i3uwx_XzEDd7uRsPNH27GzyZk63ZueAk.jpeg?auto=webp&amp;s=997246b8c34a3d9106929afa02f9e2f1e8c62e3b"
        },
        "permalink": "/r/realmadrid/comments/1p644km/rafa_nadal_vinicius_has_to_understand_who_the/"
    },
    {
        "id": "1p66mxf",
        "author": "TheFeatherDiaries",
        "title": "HAPPY BIRTHDAY!!!, Xabi Alonso!",
        "content": "",
        "upvotes": 122,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o8ww09sxyc3g1.jpeg?auto=webp&amp;s=8c35269178e1f32c0536a760eab65d2cd8af52ce"
        },
        "permalink": "/r/realmadrid/comments/1p66mxf/happy_birthday_xabi_alonso/"
    },
    {
        "id": "1p62s1c",
        "author": "TheFeatherDiaries",
        "title": "Arancha Rodriguez : Federico Valverde, Vinicius Junior, Rodrygo, Brahim DON'T buy into the Coach's ideas.",
        "content": "",
        "upvotes": 209,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KIJckxpXwXzNUGoTDLe73SkW2LOrBn0xKe3MtX5pVOI.jpeg?auto=webp&amp;s=e01f37803e526df367db158d3ef8179d8ccb0e33"
        },
        "permalink": "/r/realmadrid/comments/1p62s1c/arancha_rodriguez_federico_valverde_vinicius/"
    },
    {
        "id": "1p5kbt6",
        "author": "Bald-Eagle619",
        "title": "[Mario Cortegana] Vinicius Junior currently earns €18M a year after tax with Real Madrid. The club offered Vini an increase in salary at around €20M net, but Vini said no. The club told Vini to make a counter-offer, and he demanded the biggest contract in club history, similar to Cristiano Ronaldo.",
        "content": "Vinicius Jr signed fresh terms at Madrid in 2022, the details of which were announced a year later. He currently earns around €18million (£15.8m; $20.7m) a year after tax and his contract contains a €1billion release clause.\n\nIn 2024, a delegation working on behalf of Saudi Arabia’s Public Investment Fund (PIF) was keen to explore a move for him to join a Saudi Pro League club. It would have involved lucrative personal terms, but did not develop into anything concrete.\n\nEarlier this year, Madrid made Vinicius Jr a renewal offer, including an increase in salary to around €20million net a year. When this was not accepted, the club asked the player’s side to propose a figure.\n\nVinicius Jr’s representatives requested a historic contract, in the region of the highest ever at the club (which was given to Cristiano Ronaldo), with a package of up to €30million per season. This included base salary, performance bonuses and a renewal bonus, something which has not been offered to players at Real Madrid previously.",
        "upvotes": 960,
        "comments": 411,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8LqdgxsCySotoqdbJLjQI7S-1m5hqy9ZE1_au-r2SS0.jpeg?auto=webp&amp;s=efcb925e258267c049055a19b1977ef92bcbc8fd"
        },
        "permalink": "/r/realmadrid/comments/1p5kbt6/mario_cortegana_vinicius_junior_currently_earns/"
    },
    {
        "id": "1p62nwa",
        "author": "chunchunmaru1129",
        "title": "Can we all just calm down and stay quiet for this season atleast because it's literally Xabi's first season here",
        "content": "We just came of our worst season in a long time in the last season.Not everything will be immediately fixed.No coach will ever be able to fix a club with many problems immediately.It will need some time. \n\nWe can't overspend like the premier league clubs because of La Liga rules which is a handicap for us. \n\nWe are basically in a transition period with many of our legends like Kroos and Modric either retiring or leaving the club. \n\nWe have many young talented players who just need some time to settle down. \n\nWe still haven't figured out our proper play style yet and our players haven't yet gotten used to Xabi's tactics. \n\nSo guys I ask we all stay calm and quiet atleast for this season and let Xabi do his work. \n\nIt's not going to be the end of the world if we don't win the champions league this season. \n\nRemember Jose Mourinho built the blueprint of the team which ended up winning 4 champions league in 5 years and Mourinho's team took a while to get going. \n\nSo please stay calm and let the professionals handle it.",
        "upvotes": 68,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p62nwa/can_we_all_just_calm_down_and_stay_quiet_for_this/"
    },
    {
        "id": "1p63ge1",
        "author": "BreadfruitGrand2880",
        "title": "The squad needs a reset and Xabi needs support",
        "content": "I genuinely think Xabi has the potential to become one of the best managers in the world. But even if he doesn’t reach that level, the club still needs to back him right now. There isn’t a single top manager in Europe who would cave to this group of players. If they get their way again, what manager can realistically succeed here?\n\nDo people seriously think Arteta, Lucho, Conte or anyone of that calibre would be a good fit for these players? Vini needs to be moved on, Xabi needs a striker who fits his style, and the club needs to send a clear message: the collective comes first. This team has rarely been greater than the sum of its parts, and that’s the real shame",
        "upvotes": 59,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p63ge1/the_squad_needs_a_reset_and_xabi_needs_support/"
    },
    {
        "id": "1p663wr",
        "author": "Modo97",
        "title": "Rodrygo is making me appreciate Gareth Bale even more!",
        "content": "I think Gareth Bale is the closest comparison to Rodrygo among any player you might think of.\n\nHe too was originally a left winger, but he spent his entire Real Madrid career playing on the right because of Ronaldo’s presence. However, the key difference is that Gareth Bale arrived at Real Madrid as one of the top three players in the Premier League at the time — a true superstar that any team in the world would have loved to sign.\n\nFor more than seven years with Madrid, Gareth Bale was one of the most criticized players. And the funny thing is that the excuses fans now make for Rodrygo were never once brought up for Gareth Bale: “Oh, he’s not playing in his preferred position… Oh, he’s overshadowed because of Ronaldo and Benzema… Oh, he doesn’t get special treatment like the other stars of the team.”\n\nRodrygo will live long on the memory of what he did against Man City and Chelsea. But let’s remember that this man (Bale) contributed with goals in three Champions League finals and yet never received even a fraction of the sympathy, media support, or fan backing that Rodrygo gets today.",
        "upvotes": 38,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p663wr/rodrygo_is_making_me_appreciate_gareth_bale_even/"
    },
    {
        "id": "1p5w2lz",
        "author": "NicoSpurs",
        "title": "Nico Paz will return to Real Madrid in January",
        "content": "Breaking news from Argentina: according to Gastón Edul, the journalist with the closest ties to the Argentine national team, the repurchase of Nico Paz is very close to being finalized right now, in the winter transfer window. \n\n[https://x.com/gastonedul/status/1993081129285366120](https://x.com/gastonedul/status/1993081129285366120)\n\nAnd it is necessary. Although many do not want to see it, this team lacks creativity. There are too many one-on-one players and physically gifted midfielders, but few players capable of combining and creating play, apart from Arda and, if he manages to settle in, Mastantuono.",
        "upvotes": 157,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5w2lz/nico_paz_will_return_to_real_madrid_in_january/"
    },
    {
        "id": "1p5i9ss",
        "author": "cyrusmancub",
        "title": "Vini Jr. has informed Florentino Perez that he does not intend to renew his contract while his relationship with Xabi Alonso remains strained. Talks over an extension are now stalled",
        "content": "Vinicius Junior informed Real Madrid president Florentino Perez that he does not intend to renew while his relationship with Xabi Alonso remains strained\n➕Talks over an extension are stalled",
        "upvotes": 704,
        "comments": 455,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5i9ss/vini_jr_has_informed_florentino_perez_that_he/"
    },
    {
        "id": "1p5vtss",
        "author": "Puzzleheaded-Delay60",
        "title": "Its time we need to be honest with ourselves as fans and say this real madrid team has become average.",
        "content": "I know some of us don't want to admit it but some of our players are overrated. We have always had world class players in every position in this team, but if you look at the squad post 2024 our quality is severely diminished in all areas except the keepers. Not to say we have bad players, they are good but some of them are at best average at what they do without kroos, modric and benzema holding their hands. Look at some of the quality we lost since those three left: No Aerial threats, our set pieces have gone down the gutter, inconsistent forwards, midfield now lacks a technical player that isn't afraid of the ball, our defense is trash, our right side is completely dead without Carvajal, the bench is full of average players mixed in with young players who wont get chances to play (We have two strikers rotting on the bench) and most importantly we lost our mentality. The only reliable position we have is goalkeeping and thats because its courtois and we have a very good backup in lunin. The squad planning since the departure of Benzema has been questionable to say the least and those two ucl wins glossed over the issues which we are now facing. \n\nI know I'm going to get downvoted just because of what I said but at this point I don't really care. We have become an average team and unless these players start to play for the club and not themselves, we will remain average and no coach is going to fix this doesn't matter if its carlo, xabi or zidane.",
        "upvotes": 114,
        "comments": 101,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5vtss/its_time_we_need_to_be_honest_with_ourselves_as/"
    },
    {
        "id": "1p5iyl2",
        "author": "Waves_Rond0",
        "title": "Kylian Mbappe is enjoying the second best start to a la liga season of any Real Madrid player in the 21st century! 🔥 🐐 x 🐢⚡️",
        "content": "",
        "upvotes": 324,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/obekslnvw73g1.jpeg?auto=webp&amp;s=1039a89daaeebeab62dd8f87ad4502fc14b92b99"
        },
        "permalink": "/r/realmadrid/comments/1p5iyl2/kylian_mbappe_is_enjoying_the_second_best_start/"
    },
    {
        "id": "1p5fwu9",
        "author": "tfou79",
        "title": "Rodrygo: 0 Goals in 29 Matches — Mariano: 0 Goals in 30 Matches",
        "content": "",
        "upvotes": 478,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sjewui36973g1.jpeg?auto=webp&amp;s=1e073857885c7eb5c29d9ae379e02efcfd800e70"
        },
        "permalink": "/r/realmadrid/comments/1p5fwu9/rodrygo_0_goals_in_29_matches_mariano_0_goals_in/"
    },
    {
        "id": "1p5hx0n",
        "author": "More-Judgment-9253",
        "title": "Look at this second goal",
        "content": "First of all, Asencio was having a great game and then he did this madness sadly, so that was mainly his fault, also huijsen really didn't help him out. Second, seeing valverde out of all people decide to jog back and then eventually just stop moving is shocking. For example, if this was Barca, at least one of their midfielders would have been fighting for their lives getting back to help the defense, yet our captain that's only been on the field for 20 minutes just stops moving. I'm not trying to put the blame on him alone, my whole point is that the lack of effort from ALL of these players except for Guler, Jude, Asencio ( yes he gave them that 2nd goal but before that he was one of the only players that looked like he actually cared), and Gonzalo of course. This is another benefit of having academy players btw, because they fight like their lives depend on it. I rather see someone from the academy on the field instead of Ceballos for example, who wanted to leave a few months ago. Anyway, hopefully we see some positive changes in the future.",
        "upvotes": 365,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w4miutn1n73g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p5hx0n/look_at_this_second_goal/"
    },
    {
        "id": "1p5qlpg",
        "author": "Adventurous-Ninja-35",
        "title": "Caroline Weir - 84 G+A in 100 appearances.",
        "content": "",
        "upvotes": 106,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6mqpl0v2b93g1.jpeg?auto=webp&amp;s=d668ee3499bfe59b19539b1262ae7046ae97ba7d"
        },
        "permalink": "/r/realmadrid/comments/1p5qlpg/caroline_weir_84_ga_in_100_appearances/"
    },
    {
        "id": "1p66479",
        "author": "Quirky_Appearance539",
        "title": "How &amp; why did the dressing room get filled with such divas? [RANT]",
        "content": "Growing up I've always felt RM had one of the most secure dressing room maybe along with Bayern. Very little controversies or media stories. Even during the Barca treble years there was absolutely reports of unrest. RM have always been one of the most media secure football clubs as far as I've known. But what's changed now?\n\nWe're literally top of the table. Have 2 defeats in the season till now with 2 draws. How is there so much unrest? How is Alonso's job at risk? We've got the best defence in the league &amp; 3rd best in UCL. Coming to Alonso. Is he making mistakes? Yes. Are some of his decisons highly questionable? 100%. But that's what you get with a manager with 2+1/2 seasons of senior management. HE WILL MAKE MISTAKES! THAT IS WHAT YOU GET WITH A YOUNG MANAGER.\n\nArteta took time. Kompany literally got relegated. You have to give him the headroom to learn from his mistakes instead of sack threats. Are we not allowed a transition? Are we not alloed a rebuild phase? Plus its a well known fact that we had an incomplete transfer window!\n\nComing to the dressing room. I feel so sad. Bunch of primadonnas. How have you had your head so up your arse as to not renew your contract cause the manager is rotating you? Its his job ffs! His job is create tactics &amp; win &amp; your job is to play the way he wants! These massive egos will ruin the club. I really believed these issues would never appear at RM.\n\nFreaking Cristiano was let go due to these issues. Who do these players think they are?           \n\nI miss Sergio Ramos in times like this. \n\nPS - I'm not defending Alonso but he's exactly what you're gonna get with a young manager. You have to accep his vision. ",
        "upvotes": 11,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p66479/how_why_did_the_dressing_room_get_filled_with/"
    },
    {
        "id": "1p5vxtv",
        "author": "No-Independent2522",
        "title": "Mbappé receives the 2024/25 Pichichi Trophy",
        "content": "",
        "upvotes": 43,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5vxtv/mbappé_receives_the_202425_pichichi_trophy/"
    },
    {
        "id": "1p5ooll",
        "author": "PlantComprehensive77",
        "title": "We'll never see Benzema-Ronaldo link-up play again.",
        "content": " [https://www.youtube.com/watch?v=2qyqeeAALUM](https://www.youtube.com/watch?v=2qyqeeAALUM)\n\nJust watched a video with all of Benzema and Ronaldo assists to each other. It's like 23 minutes long, which just shows how insane their chemistry together was. Here are some things I noticed:\n\n\\- **Different types of goals:** Both Ronaldo and Benzema scored in so many different ways (longshot, header, tap-in, counterattack, tiki-taka, etc.). They were two very unpredictable attackers, opposite to our current attack.\n\n\\- **90% of the goals had nothing to do with the midfield:** There are so many dumbass people on this sub who complain that our midfield isn't creative enough. If you watch the entire video above, the majority of goals had nothing to do with the midfield. They were just genius link-up play between Ronaldo and Big Benz. A quick one-two, a low cross into the box, a lofted pass. Just two players who knew exactly how to play with each other. \n\n\\- **Benzema sacrificed so much for Ronaldo:** There were several moments in the video where Benzema could have easily scored, but still gave the goal to Ronaldo. He's truly one of the most unselfish superstars I've ever seen. Never cared about statpadding or getting the individual glory. Just focused on making the whole team better. \n\n\\- **Madrid will never find two attackers with such chemistry:** Mbappe might be more talented than Benzema, and Haaland might be just as clinical as Ronaldo, but even if those two played together for us, they would lack the chemistry that Ronaldo had with Big Benz. I'm glad I got to see them play when I was younger because I'll probably never see anything like it ever again. ",
        "upvotes": 51,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v4MLH-MacOV7byiIz9bDaoD4jyAM__OjOsWOGPdOdQA.jpeg?auto=webp&amp;s=a9b00611c13279a87fd907d8cafc76466209fbe5"
        },
        "permalink": "/r/realmadrid/comments/1p5ooll/well_never_see_benzemaronaldo_linkup_play_again/"
    },
    {
        "id": "1p5or4l",
        "author": "Outrageous-Brain-395",
        "title": "Were you Team Benzema or Team Higuain when they both played here at Madrid?",
        "content": "Be honest. I remember I was Team Higuain, he just looked more prolific and had helped us a lot during previous years including scoring a league-winning goal. It wasn’t until the game vs Lyon that my opinion of him started to change and I realized that he didn’t have that clutch gene that some forwards have. Of course, Benzema also had some terrible seasons early on his career, but his role in being the one who dropped back and linked with the midfield so that Ronaldo and Bale could score helped us a lot. I honestly didn’t expect Benzema to become such a legendary player in hindsight but I’m glad I was wrong. He became the player we all envisioned him becoming back during his Lyon days, where he was compared to a Ronaldo/Zidane hybrid. Higuain, I think, was never the same after the World Cup final where he choked. I still hold a soft spot for him tho, he was the least talented of the 3 (Gago and Marcelo were the other 2) but I think he carved out a decent career. I don’t think he was a legend, but perhaps a cult hero. Funnily enough, Gago was the one many thought had the highest ceiling of the 3, but alas, injuries stopped him.",
        "upvotes": 41,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5or4l/were_you_team_benzema_or_team_higuain_when_they/"
    },
    {
        "id": "1p5nzvu",
        "author": "ManuMora98",
        "title": "[Fem - Official] Linda Caicedo extends until 2031",
        "content": "Real Madrid CF and Linda Caicedo have agreed to extend the contract of our player, who remains linked to the club until June 30, 2031.\n\nLinda Caicedo arrived at Real Madrid in 2023, when she was only 18 years old. He has played 99 games with our shirt, in which he has scored 26 goals.\n\nAt 20 years old, she has already won the 2023 Golden Girl Award. In addition, it has been included in the FIFPro World11 Women's eleven of 2024 and in the ideal eleven of the International Federation of Football History and Statistics (IFFHS). Likewise, she was recognized as the second best player in the world at The Best 2023 awards, and her goal against Germany at the 2023 World Cup in Australia and New Zealand was chosen as the best in the competition.\n\nLinda Caicedo debuted with the Colombian senior team at just 14 years old, with which she has been runner-up in the last two editions of the Copa América (2022 and 2025). And she was included in the ideal eleven of the 2025 Copa América.",
        "upvotes": 42,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1p5nzvu/fem_official_linda_caicedo_extends_until_2031/"
    },
    {
        "id": "1p4yf70",
        "author": "OpbrBlud",
        "title": "This brings back memories",
        "content": "",
        "upvotes": 1469,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ezc7d8joq23g1.jpeg?auto=webp&amp;s=844766941790ea97255cbeaedfcf38f4c4c82c6d"
        },
        "permalink": "/r/realmadrid/comments/1p4yf70/this_brings_back_memories/"
    },
    {
        "id": "1p58xrl",
        "author": "That_Manufacturer_20",
        "title": "The Real Madrid squad right now is too imbalanced",
        "content": "We have too many players with similar profile.\nWe have 3 top Left wingers and no good right winger. \n\nWe have 2 number 10’s in Arda and Jude. They can’t be included in same lineup successfully. \n\nFede, Camavinga, Jude, Tchouameni can run around carry the ball and disrupt the play, but no one is elite level passer of the ball to control the tempo of the game.\n\nThe squad depth looks great on paper however too it’s too concentrated with similar profile players.\n",
        "upvotes": 240,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p58xrl/the_real_madrid_squad_right_now_is_too_imbalanced/"
    },
    {
        "id": "1p4yzp2",
        "author": "No-Independent2522",
        "title": "Bellingham equalizes 2-2",
        "content": "",
        "upvotes": 886,
        "comments": 94,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y1hyc21tu23g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p4yzp2/bellingham_equalizes_22/"
    },
    {
        "id": "1p4zj65",
        "author": "No-Independent2522",
        "title": "I just cannot anymore 😭",
        "content": "",
        "upvotes": 636,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3owca8dsy23g1.jpeg?auto=webp&amp;s=229bba6f51cf418cc262278eacc71f5afe7964af"
        },
        "permalink": "/r/realmadrid/comments/1p4zj65/i_just_cannot_anymore/"
    },
    {
        "id": "1p55jhc",
        "author": "Short_Mousse_6812",
        "title": "The answer to the team is a proper 9",
        "content": "   I think at this point it has to be obvious that Mbappe is not a striker. So many people are so sure that Mbappe can play striker well and just has to learn. However, I think after so much, it is obvious he is not built for that. If you look at his way of playing, always shifts to the laterals of the pitch and plays deeper. If anything, he is more of a false 9, but without the playmaking qualities. I will keep saying it, we are wasting Mbappe by forcing him to play striker. Anyone who claims that he scores, yes he does, because he is Mbappe. Put him anywhere and he will deliver because he is world class, but that is not his best position for him or the team. The amount of times I see a beautiful play just for no one to be in the box is insane. For some reason Mbappe avoids the box as much as possible. I do not know how you would arrange the players after, but I would try Mbappe on the wing for at least one match. If you want to try stuff so much, then play your young prospects who are both strikers! Try playing Gonzalo on less important matches, play Mbappe on the wing for a couple matches, put Endrick, etc. I don’t understand this fixedness on keeping Mbappe as a number nine. When we played the CWC we were doing pretty well because we had a proper 9. Unless we get one, we will keep doing bad. ",
        "upvotes": 169,
        "comments": 147,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p55jhc/the_answer_to_the_team_is_a_proper_9/"
    },
    {
        "id": "1p5jyk0",
        "author": "Ineedhelpistaken",
        "title": "What Real Madrid actually needs after the Elche draw",
        "content": "After watching the 2–2 draw vs Elche, it’s pretty clear what Real Madrid is missing right now. The squad is elite, the talent is there, but the team looks disorganized and blunt in attack. Here are the three things Madrid actually needs:\n\n**1. A real striker**  \nMbappé is world-class, but he is not a pure 9. Every time he plays centrally, the team loses width and unpredictability. He’s at his best when he starts wide on the left and attacks space. Madrid need a striker who stays in the box, finishes chances, and gives the team a reference point for crosses like Trents. Someone who can turn all those half-chances into goals.\n\n**2. Tactical stability**  \nXabi Alonso is experimenting way too much every game. It’s making the team lose structure. Madrid needs a consistent system, a fixed midfield anchor, and a front line that actually fits together. When the team has stability, the quality improves a lot.\n\n**3. Focus and intensity**  \nConceding twice vs Elche came from switching off and losing duels. Madrid have now gone three games without a win, not because they’re worse, but because the players couldn't care less. They need better concentration, and a sharper mentality which would fix half the problems.",
        "upvotes": 15,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5jyk0/what_real_madrid_actually_needs_after_the_elche/"
    },
    {
        "id": "1p59c93",
        "author": "PlantComprehensive77",
        "title": "What happened to the diversity of our goalscoring?",
        "content": "Someone recently posted a graphic on this sub, which showed 5 players in the 23/24 season had 10+ goals (Jude, Vini, Rodrygo, Joselu, and motherfucking Brahim Diaz). \n\nLet's look at how our current attack is faring in the league as we near the end of the first half of the season: \n\n\\- Mbappe: 13 goals (hip hip hooray for the Mbappe fanboys)\n\n\\- Vini: 5 goals (surprised to see him in 2nd place given his inconsistent form)\n\n\\- Guler: 3 goals\n\n\\- Jude: 2 goals (lol, how the fuck is Jude 4th on the list when he pretty much just came back from surgery). \n\nThree other players have 1 goal each, and literally everyone else has a big fat ZERO, including Valverde, Camavinga, and Rodrygo. This begs the question: how the fuck did we go from being a well-balanced attack with 5 players bagging 10+ goals to basically Mbappe FC? Losing Kroos was a big blow, but there's no way one player's departure can lead to such a drastic difference in the attack. \n\nIt also raises another question, why the fuck can't our midfield and defense help out the attack? I'm not expecting prime Ramos numbers, but fuck me, this is dismal. \n\n",
        "upvotes": 70,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p59c93/what_happened_to_the_diversity_of_our_goalscoring/"
    },
    {
        "id": "1p4zv6w",
        "author": "Apprehensive-Use8930",
        "title": "papa perez, i have ideas",
        "content": "",
        "upvotes": 253,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hoi4h4q7133g1.jpeg?auto=webp&amp;s=5e9be3f7e26e7118a3692020cebe3f4f72bccb60"
        },
        "permalink": "/r/realmadrid/comments/1p4zv6w/papa_perez_i_have_ideas/"
    },
    {
        "id": "1p4pbvn",
        "author": "Ineedhelpistaken",
        "title": "Last time we had Kroos",
        "content": "",
        "upvotes": 792,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pyo3g836y03g1.jpeg?auto=webp&amp;s=c33cdb820464b820194466e5ef3753c7a75eca78"
        },
        "permalink": "/r/realmadrid/comments/1p4pbvn/last_time_we_had_kroos/"
    }
]