[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 97,
        "comments": 298,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mkz2o0",
        "author": "wildhawk642",
        "title": "Half Season Releases Are Awful",
        "content": "I really can’t stand these half season releases - I’d so much rather it either be week by week or the full season at a time.  With these half season releases I’m just going to wait until the full season is out and avoid discussions of the first half as best I can, which I think defeats their goal of trying to make series be in the spotlight longer. Either way, between this and their show cancellation decisions, it seems like Netflix figures out the worst thing they could do and then do that thing. ",
        "upvotes": 36,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mkz2o0/half_season_releases_are_awful/"
    },
    {
        "id": "1ml07rs",
        "author": "Anxious_Cricket_1835",
        "title": "Been watching Mr. Robot and now I’m paranoid as hell about my personal info",
        "content": "I just finished watching season 1 of Mr Robot and it's great, no one warned me it's a horror series in disguise lol. I know it’s a TV show but damn watching Mr. Robot has me questioning everything. The way they gather people’s data, hack accounts, clone phones it’s way too realistic.  \n  \nNow I’m just sitting here thinking about how much of my info is floating around considering I've had the same phone number and email for years, signed up for hundreds of sites probably and no clue where half that data ended up. You hear of data breaches as well and it feels like anyone with enough motivation could piece together my whole life.  \n  \nLowkey freaking out about it lol.",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ml07rs/been_watching_mr_robot_and_now_im_paranoid_as/"
    },
    {
        "id": "1mkyq0z",
        "author": "AltruisticAide9776",
        "title": "Has anyone started Wednesday season 2 and is finding it boring?",
        "content": "I found season 1 a bit of a drag too , it just doesn't compel you. At least if they had kept Xavier there would be something i d be curious about but as it the episode gelt a bit longer than it needed to be.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mkyq0z/has_anyone_started_wednesday_season_2_and_is/"
    },
    {
        "id": "1mkng3z",
        "author": "MoneyLibrarian9032",
        "title": "Michael Bay Exits Netflix’s Will Smith Action Film ‘Fast and Loose’",
        "content": "",
        "upvotes": 20,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mkng3z/michael_bay_exits_netflixs_will_smith_action_film/"
    },
    {
        "id": "1mkuaz7",
        "author": "aaaaaaarrrrrcccccc",
        "title": "Suggest some series",
        "content": "Suggest something that is similar to stranger things or Wednesday I also liked the vampire diaries, outer banks, chilling adventures of sabrina and the umbrella academy.\nI like something mysterious, Sci-fi \nSomething like that idk",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mkuaz7/suggest_some_series/"
    },
    {
        "id": "1ml0ulo",
        "author": "listsfeed-1",
        "title": "These 15 Spanish Horror Films Are Scarier Than Anything on Netflix",
        "content": "https://preview.redd.it/wr4bhz1luthf1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=2bb3dab28cce5985283dd1c5e4e949025644d952\n\nIf you think you’ve seen it all when it comes to horror, think again. Spanish-language horror films bring a whole new level of creepy—haunting atmospheres, heartbreaking stories, and scares that hit way deeper than jump cuts. Whether it’s ghosts in old orphanages, cursed families, or strange creatures hiding in the dark, these movies are designed to mess with your head and stay with you long after the credits roll. Ready to sleep with the lights on? Here are [15 Spanish Horror Films Are Scarier Than Anything on Netflix](https://listsfeed.com/these-15-spanish-horror-films-are-scarier-than-anything-on-netflix/).",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml0ulo/these_15_spanish_horror_films_are_scarier_than/"
    },
    {
        "id": "1ml0r5o",
        "author": "Lonely_Broccoli_3232",
        "title": "New netflix layout 2025?!?",
        "content": "Why did netflix decide to change their tv layout?? because i feel like absolutely nobody asked for this, and i hate how to controls/ option bar is at the top instead of the side, i hate how each thing you select on gets bigger and i hate how they MAGNIFIED everything on your screen so you can only see one row at a time! this makes the process take so much longer and my tv is old and SO laggy already so this update makes it so much worse for me. Please netflix; change it back im begging you. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml0r5o/new_netflix_layout_2025/"
    },
    {
        "id": "1mk7ukr",
        "author": "Dry_Resist8265",
        "title": "Need something new to watch … mystery, drama, rich people problems, good vibe shows?",
        "content": "I’m in a full-on show drought. \n\nJust need something with good story, nice visuals. Mystery or thriller is great, but not full horror. Thanks in advance! ",
        "upvotes": 56,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1mk7ukr/need_something_new_to_watch_mystery_drama_rich/"
    },
    {
        "id": "1mjzix1",
        "author": "LeonNeuton",
        "title": "\"The Internet tantrums have begun.\" -Thanks to Netflix's New split release model.",
        "content": "\nOne common point of contention among both critics and viewers of the new season of Wednesday is Netflix's decision to split the release into two parts. As the first four episodes set up a satisfying new mystery, many feel the mid-season cutoff is abrupt and disrupts the show's momentum, leaving viewers with an \"unsatisfying appetizer\" rather than a complete meal. \n\n\"Fans will have to wait until Wednesday, Sept. 3, for Wednesday Season 2, Part 2 – which will conclude with episodes five through eight.\"\n\nWith so many taking it to the Internet streets; Is the uproar warranted? Or are we just spoiled brats moonlighting as binge divas?",
        "upvotes": 147,
        "comments": 282,
        "media": null,
        "permalink": "/r/netflix/comments/1mjzix1/the_internet_tantrums_have_begun_thanks_to/"
    },
    {
        "id": "1mky4g2",
        "author": "darkdragonfaerie",
        "title": "My Oxford year allusions",
        "content": "I just watched this film and noticed there were a ton of literary references I didn’t recognize and many I did. I wish I had taken notes.\n\nDoes anyone have the full lists of authors/poets/poems mentioned in this film? Can’t seem to find a comprehensive list on Google yet. Thank you! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mky4g2/my_oxford_year_allusions/"
    },
    {
        "id": "1mky48e",
        "author": "graemeisverytired",
        "title": "The K-pop in KPop Demon Hunters was added at the end to give it spectacle but became the \"spine\" of the Netflix hit",
        "content": "Despite being something that was a relatively late addition to the core idea, it was the K-pop angle that helped bring Maggie’s directing and writing partner, Chris Appelhans, onto the project. “I also grew up as a musician, and I love music as much as I love film, and I always wanted to find a project that had a justification for using music as the spine in not a Disney musical way. As soon as Maggie told me about this, I’m like, ‘This is the one.’”\n\nMore: [https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview](https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mky48e/the_kpop_in_kpop_demon_hunters_was_added_at_the/"
    },
    {
        "id": "1mkvqac",
        "author": "VecroLP",
        "title": "Is there any way to override the brightness?",
        "content": "I like to watch Netflix on my balcony but every time I sit there during the day Netflix curbstomps my phones brightness to the bare minimum, making it impossible to watch darker shows like Wednesday and stranger things. I know my phone can be brighter because I can see my phones brightness dropping when starting the show, the netflix ui is so much brighter.\n\nThe brightness slider on the left is already set to max, aswell as my phones brightness slider. Is there anything I can do to make use of my phones full brightness while watching Netflix without it just being a black screen with subtitles?\n\nEdit: on android",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mkvqac/is_there_any_way_to_override_the_brightness/"
    },
    {
        "id": "1mjrwod",
        "author": "vladtud",
        "title": "Netflix beauty filter",
        "content": "I really dislike how most Netflix shows have a beauty filter on their female characters. It’s very obvious and distracting while watching. Not that it makes it ok for older characters but what wrinkles does Jenna Ortega even have to hide. Ridiculous! ",
        "upvotes": 201,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mjrwod/netflix_beauty_filter/"
    },
    {
        "id": "1mkrfyd",
        "author": "According_Purchase75",
        "title": "Recommendations for some good watches",
        "content": "Hey guys! Apologies for any mistakes. It's my first post here. I am looking for some recommendations it doesn't have to be sitcoms but anything light and family friendly. I have watched and love BB99, Modern Family, The Office, The Good Place, Friends while couldn't bare to continue through Big Bang Theory, Schitt's Creek or HIMYM. I can watch anything as long as I feel captivated but since I'm planning to watch the series on my home TV set I'd prefer if the show doesn't contain in any explicit nudity.\n\nThanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mkrfyd/recommendations_for_some_good_watches/"
    },
    {
        "id": "1mkjpcu",
        "author": "Southern-Brother5693",
        "title": "Continue Watching - Glitches",
        "content": "Is anyone facing this issue? My Continue Watching list from time to time suddenly includes all the previous titles I have watched. They disappear when I refresh the App but appear again suddenly.\n\nJust weird.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjpcu/continue_watching_glitches/"
    },
    {
        "id": "1mk94dn",
        "author": "Similar-Car-3492",
        "title": "error -1000",
        "content": "my and my mother phone app won't open, it says there is a problem with (-1000) at the end, i can't find anything about it online, anyone here knows what does that mean?\ni forgot to add it does work on the tv \nwe are watching movie on it right now\nit returned to normal but i still have no idea what that -1000 means",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mk94dn/error_1000/"
    },
    {
        "id": "1mkf0fx",
        "author": "Key-Influence-8312",
        "title": "Netflix and Aspect Ratios",
        "content": "I'm planning on setting up a wide screen to watch Gladiator 2 and other wide screen movies. So I was wondering at what aspect ratio does Netflix stream wide screen movies. Any one have any idea? Gladiator 2 for example has a 2.39:1 aspect ratio. \n\n  \nThanks",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkf0fx/netflix_and_aspect_ratios/"
    },
    {
        "id": "1mkjlrr",
        "author": "Junior_Ostrich_5951",
        "title": "What should I do?",
        "content": "I have the basic Netflix plan and the truth is that I use it at home less at night since I work and well sometimes in my free time I watch one or another series and does it tell me that I should improve the plan to be included in the home plan? How do I solve it, the truth is that it doesn't seem fair to me, I don't even see it with Wi-Fi, I use my mobile data",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjlrr/what_should_i_do/"
    },
    {
        "id": "1mkd79w",
        "author": "tinksabellx",
        "title": "Web of Make Believe: Death, Lies &amp; the Internet",
        "content": "Late to the party on this one, but just started watching Web of Make Believe and just finished episode 4: Sextortion.\n\nI’m sure you’re all like me and Google the names of the perpetrators to see where they’re at now….? No? Just me? Nahh I know you’re lying if you say you’ve never done it….\n\nAnyway…\n\nThis episode is based on around 23 girls (literal teenagers) who got a random friend request from a guy and started talking. It then became sexual on his part, and the girls did send some photos of themselves in various states of undress. \nHe then tried to extort them, saying he’ll release the images on the internet first everyone to see.\n\nFinally, after years of harassment, he was named - Ryan Vallee - arrested and charged. He pled guilty and got 8 years.\n\nHe was released in January 2022. So, natural I googled.\n\nOh and low and behold, he’s recently been arrested (this year, April 2025) for having:\n- 175 images\n- 11 video files\nOf child SA on his devices! \n\nNo court date as of yet. But, what a straight up piece of 💩!\n\n———\n\nArticles:\n\nhttps://indepthnh.org/2025/05/05/child-porn-convict-featured-in-netflix-sextortion-documentary/\n\nhttps://www.justice.gov/usao-nh/pr/harrisville-man-plead-guilty-possessing-child-sexual-abuse-material-while-federal",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkd79w/web_of_make_believe_death_lies_the_internet/"
    },
    {
        "id": "1mjn139",
        "author": "pvpixelarts",
        "title": "Untamed is just so so",
        "content": "Just my personal opinion on Untamed series. \n\nIt was so much hyped up IMO. No depth in the story line and I could not keep myself engaged in the series at all. What you all think? ",
        "upvotes": 75,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mjn139/untamed_is_just_so_so/"
    },
    {
        "id": "1mkh7dk",
        "author": "Chris_Nexton",
        "title": "Your Avatar",
        "content": "Do you have any flexibility in your choice of avatar for Netflix? I’m presented with cartoonish characters and characters from shows I don’t watch, so can I put my photo there if I want? I see no way to do that, but thought I’d ask nonetheless.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkh7dk/your_avatar/"
    },
    {
        "id": "1mkt4t7",
        "author": "Reading-Rabbit4101",
        "title": "Could Amy Bradley have fallen overboard and then been trafficked",
        "content": "Hey so looks like the two main competing theories are that she fell overboard and that she was trafficked, and each has some supporting evidence. So I am just thinking, why not both? Like what if she fell overboard, swam to shore but was disoriented and distressed, and then taken by some bad guys? This can explain the balcony table pushed up against the rail, that no one saw her leaving the cabin/ship, that they couldn't find her body at sea, that nothing was washed ashore, the photos, sightings, etc.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mkt4t7/could_amy_bradley_have_fallen_overboard_and_then/"
    },
    {
        "id": "1mk4rmd",
        "author": "EnvironmentalOne8630",
        "title": "Looking for tv series recommendations",
        "content": "I tend to like more realistic shows but an open to all genres for the most part just no anime or cheesy cliche written stories. My favorites include\n\nLost\nThe leftovers\nThe stand\nMr robot\nAmerican primeval \nThe man in the high castle\nMindhunter\nOzark\nBloodline\nThe crowded room (very insane)\nMobland \nThe last of us (season one only)\nWalking dead\n\nThat’s all I can come up with at the top of my head and I do like most of Tyler Sheridan shows except for lioness and landman was “ok” would have been better without the obnoxious ex wife and daughter. The ones listed above are generally the shows I tend to enjoy. \n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mk4rmd/looking_for_tv_series_recommendations/"
    },
    {
        "id": "1mk3ufm",
        "author": "ToonAdventure",
        "title": "The World of Dr.Seuss | Official Announcement | Netflix Jr",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3ufm/the_world_of_drseuss_official_announcement/"
    },
    {
        "id": "1mkf1f3",
        "author": "Single-Competition12",
        "title": "I’m looking for a really obscure show that was on Netflix. (Around 2019-2021)(Don’t know if it was exclusive to Canadian Netflix or not)",
        "content": "Hey everyone, I hope y’all are having a nice day.\n\nSo I’m looking for a 3d animated fantasy series that was based on a Korean Manga (I think). It had specifically only a Korean audio track but included English subtitles.\n\nI watched it a while ago so my summary might be unhelpful. So the show satirized RPGs and split its story between two groups of characters. A boy that just became an adventurer and a group of monsters (a bunny girl, a goblin and a slime I think, maybe more)\n\nThere’s then the evil/dark Lord who is actually just a good guy who became sympathetic to monsters, he looked like a very cartoony much and had a sea creature wife.\n\nThat’s pretty much all I remember from it. If someone finds any clues about it I’d be immensely grateful. Thx again.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkf1f3/im_looking_for_a_really_obscure_show_that_was_on/"
    },
    {
        "id": "1mk72jx",
        "author": "lightonscreen",
        "title": "issue with a show streaming",
        "content": "hey! I've had this issue for some time, but now I'm actually bothered by it. I'm using Netflix on my phone and tablet and I'm currently watching dexter. I don't know why, but this exact show is available on my phone, but not on my tablet. it's the same account, same everything. it was there before though. and Netflix support just isn't working, can someone please help?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mk72jx/issue_with_a_show_streaming/"
    },
    {
        "id": "1mjza1u",
        "author": "Nice_Pen_8054",
        "title": "Top action K-Drama series on Netflix?",
        "content": "Good afternoon,\n\nI am looking for K-Drama series.\n\nWhich are your top action K-Drama series on Netflix?\n\nI prefer action, adventure or horror.\n\nThank you.\n\n// LE: thank you all",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mjza1u/top_action_kdrama_series_on_netflix/"
    },
    {
        "id": "1mj4s0m",
        "author": "BadShi-6",
        "title": "What’s with every new series being split in to 2 parts?",
        "content": "I’ve just sat down to watch the new season of Wednesday — I’ve noticed yet again Netflix has split the season into part 1 and part 2. Why do they keep doing this?  It’s actually super annoying to me, long gone are the days you can just sit and binge a new series on your day off. \n\nDo you guys prefer them split into 2 parts? I lose interest waiting for the second part of anything.. is there specific reasons for this like stretching out views etc? I don’t think it builds suspense like Netflix thinks, it’s actually just annoying 😂 ",
        "upvotes": 134,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1mj4s0m/whats_with_every_new_series_being_split_in_to_2/"
    },
    {
        "id": "1mkhx03",
        "author": "VermicelliUpbeat3008",
        "title": "Did ads always exist?",
        "content": "As title (I used to have a netflix subscription 1-2 years ago) and which subscription should I get if I want to purchase it for one month? With ads or without ads? I don't have a specific budget, but if possible, I want to save money. Also what is the frequency that the ads come on?\n\nWhy did I get downvoted? I'm genuinely confused",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mkhx03/did_ads_always_exist/"
    },
    {
        "id": "1mk3rmw",
        "author": "grindingcoffeebean",
        "title": "TV Show: You (Potential Spoiler)",
        "content": "You can go ahead and spoil it for me (please!). \n\nMy partner started watching this tv show and I grab bits and pieces of the show but it’s freaky as hell. Every time I see the screen, there’s a new person in the glass cell. \n\nCan someone dumb it down for me and tell me what the show is about, I get trauma from watching bits and pieces of this show. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3rmw/tv_show_you_potential_spoiler/"
    }
]