[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 39,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qhjsrb",
        "author": "fairplanet",
        "title": "why tf cant i stream netflix to my tv/cromecast anymore?",
        "content": "like i cant stream netflix to my chromecast anymore? my chromecast has always been funky with netflix like just not working but i didnt use netflix a while and wanted to cast but there is no option anymore?\n\nis there a way to fix it? ",
        "upvotes": 29,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qhjsrb/why_tf_cant_i_stream_netflix_to_my_tvcromecast/"
    },
    {
        "id": "1qht0cy",
        "author": "HotPotatoPieee",
        "title": "Behind her eyes (I hated the ending)",
        "content": "TW: lots of spoilers. This was actually the most aggravating show I’ve watched. I saw someone talk about it along his &amp; hers (I loved this show) so I figured I’d watch. The first time Adele and Rob astroproject together I saw the colors of their projections so the show was spoiled for me in that moment. \n\nBinged it this weekend but the last episode pissed me off. I thought Louise was smart when she clocked Adele after Adam caught her Astro projecting. But I lost it when she proceeded to call Adele after David told her not to speak to her. FURTHER, tells her about what she knows about Rob and says he’s going to the police🤨. After her failed judgement you’d think she’d actually listen to David this time. \n\nOnly character I liked in this show was her friend. She’d clock Louis all the damn time and rightfully so but Louis shut her off after. That’s the most level headed person Louis had in her life. Idc how much pity she felt for Adele, all those interactions were just gross for character development. How can you claim to pity someone and sleep with their husband repeatedly🙂?? Her judgement throughout the show was so excruciatingly painful.\n\nAs if she didn’t already act stupid enough. She could’ve called 911 to stop the fire. BUT SHE ASTROPROJECTS???? Wtf was she planning to do in the moment. Like it was so foolish it pissed me off. I knew what was coming next when she decides to astroproject and we see Robs projection in the room as well. I was so livid I turned it off when Louise is confronted by Adele and climbs on her.\n\nI’ve never seen so much stupidity in a plot I was aggravated I didn’t want to watch the rest. Like I’ve never seen a worse ending. The fact that Rob wins and David is still sentenced to hell is just sick. I need to wash this show out of my system and forget I ever watched it ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qht0cy/behind_her_eyes_i_hated_the_ending/"
    },
    {
        "id": "1qhqu60",
        "author": "Crafterandchef1993",
        "title": "Why remake the seven dials mystery when you completely change the story?",
        "content": "Netflix made a seven dials mini series, but it's not like the book or the 1981 adaptation. It's a different story, and for some reason, putting Bundle and Gerry together as a couple. The 1981 adaptation was so charming, that I'm not sure if I like this adaptation, all the Netflix version makes me want to do is watch the 1981 film. Which I have on dvd",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qhqu60/why_remake_the_seven_dials_mystery_when_you/"
    },
    {
        "id": "1qhugrt",
        "author": "True_Ask_6886",
        "title": "Need Suggestions to Watch",
        "content": "So I want to watch a new tv show, I've already watched a bunch on Netflix, but all the ones Im seeing are for 18 or 16 year olds (Im 14). I was hoping for any new suggestions of what to watch! Like, I dont mind excessive violence or horror like AOUAD or AIB, but I really dont want to watch something like..... Bridgerton, Game of Thrones. Id appreaciate any suggestions you could give me!",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qhugrt/need_suggestions_to_watch/"
    },
    {
        "id": "1qhkas5",
        "author": "VesnaKostic",
        "title": "Similar series like Run Away by Cobain that the last scene left me with my MOUTH WIDE OPEN",
        "content": "I have watched all the other series by Coben and I like that every scene is a new TWIST. I want a tv show with as many twists and turns as possible. \n\nI want something twisted and that I never dreamed that it was a plot. 😶‍🌫️😶‍🌫️😶‍🌫️😶‍🌫️😶‍🌫️",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qhkas5/similar_series_like_run_away_by_cobain_that_the/"
    },
    {
        "id": "1qhpzag",
        "author": "Boring_Ant_1677",
        "title": "Sasha Calle and Catalina Sandino Moreno on The Rip, Moral Panic, and Life-Changing Cash",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qhpzag/sasha_calle_and_catalina_sandino_moreno_on_the/"
    },
    {
        "id": "1qhvd0x",
        "author": "Comfortable_Joke_798",
        "title": "Top 10 movies to watch on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qhvd0x/top_10_movies_to_watch_on_netflix/"
    },
    {
        "id": "1qhkbs5",
        "author": "Nearby-Blueberry8899",
        "title": "Simon Cowell The Next Act",
        "content": "Am I the only one who feels like this series isn’t about creating the next boy band but instead just recreating One Direction since they split?\n\nIt’s a cute concept and I love any opportunity to showcase smaller artists, if anyone CAN do that, it’s Simon of course. But I feel like this wasn’t about “creating a boy band” as much as it was about recreating One Direction and trying to get it “bigger” and “better” the second time around. Down to the snippet of needing someone from Dublin in the band because without it, the band would be incomplete. Instead of following an algorithm or method to create a band it seems like he’s taking the individual characteristics of the One Direction members and searching for them in these young talents i.e. the Irish one, the big brother figure, etc..\n\nThoughts?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qhkbs5/simon_cowell_the_next_act/"
    },
    {
        "id": "1qh9rxf",
        "author": "theevilmidnightbombr",
        "title": "Travelling for three months: Under Netflix's new policy, is cancelling the only option?",
        "content": "I've been reading a few similar posts here, and I think I've already answered my own question, but:\n\nI've been away since December 1st, and Netflix just stopped working today for no (initially apparent) reason. They want me to cancel and restart my membership, but I need a local credit card? Kept telling me Netflix is \"IP address based\". Seems insane. Yes, licensing. Yes, international agreements. Sure. Still insane.\n\nThere's no other solution here, is there?\n\nBeen keeping it for the wife and kid for convenience, but now, blech.",
        "upvotes": 13,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qh9rxf/travelling_for_three_months_under_netflixs_new/"
    },
    {
        "id": "1qhsvrp",
        "author": "Informal-Matter-2130",
        "title": "How to watch a movie at the same time?",
        "content": "Both my friend and I have Netflix accounts and want to watch movies together.  Is there a way to sync a movie so we can do so without breaking the ToS?",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qhsvrp/how_to_watch_a_movie_at_the_same_time/"
    },
    {
        "id": "1qgmuur",
        "author": "SpecialistTour4232",
        "title": "Netflix new layout SUCKS",
        "content": "Bro why did they change the layout of Netflix to be so difficult to navigate?? It’s like Hulus horrendous layout. Literally the reason I preferred Netflix was the ease of use. ",
        "upvotes": 290,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmuur/netflix_new_layout_sucks/"
    },
    {
        "id": "1qhmpei",
        "author": "Calm_B4_TheStorm",
        "title": "Does Netflix credit expire. If pause/ cancel sub?",
        "content": "I purchased 1 month Netflix just to watch the rest of Stranger things, and watched afew other things. But don't want to continue the sub after the month expires.\n\nIf I cancel, and say later on in year see a series I want to watch, can I use the same account? Or do they delete it along with any remaining credit 💳?\n\nAfter paying for one month subscription, I have $4.01 Netflix credit as I used a $25 Netflix voucher to sign up.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qhmpei/does_netflix_credit_expire_if_pause_cancel_sub/"
    },
    {
        "id": "1qhegq0",
        "author": "Mech-inationz",
        "title": "11.22.63",
        "content": "Loved it. But here’s my thing; from my understanding of the show, time only pushes back when you actively try changing monumental events. Would Sadie have counted? No? She was shot during his attempt to rescue JFK. The timeline’s one final, resounding, (petty) “NO!” To him. He’d already decided to let Kennedy die at the end; who cares what that old man had to say? That old man was trying to prevent a DEATH from occurring. HE was just trying to date a girl. Who’s to say she would die? \n\nMy first thought was “bring her into 2016!. Let JFK die.” He lived in the past for years and the ONLY time the past tried to push back was when he actively tried stopping a HUGELY historical event. Who’s to say the timeline would even give a damn about some harmless, small time relationship? It’s at LEAST worth a second chance. If it doesnt work out AGAIN (due to some random, uncommon freak accident) reset, consider it irrefutable proof that they can’t be together and go about your day. But for me, I would’ve given it a second chance.\n\nReal love is hard to find, also, and this is just my shallow side speaking, there’s absolutely ZERO chance in hell I’m giving up on a woman that looks like HER without giving it all I’ve got at least one more chance. That’s going to haunt him forever. It would haunt me. Either, bring her to the present (no more risky to her life than his life being at risk when he lived in the past for years), or live in the 60s, bring some of the coolest, coldest tech that would work then, and a print out of every major sports event worth betting on. And one more thing. Since, at the very least, we know his cell phone can play already downloaded memes (when he distracted the mobster with the phone on his bed), I’d grab 2 laptops, a charger, download as many movies, sports, ect from our (future) timeline, and blow Sadie’s MIND with Thanos whooping each Avenger without even trying, Quentin’s best, and Marty’s classics. \n\nHe really REALLY dropped the ball. ",
        "upvotes": 2,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qhegq0/112263/"
    },
    {
        "id": "1qhf90q",
        "author": "AlexLovesCoke",
        "title": "Can someone delete my profile if it has the lock pin?",
        "content": "So my sister did this annoying \"prank\" once where she deleted my profile, which was annoying but no problem. I made a new one and I decided to add a lock pin to it.\n\nWill this stop her from deleting it? Or should I just get a private subscription for myself?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qhf90q/can_someone_delete_my_profile_if_it_has_the_lock/"
    },
    {
        "id": "1qgj2w1",
        "author": "itzclicker",
        "title": "Netflix \"random\" button",
        "content": "Does anyone else wish that Netflix had a \"random\" button where when pressed it would put on a random film that you haven't watched before. I wish it did because it's alway's so hard to find new stuff to watch!",
        "upvotes": 80,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1qgj2w1/netflix_random_button/"
    },
    {
        "id": "1qgrvdk",
        "author": "cheesycat6969",
        "title": "Lost in space is so good but so infuriating",
        "content": "My roommate and i started watching Lost in Space (season 1, ep 9), and even though it’s pretty entertaining im losing my patience with how the plot barely progresses. literally every time they try to do anything, something goes wrong. i know conflict is necessary but when it happens every single time it just feels repetitive annoying and predictable. I haven’t seen anyone complain about this so that’s just my rant. have a good day. ",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qgrvdk/lost_in_space_is_so_good_but_so_infuriating/"
    },
    {
        "id": "1qgt8ly",
        "author": "feelingwizzed",
        "title": "Spoiler: who saw the His &amp; Hers ending coming?",
        "content": "I had a feeling she was the one who was assaulted after what Zoe said at the police station. \n\nAlso, I totally saw the mom had something to do with it once they mentioned she kept getting lost but only at night. \n\nThey had me fooled for like 2 minutes that it was only Catherine but then I thought about how she may have killed her sister but the killing for the attack thing…eh. \n\nThinking MEDIA wise, it would’ve made “more sense/more drama” to go after the men who did it AND the women. \n\nSo anyways, enjoyed my binge but it wasn’t great. ",
        "upvotes": 17,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qgt8ly/spoiler_who_saw_the_his_hers_ending_coming/"
    },
    {
        "id": "1qh9mtb",
        "author": "ValBabaBanks",
        "title": "Ideas",
        "content": "Hey! I recently watched the series *Grâce et Frankie*, which was just awesome (I cried at the end, and I was really sad not to watch this series anymore when I got back from school), then I watched *Dead to Me*, which I also loved, even though the last episode left me hanging. Then I got really hooked on the series *Workin Mom*, which is really extremely funny and real. What should I watch now in the funny, girlpower style with a good story and really good vibes that mixes friendship and humor to watch without overthinking it?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qh9mtb/ideas/"
    },
    {
        "id": "1qgvv8c",
        "author": "LilNello1",
        "title": "The Rip",
        "content": "So just got done watching The Rip and wanted to know for those of you who have watched it so far.  Without giving away too many spoilers, if any.  What are your thoughts and why did you like or not like it?",
        "upvotes": 5,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1qgvv8c/the_rip/"
    },
    {
        "id": "1qfs60q",
        "author": "DemiFiendRSA",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the ‘Plot Three or Four Times in the Dialogue’ Because Viewers are on ‘Their Phones While They’re Watching’",
        "content": "",
        "upvotes": 1626,
        "comments": 131,
        "media": null,
        "permalink": "/r/netflix/comments/1qfs60q/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qgw10v",
        "author": "FunRealistic7609",
        "title": "Thanks for the Recommendations!!",
        "content": "I’ve watched His &amp; Hers and The Beast in Me.\n\nJust wanted to say thanks to everyone who suggested them. I really enjoyed both shows!..\n\nhttps://www.reddit.com/r/netflix/s/iY7Ope6WQE",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgw10v/thanks_for_the_recommendations/"
    },
    {
        "id": "1qggiio",
        "author": "RiskAndReason",
        "title": "What did you WATCH THIS WEEKEND?",
        "content": "What did you end up watching on Netflix this weekend?   \n  \nA new series, a comfort rewatch, or a random movie you finally gave a chance? Looking for ideas to add to my watchlist.",
        "upvotes": 30,
        "comments": 216,
        "media": null,
        "permalink": "/r/netflix/comments/1qggiio/what_did_you_watch_this_weekend/"
    },
    {
        "id": "1qh17ur",
        "author": "HarinNakashimo",
        "title": "Next, I NEED HELP",
        "content": "Here's a case of a human being who finished two series today, Brooklyn Nine-Nine and Spy X Family (I know it's anime, but whatever). I need recommendations for Netflix. I'm the type who likes everything, there are only three things I don't want:\n\n1- Very dramatic series (like Shameless)\n\n2- Series with very long episodes. 20 minutes is my limit, 40 minutes is a crime (right, Shameless?)\n\n3- It's not exactly a rule, but I have a weakness for sitcoms and romances (especially LGBT). If you recommend any, I'm more likely to watch them (except Shameless).\n\nNow that my love for Shameless has been proven, I'm ready.\n\nLast edit: someone can probably recommend Heartstopper, but I prefer to finish watching it today. webtoon first.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qh17ur/next_i_need_help/"
    },
    {
        "id": "1qgwwcc",
        "author": "FenkDaddy",
        "title": "Noticed another movie on a screen in a scene in “the rip” and was curious if there’s a connection",
        "content": "There’s a scene in Netflix’s new movie where JD (Ben Affleck) goes into a house across the street to investigate the house light that signals “pigs” through Morse code. I believe the movie on the screen to be the Belko experiment from 2016. I was curious if anyone could find any correlation between the two movies because I can’t seem to.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgwwcc/noticed_another_movie_on_a_screen_in_a_scene_in/"
    },
    {
        "id": "1qg5yyv",
        "author": "Miserable-Bother-572",
        "title": "Agatha Christie's Seven Dials",
        "content": "I am a big fan of Agatha Christie and her work. Books are great, and Poirot with David Suchet is one of my favourites. The newest adaptation, which aired on Netflix is a huge let down for me, and my greates impression is that they have really dumbed it down. what is you opinion? ",
        "upvotes": 47,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1qg5yyv/agatha_christies_seven_dials/"
    },
    {
        "id": "1qgp6pf",
        "author": "Achenar459",
        "title": "Is there a built-in way to tell if all the episodes in a season are available to watch?",
        "content": "Is there any built‑in way on Netflix to see whether a season is fully available, or do I need to check somewhere else—like Google or IMDb—to know if more episodes are still pending?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qgp6pf/is_there_a_builtin_way_to_tell_if_all_the/"
    },
    {
        "id": "1qhi839",
        "author": "ZealousidealArm160",
        "title": "On a scale of 0-10 how much of a boost in fame did Fleetwood Mac and Stevie Nicks both as the face of the band and as a solo artist get in Asia and Africa beside countries they’re big in pike Japan Singapore South Africa from their music being in White Lotus The Bear The Crown Stranger Things etc",
        "content": "And also South America, and Europe beside countries like the UK, Germany, Netherlands, Ireland, as they never toured Africa never toured Asia beside Japan, most of their tours in Europe were in countries like the UK, Germany, Netherlands, and Ireland, and never toured South America, but these shows and stuff are famous on every continent so.",
        "upvotes": 0,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qhi839/on_a_scale_of_010_how_much_of_a_boost_in_fame_did/"
    },
    {
        "id": "1qgq8jx",
        "author": "itsssstonyyy",
        "title": "His and hers",
        "content": "What’s a shit show, In the last episode how did Priya arrive the same time as Jack to take the shot killing lexy, literally makes zero sense when jack had left priya unconscious ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgq8jx/his_and_hers/"
    }
]