[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hrc6ol",
        "author": "S4v1r1enCh0r4k",
        "title": " Netflix Accidentally Leaks 'Squid Game' Final Season Release Date -June 27 ",
        "content": "",
        "upvotes": 595,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc6ol/netflix_accidentally_leaks_squid_game_final/"
    },
    {
        "id": "1hrqrxt",
        "author": "Whobitmyname",
        "title": "Netflix Canceled the Most Shows in 2024 (16), More Than Any Other Streamer or Network",
        "content": "",
        "upvotes": 45,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqrxt/netflix_canceled_the_most_shows_in_2024_16_more/"
    },
    {
        "id": "1hrwg7s",
        "author": "Robemilak",
        "title": "First trailer for ‘THE RECRUIT’ Season 2, starring Noah Centineo and Teo Yoo.",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrwg7s/first_trailer_for_the_recruit_season_2_starring/"
    },
    {
        "id": "1hrqrzv",
        "author": "ConfidenceUnited3757",
        "title": "Netflix keeps thinking I am currently watching a movie, but I am not",
        "content": "I have a bizarre issue that I could not solve by googling. When I want to watch anything on my smart TV Netflix app it tells me thus is not possible brcause I am currently watching Harry Potter on that same device and can only use one at a time. I did watch Harry Potter a month ago and didn't open it since and this only became an issue a few days ago. But what I am able to do is watch Harry Potter (and only that) on my TV and anything else concurrently on my phone, so their device tracking doesn't actually work at all. I have tried restarting and logging in and out of the app on my TV (it can't be uninstalled) but to no avail. Really frustrating and kind of unbelievable that a 400 billion dollar company can't get such a simple feature right.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqrzv/netflix_keeps_thinking_i_am_currently_watching_a/"
    },
    {
        "id": "1hrm3qp",
        "author": "Neither_Technology74",
        "title": "Discussion: Too many low grade, effortless, productions.",
        "content": "Here's where I currently stand on Netflix as a whole:  \n  \nAs an example: If Netflix produced Star Trek: The Next Generation, it would have been cancelled after the first season and it would never have become as huge as it is today.  \n  \nNetflix needs to take more responsibility to bring stories to fruition and conclusion. Stop producing so much absolute C, D and F grade productions.   \n  \nFocus up and work to improve the shows that have traction to be there. You cancel shows with viewers measured in millions and waste money producing umpteen 100's of things with viewership measured in thousands. \n\nPeople pay good money to spend their time getting involved in concepts, plots, character development, etc., only to have Netflix repeatedly and relentlessly pull the plug on them. \n\nAlso becomes difficult to find things worth watching because you have to browse forever through low grade productions on the platform. \n\nPersonally, I think they should stop wasting so much money, only to pull the plug on good productions because of.... money, and stick to their guns and see things through. \n\nThere's a mathematical reality to having, for example, 10,000 things to watch, spread over your subscribership, vs 5,000 higher quality things spread over your viewership. Viewership hours are finite. They put so much out there, they distract viewership from coagulating onto good productions that rely on viewership to continue production. It seems like they do not understand this basic concept. \n\nCurious to hear what you all think, please comment below :) ",
        "upvotes": 12,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hrm3qp/discussion_too_many_low_grade_effortless/"
    },
    {
        "id": "1hr9xg9",
        "author": "MarlowInvests",
        "title": "La Palma - Ending really p***ed me off.",
        "content": "I've just finished watching the limited series of \"La Palma\", which I was really enjoying. Right up until the last 15mins of the last episode. So much so it's pi**ed me off.\n\nHow can someone survive a frigging tsunami after being hit with it whilst taking off in a plane? They must of been underwater for at least 15mins (that's being generous) whilst the rest of the island gets wiped out.\n\nThey should of ended it where she and her new girl friend died. \n\nHow does everyone else feel about the ending?",
        "upvotes": 63,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hr9xg9/la_palma_ending_really_ped_me_off/"
    },
    {
        "id": "1hrq854",
        "author": "MagpieTower",
        "title": "Horizon: An American Saga should have been made as a TV series instead of movies.",
        "content": "I think Horizon is pretty good, even though the pacing is somewhat a bit off, but it's probably expected since it has large casts. I just feel it should have been made into TV series since that's the general feel I get from watching the movie, but that's just me. I feel like there's more stories to be told and I want to know more about the characters, but it feels like there's not enough since they had to cram everything in one movie and cut some parts out. Even though there's Part 2, if it ever comes at all and I would definitely look forward to that. I think Horizon has potential to become better.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrq854/horizon_an_american_saga_should_have_been_made_as/"
    },
    {
        "id": "1hrnmm8",
        "author": "sassylilchix",
        "title": "Extra member forced ads ",
        "content": "So my parents added me as an extra member on their Netflix so I can watch squid game in peace.\n\nBUT the extra member account I have is with ads. I only found one other person on Reddit with the same issue.\n\nIf I were to buy Netflix with ads in my own it’s 6.99 but an extra member is 7.99…?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrnmm8/extra_member_forced_ads/"
    },
    {
        "id": "1hrqkzv",
        "author": "aRJei45",
        "title": "Watched on Another Profile",
        "content": "Is there a feature that's something like my title? I already watched Squid Games S2 on my sister's profile. Now, I want to tag the show as already watched on my profile.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqkzv/watched_on_another_profile/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 1250,
        "comments": 166,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hro1x0",
        "author": "Bybebyebirdie",
        "title": "Where can I still find this?",
        "content": "So they have this great experience in Amsterdam, but I'm not sure they still have it.\nDo you guys know where I can find this or something like it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hro1x0/where_can_i_still_find_this/"
    },
    {
        "id": "1hrk9qg",
        "author": "infallables",
        "title": "DOTA: Dragon’s Blood is Incredible",
        "content": "This is an absolutely incredible series. World class quality in the voice acting, action, animation, and above all dialogue. Does anybody know if there will be further seasons? Are Mitch Iverson or Ashley Edward Miller writing or producing any more series?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hrk9qg/dota_dragons_blood_is_incredible/"
    },
    {
        "id": "1hrsmia",
        "author": "Rando522",
        "title": "Can you find this?",
        "content": "I need help finding the novie or tv series with this quote. It may not be exact.\n\n\"A mans wife and child died to soldiers after being hunted down for so long and breaks him\"\n\nIt was mentioned that he has a psychic break.\n\nHe has the ability to use flesh as a power and he uses this ability in the scene.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrsmia/can_you_find_this/"
    },
    {
        "id": "1hrv9x2",
        "author": "revdj",
        "title": "What is your opinion on this tech support chat?",
        "content": "\\[names changed\\]  \nThis was a transcript with someone who claimed to be from tech support.  Note - this looks like a phishing bot.  Note the responses that ignored mine and tried to get my credit card information. Should I make a complaint with the attorney general’s office?  What do you think?\n\nYou\n\nI want to change my name\n\nYou\n\nMy name is no longer Oldname it is Newname\n\nJericson Netflix\n\nHi! Thank you for contacting Netflix. My name is Jerry, I got your message above. To locate your account, may I please have the full name and email address you use on the account?\n\nYou\n\n\\[email address\\]\n\nYou\n\nOldname\n\nJericson Netflix\n\nThanks!\n\nJericson Netflix\n\nWe appreciate you contacting us regarding this matter\n\nJericson Netflix\n\nRest assured that you have the best possible support available here in Chat. Just a quick reminder, here are some tips so we don't get disconnected: Please don't use the back ◀ or close ❌ this chat window and please reply within 2 minutes so the system knows we're still chatting.\n\nJericson Netflix\n\nWhat should be the new name now?\n\nYou\n\nNewname\n\nJericson Netflix\n\nAlright\n\nJericson Netflix\n\nMay we know the reason why you wanted to change the name?\n\nYou\n\nI'd prefer not to say\n\nJericson Netflix\n\nAlright\n\nJericson Netflix\n\nBefore we proceed, could you please verify the name on the account and the date when you sign up?Also, the last 4 numbers of your card?\n\nYou\n\nMy card?\n\nJericson Netflix\n\nYes\n\nYou\n\nI'm not giving you my credit card number. Are you saying that you won't change the name without that information?\n\nYou\n\nAnd I already told you the name on the account.\n\nJericson Netflix\n\nThank you\n\nJericson Netflix\n\nPlease verify the last 4 numbers of the card on file and the date when you sign up\n\nYou\n\ndid you read what I just said?\n\nJericson Netflix\n\nYes\n\nJericson Netflix\n\nIt must be verified in order for us to change the name on the account\n\nJericson Netflix\n\nOr else we are not going to grant your request.\n\nYou\n\nI'm not giving out my credit card number. Sorry. Have a good day.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrv9x2/what_is_your_opinion_on_this_tech_support_chat/"
    },
    {
        "id": "1hr3h5o",
        "author": "Kaleidoscope_Pure",
        "title": "Is House of Cards worth watching?",
        "content": "Always thought this is probably a good show, however things with Kevin Spacey went down really fast, and i think the show might end up kinda bad after he left.\nEven with all that, is it worth watching? ",
        "upvotes": 46,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1hr3h5o/is_house_of_cards_worth_watching/"
    },
    {
        "id": "1hrlq1p",
        "author": "dacluelessbadger",
        "title": "Unable to watch specific titles on Netflix Apple TV",
        "content": "Since this morning I have been unable to watch certain shows on my Apple TV specifically on my Netflix profile. I tested other devices and other profiles and they did not have this issue. \n\nI initially thought that this issue was limited to the shows I was currently watching, given that I couldn’t find the “continue watching” tab or actually start watching those shows after searching for them. The only options I saw were “Remind Me” and “Watch Trailer.” Then I realized that this issue is also affecting almost every single non-Netflix original and some Netflix originals. These Netflix originals do not have title cards and are just text. Also, there are no titles on my watch list even though I remember having many shows and movies added.\n\nI contacted support and they were not helpful in the slightest (they suggested I just wait and that my request will be processed in the backend… whatever that means). \n\nIf anyone has experienced anything similar recently I would greatly appreciate any troubleshooting advice!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrlq1p/unable_to_watch_specific_titles_on_netflix_apple/"
    },
    {
        "id": "1hr0xa7",
        "author": "No_Spinach_9309",
        "title": "loved squid game season 2. thought it was good",
        "content": "# so i kinda loved season 2. (also season 1) i think its crazy how much hate i saw on this sub about the season. just showed me not to go on reddid after watching shows, its so negativ. \n\nand some comments i see about the season are just weird. like the crirics for it. im like what do you mean? this didnt made sense? it wasnt unrealistic either. it totally did. or that the characters werent likeable or the acting wasnt that great. and even with more specific negativ reviews im like? the comments just dont make sense to me. also i didnt found it boring at all. i have the feeling people just want to watch extrem games and people dying. they dont care about the story. the only thing i hated was the ending lol. so sad",
        "upvotes": 75,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0xa7/loved_squid_game_season_2_thought_it_was_good/"
    },
    {
        "id": "1hrq561",
        "author": "Ashen560",
        "title": "Finding a Show",
        "content": "I saw a clip on tiktok last week and it was of a dnd campaign animated, but the comments said there are different stories from different games and such. So I guess different stories in each episode/every few episodes? I’m pretty sure I saw it on the top 10 search earlier today but now I can’t find it anywhere. Title is probably 2-3 words, thanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrq561/finding_a_show/"
    },
    {
        "id": "1hrtat3",
        "author": "ZealousidealAd6578",
        "title": "netflix not letting me watch shows/movies that aren’t originals?",
        "content": "so, i was watching spy x family, and prior to next day when i wanted to continue watching…\nmy continue watching list wasn’t showing up and so i search the show up. But when i clicked on it, it only has a ‘reminder set’ option even though i’ve been watching it??? it only happens on my account but not on the others? can anyone tell me what’s going on?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrtat3/netflix_not_letting_me_watch_showsmovies_that/"
    },
    {
        "id": "1hrl2yc",
        "author": "Last_Till8596",
        "title": "Need Help Finding TV show ",
        "content": "I need help finding a tv show. It stars Taissa Farmiga. When her character was young girl her family visits an island where her older sister dies while with two African men. One of there names in gogo. In the present day Taissa Farmiga's character is living in New York and comes across one of the men accused of killing her sister. She tries to prove or figure out if he really killed her sister. In the end we find out her older sister actually just slipped and hit her head on some rocks.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hrl2yc/need_help_finding_tv_show/"
    },
    {
        "id": "1hqzrxn",
        "author": "RhiAndroid1990",
        "title": "I’m so annoyed at the lack of old episodes uploaded for WWE Raw &amp; Smackdown",
        "content": "Me &amp; husband were watching all the old 2000 episodes on WWE Network, and now it’s moved to Netflix. Was excited. Saving 1 subscription and been a long Netflix subscriber but we wake up this morning and there are NINE episodes for 2000 &amp; 2001 and then it jumps to 2022. I’m pretty upset to be fair. ",
        "upvotes": 48,
        "comments": 98,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzrxn/im_so_annoyed_at_the_lack_of_old_episodes/"
    },
    {
        "id": "1hrmawd",
        "author": "Fabulous_Island_5621",
        "title": "En una publicación que se eliminó casi de inmediato, la cuenta de YouTube de Netflix Corea publicó “por error”, la fecha de lanzamiento de la tercera temporada de la exitosa serie El Juego del Calamar, causando emoción en los fans.",
        "content": "En una publicación que se eliminó casi de inmediato, la cuenta de YouTube de Netflix Corea publicó “por error”, la fecha de lanzamiento de la tercera temporada de la exitosa serie El Juego del Calamar, causando emoción en los fans.\n\nEl video con la sorpresiva revelación se bajó de la red solo minutos después de que algunos seguidores ya habían registrado la filtración y compartieron la noticia en sus redes sociales haciendo viral el anuncio.\nLa fecha de estreno de la tercera temporada de El Juego del Calamar 3, será, según lo filtrado por Netflix Corea el próximo 27 de junio de 2025.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrmawd/en_una_publicación_que_se_eliminó_casi_de/"
    },
    {
        "id": "1hrc05v",
        "author": "H4RDCANDYS",
        "title": "Missing you ",
        "content": "Another mediocre Harlan coben show. I had high hopes for this one but it missed the mark for me. What are y'all opinions on \"missing you.\"  I can't get into Harlan coben shows. The only decent ones are shelter, and stay close in my opinion. ",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc05v/missing_you/"
    },
    {
        "id": "1hre2s1",
        "author": "seal973",
        "title": "Suggestions for Shows to Binge during holidays/NYE break",
        "content": "Hi guys \n\nI have been scrolling around Netflix, unsure what to watch for days. I am looking for something that will get me so hooked I will stay up till 5 am watching it. Also going through a break up so I need a good healthy distraction, gotta be extra good for the escapism!! Any reccs is good but nothing toooo heavy ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hre2s1/suggestions_for_shows_to_binge_during_holidaysnye/"
    },
    {
        "id": "1hrfxc4",
        "author": "I_like_cookies_a_lot",
        "title": "Does anyone know how to access a list of movies with the ‘most liked’ tag?",
        "content": "I’ve almost always enjoyed the shows and movies with the ‘most liked’ tag on them, but can’t seem to search directly for the tag or easily find a list online.\n\nDoes anyone know a good way to find a list of them?\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrfxc4/does_anyone_know_how_to_access_a_list_of_movies/"
    },
    {
        "id": "1hrkfxp",
        "author": "uniquetiger_",
        "title": "the good doctor and obx ",
        "content": "i am not ok this is not ok I just saw dr Melendez AND JJ die in the span of a few weeks. 😭😭 2 character deaths that just ruined the show for me. IM SO PISSED OFF AHHH",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrkfxp/the_good_doctor_and_obx/"
    },
    {
        "id": "1hrjwab",
        "author": "Kwikli",
        "title": "Opening Netflix crashes my pc",
        "content": "Everytime I open the Netflix app on my pc, it just gives me a white screen, freezes my pc and then crashes it. The browser version works fine. I've tried uninstalling and reinstalling multiple times, and yesterday it helped only once and then the app started crashing again. This started out of nowhere, I have no clue what could be causing it. I've tried pretty much every trick I could find by googling, but none of them helped, and also I couldn't even find any thread anywhere with the exact same problem as me, everyone else had the crash happen differently. Has anyone else experienced this? Any idea what could help?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hrjwab/opening_netflix_crashes_my_pc/"
    },
    {
        "id": "1hrf5gk",
        "author": "mkebrewersfan",
        "title": "Thanks Netflix for making me feel old",
        "content": "\n\nWell,it happened. I just turned 30. Skimming through Netflix and there is a category that says “retro”….now when I think of Retro….i think of Herbie,Sanford and son,convoy,Star Wars,Dirty Dancing. \n\nSo,I start scrolling through them….\n\nBut,what did I see? All the shows I watched growing up…THAT’S RIGHT. Reba,Zoey 101,Fairly odd parents and when it really hit me……….Drake and Josh. \n\nTime flies so fast in this life. Thanks for reminding me of that Netflix. Always in a hurry. We don’t look at the present. I couldn’t wait to finish highschool,couldn’t wait to finish college,get married,have a career. To which I have done all of that. Even bought my dream vehicle. \n\nThanks for reading. Im off to watch Drake and Josh while I stroll down nostalgia avenue. \n\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hrf5gk/thanks_netflix_for_making_me_feel_old/"
    },
    {
        "id": "1hrmzsd",
        "author": "NihilusCF",
        "title": "Is anyone else getting this weird glitch?",
        "content": "Season 2 episode 5 of squid games, it's corrupt, I've tried different accounts, using my phone, the episode has some.kind of error ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2ldn9261siae1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hrmzsd/is_anyone_else_getting_this_weird_glitch/"
    },
    {
        "id": "1hr0yz6",
        "author": "techfinpro",
        "title": "‘Santa Clarita Diet’ Creator Victor Fresco Learned his Show was Canceled when Netflix took apart its Sets",
        "content": "",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0yz6/santa_clarita_diet_creator_victor_fresco_learned/"
    }
]