[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1ma3fls",
        "author": "StreetFriendship1200",
        "title": "Binge-worthy limited series?",
        "content": "It’s Saturday afternoon. Hubby and I were planning to host some friends for cocktails and a lovely dinner, but they just called to cancel the last minute because they are sick and don’t wanna make us ill. So we have the night to ourselves, for date night. And some amazing cocktails, appetizers and a grilled porkchop dinner ahead of us. Don’t feel like inviting anyone else, so I’m currently searching for a good Netflix movie or limited series to watch tonight. Something good, like a thriller or action pack. Any suggestions welcome! I’m running out of patience scrolling aimlessly on damn Netflix and reading reviews 🙄",
        "upvotes": 153,
        "comments": 315,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3fls/bingeworthy_limited_series/"
    },
    {
        "id": "1ma7qv2",
        "author": "kathyknitsalot",
        "title": "Untamed",
        "content": "Just finished watching this and I feel like something was off. I usually like Eric Bana and Sam Neill, and the story was interesting but I don’t know if it was the writing or acting.  It was hard to get into the characters.  Any of them. Anyone else have an opinion? ",
        "upvotes": 73,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7qv2/untamed/"
    },
    {
        "id": "1ma9zsb",
        "author": "Lilcommy",
        "title": "The new UI on the PS app is trash.",
        "content": "I personally fine this new UI completely trash. I can't find anything to watch. And I just log off and go to something else. Its cluttered and the auto playing of trailers is just a pain that takes up way to much of the screen. I don't understand always changing UIs that arnt broken or unusable. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ma9zsb/the_new_ui_on_the_ps_app_is_trash/"
    },
    {
        "id": "1ma3kaw",
        "author": "ViralGeneration21",
        "title": "Dept Q - random unanswered question?",
        "content": "I’ve just finished watching Dept Q. \n\nOne question I have is - why was Aisla Jennings (lyles mum) wearing a wig?\n\nShe seemed like she was in disguise as an older character and I was waiting for another bombshell to reveal she was someone pretending to be the mum or something!? \n\nOr I thought maybe she was just hiding her identity from Merrit but she had it on the whole time (when merrit was locked away) Including when she answered the door to local police man. \n\nAnyone have any reason for this?\n\n\n",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ma3kaw/dept_q_random_unanswered_question/"
    },
    {
        "id": "1ma7xvh",
        "author": "SubstantialBat3596",
        "title": "The Penguin Lessons",
        "content": "This movie! Has anyone watched this? (I assume many have.) It’s so charming and has all the feels! Anyone who’s watched it - what did you think? \nAnyone who hasn’t - check it out!! \n(Also, apparently I have a new book to add to my list!) ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ma7xvh/the_penguin_lessons/"
    },
    {
        "id": "1ma6bt5",
        "author": "BarracudaJazzlike730",
        "title": "Thoughts on \" Hit Makers\"?",
        "content": "Just finished the 6 episodes and I feel kinda disappointed. There wasn't really any pay off. Should have ended with the artists actually performing their songs. The other takeaway was that I believe many of the lyrics came from chat GPT. When I typed in similar themes and asked for song lyrics I got very similar results to what they had. Overall, not that great of a show IMO. Any thoughts on this? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ma6bt5/thoughts_on_hit_makers/"
    },
    {
        "id": "1ma8kk4",
        "author": "Wind-Whistle20",
        "title": "Happy Gilmore 2: Maxi league seemed cool",
        "content": "Why couldn’t both leagues exist? The golfers put on a thrilling show there showing its major potential. If I lived in that fictional world, I would want to see more of the Maxi league. Who cares if their golfers are or aren’t as good? They didn’t shut down the UFC because Floyd beat McGregor. I don’t think golf fans would stop watching golf because this league exists.",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ma8kk4/happy_gilmore_2_maxi_league_seemed_cool/"
    },
    {
        "id": "1m9a67t",
        "author": "IntelligentYinzer",
        "title": "Sex Trafficking Warrant Served at House Connected to Alleged 'TikTok Dance Cult'",
        "content": "",
        "upvotes": 272,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m9a67t/sex_trafficking_warrant_served_at_house_connected/"
    },
    {
        "id": "1m9yljz",
        "author": "JohnIsInTrouble",
        "title": "Korean Dramas Any Recommendations?",
        "content": "Hi so just recently I’ve gone on a massive binge on Korean Dramas and have mostly been enjoying myself but I’ve just finished The Frog. I’ve started to notice that Korean shows always start out great then sometimes take a massive nose dive. I’ve watched 8 show, my Name, happiness, Gyeongseong Creatures, #alive, Ballerina, kingdom and all of us are dead. Would love some more recommendations because KDramas are so different to many others I’ve watched. ",
        "upvotes": 6,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1m9yljz/korean_dramas_any_recommendations/"
    },
    {
        "id": "1ma6snx",
        "author": "cookiebutter-23",
        "title": "Thrillers",
        "content": "Looking for a movie/show that is similar to the books I like to read! Thrillers/whodunit Frieda McFadden, Alex Michaelides, Delia Owens, Lisa Jewell etc….. don’t like super scary or super smutty stuff..help! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ma6snx/thrillers/"
    },
    {
        "id": "1m9ra5j",
        "author": "LastOnesLeft92",
        "title": "Remove already seen things from your page?",
        "content": "Anyone else that things its crazy Netflix keeps showing already seen things on your page. It feels impossible to find new shows, when it is constantly suggesting things you already saw.",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ra5j/remove_already_seen_things_from_your_page/"
    },
    {
        "id": "1m9kfgo",
        "author": "S-T-R-I-D-E-R",
        "title": "\"Sandman\" was beautiful",
        "content": "Sandman series was really very appealing  and what a wonderful world building it had... So great use of vfx and amazing acting by the actors... Morpheus was goated and so was Death and all of the siblings and the lore was damn fascinating... I really don't know what went wrong with the series cause it's been cancelled by the Netflix but I really loved the series a lot and it's intricate world building and i really believe it should have gotten more seasons out of it.\nEdit: *appealing ",
        "upvotes": 40,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1m9kfgo/sandman_was_beautiful/"
    },
    {
        "id": "1ma8lly",
        "author": "CopainChevalier",
        "title": "Household Netflix account is attached to Wifi for watching on TV. Those of us hardwired in are told we aren't on the same network and can't watch.",
        "content": "Is there a decent solution to this that isn't just getting a temporary code every two weeks? \n\nLiterally in the same house and such. Just wouldn't give me any other options than getting a temp code or making a whole extra account and paying again to watch stuff on my own account.\n\nEDIT: Talked with support for awhile. They logged me out of all my accounts and asked me to log in... and then said they couldn't do anything. Guess I'm SoL.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ma8lly/household_netflix_account_is_attached_to_wifi_for/"
    },
    {
        "id": "1ma84ww",
        "author": "Few_Hunter3814",
        "title": "Where are the rest of the SEC teams?",
        "content": "Just saw the trailer for that documentary and I felt a little left out since I didn’t see my team(Mizzou). I wonder if they just chose select teams or if they had to ask to join, or mabye they just aren’t popular enough. Does anybody know?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ma84ww/where_are_the_rest_of_the_sec_teams/"
    },
    {
        "id": "1m99sv5",
        "author": "cerealmilkanddarkrum",
        "title": "Happy Gilmore 2",
        "content": "What was everyone’s thoughts ? I was actually really pleasantly surprised. Lots of good surprises in it. I think it’s the best thing Adam\nSandar has done in awhile. ",
        "upvotes": 115,
        "comments": 190,
        "media": null,
        "permalink": "/r/netflix/comments/1m99sv5/happy_gilmore_2/"
    },
    {
        "id": "1m9olff",
        "author": "FoodNapTV",
        "title": "Hit Play on Hightown !!!",
        "content": "Hightown is finally on Netflix!!!! \n\nThis show is criminally underrated. \n\nI’m begging you, try it. You won’t be disappointed. \n\nMaybeeeee Netflix will pick it up for a 4th season ??? 😍",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9olff/hit_play_on_hightown/"
    },
    {
        "id": "1ma4hzr",
        "author": "distorted808s",
        "title": "Netflix not loading",
        "content": "My netflix isn't letting me sign in, and no it's not because of my internet. Is anyone else experiencing this problem and is there any way I can fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ma4hzr/netflix_not_loading/"
    },
    {
        "id": "1ma4dpu",
        "author": "AbsolutelyFab3824",
        "title": "Building the band",
        "content": "Just about to watch the final episode but have to say I'm really happy with the teams chosen to be in the finals. \nI think it will just come down to the best performance of the night and I won't be disappointed on the outcome. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ma4dpu/building_the_band/"
    },
    {
        "id": "1m9f2j3",
        "author": "Burgundy-Bag",
        "title": "I just watched One Day...",
        "content": "... and fuck me. I was not ready for it. I thought I was treating myself to a cosy Friday night in with a romcom. They should have put trigger warning for emotional devastation. \n\nIt was so beautiful. These two actors had  mad chemistry. I feel devastated both by the story, and by the fact that I won't have more episodes to watch. It's among the top TV shows I've ever watched.",
        "upvotes": 39,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m9f2j3/i_just_watched_one_day/"
    },
    {
        "id": "1m9ilcv",
        "author": "VanillaBoth5026",
        "title": "Give me some shows to watch!",
        "content": "Give me some good shows to watch on Netflix I’m down for any genre it doesn’t matter just give me some of your favorites bc I’m bored af rn. It can also be a movie but I wanna find a show that I can binge watch on Netflix to start off my weekend. So what should I watch that is good??",
        "upvotes": 21,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ilcv/give_me_some_shows_to_watch/"
    },
    {
        "id": "1m91odt",
        "author": "IceMustFlow",
        "title": "Sneaky Resubscribe",
        "content": "We cancelled Netflix, as we tend to rotate streaming services every few months. This morning, when we were supposed to be finished, my young daughter tried bringing it up and was prompted if she wanted to re-subscribe. She clicked yes, not even understanding what that meant and boom, resubscribed and charged for an extra month, no sign-in required. WHAT? Absolutely not OK that this is even possible. She was signed into the Kids profile only, we just checked. Has this happened to anyone else?\n\nEdit: confirmed with Netflix support. TBF, they were helpful and have refunded the month and signed us out of all devices. However, they confirmed that the resubscription came from the TV and admitted that it is possible to do this without a password or PIN if the device is still signed in after you unsubscribe. Hmmm...",
        "upvotes": 163,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1m91odt/sneaky_resubscribe/"
    },
    {
        "id": "1m9jkmg",
        "author": "refdeser",
        "title": "Angi : Fake life, True crime",
        "content": "Just finished watching the series, but I’m left with so many unanswered questions.\nAt the end of the second episode, one of Juan’s friends (the woman in the pink vest) asked the interviewer if they could share their theories on why the police closed Juan’s case so quickly, even though so many things didn’t add up during the investigation.\nThat scene was just left hanging, and it really made me wonder, was there more to the story that couldn’t be revealed because it involved higher authorities?\nDefinitely something that leaves you pondering.",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m9jkmg/angi_fake_life_true_crime/"
    },
    {
        "id": "1m9nshd",
        "author": "Historical-Bee710",
        "title": "Train Dreams | Official Teaser | Netflix",
        "content": "From the creators of Sing Sing, starring Joel Edgerton and Felicity Jones, written and directed by Clint Bentley. \n\nOfficial synopsis:\n\nBased on Denis Johnson's beloved novella, Train Dreams is the moving portrait of Robert Grainier, a logger and railroad worker who leads a life of unexpected depth and beauty in the rapidly-changing America of the early 20th Century.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9nshd/train_dreams_official_teaser_netflix/"
    },
    {
        "id": "1ma8slu",
        "author": "JournalistMore2356",
        "title": "Disappointed in Happy Gilmore 2",
        "content": "Did anyone enjoy the new Adam Sandler Movie!? I was really looking forward to this sequel, I wasn’t expecting much, just some light hearted fun like the original, but I felt this movie was too busy with too many cameos and not enough good writing, just a bunch of rehashed skits..  A missed opportunity IMHO",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ma8slu/disappointed_in_happy_gilmore_2/"
    },
    {
        "id": "1m8wbo6",
        "author": "PiscesInChaos",
        "title": "I hate the new redesigned layout",
        "content": "The recent redesign of the app/interface is a major step backwards in usability, clarity, and overall user experience.\n\nThe layout is now cluttered and confusing, with good features buried under unnecessary animations and tabs. The new “My Netflix” section feels like an unhelpful dumping ground with zero intuitive structure. Browsing has become frustrating—everything is larger, slower, and less responsive. It now takes twice as many clicks to get to the content I actually want to watch.\n\nWorse, the previews autoplay more aggressively, recommendations feel even more random, and the horizontal scrolling is exhausting and inconsistent across devices. The redesign feels like it was built to impress a demo room, not serve actual users who just want quick, functional access to their content.\n\nNetflix used to be seamless. Now it feels bloated, distracting, and deeply out of touch with what made the platform great in the first place. At least should have give users an option to revert to the classic layout.",
        "upvotes": 119,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1m8wbo6/i_hate_the_new_redesigned_layout/"
    },
    {
        "id": "1m9ntz6",
        "author": "Glittering-Bison-547",
        "title": "the flash left Netflix without a warning?(Netherlands)",
        "content": "i don't see it on the official page for what leaves Netflix every month so i am curious. will it come back? i was just in the process of rewatching the show and i paused for like an hour to game with friends and when i came back it was just gone. i can find the page by googling 'the flash Netflix' but then it just says 'remind me' and i cant watch it. do we know if its coming back? pretty sure i haven't seen the latest episodes and i really would like to continue watching. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m9ntz6/the_flash_left_netflix_without_a/"
    },
    {
        "id": "1m9nmnf",
        "author": "Historical-Bee710",
        "title": "Hey guys",
        "content": "Any other dystopian survival shows like Squid Game on Netflix? I've heard people talk about how AIB characterisation isn't quite up to SG's level, and Mom tells me stuff like Money Heist is too complicated. Help! ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m9nmnf/hey_guys/"
    },
    {
        "id": "1m9hcxn",
        "author": "Fragrant_Peanut_9661",
        "title": "Until Dawn",
        "content": "Ok now this was a good one. What a refreshing new twist! Hooked me right in from the start. Pretty gory, but a seriously good storyline. I really really enjoyed it. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m9hcxn/until_dawn/"
    },
    {
        "id": "1m9no5k",
        "author": "Historical-Bee710",
        "title": "Jun-hee Appreciation Rant Once And For All (because r/squidgame won't let me post)",
        "content": "You guys keep saying she should've hopped across the bridge or hung into the sides or something, but fr SHE JUST GAVE BIRTH YESTERDAY! You do not wanna imagine -the fact she was able to walk at all in the last minutes of the maze game was amazing, and it took a huge toll on her strength even without her fractured ankle. She was already fading fast by the time Jump Rope began, and if she could've done it, don't you think she'd have started trying to join the others on the bridge instead of dropping herself off? She knew her limits -she already tried practicing tiny hops on the starting platform before Myung-gi approached her, and her ankle gave out on the second shuffle. (Also, if you think it's that easy, y'all try holding onto the side of that bridge when you're already weak as hell from labour just twenty-four hours ago and a drop over 300 feet below you. Trust me: it isn't. Duh.)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m9no5k/junhee_appreciation_rant_once_and_for_all_because/"
    },
    {
        "id": "1m9ni0f",
        "author": "Lordburke81",
        "title": "Happy Gilmore 2 - are the cuts/transitions supposed to be this jarring?",
        "content": "",
        "upvotes": 0,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qgbzxvmfa6ff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m9ni0f/happy_gilmore_2_are_the_cutstransitions_supposed/"
    }
]