[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1petx4m",
        "author": "TheMirrorUS",
        "title": "BREAKING: Netflix acquires Warner Bros in $83 billion deal after tense bidding war",
        "content": "",
        "upvotes": 754,
        "comments": 210,
        "media": null,
        "permalink": "/r/netflix/comments/1petx4m/breaking_netflix_acquires_warner_bros_in_83/"
    },
    {
        "id": "1pexbm3",
        "author": "businessinsider",
        "title": "Netflix investors don't seem to like its blockbuster deal with Warner Bros. Discovery",
        "content": "",
        "upvotes": 54,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pexbm3/netflix_investors_dont_seem_to_like_its/"
    },
    {
        "id": "1pfanad",
        "author": "HehroMaraFara",
        "title": "What was everyone’s dumbest thing from S5 of Stranger Things so far?",
        "content": "So much to choose from, but for me it was to be the end of episode 4 when the Demogorgons get to the base. \n\nThe soldiers….standing in literal circle around one of them all firing at….each other essentially. Whoever directed and edited that has to of been operating in a coma. All of them would have killed each other. ",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pfanad/what_was_everyones_dumbest_thing_from_s5_of/"
    },
    {
        "id": "1pfcw7i",
        "author": "Clickwasasadmovie",
        "title": "Missing: Dead or Alive (the horrid trash we deserve…?)",
        "content": "What the fuck is this show?! How is it rated #7 today?! I feel like I’m taking crazy pills!!!\n\nAnd no one is reviewing it or talking about it on YouTube, so I have to assume the #7 rating can’t actually be real, right? Netflix has to be rating it high in hopes that more people will watch it, RIGHT?! \n\nWhy though? I figure that Netflix is pumping it out with an in-house team (it doesn’t show any info about producer, director, etc. under the “Credits” section on the show’s main page “…that’s suspicious, that’s weird”), so I’m sure 95% of the profit they see from the show goes directly back into itself. \n\nIt feels like AI and Dhar Mann had a satan baby, I hate it. I hate it so much.\n\nIf you sincerely enjoy it, I’m sincerely worried about you and you should question every decision you’ve made in your life thus far. And please don’t have children, because I fear they too will become morons and inevitably mess up my 3 item order at the drive-thru. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pfcw7i/missing_dead_or_alive_the_horrid_trash_we_deserve/"
    },
    {
        "id": "1pel907",
        "author": "somacula",
        "title": "Netflix Wins the Warner Bros. Discovery Bidding War, Enters Exclusive Deal Talks - The streaming giant hit the magic $30-a-share target and has an exclusive window to negotiate a final deal.",
        "content": "That's a wrap.",
        "upvotes": 139,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1pel907/netflix_wins_the_warner_bros_discovery_bidding/"
    },
    {
        "id": "1pem9ht",
        "author": "Obvious_Shoe7302",
        "title": "Netflix Wins Bidding War For Warner Bros. Discovery, Starts Exclusive Deal Talks",
        "content": "",
        "upvotes": 56,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pem9ht/netflix_wins_bidding_war_for_warner_bros/"
    },
    {
        "id": "1pfcvog",
        "author": "SnooDucks3859",
        "title": "Diddy documentary: Petition to give Kirk Burrowes a Wikipedia page",
        "content": "Just finished it and the ending wrecked me. Kirk’s struggle with homelessness and addiction, and then wanting to learn more and realizing he doesn’t even have a Wikipedia page… it feels like he’s been erased.\n\nI know anyone can make one, but it’s definitely not my skill set. So I’m wishing this out into the world in case someone who does know how wants to take it on.\n\nhttps://en.wikipedia.org/wiki/Bad_Boy_Records\n\n His story deserves to be findable.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pfcvog/diddy_documentary_petition_to_give_kirk_burrowes/"
    },
    {
        "id": "1pemlo8",
        "author": "Easy_Pen5356",
        "title": "Thoughts on Unbreakable Kimmy Schmidt?",
        "content": "I’m new to Netflix. I’m looking for a good show to watch! I’m looking for something lighthearted to watch while I pack since I’m moving and got recommended this show by my sister, but I’ve heard mixed reviews while I’ve been briefly looking..\n\nSo just wanted some firsthand opinions without spoilers! I just tried to watch Schitt’s Creek and found it too slow even though I heard it gets better. I’m gonna come back to it.\n\n(I’ve liked shows like the office and superstore in the past I tend to watch more lighthearted, shows where you don’t have to follow the plot with every detail)",
        "upvotes": 39,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pemlo8/thoughts_on_unbreakable_kimmy_schmidt/"
    },
    {
        "id": "1peruai",
        "author": "Purple_Pay_1274",
        "title": "Is anyone else watching  Victoria? I find one thing super distracting?",
        "content": "Generally enjoying the show Victoria, but there is one thing that takes me out of the show every time I notice it. The (gorgeous and talented) actress who plays the queen is wearing the most god awful blue contacts. Everytime she is in the light she literally looks like a twilight vampire with these huge cheap looking contacts sitting unnaturally over her eyes.\n\nOf course I understand that the real queen had large blue eyes, but I hate the way these contacts look and it’s all I can look at in any scene where she’s in the light. No one else on the show has such strange contacts in… \n\nIt honestly looks like she is wearing gag gift/Halloween costume contact lenses sometimes! Has anyone else noticed this? I am only on season one, so do they get better over time? Or is this something I should just do better ignoring? It seems strange to me that a show that went to such lengths to have amazing costumes, sets, and historical accuracy would allow such a wildly weird element and expect people not to notice. ",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1peruai/is_anyone_else_watching_victoria_i_find_one_thing/"
    },
    {
        "id": "1pf2adk",
        "author": "janeofalltradez1",
        "title": "Annoyed please help!",
        "content": "Is there any way to get the shows/movies to stop immediately starting? The new layout is driving me nuts when I wanna see similar suggestions or taking a movie off my list. I feel like im old and they've changed the grocery store around. Is there anyway to get it to bring the menu up again when clicking a show/movie? Or am I stuck w it starting right away and having to try and navigate the icons at the bottom. Thank you! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pf2adk/annoyed_please_help/"
    },
    {
        "id": "1pfao5k",
        "author": "Fit_Stomach_6483",
        "title": "Zerocalcare deserves more attention from people outside Italy!",
        "content": "Zerocalcare is an Italian illustrator who has made two animated shows on Netflix \"Tear along the dotted line\" and \"This world can't tear me down\" but since he's Italian himself and speaks italian with a specific accent called \"roman\" accent, it might be difficult to understand him. It's mostly aimed towards Italian speaking people. But people outside Italy should definitely give zerocalcare a try and watch his shows and maybe even read his graphic novels. I really just think that people are Missing out on something peak. He's already pretty well known in Spanish talking countries, like south America and Spain.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pfao5k/zerocalcare_deserves_more_attention_from_people/"
    },
    {
        "id": "1pf9v83",
        "author": "Due_Let_8691",
        "title": "Dinner time live with David Chang waitress Mandy",
        "content": "What is the waitress full name on dinner time live with David Chang? I found out her first name is Mandy but when I try to look her up it just shows Mandy more ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pf9v83/dinner_time_live_with_david_chang_waitress_mandy/"
    },
    {
        "id": "1pf1oqq",
        "author": "Prestigious-Suit746",
        "title": "Cannot get rid of menu overlay",
        "content": "Not sure if I'm phrasing it correctly but for 1 certain show it won't remove the overlay.\nIf I go back to the menu it forgets my progress in the show. \n\nI've tried other shows and they don't have this issue. \n\nI can't press pause, only button that works is the back button or home button. \nIt seems like it is not registering that I'm watching something as it constantly jumps to the \"sleep menu that you usually get from being idle in netflix main menu\"\n\n\nAnyone know how to fix this?\nI tried reopening netflix but it didn't help",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1oqq/cannot_get_rid_of_menu_overlay/"
    },
    {
        "id": "1pf5p6e",
        "author": "willemavjc",
        "title": "Airing over months: Yes or No?",
        "content": "Receiving those notifications:\n\n— \n\nNew Episode [Your show] is waiting for you. This episode is all new. Take a break and watch now. \n\n—\n\n…make me actually react like this:\n\n*No, you [censored] bunch of directors. You chose to air the show you made over months. I’m fed up waiting for the next episodes to come, and I’ve started to lose how it all started anyway now.*\n\nGenuinely curious to know if this is pissing other people too. The Netflix I first subscribed to had not this business model, which I hate so much.\n\nI would have made a poll but this is forbidden, here. So, are some of you getting fed up with how Netflix is heading?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pf5p6e/airing_over_months_yes_or_no/"
    },
    {
        "id": "1pf4ajq",
        "author": "TheoryBrief9375",
        "title": "How to find out what's coming to UK netflix?",
        "content": "Brit here, when I try searching online for this, all I get is us information, which can differ from the content of the UK version quite a bit \n\nI often want to look a month ahead to see what's going to be released",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pf4ajq/how_to_find_out_whats_coming_to_uk_netflix/"
    },
    {
        "id": "1pexzp1",
        "author": "DesperateAuthor3493",
        "title": "Netflix not loading on windows app and chrome",
        "content": "its in white screen and is stuck loading. Netlix doesnt work on chrome, edge and the software on PC. I have turned off every extension, neflix only works on firefox fine elsewhere its just a white screen and not loading   \nBtw i just got netflix like a few minutes ago even restarted my pc ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pexzp1/netflix_not_loading_on_windows_app_and_chrome/"
    },
    {
        "id": "1pecmsn",
        "author": "LollipopChainsawZz",
        "title": "Netflix is leading bidder for Warner Bros. Discovery: Sources",
        "content": "",
        "upvotes": 52,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pecmsn/netflix_is_leading_bidder_for_warner_bros/"
    },
    {
        "id": "1pf3bmi",
        "author": "KevinsThrone",
        "title": "Squid game idea",
        "content": "In the Dalgona game in squid game they should have made the star a square and the umbrella the shape of the frontman’s mask who agrees you should like",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pf3bmi/squid_game_idea/"
    },
    {
        "id": "1perykl",
        "author": "Zestyclose-Piece-662",
        "title": "Sudden quality drop on Netflix app while watching something - Fixed",
        "content": "I had this issue yesterday, so thought I would share what the fix is. \n\nWas watching a movie yesterday and suddenly the quality dropped, not terribly, but noticeably. I was on wifi with 300+mbps, so not a streaming issue. Had the same issue watching the same movie today. \n\nTurns out the app had for some reason downloaded the movie, whether it was a misclick or what, the app downloaded a poorer quality of the movie and was playing that for me. Just uninstalled the movie and the quality resumed. \n\nJust posting this for anyone who searches a similar problem in future. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1perykl/sudden_quality_drop_on_netflix_app_while_watching/"
    },
    {
        "id": "1pezlel",
        "author": "Sufficient-Curve2951",
        "title": "The new Holiday-themed series Ripple",
        "content": "Ripple got a Netflix first release order but is it only for some regions? Will people outside the US have to wait again? Have read some reviews and the show looks like a perfect Holiday season watch from the trailer\n\n\n\n[https://www.soapcentral.com/shows/ripple-should-watch-skip-new-ian-harding-drama-netflix-a-viewer-s-guide](https://www.soapcentral.com/shows/ripple-should-watch-skip-new-ian-harding-drama-netflix-a-viewer-s-guide)\n\n[https://www.tvinsider.com/1231542/ripple-netflix-show-ian-harding-interview/](https://www.tvinsider.com/1231542/ripple-netflix-show-ian-harding-interview/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pezlel/the_new_holidaythemed_series_ripple/"
    },
    {
        "id": "1peyeqq",
        "author": "DeadlyKindHero",
        "title": "So the FRIENDS and other WB shows are leaving the platform? Is this a plan for acquiring WB?",
        "content": "Is this a long term plan of Netflix? I read that it will take 12-18 month to finalise the deal and all. Will I have to wait for this much time? Prime video does have it but it sucks",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1peyeqq/so_the_friends_and_other_wb_shows_are_leaving_the/"
    },
    {
        "id": "1pe6pfe",
        "author": "StunningComment6064",
        "title": "Which movie (on netflix) is the saddest one you ever watch?",
        "content": "Hey guys,\ncould you recommend a Netflix movie that made you cry? Or a movie that left you with strong (sad) emotions after watching it? I’m currently in the mood for something like that.\nThank you!\n",
        "upvotes": 46,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1pe6pfe/which_movie_on_netflix_is_the_saddest_one_you/"
    },
    {
        "id": "1pel9li",
        "author": "harpreetthind",
        "title": "Movie recommendations on Netflix",
        "content": "Just got done watching midnight mass what else does everybody recommend looking for some great shows that that are in this category but open to all suggestions thanks guys",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pel9li/movie_recommendations_on_netflix/"
    },
    {
        "id": "1pdnga8",
        "author": "GuineaPKilledMe",
        "title": "Sean Combs: The Reckoning - The jurors that agreed to sit down for documentary are disgusting.",
        "content": "If every juror in Diddy's case truly felt the same way as those two they interviewed for the doc, no wonder Diddy only got away with 50 months.\n\nBoth of them seemed extremely biased. The male juror basically put all the blame on Cassie and showed absolutely no sympathy for her. He immediately gave me the creeps. Seems like he really didn't value women at all.\n\nThe woman was even worse. She couldn't even hide her delusional love for Diddy. You can tell she was jumping with joy every time how she explained how Diddy would make eye contact with the jurors. She's so delusional I wouldn't doubt if she thought he was making eye contact with only her.\n\nThose two were absolutely vile in their reasoning for only counting him with two charges.\n\nEdit: Sorry about the grammar error in the title. It was suppose to say \\*The documentary",
        "upvotes": 702,
        "comments": 204,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnga8/sean_combs_the_reckoning_the_jurors_that_agreed/"
    },
    {
        "id": "1pey3cz",
        "author": "Puzzled-Perception88",
        "title": "Netflix canada",
        "content": "Why does Netflix consistently remove movies &amp; shows, just to bring them back months or a year later?\n\nNetflix has a tendency to bring us a new show, &amp; remove it the same year.. but bring it back the next year. Why?\n\nExample: “Mad Men” was on back in 2019, they moved it a year or two later moving it to i believe crave. Back in 2024 they brought it back, just to remove it again in august. This is not the only example i could offer, &amp; its genuinely a bother, making me less interested in keeping netflix for their lack of consistency. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pey3cz/netflix_canada/"
    },
    {
        "id": "1pe4fit",
        "author": "GEMHidden",
        "title": "Director recognition for Sean Combs: The Reckoning",
        "content": "Alexandria Stapleton use of arrest photos, live footage, and decades of escalating violence paints the picture of a monster built by silence and complicity. The reckoning isn’t just for Diddy but for everyone who enabled him! \n\nI’m sure 50 cent offered her a pretty penny for the series, as Diddy likely passed on it either because he believed he would receive a not guilty verdict or did not have the funds to pay for the footage. What do you all think? \n",
        "upvotes": 31,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pe4fit/director_recognition_for_sean_combs_the_reckoning/"
    },
    {
        "id": "1peqjsj",
        "author": "Subhash_Boi",
        "title": "So I was watching HDR and Dolby vision right with premium plan that includes it all ?",
        "content": "My phone poco x7 pro supports everything and even in playback certification it's showing the capabilities but I'm not noticing anything big , it's normal 1080p content. Am I Missing something?? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1peqjsj/so_i_was_watching_hdr_and_dolby_vision_right_with/"
    },
    {
        "id": "1pe7279",
        "author": "hevy_smoker",
        "title": "The UK top 10",
        "content": "Just looking at the top ten films in the UK and it seems no-one in the country has any desire to watch anything that isn't total and utter garbage. Same with the top ten series, utter utter garbage.",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pe7279/the_uk_top_10/"
    }
]