[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iz1co8",
        "author": "anonRedd",
        "title": "What We Watched the Second Half of 2024",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz1co8/what_we_watched_the_second_half_of_2024/"
    },
    {
        "id": "1iyt6v9",
        "author": "Flat-Creek93",
        "title": "The Woman in the House Across the Street from the Girl in the Window",
        "content": "I’m going preface this by saying I’m a complete moron. I had no clue this was satire until like the last or second to last episode. In my defense, I knew nothing about this show when I clicked on it and was slightly preoccupied when I watched it. But OMG looking back on it, there’s so much dumb stuff I missed that’s absolutely hilarious. I might have to watch it again.",
        "upvotes": 316,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1iyt6v9/the_woman_in_the_house_across_the_street_from_the/"
    },
    {
        "id": "1iz3un2",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Zero Day is so poor",
        "content": "Just finished Zero Day and it was excruciating. Apart from the terrible plot and hammy dialogue most of the actors looked like they were phoning it in apart from Jesse Plemons. Netflix has been in decline for years now and while it still produces a good show now and again the overall output has been horrendous. I know De Niro has a lot of alimony to pay but it's sad to see him in sub par tv shows like this.",
        "upvotes": 66,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1iz3un2/zero_day_is_so_poor/"
    },
    {
        "id": "1iza29u",
        "author": "MrHaZeYo",
        "title": "I wish streaming services had options to make your own like TV station.",
        "content": "This applies to all of the big ones (hulu, Disney, Netflix, max, etc)\n\nSo what I mean is:\n\nSay I want to pick 10 TV shows and put them in a queue of sorts. The service plays 1-3 episodes of show A, then auto changes to show B, then C, etc. \n\nIt'd be cool to be able to also have an app that has all of the services your paying for all in one. The services still get your money, and you get everything from one app.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iza29u/i_wish_streaming_services_had_options_to_make/"
    },
    {
        "id": "1iynxln",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix CEO Ted Sarandos Explains Why Traditional Sitcoms Like 'The Big Bang Theory' Are Still Big Business",
        "content": "",
        "upvotes": 70,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1iynxln/netflix_ceo_ted_sarandos_explains_why_traditional/"
    },
    {
        "id": "1izahbk",
        "author": "Ill_Bookkeeper_2048",
        "title": "Sign the Petition",
        "content": "If you haven’t already, everyone should check out the show inside job on Netflix. It’s and adult animated show that needs a third part. I won’t include spoilers but please consider watching and signing this petition for a third part",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1izahbk/sign_the_petition/"
    },
    {
        "id": "1iyoes0",
        "author": "nycsbestkeptsecret",
        "title": "This season is bad ? (The Night Agent )",
        "content": "I really just couldn’t get behind this season. This romance between Peter and Rose just doesn’t give me life. She also doesn’t have any sex appeal as well (as does Peter), the storyline between the US and Middle East is a bit redundant. \n\nNoors character got on my nerves (&amp; and man her brother same ) .\n\nI’m sorry for all the negativity, but I just couldn’t stand it. \n\nDoes anyone else feel this way ?! ",
        "upvotes": 32,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1iyoes0/this_season_is_bad_the_night_agent/"
    },
    {
        "id": "1iz4oxq",
        "author": "Ambitious-Parking-33",
        "title": "Netflix speed watch option",
        "content": "Does anyone here watch Netflix shows or movies at 1.25x or 1.5x speed? I know I do it on social media, but it feels different when it comes to streaming. Also, has anyone ever watched at 0.5x or 0.75x speed? If so, why?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz4oxq/netflix_speed_watch_option/"
    },
    {
        "id": "1iyrd7j",
        "author": "MysteriousDelay6266",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrd7j/havoc_official_teaser_netflix/"
    },
    {
        "id": "1izaj4f",
        "author": "MrDannn",
        "title": "What is with the Alpha Males (Macho Alphas) rip-off?",
        "content": "I saw one (Shafted) from France that got the same premise but at least some slight deviation from the originals. The Rooster that just show up is just so shameless in copying the premise/characters 100%. Did the producers of Macho Alphas sell the rights to adaptation to other studios? Do we have another \"Perfect stranger\" situation on our hand?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1izaj4f/what_is_with_the_alpha_males_macho_alphas_ripoff/"
    },
    {
        "id": "1iz9ib2",
        "author": "ImTheDudeMAN33",
        "title": "I experienced a glitch when I was trying to watch the uncut stream of NXT but as seen in video ,subtitles cut out . Have u guys experienced this before?",
        "content": "Sorry my shoddy came work guys !",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/v4p3icgflmle1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iz9ib2/i_experienced_a_glitch_when_i_was_trying_to_watch/"
    },
    {
        "id": "1iyn6tg",
        "author": "Robemilak",
        "title": "'Zero Day' Ranks as Second Most Watched Netflix TV Shows This Week (Worldwide)",
        "content": "",
        "upvotes": 20,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iyn6tg/zero_day_ranks_as_second_most_watched_netflix_tv/"
    },
    {
        "id": "1iypg9a",
        "author": "Internal-Bed-3150",
        "title": "Netflix begins adapting the best season of Avatar: The Last Airbender to live-action",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iypg9a/netflix_begins_adapting_the_best_season_of_avatar/"
    },
    {
        "id": "1iz6qw7",
        "author": "Matthewp7819",
        "title": "How would Walter White and Jesse Pinkman fare if they did business in Baltimore and became business partners with The Greek, Proposition Joe or Marlo Stanfield?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz6qw7/how_would_walter_white_and_jesse_pinkman_fare_if/"
    },
    {
        "id": "1iz4ucg",
        "author": "aceofhearts__",
        "title": "Confused about Remind Me on removed Originals, specifically Dreamworks Netflix Originals.",
        "content": "So I’ll preface this with the fact that my dog and I LOVED watching the Dreamworks Netflix originals, specifically The Mr Peabody and Sherman Show and Home: Adventures with Tip and Oh. We’d watch them to fall asleep and I’d put it on for her while I did my studying, and she would legitimately watch it, which I always found funny. She’d get excited when I turned it on and would snuggle me and watch the show. So, occasionally, I check and see where to watch it in hopes that they’ll get added to a service that we already pay for. \n\nImagine my shock today when I looked up the Mr Peabody and Sherman Show and there was an official Netflix page that lead me to the app where I could push the remind me button. I was ecstatic! My girl and I could watch our silly cartoons again! Until I looked closer and found zero other information on these shows coming back online. \n\nDoes this mean that the show is coming back or have I been bamboozled? It also shows up for Home: Adventures with Tip and Oh and Turbo Fast, but again, I have found no other information. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iz4ucg/confused_about_remind_me_on_removed_originals/"
    },
    {
        "id": "1iyr6sh",
        "author": "mad_max_mb",
        "title": "What’s the Best Show or Movie You’ve Watched on Netflix?",
        "content": "With so many options on Netflix, it’s hard to pick what to watch next. From intense thrillers to heartwarming dramas, the platform has something for everyone.\n\nFor me, \"Money Heist\" was an absolute game-changer—the tension, the characters, and that iconic Bella Ciao just made it unforgettable!\n\nWhat’s your top Netflix recommendation? A hidden gem, a must-watch series, or a recent favorite? Let’s share our best picks!",
        "upvotes": 6,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1iyr6sh/whats_the_best_show_or_movie_youve_watched_on/"
    },
    {
        "id": "1iyzmes",
        "author": "TheLakeGuardian",
        "title": "Kaiju movies in Netflix",
        "content": "Are there any kaiju movies on Netflix? (Excluding any Godzilla film and Love and Monsters, as I've already watched those). Shows such as Gamera Rebirth don't count because I want a film to watch. Kaiju movies are my favourite genre, so I'm looking forwards to seeing if there's any. Thanks in advance! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyzmes/kaiju_movies_in_netflix/"
    },
    {
        "id": "1iypadu",
        "author": "Somethingman_121224",
        "title": "Hayden Schlossberg Reveals His Top Five Fighters in 'Cobra Kai'",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iypadu/hayden_schlossberg_reveals_his_top_five_fighters/"
    },
    {
        "id": "1iyxfds",
        "author": "sorrybroorbyrros",
        "title": "Is it weird that the series I'm watching changes seasons/episodes while I'm away?",
        "content": "I'm watching Dark. I'm in season 3.\n\nWhen I go to watch again, it's back in the middle of season 2. It's happened 3 times now and returns to different points.\n\nDoes that mean someone else is accessing my account?\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyxfds/is_it_weird_that_the_series_im_watching_changes/"
    },
    {
        "id": "1iza47r",
        "author": "Vegetable_Rich_",
        "title": "Petition To Bring All The WWE Raw Episodes On Netflix",
        "content": "It sucks that Netflix barely has any old Raw episodes. I can't be the only one who is pissed on them for taking away some of the most memorable moments in wrestling from the fans. They need to add all the episodes ASAP, it's been two months since the WWE and Netflix deal.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1iza47r/petition_to_bring_all_the_wwe_raw_episodes_on/"
    },
    {
        "id": "1iyst2b",
        "author": "LingLings",
        "title": "Does anyone know why the episode count for S1 of The Fall (2016) is different from Wikipedia page.",
        "content": "Wikipedia shows 17 episodes in total over three seasons (5,6 and 6) but ..\n\n..on Netflix the first season has only 3 episodes , not 5.  The remaining seasons have 6 each so match Wikipedia.\n\nI’m based in Spain if that might make a difference.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyst2b/does_anyone_know_why_the_episode_count_for_s1_of/"
    },
    {
        "id": "1iy5f5d",
        "author": "AwkwardUrkel",
        "title": "Disrupt The Market",
        "content": "I cancelled my Netflix today. \n\nI've been around since the DVD in the mail phase. I'm so tired of the incremental increase of subscriptions. At what point will enough of us hit cancel so they understand! ",
        "upvotes": 86,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1iy5f5d/disrupt_the_market/"
    },
    {
        "id": "1iyx3yg",
        "author": "albert_er",
        "title": "Issue with movie search",
        "content": "Has anyone else noticed issues with the title search?  \nWhen I search for a title in the Search (on PC, Firefox), select a title to look on the details and then close the details popover, the other titles can not be selected anymore.  \nThe only Option I have is to relaod the Page.\n\nI could not find a place to report this bug, so I am posting it here, so maybe a Neflix employee sees it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyx3yg/issue_with_movie_search/"
    },
    {
        "id": "1iywptw",
        "author": "katiekat1342",
        "title": "How do I \"re-merge\" an extra member back into a main account?",
        "content": "My parents have Netflix and I bought an extra member slot on their account when I moved out so I could continue using my profile from a different location. \n\nI've since moved back home and wanted to know if there was a way to \"re-merge\" my extra slot into my parents main account, so I don't have to log them out and log myself in each time I want to watch something. Is my only option to create a new profile and lose my recommendations and shows I'm currently watching?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iywptw/how_do_i_remerge_an_extra_member_back_into_a_main/"
    },
    {
        "id": "1iyv4fr",
        "author": "NoahDSanders",
        "title": "Auto profile creation glitch??",
        "content": "I was playing on my PlayStation 3 on a HDMI 3 and my PS5 was online and on HDMI 1. I believe I dropped my controller on the ground sometime when on my ps3. When I switched back to HDMI1 for the PS5 it was on my girlfriends Netflix account however I noticed it logged me into a brand new profile with a bunch of random letters and numbers for a name and what’s even weirder is I cannot delete the profile. Ironically it chose Lucifer as the main profile. Has this ever happened to anyone else? If so what might have caused this ?? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyv4fr/auto_profile_creation_glitch/"
    },
    {
        "id": "1iyu7te",
        "author": "IllustriousEgg609",
        "title": "Just one more time",
        "content": "SPOILER\n\n\n\n\nSo i had the feeling since she first met the guy(she later marries, forgot name) i always had a bad feeling with him and was praying that she gets back together with atlas :(\n\nGood to know i have a sense for red flags.\n\n\nDid you feel this too?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyu7te/just_one_more_time/"
    },
    {
        "id": "1iyjjrn",
        "author": "RealityShrine",
        "title": "Too Hot To Handle star Holly Scarfone claims Scott Disick 'pressured' her to get surgery",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyjjrn/too_hot_to_handle_star_holly_scarfone_claims/"
    },
    {
        "id": "1iz4wcu",
        "author": "smellyfingernail",
        "title": "Has Netflix always censored references to streaming services in subtitles?",
        "content": "Noticing in the subtitles for the menu, the lady mentions pitching to three separate streaming services on Monday, while the subtitles only say pitching on Monday. What a weirdly specific thing to omit.",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zdrc8ysbblle1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iz4wcu/has_netflix_always_censored_references_to/"
    },
    {
        "id": "1iy8ogp",
        "author": "MotherofBook",
        "title": "These Category titles are hilarious. Have y’all seen these?",
        "content": "Idk why this is so funny to me but ***‘Rich People Behaving Badly’*** As A category title, on Netflix, has taken me all the way out. \n\nThat’s very much how I name my categories. 🤣😂🤣🤣🤣",
        "upvotes": 26,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iy8ogp/these_category_titles_are_hilarious_have_yall/"
    },
    {
        "id": "1iyrt5u",
        "author": "anxietyrainbows",
        "title": "I need of some help",
        "content": "Hey, i wanna add some shows to my library that i saw on my brothers  acoount but they dont exist on mine?  For 15 bucks a month i should be able to view my whole countries library. We literally live in the same house so its weird i can't view the same shows ? We both have the 18 plus option, so its not due to age restrictions on the profile\n\nEdit for more clarification:\nI pay for netflix its my account and my brothers account is just another profile made on that. \nHis profile is the only one different and shows many titles my profile and the general profile dont have.   Its been like this since 2018 and we cycled through different accounts. He didn't have any specicial settings or anything ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrt5u/i_need_of_some_help/"
    },
    {
        "id": "1iyrsgk",
        "author": "Fit_Bee367",
        "title": "Need some good TV show recs",
        "content": "Hey, might sound kinda weird, but I’m looking for American or British shows with good-looking characters \" especially the male lead\" i don't want smth classic, Don’t really care about the genre, just need a solid story that won’t put me to sleep.\n\nWatched *The Gentlemen 2024*—loved it. Also saw *The Hating Game*. So yeah, my taste is all over the place \n\n**Please don't suggest any shows with a lot of sexual content**",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrsgk/need_some_good_tv_show_recs/"
    }
]