[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 682,
        "comments": 5045,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nqmh74",
        "author": "Glass_Pomegranate820",
        "title": "Anyone watched Hunting Wives?",
        "content": "At first glance looks a little soapy for me but is also tagged mystery. Tempted to watch just for some of the Cast. Haven’t seen Katie Lowes in anything since Scandal, which I loved her in!! Thoughts? I watch a pretty wide range of drama, thriller, true crime, and some comedies.",
        "upvotes": 59,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1nqmh74/anyone_watched_hunting_wives/"
    },
    {
        "id": "1npwqh3",
        "author": "Practical_Captain_58",
        "title": "Netflix code for horror is 8711",
        "content": "Type this in the search bar and you will see all the horror they have available without the algorithm .\n\nYou will see one or two odd suggestions as well.\n\n**Happy Haunted Season!!!**",
        "upvotes": 397,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1npwqh3/netflix_code_for_horror_is_8711/"
    },
    {
        "id": "1nqkltr",
        "author": "shinyemptyhead",
        "title": "Looks like they might have gone back to the old UI?",
        "content": "https://preview.redd.it/olsp7irzzdrf1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=300b328e7c6415c8fababda0ec2f723ee8783723\n\nI'm on an LG TV, and my UI had switched to the new format a couple of months ago. I just came home after being away for a week, and it's showing me the old format! I'm so happy.",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nqkltr/looks_like_they_might_have_gone_back_to_the_old_ui/"
    },
    {
        "id": "1nqaixh",
        "author": "Sudden_Pop_2279",
        "title": "Wednesday Season 2 OTT Verdict: With 100M+ Views, The Jenna Ortega-Led Show Enters Netflix’s All-Time Top 10!",
        "content": "",
        "upvotes": 19,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nqaixh/wednesday_season_2_ott_verdict_with_100m_views/"
    },
    {
        "id": "1nql45o",
        "author": "Necessary-Flounder27",
        "title": "What is your favorite movies / shows for background ?",
        "content": "I'm looking for lighthearted and humorous movies or TV shows that are easy to follow and perfect for background watching. I usually have them on while doing arts and crafts, so I’d love options where I can look up occasionally and still enjoy what’s going on without getting lost. I'd prefer newer recommendations, and I have access to all major streaming platforms—except Apple TV+. Any suggestions?\nI really like delicious and dungeons on Netflix! I’ve watched it thrown through, but it’s also such a good background show. Easy watch, humorous, entertaining!! ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nql45o/what_is_your_favorite_movies_shows_for_background/"
    },
    {
        "id": "1nqohil",
        "author": "Comfortable_Bat9856",
        "title": "Ruin good shows with music",
        "content": "Dear Netflix,\n\nMany times an amazing show comes along, sometimes on Netflix, and many a times these shows are time period shows. The casting team gets actors that look, sound, and act like the time period. The art, set, costume all bust their butts to be perfect with the time period. Then the idiots in the score/music department think they need to put in modern music. This practice needs to end. Nothing kicks me out of a film harder. You are ruining so many shows. You could make great shows, but instead you make \"just okay\" shows. House of Guinness is one of these shows. Who ever the heck is in charge at Netflix fix this stupidity. If you want to add a modern flair why spend millions making anything period perfect? Why? You may as well casted all Indians instead of Irish looking people. You may as well put the cast in American eagle shirts with cargo shorts. At that point it does not matter. \n\nSincerely,\nA cinema lover",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nqohil/ruin_good_shows_with_music/"
    },
    {
        "id": "1nqogtn",
        "author": "Sudden_Pop_2279",
        "title": "Alice In Borderland season 3; unecessary but entertaining",
        "content": "After I finished Squid Game season 3 in June, I was... pretty disappointed tbh. I frequently saw Squid Game being compared to another show, Alice In Borderland. So I decided \"let me check this out\" and I really liked it, in fact I even preferred it to Squid Game. The only thing is, season 2 was genuinely such a perfect conclusion that I myself wondered how they'd do season 3, especially as the manga ends at season 2 except for a short one-shot manga.\n\nI decided to give season 3 a try when it released today. Overall? I'd say its a 7.5/10. It was better than Squid Game season 3 and I didn't regret watching it but it wasn't exactly necessary either.\n\nThe games were fine. I especially liked the Zombies ones. \n\nFor the new character's, although they didn't hit the same as the original's did, I DID like quite a few. Rei especially was a stand-out for me. I remember everyone saw the trailer and thought she'd be annoying/hateable but no, she's probably going to be the fan favorite when this is all over. As a former bully victim, I was rooting for Nobu and am so glad he pulled through. Sachiko reminded me so much of Geum-ja from Squid Game and her surviving was a nice surprise.\n\nOn the other hand... Banda and ESPECIALLY Yaba were so wasted as villains. Yaba could be removed from the season and NOTHING would change whatsoever. He had 2 scenes. Banda was the main villain but he did nothing except hands out the cards to people manipualte Ryuji and try to recruit Arisu. At least Niragi was given a tragic backstory that humanized, this dude was just evil for fun.\n\nThere were a few questions left unasnwered, like where was Yaba in the final few episodes and why was the Borderland's collapsing at the end. It was nice for Ann to play a role due to her remembering everything but I wish she had a bigger role. It was nice to see all the previous cast return in the final episode for sure.\n\nBut PLEASE do NOT do an American spin-off.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nqogtn/alice_in_borderland_season_3_unecessary_but/"
    },
    {
        "id": "1nq0fth",
        "author": "DownWitTheBitness",
        "title": "Next Gen Chef seems highly problematic",
        "content": "I just watched the finale of Next Gen Chef and I found it to be seriously suspect.  \n\nThe show already had some questionable moments.   The episode where they did the brigade service and expected the restaurant to have a different kind of fish substitution, and a substitution for a roaster ingredient to be ready in the normal time frame seemed pretty unfair and unrealistic. Who is going to ask for a different kind of fish? That’s like saying I don’t like beef, do you have lamb (when lamb isn’t on the menu). \n\nA restaurant that’s stocking proteins that aren’t even on the menu is probably going to have food cost issues pretty quickly out the gate. But that’s not even the real problem with the show.  \n\nThe winner was an employee of two of the judges. He was the former employee of one of them, and the current employee of a highly influential finale judge.  In general, I liked the guy and by all accounts he was very confident. Aside from an extremely weird moment where he screamed at London for singing, he was a likable contestant. It’s just when you’re facing people who admired your cooking enough to hire you - TWICE - the question of authenticity really starts to seep in. \n\nBy the end, it just felt weird when he won, and it could have been avoided if they’d just done some homework in booking the judges, or\nbuilt the games blind where they couldn’t know who they were judging. \n\n",
        "upvotes": 50,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1nq0fth/next_gen_chef_seems_highly_problematic/"
    },
    {
        "id": "1nqrdsq",
        "author": "COSMOS_1516",
        "title": "Crime thriller suggestions",
        "content": "I really like british crime thriller shows . Can anyone suggest me some ?  Last I watched was dept q and really liked it\n\nI am from India , so please suggest according to India's server .",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqrdsq/crime_thriller_suggestions/"
    },
    {
        "id": "1nqh5yo",
        "author": "CaptainFlint9203",
        "title": "What do you think about 1670?",
        "content": "It's a polish production about nobility in Poland in 1670 made in the style of the office. I think that's best description I could make. \n\nI'm from Poland and loved it, but most if not all of the jokes are so integrated into our culture and history that I'm really curious what people not familiar with it think about the show. If you haven't seen it, try. It has two seasons, first one is well made and second even better. Costumes and sceneries are great. And tell me what do you think about it. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nqh5yo/what_do_you_think_about_1670/"
    },
    {
        "id": "1nqpmku",
        "author": "N8creates49",
        "title": "How long does Netflix let you 'travel'?",
        "content": "So I'm in college and using my family's netflix account. I haven't had issues until tonight, when it finally decided I was having too nice of a day. How long can you travel before netflix starts trying to ruin your day? I'm not planning on going home for at least a few weeks. How frequently do I have to get a code? Is there a way for me to get netflix to mind their own business? Can I chain multiple two week 'watch temporarily' codes?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nqpmku/how_long_does_netflix_let_you_travel/"
    },
    {
        "id": "1nqpclz",
        "author": "Powerful-Space-4704",
        "title": "Question about downloads",
        "content": "Hello everyone!  In my previous post, I asked how to hide certain items from watch history on Netflix. I was wondering if the way I found actually worked. It works on other streaming apps, so I'm wondering if it works on Netflix too. If I download a show, turn on airplane mode, watch it, delete the show, force quit the app, turn off airplane mode, then reopen the app, will that hide that show from my watch list/history?  It works on HBO (Max, HBO Max????)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqpclz/question_about_downloads/"
    },
    {
        "id": "1nqo06h",
        "author": "burtzelbaeumli",
        "title": "HOW is \"Moving On\" a Comedy??",
        "content": "Spoilers. TW: SA. Rant incoming. \n\nI needed to watch a comedy today. Instead, I'm stuck in this utterly depressing and infuriating movie. It's a very good movie, but this really SHOULD NOT be listed under comedy!!! This is a full-fledged drama. \n\nLove the actresses. It's a good and important movie, but NOT A COMEDY!!\n\nThis is not the first time that Netflix categories are far from close, what's up with that? The search function in general is really terrible on Netflix. I think that's so that more movies can appear in the results, but I think it's a ridiculous strategy (on all streaming platforms), as I find myself searching for movies elsewhere, like google, then going to the platforms. \n\nI want a comprehensive search function where I can enter date ranges, actors, directors, keywords that are much more precise, check off original languages, and exclude items in all of the above sections.\n\nRant over. But seriously...",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqo06h/how_is_moving_on_a_comedy/"
    },
    {
        "id": "1nqh6ho",
        "author": "Empty-Instruction282",
        "title": "Starstruck in the City of Love! New Netflix Rom Com movie French Lover starring Omar Sy official trailer.",
        "content": "In this charming rom-com French Lover, Omar Sy from the netflix serie Lupin and french classic movie untouchable stars as Abel Camara, a jaded movie star whose world collides with Marion (Sara Giraudeau), a grounded waitress in Paris. A chance favor sparks unlikely romance, but fame's spotlight threatens their new relationship.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqh6ho/starstruck_in_the_city_of_love_new_netflix_rom/"
    },
    {
        "id": "1nqppvn",
        "author": "RemarkableLab433",
        "title": "Netflix",
        "content": "Hi I have peacock Netflix prime video and Hulu I have adhd so shows are hard to find that are interesting I am looking for mind thrilling like shows that are so good can’t stop and will make you keep saying wtfffff Will screw with ur mind",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nqppvn/netflix/"
    },
    {
        "id": "1nqj4vq",
        "author": "ArtStraight7372",
        "title": "Another adolesence post but focusing on something else",
        "content": "Something I've seen posted a lot is about the dad and the Jamie(makes sense they are kind of the focus) but I think something that isn't focused on is the sister.\n\nIt's often said that a guy having a sister is a green flag because they usually are positive influences in them not being misogynistic, and act as a sort of buffer. I think with the rise of the manosphere, this isn't as huge of a thing anymor,e but I do find it interesting in how her experience with the brother isn't centered as someone who is roughly the same age and seems close-ish to the brother. Having a little brother myself, he has told me his view of women was shaped by me and my older sister, and he's much more of a feminist because of this. I have guy friends who hold similar views due to the impact of their sister. \n\n  \nBut other than that, how does her brother being a killer who killed based on being rejected impact her? They do talk about moving during the last episode, and it made me wonder if she felt the glares and looks at her or after the dad had that clerk from the hardware store say how he is on Jamie's side, if the dad was frightened for his daughter. \n\nIt's obviously very tailored and focused in a short span of time after he is arrested, but it makes me curious on the effects of this on his sister who could be the victim of someone else's rage. \n\nWhat are yall's thoughts?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqj4vq/another_adolesence_post_but_focusing_on_something/"
    },
    {
        "id": "1nq9nzy",
        "author": "WidgetWarrior",
        "title": "Question about recommendations",
        "content": "So I've had Netflix for a good 10 years now, and sometimes when I travel to my friend's place out of town, we watch shows on their Netflix that aren't necessarily something that would come up in my account. But if I like it, will just thumbs upping it on my account recommend more of that to me, even though I hadn't watched it on my specific account?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nq9nzy/question_about_recommendations/"
    },
    {
        "id": "1nqiwe9",
        "author": "ragathor87",
        "title": "Signing In",
        "content": "Is anyone else having issues signing into Netflix on their iPhones or iPads? I can log in on the web but on the mobile devices it says account not found. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nqiwe9/signing_in/"
    },
    {
        "id": "1nq8vuu",
        "author": "ChallengeAdept8759",
        "title": "A beer historian tells the real story behind Netflix’s beer-soaked family drama ‘House of Guinness’",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nq8vuu/a_beer_historian_tells_the_real_story_behind/"
    },
    {
        "id": "1nqhcne",
        "author": "Jezyslaw2010",
        "title": "Looking for smth to watch [REQUEST]",
        "content": "Hey guys, do yall have any recommendations for netflix shows with badass male lead. And I mean something where the storyline kind of revolves around his confident life or building his life up, something to inspire me to work harder lol\n\nIt can be something musculine or not, either university or adult life, action, non action, whatever you'd recommend that inspired you.\n\nI'm looking for tv shows, but if u have some movie recs too, I'd appreciate it :)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nqhcne/looking_for_smth_to_watch_request/"
    },
    {
        "id": "1nq6jg6",
        "author": "maceman121",
        "title": "Netflix Household on ethernet",
        "content": "Morning everyone,\n\n  \nI just finished a chat with Netflix support but wasn’t able to get any real help, so I thought I’d ask here to see if anyone else has run into this or found a solution.\n\nI use multiple devices at home on the same network to watch Netflix—mostly TVs, but also phones and computers. Until this morning, everything worked fine. Suddenly, my desktop (which is connected via Ethernet) started giving me a message that it’s “not part of the same Netflix Household.” Yesterday it worked without issue.\n\nFrom what I’ve read, the household restriction was mainly intended for TVs, and you’re only able to confirm/update your household through a TV—not a computer. When I asked Netflix chat about it, their answer was basically: *“Grant your 14-day permissions every two weeks to watch, or use Wi-Fi on your computer.”* That wasn't helpful, especially since my desktop is not a wireless compatible device.\n\nA bit more context:\n\n* My Ethernet and Wi-Fi connections appear to use different public IP addresses, though they are on the same Class C network.  It is only IPv4, not IPv6.\n* My Wi-Fi runs through a mesh system wired into my modem/router.\n* My desktop is directly plugged into the same modem/router.\n* It seems my ISP might be assigning more than one IP, which is interesting but might be the issue.\n\nHas anyone else run into this, and if so, how did you resolve it? It’s frustrating since everything was working fine up until today, and now Netflix suddenly thinks my desktop isn’t part of my household and the only help I am given is to connect it to the same Wi-Fi as my other devices are using.\n\nThanks in advance for any advice!",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nq6jg6/netflix_household_on_ethernet/"
    },
    {
        "id": "1npazk0",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix is reportedly fast tracking their 'DEMON SLAYER' live-action adaptation after the massive success of the 'Demon Slayer: Infinity Castle' movie",
        "content": "",
        "upvotes": 198,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1npazk0/netflix_is_reportedly_fast_tracking_their_demon/"
    },
    {
        "id": "1nq8ofv",
        "author": "Eclipse8301",
        "title": "Profile transfer questions",
        "content": "If I do a profile transfer, does the owner have to do anything once my profile is on their account or will Netfilx \"see\" this and automatically charge the 8.99?\n\n  \nAlso on the premium plan do we still all just share the 2 devices at one time or does this bring over another device for a total of 3?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nq8ofv/profile_transfer_questions/"
    },
    {
        "id": "1npthej",
        "author": "fizzyjuices",
        "title": "Just finished Adolescence",
        "content": "Wow, I just sobbed at the very last scene of the Dad sobbing in Jamie’s room and tucking the teddy bear in. Facing what’s probably been his biggest fear since the day he found out what Jamie did - that he, as his father, should’ve done more. \n\nThere were so many emotions to hold while watching this show and I especially felt it during this episode. I wanted to be angry with his family, because that’s the easiest thing to do when a 13 year old boy does something like this. Assume his family/home life is terrible. But there was this mixture of love, shame, anger, and grief they were experiencing. I’ve seen other comments on here say that the dad was emotionally abusive. This may be my own blind spot coming out as the daughter of a man with anger issues, but I can’t tell whether that’s what the series was trying to depict or not. What I saw was a man with temper issues but that those issues were extremely exacerbated by trying to keep it together and being in denial about his son’s actions. Not that people are merely “good” or “bad,” but seeing his family be “good” people made it a more emotional watch for me. And it makes me wonder how it is Jamie became the way he did. \n\nI felt gutted by the last scene and I thought it did an excellent job of demonstrating the grief they are going through. They are grieving the son they once knew and who they thought he was. They were trying to make sense of how this happened even though they had the best of intentions and were, by all means, a pretty “normal” family. But as I felt gutted for his family, I had to remind myself what her family must be going through. And how what happened was tragic and Jamie’s actions wreaked havoc upon everyone around him - no one in his family did what Jamie did but they are paying for his actions. But at the end of the day his main victim, above all, is the girl whose life he felt entitled to take, and nothing can ever change that. It’s something his family will have to accept and her family will have to grieve forever. ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1npthej/just_finished_adolescence/"
    },
    {
        "id": "1nq65ca",
        "author": "ToonAdventure",
        "title": "In Your Dreams | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nq65ca/in_your_dreams_official_trailer_netflix/"
    },
    {
        "id": "1npwvzl",
        "author": "AccomplishedPut5175",
        "title": "Billionaires' Bunker!!!",
        "content": "Just finished watching this series.\nAt first I was attracted by the fact that the authors of the series are the same as La Casa De Papel, but...\nI don't want to criticize, but I also don't want to praise!!\nMaybe season 2 will bring something new and let's say good!\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1npwvzl/billionaires_bunker/"
    },
    {
        "id": "1npcu0x",
        "author": "RandomTurkey247",
        "title": "Jason Bateman in Black Rabbit",
        "content": "When he first comes on the screen, I was like \"OMG, he's the Duderino!\"\n\nRon Howard's voice: \"he would quickly learn Vince was, in fact, not the Duderino.\"",
        "upvotes": 66,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1npcu0x/jason_bateman_in_black_rabbit/"
    },
    {
        "id": "1nq3pza",
        "author": "Tankion94",
        "title": "Netflix PS5 app problems",
        "content": "My Netflix app on the PS5 is not working correctly. It is missing content (different profile icons, continue watching and a whole load of shows). However my iPhone app is completely fine, I’ve tried uninstalling and logging out but still not working. Any suggestions?\n\nUpdate: The shows are showing up on my partners profile, I’ve checked age restrictions etc.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nq3pza/netflix_ps5_app_problems/"
    }
]