[
    {
        "id": "1j8e1wm",
        "author": "novocainemovie",
        "title": "Hi, I’m Jack Quaid, from the upcoming movie NOVOCAINE and you might also know me as one of The Boys. AMA!",
        "content": "Hey Reddit! Jack Quaid here.\n\nYou’ve seen me as Hughie from “The Boys,” Richie from ‘Scream’ and most recently Josh from ‘Companion.’\n\nI’m excited to chat with you guys about my new movie ‘Novocaine’ where I play Nathan Caine, who feels no pain and goes on a batshit insane journey for love.\n\nIt’s hilarious, it’s gory, it’s somehow… romantic? There’s tons of bonkers fight scenes and it’s just an overall good time – can’t wait for you guys to check it out in theaters this weekend.\n\nI’ll be back on March 12 at 12:30pm ET / 9:30am PT to answer your questions!\n\nhttps://preview.redd.it/gfb67mkrfyne1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=240208d607cf45ed78b7687ebeff4b3ecbc096e0\n\n",
        "upvotes": 1273,
        "comments": 815,
        "media": null,
        "permalink": "/r/movies/comments/1j8e1wm/hi_im_jack_quaid_from_the_upcoming_movie/"
    },
    {
        "id": "1j8ru02",
        "author": "RadDayAMA",
        "title": "Hi /r/movies! I'm Bill Allen, lead actor of the 1986 cult-classic sports film 'RAD'. It was recently restored &amp; remastered in 4K and is coming back to theaters on March 21st for RAD DAY 2025, on top of the physical release. Ask me anything!",
        "content": "",
        "upvotes": 612,
        "comments": 214,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n2wudfesj2oe1.png?auto=webp&amp;s=6bf62c9b7b9229f5503f4691d700c422930c946f"
        },
        "permalink": "/r/movies/comments/1j8ru02/hi_rmovies_im_bill_allen_lead_actor_of_the_1986/"
    },
    {
        "id": "1j9668o",
        "author": "MarvelsGrantMan136",
        "title": "Gene Winfield Dies: Custom Car Designer For ‘Blade Runner’, ‘RoboCop’, ‘Star Trek’ &amp; More Was 97",
        "content": "",
        "upvotes": 1636,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kUYWEhtlrYUjhl2MCBLiAW0u9Xyn0_kiy-Nw5JwOUdE.jpg?auto=webp&amp;s=74deb824fc367292e2d0aa37625269566c4127d0"
        },
        "permalink": "/r/movies/comments/1j9668o/gene_winfield_dies_custom_car_designer_for_blade/"
    },
    {
        "id": "1j8wplr",
        "author": "OkyouSay",
        "title": "‘Robots’ at 20 – This kids’ movie was weirdly prophetic about 2025",
        "content": "",
        "upvotes": 4206,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HOiz9OXdxXiiG43f3dTQfq-kkN0570BWMRGPqQZ34ak.jpg?auto=webp&amp;s=3af99e111429182dc3abf2b10adae8b0d90bb744"
        },
        "permalink": "/r/movies/comments/1j8wplr/robots_at_20_this_kids_movie_was_weirdly/"
    },
    {
        "id": "1j8rpx1",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'Deep Cover' Starring Bryce Dallas Howard, Orlando Bloom &amp; Nick Mohammed - Three improv actors are hired by the police to help stage low-level stings. Their instinct to ‘always say yes’ without breaking character leads them deep inside the London criminal underworld.",
        "content": "",
        "upvotes": 7438,
        "comments": 539,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xicgz3vdj2oe1.jpeg?auto=webp&amp;s=ee2f76e1f40118dea14042bcc1222542fca71ffa"
        },
        "permalink": "/r/movies/comments/1j8rpx1/first_images_from_deep_cover_starring_bryce/"
    },
    {
        "id": "1j8voqx",
        "author": "MarvelsGrantMan136",
        "title": "Hayao Miyazaki's 'Princess Mononoke' is Getting a New 4K Restoration Released Exclusively in IMAX on March 26 - Official Trailer",
        "content": "",
        "upvotes": 3770,
        "comments": 170,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GZmaDFpiq4ytLR-o3snmfEY7176IHEL7ny5nRQcN6-w.jpg?auto=webp&amp;s=061994e833ea739faea1ff6c7811594808eb6de1"
        },
        "permalink": "/r/movies/comments/1j8voqx/hayao_miyazakis_princess_mononoke_is_getting_a/"
    },
    {
        "id": "1j8y1yq",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Luckiest Man in America' Starring Paul Walter Houser - Depicts the 1984 scandal orchestrated by Michael Larson when he appeared on and won the game show Press Your Luck",
        "content": "",
        "upvotes": 2584,
        "comments": 514,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qb6zdymzt3oe1.jpeg?auto=webp&amp;s=47d53c93a39d1159c1740cb1c101eb775a5642c2"
        },
        "permalink": "/r/movies/comments/1j8y1yq/official_poster_for_the_luckiest_man_in_america/"
    },
    {
        "id": "1j93vfh",
        "author": "girafa",
        "title": "Back in 1993, Lori Petty filmed two days on Demolition Man before being replaced by Sandra Bullock",
        "content": "",
        "upvotes": 644,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F6AGihc6sjMmnVLm-XWIe0jcP2vPZpBwjOqH2PhZX-c.jpg?auto=webp&amp;s=13353f39561ed11ccd79ec9880d3b36c19dcc81c"
        },
        "permalink": "/r/movies/comments/1j93vfh/back_in_1993_lori_petty_filmed_two_days_on/"
    },
    {
        "id": "1j8wweu",
        "author": "mcchinly",
        "title": "What’s a movie nobody can convince you is good",
        "content": "Like I’m talking about a movie with critical acclaim everyone tells you it’s an amazing movie and you just do not like it at all or just don’t see the wide appeal no matter how much you’ve watched it or had people tell you how mad you are for not liking it\n\nFor me its hereditary went in to see it in the cinema. It just did nothing for me at all the story I understood what was going on but it just didn’t grip me at all and I just didn’t find it as spooky scary enough to keep me entertained. Said to my friend group I was disappointed and when they all had seen it gave me the “you just didn’t understand what was going on” or I must of been confused when watching it so it wasn’t as good. Honestly I was that disappointed I’ve never watched it again because it’s too long for me to sit through it again and be like yeh this is as disappointing as the first watch. ",
        "upvotes": 1159,
        "comments": 6760,
        "media": null,
        "permalink": "/r/movies/comments/1j8wweu/whats_a_movie_nobody_can_convince_you_is_good/"
    },
    {
        "id": "1j8v55v",
        "author": "LarryKeene",
        "title": "What are your \"10/10 you'll never watch again?\"",
        "content": "Not all great movies have high rewatch value, some due to being plot driven, others because they are simply too nasty or unnerving.\n\nFor me, one was Requiem for a Dream.\n\nHit close to home with a family member who is a recovering meth addict.\n\nI was blown away by it, but I never want to watch it again.\n\nNevertheless, I do recommend everyone to go and see it, especially if you’re a fan of Jared Leto and Jennifer Connelly.",
        "upvotes": 1074,
        "comments": 2198,
        "media": null,
        "permalink": "/r/movies/comments/1j8v55v/what_are_your_1010_youll_never_watch_again/"
    },
    {
        "id": "1j8vxg7",
        "author": "verissimoallan",
        "title": "Stan Lee’s Tumultuous Final Years to Be Explored in Documentary. Jon Bolerjack filmed hundreds of hours of footage which he says shows bad behavior by those around the Marvel legend. Now he is turning it into a doc, 'Stan Lee: The Final Chapter.'",
        "content": "",
        "upvotes": 726,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6Zf-y10iSiGmwQSLsSFALYGN8FZAl6OsJ7lY1UwhThU.jpg?auto=webp&amp;s=c441bd4b3d35aedfef1ad53ae112a10d591c8b71"
        },
        "permalink": "/r/movies/comments/1j8vxg7/stan_lees_tumultuous_final_years_to_be_explored/"
    },
    {
        "id": "1j8we6s",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the 4K Restoration of Hayao Miyazaki's 'Princess Mononoke', Releasing in IMAX on March 26",
        "content": "",
        "upvotes": 588,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ilc9ho7qi3oe1.jpeg?auto=webp&amp;s=9bee6563320ae5ed742ac7ef16d34ff0322de1a0"
        },
        "permalink": "/r/movies/comments/1j8we6s/official_poster_for_the_4k_restoration_of_hayao/"
    },
    {
        "id": "1j8tys9",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'The Uninvited' - Starring Elizabeth Reaser, Walton Goggins and Pedro Pascal",
        "content": "",
        "upvotes": 607,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g6df62qw03oe1.jpeg?auto=webp&amp;s=fa286ba5df6720cef95c393ad9b40335dcd42da8"
        },
        "permalink": "/r/movies/comments/1j8tys9/official_poster_for_the_uninvited_starring/"
    },
    {
        "id": "1j8xcrx",
        "author": "NoCulture3505",
        "title": "Steve Buscemi Joins Martin McDonagh’s ‘Wild Horse Nine’",
        "content": "",
        "upvotes": 298,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s_ShbFK5h-0XJ6IJjzWaxA_nSP2yq-czQnQyAC12iDI.jpg?auto=webp&amp;s=754b04712f158e596131855aacedd69a4aedd536"
        },
        "permalink": "/r/movies/comments/1j8xcrx/steve_buscemi_joins_martin_mcdonaghs_wild_horse/"
    },
    {
        "id": "1j9dndz",
        "author": "Significant_Slip4030",
        "title": "Dog Day Afternoon 50th Anniversary",
        "content": "Al Pacino talked about Sidney Lumet’s Dog Day Afternoon at the Aero Theater last Tuesday. Lumet’s daughter did a surprise appearance at the screening. Pacino deep dives into the making of the film and reflects on acting brother John Cazale.\n\nHeard the Q&amp;A discussion got pushed a couple times but kudos to Pacino and his team for making it work and rescheduling a date that worked out. \n\nLooked like a fun screening for the audience.",
        "upvotes": 24,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qq1arXu2HNVdkBqlNk1p1TltPONkT4Z50Pkd3-oTTPc.jpg?auto=webp&amp;s=12a4f6534b27a5e58545755d5422568279a5d199"
        },
        "permalink": "/r/movies/comments/1j9dndz/dog_day_afternoon_50th_anniversary/"
    },
    {
        "id": "1j97pq3",
        "author": "applegui",
        "title": "Trying to track down a documentary with Leonard Nimoy as VO that played around 2009 at the American Museum of Natural History in NYC. The topic was the creation of the Moon.",
        "content": "",
        "upvotes": 66,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kzggmxnyw5oe1.jpeg?auto=webp&amp;s=1b608fec60713a5ec361bfa3a89b2ea3b5f63339"
        },
        "permalink": "/r/movies/comments/1j97pq3/trying_to_track_down_a_documentary_with_leonard/"
    },
    {
        "id": "1j8z7lu",
        "author": "vtshowstopper",
        "title": "Can we talk about how absolutely absurd Face/Off is?",
        "content": "I'll begin by saying that I am not referencing the premise of the movie. Of course, the technology presented was too futuristic but that's beside the point. I'm referring to the insane plot choices that had me cackling throughout the playtime. This wasn't even close to my first time seeing Face/Off but below are some of the things that made me realize how dumb (still a fun watch) this movie really is. \n\n  \n1.) Although they make it clear that it's not only Archer's face they will be changing during his secret procedure, I don't think they emphasized that every single aspect of his outward appearance would be changed. You see him get his scar removed (back to this later) but Troy was sleeping with Archer's wife while wearing his face. That would imply that they either have the exact same sexual anatomy, his wife is completely clueless, or they surgically made Archer's body identical to Troy's. \n\n2.) Throughout the entire film, Archer and Troy shoot thousands of rounds at each other, try and blow each other up, etc. While I get Archer wanted revenge, the two of them clearly didn't care if they were going to get their real face back as I can't imagine the surgery they both received would be able to just fix a shot up face. If their goal was to get their identities back, firing bullets with little to no aim seems like the wrong approach. \n\n3.) Speaking of the shootout scenes, the FBI gives ZERO fucks about children as seen when they raid Troy's friends hideout. Adam almost got shot in every part of that scene. \n\n4.) Random callout but with hindsight, having Danny Masterson play the guy who assaults Jamie was a bad call. \n\n5.) The absolutely most absurd part of this entire movie was Archer's starting motivation and the ending of the movie. Clearly, Archer's vendetta against Troy was due to Archer's son being killed. When he goes in for his first surgery, he asks to not have his scar removed as it reminded him of his lost son and the reason he was doing the secret assignment in the first place. Cut to Archer meets Adam, Troy's biological son, who reminds him of his boy. Adam's mom dies, Archer kills Troy, yada yada. When Archer is finally getting his surgery to get back to his normal appearance, he says he doesn't need the scar back anymore. Fine. A little strange seeing as how important it was at the beginning of the film but maybe Troy being dead will help him and his family move on and remember his boy together. Then you cut to Archer returning home to his family and realize he's been making this essentially random kid (Adam) wait on the porch for him to call him in and announce him as their replacement son to the family's delight. \n\n  \n10/10 would highly recommend",
        "upvotes": 136,
        "comments": 126,
        "media": null,
        "permalink": "/r/movies/comments/1j8z7lu/can_we_talk_about_how_absolutely_absurd_faceoff_is/"
    },
    {
        "id": "1j907ef",
        "author": "VeryPteri",
        "title": "We've heard of actors playing against their type. But what directors have directed against their type?",
        "content": "i.e. directors known for doing certain types of genres opting to direct a film that's very far removed from that genre. The closest I can think of is Jared Hess, who usually did small scale comedies, now being given the reins of a $150 million Minecraft film. \n\nOthers that come to mind are Guillermo del Toro and George Miller, who I'd say don't have a type and are instead known for their range.",
        "upvotes": 116,
        "comments": 380,
        "media": null,
        "permalink": "/r/movies/comments/1j907ef/weve_heard_of_actors_playing_against_their_type/"
    },
    {
        "id": "1j8u9x4",
        "author": "NoCulture3505",
        "title": "Gareth Evans Teases 'HAVOC', New Image of Tom Hardy Revealed",
        "content": "",
        "upvotes": 240,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1ZE6_yhHik1CHXJCgmBfbzMAVh07Veiy-U491xTq3zM.jpg?auto=webp&amp;s=26a23ccb59a1718faa0346b898f067e303dae16f"
        },
        "permalink": "/r/movies/comments/1j8u9x4/gareth_evans_teases_havoc_new_image_of_tom_hardy/"
    },
    {
        "id": "1j89i8c",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Jack Quaid &amp; Jeffrey Dean Morgan in 'Neighborhood Watch' - Simon, a man grappling with mental illness, becomes convinced that he has witnessed an abduction. When the police refuse to believe him, he reluctantly seeks the help of his neighbor, a retired security guard.",
        "content": "",
        "upvotes": 7316,
        "comments": 367,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ywpmpmwjgxne1.jpeg?auto=webp&amp;s=7628ffa1a5d266d7d123a3edd53e771a63f78627"
        },
        "permalink": "/r/movies/comments/1j89i8c/first_images_of_jack_quaid_jeffrey_dean_morgan_in/"
    },
    {
        "id": "1j91a0p",
        "author": "listening_partisan",
        "title": "Movie pet peeves",
        "content": "Looking for those movie/TV tropes that you just can't stand to see, to the point where they actually completely take you out of the experience. I'll start with two of my own, if you'll allow: \n\n1) Characters ordering coffee or drinks in a bar or diner and then leaving before finishing, paying for, or, worse yet, before even being served said coffees or drinks. \n\n2) Laptop screens being slammed shut for dramatic effect. No one actually does that. \n\nCan anyone identify with this? Any other good suggestions?",
        "upvotes": 60,
        "comments": 348,
        "media": null,
        "permalink": "/r/movies/comments/1j91a0p/movie_pet_peeves/"
    },
    {
        "id": "1j8dgrr",
        "author": "BitchPancake",
        "title": "HBO Max’s platform ruins the ending of My Neighbor Totoro",
        "content": "I’m sure I’m not the first person to bring up that it’s annoying that the streaming services have all decided that the second the credits roll on a movie, that the movie’s image should immediately become a smaller box that they shove in the corner. But in the case of My Neighbor Totoro I believe it ruins one of my favorite moments in any movie. \n\nSPOILER BELOW\n\nInstead of seeing the incredibly touching moment of the Mom returning home from the hospital with her children Satsuki and Mei leaping to hug her….HBO Max has decided that instead it should be a bunch of little boxes trying to get me to click on another program to watch. \n\nI guess this just scores 1 more point for the superiority of physical media but it still shouldn’t be this way. ",
        "upvotes": 2556,
        "comments": 161,
        "media": null,
        "permalink": "/r/movies/comments/1j8dgrr/hbo_maxs_platform_ruins_the_ending_of_my_neighbor/"
    },
    {
        "id": "1j9fkib",
        "author": "Xoundor",
        "title": "Terrible movies for bachelor's party",
        "content": "Hey everyone!\n\nFor our buddy’s bachelor party, we’re brainstorming challenges, and one of them involves him watching an absolutely terrible movie beforehand. Not necessarily a long one — just something unbearably boring, painfully bad, or nearly impossible to sit through.\n\nDuring the bachelor party, we’ll randomly quiz him about the movie at the most inconvenient moments.\n\nSo, hit us with your best (or worst?) suggestions! What’s the most god-awful movie you’ve ever seen?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1j9fkib/terrible_movies_for_bachelors_party/"
    },
    {
        "id": "1j9fju4",
        "author": "gilette_bayonete",
        "title": "The most disturbing movie death that comes to mind",
        "content": "Definitely Mellish from Saving Private Ryan. I love how it's silent for a few moments then the Germans shoot back through the wall, hitting the other GI in the neck. \n\nOne sticks his head out and Mellish drops him but the rifle goes empty so he rushes the last German. It's a scrappy, dirty fight which seems to last FOREVER, while the GI is still laying there bleeding to death. It breaks my heart hearing Mellish calling out for Rieben, who had been busy taking out the 20mm cannon. They're fighting for so long that the GI bleeds out.\n\nMellish did have the upper hand - he was on top with the knife but the German reversed and disarmed him. Then it was over for Mellish. I like that they showed humanity and that the German didn't take pleasure in stabbing Mellish.\n\nIt's actually a very accurate portrayal as well - The Fallschirmjager, German paratroopers actually held the most hand-to-hand combat victories in all of WW2. You can tell by his camouflage he's not regular German infantry. ",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1j9fju4/the_most_disturbing_movie_death_that_comes_to_mind/"
    },
    {
        "id": "1j8cgv5",
        "author": "MarvelsGrantMan136",
        "title": "‘Moana’ Trial Ends in Win for Disney as Company Is Cleared of Copyright Infringement",
        "content": "",
        "upvotes": 2328,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/50Eg4XTXKPVELmb8EnhhK58eCzxwhrd3ZS23CleqipQ.jpg?auto=webp&amp;s=6aae70a8b6046a56d01ca3f24264773e383e882c"
        },
        "permalink": "/r/movies/comments/1j8cgv5/moana_trial_ends_in_win_for_disney_as_company_is/"
    },
    {
        "id": "1j8gx1q",
        "author": "Odd_Advance_6438",
        "title": "In Snowpiercer, whats the reason for the guards cutting the fish before that one fight scene? Also, are they blindfolded",
        "content": "Great movie. Really love the shot of them gutting the fish before the fight, but I’m not sure what it really means. Is the fish poisonous? Is it to show that they can afford to waste resources that the back of the train would die for? Is it just an intimidation tactic? I’m guessing it’s just the last one, as it is an unsettling image, but it just seems kind of random",
        "upvotes": 1181,
        "comments": 123,
        "media": null,
        "permalink": "/r/movies/comments/1j8gx1q/in_snowpiercer_whats_the_reason_for_the_guards/"
    },
    {
        "id": "1j8x7a8",
        "author": "NoCulture3505",
        "title": "Steve Wiener Dies: Cineworld Founder Was 73",
        "content": "",
        "upvotes": 69,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JnEp3BaF-ki-hllSFWITO09txkatQxtxJriLLKdRlm0.jpg?auto=webp&amp;s=ffb135ff52b263d2f73c7569b9fd3e88e4001598"
        },
        "permalink": "/r/movies/comments/1j8x7a8/steve_wiener_dies_cineworld_founder_was_73/"
    },
    {
        "id": "1j9dhb5",
        "author": "dcterr",
        "title": "Kate and Leopold",
        "content": "Has anyone here seen this one? I think it's excellent. I've always enjoyed movies about time travel as well as romantic comedies, and this one involves both of these and is quite entertaining. Meg Ryan does an excellent acting job as always, and Hugh Jackman does as well. I won't give away any spoilers, other than to say that it's a romantic comedy concerning a relationship between a modern woman and a man from the 19th century who accidentally ends up in 2001, when the movie was made. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1j9dhb5/kate_and_leopold/"
    },
    {
        "id": "1j98wze",
        "author": "itsmethatguyoverhere",
        "title": "Movies where another story is told in the background?",
        "content": "Can't think of any examples but I've always saw the movie where there's actually a totally different story being told through details in the background or things that aren't necessarily called attention to. This isn't a great example but I think of how \"into the furnace\" there is a few points where you hear news casts in the background that aren't references or shown but sort of add to the setting even tho they are easy to miss",
        "upvotes": 14,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1j98wze/movies_where_another_story_is_told_in_the/"
    },
    {
        "id": "1j9faun",
        "author": "Cute_Pudding8018",
        "title": "CRIME MOVIES",
        "content": "I loved ocean’s 11, tower heist, lucky number slevin, the social networks …\n\nI loved crime docs like the bing ring \n, American nightmare, don’t f with cats , evil genuine : bank heist (all Netflix produced docs) \n\nI even enjoyed oceans 8 and now you see me\n\nPLEASE recommend more crime movies - \n \nHOWEVER, I want to avoid the true crime female violence rabbit hole - I don’t wanna hear about cold cases of women being abused and killed UNLESS the killer is brought to justice. \n\nAll refs welcome - either amazing blockbusters or cheap entertainment \n",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1j9faun/crime_movies/"
    },
    {
        "id": "1j998bb",
        "author": "MNVixen",
        "title": "Creature-feature lovers, \"THEM\" is available for FREE w/ads on Tubi",
        "content": "Basically, the title. THEM! is a creature feature from 1954. It's set in New Mexico near the area where nuclear tests occurred in 1945. I don't want to give too much away but, unlike some other creature features, the acting is pretty good and includes James Whitmore, Edmund Gwenn, and James Arness. Although a lot of the science behind the movie is just wrooooooong, it's a fun watch!\n\nIf you enjoy creature features, drop the name of your favorite in the comments!",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1j998bb/creaturefeature_lovers_them_is_available_for_free/"
    },
    {
        "id": "1j9fmru",
        "author": "Sufficient_Muscle670",
        "title": "The Lost Empire(1984) - This Movie Exists",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RF9ib0T_nv-qFbS2E0HYuiuPOWccR7GKM6ApfYgMfnk.jpg?auto=webp&amp;s=84db6f0eb64b78e04cb27b23937a6bc9b1ff7821"
        },
        "permalink": "/r/movies/comments/1j9fmru/the_lost_empire1984_this_movie_exists/"
    }
]