[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 588,
        "comments": 4495,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nf7w0j",
        "author": "ProofMechanic",
        "title": "With Netflix dropping a new Ed Gein series, fans are once again asking for Mindhunter to return",
        "content": "Ever since *Dahmer* became a massive hit, there’s been constant talk about whether Netflix might bring back *Mindhunter*. Now, with the upcoming Ed Gein series (October 3) from the same producer, a lot of people in the comments are repeating the same thing: *“Bring back Mindhunter.”* Is there still a change to make a comeback? ",
        "upvotes": 80,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7w0j/with_netflix_dropping_a_new_ed_gein_series_fans/"
    },
    {
        "id": "1nfampr",
        "author": "LackAccomplished6057",
        "title": "Any movie recommendations to switch the brain off after a long day at work?",
        "content": "Hi everyone,  \nAfter long hours at the office, I usually come home mentally drained and don’t feel like watching anything too heavy or serious. I’m looking for some *switch-your-brain-off* kind of movies — something fun, light, maybe even silly, that doesn’t require a lot of thinking but is still entertaining.\n\nGenres I usually enjoy:\n\n* Comedies (feel-good or goofy)\n* Action movies with simple plots\n* Lighthearted rom-coms\n* Animated/family movies that adults can enjoy too\n\nBasically, something I can put on to relax, laugh, and forget about work stress for a while.\n\nWhat are your go-to *comfort movies* after a long day?",
        "upvotes": 27,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1nfampr/any_movie_recommendations_to_switch_the_brain_off/"
    },
    {
        "id": "1nezmob",
        "author": "TheMirrorUS",
        "title": "Netflix's Eternal Love star Yu Menglong has died at the age of 37",
        "content": "",
        "upvotes": 66,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nezmob/netflixs_eternal_love_star_yu_menglong_has_died/"
    },
    {
        "id": "1nfjoli",
        "author": "AccomplishedPut5175",
        "title": "The Wrong Paris.",
        "content": "just finished watching this movie (my girlfriend made me), and if you want to watch something completely relaxing, this is the movie for you.\nAll best🍀☘️",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nfjoli/the_wrong_paris/"
    },
    {
        "id": "1nf87e8",
        "author": "Top-Three-USA",
        "title": "Malin Åkerman and Brittany Snow Return as Netflix’s ‘The Hunting Wives’ Gets Season 2 Renewal",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nf87e8/malin_åkerman_and_brittany_snow_return_as/"
    },
    {
        "id": "1nfi2dy",
        "author": "Correct_End998",
        "title": "Looking for a feel good family movie for this weekend",
        "content": "With all the craziness going on in our lives , we really need something that isn’t too stressful and is kinda fun . We tend to enjoy movies about dogs , and my mom always enjoys a good romcom. Please nothing animated . ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nfi2dy/looking_for_a_feel_good_family_movie_for_this/"
    },
    {
        "id": "1nfdr0v",
        "author": "curdledwang",
        "title": "The Wrong Paris!!",
        "content": "Hey everyone!! I just stumbled across a hilarious new rom-com called The Wrong Paris! It stars Miranda Cosgrove (loved School of Rock)\n\nIt’s so cute, funny, amazing ensemble cast. Perfect for people who just need something to unwind and have a ton of laughs. Would recommend! ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nfdr0v/the_wrong_paris/"
    },
    {
        "id": "1nf9zn6",
        "author": "New-1978",
        "title": "Film for mid 40yr olds",
        "content": "Another night in with the other half- can you recommend a fun film about people in their 40s rediscovering themselves or going through mid life crisis but finding new lease of life / or going through some kind of epic journey of discovery!?!?  ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nf9zn6/film_for_mid_40yr_olds/"
    },
    {
        "id": "1nf7iiv",
        "author": "No_Garage_2382",
        "title": "LOVE CON REVENGE",
        "content": "Have you guys watched the Love Con Revenge which was recently added on Netflix? If yes, which episode made you feel like WHAT THE ACTUAL F- IS REALLY WITH THIS CON PERSON? ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7iiv/love_con_revenge/"
    },
    {
        "id": "1nfjink",
        "author": "Original2021",
        "title": "Beauty in Black Season 2 made a huge storyline mistake",
        "content": "This season wasn’t nearly as interesting as the first season. The main reason is the lead character seems to be Rain, Kimmie’s  friend. This character is in almost every scene making weird faces and reacting with very few lines. I wanted this season to highlight more of the conflict from season one. There are too many plot holes to list here but the best scene is the last ten minutes of the season and takes place in the office. Perry’s writing and the acting were brilliant . The rest of the season was just meh- mostly  because the storyline didn’t build properly from season one. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfjink/beauty_in_black_season_2_made_a_huge_storyline/"
    },
    {
        "id": "1nfj6d7",
        "author": "destinyrose1998",
        "title": "Netflix almost never works on my laptop.",
        "content": "Just as a reference, I have an HP spectre, bought about 3 years ago. Both the app and going online (internet explorer and Google chrome) rarely ever work. I get this weird green pixelated screen or just a black screen with the audio playing in the background. Neither are specific to what I'm on, as both have happened on the different platforms. \n\nI usually watch Netflix on my TV (as do most people, I assume), but any time I have tried to play it on my laptop, it's worked maybe 10% of the time. It's not a really big deal considering, but I would still like to know if anyone else is experiencing these problems or if anyone has any solutions? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nfj6d7/netflix_almost_never_works_on_my_laptop/"
    },
    {
        "id": "1nfd7dj",
        "author": "Randomaf899",
        "title": "Looking for thriller series similar to Harden Coben shows :)",
        "content": "I'm so bored it's unreal and I've spent days trying to find something whilst rewatching the Harden Coben series in the background. \nI need some twists and turns and mystery. I have a thing for figuring out twists and endings far too fast so I get bored easily but at this point I'll try anything 🙉",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nfd7dj/looking_for_thriller_series_similar_to_harden/"
    },
    {
        "id": "1nf7ued",
        "author": "SlightlyBoringCat",
        "title": "The wrong way to use healing magic is so good lol",
        "content": "I thought I'd watch a chill anime over a span of a few days but this anime is so interesting lol. Finally after finishing ep 9, I resisted and overcame the urge to click the '**next episode**' button haha, can't stop watching, and it's only 13 episodes. I'm sad it will end so soon :( but yeah.\n\nWould recommend to anyone who's looking for a short Isekai anime",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nf7ued/the_wrong_way_to_use_healing_magic_is_so_good_lol/"
    },
    {
        "id": "1nfa4ow",
        "author": "xxxbeebeew",
        "title": "Beauty and the Bester",
        "content": "Is this doc available outside of south africa and what are your thoughts, particularly if youre hearing/watching for the first time. Since we have a lot of background and saw the story unfold in real time, most of the stuff covered was stuff we already knew",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nfa4ow/beauty_and_the_bester/"
    },
    {
        "id": "1nf8zrm",
        "author": "JazzyJ967",
        "title": "Song played at 5:00 into 'The Program: Cons, Cults &amp; Kidnapping'",
        "content": "So I'm on episode 3 of  'The Program: Cons, Cults &amp; Kidnapping' and 5:00 minutes into the episode a song starts playing, I've used Shazam, nothing, I've used another song identifier app with no luck, I've tried googling it, looking on SongFind or WhatSong and still nothing. \n\nAnyone know what it's called? \n\n\n\n  \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nf8zrm/song_played_at_500_into_the_program_cons_cults/"
    },
    {
        "id": "1nexfxf",
        "author": "rohanad1986",
        "title": "Netflix &amp; AMC Networks Expand Branded Deal With New Seasons Of ‘Interview With The Vampire’, ‘Dark Winds’ &amp; ‘The Walking Dead’ Shows",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nexfxf/netflix_amc_networks_expand_branded_deal_with_new/"
    },
    {
        "id": "1nfdzvm",
        "author": "AlexMonikArtist",
        "title": "Battle camp spelling challenge",
        "content": "Did anyone else giggle through the entire spelling bee “challenge”? 😅 When they blasted the dramatic music for…. “Ocean”…. And paused midway through “Wholesome”. With all the encouragement from the teams for 1 to two syllable words. 💀 gotta take it easy on the Netflix cast 😅",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nfdzvm/battle_camp_spelling_challenge/"
    },
    {
        "id": "1nf3shx",
        "author": "Shararizard",
        "title": "Anyone know where I find season 2 of to the lake?",
        "content": "I just finished the first season on Netflix and can’t find any infos online… Help! The cliffhanger is just so infuriating. I thought it’d be a mini series but it just ends. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nf3shx/anyone_know_where_i_find_season_2_of_to_the_lake/"
    },
    {
        "id": "1nf6tgc",
        "author": "im_a_reddituser",
        "title": "The wrong paris is ridiculous, but in a good way?",
        "content": "They know what they are making and having fun with the genre. Found myself laughing more than i thought I would. It’s good a Disney meets lifetime movie, and it’s great if you need something light and silly. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nf6tgc/the_wrong_paris_is_ridiculous_but_in_a_good_way/"
    },
    {
        "id": "1nfbvzn",
        "author": "ProfessionalChef123",
        "title": "Has anyone watched a Netflix live event?",
        "content": "I was going to watch the upcoming Crawford Canelo fight this Saturday with a Friday but we won’t be able to start until halfway through the main event. \n\nHas anyone else watched a previous live event on Netflix before? Would we be able to choose where to start watching for the event or can we only watch what’s currently live? \n\nThank you! ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nfbvzn/has_anyone_watched_a_netflix_live_event/"
    },
    {
        "id": "1nf5xjj",
        "author": "Cultural-Caramel3621",
        "title": "Need similar recs!!",
        "content": "Does anyone have any recs similar to My Life with the Walter Boys? I also love The Summer I Turned Pretty, as well as the Kissing Booth, and To all the Boys I’ve Loved Before.\n\nThanks! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nf5xjj/need_similar_recs/"
    },
    {
        "id": "1nfgrxz",
        "author": "funkyjohnlock",
        "title": "Netflix broken",
        "content": "I turned on my tv and opened my Netflix as I always do to eat my meals, but when I click to start the episode on a show I'm watching, it has no audio. I immediately checked if the TV was the problem, but every other sound is there, even inside netflix, the trailers play with audio. I then started the last episode of the show that I had watched only a couple hours prior with no issues, and that one doesn't have audio either now, despite having already watching it today with audio. I'm a tech illiterate and don't know what might be the problem or how to solve it. Google wasn't any help. Anyone knows? Thanks.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nfgrxz/netflix_broken/"
    },
    {
        "id": "1neok6u",
        "author": "Frank3634",
        "title": "Netflix &amp; AMC Networks Expand Branded Deal With New Seasons Of ‘Interview With The Vampire’, ‘Dark Winds’ &amp; ‘The Walking Dead’ Shows",
        "content": "[https://deadline.com/2025/09/netflix-amc-networks-expand-deal-with-1236529094/#comments](https://deadline.com/2025/09/netflix-amc-networks-expand-deal-with-1236529094/#comments)",
        "upvotes": 26,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1neok6u/netflix_amc_networks_expand_branded_deal_with_new/"
    },
    {
        "id": "1ne6xhd",
        "author": "rohanad1986",
        "title": "Eunice Kim Out as Netflix’s Chief Product Officer",
        "content": "",
        "upvotes": 237,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1ne6xhd/eunice_kim_out_as_netflixs_chief_product_officer/"
    },
    {
        "id": "1nes0qt",
        "author": "lilyandcarlos",
        "title": "OA",
        "content": "Just finished watching.\nThe ending blew my mind!!!\nAmazing series \nSo much more substance than what we normally see on television.\nLoved Brit, Jason and the rest of the cast.\nNice to see a show that is so well written and cast.\nWhy not a third season?\n",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nes0qt/oa/"
    },
    {
        "id": "1nel4ay",
        "author": "Unhappy_Interview_93",
        "title": "Wolf king season 2 ending",
        "content": "There’s no subreddit for Wolf King, so I guess I might as well write it in this one. After watching the last episode and finding out that there won’t be a third season, and that Wolf King Season 2 is the final season, I think they could have just made the ending differently, giving us viewers closure on the story. But instead, they leave us on a cliffhanger and imply that another season might come. But no, there won’t be a third season, ’cause it’s canceled according to news outlets. So, given this info, the people who made the second season shouldn’t have done that at all. Now I’m just disappointed.",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nel4ay/wolf_king_season_2_ending/"
    },
    {
        "id": "1nex64a",
        "author": "Sea-Possession8260",
        "title": "Good fantasy TV show, little romance, good plot and acting.",
        "content": "After watching *Wednesday*, I’m looking for a good TV show with a solid plot, good acting, and just a touch of romance. I don’t enjoy teenage romance in fantasy shows—it usually feels forced, inconsistent, and honestly a bit cringe when they start kissing. I’d rather see romance handled with more maturity and subtlety.\n\nActing quality is really important to me. I’ve tried some Netflix shows where the performances felt too forced or awkward, and it completely pulled me out of the story. If the acting isn’t excellent, at least I’d prefer it to be decent and natural.\n\nI’ve already watched *The Witcher* and *Wednesday*. I was planning to watch *Sabrina*, but I’ve heard she has too many love interests, and I’m not sure I’d enjoy that. The acting seems decent, but I don’t know if it’s worth it.\n\nFantasy is my first choice, but if there’s nothing that fits these preferences, I’m also open to non-fantasy shows.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nex64a/good_fantasy_tv_show_little_romance_good_plot_and/"
    },
    {
        "id": "1nextfo",
        "author": "Ok-Tell-1605",
        "title": "Il caso Asunta",
        "content": "Sono alla terza puntata della serie che parla di questo caso. \n\nScusate la moglie, la figlia, la famiglia dell’amante di Rosario? Non esistono? Dopo che Rosario si è divorziata il suo amante ha detto che non avrebbe mai lasciato la sua famiglia e la moglie, non capisco se la Moglie abbia scoperto questa Rosario come amante del marito. Penso che comunque con tutto il giornalismo mediatico, in qualche modo l’abbia scoperto. Sarebbe bello analizzare anche le dinamiche di questa famiglia ora.\nSono ancora Insieme? Si sono lasciati perché la moglie è stata tradita? Lui era davvero così innamorata di lei? Una cosa che non sopporto nella vita reale, è il fatto di avere un amante quando si è sposati. Un conto è una scappatella, una botta e via , un conto è che la situazione perduri nel tempo. Addirittura conosco coppia dove lei ha l’amante e lui sta aspettando che la propria moglie lo lasci. Cose da pazzi!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nextfo/il_caso_asunta/"
    },
    {
        "id": "1nf0orm",
        "author": "sugarinjam_3",
        "title": "Thoughts on SWAT?",
        "content": "Well, the there’s a new season coming out on Monday (season 8) and I’ve personally enjoyed the series a WHOLE bunch, like it’s one of my FAVORITES. But some of my friends don’t like it, say it’s “boring”. Would like to hear other people’s thoughts on the series !! ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nf0orm/thoughts_on_swat/"
    },
    {
        "id": "1nebtxb",
        "author": "Fun_Molasses5215",
        "title": "Lisa Rinna revealed the hardest part about playing Kendra Licari in film about shocking case",
        "content": "",
        "upvotes": 39,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1nebtxb/lisa_rinna_revealed_the_hardest_part_about/"
    }
]