[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 91,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m6ln52",
        "author": "Due-Calendar-4256",
        "title": "What your top 3 all time favorites on Netflix",
        "content": "What your top 3 all time favorite shows on Netflix\nMine:\n#1 DARK (SIC MUNDUS CREATUS EST)\n#2 STRANGER THINGS (011)\n#3 MONEY HEIST (GOLD IS ILLUSION)\n\nI know all are populars show but maybe there exist a underrated gem that ranked for someone and I would love to know about it. So, consider sharing it.",
        "upvotes": 56,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1m6ln52/what_your_top_3_all_time_favorites_on_netflix/"
    },
    {
        "id": "1m6mq19",
        "author": "meltingsunz",
        "title": "Netflix Reveals New Lineup of Food Shows — Including Some Returning Favorites (Exclusive)",
        "content": "",
        "upvotes": 30,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m6mq19/netflix_reveals_new_lineup_of_food_shows/"
    },
    {
        "id": "1m6svch",
        "author": "Janeeee811",
        "title": "Sirens - ending",
        "content": "Why is it implied that Michaela wouldn’t be getting any money in her divorce settlement bc Peter destroyed the photo— but they are making to painfully and awkwardly obvious to the staff and to the guests or the Gala what is going on between Peter and Simone? \n\nEven without the photo, I’m sure people will be gossiping enough to prove Peter’s infidelity.\n\nKinda stupid really.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m6svch/sirens_ending/"
    },
    {
        "id": "1m68qbt",
        "author": "Legal-Mood-3526",
        "title": "Trainwreck: PI Moms",
        "content": "Anyone else feel kinda unfulfilled by this? Maybe it’s bc I based my expectations on poop cruise where they dedicated way too much time to the most useless details, so I thought this would be longer. I knew nothing about this case beforehand so I was very excited by the premise, but it seemed very rushed and I thought more would happen. \n\nThe story seemed quite interesting in the trailer but everything unfolded in the last 20 mins… def feel like they cut out a lot of info. I would have loved to get an extended version of this. Thoughts? ",
        "upvotes": 63,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1m68qbt/trainwreck_pi_moms/"
    },
    {
        "id": "1m6kici",
        "author": "silivriicingencim",
        "title": "I made a Netflix extension to mark shows as watched 👀👀👀",
        "content": "Ayo... Just wanted to share [this Chrome extension](https://chromewebstore.google.com/detail/watchflix-a-netflix-watch/ndembgeojaahiiibpjhocamieepbbabe) I built in under 4 days — it lets you **mark Netflix shows as watched** so you don’t forget what you’ve seen.\n\nOnce marked, it puts a little overlay on them (you can even customize how it looks). You can also choose to **hide** watched stuff (though fair warning: hiding is kinda glitchy right now lol) You can click the extension icon to open a full list of what you’ve marked, jump straight to those shows, or remove stuff from the list. It’s been super helpful for me since Netflix doesn’t have anything like this. Its completely open source and safe.\n\nIf you have any suggestions to improve the extension just send me a dm or comment here, I will try to improve it by your feedback. Im putting an image of the extension for the lazy ones :S\n\nEdit: I couldn't find a better flair... oops  \nEdit 2: I forgor to put the links of the extension \n\n[WatchFlix - A Netflix Watchlist Extension](https://chromewebstore.google.com/detail/watchflix-a-netflix-watch/ndembgeojaahiiibpjhocamieepbbabe)\n\n[Github - xanndevs/watched-flix](https://github.com/xanndevs/watched-flix)\n\nhttps://preview.redd.it/iaz8p9f2ogef1.png?width=386&amp;format=png&amp;auto=webp&amp;s=5625df0bb753fd73bc50ca5a3437a9b69f456d6d\n\nhttps://preview.redd.it/9doc924aogef1.png?width=1560&amp;format=png&amp;auto=webp&amp;s=8e88f693beaddd88f82cd93ddb7022a9df0bc1d0",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m6kici/i_made_a_netflix_extension_to_mark_shows_as/"
    },
    {
        "id": "1m6r5sn",
        "author": "Zealousideal_Map5074",
        "title": "I'm on episode 4 of Mask Girl - one thing is bugging me",
        "content": "In episode 3, how did everyone know that kim mo mi is mask girl?\n\nBecause \n1) Mr jo only recognise mask girl by her hand mole.\n2) that jerk person who decided to meet mask girl, and he knows the identity only after she removed her mask in resturant. After that he started posting about how ugly she is,  but he never upload the picture of mask girl identity.\n\nAfter that scene, that jerk died and Kim mo mi killed Mr jo in her apartment. Mr jo never released any identification of mask girl in public.\n\nThey how the hell everyone all of a sudden knows who the real mask girl is? \n\nI know, Mr jo and Mo mi both disappeared from their office. But it doesn't highlight that Mo mi is mask girl! \nYes Mr jo's computer if full of mask girl pictures but he also have many other girls picture in different folder.\n\nIf a person disappeared, nobody gonna suspect the idol or actors they followed, it's stupid.\n\nAm I missing out something or it's just a plot hole?\n*NO SPOILER PLEASE*",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6r5sn/im_on_episode_4_of_mask_girl_one_thing_is_bugging/"
    },
    {
        "id": "1m6tgfj",
        "author": "peach_ihz",
        "title": "100 years of solitude on netflix",
        "content": "Am I missing something ? This show is so confusing .\nI'm still on episode three but omg. Tried to Google somethings so I get the remark about the pigtailed kids being from incest, but were ursula and Jose related ? And why all the kids named Jose acario",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m6tgfj/100_years_of_solitude_on_netflix/"
    },
    {
        "id": "1m6wvjb",
        "author": "Technical-Pie-8356",
        "title": "Would you rather take vacation on Poop Cruise or spend a year at Camp Lejeune roomed with Balloon Boy’s dad?",
        "content": "These are my train wreck thoughts. I’m just curious. I think I’d take the poop cruise. No offense to the Heene family, but at least it’s a shorter amount of time?? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6wvjb/would_you_rather_take_vacation_on_poop_cruise_or/"
    },
    {
        "id": "1m6kktx",
        "author": "Novel_Independent166",
        "title": "Thoughts on Untamed ending?",
        "content": "&gt;!Even though the show was full of tropes I enjoyed till the 80% mark. It just went off the rails for me from the moment Kyle’s wife was in a hospital gown for some reason. Attempted suicide due to the guilt of killing her son’s murderer? Speaking of, they just glossed over the fact that Sean Sanderson killed Caleb. Why exactly? Why did Maguire fire at Kyle in the first place? How did he know what Kyle was up to? After all of this, the whole angle with the older cop shooting his daughter knees out because he just wanted to get her to stop and talk? And then she goes off and commits suicide, almost taking out two other people while doing so? !&lt;\n\nSuper disappointed. A show hasnt gone off the rails this quickly for me since a while. So much potential, wasted.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m6kktx/thoughts_on_untamed_ending/"
    },
    {
        "id": "1m6qk3q",
        "author": "anandasheela5",
        "title": "Similar shows to Love &amp; Anarchy? (I’ve watched it 4 times already!)",
        "content": "I adore Love &amp; Anarchy, especially Sophie’s character, she’s unapologetically trying to be herself while navigating all the chaos in her life, and I relate to that. I’ve already watched the series almost four times, and I’m craving something with a similar quirky, emotional, and slightly unconventional vibe. \n\nAny recommendations for shows with complex, bold female leads and that mix of humor, romance, and depth? Open to both international and English-language series!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6qk3q/similar_shows_to_love_anarchy_ive_watched_it_4/"
    },
    {
        "id": "1m6vfcm",
        "author": "gir-fire",
        "title": "Netflix with low volume what to do?",
        "content": "This solution worked for me on a Windows 10 PC: \n\nSettings &gt; System &gt; Sound &gt; Device Properties &gt; Additional Device Properties &gt; Enhancements &gt; Enable Virtual Surround and Loudness Equalization &gt; Apply &gt; OK.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6vfcm/netflix_with_low_volume_what_to_do/"
    },
    {
        "id": "1m6mcx2",
        "author": "Molybecks",
        "title": "Any true crime dramas coming soon? Like adaptations of real events",
        "content": "I know there’s the Monster series 3 production coming soon about Ed Gein. \n\nAnything else? I quite enjoyed The Staircase but that was on HBO. Anything similar?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m6mcx2/any_true_crime_dramas_coming_soon_like/"
    },
    {
        "id": "1m6e7he",
        "author": "ToonAdventure",
        "title": "NEW Pokémon Concierge Episodes 🏝️ | Coming September 4 to Netflix | Official Trailer",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6e7he/new_pokémon_concierge_episodes_coming_september_4/"
    },
    {
        "id": "1m6srqa",
        "author": "link7626",
        "title": "Any way to revert to old UI",
        "content": "Im actually disgusted by the new ui of netflix to the point im about to cancel it.  Ive called support they said they will contact me but im ghosted.  The new interface is possibly the worse of all the options now hen the old format was so much easier to find something new. \n\nEdit: forgot to mention its on a samsung neo qled",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m6srqa/any_way_to_revert_to_old_ui/"
    },
    {
        "id": "1m6i9g7",
        "author": "Zealousideal_Map5074",
        "title": "Is Mask Girl (2023) worth watching?",
        "content": "I clicked play just because the banner looked cool, the genre is thriller and my favorite actor Lee Jun‑young is in it. Someone on Reddit told me it’s a thriller with plot twists, which got me interested. But before I go in too deep, is this a slow burn?\n\nI usually get bored if a show takes too long to get to the point, so I’d love to know what to expect.",
        "upvotes": 3,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1m6i9g7/is_mask_girl_2023_worth_watching/"
    },
    {
        "id": "1m6axnb",
        "author": "sky3cabe",
        "title": "Any zombie movie recommendations?",
        "content": "Ok I can't find other zombie movies bc I feels like I already watched them all(idk whenever I search zombie, they always appear the one I already watched). So do u guys have any zombie movie recommendations? I only want movies not series since I don't have time to invest in the series. Also I prefer if its English, Korean or Japanese movie(since I understand the language).\n\nThanks in advanced😊\n\nEdit: just tell the movie u hv in mind n I'll reply if I already watch it or not. Thank you again ☺️",
        "upvotes": 8,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1m6axnb/any_zombie_movie_recommendations/"
    },
    {
        "id": "1m6uotx",
        "author": "homo-globin",
        "title": "Anyone else think UNTAMED was written by AI?",
        "content": "I just think the whole script is made by AI. Like I can see the writer pitting these scenes into ChatGPT and putting whatever it vomited into screen.\n\nThe writing is not bad, it just feels lifeless and predictable. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m6uotx/anyone_else_think_untamed_was_written_by_ai/"
    },
    {
        "id": "1m6p741",
        "author": "UzumakiShanks",
        "title": "Go on an epic adventure with Netflix’s “The Sea Beast”",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6p741/go_on_an_epic_adventure_with_netflixs_the_sea/"
    },
    {
        "id": "1m6f7ho",
        "author": "hpff_robot",
        "title": "Rivers of Fate | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f7ho/rivers_of_fate_official_trailer_netflix/"
    },
    {
        "id": "1m5ghm8",
        "author": "Longjumping_Land_977",
        "title": "What do you guys think of the ‘photos’ of Amy Bradley found in 2005?",
        "content": "Could they be her? I personally think they are, which must be truly awful for her family. It’s so sad the FBI couldn’t look into this more and that it’s been dropped. ",
        "upvotes": 372,
        "comments": 798,
        "media": null,
        "permalink": "/r/netflix/comments/1m5ghm8/what_do_you_guys_think_of_the_photos_of_amy/"
    },
    {
        "id": "1m5dw1j",
        "author": "waynejohnson1985",
        "title": "A Netflix original that completely exceeded your expectations?",
        "content": "I just finished watching *The Platform* and honestly went in without expecting much. Maybe just another dystopian thriller. But wow, it completely blew me away. The concept was so unique, and the social commentary was intense without feeling forced. I didn’t think it would stick with me the way it did, but days later I’m still thinking about it.\n\nHave any of you had a similar experience with a Netflix original that really surprised you (in a good way)? Would love to hear your picks.\n\n",
        "upvotes": 533,
        "comments": 468,
        "media": null,
        "permalink": "/r/netflix/comments/1m5dw1j/a_netflix_original_that_completely_exceeded_your/"
    },
    {
        "id": "1m6mg5z",
        "author": "Visual_Combination68",
        "title": "Netflix’s \"La Palma\" tsunami landslide: two geoscientists break down whether it could actually happen",
        "content": "Netflix included a pretty dramatic tsunami sequence in one of their recent docu-dramas  triggered by part of La Palma collapsing into the Atlantic. It’s not just fiction though; it’s based on a real 2001 paper by Ward &amp; Day that’s stirred up debate for years.\n\nTwo geoscientists made a video breaking it down. They look at whether the science behind the scenario holds up, what the original research actually said, and how newer studies view the risk.\n\n[https://youtu.be/x4D-xg4WhMw](https://youtu.be/x4D-xg4WhMw)\n\nCurious what others think. Is this something to take seriously or just another worst-case scenario that's unlikely to play out?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6mg5z/netflixs_la_palma_tsunami_landslide_two/"
    },
    {
        "id": "1m65h0s",
        "author": "hygge6",
        "title": "Not the horse 😭😭(Untamed)",
        "content": "The saddest part was Shane shooting Kyle’s horse 😭😭😭😭 but for real, animal deaths in tv/film always get me no matter how inconsequential they seem. Anyone else?",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m65h0s/not_the_horse_untamed/"
    },
    {
        "id": "1m6ocpf",
        "author": "bean3217",
        "title": "Customer service?",
        "content": "My netlix account was hacked and trying to resolve it has been a real challenge. I can't find a phone number or even email to contact netflix.  The only option I've found is a chat or call through their app. The call option requires that I allow the app to record audio on my phone. I dont want to give any app that permission. I'd just like a straight forward way to contact the company like a phone number. Any ideas out there?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m6ocpf/customer_service/"
    },
    {
        "id": "1m6tds8",
        "author": "MissBarker93",
        "title": "RANT: \"Your device isn’t part of the Netflix Household\" is BS.",
        "content": "This thing is just so, SO dumb. I just want to watch a movie at home or on my phone, but I CAN'T because whenever I try to get into Netflix, I get slapped with that stupid \"Your device isn’t part of the Netflix Household for this account\" screen. And I can't even do anything about it because the account is in my mom's email, and she's away at work most of the time, and I know that she doesn't want me to bug her while she's working just to ask for a Netflix login! This new feature is STUPID AND INCONVENIENT, and Netflix needs to ditch it ASAP.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m6tds8/rant_your_device_isnt_part_of_the_netflix/"
    },
    {
        "id": "1m6n44p",
        "author": "galeshe2",
        "title": "Why can't they just give shows the space to end properly",
        "content": "I have just finished re-watching the order and just like so many good shows get stopped mid plot also relevant to the likes of inside job and daybreak needing another season meanwhile the flash gets 10 and about 7 more then the writers know what to do with ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m6n44p/why_cant_they_just_give_shows_the_space_to_end/"
    },
    {
        "id": "1m6f7sq",
        "author": "Atlast_2091",
        "title": "Pokémon Concierge Season 2 | New Episodes Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f7sq/pokémon_concierge_season_2_new_episodes_trailer/"
    },
    {
        "id": "1m6f261",
        "author": "Establishment240",
        "title": "What's the ethereal song playing at 23:30 of the first episode of The Diamond Heist ?",
        "content": "What's the ethereal song playing at 23:30 of the first episode of The Diamond Heist ?   \n\nThanks :) Would be so cool if somebody could tell me. I would be very grateful :)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f261/whats_the_ethereal_song_playing_at_2330_of_the/"
    },
    {
        "id": "1m6eob9",
        "author": "aman_attar",
        "title": "Netflix on MacOS 2K Monitor",
        "content": "I recently treated myself to a gorgeous **2K monitor**, excited to finally watch movies and shows in crisp detail. But when I fired up **Netflix on Safari**, the picture looked... well, **awful**. Blurry, pixelated — nothing close to the HD experience I expected. 😩\n\nI double-checked my internet (blazing fast), display settings (perfect), and even tried different shows. Same fuzzy quality.\n\nThat led me down a **deep rabbit hole** of research, developer tools, hidden settings, and overrides. After hours of experimenting and tweaking, I finally found a **clean, repeatable way** to unlock Netflix’s **high bitrate playback** in Safari.\n\nIf you're also stuck with pixelated Netflix on your Mac and 2K display, here's the solution that worked wonders for me 👇\n\n# ✅ Step 1: Enable Developer Features in Safari\n\n1. Open Safari and go to **Settings &gt; Advanced**.\n2. At the bottom, check ✅ **“Show features for web developers.”**\n\n📸 *\\[Image 1\\]*\n\n[Image 1](https://preview.redd.it/h6qhgbuckfef1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=3232cdb46955a14e5a13688e5f0a746f05ff28d9)\n\n# 🔓 Step 2: Disable Cross-Origin Restrictions\n\n1. From the top menu bar, click **Develop &gt; Developer Settings**.\n2. Under “Security,” check ✅ **Disable cross-origin restrictions**.\n\n📸 *\\[Image 2\\]*\n\n[Image 2](https://preview.redd.it/6zxqz5bgkfef1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=9b982357b15b42ef078eb83cb2208bbff8dd9312)\n\n# 📥 Step 3: Download the Player Script Override\n\nDownload this custom script that overrides Netflix’s default playback behavior:  \n👉 [**cadmium-playercore-shim.js (GitHub)**](https://github.com/DavidBuchanan314/Turbo-Recadmiumator/blob/master/src/cadmium-playercore-shim.js)\n\nThis lets you **manually select the highest available bitrate** for each video.\n\n# ▶️ Step 4–9: Override Netflix’s Video Script\n\n1. **Play** any Netflix video.\n2. Go to **Develop &gt; Show Page Source**.\n3. In the **Sources** tab, look for the file named like `cadmium-playercore-*.js`. 📸 *\\[Image 3\\]*\n\n[Image 3](https://preview.redd.it/amwu29elkfef1.png?width=598&amp;format=png&amp;auto=webp&amp;s=5c1e03f0048074721b4d4a11f2590347bc7c92e1)\n\n**4. Right-click** the file and choose **“Create Response Local Override.”**\n\n5. Then click **“Map to File”** and choose the downloaded script.\n\n**6. Refresh** the Netflix tab.\n\n7. A new bitrate selector UI will appear. 📸 *\\[Image 4\\]*\n\n[Image 4](https://preview.redd.it/8iw7fx3skfef1.png?width=4832&amp;format=png&amp;auto=webp&amp;s=bc7a3603036450de6708a1f4c63cc2aadd8a4641)\n\n8. Hit **“Override”** and enjoy **buttery-smooth, sharp video**.\n\n# 🔁 Step 10: Repeat on Every Safari Restart\n\nSafari clears overrides after closing. So you'll need to repeat steps 4–9 each time you reopen Safari. It takes \\~30 seconds once you're used to it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6eob9/netflix_on_macos_2k_monitor/"
    },
    {
        "id": "1m624wl",
        "author": "PuzzleheadedKiwi7107",
        "title": "I have some questions when Netflix still mailed discs",
        "content": "When Netflix used to mail discs, specifically from 2015-2023, were the discs just of the show/movie or were they like actual discs with bonus features and everything?\n\nThis is a weirder question and if no one knows, that's perfectly okay. How specifically did you order these discs? Was it a separate site? Were there any hoops you had to jump through?\n\nDid any one of you rent The Adventures of Puss in Boots (2015)? If so, did it have the bonus features in the image? If any of you still have the discs (DVD or blu ray), would you be willing to sell them to me?\n\nhttps://preview.redd.it/i7mqedqy4cef1.jpg?width=6141&amp;format=pjpg&amp;auto=webp&amp;s=3202c55dd884d5d3bb8ff2adbc2791de9129aa3d\n\n",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m624wl/i_have_some_questions_when_netflix_still_mailed/"
    }
]