[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kwjcmk",
        "author": "Ok_Yellow4742",
        "title": "[BICICLETTA RUBATA]",
        "content": "**\\[BICICLETTA RUBATA\\] Surly Cross Check arancione brillante – Rubata vicino al Parco del Valentino**\n\nCiao a tutti,  \nscrivo nella speranza che qualcuno in questa community possa aver visto o sentito qualcosa.\n\nNella notte del **\\[inserire data del furto\\]**, mi è stata **rubata la bicicletta mentre dormivo nel Parco del Valentino**. È una bici molto riconoscibile: una **Surly Cross Check arancione brillante**, con le seguenti caratteristiche:\n\n* Pneumatici gravel\n* Nastro manubrio nero\n* Freni da touring (cantilever) e freni al manubrio standard\n* **Portapacchi posteriore Topeak**\n* Porta borraccia e supporto per lucchetto nel triangolo centrale del telaio\n\nEra caricata con tutta la mia attrezzatura, dato che ero quasi alla fine di un viaggio in bici di un mese attraverso l’Italia, pronto a tornare in Francia.\n\nHo sporto denuncia alla polizia, ma mi hanno detto che le possibilità di ritrovarla sono poche.  \nSe **qualcuno vede una bici con questa descrizione**, soprattutto in vendita online, vi prego di scrivermi o rispondere a questo post.\n\nGrazie mille! 🙏",
        "upvotes": 22,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/okix6kiqra3f1.jpeg?auto=webp&amp;s=427f925fa4bb93741ddba5b071ed0149a9f33712"
        },
        "permalink": "/r/torino/comments/1kwjcmk/bicicletta_rubata/"
    },
    {
        "id": "1kwlxqj",
        "author": "NomeUtente86",
        "title": "Un posto dove mangiare grigliata fatta bene?",
        "content": "Ciao a tutti, Domenica 9 per il mio compleanno ho pensato di farmi una camminata in montagna e una cena tra amici.\nVolevo andare a farmi una scorpacciate di carne...\nMa il posto dove andavo io è chiuso, mi sapete indicare un agriturismo o ristorante dove possa andare a mangiare una grigliata fatta bene magari con la formula all you can eat? Torino e zone limitrofe... Grazie mille",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1kwlxqj/un_posto_dove_mangiare_grigliata_fatta_bene/"
    },
    {
        "id": "1kwlagx",
        "author": "AdRoutine9042",
        "title": "Migliorare parcheggio in città",
        "content": "Hai mai perso tempo cercando parcheggio?  \nO hai un box auto che rimane spesso inutilizzato?\n\n🧭 L’idea è semplice: una piattaforma che connette **chi cerca parcheggio** con **chi ha uno spazio privato da affittare**, anche solo per poche ore.\n\n📋 Ti va di darci una mano? Bastano 2 minuti:\n\n* **Sei un guidatore?** 👉 [https://docs.google.com/forms/d/e/1FAIpQLScV5ICl13fSmFR2Gy23okPvmBvpHNK5A2ee\\_Qde73G-D-uaRA/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLScV5ICl13fSmFR2Gy23okPvmBvpHNK5A2ee_Qde73G-D-uaRA/viewform?usp=dialog)\n* **Hai un box auto?** 👉 [https://docs.google.com/forms/d/e/1FAIpQLScvCSw6phbyROfHM8EnZ63-hAdTY2QvnfvIntzJs61gF6V6zQ/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLScvCSw6phbyROfHM8EnZ63-hAdTY2QvnfvIntzJs61gF6V6zQ/viewform?usp=dialog)\n\nOgni risposta ci aiuta a costruire un servizio utile, reale ed efficiente. Grazie!",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lGibteFegwDZvIQTWPYV_xxQV3eeymaEN_CGwfVEeJw.jpg?auto=webp&amp;s=0f94b355213b6e98f74e525bf5df7147cb594c95"
        },
        "permalink": "/r/torino/comments/1kwlagx/migliorare_parcheggio_in_città/"
    },
    {
        "id": "1kwin6n",
        "author": "Leading-Complex-7828",
        "title": "dove comprare jeans baggy con texture particolari",
        "content": "il titolo è già autoesplicativo, sto cercando un posto a torino (o anche pagine instagram, siti affidabili) da cui comprare jeans baggy con texture particolari (non voglio jeans totalmente blu o neri).\nquindi toppe, cuciture o trame particolari che li rendano diversi dal solito.\novviamente essendo un poveraccio preferirei non costassero per forza 70 euro a paio ma qualcosa di più economico.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kwin6n/dove_comprare_jeans_baggy_con_texture_particolari/"
    },
    {
        "id": "1kw2x3k",
        "author": "CryingAlwaysCrying",
        "title": "Parco Sempione: un gioiello verde lasciato al degrado",
        "content": "È assurdo che uno degli unici parchi della Zona Nord sia ridotto a un parcheggio e a un rifugio per drogati. Ogni volta che passo di lì vedo macchine ovunque, siringhe a terra, persone fuori controllo. \n\nhttps://preview.redd.it/xilq9dnse63f1.png?width=672&amp;format=png&amp;auto=webp&amp;s=4f5c9c46379d035d80a42d965916d530d2dca7da\n\nAbbiamo uno spazio verde che potrebbe essere un fiore all'occhiello della città e invece sembra una terra di nessuno.   \n  \nÈ possibile che non si possa fare nulla? Il degrado è totale",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kw2x3k/parco_sempione_un_gioiello_verde_lasciato_al/"
    },
    {
        "id": "1kw7irq",
        "author": "Puzzleheaded_Mix7649",
        "title": "Club tecno e musica elettronica aperti d'estate",
        "content": "Salve, volevo chiedere se qualcuno potesse consigliarmi qualche locale o serata tecno (o musica elettronica in generale) estiva, dopo il 20 Luglio. Da quel che so, locali come Azimut e Audiodrome dovrebbero chiudere per la pausa estiva a partire già da metà Luglio.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kw7irq/club_tecno_e_musica_elettronica_aperti_destate/"
    },
    {
        "id": "1kwhhzv",
        "author": "Intelligent-Bell-120",
        "title": "conoscete un Video Maker Per eventi?",
        "content": "Stiamo cercando un videomaker per un evento techno il 7 giugno, preferibilmente con esperienza. Se sei interessato o conosci qualcuno, facci sapere",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kwhhzv/conoscete_un_video_maker_per_eventi/"
    },
    {
        "id": "1kvqbok",
        "author": "RandomNerdGuy95",
        "title": "Costo affitti a Torino",
        "content": "Probabilmente mi sta sfuggendo qualcosa ma davvero non riesco a capire come un bilocale o poco più possa costare &gt;1000 euro/mese, a volte escluso di spese condominiali e utenze varie. Si parla di più di 20 euro al m2. Lo trovo semplicemente assurdo per un immobile di questo tipo in affitto.\n\nAlcuni esempio che ho trovato:\n\n* [https://www.immobiliare.it/annunci/120510656/?entryPoint=related#foto4](https://www.immobiliare.it/annunci/120510656/?entryPoint=related#foto4)\n* [https://www.immobiliare.it/annunci/120453142/?entryPoint=related#foto7](https://www.immobiliare.it/annunci/120453142/?entryPoint=related#foto7)\n* [https://www.immobiliare.it/annunci/116899909/?entryPoint=related#foto5](https://www.immobiliare.it/annunci/116899909/?entryPoint=related#foto5)\n* [https://www.immobiliare.it/annunci/120753194/](https://www.immobiliare.it/annunci/120753194/)\n* [https://www.immobiliare.it/annunci/116863097/](https://www.immobiliare.it/annunci/116863097/)\n\nCosa ne pensate? Sono io fuori dal mondo?\n\n  \nEdit: so che esistono tante altre zone di torino con appartamenti a 500/600 euro. Trovo in ogni caso assurdo che un bilocale da 50 m2 costi 1000-1200 euro al mese. Capisco la zona, ma credo sia comunque un'esagerazione.",
        "upvotes": 26,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1kvqbok/costo_affitti_a_torino/"
    },
    {
        "id": "1kvw0ii",
        "author": "lospaesato",
        "title": "Mi trasferisco a Torino a breve: cerco consigli da chi ci vive",
        "content": "Ciao a tutti! Scrivo perché sto per trasferirmi a Torino da Napoli, con l’obiettivo di costruire una vita stabile insieme alla mia ragazza che vive già lì. Ho 23 anni, sono diplomato in informatica e attualmente sto terminando un corso per diventare tornitore e fresatore CNC, con qualifica prevista per inizio luglio.\n\nQuello che vi chiedo è:\n\nAvete nomi di aziende serie nel settore CNC/metalmeccanico/aeronautico che cercano personale o che vale la pena tenere d’occhio? Ci sono agenzie interinali o canali specifici in zona per trovare lavori nel mio settore? Qualsiasi altro consiglio utile per chi si trasferisce a Torino per lavorare\n\nGrazie a chiunque risponderà! 🙏 Apprezzo molto ogni consiglio, esperienza o dritta.",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1kvw0ii/mi_trasferisco_a_torino_a_breve_cerco_consigli_da/"
    },
    {
        "id": "1kvwz9s",
        "author": "DelusionalPanda-",
        "title": "Where to buy proper Italian coffee",
        "content": "Hey guys, I’m planning to buy some proper Italian blend coffee if this is the right way to put it. Could you suggest some places? Like a roastery or coffee shop\n\nP.S. I’m really out of my wheelhouse here. Sorry for misused terms😅\n\nUpdate: When I said proper Italian coffee, I meant if there is this specific blend that represents it but it probably doesn’t exist since it’ll change from shop to shop, I assume.\n\nUpdate 2: If you’re a coffee enthusiast who knows a good deal about it and you say: “I would definitely buy this/that if I were to gift it to someone as a gift from Italy”, please suggest that. Thank you!",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1kvwz9s/where_to_buy_proper_italian_coffee/"
    },
    {
        "id": "1kw0hgy",
        "author": "eventi_del_tano",
        "title": "Karaoke a chi piace?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kw0hgy/karaoke_a_chi_piace/"
    },
    {
        "id": "1kvr5gj",
        "author": "Intelligent-Bell-120",
        "title": "Cerco Ravers a torino per after di Pride",
        "content": "Chi è in cerca di un rave techno underground dopo il Torino Pride del 7 giugno?  \nConosco una festa semi-privata con DJ fighissimi che suonano hard techno e hardcore. Scrivetemi se vi interessa 👀🔥",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kvr5gj/cerco_ravers_a_torino_per_after_di_pride/"
    },
    {
        "id": "1kvogc2",
        "author": "Cursive_S",
        "title": "Is the agency Casa In Un Click real? Has anyone worked with them?",
        "content": "I'm going to study in polito soon, and I need to find a place to stay, and so far I've settled on a apartment under the agency Casa In Un Click. But as soon as I contacted them, they say I have to pay 250€ service fee (Which is normal for real estate agencies in turin?) Then the apartment on the site got taken down, I asked them is it no longer available? I have saved other rooms in my wishlist but they are under different agencies, I can't pay 250€ everytime I inquire for another apartment. They told me it's still on another website and won't answer directly whether it's still available or not until I paid the fee. I'm scared I'm gonna get scammed",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1kvogc2/is_the_agency_casa_in_un_click_real_has_anyone/"
    },
    {
        "id": "1kvvfsy",
        "author": "No-More-Blue",
        "title": "Rimozione nei a poco?",
        "content": "Ciao! Abito in zona Torino centro e recentemente mi stavo chiedendo dove potrei effettuare la rimozione di un neo che da tempo mi dà noia, senza spendere un capitale, qualcuno saprebbe aiutarmi? Grazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kvvfsy/rimozione_nei_a_poco/"
    },
    {
        "id": "1kvy1cd",
        "author": "No-Ant-9038",
        "title": "Posti per fumare in crocetta-nord?",
        "content": "Avrei bisogno di posti con poca gente e buon predisposti per fumarsi una cannetta nel chill. Se in crocetta-nord ancora meglio, cosi non devo muovermi troppo",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kvy1cd/posti_per_fumare_in_crocettanord/"
    },
    {
        "id": "1kv8158",
        "author": "onofriol",
        "title": "Garlic cheese bread/pizza",
        "content": "[Mission Impossible]\n\nQualcuno sa dove trovare pizza all'aglio a Torino o nei dintorni?\n\nCome base classico impasto di pizza o semplice pane, sopra come condimento formaggio filante (la classica \"mozzarella\" americana) e tanto aglio che viene cotto e poi unito a burro/olio fino a diventare una crema.\n\nCredo sia un piatto che abbia orgini italo-americane, io l'ho scoperto e amato in Iran lol.\n\nOrmai è diventata un'ossessione; ovunque rimanga per un periodo un po' più lungo la cerco ma non ho mai avuto successo.\n\nSe qualcuno ha visto qualcosa di simile nei menù di pizzerie/altro a Torino fatemi sapere!\n(fatemi sapere anche se la conoscete, a chiunque chieda non sa neanche di cosa stia parlando)\n\nGrazie in anticipo per ogni dritta!",
        "upvotes": 7,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jdcca4pjqy2f1.jpeg?auto=webp&amp;s=1cddc36c67e90e8455e70202219c5e15ea6b649c"
        },
        "permalink": "/r/torino/comments/1kv8158/garlic_cheese_breadpizza/"
    },
    {
        "id": "1kuzaoq",
        "author": "Creative-Fig-4963",
        "title": "Questa zona(santa rita)è sicura per vivere?",
        "content": "Ciao a tutti, ho una domanda: questa zona(santa rita) è sicura per viverci e anche per parcheggiare l'auto in strada?",
        "upvotes": 23,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g5lqodedmw2f1.png?auto=webp&amp;s=89202986d6c295c9762db876045d33f7ea62bc95"
        },
        "permalink": "/r/torino/comments/1kuzaoq/questa_zonasanta_ritaè_sicura_per_vivere/"
    },
    {
        "id": "1kukzc9",
        "author": "PayFun8250",
        "title": "What’s happening tonight?",
        "content": "I’m currently staying in apartment on Via Francesco Cigna, and at around 7pm music started playing out of speakers on the street posts; there’s now a procession as well. Any idea as to what’s happening?",
        "upvotes": 71,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nygl3x6ghs2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1kukzc9/whats_happening_tonight/"
    },
    {
        "id": "1kut1xd",
        "author": "Background-Chest-717",
        "title": "I have guest soon.Can you suggest me bars/cafes ?",
        "content": "Most incredible bars and cafes ",
        "upvotes": 11,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l3f8yqsdku2f1.jpeg?auto=webp&amp;s=a6eeb9e0a28a0f1845dbc1c1d1082f59e63c3308"
        },
        "permalink": "/r/torino/comments/1kut1xd/i_have_guest_sooncan_you_suggest_me_barscafes/"
    },
    {
        "id": "1kv0ze0",
        "author": "system_4nomaly",
        "title": "Cercasi amici tiratori",
        "content": "In breve: sto cercando qualcuno con cui  andare a sparare al poligono di Torrazza o altri campi da tiro nei pressi della città, vorrei cominciare a praticare IDPA ma non avendo la patente è un casino. Se c'è qualcuno che vuole allenarsi in compagnia, mi faccia un fischio!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kv0ze0/cercasi_amici_tiratori/"
    },
    {
        "id": "1kuj3r4",
        "author": "Southern_Fly5500",
        "title": "come trovare il quartiere adatto",
        "content": "Ciao scrivo per chiedere a chi vive quotidianamente a torino e nei vari quartieri.  \nsto cercando casa per me, mia madre over 70 e animali domestici (gatti).  \nal momento ci troviamo in barriera e siamo stati 6 anni tra cui lock down e altro fin adesso non abbiamo avuto problemi. Non sono tipo che esce tutte le sere, di fatti sono piu un nerd.  \nnella ricerca della casa, facciamo fatica a trovare un quartiere che abbia le stesse cose di barriera (tranne lo spaccio e la criminalità), ovvero un mercato come piazza foroni, mezzi vicini, posta, negozio di animali come arcaplanet, medico. mi trovo in difficoltà a trovare un quartiere adatto sopratutto per mia madre.  \nnon usiamo l'auto e preferiamo andare a piedi a fare la spesa e tornare a casa.  \nleggo inoltre che c'e una forte riqualificazione del quartiere.   \nla mia richiesta è ci sono quartieri simili a barriera senza delinquenza che un anziana puo uscire la notte in caso di emergenza senza problemi?\n\nper correttezza del fatto che non abbiamo avuto rogne, aggiungo che mia mamma passerebbe per straniera e io per uno del magreb.",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1kuj3r4/come_trovare_il_quartiere_adatto/"
    },
    {
        "id": "1kulucw",
        "author": "LucaScams",
        "title": "Amicizie a Torino",
        "content": "Ciao, sono un ragazzo di 25 anni che si è da poco trasferito a Torino e non conosco nessuno :( \nCerco gente nella mia stessa condizione o comunque persone con cui poter fare amicizia, uscire per mangiare qualcosa o andare a far serata. Amo la techno o serate hip hop, se siete gente di mentalità chiusa, perfettini o che giudicano il prossimo con facilità fate finta di non aver letto nulla ✌🏼",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kulucw/amicizie_a_torino/"
    },
    {
        "id": "1kugh34",
        "author": "Tasty-Display8133",
        "title": "dove posso acquistare una fresca monster rehab (torino e provincia)",
        "content": "Credo di aver girato tutti i carrefour possibili ed immaginabili se qualcuno ne vede / ne ha vista qualcuna in vendita scrivetelo qua sotto grazie",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kugh34/dove_posso_acquistare_una_fresca_monster_rehab/"
    },
    {
        "id": "1ktjofi",
        "author": "brutale800",
        "title": "Compleanni torinesi a pagamento",
        "content": "Ciao, per chi non lo sapesse perché è di fuori, a Torino e immagino in Piemonte in generale, quando vi invitano a cena/pranzo per un compleanno dovete pagarvi da mangiare e da bere oltre a fare il regalo. Dico ciò perché molti arrivano impreparati a situazioni simili aspettandosi che se ti invitano è implicito che ti offrono e tu fai solo il regalo. Qua non è così. Le eccezioni avvengono solo (e sempre a carattere eccezionale) in contesti familiari. Tutto ciò che invece riguarda colleghi, amici, conoscenti etc, se ti invitano al compleanno devi pagarti la cena. \nCosa ne pensate?",
        "upvotes": 68,
        "comments": 153,
        "media": null,
        "permalink": "/r/torino/comments/1ktjofi/compleanni_torinesi_a_pagamento/"
    },
    {
        "id": "1ku7z1l",
        "author": "Standard_Meal_6973",
        "title": "Qualcuno zona Orbassano/Stupinigi stasera ore 18:30 per bella sega in compagnia? Io m 22",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ku7z1l/qualcuno_zona_orbassanostupinigi_stasera_ore_1830/"
    },
    {
        "id": "1kt7uwp",
        "author": "333sjm333",
        "title": "Trasferimento a Torino: quali quartieri consigliate?",
        "content": "Ciao gente!  \nSono una ragazza che ha vissuto in Emilia Romagna (Cesena), poi mi sono trasferita in Argentina, ma adesso vorrei tornare in Italia… più precisamente a Torino! L’idea è andare a vivere da sola.. essere indipendente e ricominciare lì.  \nVolevo chiedervi una mano: che quartieri mi consigliate per vivere? Cerco una zona tranquilla, non pericolosa e dove gli affitti non siano esagerati. Se è ben collegata, ancora meglio! E se c’è qualcunə dell’Argentina che vive già a Torino, mi farebbe super piacere parlarne e magari fare amicizia!  \nSe vi piace Zelda, i videogiochi o il rock/metal… potremmo andare d’accordissimo!  \nSaluti! e grazie per leggere",
        "upvotes": 26,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1kt7uwp/trasferimento_a_torino_quali_quartieri_consigliate/"
    },
    {
        "id": "1ktq0g2",
        "author": "Repulsive-Yak-126",
        "title": "PC clubs",
        "content": "Ciao tutti, is there any PC clubs here in Torino, I'm looking for smth like a gaming club",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ktq0g2/pc_clubs/"
    },
    {
        "id": "1ktgn02",
        "author": "BroqueviNEGAR",
        "title": "Need Advice with my Application to Unito",
        "content": "I recently received an update from the Univers ity of Turin regarding my application for the Economics, Finance and Data Science program. Unfortunately, due to a high number of applications and limited quota seats, my admission couldn't be processed further. \n\nI'm feeling a bit stuck and would really appreciate your advice.\n\nls it possible for me to apply now for the Business &amp; Management program instead? Or would it be wiser to wait for the July intake and try again for my original choice?\n\n If anyone has faced a similar situation or has insight into how flexible the university is with switching programs (or general advice on navigating this), please share your thoughts.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ktgn02/need_advice_with_my_application_to_unito/"
    },
    {
        "id": "1ksja45",
        "author": "minoriso",
        "title": "Franchino Er Criminale a Torino: delusione totale",
        "content": "Ragazzi, ormai è chiaro: da quando Franchino Er Criminale è \"salito al nord\", qualcosa si è rotto.\n\nOgni volta che ha consigliato un posto a Torino, ci sono andato con aspettative alte e ne sono sempre uscito deluso. Locali mediocri, esperienze banali, posti che definire “criminali” è un insulto al suo stesso personaggio. Ma il problema non è solo la qualità delle scelte, è il modo in cui racconta Torino: una città vista con gli occhi del fuorisede con soldi, non del lavoratore vero.\n\nFranchino si riempie la bocca di proletariato, ma è il primo a comportarsi da classista: basta vedere come tratta le zone più popolari o periferiche, cioè quelle non gentrificate o frequentate da studenti universitari. Ci ha messo piede giusto per dire \"vabbè, ci sono stato\", giusto per far numero. Pochi posti citati, video tirati via, tono annoiato. E magari proprio lì c’era qualcosa di più autentico da raccontare.\n\nContribuisce a una visione distorta di Torino, fatta solo di spritz, panini gourmet e street food fighetto nei quartieri universitari. Ma questa città è anche (soprattutto) fatica, precarietà, disoccupazione. Non lo dico io: Draghi stesso disse che Torino ha i numeri occupazionali di una città del Sud. Eppure questa realtà non traspare mai dai suoi video.\n\nE come se non bastasse, il \"proletario\" decide di aprire una \"osteria\" non in periferia o in un quartiere popolare, ma nel Quadrilatero Romano, una delle zone più gentrificate, turistiche e care della città. Un’area già satura di locali simili, dove l’ennesimo posto da 15 euro a piatto non cambia nulla, anzi, contribuisce alla bolla. Ma va bene così, purché faccia scena su Instagram.\n\nIl problema è che non gli si può nemmeno fare una critica costruttiva, perché lui – e alcuni suoi colleghi – si comportano come i padri eterni del cibo: intoccabili, infallibili, oltre il bene e il male. Ma la verità è che mangiare bene non basta per raccontare una città.\n\n\n📝 Postilla alla Franchino:\nQuesta è un'opinione personale, dettata dalla mia esperienza e sensibilità. Non sto parlando in modo oggettivo e non voglio insegnare nulla a nessuno. Se a qualcuno piace, buon per lui.",
        "upvotes": 344,
        "comments": 158,
        "media": null,
        "permalink": "/r/torino/comments/1ksja45/franchino_er_criminale_a_torino_delusione_totale/"
    },
    {
        "id": "1ktgtgt",
        "author": "BoogieStopShuffle",
        "title": "Inspirational places in the field of child pedagogy?",
        "content": "Buongiorno, Torinese! \n\nI'm visiting Turin for a full week and have some time on my hands. I work in child pedagogy and I'm looking for inspiration during my trip. What are some good places to visit?\n\nI'm particularly interested in schools, museums, playgrounds, youth centers—anything related to children between the ages of 2.5 and 12, both in formal education and leisure activities. \n\nI am also looking for activities I can enjoy with my one year old. \n\nGrazie mille per il vostro aiuto!\n \n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ktgtgt/inspirational_places_in_the_field_of_child/"
    }
]