[
    {
        "id": "1lcwoxq",
        "author": "SonyPictures",
        "title": "Danny Boyle Here: Ask Me Anything.",
        "content": "Hello Reddit! Director Danny Boyle here. \n\nI'm back, and I’m excited to answer your questions about my new film 28 Years Later. It's starring Aaron Taylor-Johnson, Jodie Comer and Ralph Fiennes and is out in UK cinemas on June 19th and US movie theatres on June 20th. \n\nI'll be online from 5pm BST on Tuesday June 17th - drop your questions below and I hope to answer as many as I can. Speak soon!\n\nhttps://preview.redd.it/ro4j9kivca7f1.jpg?width=788&amp;format=pjpg&amp;auto=webp&amp;s=391f46c6bc5fb615d471e7a15d601d977e765eb9\n\n\n\n&gt;Director Danny Boyle here. Hello Reddit! Thanks for participating in the AMA about my new film 28 Years Later. Catch it in UK, cinemas June 19th, in US movie theatre June 20th.",
        "upvotes": 1059,
        "comments": 611,
        "media": null,
        "permalink": "/r/movies/comments/1lcwoxq/danny_boyle_here_ask_me_anything/"
    },
    {
        "id": "1ldorjo",
        "author": "BigFootAMA",
        "title": "Hi /r/movies! - I faked a murder. I faked a Bigfoot hoax. I faked a town. Then I edited it to look\nlike a 1978 documentary. It's called The Town That Cried Bigfoot. AMA.",
        "content": "Hi r/movies,\n\nI’m Mark Dossett, creator of The Town That Cried Bigfoot — a lost 1978 documentary about a small-town Bigfoot hoax that spirals into murder. But the deeper you dig, the stranger it gets —because none of it’s real. Not even the town.\n\nI built this film completely backward — starting with real 1970s news footage I found, then reverse-engineering a fictional murder, a cryptid hoax, and a made-up southern town buried inside real news footage.\n\nLet’s just say... if you Google “Weyburn, Virginia” while watching, you might start to question what’s real and what isn’t.\n\nAsk me anything about editing the truth into lies, creating fake towns, tricking Google, Bigfoot folklore, Blair Witch-style worldbuilding, or how the hell any of this even worked. Or anything else you want to discuss.\n\n**Film info:**\n\nThe Town That Cried Bigfoot\n\nGenre: Faux Documentary / Mystery / True Crime (kinda sorta)\n\nRuntime: 47 minutes\n\nWritten, Directed &amp; Edited by: Mark Dossett\n\n**Synopsis**:\n\nIn the winter of 1978, four desperate councilmen in Weyburn, Virginia staged a fake Bigfoot sighting to save their town from economic ruin. The plan worked — until someone turned up dead.\n\nBut here’s the kicker— none of this ever happened. The footage is real. The town is fake. The hoax is real enough to show up on MapQuest. This is a hoax within a hoax — crafted to feel like a lost documentary buried in public access archives.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=Mnpr9EBMhsg](https://www.youtube.com/watch?v=Mnpr9EBMhsg)\n\n**Where to Watch:**\n\nAmazon Prime Video: [https://www.amazon.com/dp/B0DXDM6RLN](https://www.amazon.com/dp/B0DXDM6RLN)\n\nGumroad (Download the full film for $5 and support the filmmaker):\n\n[https://1978bigfoot.gumroad.com/l/film](https://1978bigfoot.gumroad.com/l/film)\n\nOfficial Merch: [https://weyburn-shop.fourthwall.com](https://weyburn-shop.fourthwall.com)\n\nAlso streaming on select free platforms: Stash TV, Fawesome TV, and Xumo.\n\nAsk me anything! I'll be back tomorrow (Wednesday 6/18) at 5 PM ET to answer any questions.\n\n",
        "upvotes": 80,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/olr6ueucxh7f1.png?auto=webp&amp;s=2e3f1ab32f1a11a8b1e23778e526dad732d11672"
        },
        "permalink": "/r/movies/comments/1ldorjo/hi_rmovies_i_faked_a_murder_i_faked_a_bigfoot/"
    },
    {
        "id": "1ldwikw",
        "author": "MarvelsGrantMan136",
        "title": "‘Harold &amp; Kumar’ Getting New Sequel as ‘Cobra Kai’ Creators Ink Deal to Write, Direct",
        "content": "",
        "upvotes": 2340,
        "comments": 215,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lu8enQOUGUNQDoleTNk8JDdIrxmUrbfcdozgvjap5pc.jpeg?auto=webp&amp;s=f47962a49b18ea5172fd48d20c1eb8e2eeb4baee"
        },
        "permalink": "/r/movies/comments/1ldwikw/harold_kumar_getting_new_sequel_as_cobra_kai/"
    },
    {
        "id": "1ldo7i5",
        "author": "buttatoad",
        "title": "Movies that changed real life behavior",
        "content": "Thinking along the lines of Final Destination 2 with the logs falling off the truck and landing onto cars (one decapitating the state trooper). Ever since, people have tried to get away from being behind these vehicles.\n\nWhat are more examples where movies have actually changed how people behave in their own lives?",
        "upvotes": 5554,
        "comments": 2805,
        "media": null,
        "permalink": "/r/movies/comments/1ldo7i5/movies_that_changed_real_life_behavior/"
    },
    {
        "id": "1ldzo4u",
        "author": "StevenSanders90210",
        "title": "David Zaslav’s Pay To Be “Substantially” Lowered Ahead Of Split, WBD Says, But CEO Will Still Reap Rewards",
        "content": "",
        "upvotes": 810,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sdGJbAJ1bFxV97GWUQTKjfNrGVkcD46kB2mr0IuqJg4.jpeg?auto=webp&amp;s=a6b46638974a7a13ea7c8afa5ba9c0bb1a1e85a2"
        },
        "permalink": "/r/movies/comments/1ldzo4u/david_zaslavs_pay_to_be_substantially_lowered/"
    },
    {
        "id": "1ldu474",
        "author": "MarvelsGrantMan136",
        "title": "Tom Cruise, Dolly Parton, Debbie Allen and Wynn Thomas to Be Presented Honorary Oscars",
        "content": "",
        "upvotes": 1279,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QsunnDvMX6dlOav91ZTrX-24wk2tOh2_rJiIPdlIHaU.jpeg?auto=webp&amp;s=11e59421626c5d12614a3c8b56da5005d83d81af"
        },
        "permalink": "/r/movies/comments/1ldu474/tom_cruise_dolly_parton_debbie_allen_and_wynn/"
    },
    {
        "id": "1ldv3jn",
        "author": "CreatorSearchInsight",
        "title": "What is an often cited 'movie fact' or 'myth' that just isn't true?",
        "content": "For example:  \n*'Heath Ledger (as the Joker) improvised during the hospital scene when the button didn't set the explosives off as it should've, proving his amazing acting and quick thinking.' (The Dark Knight, 2008)*\n\nOften cited, but not based in fact at all with no reputable source ever proving it so. I believe it's actually even been disproven at this point, but the myth has spread further than the truth.\n\nWhat are some other examples?",
        "upvotes": 990,
        "comments": 759,
        "media": null,
        "permalink": "/r/movies/comments/1ldv3jn/what_is_an_often_cited_movie_fact_or_myth_that/"
    },
    {
        "id": "1le13hr",
        "author": "DemiFiendRSA",
        "title": "‘Raised by Wolves’ Screenwriter Aaron Guzikowski to Pen ‘Death Stranding’ Animated Movie",
        "content": "",
        "upvotes": 464,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_nRhKjwmTKnfBTdv3YfYOffsCwW8jIB7ggMrysS3TjI.jpeg?auto=webp&amp;s=e9cbee6f10f42f04987d154772c5dad19dd0dc59"
        },
        "permalink": "/r/movies/comments/1le13hr/raised_by_wolves_screenwriter_aaron_guzikowski_to/"
    },
    {
        "id": "1ldns5e",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy-Fantasy 'Fucktoys' - A woman embarks upon a sex worker odyssey through Trashtown with her friends to break a terrible curse that has befallen her - SXSW Special Jury Prize winner.",
        "content": "",
        "upvotes": 1863,
        "comments": 289,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/skttqspgth7f1.jpeg?auto=webp&amp;s=52a6eb1b9f8bc6187b8f9dab2784fef2dc1cca43"
        },
        "permalink": "/r/movies/comments/1ldns5e/first_poster_for_comedyfantasy_fucktoys_a_woman/"
    },
    {
        "id": "1ldl571",
        "author": "BunyipPouch",
        "title": "First Image of Liam Neeson in Thriller 'Ice Road: Vengeance' - A sequel to the 2021 film 'The Ice Road', co-starring Fan Bingbing, it follows Neeson as he travels to Nepal to scatter ashes. While on a packed tour bus, he encounters Nepali mercenaries and must fight them off to protect the travelers.",
        "content": "",
        "upvotes": 2609,
        "comments": 528,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2zyv3a177h7f1.jpeg?auto=webp&amp;s=7369a0d3d4003dfc7dbb9d3701c7d5575c489b27"
        },
        "permalink": "/r/movies/comments/1ldl571/first_image_of_liam_neeson_in_thriller_ice_road/"
    },
    {
        "id": "1ldpegs",
        "author": "MarvelsGrantMan136",
        "title": "Tom Rhys Harries Lands Role Of ‘Clayface’ In DC Studios James Watkins Movie",
        "content": "",
        "upvotes": 742,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QsxslE2xjLvXqfPuZ0lkEnacTVb1EyGcovuiV1gZd6k.jpeg?auto=webp&amp;s=a61baba1715e7c7c9e284406a603bd16ad77ae15"
        },
        "permalink": "/r/movies/comments/1ldpegs/tom_rhys_harries_lands_role_of_clayface_in_dc/"
    },
    {
        "id": "1ldr27z",
        "author": "MarvelsGrantMan136",
        "title": "Pixar's ELIO - Review Thread",
        "content": "**Pixar's ELIO - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/elio): 82% (45 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/elio/): 61 (17 Reviews)\n\nReviews:\n\n[Variety](https://variety.com/2025/film/reviews/elio-review-pixar-1236433834/) (70):\n\n&gt;Elio is right at home in the Pixar catalog, but lacks those undeniable signs of intelligent life (wit, surprise and the capacity to expand the medium) that set the studio’s best work apart.\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/elio-review-pixar-disney-zoe-saldana-brad-garrett-1236292709/) (60):\n\n&gt;Elio feels just a tad too familiar in its sights and story beats to seem totally fresh.\n\n[IndieWire ](https://www.indiewire.com/criticism/movies/elio-review-disney-pixar-1235132832/)(58):\n\n&gt;Elio isn’t a bad time at the theaters — it’s pretty to look at, charming enough, and frequently funny. But by shying away from investing in where its main character is coming from, the movie makes his galactic adventures feel a bit weightless.\n\n[SlashFilm](https://www.slashfilm.com/1888624/elio-pixar-movie-review/) (75):\n\n&gt;The frenetic pace may keep kids hooked, but parents will appreciate the sequences when Elio hits the pause button and allows audiences to sit in the silence — of complicated ideas, of emotionally challenging conversations, and of the wonders around us we too often fail to appreciate.\n\n[Collider](https://collider.com/elio-review-pixar/) (70):\n\n&gt;But despite how charming and fun Elio is, it still falls prey to some of Pixar’s occasional problems. Yes, this is a story of intergalactic adventures and a wide universe of possibilities, but it still can get a bit convoluted at times.\n\n[The Guardian](https://www.theguardian.com/film/2025/jun/17/elio-review-pixar):\n\n&gt;Overall, it’s an entertaining bit of summer fun.\n\n[Empire](https://www.empireonline.com/movies/reviews/elio/) (80):\n\n&gt;Robert Zemeckis’ Contact for kids. A slow start gives way to a charming, visually inventive adventure that might just inspire a new generation of astronomers to look to the skies.\n\nFor centuries, people have called out to the universe looking for answers—in Disney and Pixar's all-new feature film *Elio*, the universe calls back! The cosmic misadventure introduces Elio, a space fanatic with an active imagination and a huge alien obsession. So, when he's beamed up to the Communiverse, an interplanetary organization with representatives from galaxies far and wide, Elio's all in for the epic undertaking. Mistakenly identified as Earth's leader, Elio must form new bonds with eccentric alien lifeforms, navigate a crisis of intergalactic proportions, and somehow discover who and where he is truly meant to be.",
        "upvotes": 580,
        "comments": 385,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SwfXxusvXy7Ao8MdZ6P4M1Oo9wgdtHzA7PueZge1YcE.jpeg?auto=webp&amp;s=54c4d99de75bdcb92d88299f08040bd28dc93ff7"
        },
        "permalink": "/r/movies/comments/1ldr27z/pixars_elio_review_thread/"
    },
    {
        "id": "1le3rdb",
        "author": "Proper-Ad7371",
        "title": "12 Angry Men: They almost convicted before even talking about the evidence",
        "content": "Just watched the original for the first time. Loved it, great acting, great story, and actually reminded me of the one time I actually was on a jury and convinced others to acquit because of doubt.\n\nThe thing that bothers me - they had 11-1 at first, then number 8 says some very unconvincing things about his doubts, then says he’ll change to guilty if nobody else switches. He was lucky the one guy joined him, otherwise the kid would have gotten the chair.\n\nThen he brings up all the holes in the evidence, and breaks the others one at a time. Why didn’t he do that before even the first vote? Or at least before agreeing to the second one? Much of the evidence was questionable, and he was clearly prepared to talk about it.\n\nOtherwise I loved it.",
        "upvotes": 110,
        "comments": 107,
        "media": null,
        "permalink": "/r/movies/comments/1le3rdb/12_angry_men_they_almost_convicted_before_even/"
    },
    {
        "id": "1ldqxf2",
        "author": "SanderSo47",
        "title": "Joseph Kosinski's 'F1' Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/f1_the_movie): 84% (57 reviews) with 7.10 in average rating\n\n[Metacritic](https://www.metacritic.com/movie/f1-the-movie/): 68/100 (21 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; The impressive craft of these scenes extends to Kosinki’s exploration of the various technologies, like road simulators, used to help drivers gain any advantage. Of course, there are some unrealistic elements in F1, moments that might have sticklers raising an eyebrow, but the film doesn’t feel any less dramatic than the real thing.\n\n-[Lovia Gyarkye, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/f1-the-movie-review-brad-pitt-damson-idris-joseph-kosinski-1236291870/)\n\n&gt; The action is hardly dull, but the sheer disconnect between the wowee zowee immediacy of the race footage and the mezzo mezzo excitement it inspires suggests that tuning out the noise isn’t as easy as Sonny Hayes might seem to think. “Sometimes when you lose, you win,” Ruben tells his old friend. And sometimes when you win, this solid but underwhelming blockbuster contends, you still lose.  \n\n-[David Ehrlich, IndieWire](https://www.indiewire.com/criticism/movies/f1-movie-review-brad-pitt-1235133092/): C+\n\n&gt; With the action confined to stadium racetracks, you wonder why Kosinski didn’t give the audience more of a consistent eagle’s-eye overview; that would have helped. But maybe he just counted on the thrill of speed, and the specter of death, to be the film’s engine. Is there a suck-in-your-breath cataclysmic crash? Of course there is, but we’re invited to exhale from its consequences too easily. In “Grand Prix,” someone asks why race drivers do what they do, and a racer’s girlfriend replies, “It’s marvelous to go very fast.” Yes it is, but that in itself isn’t enough to make a marvelous movie.\n\n-[Owen Gleiberman, Variety](https://variety.com/2025/film/reviews/f1-review-brad-pitt-javier-bardem-damson-idris-1236432987/)\n\n&gt; Top Gun: Maverick's Joseph Kosinski assembles an all-star crew in front of and behind the camera for F1, and they craft a technical marvel of a movie. It’s gorgeous and thrilling to look at, with top-notch editing backing up Brad Pitt’s IMAX-consuming charisma. It's a faithful devotee to the sports-movie formula that’s kept from greatness by a few too many unnecessary components and a finish line that maybe should’ve been closer than two and a half hours away. But in spite of that, it’s still a hell of a ride.\n\n-[Clint Gage, IGN](https://www.ign.com/articles/f1-review-brad-pitt-joseph-kosinsky): 7/10 \"good\"\n\n&gt; “F1” is slick enough to capture your attention for an hour and a half. Again, unfortunately, it’s 2 1/2 hours long. The repetitive story, stale characterizations, portentous self-celebration and oddly flaccid take on the masculine drive just keep puttering along, long after our interest has waned. It’s a classic car that looks brand new — but it hasn’t had a lube job in decades.\n\n-[William Bibbiani, TheWrap](https://www.thewrap.com/f1-the-movie-review-brad-pitt/)\n\n&gt; Motor racing is a sport in which constituent team members seem to be competing against each other as much as against the opposition, and so it ought to be an ideal subject for a movie treatment. There’s a fair bit of macho silliness here, but the panache with which director Joseph Kosinski puts it together is very entertaining. Condon is a vital fuel ingredient and to a F1 non-believer like me, the result is surreal and spectacular.\n\n-[Pete Bradshaw, The Guardian](https://www.theguardian.com/film/2025/jun/17/f1-the-movie-review-brad-pitt): 4/5\n\n&gt; Whether or not it finds it audience (and there are probably a lot of easter eggs for viewers who know a hell of a lot more about Formula One than I do), F1 is proof that brand Pitt is still a viable option and, like Tom Cruise, can still hold a movie the old-fashioned way, putting pedal to the metal.\n\n-[Damon Wise, Deadline](https://deadline.com/2025/06/f1-the-movie-review-brad-pitt-joseph-kosinski-old-school-racing-drama-1236435474/)\n\n&gt; Joseph Kosinski has done it again. F1 combines unparalleled access, pioneering filmmaking and moving redemption arcs to deliver an exhilarating cinematic experience. What will he attach a camera to next?\n\n-[Sophie Butcher, Empire](https://www.empireonline.com/movies/reviews/f1-the-movie/): 4/5\n\n&gt; With those warnings in place, buckle in. For flash and rumble, F1 doesn't have an equal this summer. Roll down the windows and enjoy the ride.\n\n-[Jordan Hoffman, Entertainment Weekly](https://ew.com/f1-review-brad-pitt-phenomenal-racing-scenes-dull-script-11755916)\n\n&gt; “F1” leans extremely rousing, though intrigues when it mines the strategic idiosyncrasies of the motorsport and the psychological and physical toll it takes to be a champion. There’s a mental health angle touched on that, if explored more, would have led to a great albeit bleaker movie. Not that this thing deserves a participation trophy. Watching Pitt burn this much rubber, and with macho panache, puts \"F1\" in the winners' circle.\n\n-[Brian Truitt, USA Today](https://www.usatoday.com/story/entertainment/movies/2025/06/17/f1-movie-review-brad-pitt/84222638007/): 3/4\n\n&gt; F1 couldn’t feel more contemporary in its focus over a sport that’s the current obsession of millions, yet couldn’t feel more like a flashback to a bygone age where a larger-than-life movie star was the only necessary I.P. This what blockbusters used to look like. Come for the most impressive, lustrous car that a gajillion-dollar budget can buy. The reason to stay, however, is the driver.\n\n-[David Fear, Rolling Stone](https://www.rollingstone.com/tv-movies/tv-movie-reviews/f1-review-brad-pitt-formula-one-1235353444/)\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nSonny Hayes, a Formula One driver who raced in the 1990s, has a horrible crash, forcing him to retire from Formula One and start racing in other disciplines. A Formula One team owner and friend, Ruben, contacts Hayes and asks him to come out of retirement to mentor rookie prodigy Joshua \"Noah\" Pearce for the Apex Grand Prix team (APXGP).\n\n**DIRECTOR** \n\nJoseph Kosinski\n\n**WRITERS**\n\nEhren Kruger (story by Joseph Kosinski &amp; Ehren Kruger)\n\n**MUSIC**\n\nHans Zimmer\n\n**CINEMATOGRAPHY**\n\nClaudio Miranda\n\n**EDITOR**\n\nStephen Mirrione\n\n**RELEASE DATE** \n\nJune 27, 2025 (in theaters)\n\n**RUNTIME**\n\n156 minutes\n\n**BUDGET**\n\n$200 million\n\n**STARRING**\n\n- Brad Pitt as Sonny Hayes\n\n- Damson Idris as Joshua \"Noah\" Pearce\n\n- Kerry Condon as Kate McKenna\n\n- Tobias Menzies as Peter Banning\n\n- Kim Bodnia as Kaspar Molinski\n\n- Javier Bardem as Ruben Cervantes\n\n- Shea Whigham as Chip Hart\n\n- Joseph Balderrama as Rico Fazio\n\n- Sarah Niles as Bernadette Pearce",
        "upvotes": 462,
        "comments": 205,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/saSrpGisoqKYQckDy7Hc3qPWcfhVZcNWukWoTZn34G0.jpeg?auto=webp&amp;s=7ea0cd60dd3cab5ef5e1b00c0e411284608dc45e"
        },
        "permalink": "/r/movies/comments/1ldqxf2/joseph_kosinskis_f1_review_thread/"
    },
    {
        "id": "1ldxgza",
        "author": "lord_coen",
        "title": "David Lynch: an Iconic American Surrealist Filmmaker",
        "content": "David Lynch presented a uniquely innocent, yet penetrating, interpretation of the American Dream, a concept that could easily serve as the title for any of his films.",
        "upvotes": 199,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aULuODfrRkhDJyCGUHzNRp3-CAL_4hoCTu7i6DdKoh0.jpeg?auto=webp&amp;s=8c47639148b91806f5e8c310db652cdd4c4c705d"
        },
        "permalink": "/r/movies/comments/1ldxgza/david_lynch_an_iconic_american_surrealist/"
    },
    {
        "id": "1ldyull",
        "author": "Amaruq93",
        "title": "The 'Orca' returns to Amity Island | A replica of the iconic boat from “Jaws”, 9 years in the making, arrived at Martha's Vinyard for the film's 50th anniversary",
        "content": "",
        "upvotes": 170,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0A6hVUd9mPBwFrhOd5FzGtA92TOLPqwyaxpA2efKiVw.jpeg?auto=webp&amp;s=acf114711a45146fb8d99e4dede1e9ff9a1eef77"
        },
        "permalink": "/r/movies/comments/1ldyull/the_orca_returns_to_amity_island_a_replica_of_the/"
    },
    {
        "id": "1ldyer6",
        "author": "MarvelsGrantMan136",
        "title": "Nakoa-Wolf Momoa &amp; Ida Brooke Join ‘Dune 3’",
        "content": "",
        "upvotes": 165,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0Jdj8BYL3eyn1Quxfwk6butSWgrXQzzn2QEpBRD5TvA.jpeg?auto=webp&amp;s=570f2fc86f0838ba72eb6fa606446b7c01205b4e"
        },
        "permalink": "/r/movies/comments/1ldyer6/nakoawolf_momoa_ida_brooke_join_dune_3/"
    },
    {
        "id": "1ldkdgw",
        "author": "fincieta",
        "title": "What is the greatest ensemble bunch of actors before they hit the big-time cast?",
        "content": "\n\nI'll go first. \n\nSunshine \n\n[Cillian Murphy](https://www.imdb.com/name/nm0614165/?ref_=ttfc_fcr_cst_3)\n\n[Michelle Yeoh](https://www.imdb.com/name/nm0000706/?ref_=ttfc_fcr_cst_4)\n\n[Hiroyuki Sanada](https://www.imdb.com/name/nm0760796/?ref_=ttfc_fcr_cst_5)\n\n[Rose Byrne](https://www.imdb.com/name/nm0126284/?ref_=ttfc_fcr_cst_6)\n\n[Benedict Wong](https://www.imdb.com/name/nm0938950/?ref_=ttfc_fcr_cst_7)\n\n[Chris Evans](https://www.imdb.com/name/nm0262635/?ref_=ttfc_fcr_cst_8)\n\n[Cliff Curtis](https://www.imdb.com/name/nm0193295/?ref_=ttfc_fcr_cst_1)\n\n[Mark Strong](https://www.imdb.com/name/nm0835016/?ref_=ttfc_fcr_cst_10)",
        "upvotes": 894,
        "comments": 475,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C1gsR4xy7A5qMzZdYFnMEpkaiIHlWOz9xAVRTApOXnM.jpeg?auto=webp&amp;s=2521a7013d6e7ce3c7dfd59c1eca45e2e4d84b9e"
        },
        "permalink": "/r/movies/comments/1ldkdgw/what_is_the_greatest_ensemble_bunch_of_actors/"
    },
    {
        "id": "1ldc0ok",
        "author": "BunyipPouch",
        "title": "First Image for Comedy-Thriller 'Anything That Moves' - An innocent Chicago food delivery boy, after having sex for money, finds himself involved in a series of murders that can be traced back to someone who was in his bed. - A tribute to 1970s X-rated films and erotic-thrillers.",
        "content": "",
        "upvotes": 3523,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pryvlx4kge7f1.png?auto=webp&amp;s=2176372f0b65069dad2dfbc0e0812474b89b60cf"
        },
        "permalink": "/r/movies/comments/1ldc0ok/first_image_for_comedythriller_anything_that/"
    },
    {
        "id": "1lde51f",
        "author": "today_okay",
        "title": "What actor or director do you think has lost their touch?",
        "content": "I really am kind of disappointed by the trajectory of Tim Burton. He went from truly bizarre and kooky to kind of a strange brand owner of his own style - kind of a caricature. I think the stuff from Cameron Crowe lately has been off. I would imagine that we'll never get a great movie out of Oliver Stone or David Mamet ever again...",
        "upvotes": 1980,
        "comments": 1978,
        "media": null,
        "permalink": "/r/movies/comments/1lde51f/what_actor_or_director_do_you_think_has_lost/"
    },
    {
        "id": "1ldo8yo",
        "author": "ElGringoAlto",
        "title": "40 years after The Stuff, enough is still never enough",
        "content": "",
        "upvotes": 307,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AqbcTOAGkijiXMSzFDq2EhLazqi45ZsMurchXh3Yeks.jpeg?auto=webp&amp;s=c49f7bff85937eb9d5e9a89857a854eeaab4741d"
        },
        "permalink": "/r/movies/comments/1ldo8yo/40_years_after_the_stuff_enough_is_still_never/"
    },
    {
        "id": "1ldyf8o",
        "author": "JeddakofThark",
        "title": "Wind (1992), with Matthew Modine and Jennifer Grey, is a phenomenal and somewhat forgotten movie. Gorgeous sailing cinematography, a great cast, and a killer score",
        "content": "",
        "upvotes": 81,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LOOgFAeogVlxZvkddlxwp2sW5wn1glsofAhhU83Fmi4.jpeg?auto=webp&amp;s=4bf043c511d90fbc344b43ff948d4f24ca8ddaf1"
        },
        "permalink": "/r/movies/comments/1ldyf8o/wind_1992_with_matthew_modine_and_jennifer_grey/"
    },
    {
        "id": "1ldvnq2",
        "author": "GraboidGirl",
        "title": "Tremors' original opening sequence",
        "content": "",
        "upvotes": 106,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_nW73nxLCwVuP8LWouNcO4vOHvxzP82wV02KaDJcbgY.jpeg?auto=webp&amp;s=0f267873f478c551361a7e9cb571349c022dcf83"
        },
        "permalink": "/r/movies/comments/1ldvnq2/tremors_original_opening_sequence/"
    },
    {
        "id": "1lds3rh",
        "author": "arseflare",
        "title": "the most depressing movie scenes you've ever seen?",
        "content": "What's your pick? There's so many from so many different genres. It remains the ghetto liquidation in \"Schindler's list\" for me the sheer relentless brutality of it lingers many years later.\n\nThe tunnel scene in in \"irreversible\" also got me like a stone. The sheer brutal realness if it and the anger it invoked..just two what are yours?",
        "upvotes": 155,
        "comments": 504,
        "media": null,
        "permalink": "/r/movies/comments/1lds3rh/the_most_depressing_movie_scenes_youve_ever_seen/"
    },
    {
        "id": "1ld5tb9",
        "author": "Amaruq93",
        "title": "\"Titan A.E.\" at 25 | History has been kind to the 2000 animated sci-fi flop that killed Fox Animation Studios",
        "content": "",
        "upvotes": 5264,
        "comments": 495,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fanG9ygcYfpn0n5Yglg75fXlyNS9VJKw7xklczZW4Fo.jpeg?auto=webp&amp;s=99c9a03d27b5195873f53e05e929dce1a9e36d39"
        },
        "permalink": "/r/movies/comments/1ld5tb9/titan_ae_at_25_history_has_been_kind_to_the_2000/"
    },
    {
        "id": "1ldfn2v",
        "author": "MaxRichter_Enjoyer",
        "title": "The Saint (1997) - trailer, with Val Kilmer and Elisabeth Shue. Great and fun spy movie.",
        "content": "",
        "upvotes": 567,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TcPFWzFCmBSOKqXcItccNnQWECuzae7bCCqSDgVHMVA.jpeg?auto=webp&amp;s=7ed2c332b65a82e2a0ccdbb10d2fa3fc3d45888a"
        },
        "permalink": "/r/movies/comments/1ldfn2v/the_saint_1997_trailer_with_val_kilmer_and/"
    },
    {
        "id": "1le1tdl",
        "author": "rabbi420",
        "title": "Say what you want about the movies themselves, but a lot of people got to make a movie because Nick Cage will take almost any roll. Let’s talk about!",
        "content": "I don’t want to really direct what anyone is going to say, but I do have only one request of you all before you comment… Please try to remember that almost no one sets out to make a “bad” movie. Almost every movie you ever saw was someone’s dream, and group of people’s hard effing work. \n\nLove you all!\n\nEDIT: Can’t believe I misspelled “role”! 🤣🤣🤣",
        "upvotes": 20,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1le1tdl/say_what_you_want_about_the_movies_themselves_but/"
    },
    {
        "id": "1ldujrq",
        "author": "Thedumbicecreameater",
        "title": "Scariest scene in a non horror movie?",
        "content": "Me personally that damn private pyle in the bathroom scene from full metal jacket. I dont know how to describe it but theres so many thinga horrific about that damn scene. There was violence but that wasnt the scary part about it. Its like the build up of the scene and his fucking stare that mostly freaked me out. You cant even see his pupils. Its like he wasnt human anymore. Though there was some humor in the scene where the drill instructor started insulting him lmao. But that doesn't take away from the horrors of that one scene. Its so well directed. Its like one of the most memorible moments in the movie and in film history i would say. ",
        "upvotes": 43,
        "comments": 145,
        "media": null,
        "permalink": "/r/movies/comments/1ldujrq/scariest_scene_in_a_non_horror_movie/"
    },
    {
        "id": "1lcs81p",
        "author": "MarvelsGrantMan136",
        "title": "The Naked Gun | Official Trailer",
        "content": "",
        "upvotes": 14451,
        "comments": 1816,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Eg7lNqurnPN2pVFaMiuyKkshyonWytsEzEy3W8SedvU.jpeg?auto=webp&amp;s=f7b7280d5619dff610dbf30945cd72ed9524847e"
        },
        "permalink": "/r/movies/comments/1lcs81p/the_naked_gun_official_trailer/"
    },
    {
        "id": "1ldeq7t",
        "author": "tjalek",
        "title": "King Arthur Legend of the Sword is probably the craziest that Guy Ritchie has gone",
        "content": "I remember when Snatch was one of those films that everyone had on DVD in the early days, saw the Sherlock films in cinema and always wanted a RocknRolla sequel, his style was so distinct\n\nBut then I fell off Guy Ritchie until The Covenant and then I watched his films since Aladdin.\n\nI noticed that he had played it straighter than I would have expected in Aladdin, The Covenant and Fountain of Youth and I wondered why. that zany super British way he would cut together scenes.\n\nI didn't like Wrath of Man, felt very B grade.\n\nThe Gentlemen and Operation Fortune felt most like him since and Ungentlemanly had elements of his zaniness.\n\nThen I saw King Arthur, which was such an over the top hyper Guy film, that I almost expected some freeze frame 4th wall breaking moments. I loved it, it's so crazy.\n\nHowever it being such a big box office bomb and critical failure. I wouldn't be surprised if it made him more wary to be himself as much and became more of a director for hire.\n\nLooking forward to rewatching King Arthur again actually, it's so nuts.\n\nEDIT: The montage, the dlalogue, the big ass snake towards the end, the slow mo 360 degree camera shots are so insanely over the top hahahaha, it's time to make it a cult classic.",
        "upvotes": 433,
        "comments": 167,
        "media": null,
        "permalink": "/r/movies/comments/1ldeq7t/king_arthur_legend_of_the_sword_is_probably_the/"
    },
    {
        "id": "1ld75yw",
        "author": "MarvelsGrantMan136",
        "title": "David Hekili Kenui Bell Dead – ‘Lilo &amp; Stitch’ Shave Ice Guy Passes Away Just Weeks After Movie Release",
        "content": "",
        "upvotes": 1297,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1ld75yw/david_hekili_kenui_bell_dead_lilo_stitch_shave/"
    },
    {
        "id": "1ld9lu5",
        "author": "MiddleOwn5557",
        "title": "What opening scene has little or nothing to do with the movie plot?",
        "content": "This came to mind while watching Flight of the Navigator\n\nThe opening scene: [https://www.youtube.com/watch?v=MwtkUw717TQ](https://www.youtube.com/watch?v=MwtkUw717TQ)\n\nIt's got one glaring element like the flying disc which is then revealed to be a frisbee. But, the whole dogs catching frisbees has nothing to do with the movie plot.\n\nCan you think of any other examples?",
        "upvotes": 789,
        "comments": 384,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bi0uU4uMmxOSaQ6GtlxuaXGOLNCpHdjvEV8BauzDZ5k.jpeg?auto=webp&amp;s=6068db77446e69eee6d96b28ccdde9beaa3679ed"
        },
        "permalink": "/r/movies/comments/1ld9lu5/what_opening_scene_has_little_or_nothing_to_do/"
    }
]