[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lda1uo",
        "author": "clist186",
        "title": "Anyone else in Canada notice the Naked Gun trilogy on Netflix got removed after a day?",
        "content": "It's been advertised for weeks as releasing Sunday June 15th, and I even started watching the second movie yesterday. I logged in today to continue watching and all three movies have been removed completely. Not even a \"coming soon\".",
        "upvotes": 31,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lda1uo/anyone_else_in_canada_notice_the_naked_gun/"
    },
    {
        "id": "1lclhx2",
        "author": "moistwound",
        "title": "Netflix is punishing me for traveling",
        "content": "So I’m on vacation in the Caribbean with my girlfriend — we live together in CO, and like most people these days, we pay for the cheapest version of Netflix (with ads) because streaming’s gotten outta control. Between all the different platforms, we keep it low tier just so we can still have access to most stuff.\n\nAnyway, we’re chilling on vacation, decide to throw on a movie, and go straight to Netflix — our usual go-to. And what do we get? A notification saying:\n“Your subscription tier is not available in this region.”\nSo… basically, we can’t use Netflix at all.\n\nAnd THEN — get this — it hits us with:\n“You can change your subscription [here]” with a link to upgrade.\nLike that’s gonna make me go “oh yeah sure, let me give Netflix more money just so I can use it on my vacation.” Bro, be serious.\n\nI’ve been paying for Netflix for years. I’m not asking for a free ride — just some common sense. Would it really kill them to say:\n“This tier isn’t available in your current region. You have 7 days of access while traveling — enjoy your vacation!”\nGive me a little grace period. A little respect. I’m not a new user. I’m just out of town for a minute.\n\nSo what now? Am I supposed to pause or cancel my Netflix sub every time I leave the country? Is it even worth paying anymore if I’m gone for part of the month? It shouldn’t be that complicated.\n\nAnd this is why people are done with streaming services. They nickel-and-dime loyal users, and act surprised when people jump ship. It’s like they want to lose us.\n\nNetflix — if you’re listening — stop punishing your paying customers for traveling. It’s not a good look. Especially when all we wanted to do was watch a damn movie on vacation.",
        "upvotes": 533,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1lclhx2/netflix_is_punishing_me_for_traveling/"
    },
    {
        "id": "1ldf9r8",
        "author": "muffinpie90",
        "title": "Priscylla reveals what life is like after Dancing For The Devil: The Tiktok 7M Cult (and escaping the cult after 23 years)",
        "content": "She seems to be doing so much better now, but her story is wild. I hope they'll do a season 2, I really need to know what happens to Robert Shinn and Shekinah... And Miranda! ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldf9r8/priscylla_reveals_what_life_is_like_after_dancing/"
    },
    {
        "id": "1ldciq5",
        "author": "Mysterious_Sport6100",
        "title": "Netflix opened a \"finsta\" account for an hour. Did anyone see what was on it?",
        "content": "The Instagram account @netflix2 is private now. Did anyone see what was on it? I saw it on the netflix insta stories and I was low-key sad. I hate these gimmicks just show us the damn content",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldciq5/netflix_opened_a_finsta_account_for_an_hour_did/"
    },
    {
        "id": "1lcpi0b",
        "author": "LowBudgetVillain",
        "title": "What’s a lesser-known show or movie that completely consumed your brain?",
        "content": "Hey Reddit, I’m on summer break and bored out of my mind.  \nI’m looking for series or movies to watch. Preferably something good enough to make me forget what day it is.\n\nStuff I enjoy:  \n• Psychological  \n• Horror  \n• Mystery or thrillers  \n• A good slow-burn with depth  \n• Soapy comfort shows like Gilmore Girls are fine too if they’re written well\n\nStuff I don’t enjoy:  \n• Anything overhyped that everyone’s watching right now  \n• Predictable plots or weak character arcs\n\nPlease give me your personal underrated faves. The kind of stuff you wish more people knew about. Bonus points if it has killer cinematography or sharp writing.\n\nThanks in advance ✨",
        "upvotes": 59,
        "comments": 231,
        "media": null,
        "permalink": "/r/netflix/comments/1lcpi0b/whats_a_lesserknown_show_or_movie_that_completely/"
    },
    {
        "id": "1ldi0qk",
        "author": "Dry_Emphasis306",
        "title": "Show has disappeared from laptop but not TV login...",
        "content": "I'm having an issue the past couple days where Mad Men has suddenly disappeared from Netflix on my laptop at work, but when checking at home on my TV, it's still there. I'm located in the UK, and when logged into the work network with my laptop, I check [fast.com](http://fast.com) and it shows my location as UK... so not sure why that one show would suddenly be missing. Anyone experienced this before?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ldi0qk/show_has_disappeared_from_laptop_but_not_tv_login/"
    },
    {
        "id": "1ldc0c5",
        "author": "Low-Instance7728",
        "title": "Need binge worthy action shows for my grandma",
        "content": "Hi guys, as the title says I'm looking for a couple series of action shows on Netflix for my grandma. She's home a lot and really enjoys binge watching movies and TV shows. She loves action stuff and enjoys if there's a little romance too. She's watched all of the police and firefighter shows and suits, just so you get an idea of what she's into. She has also watched all of Star Gate SG1 and Hallmark movies as well as antique road show on repeat for like a month. She has varied tastes. But her favorite is action. \n\nIf anyone has suggestions for some shows that I can recommend her I'd greatly appreciate it! We have a plethora of other streaming services but Netflix is her favorite!\n\nTyia",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ldc0c5/need_binge_worthy_action_shows_for_my_grandma/"
    },
    {
        "id": "1ldhsgg",
        "author": "Personal-Ad8884",
        "title": "hey",
        "content": "hey, I'm looking for this actress.. plss                                                                                                                                   v           \n\nhttps://preview.redd.it/tr4msl9r6g7f1.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;s=40be4ed279247fef5cda1f2943705a2afdd52d79\n\nhttps://preview.redd.it/6lwa8d8t6g7f1.png?width=375&amp;format=png&amp;auto=webp&amp;s=84c33e1a0f259af7836ff57e575cf1c9e5e99ad0\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldhsgg/hey/"
    },
    {
        "id": "1ld5tu7",
        "author": "Brief-Buy9191",
        "title": "Mercy for None",
        "content": "Mercy for None is a violent South Korean action series that delivers. It follows a former gang enforcer who tried to walk away but is dragged back into a brutal underworld (John Wick vibes).\n\nThe story is solid, but the real star is the action. This show has some of the best martial arts scenes ever:  fast, intense, and packed with emotion. Every fight feels like it matters, and the stakes are real.\n\nShot in Seoul, the show is moody, stylish, and totally immersive. If you’re into dark, emotional stories with incredible fight choreography, Mercy for None is a must-watch.  Enjoy!",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ld5tu7/mercy_for_none/"
    },
    {
        "id": "1ldcdnx",
        "author": "ThrowRA_cheggkitten",
        "title": "You - Available w/ Ad Free Plan?",
        "content": "Is You (season 5) available to watch with the ad free plan? I don't know if there is any way to check without a subscription but if anyone can help me find out since I am planning to subscribe just for this show. Ty! ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ldcdnx/you_available_w_ad_free_plan/"
    },
    {
        "id": "1ld5py2",
        "author": "FoxyMiira",
        "title": "All Of Us Are Dead is the most unintentionally funniest show I've seen",
        "content": "I'm aware this finished ages ago but just decided to binge-watch this with a friend in one day. I would say this is the epitome of so bad it's good.\n\n* the detective character who is initially shown as a very serious character when introduced, but quickly turns into a goofy ass character who goes on random side quests because the plot demands he does random shit until the final episode.\n* that bully who is the main antagonist. Pretty much a Looney Tunes character\n* a girl that seemed like she would turn into a second antagonist and play a bigger role but hides in a storage room for 3 episodes (the same classroom the other kids are stuck in as well and no one even thinks to open the storage for supplies or something) and then dies unceremoniously\n* every episode there is **at least** 2 or 3 things that happens in the plot or the characters' actions that will absolutely blow your mind on how every character is a glue sniffer. It's a mystery how any of these characters even survived past childhood without getting run over in traffic or something. There's a scene where the students try to [sneak behind a zombie facing the window](https://youtu.be/EJzu9sCR-Ys?t=250). Of course one character decides to hold onto a pink steel flask when he's literally wearing a bag pack.\n* unintentionally funny scenes like the last episode when the half-zombie girl decides to jump off the building like some superhero. Or when the main character jumps out the window and you see a zoomed out shot of the character doing an inhuman acrobatic movie via cgi.\n* Pointless sideplots, pointless deaths, pointless characters that seemed like the show is setting up something but nothing happens.\n* Least on the nose political themes with the assembly woman character\n\nrecommend watching this while high. I'm also interested in what mind state the writers and showrunners were in while they produced this",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ld5py2/all_of_us_are_dead_is_the_most_unintentionally/"
    },
    {
        "id": "1ldc7oa",
        "author": "jskellingtonn_",
        "title": "tv show with blue haired girl",
        "content": "my bf is adamant this show exists but i can’t find it anywhere and he’s not given me much to work with so hoping someone can help us out. he saw a tv show ages ago on netflix that he thinks has now been removed , that had a blue haired girl , her hair was about shoulder length apparantly , he thinks she may have been of asian heritage but he’s not 100% , i think he said her brother was going to do a school shooting but someone talked him out of it? and that’s literally all i’ve been given , pls help , it was a live action not an anime but i can’t find a thing about it , thank you!!! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ldc7oa/tv_show_with_blue_haired_girl/"
    },
    {
        "id": "1ld72h8",
        "author": "_Vacation_mode_",
        "title": "How to move an extra member profile back to main account?",
        "content": "Has anyone come up with a workaround to move an extra member profile back to the main account? I set up my daughter as an extra member when she moved out. A year later she moved back in and I’d like to not have to keep paying the extra member fee now that she’s back in the household. She doesn’t want to lose her profile info. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ld72h8/how_to_move_an_extra_member_profile_back_to_main/"
    },
    {
        "id": "1lcyquc",
        "author": "RubyFennex",
        "title": "Trying to remember what movie I watched",
        "content": "I have a vague memory of watching a movie on Netflix and really enjoying it, but I canNOT remember what it's called for some reason\n\nAll I remember about it is that a girl got into an accident, and her husband took her home after the hospital, they had a fucking MASSIVE house, and that at the en, &gt;!it's revealed that he wasn't actually her husband? And I think her actual husband was dead?!&lt;\n\nThat's literally all I remember, I don't know anything about the middle of it, I'm pretty sure it had Ryan Reynolds but I could be wrong. Anyone happen to know what this is?\n\nThanks!!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lcyquc/trying_to_remember_what_movie_i_watched/"
    },
    {
        "id": "1lcuikc",
        "author": "CurrentlyLucid",
        "title": "Mercy for none",
        "content": "I just got done with this, fairly new. Korean so I watched it with subtitles. A lot of high quality martial arts, fast moving story, and a fair amount of blood and gore to be honest. I loved it.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lcuikc/mercy_for_none/"
    },
    {
        "id": "1ldgnw5",
        "author": "PrestigiousClock3393",
        "title": "One Piece profile pictures removed?",
        "content": "Did they remove one piece profile pics?, mine was shanks and today when i logged in i noticed my pfp was changed to a classic one, when i checked in to see if someone had changed it to change it back, i noticed that all of One Piece pfp’s were removed ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ldgnw5/one_piece_profile_pictures_removed/"
    },
    {
        "id": "1ld703s",
        "author": "Themadreposter",
        "title": "Does anyone else notice shows pausing and then not loading when the audio is set to Atmos? I have found many shows/movies with Dolby Vision &amp; Atmos continually freeze until you switch the audio to “original”.",
        "content": "I'll preface with saying it's not an internet issue as I have gig speed and not other service has this problem. But I've noticed it in quite a few shows. Sometimes the shows will start again when you exit out and play, but most of the time they just play a few more minutes and then freeze again. Sometimes they just won't play at all after they freeze. I've noticed it on Devil May Cry, the New Witcher Animated movie, Next Gen, and a few other animated movies/shows. And it's seemingly happening more frequently. Only switching the audio out of atmos fixes the problem. I do have a 7.1.4 set up, so idk if that's effects it at all either.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ld703s/does_anyone_else_notice_shows_pausing_and_then/"
    },
    {
        "id": "1lcv07u",
        "author": "MysticCrest1830",
        "title": "Kia Is Launching Its Premium Streaming Service In Europe, Netflix is Included",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lcv07u/kia_is_launching_its_premium_streaming_service_in/"
    },
    {
        "id": "1ldatml",
        "author": "Eton11",
        "title": "Any guesses of what show this might be?",
        "content": "I have a memory of my father watching a show years ago where this group of young adults/teens are like figuring out some town’s conspiracy (or at least that’s what it seemed like) while being chased down. The scene I remember most is 3 (i think it was 2 guys and a girl) of them hiding in a house while these bad guys start surrounding it. I think they might’ve gotten shot at, and it also might’ve been more of a log cabin than a house. It also belonged to one of their family members iirc. I assumed it was on netflix because that’s all we’ve had apart from a fire stick and its what my parents usually use, but there’s always a possibility I could be searching in the wrong place.\n\nAny guesses?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ldatml/any_guesses_of_what_show_this_might_be/"
    },
    {
        "id": "1lc4y9j",
        "author": "artifex28",
        "title": "Netflix completely HIDES content if the SUBTITLE language doesn't match your set language.",
        "content": "This seems absolutely absurd that content is *completely hidden* just if your local subtitle language isn't a match.\n\nI've had English on forever (instead of Finnish that I am).\n\nA family member was completely baffled when I mentioned watching certain shows that she wouldn't be able to even find. After changing the profile language to English, she was able to find them. I tested this personally, it indeed works like this.",
        "upvotes": 138,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1lc4y9j/netflix_completely_hides_content_if_the_subtitle/"
    },
    {
        "id": "1ld7nfk",
        "author": "OkRip3072",
        "title": "TCL vs. QOTS",
        "content": "I love love loved the Queen of the South. Theresa was such a boss. She literally came from nothing and made herself become respected. \nFor me, there hasn’t been a show that compared to Queen of the South. Then I fell upon The Cleaning Lady, and I loved it just as much, which was shocking to me. \n\nWhat do y’all think about Queen of the South? Have you seen The Cleaning Lady? If so, what did you think of the season 4 finale?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ld7nfk/tcl_vs_qots/"
    },
    {
        "id": "1lc9rcn",
        "author": "cerulloire",
        "title": "The \"Household\" aspect is insanely greedy.",
        "content": "I have the highest tiered plan, which literally allows 6 devices, shared between my parents on one TV, then myself, then my brother. I live a few cities over and my brother had to move to a different state, and we were able to stream no problem, but recently my brother and I can't watch it because it says we are not part of the household...? What's the point of paying for all these devices if we can't even use them? This isn't an issue on any other streaming service. Not being able to watch on more than 2 screens at one time is one thing that I can understand, I guess, but if you're literally paying for a plan that is laid out well to be shared, it's weird that we cannot actually share it. \n\nI'm also doubtful of \"adding an extra slot\", because while that sounds like it would alleviate the problem (unless it's just...another useless device) I refuse to give more money to Netflix and support the greed. Tbh I was willing to add the extra slot, but putting a tier on that too with ads/no-ads is just too far. \n\n\"Just Unsubscribe\" - I despise Netflix, and no longer use it, but my brother and parents still rely on it for streaming so while this isn't really my problem anymore, we won't be unsubscribing because my family is still enjoying it (regardless of me begging them to transition to another service, which we have already). I only know it does not work on my computer because my bro asked me to check what's up with Netflix rn. This doesn't change the fact that Netflix puts out sub-par cash grab originals (while cancelling/removing actually good content) behind the priciest plans, and it's even more frustrating that so many people are so tethered to Netflix that the company will never have a reason to decrease their prices. ",
        "upvotes": 58,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1lc9rcn/the_household_aspect_is_insanely_greedy/"
    },
    {
        "id": "1ld4umy",
        "author": "Apprehensive_Rub9291",
        "title": "Pip won't work",
        "content": "I have a Samsung a24 the plan is premium HD and the app has all the permissions available it is weird because it worked on my older device and I doesn't on this device",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ld4umy/pip_wont_work/"
    },
    {
        "id": "1lcigpm",
        "author": "prettykitty2005",
        "title": "OPINION: Straw",
        "content": "this movie wasn’t bad. you just had high expectations for a TYLER PERRY movie. \n\nanyways, im not sure why people are critiquing teyana taylor’s acting as if she was ever a strong actress. she does everything under the sun but acting isn’t her strong suit. she was just a special appearance to me, it was nice seeing her on a screen thats all. ",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lcigpm/opinion_straw/"
    },
    {
        "id": "1ldaozv",
        "author": "gaywidgeon_528",
        "title": "KATIE WAS VOICED BY THE SAME PERSON AS PRINCESS BEAN?????",
        "content": "So I watched 'The Mitchells Vs The Machines and the moment Katie opened her mouth I knew I regonised her voice from somewhere. But where?? So I paused the movie and googled it. BEAN!? OF COURSE \n\nDespite being fully flabbergasted, I continued watching the movie. But I just couldn't get my mind off the fact that one person, Abbie Jacobson gave her voice to two charathers with such different personalities. We have Katie with full of energy, inspiration, color, who does fun movies in which she puts all her creativity (which she has a lot) and she just enjoys life. And then we have Princess Bean who likes to do stupid things, get drunk and do stupid things while being drunk with her sarcastic emotinal suppor demon cat and an elf on her side. She's  tired of life and her dad but at the same time she loves her dad and sometimes life isn't THAT bad for her.\n\nNow that I think about it these two could be really good friends maybe because of how different they are- and they both love women and have complicated relationship with their dad! :D So maybe it isn't that surprising that they have the same voice actor. I'm still gonna post this tho.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ldaozv/katie_was_voiced_by_the_same_person_as_princess/"
    },
    {
        "id": "1lcw8p0",
        "author": "Square-Actuary-4424",
        "title": "Some recs for UK/IRL",
        "content": "Hey guys, Ireland based.\nLooking for some drama recs. \ncould really use a few good series to keep me going.\nI’m sick of constantly scrolling and rewatching old stuff! \nThings I’ve really enjoyed recently are:\n- severance\n- silo\n- west world\n- last of us \n(Obviously not all from Netflix) \nJust giving an idea of stuff I like.\nAny recommendations are welcome! \n\nGo raibh maith agat! 🇮🇪💚",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lcw8p0/some_recs_for_ukirl/"
    },
    {
        "id": "1lcfv06",
        "author": "OkRip3072",
        "title": "What show that has recently been cancelled that you’d like to see renewed/picked up on Netflix? Networks like FOX, CBS, USA,",
        "content": "There has been a few shows on these networks that have been canceled too soon, and Netflix resurrected them. For example, Lucifer was originally on FOX network cancelled after season 3 due to “declining viewership”, and Netflix picked it up for three additional seasons, so it’s not uncommon. What have you enjoyed watching that you would like Netflix to bring back?",
        "upvotes": 14,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1lcfv06/what_show_that_has_recently_been_cancelled_that/"
    },
    {
        "id": "1lcit9z",
        "author": "HANAquax",
        "title": "Upper class",
        "content": "Hi\nCan anyone please suggest me shows that talk about the lives of upper class and/or filthy rich people? \nPreferably ones without much drama unless they are too good. \nPeriod shows will be good too \nThanks",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lcit9z/upper_class/"
    },
    {
        "id": "1lcukum",
        "author": "CKWOLFACE",
        "title": "Looking for a certain English show",
        "content": "The show has a female Asian character in one the leads and takes place during the industrial revolution in London and mixs in fantasy? I remember there was a episode about kids losing their teeth?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lcukum/looking_for_a_certain_english_show/"
    },
    {
        "id": "1ld325g",
        "author": "GatoMorato",
        "title": "Netflix home, I stay at home with family  one week and switch to another house every two weeks. Do I need extra sub? Coz TV says so (table and phone doesn't)",
        "content": "Can anybody explain me how it works?\nI thought that my smartphone and tablet connecting each week to each network would say Netflix that yeah, Im part of the home base (at least twice a month). I've been long time moving back and forth to my second place with 0 problems.\nNow TV in second place says I'm not part of the plan anymore.\nBut tablet and smartphone let me watch stuff. But I can't Chromecast...\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ld325g/netflix_home_i_stay_at_home_with_family_one_week/"
    }
]