[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ivwhz3",
        "author": "NostalgicRetro73",
        "title": "There’s something in Worst Roommate Ever that I already knew but people still do…",
        "content": "That is find roommates on Craigslist. Are you out of your damn minds?  That place is a big ol nest of evil people.  So much so, Netflix should do a show just on the cases about everything evil on Craigslist. ",
        "upvotes": 32,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ivwhz3/theres_something_in_worst_roommate_ever_that_i/"
    },
    {
        "id": "1ivxs8m",
        "author": "Greenfrog2023",
        "title": "Sweet Magnolias",
        "content": "I find the characters in this show insufferable now (especially Dana Sue) and its becoming harder to get through each new season... Is it just me or is this show boring? I just needed to get this off my chest.... 🤣",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ivxs8m/sweet_magnolias/"
    },
    {
        "id": "1ivzfrf",
        "author": "Formfeeder",
        "title": "Aftermath 2024",
        "content": "This has to be one of the worst movies out on the platform.  The storyline is unbelievable, the acting is as ridiculous as the premise.  Blowing up the main supports on a bridge would put it in the water.  135 minutes I’ll never get back.  ",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ivzfrf/aftermath_2024/"
    },
    {
        "id": "1ivko3t",
        "author": "S4v1r1enCh0r4k",
        "title": "Ben Affleck Reportedly ‘Thrilled’ to Star with Longtime Crush Gillian Anderson in New Netflix Thriller!",
        "content": "",
        "upvotes": 56,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ivko3t/ben_affleck_reportedly_thrilled_to_star_with/"
    },
    {
        "id": "1iv2f9k",
        "author": "ellissabain",
        "title": "This is what the police officer who stopped Gabby Petito said after she was murdered",
        "content": "",
        "upvotes": 1185,
        "comments": 511,
        "media": null,
        "permalink": "/r/netflix/comments/1iv2f9k/this_is_what_the_police_officer_who_stopped_gabby/"
    },
    {
        "id": "1ivz4tn",
        "author": "sohaniadi",
        "title": "Zero Day - Sketch Poster &amp; Base Drawing",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivz4tn/zero_day_sketch_poster_base_drawing/"
    },
    {
        "id": "1ivgkx5",
        "author": "Legitimate_Ad3625",
        "title": "Pantheon Season 2 Is Finally Available to Watch Worldwide – Finds New Home on Netflix",
        "content": "",
        "upvotes": 39,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ivgkx5/pantheon_season_2_is_finally_available_to_watch/"
    },
    {
        "id": "1iw1fs0",
        "author": "Prestigious-Neat-625",
        "title": "'Zero Day' intro meaning?",
        "content": "This might mean literally nothing, but I noticed in zero day the intro goes from the text in black, then to white, however the \"Os\"/Holes in the text doesn't appear in Black ( the O, D, and A, in zero day had the the hole filled in black)\n\nIdk maybe it's nothing, but I have a feeling it means something I don't understand haha ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iw1fs0/zero_day_intro_meaning/"
    },
    {
        "id": "1ivx2gx",
        "author": "Bobitsababbyitsaboy",
        "title": "Title of Movie/Show",
        "content": "Definitely a shot in the dark here, I think it was a series of short stories . The one that sticks out is with a Rich father that has a daughter, daughter introduces her boyfriend to father who disagrees with the relationship. Father and boyfriend end up fighting and falls down some type of vent that teleports them to Hell like landscape(think some old guy invented the portal) where the father dies instantly and the boyfriend has to crank some machinery. Another man serves his term from the hellish place and returns to the real world to his wife . ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivx2gx/title_of_movieshow/"
    },
    {
        "id": "1iw15sn",
        "author": "lonestarbaddie",
        "title": "I really dislike Mo in Mo (2022)",
        "content": "I am currently finishing up season 2 of Mo. The show is great, and I love the storyline and relatability. But the main character Mo makes me mad!!! Have you ever seen a main character who keeps making bad choices no matter how many lessons they have to learn? I understand that is the way to keep the story going, but Mo makes his problems everyone else’s problem. He makes every situation about him and always has to be the center of attention. He is a 35+ man who acts like a child and has no growth during the show. I love this show so much but the main character is insufferable!! Did anyone else think this while watching it?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1iw15sn/i_really_dislike_mo_in_mo_2022/"
    },
    {
        "id": "1iw0xi2",
        "author": "Oniawyn",
        "title": "Language not working",
        "content": "Hey so I just got Netflix to watch Ninjago. But it only show in Norwegian language (dub/sub). While I want it to be English. All the other shows/cartoons on Netflix are in English. But only season 1 of Ninjago is in English and the rest of seasons are only in Norwegian.\nHow can I change it to English? My language settings are in English. \n\nFirst image of Season 1 Ninjago language settings\nSecond image Season 2+ Ninjago settings ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iw0xi2/language_not_working/"
    },
    {
        "id": "1ivcypa",
        "author": "Keven250",
        "title": "American Murder Series - I Found A Theme...",
        "content": "I just finished the new docuseries on Gabby Petito.\n\nWhat reminded me of the Watts story was that both men seemed to be totally enabled by their parents.\n\nWhereas the men obviously committed the crime, you get a sense that their parents are pretty terrible people who \"created\" a narcissist.\n\nI then thought of the Laci Peterson Netflix docu, where I was stunned to hear Scott's family still believes he's innocent and is trying to prove it after all these years!\n\nThere's a theme here, that explains how these guys thought they would get away with gruesome murder - they've presumably been getting away with everything their whole lives, without consequences...",
        "upvotes": 41,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ivcypa/american_murder_series_i_found_a_theme/"
    },
    {
        "id": "1ivoz6r",
        "author": "Somethingman_121224",
        "title": "'Karma' Webtoon to Air Live-Action Adaptation on Netflix This Year",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivoz6r/karma_webtoon_to_air_liveaction_adaptation_on/"
    },
    {
        "id": "1iv4n3f",
        "author": "Seismic_Salami",
        "title": "Can we remove the games section? Or at least hide it?",
        "content": "I'm willing to bet over 99% of users don't gaf about the games section. It's just bs cash farm mobile games, nothing actually fun. Netflix is for movies and shows. If someone wants to play a bs mobile game, they'll play it on mobile. If someone wants to play a real game worth playing, they'll play it on Steam. No one wants this section. It's dumb af. Remove it or allow users to at least hide it. I'm considering just dropping netflix entirely at this point the way they've been going recently. This is like adding local weather to pr0nhub. makes no f\\*\\*\\*ing sense.\n\nedit:: everyone saying there's great games on there, but seriously all I can see are shitty mobile-esque games. there's only like 14 different games, same ones every time i log in. maybe because im in Canada?",
        "upvotes": 151,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1iv4n3f/can_we_remove_the_games_section_or_at_least_hide/"
    },
    {
        "id": "1iv8xbd",
        "author": "Artdiction",
        "title": "As a breast cancer survivor, watching belle gibson in apple cider vinegar makes me sick to my stomach, how can these people exist preying on vulnerable cancer patients during their lowest time?",
        "content": "I don’t believe in ALTERNATIVE therapy but many cancer patients who need hope and become prone to this snake oil type of salesman fall into these scammers, and nowadays there are so many famous wellness influencers who keep giving out advices without even a degree in medicine. It’s sickening. ",
        "upvotes": 69,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1iv8xbd/as_a_breast_cancer_survivor_watching_belle_gibson/"
    },
    {
        "id": "1ivy000",
        "author": "JenZen_2001",
        "title": "What’s going on?",
        "content": "So:\n\n- just come back from holiday from another country\n- Netflix worked fine during the next day I came back from holiday \n\nNow when I connect to wifi (in the UK) my Netflix just don’t show much, it ain’t showing me wwe or “lost” etc but when I’m in my mobile data it shows me all my regular stuff like it did before going on holiday\n\nWhat’s going on here?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivy000/whats_going_on/"
    },
    {
        "id": "1ivg7is",
        "author": "MarionberryLong8547",
        "title": "Cozy movie recommendations",
        "content": "Hey Reddit!\n\nI need your help – I’m looking for cozy Netflix movie recommendations!\nIt can be a feel-good drama, a fantasy film, a lighthearted comedy… anything that gives off warm, comforting vibes! \n",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ivg7is/cozy_movie_recommendations/"
    },
    {
        "id": "1ivpbgr",
        "author": "Top_Cranberry8975",
        "title": "Old Enough!: Where can I watch the original/other episodes?",
        "content": "I am obsessed with the Japanese show ‘Old Enough’. Does anybody know where can I watch the other episodes. Any link or any app that can help? Please help. ✨",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivpbgr/old_enough_where_can_i_watch_the_originalother/"
    },
    {
        "id": "1iuy7cj",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reportedly Leading the Race for Scorsese’s $200M Crime Epic Starring DiCaprio, The Rock &amp; Blunt",
        "content": "",
        "upvotes": 123,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1iuy7cj/netflix_reportedly_leading_the_race_for_scorseses/"
    },
    {
        "id": "1ivro4q",
        "author": "gnxrly_",
        "title": "Every time the subtitles are displayed, the video quality gets worse",
        "content": "this is a problem I've been having for a while and I hope I'm not the only one, but when I watch any series with its original voice and I activate the subtitles to my language, every time they come out, the video quality gets a little worse.\n\nSometimes you really have to notice it, but right now I'm watching castlevania animation, and there are many static moments with dialogues and it's impossible not to notice it.\n\nI watch netlflix from the microsoft store app on pc, does anyone know why or if there is a way to fix it? Thanks in advance :)\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivro4q/every_time_the_subtitles_are_displayed_the_video/"
    },
    {
        "id": "1ivf608",
        "author": "TerminalReaper",
        "title": "The Imperfects is a Great Show. [All]",
        "content": "I understand that the show may not have had great viewership numbers but I genuinely think this is one of the better \"Young Adult\" series I've seen. The writing is really well done and it's an interesting concept built upon the super power genre. The characters are all very interesting and don't feel completely forced like some shows do.\nI can see why the show might not have attracted some people but if Netflix had marketed the show better than maybe it would have done better because I think a lot of people I know would have been interested in it. \n     I'm a big fan of the themes tied to mythology and how ordinary people are altered to become beings with powers and aren't magically born that way. I think the show really did have a lot of potential to keep growing into a really great story if it had continued and it's a shame that it didn't. I'm even a big fan of the three main leads and how their powers are integrated into their daily lives and the burden of how their powers can affect those around them either negatively or positively.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ivf608/the_imperfects_is_a_great_show_all/"
    },
    {
        "id": "1ivqjm3",
        "author": "no_more_muffins",
        "title": "Weird cropping/zooming/scaling with Netflix and Android TV box",
        "content": "Hey! I am looking for some help or good suggestions.\n\nWatching Netflix (1080p plan) with an Android TV box (Onn box from Walmart, Android 12) and a 4k LG OLED.\n\nThe issue I have is that most of the movies and series (like 80% of them) are cropped/ zoomed in/stretched. This is so annoying.\n\nTake a look at the attached video to see the issue in action.\n\nFor example I start the movie 'Inception'. All good. I leave Inception and start 'Snowpiercer'. Nothing to see but colors and subtitle. The whole pictures is weirdly zoomed in/cropped/stretched. The subtitles however are at the right place. As is the overlay, like the series' title etc. I leave that series and just for the fun of it I start 'The Fifth Element'. Another cropping issue/zooming issue to see there. Different though. Next 'Back to the Future'. All good with this movie. I leave that movie and start 'Atlas'. No picture at all, only subtitles to see. Finally 'Valerian'. No issues. Like I said 80% of the movies/series are unwatchable.\n\n\n\nWhat I tried: \n\nReset the box\n\nUpdate the box\n\nTried another monitor\n\nTried another cable\n\nTried Disney app: No issues\n\nTried Amazon Prime app: No issues\n\nTried Apple TV app: No issues\n\nTried different versions of Netflix all the way back to version 6.x or 7.x. Doesn't help.\n\n\n\nThis is a Netflix app issue. What the heck? My guess is that this ridiculous Netflix app is getting confused with some aspect ratio and never resets/adjusts itself to the 'right' ratio. What the heck? How can Netflix not be able to code a proper app?\n\n\n\nI guess a fix has to be done by Netflix. So my question is: What would be the best way to report this issue? Tried to go through their 'chat'. I realized that their chat is not the way to a solution. ;)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivqjm3/weird_croppingzoomingscaling_with_netflix_and/"
    },
    {
        "id": "1ivi97o",
        "author": "salaciousCrumble",
        "title": "Sister somehow changed the netflix account to her home wifi and I can only get temporary access to my own account.",
        "content": "Title says it all. How can I change it back to my wifi network? How the hell did she do this in the first place?  \n  \nUnder security I can sign out of any devices but I don't see an option to change the network.  \n  \nEdit: Got it. The option to manage the home network is on the tv app not on PC or android.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ivi97o/sister_somehow_changed_the_netflix_account_to_her/"
    },
    {
        "id": "1ivpf41",
        "author": "mufassil",
        "title": "We need a list for our favorites",
        "content": "Like a separate list from the one we have now. I hate having to sift through shows and movies I saved for when I have time to try something new when I just need to find my regular comfort show. When I'm having a rough day, I want to see a list of my favorite shows that make me happy, not fish through 30 shows that I might light to find my favorite that I saved 3 years ago. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ivpf41/we_need_a_list_for_our_favorites/"
    },
    {
        "id": "1iuk9mq",
        "author": "Baby_0il04",
        "title": "Gabby petito body cam footage is making me so mad rn",
        "content": "I’m only one episode in but the way these cops are talking have me so mad rn. They’re claiming he’s a victim of abuse, when the call was about him hitting her, and the marks he has are scratches, which are defensive marks meaning she was defending herself from him. You don’t attack someone by scratching/clawing at them. Brian is laughing and stubbing over his words as he tries to defend himself. While she’s crying and blaming herself. It’s so obvious who’s the victim in this situation. (Maybe that’s hindsight talking but ugh it gets my blood boiling) \n\nSorry just had to rant here, cuz I have no one to talking to about it \n\nEdit: i understand now how people do and can attack by scratching at someone. It was definitely just hindsight, knowing she was strangled And knowing strangle victims will try to scratch it get away. But I didn’t mean to invalidate anyone’s experiences, sorry if it came off that way. ",
        "upvotes": 732,
        "comments": 312,
        "media": null,
        "permalink": "/r/netflix/comments/1iuk9mq/gabby_petito_body_cam_footage_is_making_me_so_mad/"
    },
    {
        "id": "1ivoqv6",
        "author": "Dogsteeves",
        "title": "Totally mean not still waiting here for pokémon Horizons season 1 to come on Netflix",
        "content": "Looks like it finally coming but we have no date yet XD ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ivoqv6/totally_mean_not_still_waiting_here_for_pokémon/"
    },
    {
        "id": "1ivvr08",
        "author": "oniBRUH",
        "title": "My birthday is in 6 days but im really waiting for 4 says since thats when Brooklyn 99 comes backs.",
        "content": "Me and my sister have not had a show to watch for months since we finished it on netflix sad how we didn't have more seasons until our faces lit up seeing our beloved child Brooke is back.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ivvr08/my_birthday_is_in_6_days_but_im_really_waiting/"
    },
    {
        "id": "1iw1c3i",
        "author": "YBmoonchild",
        "title": "Gabby Petito doc",
        "content": "As I’m watching it I just wonder if Brian’s girl “best friend” was in on it too. \n\nThe way she acts, what she says. She doesn’t seem angry that he did this, or shocked. She seems oddly calm and almost smirks at times. It’s kind of fucked up actually. She had to have known way more than she said she did at the very least. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iw1c3i/gabby_petito_doc/"
    },
    {
        "id": "1ivjniz",
        "author": "northernblazer11",
        "title": "Netflix uk recommendations",
        "content": "Hello guys. \n\nI love a good detective show. \n\nI enjoyed the 1st part of the sinner but not the rest. I enjoy movies like 7, fight club etc. \n\nCan you give me a series or movie you guys think I will enjoy. Tried watching ozark but couldn't get into it. \n\nI will give most things a go. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ivjniz/netflix_uk_recommendations/"
    },
    {
        "id": "1ivwtfr",
        "author": "Infinite_Notice_6193",
        "title": "WTF?",
        "content": "Netflix was my first streaming subscription. I started streaming it on my phone. Now all of a sudden every time I try to use Netflix on my phone it tells me that my phone is not part of this account. I'm beyond dealing with crap like this and so if anybody has a quick fix for me great otherwise I'm going to have to just unsubscribe because I can't do all this and I'm subscribing for a lot of things because of the way the world is going and the fact that I probably won't have an income in a few months. That said, I do like to have a few nice things you know and turns out that in my life Netflix used to be one of those. I got to get off Prime though because I can't keep subscribing to Amazon and paying people who are just bleeding us dry for no apparent reason whatsoever. Anyway if anybody can help that would be great. Thank you",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ivwtfr/wtf/"
    }
]