[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1opwhdu",
        "author": "Immediate_Strike7720",
        "title": "Alice in Borderland 3",
        "content": "Has anyone watched this and felt like this season was a massive letdown? I feel like if they had stopped at 2 seasons it could’ve been great, personally I feel season 3 was all over the place ",
        "upvotes": 18,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1opwhdu/alice_in_borderland_3/"
    },
    {
        "id": "1op5qxs",
        "author": "EchoNarwhal812",
        "title": "Which actor completely carried a Netflix show",
        "content": "For me it has to be Rami Malek in Mr. Robot. Even though it originally aired elsewhere, watching it on Netflix now just hits different. The way he plays Elliot awkward, brilliant, paranoid, and somehow still relatable makes the whole show work. Without him, it wouldn’t be half as powerful.\n\nYeah I know it might not be a real \"Netflix\" show but it is on Netflix. What really stuck with me wasn’t just the story, but how real the underlying themes felt. The hacking, the data breaches, the constant sense that someone’s always watching it all got under my skin. I ended up going down a massive rabbit hole learning about cybersecurity, privacy tools, and how vulnerable most people really are online.\n\nNow I actually use different VPNs depending on what I’m doing, run privacy tools to wipe old data, and even started monitoring data leaks with cloaked just to see how often our information ends up exposed. It’s wild how a show meant for entertainment can completely change how you see technology and the world around you.",
        "upvotes": 233,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1op5qxs/which_actor_completely_carried_a_netflix_show/"
    },
    {
        "id": "1ope43t",
        "author": "BrideofBazza",
        "title": "Cancel for elderly parents",
        "content": "My parents have moved into assisted living and are no longer using their Netflix account.  Their tv is gone so do t have access. I have no idea what email/phone they used to set it up. \nThey are being charged $24.99/month and I have no idea how to stop it. Any suggestions? \n\n",
        "upvotes": 64,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ope43t/cancel_for_elderly_parents/"
    },
    {
        "id": "1opx9wa",
        "author": "Sufficient-Curve2951",
        "title": "Lena Heady and Gillian Anderson in a Western drama!!???",
        "content": "As a Gillian Anderson fan, I am so excited to see her in The Abandons. Two brilliant actresses butting heads on-screen and finally a Western with two strong female characters. WOWW The cast also looks stacked!!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1opx9wa/lena_heady_and_gillian_anderson_in_a_western_drama/"
    },
    {
        "id": "1oq3bpq",
        "author": "Goooooogol",
        "title": "What does everybody think of netflixes UI?",
        "content": "What i mean by this is the rows of shows you see on the homescreen.\n\nI personally hate how my List just moves seemingly at random when it should stay in a findable place, because it is difficult to remember what shows i wanted to watch if my list keeps moving locations. I know there is a button for it, but its easy to forget it’s there.\n\nI do think the Continue Watching and Watch List rows should stay at the top of the screen, and i have no idea why netflix makes finding them difficult from time to time.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oq3bpq/what_does_everybody_think_of_netflixes_ui/"
    },
    {
        "id": "1oq34vh",
        "author": "odlynuff",
        "title": "Soulmates",
        "content": "Im just curious what do you guys/lady's think about this show I know its cheesy but does anyone think that theres some reality behind it like if we actually have Chemical soulmates or not",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq34vh/soulmates/"
    },
    {
        "id": "1oq2skp",
        "author": "LandscapeNarrow5352",
        "title": "Stranger Things: Tales From ‘85 | Official Announcement | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oq2skp/stranger_things_tales_from_85_official/"
    },
    {
        "id": "1opcoii",
        "author": "LandscapeNarrow5352",
        "title": "'KPop Demon Hunters 2' Aims for 2029 Release",
        "content": "",
        "upvotes": 36,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1opcoii/kpop_demon_hunters_2_aims_for_2029_release/"
    },
    {
        "id": "1oq0vnb",
        "author": "JCraig96",
        "title": "Why is my video quality so bad?",
        "content": "I have Netflix on my pc, I have the standard version with ads. Now, it says that the video and sound quality is good, with the resolution being 1080p (full HD). So tell me why when I actually watch shows and movies, the quality is terrible, borderline unwatchable! When it first comes on, the quality is good, but then, before long, the resolution just gets worse and worse as time goes on. \n\nWhat's happening?! I even went to the playback settings and clicked on high data usage, where it's supposed to show the best video quality for my plan. But still, the poor quality doesn't change, it's still horrible regardless. So idk what's going on. \n\nDoes it have something to do with it being on pc? Or the type of plan that I have? Has anyone eles experienced the same thing? Does anyone know what to do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oq0vnb/why_is_my_video_quality_so_bad/"
    },
    {
        "id": "1opzoiv",
        "author": "Hackedbytotalripoff",
        "title": "Best show to watch after enjoying the Sinner season one show",
        "content": "The Sinner season 1 was a blast.  Season 2 is okay, considering the heightened expectations after the quality of Season 1.  \n\nWhat show would you suggest watching after enjoying   \"The Sinner season 1\"?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opzoiv/best_show_to_watch_after_enjoying_the_sinner/"
    },
    {
        "id": "1opyw3e",
        "author": "sonofanadultfilmstar",
        "title": "The Blacklist",
        "content": "This came  up on my “things you may like” section. It looks like a show I would definitely enjoy. And love James Spader.\n\nI wanted to ask though - is this a show that’s like CSI or Law and Order where each episode is different or is it like Breaking Bad/Prison Break where the episodes do go together throughout each season? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1opyw3e/the_blacklist/"
    },
    {
        "id": "1opy2rm",
        "author": "I_AmBetterThanY0u",
        "title": "Unable to play GTA SA due to \"Profile not having access to games with this maturity level\", when there are no viewing restrictions on my profile whatsoever, but works perfectly fine on other profiles with the same exact settings, how to fix?",
        "content": "Unable to play GTA : San Andreas due to \"Profile not having access to games with this maturity level\", when there are no viewing restrictions on my profile whatsoever, but works perfectly fine on other profiles with the same exact settings, looking for a fix.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opy2rm/unable_to_play_gta_sa_due_to_profile_not_having/"
    },
    {
        "id": "1opwu18",
        "author": "soravp",
        "title": "Witcher S4 Geralt end name confusion?",
        "content": "Spoilers for S4.\n\n\n\nSo when Geralt gets knighted at the end he is dubbed Geralt of Rivia, by the queen of Rivia (who only knew his name was Geralt), however he already went by this title? And Jaskier even makes a song with that name...\n\nAm I misunderstanding something? \n\nIs it just a massive convenience? Is the show trying to retcon something? Is this also what happens in the books? Very confused.\n\n\nEDIT: Question answered. Thank you for your responses. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1opwu18/witcher_s4_geralt_end_name_confusion/"
    },
    {
        "id": "1oowdtv",
        "author": "chashows",
        "title": "'Nobody Wants This' Renewed for Season 3 at Netflix",
        "content": "",
        "upvotes": 189,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1oowdtv/nobody_wants_this_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1opy3xe",
        "author": "simsirisic",
        "title": "What ‘The Diplomat’ gets right (and wrong)",
        "content": "Just read this list of what *The Diplomat* gets right and where it misses the mark when it comes to portraying real-world diplomacy. Some scenes felt surprisingly authentic. Others… not so much (let’s just say, not every ambassador has that much dramatic flair or unilateral power).\n\nCurious to hear your take: What felt accurate to you, and what seemed off-base? Especially from those with firsthand experience or deep interest in international relations.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1opy3xe/what_the_diplomat_gets_right_and_wrong/"
    },
    {
        "id": "1opclr7",
        "author": "the_trend_memo",
        "title": "Netflix Reveals Massive Scale of Ad Business: 190 Million Monthly Active Viewers",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opclr7/netflix_reveals_massive_scale_of_ad_business_190/"
    },
    {
        "id": "1opsanm",
        "author": "Specialist-Change-86",
        "title": "I have a theory regarding one of Ginny &amp; Georgia Season 4 cast additions",
        "content": "Sunny Mabrey is playing Daisy, but we don't have a character description for her. Considering Daisy is also Georgia's mother's name, are we getting Ginny's maternal grandmother? What is your theory? Source link:\n\n[https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find](https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opsanm/i_have_a_theory_regarding_one_of_ginny_georgia/"
    },
    {
        "id": "1opmkvl",
        "author": "Unlucky-Carpenter9",
        "title": "Boot Camp, Brothers in Arms &amp; a Secret Self—Why Boots is a Must-Watch",
        "content": "Hey all! Just finished watching *Boots* on Netflix and had to jump into r/netflix to share—and I highly recommend it if you haven’t seen it yet.\n\nFirst off: the brotherhood. The camaraderie between recruits under pressure, the friction, the breakdowns, the reunions—every bit of it felt *real*. You’ll find yourself rooting for them when they clash, and cheering when they pull together.\n\nNext: the character work is super nuanced. None of the characters are just “soldiers in training”—each has layers, vulnerabilities, secrets. That makes them all worth your time.\n\nAnd yes—it *does* explore hidden identities. Sgt. Sullivan (played by Max Parker) is this tough-as-nails, by-the-book drill instructor, but beneath the bark there’s a closeted truth, a personal weight. Parker nails it. \n\nWhile the first season sets things up brilliantly, there are still threads left open—so yes, I’m all in for Season 2!!!\n\nIf you’re into shows that blend **military grit + growth + brotherhood + queer undercurrent**, this is your kind of watch.\n\nSo… who else has seen it? Which character struck you the most? And what do you hope to see in Season 2?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opmkvl/boot_camp_brothers_in_arms_a_secret_selfwhy_boots/"
    },
    {
        "id": "1opjhly",
        "author": "Upstairs-Film-3400",
        "title": "How to stop automatic trailers after show but keep previews on main menu?",
        "content": "Is it possible? I tried un checking the box that says to automatically play previews but it also affects the automatic previews while you're browsing the maine menu. I WANT to see a little preview of each show to give me an idea of it. I do NOT want Netflix to play five billion trailers in a row after my movie is over and I'm either digesting what I just saw or falling asleep or whatever lol. \n\nPlease, is there a way to just change one of these things? Why in the world can't they be separate things in settings? They're definitely two very different things?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opjhly/how_to_stop_automatic_trailers_after_show_but/"
    },
    {
        "id": "1opn6jx",
        "author": "baguetteworld",
        "title": "Why does Uncle Joe keep speaking English in Rabo de Peixe (Turn of the tide)?",
        "content": "Not sure what the best sub is for posting this question, but Rabo de Peixe is a show about an Azores island in the Atlantic but uses all Portuguese mainland actors. However one of the characters, Uncle Joe, is also the narrator and his character spent a bit of time in the US but now lives back in the same island he was born in. However in the show he keeps speaking English to all the Portuguese characters (I mean he’s also Portuguese himself), and they respond in PT and everyone just chugs along. It just strikes me as very weird when both the actor and the character are supposed to be Portuguese first and foremost. Any idea why?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opn6jx/why_does_uncle_joe_keep_speaking_english_in_rabo/"
    },
    {
        "id": "1op3ez5",
        "author": "misterpopculture",
        "title": "Xolo Maridueña Joins Season 3 of Netflix’s One Piece",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op3ez5/xolo_maridueña_joins_season_3_of_netflixs_one/"
    },
    {
        "id": "1opdtxj",
        "author": "IYAMCANADIAN",
        "title": "Netflix App Won't Launch?",
        "content": "Anyone else had difficulty getting the Netflix App to launch on their new Windows 11 computer?\nAfter days of troubleshooting, and watching endless YouTube videos I discovered the fix.\n\nBecause I despise Microsoft Edge, I had disabled it.  Microsoft Edge is a necessary component to launch the Netflix App.  \n\nHopefully this post will save at least one other person some time and frustration.\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opdtxj/netflix_app_wont_launch/"
    },
    {
        "id": "1opdpa2",
        "author": "LandscapeNarrow5352",
        "title": "'Overcooked' Reality Competition Series Based On Game Set At Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1opdpa2/overcooked_reality_competition_series_based_on/"
    },
    {
        "id": "1opjby5",
        "author": "Pretty-Bit-9997",
        "title": "Four Seasons-Nick",
        "content": "I was in disbelief that Nick died until the following episode lol. Life is fast and that was definitely a reality check. That funeral was terrible 😂. Also, how couldn't they afford a nicer funeral and actual burial? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opjby5/four_seasonsnick/"
    },
    {
        "id": "1opidk3",
        "author": "Big-University-7198",
        "title": "Show or film recs?",
        "content": "Hi guys, recently got a Netflix account and I’m not sure what the watch! Here are some of my favourite watches for context: \n\nnon- english: \n- evening drink style\n- solitary gourmet \n- dr. romantic \n- panchayat \n\nenglish: \n- gilmore girls \n- gossip girl\n- the 100 \n- superstore\n- b99\n- house\n\n(all are very very basic i know) \nmany thanks, this is just a background of all my favourite tv shows! i mainly like either slice of lifes that are semi boring and peaceful or really really dramatic pieces. no in between. and please No friends, no big bang theory, i tried and hated both! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1opidk3/show_or_film_recs/"
    },
    {
        "id": "1oph1tg",
        "author": "EdmontonBest",
        "title": "Not enough historical/ docudrama content. Why?",
        "content": "Even though they aren’t perfect, Netflix’s docudramas like Roman Empire, The Romanovs, Age of Samurai, Rise of Empire Ottomans inspire me to learn more about history. I like them. But Netflix doesn’t really release them often, despite them being much more cheaper to produce than some of their blockbuster films and shows. I’m happy to see the new drama about President Garfield being released tomorrow, I simply wish they created more historical content regularly in the first place to cater to those who enjoy non-fiction (there’s dozens of us). ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oph1tg/not_enough_historical_docudrama_content_why/"
    },
    {
        "id": "1oomxpo",
        "author": "graemeisverytired",
        "title": "Daniel Craig reads each new Knives Out script like his character - and doesn’t want to have the mystery spoiled for him in advance",
        "content": "“I read them, I suppose, like Benoit... I’m trying to sort of get in Benoit’s head. I don’t read it wanting to know who the murderer is; I want to know what the whole is,\" Craig began. He also added that he told writer-director Rian Johnson, \"I don't want to know!\" when asked by him if he wanted to know who the killer was beforehand. ",
        "upvotes": 63,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oomxpo/daniel_craig_reads_each_new_knives_out_script/"
    },
    {
        "id": "1op9t9y",
        "author": "Havince01",
        "title": "House of dynamite secretary of defence",
        "content": "See lots of posts on the film but literally none in regards the secretary of defence \n\nConsidering was such a sad shocking moment \n\nHe literally couldn't live knowing his daughter was going to be killed in the explosion",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1op9t9y/house_of_dynamite_secretary_of_defence/"
    }
]