[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 78,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lu60pk",
        "author": "Fernsjjf",
        "title": "Alice in Borderland: Season 3 | Official Teaser | Netflix",
        "content": "Can't wait to watch. this will be the final chapter of the Alice of the Borderland series. We will finally get to know what is going happen and who is the mastermind behind this games.",
        "upvotes": 154,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1lu60pk/alice_in_borderland_season_3_official_teaser/"
    },
    {
        "id": "1lu55y7",
        "author": "Funny_Obligation2412",
        "title": "The old guard 2 sucked",
        "content": "Hi everyone,\n\nI was really excited to watch this. I liked the 1st one. I thought the idea was fun. Then the old guard 2 came along and I really thought it sucked big time.\n\nThis 2nd one seemed rushed with no good dialog and story line. The fight scenes looked cheap and slow. No explanation on what's going on. Uma's acting was bad.\n\n2 out of 10. Don't watch it.\n\n",
        "upvotes": 127,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1lu55y7/the_old_guard_2_sucked/"
    },
    {
        "id": "1lunkmp",
        "author": "refdeser",
        "title": "Trainwreck : The real Project X",
        "content": "Just finished watching it, crazy how something that started as a joke turned into a disaster overnight. I’ve never heard about this incident before, so if anyone from the Netherlands could share some insights, that’d be awesome. Did the documentary cover everything, or were some parts left out? Super curious to know more about what really happened.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lunkmp/trainwreck_the_real_project_x/"
    },
    {
        "id": "1lusgbd",
        "author": "indiewire",
        "title": "Megan Stalter on ‘Too Much,’ Lena Dunham, and Playing Characters Who Are ‘Confident and Nervous at the Same Time’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lusgbd/megan_stalter_on_too_much_lena_dunham_and_playing/"
    },
    {
        "id": "1ltp7ox",
        "author": "Indoril-Nerevar337",
        "title": "Viewership Wasn't Enough: Netflix Has Canceled Two More Series After Just One Season",
        "content": "",
        "upvotes": 338,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1ltp7ox/viewership_wasnt_enough_netflix_has_canceled_two/"
    },
    {
        "id": "1lut5rx",
        "author": "Popular-Soil-8748",
        "title": "why does my full screen keep flickeringg",
        "content": "i turned off graphics acceleration, i changed the cursor size and made it obnoxiously large and teal, and yet it is still glitching. ive tried basically every trick in the book and nothings worked at all. this didnt happen before and i havent tinkered with settings until now cuz im not a tech person so i have no idea whats going on ",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/51y3tqfagobf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lut5rx/why_does_my_full_screen_keep_flickeringg/"
    },
    {
        "id": "1luroq0",
        "author": "S4v1r1enCh0r4k",
        "title": "Into the Wild: Netflix Drops Trailer for Chilling Murder Mystery ‘Untamed’ Set in Yosemite",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1luroq0/into_the_wild_netflix_drops_trailer_for_chilling/"
    },
    {
        "id": "1ltwfia",
        "author": "InformationSuperb597",
        "title": "Best/ most addictive shows to watch?",
        "content": "Hi! I’m struggling to find a new show to watch. I’m a 23 year old female, and some shows I have enjoyed are: Greys anatomy, the resident, The Pitt, Stranger things (was obsessed. OBSESSED.), Jane the Virgin, Never Have I ever, The Last of Us, Wednesday, Only Murders in the Building, etc. Any recommendations for me? I’m at a loss with finding a good show to watch. ",
        "upvotes": 86,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1ltwfia/best_most_addictive_shows_to_watch/"
    },
    {
        "id": "1lul1tk",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Unveils Chilling Teaser for Italy’s Most Disturbing Unsolved Serial Killer Case",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lul1tk/netflix_unveils_chilling_teaser_for_italys_most/"
    },
    {
        "id": "1lupazk",
        "author": "Educational-Tie2406",
        "title": "Help for a divorced friend",
        "content": "Hello all. Thanks in advance for your help. A good friend of mine recently got divorced. Her ex is a real POS. To keep this short his job affords him significant down time at the house so he set up all of their electronic world - all accounts, security codes, etc. When the divorce was final he didn’t share any of that information with her and she’s spent the last few months trying to take back one account at a time. \n\nShe’s onto Netflix now. She knows he’s still using the Netflix she pays for because after he moved our profiles showed up on her Netflix when that hadn’t been there before. She has no idea what the password is. Is there some solution to this?  This POS doesn’t deserve his free Netflix. I’d love to hear how angry the phone call is when he sits down to watch it and realizes he’s been kicked out of the account he created but doesn’t pay for. \n\nTL;DR: would like to know how to get someone off of a Netflix account when you don’t know the password. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lupazk/help_for_a_divorced_friend/"
    },
    {
        "id": "1lulzg1",
        "author": "PiMama92",
        "title": "Tired of getting kicked out of my own household",
        "content": "Anybody really sick of the glitches with the household settings? I'm not home often and I usually watch on my phone  while my step daughter watches at home on her hotspot (we don't have home WiFi because we're not home enough to justify the added expense) and every single day it forces me to update the household. it's pushing me to cancel which sucks because I enjoy a lot of their exclusives, but the hassle just isn't worth it. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lulzg1/tired_of_getting_kicked_out_of_my_own_household/"
    },
    {
        "id": "1luihld",
        "author": "Indoril-Nerevar337",
        "title": "Anime Is Booming on Netflix as Half of Users Now Watch It",
        "content": "",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1luihld/anime_is_booming_on_netflix_as_half_of_users_now/"
    },
    {
        "id": "1lup2rr",
        "author": "OK-Loki123",
        "title": "Netflix's Abrupt / Intrusive Ads (That Start Without a Break/Cut to Black)",
        "content": "I recently noticed that Netflix's ads have felt weirdly more intrusive than other streaming services, and I think I figured out why: they don't cut to black before they jump into a commercial!\n\nHere's an example from \"The Queen's Gambit\": [https://youtu.be/JPpU6UuJKvM](https://youtu.be/JPpU6UuJKvM)\n\nOther streaming services (e.g., Max and Disney+) have at least a few black frames to demarcate their ads, but Netflix doesn't -- one frame is the show, and bam! the immediate next frame is the ad. I'm guessing this was deliberate -- a sneaky/subtle way to trick your brain for a split second to think the ad is part of the show and retain your attention.\n\n(\\*I'm not 100% sure, but it also looks like the frames might even be blended to make it even more \"seamless,\" but that could be a separate frame rate issue with my camera. Here's one example: https://imgur.com/a/a1DPC6l)\n\nI googled this left and right, but couldn't find any discussions about this. Has anyone else noticed this/posted about this? I don't know if this is a new thing, but there's definitely been a recent spike in the number of times I'm watching something on Netflix and I'm momentarily confused about why the Squid Game man is suddenly looking at a Chipotle burrito.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lup2rr/netflixs_abrupt_intrusive_ads_that_start_without/"
    },
    {
        "id": "1lurobi",
        "author": "lovenyula",
        "title": "Why do you think K-POP DEMON HUNTERS got so popular?",
        "content": "I work in the animation industry and I am really intrigued by how well KDH did comparing to Pixar's Elio (which came at the similar time).\n\nI am curious what about this film made you interested - I have also made my own video analysis (from a more professional perspective where I break down the logline) and curious to think how much it resonate with you! \n\n[https://www.youtube.com/watch?v=WMgmMIC1JiE&amp;t=43s](https://www.youtube.com/watch?v=WMgmMIC1JiE&amp;t=43s)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lurobi/why_do_you_think_kpop_demon_hunters_got_so_popular/"
    },
    {
        "id": "1ltl89p",
        "author": "Top-Three-USA",
        "title": "Netflix Says Over 50% of Global Users Watch Anime, Unveils Major New Slate at Anime Expo",
        "content": "",
        "upvotes": 192,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ltl89p/netflix_says_over_50_of_global_users_watch_anime/"
    },
    {
        "id": "1lub0nc",
        "author": "443610",
        "title": "What has been preventing Japanese originals from getting their videos (teasers, trailers, and the like) uploaded to the main Netflix YouTube channel lately?",
        "content": "After a long wait, [the first official teaser for Season 3 of Alice in Borderland](https://youtu.be/CaWRDITtT1U) is here. It is shockingly the first Japanese video this year to make it to the main Netflix YouTube channel, rather than merely the regional channels.\n\nThe trailer of Asura, the remake of the 1970s family drama, did not make it. Neither did that of Bullet Train Explosion, a modern reimagining of the action-thriller movie from that same decade that is said to have inspired Keanu Reeves' breakout hit Speed. More recently, the musical drama Glass Heart failed to get its trailer onto the main channel as well.\n\nThat is a major decline from last year, which saw FOUR Japanese originals get even just their official trailers onto the main channel: House of Ninjas, City Hunter, The Boyfriend, and The Queen of Villains. And judging by the attention (or lack thereof) given to 10Dance and Last Samurai Standing, I will be pleasantly surprised if either makes it as well.\n\nMeanwhile, South Korea has had healthy representation (barring the numerous works that remain stuck on that country's channel). Obviously there is the final season of Squid Game, but other originals have also had their official trailers hit the main channel. There is Mercy for None, aka the Korean John WIck. There is Weak Hero Class 2. There is even When Life Gives You Tangerines, arguably the first K-Drama to make it. Even Revelations, whose teaser and first trailer were not uploaded to the main channel, got its final trailer in.\n\nThat leaves only five other Japanese (true) originals (not counting Giri/Haji, which first aired on BBC2) whose official trailers have made it to the main channel (at least in my memory):\n\n* Followers (this one actually came before Alice in Borderland)\n* First Love\n* The Makanai: Cooking for the Maiko House\n* Zom 100: Bucket List of the Dead\n* Yu Yu Hakusho\n\nThe last three of them came out in 2023. That means in the span of two years, seven Japanese official trailers made it to the main channel - a major leap in marketing. But now, a downturn.\n\nIt even extends to the ancillary videos on the Still Watching Netflix channel. Squid Game, just to name a Korean example, has had many of them there. Alice in Borderland? Two, one for each season. The rest have had none - not even YuYu Hakusho and City Hunter, which were adapted from famous manga.\n\nHeck, they even streamed the Squid Game Season 3 launch party! Alice in Borderland might not get the same privilege for its own third season.\n\nSo what gives? Why has Netflix stopped significantly promoting its Japanese originals this year after a somewhat strong streak? Let me know in the comments!",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lub0nc/what_has_been_preventing_japanese_originals_from/"
    },
    {
        "id": "1luin82",
        "author": "InspectionSenior8161",
        "title": "Repeatedly hacked",
        "content": "My account has been hacked 3 times in 3 weeks, every time i change my password they leave it a week and re hack me. I spoke to Netflix support and they assured me all devices had been kicked off my account when my password had been changed, 2 days later my Netflix had been changed to Spanish and had a pin on. Is there anything I can do to prevent this or should I just cancel my subscription? This only seems to be happening since I switched over to the offer that comes with sky tv but I don’t really want to go back to paying full price…",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1luin82/repeatedly_hacked/"
    },
    {
        "id": "1luic4q",
        "author": "UltraDragonGod",
        "title": "Anyone else get this glitch when trying to watch WWE (UK)",
        "content": "I'm in the UK so I usually watch Raw a few hours after the show has finished in the morning, I watch it on my phone and the stream is completely fine as long as I don't skip any part of it or come off it.\n\nIf I do however use the 10 second skip forward or back the show just completely resets to the beginning? The timer doesn't move at all though as if the stream is still on the same part and not the start of the show.\n\nIf I force close the app and watch again the timer goes to the start again and I'll skip forward to try and go back to where I was, it'll start playing a certain segment but when it cuts to an ad break it'll just reset again. \n\nAnyone else get this glitch? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1luic4q/anyone_else_get_this_glitch_when_trying_to_watch/"
    },
    {
        "id": "1luhrzd",
        "author": "Overall-Context5455",
        "title": "Spatial Audio Not Working",
        "content": "Hey guys! I have a premium subscription of Netflix that supposedly supports Netflix Spatial Audio. I also own a Mac M4 model and a pair of AirPods 4 with ANC. However, the Spatial Audio feature that is supported by the recent titles (as mentioned under them in info) is not working. I can't see the option to toggle it on/off in my AirPods noise control section on my Mac. \n\nCan someone help me get it to work, or check if it's working?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1luhrzd/spatial_audio_not_working/"
    },
    {
        "id": "1lun9et",
        "author": "IAssureYou08",
        "title": "Martha Eyes Says Everything 🥹💜...",
        "content": "The Eyes chico, They Never Lie...\nMartha and Jonas eyes at the ending says everything and that was my most favourite scene in the whole series 🥹, And They finally did it at the end and.,\nThey're perfect for each other, They Never believe anything else...",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/h5kc4zl39nbf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lun9et/martha_eyes_says_everything/"
    },
    {
        "id": "1lucy3l",
        "author": "SPINKIRBY23TIMES",
        "title": "Does anybody have any recommendations?",
        "content": "More specifically, movie recommendations. Usually a big fan of action or thriller movies, but I have nothing against dramedys, or comedies. Just not solely dramas. Perferably under 2 hours and 15 minutes, no more than 2 and a half hours. ",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lucy3l/does_anybody_have_any_recommendations/"
    },
    {
        "id": "1lufvnk",
        "author": "madladchad3",
        "title": "007 from Squid Game doing side quests",
        "content": "https://youtu.be/5ka5NJcTeBk?si=gYxuqr5h4BhEmIbj\n\n\nMany people don’t know that 007 aka YDG is a famous/legendary musician here in Korea. He was a child actor and started to do hiphop/reggae when he grew up. Enjoy!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lufvnk/007_from_squid_game_doing_side_quests/"
    },
    {
        "id": "1ltdkl1",
        "author": "anonymous_teenage",
        "title": "The lincoln lawyer is sooooooo underrated!!!!!!!",
        "content": "Idk why people dont talk about this show its soo good. Like each season has its own crazy story and plotlinee like i cant believe the plot twist this show has. I want more people to talk about this show and i cant wait for s4 its such a long wait. ",
        "upvotes": 176,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ltdkl1/the_lincoln_lawyer_is_sooooooo_underrated/"
    },
    {
        "id": "1lti8gx",
        "author": "Mindless_Tax_4532",
        "title": "What are some good feel-good comfort shows?",
        "content": "I've been down lately and I'm looking for a good show to help cheer me up. I said \"feel-good comfort shows\" into the voice search on my remote and the first show it suggested was Dateline.... I think not lmao. So I thought I'd come here to ask for suggestions.\n\nNot much has been able to make me laugh lately, but in general I enjoy comedies, and especially musicals or musical comedies, but I am open to other suggestions. Just not anything that will make me even more depressed. Thanks!",
        "upvotes": 83,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1lti8gx/what_are_some_good_feelgood_comfort_shows/"
    },
    {
        "id": "1lubz8n",
        "author": "GingerCat77977",
        "title": "Ginny and Georgia",
        "content": "Is Netflix going to add Ginny and Georgia profile icons? Another question I have is what shows get the profile icons? Because some Netflix original shows don't have them.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lubz8n/ginny_and_georgia/"
    },
    {
        "id": "1lutbq7",
        "author": "aikikiki_123",
        "title": "Anyone wanna share netfilx???",
        "content": "Indian living in Bangalore wanna get multiple screens of netflix cus too many restrictions at home, even though im a 19-year-old. So hit me up!! \n\n\n\nonly women though cus the internet is a scary place and ive read too many articles to trust any men online, sorryy!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lutbq7/anyone_wanna_share_netfilx/"
    },
    {
        "id": "1ltye8t",
        "author": "Least_Morning2698",
        "title": "Cassandra would work SO MUCH BETTER as an analog horror",
        "content": "TW: spoilers\n\nI found this show couple days ago and watched almost all of it in one sitting, just finished the second half of the last episode rn and need to pour out my thoughts somewhere. The 70s arc of the main character was the best to watch, even though it was the most emotionally charging part, ngl at some point i was watching it only for her human scenes, because of the vibe (and because i could rest from the uncanny valley).\nThe only part i don't like in it is her son shooting his bullies and never getting caught, it's naive for me.\n\nStill, I'm pissed about the plotholes, like why the house stayed empty for such a long time with a robot inside and the decomposed body in one room, why their rentor haven't checked it first? Where are the squatters? Like an ABANDONED INTELLIGENT HOUSE FROM THE 70s WITH A TRAGEDY ATTACHED TO IT, it sounds like an urbexers wet dream, so again, you want me to believe, that in 50 years nobody got inside? \nAnd better, that nobody found the deceased child in the room OR the robot herself and if someone found them, they didn't go to police with it?\n\nAlso Samira's husband is written so insufferably, he gets more clueless and abusive with every episode, from consequently gaslighting her wife, through sending her to psych ward, cause she's scared of the old, uncanny valley robot, that tried to harm her 3 times previosly, to trying to kill her, because Cassandra said so🤣. I don't think he was meant to be so stupid as a character, he just turned out like that. Juno is weirdly infantilized, like she was playing kindergarten games with Emily, aren't they 9 years old? WHY she didn't drop out of school?? And WHY IN THE LAST EPISODE BOTH OF THE PARENTS WERE OUTSIDE THE HOUSE AT SOME POINT AND DIDN'T INFORM THE POLICE? LIKE AAAHAGAHSHXHHSKAUSH\n\nBut while watching all of it and being absolutely enchanted with her 70s plotline i started to think, that Cassandra's story would work better as an analog horror series, than as a netflix show.\nGood analog horrors are a rarity rn, i think that after Gemini Home Entertainment and The Walten Files everyone keeps copying. It saddens me, that the idea for her story was already used by netflix, cause it has so much potential for this different form.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ltye8t/cassandra_would_work_so_much_better_as_an_analog/"
    },
    {
        "id": "1lu4n80",
        "author": "DaddysPrincess4eva",
        "title": "The “After” series.",
        "content": "I LOVE Tell Me Lies on Hulu! After the second season of it I was trying to search and find another show/movie that resembled Tell Me Lies, whenever I would search for that, this “After” series would always get recommended. I see that it’s like 5 movies. I also see that it’s about a relationship, love and college which relates to Tell Me Lies BUT is it as dark, passionate and crazy as Tell Me Lies? Does it keep as glued to the screen and always guessing what’s gonna happen?Is it just another dumb love story? Or is it actually good and worth the watch? Just curious about everyone’s opinion on this series. Thanks in advance for everyone advice!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lu4n80/the_after_series/"
    },
    {
        "id": "1lu3ddq",
        "author": "Affectionate_Fan2001",
        "title": "Summer recs",
        "content": "Heyy guyss!!\n\nWhat are some binge worthy summer vibes tv shows to watch??\n\nI was thinking about My Life with the Walter Boys but idk, did you like it?? Do you recommend somthing else?\n\nThank you in advance, xoxo!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lu3ddq/summer_recs/"
    },
    {
        "id": "1lt3rus",
        "author": "NoWhereNorth-II",
        "title": "Sandman S2 is out - who remembers S1?",
        "content": "\nI have had enough with Netflix disappearing for years between seasons. The Sandman S2 is out approx 3 years after S1. I do not remember S1 and I have had enough rewatching old seasons. \n\nAnd Netflix cannot blame the pandemic, they have been releasing content throughout the past 3 years. \n\nI have made a vow never to watch a new season if it is too far out that I cannot recall the previous season. \n\nNetflix needs to reconsider how they prioritize their content investments. \n\nDo you feel the same?",
        "upvotes": 173,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lt3rus/sandman_s2_is_out_who_remembers_s1/"
    }
]