[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 41,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kv1862",
        "author": "adobongmelk",
        "title": "what's a movie/series on netflix that you've ignored for a long time but ended up being very good when you watched it?",
        "content": "i've been doomscrolling on netflix all day looking for something good to watch but i just can't seem to like anything. i end up just rewatching my favorite movies lol.",
        "upvotes": 311,
        "comments": 534,
        "media": null,
        "permalink": "/r/netflix/comments/1kv1862/whats_a_movieseries_on_netflix_that_youve_ignored/"
    },
    {
        "id": "1kvcffe",
        "author": "Pessimistic_Gemini",
        "title": "It baffles me how Netflix never improves the inaccurate subtitles for a lot of their foreign content at all.",
        "content": "I just saw my mother watching some foreign nonsense called The Sea Beyond earlier today. Not sure what it's all about, didn't really give a dang to find out. All I know about it was that it's another random foreign show Netflix has in its catalog, and it is one with horrid translation issues. And with this one, it's the worst I've ever seen with any of them as the subtitles were on as she watched it and literally NOTHING was matching what the actors, or rathe yet the DUBBED actors, were reciting or saying AT ALL!\n\nThat's been a major issue I've had with Neflix for years now when it comes to how they handle captions and subtitles for foreign shows and here, it's far more worse than any other one I've seen. I don't know why they never fixed that issue, but when it comes to the hard of hearing, it really does them a disservice more when they don't realize what they're reading doesn't match of to what they're watching.\n\nEspecially when they're charging nearly thirty bucks a month for the bloody thing. With all that they could've been able afford to improve their subtitle tech. Use AI on that for improved accuracies or something , if they want. ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kvcffe/it_baffles_me_how_netflix_never_improves_the/"
    },
    {
        "id": "1kv5jpt",
        "author": "dicedtomatoes55",
        "title": "Director Behind Feel-Good Netflix Hit 'Nonnas' Also Created a Super-Dark Apocalypse Series 20 Years Ago",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kv5jpt/director_behind_feelgood_netflix_hit_nonnas_also/"
    },
    {
        "id": "1kvcbcx",
        "author": "Scherzi_00",
        "title": "Im searching for a film",
        "content": "Hey guys i am searching for the name of a film that im pretty sure i‘ve watched on netflix. It was like a horror movie that played in a like summer camp with a group of friends i think. I think it played in the 80s-90s. And there was a murderer with all black clothes i think. After and after the murderer gets on of the kids till no one is left over. The acting was like simmiliar to a scary movie film (horror with a little bit of comedy i think) i rember an exact scene where the murderer put a guy with a black leather jacket in an oven.",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kvcbcx/im_searching_for_a_film/"
    },
    {
        "id": "1kv94cl",
        "author": "No-Repair-8176",
        "title": "Changing Netflix Plan",
        "content": "Hey. Does anyone have the 7.99 monthly plan? How frequent are the ads and how good is the picture? I’ve had Netflix since 2016 and I’m thinking of changing the plan. I currently have the 24.99/month subscription. Thanks",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kv94cl/changing_netflix_plan/"
    },
    {
        "id": "1kvibfh",
        "author": "9kLevix",
        "title": "Total amount of seasons of Total Drama? (CANADA)",
        "content": "Remembered about a few months ago I saw that total drama had all of the seasons available on Netflix, I recently checked and saw that it only has season 1. In short, how many seasons of total drama are available of Netflix for Canadian users, I’ve seen people say Canada should have all of the seasons and perhaps there could be a glitch with mine.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvibfh/total_amount_of_seasons_of_total_drama_canada/"
    },
    {
        "id": "1kvhvcr",
        "author": "Confident-Push6681",
        "title": "Physiological Thriller",
        "content": "Suggestions needed!!! Or any kind of dramas like Harlen Coben writes. Love twist and turns.  I watched Caught, Secrets We Keep, Strangers…. What are you watching?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kvhvcr/physiological_thriller/"
    },
    {
        "id": "1kvd845",
        "author": "SugarKun15",
        "title": "My Netflix keeps doing this and I just can’t watch anything like this, any fix ?",
        "content": "",
        "upvotes": 2,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ko3ke0ceuz2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kvd845/my_netflix_keeps_doing_this_and_i_just_cant_watch/"
    },
    {
        "id": "1kuxg99",
        "author": "takenforgranted_19",
        "title": "Netflix Recommendation Needed",
        "content": "Hey everyone,\n\nI'm feeling super bored and in desperate need of a good show or movie to dive into on Netflix. I'm a huge fan of the thriller and mystery genres — love anything that keeps me on the edge of my seat or has a solid \"whodunit\" vibe.\n\nWould really appreciate your recommendations!\n\nThanks in advance!\n\n\n\n",
        "upvotes": 15,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kuxg99/netflix_recommendation_needed/"
    },
    {
        "id": "1kvdvbc",
        "author": "log1234",
        "title": "Picking two caption languages",
        "content": "Is it a good idea for Netflix to allow us to pick two caption languages? So we can learn and see the original language and the language we speak. It could suit language learners and young people who want to learn new languages. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kvdvbc/picking_two_caption_languages/"
    },
    {
        "id": "1kvcgxf",
        "author": "PlentyIllustrious216",
        "title": "Premium Added Account?",
        "content": "Hey Netflixers!\n\n  \nI was was wondering if you are able to add a premium account member to ta Netflix account?  Was currently added as a ad standard membership but the series I want to watch is only available for premium accounts...what do?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kvcgxf/premium_added_account/"
    },
    {
        "id": "1kvbgpd",
        "author": "ThenTomorrow508",
        "title": "Why are the last 20 minutes missing?",
        "content": "Today my father told me his movie was cut at the end and he couldnt watch the whole movie till the end? I thought he was joking until i opened it up on my ipad and on our smart tv to compare!! And the last 23 minutes of shaolin soccer is really missing? It shows up on my ipad but not on tv im very confused. Can i fix this?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kvbgpd/why_are_the_last_20_minutes_missing/"
    },
    {
        "id": "1kvchk5",
        "author": "SplitNational2929",
        "title": "Mom said we have Lilo &amp; Stitch at home: Netflix’s Finding Ōhāna",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvchk5/mom_said_we_have_lilo_stitch_at_home_netflixs/"
    },
    {
        "id": "1kutu3h",
        "author": "Boolinks",
        "title": "Netflix \"Household Policy\" Issue",
        "content": "My Netflix account has randomly started saying my account \"isn't part of the household\" when trying to watch tv in my guest house. It's literally on the property - is there a way to sort this out? I can bypass for a brief period of time by getting a code texted to me but It's becoming a nuisance.",
        "upvotes": 10,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kutu3h/netflix_household_policy_issue/"
    },
    {
        "id": "1kvfi6n",
        "author": "innmate-2863",
        "title": "Important Petition",
        "content": "Everyone who has viewed the new remaster of *Grave of the Fireflies* on Netflix should come support this petition. If by chance you have listened to the newest English dub featured may also agree, its translations voice casting, and direction has improved by far. The film is due to release on officially licensed home media in July, so it should most definitely have the newest dub.\n\nClick here to view the petition: [http://chng.it/myy94QhqKf](http://chng.it/myy94QhqKf)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kvfi6n/important_petition/"
    },
    {
        "id": "1kv42m3",
        "author": "casul_noob",
        "title": "WWE old episodes on netflix",
        "content": "Bruh when are they gonna update it? I mean how long does it really take? Are they intentionally delaying uploading older RAW and SMACKDOWN episodes? I have been following storyline and now stuck in 2000 as there are no new episodes.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kv42m3/wwe_old_episodes_on_netflix/"
    },
    {
        "id": "1kv41tr",
        "author": "ZealousidealPin7825",
        "title": "YOU",
        "content": "Just finished season 5 of YOU and that last episode mahnnnnn.\nI don't know how to feel about it. \nDid I cry during the last few episodes? Yes \n\nSuddenly I don't see the point of love...\nEspecially when one holds trauma deep in them ... \n\nBecause in the end ... After the honeymoon phase is over ... I feel like it's just wrong for your partner to heal wounds they had no part in forming... \n\nSlowly you see their smile fade from their eyes. See the exhaustion take over. \n\nIt sucks for both ends tbh. \n\nIs love really a thing in this century or are we all full of trauma just seeking to find a safe space? \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kv41tr/you/"
    },
    {
        "id": "1kuubpn",
        "author": "InternationalBake360",
        "title": "Signing in every time you watch??",
        "content": "This is becoming so fucking annoying. We have 5 TV’s all in the same house - all on the same WiFi - and every single time we try to use Netflix on any of our tv’s it’s forcing its “confirm your account bs” I’m one bad day away from cancelling this. The audacity must be on sale for them to think this is appropriate over and over and over again. I hate you Netflix. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kuubpn/signing_in_every_time_you_watch/"
    },
    {
        "id": "1kv2e7x",
        "author": "FutureHendrixBetter",
        "title": "Did they remove animal kingdom?",
        "content": "I watched some of episode one the other week and now when I wanted to finish the rest I can’t find it. I even tried to go through google and it says it’s not available in my county. I’m in the U.S. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kv2e7x/did_they_remove_animal_kingdom/"
    },
    {
        "id": "1kv0rny",
        "author": "S4v1r1enCh0r4k",
        "title": "Here's What's Leaving Netflix in June 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kv0rny/heres_whats_leaving_netflix_in_june_2025/"
    },
    {
        "id": "1kujo36",
        "author": "smcneal",
        "title": "A Deadly American Marriage: Interview with Jason Corbett's daughter",
        "content": "",
        "upvotes": 20,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kujo36/a_deadly_american_marriage_interview_with_jason/"
    },
    {
        "id": "1kv00fs",
        "author": "Some-Air1274",
        "title": "What was the point of sirens?",
        "content": "Just watched this yesterday and I am a big fan. But what was the point of it in reality?\n\nWhy did it end with Simone marrying Pete instead of everyone getting back together?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kv00fs/what_was_the_point_of_sirens/"
    },
    {
        "id": "1kuzkeu",
        "author": "Significant_Tree3109",
        "title": "What do you think about the end of you season 5",
        "content": "I realy Love the series you But i dont Like the end where joe Goldberg get a prisoner in jail.\nThe other episodes where very good and intresting \nWhat do you think ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kuzkeu/what_do_you_think_about_the_end_of_you_season_5/"
    },
    {
        "id": "1kuj27n",
        "author": "Affectionate_Fan2001",
        "title": "What should I watch?",
        "content": "I've watched all these shows and now i don't know what's next. If you could give me some names i would really appreciate it. It doesn't have to be only similar to this list, you could write anything that made you binge watch it. Thanks!!\n\n* La Casa de Papel\n* Teen Wolf\n* Alta Mar\n* Titans\n* Prison Break\n* Once Upon a Time\n* Outer Banks\n* Pretty Little Liars\n* Riverdale\n* Anne with an E\n* Fate: The Winx Saga\n* Stranger Things\n* Shadow and Bone\n* How to Get Away with Murder\n* Rise of Empire\n* Dahmer\n* Mindhunter\n* Alice in Borderland\n* Squid Game\n* Bridgerton\n* Elite\n* The Sandman\n* Alchemy of Souls\n* My Demon\n* Death’s Game\n* Berlin\n* Burning Body\n* The Chosen\n* The Perfect Couple\n* Dear Child\n* The Fall of the House Usher\n* Wednesday\n* Inside Man\n* Monsters\n* Criminal Minds\n* Kaos\n* Breathless\n* Lucifer\n* House of the Dragon\n* Black Doves\n* XO Kitty\n* AHS: Murder House\n* The Hunting Party\n* The 100\n* You\n* The Umbrella Academy\n* 911 Lonestar\n* Emily in Paris\n* The White Lotus\n* Yellowstone\n* Grey’s Anatomy\n* The Rookie\n* AGGTM\n\nEDIT: I WANT TO THANK ALL OF YOU FOR TAKING YOUR TIME TO READ AND ANSWER MY QUESTION !! I WILL READ ALL OF YOUR COMMENTS AND YOUR RECS WILL BE ADDED TO MY WATCHLIST. It’s gonna take some time to get through all of these but i really appreciate it. Guys, you saved me🫶🫶🫶",
        "upvotes": 16,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1kuj27n/what_should_i_watch/"
    },
    {
        "id": "1kuskk6",
        "author": "starwarden2245",
        "title": "How to fix full screen problem",
        "content": "I have a windows 11 laptop and whenever I watch Netflix on the app in full screen the shows tends to glitch and move as shown in the vid. It doesn’t happen when playing on non fullscreen and also doesn’t happen with other apps like YouTube. Anyone know how to fix this issue? It rlly bothers me cuz it takes out of the watching experience ",
        "upvotes": 3,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pdqlv6iffu2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kuskk6/how_to_fix_full_screen_problem/"
    },
    {
        "id": "1kv9unl",
        "author": "Fit-Assignment8593",
        "title": "WHY DID NETFLIX RICK ROLE US",
        "content": "Ok so new fear street out watching it today after binging the first 3 (hoping there is more one coming out 🤞) and about 20 mins in when the prom starts BOOM rick roll ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kv9unl/why_did_netflix_rick_role_us/"
    },
    {
        "id": "1kuxcrc",
        "author": "wrighttoby",
        "title": "Why is there a storage limit for Smart Downloads?",
        "content": "Hi it's my first post here,\n\nI have been recently running into this issue where I cannot set Netflix's Smart Downloading feature to use more than 9.5gb of storage and don't know why this is a case, I have tried this on both Android 10 and Android 15 thinking it might of been a container-based issue with the way Google have Implemented a feature that restricts what files apps have access to, I found this wasn't the case and I thought this might of just been a cap assigned by netflix probably because of licencing, I tried searching this up and I found that this cap seemed to be undocumented as of my current research and so I don't know if this is just a problem with me. I do have Netflix Premium so I don't know why this could be a problem since it's noted that premium has more features compared to the other plans and it just says I can download on up to 6 supported devices at a time but never specified how much I could download.\n\nI am a person that notices every aspect of quality change and like my downloaded content to be at least 1080p.\n\nSorry i had to use this account, I didn't have enough karma on my \"main\".",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kuxcrc/why_is_there_a_storage_limit_for_smart_downloads/"
    },
    {
        "id": "1kuv7yx",
        "author": "Puzzleheaded_Elk996",
        "title": "Psycho on Netflix",
        "content": "The original Hitchcock film. I don't know why, but the quality and resolution of the version on Netflix feels off. Could someone explain why to me? Thank you if you read this.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kuv7yx/psycho_on_netflix/"
    },
    {
        "id": "1kuh3ej",
        "author": "Equivalent_Phrase_25",
        "title": "I think cyberpunk is one of the best anime’s of all time",
        "content": "Ik no one’s gonna agree and say I don’t watch enough anime but hear me out. All I really watch is sci-fi and anime and when theirs a sci-fi anime I get real excited. I watched cyberpunk awhile ago obviously but it’s still my 3rd favorite anime ever. 1.) attack on titan 2.) demon slayer which is another hot take but whatever. I’m not a big fan of the very long anime’s like one peice or Naruto but if I was I would probably include them. I’m not including romance anime’s because most of them low-key all follow the same format but maybe just different names / looks. Does anyone agree about my take? I loved the scenario , the characters, the backstories , the futuristic look. ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kuh3ej/i_think_cyberpunk_is_one_of_the_best_animes_of/"
    },
    {
        "id": "1ktwl7m",
        "author": "Creative-Ad-1363",
        "title": "Loudermilk is oddly comforting",
        "content": "Just discovered this hidden gem. It's been around for a few years.\nLoudermilk is an addiction counselor with a motley crew of devotees that attend his regular meetings in a catholic church.\n\nThe cast are mostly men, and there are some gross moments (doll episode).\n\nAnja Savcic is the only regular woman casted. They manage her presence nicely without being overly sexual, which I can appreciate. \n\nThe show also mingles comedy with hard topics such as living with disabilities, misogyny, and failure really well. \n\nI've rewatched it several times, especially when winding down at night or if there's nothing else to watch (skipping the doll episode). \n\nAnyone else find this show oddly comforting? ",
        "upvotes": 222,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1ktwl7m/loudermilk_is_oddly_comforting/"
    }
]