[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1o7qh13",
        "author": "lithdemi",
        "title": "So many Netflix shows get cancelled before their story is done — which one still haunts you?",
        "content": "I was talking with some friends about how shows like Warrior Nun and The OA got pulled even with solid fanbases.\n\nCurious what everyone here thinks:\n\n– Which cancellations hurt the most?\n– Which one could actually come back if fans organized?\n\n(I’m helping run a community that’s discussing this across fandoms, so I’m collecting opinions.)",
        "upvotes": 47,
        "comments": 244,
        "media": null,
        "permalink": "/r/netflix/comments/1o7qh13/so_many_netflix_shows_get_cancelled_before_their/"
    },
    {
        "id": "1o712m6",
        "author": "sftradersf",
        "title": "Netflix has gone to the dogs",
        "content": "Just tried to watch and finish Cabin 10, which was “#1 in the movies today,” and it’s the worst show they’ve put on in ages. I think this streaming service has seriously jumped the shark \n\nIt’s been a little over a year now but it seems as if every single new show is just a horrific plot trying to garner some kind of notoriety or great experience and it’s just the exact opposite. I’m so disappointed with everything they seem to put out that I now think it’s time to call it. They’re just awful now!",
        "upvotes": 752,
        "comments": 444,
        "media": null,
        "permalink": "/r/netflix/comments/1o712m6/netflix_has_gone_to_the_dogs/"
    },
    {
        "id": "1o7af4r",
        "author": "Secretly-Aware",
        "title": "Kingdom has to be the best piece of “zombie” media I’ve seen.",
        "content": "I was blown away by the quality of this show and don’t know why everyone isn’t talking about it. If you like zombie stuff, please go watch this show. If you don’t like zombie stuff, go watch it. The storyline is so complex and there are so many nail-biting political plots going on that there are entire episodes where I forgot that zombies exist. Love the alternate 17th century world-building, love the character development, love the HATS, people just go watch this for the hats alone and you won’t be disappointed.",
        "upvotes": 75,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1o7af4r/kingdom_has_to_be_the_best_piece_of_zombie_media/"
    },
    {
        "id": "1o6zb2y",
        "author": "GuineaPKilledMe",
        "title": "The Woman in Cabin 10 is such an eye rolling, boring movie",
        "content": "The entire movie just felt so flat to me. I couldn't even be on the main character's side because she started acting so deranged from the start I couldn't even blame the other characters for distancing themselves or being rude towards her. It felt like some sort of weird Gone Girl style movie (I admit, i'm not a Gone Girl fan, I found that movie itself to be pretty boring)\n\nWhat are some other thoughts whether positive or negative you guys had on this movie?",
        "upvotes": 353,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1o6zb2y/the_woman_in_cabin_10_is_such_an_eye_rolling/"
    },
    {
        "id": "1o7ioo7",
        "author": "Dazzling_Schedule365",
        "title": "Looking for shows with that Breaking Bad vibe",
        "content": "Hey *Breaking Bad* community,\n\nI’m truly grateful to have finally watched *Breaking Bad*. I can’t believe I had been missing such a masterpiece for so long. Now that I’ve finished the series, it has left me feeling both happy and sad at the same time.\n\nI’m wondering if there are any other shows out there with a similar vibe — cartels, building an empire, and that intense atmosphere I loved so much. If you have any recommendations, please feel free to share them.",
        "upvotes": 13,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1o7ioo7/looking_for_shows_with_that_breaking_bad_vibe/"
    },
    {
        "id": "1o6we9v",
        "author": "reverze",
        "title": "Monster: Ed Gein was horrific.",
        "content": "It was mostly inaccurate from start to finish. 80% of it was the most ridiculous made up trash. At one point the entire show seemed like they were saying I should feel bad for Ed. ",
        "upvotes": 333,
        "comments": 247,
        "media": null,
        "permalink": "/r/netflix/comments/1o6we9v/monster_ed_gein_was_horrific/"
    },
    {
        "id": "1o7loq0",
        "author": "Nook_6",
        "title": "Recommendations for a mini series that ends properly please",
        "content": "I’ve watched a few of the Harlan Coben adaptations on Netflix. They were mostly decent, some I liked more than others.\nThen I started watching other mini series and I keep getting disappointed. \nThe most recent two were “The Watcher” and “Wayward”. I felt like they had such good potential and I was intrigued to say where they’re going, but then the endings were just terrible.\nSo please, if you could recommend a short series with a decent story and a proper, thought out ending, that’d be great!\nI don’t care about genres, I watch everything.\n\nThank you! ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o7loq0/recommendations_for_a_mini_series_that_ends/"
    },
    {
        "id": "1o7oxev",
        "author": "Transposer",
        "title": "My Netflix App (on iPad Pro 10.5”) is telling me that the Netflix app requires an update to work starting today, 10/15. Problem is, the Netflix update requires iOS 18, which is not supported by my iPad Pro. Can I still get Netflix to work on iOS 17??",
        "content": "When I google Netflix app requiring iOS 18, my hits say that it requires iOS 17, but that’s not what the Netflix app says for me.  \n\nAny tips on how to get around this or download a Netflix app that is newer than my version but one that still doesn’t require iOS 18 (which apparently my iPad doesn’t make the cut for)?",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o7oxev/my_netflix_app_on_ipad_pro_105_is_telling_me_that/"
    },
    {
        "id": "1o7mmay",
        "author": "hexflicksarts",
        "title": "13 Commandments deserves way more love than it gets.",
        "content": "I stumbled on **13 Commandments** almost by accident. No hype, no big marketing push , just me, late at night, looking for something that didn’t feel like a cookie-cutter cop drama. And honestly? It hit me in a way I didn’t expect.\n\nThis show isn’t just another crime thriller. It’s morally uncomfortable in the best possible way. The story doesn’t give you easy answers. It makes you sit with the gray, with the parts of society we like to pretend don’t exist. Watching the vigilante twist the Ten Commandments into a chilling moral crusade… it’s both horrifying and fascinating. It’s the kind of story that crawls under your skin and lingers.\n\nWhat really got me though, was the **emotional realism**. The characters aren’t shiny heroes or cardboard villains. They’re flawed humans dealing with trauma, guilt, belief, and vengeance. The detective’s slow unraveling. The media frenzy. The way society reacts when morality is hijacked. It’s raw, unfiltered, and painfully relevant.\n\nI think the reason 13 Commandments flies under the radar is because it’s not a “background show.” You can’t scroll your phone while watching it. It demands your attention, it dares you to judge, and then it quietly flips your judgment back on you.\n\nIf you liked shows like **True Detective** (Season 1 especially), or **Mindhunter**, this will hit that same nerve , but in its own, distinct European way. \n\nThis show deserved more conversation than it got. It’s one of those gems that remind me why I love TV: because sometimes, the most haunting stories are the quiet ones no one talks about.\n\nAnyone else feel this way about it?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7mmay/13_commandments_deserves_way_more_love_than_it/"
    },
    {
        "id": "1o7rkpc",
        "author": "SleppyAlien",
        "title": "shows like Brooklyn 99 and Psych plz!!",
        "content": "i love both of these shows, and i can only rewatch them so many times, so any good recs? keep in mind i've already watched the good place, and couldnt finish the office cuz it was too boring for me. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o7rkpc/shows_like_brooklyn_99_and_psych_plz/"
    },
    {
        "id": "1o7r2ue",
        "author": "JoonieBeeJones",
        "title": "Buttons not displayed during streaming",
        "content": "Using google chrome on desktop. When im streaming, all of the buttons are gone. the next button, maximize/minimize, volume, subtitles, back etc. Chrome is up to date. they just randomly disappeared a few weeks ago and its driving me crazy that I cant maximize my screen or add subtitles! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o7r2ue/buttons_not_displayed_during_streaming/"
    },
    {
        "id": "1o7qjuz",
        "author": "Jade_Jones",
        "title": "Can I get the old strange things pfp back",
        "content": "I change a profile pic to another one real quick and tried to change it back to the yellow will profile pic again but they change the Netflix icons and I can’t change it back, it’s not appearing in the history ethier.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7qjuz/can_i_get_the_old_strange_things_pfp_back/"
    },
    {
        "id": "1o71gc2",
        "author": "Ok_Builder_310",
        "title": "I just finished watching 6 feet under",
        "content": "The last episode completely killed me 😭 I didn’t even like the show to begin with but I’m someone that has to finish a show if I started it. I really started to love it after a while and this last season broke me. Especially the last episode. I’m not okay 😭 ",
        "upvotes": 33,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o71gc2/i_just_finished_watching_6_feet_under/"
    },
    {
        "id": "1o7p425",
        "author": "ryoshamo",
        "title": "Can’t find a section for “new” or “recently added” films",
        "content": "I found one for series but not for movies. I know  new films have the recently added badge but sifting through rows of collections when all you want is to see what’s new is terribly annoying. Is there even a coming soon section anymore?  ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o7p425/cant_find_a_section_for_new_or_recently_added/"
    },
    {
        "id": "1o7m65i",
        "author": "Ok-Air4774",
        "title": "Sharing Account",
        "content": "Hello, I share a Netflix account with my family. We all watch no problem at home in the US. However, I am studying abroad for the semester in Europe, and since I am not on my home wifi, I can't use the account. Is there any way around this? It's such a dumb rule. I tried my personal hotspot, but no luck. Thanks\n\n\n\nText says:\n\nYour device isn't part of the Netflix Household for this account\nNot ____ @gmail.com? Create an account to enjoy your own Netflix today.\n\nCreate an Account\n\nDid we get it wrong? Watch temporarily until you're back on your Netflix Household Wi-Fi or sign out.\n\nWatch Temporarily\nSign Out",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o7m65i/sharing_account/"
    },
    {
        "id": "1o7knwp",
        "author": "Character-Leek5269",
        "title": "All my watch history is gone, i was multiple seasons into a show before it all disappeared",
        "content": "can someone figure out why its messed up, or am i just screwed, the show i was watching was My Hero Academia, before it disappered, i searched it up, clicked on it, and it said \"season one episode one\" i have no idea how far i was &gt;:( if its fixable pls HELP",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o7knwp/all_my_watch_history_is_gone_i_was_multiple/"
    },
    {
        "id": "1o7jjy7",
        "author": "MysteriousDelay6266",
        "title": "A Merry Little Ex-Mas | Official Trailer | Netflix | NOVEMBER 12",
        "content": "# A Merry Little Ex-Mas\n\nAlicia Silverstone &amp; Oliver Hudson\n\nThis holiday season, sometimes the messiest Christmas is the most memorable.\n\n* Only on Netflix **NOVERMER 12**.\n\nRecently divorced Kate (Alicia Silverstone) is determined to pull off one last perfect family holiday before selling her beloved home. But when her ex-husband Everett (Oliver Hudson) shows up with his younger, picture-perfect new girlfriend, Kate’s holiday dream spirals into chaos. With comedy, heart, and plenty of holiday drama, A Merry Little Ex-Mas also stars Jameela Jamil, Pierson Fodé, and Melissa Joan Hart, directed by Steve Carr.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7jjy7/a_merry_little_exmas_official_trailer_netflix/"
    },
    {
        "id": "1o7il0f",
        "author": "ToonAdventure",
        "title": "VIEW Conference: Animation's Future of Storytelling",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7il0f/view_conference_animations_future_of_storytelling/"
    },
    {
        "id": "1o72ngh",
        "author": "slickmoney11",
        "title": "Barely any new Halloween/scary movies this year",
        "content": "The fuck is netflix doing bro? Their halloween section includes a bunch of shows and movies that were already there. Usually they add a bunch of cool shit but im not seeing much. Not to mention there isnt even a dedicated halloween or scary movie section in THE MOVIE SECTION of netflix. Also has anyone noticed only tv shows appear on the homepage now? It seems they really dropped the ball this year man. For reference its netflix canada so might be different for other users, but im fairly dissapointed ",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o72ngh/barely_any_new_halloweenscary_movies_this_year/"
    },
    {
        "id": "1o6zx3s",
        "author": "AccomplishedPut5175",
        "title": "Caramelo❤️",
        "content": "I just watched this movie, and I simply have no words. At the same time, I was crying and laughing like crazy. Whether it's because I have a dog too, or the overall story of the film, I don't know. But what I do know is that this movie is a 10/10. It's a must-watch, with a warning to prepare for a big dose of emotions.☘️🍀",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o6zx3s/caramelo/"
    },
    {
        "id": "1o7cpm4",
        "author": "ChallengeAdept8759",
        "title": "How realistic is the nuclear threat in Netflix’s ‘A House of Dynamite’?",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o7cpm4/how_realistic_is_the_nuclear_threat_in_netflixs_a/"
    },
    {
        "id": "1o7buc8",
        "author": "Dry_Pressure_5249",
        "title": "modem",
        "content": "tv’m modeme bağlı netflix izlerken sıkıntı yok fakat modeme pc’yi bağladığım zaman tv ‘de netflix izleyenlerin görüntü kalitesi çok bozuluyor internetim 100mb fakat böyle bir sorun yaşıyoruz?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o7buc8/modem/"
    },
    {
        "id": "1o6rsbz",
        "author": "broomboy101",
        "title": "Can anyone recommend me a drama show?",
        "content": "I’m looking for one that isn’t boring that will almost always have me on the edge of my seat. I really liked shameless u.s there was always shit going down in that. I also liked breaking bad, but normally I stick to watching sitcoms. But now I want to find more shows like those that have dramatic tension and you’re dying to know what’s going to happen. ",
        "upvotes": 17,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1o6rsbz/can_anyone_recommend_me_a_drama_show/"
    },
    {
        "id": "1o74p7p",
        "author": "hexflicksarts",
        "title": "Why the Upper East Side in Gossip Girl Never Felt the Same After Season 4",
        "content": "You ever rewatch **Gossip Girl** and notice that something shifts around Season 4? It’s subtle at first , like the sparkle’s still there, but the edge, the bite, the tension that made the show feel alive starts to fade. The Upper East Side stops feeling like a battleground and more like a fashion runway.\n\nThe early seasons had this intoxicating cocktail of chaos. Every episode felt like a tug-of-war between privilege and pain. It wasn’t just about who wore what, it was about who would survive the social hurricane. By Season 4, the show had climbed so high into its own mythology that it started to lose that New York grit that once grounded it. The parties got flashier, the scandals bigger, but the consequences smaller. Blair and Serena stopped feeling like complex women navigating identity and started becoming plot devices in an endless carousel of recycled love interests. Even Dan, once our moral compass , turned into a caricature of the self-righteous artist.\n\nIt’s not that the show got bad , it just lost its danger. Remember how early Gossip Girl made you feel like you were peeking into a forbidden world, one text away from social annihilation? That electric fear , that’s what vanished. The Upper East Side became too forgiving, too polished, too safe.\n\nWhat are your thoughts on this?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o74p7p/why_the_upper_east_side_in_gossip_girl_never_felt/"
    },
    {
        "id": "1o6hftv",
        "author": "Jack_Micheals04",
        "title": "Ryan Murphy is such a hypocrite",
        "content": "I just finished a painful watch of the Ed Gein story and I’m just in shock as to how this got produced. This series really highlights the hypocrisy and inability to tell a story on Ryan Murphy’s behalf.\n\nI’m under the impression that the Monsters series is meant to help empathize with serial killers by showing the abuse they endured, as well to highlight the societal impact these cases have when they are so sensationalized. The main point of the Ed Gein story that I picked up on was that serial killers stories are misconstrued time and time again, and this has negative impacts, like glorifying violence and desensitizing audiences towards situations like this. Such is completely ironic.\n\nThe exact irony this show is trying to call out is simultaneously partaking in that irony on a whole new level. \n\nEd Gein never had an infatuation with “isle Koch” and “isle Koch” never had comic books made about her. Ed Gein also never had a fiance she was completely fictional for this series. Ed Gein also never had any contact with “Birdman”, and it was never corroborated that he had any romantic affiliation with the shop owner he murdered. I could go on about the historical inaccuracy’s of this show. And I understand some artistic liberties need to be drawn to help tell a story, but these plot lines really had no correlation towards telling his story, and were completely made up for the sake of entertainment, it dilutes his story and shows a complete hypocrisy in the shows mission.\n\nIn my opinion a gritty docuseries about his actual life would have been hard hitting. He lived a boring isolated life, and yeah that would have made for less drama in the show, but it would have struck a nerve with the audience. It could have highlighted a truth that I think is extremely interesting; that anyone with a similar mental health disorder could have easily committed the same crimes that Ed Gein did, if their condition where left untreated and consumed by isolation, grief, and childhood trauma. That Ed Gein could have been a peaceful (yet eclectic) member of society if access to mental health care was available to him. \n\nThat would have really driven the shows moral standpoint clearly. That we are all vulnerable, and all deserve empathy, and that media never shows the real truth (and the negative consequences of that).\n\nInstead we got Birdman shaking his boobs in Ed Geins face, and a dance montage of Ed walking up to heaven while owner of a lonely heart plays 😂 pure brain rot.\n\n",
        "upvotes": 41,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1o6hftv/ryan_murphy_is_such_a_hypocrite/"
    },
    {
        "id": "1o76o9f",
        "author": "Princessomani",
        "title": "New to C drama .. newbie newbie",
        "content": "Which C drama on netflix with eng subtitles would you recommend for someone who just wants to binge watch this weekend? Have been boored with k drama recently ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o76o9f/new_to_c_drama_newbie_newbie/"
    },
    {
        "id": "1o75l8x",
        "author": "hard2resist",
        "title": "Which websites tell you the monthly best suspense or thriller movies from all regions of Netflix?",
        "content": "I'm looking for websites that curate monthly lists of the best suspense and thriller films available on Netflix, beyond Rotten Tomatoes. I need resources that provide yearly compilations so I can easily identify top-rated titles from all regional Netflix libraries.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o75l8x/which_websites_tell_you_the_monthly_best_suspense/"
    },
    {
        "id": "1o69ekl",
        "author": "TheHippyWolfman",
        "title": "I enjoyed \"Wayward,\" this is my review",
        "content": "I enjoyed Wayward. As a matter of fact, I thought it was pretty good. I *did* go into it with absolutely no expectations, simply clicking the link after a brief look at the description. A critique I would have is that the eight episode format felt, to me, sort of limiting. There was a lot that was touched on but not really elaborated upon in a satisfying way. The show may have benefitted from either being shorter and more concise, in order to remove elements that were either unnecessary or improperly explored, or longer, so as to deal with these issues in a more coherent manner and to keep some of the plot points from having such a rushed execution. \n\nThat being said, if you’re down for a wild, and somewhat tonally inconsistent, ride, then there is fun to be had here. I found it relatively easy to get invested in the characters and their lives. The show was, at turns, endearing, unsettling and downright disturbing. There were twists I honestly didn’t expect and ended up enjoying (sometimes despite the execution and not because of it, but whatever). The psychological drama, I thought, was more often than not well done and satisfying. The fact that one pair of protagonists are teenagers and the other pair are adults allows the series to walk the line between teen and adult drama without fully committing to either audience, and maybe being accessible to both (but I will leave that for you to decide). In terms of acting, some performances were more memorable than others, but I found nothing unserviceable and the main antagonist to be delightfully both creepy and easy to hate. \n\nOverall, I feel as if I was able to feel satisfied with the series because I went into it with very little hype. It certainly wasn’t a masterpiece, but it gave me eight hours of solid entertainment and left me wanting to know *more-* about the characters, their pasts and their inevitable fates. That’s the primary pro and con of this series: it is like walking through a museum and looking at its portraits of people and landscapes. You are looking at \"snapshots\", and what both intrigues and frustrates about the experience is that each piece *suggests* so much to the mind, in terms of questions, speculations and fantasies, but the ultimate satisfaction of these suggestions occurs only in our imaginations.\n\nI have not settled on a rating yet, but I liked it, and my initial recommendation is to watch if you’re into some creepy cult-thriller fun with a heavy dose of teenage angst and a penchant for leaving you with more questions than answers. \n\n*I press post. I am sitting in a chair. I am crying out for the upvotes...*",
        "upvotes": 72,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1o69ekl/i_enjoyed_wayward_this_is_my_review/"
    }
]