[
    {
        "id": "1h9uj4w",
        "author": "BunyipPouch",
        "title": "Join us Monday 12/9 at 3:00 PM ET for a live AMA/Q&amp;A with Ryan J. Smith, writer/director of 'Kid' - An ambitious music producer races to finish his debut album under a make-or-break record deal, all whilst navigating a tumultuous family life.",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5eqb62bq7p5e1.png?auto=webp&amp;s=3f980f552efd5e7d43359867efcd0122fa926cfc"
        },
        "permalink": "/r/movies/comments/1h9uj4w/join_us_monday_129_at_300_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1h9u8kv",
        "author": "BunyipPouch",
        "title": "Join us Tuesday 12/10 at 3:00 PM ET for a live AMA/Q&amp;A with Alessandra Lacorazza and Lio Mehiel, writer/director and co-star of the two-time Independent Spirit Award nominee drama film 'In The Summers'",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pz1p5lbg7p5e1.jpeg?auto=webp&amp;s=3f3bec0d5756e03070829379cb96e25271a534fc"
        },
        "permalink": "/r/movies/comments/1h9u8kv/join_us_tuesday_1210_at_300_pm_et_for_a_live/"
    },
    {
        "id": "1ha0t0x",
        "author": "CYBOZAX_",
        "title": "District 9 is great original film.",
        "content": "A recommendation post of this film suddenly popped on my Instagram feed and I thought I should give it a try. I'm glad that I did.\n\nI knew nothing about the film other than the fact that it has aliens in it (thought that it was an alien invasion movie).\n\nNever in my life did I imagine that a film can make me sympathize with aliens and hate humans. Everything about this film is perfect. The documentary style narrative worked so well in this movie. Sharlto's character arc is simple yet so effective and beautiful. This is the most realistic film featuring aliens that I have ever watched. It made me believe that something like this can truly happen. To show aliens as refugees instead of invaders somehow felt so realistic and fresh.\n \nAnother thing that I loved about the film was it's pacing. It's perfectly paced and never drags or dips in quality. The film has a runtime of 1 hr 56 mins but it felt like I finished it in 30 mins.\n\nThe ending made me cry which no other film has ever managed to do (grave of the fireflies being an exception).\n\nThe only thing that I personally felt was slightly off in this film (it may be a little nit picky) was that it was starting to lose a little bit of its realism, but it gets back to the point eventually.\n\nIn short, District 9 is a unique film with great screenplay, Awesome performances (Sharlto especially), Beautiful yet haunting frames and some of the best social commentary I have ever watched in any film.\n\nHighly recommend if you haven't already watched it.",
        "upvotes": 779,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1ha0t0x/district_9_is_great_original_film/"
    },
    {
        "id": "1h9rcag",
        "author": "reddithawara",
        "title": "What's the most satisfying defeat of a bad guy in movie history?",
        "content": "I mean Lord of the Rings probably has to be up there, but I also really liked how they brought down Terry Benedict in Oceans 13 - even though the movie probably is no cinematic masterpiece 😄 \nMaybe we can also include series if you feel like something has earned it's place here.\n\nLooking forward to the suggestions and happy discussion! 😄🙌🏻\n\nEdit: Clarification",
        "upvotes": 3160,
        "comments": 2400,
        "media": null,
        "permalink": "/r/movies/comments/1h9rcag/whats_the_most_satisfying_defeat_of_a_bad_guy_in/"
    },
    {
        "id": "1h9l5bg",
        "author": "MarvelsGrantMan136",
        "title": "Brendan Fraser‘s Next Movies, ‘Rental Family’ &amp; WWII Drama ‘Pressure’, Have Wrapped Fiming",
        "content": "",
        "upvotes": 2318,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TaNIioYsKdFemb7KZMINnc3MHparzQALqhoW4ZKel3w.jpg?auto=webp&amp;s=97916f3d51ef6bd9462dd46aa0ad99867f53529e"
        },
        "permalink": "/r/movies/comments/1h9l5bg/brendan_frasers_next_movies_rental_family_wwii/"
    },
    {
        "id": "1ha5b7r",
        "author": "ChiefLeef22",
        "title": "10 years on, Interstellar is fascinating precisely because of what so many wags pegged as its fatal flaw back in 2014: its unabashed, teary emotionality.",
        "content": "",
        "upvotes": 100,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LsrinhNprvjyOlh7Lj0PJe3dWOTUlKVZnREQiviYwSA.jpg?auto=webp&amp;s=46b52578a66d3a831ef2b9813e2009b62d7b832b"
        },
        "permalink": "/r/movies/comments/1ha5b7r/10_years_on_interstellar_is_fascinating_precisely/"
    },
    {
        "id": "1h9wpnu",
        "author": "MarvelsGrantMan136",
        "title": "David Tennant to Return as BAFTA Film Awards Host",
        "content": "",
        "upvotes": 394,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3tHqZKSm1wXH4TY5gnC3H7OxIxCWUDmmZeWVrzNex10.jpg?auto=webp&amp;s=b93fe60ea0a9f6127d1be39bd310d4235c707b6a"
        },
        "permalink": "/r/movies/comments/1h9wpnu/david_tennant_to_return_as_bafta_film_awards_host/"
    },
    {
        "id": "1h9v3a4",
        "author": "Task_Force-191",
        "title": "From the World of John Wick: Ballerina (2025) 'CCXP Extended Look' - Ana de Armas, Norman Reedus",
        "content": "",
        "upvotes": 483,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wskSDBKekf2GGktugQ_n3XV7lyd-FbgmRSjwJgb7Q-w.jpg?auto=webp&amp;s=73800d2a18257042682bea1616a1ebc002105e60"
        },
        "permalink": "/r/movies/comments/1h9v3a4/from_the_world_of_john_wick_ballerina_2025_ccxp/"
    },
    {
        "id": "1ha0e5g",
        "author": "Either-Evening9649",
        "title": "What actually illegal happened in Weekend at Bernie’s?",
        "content": "Other than the murder obviously but i’m referring to what Larry and Richard did. I know they took his watch.. but does not calling the police right away make them an accessory to murder? impeding/delaying a police investigation? defiling a dead body? what laws specifically did they break that could get them in trouble?",
        "upvotes": 209,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1ha0e5g/what_actually_illegal_happened_in_weekend_at/"
    },
    {
        "id": "1h9waoj",
        "author": "Puzzled-Tap8042",
        "title": "Max Expands TCM Hub with Hundreds of Classic Titles in Major New Curatorial Investment\n",
        "content": "",
        "upvotes": 361,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3WREQinNFbCYYIv-tpc8zScJRkDzKK0Uy6eVlGJtz3k.jpg?auto=webp&amp;s=dc609053ff45ea523e134b3239ea8ba0ecd36894"
        },
        "permalink": "/r/movies/comments/1h9waoj/max_expands_tcm_hub_with_hundreds_of_classic/"
    },
    {
        "id": "1h9whqn",
        "author": "KillerCroc1234567",
        "title": "Anora Wins Best Picture At 50th Los Angeles Film Critics Association — Full Winners List",
        "content": "",
        "upvotes": 300,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rb7QNlnRZdnFdOBMXcvElJDhv4iml2aIxlnVgIb5vrE.jpg?auto=webp&amp;s=25a413a9dd9ae46a4619f3e0036691c924681fb3"
        },
        "permalink": "/r/movies/comments/1h9whqn/anora_wins_best_picture_at_50th_los_angeles_film/"
    },
    {
        "id": "1ha1hrb",
        "author": "Odd_Advance_6438",
        "title": "I was very impressed by Chris Evans with that monologue in Snowpiercer",
        "content": "Fantastic movie all around, but I have to say it really showed me what he was capable of as an actor. I mean I always enjoyed him in stuff like the Knives Out and the MCU. He’s great in those, but I wasn’t expecting the pretty heart wrenching monologue he gives about all his guilt.\n\nThe line that sticks out to me the most is when he says “you know the thing I hate most about myself? That I know what people taste like.”",
        "upvotes": 101,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1ha1hrb/i_was_very_impressed_by_chris_evans_with_that/"
    },
    {
        "id": "1ha2xe2",
        "author": "Due_Assist_7614",
        "title": "\"The Lovely Bones:\" A New Add to My Least Favorite Movies List",
        "content": "I just saw the movie \"The Lovely Bones\" for the first time and fucking despise it. Obviously, I don't think all movies need a happy ending, but it's the way the ending is framed that disgusts me. I interpret the message as basically, don't be so preoccupied with justice; just let nature take its course and let the promise of a peaceful afterlife pacify you. \n\nI came to this conclusion because the murderer just dies via natural causes instead of going through the justice system, paired with (emphasis on \"paired with\" since I know most murders aren't solved irl) the guide in the afterlife telling the murdered girl \"everyone dies\" to make her less angry about her murder, how negatively the father's search for the killer is portrayed, and the lack of urgency the sister has after she finds evidence of the murder. Absolutely revolting. \n\nI also don't appreciate the watering down of the rape the book had featured, I mean, it's not even mentioned in the movie. Just maybe briefly alluded to, with the murderer calling the girl pretty and asking if she had a boyfriend, as well as him only having female victims. And rape sure as hell isn't a minor thing that happens to \"everyone.\" The complete erasure of the very real reality of sexual violence, its impact on victims, and its connection to femicide disgusts me. Way too sanitized. \n\nFurthermore, I could almost go as far as to say the \"cool grandma\" character supports this lackadaisical attitude towards pedos with her fondly recalling enjoying her first kiss with a \"grown man\" at the beginning of the movie and her telling the murdered girl's mom to just \"live with it\" less than a year after the murder.\n\nIt's crazy to me that I don't see more about how much this movie trivializes violence against women and children.\n\nFinally, and this is a lesser critique, but I don't think the perpetuating of the \"weird looking, creepy stranger\" pedo stereotype is particularly helpful when most victims of pedos are at the hands of people who aren't strangers, and in fact, many are superfically charming and attractive.\n\nThis movie isn't completely irredeemable, as I do find the build up before the girl is murdered very accurate to experiences I've had with scary men, and I like the scene where she discovers that she's dead, but damn, this shit mostly sucks.",
        "upvotes": 66,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1ha2xe2/the_lovely_bones_a_new_add_to_my_least_favorite/"
    },
    {
        "id": "1h9ts7o",
        "author": "xjoeyxxx",
        "title": "Little things that really annoys you in movies?",
        "content": "What things in movies that for many people seem irrelevant, and unimportant, are really annoying for you and you pay a lot of attention to them?\n\nFor me it's how bad friendgroups are made in movies. In many films there are basically like three/four couples and they are called \"friends\", but half of them didn't even have a single conversation. I really like when friendships are developed, and I love when everyone had at least one interaction with each other.\n\nLet me know! English is not my first language!",
        "upvotes": 200,
        "comments": 787,
        "media": null,
        "permalink": "/r/movies/comments/1h9ts7o/little_things_that_really_annoys_you_in_movies/"
    },
    {
        "id": "1h9wg7i",
        "author": "gingerboi__",
        "title": "Movies like Cloverfield, Godzilla, War of the Worlds.",
        "content": "Im looking for movies like these, where there is constant chaos, running away, big monsters or aliens, fighting, end of the world etc. I'm currently watching Greenland, which is a very good end of the world movie so far, and anything like these movies would be appreciated. I'm very into War of the Worlds, I think it's one of the greatest concepts turned into a movie of all time. Found Footage movies like Project X are incredible at creating an atmosphere, so anything like that will be good too. Thanks!",
        "upvotes": 71,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1h9wg7i/movies_like_cloverfield_godzilla_war_of_the_worlds/"
    },
    {
        "id": "1h9ge32",
        "author": "Mundane-Turnover-913",
        "title": "How much do you think James Bond entering the public domain, will change his movies going forward?",
        "content": "In 2035, all of Ian Fleming's original James Bond 007 novels, will enter the public domain. This means that anyone can make projects about these original books, including film adaptations. We've already seen non-Eon Productions Bond films in the past with Casino Royale 1967, and Never Say Never Again, but this will be a whole different ball game. \n\nThere are of course restrictions, like studios not being able to use anything made up for the movies, like the iconic opening gun barrel sequence. \n\nBut what do you think? With Eon notoriously prioritizing other projects like Othello over the highly anticipated Bond 26, could it be a good thing that other studios will get a crack at Bond? Or will it dilute the brand and ruin everything they've been building up since 1962?",
        "upvotes": 677,
        "comments": 263,
        "media": null,
        "permalink": "/r/movies/comments/1h9ge32/how_much_do_you_think_james_bond_entering_the/"
    },
    {
        "id": "1h95qyl",
        "author": "MarvelsGrantMan136",
        "title": "Dorothy’s Ruby Slippers from 1939’s ‘The Wizard of Oz’ Sell for Staggering $28 Million at Auction",
        "content": "",
        "upvotes": 5045,
        "comments": 280,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rlY6aEK2ts4mUaf8N3umdUKHbgJupZqBoqY9BEF1UkQ.jpg?auto=webp&amp;s=3505affcbed902c16c4ae7bd944be7469b2912b2"
        },
        "permalink": "/r/movies/comments/1h95qyl/dorothys_ruby_slippers_from_1939s_the_wizard_of/"
    },
    {
        "id": "1h9pfkj",
        "author": "Little_Power_5691",
        "title": "Do you get more critical of movies when you get older?",
        "content": "When I was a teen, I liked pretty much everything in my favorite genres and I enjoyed the highly rated movies from other genres. These days, I find that a lot of it is pretty \"meh\" for me. Last week I was catching up on a few movies that have been praised: I, Tonya, Everything Everywhere All at Once and Anatomy of a Fall. While I enjoyed them somewhat, I found none of them amazing. It rarely happens anymore that a movie amazes me. Everything feels a bit like I've seen it before. In fact, I get most enjoyment out of watching 90s movies, that feels like one big nostalgia trip for me.\n\nI wonder whether this is a normal process, that you end up liking the stuff you discovered as a kid best? Or maybe the introduction of streaming services has brought about a decline in movie quality?",
        "upvotes": 137,
        "comments": 243,
        "media": null,
        "permalink": "/r/movies/comments/1h9pfkj/do_you_get_more_critical_of_movies_when_you_get/"
    },
    {
        "id": "1h9p4sp",
        "author": "KillerCroc1234567",
        "title": "DEMON SLAYER: KIMETSU NO YAIBA INFINITY CASTLE - Official Trailer (HD)",
        "content": "",
        "upvotes": 112,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RTbLfZ9DjOMkqqhfMoKTNNhVEAWWROoBu7W5L4RcIkg.jpg?auto=webp&amp;s=90cbd6d1fe5bd587abc70e436a45df2d5b947e36"
        },
        "permalink": "/r/movies/comments/1h9p4sp/demon_slayer_kimetsu_no_yaiba_infinity_castle/"
    },
    {
        "id": "1h8y1pp",
        "author": "MarvelsGrantMan136",
        "title": "Hans Zimmer’s Score for ‘Dune: Part Two’ is Officially Ineligible for the Oscars and BAFTAS",
        "content": "",
        "upvotes": 12995,
        "comments": 546,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vy0PpyYTwPtsN0qiZSJq28qLp5EtfBhStKU1CG82lMg.jpg?auto=webp&amp;s=4e9d3d0e73884ebf881eb935403654c389d6b24c"
        },
        "permalink": "/r/movies/comments/1h8y1pp/hans_zimmers_score_for_dune_part_two_is/"
    },
    {
        "id": "1ha2w38",
        "author": "Active-Leg9326",
        "title": "Who are the most well written antagonists in horror movies?",
        "content": "After a decade of avoiding horror movies like the plague, I've finally caved. This weekend I finished watching 'Us' and 'The Exorcist'...I felt incredibly idiotic knowing that I've potentially missed out on masterpiece films all these years. The #1 thing that gets me attracted to any film is a well written antagonist/villain who I can understand, relate to, or flat out despise. Who are some of your pics for best antagonists in the horror genre?",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1ha2w38/who_are_the_most_well_written_antagonists_in/"
    },
    {
        "id": "1h9bzre",
        "author": "Yet_Another_Guy_1123",
        "title": "Should long movies have intermissions?",
        "content": "I recently watched Wicked. It's a great movie, check it out if you got the time. But it is 2 hours and 40 minutes long. A 10-minute intermission would be cool. It would allow the audience to get up, get some more popcorn, and use the washroom. That being said; not all movies need one. If the movie is just 90 minutes long, an intermission would not make any sense. So only movies that are longer than 120 minutes (might) need one.\n\nBut what is your thoughts on it? Should studios put an intermission in movies or not?",
        "upvotes": 612,
        "comments": 433,
        "media": null,
        "permalink": "/r/movies/comments/1h9bzre/should_long_movies_have_intermissions/"
    },
    {
        "id": "1h9qyqx",
        "author": "Spreehox",
        "title": "What are some other actors' 'eternal sunshine of the spotless mind'",
        "content": "By this i mean, what are some really standout roles from otherwise comedic actors, that completely surprise you from your perception of the actor.\n\nI think eternal sunshine is a great example, in the late 90s jim carrey had a bunch of comedic movies where he played the same character in all if them. But, eternal sunshine is completely different and maybe his best performance imo.\n\nWhat are other examples of this? Actors you thought had limited range completely surprising you.",
        "upvotes": 47,
        "comments": 241,
        "media": null,
        "permalink": "/r/movies/comments/1h9qyqx/what_are_some_other_actors_eternal_sunshine_of/"
    },
    {
        "id": "1h9mq57",
        "author": "jay-__-sherman",
        "title": "Han’s Zimmer’s score for Interstellar",
        "content": "I was fortunate enough to get IMAX 70MM tickets for a showing. Of Interstellar’s re-release last weekend.\n\nObvious love for the visuals aside. One thing that I did not appreciate when I saw this film 10 years ago was the stakes and what was happening to the characters. Being that this was Nolan’s first original film since Inception, I was focused a lot more on the visual spectacle, along with wondering if I could “solve” his movie like many tried to after Inception released.\n\nI can say after seeing the film this weekend that as incredible as the visuals are, the dialogue and score are even more incredible than I possibly remembered.\n\nI read that Zimmer was challenged by Nolan to pretty much create these original compositions, and this score mixed with the dialogue had me openly bawling like a baby in multiple scenes. “Stay/Coop leaving Murph” in particular had me crying through the whole sequence. \n\nthere is something so powerful in that composition that just had me losing it. It might be the idea that I’m becoming more open to becoming a father, but when the entire orchestral noise starts escalating as Coop is letting Tom have the truck, I am wailing for him to stay. \n\nAnd this was just for one of the compositions in this film. I can keep going on about how this element alone was truly amazing for a film like this. I really hope this gets an extended run so I can watch this again.",
        "upvotes": 71,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1h9mq57/hans_zimmers_score_for_interstellar/"
    },
    {
        "id": "1h9svgm",
        "author": "paulrudder",
        "title": "Why didn’t Bruce Broughton (Rescuers Down Under, Homeward Bound) become a major film composer? ",
        "content": "This guy had such a promising start.\n\nhttps://en.wikipedia.org/wiki/Bruce_Broughton\n\nHis first animated score ever was for Rescuers Down Under, which featured arguably one of the finest scores ever for a Disney film. Just watch this scene and pay attention to how much the music elevates it (literally): https://youtu.be/gj043f05C1U?si=Dwou2jv3DKF0-IkY&amp;t=1m22s\n\nIt’s bizarre how he just totally fell off towards the late 90s. \n\nBasically stopped composing scores for Disney films and mainstream movies and I don’t really understand why. I feel like he could have been one of the greats!",
        "upvotes": 25,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k04wRwxt_WW-8uWTpZqj2ee87POXh-3MW4mgtbGSPkE.jpg?auto=webp&amp;s=88157179336f7874c72e0abc180f9d1bf8205d0a"
        },
        "permalink": "/r/movies/comments/1h9svgm/why_didnt_bruce_broughton_rescuers_down_under/"
    },
    {
        "id": "1h97ijj",
        "author": "Adventurous-Peak-853",
        "title": "Godzilla Minus One",
        "content": "I just got around to seeing this movie. For dubbed movies I know I need to make sure I can pay full attention and with kids I just never got to this one. \n\nBut my god it was incredible. I had heard good things but it still exceeded my expectations. Visuals, fantastic. Story, even better. The pacing was damn near perfect as far as I'm concerned. And considering it was a Godzilla movie I found myself incredibly moved by the characters, none of whom were one-dimensional characatures.\n\nI hate when movies are too optimistic and I thought this walked the line perfectly between tragedy and fortune.\n\nJust wanted to dole out some praise for this film and a wish that more western/American films were of this quality. \n\nA+ guys.",
        "upvotes": 879,
        "comments": 212,
        "media": null,
        "permalink": "/r/movies/comments/1h97ijj/godzilla_minus_one/"
    },
    {
        "id": "1h9vgy5",
        "author": "TheBetaBridgeBandit",
        "title": "Laroy, Texas is an excellent Coen-esque addition to western neo-noir Films. Would love to hear your favorites from this the sub-genre as well!",
        "content": "I love stumbling on a perfect film by accident, and *Laroy, Texas* just scratched that itch in such a satisfying way. *Laroy* delivers excellence top to bottom from the engaging characters, pacing, and dialogue to the impressive performances delivered by the whole cast. I thought it was an absolute treat to watch! \n\nFeels like a great addition to similar films (IMO) like Blood Simple, Red Rock West, No Country for Old Men and several others. As a fan of Coen-brothers-esque neo-noir crime... dramedies? This was right up my alley. \n\nI enjoyed it so much I want to watch another great movie from the same sub-genre while I'm stuck on the couch sick, so please feel free to share your favorite recommendations!",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1h9vgy5/laroy_texas_is_an_excellent_coenesque_addition_to/"
    },
    {
        "id": "1h9gbes",
        "author": "kassiusx",
        "title": "‘I always have a moment of confession’: Peter Sarsgaard on truth, ethics and the quirks of family life",
        "content": "",
        "upvotes": 132,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pQGIxhO3Awpbjo3xndLXG4iPHo0XjAnMbBqo6al1Yps.jpg?auto=webp&amp;s=42f1e77ee58a2dca34ba281727b7666718de17ff"
        },
        "permalink": "/r/movies/comments/1h9gbes/i_always_have_a_moment_of_confession_peter/"
    },
    {
        "id": "1h91w5u",
        "author": "KriibusLoL",
        "title": "\"Hammering the door shut\" in The Hateful Eight is one of my all time favorite bits in any movie. Any other movies with comedic bits as a side story that get more ridiculous as the movies goes on?",
        "content": "Recently watched The Hateful Eight for the 3rd time now and one of my favorite comedic bits of all time is everyone trying to hammer the door shut while getting into Minnie's haberdashery.\n\nIt just gets more and more chaotic and silly as the movie goes on. First Kurt Russell's character struggling to keep the door shut while being handcuffed to his prisoner and getting yelled at by random strangers. Then Walton Goggins character goes through the same thing 20 minutes later, the massive struggle of one board not being strong enough to hold, everyone staring at them judging and shouting to really nail it in. OB accidentally hits the wooden board instead of the nail and saying \"jesus christ, that door is a son of a whore\" as the wooden board breaks in two. Then 15 minutes later the mexican character hitting his head against the lamp while trying to nail the door for the third time now and we see how fucked up the door boards are because everybody keeps trying to really nail it in. \n\nOf course later on we learn why the door was broken in the first place but I really enjoy these small side bits to the main story that makes it feel more authentic. Are there any other movies with bits that get more ridiculous as the story goes on?",
        "upvotes": 1607,
        "comments": 284,
        "media": null,
        "permalink": "/r/movies/comments/1h91w5u/hammering_the_door_shut_in_the_hateful_eight_is/"
    },
    {
        "id": "1ha185n",
        "author": "charl0tteblair",
        "title": "looking for movies with similar settings? (examples below!)",
        "content": "i hope this makes sense, but i really love a specific kind of setting i can't describe (any mix of small town america, suburban, fall/winter in some, darker themes sometimes) and am looking for suggestions of similar movies! the genre doesn't matter too much, since it's more about the setting!\n\nsome movies with this feeling (to me as a non-american) are Longlegs, Twin Peaks, Fargo, Carrie, Bones and All, Juno, Donnie Darko... \n\ni hope this makes sense at all, but thank you if anyone can help! ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1ha185n/looking_for_movies_with_similar_settings_examples/"
    },
    {
        "id": "1h9ymux",
        "author": "cleopatraandcaesar63",
        "title": "Onegin (1999) - Ralph Fiennes and Liv Tyler are excellent in this beautiful romantic drama based on the novel in verse by Russian writer Alexander Pushkin.",
        "content": "https://preview.redd.it/lfizh83n9q5e1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=c406dbf791527cd189be56708ea4efc41484aa1d\n\nAlexander Pushkin's verse novel \"Eugene Onegin\" is well-known in English-speaking countries, partly due to the influence of Tchaikovsky's opera, so I need not set out the plot in any detail. It centres upon the relationship between Yevgeny Onegin, a 19th century Russian landowner, and a teenaged girl named Tatyana Larinа, the daughter of a neighbour. Tatyana falls passionately in love with Onegin and writes him a letter setting out her feelings, but he replies that he cannot return them. Six years later Onegin meets Tatyana again and discovers that she is now married to a prince. A subplot deals with a duel fought between Onegin and Vladimir Lensky, the fiancé of Tatyana's sister Olga.\n\nRalph Fiennes executes a stunning performance as the aloof, sarcastic disillusioned aristocrat managing a performance which combines a great deal of emotion and extreme surface passivity; Liv Tyler is at her most beautiful in one of her best performances to date as the poignant Tatiana who, as the film unfolds, evolves from passionate idealism into resignation and honour.\n\nAs for the story, the movie is very faithful to the Pushkinian attitude. The story is very character-centred, typical to Russian lit. The change in Evgenyi Onegin  is marked indeed. However, the character of Tatyana captivated me. Her faithfulness to herself and to her integrity is amazing.\n\n  \n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1h9ymux/onegin_1999_ralph_fiennes_and_liv_tyler_are/"
    },
    {
        "id": "1ha3y74",
        "author": "the_zipline_champion",
        "title": "What did we think of Nightbitch?",
        "content": "I was on the fence, leaning negative, for the first two-thirds. This is coming from someone who unreservedly adores *Can You Ever Forgive Me* and *A Beautiful Day in the Neighborhood*. Once it hit the third act, I got it. And thank god it clicked, because it would have made me really sad to give a negative review to a movie that needle-drops \"Dare to Be Stupid\" by Weird Al.\n\nWhile I still prefer Marielle Heller's previous films, this big and often baffling swing reveals itself as a deeply personal reflection on balancing artistic legacy with continuing heritage. Kudos to Heller for making a film on her terms, even if it almost turned me off completely before eventually winning me over.\n\nI was reminded of Ari Aster's *Beau Is Afraid*. In *Beau*, Joaquin Phoenix as Aster's self-insert protagonist only finds peace when performing a play in the woods—mirroring how Aster himself might only feel at ease when creating films and seeing the world through his unique lens. Even as some audiences follow Richard Kind's character out the door wondering what the hell they just saw, they at least had the opportunity to understand how it feels to live with Aster's restless, haunting brain.\n\nAn unhinged Amy Adams gives us a similar peek into Heller's mind in *Nightbitch*. And like Scoot McNairy's character admits, I \"didn't get it\" at first. Honestly, as a single man with no kids, I still don't get all of it. But now I feel a little closer to empathizing, rather than just sympathizing, with moms in the arts.\n\n(Side note: I saw Brian De Palma's *Phantom of the Paradise* a week ago and didn't recognize a young Jessica Harper until the end credits. Then tonight I didn't realize an older Jessica Harper plays Norma until I saw her name on the Letterboxd page. I don't know what's causing my Jessica-Harper-prosopagnosia, but as a big fan of hers, I'm hoping one of the witches at Tanz Akademie can cast a spell to fix it.)\n\n[https://letterboxd.com/journeymark](https://letterboxd.com/journeymark)",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5NwlNREj4pwsHlD5R62wbFpNB0EWTrBHh8gXwPZ5NqM.jpg?auto=webp&amp;s=3efc14b8ae4e6709bcb786fba5f9f44c3dbb671e"
        },
        "permalink": "/r/movies/comments/1ha3y74/what_did_we_think_of_nightbitch/"
    }
]