[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pv5c5t",
        "author": "Terrible_Wrap1928",
        "title": "Il deficente che ci sta terrorizzando a San Salvario con i fuochi d'artificio può smetterla per favore?",
        "content": "grazie ",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pv5c5t/il_deficente_che_ci_sta_terrorizzando_a_san/"
    },
    {
        "id": "1pv4iqm",
        "author": "CieloeMare",
        "title": "TARI Registration Form (Without SPID)",
        "content": "Is there a guide to fill out the Tari Registration Form? I couldnt find any. \nAre there things to be careful about?\nIs there a way to get free assistance?\nThanks in advance.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pv4iqm/tari_registration_form_without_spid/"
    },
    {
        "id": "1pumjd0",
        "author": "googly-eyes2",
        "title": "Locali alternativi/dark/metal",
        "content": "Salve a tutti e buona vigilia! Visiterò Torino dal 26 al 28 dicembre e mi chiedevo se ci fossero locali o serate alternative con musica dark/gotica/metal a cui partecipare! Grazie in anticipo🌸",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pumjd0/locali_alternatividarkmetal/"
    },
    {
        "id": "1purkxh",
        "author": "RedditUser13011997",
        "title": "Lavoro a Torino vivere a Pinerolo",
        "content": "Ciao a tutti, come da titolo purtroppo fra qualche mese dovrò trasferirmi e trovarmi una casa non in condivisione con altra gente(ho avuto coinquilini a casa per più di 6 anni adesso basta!!!) cercando case a Torino mi rendo conto che i prezzi sono altissimi per un bilocali (almeno 500+ spese per non più di 35m) sto valutando un po' fuori Torino visto che fuori i prezzo sono più \"normali\" particolarmemte Pinerolo. Che ne pensate? È ben collegata con il treno? Ho la possibilità di fare smart 3/5.\nConsigli? Altri posti in cui l'affitto è ancora abbordabile in paesini ben collegati con Torino? \nGrazieeeee",
        "upvotes": 4,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1purkxh/lavoro_a_torino_vivere_a_pinerolo/"
    },
    {
        "id": "1puq379",
        "author": "infraross_",
        "title": "Posti dove studiare 27-28-29-30",
        "content": "Ciao! Visto la possibilità di fare ponte moltissimi posti dove solitamente vado a studiare, come le biblioteche, aule studio e il Comala sono chiusi. Avete consigli su posti specifici tranquilli e soprattutto aperti anche di pomeriggio dove poter studiare?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1puq379/posti_dove_studiare_27282930/"
    },
    {
        "id": "1pupwtb",
        "author": "_pigreco_",
        "title": "svapatori",
        "content": "ciao, sto cercando negozi di sigarette elettroniche che abbiano basette di nicotina economiche, per ora il più basso che ho trovato le vende a 4 euro. se conoscete qualcuno con prezzi più vantaggiosi…",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pupwtb/svapatori/"
    },
    {
        "id": "1puew5d",
        "author": "PuzzleheadedTeam3803",
        "title": "Question about asbestos",
        "content": "Hello! Sorry if this is a stupid question, but I've been planning to move to Torino for a couple of months, and I've heard northern Italy (And by extension, Torino) has a problem with asbestos contamination.\n\nIs this true or are these concerns unfounded?",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1puew5d/question_about_asbestos/"
    },
    {
        "id": "1ptv9ev",
        "author": "Intrepid-Routine-875",
        "title": "Ma il mercato della vanchiglietta chi lo controlla?",
        "content": "Ho notato che in quel mercato non ci sono etichette ne tracciamenti, senza considerare che la maggior parte dei prodotti non ha nemmeno il prezzo esposto.. Frutta e verdura non hanno scritto la provenienza, e vengono conservate malissimo. Ho visto due di quei banchi spostare i prodotti dal banco ad un garage che usano come magazzino, non oso immaginare d'estate.\n\nGli altri prodotti, carne, pesce, pasta fresca, frutta secca, olio, conserve, mozzarelle, eccetera, non ha mai etichette che indichino la provenienza, la data di scadenza gli ingredienti. Non c'è tracciabilità di alcun tipo.  \nI prodotti da bagno e casa sono tutti sfusi, senza confezioni, con le etichette strappate nella parte della tracciabilità.\n\nMa è legale una cosa simile? Il mercato in corso chieti sembra essere senza regole.",
        "upvotes": 16,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1ptv9ev/ma_il_mercato_della_vanchiglietta_chi_lo_controlla/"
    },
    {
        "id": "1ptucvl",
        "author": "DistributinOfWealth",
        "title": "Richiesta pubblicazioni fatta! Cosa devo fare ora e quali sono i tempi reali?",
        "content": "Ciao a tutti,\n\nIo e la mia compagna abbiamo appena firmato la richiesta di pubblicazione in Comune, ma non abbiamo ben capito i passaggi successivi. L'impiegato è stato piuttosto sbrigativo e vorrei evitare sorprese con le date.\n\nQualcuno che ci è già passato sa dirmi:\n\n1. **Quanto tempo passa** della richiesta fino alla firma all'effettiva affissione online?\n2. **Ci sono ritardi** comuni di cui dovrei essere a conoscenza per non ridurmi all'ultimo secondo?\n\nUna volta ottenuto il certificato di eseguita pubblicazione, dobbiamo chiamare noi per confermare la data o ci contattano loro?\n\nGrazie a chiunque mi aiuti a fare chiarezza in questo limbo burocratico!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ptucvl/richiesta_pubblicazioni_fatta_cosa_devo_fare_ora/"
    },
    {
        "id": "1pt3fau",
        "author": "Competitive-Sky712",
        "title": "Sosta a metà carreggiata",
        "content": "Non mi capacito di come in questa città la sosta nel mezzo della carreggiata sia tollerata. Auto ferme a cavallo della linea che separa le due corsie di marcia. Lo trovo molto scomodo per il flusso di traffico e pure molto pericoloso. Immagino sia la versione torinese della doppia fila, ma non mi pare di averlo mai visto in altre città. \n\nVoi che ne pensate?",
        "upvotes": 43,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1pt3fau/sosta_a_metà_carreggiata/"
    },
    {
        "id": "1ptj9ie",
        "author": "Le_Moulin_Italien",
        "title": "Turin House Market",
        "content": "Hiii,\n\nI have to give my notice to my landlady and have to move out in July.\n\nDoes anyone know how is house market in May/June to find a house in July for two international students?\n\nI only have traumua from August and September 😭\n\nMany thanks!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ptj9ie/turin_house_market/"
    },
    {
        "id": "1pt54r4",
        "author": "Spirited_Currency_30",
        "title": "Cioccolata calda",
        "content": "Ciaoo a tutte le persone qui. \nPrima voglio ringraziare per i consigli di cuffie e panettoni. Ho già delle cuffie nuove e nuovi luoghi per panettoni. \nAdesso vorrei chiedere... Dove credete che si può prendere una bella cioccolata calda. Cioè che non sia a prezzo turista...\n",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pt54r4/cioccolata_calda/"
    },
    {
        "id": "1pt2o9j",
        "author": "snakeandbunny",
        "title": "Does GTT just not send you tickets?",
        "content": "I purchased a daily ticket in the GTT app and I received an email confirming the payment, but I didn't actually receive a ticket. It doesn't show up in the app or in the email, is that normal? My card was charged and I can't find the ticket anywhere.",
        "upvotes": 13,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m6xfs6mhzr8g1.jpeg?auto=webp&amp;s=16e8d64c0e0ea273b10adbcc6f66b4948b4fb1f0"
        },
        "permalink": "/r/torino/comments/1pt2o9j/does_gtt_just_not_send_you_tickets/"
    },
    {
        "id": "1pt0d16",
        "author": "BeeZio98",
        "title": "Indeciso tra due appartamenti per la loro posizione",
        "content": "Buon pomeriggio, mi trasferirò a Torino a gennaio per lavoro (Stellantis) e per il momento ho due appartamenti in lista pronti a chiudere:\n\n\\-il primo a Barriera di Lanzo, via Druento per la precisione, super economico ma un po’ lontano\n\n\\-il secondo a Lingotto, in via Trofarello, ben più costoso ma sicuramente molto più vicino.\n\nOra, premettendo che porterò l’auto con me, come sono queste due zone? Entrambe le soluzioni hanno i loro vantaggi, ma ne vale davvero la pena spendere 200€ in più al mese per essere più interni alla città, anche nell’ottica della vita extra lavorativa? Grazie mille a chi risponderà✌🏻",
        "upvotes": 10,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1pt0d16/indeciso_tra_due_appartamenti_per_la_loro/"
    },
    {
        "id": "1pt3eu4",
        "author": "Top_Disk_8587",
        "title": "Monoruota a Torino",
        "content": "Ciao! Volevo sapere se qualcuno di voi ha esperienza di uso di monoruota (EUC) a Torino.\nPer cosa lo usate? Avete riscontrato problemi con la polizia/municipale?\n\nGrazie a chi darà un contributo!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pt3eu4/monoruota_a_torino/"
    },
    {
        "id": "1pt1kwg",
        "author": "Overall_Oven7451",
        "title": "Corsi teatro Torino",
        "content": "Ciao a tutti! 😊 M 25\n\nSto cercando di avvicinarmi al mondo del teatro e vorrei iscrivermi a un **corso di recitazione a Torino**. Essendo completamente nuovo a questo ambiente, mi piacerebbe avere qualche consiglio su:\n\n🔹 **Scuole o laboratori seri e con buone recensioni**  \n🔹 **Prezzi indicativi** (sia per corsi annuali che cicli più brevi anche se son più interessato a cicli brevi)  \n🔹 **Eventuali esperienze personali** che possano aiutarmi a scegliere\n\nAlcune domande specifiche alle quali mi piacerebbe avere risposta:  \n• Quale corso consigliereste per un principiante assoluto?  \n• Ci sono insegnanti o scuole riconosciute o particolarmente valide a Torino?  \n• Quali sono i costi medi per un corso annuale vs. workshop intensivi?  \n• Dov’è meglio iscriversi se si cerca un ambiente divertente ma anche formativo?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pt1kwg/corsi_teatro_torino/"
    },
    {
        "id": "1ptbnm2",
        "author": "Humble_Animal6304",
        "title": "Heroquest, cerco compagni di gioco",
        "content": "Mi hanno regalato per Natale la versione base di Heroquest, non lo vedevo da ragazzino!!\nMi piacerebbe creare un gruppo di gioco, sono in San Salvario",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ptbnm2/heroquest_cerco_compagni_di_gioco/"
    },
    {
        "id": "1pt8c1p",
        "author": "Teonliner",
        "title": "Visitare Torino",
        "content": "Ciao gente, nei giorni tra Natale e capodanno ho in programma di visitare Torino con la famiglia. Com’è la situazione dopo gli scontri e le manifestazioni di questo weekend? C’é il rischio concreto di incorrere in disordini o problemi (tenete conto che viaggio con due bambini piccoli quindi voglio essere tranquillo)",
        "upvotes": 1,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1pt8c1p/visitare_torino/"
    },
    {
        "id": "1pt7y6l",
        "author": "Diegorfsd",
        "title": "Scambi di carte pokemon",
        "content": "Salve vorrei sapere dove posso scambiare le carte pokemon perché ho un sacco di doppioni e non voglio spendere un botto di soldi in spedizione \nGrazie",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pt7y6l/scambi_di_carte_pokemon/"
    },
    {
        "id": "1ptbpvz",
        "author": "GiuseppeAlletto",
        "title": "Torino Esoterica e Arte Contemporanea - La Visione Mistica di Giuseppe A...",
        "content": "“Hai mai sentito la magia segreta di Torino, dove arte, eleganza ed esoterismo si incontrano?”  \n  \nPer Alletto, pittore contemporaneo siciliano e profondo conoscitore dei linguaggi simbolici dell’arte e dell’occulto, Torino non è solo una città: è una seconda patria spirituale.  \nCulla di misteri, capitale dell’esoterismo e dell’eleganza italiana, Torino incarna quella doppia essenza che attraversa la sua arte — la tensione tra luce e ombra, tra sacro e bellezza, tra mito e modernità.  \n  \nNelle sue opere, Alletto fonde la raffinatezza torinese con la potenza epica del Mediterraneo, creando un linguaggio pittorico dove il lusso diventa rito, e l’immagine si trasforma in simbolo iniziatico.  \nUna visione eroica della vita, dove la ricerca estetica è anche un percorso spirituale.  \n  \n✨ Torino, con la sua aura misteriosa e il suo fascino aristocratico, è la cornice perfetta per un’arte che parla di bellezza, potere e trascendenza.  \n  \n👉 E tu, credi che le città possano influenzare l’anima di un artista? Raccontacelo nei commenti  \n  \n[\\#alletto](https://www.youtube.com/hashtag/alletto/shorts) [\\#arte](https://www.youtube.com/hashtag/arte/shorts) [\\#artcollector](https://www.youtube.com/hashtag/artcollector/shorts) [\\#torinoart](https://www.youtube.com/hashtag/torinoart/shorts) [\\#esoterismo](https://www.youtube.com/hashtag/esoterismo/shorts) [\\#arteesoterica](https://www.youtube.com/hashtag/arteesoterica/shorts) [\\#lussoculturale](https://www.youtube.com/hashtag/lussoculturale/shorts) [\\#luxuryart](https://www.youtube.com/hashtag/luxuryart/shorts) [\\#italianartist](https://www.youtube.com/hashtag/italianartist/shorts) [\\#artinvestment](https://www.youtube.com/hashtag/artinvestment/shorts) [\\#torinoelegante](https://www.youtube.com/hashtag/torinoelegante/shorts) [\\#modernmyth](https://www.youtube.com/hashtag/modernmyth/shorts) [\\#fineart](https://www.youtube.com/hashtag/fineart/shorts) [\\#symbolicart](https://www.youtube.com/hashtag/symbolicart/shorts) [\\#artofthesoul](https://www.youtube.com/hashtag/artofthesoul/shorts) [\\#luxurylifestyle](https://www.youtube.com/hashtag/luxurylifestyle/shorts) [\\#italianartscene](https://www.youtube.com/hashtag/italianartscene/shorts) [\\#artandmystery](https://www.youtube.com/hashtag/artandmystery/shorts) [\\#torino](https://www.youtube.com/hashtag/torino/shorts) [\\#torinocentro](https://www.youtube.com/hashtag/torinocentro/shorts) [\\#torinocity](https://www.youtube.com/hashtag/torinocity/shorts)  \n  \n🌃 Torino come non l’hai mai vista.  \nTra vicoli eleganti, archi iconici e quell’atmosfera di lusso che solo questa città sa dare… ✨  \n  \n🎨 L’arte di Giuseppe Alletto torna a Torino!  \nDopo la sua personale del 2020 alla Galleria Weber, l’artista approda di nuovo in città con una nuova mostra esclusiva.  \n  \nCSA Farm Gallery – Via Vanchiglia  \n📅 Inaugurazione: Sabato 13 dicembre 2025  \n  \nLe sue opere incontrano la magia di Torino: ombre, luci, geometrie e vibrazioni che rispecchiano l’eleganza della città. Un dialogo perfetto tra arte e architettura.  \n  \n✨ Un evento imperdibile.  \nSe ami Torino, l’arte contemporanea e le atmosfere raffinate… questa mostra è per te.  \n  \n👉 Salva il post, condividilo e segna la data!  \nTi aspetta un’esperienza visiva unica.  \n  \n[\\#torino](https://www.youtube.com/hashtag/torino/shorts) [\\#turin](https://www.youtube.com/hashtag/turin/shorts) [\\#torinocentro](https://www.youtube.com/hashtag/torinocentro/shorts) TurinItaly ItalianCities ViaggiInItalia ArteContemporanea GiuseppeAlletto MostraTorino CSAfarmgallery TorinoElegante TorinoDaVivere ItalyTravelTips PiazzeItaliane Vivaldi AntonioVivaldi ClassicalMusic ArtLovers TorinoArte",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UF4Ghk4giBmeYDO03BvK-rcUEJW2HOWYWW2hQMSI2Zg.jpeg?auto=webp&amp;s=cce261e9d1f85a742917e86236d74afb818af297"
        },
        "permalink": "/r/torino/comments/1ptbpvz/torino_esoterica_e_arte_contemporanea_la_visione/"
    },
    {
        "id": "1pt5g41",
        "author": "SkyOk1181",
        "title": "Ho bisogno di aiuto tecnico",
        "content": "Ciao a tutti,\navrei bisogno di un consiglio 🙏\n\nMi si è rotto solo il keycap di un tasto della tastiera (il tasto funziona perfettamente, è solo il copritasto).\nUn tecnico mi ha chiesto 120€ per sostituire tutta la tastiera, cosa che mi sembra davvero eccessiva.\n\nIl modello del portatile è ASUS ROG Strix.\nQualcuno conosce un posto (negozio o laboratorio) o anche un sito affidabile dove posso trovare/sostituire solo il keycap?\n\nGrazie mille in anticipo!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pt5g41/ho_bisogno_di_aiuto_tecnico/"
    },
    {
        "id": "1ps7n7s",
        "author": "Top-Text-7727",
        "title": "Post shistorm su askatasuna",
        "content": "Visto che non sembra ancora essere stato fatto, potete scrivere la vostra opinione?\n\nChiedo cose argomentate e non retoriche, che di quella ne abbiamo troppa.",
        "upvotes": 33,
        "comments": 125,
        "media": null,
        "permalink": "/r/torino/comments/1ps7n7s/post_shistorm_su_askatasuna/"
    },
    {
        "id": "1psas4j",
        "author": "AfraidAd2805",
        "title": "Multe GTT arretrate, dove trovarle?",
        "content": "Buongiorno a tutti,\n\nHo bisogno di trovare un elenco delle multe prese in zona di sosta blu con la stessa auto.\n\nPosso recarmi in GTT con la targa e avere tutte le multe da pagare li? Perchè non trovo alcun modo online di farlo. Ho trovato delle vecchie multe che sicuramente ho scordato di pagare e vorrei essere sicuro di non averne altre.\n\nSe potete aiutarmi ve ne sarei grato",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1psas4j/multe_gtt_arretrate_dove_trovarle/"
    },
    {
        "id": "1psj4b5",
        "author": "StraightBlueberry90",
        "title": "heeelp nuove amicizie",
        "content": "heelp ragazzo di 24 annetti appena trasferito per lavoro in quel di Torino, zero conoscenze e zero amici, chi è disposto a consigliare qualcosa o fare amicizia, thx",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1psj4b5/heeelp_nuove_amicizie/"
    },
    {
        "id": "1psackz",
        "author": "Nice_Project9383",
        "title": "Tricologo",
        "content": "Ciao a tutti, ultimamente ho notato un leggero diradamento dei capelli e vorrei fare una visita specialistica. Sto cercando un buon dermatologo con esperienza tricologica (quindi non solo un tricologo generico).\nQualcuno ha qualche nome/consiglio su professionisti a Torino? Se preferite potete scrivermi in privato.\nGrazie mille :)",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1psackz/tricologo/"
    },
    {
        "id": "1ps9mis",
        "author": "AdPretend66",
        "title": "Sciare il 24 dicembre a Monginevro",
        "content": "Salve, scusatemi se scrivo qui ma non ho trovato altri gruppi più incentrati sull'argomento. \nCmq, come recita il titolo vorrei andare a sciare a Monginevro il 24 dicembre ma vorrei capire se secondo voi è un giorno in cui potrebbe esserci tanta gente oppure un giorno vivibile. In generale, quale è la vostra esperienza sulle piste da sci il 24 dicembre? ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ps9mis/sciare_il_24_dicembre_a_monginevro/"
    },
    {
        "id": "1ps8zi7",
        "author": "backdunflip",
        "title": "Parrucchiere affidabile?",
        "content": "ciao! \n\nSapreste consigliarmi un parrucchiere affidabile a buon prezzo? sono già andata da dei parrucchieri cinesi in via Milano ma l'ultima volta non hanno fatto un buon lavoro e vorrei cambiare",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ps8zi7/parrucchiere_affidabile/"
    },
    {
        "id": "1prkawi",
        "author": "imoonmov",
        "title": "Situation in Vanchiglia",
        "content": "When is this gonna finish? \n\nWe cannot even reach our home anymore.",
        "upvotes": 84,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vtijr2yhde8g1.jpeg?auto=webp&amp;s=0fbf53d188cde25cf8b63f4b3db3f3085adbed6c"
        },
        "permalink": "/r/torino/comments/1prkawi/situation_in_vanchiglia/"
    }
]