[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 164,
        "comments": 577,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n4c5f3",
        "author": "WebConsistent3251",
        "title": "Unknown Number the Highschool Catfish- I'm sorry did I just watch Netflix give a platform to a predator completely glossing over the fact that she was sexually aggressive with minors?",
        "content": "She's a pedophile and a predator. I'm disgusted. She took no accountability and Netflix tried giving her some sympathetic image? Gross. Her daughter needs tons of therapy\n",
        "upvotes": 173,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1n4c5f3/unknown_number_the_highschool_catfish_im_sorry/"
    },
    {
        "id": "1n43e24",
        "author": "Interesting_Slide554",
        "title": "Unknown number The high school catfish",
        "content": "Brooooo when Kendra says “ i know a lot of us made mistakes and broke the law but didnt get caught”, BYE, this is not a mistake this is a deliberate decision that she made over and over. This wasnt a OOPSIE moment. And no Kendra, we have not all broke the law but got away with it, and certainly not to this level. Please, the rationalization of it all. People try to logically rationalize their actions as if it makes them understandable. Girl, Hitler had his reasons too, and was very convincing in his rationale, he still was a monster. That woman gives me chills. I have strong reasons to believe her daughter will cut her off way later in life, when she is going to become more aware. At the moment, she’s too young to fully process it and have perspective. She’s in a bubble. She clearly doesnt seem to fully understand.",
        "upvotes": 161,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1n43e24/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n48twd",
        "author": "Camp_Arkham",
        "title": "Hate weekly drop shows",
        "content": "Really disappointed to see Netflix starting to go to the “Weekly drop” model of series shows. I wish they would just drop their new series all at one time and allow the viewer to decide how and when they want to watch ( or binge watch). \nFor me, having entire shows dropped at one time, differentiated Netflix from a lot of other services and was somethingI valued. \nI’m I alone here?\n\n",
        "upvotes": 72,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1n48twd/hate_weekly_drop_shows/"
    },
    {
        "id": "1n4bv7m",
        "author": "Agitated_Fix_3677",
        "title": "Unknown number: The high school catfish…",
        "content": "This foolishness and fuckery in retrospect. First tf off… WHY TF DID NETFLIX CENTER THE OFFENDER. Kendra didn’t deserve to make this all about her and her story. This is about Owen, Khloe, his mother, Kendra’s husband and Lauryn. This should have been about the victims. They should have highlighted everything Kendra took from Shawn (Kendra’s husband.) Kendra is literally a family annihilator without the redrum. \n\nWhy didn’t Netflix put more emphasis on the sexual messages to minors??? Why did Netflix make a mockery of this situation??? Why didn’t they center the other parents? Why platform a literal abuser??\n\n\nY’all might drag me for this but I feel like Lauryn’s reactions are odd. Like I didn’t see any shock or surprise or even anger. I’m extremely surprised that the fact that Lauryn stayed in constant contact with her mother. It almost seems… dismissive of the whole ordeal. \n\nShawn and Lauryn lost EVERYTHING and Kendra is making it seem cool. I’m just appalled. ",
        "upvotes": 28,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n4bv7m/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n46g5m",
        "author": "ohmyhellions",
        "title": "Unknown number unpopular opinions",
        "content": "Reading the comments here, most people agree Kendra is a psychopath and pedophile, which: yes absolutely. And I agree she needs to be locked away for a much longer time (and studied).  But there are some other takes I had that I don’t see reflected. What do you think, and what unpopular opinions do you have? Please share:\n\n1. Yes, obviously Kendra was fixated on Owen, even when he was still a little prepubescent boy (sick). And she was jealous of Lauryn for being with him. That’s all the comments I’ve read. But I believe it went much deeper than that. She was also deeply jealous that her daughter was growing into a pretty teenager who had her whole life ahead of her and hadn’t fucked up her marriage, finances and life like Kendra had. Owen was the target of her fixation but It wasn’t only about Owen. There’s a lot more going on. \n\n2. I’m sorry but Owen’s parents/mother are not the heroes people are making them out to be. Why in the free world would they not take the kid’s phone away? He was being harassed into a place of suicidal ideation. They are terrible parents for letting him just deal with it while the mom pranced around pretending she was a star on Law &amp;\nOrder \n\n3. Lauryn’s dad was an incompetent father. I believe Kendra is a master manipulator but what the hell must he have been doing to not see signs that something was terribly wrong? I think he was having affairs/a double life or at the very least was willfully burying his head in the sand. What do you mean you trusted your wife to handle your daughter’s severe sexual harassment and abuse? You didn’t think you should help? You didn’t think the situation warranted all hands on deck? Where the hell were you the whole time? And all he could say about Lauryn now is that she’s “growing” and will be a “beautiful woman.”  Something is also off with him. \n\n4. Regarding Lauryn's non-emotional reaction to what her mom did to her: Lauryn never had close friends and was always quiet and withdrawn, per all her peers. Owen said she was trying to isolate him from his friends so it was just “the two of us”. As far as we saw, Kendra was her primary parent, with barely any paternal involvement. Kendra’s sociopathic ways are normal to Lauryn because it’s all she knows. I hope she gets a lifetime of therapy. ",
        "upvotes": 48,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1n46g5m/unknown_number_unpopular_opinions/"
    },
    {
        "id": "1n4fsxh",
        "author": "Aapeso4444",
        "title": "Unknown Number documentary",
        "content": "This lady is absolutely insane like insane . I can’t even believe a mother would do something this drastic to their own child I mean being a teen is already so much &amp; to think that you would do something so drastic . Telling her to off herself like that is crazy &amp; her playing the hero is what she was doing that is a real mental issue. Also this woman is a predator I mean all the messages of her talking about creaming &amp; sexual acts is just disgusting . I believe she was getting off on those messages which is more crazy because at that time that boy was sooo young. I knew from the beginning something was off about her she just looked off. But I was not thinking to this extent. I couldn’t imagine putting my son through something like that. It can really mess with someone’s mental health. What a disgusting human in my opinion she should have been registered as a sx offender I just can’t get past the fact that she said all of those things to her daughters boyfriend 🤮🤮🤮",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n4fsxh/unknown_number_documentary/"
    },
    {
        "id": "1n3oyim",
        "author": "AnotherDarnDay",
        "title": "Unknown Number High-school Catfish",
        "content": "What the hell did I just watch? And what the hell was this person thinking?\n\nI'm in shock that someone would do such a thing to their own child. And that she doesn't seem to have any focus on what she actually did. \n\nThe daughter didn't seem to grasp what her mother did when they told her but the father acted on it right away. \n\nWas she totally jealous of her own daughter? ",
        "upvotes": 539,
        "comments": 684,
        "media": null,
        "permalink": "/r/netflix/comments/1n3oyim/unknown_number_highschool_catfish/"
    },
    {
        "id": "1n42bwu",
        "author": "ciscnzhnrq",
        "title": "Katrina - Come Hell or High Water",
        "content": "This documentary produced by Spike Lee was very informative and really well done. What a complete tragedy to the people and community. Everyone needs to watch this. ",
        "upvotes": 46,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1n42bwu/katrina_come_hell_or_high_water/"
    },
    {
        "id": "1n3og0r",
        "author": "Ok-You-5930",
        "title": "Unknown Number: What mental illness does Catfish Mom, Kendra Licari have? I have questions..",
        "content": "SPOILER ALERT: first, I’m really curious as to what mental illness Kendra Licari has. I have several family members with severe mental illness but I can’t figure this out… \n\nIt was so disturbing to learn what she did to her innocent daughter and her friends. But she was also obsessed with the boyfriend! And then we learn that she lied about having a job! And then we hear her skirt accountability blaming it on her trauma, and then we see how manipulative she is at every level. Like… I have questions. Weigh in on any:\n\n1. WTF did we just watch?\n2. What mentally illness do you think she has? And what makes you think that?\n3. Why was she fired?? We need a follow up on this. Sounds like Casey Anthony at Universal Studios..\n4. We’re all in agreement that she was obsessed with Owen right? \n5. HOW DID THIS PSYCHOPATH GET FREE IN 18 MONTHS?",
        "upvotes": 313,
        "comments": 673,
        "media": null,
        "permalink": "/r/netflix/comments/1n3og0r/unknown_number_what_mental_illness_does_catfish/"
    },
    {
        "id": "1n4d7sq",
        "author": "CllrHood",
        "title": "Unknown number, Chloe’s mum comment",
        "content": "What did Chloe’s mom mean when she said, ‘I told someone that Shaun and Lauryn were going to come off looking like the victims.’ She says this towards the end of the program. Was she suggesting they were all in it together, ie Kendra, Shaun and Lauryn? ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n4d7sq/unknown_number_chloes_mum_comment/"
    },
    {
        "id": "1n4dcws",
        "author": "FaceElectronic768",
        "title": "( unknown number-high school catfish ) is anyone else confused by the picture?",
        "content": "who sent the picture of owen and his new phone case from inside his house? if owen and lauryn were broken up by then kendra wouldn’t be at their house i wouldn’t think? i’m so confused by how many things kendra knew about even owen’s new gf? how was she getting all this info and pics? idk if i missed something! ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n4dcws/unknown_numberhigh_school_catfish_is_anyone_else/"
    },
    {
        "id": "1n4fqa5",
        "author": "TeaRemote258",
        "title": "I JUST found The OA",
        "content": "And I’m utterly disappointed there isn’t a season 3+. How can I reach out to Netflix to show my support for additional seasons? Assuming they can get the cast back together? I know the creators + Jason Isaacs are still in favor of additional work to conclude the series. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n4fqa5/i_just_found_the_oa/"
    },
    {
        "id": "1n3z8co",
        "author": "Personal_Strength_44",
        "title": "Thursday murder club!!",
        "content": "Sooo good sooo wholesome!! Loved the characters and cant wait to see other richard’s book turn into movies! What do you think ? Especially people who have read the book as well??",
        "upvotes": 28,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1n3z8co/thursday_murder_club/"
    },
    {
        "id": "1n38enm",
        "author": "ADMlN-",
        "title": "What \"Unknown Number: The Highschool Catfish\" totally downplayed...",
        "content": "**Why did Kendra go after Owen's** ***new*** **girlfriend, a full year after he and Lauryn broke up?**\n\nThat isolated single detail proves this had absolutely nothing to do with protecting her daughter and everything to do with her own predatory obsession with Owen. Owen's mom tried to point it out, but they barely gave her a voice.\n\nIt feels like the real story was \"Predatory Mom Coach\" but decided \"Highschool Catfish Story\" was way more marketable. It's like they are deliberately downplaying the darkest part of this story and perpetuating Kendra's misdirection/manipulation.",
        "upvotes": 1373,
        "comments": 1333,
        "media": null,
        "permalink": "/r/netflix/comments/1n38enm/what_unknown_number_the_highschool_catfish/"
    },
    {
        "id": "1n3qylt",
        "author": "jcals17",
        "title": "Unknown Number: The High School Catfish",
        "content": "This story was insane, that was the last thing I expected. Rant incoming…\n\n\nIt really bothers me that her daughter Lauryn still had a relationship with her &amp; even a close one. \n\nShe didn’t just cyber bully her, she said disgusting things. She literally told her to OFF HERSELF. She broke up her daughter’s first relationship, she listened to her daughter cry, beg for it to stop, &amp; still did it. That’s sick, that’s not “that wasn’t me” “i dont know what i was doing”. She harassed her for almost TWO YEARS. You being assaulted does not excuse you to harass your daughter, it doesn’t even correlate. &amp; then to do it for almost 2 years. \n\nNot to mention her obsession with Owen, that’s disgusting &amp; predatory. She could have just called her daughter ugly, annoying blah blah but she said vulgar things about him. THATS WEIRD. I know this whole thing is weird but it’s even weirder that she was obsessed with him. \n\nI personally would never talk to my mother again. &amp; my mom is by best friend. You told me to off myself everyday multiple times a day. Then said “well I knew she wouldn’t do it”, I could never trust her again. \n\nLet me know your thoughts.",
        "upvotes": 95,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1n3qylt/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n4ghuy",
        "author": "Elfman72",
        "title": "Grizzly II - As a horror fan, I love that they added this.",
        "content": "Yes it is a bad trashy sequel to a bad OG horror movie, but having access to this movie is just something else.  Charlie Sheen, Laura Dern, George Clooney? Every AAA star has their roots in old school horror.  Every one of them.  I sub to Shudder for my horror fix, but I LOVE seeing something this obscure on a major service like Netflix.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n4ghuy/grizzly_ii_as_a_horror_fan_i_love_that_they_added/"
    },
    {
        "id": "1n473ju",
        "author": "Ok_Hedgehog4784",
        "title": "Unknown Number: The High-school Catfish. Kendra",
        "content": "Kendra must have mental health issues like they mentioned Munchausens once. This woman is UNWELL. I think they should have been a little more concerned about the insane sexual and violent texts she was sending to MINORS. Let alone her DAUGHTER. She was really telling her daughter to kill herself!!! And Kendra had the audacity to say that she wasn't worried about her daughter hurting herself. What a selfish demented woman. We dont know that Lauryn didnt hurt herself. WHAT MADE ME THE MOST UPSET WAS HER TELLING THE OFFICERS THAT SHE WAS UPSET ABOUT HOW LAURYN WOULD BE TREATED AT SCHOOL NOW. like lady you vetoed that right to care the second you messaged your daughter. I dont care what happened in your childhood or what mental illnesses you have, it never makes it okay for something like this. And shes acting like shes off the hook because she didnt send the first texts. SHE SENT THE WORST ONES.\nPoor Lauryn, God only knows how she truly feels about what happened. How do you recover from that?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n473ju/unknown_number_the_highschool_catfish_kendra/"
    },
    {
        "id": "1n3w464",
        "author": "Cultural-Chart3023",
        "title": "Rewatching unknown number to see what I missed",
        "content": "1:23 from the very start the first red flag \"I just told her to ignore them\" what? The first time I watched it I did say wtf but let it go. Now I'm watching it again and already realise  that alone is weird af everyone else is taking it so seriously and worried about her and mums all \"oh well\".. \n\nThe signs were definitely there! ",
        "upvotes": 35,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1n3w464/rewatching_unknown_number_to_see_what_i_missed/"
    },
    {
        "id": "1n4eu1e",
        "author": "ReasonableGlove816",
        "title": "SPOILERS!!! Unknown Number - Netflix",
        "content": "i KNOW everyone is posting about this atm but i have to say something!!!!\ni've just finished watching the new netflix documentary Unknown Number and HO-LY SHIT.\ni have not been that SAT watching a documentary for AGES. i genuinely had no idea which way the story would go and when the perpetrator was caught - jaw to the FLOOR.\n\nSPOILERS BELOW!!!\nlauryn's mum is fucking insane. a literal psychopath. i hate hate the fact that at the end they made it seem as though it was a trauma response. it wasn't. she was jealous of her daughter, and more importantly, INFATUATED with owen (a teenager). the sexual comments she made, everytime the word 'creamy' was used i felt sick, even before finding our who it was. these were 13 year old children it was disgusting they were receiving those messages, let alone from her own mother???\nalso there is absolutely no way it wasn't kendra from the get go. the message layouts and language used were FAR too similar from both periods of time.\nmore importantly, i can't believe owen's parents didn't press for her to be put on the sex offenders register?? she was literally in love with that child, thinking about doing the most HEINOUS things to him🤮🤮\nshe is vile and i truly hope as lauren gets older she realises how spiteful and truly disgusting her mother is. those poor poor kids💔",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n4eu1e/spoilers_unknown_number_netflix/"
    },
    {
        "id": "1n4ic9s",
        "author": "Celebril63",
        "title": "Long time Kdrama fans.  We just watched K-pop Demon Hunters.  We were impressed.",
        "content": "I know, I know.  It’s been out awhile now.  Having been watching K-dramas since *Hometown Cha-Cha-Cha* in 2021, we were a bit hesitant about a Canadian origin animation.  Boy were we wrong!  Maggie Kang might be Canadian but she has definitely held on to her Korean heritage when writing this. \n\nThis is about a K-drama as it gets.  The story is right.  The locations really match the types of locations you see in a K-drama.  The music, of course, is what you’d expect of K-pop.  The cast was excellent and I *did* recognize many popular K-drama stars in the credits. \n\nThe got the K-drama tropes down perfectly.  Walking past.  Foodies.  Wrist grabs.  It was all there except of the White Truck of Doom. (IYKYK)  \n\nI have seen some complaints about the ending but I’ve got to tell you, it was about a Korean as it gets.  In these supernatural stories where the being falls in love with a mortal, &gt;!that being *always* ends up sacrificing itself for their One True Love.  Time passes, and then there is a happy reunion. !&lt;  Well, usually.  If there is a second movie, this is what I would expect to happen.  However, I would only expect it to be &gt;!Ji-Un, not the rest of the band.!&lt;  \n\nThe biggest problem I’ve had with the movie is when people ask for recommendations on live action K-dramas.  My first thoughts would be something like *My Demon* or *Vincenzo*.  The problem is those aren’t shows you’d recommend to someone you don’t know and may be a 13 year old girl.  \n\nAny thoughts from other K-drama fans?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4ic9s/long_time_kdrama_fans_we_just_watched_kpop_demon/"
    },
    {
        "id": "1n3ajz4",
        "author": "unfiltered_12345",
        "title": "Need a thriller series to binge watch on Netflix",
        "content": "In desperate need of new series to watch, can't seem to stick to anything \nSo need a series that is dark, mysterious and very thrilling to watch.\nA series I cam binge watch in a day or over a few weeks.",
        "upvotes": 403,
        "comments": 611,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ajz4/need_a_thriller_series_to_binge_watch_on_netflix/"
    },
    {
        "id": "1n4g45d",
        "author": "Puzzleheaded_Day5258",
        "title": "Unknown Number. I believe the mom should be in jail way longer",
        "content": "Imagine if it’s the dad doing all these? The dad would be in jail for a ton longer time than what the mom had got. This is just ridiculous for the amount of jail time the mom received and her interview did not show any remorse.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4g45d/unknown_number_i_believe_the_mom_should_be_in/"
    },
    {
        "id": "1n4fyts",
        "author": "Deranox",
        "title": "Alexander The Making of a God - what do you think about it ?",
        "content": "Do you think we'll get a season 2 to finish Alexander' story ? \n\nPersonally I enjoyed some moments in it, even if the prophet part was cheesy and they skipped or breezed through some of his most important battles up to that point of his life.\n\nNetflix has cancelled some really good shows and kept supporting some really bad ones so it's really not known what they'll do here. The ratings weren't really good, but not terrible either.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4fyts/alexander_the_making_of_a_god_what_do_you_think/"
    },
    {
        "id": "1n47kkw",
        "author": "ravik_reddit_007",
        "title": "Bland, easy to follow, for fans of everything: what has the Netflix algorithm done to our films?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n47kkw/bland_easy_to_follow_for_fans_of_everything_what/"
    },
    {
        "id": "1n3vn8g",
        "author": "689Dementia",
        "title": "The person guilty in Unknown Player: The High School Catfish had plenty of time in prison to craft their pathetic narrative",
        "content": "had all the time in the world to think, to manipulate their version of events, and presenting the story as a victim. So Gross.. Real people were traumatized. And now that person is using that pathetic narrative to gain empathy and attention??? wow",
        "upvotes": 17,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n3vn8g/the_person_guilty_in_unknown_player_the_high/"
    },
    {
        "id": "1n4ehzq",
        "author": "UncleQ_Salva",
        "title": "Unknown Number",
        "content": "After watching the documentary— this is the first time ever hearing about this case. I found Lauryn’s reaction odd to when the Police are at her house and she finds out that her Mom is the culprit. There was no emotion but Kendra kind of holds her and you see Lauryn extending her arm around her Mom. \nThen Khloe’s Mother made a comment at the end where she says something in the words of Lauryn and Shawn knowing about it and would get away with it because the police who was investigating was not doing his effing job. Is it me or does it seem that there’s more to the story in regard to what Lauryn and her dad knew her Mom was doing? Also, Owen saying he doesn’t talk to her anymore? I just find this whole situation very fishy. Just my opinion. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n4ehzq/unknown_number/"
    },
    {
        "id": "1n4cnvk",
        "author": "Aggressive_Cloud_794",
        "title": "Alice in borderland and Inception (2010) parallels are uncanny",
        "content": "Just finished binging both seasons of AIB before s3 comes out and i noticed something very ummm interesting. the parallels between the movie inception by chris nolan and AIB are too hard to ignore,\n\n\\- for instance, the whole idea of going into borderland when ur unconscious in the real world, and second being able to 'communicate' with others who r in the same state\n\n\\- and the fact that time passes by so much slower in BL than in the real-world, the fact that the players in AIB spinoff used a 'totem' that was unique to them to remind them that they're still in BL and not in the real world.\n\n\\- the fact that entering the BLands can be done through a 'coma' induction.\n\n\\- and also the fact that if u die in the BL you essentially fall into limbo and die in the real world..\n\nthere are so many more similarities (tbh at this point the same ideas not even similarities lol) and considering the AIB manga came out in like nov of 2010 and inception was released a bit before that makes it a bit interesting as to who ripped off who lol what do yall think?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4cnvk/alice_in_borderland_and_inception_2010_parallels/"
    },
    {
        "id": "1n4h7sn",
        "author": "throwaway11178492",
        "title": "UNKNOWN NUMBER THE HIGHSCHOOL CATFISH, NETFLIX -THEORY",
        "content": "I have a theory about this show involving the daughter and the mom. What if the daughter was the one who sent the texts first, and the mom found out and covered up for her? \n\nThe reason i say this is because the daughters reaction when she found out her mom did it was like she already knew this was coming. She had no shock , surprise, or questions at all, &amp; showed no anger (until the dad told the mom to leave, but that seemed like she was more upset over the breakup). The vibe i got from the daughter watching the police cam video was like when a kid gets caught lying. Like she was sitting there listening to someone grill her about being caught.  The way her mom was hugging her and holding her hand seemed like she was saying \"its gonna be okay\".  The reaction was just way too weird and calm. \n\nThe mom also emphasized it didn't start with her. She claimed it started with someone else, and then she continued  it. \nWhat if it started with her daughter, and then her mom sent some texts just incase she would have to cover for her daughter. She probably knew at some point the texts would be tracked. \n\nWhen i was in highschool  i remember  girls \"hacking \" their own accounts for attention, so this theory wouldn't surprise me if true. It was also mentioned  as a theory  in the start of the film. \n\nI also find it odd how forgiving the daugher is to her mom, and how she is praising her.  ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1n4h7sn/unknown_number_the_highschool_catfish_netflix/"
    },
    {
        "id": "1n4a39x",
        "author": "WorkingFlan713",
        "title": "unknown number",
        "content": "should i watch if ? i see alot of people getting mad at the show and calling it rage bait but the discussion and certain spoilers i’ve read makes me want to dive deeper and watch the show. so is the final verdict a watch or a pass ?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n4a39x/unknown_number/"
    },
    {
        "id": "1n41wvk",
        "author": "UniversalInquirer",
        "title": "Any docs (anywhere not just Netflix) like American Conspiracy: The Octopus Murders?",
        "content": "Basic post but I saw this a few months ago, and boy did I love it. Always been a sucker for gov't or just big conspiracy style docs and films, but of course, they're usually laughable in how utterly bonkers they are. This felt like, regardless of how much you agree or not, there was really something going on here. \n\nAny other docs out there exploring big, believable gov't/institutional/generally big conspiracies in a grounded, worthwhile, and believable way? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n41wvk/any_docs_anywhere_not_just_netflix_like_american/"
    }
]