[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1gtc7sx",
        "author": "reare0",
        "title": "Amicizia",
        "content": "Salve miei eventuali cari conoscenti, mi chiedevo se fosse ancora possibile instaurare nella modernità odierna delle amicizie che non siano solo in funzione del farsi compagnia. Sarà che mi sono tirato fuori dalle dinamiche di conoscenza per un bel po', ma ricordo che un tempo i rapporti si vivevano diversamente. C'era l'intento di concedersi all'altra persona per costruire un rapporto che valesse la pena; da quando l'utile ha preso così tanto il sopravvento?\n\nVivo a Torino da un anno, ho 23 anni, e riscontro il più delle volte quella barriera interpersonale che non offre la possibilità di andare oltre. Tante attività sociali compiute, ma dopo le quali manca l'impegno, la costanza, la voglia, la disponibilità emotiva, di costruire effettivamente un legame.\nTutto questo risulta essere piuttosto avvilente. \n\nAd ogni modo, qualora ci fosse qualcuno che abbia colto la stessa disfunzione strutturale, mi farebbe piacere approfondire.",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1gtc7sx/amicizia/"
    },
    {
        "id": "1gtekm5",
        "author": "elganksta",
        "title": "Negozi di abbigliamento old money style",
        "content": "Mi sapreste consigliare dei negozi in cui comprare vestiti del genere, magari non a un prezzo altissimo ( magari che abbiano prezzi scontati) o da dare un'occhiata adesso che ci sarà il black Friday?\n\nVoglio cambiare il mio stile quindi dovrei procurarmi tutto haha",
        "upvotes": 2,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/me9i06qy0h1e1.jpeg?auto=webp&amp;s=05a532f52e606d68e18edb3480b0aaf4dc05b23b"
        },
        "permalink": "/r/torino/comments/1gtekm5/negozi_di_abbigliamento_old_money_style/"
    },
    {
        "id": "1gtegop",
        "author": "elganksta",
        "title": "Escursioni da fare in un giorno ",
        "content": "Salve, dove potrei andare vicino a Torino per immergermi un po' in natura come in questi posti, facili da raggiungere per uno che non ha la macchina ? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gtegop/escursioni_da_fare_in_un_giorno/"
    },
    {
        "id": "1gtbs43",
        "author": "Coccorocco1",
        "title": "Qualcuno esce ancora??",
        "content": "M 31, ho amici ma nessuno vuole fare più niente oltre che stare a casa…cerco persone con cui andare a bere, passeggiare, parlare, ecc.. se ancora esistono 😂😂\n\nMi piace stare con le persone, divertirsi, passeggiate in mezzo alla natura, collezionare ogni tipo di cosa 😁 e da qualche tempo vado in palestra vicino casa",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1gtbs43/qualcuno_esce_ancora/"
    },
    {
        "id": "1gtbdb2",
        "author": "rickyantonino",
        "title": "Ristrutturare a Torino",
        "content": "Tentiamo anche su Reddit. Cerco un'impresa/geometra/ditta/architetti o chicché sia per ristrutturare il mio appartamento. L'esperienza negativa è stata di un anno intero in cui ho chiesto preventivi e non sono neanche arrivati (parlo di circa 5-7 imprese contattate). Ora mi resta poco (o niente) tempo, causa bonus in scadenza, per farmi fare preventivo, fare CILA e avviare in caso una piccola parte dei lavori.  \nLa domanda ovvia è: **avete qualche nome da consigliarmi?**",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gtbdb2/ristrutturare_a_torino/"
    },
    {
        "id": "1gtd128",
        "author": "diegomigoli361",
        "title": "TAGLIANDO SCOOTER 125",
        "content": "Ciao a tutti, da qualche mese ho comprato un people s 125. Di recente ha iniziato a fare un rumore strano che penso possa essere associato ad un relè delle frecce. \nInoltre, recentemente il motorino lo sento più “tirato” e credo sia proprio giunto l’ora di fare un bel tagliando. Qualche buon samaritano su Torino appassionato di scooter vorrebbe aiutarmi? Ho qualche conoscenza e vorrei apprendere meglio il funzionamento ed i processi sottostanti, infine, non vorrei distruggermi economicamente per un tagliando completo.\n\nNaturalmente aperitivo offerto 🙃",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gtd128/tagliando_scooter_125/"
    },
    {
        "id": "1gtc9g2",
        "author": "matbordaRnB",
        "title": "Certificato medico agonisti",
        "content": "Ciao\n\nConsigli per ottenere il certificato medico sportivo agonista a Torino? Nello specifico faccio kick boxing. L'ideale sarebbe in zona San Donato-Cit Turin, o vicino.\n\nGrazie!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gtc9g2/certificato_medico_agonisti/"
    },
    {
        "id": "1gt6v3j",
        "author": "Pablo65t",
        "title": "Info su bagno turco a Torino? Dove sono? Come funziona? ",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gt6v3j/info_su_bagno_turco_a_torino_dove_sono_come/"
    },
    {
        "id": "1gslkpn",
        "author": "Top-Text-7727",
        "title": "Barbiere a Torino ",
        "content": "Salve.\nSono l'ennesimo terrone che si è trasferito a Torino per lavoro.\nHo trovato una casa carina, in una ottima posizione, davanti alla Lavazza.\n Ho posta, banca, Lidl, box auto, il mercato di porta palazzo a 10 minuti. Insomma mi sono ben sistemato.\nTuttavia, una cosa mi manca: un fottuto barbiere capace.\nVoi come fate? Vorrei evitare di andare dai parrucchieri che si fanno pagare trenta euro per un taglio facile. Io non è che abbia chissà quali pretese, ma tutti quelli da cui vado puntualmente ignorano le mie indicazioni e mi fanno un taglio di merda.\nHo provato un barbiere bangalese sotto casa. Ottimo taglio ma condizioni igieniche pessime.\nVoi come avete fatto?",
        "upvotes": 11,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1gslkpn/barbiere_a_torino/"
    },
    {
        "id": "1gsxe5o",
        "author": "albertot011",
        "title": "Aperitivo ",
        "content": "Vorrei fare un aperitivo di domenica in ora di pranzo, in zona Piazza Statuto o poco distante. Cosa mi suggerite?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gsxe5o/aperitivo/"
    },
    {
        "id": "1gstf1q",
        "author": "BatCat86",
        "title": "Acquisto auto usata da Spazio",
        "content": "Qualcuno ha avuto esperienza di acquisto auto usata da Spazio?\n\nPare troppo bello per essere tutto vero: ovviamente devo finanziare, alzando così il prezzo finale dell'auto di 6.000 euro.. ma ti \"ripagano\" in servizi che facendo due calcoli ti ripagano questo delta: 3 anni di garanzia, 5 anni di kasko + FI + atti vandalici + grandine, 5 tagliandi (quindi per 5 anni nel nostro caso).\n\nRispetto ad una macchina nuova della stessa categoria il risparmio finale sarebbe di oltre 7.000 euro.\n\nPer info, la macchina usata è del 2021 e con meno di 40.000 km.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gstf1q/acquisto_auto_usata_da_spazio/"
    },
    {
        "id": "1gspwt3",
        "author": "Parlu10",
        "title": "Posti per studiare in centro?",
        "content": "Come da titolo, cerco dei posti in centro dove si possa andare per studiare in tranquillità.\nDi solito vado da Starbucks ma non sempre si riesce a trovare un posto.\nGrazie mille in anticipo.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1gspwt3/posti_per_studiare_in_centro/"
    },
    {
        "id": "1gsmobm",
        "author": "Front_Candy_6477",
        "title": "Looking for beauty salon ",
        "content": "Hi everyone, i am a woman and looking for a beauty salon to do hydra facial in Torino. Any affordable recommendations please? English speaking will be preferable. Thank you",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1gsmobm/looking_for_beauty_salon/"
    },
    {
        "id": "1gsknu7",
        "author": "Critical-Window9701",
        "title": "Looking for a Pub to Watch Sinner's Semi-Final Match in Turin",
        "content": "Hey everyone,\n\nWe're currently in Turin for the weekend and have tickets to the semi-finals later today. We're hoping to catch Sinner's match in a lively pub with other tennis fans.\nDoes anyone have any recommendations for a good sports bar or pub in the city center where we can watch the match? \n\nThanks in advance!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gsknu7/looking_for_a_pub_to_watch_sinners_semifinal/"
    },
    {
        "id": "1grvzdv",
        "author": "Big-Victory-9959",
        "title": "Personaggio mistico",
        "content": "",
        "upvotes": 43,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gteyblp9e21e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1grvzdv/personaggio_mistico/"
    },
    {
        "id": "1gs5gqc",
        "author": "Nyxion-Lumina",
        "title": "club del libro per universitari/giovani a Torino?",
        "content": "Sono uno studente fuori sede di 23 anni, interessato alla lettura e a conoscere nuove persone. Penso che un buon modo per trovare persone con interessi affini potrebbe essere entrare a far parte di un club del libro, dove ci si incontra periodicamente per discutere di libri, ecc. Il problema è che sono abbastanza sicuro che, frequentando un normale club del libro, troverei principalmente persone molto più anziane di me. Esiste qualcosa di simile, ma rivolto a persone nella fascia d’età tra i 20 e i 30 anni, dove sia possibile parlare di libri e conoscere nuove persone?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1gs5gqc/club_del_libro_per_universitarigiovani_a_torino/"
    },
    {
        "id": "1gs7u68",
        "author": "sugar_kookie",
        "title": "Stura o Rebaudengo? ",
        "content": "Ciao a tutti, sono una ragazza di 22 anni (quasi 23) che studia all'università e nel contempo lavora come promoter Iliad a chiamata. Iliad ha diversi punti vendita, ma io giro principalmente tra due: il Mediaworld di Beinasco e quello di Corso Giulio Cesare. In corso Giulio Cesare fin'ora ho fatto poche giornate, e sempre e solo mattini. Essendo pendolare ho bisogno del treno per raggiungere entrambi i punti vendita (treno+bus/tram).Vi volevo chiedere se secondo voi è più sicura la stazione di Rebaudengo o quella di Stura (contate che il treno pet tornare dovebbe passare alle 19:45-19:50 dipende se a Stura o a Rebaudengo) a questi orari (di sera ma non sera tardi) da raggiungere dal Mediaworld e se entrambe le stazioni sono molto malfamate o è solo un luogo comune. Non conoscendo e non frequentando queste zone di Torino non ho per niente l'esperienza per farmi un'idea  da sola. Magari a qualcuno di voi sembro esagerata ma di queste zone si parla sempre malissimo e spesso viene ribadita la loro pericolosità. \nDatemi un parere\nGrz. ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1gs7u68/stura_o_rebaudengo/"
    },
    {
        "id": "1gs1o4i",
        "author": "Nice_Project9383",
        "title": "Nuovi amici a Torino?",
        "content": "Ciao a tutti, so bene che reddit non è il luogo adatto, ma ci provo comunque.\nSono a Torino da un anno, ma non sono riuscito a fare nuove amicizie. Magari qualcuno è nella mia stessa situazione e vuole fare qualche nuova conoscenza. In tal caso scrivetemi!\n\nLa mia imbarazzante bio: ho 26 anni, mi piace andare al cinema, uscire per una chiacchierata o fare qualche gioco da tavolo (anche se ne conosco 3 in croce 🥲). Non sono un videogiocatore, ogni tanto faccio qualche partita a smash, ma non ho switch con me (e comunque sono scarso lol)",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1gs1o4i/nuovi_amici_a_torino/"
    },
    {
        "id": "1gsavdm",
        "author": "PuzzleheadedHotel406",
        "title": "Appassionati di Jpop/Jrock?",
        "content": "Mi terrò breve: \nSono uno studente di 21 anni e mi piace molto come genere il Jpop. Ascolto anche Jrock e altra musica orientale; ovviamente ascolto anche varie canzoni/band occidentali, ma mi è sempre piaciuta la progressione armonica e il modo in cui suonano le lingue asiatiche (con qualche eccezione, ovviamente), per cui negli ultimi anni mi ci sono appassionato.\nAvendo anche ripreso a suonare volevo sapere se in città c'è qualcuno vicino alla mia età che condivida questo interesse e magari volesse anche provare a suonare qualcosa assieme più di una volta, anche se ovviamente io sono un totale novellino che ha ripreso in mano lo strumento da qualche mese (sto studiando anche teoria musicale).",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1gsavdm/appassionati_di_jpopjrock/"
    },
    {
        "id": "1gs81j5",
        "author": "VeterinarianHuman505",
        "title": "Posti per giocare ad altered",
        "content": "Qualcuno conosce negozi dive giocare ad altered?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gs81j5/posti_per_giocare_ad_altered/"
    },
    {
        "id": "1grzpno",
        "author": "cigatsuro",
        "title": "cosa visitare a Torino in 6 ore aiuto",
        "content": "degli amici di fuori Torino verranno a visitare la città per la prima volta ma onestamente non so cosa fargli vedere, non sono un tipo che esce molto di casa. quali sono posti \"particolari\" o un po' unici vicino al centro?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1grzpno/cosa_visitare_a_torino_in_6_ore_aiuto/"
    },
    {
        "id": "1grtwrs",
        "author": "Herofrancy",
        "title": "Cosa fare a Torino? (Per nerd)",
        "content": "Ciao! Quest'anno andrò al comics di Torino, a dicembre con dei miei amici. Volevo sapere se ci fossero dei posti interessanti e magari anche strani da visitare. Come per esempio cat cafes etc... \n(In più vorrei sapere com'è il comics in generale siccome sarà la mia prima volta ^^)",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1grtwrs/cosa_fare_a_torino_per_nerd/"
    },
    {
        "id": "1grwyfm",
        "author": "Pasta-al-Ragu",
        "title": "Gymbro studente McFit Politecnico? ",
        "content": "Sono una matricola triennale trasferitasi a Torino recentemente; cerco un gymbro per allenarsi in compagnia qualche volta.\n\nInternational people are well accepted too.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1grwyfm/gymbro_studente_mcfit_politecnico/"
    },
    {
        "id": "1grejj7",
        "author": "SteamPaz",
        "title": "Da Superga With Love",
        "content": "",
        "upvotes": 74,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1grejj7/da_superga_with_love/"
    },
    {
        "id": "1grfnu1",
        "author": "SteamPaz",
        "title": "Between the Moon and Jupiter",
        "content": "",
        "upvotes": 34,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/plb9vezgpx0e1.jpeg?auto=webp&amp;s=8d9f159334b36f6f99087d63d53aa294c98aa881"
        },
        "permalink": "/r/torino/comments/1grfnu1/between_the_moon_and_jupiter/"
    },
    {
        "id": "1grv0gl",
        "author": "Shibaaka",
        "title": "Consigli per medici di base zona Filadelfia?",
        "content": "Ciao, mi sono trasferito ed ho fatto il cambio residenza, adesso devo scegliere un medico di base. Ho problemi di salute relativamente importanti e sto cercando un medico di base bravo e che sia disponibile (insomma se ho un'urgenza vorrei riuscire a contattarlo). \n\nConoscete qualcuno? Considerate sono senza macchina ed ho pochissimo tempo nella settimana, quindi più vicino è a piedi, meglio è.\n\nVi ringrazio in anticipo. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1grv0gl/consigli_per_medici_di_base_zona_filadelfia/"
    },
    {
        "id": "1grz2zq",
        "author": "ernynook",
        "title": "Parrucchiere alternativo",
        "content": "Ciao, cerco un parrucchiere che faccia tagli alternativi a Torino. Il taglio che vorrei fare è questo in foto. Avete consigli?",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zh5o72qu431e1.jpeg?auto=webp&amp;s=bc94c7f60597723d865289afabcbad47745eebd1"
        },
        "permalink": "/r/torino/comments/1grz2zq/parrucchiere_alternativo/"
    },
    {
        "id": "1gr8s89",
        "author": "stymiks",
        "title": "Sbaglio o la gtt ogni giorno che passa va peggiorando? ",
        "content": "Da quest'anno ogni volta che devo prendere un tram/bus puntualmente non passa nulla, balzano gli orari e arrivano 30 minuti dopo imballati di gente. In tutto ciò il servizio è inoltre più costoso... Sono pazzo io o evidentemente questa città ha trasporti scadenti?\n\nQualcuno sa il motivo?\n\nNota: non abito in periferia e questi problemi sono soprattutto in centro con linee 15 16 68... \n\nNota 2: per ogni bus che passa dal mio lato ne passano almeno 5 dall'altro, sono sfortunato? ",
        "upvotes": 65,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1gr8s89/sbaglio_o_la_gtt_ogni_giorno_che_passa_va/"
    },
    {
        "id": "1grxd7c",
        "author": "Powerful_Alfalfa_927",
        "title": "Consigli su Pozzo Strada / Corso Brunelleschi",
        "content": "Ciao! Ho trovato una casa che sto pensando di acquistare all'inizio di Corso Brunelleschi, all'incirca all'altezza del mercato. Vorrei sapere se la zona di sera è sicura, dato che mi muovo con i mezzi. Ho letto opinioni discordanti che mi stanno facendo dubitare della scelta. Qualcuno che conosce la zona e ci vive ha consigli, anche su altri aspetti del quartiere da tenere in considerazione? Grazie!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1grxd7c/consigli_su_pozzo_strada_corso_brunelleschi/"
    },
    {
        "id": "1grehw4",
        "author": "SteamPaz",
        "title": "Blue Mole",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gv7d0phjgx0e1.jpeg?auto=webp&amp;s=045b4dcfc5e722348ad01f08352ffd2ff92b7524"
        },
        "permalink": "/r/torino/comments/1grehw4/blue_mole/"
    }
]