[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 88,
        "comments": 268,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mii95w",
        "author": "MoneyLibrarian9032",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 37,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mii95w/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mhzsi2",
        "author": "Friendxx",
        "title": "K POP Demon Hunters is INCREDIBLE!",
        "content": "I’m an adult male and I never listen to K POP or watch animation, yet I’m totally hooked on this movie, I’ve seen it like three times already. I got the sound track playing on my Spotify every day, such a catchy song, Golden, is amazing. Everyone I know is totally hooked on this movie. Sony did an incredible job with this movie. Glad it’s on Netflix and I can watch it anytime I want!",
        "upvotes": 270,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1mhzsi2/k_pop_demon_hunters_is_incredible/"
    },
    {
        "id": "1mis6et",
        "author": "Lostmyoldname1111",
        "title": "My Oxford Year",
        "content": "Stumbled on My Oxford Year and so far, so good. I’m particularly enjoying that the male lead is the actor that played young King George in the Queen Charlotte mini-series. Looks like it’s going to be decent.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mis6et/my_oxford_year/"
    },
    {
        "id": "1miljre",
        "author": "Elegant-Glove-1755",
        "title": "An Argrentine Science fiction tv series that no one is talking about?",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1miljre/an_argrentine_science_fiction_tv_series_that_no/"
    },
    {
        "id": "1mil7gy",
        "author": "GucciDLuffy",
        "title": "continue watching problem",
        "content": "for like a week my continue watching row has been full of movies and shows that i've ALREADY COMPLETED. when i click remove from row they just pop right back up when i sign back in. don't see this happening to anyone else so wtf did i do wrong?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mil7gy/continue_watching_problem/"
    },
    {
        "id": "1miikw5",
        "author": "MoneyLibrarian9032",
        "title": "Netflix Unveils Full Cast for ‘The Twits’ Movie, Original Songs by David Byrne and Hayley Williams",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1miikw5/netflix_unveils_full_cast_for_the_twits_movie/"
    },
    {
        "id": "1mhh8le",
        "author": "Longjumping_Land_977",
        "title": "Amy Bradley case has a number of ‘new tips’ following ‘incredible’ response to Netflix series",
        "content": "",
        "upvotes": 533,
        "comments": 313,
        "media": null,
        "permalink": "/r/netflix/comments/1mhh8le/amy_bradley_case_has_a_number_of_new_tips/"
    },
    {
        "id": "1mis4hw",
        "author": "Hefty-Grand3184",
        "title": "Traveling for work",
        "content": "I travel all over for work and can't watch Netflix so im thinking another canceling any tips for how to fix the whole outside the household thing before I do",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mis4hw/traveling_for_work/"
    },
    {
        "id": "1mihl0d",
        "author": "-AI3x",
        "title": "What Should I Watch On Netflix?",
        "content": "I’m currently looking for something to watch on Netflix as I’m Quite Bored.\n\nI used to watch a lot of Horror Movies, Thrillers, Detective. Action and Comedy movies.\n\nSo something with those genres would be great. ",
        "upvotes": 4,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1mihl0d/what_should_i_watch_on_netflix/"
    },
    {
        "id": "1migzz8",
        "author": "tamlee00",
        "title": "Series recommendations for me and my girlfriend?",
        "content": "Me and my girlfriend are looking to start a new series, any recommendations?\n\nPrevious serious on Netflix that we have watched and enjoyed - Prison Break, Peaky Blinders, Power…. Just to give an idea of things we’ve previously watched\n\nAny recommendations appreciated👍🏼",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1migzz8/series_recommendations_for_me_and_my_girlfriend/"
    },
    {
        "id": "1mikd83",
        "author": "Appropriate_Catch860",
        "title": "Best thriller and crime web series or films to watch",
        "content": "I am in searching best thriller movie to watch. I hope you will help me. Now I don’t know what to write more, it is feeling like I am writing an essay. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mikd83/best_thriller_and_crime_web_series_or_films_to/"
    },
    {
        "id": "1mipw5s",
        "author": "EricJackson94",
        "title": "Behold the Creature: Introducing Jacob Elordi as Frankenstein’s Monster",
        "content": "Guillermo del Toro has directed a Frankenstein movie. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mipw5s/behold_the_creature_introducing_jacob_elordi_as/"
    },
    {
        "id": "1mipdrt",
        "author": "Suspicious-Job-8815",
        "title": "Untamed Moral(?)Opinion",
        "content": "Spoilers if you haven’t watched \n\n\n\n\nIn untamed, it’s revealed that Jill paid Shane to take out Sanderson for what he did to Caleb. \n\nFor me personally, (someone who’s thankfully never been in that situation) I’d much rather see him be sent to prison &amp; shamed as a child rapist &amp; killer. Sandersons family still see him as a good person who went missing in the park &amp; will likely get a fat payout from the lawsuit. Wouldn’t it be better if he was publicly shamed &amp; sent to prison where I’m sure pedophiles do not have a good time. I do get that Jill didn’t want to listen to his voe in court &amp; Kyle wanted to be sure. But they literally had a video of them together.\n\n Obviously I know it’s just a show, but just a hypothetical. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mipdrt/untamed_moralopinion/"
    },
    {
        "id": "1mijlc5",
        "author": "Grand_Event9927",
        "title": "Any good anime recommendations??",
        "content": "Animes I've liked\nOne piece\nThe Rising of the Shield Hero\nDandadan\nJjk\nDemon slayer\nDelicious in dungeon\nDr. Stone\nMHA\nMy daemon\nLookism\nAnd Komi can't communicate\n\nSome other parts of media (games, movies, and shows) I've liked\nGravity Falls\nThe greatest showman\nUndertale\nDeltarune\n(That last part was just in case there's smth similar) ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mijlc5/any_good_anime_recommendations/"
    },
    {
        "id": "1miovgs",
        "author": "Phis-n",
        "title": "Netflix is being sneaky and I know my account wasn't hacked again",
        "content": "Got hacked recently but that was at least one billing cycle ago AND i had changed my password. Aint no way someone hacked it again and added an extra member then NEVER USED IT lmfao",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1miovgs/netflix_is_being_sneaky_and_i_know_my_account/"
    },
    {
        "id": "1mimcfv",
        "author": "Gali22",
        "title": "How do they know?",
        "content": "Stumbled upon this video on YouTube and I'm wondering - is this for real? Are cast earnings actually public? Some of the figures seem shockingly low, others unrealisticly high. Its also strangely comforting that some of these actors have the net worth of a regular human being. But again - can we trust a list like this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mimcfv/how_do_they_know/"
    },
    {
        "id": "1mikmiu",
        "author": "Dry_Mark_8434",
        "title": "Warum funktionieren meine Downloads nicht? Netflix zeigt an dass sie gedownloadet wurden wenn ich sie starte gehen sie vielleicht 3-4 Minuten bis ich diese Meldung kriege",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mikmiu/warum_funktionieren_meine_downloads_nicht_netflix/"
    },
    {
        "id": "1mi5oyn",
        "author": "clueless_212",
        "title": "what are some interesting documentaries/docu series?",
        "content": "i usually watch true crime so would love more suggestions for those, but if any other that are interesting lmkk xxx \n\npls send ones only on netflix as that is all i have thx  ",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1mi5oyn/what_are_some_interesting_documentariesdocu_series/"
    },
    {
        "id": "1mid6d6",
        "author": "Top-Three-USA",
        "title": "Netflix’s \"My Life With the Walter Boys\" Season 2 Trailer Teases Jackie’s Return, Rodeo Rivalry &amp; Love Triangle",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mid6d6/netflixs_my_life_with_the_walter_boys_season_2/"
    },
    {
        "id": "1miip11",
        "author": "Queasy_Difference_96",
        "title": "Does Netflix know if you move countries?",
        "content": "We were on holiday in Tenerife last week and we discovered The Rookie. We got several episodes in and really got into it. We got back home in the UK yesterday, switched Netflix on tonight for some more of The Rookie and there’s no sign of it anywhere!! We literally watched it on Sunday evening and there was no warning it was going to be removed, so I’m wondering if maybe it’s available in Spain which is why we could watch it?! I didn’t change the region or anything, though we did connect to the hotel wifi 🤔 ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1miip11/does_netflix_know_if_you_move_countries/"
    },
    {
        "id": "1mibxom",
        "author": "BlackJimmy88",
        "title": "Am I able to watch stuff on my account on a friend's PC?",
        "content": "A few friends are looking to catch up on some shows together, and as far as I'm aware, I'm the only one with a Netflix account.\n\nIf I log into my account at my friend's house, on their PC, would that be breaking any rules?\nI'm not looking to get my account banned for this after all.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mibxom/am_i_able_to_watch_stuff_on_my_account_on_a/"
    },
    {
        "id": "1mif8f7",
        "author": "Temporary-Custard798",
        "title": "Strange error",
        "content": "I was watching castlevania and now I get the error that I’v watched everything that I’v downloaded, but I’m still at season 3 and downloaded every episode till season 4? And when I try to watch that same episode again I get a error but I can watch other episodes. Pls explain",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mif8f7/strange_error/"
    },
    {
        "id": "1miik1i",
        "author": "Repulsive_Knee9258",
        "title": "Anyone knows more POC romance movies/tv shows like forever ?",
        "content": "I’m Biracial, constantly been watching really white romance shows my whole life like life with the Walter boys and the summer I turned pretty, normal people.  but these days I’ve grown bored  of the same representation especially since that recent movie my Oxford year or whatever on Netflix. What a rubbish movie.\n\nAnyway I watched the tv show forever, and it was 10/10 so romantic and relatable.happy to hear there’s a season 2 and I’d like to know if there’s any more movies or tv shows like that out there. Let me know thanks ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1miik1i/anyone_knows_more_poc_romance_moviestv_shows_like/"
    },
    {
        "id": "1mhswvl",
        "author": "Impressive-Crow8",
        "title": "Looking for TV show recommendations for couples to watch together! 🎬💑",
        "content": "Hi everyone!\n\nMy husband and I are on the hunt for a new show to watch together, and we’d love some suggestions.\n\nHere are some series we’ve already watched and really enjoyed:\n\t•\tHomeland\n\t•\tSuits\n\t•\tThe Night Agent\n\t•\tThe Bear\n\t•\tDexter\n\t•\tThe Blacklist\n\t•\tCSI\n\nWe’re into suspense, crime, drama, thrillers — anything that keeps us on the edge of our seats. A good storyline, strong characters, and a little intensity go a long way for us. Bonus points if it’s the kind of show that makes you say, “Okay, one more episode…”\n\nIf you and your partner have a favorite series that really pulled you in, we’d love to hear it. Thanks in advance for the recommendations! ",
        "upvotes": 20,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1mhswvl/looking_for_tv_show_recommendations_for_couples/"
    },
    {
        "id": "1miafod",
        "author": "kejdurapa",
        "title": "Netflix interface is very low resolution",
        "content": "Hello;  \nI bought a TCL 55C655PROGTV model TV, and the Netflix interface is very low resolution.\n\nFonts, buttons, content photos, and even profile photos are all very low resolution.   \nEven the older generation Xiaomi Mi Box 4s offers better resolution.\n\nSome people say it's due to Netflix licenses, but when we tested the TV with the setup service, we didn't see anything like that. We saw it while watching a movie tonight.\n\nI'm using the 720p basic plan. I know it's low, but 720p shouldn't look this bad. It looks way worse than it needs to be.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1miafod/netflix_interface_is_very_low_resolution/"
    },
    {
        "id": "1mhqexj",
        "author": "R_Steelman61",
        "title": "Leanne",
        "content": "Ok, I like her stand up but I was worried about this show. I am pleasantly surprised. It's really funny. Leanne does great in her first show and the supporting cast is wonderful. I'm in! ",
        "upvotes": 19,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mhqexj/leanne/"
    },
    {
        "id": "1mhd6g7",
        "author": "AbsolutDrift",
        "title": "whats a show that has completely changed your mindset",
        "content": "for me its The Good Place, i mean this show has brightened my days in my worst moments and i even teared up a few times. I believe that the whole cast was incredible, and the show was overall so lighthearted and smart at the same time… To sum up, i think its the kind of show that makes you want to reconsider your behavior with both friends and family",
        "upvotes": 82,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1mhd6g7/whats_a_show_that_has_completely_changed_your/"
    },
    {
        "id": "1mi8wrh",
        "author": "lilniaaaa",
        "title": "Does anyone remember the name of this sci fi movie?",
        "content": "I remember watching it years ago, I could've sworn it was called 2030. But I remember in the movie there was this older guy that ejected himself from the ship then as he floats in the darkness he says its so lonely. There was a girl that survived in the end nobody else made it. The beginning of the movie had that sci fi pre movie text and I think it said the year 2030, im not sure. I can't really remember much else. :( it was really good. I think there was a multiracial relationship too.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mi8wrh/does_anyone_remember_the_name_of_this_sci_fi_movie/"
    },
    {
        "id": "1mio6ve",
        "author": "Next_Leather8571",
        "title": "Is there any animes on Netflix that have NSFW content that I should avoid",
        "content": "I like to watch animes and this is the only place I can watch it but I want to avoid any animes with nudity and or sexual content I'm fine with Gore or violence but I was just wondering which ones you would suggest",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1mio6ve/is_there_any_animes_on_netflix_that_have_nsfw/"
    },
    {
        "id": "1mi58xd",
        "author": "Responsible-Sign3223",
        "title": "Axed cast member reveals her true feelings about being edited out of Perfect Match",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mi58xd/axed_cast_member_reveals_her_true_feelings_about/"
    }
]