[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1kapmyr",
        "author": "Agreeable_Produce_86",
        "title": "Stolen bike",
        "content": "Just in case you saw my stolen bikeonline or somewhere let me know😅 thanks.",
        "upvotes": 108,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/arzas5afdsxe1.jpeg?auto=webp&amp;s=bfafbb517927faadfc989d3099de3b8e96280f9b"
        },
        "permalink": "/r/torino/comments/1kapmyr/stolen_bike/"
    },
    {
        "id": "1kb9l76",
        "author": "raramoss",
        "title": "Gruppi di corsa.",
        "content": "Buongiorno a tutti. Abito a Torino da 7 mesi, pero non conosco nessuno per fare corsa insieme. Corro ogni volta che posso (2-3 volte a settimana). Io e mia moglie oppure solo. Vedo sempre al parco san valentino troppi gruppi di corsa. Sapete come posso fare per unirmi a uno di questi gruppi? Sto imparando l’italiano e anche parlo inglese, portuguese e un pó di spanholo, quindi sarebbe ottimo per praticare corsa e anche la lingua. Ciao!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kb9l76/gruppi_di_corsa/"
    },
    {
        "id": "1kbb7nf",
        "author": "No_Environment_2237",
        "title": "Need suggestions: I want to spend my semester abroad in Turin in summer semester",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kbb7nf/need_suggestions_i_want_to_spend_my_semester/"
    },
    {
        "id": "1kacf50",
        "author": "maschera84",
        "title": "Ho intervistato un marocchino",
        "content": "Premetto che questo non vuole essere un post politico e che, anzi, non sono nemmeno di sinistra.\n\nL’altro giorno mi sono fermato a una bancarella per comprare una pila per l’orologio. Ho pensato: \"Dai, stavolta diamo una mano a questo signore invece di andare al Carrefour.\"\n\nLo chiamerò Mohammed, giusto per raccontarvi la sua storia.\n\nEra molto gentile, cordiale. Educato e rispettoso, quasi formale. Mi ha fatto tornare in mente com’erano, venticinque anni fa, tanti nordafricani che cercavano di costruirsi una vita in Italia: seri, lavoratori, con voglia di integrarsi e alle prese con razzismo ingiustificato.\n\nAllora ci ho scambiato due chiacchiere, senza filtri. Gli ho chiesto come vede la situazione degli immigrati, visto che vive da trent'anni a Torino.\n\nMi ha risposto senza pensarci troppo:\n\"Una merda. I maranza sono i peggiori. Non ci fanno vivere, ci pestano e ci rubano le bancarelle.\"\n\nNon mi aspettavo una risposta del genere. Anzi, mi aspettavo del buonismo.\n\nSecondo lui il problema sono i ragazzini di origine nordafricana che hanno il passaporto italiano, ma zero rispetto. Si sentono in diritto di trattare male i propri stessi connazionali, quelli che lavorano onestamente.\n\nDice che lo rendono la vita impossibile. È incazzato perché rubano nei supermercati e poi si organizzano su Telegram, facendosi girare le dritte su dove è più facile rubare.\n\nCe l'ha molto con gli egiziani perché secondo lui sono violenti. Ma questa non sono sicuro la prendo seriamente perché c'è rivalità tra i popoli nordafricani e si tende a parlare male dei vicini.\n\nSecondo Mohammed, 25 anni fa Torino sembrava la Svizzera: buttavi un mozzicone per terra e la gente ti riprendeva.\nOggi, dice lui, è diventata una merda. Per colpa di immigrati fuori controllo che rubano, pestano e intimidiscono.\n\nNonostante tutto, Mohammed ama l’Italia. Ama i torinesi, che lo hanno accolto, e i napoletani per il loro cuore. Ama perfino la polizia italiana, che secondo lui riesce a metterti in riga senza trattarti come un animale.\n\nEppure, sogna di tornare in Marocco. Dice che adesso, rispetto all’Italia di oggi, si vive meglio lì.\n(Anche se su questo, permettetemi, ho i miei dubbi: il Marocco lo conosco bene.)\n\nQuesta chiacchierata mi ha aperto gli occhi.\n\nNon immaginavo che esistesse questa sottocultura, né che i primi a subire i danni degli immigrati fuori controllo fossero proprio gli immigrati perbene.\n\nNon voglio passare per buonista, ma di sicuro il mio modo di pensare è cambiato.\n\nNon vedrò più le cose come \"loro contro noi\", ma come \"loro contro noi e loro\".\n\nO, forse meglio ancora, penserò a \"noi\" includendo tutti i Mohammed.",
        "upvotes": 220,
        "comments": 64,
        "media": null,
        "permalink": "/r/torino/comments/1kacf50/ho_intervistato_un_marocchino/"
    },
    {
        "id": "1kauh1n",
        "author": "Educational-Water846",
        "title": "Info Referendum Giugno 2025",
        "content": "Breve post informativo circa i prossimi referendum abrogativi del 7-9 Giugno. \n\nSe siete residenti in altre città ma volete votare a Torino per motivi di studio, lavoro o salute, dovete inoltrare la richiesta entro il 4 Maggio (info di dettaglio ai seguenti link)!\n\nInfo:\nhttp://www.comune.torino.it/elezioni/referendum2025.shtml\n\nVoto fuori sede:\nhttp://www.comune.torino.it/torinogiovani/appuntamenti/voto-fuori-sede-referendum-2025\n\nLavorare ai seggi:\nhttp://www.comune.torino.it/torinogiovani/lavoro/lavorare-ai-seggi-elettorali\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kauh1n/info_referendum_giugno_2025/"
    },
    {
        "id": "1kaq4r4",
        "author": "Jimthafo",
        "title": "Qualcun* va mai al \"200 lire\"? (Via Barbaroux)",
        "content": "Ci sono passato davanti e sembra che qualcuno abbia fatto una fotografia della mia infanzia e l'abbia trasformata in un bar. Ho giocato letteralmente a quasi tutti i giochi presenti nei vari quadretti, souvenir, cartonati (addirittura mia madre aveva 2 Intellivision, la console esposta tra i due cabinati).\n\nIo ci passerei tutte le sere se potessi ma nessuno dei miei amici e conoscenti è appassionato (tantomeno mia moglie). Se qualcun* è un habitué* del luogo me lo dica \nche magari ci si fa una partitina o una 🍺. Saluti! ",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kaq4r4/qualcun_va_mai_al_200_lire_via_barbaroux/"
    },
    {
        "id": "1kabo4q",
        "author": "maschera84",
        "title": "E se al posto di fare solo multe facessero anche sicurezza?",
        "content": "Premetto che sono nuovo a Torino, quindi magari questo succede già e verrò giustamente attaccato.\n\nPrendo spesso il tram, Linea 4. Becco spessissimo i controllori che, giustamente, non la fanno passare liscia se non hai il biglietto.\n\nRipeto, giustamente.\n\nL'altro giorno c'era un gruppo di bulletti che mangiavano semi, li sputavano poi per terra e guardavano molto minacciosamente tutti sul tram, italiani e non. Insomma, volevano che tutti avessimo paura di loro e abbassassimo lo sguardo.\n\nI controllori muti, guardavano dall'altra parte, e sono scesi alla prima fermata, lasciando a noi passeggeri il piacere di avere questi dementi sul tram con noi.\n\nRicordo a Budapest i controllori erano sempre accompagnati da un energumeno faceva rispettare i colleghi e i passeggeri in caso di abusi.\n\nAdesso mi domando, ma se al posto di pensare a battere solo cassa i controllori non facessero anche servizio di sicurezza \"to give back\"? \n\nO magari ho solo avuto una cattiva esperienza, già succede e non lo so?",
        "upvotes": 146,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/voirf3enaoxe1.jpeg?auto=webp&amp;s=aecf990ef730fc8055450d76da550c8a88d2a2bc"
        },
        "permalink": "/r/torino/comments/1kabo4q/e_se_al_posto_di_fare_solo_multe_facessero_anche/"
    },
    {
        "id": "1kayh44",
        "author": "Original_Draw_9492",
        "title": "Pilastri Storie di Torino",
        "content": "Ho visto girando per la città diversi piedistalli/installazioni/totem, chiamateli come volete, tutti intitolati \"Storie di Torino\", posti davanti a monumenti o luoghi di interesse, con annessa breve descrizione/storia del luogo stesso.\nAvendone trovati finora 12, mi è partita la voglia di \"collezionarli\" tutti, ma non so quanti siano in totale effettivamente, né ho visti altri 2 non compresi tra quei 12 di cui però mi manca la foto.\nEsiste una lista completa da qualche parte?\nVi allego immagine per capire di cosa sto parlando ma l'avrete visto tutti di sicuro almeno uno così ",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ao7rn2a56uxe1.jpeg?auto=webp&amp;s=32fd4312d75158b1794596d9e3b70177b9468c76"
        },
        "permalink": "/r/torino/comments/1kayh44/pilastri_storie_di_torino/"
    },
    {
        "id": "1kau5h1",
        "author": "TheAnt89",
        "title": "Nuove conoscenze/meeting new people",
        "content": "ITA: \nCiao a tutti, sono un ragazzo di 29 anni originario di Torino che ha vissuto diversi anni all’estero. \nDa qualche anno sono tornato però mi piacerebbe allargare il giro di conoscenze. \n\nParlo IT/ENG/ESP, di recente ho iniziato a correre ma in generale sono un ragazzo tranquillo che va gli piace andare al pub a scambiare due chiacchiere. Viaggio sia per lavoro che per piacere e mi piace provare nuove cucine. \n\nSe ti ritrovi mandami un DM 😄\n\nENG: \n\nHi everyone! I’m a 29-year-old guy from Turin, Italy. I spent a few years living abroad and have recently moved back.\nEven though I’ve been back for a while, I’d love to meet some new people.\n\nI speak Italian, English and Spanish. I’ve recently taken up running, but I’m generally a laid-back person — I enjoy going to the pub for a chat, travelling (for both work and fun), and trying out new cuisines.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kau5h1/nuove_conoscenzemeeting_new_people/"
    },
    {
        "id": "1kas79c",
        "author": "Texas-Gold",
        "title": "Dove trovare libri usati a poco prezzo a Torino (centro)?",
        "content": "Ciao a tutti! Mi chiedevo se qualcuno di voi conoscesse dei negozi o delle librerie a Torino (preferibilmente in centro) dove si possano trovare libri usati a prezzi bassi.   \n  \nDi solito ci sono negozi che vendono edizioni un po' più vecchie, magari quelle che non si trovano facilmente nelle librerie normali, e che per questo vengono vendute per pochi euro.  \n  \nAl Balon, non ho mai trovato tanti libri, e le bancarelle di Via Po sono molto care, vendono quasi prezzo di copertina se non di più.   \n  \nGrazie in anticipo per l’aiuto.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kas79c/dove_trovare_libri_usati_a_poco_prezzo_a_torino/"
    },
    {
        "id": "1katw4r",
        "author": "thep3Dr0",
        "title": "LAVORO",
        "content": "Ciao, qualcuno conosce un posto dove posso trovare lavoro? Mi trovo in una situazione complessa perché sono argentino. Tra circa un mese otterrò la cittadinanza ma ho un lavoro 6 giorni a settimana e guadagno 400 euro al mese, e non posso permettermi le spese per vivere, sto imparando l'italiano ma posso comunicare in spagnolo e inglese e fare tutti i tipi di lavori",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1katw4r/lavoro/"
    },
    {
        "id": "1kakvoo",
        "author": "Spiritual_Yeti",
        "title": "Ingegnere cerca lavoro part-time",
        "content": "Ciao a tutti. Scrivo da account throwaway con dati non troppo specifici per non farmi sgamare dalla mia attuale azienda.\n\nHo 30 anni, laureato magistrale al PoliTo, lavoro nel settore IT da 4-5 anni con svariate aziende. Ho un buon curriculum ma non sopporto più il mio lavoro in ambiti corporate. Non provo soddisfazione nel concludere i compiti quotidiani, l'ambiente porta una vagonata di stress, nel tempo libero non riesco a riposarmi mentalmente e fisicamente e non c'è modo di imparare cose nuove. Ho già fatto da team leader / project manager ma lo stress aumenta e passo ormai tutto il giorno davanti a un computer.\n\nHo avuto un'offerta per il lavoro della vita in ambito creativo, ma devo continuare a studiare e formarmi per un annetto prima di aprire partita IVA, e il mio lavoro non mi lascia energie e tempo necessari per studiare.\n\nSto cercando quindi un qualsiasi lavoro part-time che mi dia almeno 1000/1200 dindi al mese per poter pagare affitto, bollette e rata dell'auto.\n\nIl problema è che non so dove girarmi. Il mio curriculum è troppo \"gonfio\" e non vengo preso sul serio, oppure ho paura di trovare un altro ambiente tossico da cui non riuscire a uscire. Sto valutando qualsiasi tipo di lavoro (anche lo spazzino) pur di prendere un po' di aria fresca e uscire dalla prigione che sta diventando casa mia.\n\nChiedo sia per cercare consigli di persone in una situazione simile, sia per consigli di persone che conoscono degli ambienti in cui inviare cv, sia per pacche sulle spalle.\n\nCome info utili: sono pesantemente nerd, adoro fotografia, cucina, caffè, musica, ho pochissimi risparmi, una voglia infinita di studiare e imparare cose nuove, sospetto ADHD in fase di diagnosi.\n\nGrazie a chi vorrà rispondere.\n(Se prendete per il culo ignoro e blocco senza problemi, quindi evitate e siate gentili e comprensivi, grazie).",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1kakvoo/ingegnere_cerca_lavoro_parttime/"
    },
    {
        "id": "1ka6fvf",
        "author": "luigisupport",
        "title": "Mi sento come un alieno",
        "content": "Ciao a tutti,\nSono una ragazza francese a Torino per due mesi. Ho passato 3 anni a studiare l’italiano insieme all’inglese all’università e adesso sto facendo uno stage qui per validare la mia laurea. Il problema è che quasi ogni volta che ho un’interazione con un italiano, mi sento male. Succede nei ristoranti, nei negozi, nei musei. Un po’ dappertutto. Ho l’impressione che ogni volta che apro la bocca e si sente che sono francese e non italiana, le persone mi giudicano. Parlo abbastanza bene ma ho perso un po’ di livello, e quando sono stressata parlo ancora peggio, però capisco bene. Solo a volte non capisco qualche parola perché non ho tutto il vocabolario che avete, anche di cose semplici che forse non abbiamo visto durante le lezioni, e la gente mi guarda sempre come se dessi fastidio.\nA volte mi fanno delle domande e, siccome non capisco, lo dico e chiedo se possono spiegare, ma mi guardano con un’aria che mi sembra esasperata e sprezzante.\nAdoro Torino e sono super contenta di essere qui, trovo che la città sia bellissima e che ci siano tante cose da fare, ma non mi sento accolta come nella mia città natale e questo mi rende un po’ triste. Sono già stata in Italia, al sud vicino a Napoli e anche al Lago di Garda, e non so se ho mai sentito questa sensazione, o almeno non così tanto.\nÈ questo il trattamento riservato a tutti i francesi? Oppure le persone sono così con tutti, anche con gli italiani?",
        "upvotes": 39,
        "comments": 55,
        "media": null,
        "permalink": "/r/torino/comments/1ka6fvf/mi_sento_come_un_alieno/"
    },
    {
        "id": "1ka08il",
        "author": "Living-Equivalent-18",
        "title": "Can I report a homeless person for peeping through my windows?",
        "content": "I’m a student in Torino and moved here a couple months ago. I’m staying in a small flat on the ground floor and the homeless man who camps on the sidewalk looks through my windows every chance he gets. I can’t open my windows out of fear. He sometimes knocks on the glass at night when the lights are on. I live alone and I’m a girl so this situation is pretty scary to me and I don’t know what to do. Any advice would be much appreciated.",
        "upvotes": 69,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1ka08il/can_i_report_a_homeless_person_for_peeping/"
    },
    {
        "id": "1kakubn",
        "author": "glorious-ahole",
        "title": "Grocery shopping as a student",
        "content": "Bueno sera,\n\nI am an international student who will be joining Politecnico di Torino as a PhD student. Since this Is my first time in a completely new country, can someone please let me know the do's and don'ts of the city, things i should keep in mind as a international student, budget grocery shopping in the city and approximate cost per month on groceries? I will be getting a stipend of €1386 per month. Assuming €300-400 of rent, would I be able to save, say around €300 per month?\n\nGrazie mille ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kakubn/grocery_shopping_as_a_student/"
    },
    {
        "id": "1kajch1",
        "author": "Ambitious_Home8801",
        "title": "Mainstream clubs",
        "content": "Buongiorno,\n\nAre there any clubs playing less alternative/more mainstream music in Torino that is worth going to?\n\nI can enjoy electronic music to some extend, but an all-nighter without any vocals or “hits” can kill a buzz for me.\n\nGrazie mille! 🙌🏽",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kajch1/mainstream_clubs/"
    },
    {
        "id": "1k9qgfh",
        "author": "No_Speed_2401",
        "title": "Italian language learning for a beginner",
        "content": "Hello guys. I applied to polito for 25/26 September intake and got pre-enrollment done. I should start learning italiano. Would you please suggest some free books, videos, courses for a complete beginner like me?",
        "upvotes": 11,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n374we9ybjxe1.jpeg?auto=webp&amp;s=7fa4ac426ca756f2d42ae739327082af35146ded"
        },
        "permalink": "/r/torino/comments/1k9qgfh/italian_language_learning_for_a_beginner/"
    },
    {
        "id": "1k9ghxf",
        "author": "maschera84",
        "title": "A chi ha vandalizzato quest'auto di Free2Move: perché?",
        "content": "Ho utilizzato il servizio spesso nel mio ultimo viaggio a Torino, ed è comodissimo. Anche se non economico come Ubeeqo e le auto non sono sempre in buone condizioni.\n\nUna delle auto che ho noleggiata l'ho trovata così.\n\nAl vandali che ha rovinato quest'auto, ma qual è il tuo disagio che ti porta a fare cose del genere?\n\nMi sta sulle palle quando vandalizzano auto in sharing, monopattini (o peggio li lasciano parcheggiato in mezzo marciapiedi).\n\nDovremo incentivare servizi del genere, come a Barcellona se vogliamo meno traffico e aria pulita. \n\nNon farli scappare via.",
        "upvotes": 70,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lwa9ze2xfgxe1.png?auto=webp&amp;s=86cd944bda83ecfc9eef11bdac722458f11ff064"
        },
        "permalink": "/r/torino/comments/1k9ghxf/a_chi_ha_vandalizzato_questauto_di_free2move/"
    },
    {
        "id": "1k9uhoj",
        "author": "Borzoian53",
        "title": "Speedball in via Stati Uniti a Torino - chiuso o trasferito?",
        "content": "Qualcuno sa che cosa è successo al negozio Speedball in via Stati Uniti, vicino alla stazione di Porta Nuova? Era un grande negozio di abbigliamento per uomo. È ancora aperto o ha chiuso? Se si è trasferito, qualcuno conosce il nuovo indirizzo? Grazie per qualsiasi informazione.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k9uhoj/speedball_in_via_stati_uniti_a_torino_chiuso_o/"
    },
    {
        "id": "1k99d0h",
        "author": "CryingAlwaysCrying",
        "title": "Stazione Dora",
        "content": "",
        "upvotes": 77,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qo5nenhrwexe1.jpeg?auto=webp&amp;s=030d1e8584ce3204a997af3374a87e300a79b8f5"
        },
        "permalink": "/r/torino/comments/1k99d0h/stazione_dora/"
    },
    {
        "id": "1k9xdq9",
        "author": "mooniemarr",
        "title": "Mercati dell'usato?",
        "content": "Ciao, questo weekend (dal 1 al 4) saró a Torino, mi indicati i migliori mercati dell'usato? Principalmente di vestiti, grazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1k9xdq9/mercati_dellusato/"
    },
    {
        "id": "1k90ws2",
        "author": "iannezluke79",
        "title": "Popeyes",
        "content": "Apertura a MondoJuve (se a qualcuno può interessare)",
        "upvotes": 145,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wvcc084qucxe1.jpeg?auto=webp&amp;s=4ef45c3d9b5fe1ab5377b16d44ab89d52961e986"
        },
        "permalink": "/r/torino/comments/1k90ws2/popeyes/"
    },
    {
        "id": "1k9p1mb",
        "author": "Sospettosamente",
        "title": "Consiglio ottico economico a Torino e provincia per sostituzione lenti",
        "content": "Ciao a tutti!\nSto cercando un ottico economico su Torino o provincia dove poter sostituire solo le lenti ai miei occhiali (senza cambiare montatura).\nAvrei già la prescrizione aggiornata, mi serve solo qualcuno che lavori bene e a prezzi onesti.\nQualcuno ha esperienze o consigli da darmi? Meglio ancora se sono veloci nella consegna!\nGrazie mille in anticipo!\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1k9p1mb/consiglio_ottico_economico_a_torino_e_provincia/"
    },
    {
        "id": "1k9ru1w",
        "author": "Outside-Kitchen-7681",
        "title": "meet new people in turin",
        "content": "hello i am from malaysia doing an internship here. i would like to ask is there anyone from malaysia or from any of the region nearby. i would like to get to know  and meet some new people. \n\nim also glady will be happy to meet the locals here if anyone is interested.\n\ndo let me know!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1k9ru1w/meet_new_people_in_turin/"
    },
    {
        "id": "1k9c1bw",
        "author": "Big_Attitude3680",
        "title": "Community dev a Torino",
        "content": "Ciao ragazzi, \nmi sono da poco trasferito a Torino, a parte i vari mettup tenuti al toolbox sapreste consigliarmi altri eventi per programmatori/tech?\nGrazie ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1k9c1bw/community_dev_a_torino/"
    },
    {
        "id": "1k9a0dm",
        "author": "Bubbly-Fee8434",
        "title": "Is Torino nice to live?",
        "content": "Ciao! Are there anyone who study or studied at Polito? I plan to study bachelor Mechanical engineering course taught in English. I'm a bit worried because I've never been to Torino before and.. I heard that Italian university only focus on theoretical part of engineering. Could you share your experience at Torino?\n\nIs it hard to find a engineering job right after undergraduate in Europe? \n\nAre there nice studying spots for studying in Torino?\n\nIs it safe to live? I lived in the uk before and I've seen many rough sleepers and people on drugs. Is it similar there? \n\nI've heard that air quality is not so good. How bad is it?\n\nThank you for reading!",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1k9a0dm/is_torino_nice_to_live/"
    },
    {
        "id": "1k9fm88",
        "author": "maschera84",
        "title": "La migliore scuola materne di Crocetta",
        "content": "Ciao ragazzi,\n\nSto cercando consigli su una scuola materna nella quale iscrivere mia figlia di tre anni.\n\nCi hanno parlato bene di un paio di scuole private (Poppy e TopKidz) ma vorrei esplorare anche opzioni pubbliche, che siano statali, comunali o convenzionate.\n\nQualcuno di voi ha i bimbi in una di queste scuole?\n\n- Borgo Crocetta\n- Istituto Sant'Anna\n- Principessa Clotilde di Savoia\n- Umberto I\n- Mille Colori\n\nMi raccontereste la vostra esperienza e dirmi cosa vi piace o non vi piace? Oppure, consigliarmi scuole alternative?\n\nSiamo un po' persi perché siamo nuovi in città e non conosciamo ancora molta gente.\n\nGrazie mille di cuore per l'aiuto ❤️",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1k9fm88/la_migliore_scuola_materne_di_crocetta/"
    },
    {
        "id": "1k987jn",
        "author": "ResearchOne4839",
        "title": "Kayak libero in piemonte?",
        "content": "Dove si trovano informazioni su normative, dove è possibile farlo, dove non è possibile , eventuali permessi etc? ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1k987jn/kayak_libero_in_piemonte/"
    },
    {
        "id": "1k95pju",
        "author": "Ancient_Tourist_4268",
        "title": "Nizza Millefonti, come la trovate?",
        "content": "Ciao a tutti, vivo a Moncalieri, ma la mia ragazza è di Mappano e vorremmo andare a vivere insieme, però tra motivi lavorativi e familiari la cosa migliore sarebbe ritrovarci ''in mezzo''  (in realtà un pò più su torino sud perché io dovrei muovermi di più verso i miei luoghi d'interesse per motivi lavorativi), quindi avevamo scelto idealmente Nizza Millefonti (almeno così la chiama Immobiliare.it), come zona in cui andare a vivere.\n\nIdealmente quella zona che va tra le fermate della metro Lingotto, Spezia, Carducci e danno verso il parco del Valentino, quindi non nella parte più interna vicino alla stazione di Lingotto dire.\n\nHo trovato la zona con un buon rapporto qualità prezzo (circa 500/550 euro al mese per un bilocale o qualcosa di più), però mi chiedo come sia realmente la qualità della vita?\n\nMi interesserebbe sapere da chi ci vive realmente o da chi comunque ha avuto spesso a che fare con queste zone come sia la questione sicurezza, traffico, parcheggio, supermercati ecc....\n\nGrazie a chiunque rispondere alle mie domande",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1k95pju/nizza_millefonti_come_la_trovate/"
    },
    {
        "id": "1k90e8s",
        "author": "stefano-cookie",
        "title": "Grigliata vicino Torino",
        "content": "Con amici volevamo organizzare per l’1 Maggio una grigliata. Partiremmo da Torino, preferibilmente in treno ma anche in auto va benissimo per raggiungere un area attrezzata free/a pagamento in qualsiasi posto carino a meno di un’ora e mezza di distanza, preferibilmente nella natura in montagna o un lago. Non ho davvero idea di dove poter andare e cosa considerare per garantirmi la disponibilità dello spazio. Aspetto consigli, grazie.",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1k90e8s/grigliata_vicino_torino/"
    }
]