[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jmaee8",
        "author": "AggressiveGrocery773",
        "title": "Con Mum – Graham is not as great as people make him out to be.",
        "content": "It’s honestly wild how much praise this guy gets while his wife is vilified everywhere. People even started a whole Reddit post just to complain about her *vocal fry*—like, really? Meanwhile, Graham dipped right after his wife gave birth so he could drink champagne and eat at Michelin-starred restaurants in Switzerland with his \"*dying\"* mum. Let’s be real—if she wasn’t rich and he didn’t dream of inheriting millions, would he have been this devoted? Doubt it.\n\nThe audacity of this man to take money out of their *joint* account without telling his wife—all for his *rich* mum. And then he had the nerve to go into debt, dragging his wife's finances down with him, just so his mother could continue living this lavish lifestyle (which, let’s be honest, he enjoyed too). I could understand if she was struggling and he was helping with healthcare or basic needs, but no—this was pure greed, and his wife was left alone in a foreign country, raising a newborn with no support.\n\nI get that being abandoned as a kid messed him up, and getting his mum back was a big deal for him. But let’s not pretend her *money* wasn’t a huge factor in his decisions. And then at the end of the documentary, he had the nerve to say, *“My real family are my mates who stuck by me through my worst times.”* (that felt like a direct dig at his wife) Like… excuse me? The irony is unreal—he *didn’t* stick by his *own wife* when she was going through one of the most difficult times in her life. She just had a baby, was alone in a foreign country, and he was too busy chasing inheritance money to be there for her.\n\nJust embarrassing. Instead of taking accountability for how he failed her *and* their child, he basically just doubled down on his selfishness.",
        "upvotes": 156,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1jmaee8/con_mum_graham_is_not_as_great_as_people_make_him/"
    },
    {
        "id": "1jmdv3f",
        "author": "ludefisk",
        "title": "\"His name is Fgwlpskr Pif.\" - The Residence",
        "content": "I mean, stop. Just stop. This show takes the deadpan to a whole new level - everybody gives absolute knock-out performances, and the seriousness with which they deliver some of the best one-liners in Netflix history is just so fun to watch. I'm on episode 6 and I just got to Randall Park saying \"His name is Fgwlpskr Pif\" and I'm just losing it. I'm glad this isn't a background show for me because I know I'd be missing the point of it all ... a lot of the humor is nonverbal and in the pauses and cuts so it's been way better to watch it straight up. \n\nConsider giving this show a watch - it's been a real banger. Heck of a cast and they all seem to play well off of one another. ",
        "upvotes": 87,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdv3f/his_name_is_fgwlpskr_pif_the_residence/"
    },
    {
        "id": "1jm3d1p",
        "author": "throw20190820202020",
        "title": "PSA to all the Agatha Christie loving, Jessica Fletcher obsessed cozy mystery lovers out there - “The Residence” and Uzo Aduba’s consulting detective Cornelia Cupp ARE IT!!",
        "content": "I saw it was a house whodunnit and was watching. OMG, it’s Shondaland? Yes please. In the Whitehouse!?? Fun fun! Wait, who is this actual modern warm brilliant and LIKEABLE woman running the show? Crazy Eyes was an awesome character but Uzo Aduba is now firmly our thoughtful birding private eye in my head now. \n\nDare I say I like it more than the Knives Out movies? I do. And I like those movies a lot. ",
        "upvotes": 128,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3d1p/psa_to_all_the_agatha_christie_loving_jessica/"
    },
    {
        "id": "1jm3pyb",
        "author": "LegitimateCopy4596",
        "title": "Adolescence - Final scene",
        "content": "How absolutely gutting was this scene? I’m not sure what else to say. I haven’t been impacted by a show or movie like that before. I couldn’t fall asleep after finishing it. Truly brilliant acting by Stephen Graham and the entire cast. ",
        "upvotes": 91,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3pyb/adolescence_final_scene/"
    },
    {
        "id": "1jmb9mk",
        "author": "Agile_Cupcake6961",
        "title": "\"Con Mum\" Heather deserves better",
        "content": "Heather had a newborn baby and her husband leaves her alone, no family, no friends for 2 months? Insane work. On top of that he ruins her Christmas and she was just hoping he would realize his mom is lying. I understand he probably has childhood trauma and thought his mom was gonna die in 6 months lalalalalla but still? That seems horrible for heather to enter motherhood in that way. She is truly a real one for sticking by all that bs.",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jmb9mk/con_mum_heather_deserves_better/"
    },
    {
        "id": "1jmj6py",
        "author": "adamb12345676",
        "title": "New Erin Doherty interview about ''surviving\" Adolescence",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmj6py/new_erin_doherty_interview_about_surviving/"
    },
    {
        "id": "1jlsaak",
        "author": "Legitimate_Ad3625",
        "title": "‘Adolescence’ Sets Netflix Record With 66.3 Million Views, Best Ever Two-Week Total for a Limited Series",
        "content": "",
        "upvotes": 270,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jlsaak/adolescence_sets_netflix_record_with_663_million/"
    },
    {
        "id": "1jmm2k7",
        "author": "DevotedToNeurosis",
        "title": "Midnight Mass' Filming Locations, Explained",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmm2k7/midnight_mass_filming_locations_explained/"
    },
    {
        "id": "1jmkkv4",
        "author": "Relative_Recording47",
        "title": "Dead Talents Society: Netflix's new horror comedy movie that has a glowing 94% Rotten Tomatoes rating",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmkkv4/dead_talents_society_netflixs_new_horror_comedy/"
    },
    {
        "id": "1jlr3od",
        "author": "Snoo-67164",
        "title": "Question about Adolescence I haven't seen discussed yet (red pills on Instagram)",
        "content": "Firstly I don't understand why some people are so fixated on the bullying storyline, when it's a story of all the different forces that create violence in teens. Stephen Graham's explanation that he thought about the phrase \"it takes a village to raise a child\" and therefore we've all failed (in the face of rising teen knife crime in the UK) is so clear.\n\nBut did others think it was clear that Jamie made worse comments to Katie than what we learn?\n\nWhat we know is that Jamie received nude photos of Katie, asked her out, she said \"I'm not that desperate\" (this part rang true and I think was meant to feel that way) and then she left comments on his IG implying he's an incel.\n\nTo me, it felt obvious that when Jamie was talking to the psychologist, he left out part of the conversation. He praises himself for being nice to Katie but admits he thought she was at a weak and vulnerable moment. My interpretation was that when she turned him down, he most likely said something about how no-one else would want her now her nudes had been shared. Especially since we know about his anger outbursts. It was these comments that made her post the emojis on his Insta. I thought it was important that her comments aren't about him being ugly or unpopular - which he sees as his biggest issue - but they specifically call out his attitude to women. And DI Bascombe misses the point a second time when his conclusion is \"So Katie was bullying Jamie?\"\n\nAs a fairly online woman, that was where my mind instantly went. It's such a common pattern: misogynist shows woman positive attention, woman turns him down (politely, kindly or not), misogynist shows his true colours. \n\n",
        "upvotes": 223,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1jlr3od/question_about_adolescence_i_havent_seen/"
    },
    {
        "id": "1jmnjz5",
        "author": "LeslieWai",
        "title": "I remixed streaming intros",
        "content": "I remixed streaming service logos including Netflix Logo intro",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmnjz5/i_remixed_streaming_intros/"
    },
    {
        "id": "1jm3nyu",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret",
        "content": "Who else is watching? I recently got into The Traitors and on a whim, started watching this the other day. 3 episodes are out now but more come out on April 2nd. It’s GREAT!!! From what I’ve heard, it’s a cross between The Mole (which I’ve never seen) and The Traitors.",
        "upvotes": 26,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3nyu/million_dollar_secret/"
    },
    {
        "id": "1jmjz5e",
        "author": "MerlinRebornCh2",
        "title": "Is there a list of all movies and shows on Netflix?",
        "content": "I'm doing a project and need the list of all shows and movies on Netflix, but I couldn't find it online. Anyone knows of any place where I can find it?\nThanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jmjz5e/is_there_a_list_of_all_movies_and_shows_on_netflix/"
    },
    {
        "id": "1jmc0g4",
        "author": "Puzzleheaded-Web9066",
        "title": "Help! Need a new show! (Or movie)",
        "content": "My taste it is pretty all over the place. \n\nI LOVED The Morning Show, Younger, The Wire, Virgin River, Girls, Grey’s Anatomy, Big Little Lies, Tell Me Lies, Parenthood, Shameless, Suits, Mad Men, White Lotus… \n\nI am not a game of thrones, stranger things, severance girl. I tried. I’m not. I love shows that evoke feelings. Thank you—- please help!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jmc0g4/help_need_a_new_show_or_movie/"
    },
    {
        "id": "1jmi49m",
        "author": "jixleyy",
        "title": "Netflix logs me out anytime I perform an action on their website",
        "content": "Hey all, hope this is the correct place to be asking stuff like this, haha.\n\nI just encountered this issue today, but its lasted for well over an hour now, and I'm very confused. I was browsing through the French catalogue when I noticed I couldn't add anything to my list—I refreshed the page to see if that would fix the problem, and was promptly sent to the login page. One time was fine, I just logged myself back in, but now when I do *any* action (and I mean any: typing in the search bar, trying to watch a show, changing profiles, etc.), I get immediately logged out.\n\nI tried one solution that I read where you cleared your cookies (sometimes there's a weird caching issue that Netflix doesn't like, I'm not sure exactly, I don't work in web development), but that didn't fix it. Just in case there was a \"too many logged-in devices\" issue or something, I got rid of all the ones I haven't touched in at least 2 or more weeks as well.\n\nFor some reference, I'm using the Librewolf browser on a Windows 11 system. (Librewolf is just Firefox, if you don't want to look it up.)\n\nAny help with this would be appreciated, if you can! I'm patient. And if you need any more information, I'll answer accordingly :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmi49m/netflix_logs_me_out_anytime_i_perform_an_action/"
    },
    {
        "id": "1jmdrte",
        "author": "Semiconsistent-Panic",
        "title": "Con Mom - the DNA test, anyone?",
        "content": "Is it just me or is no one questioning the legitimacy of the DNA test? It was one of the most unexpected elements of the entire document yet I felt like it wasn’t explored enough. \n\nI’m assuming the mom voluntarily got her swabs taken by Graham’s request (as opposed to being taken secretly behind her back) so I can’t help but wonder: if the mom was pro enough to fake or befriend real bankers and lawyers and pull off her tricks, I don’t see faking DNA lab results very difficult. In fact, that was my very first thought. Any thoughts or theories on this?   ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdrte/con_mom_the_dna_test_anyone/"
    },
    {
        "id": "1jm6cke",
        "author": "Sun_moon_4733",
        "title": "Psychological Thrillers?",
        "content": "Any recommendations for good psychological thriller series? Looking to watch a new one but overwhelmed by the options lol. \n\nSome I’ve watched: \nBehind her eyes,\nEvil,\nYou,\nThe Sinner,\nBloodline, \nDirty John, \nBlack Mirror, \nHaunting of Hill House and the rest of the collection,\nOzark\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jm6cke/psychological_thrillers/"
    },
    {
        "id": "1jm5gi5",
        "author": "SocialNetwooky",
        "title": "'Dead Talents Society' is just great",
        "content": "No spoiler, but if you're up for an hilarious take on show business, celebrity cult and teenage angst sprinkled with some over the top gore, then watch it :) \nI went in not exactly knowing what I was expecting, watched the first 5 minutes, stopped got my (nearly adult) kids knowing it was their cup of tea and we loved every minutes of this 1 hour 50 movie :)\n\nthank me later ;)",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jm5gi5/dead_talents_society_is_just_great/"
    },
    {
        "id": "1jm5e8t",
        "author": "PixelPulse88",
        "title": "Why have i only saw this today: Where the Crawdads Sing",
        "content": "Visually stunning and emotionally impactful film. Love the story overall, though I saw others that they might not love the casting, but I was too dedicated to the story. I haven't read the novel, but I would after this.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jm5e8t/why_have_i_only_saw_this_today_where_the_crawdads/"
    },
    {
        "id": "1jmesyb",
        "author": "kingmoney8133",
        "title": "Bug with Chinese subtitles missing lines?",
        "content": "I watch Netflix using Chinese subtitles.  Sometimes, the subtitles will skip and not display a line of dialog.  It's not that the subtitle doesn't exist, because if I rewind it will display.  It's just that sometimes the subtitles will not display.  Has anybody encountered this bug or have a fix?  I'm watching Netflix on my Xfinity Flex, to the extent that is useful. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmesyb/bug_with_chinese_subtitles_missing_lines/"
    },
    {
        "id": "1jmq9dv",
        "author": "Lilelyfelix33",
        "title": "Adolescence indoctrination",
        "content": "Alright, I just watched Adolescence, and its shitty. It appears that the program is assigning a bad label to masculinity, which doesn't feel good at all, They're attempting to suggest that all masculine men are bad, Then the overall tone of the show comes across as somewhat moralizing, as if it's attempting to dictate my thoughts. It look like they are attempting to push an agenda rather than tell good story, its made by boomers who doesnt understand how the internet works, im not gonna become an incel and commite feminicide if im on the internet or watch p*rn\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jmq9dv/adolescence_indoctrination/"
    },
    {
        "id": "1jmdrjy",
        "author": "indiewire",
        "title": "'Everybody's Live with John Mulaney' Owes These Late Night Influences",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdrjy/everybodys_live_with_john_mulaney_owes_these_late/"
    },
    {
        "id": "1jmddiv",
        "author": "Available-Reward-912",
        "title": "The Residence, did I miss it?",
        "content": "Just finished The Residence, watching while sometimes distracted, but I thought I paid attention for the final whodunnit. Did Detective Cupp ever explain the blood in the Lincoln Bedroom? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jmddiv/the_residence_did_i_miss_it/"
    },
    {
        "id": "1jmepya",
        "author": "Jumpidumpii",
        "title": "Netflix/HBO MAX/ Prime",
        "content": "My wife and I have some friends coming over for a few months to visit us from out of the country and we know all 3 of them comfortable with nudity. We thought it would be fun if anyone had some Netflix, HBO MAX, Prime shows or movie recommendations that had non sexual nudity in them.\n\nAny and all suggestion would be appreciated.\n\nThanks in advance! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jmepya/netflixhbo_max_prime/"
    },
    {
        "id": "1jma7iu",
        "author": "Sea_Nautilus",
        "title": "Upgrade extra member without paying for 2 slots at once?",
        "content": "I accidentally added a member with ads, instead of without ads. The instructions on Netflix’s website say:\n\n“If you want to change an extra member (with ads) slot to an ad-free extra member slot, you need to cancel the existing slot and then add a new extra member slot of your choice.”\n\nI already paid for the (with ads) extra member slot for this month, and if I cancel the existing slot it says the extra member will have access until a month from now. \n\nSo if I add a new extra member slot, then won’t I have to pay for that second extra slot at the same time? \n\nI don’t get it. Help. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jma7iu/upgrade_extra_member_without_paying_for_2_slots/"
    },
    {
        "id": "1jlg981",
        "author": "NixyVixy",
        "title": "Adolescence has AMAZING Camera work",
        "content": "The single camera shot scenes are incredible.  \n\nThe acting is phenomenal.  The story is captivating and riveting - but the camera work blew me away.  \n\nThe way it they chose to film is amazingly impactful.   \n\nYou see the view and timing as if you’re in the scene - including moments that are often shortened in other media, like someone getting hot chocolate from a vending machine.  \n\nThey don’t rush seemingly boring moments, and they don’t draw out seemingly significant moments.   The pacing of the plot ( via single camera lens) is perfect.  \n",
        "upvotes": 74,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jlg981/adolescence_has_amazing_camera_work/"
    },
    {
        "id": "1jl584x",
        "author": "Halloween_Nyx",
        "title": "Adolescence, a quote from the show I haven’t seen discussed yet really hit me",
        "content": "When the father is discussing with his wife how he saw some awful manosphere videos online because he was just trying to look up a workout video. \n\nThis was such a hard hitting line for me that could go by unnoticed. It is so easy to fall into that pipeline without any intentions of actually looking up people like Andrew Tate. As someone is constantly in the gym and looking up workout and diet recommendations on YouTube, I will almost always run into those kinds of videos and I just ignore them. \n\nSo many friends or fellow gym bros have shifted their attitude into this alpha male, high quality man, Andrew Tate style aggressiveness from YouTube and social media feeding them these influencers when originally all they were doing was looking up workout videos. \n\nIt’s incredibly concerning how easy it is and I feel for anyone trying to get into fitness and having to deal with this. Just understand there are normal fitness influencers out there that are not this way. ",
        "upvotes": 285,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jl584x/adolescence_a_quote_from_the_show_i_havent_seen/"
    },
    {
        "id": "1jm5pb1",
        "author": "fatesdestinie",
        "title": "Last week of Netflix",
        "content": "So, for Christmas I received a gift card for Netflix, it ends in a week. Give me some of your favorite shows and movies. I have really enjoyed their Limited Series for the true crime documentaries. I'm trying to finish Supernatural, but I have a lot left on that one. I've really liked Working Moms. I have broad spectrum tastes and watch any genre. Thank you!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jm5pb1/last_week_of_netflix/"
    },
    {
        "id": "1jlv0bl",
        "author": "BroadwayWorld",
        "title": "Stranger Things Broadway Documentary Set For Netflix Next Month; New Photos",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jlv0bl/stranger_things_broadway_documentary_set_for/"
    },
    {
        "id": "1jmasug",
        "author": "AnyTeaching6577",
        "title": "Why am i bombarded with mobile game ads as a Premium subscription paying client.",
        "content": "I recently noticed over the last few months that whenever I open my home page on Netflix there is a huge mobile ad. Am i wrong to get very mad at this fact? I pay a lot of money for the most expensive plan that specifically lists \"Watch advert-free\".\n\nIn general I'm totally cool with ads if a service is free, but as a regular paying client, a term that's supposed to be very valuable to companies this feels like a major slap in the face, and if this does not change within a month I will cancel my membership within a month.\n\nFIX THIS NOW NETFLIX!",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1jmasug/why_am_i_bombarded_with_mobile_game_ads_as_a/"
    }
]