[
    {
        "id": "1n8dn7z",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Chandler Levack - Friday 9/5 at 5:00 PM ET - Writer-Director of 'I Like Movies' and the upcoming 'Mile End Kicks'",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/513evyqd46nf1.png?auto=webp&amp;s=be267b66a33eace07b746407ffc0bf82749267a9"
        },
        "permalink": "/r/movies/comments/1n8dn7z/amaqa_announcement_chandler_levack_friday_95_at/"
    },
    {
        "id": "1n6hto7",
        "author": "ObsessionAMA",
        "title": "Hey /r/movies! I'm filmmaker Curry Barker (MILK &amp; SERIAL). My new film, OBSESSION, is premiering this Friday 9/5 at the Toronto International Film Festival as a Midnight Madness selection. Ask me anything!",
        "content": "Hey reddit, I'm filmmaker Curry Barker, and my new film, OBSESSION, is heading to TIFF this week! You might know my directorial feature debut, MILK &amp; SERIAL (2024). \n\nOBSESSION will have its World Premiere at the Toronto International Film Festival this Friday, September 5, as part of the Midnight Madness program. The film stars Michael Johnston, Inde Navarrette, Cooper Tomlinson, and Megan Lawless.\n\nAsk me anything!\n\n**Synopsis:** \n\nObsession plunges into a fever dream of longing, delusion, and the chilling cost of getting exactly what you desire. Bear, a hopeless romantic, gets pulled into a spiral where passion and terror become inseparable.\n\nFrom Curry Barker (Milk &amp; Serial), this visceral, atmospheric thriller fuses psychological horror with a haunting supernatural edge. Starring Inde Navarrette (Superman &amp; Lois), Michael Johnston (Teen Wolf), Cooper Tomlinson (Milk &amp; Serial), and Megan Lawless (The Death That Awaits), Obsession is a twistedlove story that dares to ask: How far would you go to be loved back?\n\n\\-----------------------------------------------------------------------------------------\n\n**TIFF's write-up of the film:**\n\nWoe is Bear (Michael Johnston), who has long carried a torch for his childhood friend Nikki (Inde Navarrette). When another attempted profession of love fizzles, Bear wistfully wishes for romantic reciprocation, unfortunately doing so while in possession of a trinket with supernatural properties of The Monkey’s Paw variety.\n\nSuddenly, Nikki is all over Bear, and he is quick to indulge in this long-desired turnabout while ignoring the ramifications of her intensifying fixation. Before long, Bear’s fantasy turns to nightmare as Nikki’s personality begins to twitch with a disturbing dysphoria that sinisterly suggests her autonomy has been usurped by a malignant entity that wants them both, body and soul.\n\n“Be careful what you wish for” may be a staple in the horror genre, but writer-director Curry Barker enlivens this well-worn premise by lacing its inherent irony with a wickedly wry tone and an anxious tension that’ll plummet the stomach of even hardened Midnighters. Having honed high-concept absurdism and creeping dread from his online productions, Barker deftly demonstrates a savvy command of tone and terror reminiscent of fellow sketch comedian Zach Cregger’s Barbarian.\n\nAs with that auspicious debut, Barker’s first feature preserves an uncomfortable relatability in its hyperbolic scenario. Though literally featuring a customer service call from (and possibly to) Hell, Obsession cuts to the quick as it lays bare the innate violence in romantic objectification with an unforgiving candidness. That's made all the more disarming, thanks to exceptionally nuanced performances, particularly from Navarrette whose “Freaky Nikki” oscillates between doe-eyed desire and devastating torment that will chill you to the bone.\n\n\\----------------------------------------------------------------------------------------------------\n\n**My bio:**\n\nCurry Barker is a writer-director with a bold, visceral style. His work blends raw emotion with psychological horror and dark comedy. He co-created That’s a Bad Idea, his sketch comedy channel, and directed Milk and Serial, both known for their brutal honesty and striking, cinematic visuals.\n\nAsk me anything! Back at 5 PM ET today (Tuesday 9/2) to answer any questions.",
        "upvotes": 70,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qcio23ghiqmf1.png?auto=webp&amp;s=9c6f7be58a60078897704b6190383d562023ba1b"
        },
        "permalink": "/r/movies/comments/1n6hto7/hey_rmovies_im_filmmaker_curry_barker_milk_serial/"
    },
    {
        "id": "1n8ps6r",
        "author": "DragonPup",
        "title": "Warner Bros. Sues Midjourney, Joins Studios' AI Copyright Battle",
        "content": "",
        "upvotes": 1559,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iZ_gN1J782GeK1evq9duRCvvJBkNSdWZzkU28kNhgpY.png?auto=webp&amp;s=4355a77a78a685f9c4f45c8c6771ba3698d10f3d"
        },
        "permalink": "/r/movies/comments/1n8ps6r/warner_bros_sues_midjourney_joins_studios_ai/"
    },
    {
        "id": "1n88f04",
        "author": "MarvelsGrantMan136",
        "title": "'Bluey: The Movie' Gets August 6, 2027 Theatrical Release",
        "content": "",
        "upvotes": 3842,
        "comments": 456,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RmC4X-1O83IfQOEES24M79gWFFTroHQw7jE06ZpGzYM.jpeg?auto=webp&amp;s=906113a2a6dace5be70b3c03f7e307488f7eab19"
        },
        "permalink": "/r/movies/comments/1n88f04/bluey_the_movie_gets_august_6_2027_theatrical/"
    },
    {
        "id": "1n8b5n5",
        "author": "KillerCroc1234567",
        "title": "John Candy: I Like Me - Official Trailer | Prime Video",
        "content": "",
        "upvotes": 2215,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E2lujyHbc1_sb3mjl1kpD4zVbdB8AobT78quNwczA4A.jpeg?auto=webp&amp;s=bfc8d3a482fdda9bfa4b695cc9df4a95caa0d77a"
        },
        "permalink": "/r/movies/comments/1n8b5n5/john_candy_i_like_me_official_trailer_prime_video/"
    },
    {
        "id": "1n8kt00",
        "author": "Immediate-River-874",
        "title": "Monty Python’s The Meaning of Life (1983) - Protestants and Catholics",
        "content": "",
        "upvotes": 701,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7d6nbrpdg7nf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1n8kt00/monty_pythons_the_meaning_of_life_1983/"
    },
    {
        "id": "1n89iq3",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Tron: Ares'",
        "content": "",
        "upvotes": 2156,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9r3kon61c5nf1.jpeg?auto=webp&amp;s=84c29bcb06cc197b529c8c3495242bb46f7ecaea"
        },
        "permalink": "/r/movies/comments/1n89iq3/new_poster_for_tron_ares/"
    },
    {
        "id": "1n8earf",
        "author": "NoCulture3505",
        "title": "New Poster for the Re-Release of \"ParaNorman\"",
        "content": "",
        "upvotes": 489,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/63cbg8hq86nf1.jpeg?auto=webp&amp;s=ff45591aad8fae41bce2b6375bb7bee8c51e365d"
        },
        "permalink": "/r/movies/comments/1n8earf/new_poster_for_the_rerelease_of_paranorman/"
    },
    {
        "id": "1n8ppml",
        "author": "MarvelsGrantMan136",
        "title": "'Tron: Legacy' &amp; 'Tron: Ares' Double Feature Announced for One Night Only on October 8 - Official Poster",
        "content": "",
        "upvotes": 132,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/37zpypgjg8nf1.jpeg?auto=webp&amp;s=664cd5b04ccacd2d9955bc1770d2cb16ef7cf737"
        },
        "permalink": "/r/movies/comments/1n8ppml/tron_legacy_tron_ares_double_feature_announced/"
    },
    {
        "id": "1n8cnha",
        "author": "darth_vader39",
        "title": "‘Howl’s Moving Castle’ Returns to Theaters for Studio Ghibli Fest",
        "content": "",
        "upvotes": 514,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bqIC7zK-QCFcnnn7epIobpwclwU6n3MJPq1ez2lvGuY.jpeg?auto=webp&amp;s=1ce5a54b862e127725239c0abc85b20ff2dbd672"
        },
        "permalink": "/r/movies/comments/1n8cnha/howls_moving_castle_returns_to_theaters_for/"
    },
    {
        "id": "1n88csp",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy-Thriller 'Anything That Moves' - An innocent Chicago food delivery boy, after having sex for money, finds himself involved in a series of murders that can be traced back to someone who was in his bed. - A tribute to 1970s X-rated films and erotic-thrillers.",
        "content": "",
        "upvotes": 630,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5fx6fsvk25nf1.jpeg?auto=webp&amp;s=e93fd6b96efc239d50413d7b10f05f8aeb9e8b1d"
        },
        "permalink": "/r/movies/comments/1n88csp/first_poster_for_comedythriller_anything_that/"
    },
    {
        "id": "1n8bx1q",
        "author": "countvonruckus",
        "title": "What About Bob is a psychological horror movie told from the perspective of the psycho",
        "content": "Spoilers for a 34 year old movie, I guess.\n\nSo, What About Bob is a classic Bill Murray comedy and I always loved it growing up. Bob, Bill Murray's character, is endearing, silly, and a great vehicle for Bill Murray's brand of comedy. The interplay with Richard Dreyfuss's character Dr. Leo Marvin as Bob's psychiatrist and Bob is great. The dynamic is fun and their character arcs are a fun reversal of one another where Bob learns to function and thrive despite his many mental disorders (which were somewhat problematic but portrayed pretty well for a comedy in the 90's) while Dr. Marvin descends into madness trying to get rid of Bob from his life. A delightful film and still watch it sometimes when I'm craving something lighthearted and fun.\n\nHowever, the actual events of the plot are the events of a horror story. Bob enters Dr. Marvin's life at Marvin's triumphant moment; he's a successful psychoanalyst/psychiatrist, his book got published and he's getting serious acclaim for it, his colleagues respect him, and he's about to go on a lovely vacation with his family. Bob gets foisted on him from a colleague who Bob literally convinced to give up his career to get away from, but Dr. Marvin is confident he can help him after he gets back from vacation.\n\nThen Bob calls him on vacation using a fake suicide and police investigation as a premise. Shook up, Dr. Marvin sets a very clear professional boundary: \"don't call me or approach me when I'm on vacation and we'll get to your mental health care when I'm back in the office.\" He figures that'd be the end of it; a clingy patient is annoying but he's probably dealt with that before even if the whole fake suicide approach to get his number was a bit extreme. Then Bob shows up in person. He's not even supposed to know what *town* Marvin is in, but now he knows where he and his family live. He tries to dissuade him again but then Bob shows up to his house and approaches his family. \n\nHe starts befriending Marvin's kids, going sailing with his daughter and diving with his son. His wife finds him charming and cute. He stays over for dinner and sleeps in his son's room overnight. He hijacks his once-in-a-lifetime interview that could have made him a celebrity psychiatrist, his ultimate career goal. Every step of the way Dr. Marvin sees these major boundaries being crossed and the unhinged nature of his nightmare patient *and nobody will listen to him.* \n\nHe doesn't know what to do; no reasonable options seem to work. He's scared. His family is more and more siding with Bob over him and he feels like he's being replaced as a father. Bob is even comforting his wife *about him, her husband.* He's getting more and more frustrated and desperate, and in so doing is more and more making himself look like the bad guy. He goes to colleagues who respect him for help and they act like he's the one who's crazy.\n\nHe's acting like he doesn't usually act; sure he was a bit smug before and maybe a little full of himself, but this can't really be *him,* could it? He's not seriously contemplating killing this patient of his, *is he?* He's a healer, a person who helps those suffering from mental illness; he's not a guy who breaks into a store at night to steal a gun and explosives, *right?*\n\nThen he does it. He kidnaps Bob at gunpoint and takes him out in the woods, straps bombs to him, and sets a timer for the detonator. He's using the language of his career of healing to kill. He even starts talking to himself, imagining cannibalizing Bob's fish in his triumph. He's long past the point of caring whether he sounds crazy now, but at least. he's. gone.\n\nThen he sees him. Bob is standing next to his beloved sister. He's still here. He's...never going away. It finally breaks him. He descends into catatonia and psychosis. He's one of them now; a broken mind who can't be fixed. He summons the will to scream one last protest of Bob marrying his sister at their wedding in a futile attempt to stop this final grafting of this man into his life forever. In that last moment of failure the comfort of catatonia leaves him and he knows this is his eternal damnation.\n\nSo, yeah. Horror movie.",
        "upvotes": 349,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1n8bx1q/what_about_bob_is_a_psychological_horror_movie/"
    },
    {
        "id": "1n8hqne",
        "author": "triangle---man",
        "title": "Marc Maron: Are We Good? | Official Trailer | Utopia",
        "content": "",
        "upvotes": 174,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uAmns8_ZKQgHhIB5WouyVGu-D6YSWe8qTU-YSip-mwk.jpeg?auto=webp&amp;s=a2dea02a80853f71c9c903176c9010bdc59f6247"
        },
        "permalink": "/r/movies/comments/1n8hqne/marc_maron_are_we_good_official_trailer_utopia/"
    },
    {
        "id": "1n8cjkb",
        "author": "NoCulture3505",
        "title": "Black Phone 2 | Official Trailer 2",
        "content": "",
        "upvotes": 308,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NR9LeEUmxYxvs0Sv7dC8C2xVINhqXkJlw4vFyZhV7-8.jpeg?auto=webp&amp;s=20cdd5de0c3d123187eefa5aebb3e58bf7c72756"
        },
        "permalink": "/r/movies/comments/1n8cjkb/black_phone_2_official_trailer_2/"
    },
    {
        "id": "1n8e7yo",
        "author": "darth_vader39",
        "title": "Alan Ritchson Reteams With Director Patrick Hughes For Untitled Amazon MGM Studios Pic About Navy SEAL Mike Thornton",
        "content": "",
        "upvotes": 237,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SWO20dYX6cP2TY2g5FgpthkHsZxLDDcQTLfbHaYZXwg.jpeg?auto=webp&amp;s=14eaa03fab2e5d842b5198048658e873218d38bf"
        },
        "permalink": "/r/movies/comments/1n8e7yo/alan_ritchson_reteams_with_director_patrick/"
    },
    {
        "id": "1n8jf0s",
        "author": "lawrencedun2002",
        "title": "‘Street Fighter’ Moves to Paramount as Legendary Deal Becomes Official - The project has an Oct. 16, 2026 release date as Legendary inks a three-year deal with Paramount.",
        "content": "",
        "upvotes": 117,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g9dUjT1yTEG-XvMA6CKC_2Jw1jggSbgTnYNTaSfamo4.jpeg?auto=webp&amp;s=a0b580c67ed79528380a92682daa295d8c696123"
        },
        "permalink": "/r/movies/comments/1n8jf0s/street_fighter_moves_to_paramount_as_legendary/"
    },
    {
        "id": "1n8ge2j",
        "author": "HistoricalDebate461",
        "title": "What’s a movie you’ve watched that was so disturbing that you’ll never watch it again?",
        "content": "What’s a movie you’ve watched that  was so disturbing you’ll never watch it again? For me, it’s The Boy in the Striped Pajamas and Human Centipede. I barely made it through the first time around for both of them and I couldn’t fathom watching them again. Both for different reasons of course. TBITSP was devastatingly heart-wrenching and HC was just playing disturbing. ",
        "upvotes": 149,
        "comments": 738,
        "media": null,
        "permalink": "/r/movies/comments/1n8ge2j/whats_a_movie_youve_watched_that_was_so/"
    },
    {
        "id": "1n8hqg5",
        "author": "EuphoricButterflyy",
        "title": "First image of Jonah Hauer-King and Kristine Froseth in ‘The Face of Horror’- It follows a knight who marries his devoted love after murdering her father, only to betray her for a wealthier bride.",
        "content": "",
        "upvotes": 113,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0odu0k4rv6nf1.jpeg?auto=webp&amp;s=31a2aec6d35c9b9c7c80e74176d36b395b234315"
        },
        "permalink": "/r/movies/comments/1n8hqg5/first_image_of_jonah_hauerking_and_kristine/"
    },
    {
        "id": "1n8fb2s",
        "author": "joesen_one",
        "title": "Left-Handed Girl | Official Trailer | Netflix",
        "content": "",
        "upvotes": 150,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vIJ7dKHMlUlW9vWmZKNw8amEv20RiNNJem7zZD8_Tsg.jpeg?auto=webp&amp;s=a2ee5c227725c0013efb04c9e51a949f71f7bd05"
        },
        "permalink": "/r/movies/comments/1n8fb2s/lefthanded_girl_official_trailer_netflix/"
    },
    {
        "id": "1n7k4gv",
        "author": "MarvelsGrantMan136",
        "title": "James Gunn Announces 'Man of Tomorrow', Releasing in Theaters July 9, 2027",
        "content": "",
        "upvotes": 11563,
        "comments": 1262,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xhIM7IbY8yvGg0vY5Tjn4gGrOhfGWrq1vXJrWdXBxYs.jpeg?auto=webp&amp;s=72c6eac74476f294b30f890173db1a095fe7aef4"
        },
        "permalink": "/r/movies/comments/1n7k4gv/james_gunn_announces_man_of_tomorrow_releasing_in/"
    },
    {
        "id": "1n8gtoj",
        "author": "heyitsmikep",
        "title": "What movies would you show an audience in 1900?",
        "content": "You go back in time and build a modern (2025) theater in 1900 with all movies ever made. Which 5 movies are you going to show them to make the most money? Which would blow their mind the most? Would it change per decade? \n\nShowing Django Unchained to an 1900 audience would most likely cause a riot\nTitanic to an audience in 1910 would get you sued by the White Star Line probably.",
        "upvotes": 82,
        "comments": 431,
        "media": null,
        "permalink": "/r/movies/comments/1n8gtoj/what_movies_would_you_show_an_audience_in_1900/"
    },
    {
        "id": "1n8q719",
        "author": "UsualSu",
        "title": "Anyone else here who, like me, frequently quotes lines from comedies into your daily life? What are yours?",
        "content": "Here are some I say often that are probably not the more well known ones people would usually think of when talking about these movies:\n\n Fast Times- I woke up in a good mood. I don’t know what the hell happened.\n\nFast Times- wait a minute, there’s no birthday party for me here!\n\nCaddyshack- WELL?!…we’re waiting!!\n\nCaddyshack- really? I don’t believe it! (must also be said in Ted Knights voice!)\n\nCaddyshack- So, I got that going for me\n\nHancock- ggoodd jjoobb! (As spoken by Jason Bateman, emphasis on the d and b sounds)\n\nHancock - good job! Good job! (Must use two thumbs up with this one)",
        "upvotes": 21,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1n8q719/anyone_else_here_who_like_me_frequently_quotes/"
    },
    {
        "id": "1n8k60n",
        "author": "NoCulture3505",
        "title": "Ben Stiller, Jeremy Allen White Circling ‘Airman,’ A24 in Talks to Land World War II Survival Tale",
        "content": "",
        "upvotes": 40,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Pg4kfvdK8-W74fSxEogxdEV4KHLt3p4J7DtSB5pqPoA.jpeg?auto=webp&amp;s=dc317a30be68592927cc83587c221c612741b332"
        },
        "permalink": "/r/movies/comments/1n8k60n/ben_stiller_jeremy_allen_white_circling_airman/"
    },
    {
        "id": "1n82mlu",
        "author": "Silent-Selection8161",
        "title": "What movie was saved solely by great casting?",
        "content": "Or phrased a different, what movie would've been terrible if it weren't for the specific actors in it?\n\nMy go to is Liar Liar. It's not a particularly great script. The dad (Jim Carey because no one remembers the character's name) is douche. The would be step dad is earnestly trying his best to connect with his would be step son and gets tossed out like all step dads (do Hollywood types have parental issues or what, that's rhetorical). The idea that someone's entire life can be turned around and they're suddenly not an ass just because they have to tell the truth for a day is just kind of dumb. The director ended up with a few successful movies solely because Jim Carey liked him and he let Jim Carey do his thing, his other movies include such hits as \"The Nutty Professor\". The writers never wrote anything close to noteworthy before nor after.\n\nBut damnit Jim Carey turns the whole thing into the Jim Carey show, that's hilarious. Him freaking out over the pen or in the bathroom IS the movie and is funny as hell, regardless of what else there is.",
        "upvotes": 452,
        "comments": 465,
        "media": null,
        "permalink": "/r/movies/comments/1n82mlu/what_movie_was_saved_solely_by_great_casting/"
    },
    {
        "id": "1n7h6b1",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Rental Family'",
        "content": "",
        "upvotes": 6661,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6ekjoe8fsymf1.jpeg?auto=webp&amp;s=3c8b8bb9e442e1ff52866ebc1ab812865d28bed2"
        },
        "permalink": "/r/movies/comments/1n7h6b1/new_poster_for_rental_family/"
    },
    {
        "id": "1n8gajq",
        "author": "SanderSo47",
        "title": "Mark Rylance Joins Luca Guadagnino's Next Film ‘Artificial’ – Also Starring Andrew Garfield, Yura Borisov, Monica Barbaro, Billie Lourd, Jason Schwartzman, Cooper Koch, Cooper Hoffman and Ike Barinholtz.",
        "content": "",
        "upvotes": 47,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ocFSBHj6-aX38Q1GVvCKyt2TSu9-PJvqVAoiqZvVz1M.jpeg?auto=webp&amp;s=3788cbca87e87fa109bf7a33c4ce2b8db59e2879"
        },
        "permalink": "/r/movies/comments/1n8gajq/mark_rylance_joins_luca_guadagninos_next_film/"
    },
    {
        "id": "1n7zsze",
        "author": "InExactEnds",
        "title": "Dumb Logic ≠ Plot Hole",
        "content": "Plot Holes: Inconsistencies and narrative gaps within a film’s logic or “rules”\n\nDumb Logic: Lazy explanation for something occurring within a story\n\nExample of a Plot Hole: A person is said to have gone missing on the 23rd of July even though earlier in the film, the kidnapper was in a different city on the 23rd of July.\n\nExample of Dumb Logic: A person goes missing, the movie explains the cops are bad at their jobs, and a few months pass. The person is later found in a major character’s basement (after he spent all those months there), and that character was previously a suspect.\n\nPeople often mixed these two up and I thought I’d just share this. You can hate something for having dumb or lazy logic, but that DOESN’T make it a plot hole. This is majorly the case w/ the new film WEAPONS and it drives me up a wall.",
        "upvotes": 569,
        "comments": 292,
        "media": null,
        "permalink": "/r/movies/comments/1n7zsze/dumb_logic_plot_hole/"
    },
    {
        "id": "1n8ec31",
        "author": "The_Iceman2288",
        "title": "Indie Streamer Nebula Taps ‘The Dinner Plan’ Filmmaker Patrick Willems as Director of Scripted Development (EXCLUSIVE)",
        "content": "",
        "upvotes": 45,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/segGkGm1tlZteZDluae5d6mdLHQbwlJd-DBI4AmZ_aM.jpeg?auto=webp&amp;s=413a7b09fbbffba9c89b5a366cf5f2ca2de340db"
        },
        "permalink": "/r/movies/comments/1n8ec31/indie_streamer_nebula_taps_the_dinner_plan/"
    },
    {
        "id": "1n8cohh",
        "author": "NoCulture3505",
        "title": "Official Poster for \"100 Nights of Hero\"",
        "content": "",
        "upvotes": 46,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/byw2l9qxx5nf1.jpeg?auto=webp&amp;s=7f08e0eb019bdd481ff8086a517de06fe31d903b"
        },
        "permalink": "/r/movies/comments/1n8cohh/official_poster_for_100_nights_of_hero/"
    },
    {
        "id": "1n8obf3",
        "author": "DashingMustashing",
        "title": "Something happened that broke my heart a little today with how movies are shared today.",
        "content": "To make a long story short I've managed to get several of my staff into watching \"classic\" movies (2000's is classic now, It hurt to hear lets move on) instead of the dreaded cycle of rewatching the same netflix series over and over which they very much prefer to do. It's been going very well!! I've never forced the discussion but brought it up casually though lately it's been something they've been bringing to me more and more without promting, sparking discussion and what to watch next and then, the biggest wall since my teens hit me like a brick. \n\nEvery time I've gotten into this discussion before with older peers I would always say \"Well, here! Borrow this and these dvds and let me know what ya think!\" and as that moment presented it's usual self and I was struck. I can't share these amazing movies anymore.. \nI can vaguely point at where they might be if they maybe have a subscription to a half dozen things but half the time I know I'll be met with glazed over eyes knowing their pursuit of the thing just isn't worth the time, back to binging I guess. \n\nThe passing-over of collected movies is just gone and It hurts that such a ceremonial thing is gone. I loved so much giving little treasures to my friends for them to discover for the first time and the bond it created letting them discover a thing you've discovered for yourself. Now that age feels gone. I remember so vividly my older sister giving me Nightmare on Elmstreet on vhs behind my parents back and hording it like Golem.. Maybe It's just the physical? Maybe the limited nature of it. Maybe the personality of this hand given gift of something they let touch their hearts be then hand given to you that they hope will touch yours. I don't know exactly but it hit different.\n\nMaybe it's for the better? I guess if you sail the seven seas you can still quite easily find all these things but man.. It's just not the same.",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1n8obf3/something_happened_that_broke_my_heart_a_little/"
    },
    {
        "id": "1n7r8r3",
        "author": "Cptawesome23",
        "title": "Thunderbolts*",
        "content": "Just watched the Thunderbolts* on Disney+ and I have completely loved it. Whether taken as a whole seperate work or as the culmination of several of the darker heroes storylines, this movie was a treat. The main character Yelena narrates the opening with a realization “there is something wrong with me” and the direction of the movie explores the idea of inner reflection with gusto. Every character in this film has something they are dealing with. Some dark regret they have to deal with, and it culminates in a shared realization of the method by which to deal with one’s pain: friends. The movie implicitly prescribes friends as the cure for depression. It’s heartwarming in every sense and also gives the team an unshakeable bond that was both fun to watch form as well as believable. This was a good movie. It doesn’t have the best storyline in marvel, that honor still belongs to Nebula, but it does tell a coherent and touching story about why we all need friends.",
        "upvotes": 1028,
        "comments": 278,
        "media": null,
        "permalink": "/r/movies/comments/1n7r8r3/thunderbolts/"
    },
    {
        "id": "1n7isk0",
        "author": "SpeedForce2022",
        "title": "Official Poster for Emerald Fennell’s ‘Wuthering Heights’",
        "content": "",
        "upvotes": 2667,
        "comments": 651,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6bfmfdb63zmf1.jpeg?auto=webp&amp;s=13b3153d5ba6632de09f540d27828f286db43088"
        },
        "permalink": "/r/movies/comments/1n7isk0/official_poster_for_emerald_fennells_wuthering/"
    }
]