[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1owq8wp",
        "author": "haltandcatchfirepod",
        "title": "My Love Letter to Torino",
        "content": "I had the opportunity to live in Torino for a short time from 2005-2006. I have the most wonderful memories. I had a chance to go back for the first time this summer, and I made it a point to capture as many of the things I love as I could in a few days. [https://youtu.be/QZ\\_7stVwjtk](https://youtu.be/QZ_7stVwjtk)",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3fmwtisie61g1.png?auto=webp&amp;s=d079d8b3da5cbb88585cc8c28b9e70443a36b382"
        },
        "permalink": "/r/torino/comments/1owq8wp/my_love_letter_to_torino/"
    },
    {
        "id": "1ovw8xe",
        "author": "AbbiAbbiDoo",
        "title": "Per una cosa che funziona a Torino, perché volerla spostare a Milano? Non capisco questo spasmodico \"milano-centrismo\" degli eventi",
        "content": "",
        "upvotes": 159,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ik6p7lkynz0g1.png?auto=webp&amp;s=4130790a4664680e72c946139cded3c5bff1f057"
        },
        "permalink": "/r/torino/comments/1ovw8xe/per_una_cosa_che_funziona_a_torino_perché_volerla/"
    },
    {
        "id": "1ow3lgc",
        "author": "No_Bug_3501",
        "title": "Goodbye to Turin’s techno club culture 👋",
        "content": "CIAO TORINO\n\nI’ve spent the past few months in Turin and had the pleasure of checking out several electronic and techno nights.\nI really loved Bunker! it’s a truly beautiful venue aesthetically, although unfortunately it does have a serious issue with its sound system that really needs to be reworked.\n\nI also wanted to share some very positive impressions of Azimut and Q35. Beyond hosting amazing artists and having incredibly well-curated programming, they both stand out for their sound systems, which are on a level I’ve rarely (if ever) seen in Italy. Top-quality Funktion-One and L-Acoustics setups make the musical experience genuinely great.\n\nAnother big plus: the set lengths: 3 to 4 hours for the guests is the norm! I’ve seen other parties where artists play for just an hour or an hour and a half… and honestly, that just doesn’t make much sense.\n\nOf course, I’m used to the scenes in Amsterdam and Berlin, so I won’t compare the crowd or the duration of the nights … but I did meet some lovely people at Azimut, and I hope to come visit you all again soon for this second wave!\n\nI LOVE THIS CITY\nciao\n",
        "upvotes": 20,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hqnm8o10j11g1.jpeg?auto=webp&amp;s=c744ff2a0c13e66c8b481a774f0c9d49a023bf75"
        },
        "permalink": "/r/torino/comments/1ow3lgc/goodbye_to_turins_techno_club_culture/"
    },
    {
        "id": "1ovzk8u",
        "author": "Top-Analysis-887",
        "title": "Curiosissima di sapere cosa ne pensate di questo articolo! Quanti di voi torinesi sono stati o hanno vissuto a Londra e poi sono tornati?",
        "content": "Io sono l’opposto: britannica di origine, ho vissuto lì per molti anni prima di trasferirmi qui in Italia, a Torino, e sono assolutamente d’accordo con il milionario (sì, lo so, è di Milano 😅). Ho diversi amici torinesi che hanno vissuto a Londra e alla fine sono tornati, e anche molti amici inglesi che invece sono “scappati” dal Regno Unito e si sono trasferiti qui.\n\nVoi cosa ne pensate?",
        "upvotes": 7,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2VoPgkOXp60WsHzXpbue_51iW7MGw57HRRR7TmCNIQU.jpeg?auto=webp&amp;s=0feda2ceb0c0be503644e97a880c6687495fb108"
        },
        "permalink": "/r/torino/comments/1ovzk8u/curiosissima_di_sapere_cosa_ne_pensate_di_questo/"
    },
    {
        "id": "1ovydcr",
        "author": "electrolitebuzz",
        "title": "Ho passato il giornaliero su telefono al tornello della metro e mi ha addebitato la carta",
        "content": "\\[Update: ok in base alle tante risposte mi sento meno sola. Assurdo che succeda in modo sistematico! Farò come suggerito da uno di voi, cercando i tornelli con i soli lettori di biglietti e non di carte.\\]\n\nNon uso spesso la metro, volevo sapere se è successo a qualcun altro quello che mi è capitato l'altra sera e se c'è qualche soluzione per evitarlo.\n\nDi solito uso tram e bus e tappo la carta direttamente sopra, ma compro il biglietto giornaliero sull'app GTT quando devo fare due o più tratte. L'altra sera avevo un biglietto giornaliero valido sull'app che avevo usato al mattino e al pomeriggio su due bus, quindi l'ho passato al tornello della metro. Credo fosse la prima volta che provavo a entrare in metro con il giornaliero digitale.\n\nDopo il bip e l'apertura, ho guardato lo schermo per chiudere l'app GTT, ma nella schermata c'era invece il wallet con le carte e mi sono trovata l'addebito sulla carta.\n\nHo il dubbio di non aver chiuso l'app wallet dopo aver pagato in un supermercato poco prima, ma in ogni caso se la app sullo schermo era quella della GTT non dovrebbe prendere quella? Comunque dubito anche di aver lasciato l'app aperta, perché la carta che era visualizzata e che mi è stata addebitata è quella principale che compare per prima all'apertura di Wallet, ma non quella che avevo usato poco prima per il pagamento, che sarebbe stata selezionata se avessi messo via il telefono al supermercato senza chiudere.\n\nPer questa volta amen, non sto neanche a perdere tempo con l'assistenza per 2 euro, ma vorrei capire come evitarlo le prossime volte. L'NFC è necessario anche per la scansione del giornaliero, vero? Forse bisogna aggiungere il biglietto a Wallet come si fa con trenitalia e non scansionare direttamente il biglietto dall'app GTT?",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ovydcr/ho_passato_il_giornaliero_su_telefono_al_tornello/"
    },
    {
        "id": "1ow0fdg",
        "author": "DistributinOfWealth",
        "title": "Avigliana, cosa c'e?",
        "content": "Avigliana ha due laghi splendidi… e paradossalmente un solo posto decente dove cenare davvero sul lago. Fine. Quando è venuta la mia famiglia, ci siamo accorti che oltre al posti di fumetti non c’è nulla: tutto il resto è proprietà privata, recinzioni, accessi chiusi o strutture che sembrano lasciate andare da anni\n\nIl lago è bellissimo, ma la situazione è pazzesca: zero scelta, zero vita, zero alternative.   \n  \nUn posto con questo potenziale dovrebbe avere una fila di ristoranti vista acqua, invece ti ritrovi a sperare che al posto di fumetti ci sia posto… perché altrimenti hai perso la serata.  \n  \nSe sai perchè?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ow0fdg/avigliana_cosa_ce/"
    },
    {
        "id": "1ov3hne",
        "author": "sbrodolino_21",
        "title": "Oggi c'è un evento in piazza Carignano contro la disinformazione russa",
        "content": "",
        "upvotes": 331,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0rzpvz41it0g1.jpeg?auto=webp&amp;s=184d0847767c5d218bff946bff863cbe19615e8b"
        },
        "permalink": "/r/torino/comments/1ov3hne/oggi_cè_un_evento_in_piazza_carignano_contro_la/"
    },
    {
        "id": "1ow3z46",
        "author": "Pablitos1989",
        "title": "Beachvolley a torino per divertimento",
        "content": "Ciao 👋\nChi ha voglia di giocare a beach volley a Torino? ☀️\nOrganizziamo partite pomeridiane in diverse location della città, con sfide easy e divertenti, aperte a tutti i livelli di gioco 💪\n\nFormiamo le squadre in base al livello, così le partite sono sempre equilibrate e coinvolgenti ⚡️\nIl costo è solo la divisione del campo (di solito pochi euro a testa).\n\nPer info e per partecipare, entra nel sottogruppo dedicato 👉\n💬 Beach Volley / Volley Torino\nhttps://chat.whatsapp.com/Fb5RsUlzGE7LlwYht9q2lR",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ow3z46/beachvolley_a_torino_per_divertimento/"
    },
    {
        "id": "1ow1n6v",
        "author": "enricoscarsi",
        "title": "Dove trovare a Torino buoni regalo per servizi fotografici da regalare per Natale",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ow1n6v/dove_trovare_a_torino_buoni_regalo_per_servizi/"
    },
    {
        "id": "1ow34kp",
        "author": "Dolcissima88",
        "title": "Strip poker",
        "content": "C’è qualche coppia entro i 40 anni che voglia organizzare una partita a strip poker?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ow34kp/strip_poker/"
    },
    {
        "id": "1ow13cl",
        "author": "taesub",
        "title": "Come tornare la notte dallo Stadio Allianz?",
        "content": "Ciao, sono una studentessa di 22 anni e a breve inizierò a lavorare allo stadio Allianz. Nel mese di Novembre ho un corso di formazione che termina alle 21.30. Abitando a Crocetta, mi chiedevo se qualcuno avesse consigli su come muoversi più in sicurezza a quell'ora e quali zone/linee evitare.\nGrazie",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1ow13cl/come_tornare_la_notte_dallo_stadio_allianz/"
    },
    {
        "id": "1ouysri",
        "author": "_L_-",
        "title": "Mr Orologio sul tram",
        "content": "",
        "upvotes": 153,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7oj9twiz2s0g1.jpeg?auto=webp&amp;s=ae9d23f121bfa3e2ffa53822c1a5d178e229617a"
        },
        "permalink": "/r/torino/comments/1ouysri/mr_orologio_sul_tram/"
    },
    {
        "id": "1ovxtrk",
        "author": "AlexGio27",
        "title": "Esiste un posto dove far riparare una vecchia console?",
        "content": "Avrei bisogno di trovare un posto dove poter portare il mio vecchio Nintendo 3DS per farlo riparare: avrei bisogno di cambiare lo schermo touch (che non dovrebbe essere troppo difficile). Ho cercato online e ho trovato qualche risposta, però ho pensato di chiedere qui per avere anche opinioni di chi magari ha usufruito di servizi simili, in modo da sapere quali posti evitare e quali invece sono validi.\n\nRingrazio in anticipo chiunque mi risponderà! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ovxtrk/esiste_un_posto_dove_far_riparare_una_vecchia/"
    },
    {
        "id": "1ovtzas",
        "author": "frakbar",
        "title": "Tessera musei (o simili) per stranieri",
        "content": "Ciao a tutti, Spero stiate bene!\nHo una domanda per voi: la mia ragazza (Canadese) verrà a studiare il prossimo semestre a Torino (non ad UnITO, ma  online per scrivere la tesi). Mi sarebbe piaciuto fare la tessera musei per studenti anche per lei, ma purtroppo ho scoperto che serve il codice fiscale per farla. C’è un modo per aggirare questa procedura? O un’alternativa alla tessera musei per stranieri? (So che esiste una tessera per turisti, ma credo sia al massimo settimanale)\nGrazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ovtzas/tessera_musei_o_simili_per_stranieri/"
    },
    {
        "id": "1ovcz8b",
        "author": "ThreeDegreesInACoat",
        "title": "Fuochi Artificiali - Torino Nord",
        "content": "Buonasera a tutt,\n\nsono tornato a Torino da Febbraio dopo un lungo periodo di assenza, e mi sono trasferito in una casa dalle parti di rondò della Forca, con una finestra che guarda a Nord, verso borgo vittoria / barriera. Da Febbraio la sera vedo relativamente spesso fuochi d'artificio, per quanto non abbia idea della distanza. Qualche persona ha idea di cosa sto vedendo? Compleanni di facoltosi di Rebaudengo? Sagre di paese di Borgaro? Sono mesi che mi interrogo.",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1ovcz8b/fuochi_artificiali_torino_nord/"
    },
    {
        "id": "1ov1u74",
        "author": "Ok-average-dude",
        "title": "Sto aiutando i miei genitori ad organizzare il weekend dell'8 dicembre a Torino. Sarà la loro prima visita. Quali posti e attività consigliereste per due 50enni belli arzilli, interessati alla cultura così così ma molto curiosi di provare cibo e nuove esperienze?",
        "content": "",
        "upvotes": 22,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ahbbvp2l1t0g1.jpeg?auto=webp&amp;s=cb44e26b0ef5a49153e6f371b2bb4ef201be1c5e"
        },
        "permalink": "/r/torino/comments/1ov1u74/sto_aiutando_i_miei_genitori_ad_organizzare_il/"
    },
    {
        "id": "1ovdaa3",
        "author": "NephriteAbsinth",
        "title": "Com'e' il lavoro a Torino? (domanda da torinese andata all'estero)",
        "content": "Ciao!  \nVorrei il vostro aiuto per chiarirmi un attimino le idee.  \nDopo 10 anni in UK potrei (forse) avere la possibilità di tornare a Torino.   \nNon vi sto ad annoiare con tutti i dettagli, ma sono successe delle cose nella mia famiglia che hanno creato \"un'occasione\".  \nQuello che mi ha sempre spaventato nel tornare in Italia è la situazione lavorativa. I miei ricordi di prima che mi trasferissi su non sono bellissimi: facevo un lavoro che mi piaceva molto, ma in nero e pagato 2-3 euro l'ora, 7su7. Immaginerete che anche quel bellissimo lavoro dopo quasi 5 anni sia finito per odiarlo. Avevo provato a cercare altro, ma con scarsi risultati.   \nQuindi, anche lì, per varie situazioni che si sono create, ho deciso di spostarmi in UK.  \nA Londra ho sempre lavorato nella caffetteria e ho studiato un po' nel mondo tech, proprio quando il mondo tech è andato sottosopra (almeno, per quanto riguarda UK e USA), giusto per farvi capire il mio background.  \nOra, se foste così gentili, vorrei sapere che lavoro fate, il RAL e quanti giorni a settimana lavorate. E cose che vi rendono felici, tipo colleghi o clima nell'azienda e cose che vi piacciono meno, tipo chesso', che vi forzano a prendere le ferie in determinati periodi. \n\nGiuro che non mi voglio fare i cazzi vostri, vorrei solo farmi un'idea di com'e' lavorare in Italia nel 2025 e magari togliere alcuni bias che ho per via delle mie esperienze passate. \n\nGrazie mille in anticipo! :)",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ovdaa3/come_il_lavoro_a_torino_domanda_da_torinese/"
    },
    {
        "id": "1ovgxxi",
        "author": "Able-Spell4394",
        "title": "Photo walk - street photography buddy per esplorare Torino",
        "content": "Sono arrivato da un paio di mesi a Torino per studiare al politecnico, da altrettanto tempo non fotografo più. Scatto da diversi anni, più che altro fotografia documentaristica di viaggio, street e live music, ma forse il trasferirsi ha fatto sì che mi venisse a mancare quella confidenza che avevo con questa mi passione praticata nei posti vicini a dove vivo. Mi piacerebbe cominciare ad esplorare Torino con qualcuno che sia nella mia stessa condizione, vittima di cambiamenti e di blocchi creativi vari a cui interessi andare in giro per capire come funziona fotograficamente questa città oppure qualche local street photographer , a cui poter anche rubare tips and tricks ✌️",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ovgxxi/photo_walk_street_photography_buddy_per_esplorare/"
    },
    {
        "id": "1ovioqe",
        "author": "sugar_kookie",
        "title": "Qualcuno che lavora per Greenpeace?",
        "content": "Mi serve un'opinione onesta e diretta. Com'è lavorare per Greenpeace? Pagano davvero il fisso? Che turni/giorni ti propongono? Grazieee",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ovioqe/qualcuno_che_lavora_per_greenpeace/"
    },
    {
        "id": "1oufk02",
        "author": "Emyfour",
        "title": "Subway Torino: la verità trionfa",
        "content": "Una ventina di giorni fa, ho lanciato [un accorato appello](https://www.reddit.com/r/torino/comments/1oe0ik1/subway_torino_chiuso_da_anni_ma_aperto_su_maps/) per portare all'attenzione di tutti un problema drammatico: il noto ristorante Subway in Via Garibaldi 55/D, caduto vittima della pandemia nel 2020, era ignobilmente mantenuto aperto su Google Maps.\n\nOggi, dopo anni di inganni e false speranze, ho ricevuto il messaggio che annuncia la fine della lotta.\n\nhttps://preview.redd.it/xett2qnkwn0g1.jpg?width=576&amp;format=pjpg&amp;auto=webp&amp;s=7dd2004b51774cccfc7cbf4d6ee6a4155d6ecc4c\n\nhttps://preview.redd.it/2phtae0lwn0g1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f72e0820605eee30829920205fd913e1199b9985\n\nIl falso è stato sconfitto, la mappa è stata purificata, e Subway Torino può finalmente riposare in pace.\n\nRingrazio solennemente gli eroici segnalatori che hanno contribuito a combattere l'ingiustizia cartografica. Uniti, abbiamo ripristinato la verità.\n\n\n\nGrazie per aver reso Torino un posto migliore.",
        "upvotes": 164,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1oufk02/subway_torino_la_verità_trionfa/"
    },
    {
        "id": "1ovdh0v",
        "author": "Still-Marketing2398",
        "title": "Nuoto a torino",
        "content": "sto da un anno qui a torino e sono un ex nuotatore agonista, ho provato a scrivere anche nel gruppo dell’università (economia all’unito) ma non ho ricevuto risposte. stavo cercando qualche ex agonista con cui andare a nuotare ogni tanto al palazzo del nuoto. essendo stato fermo per un anno non sono super in forma però mi piacerebbe riprendere ad andare e andare sempre da solo non mi fa impazzire come idea; se siete ex nuotatori o conoscete qualcuno interessato per favore fatemi sapere 🙏🏻",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ovdh0v/nuoto_a_torino/"
    },
    {
        "id": "1ov930d",
        "author": "grovio8888",
        "title": "Palestra con Sacco",
        "content": "Ciao!\n\nQualcuno conosce/frequenta palestre a Torino con dei sacchi ad uso libero? \nVorrei potermi allenare al sacco in autonomia senza per forza fare un corso.\n\nIdeale zona Porta Nuova/Susa ma aperto a tutto.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ov930d/palestra_con_sacco/"
    },
    {
        "id": "1ouohmu",
        "author": "Top-Analysis-887",
        "title": "Via Roma pedonale, in centro a Torino riapre il primo tratto: \"Diventerà un unico lungo boulevard",
        "content": "A Torino martedì 11 novembre è stato riaperto il primo tratto della nuova via Roma pedonale, tra piazza San Carlo e via Bertola.",
        "upvotes": 21,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B7HpNn-lANBPeByazbk5mn4dYamnFGDClLhvhwqVUrM.jpeg?auto=webp&amp;s=cbb98129032e000781b9001b0a58e759a0ddffe3"
        },
        "permalink": "/r/torino/comments/1ouohmu/via_roma_pedonale_in_centro_a_torino_riapre_il/"
    },
    {
        "id": "1ovm4j7",
        "author": "GoodHorse1926",
        "title": "Meet UP torinese monellini 🥳",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ovm4j7/meet_up_torinese_monellini/"
    },
    {
        "id": "1oujn1s",
        "author": "Vic4ri0us",
        "title": "Qualcuno è mai andato al museo con le pere di resina?",
        "content": "Sono qui da poco e ogni volta che racconto alle persone che voglio andare al museo della frutta (pomologico) mi guardano come se fossi pazza. \nForse le persone non colgono l'ironia del tutto non lo so, forse fa realmente cagare come tutti suppongono. \nTorinesi chiedo a voi, meritano 800+ sculture in resina a forma di frutta dietro teche di vetro? ",
        "upvotes": 22,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1oujn1s/qualcuno_è_mai_andato_al_museo_con_le_pere_di/"
    },
    {
        "id": "1ov3zgi",
        "author": "dkroods",
        "title": "Grazie di cuore a tutti gli utenti di Take It Easy Torino!",
        "content": "Ciao a tutti! Volevo prendermi un momento per ringraziare ognuno di voi che utilizza Take It Easy Torino!.\n\n❤️ Negli ultimi mesi siamo cresciuti tantissimo, sia come numero di utenti che come qualità dell’app. È davvero bello vedere quante persone trovano utile il nostro lavoro per muoversi più facilmente a Torino!  \n🚋🚌 Continuiamo a migliorare l’app costantemente, correggendo bug, ottimizzando le prestazioni e aggiungendo nuove funzioni grazie anche ai vostri suggerimenti. Ogni feedback è prezioso e ci aiuta a rendere Take It Easy Torino sempre più affidabile e completa.\n\n🙏 Grazie ancora per il vostro supporto e la fiducia — il meglio deve ancora venire! 💪 Se avete idee, consigli o problemi da segnalare, scrivetemi pure nei commenti o in privato.\n\n💙 Scarica subito:  [Take It Easy Torino](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nuaiiGFItbtxDSNzYhaG2Rssd5hcTlUDwPMth7Unb6A.png?auto=webp&amp;s=46528cedf69c398f3882c445f711b582d0d0bc88"
        },
        "permalink": "/r/torino/comments/1ov3zgi/grazie_di_cuore_a_tutti_gli_utenti_di_take_it/"
    },
    {
        "id": "1ov8xyn",
        "author": "Top-Analysis-887",
        "title": "Siamo seri per una volta e ditemi se questo non è il posto più bello di tutta Torino!! XDXD",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c623fm75mu0g1.png?auto=webp&amp;s=b80176ae1089e96a285b29bb9b4663ba778b882d"
        },
        "permalink": "/r/torino/comments/1ov8xyn/siamo_seri_per_una_volta_e_ditemi_se_questo_non_è/"
    },
    {
        "id": "1ouq5ci",
        "author": "Effect-Imaginary",
        "title": "Che cosa sarebbe: \"Gentile utente siamo passati presso la vostra abitazione per consegnare lo starter kit della raccolta differenziata \"porta a porta\" ma non vi abbiamo trovato.\"?",
        "content": "Mi sono trovato una sorta di volantino dell'amiat fuori casa (fra l'altro non hanno suonato).",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ouq5ci/che_cosa_sarebbe_gentile_utente_siamo_passati/"
    }
]