[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 115,
        "comments": 5803,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gvlq7w",
        "author": "Whobitmyname",
        "title": "‘Alice in Borderland’ Season 3 To Return to Netflix in 2025",
        "content": "",
        "upvotes": 47,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gvlq7w/alice_in_borderland_season_3_to_return_to_netflix/"
    },
    {
        "id": "1gvqu8y",
        "author": "BorvuxVI",
        "title": "Thoughts on Buy Now: The Shopping Conspiracy documentary? ",
        "content": "What are your thoughts after you've seen it? Does it make you rethink your own consumption habits?\n\nThe CEO of iFixIt (can't recall his name) mentioned that earbuds intentionally have a shelf life of around 18 months, which makes me reconsider buying them in the future, even though the earphone jack on my phone is gone.. ",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gvqu8y/thoughts_on_buy_now_the_shopping_conspiracy/"
    },
    {
        "id": "1gvr51g",
        "author": "misana123",
        "title": "‘A Good Girl’s Guide to Murder’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gvr51g/a_good_girls_guide_to_murder_renewed_for_season_2/"
    },
    {
        "id": "1gv8rhd",
        "author": "Metro-UK",
        "title": "Joy actor James Norton says he 'took IVF for granted' before starring in Netflix's historical drama",
        "content": "James Norton admits he knew very little about IVF before playing Robert ‘Bob’ Edwards in Joy.\n\nJoy tells the tale of three British pioneers who transformed the lives of millions of families around the world with the invention of in vitro fertilisation — or IVF.\n\nThe actor had encountered couples going through the IVF process, which marked the beginning and end of his understanding. \n\nHe said: ‘I know some very beautiful children who have been gifted to us through this amazing science so that was my knowledge of it and I took it for granted,’ he continued.\n\nBut learning about IVF’s origin story, he said, was a ‘really lovely journey’\n\nWhen you Google ‘who invented IVF?’ two names appear in bold at the top of the search box. Dr Patrick Steptoe (played by Bill Nighy) and scientist Robert ‘Bob’ Edwards. \n\nBut Google's results leave a gaping hole in the history of the creation of IVF – the vital contributions of nurse and embryologist Jean Purdy (Thomasin McKenzie) who was only commemorated by the Royal Society of Biology in 2015. \n\nIn the end, it was Jean who provided not only the ‘last piece of the puzzle that made IVF possible’ but also the voice desperately needed to bring this ‘incredible’ part of British history to the big screen.\n\n‘If this film is a reminder of the sacrifices that have been made by women, some good men, but mostly women, and how therefore we should protect that progress at every cost, then fantastic,' said Norton.\n\nYou can [**read the full article here**](https://metro.co.uk/2024/11/19/james-norton-i-took-ivf-granted-learned-shocking-truth-21940171/)",
        "upvotes": 36,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gv8rhd/joy_actor_james_norton_says_he_took_ivf_for/"
    },
    {
        "id": "1gvof84",
        "author": "Robemilak",
        "title": "Genesis Rodriguez in Talks to Join Netflx's ‘The Night Agent’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvof84/genesis_rodriguez_in_talks_to_join_netflxs_the/"
    },
    {
        "id": "1gvt1v8",
        "author": "Atlast_2091",
        "title": "Pokémon Horizons: Season 2 | Coming February 7 to Netflix | Official Trailer",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvt1v8/pokémon_horizons_season_2_coming_february_7_to/"
    },
    {
        "id": "1gvolpw",
        "author": "indiaweekly",
        "title": "Robert De Niro to star in Netflix drama 'Zero Day'",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvolpw/robert_de_niro_to_star_in_netflix_drama_zero_day/"
    },
    {
        "id": "1gvn2ty",
        "author": "bronzegods",
        "title": "Premiere of Tyler Perry’s Netflix Special \"The Six Triple Eight\" - Premiering Now",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvn2ty/premiere_of_tyler_perrys_netflix_special_the_six/"
    },
    {
        "id": "1gvn0r8",
        "author": "thaman05",
        "title": "Is a Netflix subscription required to play games on mobile?",
        "content": "Me and some friends want to play the new Squid Game Unleashed game on Android and iPhone. But when opening the game, it asks to login to Netflix account or create an account. Some people in our group don't have Netflix subscriptions. Is a subscription required or can anyone just create a free Netflix account? Or is there a way to play through in-app purchase? The app store description doesn't mention that a subscription is required.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gvn0r8/is_a_netflix_subscription_required_to_play_games/"
    },
    {
        "id": "1gunedr",
        "author": "stratogod",
        "title": "Complete silence from Netflix",
        "content": "Has anyone seen any acknowledgement or apology for the shit show Tyson stream?  I've asked a handful of people that I know that tried to watch it and they all had issues... These people lived in different areas of the US. It seems it was very widespread but Netflix is completely ignoring it and gaslighting us with how successful it was to not upset investors.  I guess they are not wanting to engage and hope it fizzles out while they correct internal issues before next stream, essentially making us beta testers.  \n\nI had friends over and spent an hour fucking with my home network thinking it was on my end until I saw others reporting issues.  It was beyond frustrating... then when it did work it looked like dog shit... I pay for 4k/HDR.  This is 2024, the scaling technology is there, yet they cut corners somewhere at the expense of its customers.  Oh well... cancelled just on principle. Ive been with them since early DVD delivery era.  Sorry, just ranting... tired of greedy corporations bending us over.  \n\nEDIT:  I should have included that they 'sort of' acknowledged it per the CTO to their EMPLOYEES... nothing publicly, at least not that I know of yet. \nhttps://x.com/markgurman/status/1857903507694915931",
        "upvotes": 314,
        "comments": 278,
        "media": null,
        "permalink": "/r/netflix/comments/1gunedr/complete_silence_from_netflix/"
    },
    {
        "id": "1gvgxl6",
        "author": "messengers1",
        "title": "Netflix Showcases Its Upcoming International Programs.",
        "content": "[https://deadline.com/2024/11/netflix-international-tv-series-2025-1236181090/](https://deadline.com/2024/11/netflix-international-tv-series-2025-1236181090/)\n\n[https://deadline.com/2024/11/netflix-international-movies-2025-1236180976/](https://deadline.com/2024/11/netflix-international-movies-2025-1236180976/)\n\nThis is what I like about Netflix for international programs in drama side. We could see more new faces around the world.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvgxl6/netflix_showcases_its_upcoming_international/"
    },
    {
        "id": "1gvl29q",
        "author": "Prize-Jelly-517",
        "title": "The Recruit season 2, is it coming?",
        "content": "Reminder that we are coming close to two years since the 8 (eight!) episodes of The Recruit were released.\n\nSeriously, what the fuck? How did we go from 20+ episodes with a few months between season to this complete joke? The only reason I remember this show is because I liked it and bookmarked it. I have no idea who's who anymore or what the story was. \n\nIs there any news? They apparently started filming... 10months ago? I don't recall this being super high production value with a lot of CGI or whatever.\n\n/rant",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvl29q/the_recruit_season_2_is_it_coming/"
    },
    {
        "id": "1gvmaqx",
        "author": "Odd-fox-God",
        "title": "Something is killing the children is getting an adaptation, I hope they don't downplay the gore and dismemberment",
        "content": "The body horror and Gore is not there for fun. Is there to cement how terrible the situation is. If the show does not show how horrible and painful the deaths are then it devalues the message of the show. \n\nKids get ripped in half while still alive, mounds of kiddy carcasses are found in the woods, parents come home to find entire sleepovers slaughtered, children are eaten alive, their limbs are ripped off of their bodies as they crawl for help. \n\nWe watch these children die in the comic. We aren't shown static lifeless bodies. We get to see living kids first and then we get to see them turned into mush. The story will be impossible to tell with cutaways to dead bodies like they do with other shows when tackling child murder. Where they don't show the kid actively being murdered but just allude and do like shitty flashbacks to it. That 100% will not work with this comic if it is adapted.\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gvmaqx/something_is_killing_the_children_is_getting_an/"
    },
    {
        "id": "1gv82di",
        "author": "CloudTurkey123",
        "title": "Arcane showing up as unavailable since yesterday! ",
        "content": "Just curious if anyone else ran into this problem. \n\nAfter watching the first three episodes this weekend, I can't watch Arcane (or lots of other shows) today while connected to my network. It works on my smart phone mobile data, but not the network. \n\nCS said it's a VPN, but I didn't change anything since the weekend (and nothing in several months). Also my ip location is in the correct part of the country (US). \n\nAny advice or commiseration? Netflix says it's Xfinity and Xfinity says nothing is wrong ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gv82di/arcane_showing_up_as_unavailable_since_yesterday/"
    },
    {
        "id": "1gvfima",
        "author": "ExpensiveKoala1303",
        "title": "KAOS",
        "content": "I know I’m late to the KAOS party, but I just finished it and I’m speechless. What a well executed, beautifully shot, incredibly provoking, and emotionally heavy show. From the characters, to the music, to the dialogue, I am blown away. There are so many parallels between their world and our world today that were so meaningful. I am so, so heartbroken that it was cancelled. I didn’t know where else to post this, but I just didn’t want to be alone with my thoughts. I’m so upset, what a mistake that it ended.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gvfima/kaos/"
    },
    {
        "id": "1gvqpgs",
        "author": "Suspicious_Luck1952",
        "title": "Netflix new obsession with hot men in there Christmas movies",
        "content": "We know that Netflix has a obsession with putting hot men in there series.\n\nNow Netflix made 2 Christmas movies main plot involves a hot shirtless guy that the main female protagonist falls in love.\n\nHot frosty. What if frosty the snow man turned into some hot shirtless guy. Bit of the plot is that this lonely woman put a magic scarf around a buff snowman statue then it turns into a human.\n\nThe merry gentlemen. Where a family is struggling to get visitors to their hotel/BnB so they hire some hot men to dance for the guests. Then the main female protagonist falls in love with a one of the dancers.\n\nThis is too much.\n\nWhat are they going to do for the other holiday movies.\n\nHalloween a pumpkin turns into a hot guy name jack.\n\nEaster. The bunny is some hot dude in a bunny suit.\n\nThanksgiving. Not sure if coming when skipping thanksgiving. Turkey the animal turns into a hot guy.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1gvqpgs/netflix_new_obsession_with_hot_men_in_there/"
    },
    {
        "id": "1gvm721",
        "author": "NoFudge8716",
        "title": "Did Outer Banks potentially get its inspiration from a Canadian cartoon called Stoked?",
        "content": "The range of words, characters, etc. seem all similar to one another.\n\nFor instance, Lo from Stoked is this rich girl with a very attractive brother just like Rafe, and she is hanging out with teenagers who aren't as wealthy as her instead of hanging out with teenagers coming from sophisticated families. Reef reminds me of JJ and John B. Johnny is pretty much like Pope—the smartest one in the group. Fin is a tomboy just like Kiara.\n\nThe setting and the fact that it's about hanging out with your friends in summer and facing adversities as well as experiencing new adventures seem more than just a coincidence. What do you all think?\n\nhttps://preview.redd.it/ibuqb4x8612e1.png?width=1500&amp;format=png&amp;auto=webp&amp;s=409d0f4cdd0aa3a83490e745c405a3f59ae47699\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gvm721/did_outer_banks_potentially_get_its_inspiration/"
    },
    {
        "id": "1gvdf6d",
        "author": "kaheye",
        "title": "What’s your opinion on how “The Cage” (2024) ended?",
        "content": "**No Spoilers**\nThe show was actually pretty good. It had a lot of celebrity appearances in the world of fighting. For only a 5 episode series, the production team did an amazing job grasping my attention and intertwining an impactful story into MMA fighting. I completely recommend the show for anyone who has minimal interest in combat sports.\n\nNow for the discussion (still no spoilers from me):\n\nI usually complain about predictable endings — this one took me by surprise. After such a dramatic story and background surrounding the main character, you really hoped for the outcome presented. Or, at least I did.\n\nWhat are your thoughts on the ending?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gvdf6d/whats_your_opinion_on_how_the_cage_2024_ended/"
    },
    {
        "id": "1gvcd33",
        "author": "verfresht",
        "title": "Upgrad for Arcane S2 to 4K plan?",
        "content": "I recently got a LG C4 77 TV. I have the HD plan of Netflix,, not really watching a lot on Netflix recently, but I am really looking forward to watch Arcane S2. My question, does the 4K plan actually make a difference with the animated show? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gvcd33/upgrad_for_arcane_s2_to_4k_plan/"
    },
    {
        "id": "1gvcb4b",
        "author": "misana123",
        "title": "Robert De Niro Netflix Conspiracy Thriller Series ‘Zero Day’ Sets February 20th Premiere Date",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gvcb4b/robert_de_niro_netflix_conspiracy_thriller_series/"
    },
    {
        "id": "1gv1jlu",
        "author": "Away-Wave-5713",
        "title": "Moving to diffrent region ",
        "content": "I'm moving to another region, does my netflix account still work in  diffrent region? \nIf they don't does it mean I have to close the account and open another one in the other region? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gv1jlu/moving_to_diffrent_region/"
    },
    {
        "id": "1gv1bge",
        "author": "Pogrebnik",
        "title": "Shah Rukh Khan Is Working on a Bollywood-Set Series with Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gv1bge/shah_rukh_khan_is_working_on_a_bollywoodset/"
    },
    {
        "id": "1gv9ny1",
        "author": "ProfessionalMix748",
        "title": "Is there a way to stop it from showing others what you're watching?",
        "content": "My family has a Netflix plan where only two can watch on the account at the same time. When you try watch something when two people are already using it it tells you what those people are watching and on what device. Is there any way to turn that off?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gv9ny1/is_there_a_way_to_stop_it_from_showing_others/"
    },
    {
        "id": "1gv95z3",
        "author": "duckgoesquack98",
        "title": "All capslock subtitles",
        "content": "Is there any way to change them to normal? or do i need to start sailing the seas. i saw a lot of older posts having the same problem, which still has not been resolved.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gv95z3/all_capslock_subtitles/"
    },
    {
        "id": "1guz0dc",
        "author": "MysteriousDelay6266",
        "title": "The Leopard (Italy) | Period Drama | Netflix in 2025",
        "content": "[THE LEOPARD \\/ IL GATTOPARDO \\(Italy\\) - Netflix in 2025](https://preview.redd.it/bcpffu06hv1e1.png?width=1299&amp;format=png&amp;auto=webp&amp;s=4a37a14a04f5f1966bbe894b6ced72279a284f27)\n\nBased on what many consider to be one of the greatest Italian novels of all time, The Leopard is a dazzlingly sensuous epic, set against the backdrop of revolution in 1860s Sicily. At its heart is Don Fabrizio Corbera, the Prince of Salina, who leads a life surrounded by beauty and privilege. But as Italy moves towards unification and the old aristocratic order is threatened, he realizes that his family’s future is in jeopardy. New allegiances must be made, each one a threat to his principles. Eventually Don Fabrizio is faced with an impossible choice. He has the power to engineer a marriage, between the rich and beautiful Angelica and his nephew Tancredi, that could secure his family’s legacy but, doing so would break his favorite daughter, Concetta’s heart. The series will be a modern exploration of timeless themes — power, love, and the cost of progress.\n\nDIRECTOR: Tom Shankland, Giuseppe Capotondi, Laura Luchetti  \nWRITER: Richard Warlow, Benji Walters  \nBASED ON THE BOOK: The Leopard (Original Title: Il Gattopardo) by Giuseppe Tomasi di Lampedusa\n\nKEY CAST: Kim Rossi Stuart, Benedetta Porcaroli, Deva Cassel, Saul Nanni\n\nTEASER: [https://www.youtube.com/watch?v=k0DS9ERfLjk](https://www.youtube.com/watch?v=k0DS9ERfLjk)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1guz0dc/the_leopard_italy_period_drama_netflix_in_2025/"
    },
    {
        "id": "1gv15x5",
        "author": "New-Breath4883",
        "title": "Imagine if you could create your own TV channel on netflix ",
        "content": "I think it would be cool af to create a TV schedule using your favourite shows like sitcoms, films ect and then you'd be able to tune in and out through the day if you just have your TV on in the background and can't decide what to watch, might be just too stoned but personally think that would be sick af ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gv15x5/imagine_if_you_could_create_your_own_tv_channel/"
    },
    {
        "id": "1gv5yoi",
        "author": "Hot_Perception_231",
        "title": "Account question",
        "content": "I am thinking of signing up for netflix but have a question due to things I've read about multiple devices (account sharing). I have no interest in sharing my account but, we do have multiple devices (3 TVs and 2 smartphones) that we use to watch shows. All the TVs are in our home and the phones we would use during slow times at work, etc. would this be allowed? Would we run into any trouble or have issues using our devices? \n\nJust want to be sure we will be good to go before taking the leap. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gv5yoi/account_question/"
    },
    {
        "id": "1gv4k4f",
        "author": "L9FatIRL",
        "title": "Why is Netflix only showing Netflix originals on my profile?",
        "content": "So just now when trying to watch Netflix on my PC most shows have disappeard. Mostly netflix originals are left\n\nIt works fine on my FireTV Stick and phone\n\nResetting my PC and Router did not change anything\n\nUsing someone else's profile lets me watch all shows\n\nI have never used a VPN to watch netflix. Funnily enough, when I use a VPN now the problem seems to go away, yet I do not want to have a VPN turned on all the time.\n\n  \nIs there any way to fix this? Would deleting the profile and creating a new one help?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gv4k4f/why_is_netflix_only_showing_netflix_originals_on/"
    },
    {
        "id": "1guvsys",
        "author": "Spurdaniel123",
        "title": "Download doesn't work",
        "content": "Recently, I've wanted to download a few episodes of a series onto my mobile, but I couldn't because it said there were downloads on too many devices (I have the lowest subscription tear, so it only works for one device). I found the device on which there were downloads and I deleted them. Afterwards, I tried to download the episodes on my mobile again, but the same message popped up. I've even waited, but more than 12 hours have passed and it still doesn't work.\nDoes somebody know what to do?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1guvsys/download_doesnt_work/"
    },
    {
        "id": "1guuncq",
        "author": "Wombo931",
        "title": "Looking for a show to watch? List of 5 of the best shows I have seen",
        "content": "People around me tell me that I give the best recommendations for shows and movies. You can basically be sure that whatever I recommend to you will not be in vain, and you'll likely share similar feelings to mine. I take a lot of pride in the fact that people respect the recommendations I give, along with the thoughts I share about a show or film. So, I refuse to do anything that might jeopardize that. Below is a list of shows (in no particular order) that I hold in the same regard as *Breaking Bad* (not all of the recommendations I give right now will have similar plots to *Breaking Bad*, such as drug dealing or gangs, but some will). Also, I am FAR FROM a good writer. So my writing may be a bit sloppy, or bland... but just trust me that these are some of the best shows you can watch. Each of them had a similar factor. I got extremely in to them to the point I would stand up, cry, or talk to the TV; and I basically watched most of them in a few sittings if not one alone. You will won't be bored for a while if you go through this list and watch each one. Here we go though!\n\n1. **Snowfall** 8/10 A solid show. It starts off feeling a bit cheesy with the acting and something about Franklin felt goofy to me at the start. However, the character development is outstanding, and the actors seem to find their footing as the show progresses. Take my criticism with a grain of salt because the show is definitely not a slow burn. It starts strong and captivating, only continuing to get better (until season 4).\n2. **3%** 9.5/10 A phenomenal show, truly a hidden gem, and in my opinion, the king of hidden gems. If a show truly deserves a 10/10 rating, this is one of the few that comes close. Some of the best acting I’ve ever seen, with exceptional character development. I became so attached to some characters and truly despised others. What makes the show unique is that there isn’t a clear \"good guy/bad guy\" dynamic. While the show guides you toward who you’re supposed to root for, you can still choose your own \"home team\" without having your experience ruined. The show excels in its realism—real in the way people react to events and situations. It provides a genuine depiction of what the world could be like, even in its dystopian setting. There isn't much \"evil\"; instead, you see people doing what they think is right, even if others view their actions as evil. I watched it in its original Portuguese because the dubbed English version didn’t do justice to the actors' performances—and frankly, it was poorly done, as most English dubs are. The show is filled with twists and turns, and it's almost never predictable. An incredible mind-bender of a show.\n3. **Ozark** 8/10 Another strong show. For some reason, I tried starting it about four times before I finally got into it—I can't remember why. This show excels in almost all aspects: plot, acting, character development, and twists that are far from predictable. The pacing is smooth, and the plot is captivating. There are moments where you notice something but don’t think much of it, only to realize how pivotal it was 30 episodes later. I love shows with well-written foreshadowing, and *Ozark* is one of them.\n4. **Attack on Titan** 9.5/10 I understand not everyone is into anime, but I truly believe anyone can watch *Attack on Titan* and love it. In my opinion, it’s one of (if not *the*) greatest stories ever told. It doesn’t rely on typical anime clichés like over-the-top humor or fan service. The acting is great (both the sub and dub, although the sub is infinitely better), and it feels like regular TV—despite being animated. The first episode grabs your attention in a huge way. While the show might seem a bit slow after that, be patient—the first season is just laying the foundation. I wouldn’t call it a slow burn, but the first season is one of the less captivating ones. Once you reach the middle of the third season, nearly every episode has you on the edge of your seat. Not many shows can make me stand up or talk to the TV, but *Attack on Titan* did it repeatedly. It’s one of the most well-written shows of all time, with incredible foreshadowing, mind-blowing twists, and unforgettable characters. It explores the gray areas of good and evil in a way few shows do. The second half of the series is almost a new show, yet it still feels like the same one. It's hard to explain, but you’ll understand if you watch it. This show has everything to be peak fiction—nothing is missing. The ending was set from the very beginning, which is rare in storytelling. Every storyline and loose end is tied up in a way that’s incredibly satisfying. I cried multiple times and had my mind blown on more than one occasion. SO many twists. A perfect show.\n5. **White Lotus** 8.5/10 Another hit. I don’t typically enjoy comedies or shows that try too hard to be funny (not that I’d call *White Lotus* a comedy), because more often than not, I find them forced and unfunny. But this show had me laughing on several occasions. It doesn't let the humorous moments overshadow the overall tone of the show, nor does it detract from its urgency or seriousness. The show portrays society and the human psyche in a way that feels incredibly real. Throughout, you feel as though you’re watching a story that could happen in real life, even though the events are outrageous. The characters' reactions to events make sense, and I found myself comparing them to people I know. The acting is excellent, and each character feels authentic. At times, I was amazed at how much they resembled real people—not in appearance, but in their actions. It’s over the top at times, but never to the point where it feels unreal. A remarkable show.",
        "upvotes": 2,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1guuncq/looking_for_a_show_to_watch_list_of_5_of_the_best/"
    }
]