[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 481,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h42qwq",
        "author": "False_Summer6313",
        "title": "Dark was very boring for me",
        "content": "I watched 5 episodes. I tried watching 3 years back, i stopped at the 2nd episode. Again i tried watching it 1 year ago, stopped at 4th episode. Now at 5th episode. Literally everyone’s characteristics in this series are the same. The character designs are sooo bland. I can’t sit through 9 hours of very slow burn screenplay to get the ‘AHHHHH’ moment in the 10th episode. I usually like ‘mind-melting’ series which makes me think more. Idk what’s happening with this one. Should i continue it and give it a shot?",
        "upvotes": 20,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1h42qwq/dark_was_very_boring_for_me/"
    },
    {
        "id": "1h3xuvg",
        "author": "_formula10",
        "title": "The MADNESS.. more like The UNBELIEVABLE.",
        "content": "\n25 minutes in, and I’m already peeved.\nIf a man reports to the police about men in masks with guns and a chopped-up body at a cabin in the woods, and then certifies himself to be an established news reporter guy (despite being disheveled) because why wouldn't he.. why are they not responding with more units? Why are they not treating the place as a crime scene? Why isn’t he taken back to the station to file a formal report?\nHow does a lawman fail to recognize the difference between running over a nail and a textbook slashed tire on the side wall? Why would the reporter be considered or treated as a suspect off the bat? just because he's a writer, he's automatically a body chopping homicidal individual? this is no Jussie Smollett case,(all though even his \"assailants\" were taken under better preliminary scrutiny) it's a possible cartelish sounding case with professionals at hand, which is far more pressing. yes, there's little proof to corroborate his story, but can a real cop tell us what would have taken place if a CNN or Fox personality with news media influence came to them with such a story?\nWhy hasn’t the reporter contacted his colleagues at the station? And why would he even stay near that property alone after the police left?\nThis isn’t a critique of the characters in this pilot ep.—it's about the story writing. It’s unrealistic, sloppy, and a product of LOUSY MADNESS so far.\n\nLousy madness or keep watching it gets better? \n",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h3xuvg/the_madness_more_like_the_unbelievable/"
    },
    {
        "id": "1h45sdl",
        "author": "Big-Wolf8312",
        "title": "Ok I get there are ads now, but why Netflix ads on Netflix??",
        "content": "I have seen that \"you have to watch it!\" ad on Netflix with Simone Biles so many times, but only ever on Netflix itself. Wouldn't you want people who don't have Netflix to see that ad to make them wanna get it? I already have Netflix...",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h45sdl/ok_i_get_there_are_ads_now_but_why_netflix_ads_on/"
    },
    {
        "id": "1h3dawo",
        "author": "Zeroyhme",
        "title": "Squid Game Comparisons: Season 1 vs Season 2",
        "content": "",
        "upvotes": 186,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1h3dawo/squid_game_comparisons_season_1_vs_season_2/"
    },
    {
        "id": "1h47lay",
        "author": "indiewire",
        "title": "Best New Netflix Shows in December 2024",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h47lay/best_new_netflix_shows_in_december_2024/"
    },
    {
        "id": "1h3x5y0",
        "author": "redditer100001",
        "title": "Shows good as Ozark",
        "content": "I first tried to watch Ozark some years back and maybe watched 2 or 3 episodes and either lost interest or got distracted but it wasn’t good enough to have me hooked yet. \n\nWell a few weeks ago I decided to try again and it got me. The show was dope. \n\nIt’s hard for me to get into other series now cause of how high they set the bar with that one lol.\n\nWhat shows do any of you recommend ?\n\nBefore Ozark another series I watched recently that I really liked was The Resident. \n\nBoth of these shows packed a lot of punch in each episode that kept things from being too\nslow or dull. ",
        "upvotes": 5,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1h3x5y0/shows_good_as_ozark/"
    },
    {
        "id": "1h3iccc",
        "author": "WowImOldAF",
        "title": "Hulu Ad in a Netflix show? ",
        "content": "Just find it ironic/funny that they filmed this scene and didn't reshoot it when there was a Hulu ad in it ",
        "upvotes": 46,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5yxtihj7w24e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1h3iccc/hulu_ad_in_a_netflix_show/"
    },
    {
        "id": "1h43wgj",
        "author": "SpyFxx",
        "title": "There appears to be a problem with the payment method you are trying to use.",
        "content": "Hi, I um got a problem with Netflix, and I do not know how so solve it.\n\nSo I've lately got a new card, and netflix sent me a message that I should update my payment method. But when I put all the new correct detail into it, it loads and then shows me a text saying : There appears to be a problem with the payment method you are trying to use. My subscription got cancelled and when I tried to restart it, it just showed the same text.... Is it a Netflix or my bank problem? \n\nSorry if you've seen this many times, i just want to watch and I don't know what to do... Thanks",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h43wgj/there_appears_to_be_a_problem_with_the_payment/"
    },
    {
        "id": "1h43hgq",
        "author": "akitwo",
        "title": "Is there a Netflix Christmas/Winter Intro?",
        "content": "Hey, there are so many different variations of the netflix intro sound on youtube but i havent found a christmas or winter Intro Sound? Does something like that exist in the Internet?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h43hgq/is_there_a_netflix_christmaswinter_intro/"
    },
    {
        "id": "1h41d3o",
        "author": "SpecialistOk359",
        "title": "Netflix won't let me play anything even though it will load everything",
        "content": "I'm watching from my laptop, and nothing will play, everything is loading fine. I installed the recent update after it started, but that didn't fix it. It will even allow me to load into an episode and skip around and will load the spot I skipped to almost instantly, but it won't play anything. I have restarted Netflix and my device yet nothing has worked, I will likely uninstall and reinstall it after I post this and hope that fixes it.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h41d3o/netflix_wont_let_me_play_anything_even_though_it/"
    },
    {
        "id": "1h40s0n",
        "author": "Practical_Event9278",
        "title": "From (TV Show): opinions?",
        "content": "I started watching this show yesterday, and I can't remember when I felt more uncomfortable. I don't want to spoil anything, but the first two episodes were quite disturbing, lol.\n\nFor those who have watched the entire season: Is it worth continuing? What are your overall impressions?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1h40s0n/from_tv_show_opinions/"
    },
    {
        "id": "1h3t6kp",
        "author": "PSProductionsSC",
        "title": "Just about to wrap up season 1 of Dark (Netflix) for the first time... thoughts on the following seasons? (No spoilers, pls!)",
        "content": "So... I am about to start episode 10 of Dark, season 1, after several unsuccessful attempts to get into it at earlier times.\nIt has been amazing each time but the show is a whole-a** meal, and a very heavy one at that. Made it kind of difficult for me to get into.\nNow that I have...\nOhmygah, this is one of the fullest explorations into time that I have encountered, and I really have enjoyed the heck out of it!\n\nSo... for all you folks that are years ahead of me...\nDo the latter seasons take as long to grip you?\n\nI know that a pilot season has a lot of ground to lay out; new names, faces &amp; places &amp; the likes. This show had that 3x over, and did so wonderfully, BUT with so much to cover, I think the amount of minutes it took to do that may have been a factor that made it hard for me to get invested in much earlier than I did.\n\nAgain, being that the amount of time it took to take off was my only real issue, I am sincerely hoping that the next seasons kind of roll on a bit more quickly.\n\nAnd anyone that was a MEGA fan of the series...\nWhich season is your favorite?\nAny recommendations for after?\nThx!",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1h3t6kp/just_about_to_wrap_up_season_1_of_dark_netflix/"
    },
    {
        "id": "1h3oikf",
        "author": "Guilty-Basil-4680",
        "title": "Why do subtitle lines keep shifting about?",
        "content": "It's really distracting that not only do the whole sentences movce about, but the individual lines are in different sides of the screen.",
        "upvotes": 6,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9odbw79ua44e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1h3oikf/why_do_subtitle_lines_keep_shifting_about/"
    },
    {
        "id": "1h3xxym",
        "author": "Fearless_Housing_302",
        "title": "Netflix Mobile app keeps freezing ",
        "content": "It's worked 100% fine on my phone for over a year. But now the video freezes while the audio keeps playing. My Netflix app is updated, I cleared the cache, reinstalled it and restarted my phone with no avail. The only thing that changed was an android security update. Could that of caused it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h3xxym/netflix_mobile_app_keeps_freezing/"
    },
    {
        "id": "1h3tj2p",
        "author": "AllHailForever",
        "title": "Why is movie quality so much worse than normal show quality for me?",
        "content": "Watching a series i get a nice crisp and clean quality, but when i put a movie on its in 480/720p even though in the setting i have it set to the best quality. its not my internet i run ethernet with 1gbps",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h3tj2p/why_is_movie_quality_so_much_worse_than_normal/"
    },
    {
        "id": "1h403x2",
        "author": "Cindro0",
        "title": "Movie gone that shouldn't be",
        "content": "Heya! So I started watching Mad Max: Fury Road yesterday and wanted to continue watching today, but when I opened Netflix, the movie was still open but showed that the movie is not available in my region. After I exited out of it, it vanished from \"continue watching\", my watchlist and netflix altogether. I already googled which movies are leaving, but Mad Max shouldn't be one of it? I'm not using a vpn, and I haven't changed locations.\nAnyone got any ideas why this happened and how to solve it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h403x2/movie_gone_that_shouldnt_be/"
    },
    {
        "id": "1h3rk48",
        "author": "sharron31369",
        "title": "Senna Netflix",
        "content": "Come on producers who are you trying to kid here?? As a huge F1 fan and of Senna in particular. The series shows him coming to Norfolk England in Ep 1. As a Norfolk resident we can clearly see that this isn’t Norfolk!!! Norfolk doesn’t have mountains and we looked it up and you shot these scenes in Northern Ireland which isn’t even in England. Was excited to watch the series but as a fan we were disappointed in your lack of attention to detail in your filming locations. Are you seriously trying to tell us that his first outing in formula ford, which is a UK racing series, was even filmed in the UK. Disappointed doesn’t come close. We live 2 miles from lotus factory. And we know he lived close by! Did you do any filming here?? Location would have been everything and made it more real!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h3rk48/senna_netflix/"
    },
    {
        "id": "1h2q8ge",
        "author": "life_lagom",
        "title": "Anyone else re watch this more than once ? [Highly recommended]",
        "content": "Its Been a minute but God damn I'm rewatching and on season 2 and I forgot how good Marco Polo was. \n\nhttps://en.m.wikipedia.org/wiki/Marco_Polo_(2014_TV_series)\n\nIf you're Into historical fiction or action. This shit is fantastic. Can't belive this came out a decade ago I don't think I've fully rewatched it since it came out.",
        "upvotes": 306,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1h2q8ge/anyone_else_re_watch_this_more_than_once_highly/"
    },
    {
        "id": "1h3if5r",
        "author": "jackdempsy2345",
        "title": "Temple",
        "content": "Has anyone watched *Temple* on Netflix? I’ve heard a bit about it—Mark Strong stars as a doctor who runs an underground clinic in a subway station, treating criminals and people in need of urgent medical help. The premise sounds interesting, but the reviews seem to be a bit mixed.\n\nHow is the show overall? Does it get better as it goes on, or does it stay slow and predictable? \n\nIs it worth sticking with or does it lose steam after a few episodes? Would love to hear some thoughts from anyone who’s watched it",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h3if5r/temple/"
    },
    {
        "id": "1h3ao71",
        "author": "muskuraahat",
        "title": "recommendations for good thriller/mystery shows?",
        "content": "i have been trying to find good mystery/thriller shows on netflix to binge-watch but most of them feel so unsatisfying for some reason... i really like the mainstream ones like \"wednesday\" and \"a good girl's guide to murder\"; but the harlan coben ones and shows like \"the watcher\" don't really have the best plot conclusions :\") \n\ndo you guys have any suggestions for any good and fun to watch mystery or thriller shows? thank you so much :)",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h3ao71/recommendations_for_good_thrillermystery_shows/"
    },
    {
        "id": "1h2nmem",
        "author": "bunaventure",
        "title": "Does everyone mute their TV when navigating Netflix?",
        "content": "Surely everyone dislikes the auto-preview feature as much as me? Either I have to flip back and forth, not staying on any one item too long, or I simply mute my TV. I feel like both spoil the experience a bit and I'm shocked Netflix hasn't done anything to tone it down. I get that they have their reasons, but it's awful.\n\nIs everyone else less bothered or what? I figure it would have changed by now if everyone dislikes the auto-preview as much as me. Google TV version btw - but I'm pretty sure it's implemented on most Netflix apps..",
        "upvotes": 304,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1h2nmem/does_everyone_mute_their_tv_when_navigating/"
    },
    {
        "id": "1h37fym",
        "author": "r4lphyyy",
        "title": "TV Shows Like The Three-Body Problem",
        "content": "Hey everyone! I recently finished *The Three-Body Problem* on Netflix and absolutely loved it. The blend of science fiction, complex plots, and philosophical themes really intrigued me. Now, I’m looking for TV shows that have a similar vibe something with deep world-building, intriguing scientific concepts, and maybe some mind-bending ideas.\n\nIf you’ve seen the show, you probably know what I mean. I’m specifically looking for shows that explore big concepts, space, or even the intersection of science and philosophy (like the nature of intelligence, technology, or human existence).\n\nAny recommendations?",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h37fym/tv_shows_like_the_threebody_problem/"
    },
    {
        "id": "1h3ilkp",
        "author": "emotional_wreck99",
        "title": "CTRL",
        "content": "Ctrl freaked me out. I feel like I am being watched right now. How did you feel after watching this?\n\nI also feel they could have given some closure to the viewers and shown some ways Nella would have fought for him.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h3ilkp/ctrl/"
    },
    {
        "id": "1h34bbu",
        "author": "KakoiKagakusha",
        "title": "\"Our Little Secret\" (2024) | Movie Discussion",
        "content": "OK, I can't believe I'm saying this, but I can't tell if I enjoyed this more than \"Hot Frosty\". Either way, it still didn't scratch that rom-com itch like I was hoping. It's always nice to see Lindsay Lohan and Kristin Chenoweth, and there were parts here and there that were enjoyable, but I think this leaned a bit more toward rom-drama than rom-com. \n\nThe high-at-church bit was probably the highlight (no pun intended), but an accidentally-on-drugs scene isn't exactly breaking new ground. The dog thing just gave me anxiety (I always worry about ppl feeding my dog things he can't eat, so even her pushing the cookies near the dog made me uneasy), so no laughs for me there.  The end honesty reveals with everyone was fun for a second before it became really sad.  I guess like a lot of downers in this one between all the cheating and the mom's death, so just not exactly what I was expecting going into this kind of movie. \n\nSo yeah, at this point, I don't know if anything is going to be topping \"Nobody Wants This\" this year for my favorite rom-com.  Recommendations very much welcome! ",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h34bbu/our_little_secret_2024_movie_discussion/"
    },
    {
        "id": "1h39t07",
        "author": "indiaweekly",
        "title": "After successful run in theatres, ‘Amaran’ to stream on Netflix from December 5",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h39t07/after_successful_run_in_theatres_amaran_to_stream/"
    },
    {
        "id": "1h32yq7",
        "author": "TheSibyllineBooks",
        "title": "can someone suggest beginner horror shows for someone who doesn't do great with it?",
        "content": "I really like the trope of \"people in a world they aren't familiar with\" like The 100, Umbrella Academy, Lost, Resident Alien, etc, but I've run out of all the family friendly ones on Netflix, and there are a lot of horror movies and tv shows that are in this genre, but I can't handle horror for the life of me. Can anyone suggest some shows (or movies) that are light on the horror to get me used to the genre before I get to the heavier stuff? Also maybe some stuff in between heavy horror and light horror too. Thank you!!",
        "upvotes": 8,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1h32yq7/can_someone_suggest_beginner_horror_shows_for/"
    },
    {
        "id": "1h3tz48",
        "author": "theOtherFox490",
        "title": "DAMN IT",
        "content": "MY FAVOURITE SHOW ON NETFLIX THE BIG BANG THEORY IS LEAVING\n\nBecause I need an appropriate flair what do you think of the big bang theory leaving?\n\nThis really destroys me Because me and my mother watch it every night before I get in my bed ",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h3tz48/damn_it/"
    },
    {
        "id": "1h2mc49",
        "author": "Dependent-Internal37",
        "title": "Anyone else watched or watching The Later Daters?",
        "content": "Would love to get the community’s thoughts on The Later Daters show which just dropped on Netflix. Understand it’s a reality show, but would appreciate to hear people’s thoughts - good or bad! I’m personally smitten by their candour and as a single person in my 30s they’ve motivated me not to give up.",
        "upvotes": 85,
        "comments": 288,
        "media": null,
        "permalink": "/r/netflix/comments/1h2mc49/anyone_else_watched_or_watching_the_later_daters/"
    },
    {
        "id": "1h38gkn",
        "author": "S4v1r1enCh0r4k",
        "title": "new trailer for Norwegian disaster miniseries La Palma has been released, the series premieres on December 12",
        "content": "",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h38gkn/new_trailer_for_norwegian_disaster_miniseries_la/"
    },
    {
        "id": "1h3aa2y",
        "author": "lmarie679",
        "title": "Help me choose a new series or a movie to watch",
        "content": "I am extremely picky when it comes to choosing a new series to watch. It does not have to be a netflix original. I love histororical shows and documentaries that are HISTORICLY ACCURATE. Sarly the only documentary that I found up to standards in a way was Age of Samurai: Battle for Japan. And even this show had a LOT of cons. I do like historical satire tho like 1670. If you are making a show about a real historical person make it ACCURATE. If its a made up story , go for it. hate hero/villain movies. I dont like usless diversity and pointless romance(sex scenes). I enjoy thriller, comedy, a bit of drama doesnt hurt. I dont like Sci-fi. I love it when the movie is in the language where the story is happening. I like nature, advanture. I LOVE EPICS (Ben hur, Lawrence of Arabia) I  watch a show for the story and i frequently drop shows because they get too repetitive and generic . I dont think i have ever watched a tv series with more than 2 seasons on netflix MADE by netflix producers (especially american production team) that i have genuinely liked or finished til the end.",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1h3aa2y/help_me_choose_a_new_series_or_a_movie_to_watch/"
    }
]