[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 670,
        "comments": 5020,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nn8wrx",
        "author": "iSwaggyP",
        "title": "They are joking right?",
        "content": "This shit made me cancel. How many more subscribers do you think they are going to lose because of this? I’m officially done with this disgrace of a streaming app  ",
        "upvotes": 583,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1nn8wrx/they_are_joking_right/"
    },
    {
        "id": "1nnqorb",
        "author": "ToonAdventure",
        "title": "Solar Opposites’ Gets Surprise Streaming Release Ahead of Season 6 Debut",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnqorb/solar_opposites_gets_surprise_streaming_release/"
    },
    {
        "id": "1nndyfm",
        "author": "TransmanLSD",
        "title": "i need a show to watch where i’m not going to want to pause it",
        "content": "i need a show to binge that’s really good. i like psychological, teen drama, supernatural (vampires preferably)\ni also enjoy cop/detective shows. \nrecent ones i binged and finished:\n- The Bates motel\n- beauty in black \n- Adolescence \n- Your Honor\ni’ve also enjoyed LOST and TWD\n",
        "upvotes": 26,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1nndyfm/i_need_a_show_to_watch_where_im_not_going_to_want/"
    },
    {
        "id": "1nnlqvr",
        "author": "Aggravating-Big-6248",
        "title": "Can we talk about Billionaires' Bunker?",
        "content": "So, can we talk about *Billionaires' Bunker*? I’m kinda pissed about how it ended. I hate finales like that – they could’ve at least given us one more episode. Obviously I went straight to Google to check if season 2 is coming.\n\nI *do* love this type of show – kind of a mix between *Fallout* and *Silo*, but with a melodrama twist. Still, I’m torn. It got so over the top at times that it lost all sense of authenticity, and some of the relationships really started to bug me.\n\nAnd don’t even get me started on Guillermo Falcón and all his endless affairs… that got exhausting real fast.\n\nI don’t even know how to fully put my feelings into words yet, which is why I’m curious what you all thought.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlqvr/can_we_talk_about_billionaires_bunker/"
    },
    {
        "id": "1nnr49m",
        "author": "clarissedbvr",
        "title": "M'entends-tu saison 3",
        "content": "Je désespère de trouver la saison 3 de la série québécoise \"M'entends-tu ?\" ou \"Do you hear me ?\" en anglais. Je suis en France pour info, et sans succès sur le site Télé Québec et sur Plex... help je suis fru",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnr49m/mentendstu_saison_3/"
    },
    {
        "id": "1nmsohn",
        "author": "HushedCamel",
        "title": "Is there a way to stop shows you've already watched being suggested?",
        "content": "As the title says.  Half the suggestions are movies and tv series I've just watched - I want fresh things!\n\nALSO, is there a way to block certain genres being suggested?  I watch mostly English and Korean language shows/movies... but now I'm getting constant suggestions for Indian things which I have 0 interest in.  Is there a settings function I'm missing?",
        "upvotes": 106,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nmsohn/is_there_a_way_to_stop_shows_youve_already/"
    },
    {
        "id": "1nnlie0",
        "author": "Less-Information-463",
        "title": "Low quality movies",
        "content": "Like the title says, some movies, or shows, just have bad quality. I watched Sisu, Becoming Led zeppelin and The darkest hour, all of them have low resolution, even on the phone. But other movies have great resolution. Am I the problem or Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlie0/low_quality_movies/"
    },
    {
        "id": "1nmmpx2",
        "author": "swaggy72",
        "title": "Black Rabbit is Phenomenal",
        "content": "I cannot believe I would get that much hooked on anything. The show is absolutely amazing and everyone should go and watch it. Every freaking moment had me on edge. Can't expect anything better.\n\nDon't listen to the people saying its no good. Trust me I have wasted a lot of time on shows that I leave halfway. This one will keep you hooked for all 8 hours.",
        "upvotes": 160,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1nmmpx2/black_rabbit_is_phenomenal/"
    },
    {
        "id": "1nners8",
        "author": "GhostOfCalville",
        "title": "To anyone who’s watched at least 1 episode of the madness..",
        "content": "Is the plot of that show not quite literally panning out in the real world? I can’t help but make direct connections from the events in that show to what’s happening in the US right now. \n\nNo this isn’t some psycho post nor do i think everything is directly related… but there are similarities in the unfolding of events that you can’t help but to think about. Am i crazy? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nners8/to_anyone_whos_watched_at_least_1_episode_of_the/"
    },
    {
        "id": "1nne3af",
        "author": "RevolutionaryDraw898",
        "title": "The Starling",
        "content": "Starring Melissa McCarthy Kevin Kline and the Irish guy from Bridesmaids. If you are looking for a feel good movie to watch on Netflix. Of course it has a bit of comedy but it’s mostly a drama. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nne3af/the_starling/"
    },
    {
        "id": "1nnhck4",
        "author": "Known-Plant-3035",
        "title": "JDrama Unnatural not showing up in netflix despite nowhere saying it was taken down?",
        "content": "I am in the Asia region. I was watching the jdrama Unnatural yesterday, but checked netflix today and it was just gone? Gone from my recents, gone from the search panel, I even searched it up on google and went in from there, yet it just showed loading screen that would not load. Usually when I load a show from google when it’s been taken down, it shows the show information, but doesn’t allow me to play it. I also checked to see if anything was taken down recently and Unnatural was not one of it. Anyone knows why?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnhck4/jdrama_unnatural_not_showing_up_in_netflix/"
    },
    {
        "id": "1nnkjmm",
        "author": "ApprehensiveSock8145",
        "title": "Mais temporadas de pesca implacável",
        "content": "alguém sabe informar se a série pesca implacável foi descontinuada pela netflix?! gostei muito da série e acho uma pena não ter mais temporadas, até comentei com vários amigos e realmente sentimos falta de mais episódios.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nnkjmm/mais_temporadas_de_pesca_implacável/"
    },
    {
        "id": "1nnprlx",
        "author": "RandomFan001",
        "title": "Bypass the Netflix Household",
        "content": "Hey all\n\nWas looking online for a fix or a bypass for the “your device isn’t part of the Netflix household for this account”, found a great bypass for my phone (the offline tech) but I am looking for something like that for my tv (tcl if it matters). Tried turning the Wi-Fi off but it did not work. \n\nAny ideas to solve this?\n\nBtw - tried accessing Netflix on my phone through my actual household because I understood it should fix it on my phone but for some reason it’s still giving me the household message. Is there anything specific I should be doing? I am on the correct Wi-Fi and all that.\n\nThank you in advance!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nnprlx/bypass_the_netflix_household/"
    },
    {
        "id": "1nmqbn6",
        "author": "Sea-Possession8260",
        "title": "Is SHAMELESS that good? How is it?",
        "content": "A few months I got bored and decide to watch all the top show in Netflix, such as Better Call Saul, Breaking Bad, the Witcher, Ozark and decide to watch Shameless next but I saw it was just bunch of families together, like slice of life show. \n\nIs there any action? I mean if its not, then its fine for me as long its good. ",
        "upvotes": 30,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1nmqbn6/is_shameless_that_good_how_is_it/"
    },
    {
        "id": "1nmu8j0",
        "author": "Main-Doughnut6222",
        "title": "Kingdom: a masterclass in political intrigue and human greed",
        "content": "I’d been sitting on Kingdom for a while and honestly regret not watching it sooner. I went in expecting a typical zombie drama with mindless gore, but wow this was something else entirely.\n\nIt felt like Game of Thrones collided with the zombieverse: the political intrigue, the scheming, the betrayals… all of it was just as gripping as the horror itself. What really struck me was how the show captured the pettiness and cruelty of human nature how people would rather cling to the throne and their power than save actual lives. That layer made the story so much more haunting than just the undead.\n\nAnd the acting? Absolutely top notch. Every performance carried so much weight that I found myself invested in every character’s fate, even the ones I hated.\n\nIf you’ve been putting this one off like I did, don’t. It’s a masterpiece.",
        "upvotes": 14,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nmu8j0/kingdom_a_masterclass_in_political_intrigue_and/"
    },
    {
        "id": "1nmfcbz",
        "author": "Sudden_Pop_2279",
        "title": "'Kpop Demon Hunters' first Netflix film to pass 300 million views",
        "content": "",
        "upvotes": 181,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nmfcbz/kpop_demon_hunters_first_netflix_film_to_pass_300/"
    },
    {
        "id": "1nmrvhb",
        "author": "Moonlitmindset",
        "title": "Haunted Hotel is FANTASTIC",
        "content": "(SUBTLE SPOILERS AHEAD) \n\nThe writers, actors, show runners, animators, and everyone who’s worked on this show should be SO PROUD! \n\nI love animation and for a long time now nothing new has felt like it “hit the mark” and this show just nailed it. \n\nThe pacing is fantastic, the humor is quirky and unique, the characters have strong individual identities and relationships, the world building is GREAT with so much potential to explore, and the animation is really crisp while still providing lots of fun details in the hotel. \n\nBut I think the thing that I truly appreciate is the balance of light humor with serious topics. They deftly explore the difficult emotions these characters feel with both humor and genuine honesty. From things like self acceptance (Ben) and fear of dating again (Catherine) to the much more serious undertones of missing a parental figure and wanting to have friends (Ester), and family trauma/relationship dynamics (Nathan and Catherine). The characters feel very truthful, their flaws explored with their good intentions and love for each-other ultimately coming through. \n\nThey touch on these topics while still providing room to develop them, leaving the audience not only excited for more world development but also excited to explore these characters on a deeper level. You can feel the passion from the creators in each episode. \n\nI’m so impressed and excited for this show and really hope Netflix invests in it properly. If they do it could absolutely be a classic! I certainly already have it on my rewatch roster and this season alone is one I know will be watched over and over again :) \n\nThank you to everyone who created and worked on this show for giving us such a gem! ",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nmrvhb/haunted_hotel_is_fantastic/"
    },
    {
        "id": "1nnlj0d",
        "author": "Reddit_Connoisseur_0",
        "title": "I am subscribed 4 streaming services and they are ALL biting me in the ass except for Crunchyroll. Now canceling all of them.",
        "content": "It's amazing how there isn't one single decent streaming service left. I just traveled to another continent and Netflix didn't let me watch content there for more than a couple days because my address was incompatible. On the other hand Amazon gives tons of ads and doesn't let me watch even half of their catalogue because everything is locked behind micro-subscriptions. Same applies to Disney.\n\nThe only streaming service that just kinda works is Crunchyroll, which I'll be keeping.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nnlj0d/i_am_subscribed_4_streaming_services_and_they_are/"
    },
    {
        "id": "1nmz7sc",
        "author": "SnooPies7319",
        "title": "Plot hole Billionaires‘ Bunker?",
        "content": "I’ve been watching this new series and I have been wondering if there’s a big plot hole. The orange team is planning out the ‚Lola club‘ thing for Guillermo’s investor (the one who is in Bangkok, sry I don’t remember the name) and they are in the office where they plan the night out for him beforehand. So it’s before the bunker scenario. But how could they plan this beforehand when the guy was on the phone after they entered the bunker and they didn’t seem to know him or they had to make plans how to deceive him, get the safe code quickly and so on…\nOr did I miss anything? ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nmz7sc/plot_hole_billionaires_bunker/"
    },
    {
        "id": "1nnbr6q",
        "author": "TheTwoGirls2",
        "title": "Missing Netflix Movie",
        "content": "There was a boy with short brown hair being the main character. I am fairly sure there was this longer haired blue-teal animated or anime character that was a girl. As well as possibly another girl. It was listed anime on Netflix, but it looked more like a videogame style art. I believe this movie was PG. If anyone could help me find this movie, it would be greatly appreciated since I'm failing to recall anything else about this. If not, I thank you for reading, trying to recall, or finding this for me. 💜💛",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nnbr6q/missing_netflix_movie/"
    },
    {
        "id": "1nmakbb",
        "author": "StopPlayingRoney",
        "title": "Black Rabbit is not good.",
        "content": "I miss the old days streaming. There was a time when Netflix was THE place to be for creative filmmakers  and experimental ideas. Now it seems like every new show that comes out is a remake of the last hit show. Netflix has become YouTube. \n\nBlack Rabbit is the latest Jason Bateman Netflix vehicle. Like Ozark, Jason Bateman directed a few episodes of Black Rabbit and even Laura Linney came back to helm an episode. The new series mostly looks great even if the Dolby Vision presentation is too dark at times. The writing however is abysmal. The writer Zach Baylin, wrote Will Smith’s Oscar winner King Richard and The Crow. \n\nBlack Rabbit is the story of two brothers. Jude Law’s character Jake operates a popular NYC restaurant while Jason Bateman portrays Vince, an addict that has a penchant for trouble. Vince is barely scraping by in Reno, NV when things take a horrible turn. Desperate, he calls his brother Jake for help and he secures a ticket to New York. We soon find out this is a habit for the brothers. Things take a turn for the worse when it’s revealed that Vince has an outstanding debt with a local mobster. \n\nOh and I forgot to mention, the show starts with the climax. You know, because there has to be a hook to grab the viewer. I guess competent plotting wasn’t an option here. \n\nOkay, here’s the problem. The characters make the most illogical choices over and over again. Just when you think they’ve got everything under control some new contrivance shows up out of nowhere and the characters make the wrong call yet again as if they do not know how to operate in their own world. Vince is a menace. A tornado destroying everything and everyone in his path, and not only does he take zero responsibility for his actions, but he blames it on the people trying to help him. Most of the characters are unlikable. Much like Ozark but this show is somehow more miserable. \n\nUnfortunately this show feels like a watered down version of Ozark which in itself was a flimsy knockoff of Breaking Bad. It even features the same style of title cards. I feel like I just watched this show. Successful family, seedy underbelly, and a secret. Last time it was called The Waterfront. Or Bloodline 10 years ago. Wait, has Netflix been doing this the entire time?",
        "upvotes": 206,
        "comments": 337,
        "media": null,
        "permalink": "/r/netflix/comments/1nmakbb/black_rabbit_is_not_good/"
    },
    {
        "id": "1nmos2r",
        "author": "Majestic-Day-5024",
        "title": "death of cinema",
        "content": "the cinema was always one of the greatest forms of entertainment, going with friends or family, to see a film everyone had been waiting for months, it was a real communal outing, sharing the room with dozens of strangers but having the same love for the film of choice.\n\nI remember in years gone by, the ending to the bourne ultimatum in 2007 when bourne starts swimming after it looked like he was killed in action, &amp; the whole cinema starting clapping &amp; cheering in unison. Goosebumps. \n\nor when I saw bruno in 2009 the whole place erupting with laughter for the whole film, i'll always remember how I felt in that moment, it really was a magical experience all of which has now firmly become a thing of the past with the introduction of streaming services like netflix &amp; what not. \n\nIt really is a shame how the cinema died off &amp; I miss it greatly. It brought loads of us together as one. ",
        "upvotes": 15,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1nmos2r/death_of_cinema/"
    },
    {
        "id": "1nn3ovm",
        "author": "gigapowersnk",
        "title": "Netflix and Chills art",
        "content": " I really like the new artwork on the Netflix and Chills hub. Does anyone know a source or a way to make high quality desktop wallpaper of it? The banner is animated but I just want the image regardless.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nn3ovm/netflix_and_chills_art/"
    },
    {
        "id": "1nm8fle",
        "author": "Trouserpants2011",
        "title": "Netflix screwed up my order in the worst way possible",
        "content": "Went from excited to owner of an unwearable hat. Quality control issue or is Netflix just…? Like who do I even talk to about this lol this has to be a mistake. A mistake which makes my hat unwearable ahead of my vacation trip yay ",
        "upvotes": 157,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zvft8reeodqf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nm8fle/netflix_screwed_up_my_order_in_the_worst_way/"
    },
    {
        "id": "1nn5xr3",
        "author": "grouchdown",
        "title": "Same day with Someone discussion",
        "content": "The movie called “same day with someone” is so bad it’s funny. 😂 it’s like final destination groundhog day mixed with a cheesy romance movie, exaggerated acting to finish it off. \n\nHas anyone else watched this movie? I didn’t see any discussion and wanted to see if anyone enjoyed it as much as I did. (Granted I watched this with English dubbing but also tried parts in Thai. It didn’t change the ridiculousness.) It reminds me of a WEBTOON that was made into a drama, I’d actually enjoy the WEBTOON a lot as well. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nn5xr3/same_day_with_someone_discussion/"
    },
    {
        "id": "1nn067b",
        "author": "Effective_Sky8567",
        "title": "Black Rabbit",
        "content": "Does anyone find it a lil bit sad to watch? Is it a coincidence that we have a US and UK brothers here? I am currently at ep5 where they're in their mom house and looking at old stuffs. I couldn't wrap my mind around the fact that the house seems to be in good shape, in a great neighborhood but it doesn't seem to be enough for them that they have to break things and move fast. It's sad and surreal at the same time with what's going on with the world. I don't find entertaining but a bit depressing to watch. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nn067b/black_rabbit/"
    },
    {
        "id": "1nmk3l4",
        "author": "nouvelle_tete",
        "title": "Any one have recommendations about tv series/ movies involving food?",
        "content": "I am currently watching *Bon Appétit your Majesty* and remembered that I really like movies/stories involving food. I've also enjoyed *The Cook of Castamar,* *Midnight Diner:Tokyo Series*, *Eat, Drink, Man Woman, Chef's Table* (all of them), *The Hundred-Foot Journey*. Can be animated , a documentary but can't be a contest or as anxiety inducing as *The Bear.* ",
        "upvotes": 19,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1nmk3l4/any_one_have_recommendations_about_tv_series/"
    },
    {
        "id": "1nn35mn",
        "author": "Jfr91",
        "title": "Netflix - BlackRabbit - Ho sentito bene?",
        "content": "Sto vedendo Black Rabbit su Netflix, puntata 5, minuto 33 inoltrato, ENG sub ITA. Dopo aver scoperto che la fidanzata lo tradisce, un tipo dice “fuc*ing god”. Che io sappia è una bestemmia in inglese (a differenza di “oh my fuc*ing god” che invece è una sorta di intercalare). Il mio dubbio è rafforzato dal fatto che c’è anche un errore di post-produzione: si vede palesemente che c’è un fermo immagine e poi hanno riattaccato la scena. Come se avessero provato a coprire o a tagliare. Inoltre la frase non è sottotitolata :D Sto flashando io? È andata in tilt la mia tv? Devo rivedere le mie basi di bestemmia inglese?",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mqrvong8ykqf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nn35mn/netflix_blackrabbit_ho_sentito_bene/"
    },
    {
        "id": "1nmvoag",
        "author": "Coff33Monkee",
        "title": "Subtitle accuracy",
        "content": "Is there a way to set the subtitles to English UK? I’m currently watching Billionaires Bunker and the subtitles for the most part are fine but the metric measurements keep getting translated to imperial. \n\nI understand a bit of Spanish so I’m only half relying on the subtitles but it’s annoying when they say things like the water is 38°c and the subtitles say it’s 100, or the distances being in feet instead of meters. \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nmvoag/subtitle_accuracy/"
    },
    {
        "id": "1nn73vn",
        "author": "Automatic-Hearing515",
        "title": "Netflix careers/application process",
        "content": "Hello:\n\nI recently (about a week ago) submitted an application for a job at Netflix through the portal on their website.  I received a confirmation email about my application. However, there was no account creation/login involved.  \n\nI later realized that Netflix uses Workday and proceeded to find their Workday page and create an account (with the same email as above), thinking I could track my status.  However my application does not appear on my Workday Netflix account. \n\n  \nCan someone offer any insight?  Did my application actually get submitted then?\n\n  \nThanks!\n\n  \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nn73vn/netflix_careersapplication_process/"
    }
]