[
    {
        "id": "1p5e4zn",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 6,
        "comments": 399,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5e4zn/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p4zs10",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Elche vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p4zs10)",
        "upvotes": 158,
        "comments": 485,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p4zs10/postmatch_thread_elche_vs_real_madrid/"
    },
    {
        "id": "1p5i9ss",
        "author": "cyrusmancub",
        "title": "Vini Jr. has informed Florentino Perez that he does not intend to renew his contract while his relationship with Xabi Alonso remains strained. Talks over an extension are now stalled",
        "content": "Vinicius Junior informed Real Madrid president Florentino Perez that he does not intend to renew while his relationship with Xabi Alonso remains strained\n➕Talks over an extension are stalled",
        "upvotes": 401,
        "comments": 337,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5i9ss/vini_jr_has_informed_florentino_perez_that_he/"
    },
    {
        "id": "1p5fwu9",
        "author": "tfou79",
        "title": "Rodrygo: 0 Goals in 29 Matches — Mariano: 0 Goals in 30 Matches",
        "content": "",
        "upvotes": 286,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sjewui36973g1.jpeg?auto=webp&amp;s=1e073857885c7eb5c29d9ae379e02efcfd800e70"
        },
        "permalink": "/r/realmadrid/comments/1p5fwu9/rodrygo_0_goals_in_29_matches_mariano_0_goals_in/"
    },
    {
        "id": "1p5kbt6",
        "author": "Bald-Eagle619",
        "title": "[Mario Cortegana] Vinicius Junior currently earns €18M a year after tax with Real Madrid. The club offered Vini an increase in salary at around €20M net, but Vini said no. The club told Vini to make a counter-offer, and he demanded the biggest contract in club history, similar to Cristiano Ronaldo.",
        "content": "Vinicius Jr signed fresh terms at Madrid in 2022, the details of which were announced a year later. He currently earns around €18million (£15.8m; $20.7m) a year after tax and his contract contains a €1billion release clause.\n\nIn 2024, a delegation working on behalf of Saudi Arabia’s Public Investment Fund (PIF) was keen to explore a move for him to join a Saudi Pro League club. It would have involved lucrative personal terms, but did not develop into anything concrete.\n\nEarlier this year, Madrid made Vinicius Jr a renewal offer, including an increase in salary to around €20million net a year. When this was not accepted, the club asked the player’s side to propose a figure.\n\nVinicius Jr’s representatives requested a historic contract, in the region of the highest ever at the club (which was given to Cristiano Ronaldo), with a package of up to €30million per season. This included base salary, performance bonuses and a renewal bonus, something which has not been offered to players at Real Madrid previously.",
        "upvotes": 124,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8LqdgxsCySotoqdbJLjQI7S-1m5hqy9ZE1_au-r2SS0.jpeg?auto=webp&amp;s=efcb925e258267c049055a19b1977ef92bcbc8fd"
        },
        "permalink": "/r/realmadrid/comments/1p5kbt6/mario_cortegana_vinicius_junior_currently_earns/"
    },
    {
        "id": "1p5hx0n",
        "author": "More-Judgment-9253",
        "title": "Look at this second goal",
        "content": "First of all, Asencio was having a great game and then he did this madness sadly, so that was mainly his fault, also huijsen really didn't help him out. Second, seeing valverde out of all people decide to jog back and then eventually just stop moving is shocking. For example, if this was Barca, at least one of their midfielders would have been fighting for their lives getting back to help the defense, yet our captain that's only been on the field for 20 minutes just stops moving. I'm not trying to put the blame on him alone, my whole point is that the lack of effort from ALL of these players except for Guler, Jude, Asencio ( yes he gave them that 2nd goal but before that he was one of the only players that looked like he actually cared), and Gonzalo of course. This is another benefit of having academy players btw, because they fight like their lives depend on it. I rather see someone from the academy on the field instead of Ceballos for example, who wanted to leave a few months ago. Anyway, hopefully we see some positive changes in the future.",
        "upvotes": 110,
        "comments": 61,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/w4miutn1n73g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p5hx0n/look_at_this_second_goal/"
    },
    {
        "id": "1p5iyl2",
        "author": "Waves_Rond0",
        "title": "Kylian Mbappe is enjoying the second best start to a la liga season of any Real Madrid player in the 21st century! 🔥 🐐 x 🐢⚡️",
        "content": "",
        "upvotes": 67,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/obekslnvw73g1.jpeg?auto=webp&amp;s=1039a89daaeebeab62dd8f87ad4502fc14b92b99"
        },
        "permalink": "/r/realmadrid/comments/1p5iyl2/kylian_mbappe_is_enjoying_the_second_best_start/"
    },
    {
        "id": "1p4yf70",
        "author": "OpbrBlud",
        "title": "This brings back memories",
        "content": "",
        "upvotes": 1176,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ezc7d8joq23g1.jpeg?auto=webp&amp;s=844766941790ea97255cbeaedfcf38f4c4c82c6d"
        },
        "permalink": "/r/realmadrid/comments/1p4yf70/this_brings_back_memories/"
    },
    {
        "id": "1p58xrl",
        "author": "That_Manufacturer_20",
        "title": "The Real Madrid squad right now is too imbalanced",
        "content": "We have too many players with similar profile.\nWe have 3 top Left wingers and no good right winger. \n\nWe have 2 number 10’s in Arda and Jude. They can’t be included in same lineup successfully. \n\nFede, Camavinga, Jude, Tchouameni can run around carry the ball and disrupt the play, but no one is elite level passer of the ball to control the tempo of the game.\n\nThe squad depth looks great on paper however too it’s too concentrated with similar profile players.\n",
        "upvotes": 214,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p58xrl/the_real_madrid_squad_right_now_is_too_imbalanced/"
    },
    {
        "id": "1p4yzp2",
        "author": "No-Independent2522",
        "title": "Bellingham equalizes 2-2",
        "content": "",
        "upvotes": 822,
        "comments": 92,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y1hyc21tu23g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p4yzp2/bellingham_equalizes_22/"
    },
    {
        "id": "1p4zj65",
        "author": "No-Independent2522",
        "title": "I just cannot anymore 😭",
        "content": "",
        "upvotes": 531,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3owca8dsy23g1.jpeg?auto=webp&amp;s=229bba6f51cf418cc262278eacc71f5afe7964af"
        },
        "permalink": "/r/realmadrid/comments/1p4zj65/i_just_cannot_anymore/"
    },
    {
        "id": "1p55jhc",
        "author": "Short_Mousse_6812",
        "title": "The answer to the team is a proper 9",
        "content": "   I think at this point it has to be obvious that Mbappe is not a striker. So many people are so sure that Mbappe can play striker well and just has to learn. However, I think after so much, it is obvious he is not built for that. If you look at his way of playing, always shifts to the laterals of the pitch and plays deeper. If anything, he is more of a false 9, but without the playmaking qualities. I will keep saying it, we are wasting Mbappe by forcing him to play striker. Anyone who claims that he scores, yes he does, because he is Mbappe. Put him anywhere and he will deliver because he is world class, but that is not his best position for him or the team. The amount of times I see a beautiful play just for no one to be in the box is insane. For some reason Mbappe avoids the box as much as possible. I do not know how you would arrange the players after, but I would try Mbappe on the wing for at least one match. If you want to try stuff so much, then play your young prospects who are both strikers! Try playing Gonzalo on less important matches, play Mbappe on the wing for a couple matches, put Endrick, etc. I don’t understand this fixedness on keeping Mbappe as a number nine. When we played the CWC we were doing pretty well because we had a proper 9. Unless we get one, we will keep doing bad. ",
        "upvotes": 151,
        "comments": 125,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p55jhc/the_answer_to_the_team_is_a_proper_9/"
    },
    {
        "id": "1p59c93",
        "author": "PlantComprehensive77",
        "title": "What happened to the diversity of our goalscoring?",
        "content": "Someone recently posted a graphic on this sub, which showed 5 players in the 23/24 season had 10+ goals (Jude, Vini, Rodrygo, Joselu, and motherfucking Brahim Diaz). \n\nLet's look at how our current attack is faring in the league as we near the end of the first half of the season: \n\n\\- Mbappe: 13 goals (hip hip hooray for the Mbappe fanboys)\n\n\\- Vini: 5 goals (surprised to see him in 2nd place given his inconsistent form)\n\n\\- Guler: 3 goals\n\n\\- Jude: 2 goals (lol, how the fuck is Jude 4th on the list when he pretty much just came back from surgery). \n\nThree other players have 1 goal each, and literally everyone else has a big fat ZERO, including Valverde, Camavinga, and Rodrygo. This begs the question: how the fuck did we go from being a well-balanced attack with 5 players bagging 10+ goals to basically Mbappe FC? Losing Kroos was a big blow, but there's no way one player's departure can lead to such a drastic difference in the attack. \n\nIt also raises another question, why the fuck can't our midfield and defense help out the attack? I'm not expecting prime Ramos numbers, but fuck me, this is dismal. \n\n",
        "upvotes": 67,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p59c93/what_happened_to_the_diversity_of_our_goalscoring/"
    },
    {
        "id": "1p4zv6w",
        "author": "Apprehensive-Use8930",
        "title": "papa perez, i have ideas",
        "content": "",
        "upvotes": 232,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hoi4h4q7133g1.jpeg?auto=webp&amp;s=5e9be3f7e26e7118a3692020cebe3f4f72bccb60"
        },
        "permalink": "/r/realmadrid/comments/1p4zv6w/papa_perez_i_have_ideas/"
    },
    {
        "id": "1p4pbvn",
        "author": "Ineedhelpistaken",
        "title": "Last time we had Kroos",
        "content": "",
        "upvotes": 716,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pyo3g836y03g1.jpeg?auto=webp&amp;s=c33cdb820464b820194466e5ef3753c7a75eca78"
        },
        "permalink": "/r/realmadrid/comments/1p4pbvn/last_time_we_had_kroos/"
    },
    {
        "id": "1p5jyk0",
        "author": "Ineedhelpistaken",
        "title": "What Real Madrid actually needs after the Elche draw",
        "content": "After watching the 2–2 draw vs Elche, it’s pretty clear what Real Madrid is missing right now. The squad is elite, the talent is there, but the team looks disorganized and blunt in attack. Here are the three things Madrid actually needs:\n\n**1. A real striker**  \nMbappé is world-class, but he is not a pure 9. Every time he plays centrally, the team loses width and unpredictability. He’s at his best when he starts wide on the left and attacks space. Madrid need a striker who stays in the box, finishes chances, and gives the team a reference point for crosses like Trents. Someone who can turn all those half-chances into goals.\n\n**2. Tactical stability**  \nXabi Alonso is experimenting way too much every game. It’s making the team lose structure. Madrid needs a consistent system, a fixed midfield anchor, and a front line that actually fits together. When the team has stability, the quality improves a lot.\n\n**3. Focus and intensity**  \nConceding twice vs Elche came from switching off and losing duels. Madrid have now gone three games without a win, not because they’re worse, but because the players couldn't care less. They need better concentration, and a sharper mentality which would fix half the problems.",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5jyk0/what_real_madrid_actually_needs_after_the_elche/"
    },
    {
        "id": "1p4lnbq",
        "author": "Kick1O1",
        "title": "Florentino Pérez on Negreira case: \"It's NOT normal for Barcelona to pay the vice-president of the referees more than €8m over 17 years, whatever the reason.”",
        "content": "Florentino Pérez on Negreira case: \"It's NOT normal for Barcelona to pay the vice-president of the referees more than €8m over 17 years, whatever the reason. It coincides, coincidentally, with Barcelona's best sporting period...\"\n\nFlorentino Pérez on Villarreal vs Barcelona in Miami: “It's not normal for the president of La Liga to promote a match outside of Spain. Even Frenkie de Jong doesn't think it's normal. It’s not normal La Liga support Barcelona and Villarreal, receiving extra financial incentives for playing in Miami.”\n\nFlorentino Pérez on CVC deal: “The agreement with CVC has made many clubs realize that losing part of their revenue for 50 years will jeopardize their future. Barcelona also opposed it… but coincidentally, they dropped the case when La Liga allowed them to register players.”\n",
        "upvotes": 534,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p4lnbq/florentino_pérez_on_negreira_case_its_not_normal/"
    },
    {
        "id": "1p4uups",
        "author": "scoreboard-app",
        "title": "Match Thread: Elche CF vs Real Madrid Live Score | LaLiga 25/26 | Nov 23, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p4uups)",
        "upvotes": 119,
        "comments": 4825,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p4uups/match_thread_elche_cf_vs_real_madrid_live_score/"
    },
    {
        "id": "1p4ucmi",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Elche",
        "content": "",
        "upvotes": 110,
        "comments": 115,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p4ucmi/our_starting_𝗫𝗜_elche/"
    },
    {
        "id": "1p4m1qg",
        "author": "Key_Researcher_5985",
        "title": "Family fc at it again",
        "content": "",
        "upvotes": 311,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fhtku5xw703g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p4m1qg/family_fc_at_it_again/"
    },
    {
        "id": "1p4pu8s",
        "author": "Glad-Ad5911",
        "title": "To all the Indian supporters of Real Madrid ( This video is from July ) #SayNoToRacism",
        "content": "",
        "upvotes": 162,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3ozt16dt113g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p4pu8s/to_all_the_indian_supporters_of_real_madrid_this/"
    },
    {
        "id": "1p4h0vh",
        "author": "Loud_Power_8197",
        "title": "Something I just realised about this picture",
        "content": "When Benzema arrived in Madrid, he said he feels honoured to play in a club where two of his biggest idols i.e R9 and Zidane have played before.\nAnd on his crowning day R9 was clapping for him from his seat as Zidane presented him the Ballondor.\n\nI mean, wow , what a story we have witnessed in this club.",
        "upvotes": 614,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wrpee8sspy2g1.jpeg?auto=webp&amp;s=0bdd873a20ceaa77f117bcb6a03d13b566ecb4ca"
        },
        "permalink": "/r/realmadrid/comments/1p4h0vh/something_i_just_realised_about_this_picture/"
    },
    {
        "id": "1p4kdy4",
        "author": "Any-Midnight9847",
        "title": "Is Angelo Stiller Destined to Be Madrid’s Next German Maestro?",
        "content": "Real Madrid have set their sights on Stuttgart midfielder Angelo Stiller as they plan the next phase of their midfield rebuild. The twenty four year old is seen as one of the most promising deep-lying playmakers in Europe, and reports say they will make a move next summer.",
        "upvotes": 96,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KTP7u18Abu4ocehWPKP0VB-SgZ1eoWAjV1QlgyqtDpQ.jpeg?auto=webp&amp;s=83b5a10af04e2cdf5b8b6a86dd0093b953861157"
        },
        "permalink": "/r/realmadrid/comments/1p4kdy4/is_angelo_stiller_destined_to_be_madrids_next/"
    },
    {
        "id": "1p4rnzk",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 3 - 0 Eibar | Weir 2', 47', Rocio 83' | Win before the international break in Weir's 100th game with Real Madrid (53 goals and 33 assists, both most in club's history) | Liga F Match Day 12",
        "content": "",
        "upvotes": 37,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g5hspfrre13g1.jpeg?auto=webp&amp;s=6d71a2312c1d0439656401267f797502370ee61d"
        },
        "permalink": "/r/realmadrid/comments/1p4rnzk/fem_real_madrid_3_0_eibar_weir_2_47_rocio_83_win/"
    },
    {
        "id": "1p550wz",
        "author": "Nakul03",
        "title": "Current injuries list 😔",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p550wz/current_injuries_list/"
    },
    {
        "id": "1p4ijpn",
        "author": "FlyingWaterMen",
        "title": "LIVE STREAM: Real Madrid General Assembly 2025/26 - Florentino Perez will address the socios about the new ownership structure of club that will decide our future forever.",
        "content": "",
        "upvotes": 60,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4HME4xj8DPkoCjrBA6RPTDUbx3uXTEuucJ44MsSSHFE.jpeg?auto=webp&amp;s=4ee92f49794109842e84d75a109db6d91065b0d9"
        },
        "permalink": "/r/realmadrid/comments/1p4ijpn/live_stream_real_madrid_general_assembly_202526/"
    },
    {
        "id": "1p4qoct",
        "author": "ManuMora98",
        "title": "Real Madrid W [2] - 0 Eibar W | Caroline Weir 47' Great goal",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SG2Lon4eR-deyolcAi2Sb8Js5E2R35b5E88wC6XwIA8.jpeg?auto=webp&amp;s=4561d9acab85fac47cbee86c9fbbdcc4a95640c6"
        },
        "permalink": "/r/realmadrid/comments/1p4qoct/real_madrid_w_2_0_eibar_w_caroline_weir_47_great/"
    },
    {
        "id": "1p4nm60",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Eibar (home) | Liga F Match Day 12",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jh6mqokzk03g1.jpeg?auto=webp&amp;s=185f21d198dcbe07db606deffc94ae75527a0fff"
        },
        "permalink": "/r/realmadrid/comments/1p4nm60/fem_our_starting_xi_against_eibar_home_liga_f/"
    },
    {
        "id": "1p41jmg",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: Elche vs Real Madrid, La Liga Game 13",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p41jmg)",
        "upvotes": 86,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p41jmg/pre_match_thread_elche_vs_real_madrid_la_liga/"
    },
    {
        "id": "1p4p5ff",
        "author": "ManuMora98",
        "title": "Real Madrid W [1] - 0 Eibar W | Caroline Weir 2' (Athenea assist)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Nw6IcXH6B-nm7TSywlJzWlZok8eGj5xidInRjFWJ6HY.jpeg?auto=webp&amp;s=7dca9c695333c73eb4a01ae596f1c4251b23856e"
        },
        "permalink": "/r/realmadrid/comments/1p4p5ff/real_madrid_w_1_0_eibar_w_caroline_weir_2_athenea/"
    }
]