[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 75,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1low3ws",
        "author": "isa_bru",
        "title": "I have to confirm I live at my house everytime I want to use netflix",
        "content": "So, I still live with my parents, and my mother pays for this netflix account. Sometimes when I'm bored at my boyfriend's house, I log in to netflix in his computer and watch my favorite series, my boyfriend doesn't even use the account, as he says there is nothing good on netflix. Theres no illegal account sharing, I live at my house. Like, bro, I get it they really needed to save those few bucks they lost from people sharing accounts, but now every time i access netflix, whether at home or not, I have to call my mother to get that stupid confirmation code to confirm I actually live at my house.\nThat's ridiculous, we pay such a high price for a service we supposedly can use at any time, anywhere, but as soon as someone decides to watch netflix away from home they will annoy you into leaving the platform and getting a membership from one of their competitors. ",
        "upvotes": 45,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1low3ws/i_have_to_confirm_i_live_at_my_house_everytime_i/"
    },
    {
        "id": "1loy3xm",
        "author": "feather-stone2353",
        "title": "Trainwreck: The cult of American Apparel",
        "content": "I am shocked at the level of abuse in this! How people were able to put up with that level of disrespect and emotional abuse is astonishing. This is the blueprint of a toxic work environment. I'm only 30 mins into the documentary and I'm beyond disgusted with Dov Charney...sleazy and shady. Why is it always the same type of men exploiting young people and popular culture.  ",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1loy3xm/trainwreck_the_cult_of_american_apparel/"
    },
    {
        "id": "1lox6gp",
        "author": "Artistic_Spinach_589",
        "title": "What is your favorite official Netflix TV show character?",
        "content": "BTW it is also okay if you put a kids character (like Gabby's Dollhouse) Also, make fanart of the character, but if you don't want to, that is okay, just put a picture of the character",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lox6gp/what_is_your_favorite_official_netflix_tv_show/"
    },
    {
        "id": "1lotwqq",
        "author": "Historical-Phrase106",
        "title": "Dept Q",
        "content": "I’m absolutely loving Dept Q… \nWhat are your thoughts on this series?  I am rewatching it because I feel like I missed a lot of important parts the first time around… I know Matthew Goode’s character Carl gets a bad rap, but I feel like his cockiness and sarcasm makes the show.. ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lotwqq/dept_q/"
    },
    {
        "id": "1lp60ch",
        "author": "Dangerous-Abrocoma-5",
        "title": "Why do some keep looking &lt;Kpop Demon Hunters&gt; from an orientalism perspective based on Japan or China?",
        "content": "You all know that the film is basically centered around Korean directors and Korean artists. In X(Twitter) or Instagram, The artists are explaining what Korean cultural context such as actual places, weapons, and patterns, accessories are appear in the movie, with their concept art.\n\nEven art director even instructed Zoey's Shinkal to \"never look like Kunai or Shuriken\".\n\nSo why do many posts try to project images of Japan or China when analyzing images, motifs, stories, etc. of this movie?\n\nFor example, there are tons of korean traditional demons which is still not used in this series. Jeoseung Saja is not the only ghost in korea. If you can understand English, you can search Jihaguk Daejeok, Imugi, Dueokshini, Dokkaebi, Gumiho, Geuseunsae, Gangcheori, etc in google. But why some of [this subreddit ](https://www.reddit.com/r/KpopDemonhunters/)think \"[Shuten Doji](https://www.reddit.com/r/KpopDemonhunters/comments/1lnz7mk/comment/n0qn3my/?context=3)\" must be seen in next movie? They think japanese Yokai is fit for mugyo movie?  \nFrankly, I don't understand. No one wants Chinese monsters like Jiangshi to come out in \"Kimetsu no Yaiba\" or \"Inuyasha,\" because it's set in a Japanese legend, and there are plenty of monsters that can bring the country's own cultural atmosphere.  Do you they Korean myths and traditional culture alone can't make a series?\n\nAnd why some think Rumi is Japanese name and her father is japanese demon? If you can read hangul, in the tombstone, Rumi's mother's name is writtern 류미영(Ryu Mi-Young). Rumi's singer name is from her mother's.\n\nAnd some of them confuses Zoey's Shin-kal as kunai, and Mira's Gokdo as guandao, [they say they are japanese and chinese. ](https://www.reddit.com/r/KpopDemonhunters/comments/1llfsup/theory_mira_and_zoey_are_chinese_and_japanese/)\n\nKoreans have hated that in past decades, Korea in Western media depicted as strange Chimera combining chinese music, jinbaori, katana, kung fu, geisha and dragon boat, etc. It is the first foreign film to portray Korean traditional culture and art as which real koreans think about themselves, not lens of Japanese or Chinese orientalism.\n\nSo, why they keep quoting Japanese folklore, Chinese Jiang-shi that do not even exist in Korean consciousness when analyzing the world, story, and meaning of this mugyo-based movie? If you are not familiar with Korean folktales or legends, shouldn't you search for them first?\n\nAlthough Jinu plays Bipa, which is influenced from Chinese Pipa, and they eat Ramyeon influenced from Instant Ramen, it doesn't mean that you can treat All of the cultural elements korean culture as same to china or japan.\n\nIn 2025, is it that hard to Google for 10 seconds to research Korean myths or customs or weapons?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lp60ch/why_do_some_keep_looking_kpop_demon_hunters_from/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 423,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lp5qeo",
        "author": "No_Debt8277",
        "title": "watch Tudum 2025?",
        "content": "I wanna watch Netflix Tudum 2025, but cant find it on Netflix anymore. Is it not available anymore? \nIf so, anyone know where I can watch it for free? (not reactions-videos)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lp5qeo/watch_tudum_2025/"
    },
    {
        "id": "1low1y6",
        "author": "Fun_Molasses5215",
        "title": "Liam Payne to be given heartbreaking tribute in Netflix series that he filmed before his passing",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1low1y6/liam_payne_to_be_given_heartbreaking_tribute_in/"
    },
    {
        "id": "1lohwhc",
        "author": "brianfagioli",
        "title": "NASA teams with Netflix to stream rocket launches and spacewalks this summer",
        "content": "NASA is bringing its live space content to Netflix this summer. From rocket launches to astronaut spacewalks, the streaming platform will now beam space directly into your living room.",
        "upvotes": 31,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lohwhc/nasa_teams_with_netflix_to_stream_rocket_launches/"
    },
    {
        "id": "1lp3urx",
        "author": "freyaxx04",
        "title": "dubbing problems",
        "content": "so basically i watch a lot of asian movies and shows, and ive never had an issue like this before however everytime i go to watch something it automatically goes onto dubbed, even though i’ve previously changed it into its original language. I thought it was just happening with one show i was watching but i came to find out it’s all of my other foreign things.\n\nalso idk if this means anything but it just started happening since ive arrived on holiday abroad.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lp3urx/dubbing_problems/"
    },
    {
        "id": "1lolza3",
        "author": "MaverickWithANeedle",
        "title": "OLD GUARD II DROPS TOMORROW !!!",
        "content": "So excited!!!!! I cannot wait for the sequel to this movie. I wonder what direction they will go with it. Is there even a trailer out for it yet? Idk haven’t actually seen it if so. Just saw it was coming, so I hit the notification button, and have patiently waited a month. Actually longer if you count from when the first movie released. Anyway just thought I’d share my excitement haha ",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lolza3/old_guard_ii_drops_tomorrow/"
    },
    {
        "id": "1lp28w4",
        "author": "vsreenivas",
        "title": "Netflix randomly ended my membership 10 days into the month",
        "content": "I have had an active Netflix subscription for the past year or so. My last payment was on 20/06 for a monthly subscription. The membership should have at least lasted till 19/07 as seen on my profile. However I am not able to use Netflix. When I try to watch something it says \"Something went wrong\". When I try to contact support, I get both options as unavailable. Any tips on how I can contact support?\n\nhttps://preview.redd.it/ernut0pvp9af1.png?width=2162&amp;format=png&amp;auto=webp&amp;s=fdc5093f0f7cc7ecd6fc131f5fdda7c99cc286d4\n\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lp28w4/netflix_randomly_ended_my_membership_10_days_into/"
    },
    {
        "id": "1lovtmg",
        "author": "helplesslyhopinggg",
        "title": "Question for squid game lovers, would you take the salesman up on his game? Where you either get slapped or win $74(usd)?",
        "content": "I’m curious to see if anyone wouldn’t take this offer up. I would in the blink of an eye. I would let someone slap me over and over in exchange for $75. And if you WOULDN’T play this game, what do you do for work? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lovtmg/question_for_squid_game_lovers_would_you_take_the/"
    },
    {
        "id": "1lou9w3",
        "author": "Electronic-Role4668",
        "title": "Would you buy this?",
        "content": "So I'm in a long distance relationship and I'm usually talking to my SO through the phone, with headphones on, in front of my computer. Sometimes I want to watch something on Netflix while I have her in the background on my phone. But if I were to play Netflix through my computer speakers, she would be able to hear and it would disrupt the call/degrade the audio connection between us.\n\nI'm an engineer and I had the idea of making a Bluetooth device that would make it such that I can connect my headphones to both my phone and my computer at the same time. \n\nThat way, she isn't able to hear the movie in the background and I'm still able to watch my Netflix. Maybe there could even be a feature where the audio from Netflix lowers when she is speaking and returns to normal after she is done speaking (audio dimming)\n\nThis all can sort of be achieved through by buying two sets of ear buds, and wearing one earbud that is connected to the phone and the other connected to the computer, but you don't get the audio dimming feature.\n\nI'm trying to understand if this a decent idea and whether there would be interest. \n\nWhat do y'all think?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lou9w3/would_you_buy_this/"
    },
    {
        "id": "1lp166c",
        "author": "Ivy1974",
        "title": "Years ago",
        "content": "In the days when Netflix started to stream after mailing DVD’s they used to have the option to select things that were in movies to remove from your account of viewing. I take it that is long gone?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lp166c/years_ago/"
    },
    {
        "id": "1lofr2h",
        "author": "x_aphrodite_0x",
        "title": "K-drama recommendations? 💕",
        "content": "I've noticed there's lots of k-dramas on netflix and I really wanna start watching some however I just don't know what to watch!! 💕\n\nI've watched true beauty and I really enjoyed it!! However, I'm looking for a more shorter series..?\n\nI don't really mind what I get recommended however I'm not a big fan of severe violence/gore!! Thank youuuu!!!",
        "upvotes": 25,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1lofr2h/kdrama_recommendations/"
    },
    {
        "id": "1los067",
        "author": "EfficiencyPrudent330",
        "title": "Shark 🦈 Whisperer",
        "content": "So profound, emotional, intriguing &amp; educational. I recommend for the whole family and I hope this show gets more people interested in preserving our great animals of the sea ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1los067/shark_whisperer/"
    },
    {
        "id": "1low1oz",
        "author": "TimesandSundayTimes",
        "title": "Meet Squid Game’s standout star, Park Gyu-young",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low1oz/meet_squid_games_standout_star_park_gyuyoung/"
    },
    {
        "id": "1loxsdt",
        "author": "Flowerofthesouth88",
        "title": "What future Trainwreck episodes you want to see them cover?",
        "content": "I did not hear of The infamous Poop Cruise and The Mayor of Mayhem until the Trainwteck series, which was interesting and bizarre. I'm looking forward to the coming episodes of The Teenager’s Birthday Party and The Balloon Boy hoax, but if they do episodes in the future, what would you like to see them covering and why?\n\nI want them to do The Glasgow Willy's Chocolate Experience, which happened in 2023, as it was bizarre seeing them £35 and some were unhappily being there. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1loxsdt/what_future_trainwreck_episodes_you_want_to_see/"
    },
    {
        "id": "1lotofe",
        "author": "Kraviken",
        "title": "Is there still no way to remove that god awfull WWE notification that keeps popping up?",
        "content": "The title says it all. I have no interest in sports. Less interested in fake sports. \n\nYet the freaking  notification keeps popping up. \n\nI have not liked it, I do not have it on my list. \nNothing that should indicate that I should get these annoying and CONSTANT notifications. \n\nIt just never ends... 😡",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lotofe/is_there_still_no_way_to_remove_that_god_awfull/"
    },
    {
        "id": "1lohhor",
        "author": "gomazoa93",
        "title": "\"This device is not part of your household\"",
        "content": "My father's Netflix account was primarily set up on our house WiFi. My sister uses his profile at her separate house, I use my profile at the house + work. My mom and Dad use the Netflix almost always at home.\n\nI went to log into work and I was given this: \"this device is not part of your household\". I was able to get a 14 temp code to allow me to use it despite not being on the family wifi. \n\nSince when did Netflix require me to be on the same wifi on which we set it up with? ",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lohhor/this_device_is_not_part_of_your_household/"
    },
    {
        "id": "1losxxl",
        "author": "ooTiramisu",
        "title": "The Magic Prank Show",
        "content": "Has anyone watched this?? It’s soo entertaining! So much time &amp; effort put into these pranks. Only 6 episodes. Hoping for a second season ✨\n\nI know a lot of people think these pranks tend to be fake buuuut idk about this one. It’s still very entertaining! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1losxxl/the_magic_prank_show/"
    },
    {
        "id": "1low9hx",
        "author": "FormalAdvertising444",
        "title": "Squid Game: What if Gi Hun (Red Team) switched teams with Hyun Ju (Blue Team)",
        "content": "I know r/squidgame  is the best subreddit to discuss squid game but the moderators there keep removing my posts there and never give me explanations why even if I tried to follow their rules. But how will the story go if that happened?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low9hx/squid_game_what_if_gi_hun_red_team_switched_teams/"
    },
    {
        "id": "1lnrhna",
        "author": "antonia71007",
        "title": "a few takes of mine from the poop cruise documentary (this has definitely been talked about before but idc)",
        "content": "first of all, the guy with the glasses and the bachelorette party were so goddamn annoying. i’m pretty sure the guy cared more about his father in law than the cruise. now i get that shitting in a bag isn’t nice, but wanna know what’s worse? walking around ankle deep in other people’s piss and shit, or shitting on top of someone else’s layered shit. they were clearly all so privileged to act like that. and then they were all disgusted when the piss and shit got everywhere. who’s fault was that? yours for not using the damn bags and continuing to use the toilets. \n\nsecondly, who thought it was a good idea to open the bar? that was really stupid, they were obviously gonna go crazy. and then they were surprised when it turned into a poop deck frat party? like what did you expect?? theyve been stuck there for 4 days.\n\nthirdly, i felt bad for the dad. he was recently divorced and just wanted to have a good time with his daughter, and that was what happened, and he felt like he had failed. at least they still go on cruises together \n\nand obviously, i was dying laughing everytime the indian chef came on screen. when he was talking about someone throwing the red bag and it hitting someone else, i was rolling\n\nthat’s it folks. thanks for coming to my ted talk",
        "upvotes": 433,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrhna/a_few_takes_of_mine_from_the_poop_cruise/"
    },
    {
        "id": "1lorm66",
        "author": "ScottShawnDeRocks",
        "title": "Squid Game 3",
        "content": "Was this written by AI or stupidity? Both?\nI'm on the 4th episode and so much insanity has gone on. A pregnancy, birth, making the baby a participant is hands down as goofy as the masked people making the rules.\nDubs for most of the cast, but scenes with English speaking actors. \n\nWhat the hell is this slop?",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lorm66/squid_game_3/"
    },
    {
        "id": "1lovc2h",
        "author": "Holiday_Sale5114",
        "title": "WWE raw ads unskippable based on device?",
        "content": "Since January, I have been watching raw on Netflix on either my PS5 or PC. Until today, both allowed for scrubbing right past ads. \n\nIt should be noted that I only watch the raw \"replay\" and never live. \n\nToday, I was able to scrub past ads on PC, but enable to do so on the Netflix app on my PS5. \n\nHas anyone else encountered this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lovc2h/wwe_raw_ads_unskippable_based_on_device/"
    },
    {
        "id": "1lov4h2",
        "author": "CurlyHairGirl01",
        "title": "netflix completely locked me out of my account",
        "content": "so i was just trying to watch netflix on my laptop then suddenly i got the your not apart of this household message while LITERALLY BEING ON THE WIFI\n\nlogged out and logged in does nothing, disconnected and re connected does nothing. contacted netflix  does nothing. i'm so sick of this netflix i get your losing a bit of money on people sharing accounts but jesus christ there are surely better ways to do this.\n\nEDIT: just spent an hour on tech support only to be told i could either sign out every single device or take this up with a high level of their support team (which would lead me to sit on hold for hours) thanks netflix beautiful customer support ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lov4h2/netflix_completely_locked_me_out_of_my_account/"
    },
    {
        "id": "1lou2o1",
        "author": "mal4frutal",
        "title": "Why does the Netflix application work so badly on cell phones?",
        "content": "I really don't understand how a multinational like Netflix can have such a bad app.\nI get disconnected all the time when I want to stream from my phone, the episodes don't play automatically, is this the case in all countries?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lou2o1/why_does_the_netflix_application_work_so_badly_on/"
    },
    {
        "id": "1loa2fb",
        "author": "ElvenQueen726",
        "title": "I'm obsessed with the tiger and magpie in Kpop Demon Hunters",
        "content": "The tiger and the magpie were easily my favourite characters in the movie, and if you’re also into art and mythology like I am, here’s a little background on their historical references.\n\nIn traditional Korean art, the white tiger and magpie often appear together in a style called [Jakhodo](https://exhibitions.asianart.org/exhibitions/jakhodo-today/#:~:text=The%20tiger%20and%20magpie%20pairing%20appears%20so%20frequently%20in%20Korean%20art%20that%20it%20comprises%20its%20own%20genre%3A%20jakhodo%2C%20paintings%20depicting%20tigers%20and%20magpies) (*jak* = magpie, *ho* = tiger, *do* = painting). These images were used as talismans to ward off evil spirits.\n\nThe tiger was intentionally given those ridiculous, bulging yellow eyes to make it look dumb. That’s why it’s traditionally nicknamed “idiot tiger” (바보호랑이), and the paintings are often called *“Idiot Tiger and Scolding Magpie.”* So, in its introduction scene when the magpie looked annoyed and judgmental that was on purpose.\n\nThis art style is part of a genre called [Kkachi Horangi](https://en.wikipedia.org/wiki/Minhwa#:~:text=Kkachi%20horangi%20(%EA%B9%8C%EC%B9%98%ED%98%B8%EB%9E%91%EC%9D%B4)%20is,structure%20of%20Joseon%27s%20feudal%20society), and it’s basically satire. The goofy-looking tiger represents authority (intentionally depicted as silly and clumsy like corrupt officials or clueless aristocrats), and the magpie is the voice of the common people, calling them out.\n\nWhen Jinu mentioned he made the hat for the tiger but the bird kept stealing it, that was a reference to a real J[oseon-era Minhwa painting that shows a tiger smoking a pipe and wearing a top hat](https://korelimited.com/blogs/korelimited/the-korean-tiger-a-hallmark-of-korean-identity#:~:text=One%20of%20the%20most%20striking%20features%20of%20art%20portraying%20the%20Korean%20tiger%20is%20the%20eyes%3B%20they%20are%20often%20bulging%20and%20painted%20a%20bright%20yellow.%20This%20is%20a%20recurring%20aspect%20of%20most%2C%20if%20not%20all%20art%20with%20the%20tiger%20as%20its%20subject), while a magpie stands nearby.\n\nThe White Tiger (Baekho in Korean) is also one of the Four Holy Beasts in Sino-Korean mythology, symbolising the West and the element of metal. It’s a powerful, protective figure with deep cultural significance.\n\nI actually did a breakdown of the movie and shared some theories about the tiger in a separate [post](https://www.reddit.com/r/movies/comments/1lmhs7a/kpop_demon_hunters_movie_analysis_theories/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) if anyone’s interested.\n\nhttps://preview.redd.it/8slwt5zaz2af1.png?width=937&amp;format=png&amp;auto=webp&amp;s=813ed2ffe493193302e9f83b02839916a0229094",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1loa2fb/im_obsessed_with_the_tiger_and_magpie_in_kpop/"
    },
    {
        "id": "1loo7f1",
        "author": "RightGuarantee1092",
        "title": "Fubar S2 New Zealand reference",
        "content": "So I watched the first episode of FUBAR (don’t judge me haha)\n\nAnyway near the beginning some guys show up start shooting and all that.\n\nArnie says “they were New Zealand smugglers from the Auckland Crew” like wtf is the Auckland crew it is a city of almost 2 million people.\n\nAs every New Zealander knows getting referenced in any tv show gets us all exited but this was bizarre and jarring to me.\n\nMy question is, is it some kind of regional thing they did for engagement, if I was watching in Ireland would does he say “Irish smugglers from the Dublin Crew” or something?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1loo7f1/fubar_s2_new_zealand_reference/"
    }
]