[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 84,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m4pyf9",
        "author": "AustinBaze",
        "title": "Stop Asking Me \"Who's Watching?\" Dammit.",
        "content": "[Please Stop Asking](https://preview.redd.it/vdi33l6te1ef1.jpg?width=890&amp;format=pjpg&amp;auto=webp&amp;s=efe046b37cc706f4349d0958c889462ec978c8f4)\n\nSingle, no kids.  There is only one Netflix profile.  There is only one subscriber. There has only ever been ONE profile and one subscriber. Ever.   \nThere has only been answer ever to this question for the 10 years or so you have been asking it.  I'm bored with it, are you Netflix?   \n",
        "upvotes": 141,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1m4pyf9/stop_asking_me_whos_watching_dammit/"
    },
    {
        "id": "1m4mze7",
        "author": "Due-Needleworker-218",
        "title": "How to stop them recommending me shows I’ve already watched..",
        "content": "I watch quite a lot of shows and movies on Netflix and they still suggest/recommend stuff to me that I previously watched like a week ago. Is there a way to stop this or maybe hide certain titles after u watched them? ",
        "upvotes": 29,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m4mze7/how_to_stop_them_recommending_me_shows_ive/"
    },
    {
        "id": "1m4r1zh",
        "author": "LilBitofSunshine99",
        "title": "Has anyone else watched Entitled?",
        "content": "Damn this show is so crazy. I don't know how else to describe it. Only 8 episodes for season 1 and they're only 30ish minutes apiece. I was hooked by the last 5 minutes of episode 1 and had to binge the rest. \n\nI'm curious about others' opinions. \n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m4r1zh/has_anyone_else_watched_entitled/"
    },
    {
        "id": "1m491ao",
        "author": "Next-Wash-7113",
        "title": "Untamed - omfg, y’all!",
        "content": "Episode one - shocking!! And it just better as it went! I’m only through episode three so no spoilers but you guys??! \nCast is AMAZING! You really feel for them and their circumstances! \nAlso!! The views and images are absolutely BREATHTAKING!! I want to go there now ",
        "upvotes": 79,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1m491ao/untamed_omfg_yall/"
    },
    {
        "id": "1m4sz8w",
        "author": "James_15625_",
        "title": "Fubar Swedish Mafia",
        "content": "Not really a spoiler but the Swedish Mafia all driving a Volvo on Fubar is like next level 😂😂😂\n\nI loved the many quirks the show has. Like Arnold’s movies being referenced. Also I think after true lies, this is yet another story of him being the ladies guy. \n\nWhat really makes you want to watch the series are his wife and daughter though. Awesome casting!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4sz8w/fubar_swedish_mafia/"
    },
    {
        "id": "1m4qze3",
        "author": "Exotic-College1042",
        "title": "Update household - no text option?",
        "content": "Has this happened to anyone? \nThis week, on the updating household page, the send text option is not longer available.\n\nThey only have a send email option. \n\nWhat's up with that? Anyone know?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4qze3/update_household_no_text_option/"
    },
    {
        "id": "1m4hs0l",
        "author": "Content-Ad-5883",
        "title": "ADAM SANDLER MOVIES",
        "content": "Is anyone here also loves Happy Madison Productions by Adam Sandler? I could bingewatch his movies all day and night. Specially the comedy one, well most of them are comedies. I have this hint that, if Rob Schneider appears... that movie would be a 10/10! Idk, I'm just proud of him because his half-Filipino. Honestly, I just watched some of his film through Netflix and Loklok. \n\nHere's the films I've watch and I will rate it based on my experience while watching (or secret crush on cast. clue: AS) Consider this as my recommendations if you love his films so much!\n\n- Grown Ups 1 &amp; 2 8/10\n- 50 First Dates 1000/10\n- Just Go With It 8/10\n- The Longest Yard 7.5/10\n- Big Daddy 9/10\n- Hotel Transylvania 1, 2, 3 &amp; 4 10000/10\n- The Cobbler 4/10\n- Punch-Drunk Love 6/10\n- The Do Over 9.5/10\n- Murder Mystery 1&amp; 2 7/10\n- Your So Not Invited To My Batmitzvah 8/10\n- Hubbie Holloween 8.9/10\n- Don't Mess with the Zohan 10000000/10\n- Happy Gilmore 1 11/10\n- Billy Madison 7.6/10\n- The Click 8.5/10\n- Blended 6/10\n- That's My Boy 100000000000/10 \n- Pixels 8.6/10\n- Anger Management 5/10\n- The Ridiculous 6 10/10\n- Sandy Wexler 5/10\n- The Week Of 1000000000000/10\n\nI'm so excited about HAPPY GILMORE 2, JULY 25TH ON NETFLIX &lt;3333333\n\nI know there's movies of him that I still don't watch, I just can't find them. Maybe y'all can send hel:p where can I watch it.",
        "upvotes": 4,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1m4hs0l/adam_sandler_movies/"
    },
    {
        "id": "1m4kdzr",
        "author": "starmaxeros",
        "title": "Winx Club: The Magic is Back is coming to Netflix on October 2",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4kdzr/winx_club_the_magic_is_back_is_coming_to_netflix/"
    },
    {
        "id": "1m4o4h7",
        "author": "ves_2727",
        "title": "5.1 sound enable in windows",
        "content": "I have an external usb 5.1 DAC , how to view supported movies and shows  in 5.1,in  browser i'm only able to see stereo option in audio settings. P.S Windows detects 5.1 ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4o4h7/51_sound_enable_in_windows/"
    },
    {
        "id": "1m4nr4y",
        "author": "dystopian_teen",
        "title": "shiny mobile app?",
        "content": "when i move my phone the poster goes shiny in different places... has anyone else noticed this as a new feature? \n\ni was wondering if maybe apple had an app running in the background that was causing the shininess like a sticker and this is nothing to do with netflix",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vonq3ccjw0ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m4nr4y/shiny_mobile_app/"
    },
    {
        "id": "1m4fwej",
        "author": "FlowCon",
        "title": "am i the only one this happens to?",
        "content": "I’ll put on a show I binged when I go to sleep - typically a small rotation of series - but it’ll get to a point where instead of playing an episode start to finish and then starting the next episode it will just run the episode plus the entirety of the credits in different languages.\n\nThen when i go to hit “watch next episode” or what have you when I come back to it, it just plays that same previous episode and does the credits thing all over again.\n\nA couple of things have temporarily fixed this but for the most part it’s been recurring for the majority of this year.\n\nhow do I fix this??\n\nalso this is happened for \nBreaking Bad / Better Call Saul / Your Honor / Squid Games / and Ozark in case anybody asks",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4fwej/am_i_the_only_one_this_happens_to/"
    },
    {
        "id": "1m47v72",
        "author": "No_Chocolate_7401",
        "title": "Help — we miss Kaos!",
        "content": "\n*and can’t come to grips that there will never be more!* What else can we watch that is similar? Anything come close? The whole vibe, the comedy, the raunch, the gods and goddesses  — we are here for it. ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m47v72/help_we_miss_kaos/"
    },
    {
        "id": "1m43sck",
        "author": "Petal_Ripple73",
        "title": "For those who’ve seen Baby Reindeer — did it change how you think about victimhood, mental health, or how messy online relationships can get?",
        "content": "I watched Baby Reindeer last week and honestly... I’m still thinking about it. I went in expecting something like your usual dark true-crime drama, but it felt way more personal and uncomfortable — in a good way, if that makes sense.\n\nIt really messed with my head a bit. The way it explores obsession, blurred boundaries, trauma, and even how we sometimes downplay our own experiences — it hit way closer to home than I expected.\n\nI’m still not even sure how I feel about certain parts. Like, who's the “real” victim here? Can you be both harmed and harmful? It just left me with way more questions than answers.\n\nDid it stick with anyone else like that? What parts hit you the hardest?",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m43sck/for_those_whove_seen_baby_reindeer_did_it_change/"
    },
    {
        "id": "1m4ct0m",
        "author": "Ok_Profit4705",
        "title": "Best rainy Saturday night movies?",
        "content": "Horror and thriller are ideal! We’re settling in for a long night/early morning marathon with all the movie snacks soon. Best movies or shows for a rainy Saturday? We love horror of any kind. Love mountain, woods, or beach settings but not picky! ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ct0m/best_rainy_saturday_night_movies/"
    },
    {
        "id": "1m4k4vn",
        "author": "Talavklo",
        "title": "Help with updating payment method.",
        "content": "**Hi everyone,**  \nI’m genuinely losing my mind over this Netflix situation. My credit card expired this month, so I went to update it with my new one. That part works fine, *great*. But then it asks me to verify my phone number by sending a confirmation code… and here’s where things go completely off the rails.\n\nFor some reason, I *cannot* change the country prefix. It’s stuck on Ecuador, even though I live in Austria and the number saved in my account is my *Austrian* number. No idea how or why Ecuador got involved here, or why I can’t switch it.\n\nObviously, I’m frustrated. I’ve tried contacting customer service, but no luck so far. My payment is due *tomorrow*, and I really don’t want to lose my subscription. I use Netflix all the time. But at this point, I honestly don’t know what else to do.\n\nHas anyone dealt with this kind of issue and managed to fix it? Any advice would be massively appreciated.\n\nThanks in advance!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4k4vn/help_with_updating_payment_method/"
    },
    {
        "id": "1m4fxpe",
        "author": "rollitodcanela_",
        "title": "when a show has a documentary what do u watch first?",
        "content": "I've been meaning to watch the new Spanish show \"Superstar\" based on the life of Tamara, an early 2000's Spanish Icon. But I saw that Netflix released a documentary on her life \"I'm Still a Superstar\" at the same time... I don't know what to watch first.\n\nThis is sort of a Netflix trend. Like the Menéndez Brothers Show and the doc coming out the same year. Or the other way around with the doc show \"This is the Zodiac Speaking\" and adding Fincher's \"Zodiac\" to the platform around a similar time. \n\nI'm curious for the doc watchers out there which way do you go?? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4fxpe/when_a_show_has_a_documentary_what_do_u_watch/"
    },
    {
        "id": "1m4ltri",
        "author": "No_Caterpillar7863",
        "title": "Account hacked ?",
        "content": "Today I got a message from Netflix on my gmail saying that another device has been signed into my account and gave a location...the message came simultaneously after I signed from device...I tried changing the password and signing out of all devices but it kept on happening...my email account has not been hacked...is it a bug or something?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ltri/account_hacked/"
    },
    {
        "id": "1m43pvr",
        "author": "Exotic-Pepper-2527",
        "title": "Tv show recommendations",
        "content": "Please give me some suggestions \nI liked :\nSons of anarchy \nPower\nBetter caul Saul \nOzark \nMosquito coast\nAnimal kingdom \n\nI like gangster/ mob family crime shows ",
        "upvotes": 7,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1m43pvr/tv_show_recommendations/"
    },
    {
        "id": "1m4pssx",
        "author": "Lazy_wolflady343",
        "title": "PLEASE TELL ME IM NOT THE ONLY ONE WHO MOTICED",
        "content": "Ok so we know at the beginning when we hear and see little Rumi sining\n\nWe are hunters voices strong\nSlaying demons with our song\nFix the world and make it right\nWhen darkness finally meets the light\n\nRight? Okay so if you listen throughout the movie when things get intense with Rumi you can hear the song playing in the background, with words and maybe without. One big scene is when Rumi goes to Celine and she has her emotional breakdown. Listen and you can hear it.\n\nPlease tell me im not the only 🙏 \n",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3v4qicyod1ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m4pssx/please_tell_me_im_not_the_only_one_who_moticed/"
    },
    {
        "id": "1m3wopt",
        "author": "StarsnIcicles",
        "title": "Who Is Erin Carter? — Apparently, a woman with no emotional intelligence and a PhD in self-sabotage",
        "content": "I’m on episode 3… or 4… honestly, I’ve stopped keeping count (or caring). I had *Who Is Erin Carter?* on my watchlist forever — thought I was signing up for a cool, badass woman spy-thriller. Instead? I got a lead character who makes *exhaustingly dumb decisions* and just endangers everyone around her.\n\nLike, what even is her plan? Is there a plan? Or is she just running on adrenaline and stubbornness?\n\nHer daughter? Clearly in shock. Clearly needs help. But Erin? Nah. Zero emotional bandwidth. No real connection shown between them. Honestly, the stepdad is the *actual* parent here — patient, worried, actually gives a damn.\n\nAnd don’t even get me started on that weird “apology” scene where the daughter threatens the kid she beat up. What was that? Who’s writing this??\n\nMaybe I’m just being pessimistic (or too emotionally attached to logic?) but I can’t see this show pulling off a satisfying “why” to justify all this chaos. I want to DNF it so badly… but my OCD says finish what you start. 🫠\n\nAnyone who’s finished it — does it get *better*, or should I just accept defeat and go rewatch *Killing Eve* or *The Night Agent* for my badass fix?\n\n\\#SendHelp  \n\\#MaybeErinNeedsTherapyNotGunfights",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m3wopt/who_is_erin_carter_apparently_a_woman_with_no/"
    },
    {
        "id": "1m3u3d7",
        "author": "Practical-Payment76",
        "title": "thoughts on “too much”?",
        "content": "I personally didn’t like it. Both the main characters were unappealing to me and I feel like their relationship wasn’t explored enough, we were never shown actually WHY they liked each other so much. \n\nFelix was okay but I couldn’t care for him. The ep about his family and SA was touching and really sad, but he had nothing else going on for him. He wasn’t particularly affectionate to Jessica, wasn’t shown to like her as a person rather then just being with her because she liked him, his relapse because of her was never even addressed, him still being friends and inappropriate with his exes was never resolved (I think there should’ve been at least one scene where Jessica confronts him and he genuinely reassures her, since she clearly had insecurities and an “other woman” issue from her past relationship). He even cheats on her, NEVER apologises, and expects Jessica to give HIM a break after HER dog died a day later…? UH??? A good looking bum overall. \n\nI was always on the brink of liking Jessica until she did anything. First of all I don’t think the actress was a good choice, her way of acting is whiny in a really annoying way and when she was crying it felt like there was something I was supposed to find funny, but there wasn’t? Her character was supposed to be weird and whimsy in an appealing and alluring way but she came off as just weird for no reason. Again I don’t understand why she liked Felix first of all, I really thought he would be her “I just moved to London and need a British guy to get over my evil ex” who she’d get over with after a bit, since she clearly didn’t love him? Like, being on your phone while watching Paddington with him, saying I love you after like two days of dating,  being clearly upset at how he still interacts with so many of his exes, leaving him alone at her boss’s house party, almost cheating on him on a work trip and never telling him, not wanting him to move in, accusing him of having no ambition? How were we supposed to be glad they get married in the end, they objectively aren’t a good couple?\nEdit: I did love her family dynamic. It was very realistic and heartwarming coming from a family like hers.\n\nDid I get the show all wrong? Why does everyone else seem to love it?",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m3u3d7/thoughts_on_too_much/"
    },
    {
        "id": "1m41nne",
        "author": "LoneRedLobster",
        "title": "What are the hot shows coming up this year?",
        "content": "Big time netflix&amp;chill person, so many good shows are coming up, but hard to keep a track of all and also in desperate need of some really good suggestions, any genre be it except cringey stuff, more of a series person I am, movies, documentary, mockumentary related to cases, spaces and more.\nEnlighten me with your picks 🌸",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m41nne/what_are_the_hot_shows_coming_up_this_year/"
    },
    {
        "id": "1m3mlsm",
        "author": "Realistic_Library309",
        "title": "Am i the only one who is happy with the squid game ending ?",
        "content": "Or its just a culture to say bad about final episodes of any series . I mean not everything have happy endings let's just admit that . And the detective part it's okay some scenes are boring so just skip that . That's all I want to say . I love the ending I love everything in that series except that detective part. ",
        "upvotes": 41,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1m3mlsm/am_i_the_only_one_who_is_happy_with_the_squid/"
    },
    {
        "id": "1m4m7zp",
        "author": "Xplanation_",
        "title": "Can’t I sue Netflix for tracking my IP address for Netflix Household?",
        "content": "I tried to sign in to Netflix in another house, but it’s not letting me because I have to verify from my other TV. I read on Reddit that Netflix locks you out of devices outside your house because it tracks the location of these devices. I didn’t consent to them tracking my devices location, so I should sue them for this, right?",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m4m7zp/cant_i_sue_netflix_for_tracking_my_ip_address_for/"
    },
    {
        "id": "1m3x56t",
        "author": "Successful-Plant-539",
        "title": "How do I access the “new and popular” section on Netflix TV",
        "content": "They redesigned the whole thing a while ago and I think they removed the “new and popular” section but I also could just be blind. Is it gone forever? Why would they remove it?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m3x56t/how_do_i_access_the_new_and_popular_section_on/"
    },
    {
        "id": "1m4g9am",
        "author": "Appropriate_Ad_4689",
        "title": "Amy Bradley - Repressed Sexuality Theory",
        "content": "I just finished watching the Amy Bradley docu. Prior to watching it, I wholly believed that she fell overboard and the family were in denial. But after watching the docu (and seeing how uncanny the similarities were in that adult escort site photo), I now think she could possibly also have been trafficked (though drowning overboard is still a possibility).\n\nHear me out - Amy was lesbian. This fact was never highlighted when I previously read about Amy prior to the docu. She was very masculine presenting and what one might term a ‘butch’. She wore masculine presenting clothes in her pictures with her friends. Her friend explained how scared she was to come out to her parents, and the disappointment the parents felt when she had told them (and how her dad wrote a 3 page letter to her then girlfriend smdh).  Her parents were obviously against her lifestyle despite saying that they ‘loved her unconditionally’. And she dealt with that unhappiness with alcohol.\n\nDespite her preference to wear masculine presenting outfits, she was literally in a DRESS with jewelry and stuff on the cruise. My conjecture is that she had tried to fit into what her parents wanted her to be (i.e. hetero) whilst she was with them on the cruise trip. And when she was approached by Yellow, she might’ve probably thought well let’s just try and see where this goes since my parents want me to be hetero. And hence it is possible that she had fed into her parents’ dream of her being hetero when she was hanging out with Yellow, and unfortunately, eventually trafficked.\n\nHer parents are still in denial about her sexuality and you can tell from the way they speak about it that they are homophobic tbh.\n\nHappy to hear thoughts on this!",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1m4g9am/amy_bradley_repressed_sexuality_theory/"
    },
    {
        "id": "1m4ff2l",
        "author": "Soil_spirit",
        "title": "Too Much: can we stop with the whining and melodrama?",
        "content": "The main character is always having a meltdown, and the actress is just not believable. I don’t think there was one episode where she’s not freaking out about something mundane. It was cute in GIRLS, because Lena Dunham’s character made sense that way, but this was just redundant. Repetitive. And this scene in particular was ridiculous— if she was truly grieving, she would have been happy that Astrid had Felix there during her final moments.  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ff2l/too_much_can_we_stop_with_the_whining_and/"
    },
    {
        "id": "1m3b6qu",
        "author": "ell_enne",
        "title": "Here's what's wrong with The Residence...",
        "content": "Don't get me wrong... I really liked the show; the potential it promised kept me hooked ...\nBut eventually with the last scene of the closing episode I can no longer deny it that l'd have loved it had it been two episodes shorter.\n\nThere are infinite twists and turns with too many (and many a times unnecessary) story arcs leading to a crescendo that feels lackluster when you look at the time spent building it all up.\n\nPhenomenal acting, sloppy writing, and lazy editing is how I'll remember this show. Will never be returning for a rewatch though.\n\nA tighter plot, sharper editing and a little Hugh Jackman in the end scene could've done magic ✨\n\n \nPs: what even was the end scene anyway?🙄",
        "upvotes": 64,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1m3b6qu/heres_whats_wrong_with_the_residence/"
    },
    {
        "id": "1m46fh2",
        "author": "rkraus10",
        "title": "Brick - I thought it was a brick of a movie",
        "content": "I watched \"Brick\" on the recommendation of my brother-in-law who said it was \"Very Very Very Good.\" I watched it and thought it was suspenseful, but lacking a lot of back story that would have made the whole thing more enhanced and suspenseful. The story matter could have been better done in a mini-series. Any remarks?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1m46fh2/brick_i_thought_it_was_a_brick_of_a_movie/"
    },
    {
        "id": "1m45q33",
        "author": "Lopsided_Soup_3667",
        "title": "Does deleting a Netflix profile delete their viewing history as well?",
        "content": "Im on my friend's  acc and i just found out he can see my viewing history from settings even tho my profile is private, if i delete my profile will my history also be deleted? Im hoping so",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m45q33/does_deleting_a_netflix_profile_delete_their/"
    }
]