[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 35,
        "comments": 615,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1hmi2o0",
        "author": "Robemilak",
        "title": "Adam Sandler Shares the First Teaser for Netflix's Sequel ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 244,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1hmi2o0/adam_sandler_shares_the_first_teaser_for_netflixs/"
    },
    {
        "id": "1hn3b1j",
        "author": "Cheddar18",
        "title": "So La Palma absolutely sucked.. what other natural disaster movies or shows should I try next!? ",
        "content": "Talk about plot armor... damn what a disappointment of a show. \n\n\nBut now I'd love to watch any other natural disaster shows or movies- I've seen Greenland so many times but am not sure what else to watch that's actually good. I'd love any recommendations please!! ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hn3b1j/so_la_palma_absolutely_sucked_what_other_natural/"
    },
    {
        "id": "1hmqmv2",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Movies Coming in 2025",
        "content": "* **Back in Action (January 17)**\n* **The Electric State (March 14)**\n* **Wake Up Dead Man: A Knives Out Mystery (2025)**\n* **The Old Guard 2 (2025)**\n* **Fear Street: Prom Queen (2025)**\n* **The Life List (2025)**\n* **Frankenstein (2025)**\n* **Happy Gilmore 2 (2025)**\n* **Havoc (2025)**\n* **Plankton: The Movie (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/) **|** [**Anticipated Netflix Shows**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/)\n\n",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqmv2/10_highly_anticipated_netflix_movies_coming_in/"
    },
    {
        "id": "1hn1u6j",
        "author": "Chaosjoint",
        "title": "Carry-on: Did I miss something?",
        "content": "When Ethan face-off with the antagonist at the end of sorting, Ethan find a similar case when the villain demands him to give him the case. \n\nMy thought is that he swapped the case by putting the ribbon on that random case and leave his earpiece there for him to take.\n\nLater, when the antagonist board the plane to DC, it was by the time he settle down that he found the case is slightly bigger than his design and even already tagged for transport.\n\nThen it is not the real one right?\n\nThen why the hell is the chem weapon still in the case? \n\nI just can't wrap my head around it. Am I missing something here?",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hn1u6j/carryon_did_i_miss_something/"
    },
    {
        "id": "1hmv9u7",
        "author": "sillysaegers",
        "title": "Any good Netflix movies/shows with Dutch Dubs?",
        "content": "I’m Belgian and I live in America and I use Netflix as one does but almost every show or movie I enjoy doesn’t have a Dutch dub, anyone have any recommendations?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmv9u7/any_good_netflix_moviesshows_with_dutch_dubs/"
    },
    {
        "id": "1hmxmnk",
        "author": "hamsamichhh",
        "title": "video game commercial?",
        "content": "hi friends, my dad saw an action video game commercial during the netflix christmas football game and can’t remember the name of it. wondering if anyone remembers the name of it ? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmxmnk/video_game_commercial/"
    },
    {
        "id": "1hmhk3t",
        "author": "Robemilak",
        "title": "Carry-On pulled nice numbers",
        "content": "‘CARRY-ON’ had 97M views in its first 10 days of streaming. The biggest Netflix film release this year. What did you think of it? I'd says it's a decent addition to Christmas movie list.",
        "upvotes": 48,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hmhk3t/carryon_pulled_nice_numbers/"
    },
    {
        "id": "1hn2tdj",
        "author": "HearYourTune",
        "title": "So far Squid Game S2 Ep 1 and 2 are incredibly boring.",
        "content": "Very disappointed.  \n\nThey should have started with picking up some players and then the limo scene and then walking into the trucks and started ep 1 with the games and then back track into some of the back story but the way they did it is awful I feel like I wasted 2 hours and they don't have enough interesting story to tell and just made a lot of filler. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2tdj/so_far_squid_game_s2_ep_1_and_2_are_incredibly/"
    },
    {
        "id": "1hn2gkt",
        "author": "Therealscorp1an",
        "title": "What are your honest thoughts on The Crown?",
        "content": "Hello, everyone.\n\nLately I have been trying to find some new series to watch on Netflix and I have heard in the past a lot of talk about The Crown.\n\nI was wondering what some of your opinions on the show are and whether it is worth the watch.\n\nI like shows that are of a similar style to something like Suits, and I have a very fond interest in history and royalty.\n\nSo if you could please leave your honest thoughts, reviews, comments and opinions, that would be really appreciated!\n\nThank you all again!",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2gkt/what_are_your_honest_thoughts_on_the_crown/"
    },
    {
        "id": "1hm64x4",
        "author": "AnonymousUser8476249",
        "title": "Netflix needs a “Live” button / option",
        "content": "There needs to be a way to jump to the live action when viewing a live event such as an NFL game.  \nApple TV latest version, latest os, etc. \nWhen you switch away from the game and then come back, Netflix holds your spot.  Which is great when watching regular shows and movies, but sucks when watching a live event.\n\nI understand that this may be baked into the core architecture of Netflix, but they need to at least add a button to jump to the live action.  Currently the only way to do this is to fast forward until you reach the live spot.  \n\nHopefully someone from Netflix sees this and makes it happen.",
        "upvotes": 239,
        "comments": 116,
        "media": null,
        "permalink": "/r/netflix/comments/1hm64x4/netflix_needs_a_live_button_option/"
    },
    {
        "id": "1hmwvts",
        "author": "Euphoric-Editor-6986",
        "title": "Wrong password and wrong email adress",
        "content": "Hi! So I have a problem. I have a netflix account,and I added a wrong E-mail adresss to my account,and I forgot the password.I want to change my password and Netflix send a code to my phone number but I didn’t get it many times.I write to Netflix,I didn’t get answer and I told the netflix costumer service that \nif it’s necessary, I will write down them to my card number or my full name,or my phone number that is linked to the Netflix account that I can't log into.So I \nI can prove that the account is mine…\nPlease help me because the gmail address is wrong and I can't change it because I don't know the password, so it's taking money from my card unnecessarily….thanks!!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwvts/wrong_password_and_wrong_email_adress/"
    },
    {
        "id": "1hn1hpi",
        "author": "treedoghill",
        "title": "Canadian Netflix movies with well done no quick multi cut camera work for  violent action ? ",
        "content": "Stuff like The Man From Nowhere , John Wick and Nobody (although I can’t remember how often the action in Nobody is done clearly Vs. with lots of cuts) . \n\nI’ve found several threads for great movies outside of these listed  ,but after googling 30+ films only those ones I mentioned are on Canadian Netflix .  \n\nI do have Disney and Tubi as well . \n\nSome other good films with the great violent scenes on Netflix are Bone Tomahawk and Brawl In Cell Block 99.  ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hn1hpi/canadian_netflix_movies_with_well_done_no_quick/"
    },
    {
        "id": "1hmcjls",
        "author": "ohhhKid",
        "title": "Korean zombie movies are top tier",
        "content": "New show called Happiness out on Netflix, korean based, zombie theme show. I love zombie movies, but “all of us are dead” “kingdom” and “happiness” are awesome choices! Really hope to see more Korean zombie movies/shows in the future",
        "upvotes": 73,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcjls/korean_zombie_movies_are_top_tier/"
    },
    {
        "id": "1hn0zvg",
        "author": "CarlosGaarher",
        "title": "Have a share account without living in the same home, didn't have a problema already. I'm gonna have problems one day? ",
        "content": "Yes, my girl and two of his friends share an account. They lived in an apartment together, I lived in another apartment. I have the account on my TV for like 3 weeks. With the Netflix restrictions, some day I'm gonna have the warning that I not lived in the same place that the owner of the account? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn0zvg/have_a_share_account_without_living_in_the_same/"
    },
    {
        "id": "1hmuv8c",
        "author": "CAmiller11",
        "title": "Netflix social connections",
        "content": "As long time ago, before streaming, Netflix had a social function were you could sort of connect to your friends on the website. It made recommending movies really easy as you could just share to them. I wish Netflix would add this feature or something like it back. No, it wouldn’t be account sharing. But like I could “friend” my mom, and when I finish watching a movie I think she would like, I could “share the recommendation” with her. Same with friends (who tend to be more clued in on movies, why I used my mom as an example). It could even be added as a “friends recommend” list below the “my list”. And it would show the movies/shows/etc and then which “friend” recommended it. You scroll to a show/movie and it gives watch now, add to my list, dismiss, etc. If you watch it and rate it, it lets the person that recommended it know if you liked it. Netflix wants to keep people on the platform, this would help. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmuv8c/netflix_social_connections/"
    },
    {
        "id": "1hmwyrp",
        "author": "PeaOk5697",
        "title": "My problem with La Palma",
        "content": "I will give lt a 5/0. It wasn't really bad, or good in my opinion. The acting could be better and the VFX/CGI wasn't terrible. The storyline was awful with the most unrealistic survival instincts. What bothered me the most was the tsunami hitting the plane. No way anyone would survive that. A good one time watch but they need better writers. What did you think? Also, i recommend watching it in Norwegian and not the dubbed version. If you like it, there is a much better movie named The Wave from 2015. Much better ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwyrp/my_problem_with_la_palma/"
    },
    {
        "id": "1hmwdi4",
        "author": "Alafandri",
        "title": "My thoughts on Squid Game new season",
        "content": "I have just finished watching season 2 of squid game, and well. I think it was short. It was really good tho but the 2 ep less we got made it feel so much shorter and everything happened so slow. I would have wanted more to happen. Get to know more about those clients. See more what everything looks like around that place. I'm not saying that I didn't like it cause I did really love it. I just wanted more to happen. But hey, at least we are getting another season already next year. So that makes stuff better. Thank you for reading all of this. This is just my opinion. Can't wait for season 3. yay!\n\n[random image from google. XD](https://preview.redd.it/wblnf8wlz89e1.jpg?width=1296&amp;format=pjpg&amp;auto=webp&amp;s=b684fdcf412568a216be8b0dfbc403de0c60c555)",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwdi4/my_thoughts_on_squid_game_new_season/"
    },
    {
        "id": "1hmv44y",
        "author": "Shiroyasha466",
        "title": "Help",
        "content": "I keep getting your card is too low on funds error even though I have enough for the monthly payments. Been a member since may . Haven't happened in previous transactions.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmv44y/help/"
    },
    {
        "id": "1hmq6c9",
        "author": "techfinpro",
        "title": "Netflix Brings ‘Carry-On’ Director Jaume Collet-Serra’s Crime Thriller ‘RUN ALL NIGHT’ to Streaming, After Chart-Busting Success",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmq6c9/netflix_brings_carryon_director_jaume/"
    },
    {
        "id": "1hmu1cp",
        "author": "avgetonas",
        "title": "Password Correct But Also Incorrect",
        "content": "A few months ago i made an account for 2 devices to use with my sister. We both left our home and live in seperate cities and countries. Everything worked fine for a few months, i used the account on my pc she used the account for her pc. \n\nNow i have finally finished the uni and returned to my hometown and since then whenever i try to enter the account on my pc it says that the password for the email is wrong although it is the correct one. I tried it on my phone on the same wifi it works. She can still use the account with no problem. If I try to reset the password through email netflix gives an error \"something went wrong please try again later\". \n\nI believe i somehow f up the devices and now netflix recognises my phone instead of my pc. Anyone had the same problem in the past? Is it a geolocation thing and how do i fix it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmu1cp/password_correct_but_also_incorrect/"
    },
    {
        "id": "1hmtmpq",
        "author": "JFedzor",
        "title": "Unable to watch Netflix on my PC (flickering black screen)",
        "content": "When I first boot my PC, it lets me watch Netflix for 10-20 minutes, then suddenly it freezes, and the screen turns black, I can still see the UI, but I only hear audio, no picture to be seen, from there, the monitor itself flickers on and off (the entire display), and my mouse cursor will begin to freeze / stutter in increments until I close Netflix. \n\nRestarting the browser doesn't help, signing out doesn't help, and using the dedicated Windows app does not help. The ONLY fix, is rebooting my PC, only to watch for another 10-20 minutes, then run into issues again.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmtmpq/unable_to_watch_netflix_on_my_pc_flickering_black/"
    },
    {
        "id": "1hn0mtw",
        "author": "Housemouse91",
        "title": "Who would win a sword fight, Ragnar Lothbrok or Uhtred ?",
        "content": "Having finished Vikings a while ago and just about to finish the last kingdom, both were very impressive. Both Ragnar and Uhtred fought battle after battle unscaved but if they came head to head who would win? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hn0mtw/who_would_win_a_sword_fight_ragnar_lothbrok_or/"
    },
    {
        "id": "1hn0i5p",
        "author": "AnxiousAd7000",
        "title": "Was the end of Squid Game Season 1 always there?",
        "content": "Watching the recap for season 2, I couldn’t remember a few scenes from the end of season one. Now rewatching the last episode, me and my friends are definitely sure certain things weren’t there before. We all watched the first season as soon as it was released…was the end always like that, or they added stuff later on? Really, not possible that we are all getting crazy like that…",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hn0i5p/was_the_end_of_squid_game_season_1_always_there/"
    },
    {
        "id": "1hmrjj8",
        "author": "HearshotKDS",
        "title": "Your Friend, Nate Bargatze - Spin to Win?",
        "content": "Watched the first 25 minutes of this special last night. I generally like Nate's comedy, but was surprised to see him come out to a weird technicolor fishbowl stage. Then the camera starts slowly spinning around him as he kind of continually turns to face it as it moves. And he keeps doing that for as long as I could watch. Jokes were pretty good suburb Dad observational humor stuff. But I couldn't get over the constant spinning, a bit of a strange choice on how they filmed this. What do you think /r/Netflix?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hmrjj8/your_friend_nate_bargatze_spin_to_win/"
    },
    {
        "id": "1hmqa5z",
        "author": "Imaginary_Stomach139",
        "title": "Netflix doesn't work anymore since 4 days. Smart TV too old?",
        "content": "Hi, me and my parents share a Netflix account together. Everyone has a seperate profile. I use it via my PC via internet browser, my Dad uses it via his LG smart TV, and my mom uses it via her Panasonic Smart TV.\n\nMy parents live together in the same house, and the smart TVs are connected via Wlan to the internet. But since like 4 days the Netflix App doesn't work anymore on my mothers TV. It always shows like no connection. Even though the TV has internet, because the YouTube app still works just fine.\n\nIt shows a error code: NW-4-8 ( if i remember correctly, if not will update you tomorrow). Then I read you should put the power away from the TV and from the Internet router. So I did that for like 1 Minute and put the power back on, but still the same. It's still not working and still same error code.\n\nCan someone help? Anyone has a solution? If you need the excact panasonic model, I can tell you tomorrow.\n\nThanks and merry christmas\n\nHave a nice evening\n\nPS: My mom said she did update the TV, but still didn't help\n\nPS2: On the TV I just turned off the power strip (cause you don't really have access to the cable itself without moving the TV), and on the internet router I unplugged the power cable\n\n  \nUpdate: So she just took a few pictures. But she said she tried to delete the app, but didn't work. But coulnd't test it myself, but i belive her 😅\n\nShe said TV is around 10 years old. Didn't expect it to be that old.. So is the TV really to old now to get Netflix access?\n\n  \nHere the pictures - [https://ibb.co/pKYNnYF](https://ibb.co/pKYNnYF)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqa5z/netflix_doesnt_work_anymore_since_4_days_smart_tv/"
    },
    {
        "id": "1hmbxt7",
        "author": "jwmoz",
        "title": "Black mirror white Christmas ",
        "content": "I would go as far to say that this episode is a masterpiece. Multiple concepts combined, multiple threads of the story that meet at the end, and a fantastic ending that leaves me smiling at the music, horror and execution. ",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmbxt7/black_mirror_white_christmas/"
    },
    {
        "id": "1hn2ww4",
        "author": "TheJungleTroll",
        "title": "1080p?",
        "content": "Yes I know its a picture of my monitor, I wish I culd do a screenshot cause it looks even worse. How is this the native resolution and why can I not change it?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ww4/1080p/"
    },
    {
        "id": "1hmwia7",
        "author": "Colinelynpit",
        "title": "Help - Netflix cancelled my account…",
        "content": "I’m currently travelling so been to a few countries. \nI used my Netflix account in hotel smart TVs whenever it is available\nToday I realised that Netflix cancelled my account \nContacted customer service and says Netflix has the rights to terminate accounts if they suspects my account is being used fraudulently. Eg by multiple people \nAnd the agent said nothing she could do nor refund my current subscription which was paid a week ago.\n\nWhat should I do in this case? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwia7/help_netflix_cancelled_my_account/"
    },
    {
        "id": "1hmt2f8",
        "author": "Different-You3758",
        "title": "Downloads expiring ",
        "content": "I lost track and have a number of movies to watch that expire 12/31/24. If I download them I know they will be removed on the expiration date. \n\nIf I download them and put that device in airplane mode (take it offline) do you think I would still be able to watch them knowing they would be deleted the next time the device is online?\n\nI figured someone must have tried this by now. \n\nThanks",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hmt2f8/downloads_expiring/"
    }
]