[
    {
        "id": "1kwrd7x",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Colby Minifie - Wednesday 5/28 at 4:30 PM ET - Actress in 'The Boys', 'Gen V', 'I'm Thinking of Ending Things', 'Fear the Walking Dead', 'The Marvelous Mrs Maisel', and lots more.",
        "content": "",
        "upvotes": 43,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ilzzql5umc3f1.png?auto=webp&amp;s=aa5228fcc19f5540d3de257a62be0c23ee4c2746"
        },
        "permalink": "/r/movies/comments/1kwrd7x/amaqa_announcement_colby_minifie_wednesday_528_at/"
    },
    {
        "id": "1kw5kt9",
        "author": "SanderSo47",
        "title": "May 23-25 Box Office Recap – It was the biggest Memorial Day weekend in history. 'Lilo &amp; Stitch' debuted with a colossal $341 million worldwide, while 'Mission: Impossible – The Final Reckoning' debuted with $204 million worldwide.",
        "content": "https://preview.redd.it/veq3xk1ey63f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=2abc6ed70f57166cfe3163e0f00b28d593335138\n\nIt was a record breaking Memorial Day weekend.\n\nDisney's live-action remake of ***Lilo &amp; Stitch*** opened with the best Memorial Day debut, as well as the third biggest debut for any live-action remake. ***Mission: Impossible – The Final Reckoning*** also reached franchise highs this weekend, although its numbers are overshadowed by its colossal budget.\n\nThe Top 10 earned a combined $260.8 million this weekend. That's not just a colossal 166.8% up from last year, but it was the biggest Memorial Day weekend in history.\n\nEasily earning the #1 spot, ***Lilo &amp; Stitch*** debuted with a gigantic $145.5 million this weekend ($183 million four-day). That's the biggest Memorial Day debut, passing ***Top Gun: Maverick*** ($126 million, $160 million four-day). It's also the third biggest debut for a Disney live-action remake, just behind 2019's ***The Lion King*** ($191 million) and 2017's ***Beauty and the Beast*** ($174 million).\n\nThat's absolutely impressive, considering the original film made $145.7 million domestically back in 2002 (yes, the remake has already outgrossed it in just four days). So how did it open that high, especially considering other animated films had higher box office?\n\nSimply put, Stitch has been a merchandising monster for the past decades. It's been a main point of attention in Disney Parks, as well as in other venues. There's a lot of toys, shirts, caps, bedsheets, etc., with the character attached. The film has also grown massively through home media, cable reruns and streaming, particularly with Millennials and Gen Z. Contrary to the belief, Gen Z still likes going to theaters, and their familiarity with Stitch helped.\n\nThe original animated film had a crazy marketing campaign, where Stitch crashed other Disney animated films, which helped raise awareness. Disney used a similar tactic with the remake; some posters have Stitch messing with other remakes like ***Aladdin***, ***Cinderella***, ***Snow White***, and ***Beauty and the Beast***. Not to mention a spot in Super Bowl LIX, where Stitch \"interrupted\" the kickoff. It's simply a case of a pretty great marketing campaign.\n\nIt's crazy to think that this was going to be straight to Disney+. Whoever decided to shift that just earned a raise. And while Disney is often known for their large amount of money spent on productions, ***Lilo &amp; Stitch*** came in far lower. It cost just $100 million, which is quite cheap. And if you watched the final version of the film, it clearly shows.\n\nAccording to Disney, 64% of the audience was female. As previously said, Millennials and Gen Z loved the franchise and the data supports it: a massive 79% of the audience was under 35. Reviews were middling (68% on RT), but the audience was much more forgiving: they gave it a great \"A\" on CinemaScore. Even with some family competition on its way, ***Lilo &amp; Stitch*** should easily get to $500 million domestically. \n\nThis franchise will self destruct in 8 films.\n\nIn second place, ***Mission: Impossible – The Final Reckoning*** debuted with $64 million ($77.5 million four-day) in 3,857 theaters. That's the franchise's biggest debut, although it comes with an asterisk in terms of attendance. Adjusted for inflation, it's the third lowest debut, just behind ***Ghost Protocol*** and ***Dead Reckoning***.\n\nOn its own, when a franchise hits a high at the box office for its final outing, it should feel celebratory. So why is this not considered a great start? Perhaps for the fact that the film cost a staggering $400 million to produce (although some have it lower at $300 million), making it one of the most expensive films ever made. Why did it cost that much?\n\nWhile films film around a few months, some blockbusters can last longer. But in the case of ***The Final Reckoning***, it was even bigger. Filming started in March 2022 with certain sections of the film, followed by a break. Then in 2023, production was halted after the WGA-SAG strike. Once they were allowed to film, they still needed to pay for actors' availability and rewrites, complicating matters. As such, the film didn’t wrap until November 2024. It wasn't a continuous shoot, and the film paid the crew despite months of not working on the film. No one involved in the film went into this expecting it to cost that much.\n\nWith all that said, it still raises the question: the film couldn't open at least higher than this? Sure, it's a franchise best, but considering it's barely above ***Fallout*** ($61 million) and it's sold as the absolute final film, it feels like it could've been higher. But it looks like the franchise simply has a ceilling at the box office. One of its biggest challenges was adding fans with time, but here's the thing: this franchise is 29 years old. Fans of the franchise will watch it, but it's unlikely it can add new fans. After all, the attendance peaked with the second film ($401 million adjusted).\n\nSo the film was sold simply as a send-off for Tom Cruise. To the point that the trailers emphasized the \"I need you to trust me one last time\" line. For the past years, Cruise and McQuarrie have said that this wouldn't be the end and that Cruise was looking forward to play the character for years. But that was put to rest a few days ago, when Cruise finally confirmed that the title of the film pretty much says it all: it's not called ***The Final Reckoning*** for nothing. The franchise has been a critical darling for the past few entries, and while reviews were positive (80% on RT), it wasn't as acclaimed as the previous films.\n\nAccording to Paramount, 63% of the audience was male. The film had no appeal for young audiences: 62% of the audience was 35 and over, with its biggest demo being 55 and over (29%). That shouldn't be a surprise. They gave it a solid \"A–\" on CinemaScore, although it's below both ***Fallout*** and ***Dead Reckoning***. The film will enjoy a 3-week exclusive run in IMAX, as part of a deal secured back in 2023. But with competition on its way, it's very unlikely ***The Final Reckoning*** could hit $200 million domestically. \n\nLast week's champ ***Final Destination: Bloodlines*** added $19.3 million ($23.9 million four-day). That represents a steep 62% drop from last week, which is worse than both ***The Final Destination*** (54.9%) and ***Final Destination 5*** (57.3%). Looks like the film will be playing like a standard horror film, but considering it's already the highest grossing film in the franchise, it's not like it matters much. Through 11 days, the film has earned $94.1 million, and it should close with around $130 million domestically.\n\nIn fourth place, ***Thunderbolts*** dropped 45%, adding $9.1 million this weekend ($11.8 million four-day). The film hasn't fully collapsed, but it hasn't held very well neither, thanks to a large slate of competition. Through Monday, the film has earned $174 million and it's gonna be struggling to hit $200 million at this rate.\n\n***Sinners*** earned $8.6 million this weekend ($11 million), which represents a 43% drop, its biggest so far. Which just speaks volumes of what an insane run it has had so far. The film has earned $258.8 million, and it should get close to $290 million by the end of its run.\n\nIn sixth place, Angel Studios' ***The Last Rodeo*** debuted with $5.2 million ($6.2 million four-day) in 2,205 theaters. The film got an \"A\" on CinemaScore, and it should earn over $15 million domestically.\n\nEven more good news this weekend. A24 expanded ***Friendship*** into wide release, and the film earned a very solid $4.5 million ($5.5 million four-day) in 1,055 theaters. That's pretty good, especially considering the selling point is pretty much just Tim Robinson and Paul Rudd. The film has amassed $7.6 million so far, and it should continue adding screenings.\n\nIn eighth place, ***A Minecraft Movie*** was clearly hit by the newcomers. It collapsed 63%, its biggest drop so far, earning $2.2 million this weekend ($2.8 million four-day). The film has earned $421 million so far, and it will finish with around $430 million domestically.\n\n***The Accountant 2*** dropped 59% and added $1.9 million ($2.5 million) this weekend. That takes its domestic total to $63.3 million, and it's gonna close with less than $70 million lifetime.\n\nRounding up the Top 10 was ***Hurry Up Tomorrow***, which managed to lose over 500 theaters on its second weekend. The film collapsed a brutal 78%, making just $715,000 this weekend ($860,000 four-day). That's simply horrible, but not surprising considering the film's terrible word of mouth. The film has earned $4.9 million, and it won't make it pass $6 million domestically.\n\n#**OVERSEAS**\n\n***Lilo &amp; Stitch*** was also incredibly strong overseas. The film debuted with a colossal $158.7 million overseas, for a gigantic $341 million worldwide debut. Basically, in one single weekend, it already outgrossed the worldwide lifetime of the original. The best debuts were in Mexico ($23.7M), UK ($12.9M), Brazil ($11.1M), France ($10.7M) and Italy ($9.2M). This is an easy billion.\n\n***Mission: Impossible – The Final Reckoning*** debuted with $127 million overseas, which was a $204 million worldwide debut, another franchise record. Its best debuts were in South Korea ($12.7M), Japan ($11M), the UK ($10.7M), India ($9M), France ($7.8M), Australia ($7.7M), Taiwan ($6.3M),  Germany ($6M), Mexico ($3.9M), UAE ($3.6M) and Hong Kong ($3.3M).\n\nThere's been talks over how the film is going to recoup its $400 million budget. Deadline reported something and here's the thing: it won't. The film by itself is going to lose a lot of money in theaters. But it also notes that Paramount is playing the long game: the value of franchise properties increases with each subsequent installment and across multiple revenue streams. So Paramount can be able to profit with multiple \"The Complete Franchise\" deals in home media and streaming. It's gonna take a long time for that, but it's gonna be a big asset. And even if it doesn't, what's gonna happen? Cancel the franchise? It's already over.\n\n***Final Destination: Bloodlines*** added $23 million overseas, taking its worldwide total to $186.7 million. It has already passed ***The Final Destination*** to become the highest grossing film in the franchise, achieving it in just 2 weekends. The best markets are the UK ($9.2M), Mexico ($9.2M), Philippines ($6M), India ($6M) and France ($5M). It will cross $200 million in the next few days, and it will finish with around $270 million worldwide. Truly impressive.\n\nIf you thought ***Thunderbolts*** was struggling domestically, it pretty much died this weekend in the rest of the world. The film collapsed a horrible 64% and added just $5.6 million, taking its worldwide total to $355 million. Clearly the arrival of Stitch and Tom Cruise took a toll on its overseas prospects. Well, we gave it the benefit of the doubt, but now it's guaranteed to finish below $400 million. As such, we finally a consensus: this is a box office flop.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Captain America: Brave New World* | Feb/14 | Disney | $88,842,603 | $200,500,001 | $415,101,577 | $180M\n\n- You should've done better, Marvel. ***Captain America: Brave New World*** has ended its run with just $200 million domestically and $415 million worldwide. Given that its budget was $180 million, we can safely call this a box office failure. It didn't fully collapse from its weak reception, given that it had very small competition for a lot of weeks. Nevertheless, its 2.26x multiplier is quite bad. It's not a surprise, considering the film itself is a Frankenstein's Monster that fails to properly delve into any of its themes or ideas. What's Marvel gonna do now? Especially considering the better received ***Thunderbolts*** is set to finish below this? \n\n#**THIS WEEKEND**\n\nWith such a huge debut, ***Lilo &amp; Stitch*** ain't losing the top spot this weekend.\n\nSony is releasing ***Karate Kid: Legends***, the sixth film in franchise, starring Jackie Chan, Ben Wang, and Ralph Macchio. The franchise has been massively popular, and the success of ***Cobra Kai*** on Netflix has helped it add new fans over the years. But the decision to sandwich the film between two anticipated family films (***Lilo &amp; Stitch*** and ***How to Train Your Dragon***) is concerning. Will the audience pay a ticket or just wait for streaming?\n\nA24 is also releasing the horror film ***Bring Her Back***, which is directed by Danny and Michael Philippou (***Talk to Me***). That film was a sleeper hit back in 2023, earning $90 million worldwide. Will they strike gold again?\n\nAnd on limited release, there's Wes Anderson's ***The Phoenician Scheme***, starring Benicio del Toro, Mia Threapleton, Michael Cera, Riz Ahmed, Tom Hanks, Bryan Cranston, Mathieu Amalric, Richard Ayoade, Jeffrey Wright, Scarlett Johansson, Benedict Cumberbatch, Rupert Friend, and Hope Davis. The film has already premiered in Cannes, where it earned a very solid response. Anderson's films often deliver high numbers on limited release, so look for this film to deliver the year's best per-theater average.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 223,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Cw4tk4-XUl6fC6PF9OjtTsgZ-OIdRrVk_Gr6GDoxZ4.png?auto=webp&amp;s=b2f7524081308c95d3c8545666b05d8f1a9f6fb3"
        },
        "permalink": "/r/movies/comments/1kw5kt9/may_2325_box_office_recap_it_was_the_biggest/"
    },
    {
        "id": "1kwfvq8",
        "author": "Fabulous_Bluebird931",
        "title": "Robin Williams' Popeye Was Filmed While the Set 'Snowed with Cocaine'",
        "content": "",
        "upvotes": 5571,
        "comments": 489,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x13Ggv0_QZC8I5LgJfcMchqki5FZ33N4neWgaDSqsQU.jpg?auto=webp&amp;s=4011768d553bf6aef22cb25b97af625ae56b5f38"
        },
        "permalink": "/r/movies/comments/1kwfvq8/robin_williams_popeye_was_filmed_while_the_set/"
    },
    {
        "id": "1kwih8m",
        "author": "PM_Peartree",
        "title": "Nepotism doesn't always work: Children of celebrated actors who tried to be film stars and FAILED",
        "content": "Rumer Willis - She did a few pictures throughout the 2000s, among those being Sorority Row and The House Bunny, yet the Alexa Joel Ray of acting failed to catch in and since became more of a bit player. \n\nSistine Stallone - The highlight of her acting career was getting eaten by a shark in 47 Meters Down: Uncaged. Her cousin, Vatican, didn't even try. Sage Stallone was the sole decent actor in the family.",
        "upvotes": 1832,
        "comments": 916,
        "media": null,
        "permalink": "/r/movies/comments/1kwih8m/nepotism_doesnt_always_work_children_of/"
    },
    {
        "id": "1kw8cdm",
        "author": "chrispdx",
        "title": "You often hear the phrase \"They Couldn't Make That Movie Today!\" about a movie that they could. What movies from the past could they LITERALLY not make today?",
        "content": "The one that pops to my mind is from 1984: \"Blame It On Rio\", where middle-aged Michael Caine has a sexual relationship with his co-worker's teenage daughter while on vacation in Brazil.\n\nIn fact, most of the late-70s to mid-80s teenage sex comedies couldn't be made today due to hightened sensibilities about exploitation.\n\nAny others?\n\nEDIT: Jesus F C this blew up",
        "upvotes": 10269,
        "comments": 5323,
        "media": null,
        "permalink": "/r/movies/comments/1kw8cdm/you_often_hear_the_phrase_they_couldnt_make_that/"
    },
    {
        "id": "1kwpjbp",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Wes Anderson's 'The Phoenician Scheme'",
        "content": "",
        "upvotes": 416,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szuu56zbac3f1.jpeg?auto=webp&amp;s=059d2640e68452cc61f7129890c882930f155a1d"
        },
        "permalink": "/r/movies/comments/1kwpjbp/new_character_posters_for_wes_andersons_the/"
    },
    {
        "id": "1kwo31n",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Aziz Ansari's ‘GOOD FORTUNE’ - Follows Keanu Reeves as an inept angel who meddles in the lives of a gig worker and a wealthy man.",
        "content": "",
        "upvotes": 407,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ikzs0datzb3f1.jpeg?auto=webp&amp;s=748f5357cdafa3abbca1416fd4870653289466db"
        },
        "permalink": "/r/movies/comments/1kwo31n/official_poster_for_aziz_ansaris_good_fortune/"
    },
    {
        "id": "1kwohsz",
        "author": "rejiro659630042025",
        "title": "I genuinely believe short IMAX release windows are a large contributor to cinema's decline",
        "content": "I almost missed out on Sinners in 70mm, so if this post comes off as a little petty, I admittedly am.\n\nI work in film myself, I love and live for the artform. Unfortunately, my unpredictable work schedule means I actually miss out on watching some good movies in theatres. My girlfriend and I have to coordinate our work schedules, and sometimes we're able to go on the third week. We both only got to see Sinners on the week of its return engagement in 70mm because IMAX agreed to it.\n\nLately, IMAX has been screening a lot of new releases for only a week or two, and rereleases for maybe 1-3 days. Michael B Jordan himself complained about the small 3 day window which he couldn't attend the screening of the 4K Princess Mononoke restoration. This is occuring quite often because IMAX has been adamant about signing contracts for as many films and experiences as possible. Sinners was not only kicked out of theatres to make way for Thunderbolts*, but also to make way for Fortnite Championship Series (which I can't understand how the audience would benefit from the extra pixels compared to a standard screen). Interstellar's infamously limited rerelease had advance tickets offered on eBay for hundreds.\n\nFurthermore, tickets are so hard to buy for the first week and sometimes even the second week. IMAX has unintentionally curated a toxic collecting culture around collecting different film strips every week (the artificial scarcity of those same strips selling for hundreds online). It has contributed to a toxic rewatch culture that takes away seats from potential first-time viewers. And IMAX only has so many screens available, which makes rewatch culture even more unfair when a second viewing could be on a standard screen instead.\n\nIMAX's greed is why a lot of cinemagoers who usually show up the second or third week have become jaded with movie theatres and just wait for the home release. Who can blame them when they're being marketed the best cinema experience only to be blocked out of attending because it's so hard to find good tickets for the entire IMAX run? IMAX has close to a monopoly on Premium Large Format where I live here in Canada (if they don't have one already). Again, I love cinema, but this is the reason I'm falling out of love with watching films in a theatre.\n\nWhat can IMAX do to fix this? Sign less contracts, IMAX should only screen 11 or 12 new releases each year, in 3-4 week runs. The extra weeks left over can be filled with rereleases that stay for 1-2 weeks. Make only one type of film strip  so that viewers aren't coming back to collect them all, and increase the supply so that everyone who wants to get one can get one.\n\nWhere will the other films go if they can't screen in IMAX? They can go to competing Premium Large Formats or standard screens (romcoms aren't made for IMAX, to be quite fair). There aren't enough IMAX screens to properly meet demand for the biggest films out there, so some films have to be pushed out to make way for longer engagements for other films.\n\nIf IMAX cannot change their ways and allow their screenings to stay an extra week or two so they can be more accessible, I think it's time to bet on another horse in the race. Maybe Dolby Cinema once they can open up enough screens worldwide. But preferably a format that can keep a film in theatres for roughly a month, as it used to be back in the old days. I'm speaking as someone who didn't have to worry about choosing between Spider-Man 2 or Shrek 2, because I could see them both in theatres on different days.",
        "upvotes": 317,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1kwohsz/i_genuinely_believe_short_imax_release_windows/"
    },
    {
        "id": "1kwhsu5",
        "author": "mrjohnnymac18",
        "title": "James Bond franchise owners request more time to defend control of 007 spy name",
        "content": "",
        "upvotes": 980,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_KifZuq4wrFppOqWeABnOmkgSv-iviGJg0AMRqZF454.jpg?auto=webp&amp;s=8d6e940420654218613444d72919e02cd4d4eb63"
        },
        "permalink": "/r/movies/comments/1kwhsu5/james_bond_franchise_owners_request_more_time_to/"
    },
    {
        "id": "1kwdyva",
        "author": "diapersareforgods",
        "title": "\"What movie scene or trope do most people dismiss as unrealistic, but you know from personal experience is actually spot-on?\"",
        "content": "I’m curious — are there any moments in movies that people often call out as \"Hollywood exaggeration\" or \"totally unrealistic,\" but you've lived through something just like it?\n\n\n\nMaybe it's something as dramatic as surviving a freak accident, or as mundane as how a workplace operates. What’s a scene or trope that felt weirdly real to you because you've actually experienced it?\n\n\n\nBonus points if you can name the movie and the scene!",
        "upvotes": 877,
        "comments": 861,
        "media": null,
        "permalink": "/r/movies/comments/1kwdyva/what_movie_scene_or_trope_do_most_people_dismiss/"
    },
    {
        "id": "1kwnbht",
        "author": "PM_Peartree",
        "title": "\"3 Ninjas: High Noon at Mega Mountain\" (1998): Hulk Hogan, Jim Varney and Loni Anderson in a movie so bad that it will make you want to run away but entertaining enough (for the wrong reasons) to keep you glued to the screen",
        "content": "",
        "upvotes": 146,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vwZkI3uCn_Q8iOqNuxzODYzPxWy9fPvDRfJC_-oSB7g.jpg?auto=webp&amp;s=b427f0fbb54f36ed450ec622c9b3ed3729c7eb1d"
        },
        "permalink": "/r/movies/comments/1kwnbht/3_ninjas_high_noon_at_mega_mountain_1998_hulk/"
    },
    {
        "id": "1kwici5",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the dumbest character decision you’ve ever seen?",
        "content": "I watched a found footage horror movie last night called “Hell House LLC”. Honestly, I don’t think I’ve seen a movie with such stupidity on display, what does it take to leave a house? People being possessed, mannequins moving on their own, not to mention the fact all of it’s caught on camera. It’s quite clear they’re not just “paranoid”. \n\nAll movies have “dumb” decisions to some extent in order to progress the story but what decisions were so stupid, they made you laugh out loud? ",
        "upvotes": 208,
        "comments": 373,
        "media": null,
        "permalink": "/r/movies/comments/1kwici5/what_is_the_dumbest_character_decision_youve_ever/"
    },
    {
        "id": "1kwlb4e",
        "author": "Happy-Ad7170",
        "title": "what’s the most anxiety inducing scene for you personally?",
        "content": "re-watched war of the worlds (2005) recently. the scene where ray and his kids are in the car and get caught up in the midst of the crowds of people trying to escape, which then follows on to the crowd jumping on the car and trying to break their way in as everyone is looking for a means to get out of the city gives me so much anxiety. it makes my heart beat out of my chest. it’s because i’m terrified of crowds and being trapped in enclosed spaces. is there any scenes that do a similar thing for you? ",
        "upvotes": 101,
        "comments": 212,
        "media": null,
        "permalink": "/r/movies/comments/1kwlb4e/whats_the_most_anxiety_inducing_scene_for_you/"
    },
    {
        "id": "1kvynwo",
        "author": "JannTosh70",
        "title": "30 Years Ago, 'Die Hard With a Vengeance' Revitalized the Franchise With Samuel L. Jackson In a Dynamite Buddy-Cop Pairing",
        "content": "",
        "upvotes": 2190,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1kvynwo/30_years_ago_die_hard_with_a_vengeance/"
    },
    {
        "id": "1kw6yvc",
        "author": "SanderSo47",
        "title": "Netflix Buys Richard Linklater’s New Film ‘Nouvelle Vague’ For $4M – Starring Guillaume Marbeck and Zoey Deutch, it follows the filming of Jean Luc-Godard's ‘Breathless’ in 1959.",
        "content": "",
        "upvotes": 546,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fiC2eAbb443xY_wqWgUpXNSjjoNhwpCFFimDSn9fDac.jpg?auto=webp&amp;s=7ac2986753bd523507091947c74eb699f31d282e"
        },
        "permalink": "/r/movies/comments/1kw6yvc/netflix_buys_richard_linklaters_new_film_nouvelle/"
    },
    {
        "id": "1kwkgxf",
        "author": "idunno324",
        "title": "Movies that will make me cry",
        "content": "I want the most heart wrenching, saddest movie there is to watch. I want to bawl my eyes out. \n\nI don't really mind what the movie is about but I just want to feel all the feelings and have a good cathartic cry. \n\nThe only movies that I can sort of think of that have made me sad in the last have been the beach scene from My Sisters Keeper ",
        "upvotes": 51,
        "comments": 336,
        "media": null,
        "permalink": "/r/movies/comments/1kwkgxf/movies_that_will_make_me_cry/"
    },
    {
        "id": "1kvlltr",
        "author": "freudian_nipps",
        "title": "Werner Herzog on shooting extra footage for films",
        "content": "",
        "upvotes": 26141,
        "comments": 919,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7hg3zzon023f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kvlltr/werner_herzog_on_shooting_extra_footage_for_films/"
    },
    {
        "id": "1kw78h2",
        "author": "doodlebuuggg",
        "title": "Pee-Wee as Himself is a beautiful depiction of an artist - with poor execution",
        "content": "I'm not going to pretend I knew Paul Reubens, nor am I a professional documentary director. But I have some brief experience in interviewing artists and people in the industry for what little time I have been doing mini-documentaries. (I even interviewed a few people in this one on a different subject!)\n\nBut after watching Pee-Wee as Himself, the new two-part documentary about the life of Paul Reubens, something rubbed me the wrong way. Here we are going through Paul's entire life- from birth to death- and along the way we discover that he's a difficult person to work with. Director Matt Wolf immediately runs into this during production; Paul not wanting to disclose his sexuality, wanting to take control of the documentary because it's about *him* and everything he's done. But it seems, as the documentary goes on, Wolf doesn't understand how to collaborate with Paul. Paul isn't a very trusting person and instead of Matt trying to earn that trust over time, he seems to constantly ask for it, and from what I could tell that only made Paul more nervous about the entire thing. It's obvious during the entire documentary that Paul works best with other artists- other like-minded people when he's creating something. What I saw in this documentary didn't reflect that relationship, I saw someone who directs documentary just trying to make another one on his subject. Paul wasn't just another subject, he was more than that, and I think Matt should've let Paul take the helm a few times like he wanted. There was too much focus on his relationship with Paul in the documentary. A director inserting themselves in their own doc always feels weird and this time was the weirdest for me thus far.\n\nI don't know what Matt and Paul's relationship was like behind the camera, I'm sure there's more I didn't get to see and maybe they were closer than what the documentary lets on, but, I didn't feel that Matt knew how exactly to play with and respect Paul as a human being. The documentary itself also felt heavily disorganized and sometimes disorienting. I don't know, I was just disappointed.\n\nEdit: To clarify, I overall enjoyed the film. Gave it four outta five stars. I just had to express my feelings about Paul and Matt's relationship. I think things could've gone better.",
        "upvotes": 303,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1kw78h2/peewee_as_himself_is_a_beautiful_depiction_of_an/"
    },
    {
        "id": "1kvzx4l",
        "author": "MuddyBuddy-9",
        "title": "80’s movies that are OK to watch with my 12 year old",
        "content": "My 12 year old and I have been bonding over watching movies from my youth. So far, they’ve been fine- without coming across a super cringey scene or some kind of sexism that was OK back then but not now. So I’ve been lucky, and want to continue my streak. \n\nWe have watched: \n- the Goonies \n- Teen Wolf \n- the Wonder Years (show)\nPlan to watch: \n- Stand By Me\n- E.T. \n\nRefuse to watch: \n- any brat pack movies \n\nPlease share your thoughts on 80’s movies that have aged well: \n\n",
        "upvotes": 697,
        "comments": 2072,
        "media": null,
        "permalink": "/r/movies/comments/1kvzx4l/80s_movies_that_are_ok_to_watch_with_my_12_year/"
    },
    {
        "id": "1kw88o9",
        "author": "Slateboard",
        "title": "When did corporate villainy become popular in movies?",
        "content": "I was watching Blade from 1998, and the vampires were heavily organized, involved with big businesses, politics, etc, and it showed the leaders sitting around a long table in big office chairs. \n\nSo seeing that, it had me wondering where this kind of thing started, or what may have triggered it, since I see it in various forms in media.",
        "upvotes": 195,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1kw88o9/when_did_corporate_villainy_become_popular_in/"
    },
    {
        "id": "1kwa3nd",
        "author": "JannTosh70",
        "title": "How Steven Spielberg and J.J. Abrams Helped Bring 1995's Casper to the Big Screen",
        "content": "",
        "upvotes": 139,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dR1_O20SUXD6Ok_WBCTnz1VYfuADBT1SJEtvUjEMP9o.jpg?auto=webp&amp;s=0344e968c4a0e72262cee4150d76c09ecd061974"
        },
        "permalink": "/r/movies/comments/1kwa3nd/how_steven_spielberg_and_jj_abrams_helped_bring/"
    },
    {
        "id": "1kwqzh3",
        "author": "GardenOrca",
        "title": "Longshot [2019]",
        "content": "This has to be my favorite romantic comedy I have ever seen. Seth Rogans acting I felt was so good and came off as such a genuine character. I loved every second of it and holy shit it’s so funny! The nazi scene fall, the staircase fall, and especially the security guard scene had me absolutely crying laughing. Those are just the highlights but the whole thing has great comedy throughout. I highly recommend it to anyone who’s looking for a super fun romcom. ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1kwqzh3/longshot_2019/"
    },
    {
        "id": "1kvxfp4",
        "author": "nickrashell",
        "title": "Who is your most hated character in all of film?",
        "content": "What character do you absolutely loath? They don’t need to be the most evil just the one that really gets under your skin.\n\nFor me it is **Mrs. Carmody** from The Mist. My god I cannot stand her. She is the embodiment of self-righteousness and forcing religion and beliefs on to other people, and pleasure she takes in dealing out punishment, I just hate her.\n\nWho is your pick?",
        "upvotes": 577,
        "comments": 710,
        "media": null,
        "permalink": "/r/movies/comments/1kvxfp4/who_is_your_most_hated_character_in_all_of_film/"
    },
    {
        "id": "1kwmlef",
        "author": "Mission_Advance7377",
        "title": "Angel's Egg",
        "content": "I recently watched Angel's Egg(1985) and wanted to share my impressions. The film is profoundly dark and eerie, characterized by long stretches of silence that create a palpable sense of unease. The music further enhances this unsettling atmosphere.  \n\nI found the movie to be quite complex, rich with symbolism. While I didn't fully grasp its overall message, I recognized familiar elements, such as allusions to Noah's Ark.  \n\nI'm now hoping someone can offer an explanation of the film's symbolism and its intended meaning.  \n\nThanks in advance!",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1kwmlef/angels_egg/"
    },
    {
        "id": "1kwru0z",
        "author": "PM_Peartree",
        "title": "The \"Emmanuelle\" films with Sylvia Kristel - Feminist or sexist?",
        "content": "What I find forward-thinking is how the films present a woman being bisexual and having relationships with men and women and it never being a major problem. \n\nIn the first film, Emmanuelle's sole romantic relationship is with a woman, played by Marika Green (Pickpocket). She explores sex with men, in an almost S&amp;M fashion and by the end, embraces her sexual hunger. In the sequel, L'antivierge, she's more independent, more confident and takes on the role of the seducer. While Francis Lai's mournful score is in the background. \n\nSylvia Kristel was a sex-symbol yet I'm charmed by how delightful she is in the first film, especially in her scenes with Green, her androgynous beauty recalling a young Jane Birkin. She's beautiful and sexy while not coming across as an idiot. \n\nI don't see Emmanuelle as sexist. The way it explores women's sexuality comes from a woman's perspective. A male fantasy would have gone for the more obvious exploration.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1kwru0z/the_emmanuelle_films_with_sylvia_kristel_feminist/"
    },
    {
        "id": "1kw2xet",
        "author": "Historical_Ostrich",
        "title": "What's the last movie you couldn't finish?",
        "content": "For me, it's The End. Saw it on Hulu and the premise looked interesting - a family surviving in a bunker after the end of the world - but I had no idea it was supposed to be a musical. Really wasn't in the mood for that, and the songs were just bad and off-putting. \n\nI also gave up on Y2K pretty recently. That one I had a better sense of the premise, but I just didn't think it was particularly funny or well-executed, and I didn't care to spend another 45 minutes on it.",
        "upvotes": 247,
        "comments": 845,
        "media": null,
        "permalink": "/r/movies/comments/1kw2xet/whats_the_last_movie_you_couldnt_finish/"
    },
    {
        "id": "1kw3m37",
        "author": "Interesting_Case32",
        "title": "I Loved 12 Angry Men - What Should I Watch Next?",
        "content": "\n\nHey everyone!\nI'm in the mood to watch something really compelling, and I’d love to get some recommendations. One of my all-time favorite films is 12 Angry Men (1957). I was completely blown away by how such a simple setting—a single jury room—could produce so much tension, drama, and emotional impact. The way the characters’ personalities clashed, the powerful dialogue, and the slow unraveling of biases and hidden motives really made it an unforgettable experience for me.\n\nI’m looking for more movies that have a similar vibe: dialogue-driven, character-focused, and intellectually engaging. I don’t mind black-and-white or older films at all—in fact, I kind of love them. I appreciate stories that dive into human nature, justice, morality, and conflict—especially ones where the stakes are high and the tension builds slowly through conversation rather than action.\n\nOne of my other favorites is The Shawshank Redemption (1994)—such a brilliant story about hope, justice, and inner strength. I also enjoyed A Few Good Men for its courtroom drama and To Kill a Mockingbird for its exploration of justice and racism.\n\nSo if you know any films like 12 Angry Men, whether they’re courtroom dramas, intense one-room settings, or just smart, dialogue-heavy stories, please send them my way. I’d also love to hear what your favorite movies are—even if they’re not exactly in the same genre. I’m open to watching anything that leaves a strong impact or makes you think.\n\nThanks in advance, and I look forward to diving into some of your suggestions!",
        "upvotes": 227,
        "comments": 427,
        "media": null,
        "permalink": "/r/movies/comments/1kw3m37/i_loved_12_angry_men_what_should_i_watch_next/"
    },
    {
        "id": "1kwo567",
        "author": "ObjectPhysical6676",
        "title": "What are your favorite movies of the ‘80s?",
        "content": "I grew up in the “80s. My favorites were Raiders of the Last Ark, Empire Strikes Back, The Princess Bride, Labyrinth, Goonies, Dark Crystal, and E.T. As I got older I revisited R rated fare like Blue Velvet, The Fly, The Thing, Escape From New York, (a lot of Cronenberg and Lynch) slash films, like Friday the 13th and Nightmare on Elm’s Street. I’d like know other’s favorite ‘80s movies. Whether you saw them when they came out, or just recently.",
        "upvotes": 7,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1kwo567/what_are_your_favorite_movies_of_the_80s/"
    },
    {
        "id": "1kw5kzv",
        "author": "ControlCAD",
        "title": "Marcel Ophuls, Oscar-winning film-maker of 'The Sorrow and the Pity', dies aged 97",
        "content": "",
        "upvotes": 131,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TnkPlWyWROGj0KfJbkOzpM5taCFpz6dTIS8p954Dkz0.jpg?auto=webp&amp;s=64aec2bf0ab1cdfcfe319ea0aef4872ef6c58d47"
        },
        "permalink": "/r/movies/comments/1kw5kzv/marcel_ophuls_oscarwinning_filmmaker_of_the/"
    },
    {
        "id": "1kw4mt7",
        "author": "Ghostmoderator",
        "title": "Long ass day movies",
        "content": "What are movies that if it was actually real, that by the end of the movie you would say to yourself \"Damn, that was one long ass day!\" A couple examples of this are Training day and Changing Lanes. I think these kind of movies will always leave you thinking about life for a bit afterwards. The movie doesn't necessarily have to take place all in one day, but they usually do.",
        "upvotes": 135,
        "comments": 310,
        "media": null,
        "permalink": "/r/movies/comments/1kw4mt7/long_ass_day_movies/"
    },
    {
        "id": "1kws6hs",
        "author": "dancingbanana123",
        "title": "What Oscar winner had the worst career afterwards?",
        "content": "Usually, winning an Oscar is seen as a huge boost for ones career and that actor/director/whatever tends to have an easier time finding good movies to work on. However, presumably if someone continues to have box office fail after box office fail afterwards, they would start to lose that success and slowly stop appearing in big movies. Who are some people like this? It doesn't have to be an actor or actress, it can be a writer, cinematographer, etc. I'm curious on what the outlier cases look like.",
        "upvotes": 2,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1kws6hs/what_oscar_winner_had_the_worst_career_afterwards/"
    },
    {
        "id": "1kwrvlr",
        "author": "Affectionate-Age715",
        "title": "Just finished rewatching Lawrence of Arabia. Noticed something.",
        "content": "I have watched this movie at least 2 dozen times in full and countless times through rewatching my favorite clips. I can quote this movie in my sleep.\n\nOn this rewatch, I noticed something.\n\nWhenever he's in control, or in a dominant or comfortable position, or victory, he is framed in the left looking towards the right.\n\nWhenever he's in danger, or undertaking a difficult task, or generally uncomfortable, or defeat, he's framed in the right looking to the left.\n\nHe's positioned in the centre when he's in a state of ambivalence, being not quite sure where he'd be, what he'd do.\n\nBe it the beginning of the movie where he's reading his bike, or him leading into the desert, with his guide Tafas. Or him admonishing Sherif Ali for killing his guide, him reaching Faisal's camp, talking to the prince privately, formulating the attack on Aqaba, crossing the nefud desert, rescuing Gasim, attacking Aqaba, walking with Allenby after convincing him to take Jerusalem, bombing the Turkish railways, agreeing to take Damascus, riding with his men towards Damascus, sitting in the aftermath of a brutal battle with a turkish brigade. In all these situations, he's framed in the left looking rightwards.\n\nWhenever he's expressing displeasure or vulnerability, or conceding defeat, like being unhappy in the cartography room, being commanded to do something by his superiors, trying to convince Colonel Brighton and Prince Faisal to fight the right way, and later on trying to defend himself and convince Allenby to continue blowing up the Turkish strongholds, talking about how he was born out of wedlock riding into the anvil to save Gasim, later executing Gasim, leaving Aqaba to ride into Sinai, trying in vain to save Farraj from quicksand, trying to pass off as Arab when getting caught, suffering torture from the Turks, getting shot at by that turkish soldier. Him getting smacked by the british officer in the military hospital in Damascus and him finally leaving Arabia. In all those instances, he's framed in the right looking leftward.\n\nWhenever he's in center, like him deciding to put Daud out of his misery, him talking about how he enjoyed the execution, him weighing the options between a job back home or go back to the Arabs, him pausing  before joining in the slaughter of the Turkish brigade.\n\nI wonder if it's a cheeky in joke about Peter O'Toole being left handed.\n\nOr a psychological trick, being that the Earth spins from west to east, a direction we associate with left to right. Him going towards the left from the right is him essentially going against what is written according to him.\n\nOr a deeper commentary about how Lawrence is powerful when he embraces the contradictions of an Englishman going 'native', buying into his own hype, deciding for himself. He's weakened when he has to defend himself, his authority is questioned, he denies the contradiction and he starts to doubt himself.\n\n\n\nAll I know is, this film never ceases to amaze me\n\n",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1kwrvlr/just_finished_rewatching_lawrence_of_arabia/"
    }
]