[
    {
        "id": "1k44frp",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - David Bushell - Monday 4/21 at 7:00 PM ET - Director of 'Cheech and Chong's Last Movie' - Exploring their 5-decade career performing stand-up, making records, and starring in hit films. It covers their lives, comedy partnership, and lasting influence on pop culture.",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hkp0zoco14we1.jpeg?auto=webp&amp;s=04eb510faf542f6abf1ce7a72268ac8279254fe5"
        },
        "permalink": "/r/movies/comments/1k44frp/amaqa_announcement_david_bushell_monday_421_at/"
    },
    {
        "id": "1k33sz5",
        "author": "SonyPictures",
        "title": "Hey everyone - Peter Stormare here. My upcoming movie, UNTIL DAWN, is out in theatres on April 25th. I'll be back this upcoming Tuesday, April 22nd at 9:30 AM PT to answer your questions about Until Dawn and anything else you might want to know. Ask me anything.",
        "content": "[ I'm looking forward to chatting with you about my upcoming movie UNTIL DAWN, which is in theatres on April 25th. Join me on r\\/movies this upcoming Tuesday, April 22nd from 9:30am PT-10:30am PT as I answer your questions about Until Dawn and anything else you might want to know.](https://preview.redd.it/132fqamd6uve1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=041be0644f759a3eb6c103e45b6ae0070d98170c)\n\n",
        "upvotes": 151,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1k33sz5/hey_everyone_peter_stormare_here_my_upcoming/"
    },
    {
        "id": "1k3wc44",
        "author": "ShoebillJoe",
        "title": "Little Miss Sunshine hits HARD in 2025",
        "content": "I (37 M) cried multiple times on this rewatch. A family is struggling financially while torn apart by generational gaps, politics, and ethics. Familial failure is held together only by their need to help a little girl. Not to help her win, but to simply participate in her dream. A twisted dream defined by poor American standards. But despite the family's failures, they are brought together by what really mattered the whole time: their love for one another and a common goal. \n\n  \nIt's also a great look at early Carell and Dano. \n\n  \nDoes anyone else miss those feelgood vibes that we were getting in the early 2000s from indie movies before streaming was huge?",
        "upvotes": 2942,
        "comments": 236,
        "media": null,
        "permalink": "/r/movies/comments/1k3wc44/little_miss_sunshine_hits_hard_in_2025/"
    },
    {
        "id": "1k41k7p",
        "author": "indiewire",
        "title": "David Cronenberg Doesn't Care About Movie Theaters",
        "content": "",
        "upvotes": 621,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J_TM_5C5PuDRrAR1PRlF0CYjnAbWwOdkwLXKw-aoJGg.jpg?auto=webp&amp;s=4ddb30a8169d727c5c8e94df536e5f344c8a8aff"
        },
        "permalink": "/r/movies/comments/1k41k7p/david_cronenberg_doesnt_care_about_movie_theaters/"
    },
    {
        "id": "1k3iybx",
        "author": "evilangel101",
        "title": "Always loved Jena Malone's and Emily Browning's response to how it feels to play a sexualized female character.",
        "content": "",
        "upvotes": 12102,
        "comments": 883,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kdzacz0lmyve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1k3iybx/always_loved_jena_malones_and_emily_brownings/"
    },
    {
        "id": "1k40i81",
        "author": "Amaruq93",
        "title": "\"The Bride of Frankenstein\" at 90: A 1935 horror sequel that changed movies forever",
        "content": "",
        "upvotes": 592,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kM8BMACAcIVRdvHlrb1f7z2yid7XmDmLEmhixn5L_kQ.jpg?auto=webp&amp;s=dd662caf40ad6194ed0a74c3b872dd870fc8b032"
        },
        "permalink": "/r/movies/comments/1k40i81/the_bride_of_frankenstein_at_90_a_1935_horror/"
    },
    {
        "id": "1k3pmdc",
        "author": "Retrofusion11",
        "title": "Fury Road is absolutely incredible… how did no one die filming this movie",
        "content": "Might be the GOT action film, phenomenal filmmaking. The fact that no one was killed on this movie is actually a feat in its entirely. Is it true that Miller didn't write a script but had each scene sketched and drawn out? either way this movie's failure at the box office will be talked about for years to come. It should of been a success ",
        "upvotes": 2582,
        "comments": 428,
        "media": null,
        "permalink": "/r/movies/comments/1k3pmdc/fury_road_is_absolutely_incredible_how_did_no_one/"
    },
    {
        "id": "1k3sj00",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies did a complete 180 and switched genres halfway through?",
        "content": "From Dusk Till Dawn is the first movie that comes to mind. What starts off as your usually run of the mill crime movie turns into a vampire slasher with a mild emphasis on foot fetishes…\n\nI personally wasn’t a fan of the genre switch but I do respect the originality and risk taking. What other movies made a complete 180 and switched genres halfway through?",
        "upvotes": 1211,
        "comments": 1368,
        "media": null,
        "permalink": "/r/movies/comments/1k3sj00/what_movies_did_a_complete_180_and_switched/"
    },
    {
        "id": "1k3v0jt",
        "author": "LiteraryBoner",
        "title": "Dogma - Alanis Morissette Is God",
        "content": "",
        "upvotes": 770,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WXuNYgRouaDruIYLtE_vHkVTh98KyXnhq9vSYRgnK8Y.jpg?auto=webp&amp;s=6b68019c952e36c81ec63ccb46926cab98f3e8bd"
        },
        "permalink": "/r/movies/comments/1k3v0jt/dogma_alanis_morissette_is_god/"
    },
    {
        "id": "1k3unpu",
        "author": "Pep_Baldiola",
        "title": "Bradley Cooper's Next Directorial “Is This Thing On?” Starring Will Arnett Wraps Production",
        "content": "",
        "upvotes": 639,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QUxgnTIdUrV7D7S9OqMnyWVTGdErlwFbUwxS6kfZwh0.jpg?auto=webp&amp;s=6dcb2fd43bf34db95ee6710133d15605f6132aa8"
        },
        "permalink": "/r/movies/comments/1k3unpu/bradley_coopers_next_directorial_is_this_thing_on/"
    },
    {
        "id": "1k41v80",
        "author": "Chessh2036",
        "title": "I Saw The Devil is one of the intense movies I’ve ever seen.",
        "content": "I finally sat down last night to watch this Korean film and it’s one of the most intense and unsettling revenge films I’ve ever seen. From showing the psychological toll of obsession, and how the desire for revenge can erode a person’s humanity. Questioning whether vengeance is ever truly satisfying—or just turns someone into the thing they hate. I can’t stop thinking about the ending. Nobody won. ",
        "upvotes": 153,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1k41v80/i_saw_the_devil_is_one_of_the_intense_movies_ive/"
    },
    {
        "id": "1k42dln",
        "author": "Bennett1984",
        "title": "The Rutger Hauer Sci-Fi Films That Aren't Blade Runner",
        "content": "",
        "upvotes": 110,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pKTbQJ20RLXQWhWEW0wnY4tvZVRpgL36zC-RfSlCU4c.jpg?auto=webp&amp;s=0966452ed00e281a0eb6b245d83cd92cf45eaa1d"
        },
        "permalink": "/r/movies/comments/1k42dln/the_rutger_hauer_scifi_films_that_arent_blade/"
    },
    {
        "id": "1k4159g",
        "author": "uofwi92",
        "title": "Famous Movie Fails",
        "content": "Not blooper mistakes like a stormtrooper banging his head on a door or a continuity error like an American flag having 50 stars in a movie set in 1945.\n\nI’m talking about something like (not a movie scene, but TV) Kevin spilling the chili. \n\nScenes of people dropping things. Of people tripping and falling. Things like that.\n\nI’m always fascinated when I see stuff like that - how do they make it look so real? I know some actors are very talented at pratfalls, but being realistically clumsy is a whole ‘nother level.",
        "upvotes": 104,
        "comments": 171,
        "media": null,
        "permalink": "/r/movies/comments/1k4159g/famous_movie_fails/"
    },
    {
        "id": "1k3ozwf",
        "author": "AdSpecialist6598",
        "title": "'Ne Zha 2' English Dub Targets Global Market After Record China Run",
        "content": "",
        "upvotes": 399,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0blO6Xq-yMLYU7Az0iiQJW-i45fMeQUpl58pZ4xUmCE.jpg?auto=webp&amp;s=9235b2d0bc96e14a3a5847ea5541c7d26d024761"
        },
        "permalink": "/r/movies/comments/1k3ozwf/ne_zha_2_english_dub_targets_global_market_after/"
    },
    {
        "id": "1k47r6x",
        "author": "Freddy-Philmore",
        "title": "anyone else notice Deadline drops plot twists and reveals in box-office reports now like it's no big deal?",
        "content": "**I saw a film in theaters this weekend, and a pretty big  reveal was just casually dropped in the Deadline** box-office **article like it was nothing. No reason for it... just tossed in like a throwaway line.**\n\nSo now I imagine Deadline reporting on older movies the same way:\n\n* &gt;!*The Sixth Sense* tops the box office. The “Bruce Willis is a ghost” thriller stunned audiences.!&lt;\n* &gt;!*The Empire Strikes Back* strikes it rich as the “Darth is Daddy” space saga takes off.!&lt;\n* &gt;!*Friday the 13th* surprises Paramount as the “Mom is the killer” slasher cuts through expectations.!&lt;\n* &gt;!*Parasite* becomes a breakout hit as the “people secretly living in your basement” thriller walls off the competition.!&lt;\n\nLike… what are we doing here?",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1k47r6x/anyone_else_notice_deadline_drops_plot_twists_and/"
    },
    {
        "id": "1k3swx3",
        "author": "Any-Tradition7440",
        "title": "Which moment from history has been most frequently portrayed in film?",
        "content": "I’m watching the Crown and its depiction of the Apollo 11 mission, including the interview with the crew. It got me thinking about how many times I’ve seen this event portrayed in different movies and series, across time and genres, due to the historical significance and it’s impact on individual stories, themes and characters. What other historical moments are often portrayed like this and why do you think that is? What’s your personal favorite? \n\nI think a safe bet for a general category of moments might be World War 2, there are so many moments that resonates deeply with audiences and are interesting to portray in media from different perspectives. What else? ",
        "upvotes": 128,
        "comments": 132,
        "media": null,
        "permalink": "/r/movies/comments/1k3swx3/which_moment_from_history_has_been_most/"
    },
    {
        "id": "1k34md7",
        "author": "These_Feed_2616",
        "title": "I sometimes forget how small Leonardo DiCaprio’s filmography is",
        "content": "If you look at his Wikipedia, there’s not many films, there’s only like 20. Plus he only really makes like 1 film every 3-4 years. Really shows how selective and picky he is when it comes to the roles he does, he really makes sure there isn’t any garbage in his filmography, he wants it to be a completely solid resume. ",
        "upvotes": 6372,
        "comments": 785,
        "media": null,
        "permalink": "/r/movies/comments/1k34md7/i_sometimes_forget_how_small_leonardo_dicaprios/"
    },
    {
        "id": "1k3vwg6",
        "author": "deep_sea2",
        "title": "What are some great movies to LISTEN too?",
        "content": "When doing work, I often like to play movies in the background. This means that I often listen to and not watch the movies. What are some movies that are great to listen to without any visuals? This can include movies which are focused on dialogue, but can also include movies with great scores and sound design (e.g. Lynch has great sounds in his movies).",
        "upvotes": 52,
        "comments": 209,
        "media": null,
        "permalink": "/r/movies/comments/1k3vwg6/what_are_some_great_movies_to_listen_too/"
    },
    {
        "id": "1k3fz0c",
        "author": "Clankortio",
        "title": "What are some movies that begin with a break up, and main character moves on?",
        "content": "My long-term girlfriend and I recently broke up, and I’ve been feeling pretty lost. I’m looking for a movie where the main character gets dumped but eventually grows, finds peace, or learns to love themselves or learns to love somebody new. \n\nJust need something hopeful to remind me it gets better. Would really appreciate any recs.",
        "upvotes": 710,
        "comments": 526,
        "media": null,
        "permalink": "/r/movies/comments/1k3fz0c/what_are_some_movies_that_begin_with_a_break_up/"
    },
    {
        "id": "1k3sqjo",
        "author": "ChiefLeef22",
        "title": "Bring Her Back | Official Promo HD | Directed by Danny &amp; Michael Philippou",
        "content": "",
        "upvotes": 62,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmreGPYEhesVtoRUehySbFYS3S4yVmKOzIa-UFraP4Q.jpg?auto=webp&amp;s=e1ac2fc979b35a8a40f92211a68a1d71714c53f0"
        },
        "permalink": "/r/movies/comments/1k3sqjo/bring_her_back_official_promo_hd_directed_by/"
    },
    {
        "id": "1k4638n",
        "author": "Wizzythumb",
        "title": "Dutch guy creates official Hollywood movie trailer music from his attic",
        "content": "(English auto subtitles are available on this video).\n\nMost humble and relaxed non-Hollywood Dutch guy creates official trailer music for productions such as BabyGirl and The White Lotus from his attic in Rotterdam, The Netherlands.",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5WW5oGMv_siihWGJnBhDhXWgl__HAu1K95yuILy4eOM.jpg?auto=webp&amp;s=7023d141f897c9c56ff369061df6bad7bda32b30"
        },
        "permalink": "/r/movies/comments/1k4638n/dutch_guy_creates_official_hollywood_movie/"
    },
    {
        "id": "1k43n67",
        "author": "LeftCulture8653",
        "title": "What's a movie you love (or just like) that you can't bring yourself to watch?",
        "content": "Like, for me, it’s Brave. It’s an amazing movie and I fucking love it. The storytelling, the backstory, the bad-ass that is Merida. Plus it’s really funny. But I cannot watch it. I have an awful “relationship” with my mother/maternal figures in general. I won’t get into it too much, but essentially she abandoned me and my dad a bunch of times when I was really little. Then I grew up as the kid without a mom and then had one really shitty maternal figure. Her and my dad broke up and I had/have someone who doesn’t respect my boundaries when it comes to maternal things. She tries to be my mother and then acts offended when I’m uncomfortable with it. \n\nSo, yea, lots of mommy issues and now I can’t watch a fucking masterpiece that’s literally just mommy issues and folklore abt bears. I’m not too sure how accurate it is but it’s a Disney movie, not a documentary. But it sucks cuz I really want to rewatch it but I don’t know if I can bring myself to.",
        "upvotes": 9,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1k43n67/whats_a_movie_you_love_or_just_like_that_you_cant/"
    },
    {
        "id": "1k3idc7",
        "author": "VOIDPCB",
        "title": "The Holy Mountain",
        "content": "",
        "upvotes": 187,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/silecDtwFDEJF7yrIuKu2uDexgWpaSwShYQfLWAnI9U.jpg?auto=webp&amp;s=b26187d37223bf1b49fea1c7f3f5181f92d80a9f"
        },
        "permalink": "/r/movies/comments/1k3idc7/the_holy_mountain/"
    },
    {
        "id": "1k32v08",
        "author": "JorReno",
        "title": "I saw an image of Tim Curry on social media. Which has prompted me to make this post about Tim Curry...",
        "content": "We all love Tim Curry... but I don't think we stop to appreciate just how amazing he really is. He's an actor, sure... but he can also sing. And sing well! He's willing to undergo makeup and prosthetics to transform himself into crazy characters. But he's also very open to various role offers; from The Hunt For Red October, to Home Alone 2: Lost In New York.\n\n\nBut on top of his amazing live action roles... he is a very prolific voice actor too! Ferngully, Scooby Doo, Wild Thornberrys... if you grew up in the 80s and 90s, dollars to donuts you know his voice! And if you grew up after the 80s and 90s... he has also narrated a few books on Audible. I personally own A Christmas Carol, read beautifully by the man himself!  \n\nHe's had a pretty diverse career in TV. Tim even made the venture into video games. Most infamously was Command &amp; Conquer. I don't know much about his career on stage... but apparently he did that too! And two music videos! Thank you, Wikipedia! \n\n\nHe's worked with Muppets, kids, and even Alec Baldwin! Just goes to show that he is patient and open minded as an actor. But, he's also a very kind person. Seldom will you ever hear anyone say anything but positive things about meeting Tim Curry. He is always very grateful for his career, and has so much time for his fans. \n\nHe has suffered some health problems in recent years... and that sucks. But he hasn't given up! Tim Curry is a fighter and still has all his charm and quick wit that we've come to know him for throughout the years.\n\nI personally will always remember him best from Legend, Muppet Treasure Island, and Home Alone 2... three movies from my childhood. If you line all three of his characters up side by side and told a random person in the street that it was all the same actor... they'd probably laugh in your face. Speaking of laughing... he apparently auditioned for The Joker before Mark Hamill got it. Would've loved to hear that take!\n\n\nHe is the reason so many people are afraid of clowns... but he is also the reason so many people fell in love with his films. \n\n\nTim Curry.\n\n\nhttps://i.imgur.com/29qFh8i.jpeg",
        "upvotes": 2427,
        "comments": 410,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NtqNtM3UtPtoE4Gi06cErgiIHDAdlskTfNMN6t4X3U8.jpg?auto=webp&amp;s=b2694d88bfd362ed829154a6bdf202ebc2d54e5a"
        },
        "permalink": "/r/movies/comments/1k32v08/i_saw_an_image_of_tim_curry_on_social_media_which/"
    },
    {
        "id": "1k3da3z",
        "author": "One_Adhesiveness4037",
        "title": "I was expecting Deep Impact to be an action-filled and intense movie. To my surprise, it wasn't, and it almost left me weeping.",
        "content": "So I was bored and nothing left to watch in Netflix. Decided to picked the Deep impact and I expect that it was like, The day after tomorrow. But it was not, it was hearfelt. Made me think that it could happen to us, and a lot would perish. \n\nIf this this could happen, given the lack of time. I would just stay in my house and would not even try to fight.\n\nIt really a sad movie thou. Really caught me off guard. Hahaha",
        "upvotes": 467,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1k3da3z/i_was_expecting_deep_impact_to_be_an_actionfilled/"
    },
    {
        "id": "1k3bv13",
        "author": "MrGittz",
        "title": "This press conference from the TIFF premiere of “Reservoir Dogs” shows that Quentin Tarantino was at his fully formed Quentin Tarantinoness right out of the gate. This is a 1st time director with almost zero self doubt about his ability. Also, the world is owed that John Woo/QT collab",
        "content": "",
        "upvotes": 548,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KWIGs1nFmJSUCJBfXF72lB_vV9xnhlsYQI-KzDfvuYs.jpg?auto=webp&amp;s=39c55f8e6591d6f0cd265ff8d5f7fed9f20853c7"
        },
        "permalink": "/r/movies/comments/1k3bv13/this_press_conference_from_the_tiff_premiere_of/"
    },
    {
        "id": "1k37f8i",
        "author": "will_scc",
        "title": "Does it bother people when time limits given in movies are not followed?",
        "content": "I've just watched San Andreas, which is a fun but unsurprisingly unrealistic movie, but one thing that's stood out to me as particularly immersion breaking is the use of time. It's just arbitrary.\n\nFor example, at the start of the film there's a scene where a rescue helicopter is running low on fuel whilst hovering during a rescue.\n\nThe Rock (I don't even think the character has a name, it's always just The Rock playing himself) says \"we have 5 minutes!\". \n\nAbout 15 minutes later and the helicopter is still going. And then they finally rescue the girl and fly back to base, the lack of fuel completely ignored for the rest of the flight.\n\nThe scene already had plenty of jeopardy, why add low fuel as well if it's going to be ignored immediately?! \n\nAnd then later, The Rock is saving his daughter from drowning whilst appearing to hold his breath for 30mins all while doing intense physical exertion. \n\nBonus points for him watching her drown before deciding to try kicking the blockage to free her...\n\nDo these silly time related discrepancies annoy anyone else more than they should? \n\nIs there a name for this?\n\n",
        "upvotes": 1036,
        "comments": 283,
        "media": null,
        "permalink": "/r/movies/comments/1k37f8i/does_it_bother_people_when_time_limits_given_in/"
    },
    {
        "id": "1k47uva",
        "author": "HouseOfYards",
        "title": "Did Fargo (1996) Use Doubles in the Marge and Jerry Dealership Scene?",
        "content": "My husband is a huge fan and prob watched it like a hundred times. He argues that in the dealership scene where Marge questions Jerry about the missing car. There are actually 2 times they were in the dealership talking to each other but either way. In some shots, especially from behind or over-the-shoulder angles, the hair of the person sitting across from Marge doesn’t quite look like William H. Macy’s, and the same goes for the reverse shots with Marge. He feels like they might’ve used doubles for these shots, maybe because the actors weren’t filmed on the same day? Has anyone else noticed this, or is there any behind-the-scenes info (e.g., from commentaries or interviews) about whether doubles were used? I just don't see it but he insists that's the case. Could it just be a continuity issue with wigs or lighting?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1k47uva/did_fargo_1996_use_doubles_in_the_marge_and_jerry/"
    },
    {
        "id": "1k36usm",
        "author": "karmagod13000",
        "title": "Movies that Start Slow and End Up Being Insane",
        "content": "A lot of people judge movies off the first fifteen minutes and if it doesn't catch their interest then switch it off.  What are some of the sleeper films that, if you pay attention and stay onboard, they pay off in spades?  \n\nI know after There Will Be Blood there was a lot of pressure for PTA to make a good follow up and the first half of The Master is almost daring you to fall asleep, but as it goes on the movie's character relationships start to really take off.  Any movies you almost turned off only to end up being sucked in by the middle?",
        "upvotes": 1037,
        "comments": 1233,
        "media": null,
        "permalink": "/r/movies/comments/1k36usm/movies_that_start_slow_and_end_up_being_insane/"
    },
    {
        "id": "1k3kfen",
        "author": "Magical_critic",
        "title": "What's the largest time gap between two oscar nominations for the same individual?",
        "content": "I noticed that Sylvester Stallone was nominated for Rocky in 1977 but his next nomination wasn't until 2016 for creed, making it a 39 year gap between nominated oscars. I'm sure there are people in the business out there who have a larger time gap between their continuous oscar nominations, so what are some other examples of large time gaps like Sylvester Stallone? They don't necessarily have to be for the same category. ",
        "upvotes": 70,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1k3kfen/whats_the_largest_time_gap_between_two_oscar/"
    },
    {
        "id": "1k38tcq",
        "author": "lawrencedun2002",
        "title": "How Ryan Coogler Discovered Musical Prodigy Miles Caton for ‘Sinners’ and What the New Actor Learned from Michael B. Jordan",
        "content": "",
        "upvotes": 562,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tL3FmagcedyLvSv0inPGxEeQ0PAs-ofa6hm_17RaVKQ.jpg?auto=webp&amp;s=b542fb7886092815e3d7d5a72e79558884e54baf"
        },
        "permalink": "/r/movies/comments/1k38tcq/how_ryan_coogler_discovered_musical_prodigy_miles/"
    },
    {
        "id": "1k3qml9",
        "author": "DCRBftw",
        "title": "In search of movies like A Beautiful Mind/Shutter Island",
        "content": "Not necessarily mental illness, but movies where what is going on as we see it and as the character in the movie sees it may not be what's really happening -- or where the experience of the main character may be a different reality than what everyone else experiences.  Thanks for any suggestions, I appreciate it.",
        "upvotes": 18,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1k3qml9/in_search_of_movies_like_a_beautiful_mindshutter/"
    }
]