[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 464,
        "comments": 3188,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1na08er",
        "author": "Putrid_Care_9888",
        "title": "wednesday jenna ortega portrait, by me",
        "content": "",
        "upvotes": 200,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1na08er/wednesday_jenna_ortega_portrait_by_me/"
    },
    {
        "id": "1na7bk1",
        "author": "SlowAerie3866",
        "title": "Good murder suspense, thriller shows to watch?",
        "content": "Recently watched the Residence, Dept Q, Untamed which were good shows. Any other shows like these? I also tried watching the hunting wives and that show was not good at all.",
        "upvotes": 39,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1na7bk1/good_murder_suspense_thriller_shows_to_watch/"
    },
    {
        "id": "1n9xhl5",
        "author": "AppropriateAdagio972",
        "title": "Question about the Michigan High School Documentary",
        "content": "Did Kendra Licari get paid for her part in the documentary? Just curious because I watched when high and am genuinely curious. Hope anyone reading haves a good day!!",
        "upvotes": 38,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1n9xhl5/question_about_the_michigan_high_school/"
    },
    {
        "id": "1nagcn6",
        "author": "Eclipse8301",
        "title": "Account sharing question",
        "content": "I currently have my own account and would like a family member to add me on his account ($8.99). Should I cancel my account or will whatever my family member does overwrite and “update” my plan?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nagcn6/account_sharing_question/"
    },
    {
        "id": "1na30y8",
        "author": "Proper_Bridge_1638",
        "title": "Love Con Revenge - Question re. Dr. Wickerson",
        "content": "If you’ve watched Love Con Revenge and the episode “A Fraudster in the Family,” I can somewhat understand why there was nothing they could do about the money that was “stolen” from his wife. I assume she was investing in a business that she had ownership in and the money was used to pay for operating costs.\n\nHere is my question… Why didn’t the stepdaughter go after him for identity theft if he was taking out loans in her name? I wish they explored this more. The episode felt anti-climactic when they tracked him down, only to say nothing happened afterwards. \n\nWhat are your thoughts? 🕵️‍♀️🕵️‍♀️🕵️‍♀️",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1na30y8/love_con_revenge_question_re_dr_wickerson/"
    },
    {
        "id": "1na3cqv",
        "author": "Warm-Big1567",
        "title": "What Happened to The Summer Hikaru Died?",
        "content": "I was in the middle of watching this anime and when it was supposed to go to the next episode is wasn’t there. The info page then has no episodes listed, only teasers and more like this. I closed Netflix and reopened it but when I searched the show up again it wasn’t even there. \n\nWhat’s happening?",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1na3cqv/what_happened_to_the_summer_hikaru_died/"
    },
    {
        "id": "1nagqg7",
        "author": "Mocha_1234",
        "title": "Netflix's reuse of this trope in stranger things and wednesday??",
        "content": "I just got around to watching Wednesday season two, and i was already not enjoying the show much. then in episode four they reveal that the character 'Lois' is not a person in the show but a secret program. i paused the show because i swore i heard those lines before, and after thinking about it for literally half a second, i realize they did the exact same shit in stranger things. whatever secret organization was training eleven was named NINA, and the characters thought it was a name before discovering it was actually a secret program. i thought the show was uncreative before with all the cliche plotlines (such as the person in the hood disappearing from across the street when a vehicle passed by), but now they're actually straight up reusing tropes for shows that are one of the most popular on the entire streaming service! people really pay for this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nagqg7/netflixs_reuse_of_this_trope_in_stranger_things/"
    },
    {
        "id": "1naakbl",
        "author": "Firm-Contact7808",
        "title": "Aaron from Love Con Revenge deserves Justice #LoveConRevenge",
        "content": "I just finished watching Love Con Revenge, which by the way lacks any type of flow or consistency between cases, and feels heavily scripted. But, anyway, I would like to highlight Aaron's case. He came across as such a sweetheart, and I cannot believe he has not gotten any justice. What is your thoughts?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1naakbl/aaron_from_love_con_revenge_deserves_justice/"
    },
    {
        "id": "1na8skx",
        "author": "Empty-Instruction282",
        "title": "New Netflix Rom Com movie French Lover starring Omar Sy official trailer.",
        "content": "talented actor Omar Sy stars in French Lover, a 2025 Netflix rom-com about a jaded actor falling for a waitress. Known for Netlfix Lupin hit serie and famous french movie Untouchables, Omar Sy’s charm shines. Directed by Lisa-Nina Rives, it premieres September 26 on Netflix. What is Omar Sy best movie and serie? top 5?\n\n* Lupin (2021–present)\n* Untouchables (2011)\n* Two Is a Family (2016)\n* The Takedown (2022)\n* Samba (2014)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na8skx/new_netflix_rom_com_movie_french_lover_starring/"
    },
    {
        "id": "1nadxbw",
        "author": "BearyBearBearBear",
        "title": "Netflix on Xbox series x",
        "content": "I’ve been watching Netflix on my Xbox for well over a year now but all of a sudden it does not want to display properly. The audio plays fine but the glitch is with the display. Either splits into four screens and only shows grey screens or just stuck on the title screen and audio keeps going.  It’s not the hdmi as YouTube and all the games work find. I’ve uninstalled and reinstalled Netflix but it hasn’t made a difference. It has become unusable on my xbox. Anyone have this happen to them or know of any solutions? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nadxbw/netflix_on_xbox_series_x/"
    },
    {
        "id": "1na2rfs",
        "author": "Training-Plastic1457",
        "title": "Rewatching Vampire Diaries",
        "content": "I have today started rewatching Vampire Diaries from season one. And I gotta say that Elena is as insufferable as ever. Good thing is I am still Team Damon. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1na2rfs/rewatching_vampire_diaries/"
    },
    {
        "id": "1nad4qf",
        "author": "Rayne_FTW",
        "title": "Show that was similar to Friend request/Unfriended",
        "content": "My girlfriend and I have been looking for a show we watched a couple years ago that was similar to Friend Request and Unfriended. All I remember is that the premise is a bunch of new college kids are drinking at a party at the start of the show and then someone gets killed. Someone kept texting the characters about who will die and when. The dudes name always showed up as Monkey something? I cant remember. The end of the show takes place in like a skatepark underneath a bridge or something like that. I have been looking for over an hour to try to rewatch it. Does anyone remember any show that was like this? Thanks!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nad4qf/show_that_was_similar_to_friend_requestunfriended/"
    },
    {
        "id": "1n9tcqi",
        "author": "ysleez",
        "title": "The Chestnut Man, a really engrossing Nordic thriller!",
        "content": "I really liked it. It's a great crime thriller with a ton of climax and tense atmosphere all around. The whole vibe is perfect, super dark, gloomy Scandinavia and I love the role the little chestnut mans play in it. The main detectives, Thulin and Hess, have that classic clashing-partners dynamic that totally work. The story may not make a lot of sense until you know the chain but it does well to ask you to just go with it. Also, a heads-up, it is quite graphic. Even with its flaws, it’s an awesome watch if you're looking for a dark, fast-paced thriller with some good twists and turns that'll keep you hooked, go for it!\n\nI'd give it a 7.8/10\n\nFlaws: some may feel its a bit predictable (I didn't feel that way) at the end and you have to suspend your beliefs about the killer's abilities lol.",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n9tcqi/the_chestnut_man_a_really_engrossing_nordic/"
    },
    {
        "id": "1nac0nl",
        "author": "Ghostbuster004",
        "title": "Best comedy drama series to watch?",
        "content": "Somebody suggest me a best comedy drama series on Netflix which would relive any stress and bring laughter. I just finished never have I ever and I love it. I'd appreciate if it has a same vibe as never have I ever. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nac0nl/best_comedy_drama_series_to_watch/"
    },
    {
        "id": "1na5eln",
        "author": "Fit-Force-9125",
        "title": "Should I watch Pop Star Academy Katseye?",
        "content": "I recently got into Katseye via K-pop Demon Hunters and I like it a lot and I heard there was a show on Netflix where they show the members trying to get into the group so should I watch it??",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1na5eln/should_i_watch_pop_star_academy_katseye/"
    },
    {
        "id": "1naaudd",
        "author": "NightmareOmega",
        "title": "Demon Slayer and Dan Da Dan missing?",
        "content": "I just tried to watch both Demon Slayer and Dan Da Dan and they've been removed as far as I am able to tell. Is anyone else in the US able to access them/confirm or is this a technical issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1naaudd/demon_slayer_and_dan_da_dan_missing/"
    },
    {
        "id": "1naafv4",
        "author": "bigguys45s",
        "title": "For those who watched the Devo music documentary: thoughts/ opinions on it?",
        "content": "As a lifelong fan, I really liked it, but honestly thought/ felt like there could’ve been more talk about the later albums and songs during the mid to late 80’s era of Devo.\n\nBut well made and very interesting/ insightful as well. Definitely a recommended watch, especially for first time Devo listeners.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1naafv4/for_those_who_watched_the_devo_music_documentary/"
    },
    {
        "id": "1n9pu3u",
        "author": "ExpensiveOstrich3559",
        "title": "Katrina: Come Hell and High Water",
        "content": "One of the best modern day documentaries I’ve watched. Few documentaries have made me cry at the end of it, however my heart ached for the people of New Orleans. The Federal Government incompetence and lack of support made me angry as well. The interviewees were very good at helping you make sense of what really happened. I’ve heard that some people didn’t like the Spike Lee episode, but I loved it. The personality and culture of New Orleans shone through the people. It also that the aftermath of Katrina still has a major impact on Modern day New Orleans. Very well done Netflix.",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n9pu3u/katrina_come_hell_and_high_water/"
    },
    {
        "id": "1n9ft4n",
        "author": "im_a_reddituser",
        "title": "Love Revenge Con is badly scripted/edited reality investigation but I’m glad those women had support",
        "content": "I wanted this to be engaging but this was not up to the usual quality I expect from Netflix. It was clear that much of the material was scripted and planned before on camera which made it feel wooden from these real people doing a great thing for these women who were struggling to move on.  The spacing and editing made me wish the 2x speed play feature was available on the tv. \n\nI wished it was more buttoned up because the investigator shared some good info but it’s a slog to get through and it feels like not enough people will see it. \n\nWhat did you think? ",
        "upvotes": 69,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1n9ft4n/love_revenge_con_is_badly_scriptededited_reality/"
    },
    {
        "id": "1na8a65",
        "author": "IdkWhatNameToUse135",
        "title": "Question about Adolescence episode 1",
        "content": "In episode 1, the officer says jamie has scratches on his arm. How comes they never scraped anything from under Katies nails to see if there was DNA under them, and if there was, test it against Jamie's DNA?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1na8a65/question_about_adolescence_episode_1/"
    },
    {
        "id": "1na5qha",
        "author": "Spartan-O7",
        "title": "Ads are skipping but so is the movie.",
        "content": "Hi, I'm having an issue on more than one device. When I'm watching a movie, it will completely skip the ads but also skip about 10 seconds of the movie. Anyone have this issue and/or know of a fix? Thanks.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1na5qha/ads_are_skipping_but_so_is_the_movie/"
    },
    {
        "id": "1na547r",
        "author": "Past-Ad1509",
        "title": "Grandiloquence",
        "content": "I have been watching Hollywood movie/series for a long time. &amp; I always find it little bit hard but when it cames to Brittish production/actors. Subtitle &amp; attention is a must. First I thought 'Wednesday' is British show, then found out it is not.\nIs it me or does anybody(non English speakers) finds it slightly hard to understand the dialouges of some characters in wednesday?? They use a lot of fancy words which we generally don't use in our conversation. is that a BRITTISH thing? \n\nThough I understand the context, I wrote down those fancy words just to understand the actual meaning. I found that there are literary 'all people know' synonym of those words. yet they choose not to use it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na547r/grandiloquence/"
    },
    {
        "id": "1na541a",
        "author": "57829",
        "title": "‘Wednesday’ Creators Unpack the Season 2 Finale: Gomez’s Tragic Backstory, Thing’s Origins and What Wednesday Thinks of Tyler Now",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na541a/wednesday_creators_unpack_the_season_2_finale/"
    },
    {
        "id": "1n9yix9",
        "author": "zkburnah",
        "title": "If I download movies can I watch them in a country if they’re unavailable in?",
        "content": "So im in Portugal and their selection is really good here. So if I download movies like Intersteller, Fast &amp; Furious etc then fly to the UK will I be able to watch them there or not?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n9yix9/if_i_download_movies_can_i_watch_them_in_a/"
    },
    {
        "id": "1n91xk3",
        "author": "Sweaty-Toe-6211",
        "title": "‘Halo’ Season 1-2 Joining Netflix in the United States in October",
        "content": "",
        "upvotes": 90,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1n91xk3/halo_season_12_joining_netflix_in_the_united/"
    },
    {
        "id": "1n9wea0",
        "author": "RayDaMan7",
        "title": "Why is the captioning/subtitles on Netflix so off?",
        "content": "This is not the only instance, but in much of the content I watch the closed caption differs from the spoken audio.  Does anyone know why this is? Who does their closed captioning? ",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zhdui1h0winf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n9wea0/why_is_the_captioningsubtitles_on_netflix_so_off/"
    },
    {
        "id": "1n9o1y6",
        "author": "cariesonmywaywardson",
        "title": "Great British Baking show Not showing up",
        "content": "Great British Baking show disappeared from all our accounts. Can’t search it. Deleted from list. On all accounts on all devices. Can’t find other titles too now. \n\nChat was totally useless and told me great British baking show is not a title and that it’s not a show.  \n\nAny ideas? \n\nThis is sole reason we get Netflix. And the utter uselessness of their chat help was comical. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n9o1y6/great_british_baking_show_not_showing_up/"
    },
    {
        "id": "1n95ehj",
        "author": "photoshop_2023",
        "title": "Have you watched Love Con Revenge?",
        "content": "What do you think of Love Con Revenge? I cant believe this happens to people! some of the stories are shocking and i feel so sorry for the victims. Its very well put together and worth a watch. ",
        "upvotes": 39,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1n95ehj/have_you_watched_love_con_revenge/"
    },
    {
        "id": "1na6ijw",
        "author": "Cool-Half9280",
        "title": "Brian L",
        "content": "Bruh, how old was Brian. Wasn’t Gabby around 19? He couldn’t have been that much older. Wondering about the receding hairline. I know many can start balding younger but they’d been together for a couple of years I believe. That’s really young. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1na6ijw/brian_l/"
    },
    {
        "id": "1n9u5ze",
        "author": "swisssf",
        "title": "Watching \"The Seduction of Joe Tynan\" on Netflix - Meryl's Streep's accent is very distracting",
        "content": "After years of being curious about the hard-to-find, acclaimed 1979 film, *The Seduction of Joe Tynan,* it has popped up on Netflix (Alan Alda, Meryl Streep, many others in supporting roles).\n\nI realize Meryl Streep is known as the great virtuoso of accents, but I'm finding *The Seduction of Joe Tynan* challenging to get through it, due to her character's \"Southern\" accent.\n\nStreep plays the daughter of an influential aristocratic Southern powerhouse of the Democratic Party but her accent is.......cloying, hammy, overdone, and inauthentic. It \"feels\" self-indulgent, like Streep determinedly set out to *master* a Southern accent. It seems self-conscious and affected to the point of caricature.\n\nI looked into it, and in a 1980 NY Times' interview, she says she modeled the accent after the way actress/singer/talkshow host, Dinah Shore speaks. Here's a video[ clip of Dinah Shore](https://www.youtube.com/watch?v=sI-pDqAe2do).  What Meryl Streep wields in *The Seduction of Joe Tynan* is not even in the same universe, much less state or region, as Dinah Shore.  It sounds more like a put-on or parody of a mish-mash of a dozen Southernesque accents.\n\nFurthermore, being the daughter of a rich man from Louisiana, and undoubtedly having been educated in the northeast, Streep's character would not have much of an accent at all in the late '70s.  But if she did, it would be a soft but distinctive accent from her particular area of Louisiana.  Instead we get a **gross distortion of Dinah Shore's** ***Tennessee*** **accent** by way of Florida Panhandle cracker--with a dash of Andy Griffith rural North Carolinian hick twang, a sprinkling of Scarlet O'Hara--and swallowed words and droppin' those G's as if she copied Sissy Spacek channeling Loretta Lynn in *Coalminer;s Daughter.*\n\nIn vibe it's precious---very smug, Yale Drama School MFA actress--and ironically, ultimately *inaccurate.*\n\nThe movie otherwise so far is pretty good, tho it unmistakably reflects the culture and \"liberal values\" circa 1979, which is a somewhat dated.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9u5ze/watching_the_seduction_of_joe_tynan_on_netflix/"
    }
]