[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n8g6e5",
        "author": "KveldssangerM",
        "title": "Truffa soldi per benzina - Zona S. Rita",
        "content": "Ciao a tuttə,\nvolevo segnalare che, in zona Santa Rita, si aggira una ragazza(sulla 30ina) bionda, capelli corti, con occhiali, che ferma le persone per strada per chiedere soldi per la benzina, fingendo che il POS del benzinaio sia fuori uso.\nPromette di restituire i soldi immediatamente tramite bonifico/Satispay presentando e inviando la foto di pagamento effettuato, che però in realtà è una semplice ricerca sul sito Unicredit, all'interno della quale lei scrive \"Ricarica {numero} effettuata, {somma} €\"; poi vi gira un documento d'identità falso, dicendovi che per il pagamento ci vogliono 24h.\n\nCerca di distrarre con informazioni aggiuntive e credibili, per esempio a me ha detto che lavora da BojaFauss, con sede sia a Torino che ad Alba.\n\nLa carta di identità fornita è purtroppo a nome di un'altra persona, Roxana, che è anche il nome con cui questa truffatrice si presenta.\n\nI carabinieri sono a conoscenza sia della truffa che del nome della truffatrice da mesi ormai, hanno inviato al tribunale decine di denunce, ma dicono di avere le mani legate fino alla decisione del tribunale.\n\nFate attenzione, io sono stato preso in un momento di distrazione. È molto brava a fingere che sia in una situazione di reale bisogno (con me ha finto di chiamare la madre per rassicurarla che aveva risolto e che sarebbe tornata presto a casa).\n\n",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n8g6e5/truffa_soldi_per_benzina_zona_s_rita/"
    },
    {
        "id": "1n8kttb",
        "author": "pietrosantoro13",
        "title": "Birra?",
        "content": "Ciao a tutti sono un ragazzo di 24 anni trasferitosi da pochissimo a Torino per lavoro. Chi si fa due chiacchere e una birra domani sera in zona San Salvario? Se siete simpatici la prima la offro io ",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w7cxdkbug7nf1.png?auto=webp&amp;s=6cad35284f524cccdbef69c950dae5c696d58c36"
        },
        "permalink": "/r/torino/comments/1n8kttb/birra/"
    },
    {
        "id": "1n8dmj5",
        "author": "Fit_Bake_6569",
        "title": "Che ne pensate di un listening bar a Torino?",
        "content": "Ciao a tutti,  \nsto ragionando su un’idea ancora molto preliminare e mi farebbe piacere avere un feedback schietto.\n\nIl concept è un **listening bar**: di giorno una caffetteria con colazioni semplici e genuine, senza fronzoli; la sera un cocktail bar con musica ascoltata da un buon impianto stereo.\n\nVorrei dare spazio anche allo **sport**: dalle partite di calcio, basket e tennis all’hockey su ghiaccio, NFL (un po’ in stile USA), insieme a un tocco di cultura skate e street. L’obiettivo è creare un posto dove ritrovarsi, bere qualcosa, ascoltare musica, guardare sport e stare insieme.\n\nSono ancora in fase di studio di costi, permessi e investimenti → quindi questo è solo uno “smoke test”.  \nSecondo voi, a Torino una cosa del genere potrebbe funzionare?  \nE se sì, **in quale zona ve lo immaginereste meglio**?\n\nGrazie a chi vorrà dire la sua!",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1n8dmj5/che_ne_pensate_di_un_listening_bar_a_torino/"
    },
    {
        "id": "1n8oi0t",
        "author": "Platform_Crocs",
        "title": "scambio linguistico",
        "content": "ciaoooo sono un americano da nyc e mi sono appena trasferito qui a torino la settimana scorsa. A New York ero un insegnante di inglese e ho lavorato all’università. Ho 24 anni e sto cercando per qualcuno cui aiutarmi con italiano e posso aiutarti con inglese :) non so esattamente il mio livello in italiano perché non ho mai fatto un lezioni in italiano. Ho vissuto a Roma and ho imparato da parlare con gente del posto. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8oi0t/scambio_linguistico/"
    },
    {
        "id": "1n8cdj0",
        "author": "Elegant-Credit7767",
        "title": "I see very few Indians here? Anyone up for a trip to Rome?",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8cdj0/i_see_very_few_indians_here_anyone_up_for_a_trip/"
    },
    {
        "id": "1n8i3eu",
        "author": "Tall-Split-5528",
        "title": "L’acqua del rubinetto/doccia e capelli crespi",
        "content": "Mi riferisco soprattutto alle ragazze, ma anche i vostri capelli fanno schifo dopo averli lavati con l’acqua che c’è qui a Torino?\nAd agosto ho passato le vacanze con la mia famiglia che vive al sud, e i miei capelli risultavano molto più voluminosi e luminosi, mentre quando li lavo qui mi sembrano più spenti e crespi. È una mia impressione oppure ha senso che ci sia questa differenza? Se sì, a cosa potrebbe essere dovuta e come potrei risolvere?? ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1n8i3eu/lacqua_del_rubinettodoccia_e_capelli_crespi/"
    },
    {
        "id": "1n8d69z",
        "author": "MonPorridge",
        "title": "Come raggiungere il santuario di Oropa?",
        "content": "Ciao a tutt\\*, volevo organizzare una gita tra amici per visitare il Santuario di Oropa, ma dal sito non si capisce come arrivare senza macchina. Qualcun\\* piò aiutarmi? Vale la pena passarci una giornata? Grazie!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n8d69z/come_raggiungere_il_santuario_di_oropa/"
    },
    {
        "id": "1n85h6h",
        "author": "Murky_Giraffe8700",
        "title": "WTF succede con i cinema a Torino? Nessun film in inglese?",
        "content": "Ciao a tutti,\n\nma sono solo io o a Torino è praticamente impossibile vedere un film al cinema in lingua originale (con sub inglese oppure italiano)?\n\nSto guardando la programmazione delle sale “commerciali” (UCI, The Space, ecc.) e non trovo **nemmeno una proiezione** in originale. Solo doppiaggi italiani ovunque.\n\nMi sembra assurdo per una città come Torino, con università piene di studenti stranieri e gente che magari vuole solo godersi un film senza doppiaggio.\n\nE se volete il Cinema Centrale, il Massimo, eccetera, ma io voglio vedere il cinema commerciale una volta al anno\n\nPer esempio, Harry Potter, ora tutto in italiano e solo in UCI e inglese, ma alle 21:00 al Lingotto...\n\nSeriamente wtf",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1n85h6h/wtf_succede_con_i_cinema_a_torino_nessun_film_in/"
    },
    {
        "id": "1n8kr0t",
        "author": "No-Ant-9038",
        "title": "Camerini con porta",
        "content": "C'è qualche negozio di vestiti a Torino che ha una porta da chiudere nei camerini, invece della solita tenda?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n8kr0t/camerini_con_porta/"
    },
    {
        "id": "1n8chbn",
        "author": "Alternative-Case-423",
        "title": "Argentinos por Turin!",
        "content": "Buenas, estoy recien llegado a Torino, algun Argentino por acá. O Alguien que se anime a probar el mate, el fernet y el asado! Envieme un mensaje por MD! Saludos ;) ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n8chbn/argentinos_por_turin/"
    },
    {
        "id": "1n8c5yf",
        "author": "Yara603",
        "title": "DAMS",
        "content": "Ciao a tutti! 🙌\nMi sono iscritta da poco al DAMS dell’Università di Torino (UniTo) e mi piacerebbe avere qualche consiglio da chi già studia o ha finito.\n\nMi interessano in particolare alcune cose:\n\nQuali sono gli esami più facili e quali quelli più difficili al primo anno?\n\nE… ci sono professori un po’ “antipatici” o particolarmente severi da sapere in anticipo?\n\nSono un po’ in ansia per l’OFA Italiano DAMS — qualcuno può raccontare la propria esperienza?\n\nDove trovate di solito appunti gratuiti, registrazioni delle lezioni o materiali utili? Esistono chat/gruppi di studenti?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n8c5yf/dams/"
    },
    {
        "id": "1n8701p",
        "author": "Lastmanintheearth",
        "title": "Dove mangiare questo weekend",
        "content": "Da sabato a lunedì saremo a Torino io e famiglia per visitare un po' di musei (egizio, automobile, cinema, parco del valentino, museo reale).\nConsigli su posti dove mangiare decentemente a pranzo o cena? Magari non cucina esclusiva a latticini... Alloggiamo in zona via porte palatine/via Garibaldi\n\nInoltre, ci muoveremo con la Piemonte card, quindi autobus e metro. Zone o cose a cui prestare attenzione, visto che abbiamo due bambini con noi?\n\nGrazie a chi risponderà!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n8701p/dove_mangiare_questo_weekend/"
    },
    {
        "id": "1n7adck",
        "author": "Mondonauta0206",
        "title": "2 anni fa ho avuto l'onore di assistere al famoso \"Concertino dal Balconcino\", diventato simbolo culturale di Torino dopo aver vinto una battaglia giudiziaria di un decennio con il condominio, così mi diceva un amico. Qualcuno conosce la vera storia di questo spettacolino bellissimo?",
        "content": "",
        "upvotes": 179,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rdcp6mdd7xmf1.jpeg?auto=webp&amp;s=c5136a1067dae4f680098dbf9b041d2e2d568266"
        },
        "permalink": "/r/torino/comments/1n7adck/2_anni_fa_ho_avuto_lonore_di_assistere_al_famoso/"
    },
    {
        "id": "1n85mfs",
        "author": "balmil",
        "title": "Trovare e offrire casa a Torino",
        "content": "Ciao a tutti\n\nInsieme a due amici sto per lanciare un'app per aiutare:\n\n\\- i fuorisede a trovare case o inquilini (e volendo anche tutti e due in un colpo solo)\n\n\\- i proprietari ad affittare l'immobile a persone verificate e in linea con le loro richieste\n\nSiamo stati tutti fuorisede e sappiamo quanto faccia schifo tutto praticamente. Vi lascio il link se qualcuno fosse interessato ad approfondire l'argomento",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sNDL8bScWd96BEu_YpyuOMuSCCHX-UlYgU78z0-Vxn0.png?auto=webp&amp;s=934d66be20ae005c9d64cfefd4c94329fe58218f"
        },
        "permalink": "/r/torino/comments/1n85mfs/trovare_e_offrire_casa_a_torino/"
    },
    {
        "id": "1n883ni",
        "author": "Desperate_Airline397",
        "title": "Spotto Studenti Iusto",
        "content": "Come da titolo spotto studenti dell’Università Salesiana di Torino- IUSTO per chiedere qualche info. Battete un colpo se ci siete, pls!!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n883ni/spotto_studenti_iusto/"
    },
    {
        "id": "1n7loyz",
        "author": "Effective_Excuse_667",
        "title": "Piazza rivoli: ci vivreste?",
        "content": "Ciao,\n\nIo e la mia compagna visiteremo un appartamento su piazza rivoli. Ricordo che Cenisia in teoria sarebbe un quartiere safe, secondo voi? C'è spaccio notturno?\n\nGrazie in anticipo ",
        "upvotes": 18,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pqgtqma2mzmf1.jpeg?auto=webp&amp;s=5efad920f8f19f8ef19ce7c2c46215bdbbd1c6ea"
        },
        "permalink": "/r/torino/comments/1n7loyz/piazza_rivoli_ci_vivreste/"
    },
    {
        "id": "1n7xjbw",
        "author": "Icy-Wear-2163",
        "title": "Where to buy vinyls in Torino?",
        "content": "Hello everybody! I’m in a small budget trip to this beautiful city and I wanted to know where can I get second hand vinyls or (new ones). I love electronic music and would love to get some italo disco or house or really whatever I can get my hands on. \nThank you beforehand! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n7xjbw/where_to_buy_vinyls_in_torino/"
    },
    {
        "id": "1n837vo",
        "author": "Ailothrg",
        "title": "Looking for a place to print a document",
        "content": "Hello everyone, I'm a tourist and right now I'm in Torino for vacations. The thing is that I'm being requested from my job in my country to print a document, sign it and send it back to the office but I don't know if there are businesses here at Torino where I can print and scan. In my country we call this businesses \"papeleria\" or \"centro de copiado\" if anyone knows a place like that near to Lucento or in the center would be very useful. \n\nThanks and have a nice day.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n837vo/looking_for_a_place_to_print_a_document/"
    },
    {
        "id": "1n7htgc",
        "author": "GenauTurin",
        "title": "Techno in Turin",
        "content": "Hello everybody,\n\nsince from time to time there's people asking about the techno and clubbing scene in Torino, let me introduce ourselves.\n\nWe're GENAU Turin, a promoter active since 12 years organizing events focused on what we can call \"Berlin  techno\" or \"club techno\" (so no hard techno / tekno vibes or tech house...).\n\nWe're about to start on September 13 out 12th season. After few years always in the same club, we decided to switch to new venues, keeping the vibes and art direction that always characterized us since the very beginning.\n\nSo please find here our event calendar for September and October  \n13.09 - MARCAL @ Notorius Club  \n26.09 - TAUCETI @ Gianca Murazzi  \n04.10 - CLERIC @ Notorius Club  \n17.10 - ELISA BEE @ Gianca Murazzi\n\nYou can better know and understand about us following our social profiles on IG and FB  \n[https://www.instagram.com/genauturin/](https://www.instagram.com/genauturin/)  \n[https://www.facebook.com/genauturin](https://www.facebook.com/genauturin)\n\nWe also run a podcast series  \n[https://soundcloud.com/genau-turin](https://soundcloud.com/genau-turin)\n\nand a Youtube channel  \n[https://www.youtube.com/@GENAUTurin](https://www.youtube.com/@GENAUTurin)\n\nplease fell free to ask us any question if you're sharing our same techno passion!\n\nhope to see you all on the dancefloor!\n\nhttps://reddit.com/link/1n7htgc/video/lo3ds19twymf1/player\n\n  \n",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n7htgc/techno_in_turin/"
    },
    {
        "id": "1n7p60r",
        "author": "glorious-ahole",
        "title": "Places to buy jackets, overcoats",
        "content": "Hey guys...this will be my first winter in turin. Since winter is starting soon, I'm looking for places to buy winter clothes(if possible for cheap but good quality).  Does anyone know good shops?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n7p60r/places_to_buy_jackets_overcoats/"
    },
    {
        "id": "1n7a56l",
        "author": "Sergente-Peperoni",
        "title": "Agnolotti del plin: burro e salvia o al sugo d’arrosto?",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aq22ahiiyimf1.jpeg?auto=webp&amp;s=bea8eaea31dad04a95a6f93ea1066f3be9227583"
        },
        "permalink": "/r/torino/comments/1n7a56l/agnolotti_del_plin_burro_e_salvia_o_al_sugo/"
    },
    {
        "id": "1n77e03",
        "author": "FlowEr_95",
        "title": "Supermercati che prendono i buoni su tutta la spesa?",
        "content": "Mi sono trasferita da poco a Torino e non riesco a trovare un supermercato che non applichi restrizioni sul numero di buoni utilizzati o sul tipo di articoli. Sapreste indicarmene uno?\nGrazie! ",
        "upvotes": 11,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1n77e03/supermercati_che_prendono_i_buoni_su_tutta_la/"
    },
    {
        "id": "1n7aft6",
        "author": "Cigarette_After_Jazz",
        "title": "Vedete la situazione compravendita di immobili a Torino migliorata o peggiorata rispetto a qualche anno fa?",
        "content": "Mi riferisco solo all'acquisto e vendita di case, non per uso investimento, no affitti",
        "upvotes": 3,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1n7aft6/vedete_la_situazione_compravendita_di_immobili_a/"
    },
    {
        "id": "1n7coae",
        "author": "Might-Be-Lilith",
        "title": "Consiglio agenzia immobiliare a Torino?",
        "content": "Ciao raga! Mi trasferirò presto a Torino e sto cercando un’agenzia immobiliare seria da contattare. Avete qualche dritta? Grazie mille!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1n7coae/consiglio_agenzia_immobiliare_a_torino/"
    },
    {
        "id": "1n7c5fx",
        "author": "Effective_Pickle_698",
        "title": "Stanza nel campus Relife Torino, corso Novara ex fabbrica Lavaza",
        "content": "Ciao, a fine settembre mi trasferirò a Torino per proseguire i miei studi magistrali al Campus Einaudi. Una delle soluzioni abitative che ho trovato è in Corso Novara 59, presso il campus Relife. La zona è veramente poco sicura come si dice?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n7c5fx/stanza_nel_campus_relife_torino_corso_novara_ex/"
    },
    {
        "id": "1n76t80",
        "author": "TiAnPa",
        "title": "Parcheggio zona largo regio parco",
        "content": "Ciao a tutti, ma ci sono aree dove si riesce a trovare posto la mattina presto (7:15/7:30) zona largo regio parco? Sto cambiando lavoro e la sede sarà lì… il 90% delle volte conto di andare con i mezzi ma in quelle rare occasioni che mi sarà necessaria l’auto dove posso parcheggiare senza andare fino in zona cimitero? \n\nGrazie!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n76t80/parcheggio_zona_largo_regio_parco/"
    },
    {
        "id": "1n6cn5z",
        "author": "BerrisFurller",
        "title": "DOVETE FERMARVI SULLE CAZZO DI STRISCE PEDONALI.",
        "content": "",
        "upvotes": 95,
        "comments": 112,
        "media": null,
        "permalink": "/r/torino/comments/1n6cn5z/dovete_fermarvi_sulle_cazzo_di_strisce_pedonali/"
    },
    {
        "id": "1n77xfh",
        "author": "MonPorridge",
        "title": "Brunch a Torino per compleanno?",
        "content": "Come da titolo, vorrei dei consigli per un brunch di compleanno. Conosco già Tauer ma vorrei qualcosa di diverso, sempre in stile UK/USA e che non costi un occhio della testa. Suggerimenti? Grazie mille!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n77xfh/brunch_a_torino_per_compleanno/"
    },
    {
        "id": "1n76tux",
        "author": "Little-Accountant892",
        "title": "Barriera di Milano",
        "content": "Sup guys, so I'll be renting a shared apartment in via Monte Rosa, which falls under the barriera di Milano area. I'm an International student, and before renting I didn't really do research properly and now everyone's saying that this area is the worst place to live in. I wanted to ask you guys how exaggerated these claims are, and whether this area is someplace where you can't even go out after 7 pm lol. If it really is that bad, what tips can you give me to stay safe here, especially if I come back to home at about 9 pm?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1n76tux/barriera_di_milano/"
    },
    {
        "id": "1n6d9vk",
        "author": "m4db0b",
        "title": "Linux Day Torino 2025",
        "content": "Sabato 25 ottobre 2025 si svolge la prossima edizione del [Linux Day](https://www.linuxday.it/) \\- la maggiore manifestazione italiana di promozione e divulgazione del software libero e open source - e, come sempre, anche a Torino ci sarà un evento, quest'anno presso l'Arsenale della Pace in piazza Borgo Dora.\n\n[https://linuxdaytorino.org/2025/](https://linuxdaytorino.org/2025/)\n\nStiamo attualmente raccogliendo proposte per i talk. Abbiamo quattro aule tematiche, e sono benvenuti interventi su\n\n* programmazione con strumenti open\n* networking, cloud, storage e architetture dati\n* dati liberi (open data, OpenStreetMap, Wikidata...)\n* progetti open source\n* qualsiasi cosa riguardi Linux, il software libero e le libertà digitali :-)\n\n[Qui ulteriori dettagli](https://linuxdaytorino.org/2025/#schedule) per inviare la propria proposta.",
        "upvotes": 19,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gFgHv-XYn2_XVM9mLdPX0kXt3PMR69MrbRIOcOCjXs8.png?auto=webp&amp;s=4f700a00986b82569407120df0fcc851e75ae93e"
        },
        "permalink": "/r/torino/comments/1n6d9vk/linux_day_torino_2025/"
    }
]